{
    "title": "Better Artificial Intelligence (AI) Stock: Nvidia vs. AMD",
    "date": "2/7/2024",
    "url": "https://www.fool.com/investing/2024/02/07/better-artificial-intelligence-ai-stock-nvidia-vs/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The artificial intelligence (AI) market exploded last year and has shown no signs of slowing. The launch of OpenAI's ChatGPT reinvigorated interest in the technology and led countless tech companies to restructure their business with an emphasis on AI. Investors have grown particularly bullish about chipmakers, the companies developing the hardware necessary to train and run AI models. As a result, Nvidia's (NVDA 0.12%) stock is up over 200% year over year, while Advanced Micro Devices (AMD 0.50%) has climbed 100% These companies are some of the best options to back the $197 billion market and could offer significant gains in the coming years as the sector expands. So, let's take a closer look at these chip giants and determine whether Nvidia or AMD is the better AI stock this month. Nvidia became a Wall Street darling last year as its graphics processing units (GPUs) became the go-to for AI developers everywhere. Increased demand for AI services saw its chips fly off the shelves, which led to soaring earnings. The chart below reflects the company's meteoric rise, with its revenue, operating income, and free cash flow skyrocketing over the last 12 months.  Data by YCharts Nvidia's years of dominance in GPUs allowed it to get a head start in AI last year while rivals like AMD and Intel scrambled to catch up. Meanwhile, increased earnings have potentially pushed it further ahead, with greater cash reserves to continue investing in its technology and retain its market supremacy. However, that's not to say other chipmakers won't be able to push through. The AI market is projected to expand at a compound annual growth rate (CAGR) of 37% through 2030, which would see it hit close to $2 trillion by the end of the decade. The industry's significant potential indicates there should be room for Nvidia to keep its leading market share and welcome newcomers. Moreover, Nvidia's continued investment in AI is contributing to promising inroads in China. Demand for the technology is soaring in the region, with Statista expecting the Chinese AI market to grow at a CAGR of 18% until at least 2030. Expanded bans on U.S. high-end chip exports to China led Nvidia to develop the H20, an AI GPU designed to meet export regulations and the growing demand for chips in the East Asian country. According to Reuters, Nvidia will begin shipping the H20 in the first quarter of 2024 and increase production in the second quarter. Nvidia is leading the way in AI chips and remains an attractive way to invest in the budding sector. AMD is easily Nvidia's biggest rival, nipping at its heels for years with the second-largest share of the GPU market. AMD wasn't as well equipped as Nvidia in 2023 to immediately begin supplying its chips to the swarm of AI developers requiring high-computing power. However, the chip designer unveiled a new AI GPU last December that could see it attain a lucrative role in the industry. AMD's MI300X AI GPU is expected to be highly competitive with similar offerings from Nvidia and has already caught the attention of some of AI's biggest players. In November 2023, Microsoft announced Azure would become the first cloud platform to implement AMD's new GPU to optimize its AI capabilities. Microsoft has a close partnership with OpenAI, making the company a powerful ally for AMD. AMD released its fourth-quarter 2023 earnings on Jan. 30. The company's revenue rose 10% year over year to $6 billion, beating analysts' forecasts by $60 million. Solid growth came from its AI-focused data center segment, which posted revenue growth of 38%. The company beat expectations overall but fell short on guidance. AMD expects to reach $5.4 billion in sales in Q1 2024, plus or minus $300 million; Wall Street estimates project $5.7 billion. Demand for central processing units (CPUs) is slowing as GPU demand rises, with AMD experiencing a transitionary period as it shifts its focus alongside market trends. AMD might not be as far in its AI journey as Nvidia, but I wouldn't count it out. It could have more room to run as it begins shipping its AI chips and expands into other aspects of the market, such as AI-powered PCs. Nvidia and AMD are at vastly different stages in their AI expansions, with one well-established on the chip side of the market and the other just getting started. As a result, the decision between these companies' stocks could lie in whether you're more swayed by Nvidia's proven success in AI or are willing to bet on AMD's long-term prospects in the sector.  Data by YCharts Either way you lean, it is wise to take a look at how these companies' valuations compare. This chart shows Nvidia's forward price-to-earnings and price-to-free-cash-flow ratios are significantly lower than the same metrics for AMD. Neither stock would be considered cheap, but Nvidia's lower figures suggest it offers far more value than AMD. With its more established role in AI and a promising expansion in China, Nvidia is the lower-risk and better stock to invest in AI right now. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}