{
    "title": "Magnificent Seven tech stocks will go their own ways, analyst says",
    "date": "3/12/2024",
    "url": "https://qz.com/magnificent-seven-tech-stocks-analyst-1851329222",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Chris Verrone, a partner at Strategas Research Partners, spoke with Quartz for the latest installment of our “Smart Investing” video series. Watch the interview above and check out the transcript below. The transcript of this conversation has been lightly edited for length and clarity. Andy Mills (AM): Tech stocks, the magnificent seven, they’re starting to diverge a little bit. Nvidia had kind of a big reversal on Friday. And is it topping out right now? What do you think is going on? Chris Verrone (CV): Yeah. Very meaningful reversal in Nvidia on Friday on huge volume, record volume for that stock. And one of our big themes to start the year was that the “Magnificent Seven” would not be the “Monolithic Seven” this year. And that’s a big change from 2023 where basically the whole set of stocks, Nvidia, Apple, Amazon, Meta, all kind of move together, and that’s not happening here. They have really fractured, while Nvidia has powered along most of the year, Friday not withstanding, we’ve seen Apple weaken, we’ve seen Google weaken. So I think this idea that it’s the only source of outperformance in the equity market is probably a little misleading at this point. I would encourage investors to look at the equally weighted S&P. So that’s a broad composite. Every stock is equally weighted. That just made new two and a half year price highs last week for the first time in years. So this is more than just the top of the market driving this. There is a broadening that we’ve seen over the last several months and we welcome that. AM: Okay. So what stocks in S&P are you looking at? What do you like? CV: Yeah. There’s a couple notable things going on. I’d say number one, the industrials are leadership here and we’ve been for, for 18 months talking about stocks like Parker, Hannafin, Cummins, Emerson Electric, Caterpillar. I still think their leadership credentials are very much intact. I think the recent development in our work, let’s say the last four or five months, is the improvement in healthcare. Healthcare interests us here from the perspective that it’s a logical place for tech money to go ‘cause it still kind of fits the growth investing corner of the market. And what’s notable is over the last couple months, if you’ve seen this huge surge of flows into tech, you really haven’t seen that in healthcare. So if money is ripe to come outta tech, I think healthcare is a logical destination for it. You’ve seen the pharma’s turn, you’ve seen the biotechs turn. I think the turn of the biotechs in particular, given how rate sensitive that group tends to be, the fact that they’re outperforming and breaking out and going up is another message to us that bon yields probably don’t go up too much more from here. Read more: Let’s talk about Nvidia stock — and whether it’s in a bubble AM: What biotech stock should I buy right now? CV: Just in the broader pharma and biotech space? Merck is a very good chart. There’s a nice turn in Abbott, ABT, we’ve been high on Regeneron, REGN. I would encourage investors also to look at the life science tools names Thermo Fisher, Danaher. They’ve been in bear markets for three years. They’re finally getting better. So, all of this speaks to there’s more than just the “magnificent seven”, more than just Nvidia driving this market. Healthcare is improving, financials are okay. Industrials have generally been leadership as well. AM: If AI earnings start to lose steam, does the whole market go with it right now? Are we on a precipice? CV: So it’s funny, this term bubble, it’s always used in a negative connotation. We should seek out bubbles. Most of the money in this business is made investing within the context of a bubble. We should be so lucky as if we are involved in one, whether this is a bubble or not. Only Lord knows what. What we do know is, I don’t think this move in AI has ever really been about the earnings, it’s been about the earnings potential and what could disrupt earnings potential is the cost of interest is the cost of debt. So it’s another I think really important piece of information that bond yields are important here. And we’re generally pretty bullish. We’re generally pretty risk on. What would disrupt that view for tech in particular. Probably bond yields above four-fifty would be a bit of a challenge to the ‘Can these earn like many expect that they will?’ Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}