{
    "title": "Nvidia's Market Cap Myopia: 3 Stocks Proving Size Isn't Everything",
    "date": "3/26/2024",
    "url": "https://markets.businessinsider.com/news/stocks/nvidias-market-cap-myopia-3-stocks-proving-size-isnt-everything-1033198892",
    "text": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips Nvidia (NASDAQ:NVDA) is massive. It is the third-largest company by market capitalization. In a little more than one year, the artificial intelligence (AI) chipmaker grew from a puny $364 million valuation to become worth almost $2.4 trillion! Barring penny stocks, that could be one of the fastest meltups in stock market history. As consider, Nvidia’s market cap, investors need to consider other AI stocks. But size isn’t everything. Not that you would know it by watching NVDA stock, but companies that large find it infinitely more difficult to keep growing at such rates. I liken them to cruise ships on the ocean: they take large sweeping curves to make a turn while smaller vessels can nimbly zig-zag back and forth. The combined value of the following three alternatives to Nvidia stock is far less than the chipmaker but they represent better investments. Here’s why. On its face, gig economy platform Upwork (NASDAQ:UPWK) wouldn’t seem to be a better stock than Nvidia. Shares are down 80% from the all-time high they hit in July 2021 though they stand 88% above the absolute bottom hit almost a year ago. But the platform that connects employers with freelancers looking for work has dramatic upside potential.  Revenue grew 14% in the fourth quarter as the number of active clients rose 5% to end the year at 851,000. Looking at similarly situated Fiverr (NASDAQ:FVRR), it saw a 5% decrease in the number of active buyers on its platform. The rival gig economy platform flourished during the pandemic but has struggled since. Upwork CFO Erica Gessert said in a statement, “We have made great strides in the early innings of our AI journey, and we’re confident that we will continue to produce growing profit margins and free cash flow each year going forward.” Upwork is something of a hidden AI stock. Last year it partnered with ChatGPT-maker OpenAI to create a partnership for AI-related jobs. Upwork is transforming its platform into a portal for individuals with AI-related skills to find employment with companies looking for such talent. Upwork also acquired AI start-up Headroom in the fourth quarter. Wall Street forecasts Upwork will grow revenue at 15% a year for the next five years while profits will more than double on a compounded growth rate basis. That should take UPWK stock well above its current $12 per share price. Movie theaters also might not sound particularly promising in a matchup against Nvidia but big screen leader IMAX (NASDAQ:IMAX) is the exception that proves the rule. Industry attendance is down from even pre-pandemic levels and the summer box office is weak. Other than Barbie and Oppenheimer, there weren’t many movies theater operators could cheer. IMAX found a way, though.  The theater chain delivered 25% year-over-year growth in revenue, net and adjusted earnings and adjusted EPS. It reversed a year ago loss of 40 cents per share into a 46 cents per share profit in 2023. IMAX also generated 40% more system installations for the year. That’s likely why analysts are extremely optimistic about IMAX stock. They see the movie theater operator expanding earnings over the long run at a compound annual growth rate (CAGR) over 40%. At just 13 times next year’s earnings and 16 times free cash flow, IMAX can outperform the chipmaker in the years to come. STAAR Surgical (NASDAQ:STAA) makes and markets implantable collamer lenses (ICL). Through a small incision in the eye, an ophthalmological surgeon implants a lens that negates the need for eyeglasses and contact lenses. Compared to the more popular Lasik surgery, ICL is a permanent fix. Lasik often requires new surgery every five to 10 years. Beyond being a one-and-done solution, ICLs can be changed if your vision changes. The lenses also offer ultraviolet ray protection, produce better night vision and can correct more severe prescriptions. It is often the preferred choice for short-sightedness with or without astigmatism. STAAR reported a 19% increase in fourth-quarter sales and a 13% rise in full-year revenue. ICL sales were up 18% in 2023 with 19% more units sold. Wall Street forecasts sales and profits to accelerate from here.  Long-term revenue growth is seen growing 18% annually while earnings will expand 42% a year for the next five years. With STAA stock down 42% over the last 12 months, investors should clearly see multiple expansion. On the date of publication, Rich Duprey did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Rich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets. The post Nvidia’s Market Cap Myopia: 3 Stocks Proving Size Isn’t Everything appeared first on InvestorPlace. Indices Commodities Currencies Stocks "
}