{
    "title": "Will AMD Be a $1 Trillion Company by 2030?",
    "date": "3/3/2024",
    "url": "https://finance.yahoo.com/news/amd-1-trillion-company-2030-144000259.html",
    "text": "One of the most important pillars in artificial intelligence (AI) is semiconductors. These chips, commonly referred to as graphics processing units (GPUs) and central processing units (CPUs), play critical roles across generative AI applications. Nvidia, which is estimated to own up to 95% of the addressable market, dominates the AI GPU industry. As of now, its market cap is roughly $1.98 trillion. To put this extreme growth into perspective, the company reached the trillion-dollar mark over the summer. But in the roughly nine months that followed, the company has added almost another $1 trillion in value. As demand continues to surge for all things AI, investors may be curious what other chip manufacturers could follow Nvidia's path to a $1 trillion enterprise. The No. 2 player in AI chips is Advanced Micro Devices (NASDAQ: AMD), which develops a host of rival computing processors to that of Nvidia. With a market cap of $311 billion, AMD will need to triple in value to reach entry to the trillion-dollar club. Let's break down AMD's business and analyze some industry trends to help forecast whether AMD can reasonably increase threefold by 2030. For the full year 2023, AMD reported total revenue of $22.7 billion. While this was a decrease of 4% year over year, much of the decline can be attributed to the waning demand in the personal computing (PC) market. AMD's artificial intelligence (AI) data center business was actually up 7% year over year. Although 7% growth may appear a bit muted, consider that AMD's management predicts the addressable market for data center AI chips will reach $400 billion by 2027. This implies that AMD could have massive upside as manufacturing for its MI300X chips begins to scale. Despite the potential market size, AMD has a lot of catching up to do to help close the gap with Nvidia. The graphs below illustrate the consensus revenue forecasts for Nvidia versus AMD for the next couple of years. While AMD is projected to grow at slightly faster rates, the overall volume of business compared to Nvidia is much smaller. Candidly, these estimates could end up being quite conservative. Nvidia's A100 and H100 chips are the hottest items in the world of GPUs. However, the company is not resting on its laurels. Nvidia plans to launch next-generation products later this year, including its highly anticipated B100 chip. AMD's path to a $1 trillion valuation is going to be tough. Should the company grow its sales in the mid-20% range through 2030, AMD could reasonably achieve $90 billion in revenue by 2030. By using the company's long-term price-to-sales (P/S) ratio of 4.8, I arrive at a valuation of $432 billion. While the above analysis is merely a fun exercise with numbers, it helps shed light on a couple of key items. My suspicion is that it is going to become increasingly challenging for AMD to keep up with Nvidia's pace of innovation. As such, I would not be surprised to see the company's valuation multiples start to compress. Eventually, growth investors may sour on AMD's prospects relative to its rival, which could lead to precipitous selling activity. On the other hand, some investors may prefer to play a much longer game and see AMD as a worthy investment prospect over the coming decades. My caution to that viewpoint is that demand for AI products will start to plateau at some point, and the already cyclical nature of the semiconductor business will likely be hit pretty hard. Another very important thing to consider is the development of AI chips outside of Nvidia and AMD. Namely, competition from the likes of Microsoft and Amazon could put a sizable dent in AMD's and Nvidia's growth over the long term. I see AMD as a decent hedge to other chip stocks you may own. However, I struggle to see how the company will close the gap with Nvidia in the long run. While the company could very well remain a respectable player in AI GPUs, I do not see it becoming a trillion-dollar company. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Advanced Micro Devices made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks *Stock Advisor returns as of February 26, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Adam Spatacco has positions in Amazon, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Will AMD Be a $1 Trillion Company by 2030? was originally published by The Motley Fool Related Quotes "
}