{
    "title": "Nvidia: We Are Watching History",
    "date": "3/10/2024",
    "url": "https://www.etftrends.com/model-portfolio-channel/nvidia-watching-history/",
    "text": "By Christopher Gannatti, CFA, Global Head of Research Nvidia’s earnings report brought much intrigue. Consider this headline from the Financial Times: “Nvidia Is Nuts, When’s the Crash?”1 The results over the past year have been amazing, yes, but there are no precedents for a company growing from a market capitalization below a $1 trillion to $2 trillion in less than a year.1 Does the hype match reality? The CURRENT share price is not necessarily a reflection the past, but rather a view on the FUTURE. One analyst believes Nvidia’s current valuation would be well supported IF the company can grow their current revenues tenfold and do so with an operating margin around 55% over the coming 10 years. We cannot know today if that will happen, but note the entire semiconductor market—meaning all sales of all semiconductors, not just AI accelerators—has been $500–$600 billion in recent years.3 Continued execution on an exponential growth thesis, while not impossible, is a very high hurdle to clear. Nvidia has been a public company for a long time—it went public in 1999 at $12 per share.1 Before the extreme feelings of FOMO (fear of missing out) kick in, remember the role of graphics processing units (GPUs) in artificial intelligence applications did not hit the mainstream until the so-called “AlexNet” moment in 2012.5 This means that we can look at Nvidia’s revenues, year by year, for quite a long time in figure 1.  Now, revenues are not profits. However, the growth story of Nvidia’s net income is even more impressive than the revenue growth component, as we see in figure 2:  The Nvidia A100, H100 and soon B100 AI accelerator chips are really systems and not chips that individuals would buy. The value lies more in building a network of these systems—usually thousands or tens of thousands of them—versus just buying a couple. Meta Platforms CEO Mark Zuckerberg indicated Meta would, by the end of 2024, have 350,000 Nvidia H100s—which could represent $9 billion.5 That does not feel like type of regular purchase, but we shall see. The Magnificent 7, excluding Nvidia (the so-called Mag 6) represent a large chunk of the customers that are currently spending the money to support Nvidia’s ongoing, blockbuster results. Microsoft, Amazon.com and Alphabet are running the world’s three largest public cloud infrastructure platforms. If the customers want to train and run models on Nvidia chips, these firms need to buy Nvidia chips. If one provider slows down, it creates an opportunity at the others. The Mag 6 have been increasing their capital expenditures. If we compare the level of reported capital expenditures at these firms and the overall level of revenues that Nvidia has reported, blunt analysis indicates almost 40% of the total capex could be represented by Nvidia’s revenues. We do not know what each of these companies is spending at Nvidia, although anecdotal evidence abounds that companies need to keep ordering from Nvidia for risk of being shut out of future production runs if they slow down.  Nvidia’s results are so remarkable that it is difficult for any company to compare. When considering thematic investments, similar to venture capital, there can be a power law at work, in which, instead of all companies delivering a result close to average, we should likely see a small number of firms delivering astronomical results and other companies with terrible results. Fortunately, the astronomical results can cancel out the terrible results over time. For strategies focused on AI, Nvidia is clearly an essential company but the success will not move forward based on a single company. The semiconductor value chain is complex, and we advocate thinking about the relationships exemplified within it—for instance, the fact that Taiwan Semiconductor Manufacturing Co. (TSMC) is fabricating Nvidia’s advanced chips. Nvidia is not, currently, making the physical chips. When considering different AI strategies, we note that it is more important to look under the hood and simply understand—what is the Nvidia exposure? What is the Magnificent 7 exposure? There are not correct and incorrect answers, but it’s important to make sure the degree of exposure to these different kinds of things is monitored over time and fits the view the investor is looking to implement. 1 Dan McCrum, “Nvidia Is Nuts, When’s the Crash?” Financial Times, 2/16/24.\n2 Nvidia’s market cap on 2/18/23 was roughly $532 billion, while on 2/2/24 it was around $1.9 trillion. Source: https://companiesmarketcap.com/nvidia/marketcap/\n3 Source: “Investor FAQs,” Nvidia.com. https://investor.nvidia.com/investor-resources/faqs/default.aspx#:~:text=back%20to%20top-,When%20was%20NVIDIA’s%20initial%20public%20offering%20and%20what%20was%20the,%2C%201999%20at%20%2412%2Fshare.\n4 Source: “AlexNet and ImageNet: The Birth of Deep Learning,” Pinecone.io. https://www.pinecone.io/learn/series/image-search/imagenet/\n5 Source: Asa Fitch, “Nvidia Hits $2 Trillion on Insatiable AI Chip Demand,” Wall Street Journal, 2/23/23. U.S. investors only: Click here to obtain a WisdomTree ETF prospectus which contains investment objectives, risks, charges, expenses, and other information; read and consider carefully before investing. There are risks involved with investing, including possible loss of principal. Foreign investing involves currency, political and economic risk. Funds focusing on a single country, sector and/or funds that emphasize investments in smaller companies may experience greater price volatility. Investments in emerging markets, currency, fixed income and alternative investments include additional risks. Please see prospectus for discussion of risks. Past performance is not indicative of future results. This material contains the opinions of the author, which are subject to change, and should not to be considered or interpreted as a recommendation to participate in any particular trading strategy, or deemed to be an offer or sale of any investment product and it should not be relied on as such. There is no guarantee that any strategies discussed will work under all market conditions. This material represents an assessment of the market environment at a specific time and is not intended to be a forecast of future events or a guarantee of future results. This material should not be relied upon as research or investment advice regarding any security in particular. The user of this information assumes the entire risk of any use made of the information provided herein. Neither WisdomTree nor its affiliates, nor Foreside Fund Services, LLC, or its affiliates provide tax or legal advice. Investors seeking tax or legal advice should consult their tax or legal advisor. Unless expressly stated otherwise the opinions, interpretations or findings expressed herein do not necessarily represent the views of WisdomTree or any of its affiliates. The MSCI information may only be used for your internal use, may not be reproduced or re-disseminated in any form and may not be used as a basis for or component of any financial instruments or products or indexes. None of the MSCI information is intended to constitute investment advice or a recommendation to make (or refrain from making) any kind of investment decision and may not be relied on as such. Historical data and analysis should not be taken as an indication or guarantee of any future performance analysis, forecast or prediction. The MSCI information is provided on an “as is” basis and the user of this information assumes the entire risk of any use made of this information. MSCI, each of its affiliates and each entity involved in compiling, computing or creating any MSCI information (collectively, the “MSCI Parties”) expressly disclaims all warranties. With respect to this information, in no event shall any MSCI Party have any liability for any direct, indirect, special, incidental, punitive, consequential (including loss profits) or any other damages (www.msci.com) Jonathan Steinberg, Jeremy Schwartz, Rick Harper, Christopher Gannatti, Bradley Krom, Kevin Flanagan, Brendan Loftus, Joseph Tenaglia, Jeff Weniger, Matt Wagner, Alejandro Saltiel, Ryan Krystopowicz, Brian Manby, and Scott Welch are registered representatives of Foreside Fund Services, LLC. WisdomTree Funds are distributed by Foreside Fund Services, LLC, in the U.S. only. You cannot invest directly in an index. Originally published 4 March 2024. For more news, information, and analysis, visit the Modern Alpha Channel. "
}