{
    "title": "Lenovo Vehicle Computing and WeRide Forge a Strategic Partnership, using \nNVIDIA DRIVE Thor Platform to ...",
    "date": "3/18/2024",
    "url": "https://finance.yahoo.com/news/lenovo-vehicle-computing-weride-forge-045100148.html",
    "text": "SAN JOSE, Calif., March 19, 2024 /PRNewswire/ -- Lenovo Vehicle Computing and WeRide recently formed a strategic partnership to create Level 4 autonomous driving solutions for commercial applications. The cutting-edge intelligent-driving solution developed by Lenovo Vehicle Computing and WeRide is based on Lenovo's recently unveiled autonomous driving domain controller, AD1, built on the NVIDIA DRIVE Thor platform featuring the new Blackwell architecture designed for transformer and generative AI workloads. The system is trained on NVIDIA's state-of-the-art data center AI solutions. The AD1 will be integrated on the WeRide One, a highly compatible autonomous driving solution platform, for use in a wide range of urban-centered target use cases. WeRide One consists of a full stack of industry-leading application software, a flexible set of hardware and a comprehensive infrastructure software platform. The solution features technical characteristics such as vehicle specification requirements, functional safety, redundant safety design, fusion, and scalability. Tony Han, founder and CEO of WeRide, stated, \"WeRide is the only technology enterprise to simultaneously hold self-driving licenses in China, the United States, the United Arab Emirates, and Singapore. We possess technical capabilities and commercial deployment experience of autonomous driving that scale from Level 2 to Level 4. This collaboration with Lenovo Vehicle Computing, along with NVIDIA's accelerated compute and AI expertise, will enable us to deliver enhanced autonomous driving products, solutions, and services to customers worldwide.\" Donny Tang, Vice President and Head of Vehicle Computing, Lenovo stated, \"The computing and automotive industries have been researching and developing technologies that imitate human thinking and decision-making to assist or potentially replace human drivers. This effort has aimed to increase productivity and enhance mobility. As a leader in large-scale general computing, Lenovo Vehicle Computing is pleased to collaborate with WeRide and NVIDIA. Guided by Lenovo's AI for All strategy, the companies will explore additional ways to bring intelligent capabilities to the automotive domain and widespread adoption of self-driving technology.\" Rishi Dhall, Vice President of Automotive at NVIDIA, said, \"The performance and architecture of the NVIDIA DRIVE Thor intelligent-driving platform, leveraging our new Blackwell architecture for generative AI, will enable Lenovo Vehicle Computing and WeRide to build and deploy safe and reliable autonomous vehicles.\" View original content to download multimedia:https://www.prnewswire.com/news-releases/lenovo-vehicle-computing-and-weride-forge-a-strategic-partnership-using-nvidia-drive-thor-platform-to-accelerate-autonomous-driving-302092408.html SOURCE Lenovo Vehicle Computing "
}