{
    "title": "Why the Super Surge May Continue for Super Micro Computer Stock",
    "date": "3/13/2024",
    "url": "https://www.tradingview.com/news/investorplace:09a5cfc00094b:0-why-the-super-surge-may-continue-for-super-micro-computer-stock/",
    "text": "Even among AI stocks, Super Micro Computer SMCI stock has knocked it out of the park, up 280% year to date. Such a surge makes Nvidia’s NVDA year-to-date gains of 73.2% seem modest. Over the past twelve months, SMCI is up nearly 1,110%. Yet while this outsized performance relative to other AI hardware or “picks and shovels” plays means an even greater concern of “bubble trouble” ahead, don’t assume that Super Micro’s surge is about to be followed up by a sell-off. Here’s why. SMCI Stock: Justification for its ‘to the Moon’ Moves Comparing Super Micro Computer to Nvidia and AMD is misleading. Super Micro Computer is not another AI chip designer/manufacturer. Rather, the company builds servers and other AI computer system products that use Nvidia and AMD’s processors. However, even though not in the same industry, Super Micro Computer benefits from the same trend. Strong demand for the company’s products has resulted in a major re-acceleration in growth. For instance, last quarter, the company reported revenue of $3.66 billion, or up 100% compared to the prior year’s quarter. Non-GAAP earnings per share came in at $5.59. This represented around a 71.% year-over-year increase. These strong results played a big role in sparking the SMCI stock rally, but it’s been future forecasts that have really kicked it into overdrive. Based on sell-side forecasts, the analyst community expects more-than 100% revenue growth for the full fiscal year (ending June 2024), with EPS rising by around 90.6%, from $11.43 to $21.78 per share. Analyst forecasts for next fiscal year vary, but the high end of these estimates call for further high revenue (73.2%) and EPS (73.7%) growth. The Show Could Go On (Just Not Indefinitely) Admittedly, even as Super Micro Computer could continue to post impressive levels of growth, one can look at the aforementioned big gains so far for SMCI stock, and argue that this upside is already priced into shares. But while the market may treat possibilities as near-certainties, not only may this be sustainable in the near-term. There may even be room for future potential to be baked into SMCI’s share price. If Super Micro once again reports ‘beat and raise’ results (like it did for last quarter) when it next releases fiscal results in April, this may fuel another spike for the stock. The “AI boom” has yet to turn into an “AI bust.” With this, the market is likely to stay in a “buy on the rumor, buy more on the news” type of mood. That said, while there may be an opportunity to stay bullish on SMCI for now, be careful. It’s too early to bet on a crash. It’s not too late to hop in to ride the next wave. However, Super Micro could take a tumble down the road, when (not if) a slowdown, downturn, or full-on bust hits the AI space. Stay Long for Now, But Pay Attention While many factors stand to keep SMCI trending higher, make no mistake. There are two risks that, if they emerge, could mean big trouble for the stock. First, if the tech sector’s build-out of its AI infrastructure shows signs of slowing down, demand for Super Micro’s products will undoubtedly slow down as well. The market loathes a growth slowdown; such an event would likely cause a sharp price decline for shares. Second, even if the ‘AI revolution’ is still in the early stages, something else could have a negative impact on Super Micro’s growth, and on the price performance of shares: rising competition. Other tech hardware forms could challenge the company’s dominance in the AI computer systems space, affecting both revenue and margins. Hence, while you should keep an eye out for these two red flags, feel free going long or staying long SMCI stock for now. On the date of publication, Thomas Niel did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Thomas Niel, contributor for InvestorPlace.com, has been writing single-stock analysis for web-based publications since 2016. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}