{
    "title": "NVIDIA (NASDAQ:NVDA) Price Target Raised to $1100.00 at Oppenheimer",
    "date": "3/21/2024",
    "url": "https://www.defenseworld.net/2024/03/21/nvidia-nasdaqnvda-price-target-raised-to-1100-00-at-oppenheimer.html",
    "text": "Posted by Defense World Staff on Mar 21st, 2024 NVIDIA (NASDAQ:NVDA – Free Report) had its price target raised by Oppenheimer from $850.00 to $1,100.00 in a report issued on Wednesday morning, Benzinga reports. The firm currently has an outperform rating on the computer hardware maker’s stock. Several other brokerages have also recently commented on NVDA. CICC Research initiated coverage on NVIDIA in a research report on Wednesday, March 6th. They set an outperform rating and a $870.00 price target for the company. Raymond James increased their price target on NVIDIA from $600.00 to $700.00 and gave the company a strong-buy rating in a research report on Friday, January 19th. Sanford C. Bernstein increased their price target on NVIDIA from $700.00 to $1,000.00 and gave the company an outperform rating in a research report on Thursday, February 22nd. Cantor Fitzgerald  reaffirmed an overweight rating and issued a $900.00 price objective on shares of NVIDIA in a research report on Monday, March 4th. Finally, Piper Sandler Companies raised their price objective on NVIDIA to $850.00 and gave the company an overweight rating in a research report on Friday, February 16th. Four investment analysts have rated the stock with a hold rating, thirty-seven have given a buy rating and one  has given a strong buy rating to the stock. According to data from MarketBeat, the stock presently has an average rating of Moderate Buy and an average price target of $881.02. View Our Latest Stock Analysis on NVDA Shares of NVIDIA stock opened at $903.72 on Wednesday. The company has a debt-to-equity ratio of 0.20, a current ratio of 4.17 and a quick ratio of 3.67. The company has a market capitalization of $2.26 trillion, a P/E ratio of 75.69, a price-to-earnings-growth ratio of 1.35 and a beta of 1.73. NVIDIA has a 1 year low of $253.81 and a 1 year high of $974.00. The business has a 50-day moving average of $721.23 and a two-hundred day moving average of $553.34. NVIDIA (NASDAQ:NVDA – Get Free Report) last posted its quarterly earnings data on Wednesday, February 21st. The computer hardware maker reported $5.16 earnings per share (EPS) for the quarter, topping analysts’ consensus estimates of $4.21 by $0.95. The business had revenue of $22.10 billion during the quarter, compared to the consensus estimate of $20.40 billion. NVIDIA had a return on equity of 93.61% and a net margin of 48.85%. NVIDIA’s quarterly revenue was up 265.3% on a year-over-year basis. During the same period last year, the company earned $0.65 earnings per share.  As a group, equities analysts predict that  NVIDIA will post 22.07 EPS for the current year. The business also recently announced a quarterly dividend, which will be paid on Wednesday, March 27th. Shareholders of record on Wednesday, March 6th will be issued a dividend of $0.04 per share. This represents a $0.16 annualized dividend and a yield of 0.02%. The ex-dividend date of this dividend is Tuesday, March 5th. NVIDIA’s payout ratio is presently 1.34%. In other NVIDIA news, insider Donald F. Robertson, Jr. sold 450 shares of NVIDIA stock in a transaction dated Friday, January 5th. The stock was sold at an average price of $484.62, for a total transaction of $218,079.00. Following the transaction, the insider now directly owns 50,961 shares of the company’s stock, valued at approximately $24,696,719.82. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through this link. In other news, EVP Debora Shoquist sold 5,676 shares of the business’s stock in a transaction dated Monday, January 8th. The stock was sold at an average price of $500.00, for a total value of $2,838,000.00. Following the transaction, the executive vice president now directly owns 48,360 shares of the company’s stock, valued at approximately $24,180,000. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, insider Donald F. Robertson, Jr. sold 450 shares of the business’s stock in a transaction dated Friday, January 5th. The shares were sold at an average price of $484.62, for a total value of $218,079.00. Following the completion of the transaction, the insider now directly owns 50,961 shares in the company, valued at $24,696,719.82. The disclosure for this sale can be found here. In the last three months, insiders have sold 104,774 shares of company stock valued at $64,322,528. 3.99% of the stock is currently owned by company insiders. A number of hedge funds and other institutional investors have recently made changes to their positions in NVDA. Studio Investment Management LLC bought a new stake in  NVIDIA in the 4th quarter valued at about $27,000.  LFA Lugano Financial Advisors SA purchased a new position in shares of  NVIDIA in the 4th quarter worth approximately $28,000.  Criterion Capital Advisors LLC purchased a new position in shares of  NVIDIA in the 4th quarter worth approximately $28,000.  Able Wealth Management LLC purchased a new position in shares of  NVIDIA in the 4th quarter worth approximately $32,000.  Finally, Peoples Financial Services CORP. purchased a new position in shares of  NVIDIA in the 3rd quarter worth approximately $30,000. 64.79% of the stock is owned by institutional investors and hedge funds. (Get Free Report) NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications.    Receive News & Ratings for NVIDIA Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for NVIDIA and related companies with MarketBeat.com's FREE daily email newsletter. Dfpg Investments LLC Purchases 441 Shares of Atlanta Braves Holdings, Inc. (NASDAQ:BATRK) Nordea Investment Management AB Has $24.50 Million Holdings in Realty Income Co. (NYSE:O) "
}