{
    "title": "Lockheed, NVIDIA Make AI-Powered Digital Twin to Predict the Weather",
    "date": "1/31/2024",
    "url": "https://finance.yahoo.com/news/lockheed-nvidia-ai-powered-digital-152539916.html",
    "text": "Lockheed Martin is collaborating with Nvidia to build a prototype that uses AI to combine data and detect anomalies in current environmental conditions. The tool could be increasingly important as the National Oceanic and Atmospheric Administration (NOAA) last year reported record ocean surface temperatures The company’s have been working together since 2022 to build a prototype of an AI-driven Earth and Space Observing Digital Twin that can process live streams of weather data, apply AI to analyze the data and display current global environmental conditions from satellite and ground-based observations and output from weather forecasting models. The project recently reached a significant milestone, demonstrating sea surface temperatures, one of NOAA’s critical data pipelines, to highlight multi-sensor fusion from satellite and model data along with short term temperature anomalies. Most Read from IEN: Podcast: Toyota Company Won't Reopen Factories; Space Station Blows Up; Ford Cuts Lightning Production Kubota Hit With Record ‘Made in USA’ Penalty First Human Receives Neuralink Implant BMW to Add Humanoid Bots to Auto Production The Earth and Space Observing Digital Twin hopes to provide NOAA with a centralized approach to fuse and visualize data from various space and earth sensors. The demo showed NOAA and other government customers the potential of using AI to display high-resolution, accurate, and timely depictions of satellites and sensor data. The NOAA is sent terabytes of weather data from multiple space and Earth-based sensors daily, accurately fusing the information could support real-time representations of global conditions. According to Lynn Montgomery, AI research engineer at Lockheed Martin, the platform could be a “one-stop-shop for global weather monitoring” and enable more accurate initial conditions for predictive forecasting. The project uses Lockheed Martin’s OpenRosetta3D software and the NVIDIA Omniverse development platform to build applications that aggregate data in real time. The digital twin uses these technologies to advance 4D visualizations and display this information in a digestible format. Next, Lockheed will feed additional data streams, like space weather and sea ice concentrations, into the Earth and Space Observing Digital Twin next year. This project was funded by NOAA SAE Joint Venture Partnerships for the exploration of possibilities for a future state and not a mission itself. Related Quotes "
}