{
    "title": "1 Simple Reason Why Nvidia Stock Could Keep Crushing the Market",
    "date": "1/28/2024",
    "url": "https://www.fool.com/investing/2024/01/28/reason-why-nvidia-stock-could-keep-crushing-market/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More It is no secret that artificial intelligence (AI) has supercharged Nvidia (NVDA 0.12%) in recent quarters, triggering eye-popping growth in the company's revenue and earnings as tech giants race to get their hands on its graphics processing units (GPUs) for training and powering AI models. This explains why buyers face wait times of 36 weeks to 52 weeks to get delivery of Nvidia's AI-focused A100 and H100 processors. But it is worth noting that the semiconductor specialist is looking to aggressively increase production of its AI GPUs, which is why customers such as Meta Platforms (META -1.68%) are expecting to get their hands on much larger numbers of those chips this year. According to Meta Platforms CEO Mark Zuckerberg, the social media giant expects its arsenal of Nvidia's flagship H100 graphics cards to hit 350,000 units by the end of 2024. Market research firm Omdia estimates that Meta received 150,000 H100s in 2023. If that estimate is accurate, Zuckerberg's remarks indicate that Meta expects to receive an additional 200,000 units of this processor in 2024. That would be a 33% increase over last year. This indicates Nvidia's capacity expansion efforts are likely to drive stronger growth for the company this year, which may be enough to help it outperform Wall Street's expectations. Omdia estimates that Nvidia sold an estimated 500,000 of its flagship H100 AI graphics cards in 2023's third quarter. That was an impressive 67% improvement over the estimated shipments of 300,000 H100 GPUs in the second quarter. The market research firm forecast that shipments of Nvidia's H100 processors would exceed 500,000 units in the final quarter of 2023. That won't be surprising, as its foundry partner, Taiwan Semiconductor Manufacturing (TSM -0.47%) (popularly known as TSMC), has been boosting its advanced chip packaging capacity so that it can produce greater quantities of Nvidia's AI chips. TSMC reportedly increased its advanced chip packaging capacity by an estimated 25% to 66% in 2023 to a range of 15,000 to 20,000 wafers per month. It was earlier manufacturing 12,000 wafers a month. With Nvidia reportedly making use of 60% of the Taiwan-based foundry giant's capacity, it won't be surprising to see Nvidia shipping more than 500,000 units of the H100 in Q4 2023. Assuming the company ships 600,000 H100 processors in Q4 (a 20% increase over the Q3 number), its total shipments of this chip in the final three quarters of 2023 would land at 1.4 million units. Given that Nvidia started shipping the H100 in the first quarter of 2023, we can assume that it may have ended the year with shipments of 1.5 million units. That's nearly triple what some were expecting the company to ship last year. This explains why Nvidia has been comprehensively beating Wall Street's earnings estimates over the past couple of quarters. In the second quarter of its fiscal 2024, Nvidia delivered $2.70 per share in adjusted earnings, topping analysts' consensus estimate of $2.09 per share. This was followed by $4.02 per share in adjusted earnings in its fiscal third quarter (which ended Oct. 29), significantly exceeding the analysts' $3.37 per share estimate. These impressive earnings beats help explain why Nvidia stock has surged by 233% in the past year. And it could continue to deliver stronger bottom-line growth given the capacity expansions of its foundry partner. TSMC is expected to boost its advanced chip packaging capacity to 30,000 wafers a month in the second quarter. According to other estimates, the foundry giant could end the year with a capacity of 35,000 wafers a month. So TSMC is likely to more than double its capacity for manufacturing AI chips in 2024. That's why we can assume that Nvidia could witness a significant increase in its revenue and earnings in its new fiscal year, which begins next month. Analysts expect Nvidia's revenue to increase by 57% in fiscal 2025 to $93 billion. Its earnings are expected to jump 67% to $20.56 per share. For comparison, they predict that Nvidia will close out fiscal 2024 with revenue of $59 billion, a 118% increase over the prior year. Its bottom line is forecast to increase by a whopping 268% to $12.30 per share. If TSMC indeed doubles its output and Nvidia continues to absorb 60% of the foundry giant's advanced packaging capacity, it won't be surprising to see the graphics specialist repeat its fiscal 2024 performance and blow away Wall Street's expectations. That's why investors would do well to buy Nvidia right away, considering that it is trading at just 29 times forward earnings, a nice discount to its five-year forward earnings multiple of 42. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Meta Platforms, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}