{
    "title": "Could Advanced Micro Devices (AMD) become the prominent AI player of 2024?",
    "date": "1/19/2024",
    "url": "https://www.cmcmarkets.com/en-sg/analysis/could-advanced-micro-devices-amd-become-the-prominent-ai-player-of-2024",
    "text": " Trade on the go Download our apps CFD's app X Select the account you'd like to open CFD account Trade CFDs on over 10,000+ shares, FX pairs, commodities, indices and treasuries  Written by CMC Markets CMC Markets 19 Jan 2024, 07:00 Share this Nvidia (NVDA:US) garnered significant attention on Wall Street in the previous year, benefiting from a surge in artificial intelligence (AI) that propelled its business. With a remarkable 224% year-over-year increase in its stock value and robust earnings, the company has been the primary provider of graphics processing units (GPUs) in response to the heightened demand in the AI sector. While Nvidia still has considerable growth potential, its exceptional performance in the past year has led to a relatively higher valuation. Consequently, many investors are actively seeking the \"next Nvidia\" – a company with the capability to satisfy the growing demand for chips and generate substantial returns in a similar fashion. Opting for Advanced Micro Devices (AMD:US) seems like a straightforward and compelling choice as an alternative to Nvidia. AMD has established strong footholds in numerous industries and has consistently held the second-largest market share in desktop GPUs for an extended period. Additionally, AMD is poised to introduce a new AI GPU this year, presenting a challenge to Nvidia's current offerings.AMD has established strong footholds in numerous industries and has consistently held the second-largest market share in desktop GPUs for an extended period. AMD has established strong footholds in numerous industries and has consistently held the second-largest market share in desktop GPUs for an extended period. While AMD may not necessarily surpass Nvidia, the rapidly expanding markets such as AI suggest that there is ample space for Nvidia to maintain its dominance and for AMD to emerge as a significant player in the realm of AI chips. Anticipate AMD's Significant Impact on the AI Landscape in the Coming Year The introduction of OpenAI's ChatGPT in November 2022 prompted a reevaluation of the potential of AI. Enthusiasm surged as the public recognized its capacity to propel various industries forward, including healthcare, consumer products, education, manufacturing, autonomous vehicles, and beyond. Nvidia stood out as the primary chip supplier in the rapidly expanding market. Nevertheless, the success underscored the notable gap that other chipmakers, such as AMD, had experienced in falling behind in the field of AI. Consequently, AMD dedicated the remainder of the year to crafting hardware capable of rivalling Nvidia, and the fruits of its labour are now evident. AMD introduced the MI300X AI GPU in December, asserting that it stands shoulder-to-shoulder with Nvidia's H100 in terms of training capabilities and outperforms the H100 in inference by 10% to 20%. AMD's latest chip has quickly garnered attention, especially with Microsoft's announcement in November that its Azure cloud platform would be the inaugural platform to leverage the MI300X for optimising AI capabilities. Microsoft's significant 49% stake in OpenAI positions it as a robust ally for AMD. In addition to a partnership with Meta, where the new chips will also be utilised, AMD appears poised for a promising future in the field of AI. AMD introduced the MI300X AI GPU in December, asserting that it stands shoulder-to-shoulder with Nvidia's H100 in terms of training capabilities and outperforms the H100 in inference by 10% to 20%. AMD introduced the MI300X AI GPU in December, asserting that it stands shoulder-to-shoulder with Nvidia's H100 in terms of training capabilities and outperforms the H100 in inference by 10% to 20%. In 2023  Nvidia achieved a historic milestone by becoming the first chipmaker to surpass a market capitalization of $1 trillion. While AMD's market cap currently stands at $237 billion, a considerable distance from that milestone, it suggests the company may possess substantial long-term growth potential. Summary The market may increasingly appreciate AMD's accelerated growth, particularly given its substantial opportunity in the AI chip market. For astute investors seeking growth stocks to benefit from the rising adoption of AI and the resurgence of the PC market, incorporating AMD into their portfolios before witnessing further surges could be a prudent move. Click here to purchase AMD shares  Disclaimer: CMC Markets Singapore may provide or make available research analysis or reports prepared or issued by entities within the CMC Markets group of companies, located and regulated under the laws in a foreign jurisdictions, in accordance with regulation 32C of the Financial Advisers Regulations. Where such information is issued or promulgated to a person who is not an accredited investor, expert investor or institutional investor, CMC Markets Singapore accepts legal responsibility for the contents of the analysis or report, to the extent required by law. Recipients of such information who are resident in Singapore may contact CMC Markets Singapore on 1800 559 6000 for any matters arising from or in connection with the information. Disclaimer: CMC Markets Singapore may provide or make available research analysis or reports prepared or issued by entities within the CMC Markets group of companies, located and regulated under the laws in a foreign jurisdictions, in accordance with regulation 32C of the Financial Advisers Regulations. Where such information is issued or promulgated to a person who is not an accredited investor, expert investor or institutional investor, CMC Markets Singapore accepts legal responsibility for the contents of the analysis or report, to the extent required by law. Recipients of such information who are resident in Singapore may contact CMC Markets Singapore on 1800 559 6000 for any matters arising from or in connection with the information. Latest from CMC Netflix Q4 earnings preview On the back of a crackdown with password sharing, how could Netflix fare in its Q4 earnings? 16 Jan 2024 Tesla Q4 earnings preview Upcoming indices dividend drop points Forex Forecast: AUD/USD, USD/JPY, EUR/USD Related articles Netflix Q4 earnings preview On the back of a crackdown with password sharing, how could Netflix fare in its Q4 earnings? 16 Jan 2024 Tesla Q4 earnings preview While Tesla's share price jumped 102% over 2023, interest rates and subsidies on EV purchases could cause headwinds in 2024. 15 Jan 2024 Upcoming indices dividend drop points View the estimated indices dividend drop points for the week commencing Monday, 15 January 2024. 12 Jan 2024 Forex Forecast: AUD/USD, USD/JPY, EUR/USD In our first Trend Tracker of 2024, Senior Trader Carlo Pruscino looks charts three of the top forex pairs to give a fundamental analysis. 12 Jan 2024 SG 1800 559 6000 Lines are open 24/5 Contact Download our app Get greater control and flexibility for peak performance trading when you're on the go. CMC Markets Singapore Pte. Ltd. (Reg. No./UEN 200605050E.) is regulated by the Monetary Authority of Singapore and holds a capital markets services licence for dealing in capital market products that are over-the-counter derivatives and leveraged foreign exchange, and is an exempt financial adviser. Contracts for difference (CFD) are leveraged products and carry a high level of risk to your capital as prices may move rapidly against you. It is possible to lose more than your initial investment and you may be required to make further payments. Countdowns carry a level of risk to your capital as you could lose all of your investment. Invest only what you can afford to lose. CFDs and Countdowns involve the risk of substantial loss and trading  such products may not be suitable for all clients therefore ensure you understand the risks and seek independent advice. Please read our disclaimers, risk warning/disclosures, terms of business and associated documentation here This website uses cookies to obtain information about your general internet usage. Removal of cookies may affect the operation of certain parts of this website. For more information about cookies and how to remove them, please read our  cookie policy.  Tax treatment depends on the individual circumstances of each client. Tax law can change or may differ depending on the jurisdiction in which you are resident.  Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. © 2012 Samsung Telecommunications America, LLC. Samsung and Galaxy S are both registered trademarks of Samsung Electronics Co., Ltd. Android is a trademark of Google Inc. Android is a trademark of Google Inc. Portions of this page are reproduced from work created and shared by Google and used according to terms described in the Creative Commons 3.0 Attribution License. This advertisement has not been reviewed by the Monetary Authority of Singapore. © 2024 CMC Markets "
}