{
    "title": null,
    "date": "1/22/2024",
    "url": "https://investorplace.com/2024/01/riding-the-nvidia-rocket-time-to-cash-out-or-stay-aboard-nvda-stock/",
    "text": " Nvidia's reign of terror over the AI market will end. The question is when Advertisement Source: Poetra.RH / Shutterstock.com We talk about stocks going “to the Moon” all the time. Sometimes, like with Nvidia (NASDAQ:NVDA) stock, they do. But all stocks return to fundamental value. Those on the Nvidia rocket, like me, constantly face the question of when to get off. The answer, so far, has been not yet. Since the hype over AI got going a year ago, NVDA stock is up 233%. Just since the start of January, it’s up 20%. If you got in five years ago, as I did, you’ve got a 10-bagger, a gain of 1,416%. My personal strategy was to get my money out and let the rest ride. I bought 100 shares before it split 4:1 in 2020. I sold 100 of those shares and got my investment out. Then I stupidly sold another 100. Now I’m sitting. I explained why Nvidia is so dear in November. It’s not the hardware. It’s the development software, its Cuda toolkit, that developers find essential. No one has its range of inference platforms for models and workloads. In the 1990s we talked often about the “WinTel” monopoly of Microsoft (NASDAQ:MSFT) Windows running on Intel (NASDAQ:INTC) chips. Cuda means Nvidia is both the Microsoft and Intel of the AI revolution. It took Nvidia almost nine years to develop Cuda, and it will take time for others to follow. Just not nine years. That’s why NVDA stock is going to the Moon. Cloud Czars like Amazon (NASDAQ:AMZN), Meta Platforms (NASDAQ:META) and Alphabet (NASDAQ:GOOG)(NASDAQ:GOOGL) are buying Nvidia chips with both hands. They’re buying at any price because their customers need Cuda. It’s not like the Czars aren’t trying to work around this. Much of the work is being done through open source processes, like OpenAI’s Triton. The debates around these languages are complex. The point is the debates exist, and at some point Cuda will face serious competition. Nvidia still has advantages in hardware  and (perhaps most important) branding. Across corporate America thousands of programming teams are now building language models and training corporate databases, seeking practical advantages. Telling managers without tech experience you’re using AMD (NASDAQ:AMD) hardware, or some open source language is a tough ask. The C-Suite wants to tell shareholders they’re going with a winner. Right now, that means delivering, and deploying, with Nvidia. This will change. Alphabet or Meta will show off something worthwhile, done without Nvidia, and that will change the equation. Right now, you want to watch Google, which is laying off people while dangling stock in front of developers. It’s when Google finds its footing that you want to pull the parachute on Nvidia. They have the hardware, the scale, and (perhaps most important) the fear to compete. You also want to watch Amazon, and its partnership with Anthropic. Getting Anthropic providing value with Amazon hardware will be a big deal. Nvidia’s reign of financial terror over the AI market will end. When it does the stock will fall. But it’s hard to say when that will happen. I set a price target of $500/share late last year, before going on my Christmas break. Since then, Nvidia has blown past it. The stock is now selling near $600. At that price, its market cap is just $150 billion less than Amazon’s. Its price to earnings (PE) ratio is nearly as high, at 78. When the fall back to reality happens, it will be sudden, and it will be final. Nvidia is still a great company, but there will be blood on the exchange floor when its stock falls to Earth. As of this writing, Dana Blankenhorn had LONG positions in GOOGL, AMD, MSFT, INTC, AMZN and NVDA. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Dana Blankenhorn has been a financial and technology journalist since 1978. He is the author of Technology’s Big Bang: Yesterday, Today and Tomorrow with Moore’s Law, available at the Amazon Kindle store. Tweet him at @danablankenhorn, connect with him on  Mastodon or subscribe to his Substack. Artificial Intelligence, Semiconductor, Software, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/riding-the-nvidia-rocket-time-to-cash-out-or-stay-aboard-nvda-stock/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}