{
    "title": "Nvidia Just Hit an All-Time High of $538, is it Still a Buy?",
    "date": "1/9/2024",
    "url": "https://tokenist.com/nvidia-just-hit-an-all-time-high-of-538-is-it-still-a-buy/",
    "text": "Nearly a week after the last Nvidia (NASDAQ: NVDA) coverage, the stock reached an all-time high of $538 per share on Tuesday. The AI-powered stock has now tracked an 8.46% performance since the new year. A week ago, DA Davidson analysts forecasted a 15% downside risk to Nvidia, projecting a U-turn within the next two to six quarters as the AI hype balloon is popped. “While we continue to believe that generative AI is the most important transformative technology since the Internet, we do not expect the same level of investment we saw in 2023 continuing beyond 2024.” DA Davidson analysts They set the average NVDA price target at $410 per share by the end of 2024 and beyond in the first two quarters of 2025. The more bearish forecast is expected, given Nvidia’s sharp public focus as the primary facilitator of the emerging AI generative ecosystem. Such investor enthusiasm, expressed by NVDA’s 233% YoY performance, is typically followed by a wind-down period. However, the new ATH suggests that Nvidia could also repeat triple-digit performance in 2024. But what are the arguments for and against it? Even after the stronger-than-expected non-farm payroll (NFP) report, fed fund futures still price in the first rate hike for March at 63.77% probability. The “hot labor market” has fragile legs because these reports are regularly revised downwardly month-to-month. Further, the December jobs report showed a disproportionate number of jobs, over 52,000, coming from government-funded sources instead of the real economy. Unsurprisingly, the New York Fed updated its recession probability by treasury spread on January 4th, delivering a 62.9% recession chance for twelve months ahead. Even with the rate cuts to stimulate the economy out of the recession, Nvidia would see a loss of demand as consumer spending decreases. Although Nvidia effectively transitioned from a video gaming company to a data center company, that loss of demand would also result in reduced business investments in data centers. Ultimately, the macroeconomic driver for NVDA’s performance in 2024 would depend on the recession’s severity if it unfolds in the first place. Join our Telegram group and never miss a breaking digital asset story. USG issued chip export restrictions to China in October to slow its primary economic rival. They covered A800 and H800 chips, which Nvidia designed explicitly for the Chinese market to avoid the prior round of export restrictions. However, Nvidia is not losing the playing field because its competitors, AMD (NASDAQ: AMD) and Intel (NASDAQ: INTC), will also be affected. Moreover, Nvidia’s wider offering of consumer-grade chips found in laptops, PC desktops, and smartphones is still exempt. Instead, the USG uses the criteria of the chip’s computing prowess and interconnectivity to determine if it is subject to control. After all, these types of chips are then clustered in AI data centers as effective supercomputers that could potentially give China an economic/military edge. To offset data center losses in the medium term, until China erects its chip foundries, Nvidia plans to expand in Vietnam and Malaysia via a partnership with YTL Power International. In the meantime, Nvidia doesn’t expect “meaningful material impact.” The simple thesis behind Nvidia’s drive onward relies on the demand for AI-powered apps. But how can that be priced if new applications are unrolled almost monthly? In this case, Magnific.ai delivered an upscaling feature previously thought impossible. Magnific’s AI algorithm rebuilds low-grade images while maintaining the fidelity of the original content. This should not be possible 🤯I've enhanced this 8x from 1.2MP to 77MP (10.752x7168px) using Magnific ai. 64x more pixels than the OG image. You can do the same. Each super enhance takes 10-15 minutes and can run in the background. A thread pic.twitter.com/AO0l51nCk3 Likewise, animating generated AI images is only a recent development. It showcases the rise of a new market for user-made short films at a quality previously reserved for well-funded studios. Attempting to make a little mini-series using only AI.I'm using midjourney to generate the images, @pika_labs to generate the video. It ended up taking me about 3 hours to generate 60 seconds of footage.This 16-sec clip used only 6 images. prompts & images in thread 👇 pic.twitter.com/Qp9usWwFkR Moreover, highly popular platforms like Midjourney have not launched proper app services. Given the rapidly evolving space of generative AI and its novelty, it is likely that demand for Nvidia’s chips is severely underestimated. Based on 38 analyst inputs pulled by Nasdaq, NVDA stock is still a “strong buy.” The average NVDA price target is $662 vs the current $535. The high estimate is $1100, while the low forecast is $560 per share, above the price at press time. Which generative AI app is your favorite so far? Let us know in the comments below. General Disclaimer: The Tokenist is an independent media publication. All information shared on The Tokenist, including its associated social media channels, is provided for informational purposes only. Nothing shared by The Tokenist should be considered investment advice. The Tokenist does not provide investment advice. While we do our best to ensure accuracy, The Tokenist makes no guarantee that all information contained on the site will be accurate. If you have any questions whatsoever, consult a licensed financial advisor. Advertising Disclosure: Some offers on this page may promote affiliates, which means The Tokenist earns a commission if you purchase products or services through the links provided. All opinions expressed here are the author’s and not of any other entity. The content at The Tokenist has not been endorsed by any entity mentioned at the site. For additional information, please review our full advertising disclosure. 467 free spots remaining By reading Five Minute Finance each week, I learn about new trends before anyone else. I can’t emphasize enough how valuable that is. Five Minute Finance has influenced how I see finance - I rely on it for insight on the latest news and trends at the intersection of finance and technology. 467 free spots remaining By reading Five Minute Finance each week, I learn about new trends before anyone else. I can’t emphasize enough how valuable that is. Five Minute Finance has influenced how I see finance - I rely on it for insight on the latest news and trends at the intersection of finance and technology. Get free stock picks every day. Delivered straight    to your inbox. Charts with clear entry and exit points, delivered by proven, funded traders. Normally:\n$29/month   |    Now: Free for Life (today only) Join 10,843 traders — No thanks, I don’t want free stock picks "
}