{
    "title": "Think Nvidia Is Too Risky? The Smartest Artificial Intelligence (AI) Stock \nto Buy With $1,000 Right Now",
    "date": "1/24/2024",
    "url": "https://www.fool.com/investing/2024/01/23/the-smartest-artificial-intelligence-ai-stock-buy/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Editor's note: This article has been corrected. Microsoft does not own any portion of OpenAI; it is entitled to a share of profit distributions. Over the past year, Nvidia (NVDA 0.12%) has been the talk of the town and one of the stock market's best-performing large companies. The company designs the kind of advanced graphics processing unit (GPU) technology needed for artificial intelligence (AI). As a result, the GPU leader's revenue and earnings have been skyrocketing. Sales surged 206% year over year in the company's third quarter, and non-GAAP (adjusted) earnings rose 593%. With guidance for sales growth of roughly 231% in the fourth quarter, Nvidia expects the incredible momentum to continue in the near term. However, the combination of the company's explosive stock gains and the historically cyclical nature of the semiconductor industry suggests that Nvidia may be too hot for some investors to handle. Additionally, the company could see some uneven performance due to bans on advanced chip sales to China and upcoming performance comparisons to recent periods that likely benefited from Chinese customers frontloading GPU orders to get ahead of regulations. Over the long term, there's still a good chance that Nvidia will deliver strong returns. But another \"Magnificent Seven\" AI stock is offering a risk-reward profile that's probably a better fit for many investors. If you've got your financial bases covered and are looking to invest $1,000 or more into a sturdy AI leader, read on to see why Microsoft (MSFT -0.17%) stands out as the smartest buy right now. Microsoft recently unseated Apple as the world's largest company as measured by market capitalization, although the two are going back and forth this month over who is on top (Apple currently has it). I think there's a very good chance that the software giant will regain and and then retain the title for much of the next decade. For investors seeking AI growth stocks backed by dependable businesses and strong competitive moats, Microsoft continues to be a great play. Even as it faced macroeconomic headwinds and one-time tax liabilities over the last year, Microsoft continued to post sales growth and strong profits. Now positive performance momentum is accelerating again. Data source: Microsoft. Chart by author. Microsoft grew its revenue 13% year over year to reach $56.5 billion in its September-ended quarter. The company's operating income rose 25% year over year to hit $26.9 billion, and its net income jumped 27% to hit $22.3 billion. Microsoft's Azure cloud infrastructure platform is at the heart of its surging profitability. AI developers are turning to the company's cloud offering to develop, launch, and scale their applications, and this tailwind is still just starting. Microsoft is integrating AI into its operating systems and productivity software, and the company's Copilot software also makes it a frontrunner in the potentially explosive AI personal assistant space. Microsoft is even designing its own AI chips. Virtually every aspect of the tech leader's business looks poised to benefit from artificial intelligence. In addition to its own internal projects, Microsoft also has a partnership with OpenAI -- the company responsible for applications including ChatGPT and DALL-E. If you're looking for a well-rounded AI stock, Microsoft is tough to beat. Aided by strong profitability, Microsoft has paid a dividend since 2003 and raised its payout annually for 18 years straight. While the company's current yield of roughly 0.7% won't be attractive to investors looking for big payouts right away, this is a dividend growth stock that's perfectly suited to be a set-it-and-forget-it portfolio component.  MSFT Dividend data by YCharts Microsoft's business is enormously profitable, and it has plenty of room for long-term expansion. In addition to sending the company's share price higher, profits generated on the back of AI should also help the company continue to increase the amount of cash that it returns to shareholders through dividends. With strong business momentum, plenty of untapped AI opportunities, and an appealing returned income component, Microsoft is a top buy for investors seeking strong AI stocks. Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}