{
    "title": "Ex-Nvidia exec launches RagaAI with $4.7m funding to automatically test and \nfix AI",
    "date": "1/23/2024",
    "url": "https://finance.yahoo.com/news/ex-nvidia-exec-launches-ragaai-140000202.html",
    "text": "RagaAI is the only automated testing platform for all types of AI including GenAI ensuring high quality, safe and reliable AI in production. San Francisco, California --News Direct-- RagaAI RagaAI, a pioneering AI-focused startup, has successfully closed a $4.7m seed funding round. The round was led by pi Ventures with participation from global investors including Anorak Ventures, TenOneTen Ventures, Arka Ventures, Mana Ventures, and Exfinity Venture Partners. The sprawl of large language models (LLMs), computer vision and natural language processing (NLP) have created a new generation of applications that are reshaping industries and transforming how we engage with the world today. Ensuring the performance, safety and reliability of AI has become a key focus. Helping companies stay on top of this, RagaAI has launched from stealth with an automated and comprehensive AI testing platform. RagaAI is establishing a robust framework for safe and reliable AI. RagaAI’s breakthrough Foundation Models called RagaAI DNA for testing uses automation to detect AI issues, diagnose and fix them instantly. The platform already offers over 300 different tests to help users triage the issue down to its root cause. It is able to identify issues as varied as data drift, edge case detection, poor data labelling quality, bias in the data, lack of model robustness or adversarial attacks. RagaAI is a true multimodal platform which supports LLMs, images/videos, 3D, audio, NLP and structured data and reduces 90% of the risks while accelerating AI development by more than 3x. RagaAI is working with a range of AI-first companies and identified two common challenges they faced which RagaAI is addressing Firstly, they face a skill set constraint owing to the sparse availability of specialized AI engineers. As such AI Testing automation becomes a necessity to optimize the AI development process. Secondly, safety and security concerns loom large. AI testing will mitigate vulnerabilities and ensure the reliability and trustworthiness of AI systems. RagaAI was founded in January 2022 by tech veteran Gaurav Agarwal who spent the early part of his career at Texas Instruments before moving to mobility business Ola and computing giant NVIDIA. He and the founding team have over 50 years of collective AI expertise who want to unlock the potential of AI by bridging the gap between technological capabilities and business outcomes through AI testing. RagaAI advisors include AI leads at Amazon, Google, Meta, Microsoft and NVIDIA. Gaurav Agarwal, CEO and founder of RagaAI commented: “At Ola & NVIDIA, I saw the significant consequences of AI failures due to lack of comprehensive testing. Our Foundation Models “RagaAI DNA” is already solving this problem across large fortune 500 companies. RagaAI is designed to detect AI issues, diagnose them and fix them seamlessly. Our vision is to liberate AI from the constraints of human interventions, and foster continuous improvement. In the era where AI dominates, our mission at RagaAI is to tackle the paramount challenge of ensuring the quality and consistency of AI applications. Focused on providing innovative testing solutions, we aim to unlock the full potential of the AI revolution, paving the way for a future where AI thrives with trust, reliability and excellence. Guided by our core values, we are committed to pushing the boundaries of automated AI issue detection, automated root cause analysis and fixing the issues, staying at the forefront of cutting-edge methods.” The platform has already added value to various sectors with multiple use cases. An ecommerce client implementing a chatbot fine-tuned an open-source language model on their product catalog for customer support. RagaAI was instrumental in identifying and rectifying hallucinations, reducing errors in responses. Meanwhile, for an Automotive customer facing challenges in detecting vehicles in low-light scenarios, RagaAI leveraged generative AI to simulate diverse lighting conditions, significantly enhancing model accuracy and potentially preventing accidents. Research indicates that AI is poised to be a $2 trillion market by 2030. RagaAI believes that 25% of this spend will be targeted towards ensuring AI is safe and reliable and its proposition is well placed to service the demand in the time to come. RagaAI's funding round will primarily be used to advance research and development, with a focus on improving AI testing tools. Additionally, the company plans to expand its team and raise awareness in the AI community while forming strategic partnerships. This investment positions RagaAI for significant growth in AI innovation. Manish Singhal, Founding Partner, pi Ventures, commented: “\"In the rapidly expanding AI landscape, the importance of reliable and unbiased systems is crucial, with AI testing emerging as the linchpin for ensuring the safety, reliability, and ethicality of complex models. Driven by their patent pending Drift detection technology, RagaAI, an AI testing platform, is well-suited to solve these massive problems for the AI deployments globally. At pi Ventures, we believe in backing founders who can create disruptive solutions for global impact. In our view, Gaurav and his stellar team at Raga are fulfilling that goal in a big way. We are pleased to be associated with them. \" RagaAI has a key focus on Enterprise and data privacy is at its core. It is the only AI & MLOPS product to have all of the SOC2 Type2, ISO 27001, HIPAA, GDPR & CCPA certifications. Additionally, RagaAI technology is deployed on customer private clouds or their on-prem infra. Designed for data scientists and ML engineers, RagaAI is offered through a fully featured UI and an easy to use python interface. About RagaAI As AI eats the world, the biggest problem facing the AI revolution is ensuring quality and consistency of AI applications. Raga AI is taking on this problem and solving it with its testing platform which promises to realize the full potential of the AI revolution. For more information please visit: https://www.raga.ai/ About pi Ventures pi Ventures is an early-stage venture capital fund pioneering AI and deep tech investments. The fund backs disruptive tech ventures solving global problems thus creating 10x differentiated businesses. The VC fund portfolio includes world leading technology companies like Wysa, Pixis, Locus, Agnikul and Niramai among others. RagaAI Bilal Mahmood +44 7714 007257 b.mahmood@stockwoodstrategy.com https://raga.ai/ View source version on newsdirect.com: https://newsdirect.com/news/ex-nvidia-exec-launches-ragaai-with-4-7m-funding-to-automatically-test-and-fix-ai-533285275 "
}