{
    "title": "Forget Nvidia: 2 Artificial Intelligence Stocks That Could Help Make You \nRich in 2024",
    "date": "1/20/2024",
    "url": "https://www.fool.com/investing/2024/01/20/forget-nvidia-2-artificial-intelligence-stocks-tha/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More As the company supplying 80% of the necessary training chips, Nvidia was arguably the biggest winner in 2023's artificial intelligence (AI) boom. That said, it makes sense for investors to diversify their holdings to target different sides of the long-term opportunity. Let's look at why Alphabet (GOOG 0.21%) (GOOGL 0.04%) and Meta Platforms (META -1.68%) could also have a place in your portfolio in 2024 and beyond. With a market cap of $1.79 trillion, Alphabet is already the fourth-largest company in the world, and it will take a lot of momentum to power continued expansion. But AI may be able to do the trick. The tech giant is heavily incorporating AI infrastructure into its cloud-computing platform, which could generate much-needed diversification and long-term growth. Among AI companies, Nvidia is particularly successful because it targets the \"picks and shovels\" side of the opportunity, minimizing competition while maximizing the total addressable market for its products. Google is developing a similar strategy (albeit higher on the value chain) by turning Google Cloud into a one-stop shop for all its enterprise clients' data-management and AI training needs. And while Google isn't the only cloud-service provider employing this strategy, it has some key advantages. Image source: Getty Images. According to CEO Sundar Pichai, 70% of generative AI start-up unicorns use Google's infrastructure to train and run their models. This is a big vote of confidence in the platform's quality and price point. And Google plans to build on this advantage with proprietary AI chips (called tensor processing units), which can bring down costs through vertical integration and reduce the company's reliance on third-party suppliers like Nvidia. Alphabet's low valuation is icing on the cake for investors. With a forward price-to-earnings (P/E) multiple of just 22, the stock is significantly cheaper than the NASDAQ 100's estimate of 29. Following the release of ChatGPT in late 2022, Meta's share price has been on a tear, jumping a substantial 174% in the last 12 months alone. Investors are optimistic about the company's decision to pivot away from metaverse development to focus more on generative AI, which could optimize its advertising and improve its consumer-facing platforms. At first glance, Meta has some clear advantages in its AI efforts. The social media giant's business model has always involved gathering and monetizing huge amounts of data. And generative AI opens another avenue for this strategy through large language models (LLMs), which are algorithms designed to create content out of trained datasets. Meta is also adding conversational AI experiences across its popular apps, introducing features ranging from more responsive image editing on Instagram to conversational chatbots with distinct personalities on WhatsApp. These efforts probably won't immediately impact Meta's operational performance, but they could help maintain its platforms' user engagement and generate valuable customer data. On the operational side, Meta is bouncing back from the challenges it faced in 2022. Third-quarter (2023) revenue jumped by 23% year over year to $34.15 billion, while net income jumped 164% to $11.58 billion, helped by aggressive cost cutting and layoffs. And with a forward P/E of just 22, it isn't too late for investors to bet on the company's long-term potential. In 2024 and beyond, investors should expect the AI landscape to become increasingly competitive, especially on the software side of the market. With that in mind, it makes sense to bet on companies with potential economic moats. Alphabet and Meta Platforms fit the bill because of their treasure troves of user data, which can be used to train and refine LLMs. Both companies look poised for market-beating growth.  Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Will Ebiefung has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Meta Platforms. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}