{
    "title": "Vibrant Gujarat Summit 2024: Generative AI Will Change The Way We Work & \nGovern, Nvidia SVP Says",
    "date": "1/10/2024",
    "url": "https://news.abplive.com/technology/vibrant-gujarat-global-summit-2024-generative-ai-will-change-the-way-we-work-and-govern-nvidia-worldwide-field-operations-partners-with-yota-to-open-state-of-art-ai-data-centre-facility-in-gift-city-generative-ai-watch-1655552",
    "text": "Vibrant Gujarat Summit: The Senior Vice President of Nvidia Worldwide Field Operations, Shanker Trivedi, on Wednesday at the Vibrant Gujarat Global Summit 2024 said that Generative AI is going to change the way people do business, the way they govern, and the way they live. He added that just like the mobile revolution and the internet, it is going to affect each and every single one of us. Trivedi said during his address, \"Generative AI is going to change the way we work, the way we do business, the way we govern, the way we live. Just like the internet started 30 years ago and the mobile revolution started 25 years ago, the Generative AI revolution will also do the same. Generative AI is going to affect all of you.\" #WATCH | Vibrant Gujarat Global Summit 2024 | Shanker Trivedi, Senior VP, Nvidia Global Field Operations says, \"Generative AI is going to change the way we work, the way we do business, the way we govern, the way we live. Just like the internet starting 30 years ago and the… pic.twitter.com/Iv1q6n1Xej Generative artificial intelligence in simpler words is the type of artificial intelligence which is capable of generating text, images, or other media, using generative models. These AI models learn the patterns and structure of their input training data and then based on that they generate new data that has similar characteristics. During his address, he also announced that Nvidia's partner Yota is setting up a state-of-the-art AI data centre facility in the GIFT city which will go live before the end of March 2024. Apart from Yota, the Nvidia group is partnering with a number of India's leading groups to set up state-of-the-art AI data centre facilities and provision them here in the nation. Trivedi added, \"India has talent, India has amazing data, India has a unique culture...I am delighted to tell you that we are partnering with all of India's leading groups to set up state-of-the-art AI data centre facilities and provision them here in India.\" #WATCH | Vibrant Gujarat Global Summit 2024 | Shanker Trivedi, Senior VP, Nvidia Global Field Operations says, \"India has talent, India has amazing data, India has a unique culture...I am delighted to tell you that we are partnering with all of India's leading groups to set up… pic.twitter.com/vMAwvbA287 At the summit, Reliance chief Mukesh Ambani revealed that Gujarat has achieved full 5G enablement, a technological milestone surpassing many countries globally. This cutting-edge connectivity is expected to pave the way for significant advancements in various sectors. ALSO READ: 5G Will Produce AI-Enabled Doctors & Teachers, Generate Millions Of Jobs: Reliance Chief Mukesh Ambani At Vibrant Gujarat Summit Ambani emphasised the transformative impact of 5G-enabled artificial intelligence (AI) on the job market. The integration of 5G technology is anticipated to create millions of novel employment opportunities, fostering a dynamic economic landscape. "
}