{
    "title": "Nvidia's Data Center Dominance and AMD's Rising Share Foretell Bullish \nFuture: BofA Analyst - NVIDIA (NAS",
    "date": "2/28/2024",
    "url": "https://www.benzinga.com/news/24/02/37372403/nvidias-data-center-dominance-and-amds-rising-share-foretell-bullish-future-bofa-analyst",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW BofA Securities analyst Vivek Arya reiterated a Buy rating on Nvidia Corp NVDA with a price target of $925. The analyst maintained a Buy rating on  Advanced Micro Devices, Inc AMD with a price target of $195. Both stocks are trading lower on Wednesday. The analyst said that Nvidia holds a dominant position in the $85 billion+ accelerator market, with its leadership in the data center sector driving the majority of its sales. Data center sales will likely exceed 85% of Nvidia’s total sales, a significant increase from about 25% five years ago and around 50% for AMD, up from 10%-15%. Also Read: Arm Is Strategically Shifting Towards AI, Increased Royalties – Analyst Forecasts Despite limited visibility into data center GPU ordering trends, key takeaways include Nvidia’s nearly 95% market share in GPU silicon units, which surpassed 900k units in the fourth quarter, showing over 100% year-on-year growth. The Hopper (H100/HGX) platform constitutes the vast majority of Nvidia’s data center revenue, with AMD’s data center GPU revenue jumping to approximately $400 million in the fourth quarter, primarily due to shipments for the new El Capitan Supercomputer, the analyst said. Arya cited significant growth in the $85-$90 billion accelerator market, with an estimated total addressable market (TAM) of about $180 billion, still below the bull case estimates of vendors like AMD ($400 billion). In the gaming segment, he stated that the discrete GPU (dGPU) market for PC gaming, low-end PCs, and consoles will likely contribute about 10%-15% of Nvidia and AMD sales over the next few years. In 2023, the dGPU market amounted to $10.4 billion, up 11% year-on-year, with fourth-quarter sales reaching $2.9 billion, up 3% quarter-on-quarter, and a robust 60% year-on-year, benefiting from strong unit growth and price strength, Arya highlighted. Upcoming catalysts include Nvidia’s GTC event on March 18, focusing on Generative Artificial Intelligence and updates on Nvidia’s accelerator and networking roadmaps, as per Arya. Broadcom Inc’s AVGO analyst day will also provide insights into custom ASIC offerings and advancements in Ethernet for AI networking. IShares Semiconductor ETF SOXX and VanEck Semiconductor ETF SMH have significant exposure to the stocks. The ETFs have gained 15%-23% year-to-date. Price Actions: NVDA shares traded lower by 0.29% at $784.72 on the last check Wednesday. AMD shares traded lower by 0.96% at $176.30. Also Read: US Chipmakers Want More Subsidies As AI Shapes The Semiconductor Industry Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}