{
    "title": null,
    "date": "2/9/2024",
    "url": "https://www.chinamoneynetwork.com/2024/02/09/cambricon-technologies-chinas-nvidia-contender-faces-challenges-in-pushing-chinese-made-ai-chips-as-it-marks-seventh-consecutive-year-of-losses",
    "text": "Cambricon Technologies, a company ambitiously striving to become China’s Nvidia and once hailed as the pioneer of artificial intelligence (AI) chip development in the country, is anticipating a net loss ranging from 756 million to 924 million yuan for 2023. This marks the seventh consecutive year of losses for the company. After undergoing multiple rounds of layoffs in 2023, Cambricon Technologies is encountering significant obstacles in promoting the adoption of Chinese-made AI chips. Its revenues have decreased, and profitability remains a distant prospect. The company’s heavy dependence on government customers and difficulties in attracting commercial customers underscore the complexities of domestic chip replacement in the advanced technology sector. Despite the aspirations of Chinese companies like Cambricon Technologies to disrupt the AI chip market dominated by foreign giants like Nvidia, significant hurdles persist. China’s reliance on foreign GPUs for accelerated computing servers is high, with Nvidia accounting for a whopping 91.4% of the enterprise-level GPU market in 2021, according to IDC data, while AMD held an 8.5% share. Amidst tightening U.S. sanctions that hinder Chinese companies’ access to advanced chip technologies, Nvidia has been banned from exporting its advanced chips, including the A100 and H100 series. While Nvidia plans to launch modified versions compliant with U.S. export controls targeting China, this creates an opportunity for Chinese-made AI chips to gain traction. However, domestic chipmakers face formidable challenges in gaining market acceptance. Cambricon Technologies, in particular, struggles with access to advanced manufacturing processes due to U.S. sanctions, rendering their products less competitive. Furthermore, the absence of a robust software ecosystem for domestic chips necessitates extensive code development work by customers, leading to reduced efficiency and performance. A case in point is Baidu’s large language model, Ernie Bot, which primarily utilizes Nvidia’s V100 and A100 for training. For inference, Ernie Bot employs Nvidia’s A100 alongside Baidu’s own Kunlun Core 2, while Cambricon Technologies’ Siyuan 590 has been deployed on a limited scale. Reports indicate that Siyuan 590’s inferior performance compared to A100, along with compatibility issues and operational barriers, hindered its widespread adoption in Ernie Bot’s deployment. This illustrates the significant obstacles Cambricon Technologies and other domestic chipmakers face in achieving commercialization breakthroughs. Cambricon Technologies currently finds itself heavily reliant on government-affiliated clients for its revenue. In 2021, the company’s largest customer was Jiangsu Kunshan High-Tech Industry Investment Development Co., Ltd., contributing 62.46% to its overall sales. Similarly, in 2022, Nanjing Science and Technology Innovation Investment Co., Ltd. emerged as the largest customer, accounting for 60.81% of Cambricon’s total sales. Both Jiangsu Kunshan High-Tech Industry Investment Development and Nanjing Science and Technology Innovation Investment have strong ties to state-owned assets, with the former backed by Kunshan City State-owned Assets and the latter by Nanjing City State-owned Assets. According to recent data from the state-owned Bank of Communications’ bidding website, Cambricon Technologies has successfully secured projects such as the supply of domestic GPU servers to the bank. This further underscores its dependence on government and state-owned enterprises for business opportunities. Despite this heavy reliance on government customers, Cambricon Technologies’ revenue growth has been sluggish. Following a year-on-year increase of 1.11% in 2022, the company anticipates achieving revenue in the range of 680 million to 720 million yuan in 2023, which is slightly lower than the previous year. This suggests that while government contracts may provide a stable source of income, they may not be sufficient for sustained and significant revenue growth. For the seventh consecutive year, Cambricon Technologies is anticipated to record a net loss attributable to the parent company’s owners. Estimated losses for 2023 range from 756 million yuan to 924 million yuan, marking a narrowing of the loss by 26.47% to 39.84% compared to the same period last year. The company’s management expenses are expected to decrease significantly in 2023, ranging from 135 million yuan to 165 million yuan. This represents a decrease of 44.38% to 54.49% compared to the previous year’s management expenses of 297 million yuan. The primary factor behind this decrease is the reduced apportioned share-based payment expenses compared to the previous year. Additionally, Cambricon Technologies expects a decrease in research and development expenses for 2023, ranging from 999 million yuan to 1.221 billion yuan. This represents a decrease of 19.83% to 34.41% compared to the previous year’s expenses of 1.523 billion yuan. The company aims to enhance research and development efficiency and optimize resource allocation based on its business plans. Asset impairment losses for 2023 are expected to range from 117 million yuan to 143 million yuan, showing a decrease of 27.20% to 40.44% compared to the previous year’s losses of 196 million yuan. This decrease is primarily due to the reduced inventory write-downs compared to the previous year. Non-operating profits and losses are expected to have a significant impact on Cambricon Technologies’ net profit. Specifically, the impact of non-recurrent profits and losses on Cambrian Genomics’ net profit is anticipated to range from 189 million yuan to 231 million yuan during the reporting period. This is primarily due to the influence of government subsidies included in current profits and losses. Unfortunately, the company has had to make significant layoffs, with the intelligent driving chip business unit bearing the brunt of the cuts. Reports indicate that the software division of Cambricon Technologies has laid off nearly half of its employees, while the hardware division has also been affected. These moves are likely a response to the company’s financial challenges and the need to streamline operations. Since its establishment in 2016, Cambricon Technologies has emerged as a leading player in the field of artificial intelligence chip design. Originating from a 10-member academic team formed by the Institute of Computing of the Chinese Academy of Sciences in 2008, the company has been exploring the synergies between processor architecture and AI. Operating as a fabless semiconductor company, Cambricon focuses primarily on chip design, leveraging external wafer manufacturers for the production, packaging, and testing of its chips. According to its 2023 interim report, the company’s core competencies lie in the research and development of AI chip products, as well as technological innovation. Its product lineup encompasses cloud-based smart chips and accelerators, training computers, edge computing smart chips and accelerators, terminal smart processor IP, and supporting software development platforms. Chen Tianshi, founder and chairman of Cambricon Technologies, holds a Ph.D. in computer science from the University of Science and Technology of China (USTC). After his graduation in 2010, he went on to serve as a researcher at the Institute of Computing of the Chinese Academy of Sciences, becoming the youngest doctoral supervisor at the institute. One of the company’s most notable collaborations was with Huawei in 2017, when Huawei integrated Cambricon’s A1 processor into its Kirin 970 mobile phone AI chip. However, this partnership did not persist, as Huawei ventured into developing its own chips in 2019. In 2020, Cambricon Technologies made its debut on the Science and Technology Innovation Board, achieving a market capitalization of 100 billion yuan. The company’s total market cap currently stands at 48 billion yuan. Related News: © 2024 China Money Network. All Rights Reserved. Disclaimer: The views, opinions, forecasts, and statements made by our hosts and guests are the personal views of those respective individuals and may or may not be either endorsed or accepted by China Money Network Limited or the companies with which these individuals are employed. "
}