{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.cointribune.com/en/nvidia-breaks-all-records-on-the-stock-market-how-far-will-the-crazy-speculation-around-ai-go/",
    "text": "Home » News » Finance News In just 70 trading days, Nvidia has added $750 billion to its market capitalization. The high-tech company, which specializes in graphics chips and artificial intelligence (AI), is on track to surpass Amazon. In the space of just 10 weeks, Nvidia has achieved a remarkable feat, surpassing the historic performance of most companies: a spectacular increase of $750 billion in its market value. As of the last record on October 31, 2023, the chip maker had a market capitalization of $950 billion. Today, this figure stands at nearly $1.7 trillion, marking an astonishing 79% increase in just 70 days. This dizzying growth translates to an impressive daily average of $10.7 billion increase in stock market value. At this frantic pace, Nvidia could very soon surpass Amazon and become the 5th most valuable public company in the world. How can we explain such a stock market rally? The answer lies in two letters: AI. Indeed, in recent years, Nvidia has established itself as the global leader in chips dedicated to artificial intelligence. With the recent rise of language models like ChatGPT, the demand for its GPUs has grown exponentially. Goldman Sachs, among others, is showing boundless optimism. The investment bank has recently revised its price target for Nvidia upward to $800, banking on a major surge in the company’s profits thanks to AI. It is thus forecasting a 22% increase in profits by 2025. Under these conditions, it is hard not to envision the tech company continuing to push its stock market limits. With the pace of the enthusiasm for AI, new records could quickly be set, despite already very high valuation multiples. Maximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits. Passionné par le Bitcoin, j'aime explorer les méandres de la blockchain et des cryptos et je partage mes découvertes avec la communauté. Mon rêve est de vivre dans un monde où la vie privée et la liberté financière sont garanties pour tous, et je crois fermement que Bitcoin est l'outil qui peut rendre cela possible. The views, thoughts, and opinions expressed in this article belong solely to the author, and should not be taken as investment advice. Do your own research before taking any investment decisions. Receive the latest and best crypto news directly to your inbox in daily, weekly, or special format, to stay updated at your own pace Receive the latest and best crypto news directly to your inbox in daily, weekly, or special format, to stay updated at your own pace "
}