{
    "title": "Weekly AI recap: Nvidia's AI reign challenged, Microsoft's latest earnings \nreport",
    "date": "2/2/2024",
    "url": "https://www.thedrum.com/news/2024/02/02/weekly-ai-recap-nvidia-s-ai-reign-challenged-microsoft-s-latest-earnings-report",
    "text": "Advertisement The Drum Awards for Marketing - Extended Deadline -d -h -min -sec February 2, 2024 | 9 min read Listen to article\n                 \n4 min Plus, AI companies will soon need to submit safety test results with the federal government as part of Biden’s recent Executive Order on Safe, Secure, and Trustworthy Artificial Intelligence. Nvidia’s valuation has skyrocketed in recent years as tech companies clamor for its AI chips. / Adobe Stock Nvidia has long held the generative AI industry in the palm of its hand; many AI companies rely on the chip manufacturer’s graphics processing units (GPUs) in order to train neural networks, and the company’s valuation has skyrocketed as a result. But some big tech companies, weary of Nvidia’s growing monopoly over such a vital and profitable technology, are stepping up their efforts to create alternative chips, The New York Times reported earlier this week. Amazon, for example – which announced plans in September to invest as much as $4bn in AI company Anthropic – has developed the second iteration of its proprietary AI chip, called Trainium. Microsoft and Meta have also unveiled plans to begin developing on their own chips. As the Times article points out, however, Nvidia’s huge head start and momentum in the AI chip industry will make it difficult for other big tech companies to viably compete anytime in the near future. Advertisement In its earnings report for the final quarter of 2023, published on Wednesday, computing giant Microsoft showed that its ongoing investments in AI are bearing fruit – but also continuing to generate significant costs. \"We’ve moved from talking about AI to applying AI at scale,\" Microsoft chief executive officer Satya Nadella said in a statement. \"By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains across every sector.” The company's total revenue for Q4 of last year grew by around 18% (compared to the same time period in 2022) to $62b, a figure which slightly exceeded average analyst estimates, Reuters reports. Microsoft chief financial officer Amy Hood also said during a call with investors that the company expects “capital expenditures to increase materially on a sequential basis driven by investments in our cloud and AI infrastructure.” Microsoft hit a $3t valuation last week and has taken Apple’s place as the company with the highest market cap in the world. Advertisement Following the October signing of the Executive Order on Safe, Secure, and Trustworthy Artificial Intelligence, officials from the Biden White House met on Monday to discuss plans for requiring AI companies to submit results from safety – or “red-teaming” – tests, the Associated Press reports. The executive order was based upon the 1950 US Defense Protection Act, which gives the president broad authority to intercede in domestic industry in the face of a national security threat. The executive order mandated that the National Institute of Standards of Technology – part of the US Department of Commerce – develop a standard framework for analyzing the safety of AI systems developed by private companies. Catch up on the most important stories of the day, curated by our editorial team. See the best ads of the last week - all in one place. Learn how to pitch to our editors and get published on The Drum. The Italian Data Protection Authority, also known as Garante, has determined that ChatGPT-creator OpenAI has breached the European Union’s Global Data Protection Regulation (GDPR) law. The watchdog temporarily banned ChatGPT in Italy in March of last year, based on a determination that OpenAI did not have legal authority to glean personal data to train the large language model behind ChatGPT and also citing concerns about the lack of effective age restrictions on the platform. Garante announced in a statement on Monday that “based on the outcome of its fact-finding activity” it had concluded that OpenAI had violated “the provisions contained in the EU GDPR.” The watchdog has given OpenAI a period of 30 days to submit counterarguments. “We believe our practices align with GDPR and other privacy laws, and we take additional steps to protect people’s data and privacy,” OpenAI said in a statement following this week's announcement from Garante. “We want our AI to learn about the world, not about private individuals. We actively work to reduce personal data in training our systems like ChatGPT, which also rejects requests for private or sensitive information about people.” WPP, one of the biggest ad gency holding companies in the world, announced a plan during a Capital Markets Day event in London earlier this week to invest more than $316m in AI. “AI is transforming our industry and we see it as an opportunity, not a threat,” said WPP CEO Mark Read. “We are already empowering our people with AI-based tools to augment their skills, produce work more efficiently and improve media performance, all of which will increase the effectiveness of our work.“ Like much of the marketing industry, WPP hit some financial roadblocks in 2023 as tech clients cut back on spending. The holding company hopes that its investments in AI will lead to a more secure footing in the future, but its forecasted revenue growth for 2024 is iimited to 1%. The US Federal Communications Commission (FCC) announced earlier this week that it’s preparing to crack down on automated phone calls that have been created with the use of AI. The news follows an incident from New Hampshire last week in which residents received a call from an AI-generated voice clone of President Biden encouraging them not to vote in the state’s primary election. The state’s attorney general’s office has launched an investigation into the calls. The FCC's ban proposal, which will reportedly be voted upon within the next few weeks, would be part of the 1991 Telephone Consumer Protection Act (TCPA), an amendment to the 1934 Communications Act which, among other things, prohibits the use of an “artificial or prerecorded voice” directed towards residential phones “to deliver a message without the consent of the called party.” For more on the latest happenings in AI, web3 and other cutting-edge technologies, sign up for The Emerging Tech Briefing newsletter. © Carnyx Group Ltd 2022 | The Drum is a Registered Trademark and property of Carnyx Group Limited. All rights reserved. "
}