{
    "title": "Nvidia Sets Sights On $30 Billion Custom Chip Market With Dedicated \nBusiness Unit",
    "date": "2/11/2024",
    "url": "https://news.abplive.com/technology/nvidia-30-billion-usd-custom-chip-market-chatgpt-microsoft-alphabet-meta-openai-1663652",
    "text": "Nvidia is establishing a new business unit dedicated to crafting custom chips for cloud computing firms and others, including advanced artificial intelligence (AI) processors, according to nine sources familiar with its plans who spoke to Reuters. The leading global designer and supplier of AI chips aims to seize a share of the rapidly growing market for bespoke AI chips and protect itself from the increasing number of companies exploring alternatives to its products. Based in Santa Clara, California, the company currently dominates around 80 per cent of the high-end AI chip market, contributing to a 40 per cent increase in its stock market value this year, reaching $1.73 trillion, following a more than tripled value in 2023. Nvidia's clients, such as OpenAI (creator of ChatGPT), Microsoft, Alphabet, and Meta Platforms, have been swift to acquire its chips to compete in the emerging generative AI sector. While its H100 and A100 chips serve as versatile, all-purpose AI processors for major clients, these companies are now developing their own internal chips tailored to specific requirements. This approach not only aids in reducing energy consumption but also has the potential to lower costs and accelerate the design process. Nvidia does not publicly disclose the prices of its H100 chips, which surpass those of the previous-generation A100. However, individual chips can be sold for $16,000 to $100,000, depending on factors such as volume. Meta aims to acquire a total of 350,000 H100 chips this year. Sources familiar with the matter revealed that Nvidia representatives have engaged in discussions with Amazon.com, Meta, Microsoft, Google, and OpenAI regarding the production of custom chips for these companies. Based on projections by Alan Weckel of research firm 650 Group, the data center custom chip market is expected to reach up to $10 billion this year and is anticipated to double by 2025. Charles Shi, an analyst at Needham, notes that the broader custom chip market, valued at around $30 billion in 2023, constitutes approximately 5 per cent of the total annual global chip sales. "
}