{
    "title": "Congressional Corruption: Pelosi Profits from Shady Nvidia Stock Trading",
    "date": "2/7/2024",
    "url": "https://www.themainewire.com/2024/02/congressional-corruption-pelosi-profits-from-shady-nvidia-stock-trading/",
    "text": "Former Speaker of the House Rep. Nancy Pelosi (D-California) has made staggering profits off of some suspect tech trading, according to her financial disclosures and a market analysis by Unusual Whales. [RELATED: Congressional Investments for 2023 Released Shows Huge Gains for Tech Investors, Suspicious Trades from Some…] Unusual Whales, a company that allows subscribers to see the flow of options trades in the stock market, has been tracking the trades of Members of Congress for years. Dozens of Members of Congress appear to have remarkably good luck or expert timing when it comes to making big money with unusual stock market bets. Either that, or they’re trading on insider knowledge that they have early or exclusive access to because of their positions in government. Pelosi stands out as the top congressional stock shark. “She has added now four times her Congressional salary in 73 days on one trade,” Unusual Whales said on X. BREAKING: Nancy Pelosi has made over $1,060,000 on her $NVDA trade.She has added now four times her Congressional salary in 73 days on one trade.Her Nvidia deep ITM call option is now up almost 53% since she entered two months ago.See her portfolio on Unusual Whales. pic.twitter.com/EU1rlh3wwL Unusual Whales has long advocated for a ban on Members of Congress trading stocks and options. Pelosi has been a consistent subject of interest for Unusual Whales because of her many suspicious trades, which have allowed her to profit off of the wars in Ukraine and Israel, as well as her foreknowledge of trade regulations. Recently, Pelsoi has made significant profits from trading stocks in Nvidia, a tech company which produces various types of advanced chips. In 2022, Pelosi came under heavy scrutiny after trading millions of dollars worth of Nvidia stocks shortly before voting on a bill concerning semiconductors. Nvidia is the largest semiconductor company in the world. After the negative attention from that trade, Pelosi sold all of her Nvidia stocks. In 2023, however, Pelosi got back to her suspicious trading, re-investing in Nvidia shortly before the Biden Administration announced a law which would allow Nvidia to avoid export regulations — excellent news for Nvidia shareholders. Since re-investing, Pelosi has made $1,060,000 on her Nvidia trades in fewer than 80 days, making nearly quadruple her congressional salary from just her Nvidia trade. When all of Pelosi’s trades are taken into account, her stock portfolio has reached a record high, with an 84.3 percent annual return on investments. BREAKING: Nancy Pelosi’s portfolio, once again, has hit a new all time high.She is up 84.30%.This year alone, her positions have made over three million in gains. pic.twitter.com/82qfXTyeVN In 2024, Pelosi has already made over $3 million in profits from her stock trading. Pelosi has previously defended her trading by citing the “free market” despite the grave concern of conflicting interests when her stocks can profit off of her own voting. Seamus Othot is a graduate of The Thomas More College of Liberal Arts, where he was able to spend his time reading the great works of Western Civilization.  Δ  Δ They all.become millionaires, look into Pingree, King,Collins and Golden to see how much their wealth has increased since being in DC. Money whore! Sign up to get Maine Wire delivered directly to your inbox: \n\nFirst Name\n\n\nEmail First Name  Sign up to get Maine Wire delivered directly to your inbox: \n\nFirst Name\n\n\nEmail First Name  Type above and press Enter to search. Press Esc to cancel. Login below or Register Now. Already registered? Login. A password will be e-mailed to you. "
}