{
    "title": "Author Lawsuit Accuses Nvidia of Copyright Infringement",
    "date": "3/10/2024",
    "url": "https://www.pymnts.com/artificial-intelligence-2/2024/author-lawsuit-accuses-nvidia-of-copyright-infringement/",
    "text": "Nvidia is the latest AI-centric company to become the target of a copyright lawsuit. The firm, whose chips help power artificial intelligence (AI) applications, has been sued by a trio of authors accusing the company of using copyrighted books without their consent to train its NeMo AI platform, Reuters reported Sunday (March 10). According to the report, writers Brian Keene, Abdi Nazemian and Stewart O’Nan said their books were part of a dataset of about 196,640 works that helped train NeMo to simulate normal written language, before being pulled in October “due to reported copyright infringement.” The suit argues that the fact that the books were removed amounts to an admission by Nvidia that it trained NeMo on the dataset, and thus infringed their copyrights. The authors seek unspecified damages for people in the United States whose copyrighted works helped train NeMo’s large language models (LLMs) in the last three years, Reuters said. A spokesperson for Nvidia declined to comment when reached by PYMNTS. The proposed class-action suit is the latest in a series of such litigation aimed at AI companies. In December, a group of 11 authors joined a suit against ChatGPT maker OpenAI and its partner Microsoft, accusing the companies of copyright infringement. That month also saw The New York Times file its own copyright infringement lawsuit against OpenAI and Microsoft, alleging that the tech companies used its content without consent to develop their AI products. Reached by PYMNTS at the time, an OpenAI spokesperson said the company respects the rights of content creators and owners and is “committed to working with them to ensure they benefit from AI technology and new revenue models.” Meanwhile, Nvidia is on the verge of overtaking Apple as the world’s second-most valuable company as the AI industry continues to grow, fueling the firm’s position as the undisputed leader of the AI chip market, of which it commands an 80% share. “This dominance has translated into a valuation leap,” PYMNTS wrote last week. “The company’s worth ballooned from $1 trillion to over $2 trillion in nine months — a feat that has seen it overtake Amazon, Google’s parent company Alphabet and Saudi Aramco.” On Friday, Nvidia’s market capitalization was approaching the $2.38 trillion mark, putting it $230 billion shy of Apple and $645 billion behind the leader, Microsoft. We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}