{
    "title": "Stocks climb, yields fall as data supports rate cut bets",
    "date": "3/1/2024",
    "url": "https://www.marketscreener.com/quote/stock/NVIDIA-CORPORATION-57355629/news/Stocks-climb-yields-fall-as-data-supports-rate-cut-bets-46076993/",
    "text": "Log In   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België)   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België) * S&P 500, Dow higher, Nasdaq out front, up more than 1%  * Treasury yields fall  * US manufacturing slumps further in February NEW YORK, March 1 (Reuters) - A global equity index rose\nand Treasury yields fell on Friday after weak U.S. economic data\nand comments from Federal Reserve officials bolstered\nexpectations for interest rate cuts later this year. The Institute for Supply Management (ISM) said its\nmanufacturing PMI fell to 47.8 last month from 49.1 in January,\nthe 16th straight month that the PMI remained below 50. This\nindicates contraction in manufacturing. The University of Michigan surveys of consumers showed all\nthree measures for sentiment, current conditions and consumer\nexpectations falling more than expected. Also on Friday, Fed Governor Chris Waller kindled hopes for\nlower interest rates, saying decisions about the ultimate size\nof the Fed balance sheet has no bearing in its inflation fight\nrate policy. On Thursday, U.S. personal consumption expenditures (PCE)\nreport came in in-line with expectations and showed annual\ninflation growth the smallest in three years. \"When you take all of it together, you're seeing the\nbalance tilting a little bit more toward the likelihood of there\nbeing more rate cuts, which has supported equities,\" said Sinead\nColton Grant, chief investment officer at BNY Mellon Wealth\nManagement. She also said equities drew support from a stronger than\nexpected earnings season and enthusiasm about artificial\nintelligence. A note of caution came from Richmond Federal Reserve\nPresident Thomas Barkin, who said U.S. price pressures still\nexist and it is too soon to predict when the Fed will cut rates. On Wall Street at 02:53 p.m. EST (1953 GMT) , the Dow Jones Industrial Average rose 80.25 points,\nor 0.21%, to 39,076.64, the S&P 500 gained 41.05 points,\nor 0.81%, to 5,137.32 and the Nasdaq Composite gained\n198.67 points, or 1.23%, to 16,290.60. On Thursday, the Nasdaq closed at a record high for the\nfirst time in more than two years, spurred by gains in AI-linked\nstocks such as chip designer Nvidia and others. MSCI's gauge of stocks across the globe rose\n5.94 points, or 0.78%, to 767.22. The STOXX 600 index\nhad closed up 0.6%. Earlier, Eurostat figures published showed inflation\nacross the 20-nation euro zone also eased to 2.6% in February\nfrom 2.8% a month earlier. Global factory surveys on Friday showed manufacturing output\nhad continued to fall in both Europe and Asia. Earlier, in Asia, Japan's Nikkei index jumped 1.9%\nto hit a fresh all-time high, extending a surge of 7.9% the\nprevious month when it breached levels last seen in 1989. In U.S. Treasuries, the two-year yield fall sharply after\nthe manufacturing data and Waller's suggestion of the need for\nmore shorter-dated Treasuries. The 2-year note yield, which typically moves\nin step with interest rate expectations, fell 11.9 basis points\nto 4.5271%, from 4.646% late on Thursday. The yield on benchmark U.S. 10-year notes\nfell 6.8 basis points to 4.184%, from 4.252% while the 30-year\nbond yield fell 4.4 basis points to 4.3313% from\n4.375%. In currencies, the dollar gained against the Japanese yen\nafter Bank of Japan (BOJ) governor Kazuo Ueda said it was too\nsoon to declare victory on inflation, but the dollar was down\nagainst the euro. Against the Japanese yen, the dollar strengthened\n0.07% to 150.09 yen. The dollar index, which measures the\ngreenback against a basket of major currencies, fell 0.23% to\n103.88, while the euro was up 0.33% at $1.0839. In cryptocurrencies, bitcoin was up 1.28% at $62,231 after\nhitting a more than two-year high of $63,933 on Wednesday. In commodities, oil prices settled higher as traders awaited\nan OPEC+ decision on supply agreements for the second quarter\nwhile they weighed U.S., European and Chinese economic data. U.S. crude settled up 2.2% at $79.97 a barrel and\nBrent finished at $83.55 per barrel, up 2% on the day. In metals, gold started the month on a positive note, with\nprices rising to a two-month high the muted economic data. Spot gold added 2.07% to $2,085.49 an ounce. (Additional reporting by Sinead Carew in New York, Naomi\nRovnick in London and Stella Qiu in Sydney; Editing by Emelia\nSithole-Matarise, Josie Kao and David Gregorio)  0 selected NVIDIA Corporation : Silicon Valley wants to break Nvidia's CUDA software monopoly March 27, 2024 at 10:55 am EDT NVIDIA: What's in store for AI Woodstock? Nvidia launches an AI woodstock  Currency / Forex Commodities Cryptocurrencies Best financial portal +951% of historicalperformance More than 20 yearsat your side +     \n                    \n    950,000\nmembers Quick & easycancellation Our Expertsare here for you OUR EXPERTS ARE HERE FOR YOU Monday - Friday 9am-12pm / 2pm-6pm GMT + 1 "
}