{
    "title": "Why Bank of America Thinks Nvidia’s Explosive Rally Isn’t Over Yet - WSJ",
    "date": "3/14/2024",
    "url": "https://www.breakinglatest.news/business/why-bank-of-america-thinks-nvidias-explosive-rally-isnt-over-yet-wsj/",
    "text": "“BoFA Securities Believes Nvidia Stock Could Reach New Heights Despite Soaring Prices” Despite Nvidia Corp. (NVDA) shares increasing by more than 80% this year, some investors may be hesitant to buy the stock. However, according to BoFA Securities analyst Vivek Arya, there are several factors that could potentially propel the stock even further. One key factor that Arya points to is Nvidia’s relative weighting in the fund, which is lower than other large information technology companies. He believes that Nvidia has the potential to grow nine times as fast as its peers. Additionally, while the stock currently trades at 37 times forward earnings, Arya notes that this valuation multiple is lower than it was in November 2022, when it was 44 times – a time when interest in artificial intelligence (AI) surged with the creation of ChatGPT. Nvidia will be hosting its annual GPU Technology Conference (GTC) soon, and Arya anticipates that this event will shed more light on the company’s vast market opportunities. One such opportunity is Nvidia’s potential to aid in upgrading computing infrastructure to support accelerated computing, with the company projecting the installed base of data centers to reach $1 trillion. This shift from general-purpose to accelerated computing is expected to double over the next five years. Arya has raised the price target on Nvidia stock to $1,100 from $925, while maintaining a buy rating. If the stock reaches this new level, Nvidia’s market capitalization would be $2.75 trillion, surpassing Apple Inc.’s current market value. Another BoFA Securities analyst sees roughly 30% potential upside for Nvidia’s stock price. Overall, despite the significant increase in Nvidia’s stock price, BoFA Securities remains optimistic about the company’s future prospects and believes that there are multiple factors that could continue to drive the stock to new heights.     Save my name, email, and website in this browser for the next time I comment.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More "
}