{
    "title": "Nvidia Partner Sets Up After Massive AI Rally As Funds Pour In",
    "date": "3/21/2024",
    "url": "https://emeatribune.com/nvidia-partner-sets-up-after-massive-ai-rally-as-funds-pour-in/",
    "text": "Adopting artificial intelligence tools in chip design gave Synopsys (SNPS) wings in 2023. After a massive AI rally, the Nvidia (NVDA) partner is in a buy range again, making Synopsys today’s selection for IBD 50  Growth Stocks To Watch. X Synopsys’ buy range goes up to 602.46 from a buy point of 573.77. Shares also are finding support at the 10-week moving average, according to the chart tools on IBD MarketSurge. Sales and earnings growth have been steady over the past eight quarters, giving Synopsys stock a place on the IBD Long Term Leaders list. Revenue grew 21% to $1.6 billion while earnings of $3.56 a share climbed 36%. Shares broke out ahead of earnings and gapped up on Feb. 22 after first-quarter results. The stock then pulled back to the 50-day moving average before rising past its buy point again. Year to date, Synopsys stock has gained more than 16%, compared with 10% for the S&P 500. In 2023, the electronics design automation leader jumped more than 60%, more than double the S&P 500’s 24% rise. Mutual funds own 58% of outstanding shares of Synopsys. A rising number of funds have been net buyers of Synopsys stock over the past seven quarters. Recent purchases by mutual funds have given the stock an Accumulation/Distribution Rating of B. The Artisan Mid Cap Fund (ARTMX) and the MFS Growth Fund (MFEGX) hold shares of Synopsys stock. EMEA Tribune is not involved in this news article, it is taken from our partners and or from the News Agencies. Copyright and Credit go to the News Agencies, email [email protected] Follow our WhatsApp verified Channel Concerns around recession risks also boost the case to own debt, with traders betting global central bankers may have to aggressively cut rates to bolster […] By David Lawder and Susan Heavey WASHINGTON (Reuters) -President Joe Biden’s proposed tax credits for certain home buyers and sellers could help boost the nation’s […] (Bloomberg) — A rout in Chinese stocks listed in Hong Kong intensified Monday, pushing their discount to mainland peers to the deepest in fifteen years […] The EMEA Tribune was founded in March 2020  by DJ Kamal Mustafa. Our aim is to be the primary portal for the Middle East, Africa, Europe, and Pakistan news, and our target audience is all those communities of readers living in and around the region that care deeply for its fate. EMEA TRIBUNE is known for its “Investigative Journalism” where we publish exclusive stories from investigative to trending and that’s how we make it viral for everyone. We have been featured in News Blogs and International Media is also quoting us and publishing our report. A video has recently surfaced from the Dangar Algar region of Afghanistan. It shows members… The recent Gwadar attack exposes a troubling pattern: so-called \"missing persons\" turning up as terrorists.… On March 24, 2023, Lieutenant General Babar Iftikhar, the Corps Commander of Karachi, visited the… Donald Lu, the Assistant Secretary of State for South Asia, has categorically refuted claims that… "
}