{
    "title": "Innodisk Showcases Edge AI Integration at NVIDIA GTC",
    "date": "3/18/2024",
    "url": "https://finance.yahoo.com/news/innodisk-showcases-edge-ai-integration-040800802.html",
    "text": "SAN JOSE, Calif., March 19, 2024 /PRNewswire/ -- Innodisk, a leading global AI solution provider, is demonstrating its edge AI integration expertise at NVIDIA GTC in San Jose, USA. Innodisk specializes in integrating and developing customizable AI solutions that can be scaled across various industries. The company actively shares its research and practical implementation of edge AI with industries worldwide, showcasing how its camera modules integrate with NVIDIA's specialized AI visual technology. Advancing Smart Factory Solutions At GTC, Innodisk is presenting smart manufacturing solutions powered by NVIDIA Metropolis for Factories technology, featuring AOI defect detection. The demonstration highlights the EV2U-SGR1 low-light USB camera module's ability to enhance smart factory efficiency by overcoming dim lighting constraints. This module's unique lens specifications and customized 3A functions (auto-focus, auto-exposure, auto-white balance) ensure clear product detail capture and precise quality inspection, even in low-light conditions common in manufacturing environments. Additionally, its application extends to safety and security, enabling comprehensive and accurate factory monitoring for enhanced safety. \"The AI tools and frameworks from NVIDIA drive innovation, complemented by Innodisk's customer-focused approach and deep integration experience, transforming AI into practical solutions,\" explained Randy Chien, Chairman of Innodisk. \"This customer-centric approach is key to bridging advanced AI technology with real-world industry solutions.\" The AI applications Innodisk is showcasing at GTC use key development tools from the NVIDIA AI Enterprise, an end-to-end, cloud-native software platform. This includes the NVIDIA TAO Toolkit for model training, the NVIDIA Triton Inference Server for model deployment and management, and the DeepStream SDK for AI inference, all packaged as microservices that can be controlled by intuitive REST-APIs. NVIDIA AI Enterprise accelerates data science pipelines and streamlines the development and deployment of production-grade AI applications. This strategic adoption enabled significant savings in validation and facilitated highly flexible end-to-end customization services. Responding to the growing demand for edge AI hardware, Innodisk is showcasing industrial-grade SSDs, memory products, and expansion modules at GTC. It emphasizes the durability and adaptability of its products, essential for maintaining edge AI system operations. By integrating Aetina's AI equipment and leveraging group resource integration, Innodisk empowers customers' AI applications to meet diverse industry demands. Visit Innodisk at booth 338 during GTC to explore the company's customizable AI solutions. For more information, please visit: http://www.innodisk.com View original content to download multimedia:https://www.prnewswire.com/apac/news-releases/innodisk-showcases-edge-ai-integration-at-nvidia-gtc-302092365.html SOURCE Innodisk Corporation "
}