{
    "title": "Top Stock Market Highlights of the Week: US Federal Reserve, Nvidia, Apple \nPartners with Google, and Singtel",
    "date": "3/22/2024",
    "url": "https://thesmartinvestor.com.sg/top-stock-market-highlights-of-the-week-us-federal-reserve-nvidia-apple-partners-with-google-and-singtel/",
    "text": "Welcome to this week’s edition of top stock market highlights. The US Federal Reserve has left its benchmark federal funds rate unchanged in the range of 5.25% to 5.5%. This was the fifth consecutive meeting where interest rates were held steady. However, the central bank now expects just three rate cuts before 2025, down from the initial four that were projected. Officials need more data to boost their confidence that inflation is moving towards the 2% target before they take action to cut interest rates. In addition, the Federal Reserve intends to reduce its balance sheet by as much as US$95 billion per month. With the central bank in no hurry to cut rates until they obtain affirmation that inflation is declining, traders have pencilled in a possible rate cut happening only in June. This plan, also known as the “dot plot”, is still subject to change depending on incoming data, with nothing written in stone for now. Nvidia has done it once again. The world’s most valuable chipmaker and the inventor of the graphics processing unit (GPU) showed off its latest chip, Blackwell, at its GTC conference in California. This chip is multiple times faster at handling the models that underpin artificial intelligence (AI). Blackwell chips represent the next step in the evolution of chip design and contain 208 billion transistors. Its predecessor Hopper had already ignited huge demand as it formed the basis for companies to build their AI capabilities. Jensen Huang, co-founder of Nvidia, believes that Blackwell chips will help to power the new AI industrial revolution. No mention was made of the pricing for this new generation of chips but Hopper has retailed for around US$30,000 to US$40,000. In addition, Blackwell can also link with other chips and has a new way of crunching AI-related data that speeds up the process. Exciting days are ahead as Blackwell ups the ante for AI tasks, going from simple ones such as recognising speech or creating images to generating three-dimensional video or speaking directly with a computer. With higher computation requirements for such tasks, Nvidia should see higher demand from major technology companies such as Meta Platforms (NASDAQ: META), Microsoft (NASDAQ: MSFT) and Amazon (NASDAQ: AMZN). Apple is reportedly in talks with Alphabet’s (NASDAQ: GOOG) Google to build its Gemini AI engine into the iPhone. The two technology giants are in talks to allow Apple to license Gemini to power some of the new features on the iPhone this year. If a deal is forged, it would provide Gemini with billions of potential users. On the flip side, this deal will also signal that Apple is not as advanced as people had expected. Although Apple has tested its large language model (LLM), which is the technology behind generative AI, its technology remains inferior to Alphabet and other competitors. If Alphabet manages to ink a deal with Apple, it will be a major coup for the former’s AI efforts and help Gemini to become the main AI engine for Apple’s devices moving forward. It is also possible that a deal may not be agreed upon and Apple may approach multiple partners to licence their AI or LLM models. Speaking of GPUs, Singtel is launching a new business line called GPU-as-a-service in Singapore and Southeast Asia in the third quarter of this year. This division will be powered by GPUs from Nvidia. The news comes as Singtel signed a memorandum of understanding with Nvidia back in January 2024. The telco also joined Nvidia’s Partner Network Cloud programme which affords it priority access to some of the chipmaker’s popular products. Singtel will use Nvidia’s H100 Tensor Core GPU-powered clusters for its GPU-as-a-service that operate in upgraded data centres in Singapore. Meanwhile, the telco will also be the first in the world to deploy Nvidia’s new Blackwell chips that promise to deliver real-time LLM inference that is 30 times faster than its predecessor. Singtel’s newly launched regional data centre brand Nxera aims to deploy more than 100 MW of next-generation sustainable AI-ready data centres through this brand in the next three years. These developments look promising for the blue-chip telco as it seeks to build a new revenue stream for the group. Are we really ready to live in a world with AI that could potentially take over our jobs? Check out our latest Special Free Report on this fascinating topic. We cover the latest developments in AI and how they could impact your life and investments. Click here to download a copy now. Follow us on Facebook and Telegram for the latest investing news and analyses! Disclosure: Royston Yang owns shares of Apple, Meta Platforms and Alphabet. Type above and press Enter to search. Press Esc to cancel. "
}