{
    "title": "3 Best ETFs for Nvidia Stock Bulls",
    "date": "3/7/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/indices/SRIT/pressreleases/24628020/3-best-etfs-for-nvidia-stock-bulls/",
    "text": "Nvidia (NVDA) has been among the hottest tech stocks in the world in the past year, as analysts are extremely bullish on the artificial intelligence (AI) megatrend. A semiconductor giant, Nvidia designs and sells chips used to run the data centers that power AI models, such as ChatGPT. Due to a massive surge in demand for these specialized chips, Nvidia increased its revenue from $26.9 billion in fiscal 2023 to $60.9 billion in fiscal 2024 (which ended in January). Its asset-light model also meant Nvidia could more than triple its adjusted earnings per share (EPS) in the last four quarters. Given its rapid growth, NVDA stock has returned a staggering 517% since the start of 2023. Its recent gains mean Nvidia stock has now surged by a monstrous 19,710% in the past decade. Nvidia is now the third-largest company in the U.S., and trades at a market cap of $2.1 trillion. The stock’s market-crushing returns may indicate that Nvidia trades at a lofty valuation, and could pull back significantly. Valued at 20.7 times forward sales and 39 times forward earnings, NVDA stock might seem expensive. But analysts expect adjusted earnings per share to surge by 33.2% annually in the next five years, which is exceptional considering its size. Out of the 39 analysts covering Nvidia, 34 recommend “strong buy,” two recommend “moderate buy,” and three recommend “hold.” The average target price for NVDA stock is $838.93, which is a discount of 7% to the current trading price. One way to gain exposure to Nvidia stock is by investing in exchange-traded funds (ETFs) that also hold shares of several other related companies. This strategy lowers your risk significantly relative to a single-stock investment, and offers diversification. Here are three of the best ETFs for Nvidia stock bulls. The VanEck Semiconductor ETF (SMH) tracks the performance of the 25 largest semiconductor stocks listed in the U.S. Semiconductors are a crucial component of modern computing, required to manufacture a wide range of devices - such as smartphones, computers, and calculators. As new connected devices are introduced every year, semiconductor chips will remain in demand, making the SMH ETF a top investment option right now. With over $17 billion in assets under management, the SMH ETF has returned over 1,000% to shareholders in the last 10 years, after accounting for dividends. Nvidia is the top holding of the SMH ETF, and accounts for 26.2% of the fund. Other top SMH holdings include Taiwan Semiconductor (TSM), Advanced Micro Devices (AMD), Broadcom (AVGO), and ASML (ASML). The Global X Robotics & Artificial Intelligence ETF (BOTZ) invests in companies that are positioned to benefit from the adoption of AI, robotics, and automation. The ETF was launched in 2016, and has since returned 128% to shareholders, while managing $2.7 billion in total assets. With a management fee of 0.68%, the ETF is quite expensive compared to other passive funds. Nvidia is the top holding of the BOTZ ETF, as well, accounting for 21.5% of the fund. Up next in the BOTZ top 5 are Intuitive Surgical (ISRG), ABB Ltd (ABBNY), Keyence (KYCCF), and UiPath (PATH). The final ETF on my list is the iShares Robotics and Artificial Intelligence ETF (IRBO). The futuristic ETF was launched in 2018, and manages less than $700 million in total assets. Since its launch, the ETF has returned about 54% to shareholders, much lower than the 354% returns generated by the SMH ETF in this period. Unlike SMH and BOTZ, the IRBO ETF is equal-weighted, which further minimizes stock-specific risk. Nvidia accounts for just 1.5% of the fund. Other notable IRBO constituents include Arm Holdings (ARM), Microstrategy (MSTR), AMD, DigitalOcean(DOCN), Meta Platforms (META), and Qualcomm(QCOM). All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Futures and Forex: at least 10 minutes delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}