{
    "title": null,
    "date": "3/28/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/NVDA/pressreleases/25156277/which-magnificent-seven-stocks-are-attracting-more-of-the-big-money/",
    "text": "When most people buy a company's shares, it doesn't affect the stock's overall momentum very much. Individual investors are small fish in a big ocean. But there are some big fish whose moves can significantly impact a stock's momentum. Institutional investors include large organizations such as investment firms, insurers, and pension funds. They're sometimes called the \"big money\" because of the massive size of their investments. As you might imagine, institutional investors own major stakes in the so-called \"Magnificent Seven\" stocks. That's to be expected since these are some of the biggest companies in the world. But which Magnificent Seven stocks are attracting more of the big money? Roughly 65.5% of Nvidia's (NASDAQ: NVDA) shares are owned by institutional investors. The big money has moved into the chipmaker more than any other Magnificent Seven stock. Nasdaq's data shows that 2,202 institutional holders have increased their positions in Nvidia based on the latest round of regulatory filings, and another 1,540 decreased their positions in the stock. Although 112 institutional investors exited their positions in Nvidia, 436 initiated new stakes. Amazon(NASDAQ: AMZN) trails close behind Nvidia. Nasdaq reports that 2,545 institutional investors have increased their positions in Amazon, compared to 1,852 who have decreased their positions. Another 440 initiated new positions in the stock, with 119 fully selling their positions. Large investors have also flocked to Alphabet(NASDAQ: GOOG)(NASDAQ: GOOGL). Between the Google parent's class A and class C shares, 3,877 institutional investors increased their positions in the stock, while 3,514 decreased them. According to Nasdaq, 758 institutional investors have initiated new positions in Alphabet, compared to 201 who have exited their positions. Why is the big money flowing to Nvidia, Amazon, and Alphabet? The generative artificial intelligence (AI) boom is almost certainly the top reason. Nvidia's GPUs are the gold standard for training and running AI apps, and Amazon and Alphabet operate cloud platforms where organizations can deploy generative AI apps. Alphabet also has a large language model (Gemini) that ranks among the most powerful in the world. Two other Magnificent Seven stocks are in the middle of the pack for institutional investor interest. Meta Platforms(NASDAQ: META) and Tesla(NASDAQ: TSLA) have attracted a lot of big money, but not to the same extent as Nvidia, Amazon, and Alphabet. Nasdaq's latest numbers show that 1,951 institutional investors have recently increased their positions in Meta, versus 1,503 who decreased their positions. New stakes have been initiated by 418 institutional investors, compared to 108 who exited their positions in the stock. Tesla's institutional ownership is lower than the other Magnificent Seven members. However, 1,627 institutional investors recently increased their stakes in the electric-vehicle maker -- well above the 1,243 who decreased their positions. Also, 336 institutional investors opened new positions in Tesla, with only 140 completely selling their stakes. This leaves Microsoft(NASDAQ: MSFT) and Apple(NASDAQ: AAPL) as the bottom two. The number of institutional investors increasing their positions in Microsoft topped the number decreasing their positions by only a narrow margin -- 2,492 to 2,431. The story was worse for Apple, with 2,571 big investors decreasing their positions in the stock, compared to 2,143 increasing their positions. However, there was some good news for these two tech giants. New positions for Microsoft outgained sold-out positions by 422 to 99. There was a similar ratio for Apple with 396 new positions and 77 sold-out positions. Investing in the same stocks that institutional investors are buying can sometimes be smart. The big money flowing in can push share prices higher. Keep in mind, though, that any data you see about institutional buying and selling reflects past transactions. Institutional investors could have recently soured on a stock they were bullish about previously. All of the Magnificent Seven stocks face risks. Valuations are high for some of them, notably including Nvidia and Microsoft. Growth is slowing for Apple and Tesla, and competition is intense for all seven. However, I think each Magnificent Seven stock has solid long-term prospects. Even if you're a small investor, you could make your own version of big money from any of them if you buy and hold. Should you invest $1,000 in Apple right now? Before you buy stock in Apple, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 25, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keith Speights has positions in Alphabet, Amazon, Apple, Meta Platforms, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Nvidia Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}