{
    "title": "With Tesla Optimus and FigureAI, Big Tech Is Betting Big on AI 2.0. Here's \nHow You Can Invest in the Next AI Boom.",
    "date": "3/9/2024",
    "url": "https://finance.yahoo.com/news/invest-ai-2-0-153000661.html",
    "text": "The AI Boom already arrived. That was made abundantly clear last month when the world’s leading maker of AI chips – Nvidia (NVDA) – reported that its revenues grew more than 260% in the last quarter of 2023 and management said that revenues are set to rise another 230% during this quarter. But, while the mainstream media and most investors are obsessing over the hyperbolic growth happening at Nvidia right now, the most important players in this industry – including Nvidia itself – have moved on to the next big thing: AI 2.0. AI 2.0 is something we’ve been following for a while now. We’ve long felt that it will be the next frontier of AI development and the next wave of major AI growth. InvestorPlace - Stock Market News, Stock Advice & Trading Tips But it is just now hitting its major inflection point. As of last month, we learned that Nvidia itself is betting big on AI 2.0. They aren’t alone. Microsoft (MSFT) – the world’s largest AI company – is betting big on AI 2.0, too. So is OpenAI, the world’s most influential AI startup. And Amazon (AMZN), Tesla (TSLA), Samsung and the world’s richest men, Elon Musk and Jeff Bezos. All of them are pouring millions of dollars into AI 2.0. The next wave of AI has arrived. It is time for you to join these powerful people and bet on AI 2.0 alongside them. So what exactly is AI 2.0? AI 2.0 is the real-world manifestation of AI technologies through humanoid robots. Yes, I’m talking about AI-powered robots like the ones you’ve seen in science fiction movies such as iRobot. Source: Designer GPT It seems like a “pie-in-the-sky” dream that humanoid robots are actually the next wave of AI. But they are. And that wave has already arrived. Tesla is developing a humanoid robot right now called Optimus that can already fold clothes, make eggs, exercise, and dance. The ultimate goal for these robots is for commercial use, but also for manufacturing, warehousing and retail use as well. Say goodbye to labor shortage issues. So what, you might be saying? Tesla sees a world in the not-too-distant future where hundreds of thousands of these robots are everywhere, helping people all across the globe complete menial tasks like cooking, cleaning, organizing, and more. Elon Musk is even on record saying that Optimus could be bigger than Tesla’s core vehicle business over time. He’s not delusional. Or, if he is, then so is Jeff Bezos. The former Amazon founder and CEO is reportedly pouring $100 million through his venture fund into a humanoid robot startup called FigureAI. He clearly sees a bright future for humanoid robots, too. Again, though, he and Musk aren’t alone. Guess who else is investing in FigureAI? Bezos’ old company, Amazon. They’re pouring $50 million into FigureAI. Microsoft is investing in OpenAI, too. They’re committing $95 million to FigureAI. Nvidia is involved, too, with a $50 million investment into FigureAI. So is OpenAI. The ChatGPT creator is already the biggest investor in FigureAI and they’re throwing another $5 million into the firm alongside Microsoft and Nvidia. Intel and Samsung are also reportedly throwing money into FigureAI right now. Folks – the writing is on the wall. You may think of AI-powered humanoid robots as a science fiction concept. But the world’s most powerful companies and people, and the world’s foremost AI innovators, clearly think humanoid robots are the next frontier of AI. They see them as AI 2.0. And they’re dedicating millions of dollars to build AI 2.0 right now. This is the next evolution of the AI Boom. It is happening right now. You need to grab your slice of the pie. Click here to find out how to do that right now with our AI 2.0 stock picks. On the date of publication, Luke Lango did not have (either directly or indirectly) any positions in the securities mentioned in this article. P.S. You can stay up to speed with Luke’s latest market analysis by reading our Daily Notes! Check out the latest issue on your Innovation Investor or Early Stage Investor subscriber site. And if you’ve benefitted from Luke’s recommendations and/or analysis, tell us your story by using the form here to send an email to our contact center, or reach out to us by calling 1-800-219-8592. The #1 AI Investment Might Be This Company You’ve Never Heard Of “America’s Top Trader” Issues A.I. Code Red: Act Now or Miss Out It doesn’t matter if you have $500 or $5 million. Do this now. The post With Tesla Optimus and FigureAI, Big Tech Is Betting Big on AI 2.0. Here’s How You Can Invest in the Next AI Boom. appeared first on InvestorPlace. Related Quotes "
}