{
    "title": "Nvidia (NVDA) is a Great Momentum Stock: Should You Buy?",
    "date": "3/12/2024",
    "url": "https://www.zacks.com/stock/news/2239432/nvidia-nvda-is-a-great-momentum-stock-should-you-buy",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Zacks Equity Research\n                    March 12, 2024 NVDA Quick QuoteNVDA Better trading starts here. You follow Tale of the Tape - edit You follow Zacks Equity Research - edit Zacks Equity Research Tale of the Tape Momentum investing revolves around the idea of following a stock's recent trend in either direction. In the 'long' context, investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades. While many investors like to look for momentum in stocks, this can be very tough to define. There is a lot of debate surrounding which metrics are the best to focus on and which are poor quality indicators of future performance. The Zacks Momentum Style Score, part of the Zacks Style Scores, helps address this issue for us. Below, we take a look at Nvidia (NVDA Quick QuoteNVDA  -  Free Report)    , a company that currently holds a Momentum Style Score of B. We also talk about price change and earnings estimate revisions, two of the main aspects of the Momentum Style Score. It's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Nvidia currently has a Zacks Rank of #1 (Strong Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period. You can see the current list of Zacks #1 Rank Stocks here >>> Set to Beat the Market? Let's discuss some of the components of the Momentum Style Score for NVDA that show why this maker of graphics chips for gaming and artificial intelligence shows promise as a solid momentum pick. A good momentum benchmark for a stock is to look at its short-term price activity, as this can reflect both current interest and if buyers or sellers currently have the upper hand. It's also helpful to compare a security to its industry; this can show investors the best companies in a particular area. For NVDA, shares are up 6.38% over the past week while the Zacks Semiconductor - General industry is up 0.78% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 18.72% compares favorably with the industry's 5.86% performance as well. While any stock can see a spike in price, it takes a real winner to consistently outperform the market. Shares of Nvidia have increased 71.28% over the past quarter, and have gained 273.48% in the last year. On the other hand, the S&P 500 has only moved 11.16% and 34.3%, respectively. Investors should also take note of NVDA's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. Right now, NVDA is averaging 57,676,532 shares for the last 20 days. Earnings Outlook The Zacks Momentum Style Score also takes into account trends in estimate revisions, in addition to price changes. Please note that estimate revision trends remain at the core of Zacks Rank as well. A nice path here can help show promise, and we have recently been seeing that with NVDA. Over the past two months, 15 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost NVDA's consensus estimate, increasing from $19.95 to $23.22 in the past 60 days. Looking at the next fiscal year, 10 estimates have moved upwards while there have been no downward revisions in the same time period. Bottom Line Taking into account all of these elements, it should come as no surprise that NVDA is a #1 (Strong Buy) stock with a Momentum Score of B. If you've been searching for a fresh pick that's set to rise in the near-term, make sure to keep Nvidia on your short list. NVIDIA Corporation (NVDA) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}