{
    "title": "Welcome To 2024. It Promises To Be Quite The AI Ride!",
    "date": "1/4/2024",
    "url": "https://www.forbes.com/sites/karlfreund/2024/01/04/welcome-to-2024-it-promises-to-be-quite-the-ai-ride/",
    "text": "2023 has been a fun year in AI, to say the least. OpenAI and ChatGPT changed nearly everything, and the AI revolution is just beginning. Nvidia will ship somewhere around 2 million H100-class GPUs in 2024, AMD is now shipping the MI300, and Intel Gaudi3 is coming soon! And don’t forget about Cerebras, or Microsoft Azure, or the Google TPU, or the AWS proprietary AI chips, Trainium and Inferentia. Or the dozen or so AI Startups beginning to ship new products in 2024, such as Groq, Samba Nova, D-Matrix, NeuReality, Untether.AI, Tenstorrent, BrainChip, …. Stay tuned to Cambrian-AI, or you might miss something important! Follow us above! The Magic Box of AI AMD Claims MI300X Is The World’s Fastest AI Hardware The hardware looks quite capable, but the software optimization story has a long way to go to get close to Nvidia. But given the current demand/supply imbalance, I suspect AMD can sell all they can make. AMD launched the MI300 in San Jose to an anxious audience of fans and followers. Undoubtedly, the market is ready to give AMD a shot for AI accelerator orders, as this is the only GPU truly competitive with the Nvidia H100. Breaking: AMD Is Not The Fastest GPU; Here’s The Real Data At the MI300 launch, AMD claimed it had significantly better performance than Nvidia. While the AMD chip does look good, and will probably run most AI just fine out of the box, the company did not use the fastest Nvidia software. The difference is enormous. At a recent launch event, AMD talked about the inference performance of the H100 GPU compared to that of its MI300X chip. The results shared did not use optimized software, and the H100, if benchmarked properly, is 2x faster at a batch size of 1. Intel Focuses On AI At Big Event, And For Good Reasons Intel has a multi-prong AI strategy. The company announced the AI PC and Intel Xeon Gen5 with excellent AI performance and TCO. Intel announced new products for desktops and servers, and the focus for both was AI, where Intel has a commanding lead over the competition. Intel’s presentation included over 40 slides out of 70 that mention AI. The venue in New York City was undoubtedly chosen for Wall Street, and the stock is up ~10% since it opened on Thursday. Investors must like what they hear. AI Is Reshaping Chip Design. But Where Will It End? Using AI reduces design costs, improves yields and performance, and shortens time-to-market for better chips. Synopsys, Cadence Design Systems, and many hyperscal chip designers are now adopting generative AI capabilities to facilitate chip design. Think of this as the second generation of AI for EDA. Where might this lead? Every chip is designed with a slew of design and test applications, usually from EDA vendors like Synopsys and Cadence Designs. Qualcomm Makes Its Push For PC Relevance, Leading With AI Qualcomm gave us an end-of-year update on the new Snapdragon X Elite, the company’s bold effort to create an Arm-based PC ecosystem. The future looks bright, especially if Qualcomm can incentivize ISVs to natively port to Arm. Cerebras, 23’s Most Successful AI Startup, Sees A Bright Future With revenue and customer commitments approaching $1B, Cerebras’ Wafer Scale Engine has likely generated more business than all other startup players combined. Needless to say, CEO Andrew Feldman is feeling pretty bullish about 2024. As previously discussed, Cerebras is a shining star in the hardware startup firmament. Companies like Groq are seeing significant market traction, and Tenstorrent has earned some big design wins. Nvidia Improves Performance With 5x Faster AI. Yes, Software Matters. Nvidia’s pre-emptive strike may blunt AMD MI300 news, pointing to the company’s key advantage in AI software. AMD will host a big announcement this week in San Jose, where the company will announce details about its new flagship GPU for generative AI, the MI300. Nonetheless, Nvidia remains confident that its hardware, software and integrated systems will keep the company in the lead. To prove the point, Nvidia announced new benchmarks changing the game. Again. IBM Launches Quantum System Two And A Roadmap To Quantum Advantage IBM announced its path to achieve over 100,000 qubits and over a billion circuit gates. When realized, IBM may create the world’s first platform for universal computation in a quantum system. It sounds like Quantum Nirvana is finally in sight. BackgroundBuilding a practical quantum computer remains elusive to some of the most advanced research teams in the world. Silicon Futures: The state of AI Computing 2023 with Cambrian AI's Karl Freund On the wing are Intel, AMD, Qualcomm,, and newcomers such as Cerebras that are vying to make a dent in Nvidia’s leadership. Then there is generative AI, the catalyst that Karl thinks is the great profit opportunity of our time, and Leonard think is the next big hype a la’ crypto and The Metaverse. Following MSFT & GOOG Lead, AWS Embraces Nvidia And Upgrades Own Chips As expected, Amazon AWS CEO Adam Selipsky announced updated AWS-engineered AI Training and Arm CPU chips to lower the cost of cloud services. But AWS has a problem: they have kept Nvidia at arm’s length to their detriment as Microsoft Azure increases market share. The Good, Bad, And Ugly From Supercomputing ‘23, Or Nearby This year’s event was as much about AI as it was about HPC. The only booths not talking about AI were, well, nobody. Everyone was touting the miracles of AI, from CPUs to accelerators to system companies to networking vendors to storage to clouds to water cooling systems to the U.S. DOE and DOD. Here’s a summary of the good, the bad, and the ugly. Disclosures: This article expresses the opinions of the author and is not to be taken as advice to purchase from or invest in the companies mentioned. My firm, Cambrian-AI Research, is fortunate to have many semiconductor firms as our clients, including BrainChip, Cadence, Cerebras Systems, Esperanto, IBM, Intel, NVIDIA, Qualcomm, Graphcore, SImA,ai, Synopsys, Tenstorrent, Ventana Microsystems, and scores of investors. We have no investment positions in any of the companies mentioned in this article. For more information, please visit our website at https://cambrian-AI.com.  "
}