{
    "title": "Tech and Bitcoin mining: NVIDIA stocks reach new highs thanks to the new \nRTX Remix V0.4",
    "date": "1/23/2024",
    "url": "https://en.cryptonomist.ch/2024/01/23/tech-and-bitcoin-mining-nvidia-stocks-reach-new-highs-thanks-to-the-new-rtx-remix-v0-4/",
    "text": "The technology company from Santa Clara, Nvidia, often associated with the topic of Bitcoin mining, has just released version 0.4 of RTX Remix, which serves as an AI toolkit suite for gaming enthusiasts. The new modding platform is available in open beta, therefore testable by everyone, and aims to add new gameplay features and improve graphic textures. Meanwhile, NVIDIA’s stock hits another record and reaches a new all-time high at $603: many analysts believe that the stock could undergo a similar transformation to what Apple experienced during its recent years of boom. All the details below. Summary Nvidia keeps innovating: the graphics processor development company, often used in the field of Bitcoin Mining, has dropped another bombshell by announcing the release of version 0.4 of the RTX Remix modding platform. This is a technology based on a collection of tools that modders (basically those who modify games) can use by harnessing the power of artificial intelligence to create new images, integrate new resources, and even add some special features like DLSS, Reflex, and ray-tracing. The goal of Nvidia’s RTX Remix is to improve the graphics of games that use DirectX 8 and 9 technologies, aiming to enhance lighting, make textures more detailed, and add new gameplay elements. The technology company from Santa Clara has repeatedly demonstrated its support for the modder community, actively collaborating with them to enable RTX technologies in titles such as Half Life 2 RTX: An RTX Remix Project, Call of Duty 2, Hitman 2: Silent Assassin, Garry’s Mod, Freedom Fighters, Need for Speed Underground 2, and Vampire: The Masquerade – Bloodlines. Currently, Nvidia’s RTX Remix 0.4 is available in open beta version, usable by anyone as a testing phase, and features an updated DXVK implementation, fixing issues related to capture, geometry corruption, stability, and more. In the new version of the platform, improvements have also been introduced in terrain baking performance, perfecting parallax occlusion mapping and anti-culling for in-game lights. It is important to note that RTX Remix does not allow for full game remastering due to copyright constraints. Therefore, mods must be manually added by users. To use the tool, the recommended minimum hardware is an RTX 3060 Ti, while for optimal performance, an RTX 4070 is recommended. The launch of this new product by Nvidia reflects its commitment as an innovator and leader in the chip and graphics card industry, bringing back the focus on gaming and gradually shifting away from speculative attention towards Bitcoin mining. While Nvidia focuses on creating new technologies for its modder audience, in a detached vision from the classic (and primordial) use of graphics cards in the field of Bitcoin mining, its stock price on the Nasdaq reaches new all-time highs. According to a report yesterday by CNBC, analysts at Melius Research believe that the stock could be on the verge of a transformation similar to the one experienced by Apple during its phase of maximum expansion, as it too is focused on the development of software and services. According to them, the company’s growing revenue in this field is reducing volatility and pushing NVIDIA’s stock into a phase of maturity. Investors usually assign a premium to software-related earnings compared to hardware-related earnings, as software sales are generally recurring and more predictable. This change could lead to a “multiple expansion” for Nvidia’s stocks, potentially increasing their value. To underline how Nvidia’s software and services division, which includes the DGX Cloud AI supercomputer, could be able to generate an annualized revenue of $1 billion by the end of fiscal year 2024. This figure is expected to rise to $3 billion within a few years, providing long-term margin support. All these reflections have led Nvidia’s stock quotes to record a market capitalization of 1.47 trillion dollars, second only to Amazon, Alphabet, Saudi Aramco, Microsoft, Apple, and gold. Bitcoin currently has a market capitalization of just over half of NVIDIA’s. Looking at the chart of the stock in question, we notice that the all-time high of $603.3 was reached yesterday at the opening of the US markets at 3:30 PM Italian time, before closing the day’s trading at $596.5. At the time of writing the article, the pre-market indicates an estimated price of $597.90, slightly higher than yesterday’s closing but at the same time lower than its last ATH. The optimism of Nvidia investors continues undisturbed for over a year, during which the stock has recorded a 216% increase, surpassing every record in the Nasdaq stock market. However, in the short term, a slowdown in the explosive trend can be expected, with the daily RSI indicating the possibility of a price contraction. The overall outlook remains largely positive, with bulls eagerly awaiting the financial data for the first quarter of the year to see if the technology company has recorded increased profits. What is most frightening at the moment are the statements of Jim Cramer, an American television personality and host of Squawk on the Street, known for his predictions that always turn out to be completely wrong. In this regard, Jim Cramer recently suggested to his followers to buy Nvidia stock and not sell it anymore due to its bullish potential. This unfortunately changes everything for Nvidia, which could experience a strong retracement after Cramer’s “jinx”. Let's tell the future.\nThe most exclusive news on Bitcoin and cryptocurrencies, trading, fintech, and blockchain. Stay updated on all the news about cryptocurrencies and the entire world of blockchain. © 2023 The Crypto Economist SAGL. All rights reserved "
}