{
    "title": "Why Nvidia stock skyrocketed 239% in 2023",
    "date": "1/11/2024",
    "url": "https://www.fool.com.au/2024/01/11/why-nvidia-stock-skyrocketed-239-in-2023-usfeed/",
    "text": " Access all of your premium services in our Member Centre Click here to learn more about our premium services TO MAKE THE WORLD\nSMARTER, HAPPIER, AND RICHER. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show, and premium investing services. Soaring demand propelled the AI chip maker to blockbuster gains last year. Image source: Getty Images You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More This article was originally published on Fool.com. All figures quoted in US dollars unless otherwise stated. As you probably know by now, Nvidia Corp (NASDAQ: NVDA) was the stock of the year in 2023. The chipmaker, traditionally known for its graphics processing units (GPUs) that have powered industries like gaming, crypto, and autonomous vehicles, has emerged as the clear leader in artificial intelligence (AI) chips as its technology is also well suited to running the kind of deep learning models that programs like ChatGPT require. As a result, Nvidia reported skyrocketing growth throughout the year, which, not surprisingly, drove the stock to towering gains. According to data from S&P Global Market Intelligence, the stock finished 2023 up 239%. As you can see from the chart below, most of those gains came in the first half of the year as the fervour over generative AI reached a fever pitch. ^SPX data by YCharts As you can see from the chart, Nvidia stock steadily moved higher over the first quarter of the year as hype around ChatGPT and new generative AI technologies pushed a wave of tech stocks associated with AI higher. However, it wasn't until Nvidia's first-quarter earnings report in May that investors saw the surge in demand for its chips that had been set off by the launch of ChatGPT. Nvidia beat estimates in the first-quarter report and blew investors away with its guidance, calling for $11 billion in revenue for the second quarter, which compared to the analyst consensus of $7.2 billion. The stock jumped 24% on May 25 on the report, and Nvidia did not disappoint in its next two earnings reports as its momentum only increased. In its second quarter, revenue jumped 101% year over year to $13.5 billion, well ahead of the company's guidance, and net income soared more than 800% to $6.2 billion. In the third quarter, its results were even more impressive as revenue tripled to $18.1 billion and net income reached $9.2 billion, up more than 13 times from the year before. Nvidia delighted investors with a number of new product and partnership announcements at the Consumer Electronics Show, and the stock has continued to gain even as other big tech and AI stocks have stalled. There's still a shortage for Nvidia's products and the company seems to have a wide technological lead over the competition. That should bode well for the stock, and shares look surprisingly affordable at a forward price-to-earnings ratio (P/E) of 27. The AI stock looks like a good bet to keep moving higher in 2024. This article was originally published on Fool.com. All figures quoted in US dollars unless otherwise stated. Motley Fool contributor Jeremy Bowman has no position in any of the stocks mentioned. The Motley Fool Australia's parent company Motley Fool Holdings Inc. has positions in and has recommended Nvidia. The Motley Fool Australia has recommended Nvidia. The Motley Fool has a disclosure policy. This article contains general investment advice only (under AFSL 400691). Authorised by Scott Phillips. March 19, 2024 |\n        Jeremy Bowman Buying Nvidia when the disruptive AI chatbot launched would have been a smart move. Read more » March 19, 2024 |\n        Jeremy Bowman Investors were encouraged by news of a price hike on the Model Y. Read more » March 16, 2024 |\n        Keithen Drury Nvidia last split its stock when it traded for a pre-split $744 in 2021. Read more » March 14, 2024 |\n        Howard Smith Tesla is no longer a magnificent stock, according to a Wells Fargo analyst. Read more » March 14, 2024 |\n        Dani Cook The company's stock could rise 40% over the next two years and outperform the S&P 500. Read more » March 13, 2024 |\n        Will Healy Nvidia stock has split five previous times in the company's history. Read more » March 13, 2024 |\n        Danny Vena Nvidia stock has gained nearly 300% over the past year. Can investors still profit from this AI stock? Read more » March 12, 2024 |\n        Tristan Harrison This stock has rocketed higher. How do we get access to it? Read more » View All Sign Up for Take Stock\nInvestment news, stock ideas, and more, straight to your inbox. Get Started Investing\nYou can do it. Learn about investing with our Investing Education hub. Win at Retirement\nOur latest articles and strategies for the post-work life you want. Listen to Our Podcast\nHear our experts take on shares, the market & how to invest. Join Our Premium Community\nJoin our flagship membership service, Share Advisor. The Motley Fool stands behind our products and our membership-fee-back guarantee. If for any reason you are not 100% satisfied with your premium subscription, simply notify us within the first 30 days and you won't pay a cent. By taking up this offer, you will also be enrolled in our auto-renewal program, which is our way of making your ongoing subscription easier by ensuring uninterrupted service.  Don't worry, though – you're not locked in, and can cancel your auto-renewal at any time before each 'anniversary' date without question or penalty. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. The Motley Fool launched its Australian presence in 2011, and since then has grown to reach over 1 million Australians. Read more about us >  This Service provides only general, and not personalised financial advice, and has not taken your personal circumstances into account. The Motley Fool Australia operates under AFSL 400691. For more information please see our Financial Services Guide. Please remember that investments can go up and down. Past performance is not necessarily indicative of future returns. The Motley Fool Australia does not guarantee the performance of, or returns on any investment. We respectfully acknowledge the Traditional Custodians of the land where we live and work and pay our respects to all Elders, past and present, of all Aboriginal and Torres Strait Islander nations. © 2010 - 2023 The Motley Fool Australia Pty Ltd. All rights reserved. ACN: 146 988 052 Australian Financial Services Licence (AFSL): 400691 The Motley Fool Australia, PO Box 104, Isle of Capri, Qld 4217 Contact Details:\nPhone: (03) 8592 4841\nEmail: [email protected]\nOur friendly customer service team will happily get back to you as soon as they can. Notifications Scott Phillips just released his 5 best stocks to buy right now and you could grab the names of these stocks instantly! "
}