{
    "title": "Why Nvidia Stock Skyrocketed 239% in 2023",
    "date": "1/10/2024",
    "url": "https://www.fool.com/investing/2024/01/10/why-nvidia-stock-skyrocketed-239-in-2023/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More As you probably know by now, Nvidia (NVDA 0.12%) was the stock of the year in 2023. The chipmaker traditionally known for its graphics processing units (GPUs) that have powered industries like gaming, crypto, and autonomous vehicles, has emerged as the clear leader in artificial intelligence (AI) chips as its technology is also well suited to running the kind of deep learning models that programs like ChatGPT require. As a result, Nvidia reported skyrocketing growth throughout the year, which, not surprisingly, drove the stock to towering gains. According to data from S&P Global Market Intelligence, the stock finished 2023 up 239%. As you can see from the chart below, most of those gains came in the first half of the year as the fervor over generative AI reached a fever pitch.  ^SPX data by YCharts As you can see from the chart, Nvidia stock steadily moved higher over the first quarter of the year as hype around ChatGPT and new generative AI technologies pushed a wave of tech stocks associated with AI higher. However, it wasn't until Nvidia's first-quarter earnings report in May that investors saw the surge in demand for its chips that had been set off by the launch of ChatGPT. Nvidia beat estimates in the first-quarter report, and blew investors away with its guidance, calling for $11 billion in revenue for the second quarter, which compared to the analyst consensus of $7.2 billion. The stock jumped 24% on May 25 on the report, and Nvidia did not disappoint in its next two earnings reports as its momentum only increased. In its second quarter, revenue jumped 101% year over year to $13.5 billion, well ahead of the company's guidance, and net income soared more than 800% to $6.2 billion. In the third quarter, its results were even more impressive as revenue tripled to $18.1 billion and net income reached $9.2 billion, up more than 13 times from the year before. Nvidia delighted investors with a number of new product and partnership announcements at the Consumer Electronics Show, and the stock has continued to gain even as other big tech and AI stocks have stalled. There's still a shortage for Nvidia's products and the company seems to have a wide technological lead over the competition. That should bode well for the stock, and shares look surprisingly affordable at a forward P/E of 27. The AI stock looks like a good bet to keep moving higher in 2024. Jeremy Bowman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}