{
    "title": "Nasdaq ekes out gain amid mixed markets",
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/video/nasdaq-ekes-gain-amid-mixed-222820210.html",
    "text": "Markets close mixed with Nasdaq (^IXIC) composite close higher for a third straight day. Energy stocks did not fare well today, with materials also down. Nvidia (NVDA) soars, hitting a record high on Monday. Yahoo Finance’s Jared Blikre breaks down the numbers for the day and weighs in on what contributed to the mixed day. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Eyek Ntekim JOSH LIPTON: Markets closing mixed on the day but well off the lows here. Jared Blikre is here with a look back at today's trade. JARED BLIKRE: That's right, Josh. We got the NASDAQ ending in the green for the third day but wasn't a big gain, as you were noting, up about 9/10 of a percent. And let's just graph the chart, the year-to-date price action so far. Still in the red for the year. The first five days was over yesterday. And that has some negative implications for the rest of the year. But now we're just focused on the rest of January, because that also has some implications for the rest of the year. Dow down 42 basis points. And when we take a look at the sector action, only three-- actually only two in the green, staples and tech. Everything else in the red. Energy was the worst off for the second day in the row, by the way. That's down 1.6% as after that nasty drubbing that crude oil got taken down on yesterday. Materials also down 1%. In the NASDAQ, we do see a little bit of green. And guess what? Nvidia up 1.7%. That is good enough for a record high. This is today's price action. Let me show you over the last year, so we can see we just had a nice break to the upside record high yesterday and some continuation today. So as far as the Mag Seven trade was concerned, some people were worried that, given the first negative price action or given the first negative few days of the year, that was dead. The AI trade back in focus here. But aside from the mega-caps here, we do see a lot more red than green. I can focus on the energy market. You can see it their worst performing sector. You can also see it in the banks. And we're looking ahead to those bank earnings this Friday. So all in all, not the worst day, and also not the best. Let's just call it a mixed-- mixed market. - All right. I like that verdict. Thanks a lot, Jared. Appreciate it. Related Quotes "
}