{
    "title": "Nvidia billionaire Jensen Huang dines with TSMC execs in Taiwan to discuss \nthe great AI chip shortage",
    "date": "1/25/2024",
    "url": "https://fortune.com/2024/01/25/nvidia-billionaire-jensen-huang-dinner-taiwan-tsmc-founder-ceo-semiconductor-ai-chips/",
    "text": "Nvidia Corp. Chief Executive Officer Jensen Huang met with his counterpart at Taiwan Semiconductor Manufacturing Co. this week to discuss AI chip supply constraints, a major challenge to the artificial intelligence boom that got going in 2023. The heads of the world’s two most valuable chip firms met in Taipei over dinner to discuss the Taiwanese firm’s role as producer of the Nvidia chips that now power the majority of generative AI training systems worldwide, Huang told reporters in Taipei. TSMC founder and prominent industry figure Morris Chang also joined Huang’s dinner with CEO C. C. Wei on Wednesday. Huang arrived in Taipei days after embarking on his first visit to mainland China in four years, at a time the US bars the shipment of Nvidia’s highest-end chips to a geopolitical rival. While Nvidia has said little about that low-profile tour, Huang talked openly Thursday about Taiwan and TSMC’s pivotal role in Nvidia’s business as well as the broader semiconductor sector. “The single greatest challenge in AI, of course, is scaling the capacity of AI,” Huang said before heading into his company’s local annual new year celebrations. “And so we’re working very hard, TSMC, all of our supply chain partners here, are working very hard to keep up with the demand.” “This year is going to be a huge year,” he added. Huang declined to answer questions about its China business. The Nvidia chief has previously warned that an escalation in US sanctions, designed to staunch the flow of AI training chips to China, could drive local firms to develop their own alternatives. That could harm American tech leaders in the long run. The billionaire has name-checked Huawei Technologies Co. — which in 2023 alarmed Washington by including an advanced made-in-China processor in a smartphone — as a potential rival. Nvidia, which more than tripled its market value in 2023 thanks largely to its pivotal role in AI development, is up another 24% this year as investors bet on its sector leadership. It’s designed versions of its semiconductors for China that it says are compliant with US restrictions. The AI boom is helping prop up TSMC’s business. Last week, the company projected a potential rise in capital spending and robust revenue growth, helping trigger a sector-wide stock rally. Born in Taiwan, Huang is feted like a celebrity on an island whose economy depends on technology and semiconductors in particular. Local media often feature him checking out his favorite haunts and, this week, broadcast a clip of the executive at a noodle place. Huang on Thursday acknowledged the island’s most critical industry. “It’s a rebirth of the computer industry and that’s why Taiwan is so central to that,” he said. “TSMC, the ecosystem of Taiwan system makers are all going to participate in this new era of computing.” © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}