{
    "title": "Lead times for Nvidia's AI GPUs narrow, suggesting expanded production \ncapacity",
    "date": "2/16/2024",
    "url": "https://www.techspot.com/news/101919-lead-times-nvidia-ai-gpus-narrow-suggesting-expanded.html",
    "text": "Why it matters: Wait times for Nvidia GPUs used in AI applications have narrowed significantly in the past few months, which could be an early sign that growth is peaking. Depending on your view, that can either be good or bad news. In a note to investors, analysts with UBS said lead times – how long a customer has to wait for delivery after placing an order – have come down considerably as of late. Seeking Alpha saw the note and said lead times are now in the 3-4 month range, down from 8-11 months late last year. So, what's happening? The publication highlights two possibilities. Either Nvidia is planning for future production capacity increases to outstrip future orders, or the company is currently shipping products in excess of the orders it has already received. Given the significant drop in lead times in such a short period of time, Seeking Alpha suggests both options are likely. What does it all mean? Well, it somewhat depends on your point of view.  Inching closer to eliminating lead times means Nvidia is also getting closer to the end of its AI boom, and that's something neither Nvidia nor investors want. However, if the decline in lead times is indeed coming from increased production capacity, that means more products are being shipped now and more revenue is being generated – great news for the company and shareholders. At the current rate, it would seem as if Nvidia will work through its backlog of orders in the next two to three quarters. Once that happens, they will only be shipping against new orders and revenue will likely take a bit of a hit. Whatever the case, UBS raised its price target on Nvidia to $850. Earlier this week, if you recall, Morgan Stanley bumped its price target from $603 to $750 per share, which is starting to look conservative. As of writing, Nvidia shares are trading at just over $739, giving the company a higher market cap than both Amazon and Alphabet. Nvidia's quarterly earnings report is due on February 21 after the bell. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}