{
    "title": "Here's Why RTX (RTX) Fell More Than Broader Market",
    "date": "2/28/2024",
    "url": "https://finance.yahoo.com/news/heres-why-rtx-rtx-fell-225012164.html",
    "text": "The most recent trading session ended with RTX (RTX) standing at $89.92, reflecting a -0.55% shift from the previouse trading day's closing. This change lagged the S&P 500's daily loss of 0.17%. At the same time, the Dow lost 0.06%, and the tech-heavy Nasdaq lost 0.55%. Heading into today, shares of the an aerospace and defense company had lost 0.2% over the past month, lagging the Aerospace sector's gain of 2.67% and the S&P 500's gain of 3.98% in that time. Market participants will be closely following the financial results of RTX in its upcoming release. On that day, RTX is projected to report earnings of $1.23 per share, which would represent year-over-year growth of 0.82%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $18.38 billion, up 6.79% from the year-ago period. For the full year, the Zacks Consensus Estimates project earnings of $5.39 per share and a revenue of $78.65 billion, demonstrating changes of +6.52% and +5.7%, respectively, from the preceding year. It's also important for investors to be aware of any recent modifications to analyst estimates for RTX. These latest adjustments often mirror the shifting dynamics of short-term business patterns. Hence, positive alterations in estimates signify analyst optimism regarding the company's business and profitability. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system. The Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has moved 0.27% higher. RTX is holding a Zacks Rank of #3 (Hold) right now. With respect to valuation, RTX is currently being traded at a Forward P/E ratio of 16.78. For comparison, its industry has an average Forward P/E of 17.19, which means RTX is trading at a discount to the group. We can also see that RTX currently has a PEG ratio of 1.65. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Aerospace - Defense industry currently had an average PEG ratio of 1.83 as of yesterday's close. The Aerospace - Defense industry is part of the Aerospace sector. At present, this industry carries a Zacks Industry Rank of 93, placing it within the top 37% of over 250 industries. The Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Don't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report RTX Corporation (RTX) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}