{
    "title": "SMH: Nvidia's Earnings Is Key, But Long-Term Tailwinds Remain Intact",
    "date": "2/19/2024",
    "url": "https://seekingalpha.com/article/4671406-smh-nvidia-earnings-key-but-long-term-tailwinds-remain-intact",
    "text": " Ignatiev Semiconductor stocks have been arguably one of the biggest beneficiaries in the age of AI and the subsequent bull market that followed last year. Nvidia (NVDA) led from the front with its H100 GPUs, which are in extreme demand since ML researchers increasingly use the company’s GPUs to train and deploy AI models. In the last year, many technology companies raced against one another to order Nvidia’s GPUs, while others such as AMD (AMD) and Intel (INTC) also took advantage of demand to launch their own AI-focused compute semiconductor products. The craze for churning out better front-end semiconductor products also spread out more horizontally into the broader space, with semiconductor equipment companies also seeing demand for their infrastructure products. This led to outsized gains in semiconductor stocks and related ETFs, with the VanEck Semiconductor ETF (NASDAQ:SMH) being an example. sa While I recommend buying this ETF due to strong tailwinds still persisting for the semiconductor stocks in this ETF, I also see this ETF as overbought, and I would assign a HOLD rating at the moment. The VanEck Semiconductor ETF is issued by the NYC-based asset management company VanEck. The ETF is designed to track the performance of the MVIS® US-Listed Semiconductor 25 Index. By tracking the index, the fund’s objective is to offer exposure to the semiconductor industry by investing its assets in the 25 most liquid semiconductor companies listed in the U.S. markets. The fund may invest its assets in both U.S.-based semiconductor companies and non-U.S.-based semiconductor companies as long as they are listed in the U.S. The fund’s investment methodology rests on the underlying index characteristics of the MVIS® US-Listed Semiconductor 25 Index, which strives to position itself as a pure-play semiconductor index. Companies that generate at least 50% of revenues from semiconductors will be included in the underlying index. Moreover, liquidity is another crucial goal the index aims to provide. Stocks with an average daily trading volume of >$1Mn over the last three rolling months will be included in the index per semi-annual review. This is one of the key reasons why SMH has one of the highest liquidity metrics when compared to its peers, which we will see in the next section. I have added a chart below that shows the Top 15 Holdings vs. the Constitution of SMH’s Funds by categories. etfdb While the fund generally has a larger allocation of its assets towards front-end semiconductor products such as chips and integrated circuits, a small percentage is also allocated towards semiconductor equipment such as the infrastructure required to manufacture and package semiconductor chips. From the Holdings summary above, it's very evident how the fund is particularly skewed towards its largest holding, Nvidia. The weights of the other assets in SMH also indicate that the fund’s assets may be more concentrated, as can be verified in the chart below. Here is how SMH compares with some of its peers. The list below is ordered by largest-to-smallest fund in terms of Assets Managed. Author When comparing SMH with its largest peer, SOXX, I see that SMH has been resoundingly outperforming SOXX on a relative strength basis since 2022. Most of this performance has been led by the strength in Nvidia’s stock, which I noted earlier holds a commanding 25% weight in SMH. What further skewed the performance of SMH was the relatively higher weight of Intel in SOXX. Hence, fund composition has played a very important part in distinguishing the performance of SMH vs. SOXX, as can be seen below. Author's chart depicting SMH's relative strength vs SOXX (in blue) and S&P 500 (in orange) When observing the performance characteristics of SMH, I also note the nature of cyclicity in SMH’s performance, as I have illustrated in the orange area chart above. While I am bullish in general for semiconductor stocks for the long term, the industry does go through cycles of ebbs and flows. This is because the underlying business tends to be cyclical. The cyclicity in the semiconductor business is tied to the trends in capital expenditure of semiconductor company's clients, which I will touch upon below, but I want to point out that it currently appears we are in a super cycle where SMH will continue to outperform in this cycle, as seen in the chart above. In the earlier section, I explained how the semiconductor industry’s business is cyclical in nature. The industry’s customers tend to shore up their investments into semiconductor products that power their technology systems when these companies see demand increasing for their end-user products. For example, with the extreme demand for AI solutions, startups and enterprises alike quickly moved to build, scale, and deploy AI models to meet high user demand. As enterprises attempted to quickly scale product deployments, they also planned for capacity and infrastructure to plan for future demand. Therefore, most companies last year resorted to hoarding Nvidia’s H100 chips, which had already proven to be optimal for training and deploying AI models. These companies also tend to order ahead of time, leading to the stockpiling of inventory of Nvidia’s H100 chips. Due to extreme demand, Nvidia’s net income surged +1000% in November last year, which is great for the long term prospects of Nvidia and the SMH fund. I have attached a chart below that shows some correlation between capital expenditures (capex) trends between some technology companies that are known to be Nvidia’s biggest customers. This shows that capex has increased cumulatively since 2019, with semiconductor companies such as Nvidia being the biggest beneficiaries, leading to higher gains in SMH. Compiled by author from various company sources While Tesla’s capex will rise by at least 24% y/y in FY24, Meta projected their capex will rise by ~19% this year. Amazon and Microsoft declined to give specific numbers, although they said capex will rise materially, driven by higher spending on AI initiatives. Sustained trends in rising capex cycles add more firepower to the long-term bull thesis for SMH. Business cyclicity can also be a downside risk to owning SMH. Of course, over the long term, it generally will not matter, as can be seen in the 5-year and 10-year periods of fund performance that I illustrated in the Peer Comparison section of this research note. But as enterprise capex cycles wind down, semiconductor companies will see headwinds. Often, excess inventory or stockpiling of chips and other products can be one of the reasons why capex cycles wind down. Economic slowdowns or recessions may also significantly impact the growth prospects of the stocks in the SMH. Valuation can also be another concern sometimes. As per the last update, SMH is currently valued at 36 times trailing twelve-month earnings. With the massive run-up since November of last year, I would want to wait for a pullback before allocating capital. But over the long term, the fund continues to have a bright outlook, in my opinion. AI will also further boost the growth outlook for SMH. Recently, Deutsche Bank Research noted in their research that they project sales to grow by 51% in 2024, propelled by AI demand for GPUs and CPUs. The research also goes on to elaborate that sales will almost double within the next three years. Given this projection, a PE of 36 may still be cheap. The SMH fund continues to impress me with a sustained growth outlook over the next three-year period. Nvidia’s earnings this week will add some more clarity about the near-term prospects for this fund. Given the massive run up in the fund, I would prefer a pullback, and for that reason, I will assign a Hold for now. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}