{
    "title": null,
    "date": "2/9/2024",
    "url": "https://www.livemint.com/market/stock-market-news/stock-market-marvels-apple-tesla-nvidia-among-aswath-damodaran-s-seven-samurai-that-rescued-us-market-in-2023-11707458096421.html",
    "text": "Apple, Amazon, Alphabet, Meta, Microsoft, Nvidia, and Tesla collectively led a market rebound in 2023, rescuing investors from the aftermath of a challenging 2022. Amid economic uncertainties and market fluctuations, these seven stocks emerged as saviors, led by what financial guru Aswath Damodaran dubs them “Magnificent Seven\" or, in his preference, the “Seven Samurai\" of the market. In a blog, Damodaran highlighted the performance of these seven stocks in 2023 and their contribution to the market growth. The Seven Samurai, as Damodaran aptly labels them, witnessed their collective market capitalization skyrocketing by a sharp $5.1 trillion in 2023. Nvidia and Meta were the top performers, with the chip maker more than tripling in value. Microsoft and Apple each added a trillion dollars to their market caps during the year, solidifying their positions as key players in the market resurgence. These companies accounted for more than 50% of the total increase in the US equity market capitalization, turning an average year into one with a remarkable 23.25% price appreciation. Also Read: Tesla asks which jobs are critical, stoking layoff fears The outperformance of these seven stocks extends back over a decade. Damodaran highlighted their cumulative market cap, which soared from $1.1 trillion in 2012 to $12 trillion in 2023, representing 24.51% of the overall US market cap as against 7.97% earlier. The Mag Seven companies now have a market capitalization larger than that of all listed stocks in China, the second largest market in the world in market capitalization terms, Damodaran noted. Moreover, he also estimated the cumulated value of $100 invested in December 2012 in a market-cap weighted index of US stocks at the end of 2023, first in US equities, and then in US equities, without the Mag Seven stocks. It was seen that removing seven stocks from a portfolio of 6,658 US stocks, investing between 2012 and 2023, creates a 17.97% shortfall in the end value. “In effect, this would suggest that any portfolio that did not include any of these seven stocks during the last decade would have faced a very steep, perhaps even insurmountable, climb to beat the market. That may go a long way in explaining why both value and small cap premium have essentially disappeared over this period,\" Damodaran wrote. Also Read: S&P 500 finishes just shy of 5,000 after latest push The Valuation guru also delved into the factors that propelled the shares of these Seven Samurai. A correction/momentum story suggests that their stellar 2023 performance was a rebound from the losses incurred in 2022, where they collectively lost $4.8 trillion in market cap, and that 2023 represented a correction back to a level only slightly above the value at the end of 2021. However, the data shows that the outperformance goes beyond mere correction, pointing to robust profitability and operating performance as key contributors. According to Damodaran, these companies demonstrated pricing power, exhibited economic resilience, and acted as money machines, translating into strong earnings. Their ability to weather economic uncertainties and maintain safety buffers, owing to minimal debt levels, bolstered investor confidence. The \"winner-take-all economics\" also played a crucial role, reflecting the shift from a manufacturing to a technology-driven global economy. “There was clearly a bounce back effect, as these firms recovered from a savage beatdown in 2022, but that bounce back occurred only because they were able to deliver strong profits and solid cash flows. And looking across the decade, I don't think it is debatable that investors have not only bought into the dominant player story (coming from the winner-take-all economics), but have also anointed these seven companies as leaders in the race to dominance in each of their businesses,\" Damodaran wrote. Also Read: Market may be too optimistic on Fed rate-cut outlook However, while acknowledging the past glory of the Seven Samurai, he emphasizes the importance of assessing their current investment appeal. He noted that on every pricing metric, the Mag Seven stocks trade at a premium over the rest of the stocks in the S&P 500, and therein lies the weakest link in pricing. That premium can be justified by pointing to higher growth and margins at the Mag Seven stocks, but that is followed by a great deal of hand waving, since how much of a premium is up for grabs. “The Mag Seven stocks have had a great run, but their pricing now reflects, in my view, the fact that they are great companies, with business models that deliver growth, at scale, with profitability,\" he said. The Mag Seven - Apple, Amazon, Alphabet, Meta, Microsoft, Nvidia, and Tesla - have reshaped the market landscape, but caution is advised as investors navigate the current premium pricing scenario. The future remains uncertain, and as Damodaran wisely notes, even the best companies can deliver disappointments, prompting a need for prudent investment strategies. Catch Stock Market Live Updates here Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Get the best recommendations on Stocks, Mutual Funds and more based on your Risk profile! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}