{
    "title": null,
    "date": "2/10/2024",
    "url": "https://tribune.com.pk/story/2455976/major-ai-chips-designer-chases-30b-market",
    "text": "Nvidia building new unit to design chips for cloud computing firms Nvidia is building a new business unit focused on designing bespoke chips for cloud computing firms and others, including advanced artificial intelligence processors, according to sources familiar with the company’s plans. The dominant global designer and supplier of AI chips aims to capture a portion of an exploding market for custom AI chips and to protect itself from the growing number of companies interested in finding alternatives to its products. The Santa Clara, California-based company currently controls about 80% of the market for high-end AI chips, a position that has sent its market value up 40% so far this year to $1.73 trillion after it more than tripled in 2023. Its customers, which include ChatGPT creator OpenAI, Microsoft, Alphabet and Meta Platforms, have raced to snap up the dwindling supply of Nvidia chips to compete in the rapidly emerging generative AI sector. Nvidia’s H100 and A100 chips serve as a generalised, all-purpose AI processor for many of those major customers. But the tech companies have started to develop their own internal chips for specific needs. This helps reduce energy consumption, and can potentially shrink the cost and time to design.\n\nRead Google says its AI supercomputer is faster, greener than Nvidia A100 chip Nvidia is now attempting to play a role in helping these companies develop custom AI chips that have flowed to rival firms such as Broadcom and Marvell Technology, according to the sources who declined to be identified because they were not authorised to speak publicly. “If you’re really trying to optimise on things like power, or optimise on cost for your application, you can’t afford to go drop an H100 or A100 in there,” said Greg Reichow, General Partner at venture capital firm Eclipse Ventures. “You want to have the exact right mixture of compute and just the kind of compute that you need.” Published in The Express Tribune, February 10th, 2024. Like Business on Facebook, follow @TribuneBiz on Twitter to stay informed and join in the conversation.  COMMENTS \n\n\n\n\nReplying to \nX\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSaved ! Your comment will be displayed after the approval.\n\n\nError !\n\n\nError! Invalid Email.\n\n\n\nComments are moderated and generally will be posted if they are on-topic and not abusive. \nFor more information, please see our Comments FAQ Comments are moderated and generally will be posted if they are on-topic and not abusive. For more information, please see our Comments FAQ 104 K Is Babar Azam Returning as Pakistan T20 Captain? | Sources Speculate on Leadership Shift Conjoined Twin Abby Hensel Marries U.S. Army Veteran | Abby & Brittany Update Finance Minister's Bold Vision: Private Sector to Lead, Govt to Support Policy Framework Where’s P. Diddy Now? Hip-hop mogul Sean \"Diddy\" Combs Faces Home Raids After Sexual Assault Cases Streamer ‘YourFellowArab’ Kidnapped in Haiti - Lord Miles Shares Insight UN Rapporteur: Decades of Israeli Atrocities in Palestine Exposed! Ben Shapiro's Silence on Candace Owens & Rabbi Shmuley Controversy Sam Bankman-Fried Sentenced: 25 Years for $10 Billion Crypto Fraud Pakistan to Investigate Alleged Judicial Meddling: PM, CJ Meet, Commission Formed Positive Signs: Pakistan's Reserves Inch Up, Rupee Strengthens Against Dollar US Condemns Russia's UN Veto on North Korea Sanctions Renewal Amidst Weapon Transfer Allegations. ChatGPT-owner OpenAI is exploring making its own AI chips Intel gives details on future AI chips as it shifts strategy US tackles loopholes in curbs on AI chip exports to China Microsoft developing its own AI chip US chip curbs give Huawei a chance to fill the Nvidia void in China Biden cuts China off from more Nvidia chips, expands curbs to more AI means everyone can now be a programmer, Nvidia chief says Israel illegally confiscated 27,000 decares of West Bank land since Oct. 7: Palestinian Authority Pakistani researcher achieves milestone in artificial vision India's Congress bemoans 'tax terrorism' after second tax notice Dutch police arrest man exiting nightclub, last hostage released Indian Navy rescues hijacked Iranian fishing vessel in Arabian Sea Laboring patients refused obstetric care at public hospitals Makeup Mastery Revolutionising Runways From Disorder to Tranquillity: The Art of Minimalist Living پیٹرولیم مصنوعات کی قیمتوں میں 10 روپے سے زائد اضافے کا امکان فیسلٹیشن اسکیم کے تحت پہلی بار اشیا برآمد کرنے پر ٹیکسز میں چھوٹ دینے کا فیصلہ اقتصادی بحالی اور معاشی نمو کیلیے مشاورتی تھنک ٹینک کا قیام غیر قانونی سگریٹوں کیخلاف ملک گیر کریک ڈاؤن کا مطالبہ پاک چین معاہدوں پر کوئی بات چیت نہیں ہوئی، آئی ایم ایف امریکی پابندیاں، ایران کو پاکستانی برآمدات تیسرے سال بھی صفر Utilize power plants fully, IMF advises Silenced by loved ones: Internet outraged by Maria's murder, likens case to Qandeel Baloch's SC endorses inquiry over judges’ letter Chinese military offers Pakistan help to fight terror Trading with the enemy PIA air hostess held in Canada Power and its discontent Redefining Pakistan’s nuclear deterrence posture Trading with the enemy Should Pakistan, China continue to feed a partner hosting the enemy? Donors don’t care much about air pollution Cross-border militancy and our priorities This material may not be published, broadcast, rewritten,\nredistributed or derived from. Unless otherwise stated, all content is\ncopyrighted © 2024 The Express Tribune. "
}