{
    "title": "Go Home, Short Sellers! There's Nothing Holding Nvidia Stock Back.",
    "date": "2/13/2024",
    "url": "https://www.tradingview.com/news/investorplace:a61615c69094b:0-go-home-short-sellers-there-s-nothing-holding-nvidia-stock-back/",
    "text": "Even after the breathtaking rally last year, our Nvidia NVDA stock outlook calls for higher prices in 2024. How is this possible? We’ve said it before, and we’ll say it again until it sinks in. You don’t need to sit on the sidelines because you think you “missed out.” As long as there’s an intense demand for Nvidia’s artificial intelligence compatible chips, the short sellers will continue to lose their shirts. Nevertheless, the doubters will dig in their heels. For instance, we caught wind of a university professor reportedly blogging about selling Nvidia stock. People can choose to buy or sell whatever they want, but we’re confident that Nvidia’s growth story is far from over in 2024. NVDA Stock Catalyst: A New Business Unit Is Coming Sorry to disappoint the short sellers, but the good news just keeps on rolling in for Nvidia and the company’s investors. For example, Reuters just broke the news story that Nvidia is creating a new business unit to design customized chips. This news, according to Reuters, comes courtesy of “nine sources familiar with” Nvidia’s plans. Furthermore, Nvidia reportedly plans to sell these “bespoke” (i.e., customized) chips to “cloud computing firms and others,” including advanced AI processors. Nvidia already has a near-monopoly with roughly 80% of the high-end AI-chip market. However, there’s always room to expand and try out new ventures. Nvidia’s H100 and A100 chips are the company’s go-to, all-purpose, AI-compatible processors. If the market for customized AI chips grows in 2024, however, then Nvidia will want to meet the demand. That’s why it’s a brilliant and forward-thinking move for Nvidia to invest in this new business unit today, in order to capture a potentially explosive opportunity in the coming quarters. Nvidia’s Graphics Cards Are Selling Like Hotcakes To put it mildly, there’s an imbalance between the supply of and the demand for Nvidia’s RTX 4090 graphics cards. In certain regions of Asia, the imbalance has reached the level of an outright supply crisis. A report from Benzinga, supported by information from Nikkei Asia, cites the U.S. government’s restrictions on exports of advanced, AI-capable chips to China. The demand for RTX 4090 graphics cards is intense in Southeast Asia and Taiwan. Thus, it might be a cliche to say this, but these graphics cards are selling like hotcakes. The Benzinga report pointed to price hikes of as much as 60% for Nvidia’s RTX 4090 graphics cards. There’s also strong, ongoing demand for the company’s H100 chips. Maybe this isn’t the intended effect of the U.S. government’s chip-export restrictions. Still, it’s a sign that Nvidia’s best-in-class, AI-enabled products are extremely popular, not only in America but internationally. NVDA Stock Outlook: The Sellers Keep Getting It Wrong In 2024, just like in 2023, Nvidia remains an innovator and a boundary-breaker. The company’s chips are in demand, sometimes even to the point of causing a supply crisis. Hence, our NVDA stock outlook is positive and we’re assigning it an “A” grade. Let the bears, doubters and short sellers continue to lose money and opportunities if they want to. Nvidia will keep on providing value to its shareholders, even if some people stubbornly refuse to acknowledge it. On the date of publication, Louis Navellier had a long position in NVDA. Louis Navellier did not have (either directly or indirectly) any other positions in the securities mentioned in this article. The InvestorPlace Research Staff member primarily responsible for this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}