{
    "title": "From Nvidia's new chip to Reddit's IPO: What you missed this week",
    "date": "3/22/2024",
    "url": "https://finance.yahoo.com/video/nvidias-chip-reddits-ipo-missed-223424013.html",
    "text": "It's been a busy week at Yahoo Finance -- as investors digested the new AI chip announcement from Nvidia (NVDA), the latest decision from the Federal Reserve, Reddit's initial public offering (RDDT), and so much more. Nvidia CEO Jensen Huang unveiled the Blackwell AI platform Monday evening in a highly anticipated keynote address, but with optimism so high, the stock came under pressure in reaction to the news. But several other partnerships were announced, lifting other stocks such as Cadence Design Systems (CDNS) and Synopsys (SNPS). As for the Federal Reserve, the central bank left interest rates unchanged as expected, and the FOMC's projections showed officials still see three rate cuts for the remainder of the year. Yahoo Finance also hit the road, as Julie Hyman traveled to Houston for the energy industry's top conference, CERAWeek by S&P Global. She sat down with key leaders in the sector, including ExxonMobil CEO Darren Woods (XOM) and Occidental's Vicki Hollub (OXY). Brad Smith got the pulse of what's happening in crypto at the Bitcoin Investor Day as bitcoin (BTC-USD) faced wild price volatility. Skybridge Founder Anthony Scaramucci and Pomp Investments' Anthony Pompliano gave their perspectives on investing in the space. Finally, in the season 2 premiere of Next, Madison Mills takes a closer look at how retailers are using artificial intelligence to fight organized theft. [MUSIC PLAYING] BRAD SMITH: It's been a big week here at Yahoo Finance. I'm Brad Smith at Bitcoin Investor Day. We're capping off high-profile interviews, plus some major market moving events. ANTHONY POMPLIANO: I think that one of the beauty of Bitcoin is that the narrative is so simple, right? For the average person, it's I can just save in an asset that isn't debased. BRAD SMITH: Our top story this morning, Nvidia's big AI conference. DANIEL HOWLEY: Expectations for Nvidia are exceedingly high. And the company will need to show Wall Street that its latest products have what it takes. And Yahoo Finance will be there to see it all. JULIE HYMAN: I'm here at the CERAWeek by S&P Global Conference. Got the chance to hear from some leaders across the sector. And one of those folks is Darren Woods. He is the CEO of ExxonMobil. And he's joining me right now. DARREN WOODS: If we open our minds and stay focused on the right problems, I think we can make a lot of progress a lot more quickly than we have been. JEROME POWELL: We're strongly committed to bringing inflation down to 2% over time. JULIE HYMAN: Jay Powell there speaking after the Fed held interest rates steady. We take a look at markets here, they seem to like it. SEANA SMITH: Reddit making its public debut on the New York Stock Exchange. It's the first big social media IPO since 2019. JOSH LIPTON: Should investors view Reddit as an AI play? STEVE HUFFMAN: I think they should look at Reddit as a community platform that has many paths to success. MADISON MILLS: In our upcoming episode of next we got a look at how retailers are investing in AI powered technology to help fight an existing problem with theft. Related Quotes "
}