{
    "title": "Wall St Week Ahead-Fracturing 'Magnificent Seven' trade puts spotlight on \nmegacap valuations",
    "date": "3/15/2024",
    "url": "https://www.marketscreener.com/quote/stock/NVIDIA-CORPORATION-57355629/news/Wall-St-Week-Ahead-Fracturing-Magnificent-Seven-trade-puts-spotlight-on-megacap-valuations-46212339/",
    "text": "Log In   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België)   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België) NEW YORK, March 15 (Reuters) - Diverging fortunes for\nthe massive technology and growth names that have propelled the\nU.S. stock market higher are throwing a spotlight on their\npricey valuations. The so-called \"Magnificent Seven\" are collectively trading\nat an average of 33 times their expected earnings for the next\n12 months, up from 26 at the end of 2022, according to LSEG\nDatastream. That compares with a price-to-earnings ratio of\nabout 21 for the benchmark S&P 500 index, which has risen\nover 7% this year. Investors last year were happy to pay up for the megacaps,\ngiven the companies' solid balance sheets and dominant positions\natop their industries. They have been more discriminating this\nyear, punishing the shares of Tesla and Apple\nwhen their outlooks turned murky while fueling dizzying gains in\nNvidia. \"When you get to those kinds of valuations you have no room\nfor failure, no room for disappointment,\" said Mike Mullaney,\ndirector of global markets research at Boston Partners.  Concerns about electric vehicle demand have sparked a near\n35% drop in the shares of the former market darling Tesla this\nyear, making it the S&P 500's worst performer. The stock traded\nat about 65 times forward earnings at the start of the year, and\nis down to about 50. Another Magnificent Seven member, Apple, has ceded its perch\nas the biggest U.S. company by market value to Microsoft\nafter its shares declined 10% year-to-date, amid\npressure in its China business. The stock's P/E has fallen from\n29 to 25. Meanwhile, chipmaker Nvidia, which trades at about\n35 times earnings, has soared about 80% as it established a\ndominant position in artificial intelligence applications. AI\noptimism has also helped drive a nearly 40% gain in Meta\nPlatforms. The Facebook parent trades at 24 times\nearnings. By contrast, the Magnificent Seven last year advanced about\n50% for Apple to over 230% for Nvidia. Because of the stocks'\nheavy weighting in the S&P 500, the group's performance\naccounted for over 60% of the index's appreciation last year.\nThe S&P 500 rose 24% in 2023.  Markets are awaiting the coming week's Federal Reserve\npolicy meeting, which concludes on Wednesday. A strong economy\nand sticky inflation have lowered investor expectations for how\nmuch the central bank will cut rates this year, leading to a\nrise in Treasury yields that could pressure stocks if it\ncontinues. Investors gauging whether Nvidia can parlay its massive lead\nin AI computing into long-term dominance will be watching the\ncompany's developer conference, set to kick off on Monday. Though AI optimism has helped lift a swath of the\nMagnificent Seven, many investors are grappling with how to\nweigh the technology's potential in their valuation models. \"We are in a unique cycle here with AI, so we are struggling\nto make sure we optimize the opportunity of this massive\ntransitional shift in technology,\" said Ken Laudan, portfolio\nmanager for the Buffalo Large Cap Fund, which holds the seven\nstocks but is underweight them on a combined basis. While robust earnings have supported the Magnificent Seven's\nvaluations, the group's growth trajectory is due to moderate\nlater this year or early next, said Jeffrey Buchbinder, chief\nequity strategist for LPL Financial. \"At that point, markets may not want to pay double the P/E\nfor this group,\" said Buchbinder, pointing the Magnificent\nSeven's trailing P/E of 41 versus 23 for the S&P 500. Many investors remain sanguine regarding the Magnificent\nSeven's valuations. Five of the seven are trading below their\nfive-year median P/E ratios, while the group is trading more\ncheaply versus the market than a few years ago, JPMorgan\nstrategists said this week. Nvidia's P/E has actually fallen from nearly 60 a year ago\nas analysts increase their profit forecasts for the chipmaker. \"These are companies that are cranking out enormous amounts\nof cash, very strong balance sheets, visible sources of revenue\ngrowth,\" said Katie Nixon, chief investment officer for Northern\nTrust Wealth Management. But Apple and Tesla's shares have recently fallen below\ntheir 200-day moving averages. Though the rest of the group are\nabove that mark, more of the Magnificent Seven dropping below\ntheir trend lines could be a \"warning sign\" for the market,\nCitigroup analysts said. If the Magnificent Seven \"start to go down ... absolutely\nyou could reverse a lot of the recent almost euphoric\nsentiment,\" said Sameer Samana, senior global market strategist\nat the Wells Fargo Investment Institute. (Reporting by Lewis Krauskopf; Editing by Richard Chang)  0 selected NVIDIA Corporation : Silicon Valley wants to break Nvidia's CUDA software monopoly March 27, 2024 at 10:55 am EDT NVIDIA: What's in store for AI Woodstock? Nvidia launches an AI woodstock  Currency / Forex Commodities Cryptocurrencies Best financial portal +951% of historicalperformance More than 20 yearsat your side +     \n                    \n    950,000\nmembers Quick & easycancellation Our Expertsare here for you OUR EXPERTS ARE HERE FOR YOU Monday - Friday 9am-12pm / 2pm-6pm GMT + 1 "
}