{
    "title": "Even After Rallying 239% in 1 Year, Nvidia Stock Still Isn't Expensive \nAccording to This Key Metric",
    "date": "3/2/2024",
    "url": "https://finance.yahoo.com/news/even-rallying-239-1-nvidia-120000288.html",
    "text": "Nvidia (NASDAQ: NVDA) was the talk of the town in 2023, and it continues to be a Wall Street darling in 2024. It's arguably the single most important stock behind the artificial intelligence trend currently fueling the market. As Nvidia has climbed higher and the broad market also reaches new all-time highs, skeptics have sounded the alarm for a stock market bubble. And while the market is stretched thinner than in years past, there's still reason to believe Nvidia is not necessarily overvalued, despite its 439% gain since the beginning of 2023. Say what you want about Nvidia stock's epic rise, but the company is delivering on every measure with a one-two punch of high revenue growth and expanding margins. Revenue has more than tripled in the last year, while net income is up over 500%. That level of growth for a company as big as Nvidia is incredible. The past year of gains has also pushed Nvidia to trade with a 66.2 price-to-earnings (P/E) ratio, a steep premium to even its \"Magnificent Seven\" peers. However, the average analyst estimate for Nvidia's fiscal 2025 earnings per share is $23.92, roughly double last year's result. The surge in anticipated profits gives Nvidia a much more reasonable forward P/E ratio. In fact, Nvidia has a lower forward-looking valuation than Tesla, Amazon, and Microsoft. You would be hard-pressed to find a growth stock that has nearly quadrupled in the last year with that low of a forward P/E ratio. At the same time, there are a few reasons why focusing only on forward P/E is dangerous for a company like Nvidia. First, Nvidia still has to double its profits in the current fiscal year -- a high bar for any company, let alone one this size. The even more significant risk to consider is that Nvidia operates in a cyclical industry. Typically, cyclical stocks have low P/E ratios during an expansion and high P/E ratios during a downturn. The idea is that investors won't pay too high of a price during times of elevated earnings but also won't sell off a stock just because there's a contraction in the cycle. Over time, the median P/E ratio works itself out to something more reasonable. A good example is agriculture and construction giant Deere. The company's earnings are slowing as the current expansion period nears an end. However, Deere's P/E ratio is just 10.6 because its trailing earnings are high, but investor sentiment is negative (shares are down 14% in the past year). Its 10-year median P/E ratio is a much higher 17.1 -- which makes sense -- the long-term median should be higher than Deere's current valuation. But in a downturn, investors can expect Deere's P/E to climb higher than that long-term baseline. The opposite is happening with Nvidia. Its 66.1 P/E is higher than its 46.7 10-year median. But again, you could argue Nvidia deserves a much higher valuation given its scorching hot growth rate and earnings outlook for this year. Nvidia is exciting because it's growing quickly, and it's already such a valuable company that it can drive the whole market. Nvidia has already become a bit of a story stock, a company valued based more on its hype and potential than its fundamentals. But Nvidia isn't priced for perfection, either -- its 32.1 forward P/E ratio is reasonable, especially relative to the other \"Magnificent Seven\" stocks. After all, Nvidia has almost always carried a premium, and there's no reason that should change in this part of its growth journey. Personally, I'd prefer to buy Nvidia when the expectations are lower, and there's more margin for error. Nvidia's short-term performance could take a turn for the worse due to macroeconomic conditions and factors outside its control. And with the stock sitting at its peak, there's a heavy expectation its growth will march on uninterrupted. A forward P/E ratio above 30 is acceptable for a company likely to double its earnings this year, but that will change quickly if the company fails to deliver. Prospective investors should be cautious about those expectations, as well as the behavior patterns of cyclical stocks. The easy money has already been made, and with Nvidia's market cap reaching $2 trillion, expecting the stock to again triple in the near term isn't realistic. As an individual investor considering Nvidia for your portfolio, it's up to you to decide what kind of price you're willing to pay for the stock and what you expect from the business at that price. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Daniel Foelber has the following options: long June 2024 $400 calls on Deere. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends Deere and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Even After Rallying 239% in 1 Year, Nvidia Stock Still Isn't Expensive According to This Key Metric was originally published by The Motley Fool Related Quotes "
}