{
    "title": "Dow Jones Futures: Inflation Rates 'Good,' Powell Says; Will Nvidia AI Chip \nPeer Forge a",
    "date": "3/29/2024",
    "url": "https://thebharatexpressnews.com/dow-jones-futures-inflation-rates-good-powell-says-will-nvidia-ai-chip-peer-forge-a-foundation/",
    "text": " Dow Jones futures open on Sunday evening, while US markets are closed on Friday.  The Federal Reserve’s favorite inflation report was largely in line, with Fed chief Jerome Powell sounding pleased with Friday’s data. X The stock market rally had a solid holiday-shortened week.  Growth stocks, especially AI leaders like Nvidia (NVDA), fell back slightly, although generally remaining above support.  The market showed strength while shaking that off with robust breadth.  Small caps led the way with strong gains, with the Dow Jones and S&P 500 at record highs.  The Nasdaq fell as many tech giants retreated. Nvidia needs more time, but Microsoft (MSFT), Metaplatforms (META) and CrowdStrike (CRWD) are technology leaders in a bullish retreat. Meanwhile, new AI chip IPO Astera Labs (ALAB) is pulling back from Tuesday’s record high.  A continued lull in Nvidia stock and AI plays could allow ALAB stock to forge a short IPO base. Meanwhile, Chinese EV makers Nio (NIO), Li Auto (LI) and XPeng (XPEV) will report March and first quarter deliveries early Monday, April 1.  EV giant BYD (BYDDF) should report a major recovery in March either on Monday or Tuesday. Tesla (TSLA) is likely to release first-quarter deliveries on Tuesday.  Expectations for Tesla are low, while Nio and especially Li Auto have lowered delivery targets in recent days. Nvidia and META stock are on the IBD Leaderboard.  Microsoft stock is on the IBD Long-Term Leaders list.  Nvidia, Meta Platforms and CrowdStrike stocks are on the IBD 50 list. Table of Contents February’s PCE price index rose 0.3% from January, the Commerce Department reported Friday, just below expectations for a 0.4% increase.  January’s PCE gain was revised upwards to an increase of 0.4%.  PCE inflation was 2.5% compared to a year earlier, in line with and just above January’s 2.4%. The core PCE price index, the Fed’s main inflation gauge, rose as expected by 0.3% from January, with an unrounded figure of 0.26%.  The January price was revised to a gain of 0.5%.  Core PCE inflation was 2.8% from a year earlier, in line with expectations, and down from an upwardly revised 2.9% in January. Inflation has proven stubborn in recent months, making the Federal Reserve less eager to cut interest rates. However, the relatively in-line PCE inflation report should keep a Fed rate cut in play in June.  The chance of a Fed rate cut in June was about 64% on Thursday. Fed chief Jerome Powell said Friday that it was “good” that there were no ugly surprises in the PCE data, adding that the report was “more or less in line with what we want to see.”  He reiterated that policymakers want to have more confidence before cutting rates.  He noted that cutting rates too quickly could be “highly disruptive,” but he also said waiting too long could mean “unnecessary damage to the economy and the labor market.” Investors won’t get a chance to react until Dow Jones futures open Sunday evening, with the real test coming Monday. The PCE inflation data came as part of the income and expenditure report.  Personal income grew by 0.3%, below expectations of 0.4%.  Consumer spending increased by 0.8% compared to 0.5% in the number of views. Dow Jones futures open at 6:00 PM ET on Sunday, along with S&P 500 futures and Nasdaq 100 futures. US markets will not trade on Friday in honor of Good Friday.  European markets and Hong Kong were also closed on Friday and will remain closed on Easter Monday. Remember, overnight action in Dow futures and elsewhere doesn’t necessarily translate into actual trading during the next regular stock market session. Join IBD experts as they analyze leading stocks and the market on IBD Live The stock market rally delivered modest to strong weekly gains, barring some growth plays. The Dow Jones Industrial Average rose 0.8% in weekly stock market trading, setting a record on Thursday.  The S&P 500 index gained 0.4% to set just an all-time high on Thursday.  The Nasdaq index fell 0.3%, just below its peaks.  During the quarter, the Dow Jones rose 5.6%, the S&P 500 rose 10.2% and the Nasdaq rose 9.1%. The market size was impressive during the week.  The small-cap Russell 2000 rose 2.5% to hit a two-year high.  The Invesco S&P 500 Equal Weight ETF (RSP) gained 1.6% to hit an all-time high.  The First Trust Nasdaq 100 Equal Weighted Index ETF (QQEW) rose 0.4% versus the Nasdaq 100’s 0.5% decline. The yield on ten-year government bonds fell by 3 basis points this week to 4.19% and dipped below the 200-day limit. U.S. crude futures rose 3.15% to $83.15 a barrel last week, having risen 16.1% in the first quarter. Among growth ETFs, the iShares Expanded Tech-Software Sector ETF (IGV) fell 0.8% this week.  Microsoft stock is a huge holding, with CrowdStrike also in IGV.  The VanEck Vectors Semiconductor ETF (SMH) fell 1.2%.  But this was within weeks, losing only some of the previous week’s strong gains. Reflecting more speculative story stocks, the ARK Innovation ETF (ARKK) rose 1.3% last week and the ARK Genomics ETF (ARKG) rose 2.1%.  Tesla shares are a major stock in Ark Invest’s ETFs. The Industrial Select Sector SPDR Fund (XLI) rose 0.6%, the Financial Select SPDR ETF (XLF) rose 1.7% and the SPDR S&P Homebuilders ETF (XHB) climbed 1.2%, all to record highs. SPDR S&P Metals & Mining ETF (XME) rose 4% last week.  US Global Jets ETF (JETS) rose 3.3%, both to multi-month highs.  The Energy Select SPDR ETF (XLE) rose 2.15% to a 52-week high.  The Health Care Select Sector SPDR Fund (XLV) rose to 1.6%, just below an all-time high. Time the market with IBD’s ETF market strategy Nvidia shares fell 4.2% this week to 903.56, ending a 92% run in an 11-week winning streak.  The shares have not tested their 21-day moving average and are trading within a three-week range.  After such a strong run, it makes sense for Nvidia to consolidate for a while.  A new base could come in a few weeks, but NVDA stock could pause for an extended period of time, as it did for several months in late 2023. Many other AI stocks could follow Nvidia’s lead, especially chipplay.  Longer pauses to forge bases and allow the moving averages to catch up would be constructive. Astera Labs went public at 36 and soared 72% in its debut on March 20.  The AI ​​chip’s IPO spiked to 95.21 on Tuesday before turning lower again.  ALAB shares continued to pull back.  Shares rose 5.9% to 74.15 this week. It’s usually a good idea to wait until an IPO stock has found its footing and forged some sort of consolidation over a few weeks.  An IPO basis can be very short, as little as two weeks and perhaps unofficially a few days shorter than that.  But they often form over several weeks, depending on market conditions.  IPO bases can deliver powerful returns. Astera Labs is experiencing rapid revenue growth from a relatively low base.  The company lost money in 2023, but is expected to turn a profit in 2024 with continued strong earnings growth in 2025. Will Reddit unplug the bulging US IPO pipeline? Microsoft stock is on a five-session losing streak, but the losses are small and the volume is very light.  Shares have fallen just below the 420.82 buy point but remain above the 21-day line.  A rebound would be doable. Meta shares fell 4.7% to 485.58 last week, but on anemic volume.  Shares fell slightly below the 21-day line.  Shares are retreating toward a rapidly rising 10-week line, which could be about flat with Meta on Monday.  That would be the first real 10-week line test of 2024.  A recovery from that level would provide a buying opportunity.  Meta stocks could also have a new base in a few weeks. CrowdStrike shares fell 2.1% this past week to 320.59, finding support around the 21-day and 10-week lines.  The cybersecurity leader is seeing a messy consolidation, but investors could use a draw-the-line buy point around 338.45, or possibly use Wednesday’s high of 333.84 as an early entry. In reality, a number of software stocks are hovering near support levels and possible introductions.  These include CrowdStrike peer CyberArk software (CYBR) and also Cloudflare (NET), monday.com (MNDY), Service now (Now and HubSpot (HUBS). Catch the next big winning stock with MarketSurge Shares of Tesla rose 2.9% to 175.70 last week, although they encountered resistance at the 10-week line.  Bulls are hopeful that Full Self-Driving will show big improvements, with CEO Elon Musk mandating FSD test drives before new purchases or after service visits.  But in the near term, analysts continue to lower Tesla’s earnings and delivery expectations.  That’s largely due to weak demand for electric vehicles in general.  Competition continues to increase in China, with smartphone maker Xiaomi making a major entry into the EV market on Thursday. Tesla will report first-quarter production and delivery figures on Tuesday, April 2, with first-quarter results later in the month. The stock market rally appears to be broadening and rotating in a constructive manner.  While this story has generally focused on technology names, investors can find useful or promising stocks in the housing, financial, medical, travel and consumer sectors. Eli Lilly (LLY), Medpace (MEDP), Uber Technologies (UBER), ELF Beauty (ELF), Nextracker (NXT), XP (XP), Royal Caribbean (RCL), East West Bancorp (EWBC), Axon company (AXON), When holding (ONON), M/I houses (MHO) and Warren Buffett’s Berkshire Hathaway (BRKB) are just a few. It is possible that technology growth leaders such as Nvidia, Microsoft and Meta will consolidate for an extended period of time. So cast a wide net and add promising names to your watchlists.  Use the long weekend to turn your screens and do some research on some specific goals. Don’t forget the defense.  Several leading stocks showed sell signals for recent buyers this past week.  While a number of stocks are seemingly bullishly rising or retreating, it wouldn’t take much selling for things to look a lot worse. Read The Big Picture every day to stay informed about market direction and the most important stocks and sectors. Follow Ed Carson on Threads at @edcarson1971, X/Twitter at @IBD_ECarson and Bluesky at @edcarson.bsky.social for stock updates and more. You might also like: Why this IBD tool simplifies the search for top stocks Do you want to make a quick profit and avoid big losses?  Try SwingTrader Best growth stocks to buy and watch IBD Digital: Unlock IBD’s premium stock lists, tools and analysis today  Save my name, email, and website in this browser for the next time I comment.   Δ "
}