{
    "title": "Stocks Fade Badly After Jobs Report; Apple Leads Dow Jones, But Nvidia \nSuffers Bearish Reversal",
    "date": "3/9/2024",
    "url": "https://emeatribune.com/stocks-fade-badly-after-jobs-report-apple-leads-dow-jones-but-nvidia-suffers-bearish-reversal/",
    "text": "The Dow Jones Industrial Average and other major stock indexes faded off highs after the February jobs report came in stronger than expected for the second straight month. Nvidia stock outperformed in the early going in the stock market today, one day after Mizuho lifted Nvidia‘s (NVDA) price target to 1,000. But a 5% early gain faded badly to a loss of more than 3% in afternoon trading. X Nvidia stock is start to showing aspects of a climax top, which raises the likelihood of a near-term pullback. The iShares Russell 2000 ETF (IWM) was up 1.6% intraday, but the gain faded to around 0.4%. Top price gainers in the Dow Jones today included Salesforce (CRM), which added just over 1%. Salesforce continues to be a strong performer after a breakout from a 19-week consolidation Nov. 30. Apple (AAPL) led the Dow Jones index with a gain of around 2%, but Apple stock remains on a firm downtrend as Wall Street worries about slowing iPhone demand, among other things. Broadcom (AVGO) slumped more than 6% despite a strong earnings report. The company also forecast $10 billion in AI chip sales this year, but investors shrugged off the news. Several AI-related stocks moved higher early, including Super Micro Computer (SMCI), but a 6% intraday gain faded to a loss of nearly 4%. See Which Stocks Are In The Leaderboard Model Portfolio Inside the MarketSurge Growth 250, Samsara (IOT) surged more than 13% after reporting strong earnings. Investors also focused on revenue guidance that came in above expectations. Samsara continues to see strong demand for its sensors and cloud-based software to manage fleet vehicles and industrial operations. Samsara gapped out of a 12-week consolidation in strong volume today. The Nasdaq composite rose to another record high and was up 1.1% in the first hour of trading, but the index reversed lower for a loss of 0.5%. The S&P 500 also hit a record high early but turned slightly lower for a loss of 0.2%. The Dow Jones Industrial Average edged up 0.1%. Volume on the Nasdaq and NYSE was higher compared to the same time Thursday. Breadth was strong early but weakened, with advancers beating decliners on the Nasdaq by less than 2-to-1. Breadth was nearly 2-to-1 positive on the NYSE. The 10-year Treasury yield was down 3 basis points to around 4.06% before the jobs report. In early-afternoon trading, the yield was flat around 4.09%. Inside the MarketSurge Growth 250, several top-rated growth stocks moved sharply higher. Bitcoin-related stocks outperformed, including Marathon Digital (MARA) and Coinbase (COIN), which rallied 8% and 6%, respectively. Both also faded from session highs, however. Square parent Block (SQ), gave an early buy signal with a 4% move higher. The stock has been holding gains well after surging on earnings two weeks ago. It’s still underneath an alternate 83.29 handle entry. Small cap sushi chain Kura Sushi (KRUS), with a Composite Rating of 93, is testing its 10-week moving average as it forms a cup-with-handle base with a 108.22 buy point. But then news wasn’t great at Costco (COST) and database software firm MongoDB (MDB), both of which plunged on earnings. Costco stock gapped down to its 21-day exponential moving average in the stock market today after the company missed on revenue. Costco was one of the first stocks out of the gate when the Nasdaq composite and S&P 500 marked follow-through days in early November. MongoDB pared losses and found support at its 200-day line after reporting earnings and revenue above expectations. But the company guided revenue for its current fiscal year 2025 below expectations. Follow Ken Shreve on X @IBD_KShreve for more stock market analysis and insight. YOU MAY ALSO LIKE: Catch The Next Big Winning Stock With MarketSurge Want To Get Quick Profits And Avoid Big Losses? Try SwingTrader Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD’s Premium Stock Lists, Tools And Analysis Today Nvidia-Led Reversal Is Wake-Up Call; What To Do Now EMEA Tribune is not involved in this news article, it is taken from our partners and or from the News Agencies. Copyright and Credit go to the News Agencies, email [email protected] Follow our WhatsApp verified Channel Most people who are looking for millionaire-makers — stocks that can dramatically change your financial trajectory — seek speculative lottery tickets, like the stock tip […] Investment in Hong Kong property fell by 28 per cent to HK$37 billion (US$4.73 billion) last year, its lowest level since the 2008 financial crisis, […] Whether you’re new to the stock market or simply want a low-maintenance investment that can help you build wealth with next-to-no effort, exchange-traded funds (ETFs) […] The EMEA Tribune was founded in March 2020  by DJ Kamal Mustafa. Our aim is to be the primary portal for the Middle East, Africa, Europe, and Pakistan news, and our target audience is all those communities of readers living in and around the region that care deeply for its fate. EMEA TRIBUNE is known for its “Investigative Journalism” where we publish exclusive stories from investigative to trending and that’s how we make it viral for everyone. We have been featured in News Blogs and International Media is also quoting us and publishing our report. A video has recently surfaced from the Dangar Algar region of Afghanistan. It shows members… The recent Gwadar attack exposes a troubling pattern: so-called \"missing persons\" turning up as terrorists.… On March 24, 2023, Lieutenant General Babar Iftikhar, the Corps Commander of Karachi, visited the… Donald Lu, the Assistant Secretary of State for South Asia, has categorically refuted claims that… "
}