{
    "title": "Wall St eases after PPI data as chipmakers fall",
    "date": "3/14/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024:newsml_L3N3FS3QD:0-wall-st-eases-after-ppi-data-as-chipmakers-fall/",
    "text": "U.S. stocks edged lower on Thursday, with chipmaker stocks extending losses for a second day, as a jump in producer prices left investors wondering if the Federal Reserve might wait longer than expected to cut interest rates. Data showed U.S.     producer prices increased     more than expected in February as the cost of goods like gasoline and food surged. Rate-sensitive utilities S5UTIL and real estate S5REAS were the day's weakest sectors. The Fed is expected to leave rates unchanged at its policy meeting next week. The market has trimmed the odds of a cut for at least 25 basis points at its June meeting to 62.9%, CME's FedWatch Tool showed, down from 81.7% a week ago. \"If we take inflation as a whole, we've had relatively hot inflation readings the last two months now, yet the market has kind of powered higher,\" said Tony Welch, chief investment officer of SignatureFD. \"Fed policy may not be as loose as the market wanted it to be this year, but the prospect of further tightening still remains a low probability.\" Nvidia NVDA was down 3%, while an index of semiconductors SOX fell 1.4%. The Dow Jones Industrial Average DJI fell 135.11 points, or 0.35%, to 38,908.21. The S&P 500 SPX lost 12.12 points, or 0.23%, at 5,153.19 and the Nasdaq Composite IXIC dropped 14.88 points, or 0.09%, to 16,162.88. The small cap Russell 2000 RUT fell 1.9%. Other data showed U.S. retail sales rebounded in February, rising 0.6%, but less than the 0.8% advance expected. Thomson ReutersAnnual change in US Producer Price Index Shares of Robinhood Markets HOOD rose 5.4% after the trading app operator said its assets under custody rose 16% in February. Declining issues outnumbered advancers on the NYSE by a 3.98-to-1 ratio; on Nasdaq, a 3.01-to-1 ratio favored decliners. The S&P 500 posted 39 new 52-week highs and no new lows; the Nasdaq Composite recorded 54 new highs and 159 new lows. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}