{
    "title": "Nvidia CEO Jensen Huang says AI could pass most human tests in 5 years",
    "date": "3/3/2024",
    "url": "https://www.foxbusiness.com/technology/nvidia-ceo-jensen-huang-says-ai-could-pass-most-human-tests-5-years",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Satori Fund senior portfolio manager Dan Niles analyzes the performance of the ‘Magnificent 7’ stocks and reveals some upcoming investment opportunities on ‘Making Money.’ Nvidia CEO Jensen Huang said Friday that artificial general intelligence (AGI) could, by some definitions, arrive in as little as five years. Huang, who leads the world's leading maker of artificial intelligence chips used to create systems like OpenAI's ChatGPT, appeared at an economic forum held at Stanford University where he was asked about how long it would take to achieve AGI with computers capable of thinking like humans. He responded that the answer largely depends on how the goal of AGI is defined. If the definition is the ability to pass human tests, Huang said that AGI will arrive soon. \"If I gave an AI… every single test that you can possibly imagine, you make that list of tests and put it in front of the computer science industry, and I'm guessing in five years time, we'll do well on every single one,\" Huang said. NVIDIA CEO IS $9.6B RICHER AS AI CHIPMAKER'S STOCK SOARS Jensen Huang, President of NVIDIA holding the Grace hopper superchip CPU used for generative AI at supermicro keynote presentation during the COMPUTEX 2023. The COMPUTEX 2023 runs from 30 May to 02 June 2023 and gathers over 1,000 exhibitors from 26  (Photo by Walid Berrazeg/SOPA Images/LightRocket via Getty Images / Getty Images) Currently, AI can pass tests like legal bar exams but has struggled on specialized medical tests like gastroenterology. Based on other definitions of AGI, Huang said it may be much farther away because there is still disagreement among scientists about how to describe how human minds work. \"Therefore, it's hard to achieve as an engineer\" because engineers need defined goals, Huang said. NVIDIA'S STOCK SOARS AFTER AI BOOM LIFTS REVENUE 265% Nvidia co-founder and CEO Jensen Huang says the timing of AGI depends on how it's defined. (Photographer: I-Hwa Cheng/Bloomberg via Getty Images / Getty Images) The Nvidia CEO also addressed a question about how many more chip factories, called \"fabs\" in the industry, are needed to support the expansion of the AI industry. Media reports have indicated that OpenAI CEO Sam Altman thinks many more fabs will be needed, and he has pursued funding for an AI chip venture. WHAT IS ARTIFICIAL INTELLIGENCE (AI)? Nvidia's role as the leading designer of AI chips has driven massive growth in its stock price. ((Photo by Jakub Porzycki/NurPhoto via Getty Images) / Getty Images) Huang said that more fabs will be needed but noted that each chip will also get better over time, which limits the number of chips required by customers. \"We're going to need more fabs. However, remember that we're also improving the algorithms and the processing of (AI) tremendously over time,\" Huang said. \"It's not as if the efficiency of computing is what it is today, and therefore the demand is this much. I'm improving computing by a million times over 10 years.\" Nvidia recently surpassed the threshold of $2 trillion in market capitalization, surpassing Google parent company Alphabet's $1.71 trillion and Amazon's $1.85 trillion to become the third-largest U.S. company by market cap – trailing only Microsoft and Apple. GET FOX BUSINESS ON THE GO BY CLICKING HERE Nvidia's stock is up 70.8% so far in 2024. The AI chip giant's share price has risen by 244% over the past year and 2,084% in the past five years. Reuters contributed to this report. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}