{
    "title": "While Nvidia announced its next-generation chips at its annual developer \nconference last week, SK Hy.. - MK",
    "date": "3/24/2024",
    "url": "https://www.mk.co.kr/en/stock/10973336",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share  While Nvidia announced its next-generation chips at its annual developer conference last week, SK Hynix-related stocks, which exclusively supply HBMs to Nvidia, are also experiencing a warm breeze. According to the Korea Exchange on the 25th, as of 9:35 a.m., Korea-U.S. semiconductors were trading at 99,100 won, up 5.65% from the previous trading day. As of the previous day's closing price, the one-month increase rate of Korea-U.S. Semiconductor reached 31.01%. Earlier on the 22nd, Hanmi Semiconductor announced the signing of a supply contract worth 21.5 billion won with SK Hynix. Analysts say that this contract has confirmed that demand is solid due to SK Hynix's continued investment in HBM. Kwak Min-jeong, a researcher at Hyundai Motor Securities, raised the target stock price of Hanmi Semiconductor to 200,000 won on the same day, saying, \"The role of Hanmi Semiconductor will become more important considering the explosive demand of Nvidia, the continued importance of HBM TSV-TC processes, and the growth of HBM-related supply chains in the U.S. If Hanmi Semiconductor develops a hybrid bonder for memory first, it is expected to solidify its position as a global memory-oriented hybrid bonder company.\" Shares of SK Square, SK Hynix's largest shareholder, have also been on a high note. Based on the previous day's closing price, SK Square's one-month increase rate reached 15.44%. In particular, it rose to 81,000 won on the 22nd, breaking the highest price since listing. However, SK Square's stock price seems to be adjusting at around 76,000 won as of 9:35 a.m. on the 25th, down about 5% from the previous trading day. SK Hynix was trading at 171,400 won as of 9:36 p.m., up 0.94% from the previous trading day. Based on the previous day's closing price, the one-month increase rate reached 13.96%. According to KB Securities, SK Hynix is expected to lead profitability improvement, with HBM accounting for more than a fifth of total DRAM sales this year, with HBM accounting for more than one-fifth of total DRAM sales. \"SK Hynix is expected to maintain its dominance in the NVIDIA HBM market for the time being despite its competitors entering the HBM market this year,\" said Kim Dong-won, a researcher at KB Securities. \"There is no alternative in terms of competitiveness of Nvidia GPU products, so it can maintain more than 80% of its market share this year.\" 2024-03-29 17:44:51 2024-03-28 14:43:55 2024-03-28 08:35:39 2024-03-29 10:06:50 2024-03-29 16:18:40 2024-03-28 22:06:01 2024-03-30 06:02:41 2024-03-28 18:05:38 2024-03-29 20:51:03 2024-03-29 09:51:58 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}