{
    "title": "2 AI Stocks That Wall Street Likes Better Than Nvidia",
    "date": "3/25/2024",
    "url": "https://www.fool.ca/2024/03/25/2-ai-stocks-that-wall-street-likes-better-than-nvidia/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. NVIDIA (NASDAQ:NVDA) may be trendy but Shopify (TSX:SHOP) has more upside according to Wall Street. Image source: Getty Images NVIDIA (NASDAQ:NVDA) is easily the trendiest stock of 2024. Up 89% for the year, it has outperformed even its fellow AI stocks, which are performing well as a group. NVIDIA’s main claim to fame is being the primary semiconductor (“chip”) vendor to the artificial intelligence (AI) industry. It has a de-facto monopoly on AI accelerator chips – chips used in AI servers to handle tasks that the central processing unit (CPU) can’t handle. Other companies are building AI chips, but they can’t handle the same workloads that NVIDIA graphics processing units (GPUs) can. For this reason, NVIDIA is either a monopoly or very close to it. At the same time, the U.S. government is heavily prioritizing computer chips, wanting to gain an edge over China. So, NVIDIA does not face the usual antitrust scrutiny that monopolies do – it’s just too important to its home country geopolitically. NVIDIA is certainly impressive, but nothing deserves an infinite price. At this point, NVIDIA’s market capitalization (value of all shares combined) is 40% higher than that of Alphabet despite it having 60% less profit. It’s possible that NVIDIA is overvalued. Wall Street does not seem to think so: its price target is above the current price. However that target ($975) is only 6.6% higher than the price which prevailed at the time of this writing. With that in mind, here are two Canadian AI stocks that Wall Street likes better than NVIDIA. Kinaxis Inc (TSX:KXS) is a Canadian tech company that develops supply chain management software. It traded for $153.80 at the time of this writing, while having a $199 price target from Wall Street. Thus, it has 29.3% expected upside compared to NVIDIA’s 6.6%. If Wall Street is right, then you will make more money by buying KXS than by buying NVDA. Why is KXS so popular on Wall Street? Like many tech companies, it is getting a lot of attention because of its investments in generative AI. KXS builds software that helps people track key supply chain components like inventory, raw inputs and customer buying patterns. Kinaxis has always had solutions that lets users track such things (e.g., RapidResponse), but now with AI, collecting supply chain insights is a faster process than before. For example, in just seconds, a user can predict how much inventory he/she will need to fulfill customer demand on a given day. Shopify Inc (TSX:SHOP) is a Canadian e-commerce platform company. It develops a website builder and payment platform that help businesses run their own online stores. The company is one of Canada’s hottest growth stocks. It has risen 2,895% since its IPO in 2015. In that time, it has grown to become one of the world’s biggest e-commerce players. Shopify stock currently trades for US$79 on the NYSE and has a US$111 price target from Wall Street analysts. The US$111 price target translates to $147. Shopify is $107.68 on the TSX at the time of this writing. So, Wall Street thinks that SHOP has 37.4% upside – which is better than NVIDIA’s estimated 6.6%. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 29, 2024 | Puja Tayal Have you given a thought to how you plan to retire? Your decision depends significantly on how much your investments… Read more » March 29, 2024 | Andrew Button AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. Read more » March 29, 2024 | Andrew Button Hot AI stocks like Open Text Corp (TSX:OTEX) have been rallying lately. Read more » March 29, 2024 | Amy Legate-Wolfe Hut stock (TSX:HUT) surged by 23% after the company reported strong earnings, and even more growth occurred in 2024. Read more » March 28, 2024 | Puja Tayal Nvidia stock has made investors millionaires in the last 10 years. Is it too late to invest to become a… Read more » March 28, 2024 | Chris MacDonald There are plenty of growth stocks in the market worth considering, but Shopify (TSX:SHOP) looks like one of the best… Read more » March 28, 2024 | Puja Tayal The TSX has been favouring tech stocks, but not this one. However, it has the potential to trounce the market… Read more » March 27, 2024 | Rajiv Nanjapla These three under-$20 stocks offer excellent buying opportunities for long-term investors. Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. © 2024 The Motley Fool Canada, ULC. All rights reserved. "
}