{
    "title": "Direxion Daily NVDA Bull 1.5X Shares (NASDAQ:NVDU) Sees Large Drop in Short \nInterest",
    "date": "3/13/2024",
    "url": "https://www.defenseworld.net/2024/03/13/direxion-daily-nvda-bull-1-5x-shares-nasdaqnvdu-sees-large-drop-in-short-interest.html",
    "text": "Posted by Defense World Staff on Mar 13th, 2024 Direxion Daily NVDA Bull 1.5X Shares (NASDAQ:NVDU – Get Free Report) was the recipient of a large decrease in short interest during the month of February. As of February 29th, there was short interest totalling 2,400 shares,  a decrease of 33.3% from the February 14th total of 3,600 shares. Based on an average daily volume of 316,800 shares, the days-to-cover ratio is currently 0.0 days. Shares of Direxion Daily NVDA Bull 1.5X Shares stock opened at $68.16 on Wednesday. The firm’s 50-day moving average price is $44.84. Direxion Daily NVDA Bull 1.5X Shares has a 12 month low of $20.18 and a 12 month high of $74.51. The company also recently disclosed a  dividend, which was paid on Friday, December 29th. Stockholders of record on Friday, December 22nd were given a dividend of $0.1766 per share. The ex-dividend date of this dividend  was Thursday, December 21st. An institutional investor recently bought a new position in Direxion Daily NVDA Bull 1.5X Shares stock. Citigroup Inc. purchased a new position in shares of  Direxion Daily NVDA Bull 1.5X Shares (NASDAQ:NVDU – Free Report) during the 3rd quarter, according to its most recent 13F filing with the SEC. The firm purchased 100,000 shares of the company’s stock, valued at approximately $2,375,000. Citigroup Inc. owned about 15.38% of Direxion Daily NVDA Bull 1.5X Shares at the end of the most recent reporting period. Read More\n\nFive stocks we like better than Direxion Daily NVDA Bull 1.5X Shares\nWant to Profit on the Downtrend? Downtrends, Explained.\nAmbarella’s Stock Turning Point: AI Set to Propel Growth in 2024\nInvesting in Construction Stocks\nON Holdings Stock Price Tumbles: Is Now The Time to Buy?\nBest of the list of Dividend Aristocrats: Build wealth with the aristocrat index\nGameStop Stock Is Giving Investors a Familiar Feeling, But Why?\n\n\n\n\n\n\n\n\nReceive News & Ratings for Direxion Daily NVDA Bull 1.5X Shares Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Direxion Daily NVDA Bull 1.5X Shares and related companies with MarketBeat.com's FREE daily email newsletter.   Receive News & Ratings for Direxion Daily NVDA Bull 1.5X Shares Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Direxion Daily NVDA Bull 1.5X Shares and related companies with MarketBeat.com's FREE daily email newsletter. Short Interest in Defiance Nasdaq 100 Enhanced Options Income ETF (NASDAQ:QQQY) Decreases By 35.9% Sacks Parente Golf, Inc. (NASDAQ:SPGC) Short Interest Down 34.7% in February "
}