{
    "title": null,
    "date": "3/19/2024",
    "url": "https://www.itnewsafrica.com/2024/03/check-point-partners-nvidia-to-secure-ai-cloud-infrastructure/",
    "text": "How can financial inclusion unlock sustainable growth? Seamless Remittance: Leatherback Teams Up with YES BANK Verto Pay Redefines Nigerian SME Financial Management Insights Unveiled: AFTS Presents Nigeria Fintech Marketing Outlook 2024 M-PESA Safaricom and Onafriq Partner to Facilitate Ethiopian Remittances Beat the Scammers: 4 Tips to Dodge Online Ticket Fraudsters Balancing Tech in Education: Protecting Students Online Fortifying #PublicSec 2024 BeyondTrust’s Silver Sponsorship Key Topics at the Forefront of IT News Africa’s #PublicSec2024 Intercede Launches MyID® MFA 5.0 for Enhanced Security How SMEs can transform their business with AI Check Point Partners NVIDIA to Secure AI Cloud Infrastructure OPPO to Introduce IoT and AI Product Ecosystem to South Africa Flapmax Launches Women in AI Fellowship on Generative AI Cracking the Code: Ria Pinto Demystifies AI’s Role in Cybersecurity Rugby’s Analytics Revolution: How Big Data is Changing the Game Seamless Remittance: Leatherback Teams Up with YES BANK Verto Pay Redefines Nigerian SME Financial Management Secure Online Payment Solutions: New Nedbank Direct EFT How can financial inclusion unlock sustainable growth? Balancing Tech in Education: Protecting Students Online Seamless Remittance: Leatherback Teams Up with YES BANK Verto Pay Redefines Nigerian SME Financial Management Rugby’s Analytics Revolution: How Big Data is Changing the Game Siemon Receives Top Honors from TIA for 2023 Star Awards How can financial inclusion unlock sustainable growth? Check Point Software Technologies Ltd, provider of AI-powered, cloud-delivered cybersecurity platforms, has announced a collaboration with NVIDIA to bolster the security of AI cloud infrastructure. Through integration with NVIDIA DPUs, the Check Point AI Cloud Protect solution aims to thwart threats at both network and host levels. Gera Dorfman, Vice President of Network Security at Check Point Software Technologies, emphasized the increasing sophistication of cyber attacks targeting AI workloads in the cloud. He highlighted the importance of delivering a secure AI cloud solution to safeguard sensitive AI workloads against evolving cyber threats. The rapid expansion of AI has revolutionized workplace efficiency and innovation but has also introduced new attack vectors specifically aimed at AI systems. These threats compromise the integrity of AI models, jeopardizing business outcomes and eroding trust in AI operations. To address these challenges, Check Point and NVIDIA are integrating network and host-level security insights to offer a comprehensive solution that protects AI infrastructures from various cyber threats. Yael Shenhav, Vice President of Networking Products at NVIDIA, emphasized the significance of securing AI clouds, ”As AI becomes more pervasive, securing AI clouds becomes paramount,” said Yael Shenhav, Vice President of Networking Products at NVIDIA. “NVIDIA BlueField 3 enables innovators such as Check Point to offer robust cyber defense measures to secure AI cloud data centers, while also ensuring peak AI performance.” © IT News Africa | All rights reserved. "
}