{
    "title": "Zacks Investment Ideas feature highlights: Nvidia",
    "date": "3/8/2024",
    "url": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-110000342.html",
    "text": "Chicago, IL – March 8, 2024 – Today, Zacks Investment Ideas feature highlights Nvidia NVDA. “The Brady 6”is one of my favorite sports documentaries. The documentary profiles the fascinating and unlikely story of the NFL’s most decorated quarterback (and greatest player) of all time, Tom Brady and the six quarterbacks picked before him (who went on to have no success in the league). Tom Brady was not always the greatest football player of all-time and highly touted. In fact, Brady started as a backup quarterback on a high school football team with zero wins and later was a “bench warmer” for much of his time at the University of Michigan. Eventually, Brady applied for the 2000 NFL draft, though he was regarded as a lower-end prospect. Luckily for Brady, he was selected, though he was one of the last picks in the draft (6th round, 199th pick). The rest is history, as they say. Brady would go on to have one the most decorated NFL careers and would win seven Super Bowls (the most ever). Tom Brady had one of the worst combines in history. His scouting report said, “Lacks mobility and ability to avoid the rush. Lacks a really strong arm. Can’t drive the ball down the field and does not throw a really tight spiral. System-type player who can get exposed if he must ad-lib and do things on his own.” So, if Brady lacked the talent of other players, how did he become so successful? It turns out that “being a system player” has its advantages. Rather than having overwhelming talent or ability, Brady succeeded by knowing the game inside and out and throwing the ball where there was a high probability it would be caught by a wide receiver. He also had the “intangibles,” AKA the qualities or characteristics of a player that are not easily quantifiable or measured by statistics (leadership, work ethic, mental toughness). Long-term Capital Management (LTCM) was a highly touted hedge fund founded by multiple Nobel Prize winners in the early 1990s. Despite their Ivy League resumes, awards, and billions in assets under management, the highly leveraged hedge fund blew up in 1998 and had to be bailed out by the Federal Reserve Bank of New York for more than $3 billion to avoid systemic risk on Wall Street. Like with Brady, real-life execution is far more important than degrees, awards, or attributes. Below Are the Key Differences Between Real Life Trading and Theoretical Trading: It’s Not About What You Make, It’s About What You Can Keep Markets are random enough that one can make money even by randomly selecting a stock symbol and purchasing the stock. However, Wall Street is littered with the graves of “boom and bust investors.” LTCM averaged compound annual returns of 40% before blowing up. The LTCM debacle is evidence that it’s not about what you can make in the market but rather what you can keep. When asked about risk management, the late, great Charlie Munger famously said to avoid “liquor, ladies, and leverage.” LTCM proved that one “Black Swan” (the Russian Financial Crisis in the case of LTCM) event can break a portfolio with outsized risk exposure to the market. Leverage extenuates risk. Savvy investors think about risk first and use leverage sparingly (if at all). The lesson: “There are old traders, and there are bold traders, but there are very few old, bold traders.” ~ Ed Seykota Many academics obsess over economic data, failing to understand the nature of markets. By definition, economic data is stale information. Wall Street is a future discounting device. The proof is in the pudding. For example, Bitcoin bottomed within days after news broke that crypto exchange FTX was rife with fraud. Another example is the equity bottom of late 2023. The day inflation hit 40-year highs; U.S. equities bottomed. Two lessons should be noted for investors: 1. Wall Street trades based on future expectations, not stale data. 2. Stocks tend to bottom on poor news. Many academics and amateur investors use valuation as a timing device. However, in real-world markets, valuations stretch (and high-valuation stocks outperform), and in a bear market, the opposite occurs. For example, many investors complained that Nvidia had a high valuation into 2023. These investors failed to understand that the market anticipated the future and that the company would “grow into its earnings.” Stanley Druckenmiller, arguably the best investor of his generation, said it best: “Earnings don’t move the overall market; it’s the Federal Reserve Board… focus on the central banks and focus on the movement of liquidity. Most people in the market are looking for earnings and conventional measures. It’s liquidity that moves markets. I never use valuation to time the market. I use liquidity considerations and technical analysis for timing.” Unprofitable investors tend to hyperfocus on complex strategies or macroeconomics. That said, successful investors understand that price in itself is news. Price and volume illustrate actual supply and demand not opinions. For this reason, technical information such as price and volume should be the primary focus of investors. After all, only price pays. Be sure to check Zacks.com for part 2 later this afternoon! Since 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report NVIDIA Corporation (NVDA) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}