{
    "title": "Mark Zuckerberg says Nvidia CEO Jensen Huang is basically the Taylor Swift \nof tech",
    "date": "3/27/2024",
    "url": "https://ca.sports.yahoo.com/news/mark-zuckerberg-says-nvidia-ceo-035200241.html",
    "text": "Music has Taylor Swift, and tech has Jensen Huang — at least, according to Mark Zuckerberg. Zuckerberg likened Nvidia's CEO to the pop star on Tuesday. The Meta chief made the comment on a photo of himself and Huang switching jackets in a \"jersey swap.\" Mark Zuckerberg really, really likes Nvidia CEO Jensen Huang. Zuckerberg on Tuesday showed off his \"jersey swap\" with Huang, posting a photo of the moment he swapped his shearling brown jacket for Huang's iconic black leather jacket. Not everyone knew who the Meta chief was posing with — but one person dared to slip into the comments section and ask Zuckerberg who Huang was. Zuckerberg's response? \"He's like Taylor Swift, but for tech,\" Zuckerberg wrote in an Instagram comment on Tuesday. View this post on Instagram A post shared by Mark Zuckerberg (@zuck) This isn't the first time Huang's been described as the tech world's version of Swift. Huang acknowledged the comparisons when he made a joke about having to perform like Swift during Nvidia's GPU Technology Conference on March 18. \"As I was simulating how this keynote was going to turn out, somebody did say that another performer did her performance completely on a treadmill so that she could be in shape to deliver it with full energy,\" Huang said, referencing Swift's grueling training regime for her record-breaking Eras Tour. \"I didn't do that. If I get a low wind at about 10 minutes into this, you know what happened,\" he continued. Yet for Zuckerberg, gushing about Huang isn't just about Swiftie-style fanboying. Huang's work at Nvidia is vital to Meta's survival, given Zuckerberg's professed ambitions for Meta to become a leading player in artificial intelligence. As part of that goal, Zuckerberg has been building up a stockpile of Nvidia's chips, which can be used to train and deploy AI models. Zuckerberg disclosed in an interview with The Verge in January that Meta would own more than 340,000 Nvidia H100 GPUs by the end of 2024. \"We have built up the capacity to do this at a scale that may be larger than any other individual company. I think a lot of people may not appreciate that,\" Zuckerberg told the outlet. The relentless race toward AI domination by companies such as Meta has also placed Huang's Nvidia in an enviable position. Last month, Nvidia's valuation reached $2 trillion, beating out Amazon and Alphabet. Nvidia's worth now also rivals the entire Chinese stock market. Representatives for Nvidia declined to comment on Zuckerberg's remarks on Huang when approached by Business Insider. Read the original article on Business Insider In the most recent trading session, Nvidia (NVDA) closed at $903.56, indicating a +0.12% shift from the previous trading day. The first quarter of fiscal year 2024 has been a bullish one, with \"Mag 7\" powerhouse Nvidia (NVDA) leading the charge. Fundstrat Global Advisors Managing Director and Global Head of Technical Strategy Mark Newton joins Market Domination Overtime to break down the technical trends behind Nvidia. In terms of Nvidia's recent performance Neton states: \"We've seen a little bit of a slowdown in Nvidia, just in the last couple weeks...I don't think that's really all that significant, technically. We have had, even at current levels, which is at, what, 903? The stock is up 400 points which is over 80% from where it started just three months ago. It's been a rocket ship. It's been parabolic. It's given us nearly 35% of the gains in the NASDAQ (^IXIC) and about 25% of the S&P (^GSPC)... I view this as just being a temporary period of consolidation. I still think tech is going to push higher.\" For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. Editor's note: This article was written by Nicholas Jacobino  Just jock things. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. Seven reportedly cost $20 million  The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida They soft-launched their relationship at the supermodel's cookbook event in Miami. Anderson shared the hilarious moment on her Instagram  The \"Late Night\" comedian brutally summed up the former president's media company. Two of Combs' properties were raided by federal agents on Monday amid sex trafficking allegations against the Bad Boy Records founder The Grammy winner celebrated 'Cowboy Carter' in style  \"She speaks out of both sides of her lips,\" Behar jokes of Lara Trump The post ‘The View’: Whoopi Struggles to Collect Herself After Joy Behar Makes Sexual Innuendo About Trump’s Daughter-in-Law | Video appeared first on TheWrap. The Prince of Wales is following his late grandmother's lead The couple followed the sun to the Caribbean island, where they've previously vacationed  On Beyoncé's new album, she covers Dolly Parton's famed 1973 song \"Jolene.\" But Bey takes some liberties and makes some changes. ‘STEVE! (Martin) A Documentary in 2 Pieces,’ streaming on Apple TV+, includes Martin’s hilarious recollection of meeting Elvis Michelle Keegan is enjoying a trip to Australia to film the new series of Ten Pound Poms, and the Fool Me Once star looked incredible in a pair of low-slung jeans and a knitted top. See photo.  Fifty years ago, the pair put aside the pain of the band's breakup to quietly reunite in the studio — and the result is not what you'd expect. “You bring so much joy to my life!” Kardashian wrote of De La Hoya on Instagram Friday “I weigh 162 lbs. right now and want to get back to 110 lbs.,” the former child star, 37, said "
}