{
    "title": null,
    "date": "1/14/2024",
    "url": "https://www.fool.com/investing/2024/01/14/this-magnificent-seven-ai-stock-nvidia-wall-st/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The \"Magnificent Seven\" group of stocks had an absolutely smashing year in 2023. All seven of the market's biggest tech stocks outperformed both the Nasdaq Composite and the S&P 500, and three of the seven stocks doubled last year. However, none performed better than Nvidia (NVDA 0.12%), the chipmaker that has asserted itself as the clear leader in the artificial intelligence (AI) revolution. Nvidia's stock jumped 239% last year, and its results explain why. The company was the clear winner in the early stages of the generative AI boom, as its revenue and profits skyrocketed last year. Revenue jumped 206% in its third quarter from the quarter a year ago, and soaring prices for its in-demand graphics processing units (GPUs) and accelerators have led to bumper profits. Net income on a generally accepted accounting principles (GAAP) basis jumped more than 13 times from $680 million to $9.24 billion, representing a near-50% improvement to its profit margin over the equivalent quarter in the previous fiscal year. While you might expect Nvidia's valuation to have gotten stretched by those gains, the stock actually looks cheaper than it has in a long time because its profits have soared. It trades at a price-to-earnings ratio of 26 based on estimates for the fiscal year that ends in January 2025, and those could easily get revised higher in the coming months, as Nvidia has soared past estimates in its recent quarters. If you're bullish on Nvidia stock, you're not alone. The average Wall Street analyst now expects the stock to jump 20% in 2024, according to TipRanks, and all the 36 analysts covering the stock expect it to gain this year. In the meantime, 32 analysts rate the stock a buy, and four call it a hold. Image source: Getty Images. You only need to look at Nvidia's recent product release at the CES trade show to see why the stock can keep moving higher. The company announced a slate of new products and partnerships, spanning a broad range of chip categories and industries. Overall, the news showed the company has no intention of taking its foot off the gas in the AI race and aims to extend its lead. For example, the company announced a new series of GeForce RTX 40 Super GPUs to improve gaming and generative AI performance, and it's signed up gaming titans like Ubisoft and Tencent to use its new Nvidia Ace AI game-making tool. Getty Images, one of the world's biggest databases of stock photos, said it's launching a new generative AI service powered by Nvidia Picasso, an AI foundry focused on visual design. Nvidia's technology will allow anyone to create 4K imagery from text with an AI model that's been trained on Getty Images' catalog of photos. Finally, the chip giant said that biotech company Amgen is using Nvidia's DGX SuperPOD to train state-of-the-art models to help accelerate drug discovery and development. There's no shortage of applications for Nvidia's chips, as the advent of generative AI has implications for nearly every industry and business. Nvidia's technology is even being used in the retail industry to help prevent organized theft and for personalized shopping advice. Meanwhile, Nvidia is also challenging Intel with three new chips for AI PCs, pushing back against a company expected to challenge Nvidia in AI. Nvidia's series of announcements at CES and comments from the likes of Oracle and OpenAI about a severe shortage of AI components (from Nvidia) show that the generative AI boom is only getting started. Considering that the stock trades at a P/E ratio in line with the broad market, based on the coming year's earnings, the stock looks like a no-brainer buy right now. If generative AI is here to stay, which nearly every tech CEO believes it is, Nvidia stock could still have a lot of room to run higher. Jeremy Bowman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia, Oracle, and Tencent. The Motley Fool recommends Amgen and Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}