{
    "title": "Nvidia and Equinix just partnered on AI supercomputers",
    "date": "1/24/2024",
    "url": "https://invezz.com/news/2024/01/24/nvidia-equinix-partner-on-ai-supercomputers/",
    "text": "Follow Invezz on Telegram, Twitter, and Google News for instant updates > Shares of Nvidia Corp are in the green this morning after the chipmaker announced to have teamed up with Equinix Inc on AI supercomputers. The private cloud-based service will enable businesses to own systems that can run custom generative artificial intelligence models.   Nvidia has trained employees of the data centres company in building and operating its systems. The deal is equally valuable to both companies since corporate customers will pay Nvidia for its systems and Equinix for its staff to build then and run them. The news arrives only days after the semiconductor behemoth announced three new chips to run AI apps on a home PC as Invezz reported here. $NVDA has now more than tripled over the past 52 weeks.  Invest and trade CFD stocks, ETFs, digital assets & commodities in minutes with our highest-rated broker. The new service is available immediately but neither Nvidia Corp nor Equinix reveal any immediate customer in their press release this morning. Are you looking for fast-news, hot-tips and market analysis? \n\n  \n    Sign-up for the Invezz newsletter, today. Note that the fully managed offering helps businesses in terms of data ownership, governance, and management. Jon Lin – the executive vice president of Equinix said in an interview with Reuters today: We want to drive privacy because what we’re hearing at large customers is they are very worried about controlling their own destiny. Our AI Act is the first comprehensive AI regulation in the world.With 3 of the world's 5 most powerful supercomputers in Europe, it is time to capitalise on our digital lead & foster trustworthy AI.Today, we have delivered key AI initiatives announced at #SOTEU ↓#DigitalEU Equinix dubbed the new service a cost-effective means of adopting advanced AI infrastructure on Wednesday as well. Shares of the California-based company are up roughly 1.0% at the time of writing. Copy expert traders easily with Plus500. Invest in stocks like Tesla & Apple. Instantly trade ETFs like FTSE 100 & S&P 500. Sign-up in minutes. Buy or sell stock CFDs with Plus500. 82% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money.  Should you buy Bitcoin before the halving? Should you buy Bitcoin before the halving?  Use Invezz APP Get a better user experience Allow notifications? Allow us to send you updates You must agree to the privacy policy. "
}