{
    "title": "Could Investing $20,000 in Nvidia Make You a Millionaire?",
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/news/could-investing-20-000-nvidia-113700970.html",
    "text": "Semiconductor designer Nvidia (NASDAQ: NVDA) has made many millionaires in recent years. Its stock has more than tripled in the last year alone. Among stocks with a market cap of at least $50 billion today, Nvidia has outperformed absolutely everybody over the past three, five, and 10 years. It's hard to beat this wealth-building machine these days. So what's next? Let's say I scrape together a robust $20,000 Nvidia position today -- can I expect to make a million dollars on that investment? The short answer is yes, but it'll take a while and the lofty target result isn't guaranteed. Looking back, Nvidia's stock chart from the past eight years is nothing short of extraordinary. Starting from a respectable $23 billion market cap in 2016, the company's strategy has shifted along with the market opportunity. Nvidia's expertise in high-performance graphics cards for gaming and professional graphics turned into a crypto bonanza when enthusiasts found the same cards to be excellent for mining Ethereum (CRYPTO: ETH) tokens. Just as Ethereum switched to a different technology with no need for miners, OpenAI came along with its ChatGPT tool, unveiling a new dawn in generative artificial intelligence (AI). Based on the same high-end graphics platforms as the gaming and crypto surges, Nvidia's AI accelerator processors powered the back-end creation of ChatGPT's AI engine. Now, lots of companies with AI-powered ambitions are buying hundreds or even thousands of extremely pricey accelerator chips and Nvidia is the first supplier that comes to mind at this point. It shows in Nvidia's spectacular financial results and the stock chart that follows: The chart above shows the return of a $20,000 investment started on May 16, 2016, resulting in a $1.0 million value nearly 8 years later. That's an average annual return of 67.4%. At the end of that market-crushing chart, Nvidia is worth $1.4 trillion. The stock rose to this height the hard way, delivering top-notch products attuned to the right market opportunities at the right times. The end result is a legendary price gain with record-high investor returns. Sorting the total stock market's 10-year gains, I don't even need to limit the field with a large market-cap requirement to weed out short-lived meme stocks and other gadflies. Nvidia simply offered the strongest decade-long returns of any stock tracked by the screeners at my disposal. But things are different now. It may be difficult to grow a $23 billion market cap 50-fold, but even tougher when you start with a $1.3 trillion stock-value footprint. Even if Nvidia continues to dominate the AI market, and that trend delivers on the most striking predictions for years to come, it's unrealistic to assume an average annual return of 67% for another eight-year run. By the end of that rainbow, Nvidia would be worth $67.6 trillion. That's more than double the gross domestic product (GDP) of the United States, estimated at $26.9 billion in 2023. I'm sorry, but that's going to take a while. Nvidia's past performance has set a high bar and it's important to manage your expectations for the next phase of its AI business. The exceptional gains of recent years are not likely to continue for another 8-year span. That would require not only continued success in the booming AI sector for nearly a full decade, but also sustained hypergrowth in the market itself and unshaken investor confidence in Nvidia's lofty valuation ratios. The stock trades at 72 times earnings and 30 times sales today. These overheated ratios should cool down over time, raising the needed financial support for that $67 trillion market cap in the process. Of course, Nvidia could lower the bar with some accounting tricks. The company can return cash to shareholders by means of generous share buybacks and dividends. Other companies have pursued this strategy before. For example, International Business Machines (NYSE: IBM) has seen its share price fall by 2% over the last 10 years while its market cap shrunk by 14%. At the same time, Big Blue bought back 12% of its issued shares and delivered robust dividend payouts. All in all, IBM investors pocketed a respectable total return of 50% over the same period. Nvidia could attempt a larger-scale version of this, boosting the returns by sharing cash profits with the company's investors. Of course, this cash-sharing idea takes away from the company's freedom to invest in future growth-boosting business plans, so there's a fine line between generosity and growth-blunting missteps. And of course, anything is possible over a long enough time span. America's GDP stopped at $1.5 trillion in 1973, comparable to Nvidia's market value today. Suggesting that any single company could deserve a trillion-dollar market cap would have sounded ridiculous 50 years ago, but here we stand with 6 stocks in the trillion-dollar club. A few decades from now, that $67 trillion target might not look so silly anymore. The real question is, will Nvidia still be around in 2064 or 2074, and will it dominate its chosen markets for that long? I don't think so, but anything is possible. So yes, Nvidia just might be able to grow that a $20,000 investment into a cool million, but it's a long road to that ambitious target and many things can go wrong along the way. Remember, this stock delivered the richest shareholder returns of any company over the last decade, and even that stellar run barely exceeded the 50-fold gain it takes to meet that goal. That being said, I'm not closing out my own Nvidia position anytime soon, though I might take advantage of its recent moonshot by diversifying some of the gains into other investment ideas. I'm still looking at a proven AI giant with a bright future, and its valuation has calmed down a bit in recent weeks. Buying Nvidia stock today makes perfect sense if you can stomach it trading at nosebleed-inducing prices. The next wave of processor orders for AI systems could make the last surge look forgettable by comparison. So feel free to invest in Nvidia today. Just don't expect the incredible returns of the last 8 years to continue for another multi-year span. To make me a happy Nvidia investor, all the company needs to do is deliver stock price gains comparable to or exceeding the stock market as a whole. At an annual clip of 15%, a 50-fold return would materialize after 28 years. Patience is a virtue, dear reader. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 8, 2024  Anders Bylund has positions in Ethereum, International Business Machines, and Nvidia. The Motley Fool has positions in and recommends Ethereum and Nvidia. The Motley Fool recommends International Business Machines. The Motley Fool has a disclosure policy. Could Investing $20,000 in Nvidia Make You a Millionaire? was originally published by The Motley Fool Related Quotes "
}