{
    "title": null,
    "date": "1/8/2024",
    "url": "https://investorplace.com/market360/2024/01/is-nvda-stock-screeching-out-of-the-fast-lane-not-quite/",
    "text": " NVDA stock is slipping but don't assume it is running out of gas Advertisement Source: Sergio Photone / Shutterstock.com Nvidia (NASDAQ:NVDA) stock surged throughout 2023, but has been sliding as investors take some risk off the table by taking profit. Investors can make prudent moves, but their necessity is questionable. The market may have overreacted to anticipated lower interest rates. Despite the company’s impressive performance in 2023, there are indications that growth may slow down more than expected. A surface-level assessment may be causing concerns, but a closer look can change your perspective. Plenty talk about Nvidia’s outsized impact on the broad market’s performance, but it’s not fully a one-way street. Factors that affect overall market sentiment can make a big impact on NVDA’s price performance. Right now, that would be the uncertainty surrounding the future direction of interest rates. Still, while macro-related uncertainty is playing a role, arguably, it’s been more company-specific areas of uncertainty having the largest effect NVDA stock. For months, the U.S. government’s crackdown on chip exports to China has affected sentiment for Nvidia. There are concerns about how this crackdown, and the resultant bans, will affect the company’s future growth. Since last month, Advanced Micro Devices‘ (NASDAQ:AMD) AI chip product launches, plus Intel’s (NASDAQ:INTC) generative AI chip unveiling, have raised concerns related to rising competition and its impact on Nvidia’s growth. While these China and competition-based concerns haven’t shifted sentiment for NVDA from bullish to bearish, they have clearly made some investors hesitant to buy, and have compelled other investors to exit/pare down positions. Again, though, while the overall market is feeling uneasy, that doesn’t mean you need to follow suit. As discussed in prior coverage of NVDA stock, China-related concerns shouldn’t scare you away. Nvidia has figured how to both work around and mitigate the impact of the export bans. When it comes to the most recent non-macro concern about NVDA (rising competition), there’s a lot out there that should assuage your concerns. AMD and Intel could keep making progress (and generate big profits) from capitalizing on the generative AI mega-trend. Still, their success isn’t likely to come at Nvidia’s expensemin the immediate future. While gaining ground, AMD and Intel remain well behind this AI chip frontrunner. According to Srini Pajjuri of Raymond James, Nvidia is projected to hold an 85% share of the AI accelerator chip market this fiscal year (ending January 2025). Nvidia will meet or surpass growth expectations despite competition. In fact, given how NVDA trades for only 24.1 times forward consensus estimates for FY2025 earnings ($19.88 per share, up by around 62.3%), merely meeting expectations may be enough to drive the stock to even loftier price levels in 2024. Here’s how. At some point in time, the AI chip market will inevitably mature. However, it’s an understatement to say that moment is years away from arriving. It may just well be decades away from arriving. In the near-to-medium term, demand for AI accelerators and processors will stay robust and continue to climb. As the dominant name in the space, this points to continued outsized earnings growth for Nvidia. This leaves the stock poised to move higher, in a big way. Shares will move higher in line with increased earnings, but also (most likely), thanks to multiple expansion. Once Nvidia shows that it’s not exiting the fast lane just yet, shares could re-rate to a forward earnings multiple in the 30-40 range. With this, hitting $600, $700, or even $800 per share this year isn’t out of reach for NVDA stock. NVDA stock earns an A rating in Portfolio Grader. On the date of publication, Louis Navellier had a long position in NVDA. Louis Navellier did not have (either directly or indirectly) any other positions in the securities mentioned in this article. The InvestorPlace Research Staff member primarily responsible for this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article. Technology, Artificial Intelligence, Semiconductor   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/01/is-nvda-stock-screeching-out-of-the-fast-lane-not-quite/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Hot Stocks Stocks to Buy Stocks to Sell Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}