{
    "title": "1 No-Brainer AI Stock That Could Rise Over 90% by 2026",
    "date": "1/31/2024",
    "url": "https://www.fool.com/investing/2024/01/31/1-no-brainer-ai-stock-that-could-rise-over-90-by-2/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 0.12%) enjoyed a stellar growth year in 2023, becoming the poster child for a boom in artificial intelligence (AI). The company benefited from a spike in demand for graphics processing units (GPUs), the chips necessary for running and training AI models. As a result, Nvidia's stock is up more than 200% year over year alongside soaring earnings. With excitement over AI unlikely to dissipate in 2024, Nvidia appears to be on a promising growth trajectory, and earnings-per-share (EPS) estimates support this.  Data by YCharts This chart shows Nvidia's earnings could hit $24 per share by fiscal 2026. Multiplying that figure by the company's forward price-to-earnings ratio of 50 yields a stock price of $1,200, projecting growth of 97% over the next two fiscal years. It's a lofty target but based on reasonable financial forecasts. Nvidia's significant potential suggests now is an excellent time to learn more about its business and potentially invest. So, here's why the company is a no-brainer for investing in AI and tech in general. As a leading chipmaker, Nvidia has a powerful position in tech. The company supplies its chips to companies across the industry, with its hardware powering everything from video game consoles to laptops, custom-built PCs, cloud platforms, and, of course, AI models. In fact, the company is the exclusive supplier of chips for the Nintendo Switch, the third-best-selling video game console of all time. The lucrative partnership has provided a steady revenue stream for Nvidia and its chips have landed in the hands of millions of consumers (the Switch has sold more than 130 million units since its launch in 2017). Moreover, Nvidia has seen a boost in earnings thanks to a recovering PC market, which will likely continue improving throughout 2024. According to data from Gartner, PC shipments rose for the first time in over a year in the fourth quarter of 2023, increasing 0.3%. Easing inflation is fueling consumer spending, with Nvidia's PC-centered gaming segment posting revenue growth of 81% in the third quarter of 2024. The company is enjoying major gains from AI, but positions in different areas of tech make its stock one of the most reliable investments over the long term as it benefits from growth catalysts throughout the industry. Nvidia became the first chipmaker to exceed a market cap of $1 trillion last year, making it the world's sixth most valuable company. The tech firm has come a long way since its founding in 1993, almost singlehandedly building the GPU market into what it is today. For years, the high-performance chips were used by and marketed toward gamers. The chips' ability to perform multiple tasks simultaneously made them well equipped for the heavy workloads required for rendering video game visuals and other intensive tasks, such as cryptocurrency mining. As a result, Nvidia's GPUs have become a favorite among PC gamers who use the chips to build high-powered gaming machines. Nvidia's success in desktop GPUs has seen it achieve an over 80% market share in the segment despite similar hardware from Advanced Micro Devices and Intel being available. However, the biggest advantage of Nvidia's command of the GPU market has been its ability to get a head start in AI. While its rivals scrambled to catch up last year, Nvidia was perfectly positioned to immediately begin supplying its chips to the entire AI market as GPU demand soared.  Data by YCharts This chart reflects Nvidia's meteoric rise over the last year. As chip sales have skyrocketed, so has its quarterly revenue, operating income, and free cash flow. Competition in the AI GPU market is expected to heat up this year as AMD and Intel begin shipping their own offerings. However, Nvidia's estimated 80% to 95% market share will be challenging for competitors to overcome. Meanwhile, the AI market's projected compound annual growth rate of 37% until at least 2030 indicates there will be plenty of room for Nvidia to retain its supremacy and welcome newcomers. With Nvidia's projected stock growth of 97% by fiscal 2026, the company is a no-brainer for anyone looking to invest in AI right now. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool recommends Intel and Nintendo and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}