{
    "title": null,
    "date": "1/30/2024",
    "url": "https://finance.yahoo.com/video/amd-downgraded-outperform-ai-revenue-153544525.html",
    "text": "Ahead of Advanced Micro Devices' (AMD) earnings Tuesday afternoon, Raymond James downgraded the chipmaker from Strong Buy to Outperform due to concerns over inflated AI revenue expectations. AMD is set to release results against the backdrop of its newest MI300 chip — a competitor to Nvidia's (NVDA) AI chip — gaining traction. The MI300 has already seen interest from tech giants like Microsoft (MSFT) and Oracle (ORCL). Yahoo Finance's Seana Smith and Brad Smith break down the details. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith SEANA SMITH: All right. It's time for our vibe on the street. And Raymond James downgraded AMD. Now, putting in perspective, they're downgrading from a strong buy to outperform. They're citing elevated AI revenue expectations for the year, especially with NVIDIA maintaining a larger stake within the chip market. Now, this comes as AMD is set to release earnings results after the bell today, and digging in a little bit further into what exactly this call is talking about. A lot of it centers around AMD's new AI chip, which is the MI300. It's a direct rival here to NVIDIA. We know AMD has already secured Microsoft, Meta, Oracle among the customers for their new chip. But the focal point, Brad, in this earnings report after the bell is going to be what demand looks like, specifically, for this new chip. Exactly what this could mean or does it mean as a threat here to NVIDIA's business. And there was a number of analysts weighing in on this. How did these results tonight? Susquehanna, among them, saying, that it is the most important piece of data here for investors in this print. BRAD SMITH: Yeah. Really interesting call here that we got. And we should note that it's still-- it is a downgrade. But it's still an outperform rating. And why? Well, because they had a strong buy on it before. So, ultimately, here, there's still positive largely on the stock. It's just they're not as bullish as they were before. But it's coming back to valuation here. And particularly, this downgrade to outperform from strong buy, they say, valuation. At 33 times 2025 EPS, their analysis is suggesting that the stock is already discounting about 20% of the unit share for AI graphics processing units, which is closer to their bull case here. So that really making up this downgrade, but still net positivity that they have in terms of their sentiment on the stock as of right now. And then additionally, just one other factor here that they did note within this. For the sustained ramp, they're actually going to need to see more partnerships, like, the wins that they saw with Microsoft and Oracle for public clouds here. And they're saying Meta is actually that next key for sustained ramp, as well. SEANA SMITH: Yeah. And it's also going to just give us a better idea in terms of what demand looks like for the chip sector because we certainly did see the Street a bit spooked and worried after the results that we got out from Intel late last week, the disappointing results there. What exactly that could then mean for the broader chip market. So if we do get strong results here, solid results from AMD, that could potentially put some of those fears, at least, leave them out for this time. We'll see how long that sticks, though. Related Quotes "
}