{
    "title": null,
    "date": "1/22/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240122143/nvidia-is-no-longer-morgan-stanleys-top-chip-pick-a-much-different-name-is",
    "text": "By Emily Bary Morgan Stanley is cheering Western Digital's stock as a business separation looms Morgan Stanley no longer considers Nvidia Corp. its No. 1 chip pick, and is now turning to a different part of the sector for its latest top endorsement. Morgan Stanley analyst Joseph Moore has elevated Western Digital Corp.'s stock (WDC) to his No. 1 recommendation, bumping Nvidia's stock (NVDA) down to second place. While artificial intelligence is the hot theme in chips these days, Moore isn't calling out AI so much as cheering the potential for more than 25% upside in shares of Western Digital, which makes computer data-storage products. He sees an \"extremely compelling\" valuation gap between Western Digital shares and peer names, and he's upbeat that an upcoming separation of the memory- and hard-drive chip company will translate to value for investors. \"While the market appeared to favor consolidation scenarios, the decision to separate the hard-disk-drive and memory assets towards the end of the year actually simplifies the story completely,\" Moore wrote in a Monday note to clients. He also flagged improvements in NAND memory trends as a tailwind. \"We are seeing NAND prices up more than 20% [on a sequential basis in the first quarter], more in some areas,\" he wrote. \"Given that the company had already guided to positive gross margins in the December quarter, we should already be at midcycle gross margins in the March quarter, in contrast to memory peers.\" Don't miss: Why Marvell just dethroned Nvidia as Citi's top chip-stock pick Admittedly, Moore has a \"somewhat mixed\" view of the longer-term NAND cycle, noting that \"fab utilization is quite low, and will rise imminently.\" That trend is \"bad for economics,\" he continued, but there have also been few new entrants into the NAND market recently. He upped his price target on the stock to $73 from $52, with the new target representing 27% upside from midday levels Monday. The stock was trading up 5.2% at last check Monday. Moore continues to like Nvidia's stock, which is his top pick among compute names, though he called out the strong stock-market rally for the maker of graphics processing units over the past month: It's gained 22% in that span. \"All of the AI stocks have rallied, and with the potential for AI tocome off of allocation in [the second half of 2024], there could be some headwinds to consider,\" he said. \"That said, Nvidia has rallied less than other companies in the AI supply chain, while retaining the premiere position, and does have material upside for the next couple of quarters at least, and key products such as H200 and B100 should add to investor comfort with the company's market leadership.\" See also: If Nvidia looked more like Salesforce, it might unlock billions more in cash, analyst says -Emily Bary This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 01-22-24 1306ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}