{
    "title": "NVDA: What Lies Ahead for NVDA and TSM in the Chip Landscape in 2024",
    "date": "1/23/2024",
    "url": "https://stocknews.com/news/nvda-tsm-what-lies-ahead-for-nvda-and-tsm-in-the-chip/",
    "text": "Login \n        Join Login \n                                            Join NVDA – Following last year’s slowdown, the semiconductor industry is positioned to witness a solid rebound in 2024, fueled by resurgent market demand, the rising popularity of technologies like generative AI and HPC, and growing government incentives. So, let’s analyze what lies ahead for NVIDIA (NVDA) and Taiwan Semiconductor Manufacturing (TSM) in the chip landscape this year. Read on to know more…. Jan 23, 2024 The semiconductor industry’s 2024 outlook appears promising, driven by the recovery in demand, especially in two prominent end markets, PCs and smartphones and numerous technological innovations. Moreover, the heightened attention to the strategic importance of chip manufacturing to national and economic security is a crucial catalyst of the industry’s growth. Amid this backdrop, fundamentally sound chip stock Taiwan Semiconductor Manufacturing Company Limited (TSM) seems well-poised to capitalize on the industry’s tailwinds. However, given its mixed prospects, investors could wait for a better entry point in NVIDIA Corporation (NVDA). Semiconductors are a crucial component in multiple applications across end-use sectors, including consumer electronics, automotive, computing, networking and communications, industrial equipment, healthcare, military, and clean energy. In addition, the growing popularity of technologies like AI, machine learning, and IoT will offer growth opportunities to chip companies. In 2023, the semiconductor industry had a challenging year, the seventh downturn since 1990, with sales projected to decline 9.4% (to $520 billion) for the year. However, the industry is well-positioned to rebound in 2024, with global chip sales reaching an impressive $588 billion, indicating a 13% year-over-year growth. The memory sector is a vital driver of this growth. In terms of end markets, both PC and smartphone sales are anticipated to increase by 4% this year, following declines of 14% and 3.5% in 2023, respectively. Returning to growth for these two end-use sectors is very important for the semiconductor industry. As we enter 2024, semiconductor companies will increasingly emphasize on product innovations, targeting developments in generative AI and large language models (LLMs) and boosting demand for high-performance GPUs in data centers and high-performance computing (HPC). According to Deloitte, the market for AI chips appears to be strong in 2024 and is predicted to reach more than $50 billion in sales for the year or 8.5% of the value of all chips to be sold. In the long term, some forecasts suggest that AI chips (mainly gene AI chips) could total $400 billion in sales by 2027. Favorable government initiatives further drive the chip industry’s prospects. In August 2022, President Biden signed the CHIPS Act of 2022 into a law that allocated about $52.70 billion over the next five years to boost domestic manufacturing and research and development (R&D) of semiconductors. 10 STOCKS TO SELL NOW! “Resurgent market demand and increased government incentives worldwide are powering an upsurge in fab investments in key chipmaking regions and the projected 6.4% rise in global capacity for 2024,” said Ajit Manocha, SEMI President and CEO. As per SEMI’s latest quarterly World Fab Forecast report, the global semiconductor capacity is projected to rise by 6.4% this year to reach record high 30 million wafers per month (wpm) mark for the first time after increasing 5.5% to 29.6 wpm in 2023. Given the industry trends in mind, let’s look at the fundamentals of the two Semiconductor & Wireless Chip stocks. Stock to Hold: Stock #2: NVIDIA Corporation (NVDA) NVDA designs and manufactures computer graphics processors, chipsets, and related multimedia software. It operates through Graphics and Compute & Networking segments. Its products are used in gaming, professional visualization, datacenter, and automotive markets. It sells its products to original equipment manufacturers, system builders, and retailers/distributors. On January 8, 2024, NVDA announced that Li Auto, a leader in extended-range EVs, selected the NVIDIA DRIVE Thor™ centralized car computer to power its next-generation fleets. Also, EV makers GWM (Great Wall Motor), ZEEKR, and Xiaomi have adopted the NVIDIA DRIVE Orin​​™ platform to power their intelligent automated driving systems. “The AI car computer of choice for today’s intelligent fleets is NVIDIA DRIVE Orin, with automakers increasingly looking to the advanced capabilities and AI performance of its successor, NVIDIA DRIVE Thor, for their future vehicle roadmaps,” said Xinzhou Wu, vice president of automotive at NVDA. On the same day, NVDA introduced GeForce RTX™ SUPER desktop GPUs for supercharged generative AI performance, new AI laptops from every top manufacturer, and new NVIDIA RTX™-accelerated AI software and tools for both developers and consumers. In order to meet growing consumer demand, the company is delivering innovations across its full tech stack, driving new experiences and building on the 500+ AI-enabled PC applications and games already accelerated by NVIDIA RTX technology. In terms of forward non-GAAP P/E, NVDA is trading at 48.49x, 93.7% higher than the industry average of 25.03x. Also, the stock’s forward EV/Sales and Price/Sales multiples of 24.85 and 24.97 are significantly higher than the industry averages of 2.91 and 2.90, respectively. NVDA’s trailing-12-month gross profit margin of 69.85% is 42.7% higher than the industry average of 48.95%. Likewise, the stock’s trailing-12-month EBITDA margin and net income margin of 49.39% and 42.10% are higher than the respective industry averages of 9.28% and 1.91%. For the fiscal 2024 third quarter that ended October 29, 2023, NVDA revenue increased 205.5% year-over-year to $18.12 billion. Its non-GAAP operating income rose 652.4% from the previous year’s quarter to $11.56 billion. Its non-GAAP net income and non-GAAP EPS were $10.02 billion and $4.02, up 588.2% and 593.1% year-over-year, respectively. However, the company’s total current liabilities increased to $9.10 billion as of October 29, 2023, compared to $6.56 billion as of January 29, 2023. As per its outlook for the fourth quarter of fiscal 2024, NVDA’s revenue is expected to be $20 billion, plus or minus 2%. The company expects its non-GAAP gross margin to be 74.5% and 75.5%, respectively, plus or minus 50 basis points. Its non-GAAP income and expense are anticipated to be an income of nearly $200 million, excluding gains and losses from non-affiliated investments. Analysts expect NVDA’s revenue and EPS for the fourth quarter (ending January 2024) to increase 233.8% and 412.5% year-over-year to $20.20 billion and $4.51, respectively. Further, the company has surpassed consensus revenue and EPS estimates in all four trailing quarters. NVDA’s stock has gained 21.5% over the past month and 33.7% over the past six months to close the last trading session at $596.54. NVDA’s mixed fundamentals are reflected in its POWR Ratings. The stock has an overall rating of C, which translates to a Neutral in our proprietary rating system. The POWR Ratings are calculated by considering 118 different factors, each weighted to an optimal degree. NVDA has an A grade for Growth and Sentiment. But the stock has an F grade for Value and a D for Stability. Within the Semiconductor & Wireless Chip industry, it is ranked #29 of 91 stocks. Click here to access additional ratings of NVDA (Quality and Momentum). Stock to Buy: Stock #1: Taiwan Semiconductor Manufacturing Company Limited (TSM) Headquartered in Hsinchu City, Taiwan, TSM, together with its subsidiaries, manufactures, packages, tests, and sells integrated circuits and other semiconductor devices internationally. The company’s products are used in high-performance computing, smartphones, the Internet of Things (IoT), automotive, and digital consumer electronics. On September 27, 2023, TSM announced the 3Dblox 2.0 open standard and significant achievements of its Open Innovation Platform® (OIP) 3DFabric Alliance at the 2023 OIP Ecosystem Forum. The 3Dblox 2.0 features 3D IC design capability that aims to drive design efficiency, and the 3DFabric Alliance will boost memory, substrate, testing, manufacturing, and packaging integration. The company continues to push the envelope of 3D IC innovation, making its comprehensive 3D silicon stacking and advanced packaging technologies accessible to customers, allowing them to reach an entirely new level of performance and power efficiency for the next-gen AI, high-performance computing (HPC), and mobile applications. In terms of forward non-GAAP P/E, TSM is trading at 18.05x, 28.3% lower than the industry average of 25.15x. The stock’s forward EV/EBITDA multiple of 8.59 is 46.6% lower than the industry average of 16.08. Further, its forward Price/Cash Flow of 10.85x is 53.3% lower than the industry average of 23.25x. TSM’s trailing-12-month EBIT margin of 42.63% is 799.7% higher than the 4.74% industry average. Moreover, its trailing-12-month gross profit margin and net income margin of 54.36% and 38.79% are favorably compared to the industry averages of 49.06% and 1.89%, respectively. TSM’s net sales increased 14.4% quarter-over-quarter to NT$625.53 billion ($19.94 billion) for the fourth quarter that ended December 31, 2023. Its gross profit grew 11.8% from the prior quarter to NT$331.77 billion ($10.58 billion). The company’s income from operations was NT$260.21 billion ($8.29 billion), an increase of 14.1 from the previous quarter. In addition, the company’s income before tax rose 15% quarter-on-quarter to NT$278.28 billion ($8.87 billion). Its net income and EPS came in at NT$238.71 billion ($7.61 billion) and NT$9.21, up 13.1% quarter-over-quarter, respectively. As per the company’s current business outlook for the first quarter of 2024, the management expects revenue to be between $18 billion and $18.80 billion. TSM’s gross profit margin and operating profit margin are expected to be 52%-54% and 40%-42%, respectively. The management further expects the 2024 capital budget to be between $28 billion and $32 billion. Street expects TSM’s revenue for the fiscal year (ending December 2024) to increase 23.6% year-over-year to $84.61 billion. The company’s revenue for the ongoing year is expected to grow 20.9% year-over-year to $6.26. Moreover, TSM topped consensus EPS estimates in each of the trailing four quarters, which is impressive. Shares of TSM have gained 15% over the past six months and 18.2% over the past year to close the last trading session at $113.03. TSM’s POWR Ratings reflect this robust outlook. The stock has an overall rating of B, which translates to a Buy in our proprietary rating system. The stock has a B grade for Momentum, Quality, and Sentiment. Within the Semiconductor & Wireless Chip industry, TSM is ranked #14 of 91 stocks. In addition to the POWR Ratings we’ve stated above, we also have TSM ratings for Growth, Value, and Stability. Get all TSM ratings here. What To Do Next? Get your hands on this special report with 3 low priced companies with tremendous upside potential even in today’s volatile markets: 3 Stocks to DOUBLE This Year > Want More Great Investing Ideas? 3 Stocks to DOUBLE This Year Updated: 2024 Stock Market Outlook > 10 Stocks to SELL NOW! NVDA shares were unchanged in premarket trading Tuesday. Year-to-date, NVDA has gained 20.46%, versus a 1.71% rise in the benchmark S&P 500 index during the same period. Mangeet’s keen interest in the stock market led her to become an investment researcher and financial journalist. Using her fundamental approach to analyzing stocks, Mangeet’s looks to help retail investors understand the underlying factors before making investment decisions. More... Copyright © 2024. Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions.Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use, please see disclaimer. "
}