{
    "title": "AT&T's outage nightmare, Nvidia smashes records, Capital One-Discover merger",
    "date": "2/24/2024",
    "url": "https://www.foxbusiness.com/markets/atts-outage-nightmare-nvidia-smashes-records-capital-one-discover-merger",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy The president of Yardeni Research Inc. gives his take on mitigating pessimism in the stock market and says the economy is 'very resilient' on 'Making Money.' — A nationwide cell phone outage stemmed from AT&T and left customers holding the phone — Nvidia smashes records taking the Dow, S&P 500 and Nasdaq along for the ride — Capital One and Discover plan to merge, creating credit card monster — Walmart wins delivering dividend boost ahead of stock split — Trio of U.S. airlines hike fees — Moon Landing draws cheers TOP STORY - AT&T CELL COLLAPSE: A wild nationwide cell phone outage that lasted an entire day left customers on hold and put AT&T in the crosshairs…continue reading here. VIDEO: This is a 'big black eye' for AT&T: Kurt Knutsson. NAILS IT!: Chip giant Nvidia cemented its AI MVP title after posting triple-digit increases in both profit and revenue, sending shares skyrocketing and the U.S. stock indices to record highs…continue reading here. Nvidia 1-Week  (FOXBusiness.com) VIDEO: Nvidia is the 'MVP' of the tech, AI, semiconductor markets. MONSTER DEAL: Capital One and Discover plan to merge in a $33 billion deal, which will make the combo the largest credit card company in the nation…continue reading here. WALMART WINNING: Business at the world's largest retailer is so good that the company announced a big dividend boost and a $2.3 billion deal…continue reading here. This ahead of its strategic 3-for-1 stock split set for this coming Monday…continue reading here. VIDEO: Walmart's U.S. CEO on how to rally store associates. Walmart - 1-Year: +23% - Stock Split Set for 2/26/24. FOLLOW THE FOX BUSINESS DEBT TRACKER: HERE HIKING FEES: Three major U.S. airlines are all raising fees for travelers in the latest sign that inflation is not going away…continue reading here. MOONSHOT!: For the first time in half a century, Intuitive Machines’ Odysseus lunar lander touched down on the moon…continue reading here. VIDEO: BLAST OFF! See the rocket launch. A SpaceX Falcon 9 rocket lifts off from launch pad LC-39A at the Kennedy Space Center with the Intuitive Machines' Nova-C moon lander mission, in Cape Canaveral, Florida, on Thursday, February 15, 2024. (Gregg Newton/AFP via Getty Images / Getty Images) UP NEXT: -Looking for more business and market-moving headlines? Find more from FOX Business here. -Want live updates? Get the FOX Business app here. -Did someone forward you this email? Subscribe to additional newsletters from Fox News and FOX Business here. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}