{
    "title": "Rail Vision Joins NVIDIA Metropolis to Boost Railway Safety Systems",
    "date": "2/29/2024",
    "url": "https://www.globenewswire.com/en/news-release/2024/02/29/2838012/0/en/Rail-Vision-Joins-NVIDIA-Metropolis-to-Boost-Railway-Safety-Systems.html",
    "text": "February 29, 2024 08:47 ET\n\n\r\n            | Source:\r\n            \nRail Vision Ltd.\n\n\n\n\n\nRail Vision Ltd. Rail Vision uses the NVIDIA Jetson and other NVIDIA edge AI platforms in its advanced railway safety systems Ra’anana, Israel, Feb.  29, 2024  (GLOBE NEWSWIRE) -- Rail Vision Ltd. (Nasdaq: RVSN) (the “Company”), a technology company at the forefront of revolutionizing railway safety and the data-related market, today announces that it is joining NVIDIA Metropolis, a partner program, application framework, and set of developer tools focused on bringing to market a new generation of vision AI applications. This signifies a significant step forward in Rail Vision’s commitment to advancing rail safety and efficiency through cutting-edge technologies. NVIDIA Metropolis makes it easier and more cost-effective for enterprises, governments, and integration partners to use world-class, AI-enabled technologies to improve critical operational efficiency and solve safety problems. The Metropolis ecosystem contains a large and growing breadth of members investing in advanced AI techniques and efficient deployment platforms and uses an enterprise-class approach to their solutions. Metropolis members can gain early access to NVIDIA platform updates to enhance their AI application development efforts. Additionally, the program offers the opportunity for members to collaborate with industry-leading experts and other AI-driven organizations. By joining Metropolis, Rail Vision hopes to gain a significant advantage in developing and deploying AI-driven solutions that are tailored to the unique needs of the rail sector through the opportunity of leveraging NVIDIA’s extensive technological expertise and integrating its cutting-edge technology. Rail Vision uses the NVIDIA Jetson and other NVIDIA edge AI platforms, which provide accelerated computing in compact and energy-efficient modules, and also uses the NVIDIA TensorRT software development kit for high-performance deep learning inference. About Rail Vision Ltd. Rail Vision is a technology company that is seeking to revolutionize railway safety and the data-related market. The Company has developed cutting-edge, artificial intelligence-based, industry-leading technology specifically designed for railways. The Company has developed its railway detection and systems to save lives, increase efficiency, and dramatically reduce expenses for the railway operators. Rail Vision believes that its technology will significantly increase railway safety around the world, while creating significant benefits and adding value to everyone who relies on the train ecosystem: from passengers using trains for transportation to companies that use railways to deliver goods and services. In addition, the company believes that its technology has the potential to advance the revolutionary concept of autonomous trains into a practical reality. For more information, please visit https://www.railvision.io/ Forward-Looking StatementsThis press release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act and other securities laws. Words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “seeks,” “estimates” and similar expressions or variations of such words are intended to identify forward-looking statements. For example, the Company is using forward-looking statements when it discusses how it hopes to gains a significant advantage in developing and deploying AI-driven solutions that are tailored to the unique needs of the rail sector through the opportunity to of leverage leveraging NVIDIA’s extensive technological expertise and integrate integrating its cutting-edge technology. Forward-looking statements are not historical facts, and are based upon management’s current expectations, beliefs and projections, many of which, by their nature, are inherently uncertain. Such expectations, beliefs and projections are expressed in good faith. However, there can be no assurance that management’s expectations, beliefs and projections will be achieved, and actual results may differ materially from what is expressed in or indicated by the forward-looking statements. Forward-looking statements are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in the forward-looking statements. For a more detailed description of the risks and uncertainties affecting the Company, reference is made to the Company’s reports filed from time to time with the Securities and Exchange Commission (“SEC”), including, but not limited to, the risks detailed in the Company’s annual report on Form 20-F filed with the SEC on March 23, 2023. Forward-looking statements speak only as of the date the statements are made. The Company assumes no obligation to update forward-looking statements to reflect actual results, subsequent events or circumstances, changes in assumptions or changes in other factors affecting forward-looking information except to the extent required by applicable securities laws. If the Company does update one or more forward-looking statements, no inference should be drawn that the Company will make additional updates with respect thereto or with respect to other forward-looking statements. References and links to websites have been provided as a convenience, and the information contained on such websites is not incorporated by reference into this press release. Rail Vision is not responsible for the contents of third-party websites. Investor RelationsMichal Efraty+972-(0)52-3044404michal@efraty.com ContactsShahar HaniaChief Executive OfficerRail Vision Ltd.15 Ha'Tidhar StRa'anana, 4366517 IsraelTelephone: +972- 9-957-7706  "
}