{
    "title": "What's Going On With Nvidia Stock Friday? - NVIDIA (NASDAQ:NVDA)",
    "date": "2/2/2024",
    "url": "https://www.benzinga.com/government/24/02/36910198/whats-going-on-with-nvidia-stock-friday",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Nvidia Corp’s NVDA RTX 4090 graphics cards became a sought-after commodity across Asia, particularly in Taiwan’s Guanghua Digital Plaza, where purchasing agents emptied shelves in a frenzy last October. The cash-rich buyers aimed to resell the cards in markets restricted by the U.S., exploiting a lucrative price gap. The RTX 4090, initially designed for rendering high-quality images in video games and capable of AI model training, found a booming market in Hong Kong and China amid U.S. export controls aimed at curbing China’s AI advancements, the Nikkei Asia reports. Previous reports indicated how the U.S. sanctions led to a captive underground market for AI chips in China. Meanwhile, the chip designer has started taking pre-orders for its latest AI chip, the H20, designed with the Chinese market in mind and positioned to directly challenge Huawei Technologies Co’s similar offerings in terms of price. Nvidia is marketing its H20 chip, priced between $12,000 and $15,000, to match the price point of Huawei’s 910B chip. Nvidia CEO Jensen Huang highlighted the growing global demand for the company’s products as countries like India, Japan, France, and Canada invest in building their AI infrastructures to harness and utilize their data domestically. During an interview in Canada, Huang emphasized the strategic importance of sovereign AI capabilities and the expansion of data centers requiring Nvidia’s technology, Bloomberg reports. With Nvidia’s sales doubling in the fiscal year due to AI investments from significant clients like Microsoft Corp MSFT and Alphabet Inc GOOG GOOGL, Huang aims to broaden Nvidia’s customer base by encouraging more corporations and government agencies to develop their infrastructure, positioning Nvidia as a critical player. The Biden administration’s 2022 restrictions on high-end chip exports to China, including Nvidia’s A100 and H100 models, were tightened in October to include redesigned versions for China, the A800 and H800, and the RTX 4090. Nvidia adapted by redesigning its chips to comply with new rules, although these chips have yet to hit the market. Despite these efforts, the RTX 4090 remains in high demand for its gaming and AI capabilities, now sold at significantly marked-up prices due to scarcity. Retailers across Singapore, Vietnam, and South Korea reported shortages and price surges, while in Taipei, sellers adjusted sales policies to manage the rush, highlighting the challenges of enforcing U.S. controls. Even as Nvidia and other companies navigate complex export controls, the demand for these chips in China remains undiminished, reflecting the ongoing tussle between technological advancement and regulatory restrictions. Nvidia stock gained over 190% last year beating the broader indexes by a high margin. Analysts tout Advanced Micro Devices, Inc AMD as the second most significant AI beneficiary after Nvidia. AMD gained over 93% last year. Price Action: NVDA shares closed higher by 2.02% at $643.01 on the last check Friday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Image Via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}