{
    "title": "2 Artificial Intelligence Stocks You Can Buy and Hold for the Next Decade",
    "date": "2/17/2024",
    "url": "https://finance.yahoo.com/news/2-artificial-intelligence-stocks-buy-183000048.html",
    "text": "Artificial intelligence (AI) is one of the hottest technology trends right now, and investors broadly are looking to invest in companies that could win big from this tech. That's natural, as AI has the ability to transform multiple industries and contribute significantly to the global economy over the next decade and beyond. According to a forecast from Bloomberg Intelligence, the generative AI market could generate a whopping $1.3 trillion in revenue in 2032, accounting for 12% of all tech spending in that year. That would be a massive jump over this year's estimate of $137 billion in generative AI spending. With that outlook in mind, now would be a good time for investors to buy and hold shares of solid companies that are positioned to capitalize on the looming growth of this lucrative market. Nvidia (NASDAQ: NVDA) and Palantir Technologies (NYSE: PLTR) are already taking advantage of this huge opportunity. While Nvidia's graphics processing units (GPUs) are critical hardware for training and powering large language models (LLMs), Palantir is helping customers integrate AI into their operations and use it to improve productivity with its software platform. Here's why investors should consider buying these two AI stocks and holding them for the next decade. The demand for chips capable of powering AI applications is set to soar big time in the coming decade. According to Allied Market Research, the AI chip market could generate annual revenue of roughly $384 billion in 2032 as compared to just $15 billion in 2022. Nvidia currently has about a 90% share of the AI chip market, which puts it in a solid position to make the most of this opportunity. The good part is that Nvidia is already witnessing eye-popping growth. The company will release its fiscal 2024 results next week, and analysts are expecting it to report that its revenue increased 119% to $59 billion. What's more, Nvidia's earnings are expected to jump from $3.34 per share in fiscal 2023 to $12.33 in fiscal 2024 thanks to the tremendous pricing power it enjoys in AI chips. More importantly, Nvidia's business is expected to grow at a healthy rate. That's evident from the chart below, which also shows that analysts have been raising their growth expectations. Again, Nvidia's earnings are forecast to increase at an astounding compound annual rate of 102% over the next five years. All this explains why Nvidia is one of the top AI stocks you could buy right now, especially considering that the company is moving quickly to ensure that it remains the top player in this market. For instance, Nvidia updated its product roadmap last year to stay ahead of its competitors. It will be releasing updated AI chips every year instead of following a two-year cycle. That schedule could help Nvidia maintain its impressive share of the AI chip market. And now, reports suggest that Nvidia is looking to make custom AI chips as well. Reuters reports that Nvidia is bringing up a new business unit to make bespoke AI chips for cloud infrastructure service providers and others. Though the demand for Nvidia's GPUs has been so strong that would-be customers may have to wait for as long as a year to get their hands on them, some companies have also been developing custom chips internally to tackle specific AI-related workloads. Moving into this market is going to open another lucrative revenue opportunity for Nvidia; the custom chip market was worth an estimated $30 billion last year. In all, it can be said that Nvidia could remain the top AI semiconductor pick over the next decade considering the potential growth on offer and the company's current market share. Also, Nvidia trades at 35 times forward earnings, which is a discount to its five-year average forward earnings multiple of 42. As such, investors would do well to buy it right now -- its sunny AI prospects could lead to healthy gains over the next decade. While Nvidia is one of the best ways to tap the AI hardware market, Palantir Technologies gives investors an opportunity to benefit from the software side of things. Market research provider Precedence Research predicts that the AI software market could generate a whopping $1 trillion in revenue in 2032. To hit that would require it to clock a compound annual growth rate of almost 23% over the next decade. Market research firm IDC ranked Palantir No. 1 in the global AI software platform market in 2021 in terms of both market share and revenue. The company's latest results indicate that the AI software opportunity will soon start driving meaningful growth. While Palantir's revenue in Q4 2023 was up 20% year over year to $608 million, its commercial business grew by 32% to $284 million. The faster growth of the commercial business was a result of the growing adoption of Palantir's Artificial Intelligence Platform (AIP) by customers. Palantir witnessed a 44% year-over-year increase in the number of commercial customers last quarter. What's more, the adoption of AIP helped Palantir close 103 deals worth over $1 million last quarter -- twice as many as in the prior-year period. \"The demand is off the charts for AIP, with bootcamps as the delivery mechanism for AIP, and we're seeing AIP drive the expanding addressable market, that we're seeing,\" said Chief Revenue Officer and Chief Legal Officer Ryan Taylor on the latest earnings conference call. So Palantir could be at the beginning of a huge growth curve. Certain analysts assert that the company may be sitting on a potential revenue opportunity of $1 trillion in the AI software space. Analysts' consensus forecast is that Palantir's earnings will increase at a compound annual rate of 85% for the next five years. Considering the huge end-market opportunity the company is sitting on, it could sustain impressive levels of growth for a longer period and deliver healthy gains over the next decade, which is why investors should consider buying this tech stock before it flies higher following its terrific gains in the past year. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 12, 2024 Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia and Palantir Technologies. The Motley Fool has a disclosure policy. 2 Artificial Intelligence Stocks You Can Buy and Hold for the Next Decade was originally published by The Motley Fool Related Quotes "
}