{
    "title": null,
    "date": "2/9/2024",
    "url": "https://www.palmbeachgroup.com/palm-beach-daily/are-meta-microsoft-and-nvidia-now-bad-ai-investments/",
    "text": "Ever wondered how to make $27 billion in just 15 minutes? Mark Zuckerberg has your answer. Last Friday, his company, Meta Platforms (META), saw its stock price skyrocket higher by 19%. It took the market cap of the company from just over $1 trillion to $1.2 trillion. Zuckerberg, the CEO and co-founder of Meta, owns 13.5% of the tech giant. So when the stock rallied 19% in minutes, the value of his stake increased by about $27 billion. The percentage gain alone is every investor’s dream – double digits in a day is a great result. But when you consider the value that gain added to Meta, that’s when things get wild. Here are some other ways of looking at it… In 15 minutes, Meta added more value than: It’s a long list, and I’m sure you get the picture. And when you put it in perspective like that, it’s the biggest single move in value of any company in any market in the world… ever. The question is, why? What triggered this mega-move from Meta? And can we expect more? Big Tech is flying over the last year. So is this a train you want to be on board, or has it pulled into its proverbial final stop? Meta’s market cap is now on a trajectory toward $2 trillion. The reason is simple: It smashed the expectations on its earnings results last week. And the forward-looking part of its release was heavily tilted toward one thing… Artificial intelligence (AI). Susan Li, Meta’s chief financial officer, said in her commentary, “We expect higher infrastructure-related costs this year.” She went on to say, “We also expect to incur higher operating costs from running a larger infrastructure footprint.” So Meta is warning that costs are going to increase. Why the mania then? Well, we know where those costs are coming from. When they say “infrastructure,” they really mean the hardware running their AI. Zuckerberg recently said that by the end of this year, Meta will be running around 350,000 Nvidia H100 graphics processing units (GPUs). I found an H100 GPU to buy online… And it costs over $40,000: Now, Meta is unlikely paying top dollar for its H100s. But if it did, we’re talking about $14 billion in GPU costs. That may be why Zuckerberg said AI will be the company’s biggest investment in 2024. So, yes, AI is still driving mega-cap Big Tech to seemingly never-ending new highs. The investor in me now thinks, well… How high can these companies go? Nvidia is still ripping higher (thanks in part to companies like Meta buying up all its tech). And it’s fast closing in on a $2 trillion market cap. However, even when you combine both their market caps, they still fall about $158 million short of the titan that is Microsoft. Microsoft recently crossed the $3 trillion mark in terms of market cap. A little while back (before I joined Palm Beach Research Group), I wrote in another publication that Microsoft was the kind of stock I think investors should avoid. Now, truth be told, I wasn’t saying Microsoft was a bad investment. In fact, over the last year, it’s been an incredible performer. And there’s plenty of great reasons to consider it for a portfolio even now. But my argument was that one of the things you’ve got to consider with any investment is opportunity cost. When you put capital into one investment, what are you forgoing by not putting it into something else? For instance, Microsoft is up about 54% in the last year. That’s a great winner in anyone’s book. But Meta is up 166%. And yes, a big part of that was last week’s move. But even before that, it was up around 126%. Would you have preferred Microsoft or Meta over the last year? Nvidia, too, is up 219% in the last year. That’s bonkers for a mega-cap stock. Again, though, that’s great, but what about other AI stocks? You can do well in companies like Microsoft, but at what cost? Have you ever heard of Super Micro Computer (SMCI)? It makes data center servers and develops storage and networking technologies. In days gone by, data center tech has been kind of boring. But now with the fancy AI wrapper on it, investors are starting to realise AI really means data… lots and lots of data. This equates to bigger spending on data centers and data storage and networking tech. And that means companies like Super Micro are also riding the AI wave higher. If you think Meta, Nvidia, and Microsoft have been great AI stocks in the last year… Super Micro was trading at about $90 this time last year. Today, it’s up around $620 at the time of writing. That’s a 588% gain. All that has come from an increase in demand for AI hardware. It’s meant Super Micro has seen record revenues, big profits, and increases in its forward-looking revenue numbers. CEO Charles Liang said in the company’s latest earnings release, “Our current end customers continue to demand more of Super Micro’s optimized AI computer platforms and rack-scale Total IT Solutions.” Again, it’s AI driving the company forward. Symbotic (SYM) is another company that’s largely overlooked. Its AI application isn’t as obvious as some. The company itself is in the business of automating warehouses. That means AI-powered robots and software to pick stock, move pallets, and load trailers. Over the last year, Symbotic’s stock price has gone from around $17 to $50, a tidy 194% turnaround. OK, so not quite Nvidia levels, but still beating out Meta and Microsoft. Of course, you can’t invest in everything. And you won’t always pick the big winners. But what’s very clear is that it’s not just Big Tech that wins as AI grips the markets. In fact, I’d say the smarter move is to broaden your horizons. Yes, you can do well with companies like Microsoft, Meta, and Nvidia. And they still may prove to be solid blue-chip investments that should be considered for the right part of a portfolio. But will they do in 2024 what they did in 2023? Or is it worth looking at companies that aren’t as obvious when you think of AI? What about companies involved in robotics and automation? “Boring” data center and server companies? Or companies that are on the edge of developing new kinds of computing and processing that will level up AI in the future? My take is Microsoft, Meta, and Nvidia aren’t bad stocks. It’s just that if you’re looking for outsized returns in 2024, then maybe the less obvious plays are the smarter ones. Until next time, Sam Volkering\nAnalyst, Palm Beach Daily P.S. After revolutionizing online payment processing (PayPal), space exploration (SpaceX), and the auto industry (Tesla)… Elon Musk is getting ready to do it again with his new AI venture. This could be bigger than PayPal, SpaceX, and Tesla – combined. So click here to watch a shocking two-minute live demonstration of Musk’s AI. Signing up for Palm Beach Daily will help you grow your bottom line and live a happier life in just three minutes a day. Signing up for Palm Beach Daily will help you grow your bottom line and live a happier life in just three minutes a day. Reading Palm Beach Daily will help you grow your bottom line and live a happier life in just three minutes a day.  Reading Palm Beach Daily will help you grow your bottom line and live a happier life in just three minutes a day. Reading Palm Beach Daily will help you grow your bottom line and live a happier life in just three minutes a day. Protected by copyright laws of the United States and international treaties. This website may only be used pursuant\nto the subscription agreement and any reproduction, copying, or redistribution (electronic or otherwise, including\non the World Wide Web), in whole or in part, is strictly prohibited without the express written permission\nof Common Sense Publishing, LLC. "
}