{
    "title": "Bullish bets on Nvidia, Magnificent Seven near most crowded levels of past \nyear",
    "date": "2/13/2024",
    "url": "https://www.marketwatch.com/story/bullish-bets-on-nvidia-other-magnificent-seven-members-near-their-most-crowded-levels-in-the-past-year-5a30fb90",
    "text": "Bets on risky bullish options tied to members of the “Magnificent Seven” and other market-leading technology stocks are nearing their most crowded levels in the past year, according to data from market-data firm Spotgamma. This is prompting some derivatives-market experts to warn that the broader equities market could be at risk of a pullback as Big Tech stocks, which have led the market higher over the past year, could falter following Friday’s options expiration. According to data from Amy Wu Silverman, head of derivatives strategy at RBC Capital Markets, the one-month and three-month call skew for Nvidia Corp. \n        NVDA,\n        +0.12%\n       has reached the highest level since at least June. Call skew measures demand for riskier out-of-the-money calls relative to at-the-money bullish bets. When skew rises, it means demand for riskier options is climbing relative to demand for options that would pay off if the stock were to see a smaller advance before expiration. According to Silverman, however, the simple fact that relative demand for out-of-the-money calls has reached extreme levels compared with recent history doesn’t necessarily portend an immediate reversal in the underlying stock. While it suggests that Nvidia is trading almost entirely on momentum, “momentum tends to beget momentum,” Silverman said in a research note shared with MarketWatch. Nvidia is the best-performing stock in the S&P 500 so far in 2024, having gained 46.7% this year on top of its 238% advance in 2023. Its shares were trading at $726 around midday Tuesday as the broader market sank following the release of January inflation data that came in slightly hotter than economists had expected. Others said that extreme demand for bullish options could create problems not only for members of the Magnificent Seven, but also other semiconductor stocks like Arm Holdings Plc \n        ARM,\n        -0.50%,\n       which has seen its shares rocket higher by more than 60% year-to-date — and perhaps for the broader market. Skew for calls tied to Arm shares on Monday touched its 98th percentile over the past year, according to data provided by Spotgamma. Skew for calls tied to Amazon.com Inc. \n        AMZN,\n        +0.31%\n       was even higher, having reached the 99th percentile over the past year, while Meta Platforms Inc.’s \n        META,\n        -1.68%\n       call skew was also in its 98th percentile. The Magnificent Seven includes shares of Nvidia, Amazon and Meta, as well as Microsoft Corp. \n        MSFT,\n        -0.17%,\n       Alphabet Inc. \n        GOOGL,\n        +0.04%\nGOOG,\n        +0.21%,\n       Tesla Inc. \n        TSLA,\n        -2.25%\n       and Apple Inc. \n        AAPL,\n        -1.06% Charlie McElligott, a derivatives-market strategist at Nomura, has been saying for months now that rising demand for out-of-the-money call options represents investors’ “fear of missing out” on further upside. In effect, investors are paying a premium to ensure their portfolios will benefit from any further gains for individual megacap technology stocks, as well as indexes like the S&P 500 and Nasdaq Composite. The biggest drawback to this type of upside hedging is it creates an environment where activity in the options market could influence trading in underlying stocks, potentially creating a dangerous feedback loop. Brent Kochuba, founder of Spotgamma, said in a note to clients dated Monday that this Friday’s expiration of monthly options tied to single-stock names, indexes and exchange-traded funds could precipitate a correction in stocks — with the S&P 500 potentially retreating to the 4,900 level or below. “The bullish tech trade is very crowded,” Kochuba said in the note. Heavy demand for bullish options forces options dealers, who are selling calls to traders, to hedge their positions by buying stocks, pushing the market higher. This is where the feedback loop comes into play, as higher stocks draw more long-call demand, which draws more hedge-buying from dealers. Wednesday’s expiration of options linked to futures of the Cboe Volatility Index \n        VIX,\n       better known as the Vix or the market’s “fear gauge,” could also become a potential catalyst for the next move lower in the markets, McElligott and Kochuba said. In options parlance, being “in the money” means an option can be exercised or sold for a profit. “At the money” describes an option with a strike price close to or at where the underlying asset is currently trading. “Out of the money” means an option with a strike price that’s higher, if it’s a call, or lower, if it’s a put, than where the underlying stock is trading. The Vix was at 14.90 in recent trading Tuesday, on track for its highest close of the year. Kochuba also noted that the heavy call skew for Nvidia could make it more difficult for the company’s shares to rally after it reports earnings on Feb. 21, even if it surpasses Wall Street’s expectations. He noted that the last two instances where Nvidia’s call skew was at or near current levels occurred in November 2021 and June 2023, as investors awaited earnings from the chip maker. In both cases, the peak in skew for Nvidia coincided with market tops, including the Nasdaq Composite’s record closing high from November 2021. U.S. stocks sold off on Tuesday following the January inflation report, with the S&P 500 \n        SPX\n       down 1.3% to 4,955 in recent trading, while the tech-heavy Nasdaq Composite \n        COMP\n       fell 1.7% to 15,679. The Dow Jones Industrial Average \n        DJIA,\n       meanwhile, was off by 508 points, or 1.3%, to 38,286. Gold has generally outpaced performance in silver over the last few years, but the tide may soon turn in favor of silver. Joseph Adinolfi is a markets reporter at MarketWatch. Joseph Adinolfi is a markets reporter at MarketWatch. Visit a quote page and your recently viewed tickers will be displayed here. "
}