{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.straitstimes.com/business/nvidia-s-surge-puts-ceo-jensen-huang-on-cusp-of-cracking-world-s-20-richest",
    "text": "NEW YORK - Nvidia co-founder and chief executive officer Jensen Huang said artificial intelligence (AI) has hit a “tipping point”, sending the stock to new dizzying heights. The renewed rally has Mr Huang on the verge of his own breakthrough: becoming one of the 20 richest people in the world. Mr Huang’s wealth jumped US$9.6 billion (S$12.9 billion) to US$69.2 billion on Feb 22, a gain that leapfrogged him ahead of Mr Charles Koch of Koch Industries and Chinese bottled-water tycoon Zhong Shanshan to 21st place on the Bloomberg Billionaires Index. It is a remarkable rise for the co-founder of the semiconductor company, who was ranked 128th with a net worth of US$13.5 billion as recently as early 2023. Nvidia surged 16 per cent on Feb 22 to a record high, adding about US$277 billion in market value. That was the biggest single-session increase in market history, beating Meta Platforms’ US$197 billion gain earlier in February. The company was able to exceed sky-high investor expectations with a revenue forecast that was more than US$2 billion ahead of analyst expectations. Nvidia’s rally boosted the fortunes of the 30 billionaires on Bloomberg’s wealth list who attribute at least some of their wealth to AI by a combined US$42.8 billion. Mr Charles Liang, CEO of Supermicro Computer, was the biggest winner on a percentage basis with a 33 per cent jump. Mr Huang is now just behind Mrs Julia Flesher Koch and members of the Walmart founder family Alice, Rob and Jim Walton on the wealth index. BLOOMBERG Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2024 SPH Media Limited. All rights reserved. "
}