{
    "title": "'Little room for error' for Nvidia in full year results",
    "date": "2/18/2024",
    "url": "https://www.cityam.com/little-room-for-error-for-nvidia-in-full-year-results/",
    "text": "Featured Submit a story Tell us your story. Featured Submit a story Tell us your story. Featured Submit a story Tell us your story. Featured Submit a story Tell us your story. Featured Submit a story Tell us your story. By: \t\t\t\t\n\n\t\t\t\t\t\tJess Jones Chip designer Nvidia is gearing up to release its full year results on Wednesday and analysts are preparing for potentially staggering results for the fourth consecutive quarter. Nvidia has provided a bullish forecast for its fourth quarter sales, estimating them to reach $20bn (£15.9bn), up by a substantial leap from the $6.1bn (£4.8bn) reported in the same period a year ago. The company’s remarkable performance over the past year has positioned it as the top-performing stock in the S&P 500, with gains exceeding 200 per cent. Last week it overtook Google owner Alphabet to become the third largest stock on Wall Street. A boom in generative AI – which Nvidia’s chips are needed for – has allowed it to consistently kick analysts’ forecasts for sales and profits across previous quarters, setting a high bar for its final quarter of the year. AJ Bell analysts said: “The AI hype-train is not only rolling but delivering, as far as Nvidia is concerned. Momentum investors seem happy to pile in, although value seekers are likely to be more reticent, given the lofty valuation which leaves little room for error.” They said the only gripe sceptics could complain about is if the stock market darling suddenly has a big increase in trade receivables, which would mean it recorded revenue for selling computer chips before actually being paid for them. Sean Peche, portfolio manager at Ranmore Fund Management, is one of the investors casting a more suspicious eye over Nvidia. He said recent history is littered with cautionary tales of investors overpaying for growth, including in fintech, wind energy and plant-based food. “I’m sure Nvidia’s short-term results will be great, but the price move tells you everyone is already expecting that so it’s probably in the price,” he said, “and although Nvidia is the current leader in AI there is a huge amount of capital being invested in this space and that will mean lower returns in the long term.” “Just look at the discounts being offered on electric vehicles at present, it’s because of all the capital invested by the auto manufacturers a few years ago and the market now being oversupplied. It wouldn’t surprise me if that’s the case with AI chips in time to come,” Peche explained. Looking ahead, the current consensus forecast for the first quarter of the new fiscal year stands at $21.3bn (£16.9bn), compared to $7.2bn (£5.7bn) in the previous year. Read more How are AI hedgies finding the next Nvidia and what are they betting big on? Share this article Subscribe to the City A.M. newsletter to have our top stories delivered directly to your inbox. Follow us for breaking news and latest updates Subscribe to get the essential daily news updates from City A.M's top stories to your inbox. "
}