{
    "title": "Watching Nvidia and Walmart this week: US earnings",
    "date": "2/19/2024",
    "url": "https://www.ig.com/en/news-and-trade-ideas/us-earnings--what-to-expect-from-nvidia-and-walmart-this-week-240219",
    "text": "We want to clarify that IG International does not have an official Line account at this time. We have not established any official presence on Line messaging platform. Therefore, any accounts claiming to represent IG International on Line are unauthorized and should be considered as fake. CFDs are complex instruments. 70% of retail client accounts lose money when trading CFDs, with this investment provider. You can lose your money rapidly due to leverage. Please ensure you understand how this product works and whether you can afford to take the high risk of losing money. \n CFDs are complex instruments. 70% of retail client accounts lose money when trading CFDs, with this investment provider. You can lose your money rapidly due to leverage. Please ensure you understand how this product works and whether you can afford to take the high risk of losing money. View more search results Investors are awaiting some key earnings results this week, including from Nvidia and Walmart. Walmart has so far found a way of dealing with higher input costs and keeping competitive prices for its customers, which translated it earnings beat in three out of the previous four quarters. Walmart is forecast to post earnings of $1.64 per share on revenue over $170 billion tomorrow. This compares to EPS of $1.50 and revenue of $151.47 billion the same quarter a year ago. Analysts, however, predict an 11% increase in US e-commerce sales, which would be the slowest rate of growth in 2023. After the US close on Wednesday, all eyes will be on NVIDIA. The street anticipates EPS of $4.58 and revenue of $20.37 billion. For the same quarter last year, NVIDIA posted earnings of 88 cents per share on revenue just over $6 billion, a phenomenal rise that translated in gains of over 220% over the past 12 months. Year to date, the stock has already risen by 50%. IGTv’s Angela Barnes has this preview. (AI Video Summary) In the coming days, there are a few important earnings reports from major US companies that are worth paying attention to. One of them is Walmart, which has been doing a great job of managing the rising costs of materials and inflation while still offering competitive prices to its customers. Over the past year, Walmart's earnings have been improving, and tomorrow they are expected to announce earnings of $1.64 per share, with revenue exceeding $170 billion. This is a significant increase from last year, where they had earnings of $1.50 per share and revenue of $151.47 billion in the same quarter. However, analysts predict that the company's US e-commerce sales will grow at a slower rate of 11 percent, which is the slowest since 2023. Despite this, Walmart's stock has been performing well, rising by 10 percent year-to-date and outperforming the S&P 500. Another company to watch out for is Home Depot, a popular home improvement retailer. While their earnings are expected to drop by 18 percent and sales to decrease by 4 percent, investors are curious to see how the company performs. On Wednesday, after the market closes, NVIDIA's earnings report will be eagerly awaited. The Street predicts earnings per share of $4.58 and revenue of $20.37 billion, compared to earnings of $0.88 per share and revenue just over $6 billion from the previous year. Nvidia's stock has seen a significant rise, with gains of over 220 percent in the past 12 months and a 50 percent increase year-to-date. This is due to the increasing demand for their products, especially in the field of artificial intelligence, as businesses around the world seek to improve their efficiency and market positions. Nvidia's data center base, including cloud and AI services, could potentially bring in around $17 billion in revenue, which is more than four times last year's amount. These earnings reports will offer valuable insights into how these companies are performing financially and what their future prospects might be. Investors and market watchers will closely analyze these results to get a sense of the overall health and direction of these key players in the US market. This information has been prepared by IG, a trading name of IG Markets Limited. In addition to the disclaimer below, the material on this page does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. No representation or warranty is given as to the accuracy or completeness of this information. Consequently any person acting on it does so entirely at their own risk. Any research provided does not have regard to the specific investment objectives, financial situation and needs of any specific person who may receive it. It has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such is considered to be a marketing communication. Although we are not specifically constrained from dealing ahead of our recommendations we do not seek to take advantage of them before they are provided to our clients. Deal on the world’s major stock indices today. See more forex live prices See more shares live prices See more indices live prices Prices above are subject to our  website terms and agreements. All share prices are delayed by at least 20 minutes. Prices are indicative only. See more forex live prices See more shares live prices See more indices live prices Find out what charges your trades could incur with our transparent fee structure. Discover why so many clients choose us, and what makes us a world-leading provider of CFDs. Stay on top of upcoming market-moving events with our customisable economic calendar. Share CFDs Forex Indices Commodities Other markets Web platform Trading apps MetaTrader 4 ProRealTime Compare features Demo News and trade ideas Trading strategy  Charges and margins Premium services Refer a friend Marketing partnerships Corporate accounts New clients: +44 (20) 7633 5430 or email sales.en@ig.com Clients: Help & Support  IG | Terms and agreements | Privacy | How to fund | Vulnerability | Cookies | About IG Follow us online: ^IG International Limited is part of the IG Group and its ultimate parent company is IG Group Holdings Plc. IG Group established in London in 1974, and is a constituent of the FTSE 250 index. The risks of loss from investing in CFDs can be substantial and the value of your investments may fluctuate. 70% of retail client accounts lose money when trading CFDs, with this investment provider. CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. You should consider whether you understand how this product works, and whether you can afford to take the high risk of losing your money. CFD Accounts provided by IG International Limited. IG International Limited is licensed to conduct investment business and digital asset business by the Bermuda Monetary Authority. IG provides an execution-only service. The information in this site does not contain (and should not be construed as containing) investment advice or an investment recommendation, or an offer of or solicitation for transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. The information on this site is not directed at residents of the United States and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation. IG International Limited is part of the IG Group and its ultimate parent company is IG Group Holdings Plc. IG International Limited receives services from other members of the IG Group including IG Markets Limited. Careers | IG Group "
}