{
    "title": "NASDAQ Index, SP500, Dow Jones Forecasts – NASDAQ Rebounds From Session \nLows As NVIDIA Tests Historic Highs",
    "date": "2/5/2024",
    "url": "https://www.fxempire.com/forecasts/article/nasdaq-index-sp500-dow-jones-forecasts-nasdaq-rebounds-from-session-lows-as-nvidia-tests-historic-highs-1407497",
    "text": "NVIDIA gained 4.1% as Goldman Sachs raised the price target from $625 to $800. US SPX 500 US Tech 100 US Wall St 30 NVDA MCD SP500 managed to rebound from session lows as traders reacted to ISM Services PMI report. The report indicated that ISM Services PMI increased from 50.6 in December to 53.4 in January, compared to analyst consensus of 52. Treasury yields moved higher as traders bet on a more hawkish Fed after the release of the strong report. The yield of 2-year Treasuries settled near 4.45%, while the yield of 10-year Treasuries climbed above the 4.16% level. Higher Treasury yields put some pressure on SP500, but it looks that traders believe that strong economy will push stocks higher despite hawkish Fed. Healthcare and Tech stocks were among the leaders today, while the yield-sensitive Utilities and Real Estate stocks have found themselves under pressure. General market sentiment remains extremely bullish, and the pullback was quickly bought. RSI is in the moderate territory, and there is plenty of room to gain additional upside momentum. A move above the 4960 level will open the way to the test of the psychologically important 5000 level. NASDAQ received support in the 17,450 – 17,500 range and rebounded towards the recent highs. NVIDIA tested historic highs as the strong rally continued. The stock gained upside momentum after Goldman Sachs raised the price target from $625 to $800. Demand for AI-related stocks stays strong, which is bullish for NASDAQ. The index needs to settle above the 17,700 level to gain additional upside momentum. Dow Jones pulled back as the majority of the index components moved lower. The pullback was led by McDonald’s, which was down by 3.8% after the earnings report. The company’s sales were hit by the Israel – Hamas conflict as some customers ignored McDonald’s products for political reasons. The nearest support level for Dow Jones is located in the 38,100 – 38,150 range. A move below 38,100 will push Dow Jones towards the support at 37,750 – 37,800. For a look at all of today’s economic events, check out our economic calendar. Vladimir is an independent trader and analyst with over 10 years of experience in the financial markets. He is a specialist in stocks, futures, Forex, indices, and commodities areas using long-term positional trading and swing trading. XRP News Today: SEC Appeal Looms, Ripple Lawsuit Drama Continues Litecoin Price Forecast: LTC eyes $150 as CFTC delivers Bullish Rulling Ethereum price forecast: This $3.6B signal could drive ETH to $5k in April Five Things to Know in Crypto This Week: Coinbase and Ripple in SEC Vice Crude Oil News Today: Is the Market on the Brink of a Bullish Breakout? Gold Price Forecast: Monthly Chart Indicates Strong Bullish Momentum "
}