{
    "title": "Why aren't Nvidia Insiders buying NVDA shares?",
    "date": "3/12/2024",
    "url": "https://finbold.com/why-arent-nvidia-insiders-buying-nvda-shares/",
    "text": "As Nvidia (NASDAQ: NVDA) stock dipped below the $900 mark, insider trading activity appears to have slowed, sparking speculation about a potential NVDA stock split or further share price declines. Reviewing insider trading data, particularly purchases, reveals no activity over the past year, as noted in a recent post by Barchart on March 12. Recent activities primarily showcase the selling of NVDA stock, notably with a significant portion of recent sales, as some prominent Nvidia insiders have been offloading their long-term holdings. In the initial week of March, Nvidia shareholders seized the opportunity to cash in on their investments, collectively selling over $180 million worth of Nvidia shares. Notably, Tench Coxe, the third-largest shareholder of Nvidia, recently sold 200,000 NVDA shares, totaling $170 million. Furthermore, Mark Stevens, a director since 2008, sold 12,000 shares on March 4, ranging in price from $852.06 to $855.02, amounting to a sale value of roughly $10 million. It might be hard to tell whether these trades are profit-taking from long-term positions or indicate the current top in NVDA share value. The history of Nvidia stock presents a compelling case for anticipating a near-term split and a possible reason for an insider sell-off. The company has split its stock five times since 2000, one of which occurred after AI and data centers reignited investor interest in GPUs. The most recent split took place on July 19, 2021, with a 4-for-1 split. Interestingly, it closed at a pre-split price of approximately $744 per share that day, which is lower than the current price. However, investors should note that these gains have accumulated rapidly, with Nvidia stock rising by about 82.40% this year and 21.61% in the last month alone, suggesting that the need for a split may have caught the company’s board off guard. Determining whether these two reasons are accurate can be challenging, but the absence of insider purchases suggests an increasing likelihood of either an NVDA share price turnaround or an imminent stock split. This move could potentially render the price more attractive at lower levels. Buy stocks now with eToro – trusted and advanced investment platform Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}