{
    "title": "Planned Solutions Inc. Takes $411000 Position in NVIDIA Co. (NASDAQ:NVDA)",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/planned-solutions-inc-takes-411000-position-in-nvidia-co-nasdaqnvda.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Planned Solutions Inc. purchased a new position in shares of  NVIDIA Co. (NASDAQ:NVDA – Free Report) in the 4th quarter, according to its most recent Form 13F filing with the SEC. The firm purchased 829 shares of the computer hardware maker’s stock, valued at approximately $411,000. Other institutional investors have also added to or reduced their stakes in the company. Aprio Wealth Management LLC grew its holdings in shares of  NVIDIA by 1.8% during the 4th quarter. Aprio Wealth Management LLC now owns 1,056 shares of the computer hardware maker’s stock valued at $523,000 after purchasing an additional 19 shares during the last quarter.  North Star Investment Management Corp. boosted its holdings in shares of  NVIDIA by 0.3% during the 4th quarter. North Star Investment Management Corp. now owns 6,994 shares of the computer hardware maker’s stock valued at $3,463,000 after acquiring an additional 20 shares in the last quarter.  LS Investment Advisors LLC grew its position in  NVIDIA by 1.0% during the 4th quarter. LS Investment Advisors LLC now owns 2,120 shares of the computer hardware maker’s stock worth $1,050,000 after acquiring an additional 20 shares during the last quarter.  PCA Investment Advisory Services Inc. increased its holdings in  NVIDIA by 2.5% in the 3rd quarter. PCA Investment Advisory Services Inc. now owns 857 shares of the computer hardware maker’s stock worth $373,000 after purchasing an additional 21 shares in the last quarter.  Finally, IMPACTfolio LLC raised its position in  NVIDIA by 4.1% in the fourth quarter. IMPACTfolio LLC now owns 529 shares of the computer hardware maker’s stock valued at $262,000 after purchasing an additional 21 shares during the last quarter. 65.27% of the stock is currently owned by institutional investors. Shares of NVDA stock opened at $903.56 on Friday. The company has a current ratio of 4.17, a quick ratio of 3.67 and a debt-to-equity ratio of 0.20. The company’s fifty day moving average price is $772.45 and its 200-day moving average price is $574.01. The stock has a market cap of $2.26 trillion, a PE ratio of 75.68, a price-to-earnings-growth ratio of 1.30 and a beta of 1.73. NVIDIA Co. has a 12 month low of $262.20 and a 12 month high of $974.00. NVIDIA (NASDAQ:NVDA – Get Free Report) last announced its quarterly earnings data on Wednesday, February 21st. The computer hardware maker reported $5.16 earnings per share for the quarter, topping analysts’ consensus estimates of $4.21 by $0.95. NVIDIA had a net margin of 48.85% and a return on equity of 93.61%. The business had revenue of $22.10 billion for the quarter, compared to analysts’ expectations of $20.40 billion. During the same quarter in the prior year, the company earned $0.65 earnings per share. The business’s revenue was up 265.3% compared to the same quarter last year.  On average, equities analysts expect that  NVIDIA Co. will post 22.45 EPS for the current fiscal year. The business also recently announced a quarterly dividend, which was paid on Wednesday, March 27th. Stockholders of record on Wednesday, March 6th were paid a $0.04 dividend. The ex-dividend date  was Tuesday, March 5th. This represents a $0.16 dividend on an annualized basis and a dividend yield of 0.02%. NVIDIA’s dividend payout ratio  is currently 1.34%. In related news, insider Donald F. Robertson, Jr. sold 450 shares of the company’s stock in a transaction dated Friday, January 5th. The shares were sold at an average price of $484.62, for a total value of $218,079.00. Following the transaction, the insider now owns 50,961 shares in the company, valued at approximately $24,696,719.82. The sale was disclosed in a document filed with the SEC, which is accessible through the SEC website. In other news, Director John Dabiri sold 128 shares of the company’s stock in a transaction on Monday, March 25th. The stock was sold at an average price of $940.00, for a total transaction of $120,320.00. Following the transaction, the director now directly owns 2,055 shares of the company’s stock, valued at $1,931,700. The sale was disclosed in a filing with the SEC, which is available at the SEC website. Also, insider Donald F. Robertson, Jr. sold 450 shares of NVIDIA stock in a transaction dated Friday, January 5th. The stock was sold at an average price of $484.62, for a total value of $218,079.00. Following the completion of the sale, the insider now owns 50,961 shares of the company’s stock, valued at $24,696,719.82. The disclosure for this sale can be found here. Insiders sold 105,352 shares of company stock worth $64,853,077 over the last three months. 3.99% of the stock is currently owned by corporate insiders. Several research analysts have recently issued reports on NVDA shares. Morgan Stanley upped their price objective on NVIDIA from $750.00 to $795.00 and gave the company an “overweight” rating in a research note on Thursday, February 22nd. Mizuho lifted their price target on shares of NVIDIA from $850.00 to $1,000.00 and gave the stock a “buy” rating in a report on Thursday, March 7th. HSBC increased their price objective on NVIDIA from $880.00 to $1,050.00 and gave the company a “buy” rating in a report on Monday, March 18th. Loop Capital initiated coverage on NVIDIA in a report on Friday, February 16th. They set a “buy” rating and a $1,200.00 target price on the stock. Finally, DA Davidson increased their price target on NVIDIA from $410.00 to $620.00 and gave the company a “neutral” rating in a research note on Thursday, February 22nd. Four analysts have rated the stock with a hold rating, thirty-seven have issued  a buy rating and one  has given a strong buy rating to the company. Based on data from MarketBeat.com, NVIDIA currently has a consensus rating of “Moderate Buy” and an average target price of $908.68. Read Our Latest Stock Analysis on NVDA (Free Report) NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications.  Want to see what other hedge funds are holding NVDA? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for NVIDIA Co. (NASDAQ:NVDA – Free Report).   Receive News & Ratings for NVIDIA Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for NVIDIA and related companies with MarketBeat.com's FREE daily email newsletter. Clear Harbor Asset Management LLC Makes New $204,000 Investment in Adobe Inc. (NASDAQ:ADBE) Planned Solutions Inc. Invests $137,000 in Alphabet Inc. (NASDAQ:GOOGL) "
}