{
    "title": "Which Artificial Intelligence (AI) Stock Is Most Likely to Deliver a 5X \nGain by 2030: Alphabet, Amazon, Microsoft, Meta ...",
    "date": "3/10/2024",
    "url": "https://www.fool.com/investing/2024/03/10/which-artificial-intelligence-ai-stock-is-most-lik/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More You won't have to look hard to find well-known stocks that have been multi-baggers in recent years. Alphabet's (GOOG 0.21%) (GOOGL 0.04%) share price has more than quadrupled since 2014. Amazon's (AMZN 0.31%) stock is up more than 9x during the same period. Microsoft (MSFT -0.17%) delivered a gain of over 10x. Meta Platforms' (META -1.68%) stock has soared 7x. Then there's Nvidia (NVDA 0.12%), with its share price skyrocketing in the ballpark of 19,400%. But those impressive returns are now history. Which of these stocks is likely to deliver a 5x gain by 2030? I think all five of these stocks should have strong growth prospects going forward. They share a common tailwind that's likely to blow hard for years to come -- artificial intelligence (AI). Amazon Web Services, Microsoft Azure, and Alphabet's Google Cloud are poised for tremendous growth, in my view, as IT spending shifts from on-premises to the cloud. The scramble to build AI functionality should accelerate this trend. Nvidia will almost certainly be a direct beneficiary of this migration. The company's GPUs remain the favorite chip for powering AI apps. Meta isn't a cloud provider or a chipmaker. However, the company's open-source approach to developing AI could pay off nicely over the long term. Meta CEO Mark Zuckerberg thinks that the benefits of this strategy include increased AI safety and security, a greater ability to integrate new AI innovations into Meta's products, and a competitive advantage in hiring the best developers and researchers. AI isn't the only growth driver for these five stocks, though. Amazon still has plenty of room to run in the e-commerce market and other areas it's expanding into, including healthcare. Microsoft's opportunities include gaming, especially with the recent acquisition of Activision Blizzard. Alphabet has its famous \"other bets,\" such as healthcare-focused Calico and Verily. Meta is investing heavily in developing the metaverse. Nvidia's initial success came from powering gaming apps, and it still represents a major growth market. I like all of these stocks. I think all of them could deliver solid long-term returns. But we must narrow the list to pick a winner. Which is the first to be eliminated? My pick is Meta. The company won't profit as directly from AI as the three cloud service providers or Nvidia. Meta's big bet on the metaverse might not pay off by 2030 (or possibly ever). Its social media platforms, while continuing to dominate, don't have as much growth potential as they have in the past. Next on the chopping block for me is Amazon. E-commerce remains the company's biggest revenue source. As mentioned previously, it's still a growth opportunity for Amazon. However, that opportunity isn't as great as the ones that other companies on our list have. This could make it more challenging for Amazon stock to soar by 5x by 2030. I'm going to reluctantly strike Microsoft off the list as well. My primary determining factor here is valuation. Microsoft's price-to-earnings-to-growth (PEG) ratio based on Wall Street's consensus five-year growth projections is over 2x, the highest multiple of all of these stocks except Amazon. Granted, those growth projections could be overly pessimistic. Still, I suspect that it would be more difficult for Microsoft stock to increase by 5x going forward because of its starting valuation. That leaves two finalists -- Alphabet and Nvidia. Choosing between them is tough. In addition to continued growth with its current apps and Google Cloud, Alphabet could have a massive growth driver with its Waymo self-driving car business. Cathie Wood's Ark Invest predicts that the robotaxi market could be worth $9 trillion by 2030. Waymo is likely to be a leader in that market. Google also ranks as a top innovator in quantum computing technology, which could be another game-changer. Alphabet does face some risks, though. Ark Invest's robotaxi market prediction could be way too optimistic. It could take much longer to achieve the potential for quantum computing than anyone expects. AI-powered virtual assistants could dampen Google Search's growth down the road. Alphabet's \"other bets\" could be disappointing. What about Nvidia? It's arguably the most important company in the world right now. Every other company on our list (plus thousands of others) relies heavily on Nvidia's GPUs. CEO Jensen Huang thinks that the shift to accelerated computing and generative AI \"will drive a doubling of the world's data-center infrastructure installed base in the next five years and will represent an annual market opportunity in the hundreds of billions.\" If he's right, Nvidia could realistically deliver a 5x return by 2030. On the other hand, NYU finance professor Aswath Damodaran believes that Nvidia is the most overvalued \"Magnificent Seven\" stock by far, even factoring in strong growth projections. The company also faces increased competition in the AI chip market, which could grow even stronger over the next few years. So which stock is most likely to deliver a 5x gain? I'm going to give the nod to Nvidia. The company should profit from pretty much every technology growth market around -- AI, gaming, self-driving cars, the metaverse, and more. That said, I don't think becoming a five-bagger again will be easy for Nvidia (because of the challenges I've already mentioned). Perhaps the most important takeaway from this hypothetical exercise is that all of these stocks could make investors plenty of money over the long run. I don't think you'd go wrong with buying Alphabet, Amazon, Microsoft, Meta, or Nvidia as long as you hold onto the stocks long enough. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keith Speights has positions in Alphabet, Amazon, Meta Platforms, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}