{
    "title": "PLTR Stock is Up 250%. Yes It's Still a Buy",
    "date": "3/13/2024",
    "url": "https://www.tradingview.com/news/investorplace:00ddd7e8f094b:0-pltr-stock-is-up-250-yes-it-s-still-a-buy/",
    "text": "Artificial intelligence (AI) inflated the share price of many companies where the technology became mission critical to their business. Palantir Technologies PLTR is really not that far behind Nvidia NVDA in performance over the past year. Where the chipmaker is up 281% for the past 12 months, the PLTR stock is 254% higher. Yet many are concerned about PLTR stock’s valuation. No question shares of the analytics company are in the nosebleed section but it’s not the fatal flaw many analysts suggest. There is a solid case its stock is still a buy despite Palantir trading at a 52-week high. A Dual Path to Preeminence PLTR stock is the clear leader in helping the government and business crunch vast amounts of data. Its respective Gotham and Foundry platforms are perfectly positioned to help the institutions make real-world sense out of the countless bits of information that are collected daily. By using AI and machine learning (ML), Palantir can make relatively quick work of the process. It is then able to convert this jumble of data into a cohesive and coherent visualization that clients can use to take action. Palantir cut its teeth analyzing data for the government that literally had life-or-death consequences. It soon realized it could take its expertise and apply it to commercial customers who were also grappling with a large influx of information that was often complex to decipher and onerous to deal with in its intricacy. It also presented a larger, faster-growing market opportunity. The government sector accounted for 55% of revenue in 2023, but that’s down slightly from the 56% it represented the year before. However, commercial revenue surged 32% year over year (U.S. commercial revenue was up 70%) while government sales rose 11%. It won’t be long before enterprise customers account for the majority of Palantir’s total business. Reinvesting in Itself PLTR stock has invested heavily in AI and ML for many years. Long before it caught the investing public’s imagination, Palantir recognized the value and scalability the technologies brought to its platforms. Research and development plays an important role in the company’s progress. Last year R&D accounted for almost 20% of revenue and grew 12% from 2022. It gives PLTR stock a substantial competitive edge over its rivals. It is one reason Palantir Technologies is called the “best pure-play AI name.” The data analytics firm is now scaling down its offerings to make them available to more companies. Buying access only based on what a business needs and then growing more functionality over time as a business expands opens up new markets and opportunities for Palantir. In just three years total revenue doubled. Palantir went from 1.095 billion in sales in 2020 to finishing last year with $2.225 billion. It should keep multiplying from here. Paying up for quality Profits are growing and margins are widening. Palantir turned in its first full year of GAAP profits last year and has been consistently profitable now for five consecutive quarters. Wall Street forecasts earnings will continue their expansion rate over the next few years while operating margins also widen. New government contracts could open more opportunities as well. Palantir was just awarded a new $174 million military contract to develop the U.S. Army’s Tactical Intelligence Targeting Access Node (TITAN) ground station vehicle. It’s a battlefield system utilizing AI and ML. This should open more doors for additional and bigger contracts for the company. PLTR stock possesses some scary price-to-earnings ratios. Yet a newly profitable company is expected to have these kinds of valuations. But even on price-to-sales and price-to-free cash flow, the company’s numbers are sky-high. But investors should take a longer view of the stock. Palantir Technologies will capitalize on its leadership position. It will continue growing in the years ahead with sales and profits flowing in. That will drive the stock price higher making any pullback a minor blip on the stock. Yes, Palantir is worth the premium despite its rich valution. Ultimately PLTR stock will continue its upward journey. On the date of publication, Rich Duprey did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Rich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}