{
    "title": "Nvidia Just Bought 5 Artificial Intelligence (AI) Stocks, but This 1 Is \nSoaring the Most",
    "date": "3/4/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/SOUN/pressreleases/24516037/nvidia-just-bought-5-artificial-intelligence-ai-stocks-but-this-1-is-soaring-the-most/",
    "text": "Nvidia (NASDAQ: NVDA) is the world's largest semiconductor company, and considering it just surpassed a $2 trillion valuation, it's also one of America's most valuable companies overall as measured by market cap. Only Microsoft and Apple are more valuable. Most of Nvidia's market capitalization has been added in the last 12 months alone, thanks entirely to its data center chips designed to process artificial intelligence (AI) workloads. CEO Jensen Huang is often referred to as the \"Godfather of AI\" by Wall Street analysts, and now he's spreading his company's good fortune by investing in other AI stocks. Image source: Getty Images. In its first-ever 13-F filing with the Securities and Exchange Commission on Feb. 14, Nvidia revealed it purchased five AI stocks in the fourth quarter of 2023 (ended Dec. 31): Arm Holdings attracted the largest investment, with Nvidia's position worth over $147.3 million at the end of last year. However, Arm is only second-best in the group of five stocks when it comes to stock price performance in 2024, with a 104% gain so far. SoundHound AI is winning that race. Its stock is up an eye-watering 180% year-to-date, valuing the company at $1.5 billion. Nvidia's stake is relatively small with a value of just $10.1 million at SoundHound's current stock price ($5.83), but it hasn't stopped the buying frenzy among investors. So is it too late to follow Nvidia's lead? While many popular generative AI applications focus on ingesting text prompts to create text, image, and video content, SoundHound has developed conversational AI that understands voice and responds in kind. SoundHound's customer list includes some of the largest companies in the hospitality and automotive industries. Restaurant chains use conversational AI to take customer orders -- both in-store and in the drive-thru -- and also handle incoming phone queries, which reduces the workload on employees. Krispy Kreme and Jersey Mike's are just two of many SoundHound customers in that space. Car giants like Mercedes Benz and Stellantis (home to Chrysler, Jeep, Dodge, and other brands) use SoundHound's technology to create in-car virtual assistants capable of understanding each vehicle's functionality and answering a wide range of general queries. In early February, SoundHound took those products to the next level with its \"Dynamic Interaction With Generative AI\" technology. It's a brand-new interface that responds to voice and touch prompts with audiovisual content, rather than just voice. It can decide when it's appropriate to include maps, internet search results, images, and videos in its responses to enhance the user experience. SoundHound only generated $45.9 million in revenue in 2023, although it was an impressive 47% increase compared to 2022. The real story is the company's order backlog, which hit $661 million by the end of the year. That was double the backlog it had at the same time in 2022. Therefore, even though SoundHound's revenue is still relatively light, that backlog could translate to substantial growth in the years ahead. There are signs of that in SoundHound's 2024 forecast. It expects to deliver $70 million in revenue for the year, which would see growth accelerate to 49%. Unfortunately, there is one negative factor investors need to be wary of. SoundHound lost $88.9 million on the bottom line in 2023, and while it isn't unusual for small tech enterprises to lose money while they scale up, this company only has $99.5 million in cash on hand, so it can't afford a repeat of last year. SoundHound will most likely need a cash infusion within the next couple of years. If it completes an equity offering, that will dilute existing investors and potentially dent its stock price. SoundHound AI stock soared by more than 60% on Feb. 15, when investors first learned of Nvidia's investment in the company. It jumped by a further 46% on Feb. 26, when Nvidia announced an expansion of its partnership with ServiceNow to improve the telecommunications industry using generative AI. Together, Nvidia and ServiceNow will build generative AI solutions to elevate customer care and service assurance. While this deal makes no mention of SoundHound, conversational AI is the perfect technology to help service providers automate phone calls and resolve customer queries far more efficiently. Considering Nvidia's recent investment in SoundHound stock, investors are speculating this deal could benefit the conversational AI specialist down the line. Plus, in the fourth quarter of last year, SoundHound said it received a \"notable, first-of-its-kind revenue contribution from a preeminent AI chip company.\" No specifics are provided, but the timing certainly lines up nicely with Nvidia's investment in SoundHound. For now, SoundHound AI stock might simply be a speculative bet on the AI industry until it's in a more predictable financial position. There's nothing wrong with that, as long as investors understand it will probably carry more volatility than the average stock. Should you invest $1,000 in SoundHound AI right now? Before you buy stock in SoundHound AI, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and SoundHound AI wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 26, 2024  Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Microsoft, Nvidia, and ServiceNow. The Motley Fool recommends Stellantis and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Soundhound Ai Inc Cl A stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}