{
    "title": "Nvidia closes above $2tn for the first time to lead AI-fuelled market rally",
    "date": "3/2/2024",
    "url": "https://www.thenationalnews.com/future/technology/2024/03/02/nvidia-closes-above-2tn-for-the-first-time-to-lead-ai-fuelled-market-rally/",
    "text": "Nvidia is now the world's third most valuable company, behind only Apple and Microsoft. AFP Nvidia is now the world's third most valuable company, behind only Apple and Microsoft. AFP Chipmaker Nvidia's market capitalisation closed above the $2 trillion level for the first time on Friday, leading a market rally fuelled by artificial intelligence stocks and setting records on Wall Street. The California-based company's stock surged 4 per cent to hit $822.79 at the close of trading, raising its market cap to about $2.06 trillion. It had previously passed the $2 trillion milestone during intraday trading on February 23, two days after Nvidia released a glowing earnings report. Shares of Nvidia, whose fourth-quarter net profit surged by 769 per cent annually to $12.3 billion, are now up about 260 per cent in the past 12 months. That makes it the world's third most valuable company, behind only Apple and Microsoft, which have market caps of $2.77 trillion and $3.09 trillion respectively, and at par with Saudi Aramco. They are the only four companies globally with valuations of at least $2 trillion. The quartet also form the upper echelon of the few companies that have a 13-figure market cap, a list that includes Amazon ($1.85 trillion), Google parent Alphabet ($1.71 trillion) and Facebook owner Meta Platforms ($1.28 trillion). \"The more companies move toward AI developments, the more Nvidia investors see dollars in their eyes,\" said Ipek Ozkardeskaya, a senior analyst at Swissquote Bank. Nvidia's success has rubbed off on other companies. Dell Technologies was the latest, as its shares soared more than 31 per cent after its fourth-quarter earnings report beat expectations, driven by AI. Friday's performance was also Texas-based Dell's best day since it returned to the stock market in 2018. It also caused founder, chairman and chief executive Michael Dell's fortune to surpass the $100 billion mark for the first time, placing him 12th on the Bloomberg Billionaire's Index. On Wall Street, the S&P 500 and Nasdaq Composite rose 0.8 per cent and 1.1 per cent, respectively, to close at fresh highs. The Dow Jones Industrial Average added 0.2 per cent. In Europe, Frankfurt's DAX climbed 0.3 per cent to hit a new high and Paris's CAC 40 inched up 0.1 per cent to hover near its own record level, as investor sentiment was unmoved by a less-than-expected decline in eurozone inflation. Britain's FTSE 100, meanwhile, rose 0.7 per cent, as investors were optimistic on slowing inflation in the US, the world's biggest economy. Earlier in Asia, Tokyo's Nikkei 225 surged 1.9 per cent, nearly touching the 40,000-point level for the first time, leading gains across the continent buoyed by easing US inflation and tech stock rallies. Hong Kong's Hang Seng Index rose 0.5 per cent, while the Shanghai Composite added 0.4 per cent. In commodities, oil prices surged on Friday and recorded a weekly again amid expectations that Opec+ crude producers would extend supply cuts into the second quarter. Brent settled 2 per cent higher at $83.55 a barrel, while West Texas Intermediate climbed 2.19 per cent to settle at $79.97 a barrel. Gold prices, meanwhile, climbed to a two-month high on Friday and posted a second straight weekly rise, on expectations that the Federal Reserve will cut interest rates in June. Gold, considered a safe haven against inflation, added about 2 per cent to settle at $2,095.70 an ounce. "
}