{
    "title": "Kingswood Wealth Advisors LLC Grows Stock Position in NVIDIA Co. \n(NASDAQ:NVDA)",
    "date": "3/26/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-nvda-sec-filing-2024-03-26/",
    "text": "Kingswood Wealth Advisors LLC raised its holdings in shares of NVIDIA Co. (NASDAQ:NVDA - Free Report) by 112.9% during the fourth quarter, according to the company in its most recent Form 13F filing with the Securities & Exchange Commission. The institutional investor owned 38,896 shares of the computer hardware maker's stock after buying an additional 20,625 shares during the period. NVIDIA comprises 2.2% of Kingswood Wealth Advisors LLC's investment portfolio, making the stock its 5th largest position. Kingswood Wealth Advisors LLC's holdings in NVIDIA were worth $19,262,000 as of its most recent SEC filing. A number of other hedge funds and other institutional investors have also recently bought and sold shares of the business. United Bank lifted its holdings in NVIDIA by 28.9% in the first quarter. United Bank now owns 7,717 shares of the computer hardware maker's stock worth $2,106,000 after purchasing an additional 1,730 shares during the period. Mirae Asset Global Investments Co. Ltd. lifted its holdings in NVIDIA by 6.8% in the first quarter. Mirae Asset Global Investments Co. Ltd. now owns 3,904,772 shares of the computer hardware maker's stock worth $1,065,457,000 after purchasing an additional 249,045 shares during the period. MAS Advisors LLC lifted its holdings in NVIDIA by 42.1% in the first quarter. MAS Advisors LLC now owns 1,967 shares of the computer hardware maker's stock worth $545,000 after purchasing an additional 583 shares during the period. Navis Wealth Advisors LLC lifted its holdings in NVIDIA by 205.3% in the first quarter. Navis Wealth Advisors LLC now owns 2,900 shares of the computer hardware maker's stock worth $791,000 after purchasing an additional 1,950 shares during the period. Finally, Ergoteles LLC acquired a new stake in NVIDIA in the first quarter worth about $929,000. 65.27% of the stock is owned by institutional investors and hedge funds. NVIDIA stock traded down $24.41 during trading hours on Tuesday, hitting $925.61. The stock had a trading volume of 51,152,437 shares, compared to its average volume of 54,082,598. The company has a quick ratio of 3.67, a current ratio of 4.17 and a debt-to-equity ratio of 0.20. The stock has a market cap of $2.31 trillion, a price-to-earnings ratio of 77.52, a P/E/G ratio of 1.36 and a beta of 1.73. NVIDIA Co. has a one year low of $258.50 and a one year high of $974.00. The business's 50 day simple moving average is $751.73 and its 200-day simple moving average is $566.07. NVIDIA (NASDAQ:NVDA - Get Free Report) last posted its earnings results on Wednesday, February 21st. The computer hardware maker reported $5.16 EPS for the quarter, beating the consensus estimate of $4.21 by $0.95. The firm had revenue of $22.10 billion during the quarter, compared to the consensus estimate of $20.40 billion. NVIDIA had a return on equity of 93.61% and a net margin of 48.85%. The business's quarterly revenue was up 265.3% on a year-over-year basis. During the same period last year, the company earned $0.65 earnings per share. On average, equities analysts predict that NVIDIA Co. will post 22.4 EPS for the current fiscal year. The business also recently disclosed a quarterly dividend, which will be paid on Wednesday, March 27th. Stockholders of record on Wednesday, March 6th will be given a dividend of $0.04 per share. The ex-dividend date of this dividend is Tuesday, March 5th. This represents a $0.16 dividend on an annualized basis and a dividend yield of 0.02%. NVIDIA's dividend payout ratio (DPR) is 1.34%. In other news, Director Mark A. Stevens sold 35,648 shares of the firm's stock in a transaction dated Wednesday, January 10th. The stock was sold at an average price of $542.93, for a total transaction of $19,354,368.64. Following the completion of the transaction, the director now directly owns 1,189,083 shares in the company, valued at $645,588,833.19. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through this hyperlink. In other NVIDIA news, Director Mark A. Stevens sold 36,000 shares of NVIDIA stock in a transaction that occurred on Friday, January 12th. The stock was sold at an average price of $546.95, for a total value of $19,690,200.00. Following the completion of the sale, the director now directly owns 1,134,583 shares in the company, valued at $620,560,171.85. The sale was disclosed in a filing with the SEC, which is available at the SEC website. Also, Director Mark A. Stevens sold 35,648 shares of NVIDIA stock in a transaction that occurred on Wednesday, January 10th. The stock was sold at an average price of $542.93, for a total value of $19,354,368.64. Following the completion of the sale, the director now owns 1,189,083 shares of the company's stock, valued at $645,588,833.19. The disclosure for this sale can be found here. Insiders sold 105,224 shares of company stock worth $64,732,757 over the last ninety days. 3.99% of the stock is owned by insiders. Several equities research analysts recently weighed in on NVDA shares. Citigroup upped their price objective on shares of NVIDIA from $820.00 to $1,030.00 and gave the stock a \"buy\" rating in a report on Wednesday, March 20th. Craig Hallum upped their price target on shares of NVIDIA from $700.00 to $850.00 and gave the company a \"buy\" rating in a report on Thursday, February 22nd. CICC Research started coverage on shares of NVIDIA in a report on Wednesday, March 6th. They issued an \"outperform\" rating and a $870.00 price target for the company. The Goldman Sachs Group upped their price target on shares of NVIDIA from $875.00 to $1,000.00 and gave the company a \"buy\" rating in a report on Wednesday, March 20th. Finally, Stifel Nicolaus reissued a \"buy\" rating and issued a $910.00 price target on shares of NVIDIA in a report on Wednesday, March 20th. Four research analysts have rated the stock with a hold rating, thirty-seven have issued a buy rating and one has assigned a strong buy rating to the stock. Based on data from MarketBeat, the company currently has an average rating of \"Moderate Buy\" and a consensus target price of $908.68. Check Out Our Latest Analysis on NVIDIA NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications.Featured ArticlesFive stocks we like better than NVIDIAWhat is a Dividend King? 3 Stocks With Unusual Call Option ActivityInvesting in Construction StocksTrump Media & Technology Group Soars on Market DebutInvesting in the High PE Growth Stocks 3 Stocks Insiders Are Buying That Analysts Love  Before you consider NVIDIA, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and NVIDIA wasn't on the list. While NVIDIA currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here If a company's CEO, COO, and CFO were all selling shares of their stock, would you want to know? Expert insights into the psychological impact of stock splits and the potential candidates for future splits. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}