{
    "title": "NVIDIA Loses Almost the Entire Market Cap of Uber as Call Options Get \nMonetized",
    "date": "3/8/2024",
    "url": "https://wccftech.com/nvidia-loses-almost-the-entire-market-cap-of-uber-as-call-options-get-monetized/",
    "text": "This is not investment advice. The author has no position in any of the stocks mentioned. Wccftech.com has a disclosure and ethics policy. Such is NVIDIA's heft these days that even a moderate-sized selloff ends up making records on the stock exchange. At the time of writing, NVIDIA is down just around 5 percent in late-session trading. However, earlier in the session, the stock was up around 5 percent. $NVDA, Nvidia has fallen 4% from being up 5% in the day, wiping out more than an entire $SPOT in marketcap during the downturn. pic.twitter.com/D3hk74EUhb — unusual_whales (@unusual_whales) March 8, 2024  This ~10 percent correction, however, has ended up making records, courtesy of NVIDIA's gargantuan market cap that still resides well north of the $2 trillion level. Looks like a lot of $NVDA calls are being monetized here. That means delta getting sold. Call skew during the week and drop before the weekend. Meme trading 101 👀 @doc_mcgraw @wolveran1 @Tim10337907 pic.twitter.com/VdRcoCACtI — Menthor Q (@MenthorQpro) March 8, 2024  Do note that today's price action has not been prompted by any specific news. Instead, this is a classic response to a call-heavy regime. With the end of the week approaching, traders began exercising their in-the-money call options on NVIDIA earlier today. This then prompted option dealers to unwind their hedges by selling the underlying NVIDIA shares, compounding today's selloff. NVIDIA closed at a market capitalization of $2.317 trillion yesterday. At the time of writing, the stock boasts a market cap of $2.18 trillion. This means that within a span of just a few hours, NVIDIA has lost $137 billion in market cap, or around 84 percent of Uber's entire market capitalization! As we reported in a previous post, traders spent a whopping $20 billion betting on NVIDIA's options in the last week of February, eclipsing the rest of the \"Magnificent 7\" grouping of high-flying names by a wide margin. This options-heavy regime, however, is working against the bulls today. Nonetheless, NVIDIA is likely to remain a momentum front-runner for the time being on the back of aggressive AI-related tailwinds. Consider the fact that the company's data center segment recently reported quarterly revenue of $18.4 billion vs. just around $3.6 billion in the comparable quarter last year. Moreover, the GPU manufacturer now expects to earn $24 billion, give or take 2 percent, in the ongoing quarter. We noted recently that Nancy Pelosi had earned 10 years' worth of pay in unrealized gains in just 103 days by placing a smart bet on NVIDIA via deep-in-the-money call options. Today's selloff is likely to dampen the career democrat's gargantuan gains on this bet. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}