{
    "title": "Nvidia, Microsoft and Alphabet are top holdings in this beautiful ETF. \nHere's why it's a buy now.",
    "date": "3/29/2024",
    "url": "https://thebharatexpressnews.com/nvidia-microsoft-and-alphabet-are-top-holdings-in-this-beautiful-etf-heres-why-its-a-buy-now/",
    "text": " Artificial intelligence (AI) could transform the economy by performing tasks that humans cannot do and making existing workers more productive. Goldman Sachs believes the technology will add $7 trillion to the global economy over the next decade, while Cathie Wood’s Ark Investment Management estimates that figure at $200 trillion. Investors are rushing to buy AI stocks Nvidia, Microsoft, AlphabetAnd Amazonall of which have increased dramatically in the past year. But other AI stocks aren’t doing so well. C3.ai Share prices have more than doubled in 2023, but remain 82% below all-time highs.  In the same way, Upstart The stock is down 93% from its all-time high.  These cases prove that developing AI alone is not enough: companies must build solid businesses. Separating the AI ​​winners from the losers won’t be easy for investors in the long run, but exchange-traded funds (ETFs) can take away that challenge. Image source: Getty Images. Table of Contents An ETF can contain dozens or even hundreds of individual stocks, neatly packaged into one security for investors to purchase.  They provide exposure to specific market segments (such as AI) and are typically actively managed, meaning a team of professionals will adjust the ETF’s portfolio as necessary. That takes a lot of pressure off individual investors.  And because an ETF can hold so many stocks, one bad performance won’t lead to catastrophic financial losses. There are a number of AI-focused ETFs available to investors, but the Roundhill Generative AI and Technology ETF (NYSEMKT: CHAT) it’s noticable.  It was launched in 2023 and is already beating the benchmark returns S&P500 Table of contents.  Here’s why it’s a buy now. The CHAT ETF invests in companies developing the platforms, infrastructure and software needed to bring AI to life.  The ETF holds 47 different stocks, but the top 10 investments account for 45.5% of the portfolio’s total value. The story continues That top 10 (and the portfolio as a whole) includes some of the most popular names in the AI ​​space: stock CHAT ETF Portfolio Weighting 1. Nvidia 8.36% 2.Microsoft 7.26% 3. Alphabet (Google) 5.55% 4. Metaplatforms 4.25% 5.Adobe 4.03% 6.Salesforce 3.55% 7. Amazon 3.27% 8. Baidu 3.23% 9. Arista Networks 3.10% 10. ServiceNow 2.92% Data source: Roundhill Investments.  Portfolio weightings as of March 24, 2024 and subject to change. Nvidia produces the world’s most powerful graphics processing units (GPUs) for data center infrastructure, designed to handle AI workloads.  The stock rose 239% last year, making it the best performer in the entire S&P 500 index. Microsoft, Alphabet and Amazon are home to the world’s largest cloud computing platforms, where millions of companies can access AI models to build their own applications. Adobe uses generative AI to make its leading photo and video editing software even more powerful, and Sales team uses the technology to improve its customer relationship management software for businesses. Several household names are also outside CHAT’s top 10.  They contain Advanced micro devicesthat develops AI chips for the data center and for computing purposes, and Oraclea world-class data center operator for AI developers. Palantir Technologies and C3.ai also appear in the ETF. The CHAT ETF is already up 18.9% through 2024, crushing the S&P 500 index’s 10.3% return.  The ETF launched in May 2023 and has returned 41.7% since its inception, surpassing the S&P 500’s 26.5% return over the same period. It’s no surprise, considering stocks like Nvidia and Metaplatforms have delivered triple-digit percentage gains over the past twelve months.  Stocks such as Microsoft, Salesforce, Amazon, AMD and Service now are also all up better than 50% in the past year. Each of the companies in the CHAT ETF is at the forefront of the AI ​​revolution, and given the substantial value this technology could create over the next decade, it should continue to outperform the S&P 500. However, investors should consider concentration risk.  This ETF could plummet if AI doesn’t live up to the hype, as most of the stocks mentioned above would lose a significant portion of their value. The CHAT ETF is a good option for investors looking for a simple way to own AI stocks as part of a diversified portfolio. Should you invest $1,000 in Tidal Trust II – Roundhill Genative Ai & Technology ETF right now? Before buying shares in Tidal Trust II – Roundhill Genative Ai & Technology ETF, consider the following: The Motley Fool stock advisor The analyst team has just identified what they think is the 10 best stocks for investors to buy now… and Tidal Trust II – Roundhill Generative Ai & Technology ETF wasn’t one of them.  The ten stocks that survived the cut could deliver monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including portfolio building guidance, regular analyst updates and two new stock picks per month.  The Stock Advisor service has more than tripled the return of the S&P 500 since 2002*. View the 10 stocks *Stock Advisor returns March 25, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors.  Randi Zuckerberg, former director of market development and spokeswoman for Facebook and sister of Mark Zuckerberg, CEO of Meta Platforms, is a member of The Motley Fool’s board of directors.  Suzanne Frey, a director at Alphabet, is a member of The Motley Fool’s board of directors.  Anthony Di Pizio has no positions in the stocks mentioned.  The Motley Fool holds positions in and recommends Adobe, Advanced Micro Devices, Alphabet, Amazon, Arista Networks, Baidu, Goldman Sachs Group, Meta Platforms, Microsoft, Nvidia, Oracle, Palantir Technologies, Salesforce, ServiceNow, and Upstart.  The Motley Fool recommends C3.ai and recommends the following options: long calls in January 2026 for $395 at Microsoft and short calls in January 2026 for $405 at Microsoft.  The Motley Fool has a disclosure policy. Nvidia, Microsoft and Alphabet are top holdings in this beautiful ETF.  Here’s why it’s a buy now.  was originally published by The Motley Fool Save my name, email, and website in this browser for the next time I comment.   Δ "
}