{
    "title": null,
    "date": "2/3/2024",
    "url": "https://tech.hindustantimes.com/tech/news/microsoft-reminds-business-users-of-july-end-teams-migration-deadline-71612359700428.html",
    "text": "Copyright © HT Media Limited  All rights reserved. Microsoft has issued a reminder to businesses that are still using its Skype for Business Online service that they have only six months to migrate to the company's lean and feature-packed Microsoft Teams service by July 31, before the former is permanently retired. The company shared additional details in a post on the Microsoft Teams blog earlier this week, telling users that they were currently focused on helping customers upgrade to Microsoft Teams. The company had first informed users in July 2019, that they would have to migrate fully to Teams before the Skype for Business Online service was retired. Also read: Skype for Android gets support for Android 11's bubble chats Six months might sound like a long time for Microsoft to be warning about an impending shutdown, but migrating a large organisation's Skype for Business Online groups and setups could take much longer, and Microsoft is sympathetic. It has categorised businesses into two possible camps - those who have begun the process of migration and are gradually moving users and workloads, and those who are ‘not far along' in the upgrade process. For the latter, Microsoft says it isn't too late. “It's understandable as the events of the past year have impacted strategies, priorities, and resources for so many. Don't worry, you still have time,” the company said on its blog, adding that there were ‘numerous examples' of organisations that have switched from Skype for Business Online or Skype for Business Server to MicrosoftTeams “in a matter of months”. Read more: Microsoft improves OneDrive app's homescreen, adds support for 8K video playback Microsoft suggests that companies that need assistance with migration look at the Microsoft Teams admin documentation, followed by workshops on Teams upgrade planning and Chalk Talk. It also states that FastTrack assistance may be available for eligible subscriptions, but a Microsoft Partner could also be engaged for those who want to help plan or execute the upgrade before the Skype for Business Online service is retired. Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71612359700428 "
}