{
    "title": "Better Artificial Intelligence (AI) Stock: AMD vs. Microsoft",
    "date": "1/3/2024",
    "url": "https://finance.yahoo.com/news/better-artificial-intelligence-ai-stock-130200031.html",
    "text": "The artificial intelligence (AI) market exploded last year, becoming one of the fastest-growing industries. Data from Grand View Research shows the AI market is projected to expand at a compound annual growth rate of 37% through 2030, which would see it exceed a value of $1 trillion before the end of the decade. So it's no surprise that companies worldwide have restructured their businesses to focus on the budding sector, presenting a variety of investment opportunities. Advanced Micro Devices (NASDAQ: AMD) and Microsoft (NASDAQ: MSFT) are some of the most attractive options, with one making moves in AI chips and the other heavily investing in the software side of the industry. So let's take a look at whether AMD or Microsoft is currently the better stock for those who want to back the rapidly expanding AI market. Since its founding more than 50 years ago, AMD has become one of the biggest threats in chips. The company hasn't always been first to a market but has proven its ability to carve out a lucrative position in almost any part of the industry with its advanced technology and decisive leadership. AMD CEO Lisa Su took the helm in October 2014. Since then, the company's shares have soared over 4,000% as it has become a leader in central and graphics processing units (CPUs and GPUs). In fact, AMD's CPU market share has risen from 18% in 2017 to 35% in 2023, gradually chipping away at Intel's share. Meanwhile, the tech giant has attained a significant share of desktop GPUs, second only to Nvidia. As a result, AMD's expansion into AI strengthens its long-term outlook. Nvidia might have an estimated 90% market share in AI chips, but AMD's past performance suggests it will be able to secure a powerful role in the sector. AMD will begin shipping its MI300X GPU this year, designed specifically to challenge Nvidia's offerings. The AI chip already has Microsoft's Azure signed on as a customer, with AMD in talks with several other tech companies. It's still early days for AMD's AI journey, but it's likely to go far in the market in the coming years. Microsoft got a head start in AI, investing $1 billion in ChatGPT developer OpenAI in 2019. The company has since increased that investment significantly and now boasts a 49% stake in the start-up. Microsoft's partnership with OpenAI has granted it access to some of the most advanced AI models, giving it an edge over rivals like Amazon and Alphabet. The Windows company has used OpenAI's technology to bring AI upgrades across its product lineup. Its cloud platform, Azure, has expanded its range of AI tools, search engine Bing has been improved with ChatGPT-like features, and various Office productivity services now promise to boost efficiency with the help of AI. Meanwhile, Microsoft has delivered impressive quarterly earnings. In the first quarter of 2024 (ending September 2023), the company posted revenue growth of 13% year over year, beating Wall Street forecasts by nearly $2 billion. Gains came from considerable growth in its productivity and cloud-related segments, which saw revenue increase by 13% and 19%, respectively. As the home of brands like Windows, Office, Azure, Xbox, and LinkedIn, Microsoft has a massive user base. Millions of businesses rely on its software, presenting considerable earning opportunities in AI. AMD and Microsoft have solid outlooks in AI over the long term. AMD looks poised to shake up the chip market with the launch of its new GPU. Meanwhile, Microsoft has the tech and brand loyalty to become the go-to for anyone looking to integrate AI into their workflow. However, the charts below suggest AMD might have more stock growth potential over the next two fiscal years. These tables compare AMD's and Microsoft's EPS estimates for the next two fiscal years. According to the data, AMD's earnings could hit $5 per share by fiscal 2026, while Microsoft's will likely reach $15 per share. On the surface, Microsoft looks like a no-brainer. Yet multiplying those figures by AMD's forward price-to-earnings ratio of 55 and Microsoft's 34 yields stock prices of $275 and $510, respectively. Looking at their current positions, AMD's share would rise 87% and Microsoft's 36% over the next two fiscal years. As a result, AMD looks like the better AI stock right now and an attractive buy at the start of 2024. Should you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Advanced Micro Devices wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of December 18, 2023  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Better Artificial Intelligence (AI) Stock: AMD vs. Microsoft was originally published by The Motley Fool Related Quotes "
}