{
    "title": null,
    "date": "2/3/2024",
    "url": "https://techxplore.com/news/2024-02-microsoft-ceo-satya-nadella-caps.html",
    "text": "Click here to sign in with\n                  \n\n\n                  or Forget Password? Learn more share this! 1 Twit Share Email February 3, 2024 This article has been reviewed according to Science X's \n                                                    editorial process\n                                                    and policies.\n                                                    Editors have highlighted\n                                                    the following attributes while ensuring the content's credibility: fact-checked reputable news agency proofread by Matt O'brien Satya Nadella marks his tenth year as Microsoft CEO on Sunday, capping a decade of stunning growth as he pivoted the slow-moving software giant into a laser focus on cloud computing and artificial intelligence. Microsoft's stock has soared by more than 1,000% since Nadella took the helm in 2014, compared to the more gradual 185% growth of the broader S&P 500. Microsoft now has a market value of $3 trillion—more than any U.S. publicly traded company, including its longtime rival Apple. \"Nadella's had the biggest transformation of a tech company potentially ever,\" said Wedbush Securities analyst Daniel Ives. \"The only one that would rival it was (Steve) Jobs coming back to Apple and turning it around with the iPhone.\" Microsoft has created $2.8 trillion in shareholder wealth in the past decade, meaning an investor who bought a $10,000 stake in Microsoft at the time Nadella took over and did nothing with those shares, would have a stake worth about $113,000 now. \"Our industry does not respect tradition—it only respects innovation,\" Nadella told employees in an inaugural memo 10 years ago, an opening salvo that hinted at bigger shifts to come. Microsoft declined requests for an interview. Now a hero to Wall Street, some were at first skeptical that such transformation could come from an insider who'd already spent 22 years at the Redmond, Washington company. He's only the third Microsoft CEO, following Steve Ballmer, who lasted for 14 years, and Bill Gates, who co-founded the company in 1975 and took it public in 1986. Big changes came quickly under Nadella. He marshaled resources to build up the Azure cloud computing platform, a shift in priorities from the company's longtime reliance on its flagship Windows operating system and the royalties it gets for each PC sold with it. And he largely put the brakes on Microsoft's ill-fated attempts to play catch-up in the smartphone market, marked by his predecessor Ballmer's $7.3 billion acquisition of Nokia's phone business. But some of the biggest changes were in the company's culture, a shift away from Microsoft's brash external reputation and internal bickering to a more collaborative approach that Nadella has modeled in his own collegial personality and engineer's mindset. LEARN-IT-ALL CULTURE \"Microsoft is known for rallying the troops with competitive fire,\" Nadella said in his 2017 autobiography. \"The press loves that, but it's not me.\" Much of Nadella's strength is how he stands out from the typical \"very strong ego CEO,\" said Raimo Lenschow, a stock analyst at Barclays who covers 36 tech companies. Instead of making bold pronouncements, Lenschow said Nadella takes a more measured approach to explaining \"where he thinks the future is going.\" And \"whether it's the person making food in the cafeteria, an engineer, finance executive, a customer, he treats everyone in the same way, with respect,\" said Ives. It's not just Wall Street analysts who think so. A tiny startup from Zeeland, Michigan, running a booth at January's CES gadget show in Las Vegas caught a glimpse of Nadella's curiosity when he showed up, shook founder Tim Murphy's hand and asked for a demo. The product, Audio Radar, visualizes the sounds in video games for deaf and hard of hearing players. \"He's very down to earth,\" said Murphy, who was there with a small crew including his teen son. \"I gave him the pitch, played some games, and he was like, 'It's wonderful what you're doing.' Honestly, I can't really remember too much of what he said because I was just kind of shocked.\" Nadella has long made the accessibility of technology a priority, informed in part by his experience raising a son who was visually impaired, quadriplegic and had cerebral palsy. Zain Nadella died in 2022. What's brought Microsoft to its latest heights is its emergence as an artificial intelligence leader, setting the agenda on how AI tools could get used in work and society. While Nadella has been emphasizing AI for most of his tenure, its role was not guaranteed and happened after years of careful planning that led to a close partnership with ChatGPT-maker OpenAI. (OpenAI pays The Associated Press an undisclosed fee to license its archive of news stories). \"Historically, if you're a cool startup that was doing something amazing, Microsoft wasn't really your first choice,\" Lenschow said. \"So the fact that he got OpenAI to commit to Azure was an amazing masterstroke ... it gives him a massive, competitive advantage over Google and Amazon.\" That position was put in jeopardy late last year when OpenAI's board of directors suddenly fired CEO Sam Altman. A weekend of behind-the-scenes maneuvers and a threatened mass exodus of employees championed by Nadella helped bring back Altman and stabilize the startup, assuaging clients and shareholders. \"He handled that like he was in the World Series of Poker playing against little kids,\" Ives said. Nadella's tenure hasn't been without hiccups, especially given how much of the world relies so heavily on Microsoft products—sometimes to the frustration of people using them. Cybersecurity experts say its tendency is to sacrifice security for convenience, including in its gung-ho rollout of AI large language models. The company's trademark suite of work tools, Microsoft Office 365, has also been penetrated successfully in recent years in embarrassing high-profile compromises that have seen elite Russian and Chinese cyber operators access the email accounts of senior U.S. officials and members of Microsoft's senior leadership team. It stepped in to provide cloud hosting to Ukraine just ahead of Russia's 2022 invasion, but the networks serving NATO allies are constantly peppered by intrusion attempts. That, and the worsening ransomware scourge, have led Nadella to call for a cyber Geneva Convention with Russia and China. And despite Nadella's stated aversion to \"competitive fire,\" Microsoft is once again drawing the kind of antitrust scrutiny that dogged Gates and Ballmer in earlier years. Nadella's confident testimony at a federal court hearing last summer helped persuade a judge not to block Microsoft's purchase of video game giant Activision Blizzard, but the company is now facing another round of questions on its partnership with OpenAI. None of those challenges are likely to push Nadella, 56, who made $48.5 million in total compensation last year and has also chaired Microsoft's board since 2021, out of his leadership roles anytime soon. \"From everything I can gather, he's really enjoying himself,\" Lenschow said. \"We're in very, very, very interesting times. I would expect him to stay for a while.\" © 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Explore further Facebook Twitter Email Feedback to editors 19 hours ago 0 23 hours ago 0 Mar 20, 2024 0 Mar 20, 2024 0 Mar 19, 2024 0 13 hours ago 13 hours ago 13 hours ago 14 hours ago 14 hours ago 15 hours ago 16 hours ago 17 hours ago 17 hours ago 19 hours ago Jan 16, 2024 Jan 31, 2024 Oct 2, 2023 Jun 17, 2021 Nov 20, 2023 May 24, 2023 14 hours ago Mar 18, 2024 Mar 18, 2024 Mar 13, 2024 Mar 12, 2024 Mar 6, 2024 Use this form if you have come across a typo, inaccuracy or would like to send an edit request for the content on this page.\n\t\t\t\t\t\t\t\t\t\t\tFor general inquiries, please use our  contact form.\n\t\t\t\t\t\t\t\t\t\t\tFor general feedback, use the public comments section below (please adhere to guidelines). Please select the most appropriate category to facilitate processing of your request Thank you for taking time to provide your feedback to the editors. Your feedback is important to us. However, we do not guarantee individual replies due to the high volume of messages. Your email address is used only to let the recipient know who sent the email. Neither your address nor the recipient's address will be used for any other purpose. The information you enter will appear in your e-mail message and is not retained by Tech Xplore in any form.  Daily science news on research developments and the latest\n                                    scientific innovations Medical research advances and health news The most comprehensive sci-tech news coverage on the web This site uses cookies to assist with navigation, analyse your use of our services, collect data for ads\n            personalisation and provide content from third parties.\n            By using our site, you acknowledge that you have read and understand our Privacy\n                Policy\n            and Terms of\n                Use. "
}