{
    "title": null,
    "date": "3/3/2024",
    "url": "https://www.defenseworld.net/2024/03/03/microsoft-co-nasdaqmsft-shares-acquired-by-metis-global-partners-llc.html",
    "text": "Posted by Defense World Staff on Mar 3rd, 2024 Metis Global Partners LLC increased its stake in  Microsoft Co. (NASDAQ:MSFT – Free Report) by 16.3% in the 3rd quarter, according to its most recent Form 13F filing with the Securities & Exchange Commission. The firm owned 349,129 shares of the software giant’s stock after purchasing an additional 48,903 shares during the quarter. Microsoft comprises about  5.3% of Metis Global Partners LLC’s portfolio, making the stock its 2nd biggest holding. Metis Global Partners LLC’s holdings in Microsoft were worth $110,237,000 as of its most recent filing with the Securities & Exchange Commission. Several other institutional investors have also bought and sold shares of the stock. First County Bank CT lifted its holdings in  Microsoft by 2.4% in the third quarter. First County Bank CT now owns 23,861 shares of the software giant’s stock worth $7,534,000 after purchasing an additional 566 shares during the period.  Glass Jacobson Investment Advisors llc lifted its holdings in  Microsoft by 0.6% in the 3rd quarter. Glass Jacobson Investment Advisors llc now owns 9,108 shares of the software giant’s stock valued at $2,876,000 after acquiring an additional 58 shares during the last quarter.  Mycio Wealth Partners LLC acquired a new stake in  Microsoft in the 3rd quarter valued at about $234,000.  Barclays PLC lifted its holdings in  Microsoft by 9.3% in the 3rd quarter. Barclays PLC now owns 28,987,007 shares of the software giant’s stock valued at $9,152,647,000 after acquiring an additional 2,456,190 shares during the last quarter.  Finally, Fox Run Management L.L.C. lifted its holdings in  Microsoft by 63.0% in the 3rd quarter. Fox Run Management L.L.C. now owns 2,070 shares of the software giant’s stock valued at $654,000 after acquiring an additional 800 shares during the last quarter. Institutional investors and hedge funds own  69.20% of the company’s stock. In other news, major shareholder Corp Microsoft sold 1,000,000 shares of Microsoft stock in a transaction dated Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the transaction, the insider now owns 11,677,398 shares in the company, valued at approximately $22,770,926.10. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is available at the SEC website. In related news, insider Bradford L. Smith sold 3,303 shares of Microsoft stock in a transaction that occurred on Monday, February 5th. The stock was sold at an average price of $406.12, for a total value of $1,341,414.36. Following the sale, the insider now owns 570,826 shares of the company’s stock, valued at approximately $231,823,855.12. The sale was disclosed in a legal filing with the SEC, which can be accessed through this link. Also, major shareholder Corp Microsoft sold 1,000,000 shares of Microsoft stock in a transaction that occurred on Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total value of $1,950,000.00. Following the completion of the sale, the insider now directly owns 11,677,398 shares in the company, valued at approximately $22,770,926.10. The disclosure for this sale can be found here. Insiders have sold 1,072,984 shares of company stock worth $30,928,803 in the last 90 days. Corporate insiders own  0.03% of the company’s stock. Several analysts have issued reports on the company. Barclays boosted their price objective on Microsoft from $421.00 to $475.00 and gave the stock an “overweight” rating in a report on Wednesday, January 31st. StockNews.com downgraded Microsoft from a “buy” rating to a “hold” rating in a report on Thursday, February 22nd. Wells Fargo & Company upped their target price on Microsoft from $435.00 to $460.00 and gave the company an “overweight” rating in a report on Wednesday, January 31st. BNP Paribas raised Microsoft from a “neutral” rating to an “outperform” rating and set a $471.00 target price for the company in a research report on Thursday, January 18th. Finally, Royal Bank of Canada upped their target price on Microsoft from $415.00 to $450.00 and gave the stock an “outperform” rating in a research report on Wednesday, January 31st. Four analysts have rated the stock with a hold rating and thirty-six have given a buy rating to the company. According to data from MarketBeat.com, the company currently has a consensus rating of “Moderate Buy” and an average price target of $411.06. Check Out Our Latest Research Report on Microsoft Shares of MSFT opened at $415.50 on Friday. The company has a current ratio of 1.22, a quick ratio of 1.20 and a debt-to-equity ratio of 0.19. Microsoft Co. has a 1 year low of $245.61 and a 1 year high of $420.82. The stock has a market cap of $3.09 trillion, a P/E ratio of 37.57, a price-to-earnings-growth ratio of 2.20 and a beta of 0.89. The stock’s 50-day moving average price is $396.34 and its two-hundred day moving average price is $362.55. Microsoft (NASDAQ:MSFT – Get Free Report) last issued its earnings results on Tuesday, January 30th. The software giant reported $2.93 earnings per share (EPS) for the quarter, topping analysts’ consensus estimates of $2.76 by $0.17. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The firm had revenue of $62.02 billion for the quarter, compared to analysts’ expectations of $61.14 billion. During the same quarter last year, the business earned $2.32 earnings per share. The company’s revenue was up 17.6% compared to the same quarter last year.  On average, equities analysts predict that  Microsoft Co. will post 11.63 earnings per share for the current year. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Microsoft Co. (NASDAQ:MSFT) Shares Sold by Financial Counselors Inc. Microsoft Co. (NASDAQ:MSFT) is LCM Capital Management Inc’s 5th Largest Position "
}