{
    "title": null,
    "date": "3/3/2024",
    "url": "https://247wallst.com/investing/2024/03/03/will-ai-hurt-alphabets-stock/",
    "text": "Google was founded in 1998 and went public in 2004. In the 1990s, Yahoo was the top search engine measured by market share. Microsoft (NASDAQ: MSFT) tried to create a search giant in 2006 by marrying its search operations to Yahoo’s. Management at Yahoo turned the deal down. Even with a merger, Google’s rise in consumer search engine usage was already surging. Google created parent company Alphabet (NASDAQ: GOOG) in 2015. After over two decades of holding the lead position among search engines, by far, in the US, Europe, Latin America, and much of Asia, Alphabet’s Google may face its first challenge due to AI. Several companies believe that, with artificial intelligence, they can build better search algorithms. If so, it could significantly damage Google’s revenue and that of its parent. Google’s hold on digital marketing dollars is amazing. It has about 27% of the US market, followed by Meta’s (NASDAQ; META) Facebook at 20% and Amazon (NASDAQ: AMZN) at 13%. Can adding Amazon save the DJIA? The New York Times tested a new AI-based search engine called Perplexity. Jeff Bezos is among its investors. It raised money recently at a $520 million valuation. After extensive testing, the Times writer observed, “I’m now more convinced that A.I.-powered search engines like Perplexity could loosen Google’s grip on the search market, or at least force it to play catch-up.” He also pointed out that Google has several products like Gmail and Google Maps. Additionally, it may be hard to break the search habits of hundreds of millions of people. The largest threat to Google is that OpenAI, the massive AI company with close ties to Microsoft, may be working on its own search engine. Quartz reports, “Google was caught flat-footed by the AI apocalypse, which could spell disaster for the search giant.” A great deal is at stake. Alphabet relies on Google and YouTube for almost all of its revenue. It has a market cap of $1.7 trillion, making it among the world’s most valuable companies. Its stock has been up 148% in the last five years. Last year, Alphabet had revenue of $307 billion and a net income of $74 billion. Its revenue continues to grow at a low double-digit pace. After years of dominance, Google may finally have some competition. Robinhood set out to democratize investing to individuals, and it’s not slowing down. The app makes it possible to buy and sell stocks, mutual funds, trade options, and even cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH). With FDIC insurance ,an award winning design, and benefits like IRAs and more, Robinhood could be your path to a richer tomorrow. Sign up today — click here to start your journey. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}