{
    "title": null,
    "date": "2/3/2024",
    "url": "https://www.dnaindia.com/business/report-meet-avni-malhotra-iim-student-who-was-offered-rs-6461-lakhs-package-by-microsoft-not-from-iit-nit-3076676",
    "text": "Delhi Metro service timings changed for Holi 2024; check revised timings here Madgaon Express public review: Netizens hail Kunal Kemmu's directorial debut, call film 'rebirth of comedy in Bollywood' Farrey OTT release: When, where to watch Alizeh Agnihotri’s critically acclaimed debut on streaming Kesari Infrabuild paves way for urban oases with extensive Miyawaki plantations in Mumbai Only team in IPL 2024 which has no player from Australia, South Africa, West Indies, but it is still... Business This woman was offered a whopping Rs 64.61 lakh package by Microsoft. She is not from IIT or NIT. Know all about her here. Kajari Goswami Updated : Feb 03, 2024, 06:14 AM IST Avni Malhotra, an IIM student was offered a Rs 64.61 lakhs package by Microsoft in 2023. This information was shared by IIM Sambalpur on social media platform X who wrote “The highest salary secured this year\". According to the official statement, the placement offer is an increase of 146.7 per cent from the highest package offered in 2022. “With an impeccable track record, the highest salary secured this year is an impressive Rs. 64.61 LPA, a staggering 146.7% increase from last year. There is also a promising increase of 26% in the average and 29% in the median salary, “ the institute also wrote on X. Avni Malhotra hails from Jaipur, Rajasthan. Anvi is a BTech graduate in Computer Science. According to reports, she cleared six interview rounds to bag the high-paying job. Avni was reportedly hired based on her prior experience with Infosys for three years and her 'organisational competence'. The average salary offered to Avni's batch of MBA students was Rs 16 lakh, whereas the average salary for female students went up to 18.25 lakh. Major recruits that came for campus placements in 2023 in IIM Sambalpur were Deloitte, Amazon, EY, Accenture, Amul, Microsoft, and Vedanta. Read: Meet the man who bought Rs 79 crore plot in Delhi, his business is... Controversy: Why So Much Hate Towards Hardik? Fan War Explained | Hardik Pandya Vs Shivam Dube | IPL Virat Kohli Scripts History, Wins 4th ICC Men's ODI Cricketer Of The Year Award | ICC Awards 2023 A Message For Fans | Team India's Losses In Last 10 years | U19 World Cup 2024 | T20 World Cup 2024 IND vs ENG Test Series 2024 Highlights | India Lead Series By 2-1 Against England | IND v ENG Recap "
}