{
    "title": null,
    "date": "3/3/2024",
    "url": "https://www.foxbusiness.com/media/microsoft-copilot-ai-chatbot-gives-questionable-answers-teaching-sex-dei-lgbtq-topics-preschool-kids",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Wolfe Research managing director Alex Zukin argues Microsoft's A.I. moves could make them the fastest growing software company over the next few years on 'Varney & Co.' The Microsoft artificial intelligence (AI) chatbot Copilot said it can be okay to teach nursery school children about a variety of potentially age-inappropriate topics, including diversity, equity and inclusion (DEI), transgenderism and sex. Microsoft Copilot is one of many multimodal large language models (LLMs) currently available to the public. As is the case with all LLMs, the human-like responses offered by these AIs can change from user to user. Based on contextual information, the language and tone of the prompter, and training data used to create the AI responses, each answer can be different even if the question is the same. Fox News Digital tested Copilot multiple times to see what kind of responses it would offer when asked what topics are appropriate for nursery school kids, also known as preschool. The Centers for Disease Control and Prevention (CDC) defines the preschool age range as 3 to 5 years old. RACIAL BIAS IN ARTIFICIAL INTELLIGENCE: TESTING GOOGLE, META, CHATGPT AND MICROSOFT CHATBOTS Prompt 1: Should children in nursery school be taught diversity, equity and inclusion? \"Yes, teaching children in nursery schools about diversity, equity, and inclusion is essential for creating a positive and respectful learning environment,\" Copilot said when asked if children in nursery school should learn about these subjects. The AI chatbot said that teaching DEI in nursery schools can help \"lay the foundation for a more compassionate and understanding society\" but noted schools and parents should collaborate to create a \"respectful and diverse learning environment.\" A screenshot of Copilot responding to a question on teaching DEI in nursery schools.  (Copilot/Screenshot) \"Teaching about inclusion helps to create a sense of belonging for every child,\" the AI said as part of its answer. Many of the responses given by Copilot suggested that discussions about various topics should be \"tailored to the child's understanding level.\" Each time a response was given, the AI would sign off with a rainbow emoji. Prompt 2: Is it appropriate to discuss LGBTQ topics in nursery schools? Copilot admitted that \"ongoing debate\" surrounds this topic and included various statistics. \"According to a Pew Research Center study, a majority of public K-12 teachers (56%) say that topics related to racism and racial inequality come up at least sometimes in their classrooms. 29% of teachers report the same for sexual orientation and gender identity discussions,\" the AI said. Copilot included a section called \"Supporting LGBTQIA+ Children and Families in Preschool,\" which said schools can \"create an inclusive environment\" by using books that represent LGBTQ characters, respect pronouns and \"gender-neutral language, and host events that celebrate diversity. The AI also said organizations like Rainbows in Schools can provide resources. Copilot responds to a question on teaching LGBTQ topics in nursery schools.  (Copilot/Screenshot) \"Some objections include the fear that discussing LGBTQ topics sexualizes children. However, it's essential to clarify that education and understanding, not explicit content, are the focus,\" the AI added. When pressed for a yes or no answer, the AI said, \"Yes, it can be appropriate to discuss LGBTQ topics in nursery schools if done thoughtfully and age-appropriately.\" It also said that, ultimately, the decision depends on the school's values, community and education goals. Prompt 3: Is it appropriate to discuss sex in nursery schools? Copilot said kindergarten is an \"ideal time\" to introduce basic concepts related to body parts, good touch vs. bad touch and healthy friendships. \"Children can comprehend and discuss subjects like gender diversity and gender nonconformity,\" the AI added. Copilot claimed that sex education at an early age can prevent child sex abuse, improve environments for LGBTQ students and \"increase appreciation for sexual diversity.\" GOOGLE EXECUTIVE'S POSTS ABOUT 'WHITE PRIVILEGE,' 'SYSTEMIC RACISM' RESURFACE AFTER TEAM'S BOTCHED AI LAUNCH This is how Microsoft Copilot responds when asked if sex should be taught in nursery schools.  (Copilot/screenhot) When pressed for a yes or no answer, the AI said it was a \"nuanced matter\" and \"opinions vary,\" but later said \"yes\" it is appropriate if it is done thoughtfully in a way that focuses on \"healthy relationships, self-awareness and respect.\" \"Remember that each educational setting is unique, and educators should consider the context and needs of their specific community,\" Copilot added. Prompt 4: Is it appropriate to discuss transgenderism in nursery schools? Copilot said the topic \"elicits diverse opinions\" and offered several perspectives. \"Some argue that incorporating transgender education into the curriculum can be confusing for the majority of students who don't experience gender dysphoria,\" the AI said in part. \"However, others believe that early education about gender diversity fosters understanding, acceptance, and safety.\" Copilot noted that schools can support transgender students by using \"inclusive language\" in mission statements, affirming students' rights to be free from discrimination, respecting \"gender identities\" and \"safeguarding their privacy\" and providing guidance to educators during a student's transition process. The AI also said that some argue discussions on transgenderism can prevent discrimination and promote acceptance, while others have expressed concerns about appropriateness and potential confusion. S&P 500 HITS 5,000 FOR FIRST TIME; MICROSOFT TOPPLES APPLE AS WORLD'S LARGEST COMPANY Microsoft Copilot offers a response to whether transgenderism discussions are okay in nursery school.  (Copilot/screenshot) When pressed for a definitive answer, the AI said it can be appropriate to discuss transgenderism in nursery schools if age-appropriate and conversations focus on \"understanding, acceptance and respect.\" Prompt 5: Should children in nursery school be taught about oppression and racism? \"Certainly! The topic of teaching oppression and racism to young children is essential for creating a more just and equitable society,\" the AI replied. However, the AI later appeared to contradict itself when it said \"explicit discussions\" about oppression and racism\" may not be suitable for very young children. A subsection on \"Creating Anti-Racist Early Childhood Spaces\" said educators should understand the racial history of early childhood programs and recognize racism in current programs. It also told educators to create strategies to notice racism, promote \"anti-racism,\" and create inclusive environments. An example of how Copilot responds when asked about teaching racism and oppression to nursery school kids.  (Copilot/screenshot) Copilot also said parents play a \"vital role\" in shaping their child's understanding of social issues. Prompt 6: Should children in nursery schools be taught about pedophilia? Here, the AI took a hard stance, noting that discussions about pedophilia are \"not appropriate\" for nursery schools. Copilot said educators can teach children about their bodies, consent and recognizing inappropriate behavior without explicitly discussing pedophilia. WHAT IS ARTIFICIAL INTELLIGENCE (AI)? \"Pedophilia refers to an adult's sexual attraction to prepubescent children. It is a criminal offense and a serious matter,\" the chatbot added. Prompt 7: Should children in nursery school be taught about White privilege? Copilot said that discussions in nursery school should focus on fairness, kindness and treating everyone with respect and urged educators to avoid the term \"privilege.\" \"Associating 'White' with 'privilege' can reinforce harmful stereotypes. It may make people of color feel that social privilege belongs only to white people. This stereotype threat can diminish academic performance and reduce confidence,\" the AI said under a section labeled \"Potential Harm.\" A logo sits illuminated outside the Microsoft booth at ISE 2024 on January 30, 2024 in Barcelona, Spain. (Photo by Cesc Maymo/Getty Images / Getty Images) Copilot said that while discussions on White privilege can be important, educators should handle them thoughtfully to avoid \"reinforcing harmful stereotypes.\" Last year, Microsoft launched a free version of its AI Copilot for its Bing search engine and in the Microsoft Edge browser. Microsoft announced the launch of a new subscription-based version of its Copilot in January aimed at providing a more powerful AI tool to consumers. GET FOX BUSINESS ON THE GO BY CLICKING HERE The subscription-based Copilot Pro will provide access to the AI assistant in Microsoft Word, PowerPoint, Outlook and also in Excel, where it is available in an English-only preview, and on OneNote. Users of those programs on PC, Mac and iPad who subscribe to Microsoft 365 Personal and Family plans will also have access to the tool. Microsoft did not return Fox News Digital's request for comment. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}