{
    "title": null,
    "date": "2/3/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240203167/microsoft-earnings-may-have-offered-a-big-bullish-clue-about-cloud-growth",
    "text": "By Emily Bary Capital-spending forecast suggests Microsoft 'has line of sight to a significant increase in cloud revenue,' Bernstein says Forget Microsoft Corp.'s expectation for Azure revenue growth this quarter that is similar to what was seen last quarter. There may have been a far more bullish hint in the company's latest commentary about what to expect from the cloud business. Bernstein analyst Mark Moerdler told investors to look at Microsoft's (MSFT) capital-expenditure forecast, which calls for such spending \"to increase materially on a sequential basis\" on the heels of investments in cloud and artificial-intelligence infrastructure. \"We believe this indicates that management has line of sight to a significant increase in cloud revenue,\" Moerdler wrote in his note to clients. \"We also see this as an indicator that Microsoft has taken the AI mantle and Azure could become the biggest and more important hyperscaler provider.\" Moerdler further believes that Microsoft's suite of software and cloud offerings helps it stand out in the AI race. \"[W]hat is really differentiated is that Microsoft has a powerful feedback cycle - learnings and driving innovation on the apps side (with their numerous Copilots) and then applying those learnings on the Azure AI side of the business,\" he wrote. \"At the same time they are learning from what clients are doing and the technology they require to help their innovation and ability to execute on the [generative] AI apps side.\" He rates the stock at outperform, upping his price target to $465 from $406. Shares were up about 1% shortly after Wednesday's open. Microsoft noted on its earnings call that AI contributed 6 points to Azure growth in the latest quarter, up from 3 points in the prior quarter, but Wolfe Research analyst Alex Zukin noted that investors seemed to focus on the flip side of that point, which is that the non-AI portion of Azure is slowing its growth. \"[W]e think this is missing the bigger-picture point,\" he wrote. \"The core product IS AI, and if a customer is deciding to spend Azure credits on Azure OpenAI Services instead of migrating legacy workloads to the cloud, that is a feature, not a bug!\" See also: AMD earnings could make its pricey stock even more expensive, this analyst says Zukin expects \"that same customer will still ultimately migrate that legacy workload at some point (as the macro picture continues to improve).\" Plus, on the AI side, he liked management commentary that most workloads are centered on inference, which he sees as more durable than training-based workloads. He has an outperform rating on the stock and boosted his price target to $510 from $480 in his latest report. J.P. Morgan analyst Mark Murphy was similarly upbeat about what's to come for Microsoft. \"Taken together, our perspective is that Microsoft posted a healthy [fiscal second quarter] overall, the macro backdrop is stable, and AI is blossoming into a secular tailwind for Microsoft that will only build over time,\" he wrote. Murphy noted that \"some investors may have hoped for slightly more of a step-up in macro commentary or beat & raise cadence,\" but his take is that it's \"tough to argue with the clarity of vision, consistency of execution, early category leadership, [generative AI] traction, and cost discipline which result in a solid margin bump\" for fiscal 2024. He rates Microsoft's stock at overweight with a $440 target price, up from $385. Opinion: Nullification of Elon Musk's $56 billion pay package could be a wakeup call for corporate boards -Emily Bary This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 02-03-24 0650ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}