{
    "title": null,
    "date": "1 Jan 2024",
    "url": "https://finance.yahoo.com/news/intrinsic-calculation-amazon-com-inc-120020526.html",
    "text": "The projected fair value for Amazon.com is US$196 based on 2 Stage Free Cash Flow to Equity Amazon.com's US$152 share price signals that it might be 23% undervalued The US$176 analyst price target for AMZN is 10% less than our estimate of fair value Today we'll do a simple run through of a valuation method used to estimate the attractiveness of Amazon.com, Inc. (NASDAQ:AMZN) as an investment opportunity by taking the forecast future cash flows of the company and discounting them back to today's value. Our analysis will employ the Discounted Cash Flow (DCF) model. Believe it or not, it's not too difficult to follow, as you'll see from our example! Remember though, that there are many ways to estimate a company's value, and a DCF is just one method. If you still have some burning questions about this type of valuation, take a look at the Simply Wall St analysis model. View our latest analysis for Amazon.com We're using the 2-stage growth model, which simply means we take in account two stages of company's growth. In the initial period the company may have a higher growth rate and the second stage is usually assumed to have a stable growth rate. To begin with, we have to get estimates of the next ten years of cash flows. Where possible we use analyst estimates, but when these aren't available we extrapolate the previous free cash flow (FCF) from the last estimate or reported value. We assume companies with shrinking free cash flow will slow their rate of shrinkage, and that companies with growing free cash flow will see their growth rate slow, over this period. We do this to reflect that growth tends to slow more in the early years than it does in later years. Generally we assume that a dollar today is more valuable than a dollar in the future, and so the sum of these future cash flows is then discounted to today's value: 2024 2025 2026 2027 2028 2029 2030 2031 2032 2033 Levered FCF ($, Millions) US$53.7b US$73.4b US$85.2b US$89.6b US$106.7b US$116.2b US$124.2b US$131.0b US$136.9b US$142.2b Growth Rate Estimate Source Analyst x16 Analyst x11 Analyst x3 Analyst x4 Analyst x4 Est @ 8.89% Est @ 6.89% Est @ 5.49% Est @ 4.51% Est @ 3.82% Present Value ($, Millions) Discounted @ 7.5% US$49.9k US$63.6k US$68.6k US$67.1k US$74.4k US$75.4k US$74.9k US$73.5k US$71.5k US$69.1k (\"Est\" = FCF growth rate estimated by Simply Wall St)Present Value of 10-year Cash Flow (PVCF) = US$688b We now need to calculate the Terminal Value, which accounts for all the future cash flows after this ten year period. The Gordon Growth formula is used to calculate Terminal Value at a future annual growth rate equal to the 5-year average of the 10-year government bond yield of 2.2%. We discount the terminal cash flows to today's value at a cost of equity of 7.5%. Terminal Value (TV)= FCF2033 × (1 + g) ÷ (r – g) = US$142b× (1 + 2.2%) ÷ (7.5%– 2.2%) = US$2.8t Present Value of Terminal Value (PVTV)= TV / (1 + r)10= US$2.8t÷ ( 1 + 7.5%)10= US$1.3t The total value is the sum of cash flows for the next ten years plus the discounted terminal value, which results in the Total Equity Value, which in this case is US$2.0t. To get the intrinsic value per share, we divide this by the total number of shares outstanding. Compared to the current share price of US$152, the company appears a touch undervalued at a 23% discount to where the stock price trades currently. The assumptions in any calculation have a big impact on the valuation, so it is better to view this as a rough estimate, not precise down to the last cent. The calculation above is very dependent on two assumptions. The first is the discount rate and the other is the cash flows. Part of investing is coming up with your own evaluation of a company's future performance, so try the calculation yourself and check your own assumptions. The DCF also does not consider the possible cyclicality of an industry, or a company's future capital requirements, so it does not give a full picture of a company's potential performance. Given that we are looking at Amazon.com as potential shareholders, the cost of equity is used as the discount rate, rather than the cost of capital (or weighted average cost of capital, WACC) which accounts for debt. In this calculation we've used 7.5%, which is based on a levered beta of 1.053. Beta is a measure of a stock's volatility, compared to the market as a whole. We get our beta from the industry average beta of globally comparable companies, with an imposed limit between 0.8 and 2.0, which is a reasonable range for a stable business. Strength Earnings growth over the past year exceeded the industry. Debt is not viewed as a risk. Weakness No major weaknesses identified for AMZN. Opportunity Annual earnings are forecast to grow faster than the American market. Trading below our estimate of fair value by more than 20%. Threat Revenue is forecast to grow slower than 20% per year. Valuation is only one side of the coin in terms of building your investment thesis, and it ideally won't be the sole piece of analysis you scrutinize for a company. It's not possible to obtain a foolproof valuation with a DCF model. Preferably you'd apply different cases and assumptions and see how they would impact the company's valuation. For instance, if the terminal value growth rate is adjusted slightly, it can dramatically alter the overall result. What is the reason for the share price sitting below the intrinsic value? For Amazon.com, we've put together three relevant items you should explore: Financial Health: Does AMZN have a healthy balance sheet? Take a look at our free balance sheet analysis with six simple checks on key factors like leverage and risk. Future Earnings: How does AMZN's growth rate compare to its peers and the wider market? Dig deeper into the analyst consensus number for the upcoming years by interacting with our free analyst growth expectation chart. Other Solid Businesses: Low debt, high returns on equity and good past performance are fundamental to a strong business. Why not explore our interactive list of stocks with solid business fundamentals to see if there are other companies you may not have considered! PS. Simply Wall St updates its DCF calculation for every American stock every day, so if you want to find the intrinsic value of any other stock just search here. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}