{
    "title": null,
    "date": "1 Jan 2024",
    "url": "https://finance.yahoo.com/news/prosy-vs-amzn-stock-value-164009248.html",
    "text": "Investors interested in stocks from the Internet - Commerce sector have probably already heard of Prosus N.V. Sponsored ADR (PROSY) and Amazon (AMZN). But which of these two stocks is more attractive to value investors? We'll need to take a closer look to find out. The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits. Prosus N.V. Sponsored ADR and Amazon are both sporting a Zacks Rank of # 2 (Buy) right now. This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that these stocks have improving earnings outlooks. But this is only part of the picture for value investors. Value investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels. The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value. PROSY currently has a forward P/E ratio of 3.36, while AMZN has a forward P/E of 56.50. We also note that PROSY has a PEG ratio of 0.07. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. AMZN currently has a PEG ratio of 1.98. Another notable valuation metric for PROSY is its P/B ratio of 5.08. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, AMZN has a P/B of 8.58. These are just a few of the metrics contributing to PROSY's Value grade of B and AMZN's Value grade of C. Both PROSY and AMZN are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that PROSY is the superior value option right now. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Prosus N.V. Sponsored ADR (PROSY) : Free Stock Analysis Report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}