{
    "title": null,
    "date": "1 Jan 2024",
    "url": "https://www.asbn.com/manage-your-business/leadership/jeff-bezos-once-pinpointed-what-makes-the-best-entrepreneurs-in-4-words/",
    "text": "Several years back, CNBC obtained a recording of Jeff Bezos’s comments at an Amazon all-hands meeting. He was talking about his excitement for the auto industry and his admiration for the founder and CEO of electric vehicle startup Rivian, R.J. Scaringe. Amazon made a $700 million dollar investment in Rivian the prior February, and Bezos was explaining that Scaringe is part of what drew him to the company. Bezos called him “incredible” and said the entrepreneur’s personality was a perfect match with Amazon’s culture and values. That’s when Bezos dropped the bombshell of wisdom that follows. He said that the kind of entrepreneurs he/Amazon looks to work with, the very best kind, have one thing in common about their approach. It’s one thing to be laser-focused, task oriented, brutal when necessary or even cold and calculating, especially towards competition, when required. This mercenary, take no prisoners, win for the shareholders mentality has certainly made many a founder rich. But it’s another thing altogether when an entrepreneur is on a mission, one that’s bigger than him/her, one that isn’t all about profits, and one that encapsulates a powerful vision to be more and contribute more to the industry, employees, and society. It’s what makes the best entrepreneurs. I realize best is subjective. I define best as those entrepreneurs that can accomplish all the business wins of a more mercenary approach, while still being higher-order mission-driven. In the announcement of Amazon’s investment, Scaringer said Rivian’s mission is to bring “sustainable mobility” to the world and to “reset expectations of what’s possible”, including eliminating compromises electric cars make on performance, capability, and efficiency, while setting a new bar in innovating the total customer experience. Missionary over mercenary. This point is worth another example. In his TED talk, Chobani CEO Hamdi Ulukaya shares his “anti-CEO” approach to running the yogurt company. He describes the fateful day visiting an 85-year old yogurt plant that was closing (and that was for sale for parts). He met the hard working, proud, yet stoically saddened workers that were losing their jobs, duty bound to shutter the site while their CEO was nowhere to be found. It was then that Ulukaya knew that he had to run a company that put people, not profits, first. He went on to describe an incredible mission versus mercenary driven approach: Corporate America says it’s about profits. Mainstream business says it’s about money. The CEO playbook says it’s about shareholders. And so much is sacrificed for it — it’s factories, communities, jobs. But not by CEOs. CEOs have their employees suffer for them. But yet, the CEOs’s pay goes up and up and up. And so many people are left behind. We need a new playbook that sees people again. That sees above and beyond profits. The new way of business — it’s your employees you take care of first. Not the profits. The Chobani CEO backs his mission with actions, giving shares to all 2,000 employees, building a little league field with the company’s first profits, taking a stand for immigrants and providing them with jobs, even busing them to his facilities. His mission includes consumer delight and he considers himself as reporting to the consumer versus the corporate board. His personal number in the beginning years of Chobani was the 1-800 number on the cup. Missionary over mercenary, as Bezos says. Now back to that word “best”. The best entrepreneurs follow a mission because of its higher-order nature and because they realize it will also get them all the business wins any other more cutthroat approach might bring. For my money, that makes it the best kind of entrepreneur. Case in point, says Ulukaya (edited for brevity): “You see, if you’re right with your people, community, and product, you’ll be more profitable, innovative, and you’ll have more passionate people working for you and a community that supports you.” If you started a local business, but didn’t need the income to live on, why would you start it? It would be to create jobs for the people in that community. To bring enrichment to that community. To create a platform to fight injustices. To build a company to serve the people, not to corral people to serve a company. Maybe it’s idealistic. Maybe Wall St. would crap on that. Maybe it’s why I was destined to leave the corporate life for that of an entrepreneur. I know for certain, though, that Bezos is right. I’ll take mission-driven over no-mercy driven any day of the week. I bet you would too — so why not role model it? ASBN, from startup to success, we are your go-to resource for small business news, expert advice, information, and event coverage. While you’re here, don’t forget to subscribe to our email newsletter for all the latest business news know-how from ASBN. We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. "
}