{
    "title": null,
    "date": "1 Jan 2024",
    "url": "https://www.businessinsider.in/tech/news/amazon-eliminated-his-role-four-months-later-hes-still-getting-paychecks-/articleshow/106442046.cms",
    "text": "Liked the article? Share it with your friends... or copy link On September 1, Justin Garrison's senior role and team at Amazon Web Services, Amazon's cloud computing subsidiary, was eliminated. He wasn't fired. He just no longer had a role. He's still getting his regular paychecks, as seen in the paystubs he shared with Business Insider. For the past four months, Garrison has been stuck in limbo at Amazon, where his managers won't let him go or assign him new work but instead tell him to look for another role internally or find a job somewhere else. Garrison — a senior developer advocate at AWS for almost four years, writing documentation and testing cloud computing products — said it's been part of a concerning pattern within the company this past year, following the layoffs of more than 27,000 employees and return-to-office plans announced in February. Rather than conducting another round of mass firings that might spook shareholders or push workers out with pricey severance packages, Garrison and another Amazon employee told Business Insider they feel the company is trying to make employees' lives miserable either by enforcing RTO or sticking them in a position that pays less or has a more junior title. The practice is often known as \"quiet firing,\" in which perks and benefits are stripped, or bosses stop providing attention to certain employees, sometimes overtly showing them the door. In a Saturday blog post in which he aired the issues he's had with Amazon in the past several months, Garrison had another name for it: \"Silent Sacking.\" Garrison said since as far back as the summer, there has been a lack of clarity from upper management on the future of his role. When Amazon CEO Andy Jassy announced RTO plans in February, Garrison's team and other groups were told they would not be impacted. After all, Garrison's job was always expected to be remote: He started in April 2020 but began interviewing for the role well before the pandemic hit in March of that year. \"I was told repeatedly it wouldn't affect me or the teams I worked with. Then in the summer that changed,\" Garrison wrote on his blog. Garrison told BI the company went beyond the usual RTO, in which an employee could work at any office, and enforced \"return-to-teams,\" which required people to be at an office where their team was located. For Garrison, the office options were Seattle, San Francisco, Austin, and Vancouver, Canada. When he chose Vancouver, Garrison said he was told the company probably wouldn't sponsor a work visa. \"So it wasn't even an option,\" he said. Afterward, Garrison was told his team had a one-year \"remote exception.\" But two days later, on September 1, he learned that his entire team was being eliminated. All but two people on his team found other internal roles. Garrison told BI he had about a month and a half of work to finish at AWS. His skip-level manager told Garrison: After you finish your work here, \"if you find another job externally, take it.\" \"You're telling me to go find another job and go take another job without any repercussions to you,\" Garrison told BI. \"And that seems very disingenuous. It seems really shady to me.\" After Garrison wrapped up his work in mid-October, he asked his bosses, including Barry Cooks, an AWS vice president, for a severance package — something they previously said would be an option. As a senior employee, Garrison felt he was in a \"privileged position\" to make that request. But Garrison was told he would have to write a proposal to get a severance package approved. Garrison said he would ping Cooks for updates on his employment and severance for the next two and a half months. He had been trying to help his teammates find other roles throughout that time but said he hadn't attended a meeting in months. \"It's the best vacation,\" Garrison said. \"I was like, 'This is kind of great, but also I don't know when it's going to end.'\" The last time Garrison spoke with Cooks was around the second week of December. Since then, he told BI that he has not gotten an update on his severance package. \"That was why I published the blog post when I did,\" Garrison said. \"I was mostly silent about it for months.\" Garrison told BI that these tactics were a way to manage head count at Amazon. One Amazon software development manager who was asked to move across the US, from New York to Seattle, for RTO previously shared the same sentiment with Business Insider. After nearly four years at the company, the employee took a $203,000 pay cut by forfeiting unvested stocks solely because of Amazon's RTO policy. \"If I was going to surmise, I would think part of it is reducing head count without doing further layoffs, because that signals bad things to shareholders,\" the manager, who requested to be anonymous, told BI. In a December 5 X post, Merritt Baer, a former AWS employee, said, \"the sheer number of AWS resignations in the last week is stunning.\" In an email to Business Insider, Rob Munoz, a spokesperson for Amazon, wrote that the company has been \"repeatedly been clear about what drove our decision on RTO, and these inaccurate and misleading anonymous anecdotes just aren't factual.\" \"In February, we shared with employees that we'd be asking them to start coming into the office three or more days per week beginning in May because we believe it would yield the best long-term results for our customers, business, and culture. And it has. With the vast majority of employees in the office more frequently, there's more energy, connection, and collaboration, and we're hearing that from employees and the businesses that surround our offices,\" Munoz wrote. But the software development manager who took the $203,000 pay cut told BI that the company hadn't shown any evidence that productivity had decreased working from home. Garrison acknowledged in his blog that the mass layoffs this year only impacted about 1.7% of Amazon employees. Still, the RTO initiative and layoffs have caused many teams to be \"emaciated\" and may make the company less agile to innovate. He explained how, for years, Amazon's organizational approach was known as \"two-pizza teams.\" Jeff Bezos said that the idea was \"to create teams that are no larger than can be fed by two pizzas.\" But people are expensive, and Amazon appears to be shifting to a more \"centralized\" organization, Garrison said, in which a bigger team with a pool of expertise is created, and \"everyone borrows time from that centralized pool.\" \"The downside of that is you have to wait in line to get an expert on something,\" he said. Garrison told BI that he would love to get a severance package but has since lost all expectations of getting one. He also said he felt compelled to write his blog post so that he could speak for other lower-level Amazon employees who have been stuck in similar situations but might not have enough experience to quit their jobs or make a lot of noise. \"With the job market the way it is, they don't have a lot of connections,\" Garrison said. \"I've been in technology for 20 years. I'm going to be OK.\" Since posting his blog on Saturday, Garrison said he received messages from people across the company who said his post resonated with their position. \"I haven't had a single person at Amazon who said I was wrong,\" Garrison said. \"Every single one of them was like, 'Yep, this is exactly what we've been living through and it sucks.'\" Advertisement "
}