{
    "title": "For A $3,499 Price Tag, The Vision Pro Should Have Housed 512GB Of Storage \nCapacity Instead Of 256GB, As Confirmed By Apple",
    "date": "1/8/2024",
    "url": "https://wccftech.com/apple-vision-pro-strorage-details/",
    "text": "Apple recently announced that it will launch the highly anticipated Vision Pro headset on February 2. The pre-orders for the headset will begin a week after the launch on February 19 in the United States. In the press release, the company also announced a fair share of details surrounding the headset, including the accessories available at launch. It was also announced that the Vision Pro will feature 256GB of storage capacity. Apple's press release details that the Vision Pro will launch with a Dual Loop Band, a Polishing cloth, an external battery pack, and much more. Additionally, the company also shared the prices of the ZEISS Optical Inserts. At launch, the company announced many features of the Vision Pro, for instance, the chipset and the remaining sensors that will power the device. However, Apple did not share the Vision Pro's storage capacity last year. A handful of speculations suggested that Apple will launch the Vision Pro headset with 512GB of storage capacity. As it turns out, the headset will only house 256GB of storage capacity. We are unsure if the company will offer the 256GB variant as the base model. If the company plans to sell only one variant, users will have no option but to buy the 256GB version. However, users must spend extra bucks above the $3,499 price tag if the company has higher storage models in the queue. We know the Vision Pro headset will launch with 256GB of storage capacity. Besides the storage, Apple also shares that the Vision Pro headset will be available with different ZEISS Optical Inserts. There are two options available for the lens. The prescription lens will cost you an extra $149, while the reader lens will push you $99 above the standard price. Other than this, the company also details a wide range of functionalities in the press release. Apple's Vision Pro is the company's second major product after Tim Cook became Apple's CEO. The headset will offer a new way to interact with content and numerous utilities surrounding productivity, gaming, and content consumption. Apple is also currently working with developers to create additional use cases. Furthermore, visionOS is already in its beta phase, and developers are working to fix potential bugs and issues for a fluid launch on February 2. The company is already working on a second-gen version of the Vision Pro, which could offer users more flexibility regarding storage space. We will cover the launch extensively, so stick around for more details. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}