{
    "title": "Apple offers rivals access to tap-and-go payment tech to resolve EU \nantitrust case",
    "date": "1/19/2024",
    "url": "https://finance.yahoo.com/news/apple-offers-rivals-access-tap-123937806.html",
    "text": "LONDON (AP) — Apple has promised to open up its tap-and-go mobile payment system to rivals, the European Union said Friday, as the U.S. tech company seeks to resolve an antitrust case and avoid a fine that potentially could be worth billions. Apple proposed letting third-party mobile wallet and payment service providers access the contactless payment function on its iOS operating system, the EU said. The 27-nation bloc now is seeking feedback from “all interested parties\" on the changes before making a decision on the case. The European Commission, the bloc's executive arm and top antitrust enforcer, accused Apple in 2022 of abusing its dominant position by limiting access to its mobile payment technology. Brussels has been using antitrust cases and new digital laws to rein in the power of Apple and other tech giants and protect consumers. The commission alleged that Apple was restricting competition by blocking developers of rival mobile wallet apps from accessing the near-field communication, or NFC, technology used by its Apple Pay system. That prevents those developers from offering competing services on Apple devices, the EU said. Breaches of EU competition law can draw fines worth up to 10% of a company's annual global revenue, which in Apple's case, could amount to tens of billions of euros (dollars). The changes Apple is proposing to ease EU antitrust concerns would last for a decade and apply to rival mobile wallet makers as well as iOS users in the bloc's 27 countries, plus Iceland, Norway and Liechtenstein, the commission said. Apple said that through “ongoing discussions” with the commission, it offered to provide developers of payment, banking and digital wallet apps with an option for their users to “make NFC contactless payments from within their iOS apps, separate from Apple Pay and Apple Wallet.” Related Quotes "
}