{
    "title": "Microsoft Stock Gains On AI News. Apple Stock Slips On iPhone Sales Woes.",
    "date": "1/16/2024",
    "url": "https://www.investors.com/news/technology/microsoft-stock-gains-on-ai-news-while-apple-stock-slips/",
    "text": "BREAKING: FedEx Soars On Earnings, Tesla Skids On China Production Cut     Microsoft (MSFT) stock rose Tuesday on news related to its artificial intelligence initiatives, while fellow megacap stock Apple (AAPL) dropped on worries about iPhone sales weakness in China. Microsoft and Apple are battling for the title of the world's largest company by market capitalization. On Tuesday, Microsoft's market cap surpassed Apple's. Microsoft ended the regular session with a valuation of $2.9 trillion, vs. Apple's $2.856 trillion, according to IBD MarketSmith. On the stock market today, Microsoft stock advanced 0.5% to 390.27. But Apple stock retreated 1.2% to 183.63. Apple stock dropped on news that the company is offering discounts on its newer iPhones in China to spur demand. Apple often discounts products for the Lunar New Year, but hasn't done so for new iPhones in years. Microsoft stock got a lift from news of a strategic partnership and expansion of its Copilot offerings. On Tuesday, Microsoft and U.K.-based Vodafone (VOD) announced a 10-year strategic partnership to bring generative AI and cloud services to more than 300 million businesses, public sector organizations and consumers across Europe and Africa. Vodafone will invest $1.5 billion over the next 10 years in cloud and customer-focused AI services developed with Microsoft. Those services include Microsoft's Azure OpenAI and Copilot offerings. Also, Vodafone will replace its physical data centers with cheaper and scalable Azure cloud services. Meanwhile, Microsoft plans to invest in Vodafone's managed Internet-of-Things connectivity platform, which will become a separate, stand-alone business by April 2024. In other Microsoft news, the Redmond, Wash.-based software giant announced moves to expand the reach of its Copilot AI assistant software to consumers and small businesses. Microsoft announced a paid version of its Copilot platform for individuals. The service, called Copilot Pro, will cost $20 per month per user and includes advanced capabilities not available in the free version. Plus, Microsoft said it is dropping the minimum user requirement for Copilot for Microsoft 365. Microsoft previously limited the offering to companies purchasing licenses for 300 seats or more. The change will open up the service to small and medium size businesses. That service costs $30 a month per user. On Jan. 11, Microsoft stock broke out of a flat base at a buy point of 384.30, according to MarketSmith charts. The 5% buy zone extends to 403.52, based on IBD trading principles. Meanwhile, Apple stock tripped sell signals on Jan. 2 after diving below its 50-day moving average line. Apple stock notched an all-time high of 199.62 on Dec. 14. Follow Patrick Seitz on X, formerly Twitter, at @IBD_PSeitz for more stories on consumer technology, software and semiconductor stocks. YOU MAY ALSO LIKE: Garmin Targeting Niche Markets In Smartwatches For Women, Kids Dolby Cranks Up Volume Of Licensing Deals In Autos, TVs, PCs Qualcomm In Catbird Seat For Edge AI Shift, CEO Says Find Winning Stocks With MarketSmith Pattern Recognition & Custom Screens See Stocks On The List Of Leaders Near A Buy Point 3/22/2024\nThe major indexes faded from record highs as Apple fell on a DOJ lawsuit. But many stocks flashed buy signals.... 3/22/2024\nThe major indexes faded from record highs as Apple fell... Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}