{
    "title": "PC market decline decelerating, Apple holding firm",
    "date": "1/10/2024",
    "url": "https://appleinsider.com/articles/24/01/10/jp-morgan-pc-shipment-decline-trending-upward-as-apple-market-share-remains-stable",
    "text": "Copyright © 2024, Quiller Media, Inc. Contact Us | Privacy Policy Mac Studio According to an analyst note, the PC market has seen eight consecutive quarters of year-over-year shipment decline, with Apple holding on to its approximate 9% market share.\r  Apple's Mac sales have been variable based on new product releases, leading to a tough compare in Q4 2023. The overall PC market, however, has seen a more consistent year-over-year percent decline, though it's recovering.\rAccording to a J.P. Morgan note seen by AppleInsider based on IDC data, the PC market is still in decline with an atypical quarter-over-quarter drop for Q3 to Q4 2023. This decline shouldn't be news to analysts as brands like HP and Dell warned of such market conditions, but the year-over-year change shows a positive trend.\rTraditional PC shipments declined 2% from Q3 to Q4 2023, which is usually a positive change historically. Shipments declined 3% year-over-year in Q4 2023, the eighth consecutive quarter of declines.\r Traditional PC Shipments Y/Y % Change. Image source: JP Morgan However, that single-digit decline is a positive trend, as previous year-over-year compares were at 8%, 13%, and 29% declines. HP and Lenovo are the only PC makers that grew market share sequentially in Q4 2023.\rApple's market share remained relatively flat, moderating from 10.6% to 8.5% across the quarters. Looking at the full-year basis, Apple's market share declined to 8.8% from 9.6%.\r Y/Y % Change in Mac Revenue Shipments and market share changes are dependent on Apple's asymmetrical release cycle. Products tend to arrive at different points throughout the year each year, leading to odd spikes and drops in year-over-year shipments. However, it all averages out with a consistent market share.\rApple is expected to announce new Macs running the M3 family of processors in the first half of 2024. These models could include updated MacBook Air models, an M3 Mac mini, and a Mac Studio. Apple's Mac sales have been variable based on new product releases, leading to a tough compare in Q4 2023. The overall PC market, however, has seen a more consistent year-over-year percent decline, though it's recovering. According to a J.P. Morgan note seen by AppleInsider based on IDC data, the PC market is still in decline with an atypical quarter-over-quarter drop for Q3 to Q4 2023. This decline shouldn't be news to analysts as brands like HP and Dell warned of such market conditions, but the year-over-year change shows a positive trend. Traditional PC shipments declined 2% from Q3 to Q4 2023, which is usually a positive change historically. Shipments declined 3% year-over-year in Q4 2023, the eighth consecutive quarter of declines. However, that single-digit decline is a positive trend, as previous year-over-year compares were at 8%, 13%, and 29% declines. HP and Lenovo are the only PC makers that grew market share sequentially in Q4 2023. Apple's market share remained relatively flat, moderating from 10.6% to 8.5% across the quarters. Looking at the full-year basis, Apple's market share declined to 8.8% from 9.6%. Shipments and market share changes are dependent on Apple's asymmetrical release cycle. Products tend to arrive at different points throughout the year each year, leading to odd spikes and drops in year-over-year shipments. However, it all averages out with a consistent market share. Apple is expected to announce new Macs running the M3 family of processors in the first half of 2024. These models could include updated MacBook Air models, an M3 Mac mini, and a Mac Studio. Wesley Hilliard served ten years as a Nuclear Power Electrician in the US Navy, then jumped careers in 2019. Today, he is Assistant Editor, Podcast Cohost, SEO Specialist, and Social Media Manager for AppleInsider. This is simple to explain. Inflation and the ridiculous price increases blamed on COVID are causing people and companies to slow down on computer purchases. It's the same with cars and trucks. Everything is overpriced. CEO's are getting too much money, workers still aren't getting enough and stock holders are getting way too much money. Anyone with a brain knows this was going to happen. This is simple to explain. Inflation and the ridiculous price increases blamed on COVID are causing people and companies to slow down on computer purchases. It's the same with cars and trucks. Everything is overpriced. CEO's are getting too much money, workers still aren't getting enough and stock holders are getting way too much money. Anyone with a brain knows this was going to happen. rob53 said:\nThis is simple to explain. Inflation and the ridiculous price increases blamed on COVID are causing people and companies to slow down on computer purchases. It's the same with cars and trucks. Everything is overpriced. CEO's are getting too much money, workers still aren't getting enough and stock holders are getting way too much money. Anyone with a brain knows this was going to happen. \n\r\nThis! 100%! You have all of these massive corporations complaining about how they can’t afford to decrease prices to pre-COVIDE prices or increase wages for their employees while at the same time bragging about record profits and giving their CEOs massive bonuses. This behavior is absolutely criminal. This! 100%! You have all of these massive corporations complaining about how they can’t afford to decrease prices to pre-COVIDE prices or increase wages for their employees while at the same time bragging about record profits and giving their CEOs massive bonuses. This behavior is absolutely criminal. Ofer said:\n\nrob53 said:\nThis is simple to explain. Inflation and the ridiculous price increases blamed on COVID are causing people and companies to slow down on computer purchases. It's the same with cars and trucks. Everything is overpriced. CEO's are getting too much money, workers still aren't getting enough and stock holders are getting way too much money. Anyone with a brain knows this was going to happen. \n\r\nThis! 100%! You have all of these massive corporations complaining about how they can’t afford to decrease prices to pre-COVIDE prices or increase wages for their employees while at the same time bragging about record profits and giving their CEOs massive bonuses. This behavior is absolutely criminal.\n\r\nCorporations are absolutely criminal, you say. The price for criminal behaviour is jail, we all know. The conclusion therefore is to put all CEOs in jail.Nobody on this planet can enforce a $15/hr salary for you. If you can earn more, good for you! Similarly no one can tell a corporation that they can't raise their prices. Your philosophy fails to recognize that corporations are just groups of people like you and me. Corporations are people too! Corporations are absolutely criminal, you say. The price for criminal behaviour is jail, we all know. The conclusion therefore is to put all CEOs in jail.Nobody on this planet can enforce a $15/hr salary for you. If you can earn more, good for you! Similarly no one can tell a corporation that they can't raise their prices. Your philosophy fails to recognize that corporations are just groups of people like you and me. Corporations are people too! Ofer said:\n\nrob53 said:\nThis is simple to explain. Inflation and the ridiculous price increases blamed on COVID are causing people and companies to slow down on computer purchases. It's the same with cars and trucks. Everything is overpriced. CEO's are getting too much money, workers still aren't getting enough and stock holders are getting way too much money. Anyone with a brain knows this was going to happen. \n\r\nThis! 100%! You have all of these massive corporations complaining about how they can’t afford to decrease prices to pre-COVIDE prices or increase wages for their employees while at the same time bragging about record profits and giving their CEOs massive bonuses. This behavior is absolutely criminal.\n\r\nIt's not criminal. it's just greed. It's not criminal. it's just greed. It’s amazing. Apple has such a small market share, yet everywhere I go, from college campuses to small business, to churches, to coffee shops, to family and friends, the world appears to be run on Mac’s. I think the feather in the PC cap is the fact that windows and its ecosystem of junk has been entrenched in the enterprise space for a long time - since windows 95, 98.  The sad part is that these corporations hear from Microsoft about TCO over 5 years, etc. but the reality is, they spend much more than if they ran a Mac ecosystem. Not only would the computers last much longer in practical daily use, but they don’t need the constant attention of the IT department. Work at HP, Verizon, and ATT was quite revealing. HP replaced workers computers every two years - always with cheap junk. Verizon didn’t let their workers actually have workstations. It was all server based. ATT had a tiered system. Lower levels on thin clients and management/executive tiers on a mix of mainframe/personal. It’s kind of a mess actually. And then you’ve got big corporations that have been operating on autopilot, ordering fleets from the hp, Dell, Lenovo reps every couple of years, never stopping to think there must be a better way - from hardware longevity and usefulness to uptime, to stable software, to user satisfaction, etc. ROI and TCO are a game of charades. With Apple, you get a rock solid, satisfying to use, fair total cost of ownership with solid return on investment that doesn’t need to be handled on the daily by IT to keep your employees useful. The IT industry is so huge on the windows/PC side because it’s necessary. Microsoft had to establish a ministry unto itself just to keep its core business (windows+office) propped up. But it does seem that with new generations growing into not only entrepreneurship, but leadership roles in large corporations, more common sense changes could be afoot. It’s amazing. Apple has such a small market share, yet everywhere I go, from college campuses to small business, to churches, to coffee shops, to family and friends, the world appears to be run on Mac’s. I think the feather in the PC cap is the fact that windows and its ecosystem of junk has been entrenched in the enterprise space for a long time - since windows 95, 98.  The sad part is that these corporations hear from Microsoft about TCO over 5 years, etc. but the reality is, they spend much more than if they ran a Mac ecosystem. Not only would the computers last much longer in practical daily use, but they don’t need the constant attention of the IT department. Work at HP, Verizon, and ATT was quite revealing. HP replaced workers computers every two years - always with cheap junk. Verizon didn’t let their workers actually have workstations. It was all server based. ATT had a tiered system. Lower levels on thin clients and management/executive tiers on a mix of mainframe/personal. It’s kind of a mess actually. And then you’ve got big corporations that have been operating on autopilot, ordering fleets from the hp, Dell, Lenovo reps every couple of years, never stopping to think there must be a better way - from hardware longevity and usefulness to uptime, to stable software, to user satisfaction, etc. ROI and TCO are a game of charades. With Apple, you get a rock solid, satisfying to use, fair total cost of ownership with solid return on investment that doesn’t need to be handled on the daily by IT to keep your employees useful. The IT industry is so huge on the windows/PC side because it’s necessary. Microsoft had to establish a ministry unto itself just to keep its core business (windows+office) propped up. But it does seem that with new generations growing into not only entrepreneurship, but leadership roles in large corporations, more common sense changes could be afoot. If you're tired of dealing with volume that is either too loud or too quiet, here's how to increase the volume level on a Mac by a quarter of what you normally can just by using a simple keyboard shortcut. Samsung's preorder deals are often aggressive, and their TV offer is no different. To celebrate the launch of the 2024 TV and audio lineup, Samsung is throwing in a free 65-inch TV with a qualifying preorder. Back by popular demand, OWC's 14-port Thunderbolt Dock for MacBooks is discounted to $99.99, matching the lowest price on record. But the month-end deal is valid for a limited time only. If you've been on the fence or haven't tried Apple's MLS Season Pass, now's a good time to try, as new subscribers can access a one-month free trial for a limited time. The Department of Justice's massive antitrust lawsuit against Apple is based on old information. Merrick Garland and company are going to lose big if they rely on arguments where practically every point made is no longer true. Apple has released iOS 17.4.1 and iPadOS 17.4.1 to the public, at the same time as bringing visionOS up to 1.1.1 while also slipping out iOS 16.7.7. A new vulnerability in Apple Silicon chips can allow a determined attacker to access a user's data by stealing the cryptographic keys — and a fix could considerably impact encryption performance. A fresh price cut on AirPods Pro 2 with USB-C is in effect at Amazon on day 2 of its Spring Sale 2024. Grab the lowest price on record while supplies last. Aiming to show that its carbon reduction efforts are not mere \"climate-washing,\" Apple has spotlighted how its Restore Fund is contributing to the restoration of a Brazilian rainforest, and attempts to save over 3,000 types of tree from extinction. Investment firm Evercore says Apple is facing weakening demand and strong competition from AI rivals, but investors should stick with it for the long term. An analyst note suggests regulation from the EU and the $2 billion fine may put pressure on Apple's earnings per share, but its shift to AI will help keep the earnings multiple even at about 25x.  "
}