{
    "title": "Apple Stock: Vision Pro, AI In Focus In 2024",
    "date": "1/11/2024",
    "url": "https://www.investors.com/news/technology/apple-stock-ai-vision-pro-2024/",
    "text": "BREAKING: Futures Rise; Tesla Skids On China Production Cut     Apple (AAPL) missed out on the spotlight when generative artificial intelligence emerged last year as the biggest technology trend in a generation. The tech giant hopes to play catch-up in 2024, and Apple stock investors will be watching. The consumer electronics behemoth found itself on the sidelines as Microsoft (MSFT), Alphabet's (GOOGL) Google and others publicly detailed plans to capitalize on generative AI throughout 2023. Apple Chief Executive Tim Cook could only point to AI features in the company's current product lineup when asked about Apple's play in the exciting new field. But those features mostly added incremental smarts to the iPhone and Apple Watch. But 2024 promises to be different for Apple, said Gene Munster, managing partner at Deepwater Asset Management. \"Probably the big story is going to be AI and what they're going to do in generative AI,\" he told Investor's Business Daily. \"Specifically it's probably anticipation around what they're going to say at their developers conference.\" Apple will hold its much-anticipated Worldwide Developers Conference, or WWDC, in June. A news report on Jan. 4 suggested Apple plans to announce new generative AI capabilities for its Siri personal assistant application. The report said Apple is going to \"add more personalization and natural conversations to Siri,\" 9to5Mac reported. Also, Apple has been working on a ChatGPT-like generative AI project since 2022, known informally as Apple GPT. The company already is using the AI chatbot internally, according to news reports. Apple scientists provided a possible glimpse of what's ahead in a recently published research paper, titled \"LLM in a Flash.\" The paper discussed a solution to the current \"computational bottleneck\" of running large-language models for AI on devices with limited memory, such as smartphones. Apple is likely to add AI capabilities to its upcoming iPhone 16, due out in September. Meanwhile, rival Samsung plans to unveil its Galaxy AI smartphone on Jan. 17. In fact, Wedbush Securities analyst Daniel Ives thinks Apple will introduce an AI app store this year. Apple likely will unveil it at WWDC and get software developers involved in making AI apps for the iPhone and the company's other devices, he said. \"For them, it's about monetization of the installed base,\" Ives said. But Apple is keeping its AI plans close to the vest. During a conference call with analysts on Nov. 2, Cook said Apple is actively working on AI projects but declined to elaborate. \"In terms of generative AI, obviously we have work going on,\" Cook said. \"I'm not going to get into details about what it is, because, as you know, we really don't do that. But you can bet that we're investing. We're investing quite a bit.\" Those AI innovations will show up in \"product advancements over time,\" Cook added. Apple already is selling products that have features based on AI and machine learning, but it doesn't promote them as such, Cook said. \"We label them as to what their consumer benefit is,\" Cook said. \"But the fundamental technology behind it is AI and machine learning.\" As examples, he named the personal voice and live voicemail features of iOS 17, the latest iPhone operating system. The company's AI innovations also include lifesaving features on the Apple Watch, such as fall detection, crash detection, and electrocardiogram analysis. But coming up with a response to the generative AI phenomenon isn't Apple's only challenge in 2024. The company also is launching its first new hardware platform since the Apple Watch debuted in April 2015. That product is the Apple Vision Pro mixed-reality headset, which the Cupertino, Calif.-based company said will be available in the U.S. starting Feb. 2. The $3,499 computer goggles combine augmented and virtual reality. Wall Street analysts aren't counting on the first version of Vision Pro to be a smashing success. For starters, it's pricey. And secondly, people aren't sure of the use cases for the device yet, much less a killer app. \"The investment community is largely indifferent to it right now,\" Munster said. \"I can't remember an Apple product coming out that people were so indifferent to.\" He added, \"Investors are thinking it's too expensive to be mainstream and all the predecessors have been duds. So, it's just hard for investors to get excited about.\" Apple is pitching the Vision Pro as a \"spatial computer,\" with potential applications in education, enterprise and entertainment. The company is likely to produce 300,000 to 400,000 units of Vision Pro in 2024, UBS analyst David Vogt said in a recent client note. The first generation Vision Pro is about laying the foundation for a new device category, Ives said. Future versions will be cheaper, less bulky and more fashionable than the original, he said. \"Eventually Vision Pro will be less than $1,200 and resemble sunglasses,\" Ives said. But that could take years, he said. Munster said Apple likely sees the Vision Pro as a steppingstone product to smartglasses. \"That's the long-term version,\" he said. He cited the way the original iPhone, which came out 16 years ago, has evolved over time. Speaking of the iPhone, analysts see it as a mature product with slowing growth. In a recent client note, Barclays analyst Tim Long described sales of the current model, iPhone 15, as \"lackluster.\" The next model, iPhone 16, likely will be a minor upgrade, he added. Apple stock bulls disagree and predict the iPhone 16 will be an edge AI device with an advanced Siri assistant. What else does Apple have up its sleeve for 2024? Loop Capital analyst John Donovan made some predictions in a recent client note. He thinks Apple will come out with OLED screen iPad tablets, an Apple Watch that can detect sleep apnea, and AirPods wireless earbuds that double as hearing aids. In addition to new products and artificial intelligence initiatives, Apple's year ahead is likely to be marked by increased regulatory scrutiny of its business practices. The U.S. Department of Justice reportedly plans to file an antitrust case against Apple for policies related to its App Store. Meanwhile, the European Union is likely to demand changes to Apple's App Store in the year ahead to improve competition. Follow Patrick Seitz on X, formerly Twitter, at @IBD_PSeitz for more stories on consumer technology, software and semiconductor stocks. YOU MAY ALSO LIKE: Microsoft Stock Has These Major Catalysts Ahead In 2024 AI PCs Could Spur Upgrade Cycle In 2024 AI News: Artificial Intelligence Trends And Top AI Stocks To Watch See Stocks On The List Of Leaders Near A Buy Point Find Winning Stocks With MarketSmith Pattern Recognition & Custom Screens 3/22/2024\nThe major indexes faded from record highs as Apple fell on a DOJ lawsuit. But many stocks flashed buy signals.... 3/22/2024\nThe major indexes faded from record highs as Apple fell... Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}