{
    "title": "WhatsApp AirDrop alternative spotted in Android beta version",
    "date": "1/23/2024",
    "url": "https://bgr.com/tech/whatsapps-airdrop-feature-might-be-its-most-exciting-upgrade-in-years/",
    "text": "Sign up for our daily newsletter If you buy through a BGR link, we may earn an affiliate commission, helping support our expert product labs. AirDrop is one of the neat iPhone features that Android has had a tough time competing with. It’s also one of the features that users often take for granted if they own multiple Apple devices. That’s how I transfer files between my iPhone and Mac, and I use AirDrop all the time. It’s also the best way to share photos and videos with friends, as long as they’re on an iPhone or another Apple device. Over on Android, things are starting to get a lot simpler thanks to Google’s announcement during CES 2024. The Nearby Share feature that rivals AirDrop is now called Quick Share. That’s actually Samsung’s version of AirDrop. You can use Quick Share to send files on Android just like you AirDrop on iPhone. All that is to say that something is missing here: a cross-platform feature that would work between iPhone and Android. That’s why I’m so excited to hear that Meta is working on an AirDrop equivalent for WhatsApp. Since WhatsApp is the most popular chat app in the world with over 2 billion users, and since it bridges the gap between iPhone and Android, Meta might be on to something here. I might be a longtime iPhone user, but WhatsApp is one of the chat apps I use the most. I’ve explained this time and again while discussing the chat blue vs. green bubble war in the US. There’s no such thing in Europe. Most people use WhatsApp here, and it’s the platform of choice between me and other iPhone users in my circle. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. I also use WhatsApp to chat with Android users in my group of friends or family. And we use WhatsApp to share files. It’s not as convenient as AirDrop or Quick Share would be, but that’s where WhatsApp’s new AirDrop alternative could come in handy. It would make file transfers even easier than they already are. Picking photos or videos and then tapping a contact name to transfer them should be a standard of modern mobile computing. Provided, of course, this data transfer protocol has privacy and security features in place to avoid abuse. If WABetaInfo’s findings are accurate, and they usually are, WhatsApp is working on an AirDrop feature of its own. It’s currently enabled in the beta version of WhatsApp for Android. That’s not a surprise, as Meta prefers Google’s mobile OS over Apple. However, if Meta rolls out this WhatsApp AirDrop functionality, it’ll probably be available across platforms. The WhatsApp AirDrop alternative should work just like the original. You will be able to share files with people nearby as long as those people make themselves visible to you. The screens above also explain that both parties would have to open WhatsApp for the AirDrop-like transfer to work. This feature will presumably fight spam drops, and it’s great that it’s there. Moreover, WhatsApp will protect the sender’s phone number when sharing with non-contacts nearby. Also, the data transfers themselves will be end-to-end encrypted, which is something we should expect from an end-to-end encrypted chat app. Finally, there appears to be a shake gesture from the recipient to see the sender’s share request. That’s something that might cause confusion on the iPhone if you have the shake-to-undo feature enabled on the iPhone. I know I do, but I hardly use it. I’d be willing to replace it with this WhatsApp gesture if that was a possibility down the road. As with any beta software, there are no guarantees the WhatsApp AirDrop equivalent will see the light of day. But if it does, I’d expect it to roll out on both Android and iPhone. Chris Smith has been covering consumer electronics ever since the iPhone revolutionized the industry in 2008. When he’s not writing about the most recent tech news for BGR, he brings his entertainment expertise to Marvel’s Cinematic Universe and other blockbuster franchises. Outside of work, you’ll catch him streaming almost every new movie and TV show release as soon as it's available. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. BGR’s audience craves our industry-leading insights on the latest in tech and entertainment, as well as our authoritative and expansive reviews. We guide our loyal readers to some of the best products, latest trends, and most engaging stories with non-stop coverage, available across all major news platforms. Founded in 2006 Over 2 billion visitors 100K+ articles published Millions of readers helped Honest news coverage, reviews, and opinions since 2006. -\n\t\t\t\t\t\tJonathan S. Geller, Founder BGR is a part of Penske Media Corporation.\n© 2024 BGR Media, LLC. All Rights Reserved. "
}