{
    "title": "Apple is opening up its powerful App Store for the first time",
    "date": "1/25/2024",
    "url": "https://www.businessinsider.com/apple-app-store-open-first-time-eu-law-developers-ios-2024-1",
    "text": "       For years, Apple has been insistent that it needs control over its App Store and other key parts of its iPhone ecosystem, even in the face of increasing complaints from regulators. But now, for the first time, it is going to grudgingly open up many of those elements — because of regulatory pressure. Important to know: The changes Apple announced Thursday only apply in Europe because of a new law that goes into effect in March. But, they are significant since Apple has spent a lot of time and effort trying to avoid making many of these changes. Some of the big ones: Apple will allow developers to create and distribute apps without using the company's App Store. Apple's App Store now will now take a cut of up to 17%, plus another 3% fee, for payments made on apps distributed on its App Store. That's down from a long-held maximum commission of 30%. Related stories Developers who use a non-Apple store won't have to give Apple any fee at all, except for apps that are downloaded more than a million times a year. Those apps — along with apps distributed through Apple's App Store — will pay a fee of 0.50 euros for each download over a million. Other key changes include the ability for users to set a default web browser other than Apple's Safari browser. And for developers to use Apple's near-field communication tech, so users can make contactless payments with their phones without using Apple's Apple Pay and Apple Wallet system. In its language announcing the changes, Apple makes it clear that it thinks many of these things are a bad idea. \"The new options for processing payments and downloading apps on iOS open new avenues for malware, fraud and scams, illicit and harmful content, and other privacy and security threats,\" the company says. It also says it will try to help customers by offering some kind of buffer between them and outside developers. That includes a system to \"notarize\" all apps, regardless of whether they come from Apple's store or somewhere else, \"focused on platform integrity and protecting users.\" And how this actually rolls out is still to be determined. In part, that's because Apple is still appealing one piece of the new rules' implementation. And in part because of choices both consumers and developers will need to make. For instance: Users who do want to buy something via a store other than Apple's App Store will encounter this screen, making it very clear that if they hand over their credit card info to someone other than Apple, then Apple won't be able to help them if something bad happens. If you've used an iPhone app in the last few years, you've seen a similar screen that told you the app's developer would like to track your movement around the web. That screen requires you to actively say you want to do that. Not surprisingly, most people have not opted into that for most apps. And that change has roiled the entire digital advertising industry, including Apple rival Meta. Faced with a warning like that, it may not be surprising to learn that many iPhone users end up sticking around with Apple's system instead of going with an outside developer's store. And developers with very popular apps will have to figure out what Apple's new fee system means for them. Of note: Fortnite-maker Epic Games, which directly challenged Apple's App Store rules and got kicked off the platform as a result, says the new regulations mean it will bring Fortnite back to Apple's phones in Europe in 2024. But the company says it will \"continue to argue to the courts and regulators that Apple is breaking the law.\" Will any of this come to the US or anywhere outside Europe? No, Apple says, because \"this is not the safest system for our users.\" Translation: If you want us to do this anywhere else, you'll need a new law. That could come in the future. In the meantime, Thursday's news is a milestone for Apple and regulators: Proof that if pushed hard enough, one of the world's most powerful companies can change things it said it never wanted to change. Read next Jump to "
}