{
    "title": "How the iPhone Changed Everything — and Why It Could Again",
    "date": "1/24/2024",
    "url": "https://www.cmcmarkets.com/en/opto/how-the-iphone-changed-everythingand-why-it-could-again",
    "text": "Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money. Disruptors: By OPTO  24 Jan 2024, 17:05 From the iPhone to AI, a succession of new technologies have completely overhauled how the world works. It may seem that they happen overnight, but major disruptions always represent a tipping point where innovation reaches critical mass. Identifying these trends before they reach their full potential presents one of the best opportunities for thematic investors. Research shows that innovative companies tend to outperform their less innovative counterparts. According to J. P. Morgan, five of the 21st century’s biggest disruptors — Alphabet [GOOGL], Amazon [AMZN], Apple [AAPL], Meta [META] and Microsoft [MSFT] — posted median revenue growth of 22.5% over the past 15 years, compared to 3.1% for the S&P 500, and their shares outperformed the index by approximately 19 percentage points annually. This new series of articles from OPTO asks: How can investors harness disruption and identify critical tipping points? What are the stocks with the capacity to drive lasting change in markets? In the nearly 17 years since Apple launched the iPhone, smartphones have conquered the world: more than half the global population owns one as of October 2023. J. P. Morgan makes the point that it is difficult to recall a world in which smartphones weren’t ubiquitous. While the question of what distinguishes a smartphone brings several features to mind — internet connectivity, apps and a built-in camera, for example — the original Apple iPhone wasn’t the first to offer any of these. Smartphones actually date back to 1992, with IBM’s [IBM] Simon Personal Communicator. This touchscreen phone could send and receive both emails and faxes and contained a calendar and an address book. It even enabled a form of predictive text. Smartphones really came into their own, though, with the BlackBerry [BB]. These phones, with their iconic QWERTY keyboards, popularised emailing on-the-go, as well as instant messaging via BlackBerry Messenger (BBM). The ‘iPhone moment’ was less of a story about a single technological innovation (though its radical upgrade on touchscreen technology certainly transformed the usability of these devices). Rather, iPhones transformed smartphones from mere productivity aids, and added a leisure layer. At the time of its launch in June 2007, the iPhone’s most tangible breakthrough was its intuitive touchscreen technology. This was a marked contrast to the incumbent BlackBerry devices, which relied on a physical keyboard; a rushed response to create a touchscreen alternative, the BlackBerry Storm, backfired disastrously. Beyond the interface, however, iPhones’ mass consumer appeal set them apart. Despite costing approximately $200 more than the BlackBerry Pearl at the time, the iPhone offered access to video and music through the device, opening up a market of younger, more casual consumers, which the business-oriented BlackBerry hadn’t addressed. The iPhone also built naturally on an earlier Apple product, the iPod. The iconic portable mp3 players accounted for nearly 40% of Apple’s revenue in 2006, but by 2014 — the last year Apple tallied iPod sales in their own categories — they had fallen 74% from their peak sales volume in 2008. While the iPhone, in this sense, cannibalised Apple’s own market, it underscores the point that this single product synthesised what had hitherto been multiple separate niches: music player, cell phone, camera and personal computer. The original iPhone featured 2G connectivity, a two-megapixel camera, the Safari web browser and access to apps like Google Maps. Models released over the following years expanded the offering with 3G connectivity, built-in GPS, the App Store, FaceTime video calling and advanced security features. It took the iPhone 74 days to sell one million units. By the end of the fiscal year on 29 September, 1.4 million units had been sold. The iPhone’s impact on Apple’s stock market performance was immediate. Between the close on 28 June, the day before it launched, and the last day of 2007, Apple’s share price gained 64.4%. In the prior six months, its stock had gone up 49%. Despite its rapid adoption, the iPhone spent three years in BlackBerry’s shadow. With the exception of Q3 2008, quarterly BlackBerry sales outweighed those of iPhones until midway through 2010. However, from then on, iPhone sales exploded, while BlackBerry shipments began a gradual decline, which culminated in BlackBerry decommissioning its operating systems by January 2022. The firm now predominantly operates in the cybersecurity and IoT markets.  That said, it took until 2023 for the iPhone to become the world’s best-selling smartphone. Between 2011 and 2022, the crown was held by Samsung [005930:KS], which lost market share in the lower price segments last year in its drive to concentrate on its mid- to high-end segment. All told, the iPhone has now sold over 2.3 billion units. Since the product’s launch, Apple’s share price has gained 5,247%.  But Samsung has not thrown in the towel, and is positioning itself to encroach onto the iPhone’s premium market segment. Samsung’s Galaxy S24 series launches on 31 January, and promises a raft of new features that incorporate advances in AI technology, making it the first (presumably of many) smartphones to leverage AI as a differentiator. Real Apple bulls probably won’t be phased by this, however. Recent research from PitchBook has shown that Apple has bought up more AI start-ups than any of its big tech peers. This suggests how disruption is rarely a question of a one-off, big-bang moment. Rather, it is the product of sustained investment and research. Innovation is a marathon, not a sprint, and this is why certain stocks with vision and staying power disrupt the market time and time again. Further to this, despite the company’s reputation for disruptive innovation, few of Apple’ s most iconic products — be they smartphones, personal computers or tablets — were the first of their kind. The iPhone defined the smartphone era not because it was the first smartphone but because it was the first product that bundled smartphone features together in a package with genuine mass-market appeal. The figures outlined above might suggest that the Cupertino company is moving to do something similar when it comes to AI. Apple is expected to unveil its own suite of AI features for the iPhone at its Worldwide Developers Conference in June. Will these new, AI-enabled iPhones be as influential as their forebears? Disclaimer Past performance is not a reliable indicator of future results. CMC Markets is an execution-only service provider. The material (whether or not it states any opinions) is for general information purposes only, and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed. No opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person. The material has not been prepared in accordance with legal requirements designed to promote the independence of investment research. Although we are not specifically prevented from dealing before providing this material, we do not seek to take advantage of the material prior to its dissemination. CMC Markets does not endorse or offer opinion on the trading strategies used by the author. Their trading strategies do not guarantee any return and CMC Markets shall not be held responsible for any loss that you may incur, either directly or indirectly, arising from any investment based on any information contained herein. *Tax treatment depends on individual circumstances and can change or may differ in a jurisdiction other than the UK. Continue reading for FREE Error! Please try submitting again. Success! You have successfully signed up. Latest articles What Does 2024 Hold for the Magnificent Seven? Can the Magnificent Seven stocks, including Nvidia and Tesla, continue to outperform the broader market in 2024? 17 Jan 2024 Connected Cars: Major Investment Trend of 2024? S&P Global believes that the automobile industry is at an inflection point, as software becomes automakers’ key strategic imperative. 16 Jan 2024 How Will Businesses Use AI in 2024? How will businesses go about integrating AI into their operations following the technology’s breakout year in 2023? 10 Jan 2024 Can Lithium Prices Recover from 2023’s Slump? Despite falling 80% during 2023, two asset managers believe that lithium prices will recover over the long term. 09 Jan 2024 © 2024 CMC Markets Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money. CMC Markets UK plc (173730) and CMC Spreadbet plc (170627) are authorised and regulated by the Financial Conduct Authority in the United Kingdom. "
}