{
    "title": "5 Apple AI features to expect on iPhones soon: What Tim Cook said and what \nmay be rolling out",
    "date": "2/4/2024",
    "url": "https://tech.hindustantimes.com/mobile/news/5-apple-ai-features-to-expect-on-iphones-soon-what-tim-cook-said-and-what-may-be-rolling-out-71706946888411.html",
    "text": "Copyright © HT Media Limited  All rights reserved. While various smartphone companies including Google and Samsung have entered the artificial intelligence (AI) race, Apple is way behind in adopting the technology. While Apple has been hinting at its generative AI, the company is taking a long time to introduce it to the public which is causing iPhone users to question the direction Apple is taking on this new technology. However, in a recent interview, CEO Tim Cook revealed that in 2024 Apple will be rolling out AI features on iPhones via the iOS 18 update. Check out the 5 speculated Apple AI features we might be seeing this year. According to a report by the Verge,  Tim Cook, in a recent earnings call, revealed that Apple will be bringing AI tools to its smartphones. It was also revealed that the company is working on generative AI tools. Cook said, “As we look ahead, we will continue to invest in these and other technologies that will shape the future. That includes artificial intelligence, where we continue to spend a tremendous amount of time and effort, and we're excited to share the details of our ongoing work in that space later this year.” So, what may be coming? Here are some thoughts by analysts. We are on WhatsApp Channels. Click to join. Apple foldable coming? Apple may launch its first foldable device in 2026 or 2027, with a 7-8 inch display. Uncertainty surrounds whether it will be a foldable iPhone or iPad. Read all about it here. Love to edit photos? Here are the best for you to do so in a jiffy! Check them out here. Smartphone launch! Infinix Smart 8 features an 8+128GB variant. It boasts a 50MP AI camera, innovative design elements, and a powerful MediaTek Helio G36 Octa-Core Processor. Check it out here. Tourists visiting Paris' Eiffel Tower will now be able to book their trip to the iconic monument using UPI. Read it all here. Beware of Hackers! A recent report has found 12 malicious apps, with 6 on the Google Play Store that are spreading malware. Know how to protect yourself from such threats. Know what is happening here. Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71706946888411 "
}