{
    "title": "EU officials are not happy with how Apple is handling Progressive Web Apps",
    "date": "2/26/2024",
    "url": "https://appleinsider.com/articles/24/02/26/eu-officials-are-not-happy-with-how-apple-is-handling-progressive-web-apps",
    "text": "Copyright © 2024, Quiller Media, Inc. Contact Us | Privacy Policy EU prepares to probe Apple over Progressive Web App issues Some European lawmakers allege that Apple is shirking its responsibility to comply with the Digital Markets Act by removing Progressive Web Apps —  and are preparing to launch an investigation.\r  In early February, European Union users began noticing that Progressive Web Apps weren't working properly in iOS 17.4. At the time, the issue wasn't immediately clear.\rIt was later found out that, due to security and privacy considerations, Apple opted to remove the Home Screen web apps feature in the EU. The company cited concerns about potential misuse by malicious web apps, given that third-party browsers will be available.\rHowever, as the Financial Times points out, the European Commission believes Apple may be limiting routes developers can take to avoid Apple's 30% App Store commission fee. The move has landed Apple in hot water once again as lawmakers send information requests to both the company and app developers. \r\"We are indeed looking at the compliance packages of all gatekeepers, including Apple,\" the European Commission said in a statement. \"In that context, we're in particular looking into the issue of progressive web apps, and can confirm sending the requests for information to Apple and to app developers, who can provide useful information for our assessment.\"\rApple did not provide a new comment to Financial Times. Instead, it reiterated that the change would affect only a small number of users overall. \rSupport for Progressive Web Apps has never been fantastic. However, their removal is perplexing, given Apple's previous stance on the matter. Apple has utilized the existence of this functionality as an anti-trust defense on a global level. In early February, European Union users began noticing that Progressive Web Apps weren't working properly in iOS 17.4. At the time, the issue wasn't immediately clear. It was later found out that, due to security and privacy considerations, Apple opted to remove the Home Screen web apps feature in the EU. The company cited concerns about potential misuse by malicious web apps, given that third-party browsers will be available. However, as the Financial Times points out, the European Commission believes Apple may be limiting routes developers can take to avoid Apple's 30% App Store commission fee. The move has landed Apple in hot water once again as lawmakers send information requests to both the company and app developers. \"We are indeed looking at the compliance packages of all gatekeepers, including Apple,\" the European Commission said in a statement. \"In that context, we're in particular looking into the issue of progressive web apps, and can confirm sending the requests for information to Apple and to app developers, who can provide useful information for our assessment.\" Apple did not provide a new comment to Financial Times. Instead, it reiterated that the change would affect only a small number of users overall. Support for Progressive Web Apps has never been fantastic. However, their removal is perplexing, given Apple's previous stance on the matter. Apple has utilized the existence of this functionality as an anti-trust defense on a global level. Amber worked at MacNN and Electronista from 2015 until 2017, reviewing software, apps, games, and tech accessories. In 2019, she signed up with AppleInsider, where she covers all things Apple, with a focus on tech rev... What a joke. Apple would have to develop an entirely new framework to allow third parties to support the  functionality using their own apps and browser engines.The EU has claimed all these regulations are about leveling the playing field, but the playing field is now level here since Apple apps don’t have the ability to add PWAs to the Home Screen. Nobody does. It’s no longer a feature of iOS in the EU.Now they are dictating what features Apple must develop. That could be justifiable for privacy and security issues. This isn’t that. Go to the web browser of your choice and open the website. Done. What a joke. Apple would have to develop an entirely new framework to allow third parties to support the  functionality using their own apps and browser engines.The EU has claimed all these regulations are about leveling the playing field, but the playing field is now level here since Apple apps don’t have the ability to add PWAs to the Home Screen. Nobody does. It’s no longer a feature of iOS in the EU.Now they are dictating what features Apple must develop. That could be justifiable for privacy and security issues. This isn’t that. Go to the web browser of your choice and open the website. Done. Would it be possible for Apple to establish a new company, Apple Europe? They could put EU rep on Board and do everything to suit them. Customers could choose to buy a Euro iPhone from them, or an imported U.S. one. Let the market decide. Just spitballin’. Would it be possible for Apple to establish a new company, Apple Europe? They could put EU rep on Board and do everything to suit them. Customers could choose to buy a Euro iPhone from them, or an imported U.S. one. Let the market decide. Just spitballin’. There is no reason at all for the eu to care about this. Apple doesn’t have to offer a feature. Mheck, they could strip the option of making phone calls. It’s not up to the eh to chart what features a company offers. There is no reason at all for the eu to care about this. Apple doesn’t have to offer a feature. Mheck, they could strip the option of making phone calls. It’s not up to the eh to chart what features a company offers. robin huber said:\nWould it be possible for Apple to establish a new company, Apple Europe? They could put EU rep on Board and do everything to suit them. Customers could choose to buy a Euro iPhone from them, or an imported U.S. one. Let the market decide. Just spitballin’.\n\r\nLet us get the best of all states/countries. 5-6 years warranty like in UK. USB C, privacy, reduced app store fees like EU. And \"Right to Repair\" like in California?Can't imagine anyone demanding a non-Euro mouse later in 2024 to avoid USB C. Let us get the best of all states/countries. 5-6 years warranty like in UK. USB C, privacy, reduced app store fees like EU. And \"Right to Repair\" like in California?Can't imagine anyone demanding a non-Euro mouse later in 2024 to avoid USB C. robin huber said:\nWould it be possible for Apple to establish a new company, Apple Europe? They could put EU rep on Board and do everything to suit them. Customers could choose to buy a Euro iPhone from them, or an imported U.S. one. Let the market decide. Just spitballin’.\n\r\nThat would be terrible. Basically the same as having an fbi guy on staff at Twitter. Letting the government run a private company? Not even a slippery slope. Just straight up going to hell. Not to mention the precedent that would set. Better to just leave Europe and tell them that the rules is why they can’t have nice things. Any company gets to do whatever they want within the confines of the law. What the wi is trying to do is micromanage a company as if that company were part of a communist government. Now they are upset over a feature removal? Give me a break. What’s next, forcing apple to change its icon designs? That would be terrible. Basically the same as having an fbi guy on staff at Twitter. If you're tired of dealing with volume that is either too loud or too quiet, here's how to increase the volume level on a Mac by a quarter of what you normally can just by using a simple keyboard shortcut. Samsung's preorder deals are often aggressive, and their TV offer is no different. To celebrate the launch of the 2024 TV and audio lineup, Samsung is throwing in a free 65-inch TV with a qualifying preorder. Back by popular demand, OWC's 14-port Thunderbolt Dock for MacBooks is discounted to $99.99, matching the lowest price on record. But the month-end deal is valid for a limited time only. If you've been on the fence or haven't tried Apple's MLS Season Pass, now's a good time to try, as new subscribers can access a one-month free trial for a limited time. The Department of Justice's massive antitrust lawsuit against Apple is based on old information. Merrick Garland and company are going to lose big if they rely on arguments where practically every point made is no longer true. Apple has released iOS 17.4.1 and iPadOS 17.4.1 to the public, at the same time as bringing visionOS up to 1.1.1 while also slipping out iOS 16.7.7. A new vulnerability in Apple Silicon chips can allow a determined attacker to access a user's data by stealing the cryptographic keys — and a fix could considerably impact encryption performance. A fresh price cut on AirPods Pro 2 with USB-C is in effect at Amazon on day 2 of its Spring Sale 2024. Grab the lowest price on record while supplies last. The Department of Justice's massive antitrust lawsuit against Apple is based on old information. Merrick Garland and company are going to lose big if they rely on arguments where practically every point made is no longer true. Apple has released iOS 17.4.1 and iPadOS 17.4.1 to the public, at the same time as bringing visionOS up to 1.1.1 while also slipping out iOS 16.7.7. Tim Cook is in Shanghai for the opening of Apple's newest store, and has been stopping by developers, students, and suppliers.  "
}