{
    "title": "TeamViewer launches Spatial Support app for Apple Vision Pro",
    "date": "2/6/2024",
    "url": "https://itbrief.com.au/story/teamviewer-launches-spatial-support-app-for-apple-vision-pro",
    "text": "TeamViewer, a global provider of remote connectivity and workplace digitalisation solutions, has announced the launch of TeamViewer Spatial Support. This application is designed to enhance TeamViewer's advanced 3D visualisation and real-time remote support functions on Apple Vision Pro. TeamViewer Spatial Support is a significant indicator of TeamViewer's capabilities for innovation, speed, and efficiency as the company progresses into a new era of immersive assistance, after-sales support, and field service. The app is poised to be amongst the first business applications to leverage spatial capture on intricate devices or machinery. With integrated ARKit and LiDAR Scanner capabilities, TeamViewer’s Spatial Support app can capture intricate 3D models of devices in need of support via iPhone. During a shared session, a remote expert, utilising the Spatial Support app on Apple Vision Pro, interacts with these precise visual models. This collaborative setup fosters a synchronised 3D experience. The expert aids the on-site technician through annotations and 3D elements, facilitating a detailed and effective exchange. Brian Ballard, Senior Vice President Product Management & Solution Delivery at TeamViewer, commented, \"Remote support and assistance is part of TeamViewer’s DNA. With Apple Vision Pro, we are elevating the levels of fidelity, visual depth, and detail achievable for our customers beyond previous capabilities.\" \"These immersive capabilities extend beyond desktop support, aiding customers working with real-world, complex objects by conveying critical information to those capable of servicing machines and systems in the field. The impact is a faster response time and fewer errors. It addresses labour shortages and enables easy knowledge transfer by bridging the gap between on-site challenges and remote expertise.\" TeamViewer's leading AR-enabled enterprise productivity platform, Frontline, uniquely positions the company to introduce an industry-focused solution for Apple Vision Pro. The knowledge accumulated by TeamViewer about digitally transforming manufacturing, after-sales and field service processes underpins this. The company's strategic partnerships with industry powerhouses such as SAP, Microsoft, and Siemens further reinforce its credibility in this space. Current customers of TeamViewer can integrate the Spatial Support app using their existing licence as part of their daily work regime, the company states. More information about TeamViewer’s after-sales support solutions is now readily accessible at the Apple App store. TeamViewer is a global technology company that provides a connectivity platform to remotely access, control, manage, monitor, and repair devices of any kind – from laptops and mobile phones to industrial machines and robots. Although TeamViewer is free of charge for private use, it has around 630,000 subscribers and enables companies of all sizes and from all industries to digitalise their business-critical processes through connectivity. The company is focused on proactively shaping digital transformation in the fields of Augmented Reality, Internet of Things and Artificial Intelligence. "
}