{
    "title": "Three out of seven a win – Amazon, Apple and Meta topping forecasts",
    "date": "2/5/2024",
    "url": "https://www.leaprate.com/forex/market-news/three-out-of-seven-a-win-amazon-apple-and-meta-topping-forecasts/",
    "text": "Home › News › Forex › Market News › Three out of seven a win – Amazon, Apple and Meta topping forecasts On Thursday, 1 February 2024, three out of the so-called Magnificent Seven – Amazon.com, Inc. (AMZN), Apple Inc. (AAPL) and Meta Platforms, Inc. (META) – published their relevant financial reports. All three companies topped Wall Street predictions.  Amazon’s Q4 revenue, which totalled $170bn, beat the expected $166.2bn by almost $4bn. Experts attributed the financial success of this company to the synergy between its diverse segments. The reported totals boosted investor confidence, and Amazon closed its Friday, 2 February 2024, trading up 7.87%. Apple followed suit with its Q1 earnings and defied analyst forecasts. Its year-on-year quarterly revenue of $119.6bn went up by 2%. According to Yahoo Finance, this outpaced Zacks Consensus Estimates by 1.66%. The company further reported a 16% jump in year-over-year earnings per diluted share, trumping estimates by 4.31%. Apple, however, missed the mark with categories and devices net sales. Don’t miss out the latest news, subscribe to LeapRate’s newsletter Emulating the trend, Meta’s Q4 earnings came in at $40.11bn, a 25% year-on-year jump, to outdo the predicted $39.01. It also reported gains of $5.33 per share as opposed to the $4.91 estimates. The metaverse creator also announced a $50bn stock buyback programme and dividends of 50 cents per share. Friday, 2 February 2024 saw Meta stock skyrocketing by more than 20%. This rally boosted the company’s market cap by approximately $200bn, which is now valued at more than $1.2tn. In his press statement, Meta founder and CEO Mark Zuckerberg said: We had a good quarter as our community and business continue to grow. We’ve made a lot of progress on our vision for advancing AI and the metaverse. As reported by LeapRate on Thursday, 1 February 2024, big tech investors are closely watching and gauging if big tech AI spending justifies returns. With over a decade’s experience as a finance writer, Elizabeth Anderson applies her knowledge and experience to keep a finger on the pulse of global trends. Specialising in forex, cryptocurrencies, and stocks, Elizabeth follows the movements that impact the world of trading. LeapRate is an independent research and advisory firm, specialized in covering\n\t\t\t\t\t\t\tthe world of Forex trading.\n\t\t\t\t\t\t\tWe are followed by hundreds of thousands of traders, investors and other\n\t\t\t\t\t\t\tFX industry participants via our website, Facebook, Twitter, LinkedIn,\n\t\t\t\t\t\t\tRSS and Email Newsletter.\n\t\t\t\t\t\t\tCopyright © All rights reserved Finaffiliates Limited Website:\n\t\t\t\t\t\t\thttps://finaffiliates.com\n\t\t\t\t\t\t\tCEO: Jason Hopgood\n\t\t\t\t\t\t\tCompany number: 14540579\n\t\t\t\t\t\t\tVAT identification number: GB 431522433\nLocation: Finaffiliates Limited, Lawrence House, 5 St. Andrews Hill, Norwich NR2 1AD, United Kingdom\nEmail: [email protected] Foreign exchange trading comes with high level of risk.\n\t\t\t\t\t\tBefore investing in foreign exchange, carefully consider\n\t\t\t\t\t\tyour level of experience and risk appetite.\n\t\t\t\t\t\tCFDs are complex instruments and bring high risk of\n\t\t\t\t\t\tlosing money because of the leverage they provide.\n\t\t\t\t\t\tNo information or opinion contained on this site should\n\t\t\t\t\t\tbe taken as investment advice, personal recommendation,\n\t\t\t\t\t\tor an offer of, or solicitation to buy or sell, any financial\n\t\t\t\t\t\tinstruments.\n\t\t\t\t\t\tPast performance should not be considered evidence or guarantee\n\t\t\t\t\t\tfor future performance.\n\t\t\t\t\t\tBetween 74 and 89% of retail investors accounts lose money. © 2024 Copyright LeapRate\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\tTerms of Use "
}