{
    "title": "Major Changes At Apple New Audio Focus – channelnews",
    "date": "2/21/2024",
    "url": "https://www.channelnews.com.au/major-changes-at-apple-new-audio-focus/",
    "text": "Apple is looking to restructure their audio business and its bad news for Sonos who are punting on headphones to give the struggling US audio business a lift this year. Overnight it was revealed that Apple has shuffled leadership at the hardware team responsible for their audio business the iPhone Company also owns the Beats audio brand. The most notable products to come out of the acoustics group are the AirPods, which have quickly become a top seller — and a major reason people sticking with the Apple ecosystem of devices. At Apple audio sales is seen as an increasingly critical business and one that faces tough competition. Currently AirPods now bring in more than A$22 billion a year for Apple, according to estimates compiled by Bloomberg, and they lead the personal audio products market. Gary Geaves a former Bowers & Wilkins executive, and the company’s longtime vice president in charge of acoustics, is stepping down from the day-to-day role, to be replaced by his deputy Ruchir Davé, he will stay on as an advisor. Over the past two years, Geaves has been focused on an end-to-end overhaul of the lineup. Consumers will see the fruit of that effort in the coming months when Apple starts rolling out revamped models of their iPods. The exit of Geaves comes with analysts suspecting that there has been a “significant softening” in sales of audio products at Apple and that Apple management are looking for new ideas to drive growth. The audio division has over 300 employees and is a core part of Apple’s growing AirPods and speaker businesses, management in this division now report to Matt Costello, the executive in charge of Beats headphones and the HomePod. Bloomberg claims that the division is responsible for all sound and microphone technology developed by Apple. This division was also responsible for the development of Apple’s spatial audio that have become a selling point for AirPods, HomePods and the new Vision Pro headset. The group currently operates audio testing labs at Apple’s Silicon Valley headquarters. This is not the only restructure taking place at Apple, Tang Tan, the company’s vice president in charge of iPhone, Apple Watch and AirPods product design, unexpectantly quit the Company recently. Upon Tan’s departure, Costello also assumed responsibility over the product design group for accessories. Geaves was also key to development of the HomePod smart speaker, which wasn’t an immediate hit. The acoustics team under Geaves, also has been involved in efforts to explore new products, such as a wall-mounted smart display and a combined iPad and HomePod device.  02 9002 5900 [email protected] Level 1, 275 Alfred Street\nNorth Sydney\nNSW 2060\nAustralia  "
}