{
    "title": "\"I've tried a television show, but it's not impressive to me. It doesn't \nfeel like it's done enough .. - MK",
    "date": "2/20/2024",
    "url": "https://www.mk.co.kr/en/it/10946572",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share \"I've tried a television show, but it's not impressive to me. It doesn't feel like it's done enough yet.\" Tesla CEO Elon Musk's One-Line Comment On Apple Vision Pro However, he believes in Apple's power and has no doubt. \"The iPhone 1 wasn't good either,\" Musk said. \"It was less practical than other products when all things were considered,\" he said, adding, \"But when I went to the iPhone 3, it was definitely the best smartphone.\" The mixed reality headset (MR) Vision Pro, which was released on the 2nd of this month with a fixed price of 4.6 million won, attracted attention with a resell price of 12 million won. The pre-booking alone was so hot that it reached 200,000 units. On YouTube and other SNS, various reviews were poured out, wearing Vision Pro and waving their hands in the air. However, at this point, 15 days later, returns are being made up to eight times a day. Why is that? Apple Vision Pro is Apple's first new product in nine years since the Apple Watch in 2015. It is a future strategy introduced by Apple, which did not produce any new technologies or results last year when it was hot due to the AI craze. But according to Bullumberg, a significant number of customers have recently returned their Vision Pro. It was because the device was too heavy, too cumbersome to manage, and caused headaches. It has been criticized for not being more productive than using an external monitor when working. CEO Zuckerberg of Meta, which is dominating the headset market with virtual reality (VR) devices, used Vision Pro himself and left a review. \"Many people think that Vision Pro will be better in quality because it is $3,000 (about 4 million won), but I was surprised that Quest is much better for most uses,\" Zuckerberg said. \"Meta's VR device 'Quest 3' is 120g lighter than Vision Pro.\" The key to a VR or MR headset is 1) It shouldn't be heavy to wear on the head. 2) It should be affordable. 3) It should not be stuttering (delay). We can meet our customers' needs only if we meet the above three. The degree of stuttering is seen as a problem that can be overcome by the sophisticated development of the software. However, Vision Pro is still heavy (600g) to wear on the head. You need to be able to use it often to increase utilization, so you'll have a headache every time you use it. Perhaps there's a price at the base that highlights all the problems more. Quest 3, a VR device that was previously the best-selling device in the market, costs $499 (about 670,000 won) for the basic type, while the non-pro basic type costs $3499 (about 4.68 million won). People who buy and use MR headsets are likely to have already used VR devices, and they paid seven times more, but they didn't have a particularly better experience. \"After the launch of Vision Pro, it became clear that the MR headset market was still in the development stage,\" Bloomberg said. \"Given the initial response to the first version, it will take a long time for some (waiting for the second generation).\" \"The vision program's eye tracking function is really good,\" Zuckerberg praised. \"Quest's previous model had similar features, and we're going to add it back to the future model,\" he said. Matthew Panjano, editor-in-chief of IT specialized media \"Tech Crunch,\" also said, \"The movement's gaze tracking is almost perfect,\" adding, \"It is a real leap in the function and execution of mixed reality.\" Apple's eye-tracking feature is attributed to the company using two of Apple's self-developed \"M2\" chips and \"R1\" chips in Vision Pro's semiconductors. The M2 is a chip used in Mac computers and iPads. Existing M2 chips are used for overall vision pro operations, and R1 chips are used independently for camera, sensor, and microphone driving. In particular, this eye tracking function plays a big role in R1 chips. The R1 chip can stream new images to the display in 12 ㎳ (millissecond, one ㎳ is one-thousandth of a second), eight times faster than the blink time. The R1 chip processes information entered by 12 cameras, 5 sensors, and 6 microphones to make the content feel like it looks real-time in front of the user's eyes. It reduces delay as much as possible and prevents 'digital motion sickness', that is, motion sickness caused by delay associations. Although the issue of the usability of Vision Pro is still large, the commercialization itself can be seen as a new electricity for Apple in semiconductor design and production. Meta's \"Quest\" series, which dominated the virtual reality headset market, also uses Qualcomm's Snapdragon XR2, while Apple uses its own semiconductors. If you use your own semiconductor, you can be more free from supply and demand than receiving and using goods. If you drastically reduce the cost, you can leave a huge margin. Above all, Apple confirmed early that designing semiconductors that fit the finished product will increase the completeness of the product. This is because software runs smoothly only when you have hardware equipped with its own semiconductor. Apple has received architecture (design) from British fabless company Arm and is designing chips to suit its products. Indeed, Apple has significantly increased its own semiconductor design resources in recent decades. In particular, we have been steadily acquiring semiconductor companies. PA Semi (processor) in 2008, Anovit (flash memory) in 2011, Otentech (biometrics sensor) in 2012, and Dialogue (power management) in 2018. In addition, Apple expanded its semiconductor patent portfolio by acquiring 9,000 U.S. patent assets from Nortel Networks, Panasonic and others. This power has been demonstrated by designing increasingly capable processors such as M1, M2, and R1 chips. Finally, in October last year, we also released the M3 series. TSMC's 3-nano process was used. It is installed on the professional laptop MacBook Pro and the all-in-one desktop iMac. Apple Silicon has allowed Apple to create the most powerful product line in the history of personal computers, said Tim Cook, CEO of Apple. \"Only Apple can operate an integrated ecosystem that encompasses hardware (HW), software (SW) and semiconductors.\" The problem is that semiconductor development requires a long time. This is why analysts say that Apple is already developing a Mac processor to unveil in 2026. Computer World's Johnny Evans said, \"The Mac processor, which will only be unveiled in 2026, will be equipped with a new on-chip technology that no one outside Apple Labs has ever heard of at this point. Looking at it that way, you might think that the M3 MacBook Pro, the biggest concern right now, is a reflection of the decisions Apple has already made even before it unveiled its first M1 Mac.\" In fact, Apple spent a whopping $30 billion on research and development during fiscal 2023. Considering that R&D costs were $1.8 billion when we first switched to Apple silicon chips in 2010, it's a 16-fold increase. That's why it's more important what chips will be on board than a simple upgrade of Apple's Vision Pro. Rather than dismissing Vision Pro as not as good as I thought, it's time to focus on what kind of technological evolution Apple is making.  2024-03-21 10:10:01 2024-03-19 17:09:10 2024-03-19 19:49:38 2024-03-21 16:01:57 2024-03-21 19:13:25 2024-03-21 07:04:32 2024-03-21 10:10:42 2024-03-22 08:29:55 2024-03-20 15:07:53 2024-03-21 21:45:32 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}