{
    "title": "Apple finally puts brakes on Project Titan self-driving car",
    "date": "2/29/2024",
    "url": "https://www.techcentral.ie/apple-finally-puts-brakes-on-project-titan-self-driving-car/",
    "text": "29 February 2024  After a decade of research and billions of dollars of investment, Apple has finally decided put away its plans for a self-driving electronic car. The team that worked on that project is largely being transferred to Apple’s AI division. Also known as Project Titan, Apple’s self-driving car, has been struggling with setbacks for some time with the project constantly being scaled back from a self-driving car with no steering wheel to an electric vehicle with driver assistance. In the end there just wasn’t enough substance to justify the effort. Project leads Jeff Williams and Kevin Lynch informed the team of 2,000 employees of the decision – most of whom will get the chance to be transferred to the team working on artificial intelligence (AI) developments. There will also be some layoffs.  Apple itself declined to comment on those reports. Their shares did shoot up slightly after the news. Apple’s plans around its own car originated in 2014. Initially, the company wanted to create an electric car that could drive fully autonomously and was voice-controlled. To do so, Apple pulled some high-ranking experts away from Tesla, among others. However, the project soon faced many setbacks. Over the past few years, many of the key people involved in Project Titan within Apple left early, causing the company to change its plans on a regular basis, resulting in many delays. Recently, it was revealed that Apple had significantly adjusted its ambitions. The company was no longer aiming for a fully autonomous car, but for a so-called Level 2+ system. This still requires drivers to pay attention to the road and intervene when necessary. The system is similar to Autopilot in a Tesla. The delivery date was also immediately adjusted from 2026 to 2028. In recent weeks, however, it was decided to scrap those plans in the expectation that the market around electric cars will slacken off soon, something that Tesla and General Motors also warned about. As with all EVs there remains a concern about a lack of charging infrastructure in some places. In addition, the cost of developing a car has also risen, which would allow Apple to take virtually no profit margin. Still, the end of Project Titan does point the way for developments in other parts of the company. Apple is reportedly investing millions of dollars a day in training an AI system called Ajax, which it plans to launch soon. News Wires Read More: Apple Project Titan  Initiative to show how people with disabilities use technology More than 1,000 misconnected appliances identified to date Cupertino looks for a stop gap as AI plans lag behind competition Connected Hubs host short courses across Munster Poor subscription uptake forces rethink The latest from TechCentral.ie direct to your inbox daily\r\n\n\n\n\nLeave this field empty if you're human: Published by         \n        \n\n Ltd.  "
}