{
    "title": "Apple calls its Vision Pro a 'spatial computer'—what that means",
    "date": "2/8/2024",
    "url": "https://www.cnbc.com/2024/02/08/apple-calls-its-vision-pro-a-spatial-computer-what-that-means.html",
    "text": " Related Stories If you're in the U.S. and have an extra $3,500 lying around, you can now get Apple's latest gadget, the Vision Pro — but don't call it a virtual reality headset. Instead, Apple refers to the Vision Pro as a \"spatial computer.\" If you don't know what that means, you're not alone. Think of \"spatial computing\" as an umbrella term that refers to merging the digital world with the physical world in a seamless way. Apple says the Vision Pro uses a three-dimensional interface that makes users feel as if the digital content they're viewing, whether it be a movie or their social media feed, is present in their physical world, rather than limited to their phone or tablet screen. While both augmented reality and virtual reality fall under the spatial computing umbrella, the two terms refer to different user experiences. With virtual reality, you're fully immersed in a digitally simulated, 3D world that's also interactive, Louis Rosenberg, a computer scientist and entrepreneur who has spent over 30 years working and innovating in the augmented and virtual reality sector, tells CNBC Make It. Rosenberg also co-authored a new book titled \"Our Next Reality: How the AI-powered Metaverse Will Reshape the World,\" coming out in March. \"It's not like watching a 3D movie. It replaces the physical reality around you, and you interact with it,\" he says. On the other hand, augmented reality is when digital content is overlaid onto the real world, typically by using your phone's camera or AR glasses. Think of the mobile game Pokémon Go, which used AR technology to allow users to view virtual Pokémon on their phones, making it appear as if those Pokémon were in the player's physical location. \"You get the idea that there's a Pokémon monster in your environment, but there's no suspension of disbelief. You don't really believe it's there, but it gives you a sense of putting virtual content into your real world,\" Rosenberg says. While the Vision Pro combines aspects of both augmented reality and virtual reality, its unique operating system, which allows users to interact with and control apps with their fingers and eyes, is what makes it a spatial computer as opposed to simply being a mixed reality headset, Rosenberg says. \"I think Apple's goal is to highlight the fact that it has additional capabilities that go toward productivity, and they're also distancing themselves from their competitors by branding it differently,\" he says. Apple is positioning the Vision Pro as a full-on computer that could work as an alternative to your desktop or laptop, instead of a device that's mainly used for entertainment, he adds. While it may take time for the Vision Pro to be widely adopted, Apple's entry into the space makes it clear the company believes augmented reality and virtual reality will eventually become mainstream, Rosenberg says. \"My view is that mixed reality, immersive worlds, immersive experiences are inevitable because we humans were not meant to stare at little screens all day,\" he says. And while Apple is making a big splash with the Vision Pro, its not the only tech company experimenting with mixed reality devices. Meta's Quest 3 headset offers a variety of mixed reality experiences, such as playing a virtual piano on your coffee table or immersive gaming, as one example. Broadly, a future where a company can control everything you see, hear and interact with via its headsets may require new regulations about how the technology is used. In this imagined future, say you're wearing a high-quality headset that blends physical and digital content so seamlessly that it's difficult to differentiate between what's real and what's virtual. As you're walking down the street, you may think you pass a real person who's drinking a specific brand of soda but, it turns out, it was actually a virtual ad for that soda. \"There's lots of possibilities for dystopia,\" Rosenberg says. \"We definitely have to worry about abuse, and we definitely need to have regulation and policy that makes people feel comfortable that they're not being manipulated by the power that they're giving to third parties.\" Want to land your dream job in 2024? Take CNBC's new online course How to Ace Your Job Interview to learn what hiring managers are really looking for, body language techniques, what to say and not to say, and the best way to talk about pay. Get started today and save 50% with discount code EARLYBIRD. Get Make It newsletters delivered to your inbox Learn more about the world of CNBC Make It © 2024 CNBC LLC. All Rights Reserved. A Division of NBC Universal "
}