{
    "title": null,
    "date": "2/22/2024",
    "url": "https://www.financialexpress.com/jobs-career/education-apple-inaugurates-ios-development-lab-at-galgotias-university-in-delhi-3401702/",
    "text": "The Financial Express In a significant collaboration, Apple has inaugurated its iOS Development Lab at Galgotias University in Delhi. The inauguration took place on February 20th, it aims to  foster innovation and nurture the next generation of iOS developers, as per the press release. Earlier in September last year, the iOS Student Developer programme, an industry and academia partnered initiative, was launched to grow quality iOS talent in India and has since expanded to Galgotias University. Release further stated that as a result of this partnership, students enrolled in the programme gain access to Mac computers, while each team receives iPhones, iPads, and Apple Watches for development and testing purposes. Additionally, they benefit from learning materials provided by Apple and industry best practices shared by Infosys. The facility’s layout deviates from typical classrooms, resembling more of a corporate office. Galgotia elaborates to Joswiak that this design facilitates easier interaction between faculty members and students throughout the entire floor. The iOS Development Lab, equipped with facilities including 100 iMacs, is poised to serve as a hub for innovation and collaboration. It offers students the opportunity to engage in hands-on learning and the practical application of iOS development principles, thereby preparing them for success in the ever-evolving tech industry. “Today marked the grand opening of the iOS Development Lab at Galgotia University in Delhi. I loved meeting with the next generation of iOS developers and seeing the lab — outfitted with 100 iMacs,” Apple Senior vice-president, Greg Joswiak, wrote on X. Students who are part of the programme get access to Mac and each team gets access to iPhones, iPads, and Apple Watch for development and testing, while they leverage learning resources from Apple and industry best practices from Infosys. “Working for Apple has truly been an inspirational and enriching experience — not only for the students but also for the faculty and leadership team at Galgotias. The quest for astute perfection, eye for micro-detail, and the intelligence behind design has truly been an enlightening experience. We at Galgotias aspire to emulate the same culture within our organisation. The learnings from the iOS Development Centre will have a far-reaching impact well beyond the boundaries of the centre, specifically in the teaching-learning pedagogy of the entire university. The importance of mentorship and guidance in fostering a culture of active learning among students, enables them to develop a global outlook towards problem-solving and prepare for the challenges of the professional world,” Dhruv Galgotia, CEO, Galgotias University, said. Get live Share Market updates, Stock Market Quotes, and the latest India News and business news on Financial Express. Download the Financial Express App for the latest finance news.   "
}