{
    "title": null,
    "date": "2/19/2024",
    "url": "https://news.yahoo.com/apple-vision-pro-doesn-t-074200971.html",
    "text": "There are many technically impressive aspects of Apple’s Vision Pro, the digital face eater the tech giant released earlier this month. But perhaps the most fascinating element is EyeSight, which displays a dynamic digital rendering of your eyes (or generic eyes, if you don’t choose to personalize it) on the device’s front screen. Smize, and the device smizes with you. Cry, though, and it sounds like EyeSight will not display your tears. This function features prominently in the Vision Pro ad that has followed me around the internet for weeks. It’s a close crop of a woman in her 20s, with perfect skin and bouncy hair, staring into the camera. She makes eye contact—well, “eye contact”—with the audience: What we see is not her eyes, of course, but her EyeSight. Apple hopes that this facsimile is enough to fool our lizard brains, and CEO Tim Cook has even insisted that this “augmented reality,” with its high-resolution internal live stream of one’s surroundings, will actually keep us in touch with the world around us. People donning the Vision Pro may be able to convince themselves they are still connected to others—to family and friends and colleagues—despite the bulky computers strapped to their faces. But they will never be able to convince anyone else. The spark of human connection we feel making eye contact with EyeSight is a fraud, and even our lizard brains will know it. I have not tested a Vision Pro or encountered one in person, and I realize that may discredit my case with some readers. But for all its technical novelty and glint, when it comes to human connection, the Vision Pro differs from familiar screens in degree more than kind. When we are absorbed in an ordinary screen, it is obvious to those around us. Even very small children can tell when we’re giving them half our attention, making half a human connection. (I speak from regrettable experience.) You no doubt know what this is like, having been on both sides of such conversations yourself: the little half-glances upward, the slightly too frequent confusion over a simple narrative (wait, who said that?), the steady murmurs of mhm and yeah, wow and oh, totally meant to suggest at least some attention is diverted from the screen. The face computer will be this, but worse. The same disconnect, only more apparent. Talking to someone while looking at their EyeSight—while they look through you to the Word document in the middle distance—will never feel quite like a normal human interaction. It can’t, because it isn’t a normal human interaction. It’s half an interaction at best, mediated by an animation expressly designed to fool our loved ones into forgetting we have other, more absorbing things in view. Apple’s trailer for the Vision Pro couldn’t disguise this fact, particularly in its depiction of a father who wears the device while interacting with his kids, then uses it to review videos of them while sitting on his couch. The time with the children is bad enough. He’s positioned just a little too far from them, half his face concealed while they play with each other and make halfhearted attempts to include the digital hybrid crouching where their father should be. But the father’s rewatch of the interaction on the couch is even worse. He sits alone in a darkening room—a spotless, gorgeous room bereft of any sign of childish inhabitants—gazing at happier moments in which he chose not to participate. His smile beneath the screen is no doubt intended to communicate happy nostalgia, but it plays instead as sorrow. If EyeSight showed tears, surely we’d see them. Why is he alone like this, too lonely to even turn on the lights? Is he divorced? Did his whole family die in a freak accident? Either explanation is more plausible than the patently ridiculous notion that this man is having a good time. “Relive a memory as if you’re right back in the exact moment,” the narrator offers over the couch scene, though all the evidence suggests this man did not actually live the moment the first time around. Maybe he can tell himself he’s connecting with his kids. Outside the goggles, however, it’s obvious he has not augmented reality; he’s sacrificed it. Apple’s long-term plan for the Vision Pro likely does not include EyeSight, with the not-yet-attainable goal being a device that looks like normal glasses and includes a single, transparent screen that can change from clear to shaded and back again—like those transition lenses your uncle uses. That effect, if achieved, might feel a little more natural. But the user’s attention would be no less divided and the human connection no less inadequate. This disconnect has implications beyond personal relationships, especially for the work uses laid out in this Wall Street Journal review. The Vision Pro may be good for some kinds of focused desk work, though I have my doubts. (I also suspect a certain somnolent effect.) For any kind of social or collaborative work, and especially any situation with power dynamics in play, the artifice and interruption of normal interaction will be a serious detriment. Can you tap someone on the shoulder to talk when they’re off in a digital world? Can you ask your supervisor to take off her face computer and give you her full attention? Do you just have to gut through a presentation to a conference room full of EyeSights? Imagine asking for a raise via Vision Pro’s video chat using Apple’s Personas, the full digital avatar of which EyeSight is just one part. How do you have that conversation in Uncanny Valley? How do you gauge your conversation partner’s reactions when they’ve undergone digital Botox? How do you ask for due recognition of your skill and expertise while taking the form of a cartoon? And it’s not just those slightly awkward compensation conversations. Imagine trying to make a sale like that. Or working through a contentious project plan. Or firing someone. Or telling your boss you need the day off because your mom just died. This is not a medium for serious, adult human interaction. Even a phone call would offer a better connection, a connection not glazed with half-truth. None of this is to suggest there are zero good use cases here. Some early coverage suggests the device might prove an asset in the quest to expand accessibility. And set aside all this nonsense about staying connected and the Vision Pro sounds like a nice toy. Good for streaming TV, I bet, though I’ll personally stick with holding ye olde-fashioned iPhone four inches from my face. I’m not going to pony up $3,500 just to put a new screen two inches closer. But hey, if they can figure out a good way to clean the fabric-looking part—and if I turn out to have a rich, elderly uncle of whom I’m currently unaware—I’ll happily try the one included in my suite on Emirates first class. Read more at The Dispatch The Dispatch is a new digital media company providing engaged citizens with fact-based reporting and commentary, informed by conservative principles. Sign up for free. "
}