{
    "title": "While Apple's stock price, a leading U.S. company, has fallen into a slump \nthis year, Meta CEO Mark .. - MK",
    "date": "2/15/2024",
    "url": "https://www.mk.co.kr/en/stock/10943298",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share  While Apple's stock price, a leading U.S. company, has fallen into a slump this year, Meta CEO Mark Zuckerberg has attracted investors' attention by leaving a review of Apple's use of new Vision Pro products. Apple officially launched a new Vision Pro, an ambitious hybrid reality (MR) headset, this month. Vision Pro is Meta's Quest 3 competition product. On the 13th of this month (local time), Zuckerberg posted his evaluation of Vision Pro on his Instagram account as a Reels video. \"Apple's Vision Pro starts at $3500 and our Quest 3 starts at $500,\" he said. \"But after using Vision Pro, I think Quest 3 is not just a cost-effective product, but the product itself is better.\" Vision Pro is said to be heavy for a person to wear for a long time, has a short battery operation time, and Apple's aggressively promoted pass-through function falls short of expectations compared to its high price. As if aware of this, CEO Zuckerberg evaluated Quest 3 as better than Vision Pro while experiencing a pass-through function in a video of the review of the use. Apple has not made an official response. Pass-through is a function of seeing the outside environment in real time after using glass. The actual environment outside the headset is reflected on the display. Meta's Quest 3 also has a pass-through function.  On the New York Stock Exchange on the 14th, Meta's stock price rose 2.86% from the previous day, reaching 37% this year. The company announced on the 1st of this month that it will start dividends of $0.50 per share every quarter starting in March this year, and its stock price soared. It announced a shareholder-friendly policy, including the first dividend since its founding and expanding the amount of treasury stock purchases to $50 billion.   On the other hand, Apple's stock price fell 0.48 percent on the same day. Apple's stock price moved in the opposite direction despite the overall buying advantage of the stock market, with major U.S. tech stocks, including artificial intelligence (AI) stocks, soaring all at once. Apple's stock price has fallen by about 1% this year. Of the seven Magnificent stocks, only Tesla and Apple have negative stock prices as of this year. Last month, Microsoft gave up the No. 1 spot in global market capitalization to Microsoft (MSFT). Apple's sales, which were heavily dependent on China, were also hit as China moved to use its smartphones such as Huawei amid the prolonged conflict between the U.S. and China. Investors' attention is focused on whether Apple will expand its dividend or share buyback. Apple usually announced its shareholder-friendly policy when it reports its first-quarter earnings for the year. Apple's first-quarter earnings this year are expected to be in late April or early May. 2024-03-21 10:10:01 2024-03-19 17:09:10 2024-03-19 19:49:38 2024-03-21 16:01:57 2024-03-21 19:13:25 2024-03-21 07:04:32 2024-03-21 10:10:42 2024-03-22 08:29:55 2024-03-20 15:07:53 2024-03-21 21:45:32 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}