{
    "title": null,
    "date": "2/24/2024",
    "url": "https://au.finance.yahoo.com/news/apple-reveals-details-spotifys-business-223014774.html",
    "text": "With the European Commission set to rule on Spotify's complaint focused on competition in the streaming music market, there are hints that the ruling will not be in Apple's favor. This week, the Financial Times reported the EC will issue its first-ever fine against the tech giant for allegedly breaking EU law over competition in the streaming music market. The fine is expected to be around €500 million (about $539 million USD), the report noted. Instead of chalking up the fine as the cost of doing business, as a company that made history as the first to be valued at $3 trillion surely could, the tech giant is taking the fight to the public. In a statement shared with media today, Apple argued against the idea that Spotify has been harmed by any anticompetitive practices on its part. (The statement was not issued by a single spokesperson, but rather comes from Apple itself). It reads: We’re happy to support the success of all developers — including Spotify, which is the largest music streaming app in the world. Spotify pays Apple nothing for the services that have helped them build, update, and share their app with Apple users in 160 countries spanning the globe. Fundamentally, their complaint is about trying to get limitless access to all of Apple’s tools without paying anything for the value Apple provides. Apple pointed out also that Spotify has a 56% share of the market, compared with 20% for Amazon Music and Apple Music's 11%, per MIDiA's 2022 report on the subscription music market. In addition, Apple shared a number of non-public details about Spotify's business, as it pertains to Apple's platforms, including, for example, that Spotify uses thousands of Apple's APIs across 60 frameworks; that Spotify uses Apple's beta testing platform TestFlight; that Spotify has submitted over 420 versions of its app to App Review, which were approved; and even that Apple engineers have helped Spotify solve various challenges, like those impacting hardware-accelerated media playback and battery optimization. And, for those number watchers out there, Apple also said that Spotify's app had been downloaded, re-downloaded or updated more than 119 billion times across Apple devices -- a stat we had not heard before, we should note. The fact that Apple is front-running the EC's decision with its own commentary is remarkable, in and of itself. It speaks to a company that so solidly believes that it's doing the best thing for its own customers and developer partners that any sort of ruling that deems otherwise is so absurd that it demands comment and pushback. Apple believes its system of in-app purchases for things like music subscriptions saves consumers not only the headache and inconvenience of having to visit external websites on the iPhone's small screen -- they can just click the side button instead -- but also protects against fraud, excess data collection, consumer confusion over cancellations and errant purchases by children. (Of course, Apple is familiar with the latter itself.) Apple believes that Spotify only wants to increase its profits, by leveraging regulations to its advantage. In the case of the EU complaint, the concern is that Apple's App Store distorts competition in the music streaming market. It is not solely a complaint that Spotify has been harmed, in other words, but that the nature of the App Store may have thwarted other rivals. \"Spotify is a big player in the music streaming market but we don’t know what would have been the conditions without this,\" EVP and competition chief Margrethe Vestager said about the EC's investigation back in 2021. \"There are other rivals to Apple Music — there are Deezer, there are Soundcloud. Smaller competitors and here we have real concerns about their developments. This is not a Spotify case — this is a music streaming case,\" she noted. Spotify, however, has been the loudest of the Apple Music rivals and has fought against the company on other matters, for instance by calling Apple's new DMA rules \"extortion\" and a \"complete and total farce.\" To protect its interests (and, Apple argues, consumers), Apple's response to the EU's DMA (Digital Markets Act) regulation is the introduction of a new system that requires developers to pay for its services beyond just App Store payment processing. Rather, it now separates payment processing from other services by levying a \"Core Technology Fee\" for those developers who want to do business under the new DMA rules. In other words, it wants developers to pay Apple for the work it does to create and maintain its iOS platform, where apps can run, rather than acknowledging that access to consumers' favorite apps helps sell its iPhones. For the record, Apple disputes Spotify's claims that it's been harmed by any anticompetitive practices. It speaks to the success Spotify has seen over the years, having grown its streaming app over eight years from 25 million to 160 million subscribers -- a 27% average growth rate. It points out that Spotify users regularly subscribe to the service outside its app, and that Spotify qualifies for the \"Reader app\" exception to Apple's rules, which allows it to link directly to its website for account creation and payment, similar to Netflix. However, Apple seems to ignore the fact that Spotify turning a quarterly profit still makes headlines, that it just laid off 17% of its workforce, and that, you know, Spotify does face competition on iOS globally from Apple Music, which is preinstalled on iPhones, iPads and other Apple devices. In addition to being offered as a standalone service, Apple's music streaming app is upsold to customers as part of the Apple One bundles, which combine multiple Apple services, like iCloud+, News+, Apple TV+ and others, under one roof. Apple also stresses how closely Spotify has worked with the Commission on its complaint, having met with the regulators more than 65 times since the investigation began. The investigation, however, has been ongoing for years. A rep for the EC declined to comment on news related to Spotify's complaint or any pending fines. The FT had reported the fine is expected to be announced early next month. Spotify responded to Apple's statement with one of its own, saying: Spotify’s success has happened despite Apple's best efforts to gain an artificial advantage by favoring their own music service at every turn while placing roadblocks and imposing unfair restrictions on ours. Under their current rules Apple controls Spotify’s access to its own customers and gives Spotify one of two untenable options: We either have to deliver a poor user experience where we can’t directly communicate how to buy or subscribe to Spotify on iPhones or we have to accept a 30% cost disadvantage against our biggest competitor. This is not a level playing field. We support the European Commission and trust that they will take action soon to create a fair ecosystem for everyone involved. Additional reporting: Natasha Lomas; Updated 2/22/24 5:54 PM with Spotify statement. Europe charges Apple with antitrust breach, citing Spotify App Store complaint A simple test at home revealed the woman was overcharged during her recent shop. Find out why. People everywhere can't believe this simple little trick is already built into most people's phones.  You can avoid the mines and still pull in a decent salary. A major deal worth $1 billion has been signed by Australia in what is being labelled the nation’s biggest defence export. A male escort has revealed how much he makes per hour, after switching from a career as a tradie.  New York Attorney General Letitia James’ office pushed back on Donald Trump’s claim that he can’t find an insurance company to support his $464 million bond in the civil fraud case, telling the a state appeals court they should ignore the argument. Working in retirement is often a completely different experience than \"having to work\" during a traditional work career. For many seniors, working in retirement is actually enjoyable and a huge... A young woman has shared her 'dangerous' experience with a rideshare driver and was shocked at how many other women have experienced the same thing. 2024 Subaru Crosstrek Review, Pricing, and Specs Noland Arbaugh, 29, is paralysed below the shoulders but he has now been able to control a PC using just his mind. An editorial by a former education minister calling to \"ration the Internet\" to 3GB a week has sparked controversy in France. Yahoo News spoke to a retail technology expert on whether the glitches were linked.  Noland Arbaugh, who is paralysed below the shoulders, received a chip implant in January. The U.S. Department of Justice on Thursday sued Apple, the first major antitrust effort against the iPhone maker by the Biden administration, alleging it monopolized smartphone markets.  Apple joins a list of major tech companies sued by U.S. regulators, including Alphabet's Google, Meta Platforms and Amazon.com across the administrations of both former President Donald Trump and President Joe Biden.  \"Consumers should not have to pay higher prices because companies violate the antitrust laws,\" Attorney General Merrick Garland said in a statement. (Bloomberg) -- PetroChina Co. is set to receive a cargo of Venezuelan oil, which will be used at its mega refinery in Guangdong, after the US rolled back sanctions on the OPEC producer late last year.Most Read from BloombergNY Gears Up to Seize Trump Westchester Assets If Fraud Fine Is UnpaidBaltimore Wants to Sell Hundreds of Vacant Homes for $1 EachYemen’s Houthis Tell China, Russia Their Ships Won’t Be TargetedWhat Happens If Trump Can’t Post His $454 Million BondChina Scrutinizes PwC Role in  Deciding when to take Social Security benefits is one of the most important questions to answer in planning your retirement strategy. Second to that is understanding what might increase-or reduce-your benefit amount. Does retirement income count as income for Social Security? No, but working while claiming benefits could shrink the amount that you're able to […] The post Does Retirement Income Count as Income for Social Security? appeared first on SmartReads by SmartAsset. (Bloomberg) -- Oil steadied above $85 a barrel in London as a stronger dollar curbed investor appetite for commodities, offsetting signs of a tighter global crude market. Most Read from BloombergNY Gears Up to Seize Trump Westchester Assets If Fraud Fine Is UnpaidBaltimore Wants to Sell Hundreds of Vacant Homes for $1 EachYemen’s Houthis Tell China, Russia Their Ships Won’t Be TargetedWhat Happens If Trump Can’t Post His $454 Million BondChina Scrutinizes PwC Role in $78 Billion Evergrande Fraud LONDON (Reuters) -Oil prices were little changed on Friday, with global benchmark Brent hovering above $85 per barrel, as the possibility of a ceasefire in Gaza gained traction.  Brent crude futures were down 2 cents to $85.76 a barrel by 1017 GMT.  U.S. crude futures were up 1 cent at $81.08 per barrel.  Estonian Prime Minister Kaja Kallas has backed the idea of a European Commissioner dedicated to the defence industry as the European Union seeks to become a bigger player in the sector.  Kallas, a member of the European Council of the EU's national leaders, told Reuters in an interview that there was an urgent need to develop Europe's defence industry. Brand has strongly denied all allegations. In the usual way of things, platinum and palladium should be turning higher after a slide from recent peaks drove supply deficits, job cuts and looming mine closures in top producer South Africa.  Along with close relative rhodium, the two metals are chiefly used in the catalytic converters used to clean exhaust fumes by the auto sector, an area that accounts for some 40% of platinum demand, and 80% of palladium offtake.  Losing that demand will be significant for all three metals - and for palladium and rhodium, there is currently no other industry that can realistically replace the volumes that will be lost as consumers transition to electric vehicles, which don't need autocatalysts. "
}