{
    "title": "How Apple is Juicing Payments – Digital Transactions",
    "date": "3/1/2024",
    "url": "https://www.digitaltransactions.net/magazine_articles/how-apple-is-juicing-payments/",
    "text": "John Stewart \nMarch 1, 2024 The iPhone maker is known for its impeccable technology. What is less obvious is its nuanced but multipronged assault on the payments business. Ask anyone on the street what Apple Inc. does, and such is the company’s fame that even the least technology-inclined will respond immediately with examples like the Mac computer, the iPhone, or, lately, the VisionPro virtual-reality headset. Some may cite Apple Pay or even tap-to-pay on iPhone. But few will think of the consumer-tech Goliath as a payments company. Until now. “Definitely, they’re a fintech company at this point,” says Sheridan Trent, director of market intelligence at TSG, an Omaha, Neb.-based payments research firm. “Are they a payments company? They’re definitely trending in that direction.” Surprised? Long-time Apple watchers aren’t. The company has for years made forays into payments-related ventures, with the advent of the iPhone in 2007 setting the stage. Here was a device that was sold as a mobile phone but that could, ultimately, serve as a wallet with the power to make online and contactless payments—all with the notoriously strict oversight commonly exercised by the notoriously fussy management in Cupertino. Sure enough, seven years later came Apple Pay, with Apple Wallet tucked along for the ride. At the center of just about all of this activity is the iPhone, a now iconic device that commands an estimated 24% share of all new smart-phone sales. Name the payment service, it’s available on the phone—a device tightly controlled by Apple. So tightly controlled, indeed, that the company has attracted the notice of skeptical courts, snappish regulators, and disgruntled app developers, as well as much speculation about its intentions not only in payments but in that crucial gateway to financial transactions—personal identity. “It’s strategy is not obvious to the casual observer,” notes Richard Crone, who has observed Apple’s moves for years as proprietor at Crone Consulting LLC, a San Carlos, Calif.-based firm. “Paymentization is where the golden nugget is.” Record Revenue Apple is characteristically tightlipped about the numbers behind its products and services, but it’s especially quiet when it comes to its ventures in payments. A spokesperson for the company did not respond to repeated messages regarding an interview for this story. So quiet is Apple’s approach to payments, in fact, that it surprised veteran observers late in January when it uncharacteristically announced that its Apple Card, a Mastercard credit card it launched in 2019 with Goldman Sachs as the issuer, had attracted 12 million cardholders. (Goldman, unfamiliar with consumer credit, last summer began negotiating with Apple to exit its role as the card’s issuer). The product includes a physical card—said to be made of titanium—along with a digital version chiefly intended for use with the iPhone and its Apple Pay digital wallet. The release included other numbers about the card, including the fact that users last year earned more than $1 billion in “Daily Cash” when using the card (users earn 1%, 2%, or 3% on purchases, depending on the merchant and such factors as whether Apple Pay is used). In a key move, Apple equipped its phone with a near-field communication chip that works with Apple Pay. That enables owners to make contactless payments in stores—allowing the phone to reap a share of the growing trade in in-person digital-wallet traffic. But while revelations from Cupertino are rare, observers can profit from paying close attention to Apple’s earnings calls. The size of the company’s payments business has become a matter of concern for investors not only because of its increasing importance on the balance sheet but also because of litigation in the U.S. market and action by the European Commission overseas. Apple doesn’t disclose what it earns on payments, but it dropped a hint on an earnings call Feb. 1 held to discuss its December-quarter results. On the call, the company celebrated what it called a record for quarterly revenue in its Services business, some $23.1 billion worldwide. To put that number in perspective, in the same quarter Apple took in $69.7 billion just on iPhone sales. But the company also noted that its payments revenue, which is a component of that Services number, also hit a record high. Apple earns money from Apple Pay transaction fees charged to merchants and on interest on funds held in Apple Pay Cash. Gene Munster, a managing partner at Deepwater Asset Management, estimates revenue from Apple Pay alone accounts for, conservatively, 3% of that Services number, or about $700 million in the December quarter—some $2.8 billion if we simply annualize the number without seasonal factors. That number includes various fees, but principally, of course, Apple’s share of Goldman’s interchange. The advantage to Apple is that payments creates value—and, hence, relevance—for Apple Pay, Munster says. With payments, he says, a digital wallet “becomes more important” to Apple as the company collects “a fraction of transaction value.” On the flipside, though, the digital wallet becomes more than just another feature. “You have to have a wallet or your phone is going to become irrelevant,” Munster warns. Regulatory Rumbles But if Apple has pursued a clear strategy in payments and has pushed that strategy with help from the company’s hardware, it has lately faced pushback from courts and regulators. In a case that could have far-reaching implications for Apple, the company has had to bend the knee to the European Commission, which in 2022 concluded the company restricts competition by monopolizing access to the iPhone’s NFC chip, a violation, the commission said, of Europe’s Digital Marketing Act. To appease the regulator, Apple said it would allow third parties to access the chip; offer new features for users, including access to payments apps they may prefer; and refrain from discriminating against competing developers. It was a clear breach of the company’s longstanding walled garden. The Commission in January began seeking reaction to Apple’s proposal. The EU action came on top of a 2021 verdict in a U.S. antitrust lawsuit against Apple in which Epic Games, a major digital-game developer, lost on nine of 10 counts. But the one count on which it prevailed calls on Apple to allow app developers to process payments through pipes outside of Apple’s walls if they so choose. As a result, Apple slapped a 27% fee on app sales, which comes on top of the approximately 3% the developer would have incurred anyway for marked-up interchange on credit card transactions. That gave Apple “ridiculously high margins on in-app payments,” notes Stewart Watterson, a strategic advisor for retail banking and payments at Datos Insights. The move had at least one other effect. “It wipes out any saving you would have had by not using Apple’s payment system,” says Eric Grover, a Minden, Nev.-based payments consultant. Other observers argue developers will stick with Apple in any case. “It eliminates some liability for app creators. I would imagine a lot of developers would continue to rely on Apple’s payment system,” argues TSG’s Trent. Against the backdrop of the EU case, the Consumer Financial Protection Bureau has also taken note of what it calls “big tech firms in mobile payments,” noting in reports it issued in September and November that Apple’s restrictions on its NFC capability could hurt consumer choice and dampen competition. With Apple’s example clearly in view, the CFPB in November proposed that it should have supervisory authority over “larger” technology companies “that offer digital wallets and payment apps.” That puts Alphabet Inc.’s Google platform in the regulator’s sights in addition to Apple, though in contrast to Apple, the NFC chip on Android phones is owned and controlled by the network operator. The Bureau has become notably more activist in payments since the 2021 appointment of Rohit Chopra, a former McKinsey & Co. executive and Treasury Department student loan ombudsman, as its director. Notes Grover: “You have Rohit Chopra trying to figure out how to go after Apple and Google. This story isn’t over in the United States.” Still, payments firms appear to be ready to take advantage of any opening the EU case might create for them at Apple. In an earnings call in early February, PayPal Holdings Inc. chief executive Alex Chriss said the company was “tracking this very closely,” according to a transcript of the event. Customers, he said, “are demanding being able to have an omnichannel and offline solution as well. So, we’ll be working closely on this.” The Identity Gambit But some observers aren’t convinced Apple is into payments simply to provide a lucrative convenience or added service for iPhone users. The real purpose, they argue, lies deeper. “Identity, the identification, validation, authorization of payment hasn’t changed. It’s about to change dramatically,” argues consultant Crone. By controlling payments on its devices—the iPhone installed base alone has reached an all-time high, Apple said in its February earnings call, without citing a number—Apple will ultimately control a system of record that could authenticate user IDs and authorize transactions with unheard-of accuracy and on an unheard-of mass scale. That, Crone says, is the Holy Grail that lies behind the company’s drive for device installations with biometric user verification, such as facial recognition on the iPhone. Iris scans, he predicts, will be next. “Being the system of record for the federated ID is the long-term gain for Apple,” he says. The jackpot in all this, Crone argues, will lie the addition of government IDs, such as driver’s licenses, passports, or visas. “There’s no bank that can do this, because they don’t have the token, the iPhone,” he points out. Payments, he argues, is a means to an end. “The endgame is identity. What government entity won’t play?” he asks. Depending on various factors, Crone says, the revenue from ID services spread across an estimated 2.2 billion active devices—the number Apple cited in its earnings report—could amount to anywhere from $84 billion to $516 billion annually. “Whoever is the system of record for ID will shift value creation from processors to someone like Apple,” Crone argues. The real value, though, lies in Apple’s mastery of biometrics, he says, though he adds a close rival in this game could be Amazon.com Inc., with its Amazon One technology. What about the card networks? After all, they’re the platforms that made digital payments possible in the first place. Here, Crone is dismissive. “Visa and Mastercard are a dumb pipe,” he says. “They left ID to Apple and Google.” Not all Apple observers are quite as enthusiastic about this play. “It sounds good but there are too many hurdles in the way, privacy, for example” argues Brian Riley, director of the credit advisory service at Javelin Strategy & Research. “I don’t know how it would ever be executed.” Even if it were “executed,” it would “represent monopolistic control,” Riley says. “And that doesn’t play well.” The question now confronting the payments business is how well that business can contend with a resourceful tech company that clearly has designs on a much bigger slice of a payments pie it has spent years sinking its teeth into. Maybe everyone will just have to think different. March 21, 2024 March 21, 2024 March 21, 2024 Digital wallets accounted for $13.9 trillion in payments volume last year, or 50% of e-commerce … Search Entire SiteSearch by TopicSearch Entire Site \n\nSearch for:\n\n\n\nSearch by Topic\n\n \nChoose Topic \nTopics\n\nAll Topics\nAcquiring  (5,345)\nATMs  (518)\nAutomated Clearing House  (791)\nBreaking News  (5)\nCompetitive Strategies  (6,973)\nCredit Cards  (3,456)\nDebit Cards  (3,214)\nDigital Currency  (975)\nE-Commerce  (3,756)\nElectronic Bill Payment  (539)\nElectronic Checks  (452)\nFraud & Security  (1,930)\nIssuing/Originating  (2,211)\nKiosks & Ticketing Machines  (154)\nLaw and Regulation  (1,072)\nMagazine  (26)\nMarketing  (2,154)\nMergers & Acquisitions  (878)\nMobile Commerce  (3,493)\nMobile Wallets  (2,040)\nNear-Field Communication (NFC)  (868)\nPerson-to-Person Payments  (824)\nPoint-of-sale  (2,353)\nPrepaid Cards  (716)\nPresented By  (3)\nPricing  (1,132)\nRadio Frequency Technology  (247)\nReal-time Payments  (342)\nRemote Deposit Capture  (80)\nSmart Cards  (542)\nSponsored Content  (133)\nTransaction Processing  (6,617)\nUncategorized  (81)\nVending  (113)\n  \nSearch Chosen Topic If Top Card Execs Must Testify, So Shoul... posted on 02-15-2024\n For Cap One, the Pulse Network Is the ‘R... posted on 02-20-2024\n Capital One May Acquire Discover. What C... posted on 02-19-2024\n With 2024 Looming, the EPC Vows to Conti... posted on 12-20-2023\n Global’s ‘Profac’ Model Starts Paying Di... posted on 02-14-2024 "
}