{
    "title": "Can the Decline in iPhone Sales Support the Continued Rise of the Company's \nStock Price?",
    "date": "1/23/2024",
    "url": "https://www.cmcmarkets.com/en-ca/analysis/apple-earnings",
    "text": " Trade on the go Download our apps CFD's app X Trade the way that suits you Trade CFDs Trade contracts for difference (CFDs) on over 12,000+ products including FX Pairs, Indices, Commodities, Shares, and Treasuries.  Written by Zhujun Li Market Analyst 23 Jan 2024, 20:00 Share this In their last earnings call in 2023, Apple's quarterly revenue reached $89.5 billion, marking a decline for the fourth consecutive quarter. iPhone revenue amounted to $43.8 billion, with a year-over-year growth of 3%, primarily driven by increased sales in emerging markets such as India, Latin America, and the Middle East, setting quarterly revenue records. However, revenue from Mac, wearable devices, home, and accessories fell below market expectations. Service revenue reached $22.3 billion, reaching a historical high. The gross profit margin was 45.2%, a historic record, mainly due to higher profit margins resulting from better-than-expected service revenue. Apple's stock price continued to rise after the earnings call, reaching a historical high of $199.62 on December 14th. Apple's management appears to have not reached a consensus on the revenue outlook for the first quarter of fiscal year 2024, mainly due to the lack of consensus on Mac, iPad, and other hardware revenue. It is reported that management expects a dual situation of iPhone revenue growth and significant deceleration in iPad and other hardware revenue, while service revenue will continue to maintain stable growth. With intense competition in the Chinese smartphone market, Apple's activation volume in China in the fourth quarter of 2023 fell by 10% year-on-year. Despite maintaining the top position, Huawei's new 5G Mate 60 saw a 79% year-on-year increase in activation, ranking third. Xiaomi, with a 38% year-on-year growth in activation, secured the second position. Considering these figures, Apple's leading position in China seems to be gradually weakening. In this context, Apple's reduced the price of iPhone 15, and the company received downgrades from several institutions in January, such as Barclays, Piper Sandler, and Redburn, causing the stock price to fall to $180 at one point. However, with Bank of America upgrading Apple to a buy rating, citing Vision Pro as bringing performance growth to Apple, the market seems to have regained confidence in Apple's future growth, and the market value has returned to $3 trillion. Nevertheless, Vision Pro still faces dual constraints of high price and low shipment volume, with only 60,000 to 80,000 units in stock at present. Considering that nearly half of Apple's revenue comes from iPhones, at least from the current trend, Apple's sales are in an awkward decline. In previous years, Apple's old models were discounted just before the release of new models. The significant discounts this time will make future Apple users face a choice: whether to wait for discounts after the release of new models before making a purchase. Therefore, the launch of Vision Pro may help Apple's stock price rebound in the short term emotionally, but investors' long-term focus could well be on the decline in the smartphone business. After Vision Pro opened for pre-orders, tens of thousands of devices were sold out in 18 minutes, indicating the product's \"hot\" status. As core users make purchases, the risk of a weakening demand side due to the product's positioning not aligning with mass consumer goods is evident. Apple's rather subdued noise in the field of AI means - at least publically - it doesn't have the 'AI hype' that has been a growth engine for the likes of Microsoft, NVIDIA, Google, and other companies with intelligent cloud businesses. Apple's current P/E ratio is 31 times, much higher than the average level of the past 10 years, with market suggestions this could be perceived as somewhat overvalued for a company experiencing a slowdown in growth. Apple's first-quarter financial results for the fiscal year 2024 will be announced after the market closes on February 1st: Disclaimer: CMC Markets is an order execution-only service. The material (whether or not it states any opinions) is for general information purposes only, and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed. No opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person. The material has not been prepared in accordance with legal requirements designed to promote the independence of investment research. Although we are not specifically prevented from dealing before providing this material, we do not seek to take advantage of the material prior to its dissemination. Latest from CMC Microsoft Q4 Earnings Preview Microsoft Earnings Preview: Can the growth of its cloud business help Microsoft maintain its position as the world's most valuable company? 23 Jan 2024 Meta Q4 Earnings Preview Netflix Q4 earnings preview Tesla Q4 earnings preview Related articles Microsoft Q4 Earnings Preview Microsoft Earnings Preview: Can the growth of its cloud business help Microsoft maintain its position as the world's most valuable company? 23 Jan 2024 Meta Q4 Earnings Preview Meta Earnings Preview: Stable growth expected in advertising business but could the Metaverse continue to incur losses? 23 Jan 2024 Netflix Q4 earnings preview On the back of a crackdown with password sharing, how could Netflix fare in its Q4 earnings? 16 Jan 2024 Tesla Q4 earnings preview While Tesla's share price jumped 102% over 2023, interest rates and subsidies on EV purchases could cause headwinds in 2024. 15 Jan 2024 Canada 1 866 884 2608 Lines are open 24/5 Contact Download our app Get greater control and flexibility for peak performance trading when you're on the go. CMC Markets Canada Inc. is a member of the Investment Industry Regulatory Organization of Canada and a member of the Canadian Investor Protection Fund. CFDs are distributed in Canada by CMC Markets Canada Inc. acting as principal. Trading CFDs involve a high degree of risk and investors should be prepared for the risk of losing their entire investment and further amounts. CFD trading is available in jurisdictions in which CMC Markets is registered or exempt from registration, and, in the province of Alberta is available to Accredited Investors only. CMC Markets is an execution only dealer and does not provide investment advice or recommendations regarding the purchase or sale of any CFD. For full details of our fees please refer to our rates schedule. CMC Markets is remunerated through the spread which is the difference between the bid and ask price. Commission and holding costs may also apply. CMC Markets Canada Inc. est membre de l'Organisme canadien de réglementation du commerce des valeurs mobilières et du Fonds canadien de protection des épargnants. Les CFD sont distribués au Canada par CMC Markets Canada Inc., en qualité de mandant. Le trading de CFD comporte un degré de risque élevé et les investisseurs doivent être préparés au risque de perdre la totalité de leur investissement et des montants supplémentaires. Le trading de CFD est disponible dans les juridictions dans lesquelles CMC Markets est enregistré ou dispensé d'enregistrement, et dans la province de l'Alberta, il est uniquement disponible pour les investisseurs qualifiés. CMC Markets est un courtier d'exécution uniquement et ne fournit aucun conseil en investissement ni aucune recommandation concernant l'achat ou la vente de CFD. Pour plus de détails sur nos frais, veuillez vous référer à notre grille tarifaire. CMC Markets est rémunéré selon l’écart qui correspond à la différence entre le prix offert et le prix demandé. Des frais de commission et de financement peuvent également s'appliquer. Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. Android is a trademark of Google Inc. This website uses cookies to obtain information about your general internet usage. Removal of cookies may affect the operation of certain parts of this website. For more information about cookies and how to remove them, please read our cookie policy. * CMC Markets Canada Inc. is a subsidiary of CMC Markets plc, which is listed on the London Stock Exchange. © 2024 CMC Markets "
}