{
    "title": "Greg Joswiak on the Mac's enduring appeal",
    "date": "1/24/2024",
    "url": "https://sixcolors.com/post/2024/01/mac-40-a-quick-qa-with-greg-joswiak/",
    "text": "Magic Lasso Adblock: YouTube ad blocker for Safari January 24, 2024 3:01 PM PT My feature for The Verge on the Mac’s 40th anniversary came together surprisingly quickly, given that the anniversary has been four decades in the making. As I was writing it, I realized I was leading off with interviews I had done with Steve Jobs for the Mac’s 20th and with Phil Schiller, Craig Federighi, and Bud Tribble for the Mac’s 30th anniversary. It made me realize that the article ideally should have the voice of someone at the Apple of today, too. One of the conditions of my interview with Jobs—hard to believe it’s half the Mac’s life ago, now—was that I only talk to him about the future, not the past. It’s a tough task, asking someone about the future when you’re supposed to be interested in the past, but that’s just how Apple rolls—then and now. It’s always focused on what’s next, a bit of corporate culture instilled by Jobs himself. The obvious choice was Greg “Joz” Joswiak, Apple’s senior vice president of Worldwide Marketing. Joz has been working at Apple since 1986, and I first remember encountering him at an early PowerBook briefing. In a tight timeframe, I managed to get a few quick questions into Joz for the Mac’s 40th anniversary. The issue I keep coming back to (apparently every 10 years!) is how since 2001 Apple just keeps adding new non-Mac product lines. (A new one on the way in a couple of weeks.) The Mac is roughly 10% of Apple’s business. So how do you give love to a platform that is only a fraction of your business when there’s another platform that’s more than half your business? “The Mac is the foundation of Apple… and today 40 years later it remains a critical part of our business that we continue to invest in,” Joswiak said. “Through all of its changes and evolutions over the years, we couldn’t be more proud to say that the Mac is more popular and relevant than ever… It’s exciting to see more people switching to Mac than ever before. The Mac will always be part of Apple. It’s a product that runs deep within the company, and defines who we are.” I asked Joswiak about where the Mac fits in among all these other platforms, and he pointed out that Apple, one of the largest companies in the world, runs on the Mac. “As a platform, the Mac is still breaking new ground and continuing to propel the concept of computing forward in unprecedented ways,” he said. “People can do things on a Mac laptop that they would have never dreamed possible 40 or even 10 years ago. And today, the Mac also plays an important complementary role to other devices in the Apple ecosystem, whether it’s iPhone, iPad, or soon… Vision Pro.” As has been pointed out a lot today, the Mac is the unique tech product to have somehow survived and thrived over 40 years, when many hit products don’t manage even 10 years in the spotlight. I’ve got my own theories about why that is, but I was curious if Joswiak—who, again, has been around Apple since 1986—had his own theories. “From the beginning, the Mac has always embraced big changes to stay at the forefront of personal computing,” he said. “It revolutionized the concept of the personal computer 40 years ago and is still doing so today — challenging the notion of what’s possible on a laptop or desktop computer. Mac has [led] with nearly every major technological wave… This constant evolution paired with our unrelenting dedication to the user experience across hardware, software, and design, has led the Mac to become a product that has not only stood the test of time, but that has built a loyalty among users like no other.” There’s no denying that. From the very beginning to today, the attachment people feel for their Macs seems like it’s one of the product line’s definining characteristics. “People love their Mac,” Joswiak told me. “It’s hard to imagine any other PC that people love as much as the Mac. That was true with the very first Mac, and it’s still true with the Macs we make today.” If you appreciate articles like this one, support us by becoming a Six Colors subscriber. Subscribers get access to an exclusive podcast, members-only stories, and a special community. "
}