{
    "title": "One reason the Vision Pro might be so expensive: 'mimetic desire'",
    "date": "2/20/2024",
    "url": "https://ca.style.yahoo.com/one-reason-vision-pro-might-213227331.html",
    "text": "Plus why you need them to keep your peepers safe. The Apple Vision Pro's $3,499 price tag may be part of the company's marketing plan. Some claim the headset's price is an example of Apple using 'mimetic desire' to stir up interest. Public figures with a Vision Pro may, in theory, inspire their followers to buy it if it's cheaper. The Vision Pro's whopping $3,499 price tag may be part of Apple's marketing ploy to entice more customers to purchase the mixed-reality headset in the future. At least that's what some members of the business community think. In a post on X, formerly Twitter, Jason Levin, a marketing strategist who writes about spatial computing, characterized Apple's so-called promotional tactic as a concept known as \"mimetic desire.\" Rooted in philosophical thought, mimetic desire refers to the notion that people desire the same things that their role models want. In the context of the Vision Pro, that theory could mean consumers may be more likely to purchase the device because celebrities or influencers they admire own it. \"When consumers see high-status people rocking Vision Pros in public, it becomes a status symbol to have one,\" Levin told Business Insider. \"If these people are models to you—which they are for many young people—mimetic desire kicks in and you subconsciously want a Vision Pro too.\" Some public figures who've been open about their experiences with the Vision Pro on the internet include YouTubers Logan Paul and Casey Neistat, rappers like T-Pain and Kid Cudi, and tech leaders like former Microsoft strategist Robert Scoble, according to Levin. Sam Altman, the CEO behind OpenAI, even said on X that the Vision Pro is the \"second most impressive tech since the iPhone.\" I just went on my walk again. This time on my couch.If you have an Apple Vision Pro, some photography tips. More in a couple videos I am uploading.1. The camera can focus close. Get very close to things. Move quickly around them. When you see it later in the headset it is… pic.twitter.com/bB0XTzJ291 — Robert Scoble (@Scobleizer) February 7, 2024 To support his point on mimetic desire, Levin linked a clip on his X post from an interview with Palmer Luckey, the founder of the Oculus VR headset that's now Meta's Quest, from last July. In it, Luckey shared his thoughts on how the Vision Pro's multi-thousand dollar price is aligned with Apple's plans to attract people to the product. \"The price just doesn't matter for the group of early adopters that they're targeting,\" he said in the interview referring to Apple. \"But what they're going to do is to inspire lust in a much larger group of people.\" After all, the Oculus founder, who did not respond to BI's request for comment, said he believes the Vision Pro will eventually be cheaper for the masses. During its initial phase after launch, the headset, he said, was purposefully designed with cutting-edge screen resolution, display quality, and ergonomics to target a wealthier customer base. Those with more disposable income would have no problem dishing out thousands of dollars for the glossy device compared to those who don't, he said. This wealthier customer base who buy and flaunt their headset out in the open may eventually stir up greater consumer interest in the product once its price drops. \"If Apple had tried to go to the low end of the market, that would've been a mistake,\" Luckey said in the interview. It's not just Apple trying to lure future customers to expensive shiny new objects. Levin said that Tesla, the electrical vehicle company run by CEO Elon Musk, has used mimetic desire by putting an expensive price tag on the company's first model to make \"owning an electric car cool.\" As a result, those who see people they respect purchase an expensive Tesla would, in theory, increase their desire for one. Apple didn't immediately respond to BI's request for comment. Read the original article on Business Insider Dark Brandon strikes again. 'Jennifer's Body' star Megan Fox opened up about her engagement to Machine Gun Kelly and listed all her cosmetic procedures on the 'Call Her Daddy' podcast.  The 48-year-old mother-of-three spoke to Vogue about her life after ending her marriage of 18 years. The far-right lawmaker finally said something her critics could agree with. Marco BelloDonald Trump, unable to front a half billion dollars to pay off his recent bank fraud judgment, now effectively has liens placed on his massive, forested estate north of New York City, according to public records and several court clerks who spoke to The Daily Beast on Thursday.Documents show that New York Attorney General Letitia James has started preparing to seize his family’s hallowed grounds at Seven Springs, the billionaire tycoon’s Bruce-Wayne-like mansion surrounded by 212 acr  The late-night host said Trump’s financial struggles could be taking a toll on another part of his life. The Trump scion \"murders irony\" with his latest hot take, quipped social media users. NEW YORK — Paul Simon is slip slidin’ back to the days of working with Art Garfunkel, and peeling back the curtain on what ended their iconic yet “uneven” partnership and decadeslong friendship. The Grammy-winning Simon & Garfunkel co-founder, 82, noted in the first half of MGM+’s “In Restless Dreams: The Music of Paul Simon” that they “were really best friends up until ‘Bridge over Troubled ...  A potential running mate for the former president is reportedly looking more favorable to Trump. “Are you trolling?” one GOP senator said when asked if he'd be willing to help pay for Donald Trump's multimillion-dollar legal fees in New York. Konstantin Koltsov's ex-wife has said the boyfriend of tennis star Aryna Sabalenka was \"most likely very drunk\" when he died.  Koltsov, 42, a Belarusian former professional ice hockey player, was found dead at a hotel in Miami, Florida, on Monday.  Police investigating his death have said it was an \"apparent suicide\" after they found no evidence of \"foul play\".  “I don’t think people really appreciate exactly what we are going to be in for,” said Michael Steele. Things got awkward for Jordan during Thursday's House Judiciary Committee meeting. The actress said for her most recent breast procedure, she wanted “1990 stripper” breasts — and shared why surgery is “traumatic” for her  Amid theories that the Palace is using a fake Kate Middleton, her professional look-alike is speaking out about claims she was hired. During an oversight committee hearing, Lev Parnas accused Sean Hannity and committee member Pete Sessions of purposely pushing Russian propaganda. This man is playing with fire.  SAO PAULO (AP) — The father of soccer star Neymar said Thursday that his family won't pay the one million euros ($1.1 million) required to bail Dani Alves out of a Spanish prison where the former Brazil defender awaits the result of an appeal to his rape conviction. Neymar da Silva Santos said in a statement on behalf of his family that they financially supported Alves during his trial, but that they won't do it again now that the former player was found guilty of raping a woman in a Barcelona n 50.2% of Californians voted in support of the measure. Social media users questioned whether the image of the Trumps was legitimate. "
}