{
    "title": "Apple reportedly cancels EV project, to focus more on AI",
    "date": "2/28/2024",
    "url": "http://www.ecns.cn/m/business/2024-02-29/detail-ihcychvt6118286.shtml",
    "text": "After spending billions of dollars and a decade on research, Apple reportedly is dropping building an electric car and will use some of the project's staff to focus on artificial intelligence. During the company's annual shareholder meeting on Wednesday, which was held virtually, CEO Tim Cook said that the iPhone maker is pouring money into AI. He said the company sees \"incredible breakthrough potential for generative AI, which is why we're currently investing significantly in this area. We believe that will unlock transformative opportunities for users when it comes to productivity, problem solving and more.\" CNBC reported that Cook teased a major announcement coming this year. \"Later this year, I look forward to sharing with you the ways we will break new ground in generative AI, another technology we believe can redefine the future,\" Cook said Cook, who began the EV project after he took over as CEO from co-founder Steve Jobs in 2011, didn't mention dropping the electric car project, which Bloomberg News reported Tuesday; Apple had no comment on the report. Unnamed sources told Bloomberg that the company told employees in an internal meeting Tuesday that it had scrapped the EV project and that many of the 2,000 people said to be working on the car project would be shifted to different roles, including in Apple's artificial intelligence division. \"This is a smart and long-awaited decision,\" Ray Wang, founder and CEO of Silicon Valley-based consultancy Constellation Research told the BBC. \"The market demand for EVs is not there, and AI is where all the action is.\" \"Apple canceling this project is a sigh of relief for us,\" Dan Morgan, a senior portfolio manager at Apple shareholder Synovus Trust, told The Wall Street Journal. \"When you looked at Apple's future initiatives, the car project was always the most far-fetched for Apple. This just isn't in their wheelhouse.\" Instead, it is better that Apple will be redeploying engineers and investments into areas like artificial intelligence that could help its consumer electronics business, Morgan said. Apple dropping the EV project comes as consumer and investor enthusiasm in the US for electric vehicles is waning because of financing costs. US automakers also have been shifting plans to account for the softer EV demand. Most recently, General Motors CEO Mary Barra said the company would begin to rely on hybrid sales in North America, and Volvo in Sweden said it was pulling future funding from its EV company, Polestar. Part of the pressure automakers are feeling comes from a price war triggered by Elon Musk's Tesla, according to automotive analysts. Musk started discounting some of Tesla's most popular models last year, driving down the average price of EVs and making it harder for legacy automakers to compete without losing money. Last year, Ford said it lost more than $64,000 on every EV that it sold. Since October, it has delayed the opening of one of its new EV battery plants. Even the world's leading EV maker, BYD, said this week it doesn't want to be in the US market. In 2023, the company sold 3.02 million pure electric and plug-in hybrid vehicles to customers in China and abroad, up by 62.3 percent from the previous year. \"We're not planning to come to the US,\" BYD Americas CEO Stella Li told Yahoo Finance. \"It's an interesting market, but it's very complicated if you're talking about EVs.\" Auto industry observers say that BYD's cars deliver great value at prices that beat anything made in the West. Earlier this month, BYD unveiled a plug-in hybrid that gets decent all-electric range and will retail for just over $11,000. The company, backed by Warren Buffett's Berkshire Hathaway, said that the new variant aims to accelerate customers' conversion from gasoline-powered vehicles. Apple never publicly confirmed that it would make an EV but had taken several steps over the past 10 years that suggested it was serious about such efforts. When Apple started the project around 2014, the company imagined a fully autonomous vehicle. Apple eventually scaled back that to semiautonomous, where the vehicle automates only some parts of the driving. Apple may be dropping its plans to develop an EV, but one of its largest partners, Foxconn, which manufactures iPhones, is diversifying into making electric cars, with sales due to start this year. CEO Young Liu recently told CNN that the EV business model \"should be reinvented''. "
}