{
    "title": "Apple financial results for the first quarter of 2024",
    "date": "2/4/2024",
    "url": "https://www.gearrice.com/update/apple-financial-results-for-the-first-quarter-of-2024/",
    "text": " Join the conversation Apple has announced its fiscal results from the first quarter of 2024, relating to the last quarter of 2023, in a conference directed by Tim Cook and Luca Maestri.  Both have shared very interesting details about new products such as Apple Vision Pro, changes in the App Store ecosystem, sales revenue, the growth of their services and more. The company has generated total revenues of 119,575 million dollars.  Figures that, by the way, have slightly exceeded analysts’ expectations.  Apple was expected to earn around $117.91 billion.  Last year at this point Apple generated $117.15 billion. As always, iPhone sales have been crucial for Apple during the last quarter of 2023. Surprisingly, services revenue has continued to grow and iPad sales have fallen significantly after Apple did not present any new iPad model all year. Apple has once again broken the record for revenue generated by its services.  Sales figures for Apple Music, Apple Arcade, Apple TV+ and other services have risen more than 2 billion dollars compared to the same period of the previous year. Revenue data for the first quarter of 2024 The fiscal results for the first quarter of 2024 indicate, for the first time, how iPhone 15 sales have gone. The figures have exceeded all expectations and the negative note is found in the iPad category, which could not be maintained due to the lack of new products. Apple has generated 119,575 million dollars in the final period of 2023 During Apple’s Q1 2024 financial results call, Tim Cook also announced that the active device base had exceeded 2.2 billion users. In addition, Tim Cook also took the opportunity to welcome to the market its new and revolutionary product, the Apple Vision Pro.  He headset lands in Apple Stores in the United States today, February 2, 2024. The CEO of Apple wanted to confirm that this year Apple will announce great news in artificial intelligenceindicating that the company has made a great effort in terms of time and investments to offer its users the best of generative AI. “In terms of generative AI, which I would assume is what you’re focused on, we have a lot of work internally, as we’ve alluded to previously. Our marketing operations, if you will, have always been to do the work and then talk about it. But we have some things we’re incredibly excited about, which we’ll talk about later this year.” Regarding the changes implemented in the App Store, Tim Cook has assured that Apple will be focused on privacy, security and usability. Join the conversation      Save my name, email, and website in this browser for the next time I comment.   Δ Type above and press Enter to search. Press Esc to cancel. "
}