{
    "title": "Number of agencies have concerns about 'sideloading' on iPhone, Apple says",
    "date": "3/1/2024",
    "url": "https://www.mvariety.com/business/number-of-agencies-have-concerns-about-sideloading-on-iphone-apple-says/article_48fbec4c-d84b-11ee-91a3-1f5b36783325.html",
    "text": "  FILE PHOTO: The Apple logo is seen hanging at the entrance to the Apple store on 5th Avenue in Manhattan, New York, U.S., October 16, 2019. BRUSSELS (Reuters) — A number of government agencies in the European Union and elsewhere have voiced concerns about security risks as Apple opens up its iPhones and iPads to rival app stores to comply with EU tech rules, Apple said on Friday. Under the Digital Markets Act (DMA), from March 7 Apple will be required to offer alternative app stores on iPhones and allow developers to opt out of using its in-app payment system, which charges fees of up to 30%. The U.S. tech giant, which on Jan. 24 detailed the changes to bring its App Store in line with the EU rules, said \"sideloading\" - installation of applications on a mobile device without using its dedicated app store - has sparked concerns from both EU and non-EU government agencies and users. Allowing the practice is among reforms that some lawmakers hope will help open up the market for apps. \"These agencies - especially those serving essential functions such as defense, banking, and emergency services - have reached out to us about these new changes,\" Apple said in a guidance paper. It said the agencies wanted assurances that they would be able to prevent government employees from sideloading apps onto government-purchased iPhones and that several said they planned to block sideloading on every device they manage. \"One EU government agency informed us that it had neither the funding nor the personnel to review and approve apps for its devices, and so planned to continue to rely on Apple and the App Store because it trusts us to comprehensively vet apps,\" Apple said. The company did not provide details on the number of concerned agencies and the countries where they are located. Firms such as Fortnite creator Epic Games and Spotify Technology, have for years said that Apple's commissions and restrictions impede their businesses. (This is not a scientific poll.) Click below to view our latest e-Edition. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: "
}