{
    "title": "Apple: Buy, Sell, Or Hold? (NASDAQ:AAPL)",
    "date": "1/9/2024",
    "url": "https://seekingalpha.com/article/4661975-apple-buy-sell-or-hold",
    "text": " yalcinsonat1 Apple (NASDAQ:AAPL), the world's most valuable company, has recently become the subject of intense scrutiny. There are concerns regarding iPhone sales, especially in China. There have also been downgrades by Piper Sandler, Barclays, and others. Analysts cite hardware concerns, including iPhone 15 weakness and other factors. Perhaps most troubling is Apple's jacked-up valuation. Apple trades at 26 times forward EPS estimates (consensus) and could have an EPS growth of only about 8% next year. At a 3.25 PEG ratio, Apple is relatively expensive. Therefore, Apple will likely go through another stagnant period, making its stock a hold now. However, despite Apple's transitory setbacks, its stock becomes increasingly attractive around the $150 zone, as its forward P/E ratio should remain above 20. Also, there are plenty of positive angles to the Apple story. There is still considerable growth in its services and wearable businesses. iPhone sales should rebound, and China sales will likely return to growth. Also, Apple's non-iPhone hardware segment can improve in future quarters. Therefore, while Apple may be a hold here, it becomes a strong buy around the $150 range. I will look for an opportunity to enter Apple on weakness as we advance through 2024. Apple's stock has gone through transitory periods of stagnant growth, weakness, and sideways price action several times. We saw its stock stagnate around the 2014-2016 time frame. We saw another low growth period around 2017-2019. Then, we witnessed a sideways phase around the 2021-2022 time frame, and Apple may continue consolidating before moving higher again. iPhone sales still account for approximately 50% of Apple's total revenues. Therefore, Apple is heavily dependent on the growth of its iPhone sales. Last quarter, iPhone sales increased by only 3% YoY after posting a 3% YoY decline in the previous quarter, illustrating some softness in the iPhone segment. iPhone sales (businessofapps.com ) However, we've seen this dynamic with prior iPhone cycles. The market has become highly saturated by Apple's iPhone 12-15 Models, and it's expected to see a slowdown. Also, the design is relatively old and has become stale. Additionally, Apple's iPhone 15 looks very much like the 12, 13, and 14 models, and consumers need more incentive to upgrade aside from incremental performance increases that may be unnoticeable to many users. For example, I still use my iPhone 12 Pro Max that I purchased in late 2020. It works perfectly fine to this day. My wife keeps saying I should upgrade, but I don't see a reason to upgrade because there is very little difference between my phone and the new line. I will likely upgrade to the iPhone 16 in the fall, but four years is a long upgrade cycle. I am not alone, and there isn't a comprehensive catalyst to compel consumers to upgrade to a new iPhone sooner (every 2-3 years). Of course, when the redesign comes with more advanced features, it will catalyze increased sales. There are rumors for minor redesign features for the iPhone 16, but the iPhone 17 model may get major adjustments similar to what we witnessed in the iPhone X jump from the iPhone 8 line-up. As the iPhone 12-15 models are so similar, it's normal to see a slowdown in sales growth. Other newer phones are likely taking incremental market share away from Apple in the smartphone market also. However, iPhone sales should rebound and could surge as Apple introduces its iPhone 16 and 17 line-ups with possible price increases in the future. Services revenues (businessofapps.com) Services revenues continue expanding at a healthy clip, with 7.7% sales growth last quarter. Also, services are becoming an increasingly significant portion of total revenues, with annual revenues likely to hit $100 billion soon (2025). While we may not see a return to substantial double-digit growth in the services segment, it should continue contributing to the increase for many years as we advance. Analysts say China iPhone sales dropped by 30% in the first week of 2024. Also, 2023 sales likely declined by about 3% from the previous year. Apple's most recent quarter saw China revenues come in at $15.1 billion, below the $15.42 billion in the same quarter one year ago. The declines are attributed to new flagship model phones from Huawei, Xiaomi, and others. China is Apple's third most significant market, behind the Americas and Europe. Despite Apple's slip in China, the sales and market share declines are likely transitory. Again, this dynamic boils down to Apple's stale and still expensive iPhone line-up. The \"new models\" aren't exactly new anymore because, aside from color changes, the designs are about the same. Yet, Apple remains at the pinnacle of the electronic hardware pyramid, and its products should continue garnering high demand in China and globally. Also, this is not a China-isolated story. Sales in almost all significant regions declined in 2023 compared to a year ago. Nonetheless, the tide should turn for Apple in China and globally, as the iPhone remains a top smartphone. It's also a status symbol in many countries, and even if some users switch away from the iPhone to try new Huawei or Xiaomi phones, they may return to Apple for their future iPhone products. In the meantime, Apple can improve sales and regain market share by decreasing prices before introducing new and updated iPhones. Wearables (businessofapps.com) Wearables sales also declined YoY in the previous quarter. However, we're dealing with a relatively slow economy, high-interest rates, and other challenging factors. Still, this segment should rebound as the economy strengthens and the Fed introduces a more accessible monetary policy in future years. Apple's AirPods business alone is estimated to be around a $10B annual revenue business. Its Apple Watch segment contributes about $14-$18B in annual sales. We should see growth improve in these and other product segments, and Apple's Vision Pro headset will likely achieve increasing growth in sales as well. Apple EPS (SeekingAlpha.com ) Of course, Apple is not cheap here at 26 times forward EPS estimates. However, if Apple continues consolidating and dips into my $150-$160 buy-in range, it will be priced much more attractively, especially with increased future growth prospects. Apple should earn around $7.00-$7.50 next year, implying that its P/E ratio is about 20-22 in the $150-$160 range. Due to Apple's dominant global positioning, high level of profitability, future growth prospects, and other advantages, its stock deserves a 20-22 P/E multiple or higher. Therefore, we may not see a sustainable move below the $150-$160 range, limiting the downside in Apple's shares. Moreover, a significant dip will likely attract substantial dip buyers to Apple's stock, making it a strong buy if it goes lower on multiple contraction and growth fears. Where Apple's stock could be in the future Source: The Financial Prophet The most significant risk to Apple may be its valuation/growth dynamic. If Apple can't deliver growth, its stock may experience multiple expansion beyond my anticipated 20-22 forward P/E contraction. If Apple's P/E ratio drops back down into the teens, its stock price could experience a considerable repricing. While this scenario is unlikely, it is possible, and investors should consider it and other risks before investing in Apple's stock. Other risks include increased competition, geopolitical tensions, and macroeconomic factors. Are You Getting The Returns You Want? All-Weather Portfolio vs. The S&P 500 Don't Wait! Unlock Your Financial Prophet! Take advantage of the 2-week free trial and receive this limited-time 20% discount with your subscription. Sign up now and start beating the market for less than $1 a day! This article was written by Victor Dergunov is an independent investor and author with 20 years experience. He preaches diversification and shares investment ideas across all market sectors. Victor aims to help readers build portfolios that perform well in all economic conditions. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}