{
    "title": "Tim Cook requests help for his struggling small business",
    "date": "1/24/2024",
    "url": "https://miscellanynews.org/2024/01/24/uncategorized/tim-cook-requests-help-for-his-struggling-small-business/",
    "text": "Vassar College's student newspaper of record since 1866 By Benjamin Savel Posted on January 24, 2024 in Humor & Satire, Uncategorized On Dec. 26, 2023, Apple was banned from selling Apple Watches in the United States. Yet just one day later, the ban had been reversed. According to press reports, CEO Tim Cook reversed the ban by simply walking up to the court and saying, “Pretty please?!” An Apple spokeswoman confirmed to The Misc that the “pretty please” did, in fact, include a cherry on top. Tim Cook’s move reversed a ban that had been upheld by the Biden administration. In a statement, President Biden commented with a set of phrases he’s never uttered before: “We are facing an existential threat to our existence. Democracy is at stake. This is a battle for the soul of our nation.” Apple was expected to face severe losses if it could not sell its watches. “We’re just a small, family-owned business with only $500 billion laying around,” Apple spokesperson Munn E. Bags wrote. The company, which currently has assets greater than those of Italy, Russia and Brazil, was worried that it might only be able to make a $120 billion profit instead of a $120.5 billion profit this holiday season. According to The Washington Post, Apple has requested an even longer reprieve because the company might suffer “irreparable harm” if it can’t sell more watches. When asked about whether union workers might suffer irreparable harm after facing the company’s anti-union tactics, a spokesperson for the company said, “LA LA LA I CAN’T HEAR YOU.” Asked about Apple’s anti-union tactics, President Biden commented in a follow-up statement, “We are facing an existential threat to our existence. Democracy is at stake. This is a battle for the soul of our nation.” He again assured us he has never, ever said this before. The megacorporation indicated last week that it will use the extra $450 million in holiday sales to pay its factory workers a living wage. “Apple will provide them all a three-bedroom house, an extra $40,000 per year and free transportation,” senior vice president Redd D. Licious stated. “You didn’t really believe that, did you?” Licious added, and then proceeded to burst into a fit of maniacal laughter. Apple has also noted that customers would be devastated if they couldn’t try the new watches. “The watch now weighs 0.1 grams lighter than the previous version, and we added pretty much nothing else. How could anyone live without it?” President Biden, in a speech, offered some solemn parting words regarding the situation. “We are facing an existential threat to our existence,” he stated. “Democracy is at stake. This is a battle for the soul of our nation.” Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.   Δ CORRECTION POLICY:The Miscellany News will only accept corrections for any misquotes, misrepresentations or factual errors for an article within the semester it is printed. The Miscellany News is not responsible for the views presented within its Opinions pages. Staff editorials are the only articles that reflect the opinion of a two-thirds majority of the Editorial Board. "
}