{
    "title": "Microsoft may soon overtake Apple as world’s most valuable company",
    "date": "1/11/2024",
    "url": "https://www.indiatoday.in/business/story/microsoft-may-soon-overtake-apple-to-become-most-valuable-company-world-2487348-2024-01-11",
    "text": "Listen to Story Microsoft may soon surpass Apple as the world's most valuable company after a recent decline in Apple's stock, triggered by concerns over iPhone sales. Apple's shares have experienced a 4 per cent decrease in 2024, following a 48 per cent surge the previous year. In contrast, Microsoft has seen a 2 per cent increase this year, building on a substantial 57 per cent surge in 2023. On Wednesday, Apple's shares dipped by 0.4 per cent, while Microsoft's rose by 1.6 per cent, narrowing the gap between the two tech giants. Apple's current market value stands at $2.866 trillion, with Microsoft closely trailing at $2.837 trillion. Apple reached its peak market capitalisation at $3.081 trillion on December 14, while Microsoft achieved a high of $2.844 trillion on November 28. However, a 30 per cent drop in iPhone sales in China in the first week of 2024, as noted by Jefferies analysts, indicates growing competitive pressure from Huawei and other domestic rivals. Apple is gearing up to launch its Vision Pro mixed-reality headset on February 2 in the United States, marking its most significant product launch since the iPhone in 2007. Despite this, a UBS report estimates that Vision Pro sales will have a relatively small impact on Apple's earnings per share in 2024.Not the first time Microsoft has intermittently surpassed Apple as the most valuable company since 2018, notably in 2021 when concerns about supply chain shortages related to the Covid-19 pandemic affected Apple's stock price. Both tech stocks are currently considered relatively expensive in terms of their price-to-expected-earnings ratios. Apple is trading at a forward PE of 28, significantly above its 10-year average of 19, according to LSEG data. Microsoft is trading around 31 times forward earnings, exceeding its 10-year average of 24. In its most recent quarterly report in November, Apple provided a sales forecast for the holiday quarter that fell short of Wall Street expectations, primarily due to weak demand for iPads and wearables. Analysts anticipate Apple will post a modest revenue increase of 0.7 per cent to $117.9 billion for the December quarter, marking its first year-on-year revenue increase in four quarters. Apple is scheduled to report its results on February 1.Published By: Koustav DasPublished On: Jan 11, 2024Must Watch "
}