{
    "title": "‘Very concerning,’ says Elon Musk on new Apple App Store changes in EU",
    "date": "1/27/2024",
    "url": "https://www.businesstoday.in/technology/news/story/very-concerning-says-elon-musk-on-new-apple-app-store-changes-in-eu-415061-2024-01-27",
    "text": "Feedback Elon Musk, the owner of X, has weighed in on the ongoing debate surrounding Apple's App Store changes in the European Union (EU), expressing deep concerns. The discussion comes ahead of the implementation of the Digital Markets Act (DMA) in March. The billionaire entrepreneur's remarks came in response to a statement by Spotify CEO Daniel Ek on X, where Ek criticised Apple's DMA announcement as \"at best vague and misleading.\" In his response, Musk echoed Ek's sentiments, stating that the proposed changes are \"very concerning.\" However, he refrained from elaborating further on the matter. Very concerning Apple recently unveiled plans to implement changes to iOS, Safari, and the App Store within the European Union in compliance with the upcoming DMA regulations set to take effect in March. A significant development is the decision to permit third-party app stores on iOS devices for the first time, with the alterations set to be introduced alongside the rollout of iOS 17.4 next month. Nevertheless, the introduction of a new App Store tax has emerged as a contentious issue. Last August, Musk announced intentions to engage with Apple CEO Tim Cook to negotiate a reduction in the App Store Tax. In a statement, Musk outlined a revised policy, stating, \"While we had previously said that X would keep nothing for the first 12 months, then 10 per cent, we are amending that policy to X keeps nothing forever, until payout exceeds $100k, then 10 per cent. The first 12 months remain free for all.\" He further highlighted Apple's existing 30 per cent commission rate, indicating intentions to discuss adjustments with Cook to ensure creators receive maximum benefits. Also Read Apple embraces change: Sideloading, alternate app stores coming to iPhone thanks to the EU Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}