{
    "title": null,
    "date": "1/20/2024",
    "url": "https://seekingalpha.com/article/4663884-apple-faces-major-potential-risks",
    "text": " Nikada/iStock Unreleased via Getty Images Entering the year as the most valuable company on the planet, Apple (NASDAQ:AAPL) faces some large potential risks. The question is can the company get back to innovating to overcome these hurdles. AAPL designs hardware and software for its own brand of smartphones, computers, laptops, tablets, wearable devices, and accessories. Sales of iPhones made up over half its revenue in fiscal 2023. The company also generates Service revenue through its App store marketplace, cloud storage services, payment services, and advertising. Services accounted for about 22% of its FY23 revenue. The first big risk that AAPL faces is with its app store. Services has been the big bright spot for the company. Services revenue reached $85.2 billion in fiscal year 2023 (ended September), up 9%, while it recorded a quarterly record in its FQ4, with Services revenue of $22.3 billion, up 16%. The segment also carries much high gross margins of over 70% compared to 36.5% for its Products segment. Now AAPL Services has several components, including advertising, cloud storage services, and payment services. But a large portion of this revenue comes for its App store, where the company receives a 30% fee (15% for small developers) for every app and in-app purchase made on its platform. Earlier this month, AAPL updated its policy in response to a court decision that developers could use payment methods outside of AAPL. In response, the company will allow app developers to use additional payment methods, but said it would collect a 27% commission (12% for small developers) for use of its platform. While AAPL seems to have found a way to keep control of its app store commissions, this fight is likely far from over. Developers are not happy with the cut AAPL is getting and will likely continue to press the issue. The original lawsuit stems from Epic Games, the maker of Fortnite, but others such as Spotify (SPOT) have also voiced their displeasure. The fight is likely to spill over into Europe, and SPOT has urge EU and UK courts to prohibit these fees. Meanwhile, it appears the U.S. Department of Justice is planning a large anti-trust lawsuit against the iPhone maker. AAPL, meanwhile, also noted in court filings that collecting the commission fees could prove very difficult. Whether this is true or not is still to be seen. However, at the end of the day, a big chunk of AAPL’s app store revenue could be in jeopardy down the road. Legal cases are never easy to predict, and AAPL undoubtedly will have the best lawyers in the business. It can argue that it is no different than any other e-commerce market place, such as eBay (EBAY) or Etsy (ETSY), that takes a commission, although those two companies have much lower commissions than 27%. As such, I think there is a real risk that its App Store take rate may come down at some point. If the App store makes up half its Services revenue, a cut to a 20% take rate from 30% would be an over $4 billion hit to revenue and likely over $3 billion in profits. At the same time, Alphabet (GOOGL) is being pressured over the payments it makes to companies under its default search agreements. These agreements are currently being challenged by the Justice Department as being anti-competitive. So why does this matter to AAPL, because it was revealed that GOOGL pays AAPL 36% of its search revenue that comes from Safari. That appears to between $10-18 billion a year of very high margin revenue that could be lost if this practice is deemed anti-competitive. These risks come at a time when AAPL has seen its revenue decline for four straight quarters. For fiscal 2023, revenue fell -2.8% to $383.3 billion. It’s the third time AAPL has seen a yearly revenue decline in the past 10 years, with the company also seeing sales declines in FY16 and FY19. Given the risks AAPL is facing and the revenue declines it has seen, the company really needs to return to its innovative ways. Under now deceased founder and former CEO Steve Jobs, AAPL was at the forefront of innovation and elegant design. During his second tenure with the company, AAPL introduced the iPad, MacBook, iPhone, and iPad, while the iWatch was released shortly after he passed away. The biggest innovations since Tim Cook has taken over are iPods, AirTags, Apple making its own chips, and yearly incremental upgrades to the iPhone. That is why the company’s introduction of the Vision Pro is important. The mixed reality headset is one of the biggest innovations to come from AAPL since Tim Cook took over the company in 2011. The product has gotten pretty good reviews, and undoubtedly over time, the product will get better in later iterations. But at $3,500, this is a very expensive toy at the moment. The Vision Pro will likely do well with AAPL’s biggest fans and early adopters, although I wouldn’t expect it to be a mainstream success at current prices. Later generations at lower prices will be key for this to be a true success, but it is good to finally see AAPL innovating again. Another area AAPL will have the opportunity to innovate is with the upcoming hardware cycle to run AI-powered solutions. Users can’t run programs like Adobe (ADBE) Photoshop’s new generative AI features on older Macs, and as more apps and program incorporate AI, consumers will need more powerful smartphones and tablets as well. AAPL has tended to slow play its iPhone advancements each year, generally making smaller incremental changes. However, with AI upon us, it could have an opportunity to make some larger important upgrades that will drive sales across its hardware product lines. Samsung just launched its latest Galaxy smartphones, with a heavy emphasis on AI. AAPL currently trades at an EV/EBITDA multiple of 21.7x the FY24 (ending September) consensus of $132.3 billion. Based on FY25 EBITDA projections of $141.3 billion, it trades at a 20.4x multiple. On a P/E basis, the company trades at 24x the FY25 consensus of $6.59 and 20x the FY26 consensus of $7.13. Revenue is projected to grow nearly 4% in fiscal year 2024 and nearly 6% in FY2025. AAPL trades towards the high-end of large mega-cap tech stocks (growing under 15%), although its projected revenue growth is among the slowest. AAPL Valuation Vs Peers (FinBox) Given its modest growth and the risks it faces, I’d value the company between 13-16x FY26 EBITDA. That would be a range between $115-$145. AAPL stock has been a huge winner both the past decade and past five years. However, coming out of the pandemic, much of its gains have from multiple expansion. This was especially true in 2023, where it saw revenue and net income decline but its stock rise 54%. AAPL EBITDA Vs EV/EBITDA Multiple (FinBox) Meanwhile, the company faces some potential risks to two large high-margin revenue streams. I wouldn’t expect its app store and search default revenue to go away or be reduced soon, but there is a real possibility that they do get a haircut at some point. And while I think a hardware upgrade cycle and the Vision Pro could help in 2024, the stock’s valuation isn’t attractive given some of the potential risks the company faces. As such, I’m going to place a “Sell” rating on AAPL with a $145 target. I would become more constructive on the name as its legal battles get cleared up. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}