{
    "title": "Wizz, a Tinder-like app for teens, pulled from Apple and Google stores over \nsextortion concerns",
    "date": "1/31/2024",
    "url": "https://www.nbcnews.com/tech/social-media/wizz-tinder-app-aimed-teens-removed-apple-google-stores-rcna136607",
    "text": "Morning Rundown: Ohtani scandal comes at a pivotal moment for MLB, Gazans increasingly support a two-state solution, and rare disorder causes man to see ‘demonic’ faces  Profile Sections tv Featured More From NBC Follow NBC News There are no new alerts at this time Wizz, a social media app growing popular among teens in the U.S., was removed from the Apple app store and Google Play this week. Apple removed the app Tuesday after the National Center on Sexual Exploitation contacted the company with concerns about the alleged use of Wizz in sextortion scams, according to a series of emails reviewed by NBC News. In an email from an Apple representative in response to the center, a representative wrote, “We take App Store violations seriously and appreciate your outreach. The app has been removed from the Store and we are in touch with the developer.” In a public post Wednesday on X, the National Center on Sexual Exploitation thanked the stores for removing Wizz. Apple did not immediately respond to a request for comment. A Google spokesperson said that the Wizz app was suspended from Google Play, the online store for Android apps, on Tuesday. The spokesperson cited the company’s child endangerment policy that requires apps to “prohibit users from creating, uploading or distributing content that facilitates the exploitation or abuse of children.” A Wizz spokesperson said in an emailed statement that “Apple and Google are seeking more information on our app, and we are working closely with their teams to clarify our platform’s extensive safeguards for users. We hope to resolve this matter soon.” The Tinder-like Wizz app is owned by the French parent company and mobile publisher Voodoo, which was funded by Goldman Sachs, Tencent and GBL, among others. It allows users to set up and scroll through profiles that show a person’s photo, first name, age, state and zodiac sign. Wizz has marketed its platform as a “safe space” to make new friends and has allowed users as young as 13 to set up accounts and start connecting with other users in the same “age-gated” group. Concerns around Wizz have risen in recent months as child safety and technology research groups gathered more information about the increasingly popular app. At least two content creators pulled out this month from a Wizz-sponsored content creation house, where influencers gathered to make TikTok videos to promote the app. They cited concerns raised by child safety advocates about Wizz and sextortion, according to creators directly involved in the project who requested anonymity because they signed nondisparagement agreements. A Wizz spokesperson said that the recent house event in Miami was “a success” and showed “how our app helps create meaningful relationships between young people.” “All of the influencers who spent the week with us say they are excited to participate in Wizz House 2, and others have reached out saying they want to join,” the spokesperson said. The Wizz app has been used by people to find and connect with young users in “financial sextortion” scams, according to a recent study by the Network Contagion Research Institute, a nonprofit organization that studies the spread of extremism, hatred and crime online to help combat and prevent it. The FBI defines sextortion as “a crime that involves adults coercing kids and teens into sending explicit images online.” After the images are sent, the criminals threaten to widely publish or send the explicit photos or videos to the victims’ friends and family, unless the victims pay up repeatedly through a variety of peer-to-peer payment apps, gift cards and cryptocurrency transfers. Sextortion can be so devastating that victims died by suicide in at least 20 known cases in the U.S., according to the FBI. In its most recent study of rising sextortion levels in North America and Australia, the institute strongly criticized Wizz, along with Meta-owned Instagram, Snapchat and TikTok, for what it called an inadequate effort to protect minors and young adults online. “Some victims report being targeted by sextortion within minutes of joining the app, suggesting that criminals have saturated Wizz,” the study said, adding that researchers found frequent complaints to the Google Play Store and Apple App Store about Wizz, with users claiming the app was “serving pornographic ads to minors.” Adam Sohn, CEO of the Network Contagion Research Institute, said in an email that generally, “social media platforms struggle to adequately address” risks to underage users and “are at times financially incentivized to overlook them.” The research institute’s director of intelligence, Alex Goldenberg, said app stores can significantly impact the reach of social media platforms. “Wizz has something in the ballpark of 20 million active users,” he said. “But if the app store doesn’t continue to carry it, they cannot sustain, let alone grow, their user base.” Goldenberg said that he believes Wizz’s age verification system is not strong enough. “We’ve seen threat actors who can bypass age verification facial recognition by having their cousin or brother take a selfie, and then they will be off and running on the platform,” he said. “And it’s not just threat actors — if you’re under the age of 13, it’s very easy to have an older sibling have a photo taken, as well.” Wizz declined to say what steps it would take to try to get reinstated on the Apple App Store or Google Play. But it posted a “story” on Instagram with an emoji-laden message on a tie-dyed background that told users: “Hey there. Just wanted to drop in with a quick heads up. Wizz is currently taking a break from the app stores due to a technical hiccup. We’re working super hard to get everything sorted out and back to normal ASAP.” Ben Goggin is the deputy editor for technology at NBC News Digital. © 2024 NBC UNIVERSAL "
}