{
    "title": "Will Apple Open Up About AI? Shareholders Want Answers But iPhone Maker \nWarns Of Competition Risks",
    "date": "2/26/2024",
    "url": "https://www.tradingview.com/news/benzinga:2820cc545094b:0-will-apple-open-up-about-ai-shareholders-want-answers-but-iphone-maker-warns-of-competition-risks/",
    "text": "Apple Inc.'s AAPL annual shareholder meeting will be held on Wednesday, and the company's board has advised against voting in favor of the shareholder proposal pushing for transparency on artificial intelligence use. What Happened: According to Apple's SEC Filing, there are five shareholder proposals, all of which the Apple board advises voting against. These proposals cover a range of topics, from seeking transparency regarding AI usage, and gender pay gaps to privacy and human rights. As per the filing, the AFL-CIO Equity Index Funds are requesting that Cupertino compile a transparency report concerning the company’s usage of AI and disclose ethical frameworks governing its implementation. Concerns exist that unchecked employment of AI could result in discrimination, widespread job reductions, or the spread of misinformation. See Also: Apple Accuses Spotify Of Seeking ‘Limitless Access' To Tools For Free As $500M Fine Looms \"The adoption of AI technology into business raises a number of significant social policy issues. For example, the use of AI in human resources decisions may raise concerns about discrimination or bias against employees,\" the proposal read, adding, \"The use of AI to automate jobs may result in mass layoffs and the closing of entire facilities.\" However, Apple’s board recommends voting against the proposal, citing its overly broad scope, which may entail divulging strategic plans and initiatives detrimental to the company’s competitive stance. The board also asserted that it has already furnished resources and transparency concerning the use of AI and machine learning. \"The scope of the requested report is overly broad and could encompass disclosure of strategic plans and initiatives harmful to our competitive position,\" the board said. Why It's Important: The annual shareholder meeting serves as a forum for Apple and its shareholders to engage in discussions regarding the company’s operations and progress towards its objectives. The meeting on Wednesday will cover various topics such as CEO Tim Cook’s compensation and the election of new board members. There's another proposal — a vote to confirm the appointment of Ernst & Young as the company’s independent registered public accounting firm for 2024. All three management proposals, encompassing the election of board members and compensation matters, are endorsed for shareholders to cast their votes in favor. Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: US Supreme Court Just Saved Apple $503M After Putting An End To A 14-Year-Long Legal Battle Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @horibuful @tradingview @arakerbabian @ceoann.garcia_fx @price_action_guru @maurice.method @mytradingsetup @hofeex @neo_inversion @_dalton16 @trade_simple_fx @trading.is.mylife @carrrros @michaelbamber @mariodelpo @my_trading_floor @satoshi_empire @jordan_fx_ Whatever the trade "
}