{
    "title": "Alo Yoga debuts immersive shopping app for Apple Vision Pro",
    "date": "2/7/2024",
    "url": "https://finance.yahoo.com/news/alo-yoga-debuts-immersive-shopping-115800568.html",
    "text": "Alo Yoga on Friday launched an immersive shopping experience for Apple Vision Pro, the same day Apple’s new spatial computer headset was released, according to the press release. The “Alo Sanctuary” app was made in partnership with experiential e-commerce company Obsess and marketing consultancy Ave Advisory. The app offers a selection of immersive environments and spatial audio for meditation and allows users to shop from Alo Yoga’s entire collection in 3D. The brand said it plans to update its featured collections on the app seasonally. Each selected environment on the app comes with four styled mannequins shoppers can engage with and shop from. Alo Yoga is among the first few to host new shopping experiences on the new Apple Vision Pro, which features over 600 environments, according to the company. With the launch, Alo Yoga is offering complimentary meditation exercises from its subscription-based platform, Alo Moves. Users can choose from over 20 meditations in the experience with four to six options per environment. \"We are proud to partner with Obsess, and Ave Advisory to launch the first wellness-powered shopping app that our community can experience with Apple Vision Pro,\" Danny Harris, co-founder and co-CEO of Alo Yoga, said in a statement. \"This is a new, immersive way for a visionary brand like ours to share a mindful experience that transports consumers directly into our world through interaction designed for spatial computing.\" Alo Yoga’s new app features its Navy, Midnight Green, Espresso and Wild Berry collections that customers can interact with in various environments. Shoppers can bring products close in vision enough to see the weave and texture of an item as well as be able to differentiate between one kind of spandex over another, according to Neha Singh, CEO and founder of Obsess. As featured with the headset, Alo’s progressive environments let users manually adjust the level of how immersed they are within the space. Spatial audio cues allow users to adjust the volume on an experience depending on how \"close\" or \"far\" they are from where the sound originates. With Apple’s headset recently being released, brands have jumped to launch shopping apps on Apple’s visionOS spatial operating system. E.l.f. Cosmetics released a beauty shopping app for the Apple Vision Pro with guided meditations, paint-by-numbers and three environments based on E.l.f.’s “holy grail” products. Launching an app early on for Apple’s new immersive headset builds on Alo's existing virtual spaces. The company opened a virtual store in February last year in partnership with Obsess, which featured digital styling services, beauty and wellness tutorials, workout classes and more. And last March, the brand introduced a virtual collection of digital wearables to the metaverse. This story was originally published on Retail Dive. To receive daily news and insights, subscribe to our free daily Retail Dive newsletter. "
}