{
    "title": "Wedbush's Dan Ives Says Apple's Decision To Abandon EV Project Is 'The \nRight Move': '...Would Have Made This An ...",
    "date": "2/27/2024",
    "url": "https://www.tradingview.com/news/benzinga:641418b92094b:0-wedbush-s-dan-ives-says-apple-s-decision-to-abandon-ev-project-is-the-right-move-would-have-made-this-an-uphill-battle/",
    "text": "Apple Inc AAPL has reportedly decided to discontinue its electric vehicle (EV) project, codenamed Titan. This decision has been met with approval from a prominent analyst, who believes that the move is in the best interest of the company. What Happened: Wedbush analyst Dan Ives, on social media platform X, formerly known as Twitter, reacted to the news of Apple’s decision to halt its EV project. Ives, who is known for his insights into the tech industry, expressed his support for Apple’s move, citing the rapidly evolving EV landscape as a significant factor. Apple has cancelled its decade-long effort to build an EV. The writing was on the wall for Apple with a much different EV landscape forming that would have made this an uphill battle. Most of these Project Titan engineers now all focused on AI at Apple which is the right move🍎 See Also: Trump-Inspired MAGA Coin Shines, Bitcoin Advocate Predicts Market Crash, ‘Dogecoin Killer’ Shiba Inu’s Burn Rate Soars And More: Top Crypto Updates This Week Apple’s EV project, which has been in the works for over ten years, has now been officially abandoned, as per a report by Bloomberg. The company has informed nearly 2,000 employees working on the project about this decision. Many of these employees will be redirected to Apple’s generative AI division, with layoffs expected but the exact number of affected workers still unclear. Apple’s EV project has faced numerous setbacks, including delays and changes in leadership and strategy. Despite these challenges, the company had previously shifted its focus to a less ambitious EV design, similar to that of Tesla Inc. However, the project has now been completely scrapped. The decision to abandon the EV project was reportedly finalized by Apple’s top executives in response to ongoing pressure from the company’s board. Why It Matters: The decision to abandon the EV project has been met with mixed reactions. Renowned investment figure Ross Gerber expressed his relief at Apple’s decision, stating that the company had “missed their big opportunity to invest in Tesla.” On the other hand, Jim Cramer, the host of CNBC’s “Mad Money,” has suggested that Google’s parent company Alphabet Inc should streamline its business operations, following Apple’s example. Cramer believes that a more focused approach could potentially boost Alphabet’s stock performance. Read Next: Trump Said He Won’t Allow CBDCs, Now His Party Is Proposing A Bill To Halt The Introduction Of Such ‘Programmable Money’ Image Via Shutterstock Engineered by Benzinga Neuro, Edited by Kaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @horibuful @tradingview @arakerbabian @ceoann.garcia_fx @price_action_guru @maurice.method @mytradingsetup @hofeex @neo_inversion @_dalton16 @trade_simple_fx @trading.is.mylife @carrrros @michaelbamber @mariodelpo @my_trading_floor @satoshi_empire @jordan_fx_ Whatever the trade "
}