{
    "title": "Apple: Vision Pro Might Be A Long-Term Catalyst (NASDAQ:AAPL)",
    "date": "2/21/2024",
    "url": "https://seekingalpha.com/article/4672083-apple-vision-pro-might-be-a-long-term-catalyst",
    "text": "Justin Sullivan/Getty Images News  Justin Sullivan/Getty Images News I rate Apple (NASDAQ:AAPL) as a buy as the company has the opportunity to build new growth avenues with the Apple Vision Pro. I believe most of the reactions to the product are positive, and the wide range of applications might make the Vision Pro a true game changer in the near future. In this article, I will make an effort to think about the possible applications of the Vision Pro in different fields to help you think about the potential growth avenues that might be built with this device. Then, I will make an approximation of Apple's intrinsic value, including the sales projections of the Vision Pro in the next few years, taking into account the expectations of some analysts. My focus on this article will be the Vision Pro, but if you want to know more details about the strategy that should be taken with Apple stock, I suggest reading an article that I wrote last year in which I explored Apple's competitive advantages and discussed why this stock is the most special among the FAAMNGs. My \"buy\" rating here is based on a long-term horizon for the next 5 years at least. People might think that the Vision Pro headsets were developed not so long ago, but that is so far from the truth. In 2007, when Steve Jobs was Apple's CEO, one of the patents submitted by Apple for patent review was \"Automatically Adjusting Media Display in a Personal Display System,\" which was accepted by the Patent Office. This head-mounted display (HMD) patent was granted to Apple before any other AR/VR device. Steve Jobs was aware of the concept, but he was more focused on the iPhone's launch for the first time in 2007. Then, in 2017, Apple introduced ARkit, which was a new framework to embed augmented reality technology with iOS 11. This technology enabled developers to produce experiences of augmented reality to be offered through applications on the iPhone or iPad. Then ARkit 2 through 6 were introduced for iOS 12 through 16 at the 2018 and 2022 Worldwide Developers Conferences, respectively. In this way, Apple was advancing gradually in the development of the Vision Pro, which was launched in February 2024. I was watching several YouTube channels with over a million subscribers who were totally impressed by how ingenious the new Apple's device was. What impressed me was that most of these people are fans of technology and had already tested the latest Meta (META) headsets, so that indicated to me that the Vision Pro has the power to impress even the most sophisticated fan. When you use Vision Pro, the screens project an image that is ahead of us, but it's not just a transparent glass through which we can see our surroundings. It turns out to be a virtualization of reality where we are, so Vision Pro's cameras collect an exterior image, which is processed by the M2 processor, the same as iMACs, and R1, which is a specific chip that collects all the information from the images, then processes them in high dynamic range (HDR) while projecting them on two 4K screens, each of which has micro-OLED technology with an incredible pixel density. The device has five sensors to track the movements of the user, six microphones, and 12 cameras that reproduce the surrounding environment. It is probably the most expensive component of the Vision Pro, and what separates it from other competitors is its cameras and screens. As such, Vision Pro enables the user to be immersed not in the metaverse but in the real world, where the experiences could be substantially improved, not only in gaming, where there is a huge world to explore, but also in other areas. In the last call for the Q1 2024 results, CEO Tim Cook said that the Vision Pro included 5,000 patents in the device, which were built on several innovations developed over many years; for instance, the hand tracking and the room mapping are driven by AI. In addition, the Vision Pro is starting with 1 million apps, with 600 of them specifically developed for the device, as Tim Cook pointed out: Vision Pro, it's -- when you look at the ton of use cases, I mean, we're starting with a million apps and 600 plus that are -- have been designed particularly for Vision Pro. When I look at what is coming out of Enterprise, it's some of the most innovative things I've seen come out of Enterprise in a long time. And so, I think there's a like there is for the Mac and iPad, and of course, iPhone has been in enterprise since the early days of iPhone. I think there's a nice opportunity there for Vision Pro as well. When I looked at several videos on YouTube about the Vision Pro review, I noticed that there were very interesting applications. I saw one in which you have a Formula 1 car in front of you and, then, you can take each part of that car to assess it properly with so many details about that part. This can work perfectly for those who are studying engineering to breakdown each part of an engine to understand it more easily and dynamically. I saw another app where the competition of Formula 1 can be watched from the air, giving a wider perspective of the different cars in competition in real time. In this sense, we might see different possibilities for the Vision Pro in the future. Architecture might be a field where the Vision Pro could add value; imagine an architect using the glasses to see how a specific design of a house or infrastructure might fit in a specific place using this combination of virtual reality and reality. An interior designer could use the device to portrait the insides of a house or a building while making changes in certain aspects. These kinds of things are already made with software in the construction sector, but it's another level to do so in virtual reality. Maybe companies like Autodesk (ADSK), Ansys (ANSS), or Nemetschek that offer software for the construction sector could develop apps or integrations that enable Vision Pro to connect with their construction software while improving the experience of designers. Flight simulations could be another field where the Vision Pro could add value since future pilots could have an immersive experience as if they were in a real situation where they might polish their skills faster with higher effectiveness. The other situation is more related to virtual travel, where travel agencies could offer a wide range of experiences in certain places, offering the chance for a person to have that experience himself, feeling as if he were in that place. There are lots of ways in which the Vision Pro could be used, and I feel the Vision Pro has surprised consumers, which is a very good sign to anticipate some projections about future sales and how important they will become for Apple's total revenues. Statista Statista The chart above shows a projection until the year 2028, but I will be even more conservative in my projections and include Vision Pro as part of my intrinsic value. I think that the Vision Pro has a lot of prospects, even when some think that the product is expensive and that its prospects are limited. Apple's strategy seems sound as it's just the start; consumers are using and exploring the different apps available on the device. Despite setting a high price for the Vision Pro, Apple has not prevented consumers from buying the device. The Apple Stores contribute enormously to introducing the experience to consumers, unlike any other company that sells these devices. It's expected that the new versions of the Vision Pro might be offered at lower prices while adding improvements; that might be a strong emotional trigger to convince new buyers to buy a cheaper and better device. I think that setting a high price for the first version is an \"emotional strategy\" to capture more consumers in future versions to deliver faster growth. On the other hand, we should not forget that the integration of the Vision Pro with other Apple devices is another factor that might convince more consumers, as the Vision Pro could be integrated with the iMac, iPad, AirPods, and iPhone while performing different tasks at the same time; for instance, while editing videos, a user could expand the Mac's screen in front of him using the Vision Pro. According to different multiples, we can see that Apple seems fairly valued: Seeking Alpha Seeking Alpha In the table above, we can see that most of the multiples indicate that the stock is fairly valued or expensive; for instance, the P/E in its different forms shows that Apple is fairly valued compared to the sector. However, a limitation of this ratio is that it's assumed that Apple and its comparables have the same quality, which is not necessarily the case. On the other hand, the PEG ratio is a multiple that calls the attention of \"growth\" investors, and it indicates that Apple is more expensive than its comparables. The main problem is that the ratio is not incorporating the growth opportunities associated with Vision Pro prospects. Furthermore, I do not use every multiple of valuation that takes the sales as a denominator, such as EV/Sales or Price/Sales, particularly if we are assessing a high-quality company like Apple; the reason is that these multiples do not consider the net income or the FCF, which are way more important metrics to gauge the real performance of a high-quality company. So the fact that Apple is more expensive than its comparables using these ratios does not tell me that much. The ratios that I consider the most important ones are graded C or C+, such as P/E, EV/EBIT, and P/Cash Flow, so according to these ratios, Apple is mostly fairly valued; the P/Cash Flow (FWD), which is a very important ratio in my view, is graded B+, which indicates even a reasonable price. Considering that Apple has a very consistent generation of free cash flows each year, I would have expected that this multiple would be way more expensive than its comparables. In my view, we need a method that incorporates Vision Pro's growth prospects and the share buyback's impact on Apple's valuation, which is a very important factor that is mostly overlooked. As such, I propose a DCF model that will include both important factors to get a better approximation of Apple's intrinsic value. In this sense, I will use Vision Pro's assumptions made by BofA Securities analyst Wamsi Mohan and UBS analyst David Vogt. This is a first approach without considering the Vision Pro and share buybacks' effect: Author Author To find the perpetuity, we used the formula: Perpetuity = FCF 2027/(discounted rate - g). where g = FCF growth in perpetuity, which was assumed to be 9% annual. The FCFs are calculated by multiplying the revenues projected by the FCF margins assumed at 26%; in this way, I get the FCFs estimated for the next few years. With perpetuity, we calculate the present value of all the FCFs beyond 2026. Then, we calculate the enterprise value using the following: Enterprise Value = Present Value of FCF (from 2024 to 2026) + Perpetuity + Cash - Total Debt. Finally, the intrinsic value is calculated by taking the enterprise value and dividing it by the outstanding number of shares. In this way, we could get $175.19 per share as an intrinsic value under the assumptions presented. To this intrinsic value, I will need to include the value that will be generated by Vision Pro and the share buyback' effect. To include the Vision Pro's impact, I will include a present value of all the free cash flow that might be generated by the Vision Pro's sales in the next few years. So, I will need the assumptions made by Wamsi Mohan and UBS analyst David Vogt about the sales forecast of the Vision Pro and other assumptions: Author Author I am assuming that Apple will reduce the price of the Vision Pro in the next few years, so I could make a forecast according to all these assumptions: Author Author The different colors in my projections of the revenues indicate the different prices per unit assumed for the Vision Pro for those periods. Notice that I consider the shipments of 7,8 million units for 2028, whereas the Statista chart shown above projects 12,6 million units for 2028. To find the perpetuity, we used the formula: Perpetuity = FCF 2032/(discounted rate - g) where g = FCF growth in perpetuity, which was assumed to be 6% annual. So I follow the same process as the previous calculation of the intrinsic value, calculating first the FCF generated by multiplying the revenues by the FCF margins of 20% in each year projected. Taking the present value of the perpetuity, which is the FCF generated beyond 2031, and the present value of all the FCF generated from 2024 to 2031, I added both groups to have a total present value of 294,587 million for the Vision Pro. So, I added this number to the enterprise value previously calculated, which boosted the previous intrinsic value from $175.19 to $194.38 per share: Author Author Now, I will need to somehow include the share buyback's impact in the intrinsic value, as it's a very important policy used by Apple each year. That impact will need to be included in the intrinsic value of $194.38 per share. I think that share buybacks are a very important policy that Apple frequently uses to deliver long-term value. Most analysts do not incorporate this important policy in their assessments of the stock, which I consider a big mistake as Apple uses an average of 80% of its FCF each year. To do this, I need to see the evolution of Apple's outstanding number of shares in the last few years: Author Author Before the 4-to-1 split in 2020, the rate of reduction of the number of shares through the share buyback policy was between -4 and -7% annually. After the split, that rate declined to -3.3% average over the last 3 years, so that's the rate that I will take to project the outstanding number of shares for the next few years: Author Author So, I make a projection of the outstanding number of shares until 2027, in which that number of shares is declining by 3.3% each year. Then, the model assumes that the number of outstanding shares in 2027 will be the same beyond 2027. That's a limitation since Apple will likely keep doing repurchases beyond 2027; nevertheless, that restriction in our model will make our calculation more conservative. As such, I add the enterprise value calculated first, where I got $175.19, then I add Vision Pro's projected present value of the FCFs, getting $194.38, and finally, I divide all of this by the outstanding number of shares projected in the year 2027, getting $212.98 per share. Of course, the intrinsic value could be boosted if the revenue growth of the current businesses is higher than my conservative assumptions; remember that I am assuming a revenue growth for Apple, considering the iPhone, iMac, iPad, accessories, and services—not counting the Vision Pro—of 1% for 2024, 2% for 2025, and 3% annual for the years beyond 2025. If Apple grows at 5% annual in the next few years in those segments, the intrinsic value could reach $233 per share while keeping my conservative assumptions about the Vision Pro. If I keep the very conservative revenue growth assumptions of the older Apple products and if the Vision Pro shows higher growth rates than expected, for instance, rather than 40% of annual sales growth, Apple reaches 50% annual sales growth, I could get $221 per share. One risk is if the Vision Pro does not grow as expected because there are other devices that capture more market share or attract more consumers, or if the device ends up not appealing with a large demand. Both scenarios could impact my assumptions and the calculation of the intrinsic value in my model. Nevertheless, Apple has been working on this device for many years since 2007, showing advanced technology ahead of any competitor with a clear strategy of offering very innovative solutions, applications, and experiences. It is really hard to believe that they do not catch the attention of many consumers, particularly those who are fans of technology. In addition, it's likely that, in the next few years, Apple will reduce the price of the Vision Pro while offering an even better product, which could trigger an \"emotion\" among consumers to buy the product. You should remember that Apple has 2.2 billion active devices worldwide, which is a metric that is growing year by year, so that's another hidden catalyst for the Vision Pro, as it would be expected that a growing proportion of all those active devices would be this new glasses as more consumers would be keen to integrate the Vision Pro as part of Apple's ecosystem. Another risk is when an investor buy Apple stock now expecting a short-term return. I believe the company's strategy is designed to reward long-term shareholders, so that's an important factor to consider if you are considering adding Apple stock to your portfolio. Tim Cook seems to believe in having a long view if any investor wants to buy Apple shares, since a long horizon would enable your shares to capture that value thanks to excellent management execution and strong competitive advantages. Probably another risk is the market cannibalization of the Vision Pro with other Apple's products, such as the Mac, iPad, or even the iPhone, which could reduce the revenue growth of those products. Nevertheless, I think that Apple has anticipated that scenario to make the Vision Pro a part of Apple's ecosystem in which each product can complement rather than substitute each other. As such, even when a certain degree of market cannibalization is possible, I do not think that the Vision Pro is designed to replace any of the main Apple's products. Apple Vision Pro is a very good opportunity for Apple to build up new growth avenues in different fields that would enrich the immersive experience of the users to a level never reached before. The strategy of setting an expensive price for the first version of the Vision Pro is a sound long-term strategy, as it's expected that Apple will make gradual improvements to the product with a better design, lower weight, more technology, and more advanced chips at a lower price. I trust in the management's execution to further develop the product, so I can make decent projections for the next few years that enable me to calculate a very achievable intrinsic value under very conservative assumptions. I would say that it's a buy for investors who are already holding Apple, but a more moderate buy for new investors who have never bought an Apple share before. New investors would need to be aware that Apple delivers more value in the long term than in the short term, so their horizon is an important factor to consider. We should never forget that the lower the price, the higher the long-term returns for our investment, particularly if we are talking about Apple. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of AAPL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}