{
    "title": "British inventor seeks to take $18bn bite out of Apple in bitter patent war",
    "date": "1/21/2024",
    "url": "https://www.theguardian.com/technology/2024/jan/21/british-inventor-seeks-to-take-18bn-bite-out-of-apple-in-bitter-patent-war",
    "text": "Patrick Racz is in a long-running patent fight with the tech company over claims it stole his filesharing and payment system for iTunes As a plumbing tycoon, Patrick Racz was used to enduring a deluge. But circumstances led to a very different kind of drenching, sitting in his local park in the rain contemplating the demise of his business during the dotcom crash. “I lost everything. I had young children. I was embarrassed, upset that I’d let my family down. I couldn’t look them in the face,” he recalls. His nadir came just before the emergence of a patent battle with Apple that would define his life. Nearly two decades on, he remains at loggerheads with the company and the US courts. He presents an intriguing figure: a credible, established British inventor who first gained wealth and success in the 1980s, but clearly bruised and angry after years of a David v Goliath dogfight that now dominates his online reputation and leaves onlookers questioning whether Racz or Apple is in the right. Racz was the man behind the Triflow – the world’s first three-way mixer tap. The system took a typical sink mixer and added a extra waterway and valve to supply filtered water alongside hot and cold. A “multimillion-pound” sale in 1998 locked in his gains after expanding the business to sell in 45 countries. However, he says his second chapter turned sour as his dotcom-era venture – a filesharing and payment tech company – was usurped by Apple’s iTunes store. He claims the US corporation stole his system. “I went through a period of deep depression,” Racz says, opening up on the emotional toll for the first time. “I’m ashamed to say I hit the bottle. I was totally lost in a haze of time and I couldn’t remember a lot.” What gave him a “new lease of life” was patents for the tech that were first lodged in 1999 and granted nearly a decade later, teeing up a huge court battle that is still playing out as he targets $18bn in damages. Apple is no stranger to fighting such patent disputes: a standoff with medical technology company Masimo led to sales of Apple’s Series 9 and Ultra 2 smartwatches being paused in the US before Christmas. Racz has won some of his rounds in court against the company, but there is no guarantee of ultimate victory for either side. The only certainty is that the road ahead will be long, winding and costly. Racz grew up on a strawberry farm in Jersey and spent his early career in sales. When he sold his tap business, Avilion, he pursued the digital download market, just as Napster upended the music industry with illegal filesharing. Racz quickly filed for patents for his anti-piracy alternative Smartflash, and accompanying systems to allow payments and secure downloads. He lined up deals with retailers and manufacturers, including Gemplus, a French sim card company. Pop star Britney Spears signed up as a brand ambassador. But in the fallout from 9/11 and the dotcom crash, Spears and Gemplus pulled out, and Racz says in court that Gemplus – also a partner to Apple – then claimed the product as its own. His blood boiled as he saw late Apple boss Steve Jobs “soak up the praise” for a series of products marrying hardware and software in the way Racz claims he first devised, starting with iTunes in 2003. After receiving patent approval in 2008, he scored an unlikely victory – landing $533m in damages in 2015 after suing Apple in Texas. It was one of the biggest jury awards to a private inventor, Racz says. But the court’s decision was later unwound: first hurt by a ruling by the US Patent Trial and Appeal Board that his patents were invalid, and then losing as Apple appealed in the commercial courts. He has since lost his own appeals, but has vowed to fight on. He has faced a sizeable backlash online among Apple supporters in recent years, which even included death threats, emailed by unknown individuals. “Those things start to sting – when you’re told that your kids should be burned at the stake and that you should be beheaded for what you’re doing. My kid was being bullied – with kids saying: ‘Your dad say he invented this, he didn’t he stole it, Apple invented it. Your dad’s a liar,’” Racz says over coffee in London. Tall, burly and with a short crop of dark hair, he is visibly still riled as he retells his story. Racz’s latest tussle is with the US Patent Office, which he is suing for refusal to disclose uncensored emails and documents related to his intellectual property. He is attempting to prove that panels of judges were intentionally stacked with ex-lawyers and close supporters of Apple. Racz argues the company has used its “wealth and power” to influence the US patent system. Approached for comment, Apple pointed to a previous statement, issued in 2015, which said: “Smartflash makes no products, has no employees, creates no jobs, has no US presence, and is exploiting our patent system to seek royalties for technology Apple invented. “We refused to pay off this company for the ideas our employees spent years innovating and unfortunately we have been left with no choice but to take this fight up through the court system.” Gemplus did not respond to a request for comment. Away from his legal pursuits, he is a backer of Regent Sounds, a musical instrument shop in central London’s Denmark Street once used by the Rolling Stones as a studio and which engaged in its own tussle with the landlord behind the huge development by media venture Outernet. His main mission remains telling his story. He’s written Smartflash, an autobiography, and says he has interest from publishers. His friend Simon Morris, the ex-global chief creative officer at Amazon and the man behind Amazon Prime Video, has signed up to sell the rights to a documentary about Racz’s life and is pitching the project to studios. Meanwhile, Racz remains focused on his legal campaign, which is backed by private investors who would share in any winnings. “They say what doesn’t kill you makes you stronger – it’s made me even more determined.” "
}