{
    "title": "Apple Plans New Fees and Restrictions for Downloads Outside App Store | Mint",
    "date": "1/24/2024",
    "url": "https://www.livemint.com/technology/apple-plans-new-fees-and-restrictions-for-downloads-outside-app-store-11706094496440.html",
    "text": "Apple is planning to add new fees and restrictions when it begins allowing third-party software downloads outside its App Store in response to a new European law intended to tear down its closed iPhone app ecosystem. The company’s plan, which would only apply in Europe, will allow users to download software onto the iPhone for the first time without using the App Store. The new policies set up a test of the legislation and how it will be enforced as Apple faces challenges from courts, regulators and software makers globally about its tight control of third-party software. Meta Platforms, Spotify and other companies are preparing new download options for customers in anticipation of the new rules. Meta is considering a system that would allow people to download apps directly from Facebook ads. Spotify plans to offer users the ability to download some of its iPhone apps directly from its website, according to the company. Microsoft has weighed a launch of its own third-party app store for games in the past. Apple has defended its policy of controlling downloads via the App Store, saying it is necessary for keeping the iPhone safe and relatively free from viruses. Critics have called Apple’s system anticompetitive, saying it collects unnecessarily high commissions and unfairly competes with Apple’s own apps. Apple’s approach to the EU law will help ensure the company maintains close oversight of apps downloaded outside the App Store, a process known as sideloading. The company will give itself the ability to review each app downloaded outside of its App Store. Apple also plans to collect fees from developers that offer downloads outside of the App Store, said people familiar with the company’s plans. The company hasn’t yet announced its plans and they could change. The restrictions and fees could renew tensions with app developers, some of whom had expected the new law to allow them to deliver their apps to users free of Apple’s restrictions or what they see as a high commission. The new European law “is a regulation with teeth, with the possibility to apply fines and with a possibility for the commission to have powers of investigation,\" said Olivia Regnier, a senior director of European policy at Spotify. Earlier this month, developers including Spotify and Fortnite-maker Epic Games criticized new policies Apple unveiled to allow third-party payment systems in keeping with a U.S. federal court ruling. Apple’s response to the new EU rules marks another potential battleground in the company’s intercontinental war to maintain control over third-party software and the outsize profits that come with it. Apple’s operating margin on the App Store is between 70% and 80%, estimated Martin Yang, an analyst at investment firm Oppenheimer. Apple has been working on its solution for more than a year now to meet the March deadline for complying with the EU law, the people said. In 2022, the European Union passed the Digital Markets Act with the intention of reining in the alleged anticompetitive practices of technology companies. One of the issues the law sought to address was Apple’s strict control over how software is downloaded onto iPhones through its App Store. The DMA also applies to Google, and its Android mobile operating system will have to comply with several of its provisions. Unlike Apple’s iOS devices, however, Android phones allow users to install apps outside the Google Play store, likely making them already compliant with that element of the law. Officials from the European Commission, the EU’s executive body, have been holding meetings in recent months with Apple and other tech companies to discuss the new rules. Apple hasn’t provided a final package describing its solution to the commission or tested its plans with market participants. Once it does, the commission will review the full package to look at whether it will make the market more open and contestable, and whether the company’s plans meet all the individual provisions of the law, according to a person familiar with its plans. The legislation has some requirements that are clear-cut and other rules that leave room for interpretation, antitrust lawyers said. One provision in the law says app stores that are covered by the act are expected to have conditions that are fair, reasonable and nondiscriminatory. Last week, Apple was obligated to follow through with a court order related to Fortnite-maker Epic Games’s antitrust case against the company. The order requires the company to let developers direct their app users to payment systems other than Apple’s. Apple has said it plans to give developers an option to offer an alternative payment system to users and will charge a 27% commission on such payments. Apple typically places a 30% commission on developers for payments for many services made through Apple’s payment system. That 27% commission would likely dissuade most developers from offering alternate payments, app makers said. During a Bay Area trip earlier this month, Europe’s top antitrust official, Margrethe Vestager, met with Apple Chief Executive Tim Cook at the company’s headquarters, where the two spoke about Apple’s compliance with the requirement to allow the distribution of apps outside of the App Store. Speaking to reporters in San Francisco, Vestager said she expects all companies will comply with the March deadline, but Europe “also stands absolutely ready to do noncompliance cases.\" Tech players like Meta and Microsoft have been hoping to take advantage of any opening Apple will make in Europe. Microsoft has previously tried to launch a cloud-based game subscription service but was shut down because Apple wouldn’t support the offering of multiple games through a single app, Microsoft said in 2020. Meta has a yearslong effort, called Project Neon, that would allow smartphone users to download apps they find through ads on Facebook directly from the social media app, according to people familiar with the matter. Meta in 2020 also tried to launch an iOS app that would allow users to play various games, but Apple rejected the submission until Meta stripped the app of any gameplay functionality. “We’ve always been interested in helping developers distribute their apps, and new options would add more competition in this space,\" a Meta spokesman said in a statement. “Developers deserve more ways to easily get their apps to the people that want them.\" On Wednesday, streaming company Spotify announced its plans in Europe to start communicating directly with app users about subscription offerings and deals, to make it possible for users to purchase audiobooks directly and to allow downloads of some apps from its website. Write to Aaron Tilley at aaron.tilley@wsj.com, Salvador Rodriguez at salvador.rodriguez@wsj.com, Sam Schechner at Sam.Schechner@wsj.com and Kim Mackrael at kim.mackrael@wsj.com Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}