{
    "title": "Apple stock looks expensive vs. the rest of the 'Magnificent Seven'",
    "date": "1/13/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240113125/apple-stock-looks-expensive-vs-the-rest-of-the-magnificent-seven",
    "text": "By Therese Poletti Tech giant's slowing growth doesn't justify its high stock price Apple Inc.'s stock had a very good run in 2023, but it is starting 2024 with looming issues that make it look expensive for investors. To begin, Apple (AAPL) has morphed into a slow-growth company, failing to increase year-over-year revenue in each of its past four reported quarters. The company is heavily reliant on its iPhone business, but innovation on the device has stagnated, making consumers less likely to upgrade their devices in a rockier economic climate. All the while, Apple shares carry a high valuation, especially compared with some faster-growing technology peers. Apple saw its shares soar about 48% during 2023. At the same time, its quarterly revenue fell between 0.7% and 5.5% across the last four quarters it reported. Wall Street analysts see only a marginally better picture for the all-important December quarter, forecasting overall sales growth below 1%. The latest batch of iPhones hasn't been the same sort of momentum driver as with past models. While Apple didn't pack too many new features into the most recent iPhone lineup, the company also faces stiffer competition in the smartphone market as big Chinese rival Huawei Technologies Inc. has upped its game after spending years hampered by U.S. sanctions. China's government is also trying to help domestic brands better compete. Furthermore, Apple is dealing with a legal challenge around its newest Apple Watch, which would be small potatoes compared to a sweeping antitrust case that the New York Times recently reported may be in the works by the U.S. Department of Justice. Given that backdrop, is Apple stock really deserving of a comparable - or even higher - valuation than Big Tech peers with better growth profiles? Apple's stock is currently trading at 27 times the consensus calendar 2024 earnings-per-share estimate among analysts polled by FactSet. (This article uses calendar years for all estimates, because some companies, including Apple, have fiscal years that don't match the calendar.) Alphabet Inc.'s Class A shares (GOOGL) are trading at a P/E ratio of about 20 times the consensus calendar 2024 estimate, while Meta Platforms Inc. (META) trades at about 20 times its consensus 2024 EPS estimate. Here is a list of the \"Magnificent Seven\" stocks that led last year's rally for the S&P 500 SPX, sorted by marker capitalization and including expected compound annual growth rates through calendar 2025, based on consensus estimates among analysts polled by FactSet. Estimates for the full S&P 500 are at the bottom of the table. Apple is expected to grow its earnings at an annual pace of 8.2% over the next two years, while increasing its annual sales at a compound annual growth rate (CAGR) of 5%. Analysts expect much higher growth rates for EPS and sales for Alphabet and Meta, and those stocks trade at much lower P/E valuations than Apple does. Even the S&P 500 is expected to increase EPS and sales more quickly than Apple through 2025. The benchmark U.S. index trades at 19.3 times weighted aggregate consensus EPS estimates for 2024 - much lower than Apple's P/E of 27. \"The P/E multiple on Apple has basically doubled over the last five years, and increased by 50% in 2023,\" wrote Barclays analyst Tim Long, in a downgrade note this week. He added that Apple's current valuation has reached a high-water mark. Long was one of two Wall Street analysts who called attention to Apple's diminished growth prospects in the first trading week of the new year. He cut his rating to underweight and lowered estimates for the March quarter, citing incrementally weak iPhone 15 data out of China and muted enthusiasm for the forthcoming iPhone 16. \"We believe the continued period of weak results coupled with multiple expansion is not sustainable,\" Long wrote. \"We also believe 2024 will bring more services risk to light.\" Apple's services business increased at a 9% rate in fiscal 2023 (which ended Sept. 30), but Long is expecting services growth to grow 10% in fiscal 2024, and then slow to 8% in fiscal 2025. Services has been a big bright spot of consistent growth for Apple in the last few years. Another analyst, Gil Luria of DA Davidson, picked up coverage of Apple shares last week with an neutral rating and a price target of $166, noting that he believed the \"current share price reflects expectations for significant resumption of growth, which is less likely without an innovation breakthrough.\" Read more here: Apple's stock needs to get \"unstuck\" and its innovation rut may not be helping. Apple needs a new growth engine in the form of a new product or landmark service. Clearly, Apple needs a new growth engine in the form of a new product or landmark service. The company's $3,499 Vision Pro mixed-reality headset will be available in U.S. stores and online Feb. 2, with pre-orders starting Jan. 19, but it is an expensive product in a market that has yet to really take off. Apple doesn't comment on unannounced products and keeps close guard over any secret projects it may have under development. So investors will be in the dark for a while, until other new product plans are unveiled. That is part of the mystique of the company, but it is also a bane for long-term investors. The company is of course dealing with the law of large numbers: As its revenue number hits greater heights, Apple will have a tougher time posting the sort of double-digit growth it last did in fiscal 2018 and in the Covid-19 pandemic boom year of fiscal 2021, with an anomaly of 33.2% growth. The low, single-digit growth analysts now forecast for Apple seems hardly worthy of its stock's current multiple. Apple still has plenty of defenders. Wedbush Securities analyst Dan Ives recently pounded the table for the stock, saying the \"'growth demise story' of Apple being spun by bears is a dynamic we have seen constantly over the past decade and this is just another chapter in that book.\" Ives says that with 240 million iPhones ripe for upgrades, both the iPhone and services, by his estimates, are poised to reaccelerate in fiscal 2024, and now is a \"golden opportunity to own Apple for the next year.\" This is an existential question that investors must ask right now. The additional pressure of a potential U.S. Justice Department case looking into how Apple exerts control to lock in users adds more uncertainty. Investors will have to decide for themselves if Apple has dramatically better growth ahead of it. If not, the stock's paltry but reliable dividend and its stock buybacks may not be enough to satiate Wall Street. Philip van Doorn contributed to this article. -Therese Poletti This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 01-13-24 0552ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}