{
    "title": "China claims it cracked Apple's AirDrop encryption to identify senders and \nmonitor 'inappropriate speech'",
    "date": "1/10/2024",
    "url": "https://africa.businessinsider.com/military-and-defense/china-claims-it-cracked-apples-airdrop-encryption-to-identify-senders-and-monitor/m2cbyn2",
    "text": "Business Insider Edition Chinese officials claim a Beijing company has cracked Apple's AirDrop encryption, a development that could enable police to trace dissidents who've used the app to spread anti-government messages. The company Wangshendongjian Technology was able to identify users by hacking encrypted device logs, according to China's Justice Bureau. The information was used by police to trace people using AirDrop to send what the filing described as \"inappropriate speech.\" It was also used to investigate the use of the app for \"malicious purposes\" like sending \"illegal pictures, videos, audio andillegally delivering and spreading bad information to nearby people in crowded places such as subways, buses and shopping malls.\" According to the release, police were able to correlate data on the phones the information was sent to with phone numbers and other data from the sender's device. Business Insider has contacted Apple for comment on whether its encryption systems have been compromised. AirDrop is a tool that allows Apple devices to share information and images wirelessly with other Apple devices nearby. The Justice Bureau did not specify the nature of the messages that sparked the investigation. CNN reported that AirDrop is sometimes used to send spam messages on Beijing subway to strangers — but it's also been used by dissidents and protesters. According to reports, Hong Kong protesters have used AirDrop to send information critical of the government to strangers anonymously. Vice News reported that the tool was used to share information in 2022 during a rare wave of protests in mainland China against Chinese leader Xi Jinping and the government's COVID-19 policies. The Chinese government has control over the internet, and closely surveils online spaces for government critics. Under pressure from Chinese authorities, Apple in 2022 introduced a new feature limiting the number of times users in China could receive information through AirDrop from people who were not on their contacts list, reports at the time said. Thanks for signing up for our daily insight on the African economy. We bring you daily editor picks from the best Business Insider news content so you can stay updated on the latest topics and conversations on the African market, leaders, careers and lifestyle.  Also join us across all of our other channels - we love to be connected! © 2024 africa.businessinsider.com "
}