{
    "title": "Apple overtakes Samsung in global smartphone shipments across 2023",
    "date": "1/16/2024",
    "url": "https://appleinsider.com/articles/24/01/16/apple-overtakes-samsung-in-global-smartphone-shipments-across-2023",
    "text": "Copyright © 2024, Quiller Media, Inc. Contact Us | Privacy Policy iPhone 15 Pro Max Preliminary data shows Apple has overtaken Samsung with the top global smartphone shipments for 2023, plus it's the only top three company with positive growth in the year.\r  Samsung sells dozens of smartphones ranging from budget models to premium $2,000 foldables. This variety and price range is what has given Samsung the number one market share annually since 2010, until now.\rAccording to data from the IDC, Apple has overtaken Samsung as the number one company based on market share of global smartphone shipments across 2023. Apple has a 20.1% market share for the year versus 19.4% for Samsung.\rAmong the top three —  Apple, Samsung, and Xiaomi —  Apple is the only company to grow shipments year-over-year. It increased shipments from 226.3 million units to 234.6 million units.\r\"While we saw some strong growth from low-end Android players like Transsion and Xiaomi in the second half of 2023, stemming from rapid growth in emerging markets, the biggest winner is clearly Apple,\" said Nabila Popal, research director with IDC's Worldwide Tracker team. \"Not only is Apple the only player in the Top 3 to show positive growth annually, but also bags the number 1 spot annually for the first time ever.\"\rDiversification within Android smartphone shipments also contributed to Samsung losing the top position. Smartphone makers like Huawei, Honor, and OnePlus have competitive devices in lower price ranges.\r Top 5 smartphone global shipments and market share 2023 vs 2022. Source: IDC The smartphone market declined by 3.2% to 1.17 billion units shipped in 2023. However, growth in the second half of 2023 shows promise for a market recovery in 2024.\rApple's iPhone 15 lineup launched in September 2023, but most of the year was dominated by iPhone 14 sales. Despite taking the top spot in terms of market share in 2023, Apple's overall revenue has declined every quarter of 2023. Samsung sells dozens of smartphones ranging from budget models to premium $2,000 foldables. This variety and price range is what has given Samsung the number one market share annually since 2010, until now. According to data from the IDC, Apple has overtaken Samsung as the number one company based on market share of global smartphone shipments across 2023. Apple has a 20.1% market share for the year versus 19.4% for Samsung. Among the top three —  Apple, Samsung, and Xiaomi —  Apple is the only company to grow shipments year-over-year. It increased shipments from 226.3 million units to 234.6 million units. \"While we saw some strong growth from low-end Android players like Transsion and Xiaomi in the second half of 2023, stemming from rapid growth in emerging markets, the biggest winner is clearly Apple,\" said Nabila Popal, research director with IDC's Worldwide Tracker team. \"Not only is Apple the only player in the Top 3 to show positive growth annually, but also bags the number 1 spot annually for the first time ever.\" Diversification within Android smartphone shipments also contributed to Samsung losing the top position. Smartphone makers like Huawei, Honor, and OnePlus have competitive devices in lower price ranges. The smartphone market declined by 3.2% to 1.17 billion units shipped in 2023. However, growth in the second half of 2023 shows promise for a market recovery in 2024. Apple's iPhone 15 lineup launched in September 2023, but most of the year was dominated by iPhone 14 sales. Despite taking the top spot in terms of market share in 2023, Apple's overall revenue has declined every quarter of 2023. Wesley Hilliard served ten years as a Nuclear Power Electrician in the US Navy, then jumped careers in 2019. Today, he is Assistant Editor, Podcast Cohost, SEO Specialist, and Social Media Manager for AppleInsider. Wow. That’s hugely impressive. Especially considering any iPhone is a premium, high end unit. Wow. That’s hugely impressive. Especially considering any iPhone is a premium, high end unit. I predict that this number will keep on growing.Android has too much of a negative annotation at this point, to sell in the premium space.However, if Google actually plays their cards right the Pixel should be able to keep on increasing in market share and dethrone Samsung eventually, at least in the premium space. The Pixel software is the only thing that comes close to iOS in optimisation and fluidity.Also, the market has repeatedly shown that it cares as much about brand value as tech features. Samsung making cheap devices dilutes that brand value. Few people (unless they are tech nerds) are going to buy Samsung devices when they are able to afford premium products. I predict that this number will keep on growing.Android has too much of a negative annotation at this point, to sell in the premium space.However, if Google actually plays their cards right the Pixel should be able to keep on increasing in market share and dethrone Samsung eventually, at least in the premium space. The Pixel software is the only thing that comes close to iOS in optimisation and fluidity.Also, the market has repeatedly shown that it cares as much about brand value as tech features. Samsung making cheap devices dilutes that brand value. Few people (unless they are tech nerds) are going to buy Samsung devices when they are able to afford premium products. One question though, can this be utilised by courts when Apple argues that they are not a monopoly? One question though, can this be utilised by courts when Apple argues that they are not a monopoly? tech_traveller said:\nOne question though, can this be utilised by courts when Apple argues that they are not a monopoly?\n\r\nIf you noticed in new edition of MONOPOLY game the sewing fingertip protector is back.  ;) If you noticed in new edition of MONOPOLY game the sewing fingertip protector is back.  ;) Monopoly typically implies over 50% market share. So 20% is less than 50%.  The difference is that Apple gets a larger share of profits associated with the premium cellphones as they do not make the cheaper models. Monopoly typically implies over 50% market share. So 20% is less than 50%.  The difference is that Apple gets a larger share of profits associated with the premium cellphones as they do not make the cheaper models. If you're tired of dealing with volume that is either too loud or too quiet, here's how to increase the volume level on a Mac by a quarter of what you normally can just by using a simple keyboard shortcut. Samsung's preorder deals are often aggressive, and their TV offer is no different. To celebrate the launch of the 2024 TV and audio lineup, Samsung is throwing in a free 65-inch TV with a qualifying preorder. Back by popular demand, OWC's 14-port Thunderbolt Dock for MacBooks is discounted to $99.99, matching the lowest price on record. But the month-end deal is valid for a limited time only. If you've been on the fence or haven't tried Apple's MLS Season Pass, now's a good time to try, as new subscribers can access a one-month free trial for a limited time. The Department of Justice's massive antitrust lawsuit against Apple is based on old information. Merrick Garland and company are going to lose big if they rely on arguments where practically every point made is no longer true. Apple has released iOS 17.4.1 and iPadOS 17.4.1 to the public, at the same time as bringing visionOS up to 1.1.1 while also slipping out iOS 16.7.7. A new vulnerability in Apple Silicon chips can allow a determined attacker to access a user's data by stealing the cryptographic keys — and a fix could considerably impact encryption performance. A fresh price cut on AirPods Pro 2 with USB-C is in effect at Amazon on day 2 of its Spring Sale 2024. Grab the lowest price on record while supplies last. The Department of Justice's massive antitrust lawsuit against Apple is based on old information. Merrick Garland and company are going to lose big if they rely on arguments where practically every point made is no longer true. After years of complaints by competitors, and an equally-long investigation, the long-rumored antitrust suit against Apple has finally been filed by the US Department of Justice — and it is going after nearly every part of the company. Gamers can now play Call of Duty: Warzone Mobile' on iPhone and iPad, with the major first-person-shooter title available to download from the App Store.  "
}