{
    "title": "Wall Street slumps to start 2024; Apple, Nvidia and Meta take big hits",
    "date": "1/2/2024",
    "url": "https://www.cbsnews.com/sanfrancisco/news/stock-market-wall-street-slumps-first-trading-day-of-2024-apple-nvidia-meta/",
    "text": "Watch CBS News January 2, 2024 / 5:59 PM PST\n          / AP A weak start to 2024 had Wall Street on Tuesday giving back a bit of its powerful gains from the year before. The S&P 500 slipped 27.00 points, or 0.6%, to 4,742.83 after coming into the year at the brink of its all-time high. The Dow Jones Industrial Average edged up 25.50, or 0.1%, to 37,715.04, and the Nasdaq composite led the market lower with a drop of 245.41, or 1.6%, to 14,765.94. Some of the market's sharper drops came from stocks that were last year's biggest winners. Apple lost 3.6% for its worst day in nearly five months, and Nvidia and Meta Platforms both fell more than 2%. Tesla, another member of the \"Magnificent 7\" Big Tech stocks that drove well over half of Wall Street's returns last year, swung between losses and gains after reporting its deliveries and production for the end of 2024. It ended the day down by less than 0.1%. Netherlands-based ASML sank after the Dutch government partially revoked a license to ship some products to customers in China. The United States has been pushing for restrictions on exports of chip technology to China. ASML's U.S.-listed shares fell 5.3%, and U.S. chip stocks also weakened. Health care stocks held up better after Wall Street analysts upgraded ratings on a few, including a 13.1% jump for Moderna. Amgen's 3.3% gain and UnitedHealth Group's 2.4% climb were two of the strongest forces lifting the Dow. Much of Wall Street had been preparing for at least a pause in the big rally that carried the S&P 500 to nine straight winning weeks and within 0.6% of its record set almost exactly two years ago. That big surge came on hopes the Federal Reserve may have engineered a perfect escape from high inflation: one where high interest rates slow the economy enough to cool inflation but not so much that they cause a painful recession. Now, the hope is that the Fed will shift sharply in 2024 and cut interest rates several times. Cuts can relax the pressure on the economy and boost prices for investments. But even though such hopes are high, it's still not assured. And prices for stocks and bonds have already rallied hard on expectations for them. At Deutsche Bank, the main expectation among economists is for the Federal Reserve to cut its main interest rate by 1.75 percentage points this year, from its current range of 5.25% to 5.50%. That's a shade more than the majority of traders on Wall Street are betting. But the Deutsche Bank economists led by Matthew Luzzetti also expect a mild recession to weaken the job market more than the Federal Reserve and much of Wall Street expect. That's partially because the Deutsche Bank economists expect the Fed to \"be adamant to not repeat the mistakes of the 1970s, namely avoiding cutting rates prematurely.\" That would give more time for the rate hikes already instituted by the Fed to fully work their way through the system and grind down the economy. The Fed's main interest rate is at its highest level in decades, up from virtually zero two years ago. A report on Tuesday showed that the U.S. manufacturing industry may be weaker than thought. It contracted by more last month than an earlier, preliminary reading indicated, according to S&P Global, as new sales dropped because of weakness both abroad and at home. Business confidence, though, did pick up to a three-month high. A separate report showed that growth in construction spending slowed by a touch more in November than economists expected. Like stocks, Treasury yields in the bond market also regressed a bit on Tuesday following their big moves since autumn. The yield on the 10-year Treasury rose to 3.94% from 3.87% late Friday. More high-profile reports on the economy will arrive later this week. On Wednesday, the Federal Reserve will release the minutes from its last policy meeting, one that sparked hopes for a series of rate cuts coming this year. Another report on Wednesday will show how many job openings U.S. employers were advertising at the end of November, data that the Federal Reserve follows closely. Friday will bring the U.S. government's monthly tally of job growth across the country. In stock markets abroad, indexes fell 1.5% in Hong Kong and 0.4% in Shanghai amid worries about the Chinese manufacturing and property sectors. South Korea's Kospi gained 0.5%, and indexes were mixed across much of Europe. Japan's markets were closed for a holiday. First published on January 2, 2024 / 7:00 PM PST © 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. ©2024 CBS Broadcasting Inc. All Rights Reserved. "
}