{
    "title": "Apple factor to boost telcos’ RCS business messaging revenues – report",
    "date": "1/5/2024",
    "url": "https://www.telecomtv.com/content/digital-platforms-services/apple-factor-to-boost-telcos-rcs-business-messaging-revenues-report-49316/",
    "text": "Jan 5, 2024 Telco revenues from rich communication services (RCS) business messaging are set to soar by more than 500% over the next two years to be worth $8bn in 2025, up from the $1.3bn estimated for 2023, according to a new forecast from Juniper Research. The main driver for this rise is Apple’s decision, announced in November 2023, to start supporting RCS on its iOS device operating system in “late 2024”. Its support for the messaging platform is expected to swell the number of active RCS users by 900 million from 1.2 billion this year to 2.1 billion worldwide by 2025. That much larger user base will boost the value proposition of RCS business messaging (RBM) among enterprises and, as a result, encourage more mobile operators to add support for RCS messaging on their network platforms so they are able to deliver RCS-enabled messages and tap a new source of revenues (something the mobile operator community desperately needs). According to the Juniper Research forecast, RCS is set to become “a key technology” for operators in the business messaging ecosystem, especially now that the traditional SMS business messaging sector is experiencing growing levels of fraudulent activity: The RCS specifications include support for end-to-end encryption, something that SMS doesn’t support. As the volume of SMS business messaging traffic decreases, support for RCS will enable telcos to retain business messaging traffic over telecoms networks – a prerequisite to combat the growing competition of over-the-top (OTT) business messaging channels (such as Meta’s WhatsApp, Instagram and Messenger, WeChat and Google Business Messages). “For the first time, the value of SMS is being questioned by enterprises. Operators must act quickly if SMS fraud and high prices cannot be resolved,” noted research author Molly Gatford. She added that Apple’s introduction of RCS in iOS devices will raise the profile of the technology, which used to struggle to obtain sufficient support and might even result in RCS becoming “a substitute for SMS business messaging traffic.” That might take a while, though: The Juniper Research team notes that for the global application-to-person (A2P) sector, the SMS user base will be about 9.3 billion this year, the OTT user base will total about 4.1 billion and the RCS user base will reach 1.2 billion. The research firm also estimates that the value of business/A2P SMS messaging to telcos this year will be $57.5bn, the value of RBM to telcos will be $2.5bn, and the negative impact on telco revenues of OTT business messaging service growth will be $381m (see chart, below). Source: Juniper Research, Global A2P Messaging Market 2024-2028 - Yanitsa Boyadzhieva, Deputy Editor, TelecomTV Mar 22, 2024 Mar 21, 2024 Mar 21, 2024 Mar 21, 2024 Mar 20, 2024 Sign up to receive TelecomTV's top news and videos, plus exclusive subscriber-only content direct to your inbox. TelecomTV is produced by the team at Decisive Media. © Decisive Media Limited 2024. All rights reserved. All brands and products are the trademarks of their respective holder(s). "
}