{
    "title": "Apple Gains 50% Of US Smart Phone Revenue",
    "date": "2/3/2024",
    "url": "https://247wallst.com/consumer-electronics/2024/02/03/apple-gains-50-of-us-smart-phone-revenue/",
    "text": "Go into a Verizon (NYSE: VZ) or AT&T (NYSE: T) store—smartphones from Samsung, Google Kyrocera, and Motorola. And the list is longer. Among all of these, half of the US smartphone revenue market share goes to Apple (NASDAQ: AAPL). The data comes from Counterpoint. Commenting on Apple’s performance in 2023, Research Director Jeff Fieldhack noted, “Apple displaced Samsung as the biggest player in shipments for the first time in a full year. Apple does not break out iPhone sales by geography, but there are hints in its new earnings about why it does so well in the US. Apple’s most recent quarter was the first time Apple’s top line had increased in a year. Revenue rose 2% to $119.6 billion. EPS jumped 16% to $2.18. Apple’s number of active devices used around the world hit 2.2 billion. Apple’s America’s revenue, mostly the US, rose from $49.3 billion to $50.4 billion. iPhone revenue worldwide $65.8 billion to $69.7 billion. Anyone worried about iPhone 15 sales was wrong. Revenue from the balance of Apple’s hardware was mediocre. Only “Services” posted a strong gain, up from $20.8 billion to $23.1 billion. Counterpoint did point out one area of concern. Apple’s revenue share is not at the level in China that it is in the US. China is highly competitive with several local companies like oppo, which have a double-digit market share of their own. Apple ships more phones in China than any other company. The stock market shrugged off Apple’s earnings. The stock dropped less than 1%. It is approximately flat year to date. If Apple’s numbers, including its US market share, don’t impact the share price, what will? Some people think they should still short Apple’s stock. Robinhood set out to democratize investing to individuals, and it’s not slowing down. The app makes it possible to buy and sell stocks, mutual funds, trade options, and even cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH). With FDIC insurance ,an award winning design, and benefits like IRAs and more, Robinhood could be your path to a richer tomorrow. Sign up today — click here to start your journey. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}