{
    "title": "Apple ejects out of autonomous car market, to cut hundreds of employees",
    "date": "2/29/2024",
    "url": "https://mugglehead.com/apple-ejects-out-of-autonomous-car-market-and-cuts-hundreds-of-employees/",
    "text": "Hi, what are you looking for? The company will shift some remaining employees to its generative AI projects By Published Apple Inc. (NASDAQ: AAPL) is getting out of the autonomous car business, which will likely result in cutting hundreds of employees. Apple’s chief operating officer Jeff Williams and the vice president in charge of the project, Kevin Lynch, announced the news to the team on Tuesday in a short 12-minute meeting without taking questions. While this person described the announcement as abrupt, they clarified that the decision was not, citing the constantly shifting priorities. Major automakers are reevaluating their investments in electric vehicles and facing increased scrutiny on autonomous vehicle projects, prompting the decision to kill the project. Apple’s entry into the automotive sector was also seen as a potential boost to its bottom line, providing a new revenue source to strengthen against stagnating hardware sales and regulatory threats to its services business. The company will shift some remaining employees to its generative AI projects, according to Bloomberg. Others will have 90 days to find reassignments to other roles within the company, or end up on the employment line. One employee, who requested anonymity , disclosed that around 1,400 employees were still working on the car project. Apple initiated its car project internally dubbed “Project Titan” in 2014 with approximately 5,000 dedicated workers. Over the last decade, Apple repeatedly pivoted between emphasizing the creation of an all-electric Tesla Inc. (NASDAQ: TSLA) competitor and developing a fully autonomous vehicle similar to Waymo’s. The project’s leadership faced pressure from Apple’s top executives and board to speed the process of bringing a product to market, and they were unable. Read more: Apple engineer sentenced for stealing self-driving car tech Read more: European Union approves regulatory act for artificial intelligence Throughout the years, Project Titan saw a revolving door of high-profile automotive executives. The project was once led by former Tesla executive Doug Field, who eventually departed to join Ford. Apple also recruited executives from Lamborghini and Ford. In 2021, Apple hired Ulrich Kranz, a former BMW executive who played a key role in the i3 program, from EV startup Canoo. Apple even engaged in discussions with Canoo as it scouted the market for contract manufacturing partners, intellectual property, and talent. This exploration also involved talks with Hyundai and Kia. Apple has been exploring other opportunities beyond the iPhone and computers, such as its recently launched Vision Pro virtual reality headset. “It is preliminarily suggested that shipments of generative AI smartphones will exceed 100 million units in 2024,” its senior analyst, Ivan Lam, said. Demand for EVs has slowed in recent months due to high borrowing costs, intensifying competition among major players striving to attract customers. In recent months, US motor industry giants Ford Motor Company (NYSE: F) and General Motors Company (NYSE: GM) have postponed plans to expand EV production. Last week, electric truck maker Rivian Automotive Inc. (NASDAQ: RIVN) announced a 10 per cent reduction in its workforce and stated that it did not anticipate any growth in its production this year. In January, Tesla cautioned that its sales growth would be weaker this year compared to 2023. Led by multi-billionaire Elon Musk, the company has been lowering prices in key markets worldwide, including Europe and China, in response to tough competition from Chinese rivals like BYD. . Follow Mugglehead on Twitter Like Mugglehead on Facebook Follow Joseph Morton on Twitter joseph@mugglehead.com  Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Mercedes and Apptronik are actively exploring potential use cases for the robots doing tasks such as delivering and inspecting parts Empowering businesses with efficient supply chain solutions DarwinAI quietly absorbed into Apple's fold as the tech giant gears up for major AI expansion These technologies provide twenty-first century solutions to twentieth century problems society hasn't solved Mugglehead Media Corp. © 2022 "
}