{
    "title": "Risky business: Europe opens the iPhone",
    "date": "2/12/2024",
    "url": "https://www.laptopmag.com/phones/risky-business-europe-opens-the-iphone",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Apple's battle with the EU may be just the start The European Union’s Digital Markets Act (DMA), which targets so-called “gatekeepers,” aims to make it easier for consumers to switch among such platform-specific features as browsers, media players, messaging apps, and app stores. Despite being squarely targeted by the legislation, Apple responded to it before it took effect, making changes to iOS, Safari, and the App Store to comply. It marked the second major capitulation the company has made to EU legislation. Last year, after arguing against rules that would have it ditch its Lightning connector for USB-C, Apple finally made the switch in the iPhone 15. While it may have done so reluctantly, it did so globally and in ways that benefited its overall platform portfolio. These included standardizing connectors across its major computing platforms, gaining access to a broader range of peripherals, and enabling faster data transfer speeds. With Lightning originally debuting over a decade ago on the iPhone 5, the legislation likely did little more than slightly speed up what Apple was planning to do anyway.  But while Apple may have viewed the USB-C switch as a mixed bag, its recent press release leaves no doubt that it was not happy about the changes it made to comply with the DMA. Chief among these is its stated concerns about privacy and security, one of Apple’s tentpole messaging points versus Android. Apple’s press release cites “risks” in the context of privacy and security 11 times, addressing what the company has done to mitigate them and can’t do to eliminate them. Yes, more parties involved in offering alternate browsers or alternate app stores could result in more risks. In complying with the DMA, Apple loses some control over containing risks. Other parties’ tolerance may not match the level of Apple, the ultimate steward of the iPhone experience. The key questions are about the degree of risk increment and what benefits may be gained from it. In addition to Apple’s mitigations, app stores are likely to be offered by companies such as Microsoft and Epic Games, companies to which millions of customers already trust their data.  Perhaps one day, the U.S. will implement a comparable law to the DMA and Apple will need to extend the kinds of changes it has implemented stateside. In confining its changes to Europe, though, Apple has set up a global experiment in which the U.S. and other countries act as a control against which to test its objections about the dangers of the DMA. The coming years will determine whether Apple’s warnings about risk prophetically align with an increased incidence or severity of security and privacy breaches on its platforms. But, particularly given that Google will likely have to further open Android in response to similar legislation (or litigation), iOS is bound to stay ahead when it comes to such compromises. Apple might consider any such weakening a loss for its customers, but it would still retain a competitive advantage. Get our in-depth reviews, helpful tips, great deals, and the biggest news stories delivered to your inbox. Ross Rubin is the founder and principal analyst at Reticle Research. Ross has been an industry analyst focusing on innovation in the technology, media and telecom markets for over 20 years. Prior to founding Reticle Research, he was executive director and principal analyst at The NPD Group, where he provided analysis on a wide range of technology topics and led research spanning devices, access and content. You can follow him on X and Threads @rossrubin. Unlocked Google Pixel 8 phone dips to just under $500 for Amazon's Big Spring Sale Apple may sidestep ChatGPT to work with OpenAI rival Google Gemini AMD's new Dx12 gaming feature drastically boosts frame rates — what it means for gamers By Shubham Agarwal9 March 2024 By Momo Tabari9 March 2024 By Rael Hornby7 March 2024 By Rami Tabari5 March 2024 By Madeline Ricchiuto3 March 2024 By Shubham Agarwal3 March 2024 By Momo Tabari3 March 2024 By Stevie Bonifield2 March 2024 By Mark Anthony Ramirez2 March 2024 By Rael Hornby1 March 2024 By Shubham Agarwal29 February 2024 Laptop Mag is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}