{
    "title": "Analyst Who Coined 'Magnificent 7' Label Declares End Of An Era: 'I Don't \nSee These Seven Names Rising To",
    "date": "2/25/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37304905/analyst-who-coined-magnificent-7-label-declares-end-of-an-era-i-dont-see-these-seven-names-risin",
    "text": "The era of the Magnificent Seven in the stock market, a term coined for a group of mega-cap giants, might be coming to an end, according to an analyst who popularized the label. What Happened: The “Magnificent Seven” stocks, which include Apple Inc AAPL, Meta Platforms Inc META, NVIDIA Corporation NVDA, Tesla Inc TSLA, Amazon.com Inc AMZN, and Microsoft Corp MSFT, have seen their fortunes diverge this year, reported Business Insider. Mike O’Rourke, the chief market strategist at Jones Trading, who is credited with coining the term, suggested in a note titled “R.I.P the Magnificent Seven Era” that the group’s dominance over the stock market is waning. The Magnificent Seven, which contributed to 88% of the year-to-date gains in April, now accounts for 45% of the S&P 500’s gains, a significant drop. “This big rising tide of seven names lift[ing] all boats in the stock market, is what I see ending,” O’Rourke said. “I don’t see these seven names rising together.” O’Rourke highlighted the diverging trajectories of the Magnificent Seven, with companies like Nvidia experiencing a 66% surge in stock value, while Tesla’s stock has dropped 22% amid concerns about electric vehicle demand. See Also: Trump-Inspired MAGA Coin Skyrockets 20% To Outshine Dogecoin, Shiba Inu After Ex-President Softens Bitcoin Stance One of the key reasons for the divergence is the increasing importance of artificial intelligence (AI) in the market. Companies like Nvidia and Meta are seen as major players in the AI trade, while others like Tesla are still primarily associated with their core businesses. Dan Niles of the Satori Fund suggested reducing the portfolio to include only Nvidia, Meta, Amazon, and Microsoft, also known as the “Fantastic Four.” Why It Matters: The Magnificent Seven stocks have been a significant force in the market, as highlighted by Goldman Sachs’ Hedge Fund Trend Monitor, which showed that six out of the 10 largest holdings in over 700 aggregated hedge fund portfolios are increasingly concentrated towards these stocks. This enthusiasm does not mirror their market weight, with the Magnificent Seven accounting for a record 13% of the aggregate hedge fund long portfolios, significantly underweight compared to a 26% collective stake in the Russell 3000. The Magnificent Seven stocks have also been a central topic during the recent earnings season, with Jim Cramer commending Nvidia for its record revenue and Amazon for its growing advertising and web services sector. Meanwhile, Broadcom has emerged as a potential replacement for Tesla in the Magnificent Seven, with its shares rallying 10% as Tesla’s shares slumped 22% into 2024. Read Next: Donald Trump’s Mar-a-Lago Co-Defendant Carlos De Oliveira Requests Dismissal Of Charges In Classified Document Case: Report Image Via Shutterstock Engineered by Benzinga Neuro, Edited by \nKaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}