{
    "title": null,
    "date": "2/22/2024",
    "url": "https://www.sportsbusinessjournal.com/SB-Blogs/SBJ-Power-Up/2024/02/22.aspx",
    "text": " In this week's SBJ Tech newsletter, we take a look at the work being done by Parity to connect brands with women athletes, provide a sneak peek into our upcoming Apple Vision Pro deep dive and more. You can read that here. -- Ethan Joyce In today's edition of Power Up: Apple has released a new sports app called Apple Sports. The app, which officially launched Wednesday, is a free live score and stats hub for iPhone users in the U.S., Canada and the U.K.\n\nApple Sports features two separate scoreboard feeds, My Leagues and My Teams, for users to personalize, allowing them to toggle between current-day view, as well as previous and future matchups. The app will start by offering scores for MLS, NBA, NHL, NCAA basketball (both men’s and women’s), English Premier League and a handful of other European soccer leagues. The offerings will expand to MLB, NFL, NWSL, WNBA and college football as those seasons start later this year. ESPN has onboarded Meta as the fourth member of its Edge Innovation Center, SBJ's Joe Lemire reports, with a primary goal of developing ESPN-branded virtual reality experiences for Meta Quest. The first activation is the inclusion of immersive VR highlights in the free Xtadium app, with 180-degree video capture. College football and basketball clips will be included as well as shoulder programming from studio shows, interviews, the ESPYs red carpet and more. Later this summer, ESPN will unveil its own space in Meta’s Horizon Worlds.\n\nESPN previously produced VR content for the original Meta-owned Oculus VR headset. The first three members of the ESPN Edge Innovation Center, which was founded in Sept. 2021, are Accenture, Microsoft and Verizon. Evolv Express was used to secure the NBA Crossover event at the Indiana Convention Center last weekend during the NBA All-Star festivities in Indianapolis, SBJ's Bret McCormick reports. The NBA is proving to be the last major league/sport hurdle for Evolv, owing in part to NBA arenas' courtside seating, which puts fans closer to players than any other league and thus elicits more caution from the league. But the NBA is now essentially willing to hear proposals from its teams about incorporating Evolv Express into their venues’ security layer. Evolv has seen a 566% increase in new sports venue and team customers in the last two years and is playing a central role in MLB’s Go-Ahead Entry biometrics trial, which started last year at Citizens Bank Park in Philadelphia and is expanding this year to the Astros and MinuteMaid Park. Send your feedback: I can be reached at ejoyce@sportsbusinessjournal.com Was this email forwarded to you? Subscribe for free here. Register for a free SBJ account to unlock one extra article per month.  © 2024 Leaders Group. All rights reserved.The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Leaders Group. © 2024 Leaders Group. All rights reserved. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Leaders Group. Already a subscriber? Click below to sign in. Upgrade your subscription to get all the news you need: Adding SBJ weekly content will give you the comprehensive view of sports business with: Already a subscriber? Click below to sign in. Upgrade your subscription to get all the news you need: Adding SBJ daily content will give you the comprehensive view of sports business with: "
}