{
    "title": "Apple’s India Revenue Rose Nearly 42% to ‘USD 8.7 Billion’, iPhone \nShipments Grew About 39% to ‘9.2",
    "date": "2/23/2024",
    "url": "https://www.latestly.com/technology/apples-india-revenue-rose-nearly-42-to-usd-8-7-billion-iphone-shipments-grew-about-39-to-9-2-million-units-in-2023-report-5778862.html",
    "text": "New Delhi, February 23: Apple's revenue in India rose nearly 42 per cent (on-year) last year to $8.7 billion, foreign brokerage Morgan Stanley said in a report on Friday. According to the report, iPhone shipments grew about 39 per cent to 9.2 million units last year. “In CY23, India represented 4 per cent of iPhones shipments and revenue, up from 3 per cent in CY22 and 1 per cent 5 years ago,” said analysts in the report. “If India continues to grow at the same trajectory while China iPhone shipments stay flat, India would be a bigger iPhone market than China by 2027,” it added. TechCrunch was first to report on Apple India’s 2023 revenue. Razorpay Surpasses ‘USD 150’ Billion in TPV, Unveils New Payment Gateway ‘Payment Gateway 3.0’ and AI Chatbot. Apple registered strong double-digit growth in the December quarter in India, reaching another quarter revenue record in the country, company’s CEO Tim Cook said earlier this month. Responding to an analyst's questions, Cook said that the India market “hit a quarter revenue record”. India’s smartphone shipments remained flat in 2023 at 152 million units, but Apple reached the 10-million-unit mark in shipments and captured the top position in revenue in a calendar year for the first time. Nokia and Indian Institute of Science Partner To Help Realise Prime Minister Narendra Modi’s Vision for India as Leader in 6G Technology. In a bid to further boost mobile manufacturing in the country, the government in January slashed import duty on parts used for manufacturing of mobile phones to 10 per cent from 15 per cent. The move will help companies like Apple to manufacture more of its high-end premium smartphones in the country. (The above story first appeared on LatestLY on Feb 23, 2024 04:39 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com). Copyright © Latestly.com All Rights Reserved. "
}