{
    "title": "Apple invested more than 10 billion dollars in the creation of an electric \ncar, but never released it - Yu News",
    "date": "3/1/2024",
    "url": "https://newsyou.info/en/2024/03/apple-vklala-ponad-10-mlrd-dolariv-u-stvorennya-elektromobilya-ale-tak-i-ne-vipustila-jogo",
    "text": "The American company Apple closed its project to create its own electric car. Over 10 years, the technology giant has invested more than $10 billion in this project. According to The New York Times, a number of Apple employees who worked on the project were happy to see it shut down. The fact is that the project existed for a very long time, and during this time Apple repeatedly changed its goals, management and work processes.   About 2000 people worked on the project in total, and it was one of the first Apple projects to involve such a large number of people from other structures. Among them were former NASA employees and people from Porsche. According to experts, the team has achieved certain successes during the 10 years of the project's existence. For example, it has developed a windshield that can display step-by-step instructions and a sunroof made of a special polymer to reduce solar heat. We will remind you that the demand for electric cars in Ukraine tripled in January. Passenger cars made up the bulk of electric vehicles registered for the month.   When copying materials from website pages for online publications, a direct hyperlink open to search engines is mandatory. The link must be placed regardless of the full or partial use of the materials. The administration of the Newsyou.info Site (Editor-in-Chief, editors, authors of materials) makes every effort to provide users with accurate and reliable information, but at the same time does not reject the possibility of errors. Some links on this Site lead to resources that are located on third-party sites. These links are placed for the convenience of users and do not mean that the Site Administration approves the content of other sites. In addition, the Site Administration bears no responsibility for the availability of these resources and their content. This statement applies to all links presented on the Site and to the material of all websites accessible through banners and links. The advertiser is solely responsible for the advertisement placed on the Site. The site administration is not responsible for the content and authenticity of advertising materials posted on our site, as well as possible damage from their use. "
}