{
    "title": "Netflix snubs streaming rival Apple by not launching app for Vision Pro",
    "date": "1/18/2024",
    "url": "https://www.businessinsider.com/netflix-snubs-apple-by-not-launching-app-for-vision-pro-2024-1",
    "text": "       The Apple Vision Pro is nearly here — but it won't have the Netflix app. The streaming service has decided not to launch a dedicated app for the Vision Pro, in a blow to Apple's attempt to market its virtual reality headset as a premier entertainment device. Netflix said in a statement to Business Insider that Vision Pro users who want to watch Netflix movies and TV shows on the Vision Pro could still do so, but only through a web browser. Bloomberg was first to report the news. Related stories The two companies are rivals in the streaming world, with Netflix competing directly with Apple's streaming service Apple TV+. Apple has made a big deal about the Vision Pro's entertainment features, announcing earlier this week that it would launch with 3D movies from Disney Plus as well as dedicated apps for Discovery+, Amazon Prime Video, and Paramount +. At the time, Apple senior vice president Greg Joswiak described the Vision Pro as the \"ultimate entertainment device,\" with users able to turn any space into their own personal home theater. A lack of dedicated support from Netflix threatens that vision. The streaming giant previously said that the Netflix iPad app would work for the Vision Pro, but now the only option for users wanting to watch Netflix content will be the web. It also means Netflix shows probably won't be able to utilize some of the Vision Pro's more exciting features, such as immersive backgrounds, and that users won't be able to download TV shows and movies. The $3,499 Vision Pro is set to launch on February 2. It's a huge moment for Apple, which is launching its first new product category in nearly a decade. Some testers have already got their hands on the new device — which Apple is determined not to call a VR headset — with early reviews praising the Pro's crystal-clear displays but noting that it seems to lack a clear purpose. Apple did not immediately respond to a request for comment from BI, made outside normal working hours. Disclosure: Mathias Döpfner, CEO of Business Insider's parent company, Axel Springer, is a Netflix board member. Read next Jump to "
}