{
    "title": "Apple loses veteran hardware engineering executive to Rivian",
    "date": "1/27/2024",
    "url": "https://9to5mac.com/2024/01/27/apple-loses-veteran-hardware-engineering-executive-to-rivian/",
    "text": "Apple veteran DJ Novotney is departing the company for a new role at Rivian, according to a report from Bloomberg. Novotney, a vice president of hardware engineering, has spent almost 25 years at Apple and worked across multiple generations of the iPod, the iPhone, the Apple Watch, and more. His LinkedIn page hasn’t yet been updated, but he is shown pictured next to a Rivian. Novotney is the second Apple executive to leave for Rivian this month. Earlier this month, it was revealed that Jonas Reinke, Apple’s head of product, mobility and auto services, had departed Apple to join Rivian as a VP of product management. Today’s Bloomberg report says that Novotney will become senior vice president of vehicle programs at Rivian, reporting directly to CEO RJ Scaringe. In a memo announcing his departure on Friday, Novotney wrote: “Great products are what we do best and I have been so very lucky along the way to be part of so many amazing teams that developed everything from iPod, iPhone, iPad, Watch and so many more. “Apple has been my life, but now is the time for me to move on and help bring to life a new set of products.” The report describes Novotney as a “senior lieutenant to many of the company’s top hardware engineering executives.” In addition to his work on things like the iPod, iPhone, iPad, and Apple Watch, Novotney also spent time working on Apple’s Project Titan electric car team. Most recently, Novotney became a “senior executive in charge of developing future home devices, including some in the robotics and artificial intelligence spaces,” according to today’s report. Other recent Apple departures: FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Chance is an editor for the entire 9to5 network and covers the latest Apple news for 9to5Mac. Tips, questions, typos to chance@9to5mac.com "
}