{
    "title": "Apple ready to open iPhone tap-to-pay to rivals in the EU",
    "date": "1/21/2024",
    "url": "https://borneobulletin.com.bn/apple-ready-to-open-iphone-tap-to-pay-to-rivals-in-the-eu/",
    "text": "BRUSSELS (AFP) – Apple is prepared to open the iPhone’s ability to tap-to-pay to rivals – in the European Union (EU) – after coming under fire for keeping users in its own ecosystem, the European Commission and the company said on Friday. The commission, the EU’s market regulator, said it was weighing Apple’s proposal, which was made after Brussels determined that the Cupertino company enjoys a dominant position in iOS mobile wallet transactions by shutting out competitors. Such transactions rely on technology called Near-Field Communication (NFC) which allows users to tap a smartphone on a vendor’s payment terminal instead of a credit card with a microchip. An Apple spokeswoman told AFP: “We have offered commitments to provide third-party developers in the European Economic Area (EEA) with an option that will enable their users to make NFC contactless payments from within their iOS apps, separate from Apple Pay and Apple Wallet.” This option would be made available in the 27 EU countries plus associated countries Iceland, Liechtenstein and Norway, which together make up the EEA. “Apple Pay will continue to be a broadly available option, and over 3,000 issuing banks across all EEA countries will still be able to offer the unparalleled privacy and security of Apple Pay, as well as its great user experience,” the spokeswoman said. The European Commission has invited companies in the contactless payments business to comment within a month on Apple’s proposal to see if it addresses their competition concerns on getting access to tap-to-pay tech on iPhones and Apple watches. The commission said Apple was offering to make NFC on iOS devices available free of charge, and would create interfaces so that competitors could safely store personal payment details for use in their own apps. Only users with an Apple ID registered in the EEA would be able to make use of these outside apps, though “Apple will not prevent the use of these apps for payments in stores outside the EEA”, the commission said in a statement. That raised a question about how consumers and regulators in non-EU markets, such as the United States, Britain and Australia might view the change, and whether they could push for similar treatment. The commission noted that, up to now in Europe, “Apple’s iPhones run exclusively on Apple’s operating system (iOS), with which they form a ‘closed ecosystem’”. Borneo Bulletin is the leading English daily in the country. It was first published by Brunei Press. Today, Borneo Bulletin has become the foremost source of information on local and foreign affairs, and the region’s business news. © 2013 Borneo Bulletin Online - The Independent Newspaper in Brunei Darussalam, Sabah and Sarawak "
}