{
    "title": null,
    "date": "1/14/2024",
    "url": "https://www.businessinsider.com/itunes",
    "text": "       iTunes has been Apple's primary media player for about two decades. It debuted in 2001 and has been the primary way that most people listened to music and downloaded songs to their iPhones ever since. That changed in 2019 when Apple announced that it was discontinuing the iconic music player starting with Mac OS Catalina. But Apple didn't make a clean, easy-to-understand break with iTunes. Depending on what kind of computer you have, you might still be using iTunes — or you might not. Here's what you need to know about iTunes and whether you can still use it. That depends on what kind of computer you use. Apple has officially discontinued iTunes for MacOS Catalina, and you can no longer download or install it. Instead, Apple has moved your iTunes media library to a handful of different apps: Apple Music, Apple TV, Apple Books, and Apple Podcasts. Even so, the iTunes Store can still be found within the Music app. If you're a Windows user, the story is a little more complicated. iTunes is still available. If you need to install it, you can get iTunes from Apple's iTunes website. That's not all. Apple has also released \"preview\" versions of its Apple Music, Apple TV, and Apple Devices apps for Windows, which you can use instead of iTunes. Apple Music lets you stream music and podcasts, for example, and gives you access to the Apple Music subscription subscription service on your desktop. Apple TV gives you access to the subscription Apple TV+ service, and Apple Devices lets you sync music and other media from your computer to your iPhone and iPad, as well as back up and restore data to those devices. Related stories Beware, though: If you install Apple Devices onto your Windows computer, it will disable iTunes completely. If you decide to go back to iTunes, you'll need to uninstall Apple Devices and then reinstall iTunes. Apple decided to discontinue iTunes for Apple users — and presumably for Windows users as well, eventually — back in 2019. Apple hasn't said much about why it decided to pull the plug on the media player, but it's not hard to see why. iTunes has been criticized by tech journalists for years for being poorly organized, awkwardly designed, and increasingly bloated. And in the time since iTunes' original design, the music landscape has changed substantially. When iTunes got its start, Apple sold songs for 99 cents each in a proprietary format, for example, rather than as MP3s. In the last decade, the model of buying individual songs one at a time has been almost completely replaced by subscription streaming services like Spotify and Tidal. Rather than redesign iTunes for the modern media world, Apple decided to discontinue the app in favor of a family of new apps designed expressly for the contemporary streaming and subscription world we live in now. iTunes is still available for Windows users. The current version is 12.13.1.3. You can download it from Apple's iTunes website for Windows. If you want to see the music, subscriptions, apps, and other items you bought with iTunes, you can do that easily. If you are using iTunes on Windows, start iTunes and click the Account menu. Choose View My Account and then scroll down to the Purchase History section. Click See All. On a Mac running Catalina that can't access iTunes, you can still access your iTunes account online. Go to reportaproblem.apple.com and sign in with your Apple ID. You should see your whole purchase history on the page. You should be able to see all your purchases in iTunes or online at the reportaproblem.apple.com website. If you can't, though, it's likely that there might be more than one account involved. If you have more than one Apple ID, you might have made a purchase when signed in with the other account. Try signing in with the other account and check your purchases history again. If you received an email invoice or some other notification about an iTunes purchase and you can't find it in your purchase history, it's also possible that it's not a legitimate email from Apple. Check to see if it's spam or otherwise fraudulent. Read next Jump to "
}