{
    "title": "Apple Vision Pro: How to Order, Price, Release Date, Features",
    "date": "1/19/2024",
    "url": "https://www.businessinsider.com/guides/tech/apple-vision-pro-order-price-release-date-features",
    "text": "       When you buy through our links, Business Insider may earn an affiliate commission. Learn more  Apple's highly anticipated Vision Pro headset is available to preorder now from Apple's physical stores and website in the US. The Apple Vision Pro is a mixed-reality headset that combines virtual and augmented reality, but Apple would rather you call it a \"spatial computing\" device. Here's what to know about the Apple Vision Pro ahead of its February 2 release date, including what you'll need to prepare when ordering the device. Preorders for the Apple Vision Pro are available now through Apple's website and physical stores in the US. The Vision Pro will be released and available to buy on February 2 from US Apple stores online and in-person. The Vision Pro starts at $3,499 with 256GB of storage. It comes with a battery pack, a face seal, a seal cushion, a cover for the front, an optional, adjustable upper headband, a 30W USB-C adapter and USB-C charging cable, and a polishing cloth.  The purchasing process for the Apple Vision Pro is more involved than the company's other products. Whether ordering the Vision Pro from an Apple Store or the Apple website, you'll need to scan your face for headband and face seal measurements. If you're ordering online from home, you'll need to take the measurements with an iPhone or iPad with Face ID. The face scan takes place in the Apple Store app, which you'll need to update to the latest version of the app if you haven't already. For those with a prescription for glasses or contacts, you'll need to have your prescription details handy to order custom optical inserts. After checkout, Apple will ask you to upload a valid and unexpired prescription from an eye-care professional. Combining virtual and augmented reality, the Apple Vision Pro can display immersive virtual \"environments\" or add a digital layer of hovering customizable displays to your physical surroundings, where you can interact with apps and games and watch video content. The Vision Pro runs on Apple's new visionOS operating system and its M2 computer processor, and it can act as a dynamic, augmented-reality version of a Mac computer with a multi-monitor setup. The headset works through voice commands and hand and wrist gestures, but you can also use it with wireless keyboards, trackpads, or mice, like Apple's Magic Keyboard or Magic Trackpad. The Vision Pro can deliver an immersive entertainment experience with a single large display for watching movies and TV shows, or your own videos recorded with Apple's 3D-style Spatial video format. You can also use the headset to take FaceTime calls and play games, among other functions. You can purchase logo and accolade licensing to this story here.Disclosure: Written and researched by the Insider Reviews team. We highlight products and services you might find interesting. If you buy them, we may get a small share of the revenue from the sale from our partners. We may receive products free of charge from manufacturers to test. This does not drive our decision as to whether or not a product is featured or recommended. We operate independently from our advertising team. We welcome your feedback. Email us at reviews@businessinsider.com. Jump to "
}