{
    "title": "Apple Fees Could Be Harbinger for Big Tech Ahead of EU Digital Markets Act \nDeadline",
    "date": "1/24/2024",
    "url": "https://www.pymnts.com/news/regulation/2024/apple-fees-harbinger-big-tech-europe-digital-markets-act-deadline/",
    "text": "For Apple, the opening of the ecosystem proceeds apace in Europe. With it, however, comes the potential to realize some additional revenue streams. And what happens in Europe, with Apple at the epicenter, may be a harbinger for Big Tech in general, operating on the continent. Last week, Apple made a move to offer competitors access to its tap-to-pay mobile wallet system. The overture seems geared toward ending an antitrust case in the European Union. Now, Apple is gearing up for sideloading, a term and practice that entails sourcing and installing apps onto Apple devices outside of the company’s App Store. Reports stated that alongside the change, Apple plans to levy fees — as yet unquantified — on developers that offer the downloads. Apple’s actions come in anticipation of a March deadline for complying with Digital Markets Act mandates on software downloads and how software is accessed and downloaded. The act was passed in 2022; its tenets have been rolled out over time. So-called “gatekeepers” are impacted here, namely, the large online platforms. Beyond Apple, there’s Google and Meta, among others. The concessions that Apple is making ahead of the March deadline hint that larger tech firms will retool at least some of their operations. The European Commission noted on its website that the DMA will require platforms to allow third parties to interoperate with the gatekeeper’s own services in certain situations and allow their business users to access the data that they generate in their use of the gatekeeper’s platform, among other directives. The consequences of non-compliance can be onerous, as penalties may be as much as 10% of the company’s total worldwide annual revenues or up to 20% in the event of repeated transgressions. Apple’s earnings show that the company gleaned a quarter of its sales from Europe. The services segment has been a key revenue driver, up double-digit percentages where hardware sales were mixed. Charging for sideloading may be a way to cushion some of the top line lost as the App Store’s practices are reconfigured. Google’s parent, Alphabet, showed that about 29% of sales came from the region, as detailed in the latest quarterly earnings report. It remains to be seen if Apple will indeed charge fees for sideloading, and/or if those fees will be successful. Developers and other critics are already jousting with the company over the roughly 27% commission that will be charged on payments made outside the United States App Store. As for the other platforms, the door may be open for charging fees for “opening” ecosystems and making content/data and apps more widely available through the 27-nation bloc, ostensibly to help. There’s already some precedent for the platforms to pull back a bit on bringing new offerings to the EU. Meta, by way of example, took several months to bring Threads to Europe and set about offering a subscription option for Facebook and Instagram users there. We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}