{
    "title": "My Apple Stock Is Up 22% Over the Past Year. Here's Why That's Actually a \nProblem for Me",
    "date": "2/12/2024",
    "url": "https://www.fool.com/the-ascent/buying-stocks/articles/my-apple-stock-is-up-22-over-the-past-year-heres-why-thats-actually-a-problem-for-me/",
    "text": "If you're on a Galaxy Fold, consider unfolding your phone or viewing it in full screen to best optimize your experience. Credit Cards Banks Brokers Crypto Mortgages Insurances Loans Small Business Knowledge Published on Feb. 12, 2024 By: Maurie Backman Writer KEY POINTS Check out our picks for best stock brokers Buying stocks is something I've been doing for quite some time. And I've always been a fan of the \"buy and hold\" strategy, where you identify quality businesses and hold onto their shares for years or decades to get the maximum benefit and return out of your investments. One such stock that I've held for many years is Apple. Over the past year, Apple's stock price has risen more than 22%. That's a good thing for me in theory, since it means my shares are now worth more money. If I were to sell them today, I'd get a much higher price than what I paid initially.\nBonus offer: unlock best-in-class perks with this brokerage accountRead more: best online stock brokers for beginners  Bonus offer: unlock best-in-class perks with this brokerage account Read more: best online stock brokers for beginners The problem, though, is that I don't want to sell my Apple shares. Like I said, I'm a \"buy and hold\" investor, so ideally, I'd like to keep my existing shares in my portfolio for many more years. But I need to unload some shares in short order for one big reason. Apple isn't the only stock I own whose value has risen over the past year. But based on the number of shares I own and the amount of growth Apple stock has seen, I'm now in a place where Apple consists of more than 5% of my portfolio. Only I have a personal rule to never have a single stock comprise more than 5% of my portfolio. I like a well-diversified portfolio, and because of this, I feel that generally speaking, no single stock should occupy more than 5% of it. But because I'm beyond that point, I now feel that I need to sell my Apple shares and replace them with a different company. See, if I were to continue to hang onto my Apple shares and let that position grow, my portfolio might take a serious beating if Apple were to miss earnings or experience negative news that results in its share price plunging. Of course, unloading stocks at a profit isn't so simple. The reason? There are capital gains taxes to think about. Generally speaking, any time you earn money, the IRS gets a piece of it. So if you sell stock at a profit, you create a tax liability for yourself. Thankfully, I've held my Apple shares for more than a year and a day. This puts them in the long-term capital gains tax category, which has a top tax rate of 20% (your rate will depend on your income). Short-term capital gains taxes -- those that apply to assets held for a year or less -- are comparable to taxes on ordinary income and top out at 37%. So the potential to owe money there is a lot higher. But either way, once I unload some Apple shares, I need to think about what I owe the IRS. And that's not fun. Owning stocks that gain value over time is a great thing. But it's important to keep tabs on your portfolio when the assets you own do increase in value, because that has the potential to throw your portfolio out of whack. You may also want to set a benchmark like I do that tells you when to sell a stock. As mentioned, I'm not comfortable having any single stock comprise more than 5% of my portfolio. You may be comfortable going higher, and that's fine. But it's a good idea to establish a system so you know when it's the right time to sell. This credit card is not just good – it’s so exceptional that our experts use it personally. It features a lengthy 0% intro APR period, a cash back rate of up to 5%, and all somehow for no annual fee!Click here to read our full review for free and apply in just 2 minutes.   Maurie Backman is a personal finance writer covering topics ranging from Social Security to credit cards to mortgages. She also has an editing background and has hosted personal finance podcasts. Share this page We're firm believers in the Golden Rule, which is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers.\nThe Ascent does not cover all offers on the market. Editorial content from The Ascent is separate from The Motley Fool editorial content and is created by a different analyst team. Related Articles By: Ben Gran |\nPublished on Jan. 26, 2024 By: Steven Porrello |\nPublished on Feb. 28, 2024 By: Ben Gran |\nPublished on Feb. 27, 2024 By: Maurie Backman |\nPublished on Feb. 27, 2024 By: Chris Neiger |\nPublished on March 2, 2024 The Ascent is a Motley Fool service that rates and reviews essential products for your everyday money matters. Copyright © 2018 - 2024 The Ascent. All rights reserved. "
}