{
    "title": "Source shares Apple's full stop on Apple Car project",
    "date": "2/27/2024",
    "url": "https://global.chinadaily.com.cn/a/202402/28/WS65dea9a9a31082fc043b98ca.html",
    "text": "chinadaily.com.cn |\n          Updated: 2024-02-28 11:34 Apple has halted development on its electric car project a decade after the tech giant initiated the project, reported by Reuters on Tuesday. The news first came from technology journalist Mark Gurman on his social media where he wrote: \"Apple cancels the Apple Car project after a decade-long, multi-billion effort to rival Tesla. Some employees shifting to Generative AI teams.\" Tesla CEO Elon Musk also followed the move, posting on X a saluting emoji and a cigarette while quoting an article about the move. It was said that Jeff Williams, Apple's chief operating officer, and Kevin Lynch, who was overseeing the car project, internally announced the decision on Tuesday, surprising the project's about 2,000 employees, according to online media outlets Huanqiu.com. The company declined to provide a comment on the matter. The rise in interest rates aimed at curbing inflation has dampened consumer sentiment, resulting in decreased demand for electric vehicles. Consequently, the industry has witnessed job cuts and reduced production, Reuters reported. Several employees from the electric car project will be reassigned to Apple's artificial intelligence division, Bloomberg News said. Apple has, so far, held back from any big moves in AI, in contrast to other tech giants such as Alphabet and Microsoft, which have first-mover advantage in incorporating the breakthrough technology, according to Reuters. Apple launched Project Titan, its internal code name for the car effort, a decade ago amid growing interest in self-driving vehicles in Silicon Valley. In 2020, Reuters reported that Apple was considering releasing a vehicle by 2024 or 2025. However, progress had been uneven even before the disruption caused by the COVID-19 pandemic. In 2019, Apple laid off 190 people from the project group after reevaluating its software strategy, said Reuters. "
}