{
    "title": "Warren Buffett-Led Berkshire Hathaway Sells Some Apple Stock. Should You?",
    "date": "2/18/2024",
    "url": "https://www.fool.com/investing/2024/02/18/warren-buffett-berkshire-hathaway-sell-apple-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More On Feb. 14, Berkshire Hathaway (BRK.A -0.52%) (BRK.B -0.56%) filed its 13F report for the period ended Dec. 31, 2023. There weren't too many sizable moves, but one noticeable one was that Berkshire sold around 10 million shares of Apple (AAPL -4.09%), trimming the position by a little over 1%. Let's discuss Berkshire's stake in Apple, what Berkshire's moves could indicate about its thoughts on the market, and what you should do if you own or want to buy the tech stock. Image source: Getty Images. Berkshire began acquiring Apple stock in 2016. By the end of 2018, Berkshire had racked up just shy of 1 billion shares. As of the end of 2023, Berkshire held 905.6 million shares. Apple has become Berkshire's largest holding because the buying spree between 2016 and 2018 proved to be a genius move. Apple stock is up 366.6% between the end of 2018 and Feb. 14. Berkshire sold 93.5 million shares in 2020. But aside from that, the position has remained relatively unchanged. Even after the fourth-quarter 2023 sale, Apple remains 45.5% of Berkshire's public equity portfolio, with Berkshire owning 5.9% of the company. I have two key takeaways from Berkshire's decision to keep its Apple position mostly unchanged between 2021 and 2023. The first is that Berkshire doesn't have better ideas than Apple. If it did, it could divert its enormous profits from Apple stock elsewhere. Effectively, Berkshire doesn't have a good enough alternative idea to justify selling Apple stock and suffering the associated tax consequences. The second takeaway is that Berkshire views Apple as a good value, not necessarily as a growth stock. Berkshire CEO Warren Buffett is a value investor at heart, and Berkshire's overall portfolio is incredibly value-oriented. The top five holdings in its public equity portfolio are Apple, Bank of America, American Express, Coca-Cola, and Chevron. Outside of its public equity portfolio, the most valuable assets Berkshire owns are its property and casualty insurance business, its 100% ownership of BNSF railroad, its 92% ownership of Berkshire Hathaway Energy, and several stakes or partial stakes in other companies. Berkshire isn't the kind of company to go out and ride the hot trend, like artificial intelligence (AI) today or the metaverse a few years ago. It's also not the kind of company to change its investment strategy. In its 2023 annual shareholder meeting from last May, Warren Buffett praised Apple, saying the following: Our criteria for Apple isn't different than the other businesses we own, it just happens to be a better business than any we own and we put a fair amount of money in it but we haven't got more money in it than we've got in the railroad. Our railroad is a very good business but it's not remotely as good as Apple's business. In other words, Apple doesn't get preferential treatment over other companies, it just continues to check all of the boxes. A couple of minutes later in the meeting, Buffett said: \"I made a mistake a couple years ago and I sold some shares.\" What he's referring to are the 93.5 million shares sold in the second half of 2020 that we discussed earlier. Buffett defended it by saying some tax-related factors made the move advisable, but he still seemed to regret it. So, if Buffett said that selling Apple was a mistake, you may wonder why Berkshire sold a little over 10 million shares in Q4 2023. Since it is a relatively small amount, my guess is that this may have been tax-related. We will hear more about Buffett's opinions on Apple during Berkshire's 2024 annual meeting on May 4. If I had to guess, the investment thesis on Apple hasn't changed. Berkshire is a big believer in the power of stock buybacks, but only if the business is good. This is why Berkshire famously doesn't pay a dividend, preferring instead to repurchase its own stock. Dividends are \"double taxed\" because they are paid with income that is taxed to the company and then taxed again when distributed to shareholders. Buybacks can be a better use of capital because they avoid this double taxing problem. They also reduce the outstanding share count of a company, which boosts earnings per share (EPS) and makes each existing share own a higher percentage of the company. Over the last 10 years, Berkshire has reduced its outstanding share count by 12.2%, whereas Apple has reduced its share count by 36%. Buybacks continue to be the main driver of Apple's capital return program. In its recent quarter, Apple spent $20.1 billion on buybacks and $3.8 billion on dividends. It's no secret that Apple's top- and bottom-line growth has slowed. The stock is also down 4.5% year to date, compared to a 5.5% gain in the S&P 500. Buybacks help boost EPS when organic growth is slow. Buffett and his team don't seem too concerned about Apple's current slowdown or its valuation. After all, there are aspects of the business that are thriving -- namely, the high-margin services segment, which just set a record for operating income and revenue. Berkshire's decision to leave its Apple position mostly unchanged makes sense. The company isn't exhibiting the growth to make it a screaming buy. Unlike other big tech stocks, Apple has yet to make a meaningful splash with AI, namely because it doesn't have the business-to-business AI potential of a company like Nvidia or Microsoft. Apple is a well-run business that is missing out on the market rally for a good reason. There doesn't seem to be any real reason to pile into Apple stock now. However, if the broader market continues to become more expensive (and Apple languishes), it will begin to look like a better value. Apple is a stock worth putting on the top of a watchlist or buying a starter position in if you don't own any. The stock is out of favor on Wall Street right now compared to other big tech plays, but that could change quickly if fundamentals improve or the valuation comes down. Bank of America is an advertising partner of The Ascent, a Motley Fool company. American Express is an advertising partner of The Ascent, a Motley Fool company. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Bank of America, Berkshire Hathaway, Chevron, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}