{
    "title": null,
    "date": "2/22/2024",
    "url": "https://timesofmalta.com/article/apple-to-halve-its-cut-from-small-app-developers.832636",
    "text": "Apple is to slash the commission it takes from small businesses selling on its App Store, the company said Wednesday, but the tech giant will still take a 30 per cent cut from major developers. The iPhone manufacturer said that from the new year, developers who make less than $1 million from selling apps on its store will see Apple's revenue bite cut to 15 per cent. The announcement, however, will have no effect on developers that generate huge amounts of cash from wildly popular apps and videogames. Apple and the developer of the blockbuster game Fortnite, Epic Games, are fighting over whether the California-based company's tight control of its App Store, and its 30 per cent cut of revenue, counts as monopolistic behaviour. Apple pulled Fortnite from its store in August after Epic released an update that dodges revenue sharing. A trial to resolve the dispute is not expected until next year. Apple said the \"vast majority\" of developers will benefit from its App Store Small Business Programme - launched to give companies a boost during the pandemic. \"Small businesses are the backbone of our global economy and the beating heart of innovation and opportunity in communities around the world,\" Apple CEO Tim Cook said. \"We're launching this programme to help small business owners write the next chapter of creativity and prosperity on the App Store, and to build the kind of quality apps our customers love.\" You can unsubscribe at any time by clicking the link in the footer of our emails. We use\nMailchimp as our marketing platform. By\nsubscribing, you acknowledge that your information will be transferred to Mailchimp for processing. 6,000 pulmonary disease patients to get free inhalers European car sales swerve lower Comments not loading? We recommend using\nGoogle Chrome\nor\nMozilla Firefox. Independent journalism costs money. "
}