{
    "title": "Apple tests upgraded iPhone and Mac search using AI",
    "date": "2/15/2024",
    "url": "https://9to5mac.com/2024/02/15/apple-llm-ai-spotlight-upgrade-ios/",
    "text": "In a report describing new AI coding and testing features coming to Xcode later this year, Bloomberg also shares some interesting details about ways Apple is considering using AI to supercharge Spotlight. The report describes a version of Spotlight that is far more powerful than what we have today, thanks to the use of generative AI. Spotlight Search is Apple’s search utility that’s available on iPhone, iPad, and Mac. In addition to letting users find documents and files saved on their devices, it can also search the web, the App Store, and perform other rudimentary tasks. Today’s report says that this “revamped version of Spotlight” powered by large language model technology is “under consideration” inside Apple. This would give Spotlight the ability to perform more complex tasks, tie into specific apps, and more. The new version would be able to toggle between specific features within apps and answer complex questions based on data trained from large language models. LLMs, the technology that powers AI tools, is developed by bombarding software with a torrent of data. Early designs of the Spotlight overhaul include using LLMs to answer more complex questions and the ability to tap deeper into apps to launch specific functions. The current version of Spotlight is mostly limited to launching apps, making basic web searches and pulling up information like the weather and sports scores. As of right now, there’s no word on when – or if – this new version of Spotlight will see the light of day. Bloomberg simply says it’s something Apple is considering as part of its adoption of AI across all of its platforms. While the AI coding and testing features rumored for Xcode sound great for developers, I’m not the target audience for that. I am, however, very excited at the prospect of a more powerful version of Spotlight Search. There are Spotlight alternatives on the Mac that are far more powerful than Apple’s offering, such as Raycast and Alfred. While these are great on the Mac, Apple doesn’t give developers a way to overtake Spotlight on iPhone and iPad. In fact, I’d say that a more powerful version of Spotlight Search is one of the best ways Apple could implement LLM technology on iPhone and iPad (other than improving Siri itself, of course). Follow Chance: Threads, Twitter, Instagram, and Mastodon. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Chance is an editor for the entire 9to5 network and covers the latest Apple news for 9to5Mac. Tips, questions, typos to chance@9to5mac.com "
}