{
    "title": null,
    "date": "2/24/2024",
    "url": "https://www.macrumors.com/2024/02/24/steve-jobs-69th-birthday/",
    "text": "Apple co-founder and former CEO Steve Jobs was born on February 24, 1955, so today would have marked his 69th birthday had he not passed away in 2011 at the age of 56. Jobs and Steve Wozniak founded Apple in 1976 to produce the very first Apple computers, revolutionizing the personal computer and building up to one of the most famous commercial launches in history, the Macintosh, in 1984. He was ousted from the company just a year later, but returned in 1997 as a floundering Apple purchased Jobs' follow-up company NeXT to serve as the future basis of the Mac operating system. Apple was reinvigorated with Jobs back at the helm and Jony Ive leading a team generating iconic design after iconic design. The duo oversaw not only a rebirth of the Mac but the creation of a number of other revolutionary products and services, most notably including the iPod and of course the iPhone. Under Jobs' leadership from 1997 until his 2011 death from cancer, Apple went from a company on the brink of failure to one of the biggest tech companies in the world. As he always does, Apple CEO Tim Cook paid tribute to Jobs on Twitter today. Thinking of my friend Steve on his birthday — the lives he touched, the vision he shared, and the profound impact he had on our world. “We’re here to put a dent in the universe. Otherwise, why else even be here?” pic.twitter.com/ONDgZ6ycCe\n— Tim Cook (@tim_cook) February 24, 2024 Thinking of my friend Steve on his birthday — the lives he touched, the vision he shared, and the profound impact he had on our world. “We’re here to put a dent in the universe. Otherwise, why else even be here?” pic.twitter.com/ONDgZ6ycCe\n— Tim Cook (@tim_cook) February 24, 2024 Get weekly top MacRumors stories in your inbox. Our comprehensive guide highlighting every major new addition in iOS 17, plus how-tos that walk you through using the new features. App Store changes for the EU, new emoji, Podcasts transcripts, and more. Get the most out your iPhone 15 with our complete guide to all the new features. A deep dive into new features in macOS Sonoma, big and small. Revamped models with OLED displays, M3 chip, and redesigned Magic Keyboard accessory. Updated 10.9-inch model and new 12.9-inch model, M2 chip expected. Expected to see new AI-focused features and more. Preview coming at WWDC in June with public release in September. Action button expands to all models, new Capture button, camera improvements, and more. 2 hours ago by Tim Hardwick 1 day ago by Tim Hardwick 2 days ago by Tim Hardwick 2 days ago by Tim Hardwick 3 days ago by MacRumors Staff  MacRumors attracts a broad audience of both consumers and professionals interested in the latest technologies and products. We also boast an active community focused on purchasing decisions and technical aspects of the iPhone, iPad, Mac, and other Apple platforms. "
}