{
    "title": "Apple's Vison Pro Could Send the Stock Up 35%, According to This Wall \nStreet Analyst",
    "date": "2/17/2024",
    "url": "https://finance.yahoo.com/news/apples-vison-pro-could-send-121000855.html",
    "text": "Apple (NASDAQ: AAPL) share prices are down about 5% on the year so far, and Wedbush analyst Dan Ives sees the drop as a buying opportunity. The analyst recently maintained his buy rating on the stock and reiterated a $250 near-term price target. That target represents a 35% upside from the current share price of $183. His optimism reflects sales expectations for Apple's new Vision Pro headset, which the company describes in press releases as \"a revolutionary spatial computer that seamlessly blends digital content with the physical world.\" Analysts at Wedbush originally set the high price target last year on the expectation of strong sales of the iPhone 15. Sure enough, Apple reported better-than-expected revenue of $119 billion in the December-ending quarter, driven by iPhone. Ives now sees Apple's Vision Pro headset -- the company's first major computing product since the Apple Watch -- as a growth catalyst that could provide upside to Apple's long-term earnings growth. His sales forecast is 600,000 units in 2024 with 1 million unit sales in 2025. Bank of America analyst Wamsi Mohan has the same forecast for 2025, and he raised his projection to 4 million units for 2026. Apple stock is not cheap, trading at a high forward price-to-earnings ratio of 28, and the Vision Pro may take a while to catch on with Apple's customers, especially given its high retail price tag of $3,499. However, Apple has a long history of delivering new products that people eventually can't live without but didn't think they wanted in the first place. This is a highly profitable business, with nearly $100 billion in annual free cash flow, and it got to this point by making calculated bets on what it thinks customers are going to love. I wouldn't bet against it over the long term. Should you invest $1,000 in Apple right now? Before you buy stock in Apple, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 12, 2024 Bank of America is an advertising partner of The Ascent, a Motley Fool company. John Ballard has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Bank of America. The Motley Fool has a disclosure policy. Apple's Vison Pro Could Send the Stock Up 35%, According to This Wall Street Analyst was originally published by The Motley Fool Related Quotes "
}