{
    "title": "Apple's Vision Pro headset hits U.S. stores Friday",
    "date": "2/2/2024",
    "url": "https://www.abc12.com/news/business/apple-s-vision-pro-headset-hits-u-s-stores-friday/article_af803738-f332-50cc-a964-9cdae6916f58.html",
    "text": "    The Vision Pro, Apple's first new product in seven years, will officially launch in stores on Friday in the U.S. The mixed reality headset is set to go sale at Apple Stores across the country, as some eager shoppers will be among the first to get their hands on what promises to be one of the most innovative tech products in years. People will also be able to walk into stores and receive private one-on-one demos on a first come first serve basis. CEO Tim Cook has long talked up the potential for augmented reality to help people communicate and collaborate. Now he will have to prove that a device that blends both virtual reality and augmented reality, a technology that overlays virtual images on live video of the real world, is indeed the future of computing. Ahead of the release, Cook called it \"the most advanced consumer electronics device ever created.\" But it won't be an easy sell: It's a $3,499 clunky computer you wear on your face. The headset will have 256 GB of storage, and prescription lens inserts for the device will be available starting at $149. Reading lens inserts start at $99. Once you factor in additional accessories, like a $200 travel case and $50 battery pack holder and more, it can cost up to $4,600, The New York Times reported. The headset enters just as the extended reality (XR) market — a category that includes augmented, virtual and mixed reality — has plateaued with little mainstream consumer adoption. The Vision Pro has limited apps out of the gate and will be tethered to a battery pack the size of an iPhone, offering about 2.5 hours of battery life on a single charge. The experience, however, is unmatched when it comes to watching immersive videos and interacting with the world around you. It's rare to find a new technology that feels groundbreaking, but in the two demos CNN experienced ahead of the launch, it's easy to see the future — or at least an early and very pricey prototype of it. The headset itself looks like a pair of designer ski goggles. It features a soft adjustable strap on the top, a \"digital crown\" on the back — a bigger version than what you'd find on an Apple Watch — and another digital crown on the top that serves as a kind of home button. Although it's still a computer around the eyes, it's surprisingly light and comfortable to wear. The setup process is easy: First, the headset tracks the eyes, scan hands and maps the room. Users will then see an iOS-like interface placed in front of their environment. By using eye movements and touching the thumb and pointer finger together, it activates a \"select\" button, allowing people to seamlessly go in and out of apps, such as Messages, FaceTime, Safari and Photos. The interface also responds to voice to activate Siri. Photos can be viewed at life size or as if you're watching them on a giant movie screen. Panoramics, meanwhile, place you directly within the scene. Vision Pro also offers a spatial photo option, which lets users view images and videos in 3D for an even more life-like experience. Use cases for the Vision Pro vary from cooking and meditating to working. Users can sync up their Mac computer to turn the screen into an enormous display and connect a physical keyboard. To maximize productivity, it's possible to have several windows open at once: Email can be kept on one side, a Safari browser opened perhaps in the middle and a FaceTime call on the right. If a user is wearing Vision Pro while on FaceTime, they appear as a Persona, or an avatar-like digital representation of their face. The real magic of the Vision Pro, however, is in the immersive videos. During a recent demo, we watched \"Star Wars\" clips on Disney+ while sitting inside a virtual representation of Luke Skywalker's landspeeder vehicle, a viewing experience that will delight any movie fan. Watching an underwater scene from \"Avatar 2\" in 3D, meanwhile, was also surreal, seemingly placing users right in the ocean. Apple has taken steps to reduce the motion sickness problem that has plagued other headsets, thanks to a custom chip that cuts down on the latency issue found in similar products. Vision Pro includes surround sound, with audio pods that sit outside the ears to deliver rich immersive audio. To help users navigate their new headset, Apple has included a nearly 10-minute guided tour on its website. Almost every new Apple product, from the iPhone to the Apple Watch, promises to use screens of varying sizes to change how we live, work and interact with the world. The Vision Pro has the potential to do all of that in an even more striking way. But out of the gate, the Vision Pro will likely remain a niche product for die-hard Apple enthusiasts and developers, largely due to the price tag. Apple analyst Ming-Chi Kuo said during the first pre-order weekend last month, the company sold an estimated 160,000 to 180,000 Vision Pro headsets. Shipping times remained largely unchanged after the first 48 hours, indicating demand could wane after core fans have placed orders. Shipping windows typically widen after new iPhone models sell out. Morgan Stanley analysts project the company will ship up to 400,000 Vision Pro units this year. The-CNN-Wire ™ & © 2024 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: "
}