{
    "title": "iPhone 15 gets cheaper by Rs 10,091 ahead of Valentine’s Day, but you can \nget it for even less with this deal",
    "date": "2/10/2024",
    "url": "https://www.financialexpress.com/life/technology-iphone-15-gets-cheaper-by-rs-10091-ahead-of-valentines-day-but-you-can-get-it-for-even-less-with-this-deal-3390217/",
    "text": "The Financial Express Apple iPhone 15 is currently available with a flat discount of Rs 10,091 on Flipkart. The limited-period offer is part of the Walmart-owned company’s Valentine’s Day Mobile Bonanza promotional sale event that kicked off on February 9 and will run through February 15, 2024. The iPhone 15 128GB variant sticker price is Rs 79,999 but you can get it for as low as Rs 66,999 on Flipkart at the time of writing, that is without any strings attached. For HDFC Bank credit card customers, an additional Rs 2,000 discount is available and so, if you make the payment using the select credit card (non-EMI transactions only), you can snag the latest Apple iPhone for as low as Rs 64,999. Citi Bank, HSBC, DBS and Bank of Baroda customers can similarly avail a 10 percent discount of up to Rs 1,500 on purchase. On top of all this, you can of course also exchange your existing handset and Flipkart will give you up to Rs 54,900 for it, depending on the product. The top-tier discount will obviously be tied to a top-end iPhone like say the iPhone 14 Pro Max but if you own an iPhone 12 or iPhone 13, this may be a good time to upgrade. Regardless of whether or not, it’s Valentine’s week, iPhone discounts are a dime and dozen these days. It is not uncommon to see the iPhone 15 being sold at lower prices in sharp contrast to a couple of years ago when buying a new iPhone meant, great saving and meticulous planning. Apple’s latest 15 packs a 6.1-inch Super Retina XDR OLED display and its new Dynamic Island alongside a USB Type-C port for charging and data syncing. Under the hood, it has the 4-nanometre A16 Bionic processor while a new 48-megapixel main camera calls the shots on high-resolution photos and videos bringing more powerful portrait shooting capabilities to the masses. Rounding off the package are IP68 water and dust resistance and dual speakers. Follow FE Tech Bytes on Twitter, Instagram, LinkedIn, Facebook. Get live Share Market updates, Stock Market Quotes, and the latest India News and business news on Financial Express. Download the Financial Express App for the latest finance news.   "
}