{
    "title": "Apple releases free new sports app for iPhone",
    "date": "2/21/2024",
    "url": "https://www.cnbc.com/2024/02/21/apple-sports-app-release-february.html",
    "text": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article Apple on Wednesday released a free new iPhone app for tracking sports scores, its latest effort to become a major provider of sports content and news. The app, called Apple Sports, does one thing well: show sports scores from all the major teams and leagues. Users in the U.S., Canada and the U.K. can download it Wednesday, the first day of the Major League Soccer season. Apple services chief Eddy Cue said the company designed the app to be fast and simple for multiple quick checks per day. It will stand out from other sports scores apps because Apple doesn't represent a team or league and isn't incentivized to engage users for long sessions, he said. \"You want your scores basically to be real time. You want them to be really easy to get to. And nothing else is getting in the way. And that's the primary purpose of the app,\" said Cue, hoarse from cheering at the Super Bowl, in an interview last week. Apple has moved into sports in recent years by buying rights and airing Major League Baseball and Major League Soccer games, adding additional sports journalism to its News app and airing sports-related documentaries about teams such as the Golden State Warriors and the New England Patriots on Apple TV+. Apple also bid for rights to National Football League games last year before losing out to YouTube, CNBC reported, and is expected to be a player in upcoming rights negotiations for the National Basketball Association. Apple, like Google and Amazon, sees major live sports events as a potential anchor for its streaming services. This new app, which won't come pre-installed on iPhones, is tightly integrated with Apple's other Services apps, such as the TV app and News app. For example, it will take the user's existing preferences for favorite teams, sports and leagues from those apps, so when the Sports app is first opened, many will already see scores from their favorite teams. Notifications and live activities are also handled by the Apple News and Apple TV apps, including existing features such as notifications for game start times or an alert for a close game the user is interested in. Most game pages will include sport-specific information, such as who scored goals, which players are on the court or who's on first base. Pages will also include live betting odds, but users can turn them off in settings. The game pages will also often include an Apple TV button. That means the user can tap the button to view a livestream of the game. It works for sports Apple carries, as well as games on streaming services that are connected to the Apple TV app, many of which still require a cable subscription but will increasingly be available from over-the-top streamers. \"In an ideal world, when I'm looking at the Duke game, it says open the TV app, I'd like it to get me to the game of basketball,\" Cue said. \"And that's what we try to do.\" Notably, there isn't a special version for Apple's new Vision Pro headset, which is the best Apple product for watching sports on a big virtual display. Cue has spoken about Apple's desire to fix sports distribution since before Apple had a streaming service. He critiqued cable channel guides in a 2016 interview with The Hollywood Reporter, and how it was tough to find the Duke game. In 2019, Apple gave Sports Illustrated a look into a war room the company built to monitor games and send notifications. Cue said Apple does a fair amount of behind the scenes to work with app developers and streaming providers to get their services working seamlessly with Apple's services, for example. Apple's goal is to make it simple and clean to find sports information, and eventually, seamlessly cue up the game with a few taps. \"As a huge sports fan, there's never been a better time, there's never been a worse time,\" Cue said. \"The best time is that pretty much everything in the world is televised in some fashion. But it's never been worse. Because of the amount of services, the rights, the blackouts, the restrictions.\" Apple will also have features that will allow users to follow college basketball's March Madness tournament in the app, Cue said. Here's a list of leagues Apple says it will support: Don't miss these stories from CNBC PRO: Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by "
}