{
    "title": "Apple gets angry calls from Vision Pro owners who forgot passcode",
    "date": "2/6/2024",
    "url": "https://www.scmp.com/tech/big-tech/article/3251071/users-who-forgot-their-apple-vision-pro-headset-passcode-have-return-device-store-reset-it",
    "text": "Buyers of Apple’s new Vision Pro headset are finding it can be a major hassle if they lose their passcode. The company is telling users who forget their code – typically a series of digits – that they will have to bring the device to a store or mail it to AppleCare customer support if they want to get it working again. Apple will then erase and reset it. The passcode problem could be particularly frustrating. When customers enter their passcode incorrectly too many times, the headset will be disabled. If users still cannot recall their passcode after a waiting period, they will need to send it back to Apple to be reset, according to guidance given to the company’s support staff. At that point, all content on the device will be erased. It is a quirk that does not exist with Apple’s other products. Apple Watch, for instance, has a mechanism that lets users set it up again if a passcode is forgotten. It is possible that Apple makes software changes in the near future that would allow the passcode to be reset without needing to send the product back. An Apple spokeswoman did not respond to a request for comment. On Apple’s community forum, one customer said he spoke to an agent who was flooded with calls about the problem. “He’s had to deal with a lot of angry customers after telling them their only recourse is to return to the store,” the user wrote. “He said Apple Support was really caught off guard by this and apologised for not being better prepared.” One complication with the Vision Pro is it does not have a USB-C port that lets users plug it into a Mac for troubleshooting. The company did release a special strap for developers to be able to attach the headset to a Mac last week, but that accessory costs about US$300 and is not meant for consumers. The Vision Pro is Apple’s first major new hardware category since it began selling smartwatches almost a decade ago. The device is not expected to be a blockbuster product – partly due to its hefty price tag – but curious customers streamed into Apple stores over the weekend to try it out. The product’s reception has been generally positive, with reviewers praising its immersive video playback and productivity features. "
}