{
    "title": "Apple stock to jump more than 20%, analyst says",
    "date": "1/18/2024",
    "url": "https://finance.yahoo.com/video/apple-stock-rises-upgrade-buy-164417845.html",
    "text": "Apple (AAPL) shares rose Thursday after Bank of America upgraded the tech company to \"Buy.\" Analysts led by Wamsi Mohan raised their price target on the stock to $225 per share, implying a more than 20% upside from Wednesday's closing price. Bank of America sees the upcoming launch of the Vision Pro as a catalyst for the stock. In a note to clients, the team wrote it expects a \"stronger multi-year iPhone upgrade cycle driven by need for the latest hardware to enable Generative AI features to be introduced in 2024/2025.\" Yahoo Finance Anchors Brad Smith and Seana Smith break down the latest analyst call on Apple. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino BRAD SMITH: Apple shares are getting a boost today as Bank of America takes a bullish stance on the company saying, they expect AI and the Vision Pro headset to drive a massive upside for the stock. This comes as the tech giant is taking on its latest smartwatches agreeing to sell the Series 9 and Ultra 2 watches without its blood oxygen feature here. So two very different components to think about here. But at the end of the day, when you think about this upgrade that's come forward this morning, and perhaps having a more pronounced move on the stock, at least, during today's session, there were two things that stuck out from this call from Wamsi Mohan. One, stronger multi-year iPhone upgrade cycles driven by the latest need for hardware to enable generative AI features. Two, higher growth in services. That is on pace, well on pace. And it has been to reach that $100 billion annualized run rate just in that segment for this company alone. SEANA SMITH: Yeah, Brad. When you take a look at the reaction that we're seeing in the stock just over an hour and 15 minutes into the trading day, we're looking at gains of over 2.5%. And that's really why we are seeing, as you look to the bottom right-hand corner of your screen, the S&P and the NASDAQ holding onto gains. And why we also are seeing a larger losses in the Dow. Apple, the second top performer in the Dow today. But digging into this upgrade here from Bank of America, and what stuck out to me in this report was just how optimistic they are about the Vision Pro. And they went on to say that they think the Vision Pro could surpass iPad revenue over time. And they think that because the spatial computing takes hold offering, differentiated use cases that would drive then the upside that they expect to see in services. And a lot of this new technology with VR, with AR will then they think prompt people to upgrade their iPhones. And Bank of America noting that a large part of the install base still uses the iPhone 11. So this bullish case offsetting any of the concern that we saw play out in the market yesterday from that ruling, when it comes to the smartwatches. And even there, I would say, this is almost a win for Apple in terms of how they are navigating this situation. They were able to make a software fix. So they are still able to sell the smart wear-- the smartwatches here in the US, which then could potentially be a big win there for them down the line. BRAD SMITH: Yeah, absolutely. You had mentioned the Vision Pro. And a lot of our viewers see that Vision Pro on screen, they see $3,500. And it's a good reminder right now that we're still in the very early adoption phase for those who are even going to fork over that type of money for a device that still does not have the amount of developers that are even putting content into it, the partnerships that Apple is going to see come forward. So even in our conversations with Wedbush's Dan Ives in the past, he said, that this needs to get slimmer in terms of the product design. Also, we need to see a trimmed down price as well. And he anticipates that future iterations could see this come down as low as maybe $1,500, which actually puts it in the range of a MacBook. SEANA SMITH: Yeah. And then that would certainly change the conversation, right? BRAD SMITH: Yeah. SEANA SMITH: We're not going to be talking about $3,500 device. We'll be talking about $1,500 device. And you would think that maybe that would be enough for people to try it out. But we'll see. BRAD SMITH: Absolutely. Related Quotes "
}