{
    "title": "Apple concedes to European banks amid concern on new RBA payment power",
    "date": "1/23/2024",
    "url": "https://www.afr.com/companies/financial-services/apple-concedes-to-european-banks-amid-concern-on-new-rba-payment-power-20240122-p5ez45",
    "text": "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Apple wants the Albanese government to clarify when the Reserve Bank would be able to deploy new powers allowing it to create rules on bank access to the tech giant’s tap-and-go mobile payment system, after Apple said it would allow European bank apps to make payments with iPhones without sending them through Apple’s digital wallet. Apple provided the concessions in Europe as part of moves to settle antitrust charges brought by the European Commission, which has been investigating banks’ access to the Apple Pay system, Reuters reported at the weekend. Apple wants the Albanese government to rethink new RBA powers.  Josh Robenstone The case arose because Apple restricts access to its near-field communication (NFC) technology, which lets iPhones communicate with payment terminals. Currently, all contactless payments that use iOS-based devices, such as iPhones and Apple Watches, are sent through Apple Pay. The EU says that, by limiting third-party access, Apple is making it tougher for banks to develop rival mobile wallets, which are becoming a more common way to pay. The Australian Competition and Consumer Commission has been examining similar issues after the big banks flagged concerns eight years ago that Apple’s payments architecture was “closed and controlling”. The federal government is consulting on new laws that would expand the powers of the RBA over Apple and other global payments platforms. The changes to the Payment Systems (Regulation) Act of 1998 would let the RBA create an “access regime”, creating rules about bank use of iPhones for payments, which has emerged as a key issue in submissions to Treasury on the bill late last year. The Australian Banking Association argues the new law should ensure regulators can consider bank access to “gatekeeper” or “must-have” payment technologies, which are being used by a growing proportion of consumers and businesses. “The ABA strongly supports the intention for the RBA to have clear powers to address a spectrum of issues that may affect access to payment systems,” it said. Whether Apple is acting as a “gatekeeper” – by controlling critical economic infrastructure that iPhones have become part of as they digitise payment cards – was flagged last year by Commonwealth Bank CEO Matt Comyn. He has been warning policymakers for several years about Apple’s increasing power in the financial services sector. Apple told Treasury in its latest November 1 submission that if Australian regulators are given powers to impose such a regime, decisions should be “appropriately weighed against potentially harmful consequences for participants and the public more generally”. The Cupertino, California-based company expressed concerns that draft bill “does not identify any specific matters that must be taken into account” when proposing an access regime, or standards. Apple has previously argued its control of the iPhone NFC antenna, which also lets it charge banks fees when iPhones make card payments, is necessary to maintain the security of iPhones. It has also argued banks’ arguments are being made to protect their own market power in payments, given Apple Pay makes it easy to switch between cards issued from different banks. In Europe, where it faces a potential fine from the commission, Apple’s position appears to be softening. “We have offered commitments to provide third-party developers in the European Economic Area with an option that will enable their users to make NFC contactless payments from within their iOS apps, separate from Apple Pay and Apple Wallet,” Reuters reported Apple as saying on Friday. The decision may embolden Australian banks, which have been seeking fair access to the NFC since Apple Pay arrived in Australia in 2016. The following year, the ACCC refused to grant the other big banks authorisation to collectively bargain with Apple over access to NFC technology. But ACCC chairwoman Gina Cass-Gottlieb said in 2022 that the competition watchdog had been collaborating with the EU on NFC access, including considering whether Apple “engages in self-preferencing and restriction of competitor access to functionality is in its reservation of tap-and-go, contactless payments using the NFC chip on Apple mobile devices to its own Apple Pay app and Apple Wallet”. Apple told Treasury in its latest submission that the bill “is not a proportionate nor evidence-based regulatory response” for services that are simply a digital presentation of a physical card. It reiterated it had a “limited role in payment systems” and no material risks caused by Apple Pay had been identified that would make regulatory intervention necessary. Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Follow the topics, people and companies that matter to you. Fetching latest articles The Daily Habit of Successful People "
}