{
    "title": null,
    "date": "1/14/2024",
    "url": "https://www.scmp.com/news/world/united-states-canada/article/3248395/microsoft-overtakes-apple-worlds-most-valuable-company-us289-trillion-market-capitalisation",
    "text": "Apple crept up 0.2 per cent on Friday, while Microsoft added 1 per cent. With that, Microsoft’s market capitalisation stood at US$2.887 trillion, its highest ever, according to London Stock Exchange Group (LSEG) data. Apple’s market capitalisation was US$2.875 trillion. Apple’s market capitalisation peaked at US$3.081 trillion on December 14, according to LSEG. Microsoft has incorporated OpenAI’s technology across its suite of productivity software, a move that helped spark a rebound in its cloud-computing business in the July-September quarter. Its AI lead has also created an opportunity to challenge Google’s dominance of web search. Sales of Apple’s Vision Pro mixed-reality headset start on February 2 in the United States, marking Apple’s biggest product launch since the iPhone in 2007. However, UBS in a report this week estimated that Vision Pro sales would be “relatively immaterial” to Apple’s earnings per share in 2024. A handful of times since 2018, Microsoft has briefly taken the lead over Apple as the most valuable company, most recently in 2021, when concerns about supply chain shortages related to the Covid-19 pandemic hit the iPhone maker’s stock price. Both tech stocks look relatively expensive in terms of price to their expected earnings, a common method of valuing publicly listed companies. Apple is trading at a forward PE of 28, well above its average of 19 over the past 10 years, according to LSEG data. Microsoft is trading around 32 times forward earnings, above its 10-year average of 24. In its most recent quarterly report in November, Apple gave a sales forecast for the holiday quarter that missed Wall Street expectations, hurt by weak demand for iPads and wearables. Analysts on average see Apple posting revenue up 0.7 per cent to US$117.9 billion for the December quarter, according to LSEG. That would mark its first year-on-year revenue increase in four quarters. Apple reports its results on February 1. Analysts see Microsoft reporting a 16 per cent increase in revenue to US$61.1 billion, lifted by ongoing growth in its cloud business when it reports in the coming weeks. "
}