{
    "title": "One Company’s Quest to Burst Apple’s Blue Bubble Texts",
    "date": "1/3/2024",
    "url": "https://gimletmedia.com/shows/the-journal/gmhnagwx",
    "text": "January 3, 2024 If you text on a smartphone, chances are you’ve seen the problem: blue text bubbles versus green texts. It's a visual symbol of the problems that Android and iPhone users have when trying to text each other. WSJ’s Nicole Nguyen on the blue-green texting divide and one company’s fight to pop Apple’s iMessage exclusivity.  Further Reading: - The Fight Over Apple’s iMessage and Those Green Bubbles - Why Apple’s iMessage Is Winning: Teens Dread the Green Text Bubble  Further Listening: - How Apple Lost to the EU   Learn more about your ad choices. Visit megaphone.fm/adchoices March 21, 2024 Is Fighting Misinformation Censorship? The Supreme Court Will Decide. The Journal This week, the Supreme Court is considering whether the Biden administration unlawfully pressured tech companies to suppress social media posts opposed to Covid vaccines. We talk to WSJ’s Jess Bravin about the latest in a series of cases that could set important ground rules for free speech and online content moderation. March 20, 2024 Can Reddit’s IPO Survive Its Own Users? The Journal The social-media platform Reddit is making its stock-market debut Thursday and is offering a chunk of shares in its initial public offering to users, who are the lifeblood of its operations. But those same passionate users could cause trouble for the company. WSJ's Corrie Driebusch explains, and a moderator for the popular Reddit forum WallStreetBets weighs in. March 19, 2024 Why Women Are Leaving Goldman Sachs The Journal When David Solomon became CEO of Goldman Sachs just over five years ago, he made promoting women to senior levels of the firm a priority. But female executives are heading for the door—among them, Stephanie Cohen, one of the most senior executives at the company, who announced her departure Monday. WSJ’s AnnaMaria Andriotis unpacks what’s happening at the Wall Street giant. More from The Journal We've updated our Terms of Service.  Learn More This website uses cookies to ensure you get the best experience on our website.  Learn More "
}