{
    "title": "Down $14! I'd buy fallen Apple shares and hold for a decade!",
    "date": "1/19/2024",
    "url": "https://www.fool.co.uk/2024/01/19/down-14-id-buy-fallen-apple-shares-and-hold-for-a-decade/",
    "text": "US tech firms enjoyed a terrific 2023 and their dominance looks set to continue. Here’s why I think Apple shares might be the best investment going. The content of this article was relevant at the time of publishing. Circumstances change continuously and caution should therefore be exercised when relying upon any content contained within this article. Image source: Getty Images When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More. US tech stocks continue to embarrass the rest of the markets. The ‘Magnificent 7’ of Apple (NASDAQ: AAPL), Tesla, Meta, Nvidia, Alphabet, Amazon and Microsoft shares were up an average of 71% last year. The rest of the S&P 500 was up just 6%. Take away these seven tech giants and the American market’s performance is similar to the so-called underperforming UK. US tech might continue to drive the majority of stock market returns. If so, it makes sense to increase my exposure. And, of the firms above, Apple just dropped $14 and I think it’s the best investment of the lot. Here’s why. Of course, the company Steve Jobs and Steve Wozniak created is hardly a hidden gem. A $3trn market value makes Apple the world’s largest company and it’s by far billionaire investor Warren Buffett’s biggest holding. But the world’s most popular stock boasts an edge like few others. Buffett talks about the advantages of an ‘economic moat’ which leads to loyal customers and a large margin of safety. Well, Apple might have the best moat of any company on the planet. An adoring fanbase tunes into every new product launch. And with an ecosystem of products that work in sync, once you’re in, it’s hard to get out. I know this all too well. I’m surrounded by four separate Apple devices within hand’s reach. An even bigger advantage, and one less talked about, is the human capital. US tech pays the biggest salaries and therefore attracts the best minds, not just from California or from the wider United States, but the entire world. Is it any wonder these high-salary companies drive the most economic growth? With the world’s brightest scratching at the door to work there, Apple enters new markets and tends to do very well. The Apple Watch has quietly turned into a $20bn revenue stream. The firm now owns 22% of the global smartwatch market share. We’ve seen the same story play out with tablets, phones, music players and more. Apple brings out a new product and it sells like mad. The February release of the Apple Vision Pro might bring another hit product. Will virtual reality take off? Who knows? But Apple has the resources and know-how to be at the heart of that or any other technological revolution. An expensive valuation might be a dealbreaker for some. Even after a recent $14 drop, Apple trades at just over 30 times earnings. That might deter bargain hunters. On the other hand, Apple has been called expensive for years yet it continues to deliver outstanding returns. If I’d bought £10,000 in Apple shares even five years ago, I’d now have £47,416. There’s no guarantee US tech firms will continue their dominance, but it’s a brave soul who bets against them or Apple. I won’t be one. I own the stock already and would possibly buy more if I had the spare cash.  Should you invest, the value of your investment may rise or fall and your capital is at risk. Before investing, your individual circumstances should be assessed. Consider taking independent financial advice. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. John Fieldsend has positions in Apple and Tesla. The Motley Fool UK has recommended Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. Views expressed on the companies mentioned in this article are those of the writer and therefore may differ from the official recommendations we make in our subscription services such as Share Advisor, Hidden Winners and Pro. Here at The Motley Fool we believe that considering a diverse range of insights makes us better investors. 22 March, 2024 |\n        Christopher Ruane Christopher Ruane examines why the Lloyds share price has surged by a quarter in a matter of weeks -- and… Read more » 22 March, 2024 |\n        Alan Oscroft A progressive and sustainable dividend policy, with a 10%+ yield? No wonder the Phoenix Group Holdings share price climbed on… Read more » 22 March, 2024 |\n        Christopher Ruane Christopher Ruane looks at a trio of UK shares with high yields -- one of which is due to fall… Read more » 22 March, 2024 |\n        John Fieldsend Where to look on the FTSE 100 stock for a £12K yearly passive income target? Our Foolish writer explains why… Read more » 22 March, 2024 |\n        Ben McPoland Our writer highlights one struggling FTSE 100 stalwart he'd happily snap up inside his Stocks and Shares ISA before 5… Read more » 22 March, 2024 |\n        Jon Smith Jon Smith explains how he'd focus on artificial intelligence and the banking sector when picking FTSE 100 stocks for long-term… Read more » 22 March, 2024 |\n        Zaven Boyrazian, MSc This FTSE 250 REIT is paying a chunky dividend yield! Zaven Boyrazian explains how he’d boost his portfolio income with… Read more » 22 March, 2024 |\n        John Fieldsend Despite the Footsie treading water, plenty of FTSE 100 stocks have achieved double-digit returns so far this year. But which… Read more » View All When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. Tax treatment depends on your individual circumstances and may be subject to future change. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. Read more about us >  We have taken reasonable steps to ensure that any information provided by The Motley Fool Ltd, is accurate at the time of publishing. Any opinions expressed are the opinions of the authors only. The content provided has not taken into account the particular circumstances of any specific individual or group of individuals and does not constitute personal advice or a personal recommendation. No content should be relied upon as constituting personal advice or a personal recommendation, when making your decisions. If you require any personal advice or recommendations, please speak to an independent qualified financial adviser. No liability is accepted by the author, The Motley Fool Ltd or Richdale Brokers and Financial Services Ltd for any loss or detriment experienced by any individual from any decision, whether consequent to, or in any way related to the content provided by The Motley Fool Ltd; the provision of which is an unregulated activity. The value of stocks, shares and any dividend income may fall as well as rise and is not guaranteed, so you may get back less than you invested. You should not invest any money you cannot afford to lose, and you should not rely on any dividend income to meet your living expenses. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, administrative costs, withholding taxes and different accounting and reporting standards. They may have other tax implications, and may not provide the same, or any, regulatory protection. Exchange rate charges may adversely affect the value of shares in sterling terms, and you could lose money in sterling even if the stock price rises in the currency of origin. Any performance statistics that do not adjust for exchange rate changes are likely to result in an inaccurate portrayal of real returns for sterling-based investors. Fool and The Motley Fool are both trading names of The Motley Fool Ltd. The Motley Fool Ltd is an appointed representative of Richdale Brokers & Financial Services Ltd who are authorised and regulated by the Financial Conduct Authority (FCA) (FRN: 422737). We publish information, opinion and commentary about consumer credit products, loans, mortgages, insurance, savings and investment products and services, including those of our affiliate partners. The Motley Fool Ltd. Registered Office: 5 New Street Square, London EC4A 3TW. | Registered in England & Wales. Company No: 3736872. VAT Number: 188035783. © 1998 – 2024 The Motley Fool. All rights reserved. The Motley Fool, Fool, and the Fool logo are registered trademarks of The Motley Fool Holdings Inc. "
}