{
    "title": "Dow Jones Rises 180 Points On Strong Jobs Data; Apple Dives On Downgrade, \nMobileye Crashes",
    "date": "1/4/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-ahead-of-jobs-data-jobless-claims-apple-stock-slides-on-downgrade/",
    "text": "BREAKING: Futures Rise; Tesla Skids On China Production Cut     The Dow Jones Industrial Average rallied 180 points Thursday as Wall Street digested a stronger-than-expected jobs report and fewer-than-expected unemployment claims that could tip the balance for stocks going forward. Meanwhile, Apple stock sold off on another analyst downgrade. And Mobileye Global (MBLY) crashed after the company warned that 2024 sales will be below estimates because of excess inventory at its customers. After the opening bell, the Dow Jones Industrial Average gained 0.5%, while the S&P 500 gained 0.3%. The tech-heavy Nasdaq composite declined 0.1% in morning action. Among U.S. exchange traded funds, the Nasdaq 100 tracker Invesco QQQ Trust (QQQ) was down 0.3%, while the SPDR S&P 500 ETF (SPY) rose a fraction. Oil prices looked to add to Wednesday's solid rebound, as West Texas Intermediate futures climbed Thursday morning. WTI futures held right at $73 a barrel. Magnificent Seven stock Apple (AAPL) sold off 1.5% Thursday after Piper Sandler downgraded the stock from overweight to neutral, lowering its price target to 205 from 220. The analyst firm cited a weak macro environment in China that it said will negatively impact demand for iPhone. Apple traded further below its 50-day line Wednesday, with a 0.75% decline. Shares are also below a 192.93 buy point. Mobileye shares crashed 27% Thursday morning after the company released preliminary fourth-quarter results and a weak 2024 outlook before the market open. The maker of advanced driver-assistance systems predicted 2024 sales of $1.9 billion at the midpoint, well below forecasts for $2.56 billion. Mobileye cited excess inventory at its customers. Early Thursday, the ADP employment report showed an increase of 164,000 jobs in December, above the 115,000 estimate and up from November's 103,000 gain. ADP's employment report is a precursor to Friday's jobs report from the Labor Department. Meanwhile, initial unemployment claims surprisingly fell to 202,000 vs. 218,000 in the previous week. They were expected to edge lower to 217,500. Stock Market Forecast 2024: A Soft Landing May Not Bring The Gains You Expect The tech-heavy Nasdaq composite led the stock market lower Wednesday, as it declined 1.2%. The Dow Jones industrials and S&P 500 followed up with losses of around 0.8% each. Wednesday's Big Picture column commented, \"As a result, the Market Pulse after the action in stocks today reflects a cluster of four distribution days on the S&P 500 — four bouts of unusually strong profit taking by fund managers — in the space of just nine trading sessions.\" Now is an important time to read IBD's The Big Picture column amid the continuing stock market rally. Be sure to read how to adjust to changing market conditions, with IBD's new exposure levels. Learn How To Time The Stock Market With IBD's ETF Market Strategy Magnificent Seven player Alphabet (GOOGL), Celsius (CELH), Netflix (NFLX) and Snowflake (SNOW) — along with Dow Jones components Amgen (AMGN), Caterpillar (CAT) and Visa (V) — are among the best stocks to buy and watch in the current market rally. Caterpillar and Nvidia are featured in this Stocks Near A Buy Zone column. Get Real-time Buy And Sell Alerts On Stock Market Leaders With IBD Leaderboard Drug leader Amgen added to Tuesday's breakout gains past a 288.46 official buy point in a flat base, with a 1.1% rise Wednesday. AMGN stock rose 0.5% early Thursday. Heavy machinery giant Caterpillar ended Wednesday about 3% below its 293.88 buy trigger, amid a 2.9% drop. CAT stock was down a fraction Thursday morning. Payments leader Visa remains in buy range above a 250.06 entry in a cup base, according to IBD MarketSmith pattern recognition. V stock rose 0.2% Thursday. 4 Top Growth Stocks To Watch In The Stock Market Rally Alphabet remains below its 139.42 buy point in a cup with handle following a 0.5% gain Wednesday, according to IBD MarketSmith. GOOGL stock fell 0.5% early Thursday. Netflix moved up 0.4% Wednesday, still squarely below a 482.70 buy point out of a cup with handle. NFLX stock rose 0.5% Thursday morning. Fitness drink leader Celsius tumbled more than 6% Wednesday, nearly giving up the entirety of Tuesday's big gains. Investors could view the recent strength as an aggressive entry, but it's clearly a tough trade at this point. The official buy point is 68.95. Investors could use 62.99 or a downward-sloping trendline as other early entries. CELH stock climbed 3% Thursday morning. Artificial intelligence leader Snowflake extended the week's losses Wednesday, falling 2.6% and dropping further below a cup-with-handle's 192.66 buy point. SNOW stock gained 0.6% early Thursday. IBD's latest newsletter MarketDiem gives you actionable ideas for stocks, options and crypto right in your inbox These are four best stocks to watch in today's stock market, including a Dow Jones leader. Join IBD experts as they analyze leading stocks in the current stock market rally on IBD Live Magnificent Seven stocks Nvidia (NVDA) and Tesla (TSLA) traded higher Thursday morning. NVDA stock was up 0.7%, while Tesla shares gained 0.9%. Nvidia ended Wednesday's session down 1.2%, holding just below a double-bottom base's 476.09 entry. Nvidia, an IBD Leaderboard stock, also is now forming a flat base that has a 505.48 buy point. A test of the 50-day line seems likely after the recent weakness. Electric-vehicle giant Tesla skidded 4% Wednesday, finishing about 2% above the 50-day line. Tesla stock has a big double-bottom pattern with conventional buy point of 278.98. Among Dow Jones components in the Magnificent Seven, Microsoft (MSFT) traded higher after Thursday's stock market open. Microsoft stock inched lower Wednesday, still holding above a 366.78 cup-base buy point. And the software giant was up 0.3% Thursday morning. Be sure to follow Scott Lehtonen on X, formerly known as Twitter, at @IBD_SLehtonen for more on growth stocks and the Dow Jones Industrial Average. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders Nvidia, Tesla, Meta Reveal Rules For Santa Claus Rally And Beyond Spot Buy Points And Sell Signals With MarketSmith Pattern Recognition 3/22/2024\nFutures rose slightly early Friday with FedEx set to break out. Lululemon and Nike are earnings losers, with Tesla falling... 3/22/2024\nFutures rose slightly early Friday with FedEx set to break... Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}