{
    "title": "Apple board members Al Gore, James Bell to retire",
    "date": "1/12/2024",
    "url": "https://www.foxbusiness.com/technology/apple-board-members-al-gore-james-bell-to-retire",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Woodshaw Financial Group principal D.R. Barton analyzes the stock market ahead of its opening, revealing his top tech stocks for investors. The composition of Apple’s board will soon change as two longtime members are retiring. Apple said Thursday that both former Vice President Al Gore and former Boeing CFO James Bell will step down. Their retirements from the board will become effective in late February, marking the respective ends of a 21-year tenure for Gore and a nine-year tenure for Bell, Apple said in a filing with the Securities and Exchange Commission. Former Vice President Al Gore attends the UK premiere of \"An Inconvenient Sequel: Power To Truth\" at Somerset House on Aug. 10, 2017, in London, England. (Dave J Hogan/Dave J Hogan/Getty Images / Getty Images) Apple CEO Tim Cook praised Gore for \"contribut[ing] an incredible amount\" to Apple’s work related to privacy and environmentalism and Bell for the \"important perspectives and deep expertise he’s offered on audit, finance, and so much more over the years.\" MICROSOFT BRIEFLY OVERTAKES APPLE AS WORLD'S MOST VALUABLE COMPANY Apple said its policy \"generally\" limiting board members from re-election once they turn 75 precipitated Gore and Bell’s upcoming departures from the board. James A. Bell speaks during the Martin Luther King, Jr. Memorial Dream Gala at Hilton Hotel on Oct. 15, 2011, in Washington, D.C. (Paul Morigi/WireImage for Tommy Hilfiger / Getty Images) At the same time, the tech giant tapped former Aerospace Corporation CEO Wanda Austin as a new board nominee. \"Like Apple, I’ve always believed in the power of innovation to improve lives, support human potential, and shape a better future,\" Austin said. Her resume also includes board positions at biotech firm Amgen and energy giant Chevron. APPLE CEO TIM COOK TELLS DUA LIPA HOW LONG HE'LL REMAIN IN THE ROLE The company most recently brought on new board members in 2021. The Apple Inc. logo at one of the company's stores in Sydney, Australia, on March 18, 2022. (Photographer: Brent Lewin/Bloomberg via Getty Images / Getty Images) Apple said in an SEC filing that it will put Austin’s name forward at its Feb. 28 annual meeting along with seven other existing directors up for re-election, including former Northrop Grumman CEO and Apple Audit Committee Chair Ron Sugar, even though he is 75 years old. APPLE VISION PRO HEADSET: LAUNCH DATE, PRICING UNVEILED In recent months, the company has rolled out several products, including its iPhone 15 slate, the Apple Watch Series 9 and new iterations of its iMac and MacBook Pro. Earlier this week, it set the U.S. release of its Vision Pro augmented reality headset for February. Apple Inc Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}