{
    "title": null,
    "date": "2/13/2024",
    "url": "https://nairobinews.nation.africa/ruto-says-apple-has-employed-23000-kenyans-react/",
    "text": "President William Ruto has announced that Apple, an American multinational technology company headquartered in California, has employed 23,000 Kenyans in Nairobi. But a majority of Kenyans are struggling to believe their Head of State. X users, formerly Twitter, shared their opinion on the announcement, with some applauding the firm known for manufacturing Iphone. Others questioned the accuracy of these numbers as presented by the Head of State. “And they believed him?” posed one user. “Apple’s total workforce is 160,000. The President is saying that 15% of Apple’s workforce is in Nairobi. I guess they have run out of space.” “What hurts is knowing your President is busy moving around with lies yet many Kenyans out here are jobless and Apple has probably less than 100 employees in Kenya,” claimed Sholla 🇰🇪 @Haaland_sholla “This is not true. Apple has a global workforce of 161,000. There is no way that 14.3% (23,000/161,000) of Apple’s employees are stationed in Nairobi or the entire country,” said Antony Alexanderia Irungu In his address at the World Governments Summit in Dubai, UAE, President Ruto celebrated Kenya’s strides in the technology sector. He shared a revelation from his September 2023 trip to the United States for the U.S.-Kenya Business Roadshow, disclosing that Tim Cook, the CEO of Apple, informed him that the multinational company employs approximately 23,000 Kenyan individuals in Nairobi. President Ruto emphasized this information as he advocated for support for the digital economy, portraying it as a wellspring of remote opportunities, particularly beneficial for young individuals who can engage in meaningful work without leaving their homes. “The digital economy is delivering attractive opportunities for young people, to work for employers scattered across the world without having to leave their homes in Kenya,” Ruto noted. “When I visited Silicon Valley last year, Apple’s Tim Cook informed me that his company now employs about 23,000 Kenyans, all working from Nairobi.” Also read: Janet Mbugua shares ‘Dark Valentine’ vigil plan KPLC announces full resumption of token purchase service Nairobi News is now available on Telegram. For handpicked stories every day, subscribe to our channel today. Po is gearing up to become the spiritual leader of his... A vicious beaver blankets the jungle with a dangerous pink... Jamaican singer-songwriter Bob Marley overcomes adversity... Bizarre Bazaar Festival is the largest open-air market in... #TributeSeries... Celebrate 60 years of AFC Leopards with the ultimate fan... "
}