{
    "title": "Meta to charge extra for boosted posts on Instagram, Facebook after Apple \nchange",
    "date": "2/15/2024",
    "url": "https://www.theverge.com/2024/2/15/24073228/meta-apple-tax-facebook-instagram-boosted-posts",
    "text": "By  Emma Roth, a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO. Meta said Thursday that it will start charging a 30 percent fee when advertisers pay to boost the visibility of their posts in Facebook’s and Instagram’s iOS apps. The change, which goes into effect later this month, stems from a 2022 App Store update where Apple extended its typical 30 percent cut of digital purchases to boosted posts, which are essentially ads. The change particularly targeted Meta and other social apps that let people pay in app to increase the reach of their content. Meta notes in a statement shared with The Verge that small business owners and influencers who want to purchase a boost on iOS will now be billed through Apple, “which retains a 30% service charge on the total ad payment, before any applicable taxes.” Meta says people can still purchase boosts from Instagram’s and Facebook’s websites on desktop or mobile to get around the Apple fee that is being passed on to iOS users. “We are required to either comply with Apple’s guidelines, or remove boosted posts from our apps,” the company says. “We do not want to remove the ability to boost posts, as this would hurt small businesses by making the feature less discoverable and potentially deprive them of a valuable way to promote their business.” Additionally, Meta says those who want to boost posts through its iOS apps will now need to add prepaid funds and pay for them before their boosted posts are published. Meta will charge an extra 30 percent to cover Apple’s transaction fee for preloading funds in iOS as well. This new payment process will roll out in the US first before hitting “additional markets and countries” later in the year. “We have always required that purchases of digital goods and services within apps must use In-App Purchase,” Apple spokesperson Adam Dema says in an emailed statement to The Verge. “Boosting, which allows an individual or organization to pay to increase the reach of a post or profile, is a digital service — so of course In-App Purchase is required. This has always been the case and there are many examples of apps that do it successfully.” Meta is one of the many companies that has waged criticism against Apple and its new policies in recent months. After introducing a 27 percent tax on alternative payment methods in the US, Apple also announced plans to start allowing developers in the European Union to have their apps exist on alternative app stores, as long as they pay a brand-new “Core Technology Fee.” Update Thursday, February 15th, 10:51AM ET: Added a statement from Apple. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}