{
    "title": "Neural Notes: Apple enters the AI chat, RIP Google Bard",
    "date": "2/9/2024",
    "url": "https://www.smartcompany.com.au/technology/artificial-intelligence/neural-notes-apple-vision-pro-chatgpt-ai-google-bard/",
    "text": "Source: SmartCompany via Canva/Adobe Stock Welcome back to Neural Notes: A weekly column where I condense some of the most interesting and important AI news of the week. In the latest edition, we have ChatPwC, RIP Google Bard and Apple’s first generative AI play. Oh, and ChatGPT is now on the Apple Vision Pro now for some reason. If it wasn’t already abundantly clear that AI is everywhere, PwC is here to remind you with its very own generative AI bot — ChatPwC. According to the Australian Financial Review, the platform has been rolled out to its 8,400 staff after a six-month flirtation with around a thousand employees. According to the company, ChatPwC does everything from jazzing up data to penning emails and summarising meetings. The long-term plan is to hook ChatPwC up to more of its data and systems to provide a more comprehensive service. Powered by a cocktail of AI models, including ChatGPT of course, ChatPwC promises to amp up productivity and polish client work. But it’s not quite an AI free-for-all, PwC’s laid down some rules. Staff have to complete an internal training program. And while the firm hasn’t actively blocked other generative AI platforms, it doesn’t want chit-chat with external bots about work or client intel. PwC has also said that a human will still have the final say over any AI-generated work. Apple didn’t jump on the generative AI train as quickly as every other US tech giant. And this is on brands for the company that tends to wait out new tech trends — largely avoiding the bugs and teething issues that come with them. By the time it does come to the party, it takes more of an ‘innovation’ approach, appearing to have perfected the technology for a wider consumer audience. A perfect example has been the foldable phone hype that has been gradually sweeping across the Android landscape for the past years. It wasn’t until just this week that it seemed that Apple was finally making a move into this space. And the same largely goes for generative AI. While there was news last year of Apple making a breakthrough in deploying large language models (LLMs) on iPhones — we now have something a little more tangible. This week Apple released an open-source AI model that can edit images via text instruction. Named MGIE (MLLM-Guided Image Editing), it has been developed in partnership with researchers from the University of California. MGIE can enhance the overall look of an image as well as make precise edits like adding filters or altering backgrounds. If you’re keen to play around with it, it’s now live on GitHub. But that’s not the only A(I)pple news of the week. OpenAI has now created a ChatGPT app for VisionOS, the operating system for Apple Vision Pro. ChatGPT doesn’t actually have a 3D element to it yet, but sure, why not! At present, it more or less behaves exactly like the browser/mobile app versions of ChatGPT. However, it does let you ask your questions out loud since you’re, you know, wearing a headset. So that’s something. chat has now entered the 3D world. you can find it in the visionOS App Store. pic.twitter.com/TethfMEc9j — ChatGPT (@ChatGPTapp) February 2, 2024  If you somehow hadn’t had enough Google Gemini news over the past few weeks, don’t worry, it’s never-ending. As we have reported repeatedly since December, Google has been incrementally rolling out its various versions of Google Gemini. And the latest has heralded the final nail in the coffin for Google Bard. If you cast your mind back to early 2023, Google Bard was the tech giant’s first attempt at an answer to ChatGPT. It was rushed and this inevitably led to problems with the platform. In fact, when the platform publicly answered a simple trivia question incorrectly, it caused the Alphabet share value of parent company Alphabet to drop by US$100 billion. Now Google Bard is finally no more, with the new family of Google’s AI models falling under the Gemini umbrella. The idea is for Gemini to be scalable and usable across large data centres as well as on personal mobile devices. As a refresher, these are various Geminis: This week marks the release of the Ultra, the most powerful of the Gemini models, and one that is definitely more aimed at enterprise customers. It will be available for US$20 per month through Google One. With it comes 2TB  and access to Gemini in Google Workspace apps like Docs, Slides, Sheets and Meet. It’s worth noting that Google is also sunsetting the Duet AI brand it announced last year, rolling it into Gemini instead. In other Google AI news, it is launching a Gemini app for Android (it can also be accessed in the iOS Google app) and letting you replace Google Assistant with Gemini. It also turns out that Google saves Gemini conversations by default, and holds onto them for years. If you’d like it to not do that, go to the My Activity dashboard and turn off Gemini Apps Activity. It’s honestly been quite a confusing AI journey for Google so far thanks to Bard, Duet and Gemini. Here’s to hoping having a single, streamlined brand will make things a little less headache-inducing. That’s it. That’s the update, and this early 2000s PC user is here for it.  SmartCompany is committed to hosting lively discussions. Help us keep the conversation useful, interesting and welcoming. We aim to publish comments quickly in the interest of promoting robust conversation, but we’re a small team and we deploy filters to protect against legal risk. Occasionally your comment may be held up while it is being reviewed, but we’re working as fast as we can to keep the conversation rolling. The SmartCompany comment section is members-only content. Please subscribe to leave a comment. The SmartCompany comment section is members-only content. Please login to leave a comment. SmartCompany is the leading online publication in Australia for free news, information and resources catering to Australia’s entrepreneurs, small and medium business owners and business managers. SmartCompany acknowledges the Traditional Owners of the many nations across Australia, and pay our respect to Elders past and present. We recognise that their sovereignty has never been ceded. Just fill out the fields below and we'll send your friend a link to this article along with a message from you. "
}