{
    "title": "Epic Games CEO suggests Apple broke iPhone web apps in the EU for \nanticompetitive reasons",
    "date": "2/16/2024",
    "url": "https://techcrunch.com/2024/02/16/epic-games-ceo-suggests-apple-broke-iphone-web-apps-in-the-eu-for-anticompetitive-reasons/",
    "text": "After Apple confirmed yesterday it’s breaking web apps for customers in the EU due to its compliance with the EU regulation the Digital Markets Act (DMA), Epic Games CEO Tim Sweeney suggests in a post on X there’s another reason behind Apple’s decision: iPhone web apps don’t make Apple money. Sweeney, whose company sued Apple over antitrust concerns related to App Store fees, is obviously a biased source on the matter, but he raises a question that’s on everyone’s minds. Did Apple break iPhone web apps because it was looking to protect customers from security risks arising from third-party browser engines, as it claims, or was the decision more about quashing a potential threat to Apple’s business? Would Apple really go so far as to degrade the consumer experience on iPhone to protect its revenue, in other words? The iPhone maker on Thursday published an update to its website detailing its DMA-related changes in the EU to address the matter, after the discovery that iPhone web apps — also known as progressive web apps, or PWAs — were no longer functional in the recent iOS betas in the EU. Initially, there was concern that the issues were just a beta bug, but Apple soon put that theory to rest. On its website, Apple explains that to comply with the DMA, it’s being forced to support other web browser engines besides WebKit — the browser engine used by Safari. iOS Home Screen web apps have relied on WebKit and its security architecture to keep users safe from online threats. This involves the isolation of storage and the enforcement of “system prompts to access privacy-impacting capabilities,” Apple said. Without this isolation and enforcement, malicious web apps could read data from other apps and gain access to a user’s camera, microphone or location with user consent, the company noted. Since Apple is being forced to allow alternative browser engines via the DMA’s requirements, the company chose not to put users at risk and instead degraded the web app experience on iOS for users in the EU. Now, web apps will function as website bookmarks — without support for local storage, badges, notifications and dedicated windowing. I suspect Apple’s real reason for killing PWAs is the realization that competing web browsers could do a vastly better job of supporting PWAs – unlike Safari’s intentionally crippled web functionality – and turn PWAs into legit, untaxed competitors to native apps. https://t.co/RrqQamVdYX — Tim Sweeney (@TimSweeneyEpic) February 15, 2024  Though Sweeney arguably has a bone to pick with Apple, there may be some truth to his claims. Within Apple’s explanation of why it has ended support for web apps in the EU, the company admits there’s a technical solution to the security issues problem — but it simply chose not to implement it. Apple wrote (emphasis ours): Addressing the complex security and privacy concerns associated with web apps using alternative browser engines would require building an entirely new integration architecture that does not currently exist in iOS and was not practical to undertake given the other demands of the DMA and the very low user adoption of Home Screen web apps. In short, Apple is saying it knows how to fix the problem but because it’s been burdened by having to comply with the DMA — which it noted had required “more than 600 new APIs and a wide range of developer tools” — it decided to skip fixing this one. While it may be no small feat to build “an entirely new integration architecture,” it also isn’t as if Apple was surprised by the DMA, a regulation that’s been in the works for years. It had time to prepare for this. To further deflect any culpability here, Apple suggests that people won’t mind that it broke Home Screen web apps, given their “low user adoption.” But Apple’s own moves contradict that explanation. If anything, Apple has been working to make PWAs more useful over the years, adding features that allowed web apps to function more like native apps, and be easily distributed outside its App Store. Meanwhile, user adoption has been growing, not shrinking. Analysts estimated that the PWA market would reach $10.44 billion by 2027, at a compound annual growth rate of 31.9%. It’s entirely possible that alternative browser engines could make PWAs even more useful, as Sweeney argues, which would be a threat to Apple’s App Store business, given the web apps are now nearly as functional as native apps are. Apple had been asked to comment on its decision around PWAs, but it only published an explanation to its DMA website as its response. Apple confirms it’s breaking iPhone web apps in the EU on purpose  Apple’s answer to EU’s gatekeeper rules is new ‘core tech’ fee for apps  "
}