{
    "title": "Mark Zuckerberg takes aim at rival Apple over Vision Pro headset",
    "date": "2/14/2024",
    "url": "https://www.breakingnews.ie/business/mark-zuckerberg-takes-aim-at-rival-apple-over-vision-pro-headset-1588714.html",
    "text": "Martyn Landi, PA Technology Correspondent Mark Zuckerberg has taken a swipe at Apple’s new Vision Pro spatial computing headset, saying his firm’s Quest headsets are “so much better” at most tasks. The Meta founder said having now tried Apple’s Vision Pro device, which was released in the US earlier this month, he was “surprised” how much better he believes Meta’s Quest devices are despite being “seven times less expensive”. The Vision Pro costs $3,500, while the Meta Quest costs around $500.     Speaking in a video post to his Instagram page, Mr Zuckerberg gave a short review of his experience with the Vision Pro, and while complimenting the Apple device’s eye-tracking feature – which enables users to control the device using their eyes – the Meta founder claimed his company’s devices were superior. “I have to say that before this, I expected that Quest would be the better value for most people since it’s really good and it’s seven times less expensive, but after using it, I don’t just think Quest is the better value, I think Quest is the better product, period,” he said. “Overall, Quest is better for the vast majority of things that people use mixed reality for now. “I think it’s just a lot more comfortable, and we designed it to weigh 120 grams less which makes a really big difference on your face. “There’s no wires that get in the way when you move around – it’s a big deal.” He added that he believed the Quest had a bigger field of view along with a brighter screen. “Honestly, I’m pretty surprised that Quest is so much better for the vast majority of things that people use these headsets for with that price differential,” he said. The tech billionaire ended the video by acknowledging that some “fanboys” would criticise him or others who “dare to question if Apple is going to be the leader” in a certain technology sector. He then compared the growing mixed reality headset market to the smartphone and PC markets, and how Apple’s “closed” model, where it controls what appears on its devices, had been historically successful in some sectors, but not others. “The reality is that every generation of computing has an open and a closed model,” he said. “And yeah, in mobile, Apple’s closed model won, but it’s not always that way – if you go back to the PC era, Microsoft’s open model was the winner. “In this next generation, Meta is going to be the open model, and I really want to make sure that the open model wins out again.”  Message submitting... Thank you for waiting.  Want us to email you top stories each lunch time? "
}