{
    "title": "12 Best NYSE Penny Stocks To Buy",
    "date": "2/21/2024",
    "url": "https://finance.yahoo.com/news/12-best-nyse-penny-stocks-151759910.html",
    "text": "In this article, we will take a detailed look at the 12 Best NYSE Penny Stocks To Buy. For a quick overview of such stocks, read our article 5 Best NYSE Penny Stocks To Buy. Markets wavered as latest data showed inflation in January 2024 was hotter-than-expected. But many analysts believe the markets overreacted as a single month's data can only delay the Fed's planned rate cuts for 2024. UBS Global Wealth Management on February 20 said it expects the Federal Reserve to begin cutting rates in June instead of May. UBS expects the first rate cut to be of 25 basis points. \"Given the upside surprises to both payrolls and inflation, we now expect the Fed to wait a bit longer before cutting rates,\" UBS economists said in a note. UBS is expecting 75 bps of cuts in 2024, lower than its previous estimate of 100 bps cuts. The era of elevated interest rates might be prolonged amid a resilient labor market and stubborn inflation but sooner or later the Fed will begin to cut rates. That means good times might be coming for small-cap stocks or risky equities, including penny stocks, which have hitherto suffered as investors' shunned smaller companies to find refuge in high quality stocks like Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA). Historical data showed small-cap stocks perform exceptionally well in the first 12 months of the Fed's first rate cut. Lord Abbett in its December 2023 report took a detailed look at what the private investment management company called a dovish \"pivot\" of the Federal Reserve where it hinted that its interest rate cycle might have peaked. The Lord Abbett report also said small-cap companies perform well during rate cuts. \"Currently, in fixed income, we find the short duration space to be attractive and underallocated. A “bull-steepening” environment, like what we’ve seen when the Fed turns dovish on policy, favors short duration. At the same time, the normalized rate environment can make active, opportunistic credit an attractive diversifier with expected returns at current yields rivaling equities. Equities, particularly small caps, historically have done very well when inflation falls and in Fed rate-cut cycles while growth equities have done well when growth slows. Finally, a more normalized rate environment means less of the “financing for everyone” that was prevalent in the zero-interest-rate era. Going forward, quality companies with greater financial strength should be able to differentiate in terms of financial performance and demand a premium. All in all, the Fed’s dovish December pivot shocked the markets and set the table for better performance by risk assets in 2024. What a difference a week can make,\" the report added. Image: Depositphotos For this article we first used a stock screener to identify NYSE stocks trading under $5. From the resultant data set we picked 12 penny stocks with the highest number of hedge fund investors. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). Number of Hedge Fund Investors: 20 While Ginkgo Bioworks Holdings Inc (NYSE:DNA) shares have lost about 42% over the past one year, 20 hedge funds tracked by Insider Monkey had stakes in Ginkgo Bioworks Holdings Inc (NYSE:DNA) as of the end of the third quarter. According to Yahoo Finance data the stock's one-year average price estimate is $3.08 while its stock price as of February 3 was $1.25. This shows the stock has an upside potential of 146%. Ginkgo is a small company and unlike stocks like Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA), which are highly popular among hedge funds, this stock does not have a high number of hedge fund investors. Number of Hedge Fund Investors: 20 Supply chain management platform company E2open Parent Holdings Inc (NYSE:ETWO) ranks 11th in our list of the best NYSE penny stocks to buy according to hedge funds. Earlier this month E2open Parent Holdings Inc (NYSE:ETWO) posted fiscal third quarter results. Adjusted EPS in the period came in at $0.04, meeting estimates. Revenue fell 5.2% year over year to $156.4 million, beating estimates by $2.14 million. Out of the 910 funds tracked by Insider Monkey, 20 funds had stakes in E2open Parent Holdings Inc (NYSE:ETWO). The biggest hedge fund stakeholder of E2open Parent Holdings Inc (NYSE:ETWO) during this period was Snehal Amin's Windacre Partnership which owns a $131 million stake in E2open Parent Holdings Inc (NYSE:ETWO). Liberty Park Capital made the following comment about E2open Parent Holdings, Inc. (NYSE:ETWO) in its Q2 2023 investor letter: “E2open Parent Holdings, Inc. (NYSE:ETWO) reported much lower-than-expected forward guidance when it announced its fiscal 2023 results. Given the tailwinds that other supply chain software companies are taking advantage of, we lost confidence in the company’s current ability to execute and closed the position. We continue to view the supply chain software space favorably and would consider revisiting the stock in the future.” Number of Hedge Fund Investors: 21 Hyperlocal social networking platform company Nextdoor Holdings Inc (NYSE:KIND) ranks tenth in our list of the best NYSE penny stocks to buy according to hedge funds. In November last year Nextdoor Holdings Inc (NYSE:KIND) announced a cost reduction plan which included layoffs affecting 25% of its workforce. Nextdoor Holdings Inc (NYSE:KIND) also said its CFO was departing. As of the end of the third quarter of 2023, 21 hedge funds out of the 910 funds tracked by Insider Monkey were long Nextdoor Holdings Inc (NYSE:KIND). The most notable stake in Nextdoor Holdings Inc (NYSE:KIND) is owned by Catherine D. Wood's ARK Investment Management which owns a $13 million stake in Nextdoor Holdings Inc (NYSE:KIND). Number of Hedge Fund Investors: 21 Perimeter Solutions SA (NYSE:PRM) was trading at $4.99 as of mid-day trading on February 3. Of the 910 hedge funds in Insider Monkey's database of elite money managers, 21 funds had stakes in the firefighting products and lubricant additives company Perimeter Solutions SA (NYSE:PRM). Here is what Weitz Multi Cap Equity Fund has to say about Perimeter Solutions, SA (NYSE:PRM) in its Q3 2023 investor letter: “Perimeter Solutions, SA (NYSE:PRM), the leading provider of fire retardants and firefighting foam, experienced weakened quarterly results due to a decline in wildfire activity, particularly in its largest market, California. Acres burned this year have been significantly below average, diminishing cash flow and obscuring the company’s potential earnings power in a more typical year.” Number of Hedge Fund Investors: 22 Online learning platform company Nerdy Inc (NYSE:NRDY) is one of the top penny stocks on the NYSE. As per Insider Monkey's database of 910 hedge funds 22 funds had stakes in Nerdy Inc (NYSE:NRDY). According to Nerdy Inc's (NYSE:NRDY) third quarter results posted in November 2023, Nerdy Inc's (NYSE:NRDY) revenue in the period jumped 26.7% year over year. In addition to NRDY, hedge funds are also piling into Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA). Number of Hedge Fund Investors: 22 eVTOL aircraft company Archer Aviation Inc (NYSE:ACHR) shares have gained about 56% over the past one year. It is one of the best NYSE penny stocks to buy according to hedge funds. Last month Archer Aviation Inc (NYSE:ACHR) said it entered into a deal with NASA. The partnership will focus on studying high-performance battery cells and safety testing targeted for Advanced Air Mobility and space applications. NASA intends to test Archer Aviation Inc's (NYSE:ACHR) battery cell and system design and share the results to push the entire Advanced Air Mobility industry forward. As of the end of the third quarter of 2023, 22 hedge funds out of the 910 funds tracked by Insider Monkey were long Archer Aviation Inc (NYSE:ACHR). In November, during its Q3 earnings call, the company talked about its long-term plans: \"I’m excited about our announcement earlier today that Archer and InterGlobe Enterprises, India’s foremost air travel and hospitality conglomerate, plan to launch an electric air taxi service together across India in 2026. Earlier this week in New Delhi, my team held a signing ceremony with Rahul Bhatia, the Group Managing Director of InterGlobe, to announce our plans to work with InterGlobe to bring safe, sustainable and low-noise electric air taxi services to some of the most highly populated cities in the world. As part of the initiative, we will work with InterGlobe to set up an entity and will work with select in-country business partners to operate Archer’s Aircraft, enhance and build vertiport infrastructure, and train pilots and other personnel needed for these operations. InterGlobe and Archer also anticipate the purchase of up to 200 of our Midnight aircraft as we bring up operations. India is an incredibly important market for eVTOL, and it has the potential to be one of the largest in the world, with Delhi, Bengaluru and Mumbai being our initial focus where congestion costs cities over $22 billion annually. In these cities, traffic congestion contributes to 20% to 25% of the outdoor pollution, and I hope that Archer can be a part of reducing that over the next decade. I founded Archer to help give back time to millions of people and to make cities smarter, better, cleaner, more efficient places to live. Now that Midnight is flying and we are well along the pathway to commercialization, it’s clear that major cities around the world have the same goals as Archer does.\" Read the entire earnings call transcript here. Number of Hedge Fund Investors: 24 Canadian crude oil and natural gas company Baytex Energy Corp (NYSE:BTE) is one of the best NYSE penny stocks to buy according to smart money investors. In December, Baytex Energy Corp (NYSE:BTE) said its board approved a FY 2024 budget for $1.2 billion -$1.3 billion in exploration and development spending. Baytex Energy Corp (NYSE:BTE) targets full-year production of 150K-156K boe/day. As of the end of the third quarter of 2023, 24 hedge funds out of the 910 funds in Insider Monkey's database of funds were long Baytex Energy Corp (NYSE:BTE). Click to continue reading and see the 5 Best NYSE Penny Stocks To Buy.  Suggested Articles: 12 Cheap Penny Stocks to Buy According to Hedge Funds 10 Cheap Penny Stocks To Buy Now 13 Cheap Penny Stocks to Buy According to Hedge Funds Disclosure. None. 12 Best NYSE Penny Stocks To Buy was initially published on Insider Monkey. Related Quotes "
}