{
    "title": null,
    "date": "2/24/2024",
    "url": "https://tech.hindustantimes.com/mobile/news/apple-iphone-scam-celebs-unwittingly-promote-35-mn-fraud-global-hunt-on-for-scamster-71708764169658.html",
    "text": "Copyright © HT Media Limited  All rights reserved. A sophisticated Apple iPhone scam has emerged in Iran, amassing a staggering $35 million, with celebrities unwittingly roped in to endorse the fraudulent scheme. Exploiting the absence of Apple's official presence due to US sanctions, the orchestrator of the scam has been traced by Iranian authorities, paving the way for potential extradition through Interpol. Iran, under US sanctions due to its actions in the Persian Gulf and alleged support for terrorism, creates an unconventional market for Apple products. Since the tech giant cannot directly sell iPhones in the country, Iranians often resort to purchasing them abroad and importing them for resale, forming a humming iPhone gray market. Seizing this opportunity, the alleged scammer positioned his operation as a more affordable alternative, cutting out middlemen. Also check: Apple iPhone 15 The Financial Times via 9to5mac discloses that Kourosh Company, operating from Tehran, enticed customers with half-priced iPhone deals, claiming to save costs by eliminating intermediaries. Headed by entrepreneur Amir Hossein Sharifian, the company leveraged high-profile endorsements from Iranian sports figures and celebrities, luring in unsuspecting victims, particularly young enthusiasts dreaming of owning the latest Apple gadget. However, after an agonizing 45-day wait for delivery, most customers discovered the harsh reality- the iPhones never arrived. A subsequent police investigation uncovered Sharifian's departure from the country, but authorities, in collaboration with Interpol, are diligently working to bring him back to face charges. In a surprising twist, Sharifian admitted owing money to clients in a YouTube interview, acknowledging a debt of approximately $2.7 million, contrary to the $35 million reported by local media. Celebrities associated with the promotion seem to have been oblivious to the scam, yet public outrage and calls for accountability have swirled around them. Amidst the scandal, questions arise about the company's ability to secure permits and operate, fueling speculations of potential government corruption. The aftermath of this fraudulent episode leaves a trail of disillusioned customers and tarnished reputations, prompting a deeper examination into the intersections of celebrity endorsements, business operations, and regulatory oversight. Smartphones and kids don't mix well! It was inevitable that access to such power and convenience would exact a price.  Increasingly, it appears the most unanticipated and unacceptable has been our children's mental health. Check out the details here. Human-like robots! Big technology names are investing in a business that's developing human-like robots. This is part of a scramble to find new applications for artificial intelligence. Read all about it here. If you enjoyed reading this article, please forward it to your friends and family. Reddit brews controversy! AI will become an important part of Reddit's business. It is looking to tap into a revenue stream that could be both lucrative and controversial.  Some interesting details in this article. Check it out here. If you enjoyed reading this article, please forward it to your friends and family. Exciting fare on the cards! Spaceman, and Iwaju are some of the new TV, movies, music and games headed to a device near you. Check out what all is on offer here. Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71708764169658 "
}