{
    "title": "Apple shifted focus from EVs to AI",
    "date": "2/29/2024",
    "url": "https://finimize.com/content/ditch-it-yourself",
    "text": "Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software 23 days ago  •  2 mins What’s going on here? Apple scrapped plans to build the self-driving iCar after a decade of development, perhaps disappointed it didn't autonomously make a success of itself. What does this mean? Apple put “Project Titan” into motion in 2014, sketching plans for a self-driving electric vehicle with a swanky limo-style layout. A company needs to be pretty confident in its driverless car to put it on the roads, though – and even after a decade, Apple’s just not there. That’s why the iCar team has switched its focus to generative AI, the type of technology that fuels OpenAI’s ChatGPT. Apple’s already teasing more progress than it did with its eco-friendly limousine, dropping hints earlier this year that investors can expect a serious announcement in the not-too-distant future. Why should I care? Zooming out: Apple’s been reading the news. Apple might not be missing out on much. Drivers aren’t buying electric cars like they once were, mainly because their higher prices are less justifiable in today’s economy. So realistically, the iCar wouldn’t have helped Apple catch up to competitors Google, Amazon, and Microsoft. But if Apple can craft an AI service that takes its signature iPhones and iPads to the next level, the company could win big-spending gadget aficionados over – not to mention eagle-eyed, tech-obsessed investors. The bigger picture: Baidu, bai-dont. The tech industry moves fast, and companies that can’t keep up risk being left behind. Just look at Baidu: the Chinese firm secured its spot as the country’s go-to search engine ten years ago, but rivals Alibaba and Tencent have since stolen a march on the company when it comes to AI. Baidu created the “Ernie” language model, sure, but the other two were quicker to throw a lot more money into their own budding systems. That go-getter attitude has already paid off, with Alibaba and Tencent’s stocks and AI-related revenue beating the old timer’s so far this year. ai alibaba amazon apple electric vehicles evs microsoft tencent tesla stocks us ai apple ecommerce fintech Disclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. /3 • Your free quarterly content is about to expire. Uncover the biggest trends and opportunities. Subscribe now for 50% off. Cancel anytime. "
}