{
    "title": "Is It Too Late to Buy Apple Stock?",
    "date": "2/10/2024",
    "url": "https://www.fool.com/investing/2024/02/10/is-it-too-late-to-buy-apple-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Apple (AAPL -4.09%) made headlines last week with its most significant product launch in almost a decade. On Feb. 2, the company released the Apple Vision Pro, a virtual/augmented reality (VR/AR) headset, or \"spatial computer\" as Apple describes it. The new product is equipped with the same chip powering its MacBook Air, allowing the Vision Pro to perform everyday computing tasks such as web browsing, word processing, video editing, and various entertainment tasks. Data by YCharts It remains to be seen how successful the headset will be, but this chart shows Apple is currently dedicating about 8% of its annual revenue to research and development. The last time that figure was higher, the tech firm was gearing up to launch the first iPhone. So whatever the company is cooking up now could mean big things for Apple over the next decade. Although the company has encountered some challenges over the last year, its significant cash reserves and potent brand make me confident in its long-term success. Here's why it's not too late to buy Apple stock. Apple hasn't had it easy over the last year. In 2023, macroeconomic headwinds caught up with the company, leading to four consecutive quarters of revenue declines. The streak was finally broken in Apple's latest quarter, with revenue rising 2% year over year to $120 billion in the first quarter of 2024. The company beat Wall Street forecasts by more than $1 billion. However, outperforming estimates wasn't enough to quell investor concern over its iPhone business, with its stock down 3% year-to-date. Smartphone sales rose 6% in Q1 2024, yet fell 13% in China. The East Asian country has increased restrictions on the iPhone, threatening business from Apple's third-largest market. China accounts for about 17% of the company's revenue. Sales in China look unlikely to improve soon or perhaps ever with the rise of rivals like Xiaomi and Huawei. However, growth in other regions could offset losses in China over the long term while the company also gradually reshapes its business to rely less on the iPhone. In Q1 2024, product sales in Europe, Apple's second-largest market, posted revenue growth of 10% year over year. Meanwhile, sales in Japan soared 15%. Moreover, despite recent hurdles, Apple's free cash flow climbed 10% to about $107 billion in the last year, indicating slowing Chinese sales aren't having the detrimental effect that the company's stock dip would have you think. Additionally, it shows the firm has the funds to overcome current headwinds and keep investing in other high-growth areas of tech. Apple's research and development hit just under $8 billion last quarter. It's unclear what the tech firm's roadmap looks like for the next decade. However, market trends and the launch of its Vision Pro headset suggest it will include journeying further into artificial intelligence (AI), VR/AR, and digital services. Consistent growth in these sectors could allow Apple to lean less on product sales and, more importantly, the iPhone over the long term. The AI market on its own is projected to expand at a compound annual growth rate (CAGR) of 37% through 2030, which would see it exceed $1 trillion. Meanwhile, data from Fortune Business Insights shows the VR market will grow at a CAGR of 31% in the same period. Apple's brand loyalty and substantial cash reserves make it well-positioned to see major gains from both industries. Additionally, digital services are gradually becoming Apple's best-performing business, and could overtake the iPhone. Services include income from the App Store and subscription platforms like Apple TV+, Music, and iCloud. The digital business is Apple's second-highest-earning segment, accounting for about 20% of the company's revenue. Meanwhile, services growth has outperformed the iPhone for more than a year, with revenue for the segment rising by 11% year over year in Q1 2024 compared to the iPhone's 6%. It will take time for Apple's investments to pay off and be reflected in its stock price. However, now could be an excellent time to make a long-term investment in Apple's business. Its stock offers significantly more value than some of its rivals, indicating it is lower risk than other \"Big Tech\" stocks.  Data by YCharts This chart shows Apple's forward price-to-earnings ratio (P/E) and price-to-free cash flow are considerably lower than those of Microsoft and Amazon. Apple's lower figures for both metrics suggest its stock is trading at a far better value. Alongside expanding positions in AI, VR/AR, and digital services, Apple's stock is a screaming buy for long-term-minded investors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Apple, and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}