{
    "title": "Apple scales back electric car plans after pushing back launch date",
    "date": "1/24/2024",
    "url": "https://finance.yahoo.com/news/apple-scales-back-electric-car-110743343.html",
    "text": "Apple has pushed back the launch date for its long-rumoured electric vehicle and scaled back its self-driving features as the iPhone maker struggles with the shift from gadgets to cars. The Californian tech giant has delayed its internal target to launch a car from 2026 to 2028, according to Bloomberg. The vehicle will also have fewer advanced autonomous driving capabilities than first hoped. The revisions come as Apple finds the push into cars more challenging than it initially hoped. Known internally as Project Titan, Apple has been working on the secretive electric car project since 2014. The company has spent hundreds of millions of dollars on development, according to reports, but is yet to come up with a prototype. Its internal team has also gone through multiple restructurings and leadership changes. Dan Ives, a technology analyst at Wedbush Securities, said developing an electric car had proved “arduous” for Apple. The $3 trillion company has now downgraded its ambitions for the car’s self-driving capabilities at launch. The car will feature what is known as “level two” autonomous driving features – similar to Tesla’s Autopilot technology. This means the car can perform some manoeuvres on its own, such as braking, lane changing, parking or driving on a motorway, but the driver remains in control.Apple had hoped to launch a “level four” car, where the car drives by itself under most conditions, although the human driver can still take control of the vehicle.The levels of autonomous driving are set by the Society of Automotive Engineers and are widely used as the standard in the industry.The company is now considering offering extra autonomous features as future upgrades once the car is released. It represents a significant downgrade to the project’s ambitions compared to what Apple had hoped to achieve at the start of the project. At one stage, Apple had been looking to develop a car without a steering wheel or pedals.According to Bloomberg, Apple’s board grilled chief executive Tim Cook on the car plans last year, along with the head of the project, Kevin Lynch.Insiders are said to see the strategy shift as a key moment, at which Apple’s board is likely to either give the go-ahead to ramp up plans to launch a car, or kill the project entirely. The company has reportedly been meeting European carmakers to discuss its plans.While it has not built a car of its own, Apple has been testing autonomous driving technology on the streets of California with a fleet of Lexus SUVs. Last year, it had a total of 67 vehicles registered with California’s Department of Motor Vehicles.It has also offered in-car software for years. Apple currently offers CarPlay, a hands-free car system that can link to drivers’ iPhones, which is available on dozens of models including vehicles from BMW and Ford. The push into developing cars comes as Apple seeks to find new ways to grow. The company has struggled to come up with a consistently profitable and popular product on the scale of the iPhone since its launch in 2007. Earlier this month, Apple made a major leap into developing virtual reality technology, launching its Vision Pro headset. Mr Ives said: “Right now AI and new consumer hardware devices are at the top of the priority list and not the Apple Car.” An Apple spokesman did not respond to a request for comment. Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month, then enjoy 1 year for just $9 with our US-exclusive offer. Related Quotes "
}