{
    "title": "Huawei’s homegrown operating system, launched after the company was put on \na U.S. blacklist, may soon overtake Apple’s iOS in China",
    "date": "1/4/2024",
    "url": "https://fortune.com/asia/2024/01/04/huawei-homegrown-os-harmonyos-second-most-used-in-china-apple-ios/",
    "text": "Just a few years ago, Huawei was so pressured by U.S. trade blacklists that it offloaded its budget smartphone division. But the Chinese electronics giant is having a comeback with a buzzy return to the high-end phone market that’s pulling consumer attention away from Apple’s iPhone. Now, Huawei may soon be on the verge of surpassing Apple in one metric, as its homegrown HarmonyOS operating system is poised to overtake Apple’s iOS in China this year, according to the South China Morning Post citing a report from tech research firm TechInsights. iOS and Android, the open-source OS primarily developed by Google, will continue to dominate the global market. Huawei’s decision to develop its own operating system took on greater importance following U.S. sanctions on the company. The Chinese company originally used the Android operating system in its smartphones, yet announced HarmonyOS in August 2019, just a few months after the Trump administration added Huawei to the Entity List, which forced the company to get Washington’s approval for any purchases of U.S. technology. Huawei executives had previously described the development of its own operating system as a “Plan B,” as the company faced the prospect of being barred from using key hardware or software with U.S. origins. Huawei’s initial success in getting HarmonyOS off the ground could be an indicator that the Chinese firm is maintaining its technical expertise in spite of U.S. sanctions. Huawei is now gearing up for another major transition by preparing to abandon Android entirely. Previous versions of HarmonyOS supported apps developed for Android, yet Huawei’s next update will end this compatibility, creating what the company calls a “pure” operating system. Chinese tech companies are scrambling to develop HarmonyOS-compatible versions of their apps. Chinese firms are reportedly ramping up efforts to hire developers for HarmonyOS, including companies like Alipay owner Ant Group and McDonald’s China. In August, Huawei said at its annual developer conference that more than 700 million devices currently run on HarmonyOS with more than 2.2 million third-party developers creating apps for the platform. The rise of HarmonyOS is also coming as Huawei successfully returns to the 5G smartphone market, symbolized by its surprise release of the Mate 60 Pro in August last year. The phone features an advanced locally developed seven-nanometer chip, despite U.S. sanctions on both Huawei and China’s broader chip industry. Huawei’s Mate 60 Pro smartphone was an immediate success, with state media outlets and commentators proclaiming the phone a national achievement. The company sold 1.6 million Mate 60 handsets in its first six weeks of sales, according to market research firm Counterpoint Research. “The clear standout in October has been Huawei with its turnaround on the back of its Mate 60 series devices. Growth has been stellar with its new launch marketing and strong media coverage around its ‘Made in China’ chipset,” said Archie Zeng, a China analyst for Counterpoint Research in a report on the Chinese smartphone market released in November. Huawei captured about 13% of China’s smartphone market in 2023, up from 7.6% in 2022, estimates Ivan Lam, senior analyst at Counterpoint Research. The company predicts that it generated almost $100 billion in sales in 2023, up from a recent low of $89.6 billion in 2021. “After years of hard work, we’ve managed to weather the storm,” Huawei rotating chairman Ken Hu said to employees in late December. Still, the company has yet to surpass the $137 billion in revenue reported in 2020. Huawei’s return could be bad news for Apple, which counts China as one of its most important overseas markets. Sales of Apple’s iPhone 15, which the company released a few weeks after Huawei’s Mate 60 Pro, underperformed in its first 17 days on sale, compared to Apple’s previous models. Apple is also contending with new regulations from Beijing. Chinese officials will soon require all programs sold on Chinese app stores, including Apple’s, to have a license from the government. Apple may be forced to remove thousands of apps from its Chinese store once the grace period ends in March. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}