{
    "title": "Apple Ramps Up R&D Intensity to Pre-iPhone Levels",
    "date": "1/19/2024",
    "url": "https://www.statista.com/chart/2502/apples-r-and-d-expenditure/",
    "text": "Industry Overview Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Insights on consumer attitudes and behavior worldwide Business information on 100m+ public and private companies Explore Company Insights Detailed information for 39,000+ online stores and marketplaces Directly accessible data for 170 industries from 150+ countries\n                    and over 1 Mio. facts. Customized Research & Analysis projects: Get quick analyses with our professional research service The best of the best: the portal for top lists & rankings: Transforming data into design: Statista Content & Design Strategy and business building for the data-driven economy: Ahead of the launch of Apple Vision Pro, which becomes available for pre-order on January 19, Apple ramped up its R&D spending quite significantly. In fiscal 2023, which ended September 30, the company spend $29.9 billion on research and development, bringing its R&D intensity, i.e. R&D spending as a percentage of sales, to levels last seen before the iPhone launch in the early 2000s. Since fiscal 2020, Apple's research and development spending has increased by more than $10 billion, as work on the company's supposedly groundbreaking XR headset and its transition to Apple silicon took up a lot of capital.When asked about the steep increase in R&D spending over the past two years, Apple CEO Tim Cook put it down to \"a number of things\": things he couldn't talk about, the Vision Pro, AI, machine learning and investments in Apple silicon. He also pointed out that Apple's R&D expenditure was \"very competitive\" compared to others, while CFO Luca Maestri added that the company's aggressive R&D spending is one of the drivers behind its gross margin expansion, meaning that it partly pays for itself, so to speak. Ahead of the launch of Apple Vision Pro, which becomes available for pre-order on January 19, Apple ramped up its R&D spending quite significantly. In fiscal 2023, which ended September 30, the company spend $29.9 billion on research and development, bringing its R&D intensity, i.e. R&D spending as a percentage of sales, to levels last seen before the iPhone launch in the early 2000s. Since fiscal 2020, Apple's research and development spending has increased by more than $10 billion, as work on the company's supposedly groundbreaking XR headset and its transition to Apple silicon took up a lot of capital. When asked about the steep increase in R&D spending over the past two years, Apple CEO Tim Cook put it down to \"a number of things\": things he couldn't talk about, the Vision Pro, AI, machine learning and investments in Apple silicon. He also pointed out that Apple's R&D expenditure was \"very competitive\" compared to others, while CFO Luca Maestri added that the company's aggressive R&D spending is one of the drivers behind its gross margin expansion, meaning that it partly pays for itself, so to speak.  Description This chart shows how much money Apple spends on research and development relative to its revenue. Report Can I integrate infographics into my blog or website? Yes, Statista allows the easy integration of many infographics on other websites. Simply copy the HTML code that is shown for the relevant statistic in order to integrate it. Our standard is 660 pixels, but you can customize how the statistic is displayed to suit your site by setting the width and the display size. Please note that the code must be integrated into the HTML code (not only the text) for WordPress pages and other CMS sites. Statista offers daily infographics about trending topics, covering:Economy & Finance, Politics & Society, Tech & Media, Health & Environment, Consumer, Sports and many more. Feel free to contact us anytime using our contact form or visit our FAQ page.  Need infographics, animated videos, presentations, data research or social media charts? More Information "
}