{
    "title": "US Stocks: S&P, Nasdaq begin 2024 with lower close as Apple, big tech weighs",
    "date": "1/2/2024",
    "url": "https://www.zawya.com/en/markets/equities/us-stocks-s-and-p-nasdaq-begin-2024-with-lower-close-as-apple-big-tech-weighs-lmicoubd",
    "text": "Apple dives on Barclays' downgrade The S&P 500 and Nasdaq Composite closed the first trading session of 2024 lower, weighed by a fall in Apple shares after a broker downgrade and declines among other big-tech names triggered by a move higher by Treasury yields. The lackluster session follows a year where Wall Street's three major indexes notched double-digit gains on the back of optimism around artificial intelligence and stabilizing inflation. The S&P 500 ended last week within 1% of a record closing high reached in early 2022. However, equities were pressured on Tuesday as U.S. Treasury yields climbed, with the yield on 10-year notes ticking above 4.000% to a two-week high before easing slightly to 3.937%. Such movement in Treasury yields reflected investors' tempered expectations around cuts this year in U.S. interest rates. This, in turn, weighed on growth stocks - among them tech stocks - which would benefit from a more favorable rate environment. Apple fell 3.6% after Barclays downgraded the tech giant to \"underweight\", citing weakening iPhone demand. Other megacap stocks also declined, including Nvidia, Meta Platforms and Microsoft, which slipped between 1.4% and 2.7%. \"Everyone was very excited by the tail-end rally, the Fed - on the surface at least - paring back a little, and the fact we didn't have a recession,\" said Jason Pride, chief of investment strategy & research at Glenmede. \"But does that mean we're out the woods yet? I suspect, even if the Fed brings rates down gradually, monetary policy is still tight and still likely to be a hindrance to overall economic activity.\" The Fed's December policy meeting minutes and a slew of labor market data are on the roster for this week as market participants look to ascertain the timing of potential rate cuts. While the Fed is widely seen holding rates at its January meeting, traders expect a near 70% chance of a 25-basis point cut in March, according to the CME Group's FedWatch tool. The S&P 500 lost 27 points, or 0.57%, to end at 4,742.83 points, while the Nasdaq Composite lost 245.41 points, or 1.63%, to 14,765.94. The Dow Jones Industrial Average rose 25.5 points, or 0.07%, to 37,715.04. The S&P 500 sectors were mixed. Healthcare was the brightest performer, with its 1.8% gain taking it to its highest close since mid-December 2022. Moderna's 13.1% advance led the sector higher after the vaccine maker was upgraded by brokerage Oppenheimer, and it reiterated the company's goal of achieving sales growth in 2025. The energy index also rose 1.2% despite crude slipping on concerns about the economic outlook. Information technology led decliners with a 2.6% fall, the index's largest one-day drop since Aug. 2.   Tesla was flat despite saying it delivered a record number of electric vehicles in the fourth quarter, beating market estimates and meeting its 2023 target of 1.8 million vehicles. Boeing dropped 3.4% after Goldman Sachs removed the aerospace company from its \"conviction list\". Meanwhile, Citigroup advanced 3.1% to $53.04, its highest finish since August 2022, after Wells Fargo raised its price target for the bank to $70 from $60. Wells analyst Mike Mayo also said Citi was his top pick among large banks in 2024, and he expects the stock to double to $100+ over the next three years. Crypto-related stocks such as MicroStrategy gained as bitcoin pierced above $45,000 for the first time since April 2022 on optimism around the possible approval of exchange-traded spot bitcoin funds. The volume on U.S. exchanges was 11.86 billion shares, compared with the 12.4 billion average over the last 20 trading days. (Reporting by Sruthi Shankar and Shristi Achar A in Bengaluru and David French in New York; Editing by Devika Syamnath and Aurora Ellis)  Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. Read our full disclaimer policy here. © ZAWYA 2024 Get insights and exclusive content from the world of business and finance that you can trust, delivered to your inbox. Subscribe to our newsletters: DAILYWEEKLYGREENPROJECTSAFRICA "
}