{
    "title": "Microsoft briefly outshines Apple as world's most valuable company",
    "date": "1/11/2024",
    "url": "https://www.cbsnews.com/news/microsoft-apple-open-ai-sam-altman-market-capitalization/",
    "text": "Watch CBS News By Elizabeth Napolitano Edited By Anne Marie Lee January 11, 2024 / 3:52 PM EST\n          / CBS News Microsoft briefly dethroned Apple as the world's most valuable company, as its foray into generative AI continues to push up its stock price. The software giant's stock on Thursday jumped as much as 2%, putting the firm's market valuations at $2.903 trillion. At the same time, Apple's market cap dropped to $2.871 trillion after shares fell 0.9%, marking the first time since 2021 that the iPhone maker's value dropped below that of Microsoft. By Thursday afternoon, however, Apple had regained its title, with Microsoft's valuation falling to $2.849 trillion. The surge in shares came shortly after Microsoft reported its revenue grew 7% to $52.9 billion in the third quarter, beating analysts' expectations, the company's financial statement shows. The gains were largely due to the Redmond, Washington-based company's push to integrate AI technology into its cloud computing business, according to the statement. Microsoft ramped up its AI initiatives at the start of 2023 with the announcement of a $10 billion multiyear investment in Sam Altman's OpenAI, the startup behind ChatGPT, the tech disrupter that shook the world in 2023. While Apple was the first U.S. company to reach a market value of $3 trillion back in 2022, slumping sales of the company's iPhone — which account for a large portion of its profits — have hurt the company's stock price which has since fallen below the milestone threshold. Though it is among the latest big tech entrants into the red-hot AI market, it has not benefited from the AI-fueled stock surges seen by Microsoft and others. Several big tech companies, including Google, Amazon and Meta, have increased the value of their stocks by announcing plans to develop their own AI-powered chatbots or integrate the tech into their products or operations, the Motley Fool reported. Companies that mentioned AI saw an average stock price increase of 4.6%, while those who did not only saw a 2.4% increase, according to stock research platform Wall Street Zen. Elizabeth Napolitano is a freelance reporter at CBS MoneyWatch, where she covers business and technology news. She also writes for CoinDesk. Before joining CBS, she interned at NBC News' BizTech Unit and worked on The Associated Press' web scraping team. First published on January 11, 2024 / 3:52 PM EST © 2024 CBS Interactive Inc. All Rights Reserved. Copyright ©2024 CBS Interactive Inc. All rights reserved. Quotes delayed at least 15 minutes. Market data provided by ICE Data Services. ICE Limitations. Powered and implemented by FactSet. News provided by The Associated Press. Legal Statement. "
}