{
    "title": "Apple announces when the Vision Pro will go on sale",
    "date": "1/8/2024",
    "url": "https://www.cnn.com/2024/01/08/tech/apples-vision-pro-headset-launch-date/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Follow: Apple said Monday that its Vision Pro mixed reality headset will be available for purchase in the United States beginning on February 2, with pre-orders beginning on January 19. The Vision Pro headset, Apples’ riskiest and most ambitious new hardware offering in years, is also one of its priciest products: It starts at $3,500. The company revealed Monday that the headset will have 256 GB of storage, and prescription lens inserts for the device will be available starting at $149. Reading lens inserts start at $99. In a statement announcing the Vision Pro’s release date, CEO Tim Cook did not mince words: “Apple Vision Pro is the most advanced consumer electronics device ever created,” Cook said. “Its revolutionary and magical user interface will redefine how we connect, create, and explore.” The release of the Vision Pro marks Cook’s first new major hardware product launch at Apple in seven years, and only the third during his tenure as CEO. The device looks like a pair of ski goggles and and its underlying technology lets users overlay virtual images on live videos of the real world. Unlike some other headsets on the market, Apple’s mixed-reality device will display the eyes of its users on the outside, according to company demonstrations last June. The Vision Pro will have its own operating system, dubbed visionOS, as well as a novel three-dimensional user interface and input system that is controlled by a user’s eyes, hands and voice. The product is expected to face a number of challenges, as Apple is diving into an unproven market littered with other tech companies who have tried and largely failed to find mainstream traction for their augmented reality hardware devices. And the hefty price tag has also raised eyebrows since it was revealed at Apple’s Worldwide Developers Conference in June. Shares for Apple (AAPL) ticked up by 1.5% in early trading Monday after the Vision Pro’s launch date was announced. Apple’s announcement also comes as the tech sector’s annual CES convention in Las Vegas kicks off this week. This story has been updated with additional developments and context. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}