{
    "title": "Bloomberg: Apple targets 2028 release date for its own electric vehicle",
    "date": "1/23/2024",
    "url": "https://9to5mac.com/2024/01/23/bloomberg-apple-car-2028-release/",
    "text": "Project Titan, the Apple electric car project, has been underway since 2015. But the project has faced numerous delays and repeated executive turnover. Initially planning to make a fully autonomous vehicle without a steering wheel, those lofty ambitions have come crashing down to earth in recent years. With Apple VP Kevin Lynch leading the project since 2021, the company has set a new release date for the launch of its first vehicle: 2028. That’s according to a new report today from Bloomberg. Apple has been working on autonomous driving technology for almost a decade at this point, but has had to confront the reality of its vision of a car without a steering wheel is unrealistic. Bloomberg says the 2028 car will offer limited autonomy features in line with what is offered by other electric vehicle manufacturers like Tesla. The Apple car will require drivers pay attention and be ready to take over, as the car drives itself on roads and highways, similar to the current Tesla Autopilot system. This will represent a Level 2+ system; originally Project Titan was aiming for Level 4. It is possible Apple can upgrade the system over time with software updates, and as the international regulatory environment evolves. Bloomberg says Apple’s board had put pressure on Cook last year to deliver a plan for shipping Project Titan, or whether to axe the project entirely. The project has never before generated a viable prototype, the report says. The new lowered autonomy specifications should mean that Apple can now move forward successfully, with Kevin Lynch leading the project, but there are apparently doubts about how innovative the first Apple car will end up being. Bloomberg warns some employees are critical of the plans, suggesting that it is merely a ‘me-too product’. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Benjamin develops iOS apps professionally and covers Apple news and rumors for 9to5Mac. Listen to Benjamin, every week, on the Happy Hour podcast. Check out his personal blog. Message Benjamin over email or Twitter. The easiest way to get into HomeKit and Apple smart home tech. Great for gifts. Inexpensive, fast, wireless charger for iPhone. "
}