{
    "title": "Rivian Poaches Apple's VP Of Hardware Engineering",
    "date": "1/29/2024",
    "url": "https://www.carscoops.com/2024/01/rivian-poaches-apples-vp-of-hardware-engineering/",
    "text": "After 25 years at Apple, DJ Novotney, who played a key role in initiating the iCar project, is leaving to join Rivian Electric vehicle manufacturer Rivian has started 2024 with a bang, poaching Apple’s vice president of hardware engineering, DJ Novotney, away from the world’s biggest tech company. In his new role, he will reportedly lead management for new products and engineering. Novotney has been with Apple for nearly 25 years, and in that time has played an important role in developing several of the tech company’s most recognizable products. A part of the teams that created iPods, iPhones, iPads, and the Apple Watch, he was also reportedly a member of the team developing the iCar, though he left that team as part of a reorganization. “Great products are what we do best and I have been so very lucky along the way to be part of so many amazing teams,” Novotney wrote in a memo seen by Bloomberg. “Apple has been my life, but now is the time for me to move on and help bring to life a new set of products.” His role at one of America’s best-known companies makes Novotney a major score for Rivian, which is in the process of developing a new platform for mass market electric vehicles. An important source of revenue for the automaker, the new R2 vehicles based on it will be central to the company’s future success. Read: Apple iCar Launch Delayed To 2028, Levels Down On Autonomy In his new role, Novotney is set to become one of Rivian’s most critical executives, and will report directly to CEO, RJ Scaringe, who has been filling the position since Nick Kalayjian stepped back from it in November. Meanwhile, in Cupertino, this is just the latest departure of a senior figure for Apple. The company will lose its vice president of design for the iPhone and Apple Watch, Tang Tan, next month, while head of hardware technologies, Steve Hotelling, left late last year. Follow Carscoops on \n                                Google News "
}