{
    "title": "'Hot garbage': Developers are not pleased with Apple's unlocked App Store",
    "date": "1/27/2024",
    "url": "https://www.businessinsider.com/apple-app-store-shakeup-in-europe-triggers-fury-2024-1",
    "text": "       Apple's absolute rule over the App Store has just been broken for the first time since its launch in 2008. Are developers celebrating? Hardly. On Thursday, changes were made to the way app distribution works on iPhones — changes that should have been welcomed by developers who have long been at the mercy of strict rules around that process. Specifically, the changes take effect in the European Union, where Apple has been pushed to comply with the Digital Markets Act by March this year. It's a law that designates the App Store, which takes a 30% commission from developers, as an unfair \"gatekeeper\" by acting as the only digital store from which apps can be sold and bought on iPhones. Despite trying to retain that control ruthlessly over the years, Apple's changes in the face of the EU legislation mean two main things for developers. First, third-party stores will finally be allowed onto Apple's operating system once iOS 17.4 is released. It means developers can simply bypass the App Store. Second, Apple's cut on transactions will drop from 30% to 17%, with an extra 3% fee for use of its payment processing. As my colleague Peter Kafka writes, this has all made Apple quite unhappy. In a release announcing the changes, Apple said this new system under the EU act \"opens new avenues for malware, fraud and scams,\" as well as other harmful content. But it seems to have made a lot of people quite unhappy too. Tim Sweeney, CEO of Fortnite-maker Epic Games, described the changes as \"hot garbage\" as he pointed to the fine print that seemingly complicates matters for developers. Apple, for instance, will have tight control over which third-party app stores end up on its system and compete with it. Apple said this was \"to ensure marketplace developers commit to ongoing requirements that help protect users and developers.\" Sweeney suggests otherwise. Related stories \"Apple proposes that it can choose which stores are allowed to compete with their App Store,\" Sweeney wrote on X. \"They could block Epic from launching the Epic Games Store and distributing Fortnite through it, for example, or block Microsoft, Valve, Good Old Games, or new entrants.\" Nikita Bier, who founded businesses acquired by Discord and Meta, took aim at a new \"core technology fee\" being introduced by Apple. The fee means that apps sold from its App Store or third-party marketplaces will have to pay \"€0.50 for each first annual install per year over a 1 million threshold.\" Using Apple's own fee calculator, he estimated that companies that made $10 million in sales from 10 million customers would result in an annual cut of $6.2 million for Apple. However, when the revenue per user was placed to higher than $1, it resulted in much better returns for app makers. Eric Seufert, general partner at Heracles Capital, noted that the fee \"presents an appreciable financial hurdle to clear\" for apps that are downloaded from third-party stores, seemingly defeating the purpose of those stores being allowed onto iOS in the first place. \"It seems odd to me that the European Commission would approve these platforms charging fees on apps that are sideloaded / downloaded from third-party stores,\" Seufert said. Others, like Ashley Gullen, lead developer of game-making software Construct, likened Apple's new fee structure to a controversial install fee introduced by Unity last year. Did... did Apple just introduce the equivalent of Unity's runtime install fee... but for all iOS app developers in the EU?! pic.twitter.com/Z7KMiWEqmD Unity, creator of a game engine platform, initially planned on charging developers $0.20 per install for games with over 200,000 installs, but later revised the plans after facing backlash. In a statement, Apple said its changes, which came after spending months in conversation with the European Commission, comply with the DMA. However, it said it would limit the changes to the EU because it is \"concerned about their impacts on the privacy and security\" of users. \"Apple's focus remains on creating the most secure system possible within the DMA's requirements. But even with these safeguards in place, many risks remain — and in the EU, the DMA's changes will result in a less secure system,\" the company said. It added that it created new tools for developers, such as a fee calculator and developer documentation, to help them \"understand the options available for their EU apps and make informed decisions.\" Developers will be forced to reckon with a whole new reality of app distribution that they've barely begun to grasp. As Epic Games' Sweeney put it: \"It will take more time to parse both the written and unwritten parts of this new horror show, so stay tuned.\" Read next Jump to "
}