{
    "title": null,
    "date": "2/22/2024",
    "url": "https://www.indiatoday.in/technology/news/story/apple-mac-mini-m2-available-for-under-rs-50000-on-amazon-how-the-deal-works-2505474-2024-02-22",
    "text": "Listen to Story Apple launched the Mac Mini with M2 chipset back in 2023 and it turned out to be a great option for those who were looking forward to enter the Apple ecosystem without breaking the bank. The Mac Mini 2023 desktop computer emerged as a relatively affordable alternative for people and is currently available on Amazon with enticing discounts and additional offers. Now, you can get your hands on the desktop for under Rs 50,000. Read on to know more about the deal and how you can take advantage of it. advertisementApple Mac Mini M2 available for under Rs 50,000The original price of the Apple Mac Mini M2 is Rs 59,900. However, it is available at a direct 8 percent discount and is selling for Rs 54,990 on Amazon at the moment. You can further slash up to Rs 5,000 by using an HDFC Bank Credit Card or Debit Card for EMI transactions. This means that the price of the device can be brought down to Rs 49,990 by using an HDFC Bank card. Additionally, no-cost EMI options are available which can lead to savings of Rs 2,476 if you use an Amazon Pay ICICI credit card. If you are buying the device for business purposes, you can also save up to 28 percent by providing a GST invoice. \n \n\n\nApple Mac Mini M2 specificationsThe Apple Mac Mini M2 comes with 8GB RAM and a 256GB SSD which ensures smooth multitasking, and ample storage space. Further, the compact device promises robust performance as it is equipped with an eight-core CPU and a 10-core GPU complemented by a 16-core Neural Engine.At the time of the device's launch, Apple said in a press release that with the Mac Mini M2, day-to-day tasks are \"blazing fast,\" be it launching and multitasking between apps to browsing the web. \"For users with more intensive tasks, Mac mini with M2 also powers through even more demanding workloads,\" the company added.The Mac Mini 2023 also supports dual displays for an expanded workspace. Apple enthusiasts can also rest easy, knowing that this variant is fully compatible with the latest macOS Sonoma update.Weighing in at a mere 1.18 kg, the Mac Mini 2023 doesn't compromise on connectivity. Boasting Wi-Fi 6E and Bluetooth 5.3, it ensures seamless wireless communication. The device hosts an array of ports, including two Thunderbolt 4 ports with DisplayPort functionality, USB 4, USB 3.1 Gen 2, Gigabit Ethernet port, HDMI port, and a headphone jack. Additionally, the built-in speaker and dedicated headphone jack cater to audio needs.Published By: Divyanshi SharmaPublished On: Feb 22, 2024ALSO READ |  Ruchir Dave, a graduate from Gujarat college, is new boss at Apple Audio division after big shakeupALSO READ |  Robots delivering food to your doorstep? Uber will make it happen by next month The original price of the Apple Mac Mini M2 is Rs 59,900. However, it is available at a direct 8 percent discount and is selling for Rs 54,990 on Amazon at the moment. You can further slash up to Rs 5,000 by using an HDFC Bank Credit Card or Debit Card for EMI transactions. This means that the price of the device can be brought down to Rs 49,990 by using an HDFC Bank card. Additionally, no-cost EMI options are available which can lead to savings of Rs 2,476 if you use an Amazon Pay ICICI credit card. If you are buying the device for business purposes, you can also save up to 28 percent by providing a GST invoice. \n \n\n\nApple Mac Mini M2 specifications The Apple Mac Mini M2 comes with 8GB RAM and a 256GB SSD which ensures smooth multitasking, and ample storage space. Further, the compact device promises robust performance as it is equipped with an eight-core CPU and a 10-core GPU complemented by a 16-core Neural Engine. At the time of the device's launch, Apple said in a press release that with the Mac Mini M2, day-to-day tasks are \"blazing fast,\" be it launching and multitasking between apps to browsing the web. \"For users with more intensive tasks, Mac mini with M2 also powers through even more demanding workloads,\" the company added. The Mac Mini 2023 also supports dual displays for an expanded workspace. Apple enthusiasts can also rest easy, knowing that this variant is fully compatible with the latest macOS Sonoma update. Weighing in at a mere 1.18 kg, the Mac Mini 2023 doesn't compromise on connectivity. Boasting Wi-Fi 6E and Bluetooth 5.3, it ensures seamless wireless communication. The device hosts an array of ports, including two Thunderbolt 4 ports with DisplayPort functionality, USB 4, USB 3.1 Gen 2, Gigabit Ethernet port, HDMI port, and a headphone jack. Additionally, the built-in speaker and dedicated headphone jack cater to audio needs.Published By: Divyanshi SharmaPublished On: Feb 22, 2024ALSO READ |  Ruchir Dave, a graduate from Gujarat college, is new boss at Apple Audio division after big shakeupALSO READ |  Robots delivering food to your doorstep? Uber will make it happen by next month "
}