{
    "title": "Apple supply chain checks show 'clear stabilization of demand' in China: \nWedbush",
    "date": "2/12/2024",
    "url": "https://seekingalpha.com/news/4065428-apple-supply-chain-checks-clear-stabilization-of-demand-china",
    "text": "ozgurdonmaz Recent checks into the supply chain suggest that Apple (NASDAQ:AAPL) is seeing a \"clear stabilization of demand\" in China, Wedbush Securities said. It's likely that the iPhone will see some \"incremental growth\" this year, which Wedbush analyst Dan Ives said speaks to the idea that the iPhone 15 \"is catalyzing an upgrade cycle that will exceed Street expectations,\" adding that between 225M and 230M iPhone units should be shipped this year. \"While the China demise narrative has been the black cloud over the Apple story, we are expecting iPhones to show year over year growth during the Lunar New Year in China as some promotions and a stepped up marketing campaign by Apple has been very successful in mainland China,\" Ives, who has an Outperform rating on Apple, wrote in a note. Although Apple is fighting geopolitical issues and a resurgent Huawei in China, Ives added that it's clear \"very few consumers\" are moving away from the Apple ecosystem, increasing his bullish stance. Apple shares fell fractionally in premarket trading on Monday. Looking ahead, Apple has a couple of major catalysts going for it, Ives said, including the company's push into generative artificial intelligence, expected to be cemented at this year's developers conference. \"We believe the 'Super Bowl moment for Apple' will be when [Tim] Cook & Co. finally take the covers off the generative AI technology being worked on in the labs of Apple Park and introduce it to developers and consumers at WWDC in June followed by the exclusive AI features we expect to be included on iPhone 16,\" Ives said. A further push into generative AI could unlock roughly $5B or more in annual revenue for the company as it pushes further into services, Ives said. "
}