{
    "title": "Apple Defeats Investor's Lawsuit Over Executive Compensation",
    "date": "2/7/2024",
    "url": "https://news.bloomberglaw.com/litigation/apple-defeats-investors-lawsuit-over-executive-compensation",
    "text": "Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 By Mike Vilensky Apple Inc. didn’t misrepresent the value of stock-based compensation for Tim Cook and other executives to shareholders ahead of a vote on Cook’s pay, a federal judge said, dismissing an investor’s lawsuit against the tech giant and its top leaders. Apple’s disclosures to shareholders didn’t unlawfully lead the Teamsters pension fund that brought the lawsuit to lose money through inflated executive pay, Judge Jennifer L. Rochon said, because the investor only took a non-binding vote on executive pay after reviewing the proxy statement. The International Brotherhood of Teamsters pension fund, an institutional investor in Apple, sued Cook and other high-level Apple executives in the US District Court for the Southern District of New York last year, alleging violations of the Securities Exchange Act of 1934 and SEC regulations. Apple directors failed to use the proper, “somewhat complicated” analytical model to determine the values of performance-based stock compensation for Cook and others, the Teamsters said in the complaint. Apple then presented the lower values in part of a proxy statement to stockholders ahead of a non-binding shareholder vote on Cook’s pay, “grossly understat[ing] the known costs of this compensation,” the Teamsters had said. Instead of awarding $77.5 million for several executives per fiscal year, Apple actually awarded about $92.7 million in restricted stock units for FY 2021 and about $94 million in FY 2022. The plaintiffs had sought a reduction of the executives’ compensation and damages. Rochon rejected as “impermissibly speculative” the fund’s cause of action based on the theory that had Apple calculated executive compensation with a different model and presented that calculation in the proxy statement, then shareholders would have voiced feedback that would have caused Apple to change the compensation. The value of stock-based executive compensation in Apple’s proxy statement doesn’t constitute an actionable material misrepresentation, the judge said. The fund alleges “only that the method of calculation employed is ‘improper,’ but not that it was in any way inaccurate,” Rochon said. “There is no SEC rule requiring that a specific method for determining executive compensation be used, so long as the chosen method is disclosed...Apple did precisely what [SEC rules] require—presented its compensation process and methods.” The case was dismissed with prejudice. Barrack, Rodos & Bacine represents the Teamsters. Latham & Watkins LLP represents Apple, Cook and other Apple executives. The case is Int’l Brotherhood of Teamsters, Garage Emp. Local 272 Labor Mgmt. Pension Fund v. Apple Inc., S.D.N.Y., 1:23-cv-01867, 2/7/24. To contact the reporter on this story: Mike Vilensky at mvilensky@bloombergindustry.com To contact the editor responsible for this story: Carmen Castro-Pagán at ccastro-pagan@bloomberglaw.com AI-powered legal analytics, workflow tools and premium legal & business news. Log in to keep reading or access research tools. "
}