{
    "title": "Tim Cook States Apple is Set to Disclose AI Plans Later in 2024",
    "date": "2/29/2024",
    "url": "https://whatstrending.com/tim-cook-states-apple-is-set-to-disclose-ai-plans-later-in-2024/",
    "text": "Apple has plans to disclose more about its long term plans in artificial intelligence later this year, according to Tim Cook. The Chief Executive Officer mentioned during the company’s annual shareholder meeting Wednesday that the iPhone maker sees “incredible breakthrough potential for generative AI, which is why we’re currently investing significantly in this area. We believe that will unlock transformative opportunities for users when it comes to productivity, problem solving and more.” Apple has not rolled out as much when it comes to generative AI in comparison to competitors like Microsoft and Alphabet’s Google, which are now integrating them into products. Cook went on to mention during the meeting that AI is already at work behind the scenes in Apple’s products, but he also mentioned that there would be even more news on AI features later this year. As of late, Bloomberg also reported that Apple has plans to use new AI to improve the ability to search through data in Apple devices. “Every Mac that is powered by Apple silicon is an extraordinarily capable AI machine. In fact, there’s no better computer for AI on the market today,” Cook said. Apple shareholders also rejected a new measure asking the company to disclose even more information about how its uses artificial intelligence in its business and ethical guidelines for the technology. ADVERTISEMENT The proposal, which did not pass but won 37.5% of votes cast, was put forth by the pension trust of the AFL-CIO, the largest American labor union federation, which has also proposed AI measures at other technology companies. “Compared to other leading technology companies, Apple has been behind the curve on disclosing ethical guidelines regarding the use of artificial intelligence,” Brandon Rees, deputy director for corporations and capital markets with the AFL-CIO, said in statement. “We hope that Apple will enhance its disclosure practices on this important issue to investors and other stakeholders.” A similar proposal is up for bat at Walt Disney’s annual meeting in April. At Apple, the AFL-CIO asked for a report on the company’s use of AI “in its business operations and disclose any ethical guidelines that the company has adopted regarding the company’s use of AI technology.” What’s Trending, Inc © 2024 "
}