{
    "title": "Here are my favorite Vision Pro apps (so far)",
    "date": "2/8/2024",
    "url": "https://finance.yahoo.com/news/favorite-vision-pro-apps-far-235120057.html",
    "text": "Since Apple launched the Vision Pro last Friday, I’ve been hammering home the importance of immersive content. This isn’t a radical suggestion by any means. At this point we’re all keenly aware that hardware platforms live and die by content offerings. Remember all the way back, for a moment, to the end of 2014. When Tim Cook unveiled the first Apple Watch alongside the iPhone 6, the product was met with some blank stares. What, many wondered, was the point of such a device? It wasn’t the Dick Tracy wristwatch we’d been promised since the mid-1940s, but rather a small-screen extension of the iPhone. It took Apple a few years to really hone in on fitness as the device’s single biggest driver. When you wear a smartwatch these days, you get a lot fewer questions about why you would possibly want to own such a gadget. There’s no guarantee that the Vision Pro will follow a similar trajectory, but if does, it will be on the backs (faces) of app and game developers. The Vision Pro is an unquestionably impressive piece of hardware. It does several key things — including passthrough, spatial association and high-res displays better than anyone else in the consumer space. But plenty of people are understandably still asking, “Why?” As in, why would someone spend $3,500 on that? The price and extended reality’s long, spotty history have cast additional doubt on Apple’s first headset. Ultimately, however, the “why” can be traced back to content. A little less than a week after the device’s launch, what should we point to as the Vision Pro’s killer app? For the moment, it’s computing. This is where Apple has leaned heavily, partially in a bid to appeal to enterprise customers with deep pockets. If these organizations purchase headsets in bulk, scaling will help bring down the cost of subsequent models. The beauty of the platform play is that it’s a method to crowdsource functionality. Apple may have more money than any deity you can name, but its developer resources are still finite. By leaning on 3D parties, you tap into a wealth of outsider perspectives that bring the sort of outside-the-box thinking that is often considered counterproductive to the bottom line inside the gears of a large corporation. In the lead-up to the Vision Pro's release, whether Apple still possessed the standing to attract key developers remained something of an open question. Six hundred “optimized” apps at launch was a strong showing for a first-gen device in a category with a rocky track record. That figure is bolstered by significantly more iPadOS apps that can run on the device. As for what constitutes “optimization,” the answer isn’t as straightforward as you might think. This can be as simple as tweaks to the UX in line with the shift from touch to hand gestures or as complex as full immersion and advanced hand tracking. For the sake of this piece, I am most interested in optimized apps with immersive properties. Using an iPad app on the headset generally isn’t a bad experience (nor do you want full immersion all the time), but we’re here to talk about a bleeding edge $3,500 piece of hardware — let’s see what this bad boy can do. [youtube https://www.youtube.com/watch?v=tvK6Q2FdyCg?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent&w=640&h=360] I’m a staunch believer in screen breaks. Take a walk, read a book, speak with a human, touch the proverbial grass. If anything, this is more important when that screen is strapped to your head. After spending a little over a week with Vision Pro in my home, I’ve found that my usage tends to be divided in clusters. For instance, I’m writing this to you on my desktop — the real one, not the virtual. My interaction with the infinite desktop experience is still limited. I find the device is best used with intentionality. Rather than simply attempting to convert as much of my life to spatial computing, using the Vision Pro is an ongoing process of determining when it is the best tool for the job at hand (I will wholly admit that my philosophy might be different if I had paid the upfront costs, rather than reviewing a loaner unit). Your mileage will vary, but I tend to get motion sickness relatively easily, so I’ve been limited to sessions around 30 minutes. A few apps have crept into my morning routine during this time. I’ve been suffering from degenerative disc disease, spinal stenosis and sciatica for several months now. Things like that put a real damper on your ability to head to the gym. As I’ve been engaging in a little self-rehab, however, I’m more able to do moderate exercise. My mornings now involve 20 minutes of Apple Fitness+ Pilates, followed by a game of Synth Riders on the Vision Pro. The latter has been ported over from the Meta Quest. It’s a Rock Band/Guitar Hero rhythm game, wherein your hands become instruments that collide with orbs barreling toward you at great speeds. It’s a fun, quick game that’s reminiscent of Beat Saber. Here, all the levels revolve around synth tracks and the broader aesthetic can be described as “’80s Trapper Keeper.” It features either full or partial immersion, depending on how aware you need to be of your surroundings. Synth Riders is about the most exercise you can get away with on the Vision Pro, given price, weight and battery pack. I don’t break a sweat playing the game; it’s more about getting the blood pumping. It’s also suitable for a 3–4 PM workday break when your energy starts flagging. If you do sweat a little, you can always hand wash the light seal insert. Moving forward, I would love more apps that bring some light exercise to the platform — and Quest ports are a solid starting point. I would be curious to see how the system handles boxing and form-correcting, à la products like Tonal and Mirror. I wrote a bit about Apple’s Mindfulness app. It’s pretty bare-bones on the feature side, but that’s not a terrible thing in the world of meditation. I’ve also been trying out Endel Realms after a brief morning workout. I’ve written about Endel’s mobile app and how its algorithmically produced music has helped me get back into the meditation groove. Realms is a far simpler application at the moment, creating calming or energizing environments. You basically sit there for five to 10 minutes and let the light bath wash over you. I’ve so far found it to be centering. There are three things I want to see more of on the Vision Pro: dinosaurs, ocean exploration and space. I’ve mentioned Dinosaur Experience a few times on here, because it serves as a great example of what can be done with immersive, interactive technology. Being up close with dinosaur bodies that are based on the latest scientific research is one of those experiences that shows what a system like this is capable of. More than anything, however, it’s proof of concept. It’s short, plays and loops and the whole of its interactivity is limited to a butterfly landing on your finger and a trio of dinosaurs looking at you as you walk around. There’s not a ton of meat on this proverbial bone, but it’s beautiful, compelling and will hopefully point the way to bigger things. Image Credits: SkyGuide As I wait for a guided tour through the solar system, I’m happy to spend some time with SkyGuide. The app operates similarly to NightSky on iPhone, providing an immersive look at the stars, constellations and planets. SkyGuide is a bit less tied to place than NightSky (which is honestly one of its best features) and is instead about simulating locations (a light-pollution-free cityscape, the top of a mountain range and the open ocean). Lego has been absolutely killing it with Nintendo AR demos. Builder’s Journey is an extremely pleasant experience that takes full advantage of the system’s object recognition, plopping a box of bricks directly on the table in front of you as you follow the storyline and build virtual structures. Loona occupies a similar space — albeit an even chiller one. This is what our Danish friends refer to as hygge. Here you’re piecing together some basic objects like a scooter or fireplace. It’s good for turning your brain off, though unfortunately you have to pay to unlock all but the first puzzle. Microsoft Word doesn’t bring much to the table on the immersion front, but if you plan to do some work inside the Vision Pro, the 40-year-old app remains a gold standard for word processing. As with any apps that entail a lot of typing, I strongly recommend pulling out a Bluetooth keyboard and mouse. Voice dictation still has its limitations, and while I’ve gotten pretty quick with gesture typing, the idea of using it to enter much more than a username and a password makes me want to jump off the roof. The coolest UI piece here is the addition of a small predictive text field that sits directly above the keyboard — more or less the same one you’ll find in iOS. Thus far, I’ve mostly limited longer form typing to sending off some emails. I’ve written a bit about Vision Pro enterprise apps over the last couple of weeks (as has Ron). My current take on the category is that it’s the place where Apple sees the highest and most immediate return on investment. Companies have deep pockets and they’ll buy products in bulk if they think it will save them in the long run. Bring on enough customers and you begin to approach a place where scale has a tangible impact on manufacturing prices. Training is a no-brainer. It can be especially useful for more complex tasks that require a three-dimensional understanding of objects in space. That last bit is also a fundamental aspect of JigSpace, which is designed to build AR demonstrations. Right out the gate, you can explore objects like a jet turbine, an F1 car and a human heart. The app offers a glimpse into how this tech might be used in the future. This article originally appeared on TechCrunch at https://techcrunch.com/2024/02/08/here-are-my-favorite-vision-pro-apps-so-far/ Related Quotes "
}