{
    "title": "Apple Vision Pros Are Practically Dress Code at This Crypto Hacker House",
    "date": "2/15/2024",
    "url": "https://finance.yahoo.com/news/apple-vision-pros-practically-dress-175600378.html",
    "text": "SALT LAKE CITY – Looking for a glimpse of what an office might look if everyone's wearing Apple's Vision Pro headsets? You can find it here in Salt Lake City, at an in-person gathering of developers focused on the Solana blockchain, known as \"mtnDAO.\" The common theme? They're geeks, and they're rich – a natural demographic for testing out the newly released devices, which can cost upwards of $5,000 including accessories. Over 20 attendees of this month-long coworking event have purchased Apple's Vision Pro. They spend their days staring into sleek goggles, slipping between its digital recreations of reality and the massive workspaces that only they can see. MtnDAO might offer a glimpse of Apple CEO Tim Cook's \"era of spatial computing\" – where the meatspace environment is enhanced by the digital goggles. Everyone is simultaneously using them to work, play and even socialize, and maybe even physically eat alongside each other, while still wearing them. Cook unveiled the Vision Pro in June 2023. What's perhaps most interesting of all is that the whole thing is completely organic – a future-of-work laboratory that has just popped up, without influencers or corporate sponsorships. These people don't work for a single company developing VR technology. They're nearly all independent tech workers in the crypto industry. They spend their days building products for the \"future of finance:\" a world built on cryptocurrencies, NFTs and the Solana blockchain. That so many 20- and 30-somethings can afford Vision Pros might be possible only because of crypto riches, or with Solana specifically. Since October the blockchain's flagship token SOL rallied over 10-fold to become the best-performing large-cap crypto of 2023. Believers in Solana aplenty, the mtnDAO attendees have plenty of SOL to spend. And then there's the airdrops – essentially token giveaways by blockchain projects to incentivize early users. In the past few months a parade of financial applications built on Solana have created their own tokens and rewarded power-users with princely sums. Just by trading tokens on platforms like Jupiter, some of the Vision Pro buyers said they received airdrops worth tens of thousands of dollars. \"I know it's a $5,000 impulse buy, but f_ck it, I just got a $5,000 impulse airdrop,\" said ZenLlama, a pseudonymous Solana contributor and mtnDAO attendee who does developer relations for the Monad blockchain. \"We legitimately think that we have the largest amount of Vision Pros in one area anywhere,\" said MJ, a former animator for Netflix and Disney and one of the few headset owners here at mtnDAO actually building a product for the Vision Pro. The headset owners' purchases are fueled by jealousy as much as curiosity. Only a handful preordered the Vision Pro. Most of the rest bought their pairs because of FOMO. Their friends had one at mtnDAO. So they, too, made the one mile pilgrimage to Apple's downtown store and got their own. The result: a WeWork bustling with headset-wearers staring off at who-knows-what and the \"normies\" around them, experiencing regular old reality. These two groups mingle frequently. Normies chat with headsetters, headsetters chat with other headsetters. The front of their headsets display purplish digital eyes that mimic the real ones they're covering. Their real ones are staring at invisible screens even though they're typing on actual keyboards. \"Time to get some real work done,\" said Marbius, a product manager for a crypto fitness game, as he entered \"the box.\" He said he goes entire days in his Vision Pro. He sets up a few desktops within the VR and allows just a smidge of reality to pass through around them. \"I'm spending more time in it than I expected,\" said Anders Jorgensen, the head of growth at crypto borrow and lend protocol MarginFi, one of mtnDAO's hosts. He pre-ordered his Vision Pro months ago and then brought it to the WeWork where mtnDAO's crypto workers gather every weekday in February. Inside his Vision Pro Jorgensen opts for a \"fully immersed setup – no distractions,\" with his Airpod Pros providing extra noise-cancellation. Instead of inside busy WeWork he types away atop mountains and moonscapes. Jorgensen and another regular at mtnDAO, T.J. Littlejohn, a former Apple employee who also pre-ordered his headset, says they inspired \"a lot\" of other people at the coworking event to buy their own Vision Pros. Two others went with Littlejohn to the Apple store when he picked him up and came back with pairs of their own. That spawned a local run on Vision Pros. By mid-February the rumor at mtnDAO was that Apple's local store had sold out. Not every Vision Pro owner at mtnDAO is a crypto developer. Two of them are building programs for the device itself. Littlejohn and MJ, the animator were some of the earliest mtnDAOers to own the headsets and helped seed the FOMO that set off the buying frenzy. \"Our whole operating vibe right now is finding these really compelling experiences that we can make that would be so dope on the Vision Pro,\" said Littlejohn, who now runs a VR gaming studio startup called Middle Curve with MJ. Their short term plan is to build spatial video games for the Vision Pro and then leverage that tech for other applications in the \"professional\" space, perhaps by building character-avatars that Vision Pro's users can consult in lieu of menus. Littlejohn said he was surprised so many other mtnDAO attendees bought Vision Pros. It's been a bigger hit among professionals than he expected – plenty of people spending their entire days in mixed reality. There's something powerful about using the Vision Pro in an office environment, attendees told CoinDesk. It lets them toggle between immersion in their work and the myriad distractions around them in seconds. \"Part of me wonders if I'm only gonna like it at a place like this,\" said Marbius.  "
}