{
    "title": null,
    "date": "2/19/2024",
    "url": "https://www.irishexaminer.com/business/companies/arid-41334487.html",
    "text": "The EU probe was sparked by a complaint in 2019 from Sweden’s Spotify. The European Union is close to hitting Apple with its first-ever competition fine as well as a ban on App Store rules that the commission believes thwart competition. The fine of around €500m is expected to be announced next month, the  Financial Times reported, citing five sources it did not name. Apple could have been fined as much as 10% of its annual global sales. The probe was sparked by a complaint in 2019 from Sweden’s Spotify Technology, which claimed it was forced to ramp up its monthly subscription price to cover costs associated with Apple’s alleged stranglehold on how the App Store operates. The European Commission homed in on Apple’s so-called anti-steering rules in a formal charge sheet in February 2023, saying the conditions were unnecessary and meant customers faced higher prices. In early 2022, Apple began allowing Spotify and other music services to direct app users to the web to sign up for subscriptions. This bypasses Apple’s revenue cut of as much as 30% and gives consumers more pricing and subscription options. But Spotify hit back at Apple’s efforts, saying in June that the restrictions still existed and the changes were “just for show\".  What's your view on this issue? You can tell us here  Aside from attacking firms for their past abuses, the commission has also pushed through sweeping new rules to head off competition violations by tech firms before they take root. The Digital Markets Act, or DMA, enters into full force in March 2024 and lays out a series of dos and don’ts. Under the DMA, it will be illegal for the most powerful firms to favor their own services over those of rivals. Both the European Commission and Apple declined to comment on the FT report. Apple had better news last week when it won an exemption for its iMessage, along with Microsoft for its Bing search engine, from new EU tech rules after the companies convinced competition regulators their services are not gateways for businesses to reach end-users. The DMA requires Microsoft, Apple, Alphabet's Google, Amazon, Meta Platforms, and ByteDance to allow third-party apps or app stores on their platforms and make it easier for people to switch to rivals. The companies are also prohibited from favouring their services over rivals. Bloomberg and Reuters Read MoreGifted Irish distiller finds his heart's desire in Minnesota More in this section News and analysis on business, money and jobs from Munster and\nbeyond by our expert team of business writers. Please click here for our privacy statement.     News and analysis on business, money and jobs from Munster and\nbeyond by our expert team of business writers. Analysis Keep up with the stories of the day with our lunchtime news wrap. Sign up to the best reads of the week from irishexaminer.com selected just for you. Thursday, March 21, 2024 - 6:00 PM Friday, March 22, 2024 - 11:00 AM Thursday, March 21, 2024 - 5:00 PM © Examiner Echo Group Limited, Linn Dubh, Assumption Road, Blackpool, Cork. Registered in Ireland: 523712. © Examiner Echo Group Limited "
}