{
    "title": "Apple appears to be breaking iPhone web apps in the EU",
    "date": "2/14/2024",
    "url": "https://www.theverge.com/2024/2/14/24072764/apple-progressive-web-apps-eu-ios-17-4",
    "text": "By  Emma Roth, a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO. Apple appears to be turning off the ability to use web apps right from the iPhone’s homescreen in the European Union. Support for progressive web apps appeared to be broken inside in the EU during the first two betas of iOS 17.4, but today developer Maximiliano Firtman said in a post on X that web apps are still turned off in the third beta, which arrived yesterday. “At this point, it’s a feature disabled on purpose,” Firtman wrote. Now, instead of opening in a full-screen window, web apps open in your web browser, making them act more like shortcuts. Developers Mysk found that when you select a web app for the first time, it will trigger a pop-up that asks to open the app in your default web browser. Once the app opens, the browser’s address bar and toolbar remain at the bottom of the web app while you use it. As noted by MacRumors, web apps opened in Safari no longer offer notifications or long-term local storage, leading some users to experience data loss and broken notifications with the apps they already have installed. iOS 17.4 includes major changes for users in the EU as part of Apple’s plans to comply with the Digital Markets Act. The update will bring sideloading and alternate app stores to iOS and let third-party browsers use their own engines. Apple had previously treated the ability to install web apps as an alternative to its App Store, despite web apps not being nearly as capable. It’s possible that since there are now going to be true alternative app stores, Apple is cutting off the ability to use this other app-like experience — one that it doesn’t control and doesn’t make money from. Apple hasn’t responded to The Verge’s requests for comment. Developers began noticing that web apps no longer worked in the initial betas of iOS 17.4 earlier this month. The broken web apps appeared to be a glitch at the time, but this seems less likely now that the broken feature has made its way into the third beta of iOS 17.4. The final version of iOS 17.4 is expected before the DMA begins to be enforced on March 6th. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}