{
    "title": "Zacks Investment Ideas feature highlights: Microsoft, Alphabet, Amazon, \nApple and Meta Platforms",
    "date": "2/5/2024",
    "url": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-110000886.html",
    "text": "Chicago, IL – February 5, 2024 – Today, Zacks Investment Ideas feature highlights Microsoft MSFT, Alphabet GOOGL, Amazon AMZN, Apple AAPL and Meta Platforms META. We saw a slew of earnings this week from the market’s leading stocks, and they didn’t disappoint. In addition to many other companies that reported earnings, five of the ‘Magnificent 7’ informed us of their performance. Last Tuesday, we heard from Microsoft and Alphabet, and then on Thursday afternoon from Amazon, Apple and Meta Platforms. All these market leading companies have put up incredible stock performance over the last 18 months, and it looks like that trend may well continue. In this article we are going to take a look at the quarterly earnings reports, valuations, and Zacks Ranks, and attempt to identify which are the most attractive investments right now. Microsoft: Q2 2024 saw Microsoft soar past expectations with 18% revenue growth and a 33% EPS jump. Their cloud product, Azure, fueled the gain with a 30% surge and doubled its AI integration showcasing commitment to the future. However, a lower-than-expected Q3 revenue forecast was a notable concern. Despite this, Microsoft remains a Zacks Rank #2 (Buy) with its thriving cloud business and dedication to AI advancements. Alphabet: While Q4 2023 earnings for Alphabet topped EPS estimates by 2%, ad revenue missed expectations slightly, leading to a stock price dip despite an overall 14% YoY sales growth. Their cloud business continues to shine, but concerns linger about growth in the core advertising engine. With a Zacks Rank 3 (Hold), may be a bit less appealing based on earnings estimate trends. Amazon: Q4 2023 earnings were music to investors' ears with Amazon exceeding estimates on both revenue and EPS. Their cloud computing arm, AWS, continues to be a major growth driver, and advertising revenue also surpassed expectations. This positive report led to a stock price rise and solidified Amazon's Zacks Rank #2 (Buy) rating. Apple: Q1 2024 earnings saw Apple beat analyst expectations for both revenue and EPS. Revenue grew 2% YoY to $119.6 billion, and EPS increased 16% YoY to $2.18. While iPhone sales slightly missed expectations, Services revenue reached an all-time high, suggesting a shift towards recurring income streams. The company also achieved a record number of active devices. Apple has a Zacks Rank #3 (Hold) rating. Meta Platforms: Q4 2023 earnings surpassed expectations, leading to a more than 20% surge in stock price. Both revenue and EPS beat analyst estimates, with revenue growing 25% YoY. The company announced its first-ever quarterly dividend and a $50 billion stock buyback, further contributing to investor excitement. Metaverse investment continues, and its profitability remains a concern for some investors. META has a Zacks Rank #2 (Buy) rating. The chart below shows the forward earnings multiples of each of the stocks discussed in this article. We can see that GOOGL and META have the lowest, near 20x, and AMZN has the highest at 43.5x. AAPL and MSFT are in the middle of the pack with 28.4x and 36.2x respectively. It is also worth noting that AMZN, META and GOOGL are all below their 10-year median valuations, while AAPL and MSFT are above them. I think Meta Platforms and Amazon are showing the most promise for further big moves ahead. Amazon’s development is just so impressive to me, with AWS still growing at 20%, and their new advertising business growing at 23% annually and suddenly bringing in $60 billion in sales annually. The success in ads is even more impressive when compared to Alphabet, the leading online ad platforms, whose growth is slowing significantly. Meta Platforms too is just absolutely killing it. Even with its 250% rally in the last year and a half it still trades at a very reasonable earnings multiple. And now with its new $50 billion buyback plan, and a new dividend, it is showing a real commitment to returning cash to shareholders. Alphabet, although it has some concerning growth data regarding its ad business, does continue to chug along. I don’t think it has the best growth prospects, but there is no doubt it is the cheapest of the Magnificent 7, which makes it a worthy investment consideration. Apple and Microsoft are of course fantastic businesses that should be a part of any well diversified investment portfolio, but I think at this point in time are less appealing than the other three. Apple is seeing a slowdown in iPhone sales growth, and Microsoft seems to have a lot of future news priced in especially regarding its recent gains with AI. The premium valuations are a concern as well. Nonetheless, this group of the world’s leading companies have shown that even at their mammoth sizes, they continue to thrive. Furthermore, they are showing that the US economy is still performing at a steady rate. Since 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Meta Platforms, Inc. (META) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}