{
    "title": null,
    "date": "2/13/2024",
    "url": "https://en.softonic.com/articles/one-of-the-people-responsible-for-making-apple-what-it-is-today-is-leaving-the-company-after-30-years",
    "text": "Advertisement Trending News It is possible that the senior designer believed that he had contributed enough in his work after 32 years. Chema Carvajal Sarabia The only other designer who has worked at Apple for as long as Jony Ive has announced that he will be leaving the company very soon. This is the end of something very important within Apple, which has been known for its designs. Bart Andre, described as one of “Ive’s top partners”, was part of the design team for 30 years and, with his departure at the end of this month, there will no longer be any high-ranking executives from the Ive era at Apple. The design team will now report to the Chief Operating Officer, Jeff Williams, but that decision has caused internal dissent among the staff, as reported in a recent report. Apple’s longest-serving senior industrial designer, Bart Andre, is leaving the company, marking the near-complete turnover of a team once led by Jony Ive https://t.co/N2iezPISlc Andre has been helping the design team to continue launching products with amazing designs since 1992, when he worked alongside Jony Ive. After Evans Hankey’s resignation in 2022, Andre took over and resumed the work where the previous executive had left off. However, with his retirement comes another problem, according to Bloomberg. The design team will now be under the leadership of Jeff Williams and, according to sources familiar with the matter, the relationship between the two parties is more than sour. #Apple's longest serving industrial designer, spending 32 years at the company, is leaving. Bart Andre was one of Jony Ive's top lieutenants and helped run things after Evans Hankey left in 2023. pic.twitter.com/qpyCnp8eKE One of the reasons for this heated behavior is that the design team is accountable to an executive in charge of Apple’s operations, which can lead to a conflict of competencies. Secondly, Williams has implemented some cost-cutting measures, which likely frustrates the team that has invested countless hours in designing numerous prototypes. Fortunately, there are still some Apple employees who were previously part of Jony Ive’s core design team to maintain peace: Richard Howarth, Molly Anderson, and Duncan Kerr. For those wondering, it is possible that the senior designer believed he had contributed enough in his work after 32 years and thought that retirement would be the best option at that time. Link Copied! Chema Carvajal Sarabia Journalist specialized in technology, entertainment and video games. Writing about what I'm passionate about (gadgets, games and movies) allows me to stay sane and wake up with a smile on my face when the alarm clock goes off. PS: this is not true 100% of the time. Advertisement Advertisement Advertisement Next story Dragon’s Dogma 2 has decided to correct some of your worst habits Loading next article  Copyright SOFTONIC INTERNATIONAL S.A. © 1997-2024 - All rights reserved "
}