{
    "title": "Redesigned Apple Watches not subject to import ban, US Customs says",
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/redesigned-apple-watches-not-subject-172042582.html",
    "text": "By Blake Brittain (Reuters) -A U.S. law enforcement agency has determined that Apple can use a redesign to bypass an import ban on newer Apple Watch models stemming from its patent infringement dispute with Masimo, the medical-monitoring technology company said in a court filing on Monday. The import ban, issued by the U.S. International Trade Commission (ITC), applies to Apple's current Series 9 and Ultra 2 watches and initially went into effect on Dec. 26. Apple convinced the U.S. Court of Appeals for the Federal Circuit to pause the ban the next day, and has since resumed selling the watches as it contests the import ruling. Apple had said that a proposed redesign would allow it to circumvent findings that the watches infringe Masimo's blood-oxygen reading pulse oximetry patents. Apple has not publicly described the redesign, which could involve an update to the watches' software. According to Masimo's filing on Monday with the Federal Circuit, Apple told the U.S. Customs and Border Protection agency that its redesigned watches \"definitively do not contain pulse oximetry functionality.\" Apple's filings with U.S. Customs and the agency's decision, issued Friday, have not been released publicly. \"Apple's claim that its redesigned watch does not contain pulse oximetry is a positive step toward accountability,\" a Masimo spokesperson said on Monday. Apple said on Monday that Series 9 and Ultra 2 watches with blood-oxygen reading capabilities are still available. Irvine, California-based Masimo has accused Apple of hiring away its employees and stealing its pulse oximetry technology to use in Apple Watches after discussing a potential collaboration. Apple has included a pulse oximeter feature in smartwatches since its Series 6 Apple Watch in 2020. Masimo sued Apple in California that year, alleging that Apple stole trade secrets related to technology for reading blood-oxygen levels and infringed Masimo patents. Apple countersued Masimo for patent infringement, calling Masimo's legal actions a \"maneuver to clear a path\" for a competing smartwatch. Masimo released its W1 watch, which tracks blood-oxygen levels and other health indicators, in 2022. Masimo asked the ITC in 2021 to bar Apple's imports and sales of Apple Watches that allegedly infringed its patents. The ITC ruled for Masimo last year and the ban went into effect in December. Apple briefly stopped sales of its latest Series 9 and Ultra 2 watches in the United States before Christmas due to the ITC decision, though they remained available from other U.S. retailers including Amazon, Best Buy, Costco and Walmart. The tech giant resumed selling the watches Dec. 27 after the Federal Circuit said it would pause the ban while it considers whether Apple's appeal should put the ITC's decision on hold. Apple said on Monday that the appeal would likely take at least a year, and that it expects a decision on its request to keep the ban paused during that time as early as Tuesday. The Federal Circuit is still considering whether to continue the pause or reinstate the ban, which would apply to Series 9 and Ultra 2 Apple Watches with pulse oximetry technology that do not have the redesign. Apple has argued that it is likely to win the appeal and that allowing the ban to stay in effect would cause significant harm to the company, its suppliers and the public. Masimo has said that maintaining the pause would hurt its business and reputation and \"demoralize\" its scientists and engineers. It also said in its Monday filing that the Customs decision undermines Apple's argument that reinstating the ban would cause the tech giant irreparable harm. (Reporting by Blake Brittain in WashingtonEditing by David Bario, Alexia Garamfalvi and Matthew Lewis) Related Quotes "
}