{
    "title": "Smart Strap Turns Your Apple Watch Into A Wrist Camera",
    "date": "1/29/2024",
    "url": "https://nocamels.com/2024/01/smart-strap-turns-your-apple-watch-into-a-camera/",
    "text": "Sponsored by the Asper Foundation and Reichman University An Israeli startup has created a smart wristband that uniquely turns an Apple Watch into a camera capable of taking photos and recording video and audio, without relying on an accompanying phone. Wristcam’s special strap includes two cameras (front and rear facing) to allow users to take the images or record short messages, which they can then send directly to others with the app or upload to their paired phone to share in other ways. “The developer ecosystem for the Apple Watch is nowhere near [as advanced as] the iPhone,” Writstcam CEO Roi Ginat tells NoCamels. “Many companies on an ongoing basis struggle with their phone applications, and they did not want to share any resources with developing a watch app.” But for Wristcam, the evolution into a camera for the watch was a natural one. Seeking to make an easy-to-use video platform, the company initially produced a live streaming app for the iPhone, but soon realized that it did not offer any unique features to attract new users. Instead, the company transformed their product into the device for the Apple Watch, which, according to analysts, was on 115 million wrists by December 2022. While the Wristcam is not formally affiliated with Apple, the tech giant did provide the company with a special security chip to embed into the strap so that it can properly connect to an iPhone. The Made for iPhone (MfI) chip is provided to third-party companies whose products, such as chargers and headphones, are deemed compatible by Apple. The app is downloaded onto the paired phone and therefore automatically the watch too, and once installed, the app connects to the camera on the strap. This allows the strap to send audio and video messages directly to another device with the same app, or to a paired phone in order to share via messaging services such as WhatsApp or even post to social media. In order to work, all devices must be connected to the internet. While most of the audio and video messages are designed to be around 20 seconds long, the app can record for several minutes at a time. The strap can also store a large number of messages as it has eight gigabytes of memory. Safety Strap The unique camera also works as a safety feature, with a separate Wristcam app called Protect. This allows a user to automatically live stream in an emergency, to up to three people with the app who form what Ginat calls a “safe network.” “Protect is a first of all on a mission to try and prevent emergencies, prevent physical or mental damage and suffering if possible, and improve handling of those situations when they occur with better speed and better accuracy,” Ginat explains. All the user needs to do, he says, is push a button that will start live broadcasting for people in their safe network. The application is set up to immediately alert everyone in that safe network as a critical notification, which is sent even when the phone is in silent or do not disturb mode. (Israel’s national alert system for incoming rocket fire also bypasses these modes.) The Protect app automatically uploads the live-streamed video and audio to the cloud for review at a later date. The app even works without the camera, only recording audio. Once another person is watching the live stream, they can start voice communication with the original user through the app. Ginat says this particular feature works well when people are in distress and need someone to calm them down. “Whether it’s making sense of the person in distress, whether it’s calming them down or directing them on the right things to do – it’s basically being there,” he says. “That’s already helpful and it’s fast.” In the US and in Israel, Protect is also designed to facilitate calls from someone watching the livestream to the emergency services. The feature was made available for free in Israel last year, following the massive terror attack of October 7. When the emergency services in either country are contacted, the caller can easily transmit the video and audio from the Protect app to the call center, giving the operator an understanding of the situation, who is involved and where the caller is located. “911 calls typically start with a lot of very basic questions like your name, where are you, who’s there with you,” he says, and the app helps to provide this information. The emergency call can be made while still watching the live stream, which Ginat says is a crucial feature as it means the line of communication with the person in distress remains open. The company, which was founded in 2012 and has offices in Ramat Gan, California and China, is funded by private investors rather than venture capital firms. They are, Ginat says, nonetheless always looking for new sources of support. The wristband is currently available on Amazon in the US and Europe, as well as in certain European countries that do not have the option to purchase from the online shopping platform. Future plans, Ginat says, include incorporating artificial intelligence to improve the technology both for communication and personal safety. “What’s most exciting for me now is the combination of AI and our rich media technologies, because it’s just a perfect match both for safety and health,” he says. NOCAMELS Straight To Your Inbox Accessibility Tools "
}