{
    "title": "Apple's new EU App Store changes are 'vague and misleading', says Spotify \nCEO Daniel Ek | Mint",
    "date": "1/27/2024",
    "url": "https://www.livemint.com/technology/tech-news/apples-new-eu-app-store-changes-are-vague-and-misleading-says-spotify-ceo-daniel-ek-11706367414995.html",
    "text": "Swedish music streaming service Spotify's CEO Daniel Ek on 26 January criticised Apple's proposed App Store changes ahead of the EU Digital Markets Act (DMA) and called changes 'at best vague and misleading', a 'new low for the company' and 'extortion'. The Spotify CEO in a blog post alleged that under the false pretense of compliance and concessions, Apple has put forward a new plan 'that is a complete and total farce'. He argued, \"Apple is nothing if not consistent. While they have behaved badly for years, this takes the level of arrogance to an entirely new place. Under the false pretense of compliance and concessions, they put forward a new plan that is a complete and total farce. Essentially, the old tax was rendered unacceptable under the DMA, so they created a new one masquerading as compliance with the law.\" ALSO READ: Spotify takes on Apple: Audiobooks and subscriptions available in-app, bypassing 30% fee Ek alleged that Apple had been clear from the beginning that they didn’t like the idea of abiding by the DMA, so they formulated an undesirable alternative to the status quo. In his blog, Ek called Apple's new 0.50 cent Euro fee per download, every year, in perpetuity, to Apple for just allowing developers to exist on iOS 'is extortion, plain and simple'. 'This is extortion'\"This is extortion, plain and simple. If Apple’s already charging a commission of 17% (and 10% for recurring payments) on digital goods purchased, why would they also need to charge an annual flat fee for every user?\" Ek wrote.\n   He added that for any developer wondering if this might work for them, they need to have less than a million customers and essentially sign up for not growing in the long run.\n\n\n\n\nYou may be interested in\n\n\n\n\n\n\n\n\n\n\n\n\n    \"From our read of Apple’s proposal, a developer would have to pay this fee even if a user downloaded the app, never used it and forgot to delete it. This will hurt developers, potential start-ups and those offering free apps most: How will a developer pay Apple back if its free app goes viral – multiple millions of accounts install that free app, and then that developer owes Apple millions?\" he asked.\n   According to new terms, if Spotify stays in the App Store and wants to offer its in-app payment, it will have to pay a 17 percent commission and a 0.50 cent Euro Core Technology Fee per install and year.\n   \"This equates for us to being the same or worse as under the old rules. And if we managed to remove our app from the App Store and only existed in the Alternative App Store, that would still not work,\" he said.\n   \"With our EU Apple install base in the 100 million user range, this new tax on downloads and updates could skyrocket our customer acquisition costs, potentially increasing them tenfold. This, as we have to pay on every install or update to our free or paid app, even for those who no longer use the service,\" he added.\n   In response to the DMA coming into force in March, Apple has announced changes to iOS, Safari, and the App Store in the European Union.\n   As per details, the new changes include new controls and disclosures, and expanded protections to reduce privacy and security risks the DMA creates, the company said in a statement.\n   However, the main news is that third-party app stores will be allowed on iOS for the first time. In March, the following changes will arrive with iOS 17.4.\n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Chip(per) ambitions: Why India needs its wafer fabs          Dholera chip fab: India's leap into electronics manufacturing          Mint Primer| Google vs Indian startups row: its global implications          Ask me anything: Inside the race to build desi GPTs          A Google Maps competitor in India's tech revolution          ‘Need another technology leap for AI to start reasoning like humans’          Govt's ₹1-trillion deep tech fund: why we need it, and is it enough?          Telepathy: Would you allow a chip implant in your brain?          Budget 2024: India's digital public infra now a new 'factor of production'          Rights issue caps Byju's wild ride from top startup to throwaway valuation       Explore Premium  \n\n\n                Catch all the  Technology News and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 27 Jan 2024, 08:32 PM IST\n\t\nTopics You May Be Interested In \n Apple iOS 17.4 \n Daniel Ek \n Spotify \n Apple Inc \n EU Digital Markets Act \n Apple App Store \"This is extortion, plain and simple. If Apple’s already charging a commission of 17% (and 10% for recurring payments) on digital goods purchased, why would they also need to charge an annual flat fee for every user?\" Ek wrote. He added that for any developer wondering if this might work for them, they need to have less than a million customers and essentially sign up for not growing in the long run. \"From our read of Apple’s proposal, a developer would have to pay this fee even if a user downloaded the app, never used it and forgot to delete it. This will hurt developers, potential start-ups and those offering free apps most: How will a developer pay Apple back if its free app goes viral – multiple millions of accounts install that free app, and then that developer owes Apple millions?\" he asked. According to new terms, if Spotify stays in the App Store and wants to offer its in-app payment, it will have to pay a 17 percent commission and a 0.50 cent Euro Core Technology Fee per install and year. \"This equates for us to being the same or worse as under the old rules. And if we managed to remove our app from the App Store and only existed in the Alternative App Store, that would still not work,\" he said. \"With our EU Apple install base in the 100 million user range, this new tax on downloads and updates could skyrocket our customer acquisition costs, potentially increasing them tenfold. This, as we have to pay on every install or update to our free or paid app, even for those who no longer use the service,\" he added. In response to the DMA coming into force in March, Apple has announced changes to iOS, Safari, and the App Store in the European Union. As per details, the new changes include new controls and disclosures, and expanded protections to reduce privacy and security risks the DMA creates, the company said in a statement. However, the main news is that third-party app stores will be allowed on iOS for the first time. In March, the following changes will arrive with iOS 17.4. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}