{
    "title": "Apple's New Fee Could Drive Developers Of Free And Shareware Apps Out Of \nBusiness",
    "date": "1/26/2024",
    "url": "https://technewsspace.com/apples-new-fee-could-drive-developers-of-free-and-shareware-apps-out-of-business/",
    "text": "European app developers who decide to accept the new terms of cooperation with Apple will have to pay a “Core Technology Fee” (CTF) of €0.50 for each first installation of an application after achieving one million installations within a year achieved. This model threatens to ruin developers of free and shareware applications.  Image source: apple.com Developers of free or shareware apps that prove popular enough to reach more than a million downloads face astronomical amounts – Apple even posted on its website Online calculator. Thus, the creator of an application with an audience of 2 million users has to pay Apple 41,667 euros per month or 500,000 euros per year, even if he does not make any money from it himself. That is, to achieve profitability, applications must earn at least €0.50 per year from each user – a measure forced by product developers whose target audience exceeds 1 million downloads. You have the option to avoid this by agreeing to Apple’s usual terms of 15 to 30% commission on each transaction. In addition to the €0.50 CTF, Apple’s new terms include a commission of between 10% and 17% for apps from the App Store and 3% for each transaction through the Apple payment system. The Company waives the CTF for applications from non-profit organizations, accredited educational institutions, and government agencies that have been approved for a fee waiver. For services the size of Spotify, collecting CTFs can be prohibitive. For example, the developer of an application for $0.99 with a turnover of $10 million has to transfer more than $500,000 per month to Apple. The changes will take effect with the release of Apple iOS 17.4; To apply them, developers must switch to the new payment system. Robbie Elmers is a staff writer for Tech News Space, covering software, applications and services. Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  TECH NEWS SPACE The Tech News Space team monitors news from the world of high technology, science, the gaming industry and delivers them to its readers in a timely manner. "
}