{
    "title": "Dow Awaits Key December Jobs Data; Apple Sells Off On Second Downgrade",
    "date": "1/4/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-rises-in-bumpy-new-year-rally-chip-glut-hits-ev-plays-as-apple-gets-second-downgrade/",
    "text": "BREAKING: Futures Rise; Tesla Skids On China Production Cut     Major stock indexes ended Thursday's session flat to down, as the Dow Jones Industrial Average finished slightly above the break-even point but a sell-off in technology pulled the Nasdaq lower for the fifth-straight day. Dow Jones stocks had climbed 0.3% in late trades but in the end managed a gain of only 10 points, while the S&P 500 gave up positive ground and fell 0.3% at closing bell on the stock market today. The Nasdaq dropped another 0.6% despite venturing into positive ground earlier in the session. The same was true for the small-cap Russell 2000. The Russell was in the black earlier but gave up that territory and inched downward by the closing bell. Meanwhile, volume on both the New York Stock Exchange and the Nasdaq was lower compared with the same time Wednesday. The Innovator IBD 50 (FFTY) exchange traded fund shone with a 0.9% gain. And the yield on the benchmark 10-year Treasury note rose 8 basis points to 3.99%. In economic news, December's report from ADP showed that the economy added 164,000 jobs, well above views of 115,000 from economists surveyed by Econoday. Further, the U.S. Labor Department said initial unemployment claims came in at 202,000 for the week ended Dec. 30, also below consensus of 217,500. The department's payroll data for December is due Friday. According to Wall Street estimates, the economy added 164,000 jobs in December. Among stocks in the Dow Jones index, Walgreens Boots Alliance (WBA) gapped down below its 50-day moving average after the drug retailer reported a drop in earnings. The company's chart already was bearish with its 200-day line tracking above the 50-day line for roughly a year. The company said sales grew 10% while earnings declined 43%. Further, it reduced its quarterly dividend by 48% to 25 cents. Walgreens Chief Executive Tim Wentworth said the reduction would help the company's \"long-term balance sheet and cash position and will ultimately improve shareholder value.\" Shares pared back some losses but Walgreens closed 5% lower on Thursday. Merck (MRK) climbed nearly 2% and was a top Dow gainer. The company's CEO reportedly said Merck is seeking to develop GLP-1 treatments with benefits beyond weight loss. Tech stocks on the Dow lagged, however. Apple (AAPL) dropped more than 1%, and fell further below its 50-day moving average on another analyst downgrade. Coinbase Global (COIN) climbed 2% after a steep three-day sell-off. Crypto stocks are turning volatile as investors await the approval of a spot crypto ETF in 2024. That could happen as early as Friday, ahead of the expected Jan. 10 deadline. Crypto plays Marathon Digital (MARA) and Riot Platforms (RIOT) also rose. Outside the Dow Jones index, Eli Lilly (LLY) was on watch as it hovered near a buy point of 629.97 Thursday, but ultimately ended the session 0.5% lower. The drug giant stepped up its direct-to-customer marketing pitch and launched a website for its burgeoning weight-loss treatments, calling it LillyDirect. Meanwhile rival drug company Novo Nordisk (NVO) struck two separate deals with Omega Therapeutics (OMGA) and Cellarity for weight loss and liver disease treatments. NVO stock broke out from a flat base with a buy point of 105.69 and is in a buy zone. Bulls, Bears Duel Ahead Of Jobs Data; 6 Stocks To Watch In tech news, Mobileye (MBLY) plummeted nearly 25% and crashed through its 50-day moving average on a weak preliminary sales outlook for the fourth quarter and full year. A chipmaker for driver-assistance systems in vehicles and recent Intel spinoff, Mobileye says it has to work through excess inventory. The news triggered a sell-off in other chip stocks in driver assistance technologies, including Analog Devices (ADI) and STMicroelectronics (STM). Also outside the Dow Jones index, Peloton (PTON) surged nearly 14%. It was reported Peloton struck a partnership with TikTok to provide fitness classes and other content. Please follow VRamakrishnan on X/Twitter for more news on the stock market today. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders MarketSmith: Research, Charts, Data And Coaching All In One Place How To Research Growth Stocks: Why This IBD Tool Simplifies The Search For Top Stocks 3/21/2024\nNovo Nordisk and Eli Lilly stocks dipped Thursday after Medicare said it could pay for weight-loss drugs for some members. 3/21/2024\nNovo Nordisk and Eli Lilly stocks dipped Thursday after Medicare... Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}