{
    "title": "Here's Why ClearBridge Investments Reduced its Exposure in Apple (AAPL)",
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/news/why-clearbridge-investments-reduced-exposure-122534694.html",
    "text": "ClearBridge Investments, an investment management company, released its “ClearBridge Dividend Strategy” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. The market recovered in 2023 following a sharp decline in 2022, driven by excitement about artificial intelligence and an improving forecast for interest rates. The strategy underperformed the benchmark S&P 500 Index, in the fourth quarter. The strategy gained from eleven sectors it invested during the quarter on an absolute basis. Sector allocation detracted, while stock selection contributed positively on a relative basis. In addition, please check the fund’s top five holdings to know its best picks in 2023. In its Q4 2023 investor letter, ClearBridge Dividend Strategy featured stocks such as Apple Inc. (NASDAQ:AAPL). Headquartered in Cupertino, California, Apple Inc. (NASDAQ:AAPL) is a multinational technology company that designs and manufactures smartphones, personal computers, tablets, wearables, and accessories. On January 4, 2024, Apple Inc. (NASDAQ:AAPL) stock closed at $181.91 per share. One-month return of Apple Inc. (NASDAQ:AAPL) was -7.05%, and its shares gained 40.34% of their value over the last 52 weeks. Apple Inc. (NASDAQ:AAPL) has a market capitalization of $2.866 trillion. In its fourth quarter 2023 investor letter, ClearBridge Dividend Strategy stated the following regarding Apple Inc. (NASDAQ:AAPL): \"We meaningfully reduced our exposure to Apple Inc. (NASDAQ:AAPL) in 2023. Apple is the largest company in the world and produces terrific products that engage users for hours each day. Despite the company’s size, ubiquity and relevance, however, Apple’s growth has slowed dramatically. Its fiscal 2023 earnings were flat with those of 2022. Apple trades at 30x earnings; sustaining that multiple will require a meaningful acceleration in revenues. While such an improvement is possible, we do not see any obvious catalysts for adding tens of billions of dollars to Apple’s topline. Consequently, the risk-reward skews negatively.\" Pixabay/Public Domain Apple Inc. (NASDAQ:AAPL) is in 10th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 134 hedge fund portfolios held Apple Inc. (NASDAQ:AAPL) at the end of third quarter which was 135 in the previous quarter. We discussed Apple Inc. (NASDAQ:AAPL) in another article and shared the list of money-making stocks to invest in. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: 10 Best January Dividend Stocks To Buy 11 Cheap Pot Stocks to Buy 20 US Cities with the Highest Rental Vacancy Rates Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}