{
    "title": "Apple share price hammered",
    "date": "1/3/2024",
    "url": "https://mybroadband.co.za/news/business/520577-apple-share-price-hammered.html",
    "text": "MyBroadband Apple Inc. got itself a new bear as expectations of soft demand for its latest iPhone prompted analysts at Barclays Plc to downgrade the stock. Shares fell 3.6% on Tuesday, their biggest one-day percentage drop since September, and the decline erased more than $107 billion in market value. Barclays analysts led by Tim Long cut their rating on Apple to underweight and price target by $1 to $160, compared with the stock’s Tuesday closing price of $185.64. “We expect reversion after a year when most quarters were missed and the stock outperformed,” the analysts wrote in a note on Tuesday. “ Our checks remain negative on volumes and mix for iPhone 15, and we see no features or upgrades that are likely to make the iPhone 16 more compelling.” Apple’s shares rose around 50% to a record last year and saw its market value hit $3 trillion as investors bet that its flagship device will withstand a sluggish economy.  However, doubts have emerged whether the stock will be able to repeat such hefty gains given rising competition from the likes of Huawei Technologies Co. and a Chinese government crackdown on foreign-made devices. The new underweight means Apple has five sell or equivalent ratings, according to data compiled by Bloomberg, in contrast to 34 buys and 14 holds. The stock’s recommendation consensus — a proxy for its ratio of buy, hold, and sell ratings — stands at 4.08 out of five, its lowest since October 2020. The average analyst price target suggests a return of just 7.5% over the next year. Apple Barclays big tech China Huawei iphone iPhone 15 iPhones smartphone sales tech shares Comments section policy: MyBroadband has a new article comments policy which aims to encourage constructive discussions. To get your comments published, make sure it is civil and adds value to the discussion.   Which petrol station are you most likely to go to to fill up your car?  View Results "
}