{
    "title": "Apple steals the smartphone crown from Samsung",
    "date": "1/16/2024",
    "url": "https://www.businessinsider.com/apple-iphone-overtakes-samsung-global-smarphone-shipments-market-id-data-2024-1",
    "text": "       Tim Cook has a good reason to smile today. There's some more sunlight in the midst of storm clouds for Apple — the iPhone maker toppled Samsung off its perch as the top smartphone seller in the world for 2023, according the data from the International Data Corporation. Apple closed out 2023 with record-high smartphone market share despite the overall market for phones decreasing. Related stories It's a notable milestone — it's the first time any company other than Samsung has topped the list since 2010. Apple is the \"biggest winner\" of the year in the smartphone race, IDC research director Nabila Popal said. The tech giant shipped an estimated 80.5 million smartphones in the fourth quarter of last year — the highest of any other phone-maker — and enjoyed a market share that grew to 24.7 percent. Samsung shipped an estimated 53 million smartphones during the same period and saw its market share shrink to 16.3 percent, according to IDC. Overall, the smartphone market declined 3.2% year-over-year — a decade low, according to the IDC. \"Apple's ongoing success and resilience is in large part due to the increasing trend of premium devices, which now represent over 20% of the market, fueled by aggressive trade-in offers and interest-free financing plans,\" Popal said in a statement. But, this win for Apple comes on the heels of some losses. During its fiscal Q4 2023 earnings call, Cook said that overall revenue at Apple declined for the fourth consecutive quarter, yet revenue from the iPhone went up. A complicated relationship with China has put a strain on the numbers in its largest market. Some reports have indicated that the iPhone 15 may not be performing as well as past models released in China. The country recently cracked down on the use of iPhones by government officials, and Chinese tech company Huawei is proving to be increasingly tough competition. And the headaches have continued into 2024. In the first week of the year, Apple's stock got 2 downgrades from analysts  — falling 6% over five days. Barclay analysts cited the \"lackluster\" performance of the iPhone 15 in China. But while the smartphone business is tough right now, Apple continues to prove its iPhone is still a major moneymaker — both in the US and around the world. Read next Jump to "
}