{
    "title": "Apple faces challenge from Microsoft for world’s most valuable company \ntitle | Mint",
    "date": "1/11/2024",
    "url": "https://www.livemint.com/market/stock-market-news/apple-faces-challenge-from-microsoft-for-world-s-most-valuable-company-title-11704942603499.html",
    "text": "Apple faces a potential challenge from Microsoft for the title of the world’s most valuable company as concerns about iPhone sales have led to a recent decline in Apple share price. After a 48% surge in 2023, Apple shares fell 4% in 2024 so far on worries over smartphone demand. In contrast, Microsoft share price gained 2% this year after a 57% surge in 2023. On Wednesday, Apple’s stock dropped by 0.4%, while Microsoft gained 1.6%, narrowing the margin between the value of two companies. Currently, Apple’s market value stands at $2.866 trillion, slightly ahead of Microsoft’s $2.837 trillion. Apple’s market cap reached its peak at $3.081 trillion on December 14, while Microsoft's value reached $2.844 trillion on November 28. Also Read: BlackRock to cut 3% of workforce, aims for larger employee strength by end of 2024 Microsoft has briefly taken the lead over Apple as the most valuable company a handful of times since 2018. Most recently in 2021, it overtook Apple when concerns about supply chain shortages related to the COVID-19 pandemic hit the iPhone maker's stock price. Analysts believe both tech stocks look relatively expensive in terms of price to their expected earnings. Apple is trading at a forward PE of 28, well above its average of 19 over the past 10 years, according to LSEG data. Microsoft is trading around 31 times forward earnings, above its 10-year average of 24, Reuters reported. (Exciting news! Mint is now on WhatsApp Channels  Subscribe today by clicking the link and stay updated with the latest financial insights! Click here!) Apple has been facing a slowdown in iPhone demand in China as the sales dropped 30% in the first week of 2024, amid signs of growing competitive pressures from Huawei and other domestic rivals, as per reports. In its quarterly report in November, Apple gave a sales forecast for the holiday quarter that missed Wall Street expectations, hurt by weak demand for iPads and wearables. Also Read: Amazon to lay off hundreds of employees in Prime Video, MGM Studios Analysts expect Apple to see revenue growth of 0.7% to $117.9 billion for the December quarter, according to LSEG. That would mark its first year-on-year revenue increase in four quarters. Apple will report its results on February 1. Microsoft is estimated to report a 16% increase in revenue to $61.1 billion, lifted by ongoing growth in its cloud business when it reports in the coming weeks. Catch Live Market Updates here (With inputs from Reuters) Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Get the best recommendations on Stocks, Mutual Funds and more based on your Risk profile! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp Chat with\n                    MintGenie I am Genie, Mint’s AI enabled assistant to help you with your queries related to: "
}