{
    "title": "Apple faces epochal moment with looming antitrust scrutiny",
    "date": "1/8/2024",
    "url": "https://www.cnn.com/2024/01/08/tech/apple-faces-looming-antitrust-scrutiny/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Follow: A potential antitrust lawsuit against Apple by the federal government could be a turning point as big in the company’s 48-year history as the return of founder Steve Jobs or the invention of the iPhone, according to legal experts. Speculation about a landmark case is again on the rise after The New York Times reported Friday that the Justice Department is in the final stages of a years-long investigation into Apple, which could lead to a lawsuit later this year. The probe reportedly focuses on everything from the seamless integration between the iPhone and Apple Watch to the company’s digital payments system and Apple’s use of green text bubbles to differentiate Android text messages from iMessage communications — in short, a broad look at Apple’s tightly controlled, walled-garden ecosystem that’s turned it into $2.8 trillion behemoth. Apple — the most valuable company in the world — is the only leading tech giant the US government has yet to sue on antitrust grounds within the past few years. If antitrust officials do go after Apple, expect it to be a “full-frontal assault” on Apple’s business, said Adam Wolfson, an antitrust attorney at the law firm Quinn Emanuel. “Depending on what the Department of Justice actually alleges, it could potentially attack all the ways, or many of the ways, that Apple runs its business and maintains itself as one of the most profitable companies in the world,” Wolfson said. Apple did not immediately respond to a request for comment. A DOJ investigation does not mean the agency intends to bring a case, and regulators could still opt not to sue. But a decision to take Apple to court would be “a very big deal,” according to William Kovacic, a former chairman of the Federal Trade Commission, one of the country’s top antitrust agencies. “The stakes for consumers here, the stakes for the company, are very high,” Kovacic said. Some of the most important milestones in Apple’s roughly half-century of existence include Jobs’ ouster from Apple in 1985, along with his return in 1997 and his fateful pivot to launch the iPhone, the iPad and the Apple app store, ushering in the mobile era of computing that has forever transformed global society. A DOJ lawsuit targeting the bedrock of Apple’s success would become another major chapter in the company’s storied narrative, and Apple would likely draw on much of that history — as well as the goodwill it has created with millions of consumers who love the company’s products — as part of its court defense, legal experts said. Despite its popularity with users, Apple has attracted mounting criticism from app makers, rivals and policymakers who have accused the company of locking users in and of forcing competitors to accept restrictive terms to reach Apple’s users. Some US lawmakers have proposed legislation to force open Apple’s app store, though the bill has stalled amid opposition by Apple and Google. In other situations, Apple’s opponents have successfully challenged the company, most recently in a roiling patent dispute that led to an import ban on certain Apple Watches last month before Apple obtained an emergency court order pausing the ban. In 2020, a US House investigation found that Apple, along with Amazon, Google and Meta, all wielded monopoly power in potentially harmful ways. The 16-month investigation featured high-profile hearings with tech CEOs and culminated in a 450-page congressional report detailing some of the companies’ allegedly anticompetitive business practices. It also fueled a wave of antitrust scrutiny that has since led to US government lawsuits against all the companies named in the report, except for Apple. Apple’s handling of Android messages has emerged as a high-profile example for critics of how the company tries to leverage its power. By showing Android messages on iPhones within a green text bubble instead of a blue one, as it does with its proprietary iMessage platform, Apple has created a kind of status differential, said Wolfson. “People with an iPhone are more entrenched because they don’t want to be on that other side,” he said. “And for the people who are on Android phones, they want to get an iPhone because they don’t want to be excluded. The question is, is that an exercise of power that has anticompetitive effects?” Last year, Apple announced plans to improve interoperability with Android messages by adopting a standard known as Rich Communication Services, although experts anticipate Apple will continue using the green message bubbles. Beginning in 2020, Apple fought a highly public antitrust court battle over its app store against Epic Games, maker of the video game “Fortnite,” but a US district court and federal appeals court both ruled that Apple has not illegally monopolized the market for distributing apps on its platform. Aspects of the case have been appealed to the US Supreme Court, though the justices have not yet determined whether to hear the matter. Those existing rulings highlight the challenges ahead for the Justice Department, which will need to bring in any lawsuit a strong legal theory about how Apple has allegedly harmed competition. The DOJ would also need to prove that the benefits Apple has delivered to consumers don’t outweigh its alleged antitrust violations. “All of these matters are extremely challenging,” Kovacic said. “[Apple] will argue, as have Google, Amazon and Facebook, that their behavior isn’t sinister, but crucial to providing users with a good experience.” If the Justice Department brings a lawsuit against Apple, it would likely be considered as significant as the US government’s antitrust prosecution of Microsoft during the 1990s, legal experts said. It may also be interpreted as a symbol of President Joe Biden’s economic agenda. Leading the DOJ’s antitrust division and the FTC are a fresh generation of officials who have argued the United States has historically under-enforced the nation’s antitrust laws, leading to a wave of corporate consolidation and anticompetitive practices that ultimately harmed the public through higher prices, fewer choices or reduced innovation. Both agencies have since pursued high-profile cases against powerful companies and mega-mergers. “One of the greatest accomplishments of the Biden administration, especially in terms of economic policy, is to have moved antitrust from the storage sheds to the front burner,” said David Balto, a former policy director at the FTC. Members of Congress have also expressed concern about rising economic concentration and have passed legislation increasing the budgets for the FTC and DOJ. That, along with the House investigation and the proposals to regulate US app stores, shows how lawmakers have a pivotal role to play in curbing competition abuses, said Charlotte Slaiman, an antitrust attorney and vice president at Public Knowledge, a consumer advocacy group. A case against Apple would reflect what enforcers can do with more resources, Slaiman added. It could also potentially lead to sweeping changes to the tech sector not seen since the Microsoft case, which ended in a groundbreaking settlement that experts credit for the rise of the modern internet. “If they were to bring a case against Apple now, it would be at the same level, in terms of magnitude and enforcement,” Wolfson said. “It would be a marked elevation in what they’re going after.” Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}