{
    "title": "Apple Vision Pro receives mixed reviews on launch. Here's what experts said",
    "date": "2/12/2024",
    "url": "https://www.hindustantimes.com/technology/apple-vision-pro-receives-mixed-reviews-on-launch-heres-what-experts-said-101707714210123.html",
    "text": "Subscribe Now! Get features like Apple Vision Pro, the virtual reality headset of technology giant Apple, was launched last week in the United States. Tim Cook, the iPhone maker's chief executive officr, was present at the company's flagship Manhattan store in New York for the launch of the product which Apple calls it ‘an era of spatial computing’. With $3,499 headset Vision Pro, Apple is now in this new product category. Apple is hoping to use cutting-edge technology — and the company’s famous marketing muscle — to turn it into something bigger, as it competes against Meta's Quest. ALSO READ: Apple Vision Pro underlines a world with virtual overlays, and flagship phones are changingHere's what the tech experts reacted on the launch of Apple's Vision Pro virtual reality headset. Adam Rogers of Business Insider said that the users' brains are set to undergo a massive experiment and can rewire the sense of the world around them. It will make them find harder to agree on what is reality. Mark Gurman of Bloomberg described Vision Pro as an ‘iPad Killer’. In a post on X, the tech journalist who tracks Apple updates, said he is finding it ‘impossible’ to enjoy watching a movie in a pitch black room. He complained of the movie being stopped frequently by error messages for the room. According to Nilay Patel, editor-in-chief of The Verge, the Vision Pro is the ‘best consumer headset’ ever made, and that is the problem. Matthew Miller of ZDNet, said that the Vision Pro is more ideal for the content creators, day traders and whose workflows revolve around just one to three apps. He also suggested that this headset is for watching movies on flights, enjoying multiple sports games at once and exploring virtual environments. Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}