{
    "title": "Apple Watch: What to Know About the Legal Disputes",
    "date": "2/8/2024",
    "url": "https://time.com/6692718/apple-watch-masimo-alivecor-patent-antitrust-legal-explainer/",
    "text": "In a win for Apple, a U.S. federal appeals court earlier this week dismissed a lawsuit claiming that the tech giant had illegally monopolized the U.S. market for heart-monitoring apps for the Apple Watch. The lawsuit, filed by medical technology startup AliveCor, comes amid years of legal tussle between the two companies, centered around claims of antitrust and intellectual property infringement by Apple. “AliveCor’s lawsuit challenged Apple’s ability to improve important capabilities of the Apple Watch that consumers and developers rely on, and today’s outcome confirms that is not anticompetitive,” Apple said in a statement provided to media outlets. The details of the judgment made Tuesday remain sealed, but a redacted version is expected to be made public in the coming weeks. AliveCor said it plans to appeal the ruling, saying in a statement provided to media outlets that it “will continue to vigorously protect our intellectual property to benefit our consumers and promote innovation.” The ruling brings temporary reprieve to Apple, which in recent weeks has faced separate legal setbacks over its watch technology. The Apple Watch, one of the company’s best-selling products and a frontrunner in the global wearable medical device market, which is predicted to be worth $132.5 billion by 2031, has faced years of legal challenges. But despite one ruling forcing Apple to disable the blood-oxygen-monitoring feature in two of its newest models, it does not seem like the company will be turning away from the watch business anytime soon. CEO Tim Cook recently told CNBC that “there’s lots of reasons to buy the watch even without the blood oxygen sensor,” one of the health features most scrutinized by courts and competitors, AppleInsider reported. Here’s what to know about the biggest legal disputes surrounding the Apple Watch: In 2021, AliveCor filed an antitrust lawsuit against Apple over the heart-monitoring technology used in the Apple Watch, claiming that Apple had abused its monopolistic power with the electrocardiogram (ECG) technology. “Apple’s tactics in the heartrate analysis market, have injured competition, reduced consumer choice, and potentially damaged public health,” AliveCor CEO Priya Abani said in a statement at the time. AliveCor had previously filed separate patent infringement suits against Apple, and in 2021 it also filed a complaint with the International Trade Commission (ITC) seeking to ban the import of Apple Watches in the U.S. AliveCor claims that, during a 2015 meeting its cofounder had with Apple executives to demonstrate AliveCor’s heart-monitoring device KardiaBand, it was told Apple wanted to collaborate on the technology. Apple countered that it has hosted hundreds of such meetings without promises of partnership. According to the antitrust lawsuit, Apple announced the heart health feature for its Apple Watch more than a year after the meeting and just hours after AliveCor informed them of the Kardiaband launch date. The Apple Watch went on to dominate the market and, according to AliveCor, to effectively prevent third parties from offering competing heart-rate-monitoring apps on the device. In 2020, medical technology company Masimo sued Apple for infringing on 10 of its patents, including technology to measure blood oxygen levels and heart rate. In December, the ITC imposed a ban on the Series 9 and Ultra 2 models of the Apple Watch after finalizing its decision that the blood oxygen sensors in the devices did indeed infringe on patents owned by Masimo and its subsidiary Cercacor Laboratories. That ban was paused after just one day, on Dec. 27, by a federal appeals court, allowing the watches to go back on sale. But the court decided to reinstate the ban in January—a move welcomed by Masimo. “It affirms that even the largest and most powerful companies must respect the intellectual rights of American inventors and must deal with the consequences when they are caught infringing others’ patents,” Joe Kiani, Founder and CEO of Masimo, said of the reinstated ban in a statement. To get around the import ban, Apple redesigned the Series 9 and Ultra 2 watches, dropping blood oxygen features for the two models. While the redesigned watches, which have been on sale in the U.S. since Jan. 18, still include the blood-oxygen-monitoring sensor, it has been made not functional, pending an appeal. Masimo has been feuding with Apple since 2013, when the latter hired an engineer who was previously the chief technical officer of Cercacor Laboratories, followed by about 20 other ex-employees from Masimo. Masimo accused Apple of poaching its staff to steal its patented technology. It’s not just companies that are going up against Apple. Individuals have also engaged in David vs. Goliath-style legal battles with the tech giant. In 2019, Apple was sued by Joseph Wiesel, a New York cardiologist, in a federal court alleging that the company used his patented monitoring toolto detect heartbeat irregularities. A trial date has not been set yet for that case, with the court granting Apple’s application for a stay of the proceedings in 2021, pending a decision from the U.S. Patent and Trademark Office on Apple’s request for a reexamination. And in a 2021 lawsuit not to do anything with cardio technology, an app developer and former Pinterest engineer alleged that Apple had banned his app for a FlickType watch keyboard from the App Store but later allowed competing keyboard apps that ripped off the FlickType keyboard, which led to the plummeting of FlickType’s revenue. That lawsuit was settled with undisclosed terms in 2022. Contact us at letters@time.com "
}