{
    "title": "Tiger Global-backed Pento acquired, we go hands-on with the Apple Vision \nPro, and close to €5B was invested in ...",
    "date": "2/16/2024",
    "url": "https://tech.eu/2024/02/16/this-week-in-european-tech/",
    "text": "This week our research tracked more than 65 tech funding deals worth over €4.9 billion, and around 10 exits, M&A transactions, rumours, and related news stories across Europe. In addition to this week's top financials, we've also indexed the most important/industry-related news items you need to know about. If email is more your thing, you can always subscribe to our newsletter and receive a more robust version of this round-up delivered to your inbox. Either way, let's get you up to speed. 🇫🇷 ACC bags €4.4B to construct three gigafactories for lithium-ion battery cell production 🇨🇿 Omnetic raises €100M from Kartesia and CVI 🇳🇱 Renewable chemistry firm Avantium secures €70M to launch FDCA plant in the Netherlands 🇩🇰 Tiger Global-backed Pento acquired by Israeli HR platform HiBob 🇫🇷 Deskbird acquires french company Hubtobee 🇬🇧 Signal AI acquires risk data firm Social 360 🇨🇭 Swiss VC fund Founderful nears 70 per cent capacity with $85M raised 🇩🇪 Healthcare sector attracts increased interest: Earlybird Health's new €173M fund 🇫🇮 “Never too late and never too early” to launch a startup, says founder of one of Finland’s biggest fintechs 🇺🇸 Peter Thiel’s Founders Fund made $200M crypto investment before bull run 🇵🇱 Poland’s Full Speed Ventures launches a new €50M tech fund 🇪🇺 Google launches AI Opportunity Initiative for Europe; announces €25M funding to support AI skills development 🇪🇺 Apple won’t be forced to open iMessage to rivals, EU decides, as it also lets three Microsoft services off DMA hook 🇪🇺 EU gig workers rule opposed by industry faces key vote 🇪🇺 EU mulls easing merger rules for telecoms, Big Tech to help pay network costs 🇺🇸 SVB is in hiring mode to defend its turf a year after collapse 🇩🇪 This VC firm wants to fund the best night of your life 🇺🇸 Hands-on with the Apple Vision Pro 🇬🇧 Future data centres may have built-in nuclear reactors 🇫🇮 ReOrbit is leading the Space Internet of Things with software-centric satellites 🇬🇧/🇺🇦 UK-Ukraine partnership boosts startups for dronetech innovation 🇳🇴 Midio raises $660,000 for visual programming interface development 🇬🇧 Koalaa's life-changing soft prosthetics raise $1.2M funding 🇳🇱 Medtech startup Amazec Photonics secures €1.5M seed funding for clinical trials 🇮🇪 Amply secures £1.4M for AI-powered drug discovery platform 🇬🇧 Spacegoods raises £2.5M to expand mushroom-based wellness products Would you like to write the first comment? "
}