{
    "title": "Apple faces £430m EU fine in long-running row with Spotify",
    "date": "2/18/2024",
    "url": "https://www.telegraph.co.uk/business/2024/02/18/apple-facing-430m-eu-fine-in-row-with-spotify-over-app-stor/",
    "text": "iPhone maker accused of using its App Store to drive up prices and block competition Apple is facing a €500m (£427m) fine from the EU as part of a long-running competition row with Spotify. Brussels is preparing to levy what would be its first antitrust fine for the iPhone maker, the Financial Times reported. The decision follows a years-long European Commission probe into whether Apple abused its position in the market to block rivals. Apple has been accused of unfairly blocking apps that use its App Store from telling users about alternative ways to pay. The EU investigation was launched after an official complaint from Spotify in 2019. The music streaming app claimed it had been forced to ramp up the price of its monthly subscriptions to cover costs associated with Apple’s App Store rules. Apple takes a cut of 30pc of all purchases done through the App Store. Spotify said this policy forced it to increase monthly subscriptions for its premium service from £9.99 a month to £12.99. Around the same time, Apple launched a competing music streaming service that cost £9.99 a month. The EU formally charged Apple with anti-competitive behaviour in 2021. In an attempt to appease Brussels, Apple last month announced changes to its iOS mobile software, App Store and Safari browser that allowed companies to sign-post cheaper subscription options elsewhere. It said the changes “give developers choice”. Spotify branded the changes a “complete and total farce” at the time. Brussels is expected to rule that Apple’s actions were illegal next month, according to the FT, citing sources familiar with the investigation. The European Commission declined to comment. Apple and Spotify were approached for comment. The Commission could impose a fine of up to 10pc of Apple’s $385bn annual turnover if the company were found to have broken the law. Apple has faced multiple battles over its App Store fees in recent years, including a high-profile legal spat with Fornite developer Epic Games. The iPhone maker largely prevailed in that case, though was ordered by a Californian court to make some changes to how its store operates. The looming fine is also the latest attempt by Brussels to rein in the power of Big Tech. New rules set to come into effect in March will brand Apple, Amazon, Google, Meta and Microsoft so-called “digital gatekeepers”, meaning they will be forced to follow strict new competition rules. "
}