{
    "title": "Apple’s revenue in India jumped 42% year-over-year in 2023 to $8.7 billion \n– Morgan Stanley",
    "date": "2/23/2024",
    "url": "https://macdailynews.com/2024/02/23/apples-revenue-in-india-jumped-42-year-over-year-in-2023-to-8-7-billion-morgan-stanley/",
    "text": "Update font size. Reset  Apple’s work in India is finally beginning to pay off. The company’s revenue in India soared 42% year-over-year in 2023 to $8.7 billion, Morgan Stanley reported in a note to clients on Friday. Manish Singh for TechCrunch:\n ‎ The iPhone shipments in India grew 39% year-on-year in 2023 to 9.2 million units, making it iPhone’s fifth largest smartphone market. India’s iPhone business is now larger than any standalone country in the European Union, Morgan Stanley added. “This means that in CY23, India represented 4% of iPhones shipments and revenue, up from 3% in CY22 and 1% 5 years ago. This compares to China iPhone shipments, which represented 20% of iPhone shipments and revenue in CY23 (down 1-2 points Y/Y, respectively),” the analysts wrote. “Ultimately, this means that India as a standalone market is still not big enough to offset the declines we are seeing in the Chinese market today, but if India continues to grow at the same trajectory while China iPhone shipments stay flat, India would be a bigger iPhone market than China by 2027.” ‎\nMacDailyNews Take: It bears repeating: “India’s iPhone business is now larger than any standalone country in the European Union… [I]f India continues to grow at the same trajectory while China iPhone shipments stay flat, India would be a bigger iPhone market than China by 2027.”\n ‎\nPlease help support MacDailyNews. Click or tap here to support our independent tech blog. Thank you! Support MacDailyNews at no extra cost to you by using this link to shop at Amazon. That is a pretty Apple logo 😛 Could the long-term and frequent India slammers/doubters please step forward?  For your prescience, you have won a copy of Windows 98. You can pick it up at the Office. With each passing year, the landscape of gaming undergoes profound changes, shaping not only how we play but also how we interact and connect with others in virtual worlds. This site uses Akismet to reduce spam. Learn how your comment data is processed. MLS Season Pass can be had free for an entire month via Lionel Messi’s Instagram page. The soccer league features… This week at the 2024 Winter Television Critics Association press tour, Apple TV+ announced that “Franklin,” a new limited series starring… Apple today released iOS 17.4.1, iPadOS 17.4.1, and visionOS 1.1.1 with minor updates and bug fixes. The new releases… The U.S. DOJ on Thursday sued Apple, accusing the consumer electronics giant of violating antitrust laws, adding to the growing list of bad… The U.S. DOJ, joined by 16 other state and district attorneys general, on Thursday filed a civil antitrust lawsuit against Apple for… Enter your email address to follow MacDailyNews and receive notifications of new posts by email. Email Address Follow :-) The ad-supported model is broken. Contributions are helping! If half of our visitors contributed just $2/month, we’d be AD-FREE! Click or tap to Contribute. "
}