{
    "title": "Apple to disclose AI plans later this year, Tim Cook says – Dayton Hoops",
    "date": "2/28/2024",
    "url": "https://www.daytonhoops.com/technology/apple-to-disclose-ai-plans-later-this-year-tim-cook-says/519/",
    "text": "Feb 28 – Apple ( AAPL.O ) is opening a new tab on plans to reveal more about its plans for generative artificial intelligence later this year, Chief Executive Tim Cook said at the company’s annual shareholder meeting on Wednesday. Cook said the iPhone maker sees “incredible breakthrough potential for generative artificial intelligence, which is why we’re investing heavily in this area right now. We believe this will open up transformative openings for druggies when it comes to productivity, problem working, and more. ” Apple has been slower to deploy generative artificial intelligence, which can generate human responses to written prompts, than rivals such as Microsoft ( MSFT.O ), Opens a New Tab and Alphabet’s Google ( GOOGL.O ), Opens a New Tab , which weave them into products. On Wednesday, Cook claimed that artificial intelligence was already at work behind the scenes in Apple products, but said there would be more news about overt AI features later this year. Bloomberg previously reported that Apple plans to use artificial intelligence to improve the ability to search data stored on Apple devices. “ Every Mac powered by Apple silicon is an extremely expressive device with Ai. In fact, there’s no better AI computer on the request moment, ” Cook said. Apple shareholders on Wednesday rejected a measure that would have required the company to disclose more information about how it uses artificial intelligence in its business and its ethical principles regarding the technology. The proposal, which was rejected at the company’s annual shareholder meeting, was put forward by the pension fund AFL-CIO, America’s largest union federation, which has also proposed AI measures at other technology companies. A similar proposal will be heard at Walt Disney’s ( DIS.N ) annual meeting, which opens a new tab in April. At Apple, the AFL-CIO asked for a report on the company’s use of artificial intelligence” in its business operations and exposure of any ethical principles espoused by the company regarding the company’s use of artificial intelligence technology.” In its affirmative statement in Apple’s proxy materials, the AFL-CIO wrote that “artificial intelligence systems cannot be trained on copyrighted works or the voices, images, and performances of professional performers without translucency, concurrence, and compensation to generators and rights holders.” Apple resisted the step, saying the openness could affect its strategy as it competes with rivals in the zippy- affecting field of AI.  Comments are closed. Introduction Are you also curious about the mystery of Jack Harlow white suit? Or do…  Daytonhoops is a place of interest for every member of the family as it highlights issues that people of all ages are searching for. Type above and press Enter to search. Press Esc to cancel. "
}