{
    "title": "Arm Holdings Expected To Report Strong Earnings On Back Of Android Demand, \nWhile Apple Supplier Faces Ris",
    "date": "2/6/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/36950817/arm-holdings-expected-to-report-strong-earnings-on-back-of-android-demand-while-app",
    "text": "Arm Holdings Plc. ARM is all set to report its December quarter earnings on Wednesday. The semiconductor designer is looking at \"solid results and guidance\" ahead, surprisingly thanks to a \"sustained Android demand,\" according to KeyBanc Capital Markets analyst John Vinh. What Happened: SoftBank-owned Arm Holdings is poised to gain on account of strength in demand from Android phone makers, Vinh said in a note seen by Benzinga. This comes as a surprise in the backdrop of Samsung Electronics Co Ltd. SSNLF, the world's largest Android phone maker, losing its crown to Apple Inc. AAPL after a blemish-free run at the top for 13 years. See Also: Apple’s Phil Schiller Warns Of Privacy Threats From New EU App Stores: ‘There’s No Getting Around That’ However, the AI-focused launches in January could help Arm. \"We expect solid results and guidance for ARM, benefiting from sustained Android demand,\" Vinh said. \"The market is heading in the right direction, aided by improved holiday season demand,\" said Canalys Senior Analyst Toby Zhu. \"There have already been plenty of new flagship Android launches taking advantage of the on-device AI trend, from Google Pixel and several Chinese vendors.\" The first month of 2024 has seen new flagships from Samsung and OnePlus – while Samsung launched the Galaxy S24 series with a keen focus on AI in partnership with Android-maker Alphabet Inc.'s GOOG GOOGL Google, Oppo-subsidiary launched the OnePlus 12. Both smartphones are powered by Qualcomm Inc.'s QCOM top-tier Snapdragon 8 Gen 3 chipset. Apple's iPhone sales guidance in its December quarter earnings call could lead to a \"potential risk\" for one of its suppliers, Cirrus Logic Inc. CRUS. Cirrus is an Austin, Texas-based fabless semiconductor supplier. However, Huawei's resurgence has put a spanner in Apple's plans in China. The upcoming Mate 70 series smartphone will take the iPhone 16 series head on – Huawei is expected to launch it in September this year, days after the iPhone 16's expected launch. “Great China’s revenue decline of 13% is worse than expected and will likely drive more concerns into the rest of 2024,” Oppenheimer analyst Martin Yang said. Wedbush's Dan Ives has also called Apple's guidance for the March quarter \"very conservative,\" adding that it's \"no secret that Apple is struggling to battle Huawei.\" Apple's China challenges could also keep its shares \"range-bound,\" according to analysts. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Happy 20, Facebook: If You Invested $1,000 In Mark Zuckerberg’s Social Network When It Went Public 12 Years Ago, Here’s How Much You’d Have Photo courtesy: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}