{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.tradingview.com/news/benzinga:43cf0d1f3094b:0-apple-bows-to-eu-with-third-ios-17-4-beta-rollout-here-s-what-s-changed-with-app-store-emojis-podcasts/",
    "text": "Apple Inc. AAPL has rolled out the third beta version of iOS 17.4 and iPadOS 17.4 for developers, introducing a raft of new features and significant changes mainly aimed at the European Union (EU). What Happened: The third beta versions of iOS 17.4 and iPadOS 17.4 were launched a week following the release of the second betas, reported Macrumors. Developers registered with Apple can opt into these betas via the Settings app, which requires an Apple ID linked to a developer account for download and installation. The beta versions substantially change the App Store and apps’ functioning within the EU. These include alternative app marketplaces, different payment systems, third-party browser engine support, and NFC access for banks and payment providers. However, these features are exclusive to the EU and will not be made available in other regions. See Also: Life Coach Tony Robbins Recommends Investing In Apple Stock Instead Of Regular iPhone Upgrades To Push Ow Besides this, Apple’s latest update incorporates changes for gaming apps, permitting cloud gaming apps such as Xbox Cloud Gaming and Nvidia GeForce NOW. Mini-games, chatbots, and plug-ins can also utilize the in-app purchase system. The new iOS 17.4 also introduces new emojis, podcast transcripts, SharePlay support for HomePod, and other features. Detailed information on these can be found here. Why It Matters: Apple’s introduction of app sideloading and support for alternative app stores for EU users is a direct response to the EU's Digital Markets Act or DMA antitrust legislation, as reported in January. This move aims to encourage alternative app stores to distribute apps outside the App Store, provided they comply with Apple’s stringent rules. In February, Apple started rolling out changes to its App Store Connect and TestFlight to support alternative app stores in the EU. With the public release of iOS 17.4 scheduled for March, Apple continues to make significant strides to adapt to changing market demands and regulatory requirements. Photo by Poetra.RH on Shutterstock Read Next: Nvidia On The Rise, ChatGPT’s Secret Sauce, And AI Cracks Ancient Code: This Week In Artificial Intelligence Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @horibuful @tradingview @arakerbabian @ceoann.garcia_fx @price_action_guru @maurice.method @mytradingsetup @hofeex @neo_inversion @_dalton16 @trade_simple_fx @trading.is.mylife @carrrros @michaelbamber @mariodelpo @my_trading_floor @satoshi_empire @jordan_fx_ Whatever the trade "
}