{
    "title": "Berkshire trims Apple, sheds four stocks, mum on new investment",
    "date": "2/14/2024",
    "url": "https://finance.yahoo.com/news/berkshire-sheds-holdings-mum-investment-213748123.html",
    "text": "(Reuters) — Berkshire Hathaway on Wednesday said it has trimmed its huge stake in Apple and shed four common stock holdings, and kept investors guessing on what could be a major new investment by Warren Buffett. In a regulatory filing describing its U.S.-listed stock holdings at the end of 2023, Berkshire said it sold 10 million Apple shares in the fourth quarter, but still owned more than 905 million shares worth about $174 billion. Though Buffett has been driving Berkshire's investment in Apple, the stock sales in the iPhone maker could have been made by one of his portfolio managers Todd Combs and Ted Weschler, who oversee some Berkshire investments. Berkshire reported no holdings in homebuilder DR Horton, insurer Globe Life, insurance and investment company Markel and Brazilian credit card processor StoneCo, after holding more than $1 billion of those stocks at the end of September. The Omaha, Nebraska-based conglomerate also boosted its stake in oil company Chevron, one of its biggest holdings, and reduced its stakes in computer and printer maker HP and media company Paramount Global. For a second straight quarter, Berkshire obtained permission from the U.S. Securities and Exchange Commission to temporarily keep one or more of its holdings confidential. It occasionally requests such treatment when it is making big investments, including multibillion-dollar stakes in Chevron, Exxon Mobil, IBM and Verizon Communications. This is because investors often try to piggyback on what Berkshire does, reflecting Buffett's reputation as one of the world's greatest investors. Berkshire prefers not to have investors pile into its stocks before it's done buying. In its third-quarter report in November, Berkshire hinted that its confidential investment may involve a bank, finance company or insurer because it had recently spent $1.2 billion on stock in that sector. It has yet to reveal where the money went. Berkshire did not immediately respond to a request for comment. It no longer invests in Exxon, IBM and Verizon. Buffett, 93, has run Berkshire since 1965. The conglomerate also owns dozens of businesses including the Geico car insurer, BNSF railroad, energy and industrial companies, and consumer brands such as Benjamin Moore, Dairy Queen, Duracell, Fruit of the Loom and See's Candies. It also owns the Pilot truck stop chain, after buying the 20% it didn't already own from the billionaire Haslam family in January. Berkshire will reveal more about its investing and businesses when it releases its annual report and Buffett's annual letter to shareholders, expected on Feb. 24. (Reporting by Jonathan Stempel in New York; editing by Jonathan Oatis and Diane Craft) "
}