{
    "title": "After Epic Games' $700 Million Google Antitrust Lawsuit Win, CEO Tim \nSweeney Has His Sights Set On Apple's ...",
    "date": "2/26/2024",
    "url": "https://finance.yahoo.com/news/epic-games-700-million-google-161334544.html",
    "text": "Nobody is likely a more outspoken dissenter against the ongoing stronghold Apple Inc. and Google have on the mobile apps store than Epic Games Inc. Founder and CEO Tim Sweeney. Google's Play Store and Apple's App Store collectively have a 90% market share. Going up against Apple and Google is no easy feat — they are two of the biggest companies on the planet with armies of top lawyers around the world. Funding such a suit would bankrupt many companies, but Sweeney isn't deterred, taking on both of them in recent lawsuits. The popular maker of Fortnite makes billions from skin sales and in-game items. With tens of millions of mobile players, it's easy to see how the 30% fee the app stores charge would add up over time. A successful lawsuit that lowered fees or costs would end up saving Epic billions over the long term. Don't Miss: New in startups – Fortnite’s creator company greenlights partial ownership for up to 100 accredited investors in the upcoming series. Did you know StartEngine Private is your portal to investing in venture-backed businesses without spending millions? Neither Apple nor Google allow users to skirt their app stores. For example, code driving someone to a website to purchase Fortnite's in-game currency V-Bucks, rather than in an app, breaks the terms of service and will, as happened to Fortnite, result in removal from the store. When Fortnite was removed, Epic filed an antitrust lawsuit and lost. But in a nearly identical case, it defeated Google, which resulted in a $700 million fine against the company. Now, Sweeney is back taking another swing at Apple after the company's recent decision to scrap web apps entirely in the EU. The EU passed the Digital Markets Act (DMA), which Apple is using as an excuse to snub home screen web apps. Users will no longer be able to download apps on their iPhones in the EU unless they are on the Apple App Store. They will be able to open links to websites from their home screens, just not stand-alone apps. This is yet another blow to anyone trying to avoid the 30% fees. Sweeney and other critics argue Apple’s latest policy update, which effectively stifles the functionality of web apps by imposing stringent limitations, will undermine the open nature of the web and restrict consumer choice. Trending: This startup is accepting investors for as little as 25 cents – what’s the catch? The policy change comes at a time when the European Union is pushing for greater digital openness through initiatives like the DMA. Critics, including Sweeney, argue that Apple’s move is not only antithetical to the spirit of the DMA but also represents a significant step back for digital innovation and accessibility in Europe. Legal experts and industry watchers predict this latest conflict could lead to increased regulatory scrutiny of Apple’s practices in Europe and potentially beyond. The European Commission has already shown a willingness to tackle what it sees as anti-competitive behavior by tech giants, and Sweeney’s fight against Apple could catalyze further action. Sweeney recently went to X to speak about Apple's continued anti-competitive practices, posting, \"Apple needs to completely reset its relationships with regulators and developers on the foundation of enlightened, lawful business practices as Microsoft did after the DOJ [Department of Justice] case. They can't go on like this, not as a self-respecting company that's honest with itself and the world.\" As this saga unfolds, the tech world watches closely, recognizing that the outcome could have far-reaching implications for how digital markets operate, how developers create and distribute apps and how consumers access digital content. Sweeney’s crusade against Apple’s monopoly is more than a corporate skirmish; it’s a battle for the soul of the digital age. Read Next: Harvard-founded AI startup is solving paywalls, growing 5x yearly and looking for new shareholders. This startup in the climate tech industry could unlock the riches flowing 30 feet above your head. \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? APPLE (AAPL): Free Stock Analysis Report TESLA (TSLA): Free Stock Analysis Report This article After Epic Games' $700 Million Google Antitrust Lawsuit Win, CEO Tim Sweeney Has His Sights Set On Apple's Decision To Ban Web Apps originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}