{
    "title": "Apple cancels decade-long electric car project, source says",
    "date": "2/27/2024",
    "url": "https://www.streetinsider.com/General+News/Apple+cancels+decade-long+electric+car+project%2C+source+says/22841630.html",
    "text": "FREE Breaking News Alerts from StreetInsider.com! StreetInsider.com Top Tickers, 3/22/2024 FILE PHOTO: The Apple Inc logo is seen hanging at the entrance to the Apple store on 5th Avenue in Manhattan, New York, U.S., October 16, 2019. REUTERS/Mike Segar/File Photo By Stephen Nellis and Shivansh Tiwary (Reuters) -Apple has canceled work on its electric car, a source familiar with the matter told Reuters on Tuesday, a decade after the iPhone maker kicked off the project. The move draws the curtain on a plan that would have helped Apple break out into a new industry and potentially replicate the success of the iPhone. The project had seen uneven progress throughout its life and its end comes as global automakers cut back their investments in electric vehicles, whose demand has dropped significantly. Several employees working on the project will be shifted to the company's artificial intelligence (AI) division, according to Bloomberg News, which first reported the development. Apple declined to comment. \"If it is true, Apple will put more focus on GenAI and that should give investors more optimism about the company's efforts and ability to compete at a platform level on AI,\" said Ben Bajarin, CEO of consulting firm Creative Strategies. Apple has so far held back from any big moves in AI, in stark contrast to tech giants such as Alphabet and Microsoft, which have first-mover advantage in incorporating the breakthrough technology. Its quiet approach has sparked worries the iPhone-maker could be behind in integrating the technology into its products. That was reflected in Apple's share gain last year, which at nearly 50% was the smallest among the so-called Magnificent Seven stocks. Last month, Microsoft overtook Apple as the world's most valuable company as the iPhone maker grapples with weakness in demand for its key products, especially in major market China. Meanwhile, high interest rates have led to a slowdown in demand for usually pricier electric vehicles, prompting the industry to cut jobs and reduce production. Several major automakers, including EV market leader Tesla, have decided to pull back on investments, with some shifting plans to focus on hybrids instead of fully battery-powered cars. Tesla CEO Elon Musk cheered Apple's move on X social media with a post of a saluting emoji and a cigarette. PROJECT TITAN Apple kicked off Project Titan, as its car effort was known internally, a decade ago, as a wave of interest in self-driving vehicles swept through Silicon Valley. Reuters reported in 2020 that Apple was considering releasing its proposed car soon as 2024 or 2025. But progress had been bumpy even before the COVID-19 pandemic disrupted the global automotive industry. Apple had laid off 190 workers from the group in 2019 after revamping its software approach. The design of the concept car also changed from a radical, steering-wheel-free autonomous vehicle that would have been a departure from traditional automotive design to a more conventional car with advanced driver-assistance features. News of the project had initially raised hopes that Apple may replicate the success of the iPhone, whose fresh design and clean interface helped alter the handheld phone market. But even iPhone sales, the main source of the company's revenue, has started seeing a growth slowdown as rivals launch handsets with matching specs and competitive prices. Sales of iPad and Mac computers have also fallen amid broader slump in demand for expensive gadgets. (Reporting by Stephen Nellis in San Francisco and Shivansh Tiwary in Bengaluru; Additional reporting by Abhirup Roy in San Francisco, Harshita Mary Varghese and Yuvraj Malik in Bengaluru; Editing by Pooja Desai and Arun Koyyur) Receive full access to all new and archived articles, unlimited portfolio tracking, e-mail alerts, custom newswires and RSS feeds - and more! "
}