{
    "title": "A tech worker wore Apple's 'creepy' Vision Pro headset during his wedding \nphotos — much to his wife's dismay",
    "date": "2/29/2024",
    "url": "https://ca.finance.yahoo.com/news/tech-worker-wore-apples-creepy-105733962.html",
    "text": "A software engineer wore Apple's Vision Pro headset during his wedding. The bride told the SFGATE she found Apple's headset a \"little creepy\" and \"a little uncanny.\" Users have been seen wearing the Vision Pro in various public places, including while driving. A tech worker wore Apple's Vision Pro headset during his wedding photo shoot — much to his new wife's dismay. Pictures of software engineer Jacob Wright wearing the mixed-reality headset while his wife looks on disapprovingly went viral earlier this month. Wright, an engineer at an AI startup, also wore Apple's chunky new headset during the wedding reception, local outlet SFGATE reported. Wright told the science and technology news outlet Futurism he had a \"bad habit\" of carrying the Vision Pro with him everywhere. The bride, Cambree Wright, told the SFGATE she found the headset a \"little creepy\" and \"a little uncanny\" — adding she'd tried to keep the headset out of the bridal shots despite her husband's multiple requests. \"I turn around one minute, and he has it on,\" she said of the photos. However, said added she wasn't angry about her husband's decision to don the Vision Pro, despite looking upset in one of the pictures snapped by the photographer. \"I look pissed in the picture. I wasn't really mad, though,\" she told Futurism. \"I just thought it was funny.\" Jacob Wright did not immediately respond to a request for comment from Business Insider, made via LinkedIn outside normal working hours. Apple's Vision Pro has only been unleashed on the world for less than a month, but users have already been spotted wearing the headset in odd places. At least two people have been filmed using the headset while driving, while another appeared to be wearing it while crossing a road. Users have also been spotted wearing the headset in other public places, including the gym and the subway. Read the original article on Business Insider Dark Brandon strikes again. 'Jennifer's Body' star Megan Fox opened up about her engagement to Machine Gun Kelly and listed all her cosmetic procedures on the 'Call Her Daddy' podcast.  The 48-year-old mother-of-three spoke to Vogue about her life after ending her marriage of 18 years. The far-right lawmaker finally said something her critics could agree with. Marco BelloDonald Trump, unable to front a half billion dollars to pay off his recent bank fraud judgment, now effectively has liens placed on his massive, forested estate north of New York City, according to public records and several court clerks who spoke to The Daily Beast on Thursday.Documents show that New York Attorney General Letitia James has started preparing to seize his family’s hallowed grounds at Seven Springs, the billionaire tycoon’s Bruce-Wayne-like mansion surrounded by 212 acr  The late-night host said Trump’s financial struggles could be taking a toll on another part of his life. The Trump scion \"murders irony\" with his latest hot take, quipped social media users. NEW YORK — Paul Simon is slip slidin’ back to the days of working with Art Garfunkel, and peeling back the curtain on what ended their iconic yet “uneven” partnership and decadeslong friendship. The Grammy-winning Simon & Garfunkel co-founder, 82, noted in the first half of MGM+’s “In Restless Dreams: The Music of Paul Simon” that they “were really best friends up until ‘Bridge over Troubled ...  A potential running mate for the former president is reportedly looking more favorable to Trump. “Are you trolling?” one GOP senator said when asked if he'd be willing to help pay for Donald Trump's multimillion-dollar legal fees in New York. Konstantin Koltsov's ex-wife has said the boyfriend of tennis star Aryna Sabalenka was \"most likely very drunk\" when he died.  Koltsov, 42, a Belarusian former professional ice hockey player, was found dead at a hotel in Miami, Florida, on Monday.  Police investigating his death have said it was an \"apparent suicide\" after they found no evidence of \"foul play\".  “I don’t think people really appreciate exactly what we are going to be in for,” said Michael Steele. Things got awkward for Jordan during Thursday's House Judiciary Committee meeting. The actress said for her most recent breast procedure, she wanted “1990 stripper” breasts — and shared why surgery is “traumatic” for her  Amid theories that the Palace is using a fake Kate Middleton, her professional look-alike is speaking out about claims she was hired. During an oversight committee hearing, Lev Parnas accused Sean Hannity and committee member Pete Sessions of purposely pushing Russian propaganda. This man is playing with fire. 2024 Subaru Crosstrek Review, Pricing, and Specs GUADALAJARA, Mexico — First the cartel cut its teeth with drug trafficking. Then avocados, real estate and construction companies. Now, a Mexican criminal group known for its brutality is moving in on seniors and their timeshares. The operation is relatively simple. Cartel employees posing as sales representatives call up timeshare owners, offering to buy their investments back for generous sums. They then demand upfront fees for anything from listing advertisements to paying government fines. T SAO PAULO (AP) — The father of soccer star Neymar said Thursday that his family won't pay the one million euros ($1.1 million) required to bail Dani Alves out of a Spanish prison where the former Brazil defender awaits the result of an appeal to his rape conviction. Neymar da Silva Santos said in a statement on behalf of his family that they financially supported Alves during his trial, but that they won't do it again now that the former player was found guilty of raping a woman in a Barcelona n 50.2% of Californians voted in support of the measure. "
}