{
    "title": "Apple scales back its car project while Waymo, Huawei and Xiaomi power up",
    "date": "1/23/2024",
    "url": "https://seekingalpha.com/news/4057616-apple-scales-back-its-car-project-while-waymo-huawei-and-xiaomi-power-up",
    "text": "ozgurdonmaz Apple (NASDAQ:AAPL) has pulled back on its car project once again, according to various media reports on Tuesday. Following recent board meetings, the tech giant now has a release date of 2028 set for the Apple Car, and the level of autonomy has been downshifted dramatically to Level 2+ from Level 4. The project is said to be in a make-or-break position, but still moving forward. Apple's (AAPL) Project Titan has been around since 2014 and created plenty of debate over if the Cupertino-based company could ever match the margins it generates on its tech products with a car. Over the years, some of the automakers and suppliers linked to Apple Car speculation include Hyundai (OTCPK:HYMTF), Tesla (NASDAQ:TSLA), General Motors (GM), Ford (F) and Volkswagen (OTCPK:VLKAF), XPeng (XPEV), NIO (NIO), Magna International (MGA), Stellantis (STLA), and Foxconn (OTCPK:FXCOF). While Alphabet's (GOOG) Waymo, Huawei Technologies, Baidu (BIDU), and Xiaomi Corporation (OTCPK:XIACF) (OTCPK:XIACY) have all introduced electric vehicles, Apple's (AAPL) biggest splash in the automobile sector is through its CarPlay software. So far, Apple (AAPL) has not even developed a prototype to show off internally. Last month, Xiaomi (OTCPK:XIACF) created a bit of a splash with its EV model event. The model is in trial production and expected to hit the domestic market in a few months. Notably, both the chassis and electrical architecture were built in house by the based Beijing-based company. The SU7 will come in two versions – one with a driving range of up to 668 km on a single charge and another with a range of up to 800 km. Those marks compare favorably to the Tesla (TSLA) Model S range of up to 650 km. The dual-motor AWD version is reported to feature 664 horsepower and 614 pound-feet of torque combined, as well as a 0-60 mph time of just 2.8 seconds. One of the selling points from Xiaomi (OTCPK:XIACF) is that its EVs will be integrated with the company's smartphones and connected home appliances. "
}