{
    "title": "Not all financial predictions for Apple's holiday quarter are doom and gloom",
    "date": "1/5/2024",
    "url": "https://appleinsider.com/articles/24/01/05/not-all-financial-predictions-for-apples-holiday-quarter-are-doom-and-gloom",
    "text": "Copyright © 2024, Quiller Media, Inc. Contact Us | Privacy Policy Apple's App Store Despite other investment analysts downgrading Apple, Evercore is more positive and is maintaining a $220 stock price target because of the continued growth of the App Store.\r  Evercore has previously been positive on Apple because of what, in 2020, it described as the firm benefiting from a \"confluence of strong iPhone 11 trends, wearables momentum and continued services traction.\" \rNow according to a new note seen by Apple-centric finance site Apple 3.0, Evercore is maintaining its existing price target but specifically because of its research into App Store growth. For Q4 2023, Evercore says that Apple's App Store grew by 10% —  and also that revenues for solely the month of December were also up by 10%.\rThis follows a 9% growth rate for the month of November 2023, and Evercore says that there was a continued broad strength across all categories. Significantly, though, gaming by itself grew 5% in December, compared to a 3% growth the month before.\rEvercore claims that gaming accounts for 54% of App Store revenue. \"We think this sets up 2024 to also sustain positive growth,\" writes its analysts.\rReportedly, entertainment —  which Evercore says chiefly concerns streaming —  grew 17% over the year, and 36% in the last two months. Social media apps brought in 9%, which is down from 12% the year before.\rEvercore says that there are differences across the globe, though. China's App Store grew 10%, while Japan's fell 2%, year over year. The US App Store grew 7% year over year, which is fractionally down on the year before's 8% growth.\rFinancial doom and gloom predicted for Apple These App Store growth reports paint a rosier picture for Apple than other analysts currently believe. Given how significant the iPhone is to the company, Barclays' claim that the iPhone 16 will have no compelling new features, saw the firm's market share fall.\rIf correct, the predictions of falling iPhone demand from other analysts could put a limit on the App Store's growth. But analysts have previously also said that around 25% of Apple's 1.2 billion users have not upgraded their iPhone in 4 years, meaning that it's likely significant numbers will upgrade at some point.\rPerhaps users entirely new to the iPhone are likely to buy more apps than existing customers, but the market remains large and perhaps especially so for key titles such as new games.\rThere are, though, other issues that could significantly alter how the App Store performs in the near future.\rFuture App Store issues Separately, since October 2023, China's App Store has been affected by new laws that are likely to decrease the number of apps being added. While Apple initially resisted the change, it now requires new apps to show that the developer has a license from the Chinese government. \rThere may also be a change in App Store revenues in Europe, as the European Union enforces its requirement that Apple allow users to buy apps through alternative stores.\rApple has strongly resisted third-party app stores, with head of software engineering Craig Federighi going so far as to blast Mac security, in order to stress how important it is to keep the App Store a closed system. The idea is that if iPhone users can buy apps from anywhere, it's unlikely that the apps will have gone through what Apple describes as its rigorous vetting system.\rOthers have said that in practice it's easy to get a fraudulent apps through the official App Store review process. However, it's still the case that Apple at least attempts to ensure that iPhone users are not subjected to malicious apps.\rIt remains to be seen, though, how many developers will elect to use third-party alternative app stores to reach customers. At present, Apple handles all of the logistics of a worldwide app store, plus all of the global taxation requirements. It's unlikely that any but the largest developer firms will find it economically feasible to take on any of this. Evercore has previously been positive on Apple because of what, in 2020, it described as the firm benefiting from a \"confluence of strong iPhone 11 trends, wearables momentum and continued services traction.\" Now according to a new note seen by Apple-centric finance site Apple 3.0, Evercore is maintaining its existing price target but specifically because of its research into App Store growth. For Q4 2023, Evercore says that Apple's App Store grew by 10% —  and also that revenues for solely the month of December were also up by 10%. This follows a 9% growth rate for the month of November 2023, and Evercore says that there was a continued broad strength across all categories. Significantly, though, gaming by itself grew 5% in December, compared to a 3% growth the month before. Evercore claims that gaming accounts for 54% of App Store revenue. \"We think this sets up 2024 to also sustain positive growth,\" writes its analysts. Reportedly, entertainment —  which Evercore says chiefly concerns streaming —  grew 17% over the year, and 36% in the last two months. Social media apps brought in 9%, which is down from 12% the year before. Evercore says that there are differences across the globe, though. China's App Store grew 10%, while Japan's fell 2%, year over year. The US App Store grew 7% year over year, which is fractionally down on the year before's 8% growth. These App Store growth reports paint a rosier picture for Apple than other analysts currently believe. Given how significant the iPhone is to the company, Barclays' claim that the iPhone 16 will have no compelling new features, saw the firm's market share fall. If correct, the predictions of falling iPhone demand from other analysts could put a limit on the App Store's growth. But analysts have previously also said that around 25% of Apple's 1.2 billion users have not upgraded their iPhone in 4 years, meaning that it's likely significant numbers will upgrade at some point. Perhaps users entirely new to the iPhone are likely to buy more apps than existing customers, but the market remains large and perhaps especially so for key titles such as new games. There are, though, other issues that could significantly alter how the App Store performs in the near future. Separately, since October 2023, China's App Store has been affected by new laws that are likely to decrease the number of apps being added. While Apple initially resisted the change, it now requires new apps to show that the developer has a license from the Chinese government. There may also be a change in App Store revenues in Europe, as the European Union enforces its requirement that Apple allow users to buy apps through alternative stores. Apple has strongly resisted third-party app stores, with head of software engineering Craig Federighi going so far as to blast Mac security, in order to stress how important it is to keep the App Store a closed system. The idea is that if iPhone users can buy apps from anywhere, it's unlikely that the apps will have gone through what Apple describes as its rigorous vetting system. Others have said that in practice it's easy to get a fraudulent apps through the official App Store review process. However, it's still the case that Apple at least attempts to ensure that iPhone users are not subjected to malicious apps. It remains to be seen, though, how many developers will elect to use third-party alternative app stores to reach customers. At present, Apple handles all of the logistics of a worldwide app store, plus all of the global taxation requirements. It's unlikely that any but the largest developer firms will find it economically feasible to take on any of this. William Gallagher has 30 years of experience between the BBC and AppleInsider discussing Apple technology. Outside of AppleInsider, he's best known for writing Doctor Who radio dramas for BBC/Big Finish, and is the De... If you're tired of dealing with volume that is either too loud or too quiet, here's how to increase the volume level on a Mac by a quarter of what you normally can just by using a simple keyboard shortcut. Samsung's preorder deals are often aggressive, and their TV offer is no different. To celebrate the launch of the 2024 TV and audio lineup, Samsung is throwing in a free 65-inch TV with a qualifying preorder. Back by popular demand, OWC's 14-port Thunderbolt Dock for MacBooks is discounted to $99.99, matching the lowest price on record. But the month-end deal is valid for a limited time only. If you've been on the fence or haven't tried Apple's MLS Season Pass, now's a good time to try, as new subscribers can access a one-month free trial for a limited time. The Department of Justice's massive antitrust lawsuit against Apple is based on old information. Merrick Garland and company are going to lose big if they rely on arguments where practically every point made is no longer true. Apple has released iOS 17.4.1 and iPadOS 17.4.1 to the public, at the same time as bringing visionOS up to 1.1.1 while also slipping out iOS 16.7.7. A new vulnerability in Apple Silicon chips can allow a determined attacker to access a user's data by stealing the cryptographic keys — and a fix could considerably impact encryption performance. A fresh price cut on AirPods Pro 2 with USB-C is in effect at Amazon on day 2 of its Spring Sale 2024. Grab the lowest price on record while supplies last. The Department of Justice's massive antitrust lawsuit against Apple is based on old information. Merrick Garland and company are going to lose big if they rely on arguments where practically every point made is no longer true. Apple has released iOS 17.4.1 and iPadOS 17.4.1 to the public, at the same time as bringing visionOS up to 1.1.1 while also slipping out iOS 16.7.7. Tim Cook is in Shanghai for the opening of Apple's newest store, and has been stopping by developers, students, and suppliers.  "
}