{
    "title": null,
    "date": "1/14/2024",
    "url": "https://newsable.asianetnews.com/gallery/technology/apple-ceo-tim-cook-salary-dropped-in-2023-here-is-how-much-he-earned-gcw-s78msg",
    "text": "In proxy filing with the US Securities Exchange Commission, the company revealed that the 63-year-old earned Rs 300 crore less than what he got in 2022. Apple stated Tim Cook earned USD 63.21 million as compensation in 2023. In proxy filing with the US Securities Exchange Commission, the company revealed that the 63-year-old earned Rs 300 crore less than what he got in 2022. Apple stated Tim Cook earned USD 63.21 million as compensation in 2023. Have you ever considered Tim Cook's compensation as Apple's CEO? Given the immense responsibility he has, it’s a fair question. Cook is in the exclusive group of CEOs because he has played a significant role in directing the company's operations after Steve Jobs. Tim Cook received a substantial compensation package for the fiscal year 2023 totaling $63.2 million, or almost Rs 523 crore. That’s a lot of money, but it’s really less than what he made in 2022. Why? Yes, it was deliberate. Following a suggestion from Apple's compensation committee, Cook asked for a 40% decrease in his overall remuneration. According to a report by The Hollywood Reporter via AppleInsider, Apple’s recent filing with the Securities and Exchange Commission (SEC) revealed that Tim Cook earned a base salary of $3 million, stock awards of $47 million, non-equity incentive compensation of $10.7 million, and other compensation of $2.5 million. By contrast, Cook's earnings for the fiscal year 2022 amounted to $99.4 million even if his basic pay stayed at $3 million. The $1.3 million in other remuneration, the $12 million in non-equity incentive payments, and the $83 million in stock awards are the reasons for the pay discrepancy. If you're wondering how much other CEOs make—such as Satya Nadella of Microsoft—the figures are very comparable. In 2023, Nadella earned $48.5 million, as reported by The Register. However, CEO salaries vary widely. For example, Google CEO Sundar Pichai got a stunning $226 million in 2022, while Shantanu Narayen, Chairman and CEO, Adobe made $31 million in 2022. Infinix introduces iPhone-like MagSafe charging to mid-range smartphone; Check details Realme Narzo 70 Pro 5G launched in India: 5 top reasons why you should buy it Beware iPhone users! Indian government issues a high severity warning for Apple products; Check details Telegram is the most-used app for terror radicalisation: Australia Apple in talks with Google to bring Gemini-powered AI features to iPhones: Report ISL 2023-24: Amrinder Singh's Rise; From streets of Punjab to goalkeeping glory in Indian football Zomato launches 'Pure Veg Mode' with 'Pure Veg Fleet', CEO Deepinder Goyal steps out for delivery From Hobby to Business: How Somesh Thackeray Became a Fantasy Cricket Sensation Royal Family denounces false Russian media report on King Charles' health IPL 2024: RCB men's team give guard of honour to women's team for clinching WPL title (WATCH) Did you know? Albert Einstein's brain was stolen, cut into 240 pieces! (WATCH) IAF lands aircraft on National Highway 16 in Andhra Pradesh (WATCH) What to know about Airbnb's new camera ban before booking your next stay (WATCH) How inventor of karaoke machine Shigeichi Negishi revolutionized music industry (WATCH) Viral video shows BRS leaders, KTR Rao intimidating ED officials while detaining K Kavitha (WATCH) Follow us on: "
}