{
    "title": "Apple stock tumbles as the Supreme Court rejects the company's appeal over \napp-store rules",
    "date": "1/16/2024",
    "url": "https://finance.yahoo.com/news/apple-stock-tumbles-supreme-court-001551272.html",
    "text": "Apple stock fell after a Supreme Court ruling that could cost the company billions of dollars a year in revenue. Justices rejected Apple's appeal of lower-court rulings over unfair competition in the app store. Shares were also under pressure after Apple cut iPhone prices in China, raising demand fears. Shares of Apple fell about 2% on Tuesday following a Supreme Court ruling that could wind up costing the company billions of dollars a year in revenue from its app store. Justices dismissed Apple's appeal in an antitrust suit that takes aim at the company's lucrative app-store fees. A lower court had ruled earlier that some of the iPhone maker's rules within its app store constitute unfair competition. But with the Supreme Court's Tuesday decision, app developers will now be allowed to offer alternative payment options for iPhone users that could help them avoid paying Apple's commissions. Apple collects commissions of 15% to 30% for digital goods and subscriptions. According to a Bloomberg report citing Sensor Tower data, in-app spending could reach $182 billion in 2024, and climb to $207 billion in 2025. Last year, the 9th US Circuit Court of Appeals found that Apple violated California's Unfair Competition Law in limiting developers' ability to present alternative payment methods. Epic Games had first filed the antitrust lawsuit, marking the first challenge Apple's highly profitable app store set-up. Epic attempted to avoid paying Apple commissions by getting its app on Apple's platform in a different way. In Epic's case, the court had found Apple can't prevent app owners from informing customers of alternative payment methods outside of Apple's ecosystem. Meanwhile, Apple stock was also under pressure Tuesday after the company began offering rare discounts on its latest iPhone in China, raising fears about weakening demand. Read the original article on Business Insider "
}