{
    "title": "Apple overtakes Samsung as world's biggest phonemaker",
    "date": "1/17/2024",
    "url": "https://www.bbc.co.uk/news/business-68002846",
    "text": "Apple now has the lion's share of the global smartphone market, knocking Samsung off the top spot for the first time in 12 years. The American phone giant accounted for more than a fifth of phones shipped last year, according to data from the International Data Corporation (IDC). Samsung took 19.4% of the market share with Chinese phonemakers Xiaomi, OPPO and Transsion following behind. Smartphone sales have been faltering as many people upgraded in the pandemic. The IDC reports that almost 1.2 billion smartphones were sold last year - a drop of more than 3% on the previous year. It is the lowest amount sold in a decade, with many consumers tightening their purse strings in the face of economic challenges and high interest rates. Experts predict the market will recover this year. Still, the IDC said Apple - which sold more than 234 million phones last year - is \"the biggest winner\". \"Not only is Apple the only player in the Top 3 to show positive growth annually, but also bags the number 1 spot annually for the first time ever,\" said the IDC's Nabila Popal. \"All this despite facing increased regulatory challenges and renewed competition from Huawei in China, its largest market.\" Huawei has recently made strides in making its own chips, after being banned from buying chips that were made using US technology over claims the company poses a national security risk to Washington. Offers to trade in old models as well as interest-free financing plans are also driving demand for premium devices like Apple. It's disappointing news for Samsung which - until now - had the top spot as the world's largest maker of memory chips, smartphones and televisions. Recently, the South Korean electronics giant warned its profits would drop more than expected as global demand for consumer electronics remains weak. It is also facing competition from cheaper Android models including Transsion and Xiaomi which are getting a boost from both price-savvy consumers and emerging markets. The IDC also said the smartphone market is entering a \"very interesting time\", with a growing number of Android-providers splintering the market and customers increasingly prioritising foldable phones and AI capabilities. Samsung warns of worse than expected profits fall Apple sales dip again despite iPhone boost Blinken meets Israel PM as US calls for immediate ceasefire in Gaza at UN 'Help my brother first': Gazan girl's plea as entire family killed India opposition says leader's arrest ‘decay of democracy’ The Indians protesting in freezing cold for statehood 'Help my brother first': Gazan girl's plea as entire family killed Eclipse spectacle set to grip North America again Fleeing Ukraine’s embattled border villages Apple becomes the latest tech giant under siege The photographer who captured Sinead, Oasis and more stars Weekly quiz: How long did this woman take to climb nearly 300 mountains? Metal bands and dancing feet: Africa's top shots Why Trump may reap billions in a stock market merger Are you ready for a challenge? Test your pop knowledge with Vernon Kay's music quiz Tracking down online trolls... Behind striker Neal Maupay's struggle with an extreme case of online hate Unearthing China's terracotta army In 1974 a chance find by Chinese farmers led to an astonishing archaeological discovery Meet some adorable hamsters from Wales... This family loves Casualty, News, Sport and the odd murder show! © 2024 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
}