{
    "title": "Apple stock rises after BofA upgrades on AI, Vision Pro as drivers for \ngrowth",
    "date": "1/18/2024",
    "url": "https://seekingalpha.com/news/4055966-apple-pops-after-bofa-upgrade-on-ai-vision-pro-as-drivers-for-growth",
    "text": "Justin Sullivan Apple's (NASDAQ:AAPL) stock rose about 2% premarket on Thursday after BofA Securities upgraded the shares to Buy from Neutral noting that AI and Vision Pro are drivers for upside to hardware and services. The firm also raised the price target to $225 from $208. The analysts upgraded the shares due to — stronger multi-year iPhone upgrade cycle steered by need for the latest hardware to enable Generative AI features to be introduced in 2024/2025 (large part of installed base still on iPhone 11). In addition, due to higher growth in Services as Apple better monetizes its installed base; silicon roadmap to morph from PC to Servers to autonomous, driving higher margins; capital returns strong (buybacks, dividend) even post approaching net cash neutral; Gross margin, or GM, stable to higher over time (mix, price, vertical integration), the analysts noted. The analysts added that Apple (AAPL) remains underweighted versus S&P500 and anticipation of AI features could induce institutional investors to increase positions; the risk around legal issues is manageable; and recent relative underperformance indicates many risks baked into expectations. The analysts noted that they were raising iPhone and Services estimates. Investor focus is shifting to the expected launch of Vision Pro in February 2024 and AI enabled iPhones in 2024/2025. The analysts raised their iPhone unit estimates (F24/F25/F26 to go from 231M/244M/230M to 233M/250M/250M), and their Services estimates (F24/F25 to go from $95B/$107B to $97B/110B, respectively). BofA's EPS estimates for F25/F26 are now higher than the Street by 7%/4%. In Services, the analysts see traction with a broader installed base with several categories including advertising, and health and fitness. The analysts said that their checks suggest higher iPhone production in December and potentially lower in March but no aggregate material order changes. Forex tailwinds provide revenue, margin offset. China weakness is largely offset by strength in other countries. The analysts expect Apple to introduce AI driven features in iOS18 with monetization through better iPhone hardware and AI enabled third party apps. Vision Pro could surpass iPad revenues over time as spatial computing takes hold offering differentiated use cases driving services upside, the analysts added. Apple (AAPL) has a Hold rating at Seeking Alpha's Quant Rating system, which consistently beats the market. The Seeking Alpha authors' average rating is also Hold but the average Wall Street analysts' rating is more positive with a Buy. "
}