{
    "title": "Very impressive Apple Vision Pro launch has inspired Wedbush analysts",
    "date": "1/24/2024",
    "url": "https://appleinsider.com/articles/24/01/24/very-impressive-apple-vision-pro-launch-has-inspired-wedbush-analysts",
    "text": "Copyright © 2024, Quiller Media, Inc. Contact Us | Privacy Policy Apple Vision Pro Investment analyst firm Wedbush has revised its estimates of how many of the Apple Vision Pro will be sold in 2024 upwards, and also believes it will lead to a separate AI App Store.\r  Wedbush has been bullish about Apple Vision Pro from its launch, and most recently raised its target price to $250 based on sales of the iPhone 15 range.\rIn a note to investors seen by AppleInsider, Wedbush is maintaining that $250 price target, but revising upwards all its other figures regarding the company and specifically the Apple Vision Pro.\r\"Roughly 6 months ago the consensus view on the Street was 70k to 80k would be the initial bogeys and stretch goals for Vision Pro coming out of the gates given the high $3,500 price point and laser developer focus,\" say the analysts. \"Fast forward to pre-orders hitting the Apple website this past Friday and based on our initial reads/delivery times it looks like close to 180k Vision Pro units were sold over the weekend in a very impressive Cupertino launch.\"\r\"We now expect Apple to ship and sell roughly 600k Vision Pro headsets for 2024 vs. our prior estimate of 460k given the demand trajectory and number of apps on the new form factor look robust and growing,\" the note continues. The official launch date for Vision Pro is next Friday, February 2nd with demos kicking off in Apple stores which should generate incremental interest from Apple loyalists, power users, developers, and technologists globally.\"\rWedbush estimates that there \"are roughly 230 native apps on the Vision Pro platform\" but that it expects that \"to double to close to 500 apps by the summer as more developers head down this path for AR/VR.\"\rCiting what it describes as its industry checks, Wedbush says that the next version of Apple Vision Pro will cost below $2,000 —  and that there may be two or three models released.\r\"We also believe future Vision Pro models will resemble form factors that look like sunglasses over the coming years,\" it says, \"and be a much broader reach/functionality for Apple users down the road with north of 1 million Vision Pro units our initial sales bogey for FY25.\"\rAs well as the future for Apple's headset itself, Wedbush is adamant that Apple Vision Pro is the start of the company's AI program.\r\"In our view this is the first step to Apple pushing into AI and eventually a separate AI App Store we expect Apple to discuss initially at WWDC this summer,\" it says. \"For Apple the ultimate goal in our opinion is that Vision Pro will work alongside the iPhone and other Apple devices over the coming years with many consumer AI use cases set to explode across health, fitness, sports content, and autonomous.\"\r\"While many on the Street are dismissing Vision Pro as noise,\" it continues, \"we strongly disagree and believe its the first step towards a much broader technology vision that Cook & Co. plan to push to its golden Cupertino installed base over the coming years.\" Wedbush has been bullish about Apple Vision Pro from its launch, and most recently raised its target price to $250 based on sales of the iPhone 15 range. In a note to investors seen by AppleInsider, Wedbush is maintaining that $250 price target, but revising upwards all its other figures regarding the company and specifically the Apple Vision Pro. \"Roughly 6 months ago the consensus view on the Street was 70k to 80k would be the initial bogeys and stretch goals for Vision Pro coming out of the gates given the high $3,500 price point and laser developer focus,\" say the analysts. \"Fast forward to pre-orders hitting the Apple website this past Friday and based on our initial reads/delivery times it looks like close to 180k Vision Pro units were sold over the weekend in a very impressive Cupertino launch.\" \"We now expect Apple to ship and sell roughly 600k Vision Pro headsets for 2024 vs. our prior estimate of 460k given the demand trajectory and number of apps on the new form factor look robust and growing,\" the note continues. The official launch date for Vision Pro is next Friday, February 2nd with demos kicking off in Apple stores which should generate incremental interest from Apple loyalists, power users, developers, and technologists globally.\" Wedbush estimates that there \"are roughly 230 native apps on the Vision Pro platform\" but that it expects that \"to double to close to 500 apps by the summer as more developers head down this path for AR/VR.\" Citing what it describes as its industry checks, Wedbush says that the next version of Apple Vision Pro will cost below $2,000 —  and that there may be two or three models released. \"We also believe future Vision Pro models will resemble form factors that look like sunglasses over the coming years,\" it says, \"and be a much broader reach/functionality for Apple users down the road with north of 1 million Vision Pro units our initial sales bogey for FY25.\" As well as the future for Apple's headset itself, Wedbush is adamant that Apple Vision Pro is the start of the company's AI program. \"In our view this is the first step to Apple pushing into AI and eventually a separate AI App Store we expect Apple to discuss initially at WWDC this summer,\" it says. \"For Apple the ultimate goal in our opinion is that Vision Pro will work alongside the iPhone and other Apple devices over the coming years with many consumer AI use cases set to explode across health, fitness, sports content, and autonomous.\" \"While many on the Street are dismissing Vision Pro as noise,\" it continues, \"we strongly disagree and believe its the first step towards a much broader technology vision that Cook & Co. plan to push to its golden Cupertino installed base over the coming years.\" William Gallagher has 30 years of experience between the BBC and AppleInsider discussing Apple technology. Outside of AppleInsider, he's best known for writing Doctor Who radio dramas for BBC/Big Finish, and is the De... Male that two app Stores, don’t forget the one for sideloading ;-) Male that two app Stores, don’t forget the one for sideloading ;-) wedbush had such positive views of appl always. but the problem with appl in 2024 is AI its very much left behind. even now they r massively investing what kinda ROI will this billions invested on AI will bring back in profits. thats not only applies to appl but all of the FAANG. the only ppl profiting from AI r chip stocks and AI startups r getting such high valuation but zero profits.This reminds me of the self driving investments the car companies made which resulted in massive losses and zero benefits. this not only applies to appl but more so meta which doesnt have any cloud platform  to try to get some of the money back. but they r all losing billions and billions wedbush had such positive views of appl always. but the problem with appl in 2024 is AI its very much left behind. even now they r massively investing what kinda ROI will this billions invested on AI will bring back in profits. thats not only applies to appl but all of the FAANG. the only ppl profiting from AI r chip stocks and AI startups r getting such high valuation but zero profits.This reminds me of the self driving investments the car companies made which resulted in massive losses and zero benefits. this not only applies to appl but more so meta which doesnt have any cloud platform  to try to get some of the money back. but they r all losing billions and billions If you're tired of dealing with volume that is either too loud or too quiet, here's how to increase the volume level on a Mac by a quarter of what you normally can just by using a simple keyboard shortcut. Samsung's preorder deals are often aggressive, and their TV offer is no different. To celebrate the launch of the 2024 TV and audio lineup, Samsung is throwing in a free 65-inch TV with a qualifying preorder. Back by popular demand, OWC's 14-port Thunderbolt Dock for MacBooks is discounted to $99.99, matching the lowest price on record. But the month-end deal is valid for a limited time only. If you've been on the fence or haven't tried Apple's MLS Season Pass, now's a good time to try, as new subscribers can access a one-month free trial for a limited time. The Department of Justice's massive antitrust lawsuit against Apple is based on old information. Merrick Garland and company are going to lose big if they rely on arguments where practically every point made is no longer true. Apple has released iOS 17.4.1 and iPadOS 17.4.1 to the public, at the same time as bringing visionOS up to 1.1.1 while also slipping out iOS 16.7.7. A new vulnerability in Apple Silicon chips can allow a determined attacker to access a user's data by stealing the cryptographic keys — and a fix could considerably impact encryption performance. A fresh price cut on AirPods Pro 2 with USB-C is in effect at Amazon on day 2 of its Spring Sale 2024. Grab the lowest price on record while supplies last. A new vulnerability in Apple Silicon chips can allow a determined attacker to access a user's data by stealing the cryptographic keys — and a fix could considerably impact encryption performance. Apple Vision Pro has two incredible ways for users to experience audio, and AirPods Max isn't one of them. Here's how the options compare. Apple has posted Apple Vision Pro-related job listings in Australia and Japan, which means a launch outside of the US could be just weeks away.  "
}