{
    "title": "Apple will reportedly reward artists for offering music in spatial audio",
    "date": "1/22/2024",
    "url": "https://au.finance.yahoo.com/news/apple-will-reportedly-reward-artists-for-offering-music-in-spatial-audio-183713277.html",
    "text": "Apple will reward record labels and artists who offer their music in spatial audio, a relatively new audio format that is more immersive than regular stereo. According to a Bloomberg report, artists who release their music in spatial audio will receive “added weighting” starting next year. That, Bloomberg speculates, could mean higher royalties. Nearly all of Apple’s audio hardware such as AirPods, HomePod, the iPhone and the upcoming Vision Pro headset, support playback in spatial audio, so the company’s move to incentivize artists is almost certainly to ensure that most music available on Apple Music is available in a format that Apple has positioned as a selling point. Notably, Bloomberg notes that Apple Music listeners wouldn’t necessarily have to stream a song in spatial audio for artists to be rewarded. Simply having their music available in the format would be enough. Apple added spatial audio, which is powered by technology from Dolby Atmos, to Apple Music in 2021. Most of the company’s original shows and movies on Apple TV+ are also offered in the format. Artists also have the option of mixing their older music in the new format, something that bands from all decades are already doing. Mixing music in the format isn’t wildly expensive, according to Bloomberg; if true, this push could help get independent musicians and smaller acts on board. Some Apple Music competitors like Amazon Music and Tidal also offer spatial audio on their services. But Spotify, Apple’s biggest music stream rival, is a notable exception, even though rumors about a high-quality music format on the service have swirled for years. Update, January 22, 2024, 5:07 PM ET: Apple started offering 10 precent higher royalties to artists who offer music in spatial audio on Apple Music from January, according to a new report from 9to5Mac. A shocking find in the garden has left those online terrified, but wait until you hear what the spider will do next. Find out here. Kaia Gerber covers V Magazine's Spring 2024 issue wearing multiple braless and topless looks all from Celine by Hedi Slimane including black leather dungarees.  Dark Brandon strikes again. While Tom Hanks doesn't regret any role, if he had to choose one it would be this. Centrelink recipients have been reminded of upcoming service centre closures and payment changes. Here’s what you need to know.  From Australia's most tattooed woman to Onlyfans creators like Billie Beever, there's a new adult platform set to take over. Read more. The match review committee has decided on the Taylan May and Reece Walsh incident. The attempted strike on the Engels air base was reported to have been launched by Ukraine’s GUR military intelligence agency  Billy was his usual 'happy self' when he first sat down, but didn't move out of the barber's chair for another three hours. One driver recalled to Yahoo News how he watched the massive effort unfold. A simple test at home revealed the woman was overcharged during her recent shop. Find out why.  \"I remember getting into it.\" The attorney general files notice of the ex-president’s fraud judgment in Westchester County, home of his golf club and Seven Springs estate You'll have to be earning well above the average to ensure you can comfortably afford your repayments.  ‘This is what happens when the citizenship hits the fan’ CHOICE's hot cross bun connoisseurs put their taste buds to the test, sampling almost 30 varieties of hot cross buns to pick the best of the best. Find out more. It marks a sad five-year first for the Australian women's cricket team. Read more here.  ‘You can’t make this stuff up,’ someone can be heard saying Legitimate Target Russia has accused the United States of using commercial satellite operators for its intelligence efforts — and is threatening to take them down with its military. The news comes days after Reuters released a report earlier this month, detailing a classified contract that SpaceX signed with a US intelligence agency to launch hundreds […] \"I'm just gonna go through all the things that I've done because I feel like there's this stigma and I'm not going to win,\" Megan said on Call Her Daddy. "
}