{
    "title": "Super Bowl TV picks, Apple Vision Pro, Prime Video ads, Samsung deals",
    "date": "1/29/2024",
    "url": "https://www.theshortcut.com/p/tech-news-super-bowl-tv-deals-apple-vision",
    "text": "Our tech news round-up begins with our Super Bowl picks. No, not football picks (we have no authority there). These are our best TV picks for the big game. Programming note: On Thursday, I’ll be on SiriusXM radio channel Shade 45 at 1pm ET to talk about my Samsung Galaxy S24 Ultra review and the Apple Vision Pro (it launches the next morning and I’ll be reviewing it live for The Shortcut subscribers). 🤫 Super savings secret. Walmart TV, Best Buy TV & Samsung TV deals are at their lowest prices. The catch? It’s just before new TV models debut at full price 🫥 ‘Mr. Irrelevant.’ San Francisco 49ers QB Brock Purdy has this usually dubious (now ironic) title as the very last pick in 2022’s NFL Draft 🏆 Winning. Now he’s Super Bowl-bound with a two-season 21-5 game record 🐐 Young GOAT. Purdy, just 24, is the 3rd youngest QB to start a Super Bowl. Dan Marino & Ben Roethlisberger were younger at 23 🔢 Chief rival. It’s the 4th time the Chiefs have been to the Super Bowl with QB Patrick Mahomes & head coach Andy Reid together (winning twice) 🌎 Did you know? Kansas City is in Missouri, not Kansas ⏰ Be there in front of your TV. Kickoff time is 6:30pm ET / 3:30pm PT on February 11. I believe… that’s a Sunday ;) 🏟️ Or actually there. In Las Vegas at Raiders’ Allegiant Stadium. Ticket prices range from $7,000 to $35,000. Apple Vision Pro suddenly sounds so affordable 🧽 CBS & Nickelodeon? Spongebob & Patrick host the first Super Bowl alternate telecast. No, seriously. A kids version on Nick will air in addition to the CBS broadcast & Paramount+ stream 🎤 Turn it up to [Feb] 11. Usher performs at the half-time show and, ironically, Taylor Swift is attending as just another fan The 10-story newsletter starts below the calendar ⤵️ Follow me on Twitter/X Join my Instagram Broadcast Channel 😖 Today: Amazon Prime Video now includes ad breaks ⏳ Jan 30, Tue: Samsung S24 series deals end at midnight 👶 Jan 31, Wed: Death Stranding iPhone & Mac launches (it’s #10 on our best PS5 games list) 🪑 Jan 31, Wed: Razer Iskur V2 gaming chair gray color launches 🤖 Jan 31, Wed: Google Pixel 8 update adds Circle to Search feature 📻 Feb 1, Thur: Catch me on SiriusXM radio on Shade 45 at 1pm ET with a call-in segment called ‘Tech Tips w/ Matt Swider from The Shortcut’ 🥽 Feb 2, Fri: Apple Vision Pro release date – we’ll be reviewing it live 🦈 Feb 2, Fri: Suicide Squad: Kill the Justice League - pre-order here 👽 Feb 8, Thur: Helldivers 2 release date - pre-order here 🏈 Feb 11, Sun: Super Bowl LVIII 👍 Winner: TVs are at their lowest price. Here’s what’s worth your $$$ There are two key times US consumers buy a new television, according to our retail research: Black Friday and in the two weeks leading up to Super Bowl Sunday. This is right before stores sell new TV models at full price, so you get heavy discounts. Here are our top picks based on price and quality. 65-inch $899 (was $1,099) at Walmart (most popular) & Best Buy 75-inch $1,299 (was $1,799) at Walmart & Best Buy 85-inch $1,799 (was $1,999) at Walmart & Best Buy 98-inch $5,999 (was $9,999) at Walmart & Best Buy 55-inch $1,799 (was $2,499) at Samsung & Best Buy 65-inch $2,299 (was $3,299) at Samsung & Best Buy 77-inch $3,499 (was $4,499) at Samsung & Best Buy 55-inch $349 (was $449) at Best Buy 65-inch $549 (was $599) at Best Buy 75-inch $649 (was $799) at Best Buy 65-inch $1,098 (was $1,299) at Walmart & Best Buy We reviewed the Sony X90L here 55-inch $1,299 (was $1,499) at Walmart 65-inch $1,599 (was $1,799) at Walmart & Best Buy 77-inch $2,296 (was $2,699) at Walmart 83-inch $3,799 (was $4,999) at Best Buy 65-inch $2,999 (was $4,999) at Samsung 75-inch $4,499 (was $6,299) at Samsung 85-inch $5,499 (was $7,999) at Samsung & Best Buy Our full best Super Bowl TV article 👍 Winner: Apple is reportedly ready to show off new hardware in March New iPad and MacBook Air models are getting closer to release, according to Mark Gurman of Bloomberg. Expect the biggest revamp ever for the iPad Pro, a refreshed iPad Air, a larger iPad Air, and new 13-inch and 15-inch MacBook Air models that feature M3 processors. The refreshed lineup is tipped to come out around the end of March, and we could also see new iPad accessories launch alongside, including a new Apple Pencil and Magic Keyboard with USB-C. 💻 Apple is set to refresh its iPad and MacBook Air lineup 📆 New models are expected to launch in March 👍 The iPad Pro will receive its biggest revamp to date 🆕 New accessories will also be made available The saying “Good things come to this who wait” doesn’t apply here. Samsung actually rewards early adopters of tech, and that means once the pre-order button turns into the “buy now” button, you’ll miss out on some key savings. Specifically, the free storage upgrade – from 256GB to 512GB for the same price as the 256GB version – is set to expire. Samsung’s track record proves that it’s not bluffing. These deals usually don’t come back until the Discover Samsung deals weeks that happen four times a year. Go here to see the Samsung Galaxy S24 Ultra colors, which include three colors exclusive to the Samsung Store. Galaxy S24 Ultra price & deals Galaxy S24+ price & deals Galaxy S24 price & deals Galaxy S24 deals at Best Buy I know many of my followers are still looking Well, if you’ve been patiently waiting for a PlayStation Portal restock (make sure you follow @mattswider on X and turn on notifications), it looks like more stock is coming in early February. A message on Sony Direct says: “Not in stock? We are regularly restocking this item on site, please check back early February.” We’ll be sure to let you know as soon as PlayStation Portal stock appears. 📆 More PlayStation Portal stock is set to arrive in February 🔜 A new message appeared on Sony’s PlayStation Direct site ☹️ The PlayStation Portal has been hard to find ever since it launched 🎮 The handheld lets you stream PS5 games via Remote Play Read up on the latest restock news 👍 Winner: Get ready for the Apple Vision Pro The Apple Vision Pro is out this Friday, February 2, and we’ll be bringing you our hands-on verdict. It looks like Apple is off to a good start with the Vision Pro, as early sales are predicted to be around 180,000 – not bad for a device that costs $3,499. Apple’s headset uses a combination of virtual reality and augmented reality to create new possibilities in entertainment and productivity like we’ve never seen before. Apple calls it “spatial computing”, and everything is controlled by your eyes, hands and voice. Whether or not it will be a global success remains to be seen. 📆 Apple Vision Pro launches this Friday for $3,499 💰 You can get more storage for $3,699 and $3,899 ⏳ New buyers will get it shipped in mid-February 🧪 Apple will hold in-store demonstrations 🙋‍♂️ Expect demos to take over 30 minutes Find out more Honor is set to reveal two new phones at Mobile World Congress 2024 in Barcelona. The Honor Magic 6 and Magic V2 phones will be shown to attendees on February 25 at 2pm CET (8am ET/ 5am PT) and we’ll be walking the halls of the Palau de Congressos de Catalunya once again to bring you the latest updates at MWC. 🔜 Honor has two new phones to show at MWC 2024 🆕 The Honor Magic 5 and Magic V2 phones will be revealed 🙏 The Honor Magic V2 is a follow-up to last year’s foldable smartphone 📱 While the Magic 5 is the next iteration of the company’s flagship handset 👎 Loser: Fossil is leaving smartwatches behind Fossil’s smartwatch business is now dead and buried. The company’s executive vice president Jeff Boyer told The Verge: “As the smartwatch landscape has evolved significantly over the past few years, we have made the strategic decision to exit the smartwatch business.” Fossil Group will now redirect its resources to support other aspects of its business such as designing and distributing traditional watches, jewelry, and leather goods. 👋 Fossil is bowing out of the smartwatch business ⌚ It’s one of the most prolific makers of Wear OS smartwatches 💍 Fossil will turn its attention to other aspects of its business 🥲 Gen 6 was the last smartwatch Fossil made, which launched in 2021 👎 Loser: Amazon wants a few extra bucks a month from you Get ready to sit through adverts on Amazon Prime Video from now on, or be prepared to pay an additional $2.99 a month if you want an ad-free experience. Amazon announced the controversial change to its streaming service in September last year, and said that ads will help it continue to “invest in compelling content”. Funnily enough, Amazon’s gross profit for 2023 was $256 billion, an increase of 18.52% year-over-year. 🤷‍♂️ The amount of ads shown per break varies 😤 Expect to see the same ads on repeat 💰 Prime Video costs $8.99 per month without ads 😖 You’ll need to pay an additional $2.99 to remove ads Find out more 👍 Winner: Hideo Kojima’s Death Stranding is almost here The next big iPhone 15 Pro and Pro Max release is almost here, as Death Stranding: Director’s Cut makes its way to Apple’s mobile and Mac devices on January 31. The game will make use of hardware-accelerated ray tracing, a graphically-intensive feature that’s reserved for high-end GPUs, and a select number of PS5 and Xbox Series X games. A new limited edition Backbone One controller is also launching alongside Death Stranding: Director’s Cut. It features a new and improved D-pad, includes magnetic adapters for a better fit, and costs $124.99. 📆 Death Stranding: Director’s Cut is out on January 31 💰 The game will cost $19.99 🆕 A new limited edition Backbone One controller will also be released 🎮 The controller costs $124.99 Buy Death Stranding from the App Store Get the Backbone One controller here The normal BackBone One controller is a bit cheaper at $99 when it’s in stock Walmart: Backbone One USB-C Best Buy: Backbone One USB-C 👍 Winner: Take a seat on the new Razer Iskur V2 gaming chair The Razer Iskur V2 gaming chair was a worthy winner of The Shortcut CES 2024 awards for best lifestyle gadget, and a new color option is going on sale this week. Pre-orders are open for the stylish dark gray fabric version of Razer’s $699 chair, which is a great alternative if you’re not a fan of the black leather or black and green leather combo. 🆕 A new version of the Razer Iskur V2 goes on sale on January 31 🎨 You can pick up a dark gray fabric version of Razer’s excellent chair 👏 The Iskur V2 features 6D lumbar support and 4D armrests 🏆 It was one of our favorite products at CES 2024 Shop for it at Razer Find out why we love Razer's chair There’s a lot more content on The Shortcut every day for FREE and PAID subscribers. Thank you for your feedback in the email replies ❤️ No posts Ready for more? "
}