{
    "title": "Apple & Microsoft: The future of AI in consumer tech",
    "date": "1/12/2024",
    "url": "https://finance.yahoo.com/video/apple-microsoft-future-ai-consumer-220236726.html",
    "text": "Investors paid careful attention to Apple (AAPL) and Microsoft (MSFT) at CES 2024 (Consumer Electronics Show) as, for a brief moment, Microsoft took over as the most valuable company for the first time since 2021. Microsoft has made a lot of ground for investment and development of AI, from purchasing OpenAI to the buzz around ChatGPT, while Apple has been grappling with weaker iPhone demand, especially in China. Constellation Research Founder and Principal Analyst R \"Ray\" Wang joins Yahoo Finance to give insight into Apple's AI strategy and share some of the latest tech innovations seen at CES. \"What we've seen over the last couple of quarters is declining revenues but profits are still increasing. That's because the services equation of the rational is actually growing in services a lot more profitable than putting out a piece of hardware,\" Wang says about Apple. \"I would say that we've probably seen those same kind of trends. But we do supplier checks, and suppliers aren't that nervous, in the sense that they're saying... we're going to see a decrease, mostly because we are in a super cycle.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino JOSH LIPTON: It's interesting, Ray, because, obviously, investors very excited about AI. That was a huge theme in 2023 and that excitement obviously helped really supercharge Microsoft stock, right? I mean, really can see like the investment Nadella makes in Microsoft versus how that stock-- what a great deal. I guess the question for Apple though, is what is their AI story? You'll hear rumors of this and whispers of this, but what do you think is coming there? RAY WANG: Well, the interesting thing is Apple has never explicitly had said they have an AI strategy, but we've all experienced what an ambient experience looks like, right? Take a photo, the lighting is off. Suddenly, it looks better. I mean, we've done with gray sky pictures, every picture now looks blue, right? It's kind of crazy like that. And so their AI is embedded in the background. They have a lot of it already. It's starting from the chip level all the way down to the user experience. I think they just have to tell the story more if they want to tell that AI story. JOSH LIPTON: You don't think they're going to put time, and effort, and money into building out those capabilities? Maybe would you not expect maybe a bit, some big announcement coming at the big software show in June? RAY WANG: I'm not sure they're going to have a Samsung, the whole world is Galaxy AI kind of strategy that was announced at CES. I think it's been here all the time. And I think people are going to see what it means to actually have AI that works versus, hey, we're talking about AI. JARED BLIKRE: Ray, we were talking over the brink-- over the break and you mentioned that the CES has become an auto show, a car show. Lots to do in mobility and the advances for AI, of course, it's integrated in every facet, you've got to think. But how does this roll out to the public? How does AI become, I guess, more a part of everyday internet of things objects as those become embedded in our lives? RAY WANG: Yeah, so we're seeing across a couple of fronts. You saw it in energy management. You saw it in the ability to help you as an assistant, help anything from translation to be able to manage your day-to-day activities. We see it in smart lighting and smart buildings. They're actually adjusted to your needs. We're seeing it in the health arena as people are quantifying their self and saying, oh, yeah, is that a heart murmur or is that not a heart murmur? Wait, am I allergic to this thing? Right, so we're starting to see that as augmenting humanity. Over time what we may get to a point, and that's probably 10 to 15 years out, is there will be more situational awareness. So right now it's augmenting humanity. In the future, it's how do we train the machines to get to the level of precision I want to get to. And then at some point, we're going to get to that full automation that we all are dreaming of. And remember, the automation is the only other way you want it, not the way someone else does. JARED BLIKRE: The way I'm dreaming of it, right? Yes. RAY WANG: Yes, the way all we're dreaming it. JOSH LIPTON: And Ray, I want to bring it back to Apple real quickly too because we do have earnings on deck coming up here pretty shortly. There's some kind of nervousness creeping into that story. We've seen a series of downgrades on the street, Ray. I think, obviously, some concern maybe from some quarters about weaker iPhone sales specifically in China. What would you expect when they report? RAY WANG: So I'm not sure because what we've seen over the last couple of quarters is declining revenues, but profits are still increasing. And that's because the services equation or the rationale is actually growing and service is a lot more profitable than putting out a piece of hardware. So I would say that we'd probably see those same kind of trends. But we did supplier checks and suppliers aren't like that nervous in the sense that they're saying, hey, we're going to see a decrease. And it's mostly because we're still in a supercycle. That supercycle that's going on is because we've got a lot, probably 250 to 260 million more iPhones to move on to 5G and that's going to take you into the 15 and the 16 cycles. That's a lot of iPhones. Plus, we haven't ramped up India yet. So even if China shuts down and China's economy is really, really bad, right, India is the one that they're hoping to pick up. Related Quotes "
}