{
    "title": "Apple's $3499 Vision Pro: Is it the future or a geeky fad?",
    "date": "2/6/2024",
    "url": "https://gulfbusiness.com/whats-inside-apples-vision-pro-take-a-look/",
    "text": "Get daily business news from the region delivered straight to your inbox Vision Pro features multiple cameras and sensors built into the device, OLED displays, an external EyeSight display, internal stereo speakers, connectors, lens inserts and headbands, among other technology The first videos of users wearing Apple’s Vision Pro headset are out and they are stunning, awkward or futuristic – choose your adjective, as you watch the reviews below. The Vision Pro – unveiled in June last year – has been lauded by analysts for its impressive technology, including an exterior display that shows the user’s eyes to people in the outside world, as well as a new chip that Apple says will process information from sensors in less time than the blink of an eye. At $3,499 they are the most expensive wearables on the market  – leaving behind Meta‘s Ray-Ban smart glasses which start at $299, and the Meta Quest 3 at $650 for the 512GB version. What makes the Apple’s Vision Pro different is the never-seen-before tech fit into a device that slides onto your face and allows you to move about without any restrictions. The headset, which has been called the phone maker’s most expensive wearable gamble, features multiple cameras and sensors built into the device, OLED displays, an external EyeSight display (with a blue glow), the internal stereo speakers, connectors, the lens inserts and headbands, and the new R1 chip powering it all. Check out this video below from iFixit who breaks it down – quite literally – and lets you have a look at the nuts and bolts of the Vision Pro. With the first set of devices available from February 2, a few reviewers have taken it for a spin, and the reactions are a social experiment of sorts. Apple has turned the surroundings into a three-dimensional navigational display, while aiming for an intuitive and natural control interface. Wallpaper describes the interface interaction as “VisionOS makes digital content look present in the physical world. Every detail of the UX design has been specially created to close the gap between the physical and digital realms.” Alan Dye, Apple’s VP of Human Interface Design explained the spatial computing that defines the Vision Pro to Wallpaper. “Once we understood that the product could be used for connection, for bringing people together and helping to enrich their lives, as we do with so many other Apple products, that’s when we got fully immersed in the program and wanted to bring it to life. We got excited about what this could mean as a whole new platform. That’s why we call it spatial computing.” The transparency of the glass that allows the wearer’s eyes to be visible was a huge consideration, revealed Dye, and is arguably the biggest differentiator from other eye wearables.” Dye says, ‘We wanted people around you to also feel comfortable with you wearing it, and for you to feel comfortable wearing it around other people. That’s why we spent years designing a set of very natural, comfortable gestures that you can use without waving your hands in the air. “That’s also why we developed EyeSight, because we knew more than anything, if we were going to cover your eyes, that takes away much of what is possible when you connect with people. Getting that right was at the core of the concept of the product because we wanted people to retain those connections in their actual world,” he added.  Watch this video to check out YouTuber Casey Neistat wearing the Vision Pro on the streets of Manhattan. Yup, there were a few heads turned, some stares, and definitely a few laughs of disbelief. 1. Asking for directions was not a problem as people do engage with you while you are wearing it 2. You can talk and look at the screen simultaneously and this is what it looks like: 3. Getting on to public transport was not a problem however, “please mind the gap” 4. The social experiment mentioned earlier 5. This is where the tracking failed… ﻿  © 2021 MOTIVATE MEDIA GROUP. ALL RIGHTS RESERVED. "
}