{
    "title": "Apple Vision Pro and an ASX 200 healthcare share hitting all-time highs",
    "date": "2/5/2024",
    "url": "https://www.fool.com.au/2024/02/05/apple-vision-pro-and-an-asx-200-healthcare-share-hitting-all-time-highs/",
    "text": " Access all of your premium services in our Member Centre Click here to learn more about our premium services TO MAKE THE WORLD\nSMARTER, HAPPIER, AND RICHER. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show, and premium investing services. This healthcare company has launched a 'groundbreaking' offering on Apple's new device. Image source: Apple You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Pro Medicus Limited (ASX: PME) shares have continued their positive run on Monday despite the market weakness. In morning trade, the ASX 200 healthcare share has climbed over 3% to hit an all-time high of $108.67. Investors have been buying the company's shares after it announced the launch of the \"groundbreaking\" Visage Ease VP for the new Apple Inc (NASDAQ: AAPL) product, the Apple Vision Pro. Apple Vision Pro is the tech behemoth's newly released spatial computer that blends digital content and apps into your physical space. It lets users navigate using their eyes, hands, and voice. According to the release, Visage Ease VP has been designed to take advantage of the unique capabilities of Apple Vision Pro. It supports immersive, spatial experiences for diagnostic imaging and multimedia. The company notes that Visage Ease VP includes all the proven functionality of Visage Ease, plus the exciting addition of Visage's powerful cinematic rendering engine for stunning volume-rendered images in immersive space. In addition, anywhere, on-the-go access with Visage Ease VP has additional flexibility with virtual screens at more than 4K resolution for each eye, independence from environmental lighting restrictions, and the ability to interact with imaging seamlessly in the user's physical space. Management also notes that Visage Ease VP uses the natural and intuitive input of eyes, hands, and voice navigation \"to provide an end-user imaging experience that's unlike any other application.\" The ASX 200 healthcare share already has a user testing out the technology. It notes that UC San Diego Health, a tier 1 academic medical centre and Visage customer, is the first health system to pilot the technology. Dr. Paul Murphy from UC San Diego Health commented: The visualization of three-dimensional medical imaging in immersive space creates exciting opportunities to improve patient care. Technology that allows for sophisticated eye motion and gesture controls for reviewing 2D and 3D medical imaging could potentially help in efficient tumor board reviews and create collaborative spaces in healthcare. Motley Fool contributor James Mickleboro has no position in any of the stocks mentioned. The Motley Fool Australia's parent company Motley Fool Holdings Inc. has positions in and has recommended Apple and Pro Medicus. The Motley Fool Australia has recommended Apple and Pro Medicus. The Motley Fool has a disclosure policy. This article contains general investment advice only (under AFSL 400691). Authorised by Scott Phillips. March 22, 2024 |\n        Tony Yoo The travel restriction also applies to lawyer, as the corporate watchdog investigates potential misuse of funds. Read more » March 21, 2024 |\n        James Mickleboro The broker is feeling very positive about these tech stocks. Read more » March 21, 2024 |\n        James Mickleboro Executives get free shares despite shareholder wealth destruction. Read more » March 20, 2024 |\n        James Mickleboro March has been very fruitful for owners of this tech company. Read more » March 20, 2024 |\n        Mitchell Lawler After a stunning rally in its share price, working closely with the AI giant, this Aussie company is calling a… Read more » March 19, 2024 |\n        James Mickleboro This online retailer is making changes in response to criticism. Read more » March 19, 2024 |\n        James Mickleboro This small cap has signed another deal with one of the world's largest companies. Read more » March 19, 2024 |\n        James Mickleboro Now could be the time for investors to snap up this tech stock. Read more » View All Sign Up for Take Stock\nInvestment news, stock ideas, and more, straight to your inbox. Get Started Investing\nYou can do it. Learn about investing with our Investing Education hub. Win at Retirement\nOur latest articles and strategies for the post-work life you want. Listen to Our Podcast\nHear our experts take on shares, the market & how to invest. Join Our Premium Community\nJoin our flagship membership service, Share Advisor. The Motley Fool stands behind our products and our membership-fee-back guarantee. If for any reason you are not 100% satisfied with your premium subscription, simply notify us within the first 30 days and you won't pay a cent. By taking up this offer, you will also be enrolled in our auto-renewal program, which is our way of making your ongoing subscription easier by ensuring uninterrupted service.  Don't worry, though – you're not locked in, and can cancel your auto-renewal at any time before each 'anniversary' date without question or penalty. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. The Motley Fool launched its Australian presence in 2011, and since then has grown to reach over 1 million Australians. Read more about us >  This Service provides only general, and not personalised financial advice, and has not taken your personal circumstances into account. The Motley Fool Australia operates under AFSL 400691. For more information please see our Financial Services Guide. Please remember that investments can go up and down. Past performance is not necessarily indicative of future returns. The Motley Fool Australia does not guarantee the performance of, or returns on any investment. We respectfully acknowledge the Traditional Custodians of the land where we live and work and pay our respects to all Elders, past and present, of all Aboriginal and Torres Strait Islander nations. © 2010 - 2023 The Motley Fool Australia Pty Ltd. All rights reserved. ACN: 146 988 052 Australian Financial Services Licence (AFSL): 400691 The Motley Fool Australia, PO Box 104, Isle of Capri, Qld 4217 Contact Details:\nPhone: (03) 8592 4841\nEmail: [email protected]\nOur friendly customer service team will happily get back to you as soon as they can. Notifications Scott Phillips just released his 5 best stocks to buy right now and you could grab the names of these stocks instantly! "
}