{
    "title": null,
    "date": "2/19/2024",
    "url": "https://www.firstpost.com/explainers/how-irans-iphone-ban-led-to-a-multimillion-dollar-scam-13739398.html",
    "text": "Despite Iran banning the iPhone for an ‘indefinite period,’ the handset remains available in shops across the country and in high demand from the public — for a hefty price. The Kourosh Company, which promised to deliver iPhones cheaply and within weeks, scammed people out of $35 million in just a few months Iran banned iPhones in 2023. However, despite the action from authorities, the iPhone remains popular with the public and constantly in demand. So much so that the authorities recently busted a multimillion-dollar scam that promised Iranians cheap iPhones. But why did Iran ban the iPhone? And how did it lead to the scam? Let’s take a closer look: Iran’s ban on iPhones According to Iran Times, Supreme Leader Ali Khamenehi in September 2020 had, citing the country’s finances, demanded a ban on excessive imports of luxury products including a phone manufactured in the United States. Iran on 20 February, 2023, banned iPhone 14 imports for an ‘indefinite period,’ according to AzerNews.az. Iran’s Ministry of Industry, Mine and Trade in a letter to the Islamic Republic of Iran Customs Administration (IRICA) said, “iPhone 14 and higher model mobile phones will no longer be registered in Iran and related instructions will be announced at the crossing points of the country.” The letter said these models were removed from the list of permitted devices that can be brought into Iran by citizens and via mail. According to Iran Times, the government banned the iPhone to halt the exodus of money from Iran. Iran had imported $2.3 billion worth of phones from 21 March, 2022 to 20 January, 2023. Of these, iPhones made up around a third of cellphone imports. According to Al Jazeera, the ban was expanded this year to include the iPhone 15 and all its models. But, the ban didn’t even work. IranWire.com quoted the country’s Association of Mobile Phone Importers in August 2023 as estimating that, since the ban, 120,000 iPhone 14 units worth $150 million had been illegally imported. The letter, addressed to First Vice President Mohammad Mokhber, stated that the iPhone 14  “does not possess any unique features such as satellite communication capabilities that would justify its inclusion in the list of prohibited imports.” The association told the government not to depend on a ban to regulate the flow of iPhone 14s. It said technological developments lets unsavoury persons bypass the ban. The association concluded that the ban on iPhone 14 imports deprives the government from high tax revenues and causes significant economic harm to legitimate importers. According to Al Jazeera, iPhones remain ubiquitous at shops across the country. The basic version of the iPhone 13 Pro is available for $2,300 (Rs 1.90 lakh) at shops in Tehran. Repacked and refurbished versions of the iPhone 13 Pro are available for $1,150 (Rs 95,000) Outside Tehran, the phone is being sold for around $800 (Rs 66,000.) The scam Enter the Kourosh Company. According to Al Jazeera, the firm called itself Iran’s “largest phone repair company.\" It promised consumers iPhones for around $360 (Rs 29,000) or less. It promised to deliver the phones ‘in weeks’. The company got people to fork over $35 million (Rs 266,13,47,500 crore) in just a few months. The Tasnim news agency identified 27-year-old Amirhossein Sharifian as the brains behind the scheme. The company launched a huge advertising blitz backed by a number of high-profile celebrities including actors, footballers and influencers to sell the scam to the public. Among these figures are national football team goalkeeper Alireza Beyranvand and actor Akbar Abdi. “Unfortunately, some renowned and recognised figures advertised for this company during its operation, whose charges will also be followed up on,” Hossein Rahimi, a senior police official, was quoted as saying by Al Jazeera. While Sharifian has reportedly fled to Turkey, one person from the company has been arrested and two more are wanted. The old adage is true – if an offer seems too good to resist, it probably is. With inputs from agencies Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}