{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.hrgrapevine.com/us/content/article/2024-02-13-apple-employees-left-deflated-by-vision-pro-worker-gift",
    "text": "Apple's Vision Pro may have successfully made headlines since its recent release, however the company's choice of gift for the employees who contributed to its development has raised eyebrows and sparked debate. In a move that has left many underwhelmed, Apple decided to acknowledge the efforts of its Vision Pro team with a rather minimalist token of appreciation – a framed image of the innovative device. Apple employees who worked for the Vision Pro get a nice gift. pic.twitter.com/6pQ108X432 Pictures of the gift surfaced on social media, eliciting mixed reactions from both Apple enthusiasts and industry observers. While some employees expressed gratitude for the gesture, others couldn't help but question the logic behind gifting a mere representation of a product that they played a crucial role in bringing to fruition. One Twitter user quipped, \"Is that a picture/picture frame? Wouldn't a nice gift be... a Vision Pro?\" Another pondered, \"But not a Vision Pro?\" The disparity between the gift and the product's high price point, starting at around $3,500, further fueled the controversy. With the Vision Pro already in high demand, some anticipated that employees would receive the actual device as a token of appreciation for their hard work and dedication. Instead, Apple opted to offer employees a 25% discount on the Vision Pro, should they choose to purchase one. While this discount may alleviate some disappointment, it still falls short of the expectations set by the company's reputation for lavish rewards and recognition. Similarly, HR Grapevine recently reported on a case in which beauty retail giant Sephora recently achieved a significant financial milestone by reaching $10billion in revenue in North America for the fiscal year 2023, however chose to thank staff for their hard work with cookies. Following the unprecedented financial success, Sephora reportedly distributed packages containing individually wrapped cookies adorned with the company logo, accompanied by a note expressing appreciation for the hard work of its employees. The company stated that it was “thrilled” that it reached $10billion in sales, claiming that “multiple Sephora records were shattered,” and it couldn’t be reached without “the dedication and efforts of all employees.” However, whilst the company’s intention may have been to say thank you, many staff instead deemed the move to be underwhelming. “Ten BILLION...and they give us stale cookies,” wrote one unnamed staff member. Both cases highlight the importance of meaningful recognition and rewards in fostering employee satisfaction and wellbeing, and the likelihood that underwhelming recognition efforts will be called out publicly. Employees in 2024 aren’t afraid to speak up when they feel that their organization isn’t truly appreciating their efforts, and in the age of social media, news around lacklustre employee recognition spreads like wildfire. As the Vision Pro continues to capture the imagination of consumers and tech enthusiasts alike, Apple may find itself revisiting its approach to recognizing the contributions of its employees in future product launches. Ensuring that employees feel valued and appreciated remains essential for fostering a culture of excellence and driving exemplary culture. This is the last preview available to you for 30 days. To access more news, features, columns and opinions every day, create a free myGrapevine account. Your privacy matters to us, and we will never collect personal information without your consent. You can manage your cookie preferences for your devices at any time. For more information, please read our Privacy and Cookie Policy. By clicking \"Accept All\" or continuing to use our site, you consent to the use of all cookies. Thank you for trusting us with your online experience. If you would rather just accept \"Essential Only\" cookies, the site performance will not be affected. "
}