{
    "title": "After Earnings, is Apple Stock a Buy, Sell or Hold?",
    "date": "2/9/2024",
    "url": "https://www.morningstar.co.uk/uk/news/245984/after-earnings-is-apple-stock-a-buy-sell-or-hold.aspx",
    "text": "Get 14 Days Free Apple (AAPL) released its fiscal Q1 earnings report on February 1. Here’s Morningstar’s take on Apple’s earnings and stock.\nKey Morningstar Metrics for Apple\n\nFair Value Estimate: $160.00\nCurrent price: $188\nMorningstar Rating: 2 stars\nMorningstar Economic Moat Rating: Wide\nMorningstar Uncertainty Rating: Medium\n\nWhat We Thought of Apple’s Q4 Earnings\nApple’s results showed better iPhone revenue in the December quarter than we expected, as well as better profitability. iPhone revenue was driven by the launch of the iPhone 15 lineup, and the improved profitability stems from a higher mix of services and higher-end products like the iPhone Pro models. However, revenue guidance for the March quarter fell below our expectations.\nIn the short term, we see demand headwinds for Apple relating to elongating personal device replacement cycles and more aggressive domestic alternatives in China. In the long term, we maintain our view that Apple can drive growth from its unique combination of hardware, software, and services, which also elicits steep customer switching costs and underpins our wide moat rating.\nWe believe guidance for weaker iPhone revenue in the March quarter portends weaker iPhone revenue for fiscal 2024 (ending in September). In our view, Apple’s current share price reflects overly rosy expectations for iPhone sales over the next five years, and our more modest forecast leads us to see the stock as overvalued.\nAAPL Bulls Say\n\nApple offers an expansive ecosystem of tightly integrated hardware, software, and services, which locks in customers and generates strong profitability.\nWe like Apple’s move to in-house chip development, which we think has accelerated its product development and increased its differentiation.\nApple has a stellar balance sheet and sends great amounts of cash flow back to shareholders.\n\nAAPL Bears Say\n\nApple is prone to consumer spending and preferences, which creates cyclicality and opens the firm to disruption.\nApple’s supply chain is highly concentrated in China and Taiwan, which leaves the firm vulnerable to geopolitical risk. Attempts to diversify into other regions may pressure profitability or efficiency.\nRegulators have a keen eye on Apple, and recent regulations have chipped away at parts of its sticky ecosystem.\n\n\n\nIs Apple Stock Fairly Valued?\nWith its 2-star rating, we believe Apple’s stock is overvalued compared with our long-term fair value estimate of $160 per share. Our valuation implies a fiscal 2024 adjusted price/earnings multiple of 25 times, a fiscal 2024 enterprise value/sales multiple of 7 times, and a fiscal 2024 free cash flow yield of 4%.\nWe project 6% compound annual revenue growth for Apple through fiscal 2028. The iPhone will be the greatest contributor to revenue over our forecast, and we project 3% growth for iPhone revenue over the next five years. We expect this to be driven primarily by unit sales growth, with modest pricing increases. We think pricing increases will be driven primarily by higher features and a mix shift toward the more premium Pro models.\nServices are Apple’s next biggest revenue contributor over our forecast, and we predict 8% revenue growth in this segment. Services are driven in large part by revenue from Google, thanks to its status as the default search engine on the Safari browser, as well as Apple’s cut of App Store sales. We expect solid growth in Google revenue, but we see a more mixed outlook for App Store results. There we forecast growth in overall app revenue but progressively lower cuts going toward Apple as the result of regulatory pressures. Elsewhere, we see roughly high-single-digit growth across revenue from Apple Music, Apple TV+, Apple Pay, AppleCare, and Apple’s other services.\nWe see the highest growth opportunity in Apple’s wearables revenue, to the tune of 18% through fiscal 2028, primarily driven by our expectations for the ramp of the new Vision Pro headset. We project a rapid ramp for Vision Pro, approaching 10 million unit sales and $30 billion in revenue in fiscal 2028. We see high-single-digit growth for Apple Watch and AirPods sales, with both products continuing to gain share. Apple (AAPL) released its fiscal Q1 earnings report on February 1. Here’s Morningstar’s take on Apple’s earnings and stock. Apple’s results showed better iPhone revenue in the December quarter than we expected, as well as better profitability. iPhone revenue was driven by the launch of the iPhone 15 lineup, and the improved profitability stems from a higher mix of services and higher-end products like the iPhone Pro models. However, revenue guidance for the March quarter fell below our expectations. In the short term, we see demand headwinds for Apple relating to elongating personal device replacement cycles and more aggressive domestic alternatives in China. In the long term, we maintain our view that Apple can drive growth from its unique combination of hardware, software, and services, which also elicits steep customer switching costs and underpins our wide moat rating. We believe guidance for weaker iPhone revenue in the March quarter portends weaker iPhone revenue for fiscal 2024 (ending in September). In our view, Apple’s current share price reflects overly rosy expectations for iPhone sales over the next five years, and our more modest forecast leads us to see the stock as overvalued.  Is Apple Stock Fairly Valued? With its 2-star rating, we believe Apple’s stock is overvalued compared with our long-term fair value estimate of $160 per share. Our valuation implies a fiscal 2024 adjusted price/earnings multiple of 25 times, a fiscal 2024 enterprise value/sales multiple of 7 times, and a fiscal 2024 free cash flow yield of 4%. We project 6% compound annual revenue growth for Apple through fiscal 2028. The iPhone will be the greatest contributor to revenue over our forecast, and we project 3% growth for iPhone revenue over the next five years. We expect this to be driven primarily by unit sales growth, with modest pricing increases. We think pricing increases will be driven primarily by higher features and a mix shift toward the more premium Pro models. Services are Apple’s next biggest revenue contributor over our forecast, and we predict 8% revenue growth in this segment. Services are driven in large part by revenue from Google, thanks to its status as the default search engine on the Safari browser, as well as Apple’s cut of App Store sales. We expect solid growth in Google revenue, but we see a more mixed outlook for App Store results. There we forecast growth in overall app revenue but progressively lower cuts going toward Apple as the result of regulatory pressures. Elsewhere, we see roughly high-single-digit growth across revenue from Apple Music, Apple TV+, Apple Pay, AppleCare, and Apple’s other services. We see the highest growth opportunity in Apple’s wearables revenue, to the tune of 18% through fiscal 2028, primarily driven by our expectations for the ramp of the new Vision Pro headset. We project a rapid ramp for Vision Pro, approaching 10 million unit sales and $30 billion in revenue in fiscal 2028. We see high-single-digit growth for Apple Watch and AirPods sales, with both products continuing to gain share.  on Morningstar.com The information contained within is for educational and informational purposes ONLY. It is not intended nor should it be considered an invitation or inducement to buy or sell a security or securities noted within nor should it be viewed as a communication intended to persuade or incite you to buy or sell security or securities noted within. Any commentary provided is the opinion of the author and should not be considered a personalised recommendation. The information contained within should not be a person's sole basis for making an investment decision. Please contact your financial professional before making an investment decision. From AI to shipping lanes, Morningstar's European market strategist Michael Field guides us th... From AI to shipping lanes, Morningstar's European market strategist Michael Field guides us th... First payout pleased investors but the yield is small and Meta will remain focused on share bu... First payout pleased investors but the yield is small and Meta will remain focused on share bu... We've had Tesla, Meta, Alphabet, Amazon, Apple and Microsoft report earnings recently. Nvidia ... We've had Tesla, Meta, Alphabet, Amazon, Apple and Microsoft report earnings recently. Nvidia ... Apple shares were off more than 3% in trading on Thursday, but Morningstar analysts are unconcern... Earnings and the outlook for tech stock growth support the move higher in stocks, according to Bl... Mining companies are operating in a challenging environment but could now be the time to top up o... THE WEEK: Morningstar columnist Rodney Hobson provides two pieces of advice to George Osborne, an... Businesses that have competitive advantages within their industry are good candidates for dividen... Morningstar reveals the top 10 best performers over the last five years Morningstar OBSR reveals the top funds for investors seeking exposure to European equities Shares of the buzzy social media platform climbed 48% from their IPO price Apple shares were off more than 3% in trading on Thursday, but Morningstar analysts are unconcern... The company, which previously bought the Standard Life pensions and savings brand, now anticipate... VIDEO: Morningstar's Monika Calay shares where active fund management are finding opportunities, ... Fed kept the rate unchanged at its March meeting, but falling inflation should boost the case for... Dan Romanoff \r\n\t is an equity research analyst on the technology, media, and telecommunications team for Morningstar in Chicago. About Us Connect With Us Get Help Terms of Use\r\n        \r\n  Privacy Policy\r\n        \r\n  Modern Slavery Statement\r\n        \r\n  \nCookie Settings\n\r\n      \r\nDisclosures The Morningstar Star Rating for Stocks is assigned based on an analyst's estimate of a stocks fair value. It is projection/opinion and not a statement of fact. Morningstar assigns star ratings based on an analyst’s estimate of a stock's fair value. Four components drive the Star Rating: (1) our assessment of the firm’s economic moat, (2) our estimate of the stock’s fair value, (3) our uncertainty around that fair value estimate and (4) the current market price. This process culminates in a single-point star rating that is updated daily. A 5-star represents a belief that the stock is a good value at its current price; a 1-star stock isn't. If our base-case assumptions are true the market price will converge on our fair value estimate over time, generally within three years. Investments in securities are subject to market and other risks. Past performance of a security may or may not be sustained in future and is no indication of future performance. For detail information about the Morningstar Star Rating for Stocks, please visit here Quantitative Fair Value Estimate represents Morningstar’s estimate of the per share dollar amount that a company’s equity is worth today. The Quantitative Fair Value Estimate is based on a statistical model derived from the Fair Value Estimate Morningstar’s equity analysts assign to companies which includes a financial forecast of the company. The Quantitative Fair Value Estimate is calculated daily. It is a projection/opinion and not a statement of fact. Investments in securities are subject to market and other risks. Past performance of a security may or may not be sustained in future and is no indication of future performance. For detail information about the Quantiative Fair Value Estimate, please visit here The Morningstar Medalist Rating is the summary expression of Morningstar’s forward-looking analysis of investment strategies as offered via specific vehicles using a rating scale of Gold, Silver, Bronze, Neutral, and Negative. The Medalist Ratings indicate which investments Morningstar believes are likely to outperform a relevant index or peer group average on a risk-adjusted basis over time. Investment products are evaluated on three key pillars (People, Parent, and Process) which, when coupled with a fee assessment, forms the basis for Morningstar’s conviction in those products’ investment merits and determines the Medalist Rating they’re assigned. Pillar ratings take the form of Low, Below Average, Average, Above Average, and High. Pillars may be evaluated via an analyst’s qualitative assessment (either directly to a vehicle the analyst covers or indirectly when the pillar ratings of a covered vehicle are mapped to a related uncovered vehicle) or using algorithmic techniques. Vehicles are sorted by their expected performance into rating groups defined by their Morningstar Category and their active or passive status. When analysts directly cover a vehicle, they assign the three pillar ratings based on their qualitative assessment, subject to the oversight of the Analyst Rating Committee, and monitor and reevaluate them at least every 14 months. When the vehicles are covered either indirectly by analysts or by algorithm, the ratings are assigned monthly. For more detailed information about these ratings, including their methodology, please go to here The Morningstar Medalist Ratings are not statements of fact, nor are they credit or risk ratings. The Morningstar Medalist Rating (i) should not be used as the sole basis in evaluating an investment product, (ii) involves unknown risks and uncertainties which may cause expectations not to occur or to differ significantly from what was expected, (iii) are not guaranteed to be based on complete or accurate assumptions or models when determined algorithmically, (iv) involve the risk that the return target will not be met due to such things as unforeseen changes in changes in management, technology, economic development, interest rate development, operating and/or material costs, competitive pressure, supervisory law, exchange rate, tax rates, exchange rate changes, and/or changes in political and social conditions, and (v) should not be considered an offer or solicitation to buy or sell the investment product. A change in the fundamental factors underlying the Morningstar Medalist Rating can mean that the rating is subsequently no longer accurate. For information on the historical Morningstar Medalist Rating for any managed investment Morningstar covers, please contact your local Morningstar office. For more detailed information about conflicts of interest, including EU MAR disclosures, please see the “Morningstar Medalist Rating Analyst Conflict of Interest & Other Disclosures for EMEA”here "
}