{
    "title": "Apple to launch new AI coding and testing features in Xcode this year: \nreport",
    "date": "2/15/2024",
    "url": "https://9to5mac.com/2024/02/15/apple-ai-xcode-features/",
    "text": "Apple is widely rumored to be working on major new artificial intelligence features coming later this year. In a new report today, Bloomberg says that Apple is “nearing the completion of” an update to its Xcode development platform that will use AI to streamline coding and testing for developers. The report says that Apple’s new system in Xcode will work along the lines of Microsoft’s GitHub Copilot platform. It will reportedly “use artificial intelligence to predict and complete blocks of code” in an effort to simplify the work required for software development. Bloomberg also says that Apple is exploring how to use AI to “generate code for testing applications.” Apple’s goal is to release the new AI features in Xcode as soon as later this year for third-party developers. Right now, it is “pushing some engineers to try these new AI features internally” as it aims to meet its launch goals. The new system will operate similarly to Microsoft’s GitHub Copilot and use artificial intelligence to predict and complete blocks of code, said the people, who asked not to be identified because the plans are private. That simplifies the programming process for software development, potentially saving time and money. Apple is also exploring the use of AI to generate code for testing applications, an often tedious process. Currently, Apple is pushing some engineers to try these new AI features internally as part of a “dogfooding” effort — when a company uses its own products — to make sure they work properly before releasing them to outside developers. During Apple’s earnings call earlier this month, Apple CEO Tim Cook promised that the company would share more details about its AI work this year. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Chance is an editor for the entire 9to5 network and covers the latest Apple news for 9to5Mac. Tips, questions, typos to chance@9to5mac.com "
}