{
    "title": "Apple pips Samsung to capture top position in India smartphone revenues in \n2023",
    "date": "1/31/2024",
    "url": "https://www.moneycontrol.com/news/business/apple-captures-top-position-in-india-smartphone-revenues-first-time-ever-in-a-calendar-year-12162991.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Apple shipped over 10 million iPhones in 2023, securing the top revenue position for the year, pipping its Korean rival Samsung, according to a report from Counterpoint Research. In 2022, Apple shipped over 6 million iPhones. Apple accounted for 23 percent of smartphone revenue share in 2023, surpassing Samsung's 21 percent market share. In the previous year (2022), Samsung held the top spot with a 22 percent smartphone revenue share, while Apple had 17 percent, data accessed by Moneycontrol showed. The average selling price (ASP) for Apple iPhones stood at $981 in 2023, the highest in the market compared to Samsung's $350 ASP. “Apple’s focus on India is also aiding the trend, with the brand surpassing the 10-million-unit mark in shipments and capturing the top position in revenue in a calendar year for the first time, propelled by robust demand for both its latest and older iPhones,” Counterpoint’s research analyst Shubham Singh said. “The opening of own retail stores and increasing focus on LFR (large-format retail) through regular promotions contributed to increased offline shipments. Besides, higher trade-in values presented an appealing proposition for consumers to transition to iOS,” Singh added. CMR India separately said that iPhone shipments grew 28 percent in 2023 as Apple cornered a 6 percent market share. In the fourth quarter of 2023 alone, iPhone shipments saw seven percent growth in India. Apple produced iPhones worth over Rs 1 lakh crore in India last year, having ramped up output sharply from the year before. Of this, made-in-India iPhones worth Rs 65,000 crore were exported from January to December. Apple reportedly exceeded the targets under the production-linked incentive (PLI) scheme, which may allow its contract manufacturers to get more residual incentives depending on the outlay. With an 18% share, as per Counterpoint data, Samsung took the top spot in 2023 for the first time since 2017. Xiaomi slipped to the third spot in 2023 but led in the October-Decmeber period of 2023 with an 18.3% share driven by its strategy to launch 5G phones in the affordable segment, offline expansion and a leaner portfolio. Vivo took the second spot in 2023 with a 17% share and led the affordable premium segment (Rs 30,000 45,000, ~ $360-$540) with a 33% share. India’s smartphone shipments remained flat in 2023 at 152 million units, Counterpoint data revealed. It added that the 5G smartphone shipment share crossed 52% in 2023, growing 66% YoY. Singh said that the premium segment (>Rs 30,000, ~ $360) witnessed a 64% YoY growth in 2023 driven by easy financing schemes, which resulted in consumers jumping price bands to purchase higher-priced smartphones. One out of every three smartphones was purchased through financing in 2023. “Driven by the premium segment’s growth and 5G upgrades, India’s smartphone market grew 25% YoY in Q4 2023 after declining for a year. The elongated festive season further aided this growth, as steep discounts, easy financing schemes, and lucrative promotions boosted demand,” said Shilpi Jain, senior research analyst at Counterpoint. For many OEMs, the key focus during the year was on taking 5G to the lower segment, driven by a shift in consumer preferences. 5G smartphone shipment share crossed 52% in 2023, growing 66% YoY. The last quarter (October-December) exited the market with healthy inventory levels compared to last year, setting the right tone for growth for next year. “We believe the market will grow by 5% YoY next year driven by premiumization, diffusion of 5G in lower price bands and better macroeconomic conditions,” Jain said.  DAILY-EVENING DAILY-EVENING Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}