{
    "title": "Apple’s Latest Update iOS 17.3 Bolsters Security With Anti-Theft Feature",
    "date": "1/24/2024",
    "url": "https://www.forbes.com/advisor/personal-finance/apple-update-stolen-device-protection/",
    "text": "You might be using an unsupported or outdated browser. To get the best possible experience please use the latest version of Chrome, Firefox, Safari, or Microsoft Edge to view this website. Reviewed Reviewed Published: Jan 24, 2024, 5:04pm In a bid to foil potential thieves, Apple has rolled out a major security update for iPhones that identifies users with biometric scans before granting them access to important data. The Stolen Device Protection feature, included in the iOS 17.3 update, can detect when a phone is in an unfamiliar place, away from known locations like your home or office. It then deploys one or more anti-theft measures to prevent unauthorized access and safeguard personal data. Stolen Device Protection requires you to provide biometric authentication through either Face ID (face scan) or Touch ID (fingerprint scan) for access. This safeguards data, such as stored passwords and credit card numbers, and prevents actions a thief might take, such as erasing all content from the device. Previously, iPhone users could use just a passcode. The new feature also includes a security delay for certain actions, such as changing your Apple ID password. After starting the process with one Face ID or Touch ID authentication, you have to wait an hour and then complete a second authentication. Featured Partners 1 TotalAV $19 for the first year Yes Yes 1 TotalAV On TotalAV's Website 2 Norton Antivirus $29.99 your first year Yes Yes 2 Norton Antivirus On Norton's Website 3 Mackeeper $4.80 per month Yes only for MacOS 3 Mackeeper On Mackeeper's Website 4 Surfshark $2.49 per month No No 4 Surfshark On Surfshark's Website When Stolen Device Protection is activated and your iPhone is not in a familiar location, authentication with Face ID or Touch ID is required for specific actions. These include: It’s important to note that, even with Stolen Device Protection, your iPhone passcode can still be used for purchases with Apple Pay. The first step in installing the iOS 17.3 update is to update your iPhone. Go to Settings > General and select Software Update. If there are multiple update options; choose the one you want and tap Install Now. If it says download and install, tap it, enter your passcode, and then tap Install Now. Once the update is complete, go to Settings > Face ID & Passcode and turn on Stolen Device Protection. This is an optional feature, so you can always disable it later if you want. To activate Stolen Device Protection, you have to enable location tracking, two-factor authentication and “Find My” for your Apple ID account. You can activate the location tracker by going to Settings > Privacy & Security > Location Services. When the iPhone is located in familiar areas, you can use your device passcode as usual, as the additional security steps aren’t needed. You may also want to install a mobile security app for extra safety.   Natalie toggles between news stories and enterprise reporting to bring timely personal finance topics to readers. Her mission is to help inform people of all financial backgrounds about events that may affect their financial futures. Her work has appeared in numerous publications such as CNBC, Bankrate, Buzzfeed, ABC Action News, The Chicago Tribune, The Associated Press and the Tampa Bay Times. She’s appeared on various podcasts and news shows to discuss personal finance topics, including Nasdaq’s Trade Talks. "
}