{
    "title": "Apple Watch Series 9, Watch Ultra 2 Lose Blood Oxygen Feature to Dodge US \nBan",
    "date": "1/21/2024",
    "url": "https://udaipurkiran.com/apple-watch-series-9-watch-ultra-2-lose-blood-oxygen-feature-to-dodge-us-ban/",
    "text": "According to the company, the Apple Watch Series 9 and Apple Watch Ultra 2 in the US will no longer have the company’s blood oxygen feature on both models. Apple has disabled the pulse oximetry feature on its smartwatches to avoid a looming US ban on its latest smartwatches. This violates a patent owned by Masimo Medical Technology. Therefore, customers who purchase these two models in the USA cannot measure blood oxygen saturation (SpO2). Masimo CEO Joe Chiani told Bloomberg that Apple has not contacted the medical device company to negotiate a settlement given the ongoing litigation between the two companies. Apple is appealing an October International Trade Commission (ITC) ruling that found the company infringed Masimo’s patent on pulse oximetry, a feature first introduced in the Apple Watch Series 6. Earlier this week, a federal appeals court ruled that Apple could not sell either model with blood oxygen functionality, but declined to suspend the import ban pending an appeal. As expected, Apple has disabled the blood oxygen sensor on the Apple Watch Series 9 and Watch Ultra 2 sold in the US to circumvent the ban. This means that both smartwatches in the US will still have a blood oxygen sensor, but the feature will be disabled. This feature will also be disabled in the Watch app. Meanwhile, Apple also updated the Apple Watch Series 9 and Watch Ultra 2 product pages in the US with a banner informing customers that the blood oxygenation feature is not available on these models, but the company’s feature comparison also shows that this is not the case. Performance has been lost. Diagrams of different models It is important to note that the blood oxygen function limits apply only to customers in the United States. This means the feature also works on the same model sold in other countries including India. If Apple and Massimo resolve their patent dispute in the future, the iPhone maker should be able to re-enable the feature since the company only disabled the hardware on those models. Tags Apple Watch Series 9 4 hours ago 4 hours ago 7 hours ago The joint venture between India’s JSW Group and MG Motor expects to sell one million … Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ     Want to play some real money Teen Patti Visit onlinecasinoguide.in and play Teen Patti for real money today. Find your dream job here  "
}