{
    "title": "Will Microsoft Still Be Worth More Than Apple by 2025?",
    "date": "1/16/2024",
    "url": "https://www.fool.com/investing/2024/01/16/will-microsoft-still-be-worth-more-than-apple-by-2/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Microsoft (MSFT 0.97%) recently overtook Apple (AAPL -4.09%) as the world's most valuable company. As of this writing, Microsoft's market cap has reached $2.89 trillion and remains higher than Apple's market cap of $2.87 trillion. This isn't the first time Microsoft's valuation eclipsed Apple's, but can it maintain that lead through the end of 2025? Let's take a fresh look at both tech giants to find out. Image source: Getty Images. Apple's stock declined 4% over the past three months as its critics lamented its sluggish iPhone sales and lack of near-term catalysts. It still generated more than half of its revenue from the iPhone in fiscal 2023 (which ended last September), but its handset sales declined 2% during the year as the 5G upgrade cycle ended. China's sluggish economy recovery and fierce currency headwinds exacerbated that pressure. Apple's Mac sales also continued to slip in a post-pandemic market as fewer consumers upgraded their laptops and desktops. As a result, Apple's revenue dipped 3%, and its earnings per share stayed nearly flat for the full year. Analysts expect Apple's revenue and earnings to grow 4% and 8%, respectively, in fiscal 2024 as it laps that slowdown and the macro environment improves. The expansion of its services ecosystem, which already hosts more than 1 billion paid subscriptions, could also amplify that recovery. Moreover, the launch of its Vision Pro headset could gradually diversify its hardware business -- even if its $3,500 price tag limits its early adoption to affluent tech enthusiasts. Apple's business remains broadly stable, while its $162 billion in cash and marketable securities gives it plenty of room to expand through investments and acquisitions. However, the lack of big near-term catalysts -- along with its stretched-forward price-to-earnings ratio of 28 -- are limiting its gains as the bulls rush toward more exciting growth plays. Meanwhile, Microsoft's stock rose 19% over the past three months as it impressed the market with the growth of its cloud business, the expansion of its artificial intelligence (AI) ecosystem, and its takeover of Activision Blizzard. Microsoft owns Azure, the world's second-largest cloud infrastructure platform after Amazon Web Services (AWS). Azure notably grew at a much faster rate than AWS in its latest quarter, and its year-over-year revenue growth actually accelerated as AWS' revenue growth merely stabilized from its previous quarter. Microsoft attributed that acceleration to the integration of OpenAI's AI tools into Azure and its other cloud services. Microsoft is also the top investor in OpenAI, the creator of ChatGPT, making the Windows company one of the easiest ways to invest in the AI market. Microsoft's acquisition of Activision Blizzard should strengthen its Xbox business, add more games to its Game Pass and Cloud Gaming libraries, and ensure that it keeps pace with Sony and Nintendo in the console race. Simply put, the expansion of Microsoft's cloud, AI, and gaming businesses are offsetting the slower growth of its PC-oriented businesses and made it a more exciting investment than Apple. Microsoft's revenue and adjusted EPS both grew 7% in fiscal 2023 (which ended last June), even as it faced tough currency headwinds and slower enterprise spending in this challenging macro environment. Analysts expect its revenue and adjusted EPS to both grow 15% in fiscal 2024. At 35 times forward earnings, Microsoft's shares might seem a bit pricier than Apple's. Nevertheless, its stronger growth and exposure to the AI market might easily justify that higher valuation. Looking further ahead, analysts expect Apple's revenue and earnings to grow 6% and 8%, respectively, in fiscal 2025. They expect Microsoft's revenue and earnings to both rise by another 15% in fiscal 2025. Investors should take those estimates with a grain of salt, but Apple needs to prove it can expand beyond the iPhone -- while Microsoft could continue to dazzle investors with the growth of its cloud and AI businesses. Therefore, I believe Microsoft has a clear shot at outperforming Apple throughout 2025 and widening its lead as the world's most valuable company. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Leo Sun has positions in Amazon, Apple, and Nintendo. The Motley Fool has positions in and recommends Amazon, Apple, and Microsoft. The Motley Fool recommends Nintendo. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}