{
    "title": "Apple broke a 12-year tradition in 2023 and it has to do with iPads",
    "date": "1/2/2024",
    "url": "https://finance.yahoo.com/news/apple-broke-12-tradition-2023-162354781.html",
    "text": "Since its debut in 2010, the iPad has regularly received annual updates and enhancements. That streak came to an end in 2023, however. For the first time since it introduced its tablet, Apple did not roll out a new model last year. The last time the company updated the line was in October 2022. That drought is expected to end later this year, with the rumor mill suggesting a refresh on the entire product line, from entry-level iPads to a new flagship iPad Pro, which is expected to receive several new features, ranging from a better screen to a new keyboard attachment. The new iPads could be introduced as early as March. Part of the reason for the interruption in new iPads, per Bloomberg, was Apple’s desire to make it easier for consumers to differentiate between models. The wide variety of models has resulted in a sales slowdown for the iPad. In fiscal 2023, sales of the tablet were down 3% compared to fiscal 2022. The year before, they saw an 8% decline. The pause in new iPads also comes as Apple is working to add touch screens to its Mac computers, a decision that cofounder Steve Jobs once rejected and one the company previously worried could cannibalize iPad sales. The company is also facing issues with its successful Apple Watch line, which is in the midst of a legal battle over a patent infringement battle with Masimo. An import ban went into effect late last year but was quickly paused by an appeals court. Apple could use some good news. On the first day of trading in 2024, the company’s stock was down more than 3% in late morning trading. That followed a downgrade from Barclays, which cited a slowdown in iPhone sales, particularly in China. The drop wiped out over $100 billion of Apple’s market value. This story was originally featured on Fortune.com Related Quotes "
}