{
    "title": "Just How Safe Is Apple Stock's Dividend?",
    "date": "1/27/2024",
    "url": "https://247wallst.com/investing/2024/01/27/just-how-safe-is-apple-stocks-dividend/",
    "text": "A key component of income investing is a portfolio that includes safe dividends, those that are unlikely to shrink or disappear. Recognizing when a dividend is stable and safe can be a challenge. Yet, certain metrics can offer clear signs for the investor looking to establish or shore up such a portfolio. What do these metrics tell us about the quarterly dividend at Apple Inc. (NASDAQ: AAPL)? The most recent payout from Apple was $0.24 a share, and the yield is now about 0.5%. The next ex-dividend date is expected in early February. The current yield is less than that of such competitors as Dell Technologies Inc. (NYSE: DELL), HP Inc. (NYSE: HPQ), International Business Machines Corp. (NYSE: IBM) and Samsung Electronics. It is also lower than the tech sector average of about 1.6%. One clear sign of whether a dividend is stable and safe is if the company is a Dividend Aristocrat. Those are companies in the S&P 500 that have not only paid a dividend consistently for 25 years but have increased their payouts every year as well. Apple is not among the aristocrats, as its payout has varied over the past decade, from about $0.20 to $3.05 a share. The company has increased the dividend by a penny per share for the past couple of years, but it has a long way to go to become a Dividend Aristocrat. (See the seven highest-yielding 2024 Dividend Kings to buy and hold forever.) While being a Dividend Aristocrat would have been a good sign, other financial metrics provide additional insight as well. The dividend payout ratio indicates how much of a company’s earnings it pays out as a dividend. It is a sign of how safe a company’s dividend is and how much room it has for future growth. The higher the ratio, the greater the risk. Income investors often look for a dividend payout ratio of less than 60%. Apple’s current dividend payout ratio is just 15%. That is well below the industry average, and the company’s mean dividend payout ratio was 24% over the past decade. A look at free cash flow reveals whether the company has the funds required for its payout, as well as for share repurchases or even paying down debt or making acquisitions. Income investors prefer growing free cash flows. In 2010, Apple had free cash flow of nearly $16.6 billion. The figure should come in well above $100 billion for  2023. In between, the figure has declined in some years, but the overall trend is upward. Return on invested capital is a measure of how well a company allocates its capital to profitable projects or investments. Again, the thing to look for is stability, specifically a double-digit ROIC over many years. At Apple, the current ROIC is around 33%, which is well above those of tech giants Alphabet Inc. (NASDAQ: GOOGL) and Amazon.com Inc. (NASDAQ: AMZN). Apple’s ROIC has been in the double digits for at least a decade. Operating margin is a measure of the percentage of revenue a company keeps as operating profit. Here too the preference is for a stable double-digit percentage increase. The current figure is about 30%. The margin has mostly been above 25% since 2010. Note that the current operating margin at Microsoft Corp. (NASDAQ: MSFT) is higher than Apple’s. A look at sales growth offers a clue to the volatility or cyclical nature of the business. Steady, moderate growth, say 3% to 7%, is often considered ideal. Revenue at Apple was about $65.2 billion in 2010, growing to $383.2 billion last year. Sales increased in most quarters in that interval. The growth has not been as steady smartphone rival Samsung, nor at Dell, HP or IBM. A company’s net debt-to-capital ratio also can signal whether a dividend may be at risk. Because too much debt can put dividends at risk in hard times, a lower ratio is considered better. A debt-to-capital ratio above 0.6 usually means that a business has significantly more debt than equity. The ratio at Apple has been less than that for most of the past few years. Probably the most popular valuation metric is the price-to-earnings (PE) ratio. This indicates whether a stock is expensive or cheap at its current market price, compared to the broader market or to competitors. Apple has a trailing PE ratio of nearly 32, which is above the industry average of 22.5. Note that the forward PE is less than 30. That also compares with a broad historical benchmark of 15, as well as the broader market’s current 24 or so. Note that among the rest of the so-called Magnificent Seven tech stocks, only Alphabet has a PE ratio lower than Apple. (See which five blue chip dividend stocks make up 75% of Warren Buffett’s portfolio.) And finally, the number of shares outstanding is worth a look. When companies buy back their shares, that number shrinks. But secondary offerings of stock and stock compensation increase that total. Investors tend to prefer a declining total, as that increases their stake over time. At Apple, the number of shares was 26.2 billion in 2012 and has declined every year to 15.8 billion last year. The company bought back $77.6 billion worth of stock last year, though that was down from $89.4 billion the year before. Given these metrics, it seems clear that Apple’s dividend is safe for now, if not generous. While the PE ratio is not a match for the broad benchmarks, it is not out of line for a Magnificent Seven stock. Some income investors no doubt wish for Apple’s dividend to be more generous, which the tech giant clearly could afford. At least Apple has a pattern of annually increasing the payout going back to before its stock split in 2020. The company could be a Dividend Aristocrat in time. Sponsored: Want to Retire Early? Here’s a Great First Step Want retirement to come a few years earlier than you’d planned? Or are you ready to retire now, but want an extra set of eyes on your finances? Now you can speak with up to 3 financial experts in your area for FREE. By simply clicking here you can begin to match with financial professionals who can help you build your plan to retire early. And the best part? The first conversation with them is free. Click here to match with up to 3 financial pros who would be excited to help you make financial decisions. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}