{
    "title": "Apple suffers second rating downgrade in tough start to 2024",
    "date": "1/4/2024",
    "url": "https://www.moneycontrol.com/news/business/apple-suffers-second-rating-downgrade-in-tough-start-to-2024-12000801.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Apple fell further on Thursday, losing about $176 billion since the start of the year, after Piper Sandler became the second brokerage this week to downgrade the stock on worries of tepid demand for its products, including the iPhone. The company's shares dropped 1.7% to an eight-week low of $181.20 on Thursday. If the losses hold, Apple stands to lose $47.4 billion of its value for the day. \"We are concerned about handset inventories entering into 1H24 and also feel that growth rates have peaked for unit sales … deteriorating macro environment in China could also weigh on handset business,\" Piper Sandler lead analyst Harsh Kumar wrote in a note to clients. Also read: Apple stock downgraded as Barclays warns on cooling iPhone demand The brokerage downgraded the rating on Apple's stock to \"neutral\" from \"overweight\" and cut its price target by $15 to $205. Apple has been grappling with a demand slowdown since early last year and forecast holiday-quarter sales below Wall Street estimates. The company has been dealing with weak demand in China due to strained consumer spending in the country, as well as the revival of local rival Huawei. Apple could also face headwinds due to an ongoing patent dispute involving its new Apple Watches and a strong U.S. dollar, according to Kumar. The brokerage's comments echo those from Barclays, which downgraded Apple stock to a rating equivalent of \"sell\" on Tuesday. Apart from growth concerns at the iPhone business, Barclays also warned of risks to the company's services business that has come under the scanner in countries including the United States over certain app store practices. Analysts, on average, rate the iPhone maker \"buy\", with a median price target of $200, according to LSEG data.  DAILY-EVENING DAILY-EVENING Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}