{
    "title": "5 Blue-Chip Stocks to Buy Ahead of Earnings Results",
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/news/5-blue-chip-stocks-buy-124700798.html",
    "text": "We are in the initial stage of the fourth-quarter 2024 earnings season. The earnings results and management guidance would be crucial for market participants to gauge the health of the U.S. economy. As of Jan 12, 29 companies on the S&P 500 Index have reported their financial numbers. Total earnings for these index members are up 7.6% from the same period last year on 6% higher revenues, with 93.1% beating EPS estimates and 55.2% beating revenue estimates. At present, total earnings of the S&P 500 Index in fourth-quarter 2024 are expected to be up 0.1% on 2.2% higher revenues. This follows the 3.8% earnings growth on 2% higher revenues in the third quarter and three back-to-back quarters of declining earnings before that. Meanwhile, a handful of Dow stocks — popularly known as blue-chip stocks — with a favorable Zacks Rank are set to beat on earnings results. Investment in these stocks should be prudent going forward. We have narrowed our search to five Dow stocks that are poised to beat on earnings results. Each of these stocks carries either a Zacks Rank #1 (Strong Buy) or 2 (Buy) and has a positive Earnings ESP. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here. Our research shows that for stocks with the combination of a Zacks Rank #3 (Hold) or better and a positive Earnings ESP, the chance of an earnings beat is as high as 70%. These stocks are anticipated to appreciate after their earnings releases. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter. The chart below shows the price performance of our five picks in the last quarter. Image Source: Zacks Investment Research Apple Inc. AAPL is benefiting from strong demand for iPhone. AAPL expects iPhone’s year-over-year revenues to grow on an absolute basis in first-quarter fiscal 2024. Revenues for Mac are expected to significantly accelerate compared with the fourth-quarter fiscal 2023 reported figure. AAPL expects the year-over-year revenue growth for both iPad and Wearables, Home and Accessories to decelerate significantly from the September quarter due to a different timing of product launches. For the Services segment, AAPL expects average revenues per week to grow at a similar strong double-digit rate as it did during the September quarter. The expanding content portfolio of Apple TV+ aids subscriber growth. Zacks Rank #1 Apple has an Earnings ESP of +3.65%. It has an expected earnings growth rate of 7.2% for the current year (ending September 2024). The Zacks Consensus Estimate for current-year earnings has improved 0.2% over the last 30 days. Apple recorded earnings surprises in three out of the last four reported quarters, with an average beat of 3.5%. The company is set to release earnings results on Feb 1, after the closing bell. The Boeing Co. BA remains the largest aircraft manufacturer in the United States in terms of revenues, orders and deliveries. During the third quarter, the jet giant booked 398 net commercial airplane orders. A strengthening U.S. defense budget should also boost BA’s Defense, Space & Security's segment growth. Boeing has ample liquidity to meet its debt obligations in the near term. Our model projects BA's total revenues to increase in 2023-2025 time period. Zacks Rank #2 Boeing has an Earnings ESP of +0.33%. It has an expected earnings growth rate of more than 100% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 5.9% over the last 30 days. The company is set to release earnings results on Jan 31, before the opening bell. The Coca-Cola Co. KO continues to witness positive business trends as reflected by its robust surprise history. KO’s sales and earnings beat estimates for the third consecutive quarter in third-quarter 2023. Strong revenue growth across most of its operating segments aided by improved price/mix and increased concentrate sales boosted the results. KO is poised to gain from innovations and accelerating digital investments. KO provided upbeat guidance for 2023. We anticipate organic revenue growth of 10% for 2023. We expect positive price/mix of 9.3% and an increase of 1.5% in concentrate volume for 2023. Zacks Rank #2 Coca-Cola has an Earnings ESP of +1%. It has an expected earnings growth rate of 4.6% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.1% over the last 90 days. Coca-Cola recorded earnings surprises in three out of the last four reported quarters, with an average beat of 5.1%. The company is set to release earnings results on Feb 13, before the opening bell. The Procter & Gamble Co. PG has been gaining from robust pricing and a favorable mix, along with strength across segments. PG has been focused on productivity and cost-saving plans to boost margins. This led to the top and bottom lines beating the consensus mark for the fifth consecutive quarter in the first quarter of fiscal 2024. Consequently, PG has provided an optimistic fiscal 2024 view. We estimate all-in sales to increase 3.7% year over year in fiscal 2024. Zacks Rank #2 Procter & Gamble has an Earnings ESP of +0.48%. It has an expected earnings growth rate of 8.8% for the current year (ending June 2024). The Zacks Consensus Estimate for current-year earnings has improved 0.6% over the last 90 days. Procter & Gamble recorded earnings surprises in the last four reported quarters, with an average beat of 3.8%. The company is set to release earnings results on Jan 23, before the opening bell. The Travelers Companies Inc. TRV boasts a strong market presence in auto, homeowners’ insurance and commercial U.S. property-casualty insurance with solid inorganic growth. A high retention rate, a rise in new business and positive renewal premium change bode well. TRV’s commercial businesses should perform well owing to market stability. TRV remains optimistic about the personal line of business, given growth at auto and homeowners business. TRV expects fixed-income net investment income to be around $615 million after tax for the fourth quarter. Zacks Rank #2 Travelers Companies has an Earnings ESP of +1.56%. It has an expected earnings growth rate of 51.8% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.6% over the last seven days. The company is set to release earnings results on Jan 19, before the opening bell. Stay on top of upcoming earnings announcements with the Zacks Earnings Calendar. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report The Boeing Company (BA) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report CocaCola Company (The) (KO) : Free Stock Analysis Report Procter & Gamble Company (The) (PG) : Free Stock Analysis Report The Travelers Companies, Inc. (TRV) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}