{
    "title": null,
    "date": "1/14/2024",
    "url": "https://www.bostonherald.com/2024/01/14/ticker-microsoft-passes-apple-as-most-valuable-stock-supreme-court-agrees-to-hear-starbucks-appeal/",
    "text": "E-Edition Sign up for email newsletters  Sign up for email newsletters E-Edition Trending: Microsoft Corp. overtook Apple Inc. to become the world’s most valuable publicly traded company for the first time in more than two years, as worries over smartphone demand have weighed on the iPhone-maker’s stock in recent weeks. The Redmond, Washington-based software giant rose 1% to $388.47 on Friday, ending with a market valuation of $2.89 trillion. Meanwhile, Apple gained 0.2% and closed with a market capitalization of $2.87 trillion. It’s the first time since November 2021 that Microsoft has closed with a higher value than Apple. “When you compare and contrast the two, the growth Apple is showing is nothing special, whereas Microsoft has done a better job of executing and demonstrating earnings growth,” said David Katz, chief investment officer at Matrix Asset Advisors. “Microsoft also has a much clearer roadmap with AI, and it has done a great job articulating how that will accelerate growth to make its long-term prospects even more compelling.” The Supreme Court has agreed to hear an appeal from Starbucks in a dispute with the National Labor Relations Board over efforts by workers to unionize at a store in Memphis, Tennessee. The case has been among the most closely watched in the more than 2-year-old effort to unionize Starbucks’ company-owned U.S. stores. Starbucks fired seven employees in Memphis in February 2022, citing safety. The Seattle coffee giant said they violated company policy by reopening a store after closing time and inviting non-employees — including a television crew — to come inside and move throughout the store. But the NLRB intervened, saying the company was unlawfully interfering in workers’ right to organize and that the store had routinely allowed employees to gather there after closing time. Copyright © 2024 MediaNews Group "
}