{
    "title": "Mark Zuckerberg has entered his Posting Era",
    "date": "2/17/2024",
    "url": "https://www.businessinsider.in/tech/news/mark-zuckerberg-has-entered-his-posting-era/articleshow/107763800.cms",
    "text": "Liked the article? Share it with your friends... or copy link Having not personally tested both devices, I am not fully qualified to judge whether Mark Zuckerberg's video review accurately compares Apple's Vision Pro to the Meta Quest 3. But having read and watched a gazillion reviews of both, I can confirm that he makes some good points. He's not wrong that the Vision Pro is heavy and uncomfortable. (Some people are returning theirs over this.) And he gives it credit for having a brighter, sharper screen. Sure, his conclusion that Meta's Quest 3 is better is convenient, but let's not overlook something incredible: He's a decent gadget reviewer. We've been exposed to Zuckerberg's awkward posts for years now, from meat smoking to surfing, where he strives for \"human.\" But there's a new chaotic element here — he's doing something as pedestrian and relatable as shit-talking a rival. The impulse in the face of extreme adversity to Post Through It — I recognize that specific tendency all too well. In an interview on the Morning Brew Daily podcast, Zuckerberg explained why he posted the video, painting a picture that might be disturbingly familiar to some of us: \"In my household, it's basically like my wife Priscilla screaming at me, 'Mark come to sleep,' and I'm like 'No! There's someone wrong on the internet, I've got to do something about it!'\" It's happened. Mark Zuckerberg has entered his Posting Era. (Andrew \"Boz\" Bosworth, Meta's CTO and a notorious poster on Meta's internal message boards, also gave his own review of the Vision Pro in his Instagram Stories. Shockingly, he also declared the Quest 3 to be superior.) Zuckerberg's latest video isn't necessarily a homerun; some are comparing his rant to a famously wrong-sighted comment by Steve Ballmer when the ex-Microsoft chief poopooed the debut of the iPhone. Apple's Vision Pro might be the first time the two companies are directly competing, but their bad blood goes way back. Apple and Facebook have been beefing since Ping. Ping! Remember Ping, the social element added to iTunes back in 2010? Over the years, Apple CEO Cook has taken some shots in the press about Meta's handling of user privacy (fair), which reportedly made Zuckerberg so mad he ordered executives to use Android phones (lol, but also fair). Then there was Apple's \"Ask App Not to Track\" feature, which was a significant blow to Meta's ad business, costing the company as much as $10 billion in 2022. (Meta has since recovered its composure: It just posted bonanza quarterly results and has a soaring stock price.) And for a long time, Meta has grumbled about the App Store's \"onerous\" cut of in-app purchases and anti-competitive policies. Some of this back-and-forth is playing out on Meta's own Threads, where Meta executives and employees are highly active, and a handful of rank-and-file employees have grown large audiences. Not infrequently, those employees are complaining about Apple. It is reasonable that Meta employees have a unique vantage point to form opinions about other tech companies and tend to come to the same conclusion. It happens in lots of workplaces — probably yours, too. The result is a sort of humid hothouse on Meta-owned Threads, a soupy thick air full of just the level of friendly moisture to grow the fungus of Poster's Brain. It's tempting to compare Zuckerberg's new zest for posting with that other keyboard-happy tech CEO. But Elon Musk's X habit is more like the impulsive spewing of what's inside his mind — often coming with significant negative costs to him and his companies. I don't attempt to think too hard about Mark Zuckerberg's inner life, but I don't get the sense that what we're seeing is a window into his soul. This is a business strategy. Instead, what I see an inkling of in Zuckerberg's latest video is the belief that posting more can fix the problem or make things better. (A core belief of a True Poster.) Apple came out with a product that — whether or not it's actually far superior — people were way, way more hyped about. It's nearly impossible to imagine Tim Cook making a video like this; he simply doesn't have that dog in him. Meta faces big challenges — not just competition to its VR headset business, but the ongoing existential problems that have long plagued it: shifting consumer habits away from public posting, competition from TikTok, lawsuits from states and cities over its products' potentially addictive and harmful effects on teens, lingering distrust by the public as a result of a decade of mistakes and bad decisions about the safety and integrity of the product. The CEO posting a few Threads or videos where he comes across as a silly, goofy guy won't fix that overnight. But I can see the allure of trying. I, too, know the vertiginous feeling of riding the high of a well-received tweet or post; how it temporarily emboldens you to want to post more and more. I've spent more of my waking hours than I should admit chasing that dopamine high. For a long time, Meta has been the No. 1 dealer in these cheap thrills, but the boss has largely avoided it. What I see now is something I never thought might happen: Mark Zuckerberg is getting high on his own supply. Advertisement "
}