{
    "title": "LG OFFERS THREE-MONTH FREE TRIAL FOR APPLE TV+ TO SMART TV AND LIFESTYLE \nSCREEN OWNERS",
    "date": "2/6/2024",
    "url": "https://finance.yahoo.com/news/lg-offers-three-month-free-130000261.html",
    "text": "LG Smart TV Users Gain Free Access to Wide Selection of Apple Originals, Hit Shows and Feature Films for Limited Time Only ENGLEWOOD CLIFFS, N.J., Feb. 6, 2024 /PRNewswire/ -- LG Electronics (LG) is offering access to three months of Apple TV+ free to eligible LG Smart TV users in 93 countries.1 The 3-month free trial is available within the Apple TV app of compatible 4K and 8K LG Smart TVs (2018 models and later), along with lifestyle screen models StanbyME and StanbyME Go. This limited-time offer will be in effect from February 6 to April 30, 2024.2 Apple TV+ offers premium series, compelling drama and comedy series, captivating feature films, groundbreaking documentaries, and kids and family entertainment. Apple TV+ offers acclaimed, global hit series such as \"Monarch: Legacy of Monsters,\" Masters of the Air,\" \"Silo,\" \"Hijack,\" \"The Morning Show,\" \"Foundation,\" \"Slow Horses\" and multi-Emmy Award-winning Ted Lasso, as well as award-winning Apple Original Films including the 10X Academy Award nominated \"Killers of the Flower Moon,\" from Martin Scorsese and historic Oscar Best Picture winner \"CODA\". LG's industry-leading TVs feature Dolby Vision and Dolby Atmos to deliver superb home entertainment and LG Smart TV users can enjoy Apple TV+ in 4K with Dolby Vision and Dolby Atmos.3 The company's 2024 premium TVs,4 are industry first to support both Dolby Vision and Filmmaker Mode, a cinematic experience available with Apple TV+ titles mastered in Dolby Vision. LG is committed to elevating the viewing experience to a new height by offering an extensive array of content and services, class-leading picture quality, and immersive audio. LG Smart TV users can effortlessly tap into the full suite of content and services offered by LG Smart TVs with the versatile and user-friendly webOS platform. 1 Available in Australia, New Zealand, Hong Kong, Indonesia, Japan, Malaysia, Philippines, Singapore, Sri Lanka, Thailand, Taiwan, India, Korea, Austria, Belgium, Luxembourg, Netherlands, Czech Republic, Slovenia, Slovakia, Germany, Switzerland, Spain, France, Cyprus, Greece, Italy, Malta, Estonia, Latvia, Lithuania, Bulgaria, Hungary, Poland, Portugal, Denmark, Finland, Norway, Sweden, Ireland, United Kingdom, US, Canada, Argentina, Colombia, Chile, Mexico, Bolivia, Paraguay, Peru, Belize, Costa Rica, Dominica, Dominican Republic, Ecuador, El Salvador, Grenada, Guatemala, Honduras, Nicaragua, Panama, Puerto Rico, Trinidad and Tobago, Venezuela, Brazil, Belarus, Ukraine, Gambia, Ghana, Uganda, Egypt, Armenia, Azerbaijan, Oman, Qatar, United Arab Emirates, Jordan, Lebanon, South Africa, Saudi Arabia, Israel. Additionally available in Bermuda, the Bahamas, the Cayman Islands, Saint Kitts and Nevis, Moldova, Mongolia, Tajikistan, Mauritius, Niger, Guinea-Bissau, and Turkmenistan for models ranging from webOS22 to webOS 24. 2Offer ends 04/30/2024. Redemption dates for select 12 countries (Bermuda, the Bahamas, the Cayman Islands, Saint Kitts and Nevis, Moldova, Mongolia, Tajikistan, Mauritius, Niger, Guinea-Bissau, and Turkmenistan) is from February 20th for TVs running webOS 22 and March 4th for TVs running webOS 23. This offer is available on 2018-2024 LG 4K and 8K Smart TV models, StanbyME, and StanbyME Go in the Apple TV app. Availability of StanbyME and StanbyME Go may vary by region. Valid only for new subscribers to Apple TV+ in your region. Limit one offer per TV and Apple ID. Plan automatically renews at your region's price per month until cancelled. Requires Apple ID with payment method on file. Payment will be billed to payment method on file and can be cancelled anytime at least a day before each renewal date in your service account settings. Terms and Apple Privacy Policy apply; see the applicable terms at https://www.apple.com/legal/internet-services/itunes/us/terms.html. Must be the minimum age required in your country and in the country that matches the store front on which you are redeeming the offer. Compatible products and services required. Cannot be combined with other offers providing access to the same service. Apple TV+ is a service mark of Apple Inc. 3. Not all content is available in 4K or 4K HDR. 4K resolution requires a 4K‑capable device. Accessing Dolby Atmos and Dolby Vision features requires a Dolby Atmos and Dolby Vision capable system. Playback quality will depend on hardware and internet connection. 4. Dolby Vision and Filmmaker Mode is available on LG's 2024 OLED TV, QNED TV 90, QNED TV 91 and QNED 99 series. Automatic Filmmaker Mode experience is available on Apple TV+ on LG Smart TV models running webOS 6.0 and later. About LG Electronics USALG Electronics USA, Inc., based in Englewood Cliffs, N.J., is the North American subsidiary of LG Electronics, Inc., a $68 billion global innovator in technology and manufacturing. In the United States, LG sells a wide range of innovative home appliances, home entertainment products, commercial displays, air conditioning systems and vehicle components. LG is a ten-time ENERGY STAR® Partner of the Year. The company's commitment to environmental sustainability and its \"Life's Good\" marketing theme encompass how LG is dedicated to people's happiness by exceeding expectations today and tomorrow. www.LG.com. Media Contacts:      LG Electronics USA  LG Electronics USA Chris De Maria  Christin Rodriguez christopher.demaria@lge.com  christin.rodriguez@lge.com    LGHEUS@LG-One.com     View original content to download multimedia:https://www.prnewswire.com/news-releases/lg-offers-three-month-free-trial-for-apple-tv-to-smart-tv-and-lifestyle-screen-owners-302054251.html SOURCE LG Electronics (LG) "
}