{
    "title": "Unsurprisingly, Zuckerberg thinks the Quest 3 is a 'better product' than \nApple's Vision Pro",
    "date": "2/14/2024",
    "url": "https://au.finance.yahoo.com/news/unsurprisingly-zuck-thinks-the-quest-3-is-a-better-product-than-apples-vision-pro-104001890.html",
    "text": "Meta chief Mark Zuckerberg has posted a review of Apple's Vision Pro on Instagram, reminding us all that the rivalry between the two companies has deepened even further with the launch of the latter's mixed reality headset. In the video shot with a Meta Quest 3, Zuckerberg didn't mince words while pitting the Vision Pro against his company's device. He said he originally expected the Quest to be the better value for most people, because it's \"like seven times less expensive\" than the $3,500 Vision Pro. However, after testing his competitor's product, he came to the conclusion that the Quest \"is the better product, period.\" He added that the Quest is \"better for the vast majority of things that people use mixed reality for.\" Zuckerberg said he thinks the Quest is \"a lot more comfortable,\" since Meta designed it to be light and portable, so that people could use it while moving around or even while hanging out with friends and socializing. He found the Quest's field of view to be wider and its screen to be brighter than the Vision Pro, and he also found that Meta's headset showed crisper visuals when he moved his head while wearing it. Apple's device, he said, had motion blur. Zuckerberg acknowledged that the Vision Pro has a screen with a higher resolution, but in the same breath, he criticized Apple for the \"tradeoffs\" it had to make to the device's comfort and ergonomics. While Quest's controllers are \"a little more accurate,\" he admits that Apple's eye tracking is \"really nice.\" Apparently, Meta used the Vision Pro's sensors for the Quest Pro but took them out for the Quest 3. The company is planning to bring them back in the future. Of course, Zuckerberg took the chance to talk about the Quest's bigger library and to emphasize that the Quest, unlike the Vision Pro, has access to the YouTube and Xbox apps. Zuckerberg ended his review by talking about open and closed models for every generation of computing and how he wants to make sure that for this generation, Meta's technology, as the open model, \"wins out\" like Microsoft's did in the past. View this post on Instagram A post shared by Mark Zuckerberg (@zuck) A shocking find in the garden has left those online terrified, but wait until you hear what the spider will do next. Find out here. Dark Brandon strikes again.  Kaia Gerber covers V Magazine's Spring 2024 issue wearing multiple braless and topless looks all from Celine by Hedi Slimane including black leather dungarees. While Tom Hanks doesn't regret any role, if he had to choose one it would be this. Centrelink recipients have been reminded of upcoming service centre closures and payment changes. Here’s what you need to know.  From Australia's most tattooed woman to Onlyfans creators like Billie Beever, there's a new adult platform set to take over. Read more. The match review committee has decided on the Taylan May and Reece Walsh incident. The attempted strike on the Engels air base was reported to have been launched by Ukraine’s GUR military intelligence agency  Billy was his usual 'happy self' when he first sat down, but didn't move out of the barber's chair for another three hours. One driver recalled to Yahoo News how he watched the massive effort unfold. A simple test at home revealed the woman was overcharged during her recent shop. Find out why.  \"I remember getting into it.\" The attorney general files notice of the ex-president’s fraud judgment in Westchester County, home of his golf club and Seven Springs estate You'll have to be earning well above the average to ensure you can comfortably afford your repayments. 2024 Subaru Crosstrek Review, Pricing, and Specs ‘This is what happens when the citizenship hits the fan’ CHOICE's hot cross bun connoisseurs put their taste buds to the test, sampling almost 30 varieties of hot cross buns to pick the best of the best. Find out more. It marks a sad five-year first for the Australian women's cricket team. Read more here.  ‘You can’t make this stuff up,’ someone can be heard saying Legitimate Target Russia has accused the United States of using commercial satellite operators for its intelligence efforts — and is threatening to take them down with its military. The news comes days after Reuters released a report earlier this month, detailing a classified contract that SpaceX signed with a US intelligence agency to launch hundreds […] \"I'm just gonna go through all the things that I've done because I feel like there's this stigma and I'm not going to win,\" Megan said on Call Her Daddy. "
}