{
    "title": null,
    "date": "2/22/2024",
    "url": "https://finance.yahoo.com/news/11-best-magic-formula-stocks-084817204.html",
    "text": "In this piece, we will take a look at the 11 best magic formula stocks to buy now. If you want to skip our coverage of what magic formula investing is all about, then you can take a look at the 5 Best Magic Formula Stocks to Buy Now. Considering the thousands of companies that trade on stock markets such as the NASDAQ and the NYSE as well as the plethora of information that investors are bombarded with every day, investing sometimes appears as nothing short of wizardry. For novices, terms such as relative strength indexes (RSIs), standard deviations of returns, beta, earnings per share, yields, and other metrics appear to be a new language that requires a detailed study before one can become comfortable with it. One investor who literally describes his investment strategy as 'magic' is Joel Greenblatt. Mr. Greenblatt is the chief investment officer of the ominously named Gotham Asset Management. While his investment decisions focus mostly on making returns for investors rather than fighting crime, Mr. Greenblatt's approach has nevertheless won him more fame in financial markets than Bruce Wayne. He set up Gotham Asset Management in 2008, which makes the fund relatively younger when compared to some other funds that have been around for decades. However, before Gotham Asset Management, the Magic Formula investor was at the helm of the fund Gotham Capital. He set up Gotham Capital in 1985, and the fund successfully focused on investing in distressed or 'special situation' companies and stocks. These stocks are of firms that might be facing troubles in managing their debt, or they might be struggling in their markets due to choices made of their own accord or broader macroeconomic factors. Mr. Greenblatt's Gotham Capital was one of the top performing funds in its league back in the mid 80s and 90s as it delivered net 30% returns during the time periods. Like some other hedge fund and investing heavyweights like Warren Buffett of Berkshire Hathaway and Seth Klarman of Baupost Group, Mr. Greenblatt is also an adherent of one of Wall Street's best known investment approaches. If you haven't guessed it already, this approach is called Value Investing. Value investing simply analyzes a stock to compute what the investor believes is a fair value of the shares. This value is then compared to the market price of the stock, and if it's higher than the market price, then a potential investment decision is made. This investment decision is also influenced by the difference between fair and market values. The higher this difference is, the more comfortable an investor is buying the shares as it leaves a greater 'margin of safety' for non fundamental downward share price movements. So where's the magic? Well, Mr. Greenblatt's flavor of value investing is called Magic Formula investing. This strategy is based on the two fundamental metrics of share price and stock valuation. These are the Return on Capital Employed (ROCE) and the earnings yield. For the uninitiated, the ROCE divides a firm's operating income by the sum of its working capital and net fixed assets. The logic behind this computation is that the ROCE measures the return to investors over the costs of doing business as measured by buying and selling inventory and spending on assets. The earnings yield of a stock is its earnings per share divided by the share price, and it enables investors to understand the true post expenses, tax, and interest ability of their investment to make money. In Magic Formula investing, the ROCE and earnings yield of stocks are calculated first. They are then ranked according to these metrics, and the top shares are bought and held for the long term to benefit from a firm's ability to capitalize on its assets and cash to turn a profit and return for investors. So what are some magic formula stocks that can deliver magical returns? We took a look today, and some top stock picks are Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and Snowflake Inc. (NYSE:SNOW). Rommel Canlas/Shutterstock.com Our Methodology To make our list of the best magic formula stocks to buy now, we scanned the Q4 2023 investment portfolio of Joel Greenblatt's Gotham Asset Management and picked out the top holdings in U.S. dollar terms. For these best magic formula stocks, we used hedge fund sentiment. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this often-ignored indicator. Number of Hedge Fund Investors As Of Q4 2023 end: 117 Gotham Asset Management's Q4 2023 Stake: $22 million Berkshire Hathaway Inc. (NYSE:BRK-A) is the famed investment management company of Warren Buffett that also has the honor of being the most expensive stock on the U.S. markets. Yet, the future is quite rosy, as analysts have set an average share price target of $632,500. During last year's fourth quarter, 117 out of the 910 hedge funds covered by Insider Monkey's research had invested in Berkshire Hathaway Inc. (NYSE:BRK-B). Out of these, the biggest investor was Michael Larson's Bill & Melinda Gates Foundation Trust as it owned 19.9 million shares that were worth $7.1 billion. Number of Hedge Fund Investors As Of Q4 2023 end: 85 Gotham Asset Management's Q4 2023 Stake: $22.8 million Exxon Mobil Corporation (NYSE:XOM) is a well known American oil and gas company that is one of the biggest of its kind in the world. The shares are rated Buy on average and the average analyst share price target is $124.89. For their fourth quarter of 2023 shareholdings, 85 out of the 933 hedge funds tracked by Insider Monkey were the firm's shareholders. Exxon Mobil Corporation (NYSE:XOM)'s largest shareholder among these is Ken Fisher's Fisher Asset Management as it owns $1.3 billion worth of shares. Along with Apple Inc. (NASDAQ:AAPL), Microsoft Corporation (NASDAQ:MSFT), and Snowflake Inc. (NYSE:SNOW), Exxon Mobil Corporation (NYSE:XOM) is a top magic formula stock to buy. Number of Hedge Fund Investors As Of Q4 2023 end: 81 Gotham Asset Management's Q4 2023 Stake: $25.1 million Johnson & Johnson (NYSE:JNJ) is one of the biggest healthcare and personal well being companies in the world. It makes and sells a variety of products that include off the shelf beauty products and vaccines. 2024 is proving to be a crucial and interesting month for the firm, as after its CEO was grilled by Senators for high drug prices, an incorrect media report claimed that a Johnson & Johnson (NYSE:JNJ) frostbite drug had secured FDA approval. After digging through 933 hedge funds Q4 2023 investment portfolios, Insider Monkey discovered that 81 had bought Johnson & Johnson (NYSE:JNJ)'s shares. Ken Fisher's Fisher Asset Management owned the biggest stake which was worth $996 million. Number of Hedge Fund Investors As Of Q4 2023 end: 91 Gotham Asset Management's Q4 2023 Stake: $28.5 million Broadcom Inc. (NASDAQ:AVGO) is a semiconductor company whose products enable connectivity in wireless gadgets and wireless devices. The firm scored a big win on the A.I. front in February 2024 when its CEO joined Meta's board to deepen the pair's partnership for networking chips. As of December 2023 end, 91 out of the 933 hedge funds profiled by Insider Monkey were the firm's shareholders. Broadcom Inc. (NASDAQ:AVGO)'s largest hedge fund investor is Ken Fisher's Fisher Asset Management due to its $2.3 billion investment. Number of Hedge Fund Investors As Of Q4 2023 end: 173 Gotham Asset Management's Q4 2023 Stake: $34.9 million NVIDIA Corporation (NASDAQ:NVDA) is a semiconductor designer that is best known for its graphics processing units (GPUs). These have also propelled it right at the top of the artificial intelligence food chain, and thanks to the expected booming demand for NVIDIA Corporation (NASDAQ:NVDA)'s GPUs, the shares are up by a whopping 231% over the past 12 months. By the end of last year's fourth quarter, 173 out of the 933 hedge funds polled by Insider Monkey had invested in NVIDIA Corporation (NASDAQ:NVDA). Out of these, the biggest investor was Rajiv Jain's GQG Partners through its $6.8 billion investment. NVIDIA Corporation (NASDAQ:NVDA), Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and Snowflake Inc. (NYSE:SNOW) are some top magic formula stocks. Number of Hedge Fund Investors As Of Q4 2023 end: 242 Gotham Asset Management's Q4 2023 Stake: $34.98 million Meta Platforms, Inc. (NASDAQ:META) is one of the biggest social media and communications companies in the world. The high technology mindset of its chief Mark Zuckerberg is serving the firm well these days, with Zuckerberg sharing in January 2024 that Meta Platforms, Inc. (NASDAQ:META) will buy hundreds of thousands of NVIDIA's latest GPUs this year to beef up its A.I. computing capabilities. 242 out of the 933 hedge funds part of Insider Monkey's Q4 2023 database had bought the firm's shares. The largest Meta Platforms, Inc. (NASDAQ:META) shareholder is Rajiv Jain's GQG Partners as it holds $3.9 billion worth of shares. Click here to continue reading and check out 5 Best Magic Formula Stocks to Buy Now. Suggested articles: 13 High Growth Healthcare Stocks to Buy 11 Best Natural Gas Dividend Stocks To Buy 10 Stocks Receiving a Massive Vote of Approval From Wall Street Analysts Disclosure: None. 11 Best Magic Formula Stocks to Buy Now is originally published on Insider Monkey. Related Quotes "
}