{
    "title": "Apple is still working on foldable iPhones and iPads",
    "date": "2/7/2024",
    "url": "https://www.theverge.com/2024/2/7/24064617/apple-foldable-iphone-ipad-rumor-z-flip-5",
    "text": "By  Emma Roth, a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO. Apple may have just released the Vision Pro, but it hasn’t forgotten about making foldable iPhones and iPads. A new report from The Information reveals the company is developing “at least two” iPhone prototypes that fold horizontally, similar to Samsung’s Galaxy Z Flip devices. We are unlikely to see a folding iPhone anytime soon, if at all, as The Information reports the device isn’t in the company’s mass production plans for 2024 or 2025. Even though the company reportedly wants to create a foldable iPhone with displays on the outside of the device, The Information says engineers “struggled” with the design because it can break easily. Additionally, engineers also reportedly want to develop a foldable that’s “as thin as current iPhone models,” but battery sizes and display components make this a challenge. So far, Apple has spoken with “at least one” manufacturer in Asia about procuring parts for foldable iPhones of different sizes, The Information reports. Work is still underway on Apple’s long-rumored folding iPad, too. According to The Information, Apple is looking into developing a folding tablet that’s around the same size as an iPad Mini with an eight-inch display. Apple engineers working on the product are reportedly in the process of trying to reduce the crease that appears in the center of the display and also want to develop a hinge that allows the display to lie flat when unfolded. It’s still not clear when Apple could release a folding iPad, either, but a recent report from The Elec suggests Apple is readying a seven- or eight-inch device for 2026 or 2027. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}