{
    "title": "European Commission reportedly set to fine Apple $539M for antitrust \nviolations",
    "date": "2/18/2024",
    "url": "https://siliconangle.com/2024/02/18/european-commission-reportedly-set-fine-apple-539m-antitrust-violations/",
    "text": "UPDATED 18:08 EST / FEBRUARY 18 2024 by \nDuncan Riley The European Commission, the executive branch of the European Union, is reportedly preparing to fine Apple Inc. €500 million ($539 million) for allegedly breaking EU law by restricting access to competitors to favor Apple Music on the iPhone. The Financial Times, citing five people with direct knowledge of an antitrust investigation into Apple, said the fine is expected to be announced early next month and is the culmination of a European Commission antitrust probe into whether Apple used its own platform to favor its services. The investigation goes back to 2019 when Spotify Technology SA filed an antitrust complaint claiming that Apple was unevenly enforcing App Store policies in a way that tilts the playing field against rivals. Among Spotify’s claims were that Apple unfairly discriminated against other music services by taking a 30% cut from purchases in the app store while not imposing the same requirement on companies such as Uber Technologies Inc. Spotify also alleged that when developers choose not to use Apple’s in-app payment system, they were then hit with an additional set of restrictions from Apple. Apple prohibited developers that don’t use IAP from promoting paid offerings such as subscriptions inside their apps. Under the policy, iOS apps couldn’t display any buttons or links that lead to external product pages, even if those pages are only informational in nature. Fast forward to 2022 and it was reported that the EC said that Apple’s requirement to restrict streaming apps to making in-app purchases only through Apple’s IAP payment processing system was essentially raising prices. Along with the fine, the FT report claims that the commission will rule that Apple’s actions are illegal and go against the bloc’s rules that enforce competition in the single market. Further, it’s claimed that Apple will be accused of abusing its powerful position and imposing anticompetitive trading practices on its rivals. The ruling will ban Apple’s practice of blocking music services from letting users outside its App Store switch to cheaper alternatives. This isn’t the first time Apple has been investigated over allegedly dubious business practices. The U.K. announced in March 2021 that it had launched an investigation into Apple on similar grounds and Apple may also soon face antitrust charges closer to home, with a report in January claiming that the U.S. Department of Justice was considering filing a broad antitrust lawsuit against Apple in the first half of 2023. THANK YOU Blockchain-focused cryptography startup Zama raises $73M to protect data in use Bipartisan bill could see TikTok banned in US if it doesn’t split with China OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions Taalas raises $50M to develop chips optimized for specific AI models Claroty secures $100M to enhance cyber-physical system security Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research Blockchain-focused cryptography startup Zama raises $73M to protect data in use SECURITY - BY MIKE WHEATLEY . 3 HOURS AGO Bipartisan bill could see TikTok banned in US if it doesn’t split with China POLICY - BY JAMES FARRELL . 6 HOURS AGO OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions AI - BY MIKE WHEATLEY . 8 HOURS AGO Taalas raises $50M to develop chips optimized for specific AI models AI - BY MARIA DEUTSCHER . 9 HOURS AGO Claroty secures $100M to enhance cyber-physical system security SECURITY - BY DUNCAN RILEY . 9 HOURS AGO Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research AI - BY MARIA DEUTSCHER . 10 HOURS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}