{
    "title": "Apple Boosts iMessage Security to Fend Off Quantum Computing Attacks",
    "date": "2/21/2024",
    "url": "https://au.finance.yahoo.com/news/apple-boosts-imessage-security-fend-140000003.html",
    "text": "(Bloomberg) -- Apple Inc. is upgrading the security of its iMessage app, aiming to fend off a looming future threat: advanced quantum computing attacks. Most Read from Bloomberg BYD’s New $233,450 EV Supercar to Rival Ferrari, Lamborghini Jack Ma-Backed Ant Outbids Citadel Securities for Credit Suisse’s China JV Norwegian Cruise Ship Halted at Mauritius Due to Outbreak Zelenskiy Says 31,000 Troops Killed as Ukraine Seeks US Aid Decision Within Month The changes will be part of a new system called PQ3, Apple said on Wednesday. It’s a more advanced type of encryption that could thwart attacks from quantum computers — still-nascent technology that can perform calculations exponentially faster than traditional machines. The fear is that these computers could someday have the power and mathematical capabilities to break through today’s tools for encrypting messages. The new security protocol has already been added to beta versions of iOS 17.4, iPadOS 17.4, macOS 17.4 and watchOS 10.4, which will roll out to all users in the coming weeks. It will replace the current security protocols for all iMessage chats by the end of the year. Though hackers don’t currently have quantum computers, they could conduct what’s known as a “harvest now, decrypt later” attack. That means they steal messaging data today and then use a more advanced computer in the future to break the encryption. Apple said its new system is designed to prevent that. The warnings about quantum computing attacks have been dire. International Business Machines Corp. executive Ana Paula Assis has said that they’ll cause a “cybersecurity Armageddon.” SandboxAQ Chief Executive Officer Jack Hidary said that such computers will be available by the end of the decade and cause a “train wreck” for security. Governments are also getting involved, with the US Senate passing a bill two years ago to address the threat. Apple said that PQ3 “has the strongest security properties of any at-scale messaging protocol in the world.” The company sees the defenses as more powerful than those of messaging app Signal, which has long been known as the gold standard for encrypted communications. Apple considers its new system to be at a Level 3 of security, while it puts Signal at Level 2. The prior protocol for iMessage ranked as a Level 1, in Apple’s view, the same level as Meta Platforms Inc.’s WhatsApp. Other popular messaging apps — like Telegram, Skype, QQ and WeChat — sit below that, according to Apple’s analysis of messaging app security. The company also said its current Contact Key Verification system, which allows users to verify that they’re actually communicating with the intended person, is coming to its Vision Pro headset. The change will be included with the visionOS 1.1 software update. Users with the feature enabled on their Apple devices previously had to disable it to send messages on the Vision Pro. Most Read from Bloomberg Businessweek Elon Musk’s Vegas Tunnel Project Has Been Racking Up Safety Violations The High Cost of Eating Out in America Why Elon Musk Bought Twitter in the First Place Can the Masters of Hipster Cringe Conquer Hollywood With Wall Street Cash? How Capital One’s $35 Billion Discover Merger Could Affect Consumers ©2024 Bloomberg L.P. A simple test at home revealed the woman was overcharged during her recent shop. Find out why. People everywhere can't believe this simple little trick is already built into most people's phones.  China risks alienating much-needed foreign investment should it hit back against the US over a potential ban on TikTok, its social media success story. A young woman has shared her 'dangerous' experience with a rideshare driver and was shocked at how many other women have experienced the same thing. Noland Arbaugh, 29, is paralysed below the shoulders but he has now been able to control a PC using just his mind. 連續13日閃購，PS5 Slim、Marshall、Switch OLED、AirPods Pro 2、DJI等人氣產品平到笑！ An editorial by a former education minister calling to \"ration the Internet\" to 3GB a week has sparked controversy in France. Noland Arbaugh, who is paralysed below the shoulders, received a chip implant in January. Epic Games has received some significant support in its battle against the fee Apple is charging for iOS payments made outside of the App Store. Meta, Microsoft, X and Match Group filed a petition stating that \"The Apple Plan comports with neither the letter nor the spirit\" of a court ruling. 為本地學士及研究院課程學生提供保險公司或專業中介公司的中後勤職位實習，體驗行業實況，了解發展前景並累積工作經驗。實習期為6月至8月，實習生可獲僱主發放每月酬金，立即報名！ The U.S. Department of Justice on Thursday sued Apple, the first major antitrust effort against the iPhone maker by the Biden administration, alleging it monopolized smartphone markets.  Apple joins a list of major tech companies sued by U.S. regulators, including Alphabet's Google, Meta Platforms and Amazon.com across the administrations of both former President Donald Trump and President Joe Biden.  \"Consumers should not have to pay higher prices because companies violate the antitrust laws,\" Attorney General Merrick Garland said in a statement. You can now do almost anything with the click of a button on your smartphone, from ordering groceries to finding a date to booking a vacation. And many people are filing their taxes from their phones... In this article, we will list the 8 best AirTag alternatives that are actually worth buying. If you want to skip our discussion about smart trackers, go to the 3 Best AirTag Alternatives That Are Actually Worth Buying. Smart Bluetooth Trackers like Apple’s AirTags are emerging as pivotal components in an era of technological advancements. […]  Every enterprise software company out there is working to bring more workflow automation and AI to the platform.  ServiceNow has been on this journey for some time now, and given the kind of data it collects via interactions on its platform, it’s building more refined models.  Part of the shift to AI comes internally by building, some via acquisitions and some from partnering widely, says SVP of corporate business development Philip Kirk. A shocking find in the garden has left those online terrified, but wait until you hear what the spider will do next. Find out here. Centrelink recipients have been reminded of upcoming service centre closures and payment changes. Here’s what you need to know. 本月入主FORD RANGER XLT現金價129.9萬，再送Coleman露營精選組 From Australia's most tattooed woman to Onlyfans creators like Billie Beever, there's a new adult platform set to take over. Read more. The match review committee has decided on the Taylan May and Reece Walsh incident. Andrew Weissmann also suggested the \"real issue\" behind the former president's struggles to secure bond to appeal his civil fraud conviction.  One driver recalled to Yahoo News how he watched the massive effort unfold. \"I remember getting into it.\" You'll have to be earning well above the average to ensure you can comfortably afford your repayments. "
}