{
    "title": "Apple CEO hints at major AI announcements later this year: Details here",
    "date": "2/2/2024",
    "url": "https://www.techlusive.in/news/apple-ceo-hints-at-major-ai-announcements-later-this-year-details-here-1457649/",
    "text": "Follow Us on Edited By: Om Gupta Published: Feb 02, 2024, 07:18 AM IST Apple CEO Tim Cook has teased some of the company’s upcoming plans for artificial intelligence, saying that he is “excited to share the details” of its work in that area later this year.\n\n\n\n\n\n\n READ MORE\nUS sues Apple for monopolising smartphone market using iPhones Cook made the remark during the company’s quarterly earnings call on Thrusday, where he also reported record revenue and profit for the first quarter of 2024.\n\n\n\n\n\n\n READ MORE\nHow to uninstall apps on your iPhone, iPad The comment fuelled speculation that Apple is preparing to unveil a major overhaul of its AI capabilities, especially for its iOS devices, at its annual Worldwide Developers Conference (WWDC) in June.\n\n\n\n\n\n\n\n READ MORE\niPhone 16 may have the thinnest bezel on an iPhone yet According to reports, Apple is working on iOS 18, which will feature comprehensive AI features powered by its own large language model, codenamed Ajax. The model is said to be similar to ChatGPT, a popular generative AI system developed by OpenAI. Apple is also expected to use AI to improve Siri, its voice assistant, which has lagged behind rivals like Google Assistant and Amazon Alexa in terms of functionality and accuracy. A new version of Siri, dubbed Siri 2.0, could leverage Ajax to offer more natural and conversational interactions with users. In addition, Apple is reportedly planning to roll out AI features across the iPhone operating system, such as smart replies in Messages, playlist recommendations in Apple Music, and more. Cook’s statement seemed to be a response to some critics who have accused Apple of falling behind in the AI race, as competitors like Microsoft and Google have launched generative AI features in their products and services. Meanwhile, a recent leak indicates that the only new feature in the iPhone 16 series will be an additional button. This Capture Button, the sole significant enhancement to the iPhone’s design, will provide users with direct access to the iPhone cameras. This implies that the much-anticipated redesign, including a foldable form factor, will not materialize in 2024. In his most recent report, esteemed analyst Ming-Chi Kuo stated that the iPhone 16 series will not undergo any major changes. This includes the absence of generative AI capabilities, which competitors like Google and Samsung have begun to incorporate into their latest devices. Kuo predicts that Apple is unlikely to roll out “more comprehensive” AI functionalities until the iPhone 17 series. Author Name | Om Gupta  ₹23,890 ₹9,999 ₹19,999 ₹75,999 By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site \nnavigation, analyze site usage, and assist in our marketing efforts. Cookie Policy Select Language "
}