{
    "title": "Apple won't have another 'iPhone moment' with electric cars",
    "date": "2/28/2024",
    "url": "https://www.morgancountycitizen.com/arena/thestreet/apple-wont-have-another-iphone-moment-with-electric-cars/article_a35ba49b-0e28-51df-a59b-a18ef2578da6.html",
    "text": "             Please purchase a subscription to read our premium content. If you have a subscription, please log in or sign up for an account on our website to continue. Your current subscription does not provide access to this content.       Remy Blaire brings the latest business headlines from the floor of the New York Stock Exchange as markets open for trading Wednesday, February 28. Related: Analyst says Apple's latest move is a positive for Elon Musk's Tesla REMY BLAIRE: I'm Remy Blaire, reporting from the New York Stock Exchange. Here's what we're watching on TheStreet today. Stocks are coming off a mixed session as investors continue to digest the latest batch of quarterly results. So far, over 80 percent of companies in the S&P 500 have released earnings, with 75 percent beating Wall Street expectations. Investors are looking ahead to the P-C-E report, which is the Fed's preferred gauge on inflation out Thursday, and several Fed speakers on Friday. Traders will be monitoring for clues into the Fed's next move on interest rates. Meanwhile, Apple is pulling the plug on its electric car venture. According to several media reports citing internal sources, the tech giant has decided to cancel its most ambitious project known internally as 'Project Titan' after ten years of development. While Apple never confirmed it was making a car, it's estimated that the project cost the company billions of dollars, with over 2,000 employees assigned. Those employees will reportedly be moved to Apple's A-I division. Analysts expected the vehicle to be priced at around $100,000 and saw it as a rival to Tesla's higher-end cars. This news comes as electric vehicle sales continue to slump, with several major automakers across the globe pulling back on investments, slashing production forecasts, and cutting prices. That'll do it for your daily briefing. From the New York Stock Exchange, I'm Remy Blaire with TheStreet.      Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language.\nPLEASE TURN OFF YOUR CAPS LOCK.\nDon't Threaten. Threats of harming another\nperson will not be tolerated.\nBe Truthful. Don't knowingly lie about anyone\nor anything.\nBe Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person.\nBe Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts.\nShare with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Please purchase a subscription to read our premium content. If you have a subscription, please log in or sign up for an account on our website to continue. Last week, a special feature was published of tips on how to save at the grocery store. The goal is to cut costs on items you are already purchasing, but make it simple. \n\nSaving Money on a Weekly Grocery Trip Can Be Easy! Here's How\n\nThe items pictured were actual purchases and the last photo highlighted additional deals, at both Kroger and Publix, that may be beneficial to the majority. \n\nDid you find this helpful? Let us know in the comments how it was helpful and/or how it can be improved! Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: "
}