{
    "title": null,
    "date": "2/13/2024",
    "url": "https://9to5mac.com/2024/02/13/apple-designer-leaving-cost-cutting-unrest/",
    "text": "Bloomberg reports that Apple’s longest-running senior designer, Bart Andre, is retiring. As the story explains, Andre joined Apple in 1992 with Jonny Ive. His departure marks “the near-complete turnover” of Ive’s former design team. Andre announced his plans to retire this month. His departure is a significant shakeup to Apple’s industrial design team, but only the latest in a series of changes and departures. Andre is described as being “one of Ive’s top lieutenants” and is credited with helping run Apple’s industrial design team after Evans Hankey departed in 2023. “He’s also known as one of the biggest holders of Apple patents,” Bloomberg reports. Bart Andre, who joined Apple in 1992 alongside Ive, told colleagues this month that he is retiring, according to people familiar with the matter. Andre was one of the last remaining designers from the Ive era and helped create the aesthetic for Apple products released over the past three decades — even prior to Steve Jobs returning to the helm in the late 1990s. As it stands right now, Apple’s industrial design team is led by chief operating officer Jeff Williams. “Having an operations person oversee a division dedicated to design and innovation has rankled some staff,” Bloomberg says, according to “people close to the situation.” ”Cost-cutting measures also have added to the unrest, they said. Under Ive, the team embarked on exploratory projects that didn’t necessarily have an immediate payoff – something that’s been reigned in.” The full report is available at Bloomberg. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Chance is an editor for the entire 9to5 network and covers the latest Apple news for 9to5Mac. Tips, questions, typos to chance@9to5mac.com "
}