{
    "title": "Microsoft announces AI Odyssey initiative to train developers in India: How \nand who all can enroll | Mint",
    "date": "1/8/2024",
    "url": "https://www.livemint.com/ai/microsoft-announces-ai-odyssey-initiative-to-train-developers-in-india-heres-how-and-who-all-can-enroll-11704718866487.html",
    "text": "Microsoft has unveiled a new initiative, the AI Odyssey, designed to equip 1,00,000 developers in India with AI technologies and tools. The program, announced today, is aimed at providing a learning experience for developers to gain and showcase essential skills in executing pivotal projects aligned with business objectives using AI technologies. Interested developers can participate in the month-long AI Odyssey program by registering on aka.ms/AIOdyssey and accessing the learning modules and resources provided. The program is open to AI enthusiasts across India, irrespective of their experience level or background. Comprising two levels, the first phase of the program focuses on educating participants on utilizing Azure AI services to create and deploy AI solutions for diverse scenarios. This level provides participants with access to valuable resources, code samples, and guides aimed at mastering practical AI skills. The second level of the program presents participants with a challenge to validate their AI expertise through an online assessment featuring interactive lab tasks. Successful completion of both levels earns participants the Microsoft Applied Skills credentials—a verifiable credential attesting to their capability to solve real-world problems using AI. Furthermore, participants completing both program levels stand a chance to win a VIP Pass to attend the Microsoft AI Tour in Bangalore on February 8, 2024. The AI Tour promises to showcase the revolutionary impact of generative AI, featuring keynote sessions, demos, workshops, and opportunities for developers to learn from Microsoft experts and partners while networking with peers. Irina Ghose, Managing Director of Microsoft India, expressed enthusiasm for the initiative, stating, \"AI is the future of innovation, and India is leading the way with its tech talent. The Microsoft Applied Skills credential will help developers demonstrate their competence and creativity in the most in-demand AI skills and scenarios.\" Ghose encourages developers to join the endeavor, emphasizing the goal of creating meaningful AI solutions that contribute to India's economy.  Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}