{
    "title": null,
    "date": "1/16/2024",
    "url": "https://www.fool.co.uk/2024/01/16/can-vodafones-1-5bn-ai-deal-with-microsoft-move-the-share-price/",
    "text": "Vodafone signs $1.5bn Microsoft deal for AI, cloud and IoT and the move could help to drive the share price higher over time. The content of this article was relevant at the time of publishing. Circumstances change continuously and caution should therefore be exercised when relying upon any content contained within this article. Image source: Getty Images When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More. The Vodafone (LSE: VOD) share price has been languishing at what looks like a low valuation for ages. Ex-growth and unloved, the stock has been locked in a strong downtrend driven by volatile earnings. On top of that, the firm’s huge debt-pile could have been adding to investors’ concerns. However, today (16 January), the company made an announcement proving there may still be some life in the old dog. The telecoms provider said it’s signed a 10-year strategic partnership with Microsoft and will invest $1.5bn over 10 years in cloud and customer-focused artificial intelligence (AI) services co-developed by the two firms. Also, Microsoft will use Vodafone’s fixed and mobile connectivity services. The aim of the collaboration is to supply AI, digital services and the cloud “to more than 300m businesses and consumers”. The plan is to “transform” the customer experience using Microsoft’s generative AI. On top of that, Vodafone will scale its new standalone internet of things (IoT) business with Microsoft. The partnership will seek to expand digital services in Africa and Europe. Vodafone aims to grow enterprise turnover with new Microsoft services for small and medium-sized businesses. Part of the plan involves Vodafone accelerating digital transformation and operational efficiencies by migrating virtual data centres to Microsoft Azure. It’s quite a far-reaching tie-up between the two companies. Vodafone’s chief executive, Margherita Della Valle, said: “Today, Vodafone has made a bold commitment to the digital future of Europe and Africa.” Meanwhile, chairman and chief executive of Microsoft, Satya Nadella, added: “This new generation of AI will unlock massive new opportunities for every organisation and every industry around the world.” These are visionary statements from the top people. But it has to be said, the market was underwhelmed by the news with Vodafone’s share price barely moving on the day. For now, the well-established downward trend for the stock is still firmly in place. So let’s forget the hype for a few moments and look at the reality of shareholder dividends. In a nutshell, there’s something to be concerned about its record. Since 2018, the dividend payment has halved and the compound annual growth rate of the shareholder payment is minus 10% — ouch! Meanwhile, with the share price near 67p, the forward-looking dividend yield for the trading year to March 2025 is around 11%. At first glance, a yield that high may seem attractive. But I see ultra-high yields as more of a warning than an opportunity. In this case, the woeful dividend record, patchy earnings and the falling share price all seem to back up a cautious stance. There’s no doubt Vodafone has been ex-growth for some considerable time. However, the business does not look much like a solid back-up for the dividend either. It’s possible this new tie-up with Microsoft to enhance Vodafone’s prospects going forward. However, the telecoms firm has a lot of work to do to turn around and stabilise its business. For the time being, I’m cautious about Vodafone despite today’s announcement.  Should you invest, the value of your investment may rise or fall and your capital is at risk. Before investing, your individual circumstances should be assessed. Consider taking independent financial advice. Kevin Godbold has no position in any of the shares mentioned. The Motley Fool UK has recommended Microsoft and Vodafone Group Public. Views expressed on the companies mentioned in this article are those of the writer and therefore may differ from the official recommendations we make in our subscription services such as Share Advisor, Hidden Winners and Pro. Here at The Motley Fool we believe that considering a diverse range of insights makes us better investors. 25 March, 2024 |\n        Jon Smith Jon Smith outlines a FTSE 250 stock from the financial services sector that has a dividend forecast almost double the… Read more » 25 March, 2024 |\n        Zaven Boyrazian, MSc Teladoc Health's had a pretty rough ride over the last two years and now trades close to 2016 levels. But… Read more » 25 March, 2024 |\n        Zaven Boyrazian, MSc The FTSE 250 is leading the charge among UK indexes, rising by double-digits in the last six months. But this… Read more » 25 March, 2024 |\n        Zaven Boyrazian, MSc Zaven Boyrazian breaks down two dividend shares that have rewarded shareholders with higher payouts for more than 25 years. Read more » 25 March, 2024 |\n        Zaven Boyrazian, MSc Rolls-Royce shares have almost tripled in the last 12 months, but can this upward trajectory propel the stock above £5… Read more » 25 March, 2024 |\n        Zaven Boyrazian, MSc Around 25% of the FTSE 350 offers market-beating dividend yields! But which ones are sustainable in the long run? Zaven… Read more » 25 March, 2024 |\n        Zaven Boyrazian, MSc Zaven Boyrazian explores what’s happening with the collapsing Reckitt Benckiser share price and whether now's the time to buy the… Read more » 25 March, 2024 |\n        Ben McPoland Might investing in NIO stock at its current price make this Fool a fortune? Or are shares in this Chinese… Read more » View All When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. Tax treatment depends on your individual circumstances and may be subject to future change. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. Read more about us >  We have taken reasonable steps to ensure that any information provided by The Motley Fool Ltd, is accurate at the time of publishing. Any opinions expressed are the opinions of the authors only. The content provided has not taken into account the particular circumstances of any specific individual or group of individuals and does not constitute personal advice or a personal recommendation. No content should be relied upon as constituting personal advice or a personal recommendation, when making your decisions. If you require any personal advice or recommendations, please speak to an independent qualified financial adviser. No liability is accepted by the author, The Motley Fool Ltd or Richdale Brokers and Financial Services Ltd for any loss or detriment experienced by any individual from any decision, whether consequent to, or in any way related to the content provided by The Motley Fool Ltd; the provision of which is an unregulated activity. The value of stocks, shares and any dividend income may fall as well as rise and is not guaranteed, so you may get back less than you invested. You should not invest any money you cannot afford to lose, and you should not rely on any dividend income to meet your living expenses. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, administrative costs, withholding taxes and different accounting and reporting standards. They may have other tax implications, and may not provide the same, or any, regulatory protection. Exchange rate charges may adversely affect the value of shares in sterling terms, and you could lose money in sterling even if the stock price rises in the currency of origin. Any performance statistics that do not adjust for exchange rate changes are likely to result in an inaccurate portrayal of real returns for sterling-based investors. Fool and The Motley Fool are both trading names of The Motley Fool Ltd. The Motley Fool Ltd is an appointed representative of Richdale Brokers & Financial Services Ltd who are authorised and regulated by the Financial Conduct Authority (FCA) (FRN: 422737). We publish information, opinion and commentary about consumer credit products, loans, mortgages, insurance, savings and investment products and services, including those of our affiliate partners. The Motley Fool Ltd. Registered Office: 5 New Street Square, London EC4A 3TW. | Registered in England & Wales. Company No: 3736872. VAT Number: 188035783. © 1998 – 2024 The Motley Fool. All rights reserved. The Motley Fool, Fool, and the Fool logo are registered trademarks of The Motley Fool Holdings Inc. "
}