{
    "title": "Microsoft briefly overtakes Apple as world's most valuable company in 2024",
    "date": "1/15/2024",
    "url": "https://www.edgemiddleeast.com/business/microsoft-briefly-overtakes-apple-as-worlds-most-valuable-company-in-2024",
    "text": "Edge Middle East Home » Business » Microsoft briefly overtakes Apple as world’s most valuable company in 2024 Microsoft briefly surpassed Apple as the world’s most valuable company for the first time since 2021. Apple’s weak start to the year, driven by concerns over demand for its products, allowed Microsoft to take the lead. Microsoft’s surge in stock value is attributed to its early investment in generative artificial intelligence, particularly through its association with OpenAI, the creator of ChatGPT. Microsoft’s stock closed 0.5 per cent higher, reaching a market valuation of $2.859 trillion, with a peak of $2.903 trillion during the session. In contrast, Apple’s shares closed 0.3 per cent lower, resulting in a market capitalisation of $2.886 trillion. Microsoft’s incorporation of OpenAI’s technology across its productivity software contributed to a rebound in its cloud-computing business in the July-September quarter. Meanwhile, Apple faced challenges with weakening demand, particularly for the iPhone, and a decline in the Chinese market due to slow economic recovery and increased competition from Huawei. In terms of valuation, Microsoft’s market capitalisation of $2.85 trillion exceeded Apple’s. Both companies have expensive stock valuations based on their share price-to-earnings (PE) ratio. Apple’s forward PE is 28, above its 10-year average of 19, while Microsoft trades around 31 times forward earnings, exceeding its 10-year average of 24. Although Apple’s market capitalisation peaked at $3.081 trillion on Dec. 14, Microsoft has gained momentum, posting a 57 per cent rise in stock value compared to Apple’s 48 per cent at the end of last year. Microsoft has intermittently surpassed Apple as the most valuable company since 2018, with the latest occurrence in 2021 during concerns about COVID-driven supply chain shortages affecting Apple’s stock price. Sign up to our newsletter "
}