{
    "title": "Microsoft CEO Satya Nadella likely to visit India in February, expected to \nmeet AI start-ups: Report",
    "date": "1/29/2024",
    "url": "https://www.businesstoday.in/tech-today/news/story/microsoft-ceo-satya-nadella-likely-to-visit-india-in-february-expected-to-meet-ai-start-ups-report-415278-2024-01-29",
    "text": "Feedback Microsoft CEO Satya Nadella is scheduled to visit India on February 7 and 8, marking his annual trip to the country. This visit is particularly significant as it underscores Microsoft's focus on Artificial Intelligence (AI) and its burgeoning opportunities within the region. The trip follows a series of meetings in June 2023 between Prime Minister Narendra Modi and several high-profile tech CEOs, including Nadella, where they discussed AI's potential and growth prospects. In an internal communication, Puneet Chandok, President of Microsoft India and South Asia, emphasized that Satya Nadella's visit underscores Microsoft's dedication to leveraging technology for broadening opportunities in the country. “AI is playing a game-changing role in shaping ‘India’s Techade’ and will make India and South Asia one of the most exciting markets for technology,” the email said. Nadella's itinerary is expected to include engagements with various stakeholders in the Indian AI landscape. According to a report by Moneycontrol, he is expected to meet with founders of prominent AI startups such as Lightspeed and Peak XV-backed Sarvam, as well as Bhavish Aggarwal's AI startup Krutrim, among others, in Mumbai and Bangalore. These interactions are poised to explore new opportunities and reinforce Microsoft's commitment to leveraging technology for expanding possibilities in India. The emphasis on AI during Nadella's visit aligns with Microsoft's strategic moves over the past year. In 2023, the company announced AI integrations across its Office 365 suite and introduced an AI assistant called Copilot, powered by OpenAI's GPT-4 technology. Furthermore, Microsoft strengthened its partnership with OpenAI by integrating Bing search engine into ChatGPT, positioning itself as a direct competitor to Google. The visit also comes on the heels of organizational changes at OpenAI, where Sam Altman was dismissed from the board. Subsequently, Microsoft welcomed Altman, Brockman, and other OpenAI employees to form a new advanced AI research team under the company, with Altman appointed as the CEO of this team. With AI adoption on the rise, Microsoft anticipates a revenue increase of nearly 15 percent in its fiscal year 2024, outpacing the overall tech sector's growth. During his US visit in June 2023, Prime Minister Narendra Modi engaged in discussions with leading technology executives, including Tim Cook of Apple, Sundar Pichai of Google, and Satya Nadella. A statement from Nadella's office was subsequently released, detailing the outcomes of his meeting with the Prime Minister. “One important topic was the power of technology, particularly Artificial Intelligence, to help improve the lives of Indians. India is home to one of the most vibrant developer and start-up ecosystems in the world, and Microsoft remains deeply committed to the growth of Indian technology - that will impact both India and markets across the globe,” Microsoft had said in a statement. One year ago, CEO Nadella conducted a four-day official visit to India, engaging with essential customers, startups, developers, non-profit organizations, and students during the visit. Also Read: BYJU’S to raise $200 mn from existing investors through rights issue Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}