{
    "title": "Microsoft Tops Apple as World's Most Valuable Company",
    "date": "1/11/2024",
    "url": "https://www.pymnts.com/news/investment-tracker/2024/microsoft-tops-apple-as-worlds-most-valuable-company/",
    "text": "Microsoft’s AI investments have helped it surpass long-time rival Apple as the world’s most valuable company. Shares in the software company climbed early Thursday (Jan. 11) to bring its market value to $2.87 trillion, ahead of that of Apple, the Financial Times (FT) reported. As the morning progressed, the two companies jumped back and forth between the number one and two spots several times, the report said. Microsoft has benefitted from investor enthusiasm in the rise of generative artificial intelligence (AI) technology in the wake of the rising popularity of AI chatbot ChatGPT. Microsoft is the largest backer of OpenAI, the company behind ChatGPT. The FT report argued that Apple — Microsoft’s rival since the rise of personal computers in the 1980s — has been largely left out of the AI craze (or, taking a quieter approach, as PYMNTS argued last summer). The company is also dealing with slowing iPhone sales — especially in China — leading its stock to be downgraded by analysts earlier this year. Meanwhile, PYMNTS on Thursday examined the potential of OpenAI’s new ChatGPT store’s potential as a monetization strategy. The store, which debuted Wednesday (Jan. 10) offers a low-to-no-code platform for users to create customized AI-powered chatbots. The company said in a blog post that its users have already built more than 3 million custom versions of ChatGPT. A major element of the GPT store, similar to Apple’s App Store, is the “leaderboard” it will use to showcase the most popular and most-used GPTs. “Already, the AI developer is featuring GPTs that include personalized hiking trail recommendations from AllTrails, the ability to surface results from 200 million academic papers via Consensus, a way to design presentations and social posts from Canva, and more,” the report said. As PYMNTS CEO Karen Webster has written, for an app store to take off, it needs the same thing Apple and Google needed with their app stores 16 years ago: a critical mass of developers and users. “OpenAI claims to have a lot of both, with 100 million weekly users after only its first year and hundreds (if not thousands) of developers using GPT and its derivatives to create new apps that would ultimately live in a GPT app store,” PYMNTS wrote. We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}