{
    "title": "European Commission is checking whether Microsoft's investment in OpenAI \ncomes under its merger regulation",
    "date": "1/9/2024",
    "url": "https://mspoweruser.com/european-commission-is-checking-whether-microsofts-investment-in-openai-comes-under-its-merger-regulation/",
    "text": "Follow us Share this article Latest news 2 min. read Published on January 9, 2024 published on \n\nJanuary 9, 2024 Share this article Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more The EU Merger Regulation is a legal framework that aims to prevent mergers and acquisitions that would significantly reduce competition in the European Single Market. The European Commission is the authority that enforces this regulation and has the power to approve, block, or impose conditions on proposed transactions. Today, the European Commission announced that it is examining whether Microsoft’s investment in OpenAI, the company that created ChatGPT and other innovative AI tools, might be reviewable under the EU Merger Regulation. The Commission is concerned that Microsoft’s exclusive access to OpenAI’s technology and data could give it an unfair advantage over its rivals and harm consumers. According to various reports, Microsoft has invested a total of $13 billion in OpenAI since 2019, and has integrated some of its models into several of its products and services. Commission’s investigation may lead to several possible outcomes. The outcome of the Commission’s investigation could affect Microsoft’s investment and working relationship with OpenAI in different ways, depending on the degree of intervention and the nature of the remedies imposed by the Commission. For example, the Commission could decide that Microsoft’s investment in OpenAI does not constitute a merger or a concentration of economic power. So,it would not intervene and Microsoft and OpenAI could continue their partnership as before. Or the Commission could decide that Microsoft’s investment in OpenAI does qualify as a merger or a concentration of economic power and can approve, block, or impose conditions on the transaction, depending on its assessment of the impact on competition and consumers. More about the topics: EC, eu, microsoft, openAI Pradeep Viswav Software and Services Expert Pradeep is a Computer Science and Engineering Graduate. He was also a Microsoft Student Partner. He is currently working in a leading IT company. Pradeep Viswav Software and Services Expert Pradeep is a technical manager at a large tech company and a seasoned technology blogger. He reports on software, hardware, industry trends, and more. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}