{
    "title": "Microsoft to lay off 1,900 employees in its gaming division",
    "date": "1/25/2024",
    "url": "https://finance.yahoo.com/news/microsoft-lay-off-1-900-183328491.html",
    "text": "Microsoft will lay off roughly 1,900 people in its gaming division, according to a company memo seen by CNBC. The cuts come in conjunction with Blizzard president Mike Ybarra announcing he would depart the company as well. In the memo, Microsoft Gaming CEO Phil Spencer said that the layoffs were intended to minimize “areas of overlap.” NBC News has not reviewed the memo. In the memo, which was shared in full by CNBC, Spencer called the layoffs \"painful.\" \"The people who are directly impacted by these reductions have all played an important part in the success of Activision Blizzard, ZeniMax and the Xbox teams, and they should be proud of everything they’ve accomplished here,\" Spencer wrote. The move comes just over three months after Microsoft closed its acquisition of video game giant Activision Blizzard, which is best known for the games Call of Duty, Crash Bandicoot, World of Warcraft and Spyro. Microsoft also owns Xbox. Spencer said that the company plans to \"invest in areas that will grow our business and support our strategy of bringing more games to more players around the world.\" \"Although this is a difficult moment for our team, I’m as confident as ever in your ability to create and nurture the games, stories and worlds that bring players together,\" he said. In a post on X, Ybarra, who became president of Blizzard in 2022, thanked everyone “who is impacted today for their meaningful contributions to their teams, to Blizzard, and to players’ lives.” Although Ybarra did not specify how many people had been laid off, he said that it was an “incredibly hard day” and vowed to support those affected by the cuts, adding “this is in no way a reflection on your amazing work.” “To the Blizzard community: I also want to let you all know today is my last day at Blizzard. Leading Blizzard through an incredible time and being part of the team, shaping it for the future ahead, was an absolute honor,” Ybarra wrote. “Having already spent 20+ years at Microsoft and with the acquisition of Activision Blizzard behind us, it’s time for me to (once again) become Blizzard’s biggest fan from the outside.” Activision Blizzard did not immediately respond to requests for comment. A spokesperson for Microsoft declined to comment but confirmed details in The Verge's report, including the contents of an internal memo sent by Microsoft’s game content and studios president, Matt Booty. \"This is a difficult process, but it is one that will best enable Blizzard and Xbox to deliver ambitious games for our players on more platforms and in more places than ever before,\" Booty wrote. He thanked Ybarra, and also noted that Blizzard’s chief design officer, Allen Adham, would also be leaving the company. Adham was one of Blizzard's co-founders. Blizzard will announce its new president next week, Booty wrote. The layoffs come after a brutal year in the gaming industry, during which an estimated 6,500 or more people in the field lost their jobs. Some unofficial trackers suggest the count was significantly higher. Layoffs continued across gaming companies this year — with video game website Kotaku estimating that about 5,800 jobs were cut this month across publishers, developers and other video game-related companies. On Monday, Riot Games, the publisher of the League of Legends and Valorant video games, laid off 530 people. Earlier this month, Twitch, the Amazon-owned video game streaming website, also said it would cut about 500 employees. Popular video game chat software developer Discord, a popular messaging service used by gamers, also confirmed to CNBC that it is laying off 17% of its workforce, which equates to 170 employees, this month. This article was originally published on NBCNews.com "
}