{
    "title": "Move over Apple: Microsoft is now the most valuable publicly traded company",
    "date": "1/13/2024",
    "url": "https://www.ctvnews.ca/business/move-over-apple-microsoft-is-now-the-most-valuable-publicly-traded-company-1.6724651",
    "text": "Microsoft is back on top. After trailing behind Apple for the majority of the past decade, Microsoft is the world’s most valuable publicly traded company as of market close on Friday. The tech giant’s stock (MSFT) closed at US$388.47 a share on Friday, giving it a market capitalization of US$2.89 trillion. Apple’s stock (AAPL) closed at US$185.92 a share, for a market capitalization of US$2.87 trillion. Market capitalization — or market cap — is the total value of all the shares of a publicly traded company. In other words, it’s the market value of the company. Microsoft’s rise to the top comes after the company had a stellar year thanks to its success with generative artificial intelligence. In 2023, the company’s CEO, Satya Nadella, made a multi-billion dollar investment in AI, including commercializing and adding AI tools like ChatGPT into its suite of products before rivals. He even strengthened Microsoft’s ties to ChatGPT maker OpenAI, a major pioneer in the field of artificial intelligence, during a board and leadership upheaval at the smaller company late last year. Apple, meanwhile, is facing a barrage of problems. iPhone sales are slowing in part because of the Chinese government’s reported efforts to restrict purchases (Beijing denies it has put any restrictions in place). That’s helped Chinese smartphone maker Huawei to gain market share. Apple also recently contended with a brief ban from selling the latest Apple Watch models in the United States. Microsoft declined to comment, while Apple did not return CNN’s request for a comment. A so-called “chickenpox party” was at the centre of a recent dispute between a B.C. family and their daycare provider, according to a decision from the Civil Resolution Tribunal.  Elon Musk's X said it's funding legal bills for a Canadian doctor previously chastised by regulators for her tweets about COVID-19.  Family and friends of those still missing after an attack that killed more than 130 people at a suburban Moscow concert hall waited for news of their loved ones as Russia observed a day of national mourning on Sunday.  CTV W5 puts the spotlight on 18-year-old Emily Nash, who appears to be the first Canadian, and among the youngest people in the world, to have a rare but extraordinary super memory.  Italy's one-euro-home sales have been attracting a lot of interest over the past few years, with dozens opting to snap up abandoned properties in some of the country's depopulated towns.  Anne Murray swooped into the Juno Awards to give viewers a hearty East Coast welcome, as host Nelly Furtado added some extra spark to the early festivities.  The young framebuilding bike shop in Montreal Memento Cycles took home the top prize at the Philly Bike Expo for a bike painted in the trans flag colours with hopes of broadening representation in the industry.  Having covered the Vatican for 27 years — that's three popes — Associated Press photographer Andrew Medichini has mastered snapping images of papal pomp.  Kate, the Princess of Wales, and her husband, Prince William, are said to be \"extremely moved\" by the public’s warmth and support following her shocking cancer announcement as tributes continued to pour in Sunday from around the world.  Anne Murray swooped into the Juno Awards to give viewers a hearty East Coast welcome, as host Nelly Furtado added some extra spark to the early festivities.  A so-called “chickenpox party” was at the centre of a recent dispute between a B.C. family and their daycare provider, according to a decision from the Civil Resolution Tribunal.  CTV W5 puts the spotlight on 18-year-old Emily Nash, who appears to be the first Canadian, and among the youngest people in the world, to have a rare but extraordinary super memory.  The young framebuilding bike shop in Montreal Memento Cycles took home the top prize at the Philly Bike Expo for a bike painted in the trans flag colours with hopes of broadening representation in the industry.  Canada's Rachel Homan beat Switzerland's Silvana Tirinzoni 7-5 to win gold at the world women's curling championship.  A nonagenarian did not need medical care after her vehicle crashed into the front of a Tim Horton’s in northwest London Sunday afternoon.  Family and friends of those still missing after an attack that killed more than 130 people at a suburban Moscow concert hall waited for news of their loved ones as Russia observed a day of national mourning on Sunday.  Rep. Alexandria Ocasio-Cortez on Sunday defended accusing Israel of genocide against the Palestinian people and advocating for cuts to U.S. military aid until humanitarian relief flows freely in Gaza.  Observances were held in Poland on Sunday to mark the 80th anniversary of the \"Great Escape,\" an ingenious act of defiance during World War II in which 76 prisoners of war tunneled out of a German prisoner-of-war camp into a snowy forest.  Brazil's federal police Sunday arrested two men suspected of ordering the killing of a popular Rio de Janeiro councilwoman in 2018, a long-awaited step after years of society clamoring for justice.  Poland demanded an explanation from Russia on Sunday after one of its missiles strayed briefly into Polish airspace during a major missile attack on Ukraine, prompting the NATO member to activate F-16 fighter jets.  Italy on Sunday marked the 80th anniversary of one of the most horrific World War II massacres in German-occupied Italy with solemn commemorations and a performance of a symphony honouring the dead.  Greece would 'of course' be interested in purchasing Canada's liquefied natural gas if the resource could be made available to the Mediterranean country, Greek Prime Minister Kyriakos Mitsotakis says.  Threats against politicians have become \"increasingly normalized\" due to extremist narratives prompted by personal grievances and fuelled by misinformation or deliberate lies, warns a newly released intelligence report.  Prominent Canadians, political leaders, and family members remembered former prime minister and Progressive Conservative titan Brian Mulroney as an ambitious and compassionate nation-builder at his state funeral on Saturday.  A so-called “chickenpox party” was at the centre of a recent dispute between a B.C. family and their daycare provider, according to a decision from the Civil Resolution Tribunal.  Despite a brand new hospital and a hefty signing bonus, health officials in Newfoundland and Labrador still haven't recruited the oncologists they need for an expanded cancer care program on the province's west coast.  Layne French was on his way to pick up his parents from the airport when a coughing fit turned into something much worse.  Canadian discount store chain Giant Tiger is warning of a recent cybersecurity breach involving customer’s information.  The question of whether these artificial intelligence-based chatbots are delivering a mental health service or are simply a new form of self-help is critical to the emerging digital health industry — and its survival.  Kris Stewart has her hands full with two rambunctious, 10-week-old kittens after cloning her beloved cat Bear.  Kevin Bacon announced this week to a gym full of students from Utah’s Payson High School, where his iconic movie “Footloose” was filmed, that he will be making an appearance at the school’s final prom.  Anne Murray swooped into the Juno Awards to give viewers a hearty East Coast welcome, as host Nelly Furtado added some extra spark to the early festivities.  Kevin Hart, who rose from the open mics and comedy clubs of his native Philadelphia to become one of the country's most recognizable performers, will receive the Mark Twain Prize for American Humor at a gala performance Sunday at the Kennedy Center for the Performing Arts.  The spike in freight crime comes in lockstep with a ramp-up of more sophisticated, digitally savvy tactics that revolve around identity theft and drain the economy of millions of dollars, as the higher cost of living drives demand for pilfered products.  Recognizing the growing threat of fraud, the Canada Revenue Agency is taking a new approach to raise awareness and educate individuals with the knowledge to steer clear of scams, using a unique and interactive escape room.  The CEO of Flair Airlines says the company is committed to 'serving the needs of Canadian travellers' amid news that the company cut hundreds of flights in Canada this spring.  Italy's one-euro-home sales have been attracting a lot of interest over the past few years, with dozens opting to snap up abandoned properties in some of the country's depopulated towns.  Trying to imagine fat, fuzzy white lambs, jumping one by one over a fence, is a well-known remedy for sleeplessness. When I used to try this, I would insert a dapper black sheep with a red bow tie now and again — a nod to my inner rebel.  Usain Bolt's sprint world records were never in danger. Then again, even the world's fastest-ever human likely wouldn't have been so quick while balancing a tray with a croissant, a coffee cup and a glass of water through the streets of Paris, and without spilling it everywhere.  Canada's Rachel Homan beat Switzerland's Silvana Tirinzoni 7-5 to win gold at the world women's curling championship.  Shohei Ohtani plans to speak to the media Monday for the first time since the illegal gambling and theft allegations involving the Los Angeles Dodgers star and his interpreter emerged during the team’s trip to South Korea.  With the win, Canada will open the Copa América against defending champion Argentina in June 20 in Atlanta, plays Chile five days later at East Rutherford, New Jersey, and Chile on June 29 at Orlando, Fla.  A retreat in new car purchases helped push the country's retail sales down 0.3 per cent to $67 billion in January, Statistics Canada said Friday.  Gas prices are set to rise in Alberta next month, with the provincial government fully reinstating its fuel tax following a drop in oil prices.  Police are calling on the federal government to create a 'national action plan' to combat auto theft as it becomes increasingly violent, raising concerns at the Annual Auto Theft Summit in Peel Region.  Kris Stewart has her hands full with two rambunctious, 10-week-old kittens after cloning her beloved cat Bear.  Medicine Hat's mayor is essentially mayor in title only following a meeting of the southern Alberta city's council on Thursday.  Clendon Patrick was driving down the world's longest seasonal winter road located in Ontario's Far North this week when he saw a polar bear mother and her two cubs running down the road.  It takes a lot of patience and willpower to tackle a good puzzle; just ask Janet Hart who spent the last 14 months putting together one of the largest puzzles in the world.  After a harrowing ordeal where a young boy's fingers became trapped in a bathtub drain over the weekend, firefighters returned to the scene to deliver a special surprise for his bravery.  A senior \"A\" hockey team from southeast Saskatchewan is quietly gaining a huge following.  An American Elm that has grown in the parking lot outside the Calgary Stampede grounds for more than 125 years, will be removed this spring, but it will live on thanks to the Internet.  After returning home from an extended vacation in Costa Rica, a Montreal man got the surprise of the lifetime in the mail — the Quebec government thinks he's dead.  A community nestled in the Rocky Mountains is the only Canadian destination named on a list of the most beautiful small towns in the world.  As the community mourns a mother killer whale that died after getting stranded on shore Saturday, an effort is underway to reunite her orphaned calf with its pod.  For the second time this month, CTV News has learned that CT scans were unavailable at Surrey Memorial Hospital overnight due to staffing shortages.  A so-called “chickenpox party” was at the centre of a recent dispute between a B.C. family and their daycare provider, according to a decision from the Civil Resolution Tribunal.  Hospitals and long-term care homes spent nearly $1 billion last year to fill shifts with nurses and personal support workers from private staffing agencies, a Ministry of Health document estimates.  Elon Musk's X said it's funding legal bills for a Canadian doctor previously chastised by regulators for her tweets about COVID-19.  A 9-year-old child suffered serious, life-altering injuries after being bitten and dragged by a dog in a waterfront playground Saturday morning, Toronto police said.  Around 100 families beat the rush to Southcentre Mall Sunday in order to participate in the shopping centre’s popular Sensory Easter event.  Many late-night TV watchers have heard of or even seen the movie The Great Escape. Now, thanks to a new exhibit from Calgary's Military Museums, fans of the film can learn the true story that inspired the movie.  Police report no one was injured when a semi tipped onto its side on Country Hills Boulevard Northeast.  When there's a storm brewing most people take cover, but Andrew Macklin dives right in.  Ottawa Fire Services says no injuries were reported after a fire broke out at a pharmacy along Bank Street in the Glebe Sunday morning.  The Ottawa airport authority and volunteers from a local rescue shelter are searching for Athena, a pregnant cat who has been lost in the parking garage of the Ottawa airport since Thursday.  The Conservative Party of Canada (CPC) suggestion that there is a link between a police intervention in a Montreal food bank and the \"carbon tax\" is being criticized with many involved with the situation.  New signs sprung up in the area around Hudson, Que.'s 'Sandy Beach' that say: 'Private Property. Do Not Enter,' angering residents who no longer have access to the prized spot along the water.  The young framebuilding bike shop in Montreal Memento Cycles took home the top prize at the Philly Bike Expo for a bike painted in the trans flag colours with hopes of broadening representation in the industry.  An Edmonton man is on a delicious mission to explore his culinary heritage.  Police are investigating a shooting in Westmount Sunday afternoon.  Red Deer RCMP are warning of a new text message scheme involving speeding tickets.  The top names in music gathered in Halifax Sunday night for the 53rd annual Juno Awards.  Canada's Rachel Homan beat Switzerland's Silvana Tirinzoni 7-5 to win gold at the world women's curling championship.  The mother of a nine-year-old boy says packaging that depicts highly potent cannabis as a \"treat\" led her son and several classmates at a Halifax school to consume them and become violently ill earlier this week.  Winnipeg police have arrested a man for stealing from grocery stores over two dozen times.  A pair of Manitobans walked away with some hardware at the Juno awards Saturday night.  A Winnipeg mom is working to spread joy this Easter by getting the entire city involved in an Easter egg hunt.  The Regina Pats fell to the Moose Jaw Warriors 11-1 in what was their final game of the season after failing to make the playoffs with a 22-40-4-2 record.  Regina fire and the Saskatchewan Coroners Service are investigating after a body was recovered from an early morning house fire.  The provincial government is tackling the problem of vacant social housing units.  Waterloo regional police are investigating a single motor vehicle collision in Kitchener.  University flag football players from across Ontario came together to vie for the title as Laurier University hosted the Ontario Women’s Intercollegiate Football Association championship weekend.  Mary McFarlane is happy to be home after her two week long trip in Tanzania.  A local environmental group is rallying support against a proposed freeway around Saskatoon that would pass through two sensitive natural wetlands.  Saskatoon councillors are considering axing a 2018 policy that limits the number of commercial billboards on busy public roadways.  Saskatoon's black community gathered at Prairieland Park for the first-ever black business expo on Saturday.  Fire crews are still working to put out the blaze at the historic Empire Complex building in Timmins, Ont.  CTV W5 puts the spotlight on 18-year-old Emily Nash, who appears to be the first Canadian, and among the youngest people in the world, to have a rare but extraordinary super memory.  This winter marked the shortest ice road season anyone can remember on Temagami First Nation.  The London Knights are 2024 OHL Regular Season Champions. With a 3-0 win over the Guelph Storm on Sunday, the Knights solidified the top spot on the final day of the regular-season schedule.  A nonagenarian did not need medical care after her vehicle crashed into the front of a Tim Horton’s in northwest London Sunday afternoon.  A Sarnia man has been charged after members of the Sarnia Police Service Operations Division responded to an altercation at the River City Vineyard, located at 260 Mitton St. N.  A group of Wasaga Beach residents are on edge as they wait to learn if power at the hotel they call home will be shut off on Monday.  Barrie's Indian community celebrated the festival of Holi on Sunday.  Sunday marked the Jewish holiday of Purim, and synagogues throughout Simcoe County hosted services and parties.  Having worked at the Windsor Assembly Plant for 28 years, Bruce Kubenic knows there's a clear rivalry between Stellantis and Ford workers in Windsor — and a good ol' fashioned hockey game is the perfect way to settle the score.  Chatham-Kent firefighters attended the scene of a detached garage fire Saturday evening.  Young athletes from Windsor, Ont. are celebrating massive victories in combat sport tournaments across Canada and the U.S.  As the community mourns a mother killer whale that died after getting stranded on shore Saturday, an effort is underway to reunite her orphaned calf with its pod.  On the 33rd anniversary of Michael Dunahee’s disappearance, the Victoria Police Department says the missing person’s investigation remains active.  A so-called “chickenpox party” was at the centre of a recent dispute between a B.C. family and their daycare provider, according to a decision from the Civil Resolution Tribunal.  Kris Stewart has her hands full with two rambunctious, 10-week-old kittens after cloning her beloved cat Bear.  The latest funding to flow through British Columbia's Community Housing Fund will add nearly 600 rental homes to communities in the Interior and northern B.C.  Mounties in Kelowna are warning members of the public of \"potential fraudsters\" they say are collecting money for a charity that may not exist.  The Hurricanes wrapped up their regular season on a winning note Saturday night, defeating the Tigers 4-3 in overtime in a game played in Medicine Hat, Alta.  The Lethbridge Hurricanes lost their final home game of the 2023-24 regular season, dropping a 3-2 decision to Medicine Hat in overtime Friday night.  After a 25-year career with the Calgary Police Service, Mike Worden was sworn in as Medicine Hat's top cop in January 2021.  A trucking company based in Alberta has been fined $125,000 for environmental offences in northwestern Ontario that date back to 2021.  The province's Special Investigations Unit is probing an altercation in Thessalon, Ont. on Friday night where a man has survived a police shooting and is now in stable condition at a hospital.  Sault Ste. Marie hasn't quite \"gone to the birds\" but it is looking to become a \"bird-friendly city.\"  Fish harvesters in Newfoundland and Labrador are declaring victory in their negotiations with the provincial government, and are heading home after a recent protest that brought out riot police in St. John's.  Newfoundland and Labrador's provincial government delivered its annual budget to a half-empty legislature Thursday, as opposition politicians boycotted the speech and protesters stared down riot police outside.  Despite a brand new hospital and a hefty signing bonus, health officials in Newfoundland and Labrador still haven't recruited the oncologists they need for an expanded cancer care program on the province's west coast.  The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. © 2024 \n\n All rights reserved. Use of this Website assumes acceptance of Terms & Conditions and Privacy Policy "
}