{
    "title": "Those who invested in Microsoft (NASDAQ:MSFT) five years ago are up 310%",
    "date": "2/4/2024",
    "url": "https://finance.yahoo.com/news/those-invested-microsoft-nasdaq-msft-110015352.html",
    "text": "When you buy a stock there is always a possibility that it could drop 100%. But when you pick a company that is really flourishing, you can make more than 100%. Long term Microsoft Corporation (NASDAQ:MSFT) shareholders would be well aware of this, since the stock is up 289% in five years. It's also good to see the share price up 15% over the last quarter. But this could be related to the strong market, which is up 13% in the last three months. So let's assess the underlying fundamentals over the last 5 years and see if they've moved in lock-step with shareholder returns. View our latest analysis for Microsoft While the efficient markets hypothesis continues to be taught by some, it has been proven that markets are over-reactive dynamic systems, and investors are not always rational. One way to examine how market sentiment has changed over time is to look at the interaction between a company's share price and its earnings per share (EPS). During five years of share price growth, Microsoft achieved compound earnings per share (EPS) growth of 21% per year. This EPS growth is lower than the 31% average annual increase in the share price. So it's fair to assume the market has a higher opinion of the business than it did five years ago. And that's hardly shocking given the track record of growth. The image below shows how EPS has tracked over time (if you click on the image you can see greater detail). We know that Microsoft has improved its bottom line lately, but is it going to grow revenue? Check if analysts think Microsoft will grow revenue in the future. When looking at investment returns, it is important to consider the difference between total shareholder return (TSR) and share price return. The TSR incorporates the value of any spin-offs or discounted capital raisings, along with any dividends, based on the assumption that the dividends are reinvested. So for companies that pay a generous dividend, the TSR is often a lot higher than the share price return. In the case of Microsoft, it has a TSR of 310% for the last 5 years. That exceeds its share price return that we previously mentioned. This is largely a result of its dividend payments! It's nice to see that Microsoft shareholders have received a total shareholder return of 61% over the last year. That's including the dividend. That gain is better than the annual TSR over five years, which is 33%. Therefore it seems like sentiment around the company has been positive lately. Someone with an optimistic perspective could view the recent improvement in TSR as indicating that the business itself is getting better with time. I find it very interesting to look at share price over the long term as a proxy for business performance. But to truly gain insight, we need to consider other information, too. Consider risks, for instance. Every company has them, and we've spotted   1 warning sign for Microsoft   you should know about. Of course Microsoft may not be the best stock to buy. So you may wish to see this free collection of growth stocks. Please note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}