{
    "title": "Microsoft's ChatGPT Rival Copilot Faces Takeoff Turbulence—Early Adopters \nQuestion $30 Fee (UPDATED)",
    "date": "2/28/2024",
    "url": "https://www.tradingview.com/news/benzinga:0963d9c25094b:0-microsoft-s-chatgpt-rival-copilot-faces-takeoff-turbulence-early-adopters-question-30-fee-updated/",
    "text": "Microsoft Corporation‘s MSFT latest AI upgrade, Copilot for Microsoft 365, has received mixed reviews from testers, raising concerns about its value proposition. What Happened: The AI upgrade, which has been in the hands of testers for over six months, is considered useful but often fails to justify its price, reported The Wall Street Journal on Monday. Copilot for Microsoft 365 is designed to integrate with Word, Outlook, and Teams, using the same technology as OpenAI’s ChatGPT. It can summarize emails, generate text, and create documents using natural language prompts. Despite initial enthusiasm, testers have expressed reservations about the software’s performance, particularly in programs like Excel and PowerPoint. Some are questioning whether the $30 per user price tag is justified. “I wouldn’t say we’re ready to spend $30 per user for every user in the company,” said Sharon Mandell, the chief information officer at Juniper Networks, one of the companies testing Copilot. “All new technology requires thoughtful consideration and AI is unlike any technology we've seen before. Every organization will need a strategy to deploy and drive adoption, and taking a thoughtful and deliberate approach will help reap the benefits of AI. We are listening to customer feedback and will continue to work hard to make Copilot even better over time,” said Jared Spataro, corporate vice president of Modern Work and Business Applications at Microsoft. See Also: Is Tesla Still A Magnificent 7 Stock? Berkshire Hathaway, Broadcom, Eli Lilly Line Up As Contenders Microsoft has not disclosed specific sign-up figures but has stated that the early demand from users is unprecedented. The company has made significant investments in AI, with Copilot being a key part of its AI strategy. However, Microsoft’s previous AI upgrades have had mixed results. For example, the AI-powered chatbot added to Bing search struggled to compete with Google’s market share. Why It Matters: This development comes on the heels of Microsoft’s aggressive push into the AI space. In December 2023, the tech giant launched a dedicated Copilot app on Android, offering chatbot features, image creation, and text composition for emails and documents. This move signified Microsoft’s commitment to making AI more accessible to a wider audience. Despite the slow start, industry analysts like Brent Bracelin believe that Microsoft is still leading the AI race. Bracelin, an analyst at Piper Sandler, emphasized that Microsoft’s mature AI products, such as GitHub Copilot and Azure AI, are gaining momentum. Additionally, Microsoft’s strategic moves, such as introducing a $20 per month Copilot Pro AI subscription for personal and small business use, have been aimed at expanding its consumer base. This new subscription service, which offers an AI assistant for drafting texts and crunching numbers on widely used applications, was introduced after the company rolled out a free AI Copilot version for its Bing search engine. Read Next: From Tesla Drivers To German Customs, Apple Vision Pro Shines Bright: This Week In Appleverse Photo via Shutterstock Editor’s note: This story has been updated with comments from Microsoft on early adopters of Copilot giving mixed reviews. Engineered by Benzinga Neuro, Edited by Pooja Rajkumari The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @profitable_trades @TradingView @ozonlayerfx @aggressivecalculator @most_luxurious_lifestyle @life_of_lorena.fx @chartfeed @tradingview @TradingView @fxdelta @lifestylewith_ashley26 @TradingView @aitor_avatar @rok_trader @Cenobar @trading_tools.ir @Market Mentor Network @itzi71 Whatever the trade "
}