{
    "title": "Microsoft CEO Satya Nadella urges India to invest in AI for economic growth",
    "date": "2/7/2024",
    "url": "https://tech.hindustantimes.com/tech/news/microsofts-nadella-calls-on-india-to-seize-opportunity-of-ai-71707296659526.html",
    "text": "Copyright © HT Media Limited  All rights reserved. With the recent boom in AI, the world's biggest companies are making efforts to incorporate this technology into their suite of products in a bid to attract more users and drive profits. While it is being debated whether the opportunities arisen courtesy of AI outweigh its dangers, Microsoft CEO Satya Nadella has called on India as well as other countries to heavily invest in the technology. Nadella also highlighted that India has a unique opportunity to drive its economic growth by leveraging AI. “AI is really in the air now,” Bloomberg quoted Nadella saying during a keynote speech with industry leaders at the iconic Taj Mahal Hotel in Mumbai. “I have never seen a rate of diffusion of any technology like this in the 70-year-long computer age.” He said Microsoft will help train 2 million people in India with AI skills, stepping up its commitment to the nation. Countries that adopt the technology will have the chance to expand their expertise and push up economic growth, he said. “This new capability, AI, is going to have an impact on GDP,” he said. Microsoft has been at the forefront of driving adoption of AI and commercializing the technology through its suite of software offerings. The Redmond, Washington-based company invested more than $10 billion in OpenAI, the company behind ChatGPT, and works with the startup on new products and services. India is a emerging as a key battleground in the AI competition. With more than 5 million programmers, the country holds one of the largest pools of AI talent for startups and global businesses at a time when AI talent is often in short supply. “The AI engineering community in India is second only to the US,” he said. Nadella, who took the helm at Microsoft 10 years ago in February of 2014, is getting something of a hero's welcome on his return home. The 56-year-old has presided over a 1,000% stock-market run over the last decade, pushing it past Apple Inc. to become the most valuable company in the world. At the Mumbai event, he was showered with praise by people who talked about the “incredible priviledge” and “honor of a lifetime” in meeting him. Microsoft has made big investments in Nadella's native country, where it employs over 23,000 in cities including the tech centers Bangalore and Hyderabad. Last year, it pledged to train 100,000 developers on the latest AI tools and technologies. In his Mumbai appearance, Nadella drew a parallel to the UK and how its economy took off after the country poured 10% of its GDP into railroads. “The rest is history,” he said. Nadella predicted all manner of opportunities for investments related to AI, including in quantum computing, climate change and scientific research. “AI models are like the foundries of the world,” he said. (With inputs from Bloomberg) More Than Just Chip Power! Nvidia and Cisco are teaming up to make it easier for corporations to build their own AI computing infrastructure. Cisco will offer Nvidia-based equipment along with its networking gear. Find out more here. Bluesky Social Goes Public! After a year of staying in the invite-only phase, former Twitter CEO Jack Dorsey's decentralized social media platform Bluesky Social has opened for the public. Dive in here. Apple Defeats AliveCor Suit! A US District Judge has ruled that the iPhone maker won't have to face a lawsuit alleging its watch copied heart-monitoring technology from a Khosla Ventures LLC-backed startup, AliveCor. Read all about it here. One more thing! We are now on WhatsApp Channels! Follow us there so you never miss any updates from the world of technology. ‎To follow the HT Tech channel on WhatsApp, click here to join now! Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71707296659526 "
}