{
    "title": "Microsoft CEO Satya Nadella dreams of a world where every person in India \nand the planet are empowered by AI",
    "date": "2/8/2024",
    "url": "https://www.indiatoday.in/technology/news/story/microsoft-ceo-satya-nadella-dreams-of-a-world-where-every-person-in-india-and-the-planet-are-empowered-by-ai-2499145-2024-02-08",
    "text": "Listen to Story Microsoft CEO Satya Nadella dreams of a world where every person in India and the planet are empowered byAt 10:17 am on Thursday, Microsoft Chairman & CEO Satya Nadella addressed a cheering crowd of developers in Bengaluru at the Microsoft AI Tour event. Nadella opened the keynote by talking about the age-old desire to “create computers that understand us, instead of us understanding them. A computer that can hold conversations.” And if we look around for a minute, we are currently living that “age-old desire”. The focus of the event was primarily on developers, of course, but also on Microsoft Azure, GitHub and Copilot. The event was all about how the company’s cloud and gen AI services are helping developers. In fact, Nadella gave it a more profound twist and shared his ambition to be able to “empower every person in India and the planet to achieve more” with the help of Microsoft services. “The idea is to use Copilot to help us do more,” said Nadella. Puneet Chandok, who is the President of Microsoft India & South Asia, did just that. He opened his address with a beautiful AI-generated image of Bengaluru that he created using Copilot. Then, Karan MV, Senior Managar, Github India demonstrated how Github Copilot can now help developers code, write a sign up page. And for users in India, developers can ask it coding queries in Hindi, type in Devanagari script, or even in local indian languages like Telugu. Microsoft also shared examples of how NGOs and startups are using Copilot’s generative AI tools to empower Indians in the rural parts of the country. One such example was of the Sikshana Foundation that is using Microsoft Copilot to create Shiksha AI, which is aimed at empowering teachers in government schools and NGOs in creating teaching plans within minutes which would otherwise be a time consuming process. Another example shared was of Sarvam AI that uses voice LLM in Hindi to help bring ChatGPT features to users who are not very smartphone-friendly. It’s basically like taking the voice feature on ChatGPT and making it available more widely, and in local Indian languages. Karya AI is another example where women in Maharashtra are able to use the voice-powered chatbot to simplify every day financial tasks like opening a bank account, taking a loan, and making payments. Besides the newer startups, Microsoft also shared that more established brands like Air India, Paytm, Blinkit Swiggy, Nykaa, Ola, and Meesho are among some of the early adopters of copilot in India. It’s true. As Satya Nadella said at the keynote, it looks like “the age of Copilots has taken off.” Nadella also shared some interesting figures and future projections with regards to developers in India. He shared that India is the second biggest community in the world creating the most generative AI project on GitHub. Additionally, India will have the largest developer community on Github in 2027. In line with his ambition of making Microsoft’s AI services available to every Indian, Nadella also announced that Microsoft Azure will soon be available in more regions in India, and that the company is constantly working towards building the “best AI infrastructure” in the country. Nadella briefly also spoke about AI for science and “learning the language of nature”. The Microsoft CEO spoke about his ambition to use generative AI in the field of biology and eventually make the tools available to all users like any other Copilot tool is available right now. Nadella concluded the keynote with the dream of making available “not just information on your fingertip, but expertise on your fingertip” with Microsoft Copilot.Published By: Ankita ChakravartiPublished On: Feb 8, 2024Trending Reel "
}