{
    "title": null,
    "date": "2/15/2024",
    "url": "https://www.windowscentral.com/gaming/xbox/xbox-game-pass-has-hit-a-new-growth-milestone-as-microsofts-gaming-ambitions-expand",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Xbox Game Pass is still growing. Today, Microsoft held an Xbox Business Update \"event\" as part of a special edition of the official Xbox Podcast over on YouTube. During the show, Xbox lead Phil Spencer was joined by Xbox execs Sarah Bond and Matt Booty to discuss the future of the Xbox ecosystem. During the podcast, Xbox confirmed what has been rumored for weeks, that some Xbox games will no longer be console exclusive. \"Four\" games will be heading to PlayStation and Nintendo Switch, which Microsoft described as being \"hidden gems,\" rather than their main AAA single-player games. Indeed, the rumors that started the backlash against this plan included Starfield and Indiana Jones, two games Microsoft specifically confirmed are not in development for PlayStation 5, at least for now. Microsoft also re-affirmed commitment to Xbox hardware, claiming the next Xbox would be the \"biggest generational leap\" for an Xbox console ever. Microsoft also had some news to share about Xbox Game Pass. Rumors swirled that Microsoft may announce something negative for Xbox Game Pass, with some pundits expecting an end to day-one launch titles into the subscription service, or even price increases. Instead, Microsoft reaffirmed a commitment to Xbox Game Pass, by revealing that the first major Activision title is entering Game Pass in March, in the form of Diablo 4. In addition, Microsoft also confirmed that Xbox Game Pass is continuing to grow, putting to bed rumors that it has stalled. The last update we had about Xbox Game Pass' numbers was back in 2022, which pit them at 25 million. Xbox lead Phil Spencer had alluded to the idea that growth in Game Pass had reached saturation point in a previous interview (via The Verge), but it seems that they are still finding growth, at least potentially. Xbox Game Pass now stands at 34 million subscribers (via Xbox Wire), although it's unclear what the tier breakdown looks like here. Remember, last summer Microsoft rebranded Xbox Live Gold, the subscription you need to play online, to Xbox Game Pass Core. This change over could account for the boost in subscriber numbers we're seeing here, and we've reached out to Microsoft to clarify the metrics. Update: Microsoft confirmed to us that these numbers do indeed include Xbox Game Pass Core. All the latest news, reviews, and guides for Windows and Xbox diehards. A couple of weeks ago, I wrote an article explaining why Xbox fans were right to be angry about the possibility of exclusive games going to PlayStation and Nintendo Switch. However, it seems the most extreme case scenario, of Microsoft going all-in on multi-platform publishing, seems to have been totally unfounded. Microsoft put a pretty firm denial on games like Starfield and Indiana Jones going to non-Xbox platforms, and instead are focusing on smaller titles that have long hit the upper limits of their growth potential on Xbox. This was never about gatekeeping, it was about the possibility that Microsoft no longer sought to curate and maintain its hardware ecosystem, among a userbase that remembers how Microsoft treated Windows Phone owners in years past. No more hardware, means thousands of dollars of digitally-locked Xbox games becoming mothballed. Thankfully, Microsoft made a pretty loud commitment to Xbox hardware fans as part of the above podcast today (and we believe that Xbox is actually building a handheld, too.) In an interview with The Verge, Xbox lead Phil Spencer emphasized how Xbox's strength is in its business plurality and diversity, and that there's no \"one size fits all\" approach for Xbox to find growth and sustainability. \"I tell you honestly, running the business, having a diversity of business models that are working is pretty critical,\" Spencer continued, \"the one thing I will say about the Game Pass subscriber revenue is that it’s consistent. You can look at it, it’s growing. You can kind of see its growth. You know plus or minus what it’s going to be next month and the month after.\" Microsoft also touted plans to develop new Xbox consoles that will represent the \"biggest generational leap,\" and also provide \"unique\" hardware paradigms that \"unleash\" the creativity of Microsoft's industrial design teams. On paper, it all sounds incredibly positive, but it remains to be seen how the wider market responds to Microsoft's plans. Jez Corden is a Managing Editor at Windows Central, focusing primarily on all things Xbox and gaming. Jez is known for breaking exclusive news and analysis as relates to the Microsoft ecosystem while being powered by tea. Follow on Twitter @JezCorden and listen to his XB2 Podcast, all about, you guessed it, Xbox! Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}