{
    "title": "MWC: Microsoft pitches 'AI access principles' to offset OpenAI competition \nconcerns",
    "date": "2/27/2024",
    "url": "https://ca.news.yahoo.com/microsoft-announces-ai-access-principles-173101563.html",
    "text": "On the heels of Microsoft's investment and partnership with French Large Language Model startup Mistral AI, the company continues to work hard to try to dispel the image that it's blocking competition through its deep partnership (and financial stake) in OpenAI. On Monday at Mobile World Congress, the company launched a new framework it's calling \"AI Access Principles\" -- an eleven-point plan that Microsoft said will \"govern how we will operate our AI datacenter infrastructure and other important AI assets around the world.\" The points cover areas such as the building and operation of an app store to allow businesses to pick and choose different LLMs and other AI products and a commitment to keeping company's proprietary data out of its training models. It also includes a commitment to let customers change cloud providers, or services within the cloud, if they choose to. It also details a focus on building cybersecurity around AI services; attention to building data centers and other infrastructure in an environmentally-sound way; and education investments. Brad Smith, the president and vice chair of Microsoft, announced the framework today at the Mobile World Congress in Barcelona. Although the implication here is that Microsoft is open to dialogue and conversation with stakeholders, ironically, Smith delivered the news in a keynote speech, with no scope for follow-up questions. (Read a roundup of day one hardware coverage from MWC here.) The announcement comes at the same time that Microsoft is coming under increasing regulatory scrutiny for its $13 billion investment in OpenAI, which currently gives it a 49% stake in the startup that is leading the charge for generative AI services globally. In January, the European competition watchdog said that it was assessing whether the investment falls under antitrust rules. The take specific aim at how third parties might use Microsoft's platforms and services to develop AI products, a critical business area and enterprise service that the company hopes to develop in coming years, not just with the carriers who attend MWC, but businesses and organizations from a much wider array of industries. \"If they are training a model on our infrastructure, if they are deploying it on our infrastructure, we recognise that their data is their data, we will not access it and use it to compete with the companies that are relying on our infrastructure,\" Smith said. These AI Access Principles, to be clear, are not binding rules for Microsoft -- nor is there any kind of detail laid out around how any of the commitments might be verified or tracked -- but they serve a purpose in anticipation of that. In the event of any formal regulatory investigations, they will likely be used by the company to argue that it is taking proactive efforts to ensure competition in the market. \"In fact, as of today, we have almost 1600 models running in our data centres, 1500 of which are open source models,\" said Smith on stage today, \"showing how we as a company ... focus on proprietary and open source models, companies, large and small.\" On the other hand, by laying them out publicly like this, the principles become a public pronouncement that the public, Microsoft's competitors, and pointedly regulators, could use as a reference point if they believe Microsoft has failed to measure up. A group of Chinese researchers from Nanjing University School of Aeronautics unveiled the designs last month. In this article, we discuss the 11 stocks that will profit from AI evolution. If you want to skip our detailed analysis of these stocks, go directly to 5 Stocks That Will Profit From AI Evolution. Artificial intelligence products like automated assistants, chatbots, robotics, and even self-driving vehicles have become all the rage in the […] Despite high labor costs, restaurants with automation are saving money by retaining employees and increasing their agency within the company. Analysts predict patents for an Apple Watch with a camera, a hand wearable for the Vision Pro, and an offline Siri are likely to become products. People using the app reduced booze intake by an extra two units a week, compared to those who followed standard NHS advice, research indicated. If you’re looking for the biggest deals included in Amazon’s Big Spring Sale, we’ve got you covered. TVLine has rounded up 17 of the best tech deals, from those little gadgets you never buy (but always need) to major TV discounts. Below are all the best Big Spring Sale tech deals from Amazon’s event. And … Vice President Kamala Harris vowed that the Biden administration does “not intend to ban TikTok” in a new interview. But President Joe Biden has said he intends to sign the bill if it passes in the Senate. Toronto police say a child was taken to hospital with serious, life-altering injuries after being bitten and dragged by a dog at a waterfront playground on Saturday.Officers were called to Little Norway Park, near Lake Shore Boulevard West and Bathurst Street, at about 10:15 a.m.A news release issued Saturday said a woman was inside the playground area with a dog that was off-leash when a father approached the same area with his child.The dog allegedly \"charged toward\" the child through an open Prince Harry and Meghan Markle were not informed about the Princess of Wales cancer diagnosis before the news was made public, according to a new report in The Sunday Times The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach Italy’s one-euro-home sales have attracted interest in recent few years, but towns like Patrica, located south of Rome, have struggled to offload their empty homes. The Ohio lawmaker was asked about Donald Trump's debunked claims about the 2020 election. Affected Stellantis employees were “expected to work from home unless otherwise instructed by your manager.\" Following the royal mum-of-three’s announcement she is battling cancer, Prince Harry is said to be “devastated” at the news. “No one’s ever seen a bond this big,\" he complained to Fox News' Maria Bartiromo. The far-right lawmaker's pic goes under the microscope on social media. Snopes looked for the facts about a young girl who had purportedly once been abandoned in a vacant house in the Russian city of Yaroslavl. For days, Donald Trump’s fury over the requirement to secure hundreds of millions of dollars in bond money by Monday has been bubbling behind the scenes and through a steady stream of social media posts. The Daily Beast/Getty Images/BBCA controversial British royal commentator is under fire for a “disgusting” tweet ahead of Kate Middleton’s Friday announcement that she has cancer and is undergoing chemotherapy.An hour before the Princess of Wales released the video announcement of her diagnosis, Omid Scobie posted a photo on X, formally known as Twitter, of his alarm clock being set to 6 p.m. GMT. Scobie told The Daily Beast that hearing “there would be an announcement of some kind from the Pala "
}