{
    "title": "5 Best Blue Chip Stocks To Invest In According to Hedge Funds",
    "date": "2/19/2024",
    "url": "https://www.insidermonkey.com/blog/5-best-blue-chip-stocks-to-invest-in-according-to-hedge-funds-1256128/5",
    "text": "Number of Hedge Fund Investors: 306 Microsoft Corp (NASDAQ:MSFT) is the most popular blue chip stock among the 910 elite hedge funds tracked by Insider Monkey. Last month, Microsoft Corp (NASDAQ:MSFT) posted fiscal second quarter results. GAAP EPS in the period came in at $2.93, beating estimates by $0.16. Revenue in the period jumped 17.7% year over year to $62.02 billion, beating estimates by $890 million. A total of 206 hedge funds tracked by Insider Monkey had stakes in Microsoft Corp (NASDAQ:MSFT) as of the end of the third quarter of 2023. Madison Sustainable Equity Fund stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its fourth quarter 2023 investor letter: “Microsoft Corporation’s (NASDAQ:MSFT) sustainable scorecard was updated with an unchanged rating of Above Average. The company’s board has an official Environmental, Social, and Public Policy Committee in addition to the traditional Audit, Compensation, and Governance committees. For ten years, Microsoft has publicly released data measuring the diversity of its workforce. With the prominence of Artificial Intelligence (AI), the company has launched a 5-point blueprint for governing AI to address public policy and regulation. Environmentally, Microsoft has multiple programs to be carbon negative by 2030. The company has signed Purchase Power Agreements for carbon-free energy totaling 13.5 Gigawatts.” Insider Monkey focuses on uncovering the best investment ideas of hedge funds and insiders. Please subscribe to our free daily e-newsletter to get the latest investment ideas from hedge funds’ investor letters by entering your email address below. You can also look at the 10 Best Tech Stocks for the Next 5 Years and the 10 Best Long-Term Tech Stocks To Buy. NASDAQ:AMZNNASDAQ:METANASDAQ:MSFTNASDAQ:NVDANASDAQ:GOOGLNvidia Corp (NASDAQ:NVDA)Microsoft Corp (NASDAQ:MSFT)Amazon.com Inc. (NASDAQ:AMZN)Meta Platforms Inc. (NASDAQ:META)10 Best Long Term Tech Stocks To BuyAlphabet Inc. Class A (NASDAQ:GOOGL)10 Best Tech Stocks for the Next 5 Years5 Best Blue Chip Stocks To Invest In According to Hedge FundsShow more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                 Get our editor’s daily picks straight in your inbox!  "
}