{
    "title": "Zacks Earnings Trends Highlights: Microsoft, Alphabet, Tesla, Amazon, Meta \nand Apple",
    "date": "2/1/2024",
    "url": "https://finance.yahoo.com/news/zacks-earnings-trends-highlights-microsoft-133300128.html",
    "text": "Chicago, IL – February 1, 2024– Zacks Director of Research Sheraz Mian says, \"S&P 500 index earnings are currently expected to be up +2.4% from the year-earlier level on +2.8% higher revenues, which would follow the +3.8% earnings growth in 2023 Q3 on +2.0% higher revenues.\" Note: The following is an excerpt from this week's Earnings Trends report. You can access the full report that contains detailed historical actual and estimates for the current and following periods, please click here>>> Total Q4 earnings for the 176 S&P 500 members that have reported results are up +1.7% from the same period last year on +2.6% higher revenues, with 81.8% beating EPS estimates and 69.3% beating revenue estimates. Looking at Q4 as a whole, combining the actual results that have come out with estimates for the still-to-come companies, total S&P 500 index earnings are currently expected to be up +2.4% from the year-earlier level on +2.8% higher revenues, which would follow the +3.8% earnings growth in 2023 Q3 on +2.0% higher revenues. For the Tech sector, we now have Q4 results for 46.8% of the sector's market capitalization in the index. Total earnings for these Tech companies are up +19.3% from the same period last year on +6.6% higher revenues, with 82.1% beating EPS estimates and 75% beating revenue estimates. The Q4 earnings and revenue growth rates for these Tech companies are notably tracking higher than what we have seen from these companies in other recent periods, though the EPS and revenue beats percentages are tracking modestly below other recent periods and the 20-quarter average. The market's darling mega-cap Tech companies that we have been referring to as the 'Big 7 Tech Players' and everyone else as 'Magnificent 7', or 'Mag 7' for short, have started reporting results, with Microsoft MSFT, Alphabet GOOGL and Tesla TSLA now out with their December-quarter results. The still-to-come reports from this exalted club are comprised of Amazon AMZN, Meta META and Apple AAPL this week. Total Q4 earnings for the 'Mag 7' (we have thrown in the towel and will be referring to the group by the same name) are expected to be up +41.3% from the same period last year on +13% higher revenues, which would follow the group's +54.2% higher earnings on +12.9% higher revenues in 2023 Q3. Concerning the market reactions to the Microsoft and Alphabet results, both of these stocks had climbed significantly heading into the releases, on top of last year's impressive gains, suggesting that a sell-the-news type of reaction was the most likely outcome. Microsoft's results were relatively more impressive than Alphabet's numbers, but both companies came out with solid results. Microsoft's Q4 earnings were up +25.9% on +17.6% higher revenues, while the same for Alphabet were up +51.8% on +14.6% higher revenues. Both companies came out with cloud revenues that represented acceleration over the preceding period, with Microsoft's cloud revenues up +30% from the same period last year and Alphabet's relatively smaller cloud business enjoying revenue growth of +26%. The market's issue with the Alphabet report is related to the company's core ad business, which showed lower-than-expected growth of +11%. The market reactions to these results notwithstanding, for companies the size of Microsoft and Alphabet to be able to achieve this magnitude of top- and bottom-line gains in this macro backdrop speaks to their enormous earnings power. Beyond the Mag 7, Q4 earnings for the S&P 500 index are currently expected to be up +2.4% above the year-earlier period on +2.8% higher revenues. This would follow the +3.8% increase in index earnings in 2023 Q3 on +2.3% higher revenues. Given the expected moderation in the U.S. economy's growth trajectory due to the cumulative effects of Fed tightening, these estimates likely need to come down. Some of that downward adjustment is already happening. As we have noted before, full-year 2024 estimates started coming down in October, with the trend continuing in November and early December, but appear to have stabilized in recent weeks. Why Haven't You Looked at Zacks' Top Stocks? Since 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Follow us on Twitter:  https://twitter.com/zacksresearch Join us on Facebook:  https://www.facebook.com/ZacksInvestmentResearch/ Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates. Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer. Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Tesla, Inc. (TSLA) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Meta Platforms, Inc. (META) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}