{
    "title": "3 Artificial Intelligence (AI) Stocks With More Potential Than Any \nCryptocurrency",
    "date": "3/1/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/MSFT-Q/pressreleases/24472307/3-artificial-intelligence-ai-stocks-with-more-potential-than-any-cryptocurrency/",
    "text": "According to Grand View Research, global cryptocurrency revenue hit $5 billion in 2022 and is projected to expand at a compound annual growth rate (CAGR) of 12% through 2030. While that growth is significant, it pales in comparison to the artificial intelligence (AI) market's CAGR of 37% for the rest of the decade and its value of $137 billion.  Data by YCharts Excitement over cryptocurrency faltered in recent years as volatility has caused pullback from investors. The chart above compares the three-year growth between the most prominent cryptocurrency and three companies active in AI. Each tech company has performed significantly better than Bitcoin and potentially has more room to run in the coming years, thanks to AI. Cryptocurrencies developed a reputation for inconsistency. However, it's just the opposite with tech stocks. The tech market is known for rewarding innovative companies with consistent gains over the long term, with that unlikely to change alongside a recent boom in AI. So, here are three AI stocks with more potential than any cryptocurrency. All eyes have been on Nvidia (NASDAQ: NVDA) this year because its chips have become the go-to for developers across the AI market. The company's dominance in graphics processing units (GPUs) gave it a leg up on its competitors, allowing it to secure an estimated 80% to 95% market share in AI chips. Soaring demand for AI GPUs caused Nvidia's revenue to skyrocket. In the fourth quarter of 2024 (ended in January), the company's revenue increased by 265% year over year to $22 billion. Meanwhile, operating income jumped 983% to nearly $14 billion. The monster growth was primarily owed to a 409% increase in data center revenue, reflecting increased chip sales.  Data by YCharts Nvidia's earnings could hit $34 per share over the next two fiscal years. Multiplying that figure by the company's forward price-to-earnings ratio (P/E) of 32 projects a stock price of $1,094. Considering its current position, these projections would mean Nvidia's stock rising 39% by fiscal 2027. In addition to a dominating position in a high-growth market like AI, Nvidia is a screaming buy this month with more potential than any cryptocurrency. As the home of potent brands like Windows, Office, Xbox, and LinkedIn, Microsoft (NASDAQ: MSFT) is a tech behemoth and one of the biggest threats in the industry. The company's shares are up 65% in the last 12 months, and it recently surpassed Apple as the world's most valuable company, with its market cap currently at just over $3 trillion. Additionally, Microsoft won over investors with an expanding role in AI. Heavy investment in ChatGPT developer OpenAI has led to a lucrative partnership and access to some of the most advanced AI models in the industry. The Windows company used OpenAI's technology to introduce AI features across its product lineup. In 2023, Microsoft added new AI tools to its Azure cloud platform, integrated aspects of ChatGPT into its Bing search engine, and boosted productivity in its Office software suite by adding AI features. Microsoft achieved more than $67 billion in free cash flow last year, highlighting the business's reliability and value as a long-term investment.  Data by YCharts Microsoft's earnings could reach nearly $16 per share over the next two fiscal years. In a similar calculation to Nvidia, multiplying that figure by Microsoft's forward P/E of 35 yields a stock price of $550, projecting stock growth of 35% by fiscal 2026. With its lucrative OpenAI partnership, Microsoft is a far better investment than any cryptocurrency. Like Nvidia, Advanced Micro Devices(NASDAQ: AMD) has massive potential in the hardware side of AI. The company got a late start in the industry, outrun by Nvidia last year. However, AMD is moving to challenge Nvidia's dominance soon and take its slice of the lucrative sector. Last December, the tech giant unveiled its MI300X AI GPU, designed to provide an alternative to Nvidia's products. The new chip already caught the attention of some of tech's most prominent players, signing on Microsoft and Meta Platforms as clients. Moreover, AMD isn't banking solely on stealing market share from Nvidia in GPUs. AMD seeks to lead its own space within AI by doubling down on AI-powered PCs. According to research firm IDC, PC shipments are projected to receive a major boost this year, with AI integration serving as a key catalyst. And a Canalys report predicts that 60% of all PCs shipped in 2027 will be AI-enabled. AMD has a solid outlook over the long term, and earnings-per-share estimates reflect this.  Data by YCharts AMD's earnings could hit just above $7 per share over the next two fiscal years. Multiplying this figure by the company's forward P/E of 49 yields a stock price of $352. If projections are correct, AMD's stock price could double by fiscal 2026. And with that, AMD has significantly more potential than the crypto market. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 26, 2024  Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Bitcoin, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Microsoft Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}