{
    "title": "OpenAI and Microsoft are being dragged to the courts yet again",
    "date": "1/8/2024",
    "url": "https://interestingengineering.com/culture/openai-and-microsoft-are-being-dragged-to-the-courts-yet-again",
    "text": "Authors miffed over OpenAI allegedly using their work to train ChatGPT. Wikimedia Commons By subscribing, you agree to our Terms of Use and Policies You may unsubscribe at any time. OpenAI and Microsoft are facing a lawsuit from authors Nicholas Basbanes and Nicholas Gage, who claim that their work was used without permission to train artificial intelligence models, including ChatGPT. They said the two organizations ‘simply stole’ their work without compensation and used it to train their “billion-dollar” large language model. They argue that this unauthorized use infringes on their copyrights. Other writers, including Sarah Silverman and George R.R. Martin, have also filed similar lawsuits for allegedly using their work to train AI programs, reported Interesting Engineering earlier. Trouble has been brewing for OpenAI, in which Microsoft has heavily invested, for some time now. About ten days ago, the New York Times filed a lawsuit against the two companies, alleging that they used its articles without permission to train their AI systems, including ChatGPT and Bing chatbot. The lawsuit reflects a broader legal concern about using online content to train large language models and AI systems, with content creators fearing that their works could be used to create competing products without compensation. Basbanes and Gage said in their lawsuit that they represent a class of writers “whose copyrighted work has been systematically pilfered by” the two companies, reported NBC News. They are seeking up to $150,000 for each work ‘infringed.’ “They’re no different than any other thief,” said the suit. The new lawsuit is a class action, meaning anyone in the US “who are authors or legal, beneficial owners” whose work has been used to “train their large language models” can claim party to the suit. One of the first lawsuits against the creator of the popular chatbot was in June when it was alleged that OpenAI was illicitly collecting significant volumes of personal data to train its AI models in pursuit of profits. The anonymous group initiating the lawsuit claimed that OpenAI violated privacy laws by covertly extracting 300 billion words from the internet, including personal information acquired without consent. The extensive 157-page lawsuit employs sweeping language, accusing the company of jeopardizing “civilizational collapse,” reported Interesting Engineering. Amidst the flurry of recent legal actions, not everybody opposes utilizing their content for AI model training. The Associated Press, for example, has broken away from the trend and granted OpenAI a two-year access window to its news stories for AI training. Similarly, Politico and Business Insider have entered into agreements with the companies, allowing the use of their site content for future training purposes. "
}