{
    "title": null,
    "date": "1/20/2024",
    "url": "https://www.livemint.com/technology/tech-news/microsoft-ceo-satya-nadella-praises-rabbit-r1-ai-assistant-steve-jobs-iphone-launch-one-of-the-most-impressive-11705722271026.html",
    "text": "Much like the rest of the tech community, Microsoft CEO Satya Nadella was smitten with the idea of Rabbit R1, the AI assistant unveiled at CES 2024 in Las Vegas last week. In fact, Nadella was so impressed with Rabbit R1 that he compared the AI assistant's launch presentation to Steve Jobs' highly acclaimed presentation of the original iPhone in 2007. Also Read | What is Rabbit R1? All you need to know about the AI-powered smart assistant launched at CES 2024 Speaking about the Rabbit R1 in an interaction with Bloomberg, Nadella said, “I think CES this year was very interesting. I thought I thought the demo of the Rabbit OS and the device was fantastic. I think I must say, after Jobs and the launch of iPhone, probably one of the most impressive presentations I've seen of capturing the vision of what is possible going forward for what is an agent-centric Operating System (OS) interface.\" “I think that's what everybody is going seeking. Which device will make it and so on is unclear. If you have a breakthrough in natural interface where this idea that you have to go one app at a time and all of the cognitive load is with you as a human, does seem like there can be a real breakthrough.\" Nadella added. What is Rabbit R1? Santa Monica-based startup Rabbit had announced its Rabbit R-1 AI assistant at the Consumer Electronics Show (CES 2024) in Las Vegas earlier this week. The R1 is an AI-powered device that features a 2.88-inch touchscreen display and runs on a MediaTek processor. The AI assistant can perform a variety of functions, including playing music, ordering groceries and sending messages.\n   Also Read | CES 2024 Recap: From invisible TVs to brain-scanning headphones, here's day by day highlights\n   unlike much of AI-based offerings which are based on large language models (LLM) like OpenAI's GPT or Google's Gemini, the Rabbit R1 instead is based on a ‘Large Action Model’ and has the ability to gauge users' intention and behaviour while using specific apps and is claimed to mimick those actions ‘reliably and quickly’.\n\n\n\n\nYou may be interested in\n\n\n\n\n\n\n\n\n\n\n\n\n    Explaining the idea behind Rabbit R-1, Rabbit founder and CEO Jesse Lyu said, \"We’ve come to a point where we have hundreds of apps on our smartphones with complicated UX designs that don’t talk to each other. As a result, end users are frustrated with their devices and are often getting lost. rabbit is now building towards an intuitive app-free experience with the power of AI.\"\n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Chip(per) ambitions: Why India needs its wafer fabs          Dholera chip fab: India's leap into electronics manufacturing          Mint Primer| Google vs Indian startups row: its global implications          Ask me anything: Inside the race to build desi GPTs          A Google Maps competitor in India's tech revolution          ‘Need another technology leap for AI to start reasoning like humans’          Govt's ₹1-trillion deep tech fund: why we need it, and is it enough?          Telepathy: Would you allow a chip implant in your brain?          Budget 2024: India's digital public infra now a new 'factor of production'          Rights issue caps Byju's wild ride from top startup to throwaway valuation       Explore Premium  \n\n\n                Catch all the  Technology News and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 20 Jan 2024, 10:05 AM IST\n\t\nTopics You May Be Interested In \n satya nadella \n microsoft ceo satya nadella \n rabbit r1 \n microsoft \n microsoft ceo \n satya nadella rabbit r1 \n rabbit r1 india \n rabbit ai \n rabbit ai r1 \n rabbit r1 india price \n rabbit device \n rabbit r1 price in india Santa Monica-based startup Rabbit had announced its Rabbit R-1 AI assistant at the Consumer Electronics Show (CES 2024) in Las Vegas earlier this week. The R1 is an AI-powered device that features a 2.88-inch touchscreen display and runs on a MediaTek processor. The AI assistant can perform a variety of functions, including playing music, ordering groceries and sending messages. Also Read | CES 2024 Recap: From invisible TVs to brain-scanning headphones, here's day by day highlights unlike much of AI-based offerings which are based on large language models (LLM) like OpenAI's GPT or Google's Gemini, the Rabbit R1 instead is based on a ‘Large Action Model’ and has the ability to gauge users' intention and behaviour while using specific apps and is claimed to mimick those actions ‘reliably and quickly’. Explaining the idea behind Rabbit R-1, Rabbit founder and CEO Jesse Lyu said, \"We’ve come to a point where we have hundreds of apps on our smartphones with complicated UX designs that don’t talk to each other. As a result, end users are frustrated with their devices and are often getting lost. rabbit is now building towards an intuitive app-free experience with the power of AI.\" Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}