{
    "title": "Can Microsoft Stock Hit $600 on AI Growth?",
    "date": "1/17/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/indices/TXCX/pressreleases/23403956/can-microsoft-stock-hit-600-on-ai-growth/",
    "text": "The tech sector is still being driven by the artificial intelligence (AI) theme, and Microsoft (MSFT) is riding the wave like a pro. The old-school tech giant has been quick to leverage the AI trend, thanks to its massive investment in OpenAI, and the stock is fresh off a new all-time high of $394.03, set in Tuesday's post-holiday trading. In fact, Microsoft has narrowly edged out Apple (AAPL) as the world's most valuable public company, due in part to AAPL crumbling under the pressure of multiple analyst downgrades this January. MSFT currently sports a market cap of $2.90 billion, compared to AAPL's $2.83 billion. Longer term, at least one analyst sees quite a bit more upside in store for Microsoft stock. So, can AI-fueled growth carry the stock all the way to $600 per share? Here's a closer look. Microsoft stock has been on a roll, standing out even amid a strong showing for the broader market over the past year. MSFT is up 60.7% in the last 52 weeks, compared to a return of 32.7% for the Nasdaq Composite ($NASX). Like most AI-related tech stocks, MSFT isn't particularly cheap at current levels. That said, while Microsoft's valuation ratios are elevated, they're down from historical peaks. The stock currently trades at a forward price-to-earnings (P/E) ratio of 34.9x and a price-to-sales ratio of 11.9x. By comparison, the stock traded north of 40x forward earnings in September 2020. It's also worth noting the company's consistent dividend growth. Microsoft is on pace to achieve Dividend Aristocrat status in this decade, as the tech titan has consistently boosted shareholder payouts each year since 2003. MSFT pays $0.75 per share each quarter for a forward yield of 0.77%, providing investors with an appealing combination of income and growth. Plus, with ample free cash flow and a low payout ratio, there's plenty of room for more dividend hikes down the road. In its fiscal Q1 earnings report, Microsoft raked in earnings per share (EPS) of $2.99, which exceeded analysts' expectations of $2.65. Revenue of $56.52 billion also beat Wall Street's forecast. For MSFT's next quarterly release, due out on Jan. 23, the company is expected to report earnings of $2.75 per share, reflecting a year-over-year increase of 18.53%. Microsoft has reported significant growth in its AI and Azure segments, which has been a key driver of its overall performance. In the recent quarter, Azure and cloud services revenue rose by a stronger-than-anticipated 29%, and CFO Amy Hood revealed that 3 points of Azure's growth came from AI, surpassing the company's own expectations. Asked about Microsoft's ability to maintain the pace of growth going forward, CEO Satya Nadella explained on the conference call, \"Given our leadership position, we are seeing complete new project starts, which are AI projects. And as you know, AI projects are not just about AI meters. They have lots of other cloud meters as well.\" In other words, the company's AI services are not only driving growth in Azure - they're stimulating sales across the board. In particular, Microsoft's AI-infused programming assistant Copilot is driving adoption of Azure, as it requires the cloud platform to run. Copilot is already being used by 40% of the Fortune 100 companies in preview. Microsoft has an advantage over cloud competitors like Amazon and Google when it comes to AI adoption, partially due to strong integration between its productivity suites and Azure services. In fact, MSFT reported stronger cloud growth than both of its FAANG rivals in the most recent quarter, which analysts at Bernstein took as an indication that Microsoft “has taken the AI mantel from Google, and that Azure could become a bigger and more important hyperscale provider than AWS.” Other analysts appear equally optimistic about Microsoft's future prospects - but perhaps none more so than Truist Securities analyst Joel Fishbein, who initiated coverage of Microsoft stock with a “buy” rating and a three-year price target of $600. That represents expected upside of about 55% from current levels, or a compound annual growth rate of roughly 15.7% - which is not a stretch, considering Microsoft's past performance. Elsewhere, Wedbush analyst Daniel Ives just raised his target price on the stock to $450 from $425, expressing confidence that AI-powered growth will sustain its run. He projects Azure alone will be a $1 trillion market in the next decade, with Microsoft gaining share. Another bullish analyst, Frederick Havemeyer at Macquarie, sees upside for Microsoft from increased enterprise spending on digital transformation and cloud migration. On average, analysts expect Microsoft to deliver earnings per share of $11.14 in fiscal year 2024, reflecting growth of 13.56% from the prior year. Revenue for fiscal 2024 is forecast to rise 14.7% to $243.06 billion. Wall Street is overwhelmingly bullish on Microsoft stock, with a “strong buy” consensus based on 37 analysts' recommendations. The mean price target for Microsoft is $408.89, representing a potential upside of 5.6% from current levels. In conclusion, Microsoft stock could plausibly surge to $600 per share, driven by AI growth. Given its market-leading position, robust AI results so far, and upbeat projections for continued growth, the stock still looks appealing, despite its relatively stretched valuations. As Microsoft continues to lead in AI and cloud, the stock remains a top pick for growth - and the dividend is a nice bonus, too. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Futures and Forex: at least 10 minutes delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}