{
    "title": "Microsoft, Vodafone 10-year partnership will pave way for new AI services",
    "date": "1/27/2024",
    "url": "https://coingeek.com/microsoft-vodafone-10-year-partnership-will-pave-way-for-new-ai-services/",
    "text": " Home » Business » Microsoft, Vodafone 10-year partnership will pave way for new AI services Business   27 January 2024 Vodafone (NASDAQ: VOD) has signed a 10-year strategic partnership with Microsoft (NASDAQ: MSFT) to offer a suite of new digital products to enterprises, public sector organizations, and consumers. In an official disclosure, the U.K.-based telecommunications firm says the partnership will see both entities lean on their “respective strengths” to improve their offerings for consumers across Africa and Europe. One area of the partnership focuses on generative artificial intelligence (AI), with Vodafone pledging to invest $1.5 billion to develop new AI services with Microsoft over a 10-year window. Amid the push for cloud and AI innovation, Vodafone will leverage Microsoft’s generative AI offerings to improve its customer experience. “We are delighted that together with Vodafone we will apply the latest cloud and AI technology to enhance the customer experience of hundreds of millions of people and businesses across Africa and Europe, build new products and services, and accelerate the company’s transition to the cloud,” Microsoft CEO Satya Nadella said. Using Microsoft Azure OpenAI offering, Vodafone says it will personalize customers’ experience across its offering, including integration with TOBi, its brave attempt at rolling out a chatbot. To improve workplace productivity, Vodafone employees will be unfettered by Microsoft Copilot, with the company in pole position to receive priority access for new AI offerings. Outside of AI, the new partnership will see both firms pursue digital acceleration in Africa by targeting small and medium-scale enterprises (SMEs) on the continent. Microsoft’s solution is an attempt to scale the continent’s largest payment platform, M-Pesa, by hosting it on Azure and offering digital educational outreach. Vodafone and Microsoft are keen on pursuing enterprise growth and cloud transformation, with the telecom giant eyeing a pivot to virtual data centers to save operational costs. Vodafone says the move will improve its response times to customers, lower its energy consumption rates, and allow it to meet its sustainable business targets. A vital part of the plan is Microsoft’s intention to invest in Vodafone’s IoT connectivity platform, with the goal of floating it as a separate business by the start of Q2. In turn, Vodafone’s IoT platform will join Microsoft’s Azure ecosystem, which will offer myriad scaling benefits through open APIs. Microsoft’s red-hot partnership streak Microsoft has a streak of impressive partnerships under its belt, famously inking a $2 billion deal with professional services firm KPMG for AI research and development. At the tail end of 2023, a new deal with Siemens will see Microsoft pursue cross-industry AI adoption in manufacturing, healthcare, and transportation. The technology giant has similar partnerships with Australia and the U.K., pledging to invest in the digital economies of both nations via emerging technologies. In the U.K., Microsoft’s plan involves deploying over 20,000 GPUs over three years, supported by training initiatives to deepen the AI talent pool. In order for artificial intelligence (AI) to work right within the law and thrive in the face of growing challenges, it needs to integrate an enterprise blockchain system that ensures data input quality and ownership—allowing it to keep data safe while also guaranteeing the immutability of data. Check out CoinGeek’s coverage on this emerging tech to learn more why Enterprise blockchain will be the backbone of AI. Watch: What does blockchain and AI have in common? It’s data width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"> New to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology. As interest in digital asset investments grows, Deutsche Börse eyes developing a platform that would make tokenized assets fungible for institutional clients and boost its profit in the long run. Microsoft is ramping up its AI efforts as tech giants race to become the frontrunner in the industry, hiring key players from Inflection AI to spearhead its consumer AI arm. The ECB is establishing seven new ‘workstreams’ to develop the digital euro rulebook, and experts in payments infrastructure and architecture were encouraged to apply by April 5. Join the official Bitcoin SV Discord channel: www.discord.gg/bsv "
}