{
    "title": "AAPL, AMZN, MSFT: How to Play the Tech Giants Ahead of Earnings",
    "date": "1/23/2024",
    "url": "https://investorplace.com/2024/01/aapl-amzn-msft-how-to-play-the-tech-giants-ahead-of-earnings/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. These tech stocks are running into quarterly earnings over the coming weeks Advertisement Source: whiteMocca / Shutterstock It’s that time of year again: big-tech earnings season. With a fairly robust start to 2024, the tech behemoths may need to pull a surprising earnings beat out of a hat to get Mr. Market to nudge their share prices higher from current levels. Indeed, many analysts have mixed feelings about the three Magnificent Seven tech titans going into earnings. Sure, valuations seem a tad too extended as we enter earnings season. But if there are firms that can pole-vault past estimates and deliver positive surprises, it has to be members of the Magnificent Seven cohort. With earnings on tap for Apple (NASDAQ:AAPL), Amazon (NASDAQ:AMZN) and Microsoft (NASDAQ:MSFT) over the coming weeks, investors may be wondering which, if any, is worth pursuing ahead of their respective quarterly reveals. On the other hand, is it a better idea to wait until after the tech stocks share their earnings, given the stakes are higher after the market’s recent gains? Let’s find out. Apple started the year with a handful of analyst downgrades that weighed down its share price after a turbulent finish to 2023. Many unenthused analysts don’t expect much from the firm this year as iPhone sales continue to be underwhelming. Indeed, Apple remains a Magnificent Seven firm that’s continued to put up the returns, with more than 40% in gains over the past year. That said, it’s been outshined by many of its Magnificent Seven peers on the front of recent returns. And questions linger as to what could help iPhone 15 (and its coming iPhone 16) sales kick up a notch. Perhaps recent discounts in China could help boost iPhone 15 demand in an ultra-competitive market (Huawei is the force over in China) that’s faced more than its fair share of economic headwinds. In any case, don’t count on such efforts to impact the quarterly numbers due to be released in just over a week. With earnings ahead, I wouldn’t chase AAPL stock after its latest jump back to $193 and change. Though expectations are now relatively modest, I think it will take more than just better-than-expected numbers to move the needle higher. Perhaps some AI commentary could do the job? In recent sessions, Apple stock seems to be ascending again over hopes for some artificial intelligence (AI) announcement. Amazon’s momentum could continue through the year as it continues trimming its workforce in a bid to shore up financial firepower while also investing heavily in its generative AI projects. Over the past 12 months, shares of AMZN are up around 58%, a solid gain, even for a Magnificent Seven member. Though shares are still off nearly 16% from their all-time highs, I think it’s just a matter of time before new heights are reached as Amazon looks to gain the cloud with a bit of help from new AI tech. Additionally, hopes for a healthier consumer could help jolt the e-commerce business, which has taken a backseat to Amazon’s other initiatives of late. With layoffs sweeping through various Amazon subsidiaries (Twitch recently shed 35% of its staff), it certainly seems like the company is pushing to bolster profitability in this higher-rate environment. Even as rates come down again, I’d look for Amazon to be more deliberate in how it spends money on growth projects moving forward. Perhaps AI could receive more love than Amazon subsidiaries, like Twitch, that aren’t really helping Amazon pay the bills. All considered, I think Amazon has what it takes to impress for its coming quarter. However, I’d prefer waiting for a pullback, which may just happen post-earnings. I’m sure dip-buyers will be ready to pounce quickly. Microsoft stock is close to fresh new all-time highs, with shares just a few bucks below the $400 per-share mark. Going into earnings, expectations are going to be quite high. That’s to be expected for a firm that’s up more than 64% over the past year. With shares trading at 38.4 times trailing price-to-earnings (P/E), you’re going to be paying a hefty historical premium to play the tech titan ahead of earnings. Though Microsoft’s AI will pay more of the firm’s bills over time, I’m not so sure this past quarter is the one that will have AI written all over it. Microsoft Copilot still has a long way to go as it works its way into our favorite Microsoft software. In any case, the expensive AI gem could easily stand to become even more expensive after earnings. If you’re worried about MSFT stock getting away from you after posting its numbers, perhaps it makes sense to buy half a stake before and the other half after earnings. With the recent launch of the popular Xbox Game Pass title Palworld and the Activision Blizzard integration in full swing, it will be interesting to see what the firm has to say about its gaming ambitions during its conference call. On the date of publication, Joey Frenette held shares of Apple, Amazon and Microsoft. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Joey Frenette is a seasoned investment writer specializing in technology and consumer stocks. Contributing to the Motley Fool Canada, TipRanks, and Barchart, Joey excels in spotting mispriced stocks with long-term growth potential in a fast-paced market.   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/aapl-amzn-msft-how-to-play-the-tech-giants-ahead-of-earnings/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Crypto & Blockchain Market Analysis Stocks to Sell Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}