{
    "title": "Top Funds Kick Off 2024 With Huge Bet On MSFT Stock — And 1 Sector",
    "date": "1/5/2024",
    "url": "https://www.investors.com/etfs-and-funds/mutual-funds/msft-stock-leads-new-buys-by-best-mutual-funds-this-sector-sees-strong-demand/",
    "text": "BREAKING: Futures Mixed In the first list of new buys by the best mutual funds to close out 2023 and kick off 2024, leading money managers placed massive bets on MSFT stock, Broadcom (AVGO) and a host of top tech and other companies. But one sector commanded the most demand: building. Microsoft (MSFT) topped this monthly screen, raking in an estimated $17.4 billion. Microsoft holds the distinction of being the only one of the Magnificent Seven stocks to earn a spot on the IBD Long-Term Leaders list. The best mutual funds also scooped up just under $13 billion worth of shares in AVGO stock. Nine more stocks joined the billion-dollar club, including Lululemon Athletica (LULU), Arista Networks (ANET), Netflix (NFLX) and Costco Wholesale (COST). Last month, NFLX stock was featured on the IBD Breakout Stocks Index. Artificial intelligence leaders Adobe (ADBE) and Salesforce.com (CRM) also earned membership. Spearheading huge demand for the building sector, CRH (CRH) cemented its spot on the list as these savvy investors shoveled roughly $1.5 billion into the provider of building materials solutions. The links below highlight a portion of this month's new buys and sells by top funds. Click here to see all the stocks on the list. Magnificent Seven: Why Only MSFT Stock Is A Long-Term Leader Showing clear demand among the best mutual funds, the building sector accounted for 38 of the 200 companies on this month's list. Within the broad building sector, stocks showing institutional demand hailed from seven industry groups. The Construction Products/Miscellaneous group led, featuring 13 firms. Among them were Tecnoglass (TGLS), TopBuild (BLD), Core & Main (CNM) and Owens Corning (OC). Trane Technologies (TT), SmithAO (AOS) and AAON (AAON) joined five others in the A/C & Heating Products industry. On Wednesday, AAON was featured as an IBD 50 stock to watch because of its surging earnings growth in recent quarters. In the homebuilders group, PulteGroup (PHM), Toll Brothers (TOL) and Dream Finders Homes (DFH) were among six companies making the grade. Four industry peers joined CRH in the Cement/Concrete/Aggregates group, including Martin Marietta (MLM) and Summit Materials (SUM). As 2024 gets underway, demand for enterprise software stocks — driven by the AI boom — continues unabated. In addition to CRM stock, Palantir (PLTR), Workday (WDAY), Datadog (DDOG), Dynatrace (DT) and Shopify (SHOP) joined eight more companies in that industry group. A Jefferies analyst just downgraded PLTR stock, calling it \"overhyped on AI.\" In the related but Specialty Enterprise Software group, DoubleVerify (DV), HubSpot (HUBS), Atlassian (TEAM) and AppLovin (APP) made the cut, along with three others. Click here to see who joins PLTR stock, CRM, AVGO, NFLX, MSFT and all 200 names on this list of new buys by the best mutual funds. Follow Matthew Galgani on X (formerly Twitter) at @IBD_MGalgani. YOU MAY ALSO LIKE: Magnificent Seven Stocks Face These Questions As 2024 Kicks Off Magnificent Seven Stocks In 2024: Ready To Rock On — Or Roll Over? Stock Market Forecast 2024: A Soft Landing May Not Bring The Gains You Expect How To Invest In Magnificent Seven Stocks Like Nvidia In 2024 Spot Buy Points And Sell Signals With MarketSmith Pattern Recognition 3/24/2024\nThe dovish Fed and the Nvidia-led AI boom continue to be the big stock market catalysts. Uber and Eli Llly... 3/24/2024\nThe dovish Fed and the Nvidia-led AI boom continue to... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}