{
    "title": "Public Preview: Azure Business Continuity Center is now available in all \nregions | Azure-Updates",
    "date": "1/30/2024",
    "url": "https://azure.microsoft.com/de-de/updates/public-preview-azure-business-continuity-center-is-now-available-in-all-regions/",
    "text": "Dieser Browser wird nicht mehr unterstützt. Führen Sie ein Upgrade auf Microsoft Edge durch, um von den neuesten Features, Sicherheitsupdates und vom technischen Support zu profitieren. Entdecken Sie sichere, zukunftsweisende Cloudlösungen – lokal, hybrid, in einer Multi-Cloud-Umgebung oder am Edge. Erfahren Sie mehr über die nachhaltige, vertrauenswürdige Cloudinfrastruktur mit mehr Regionen als bei jedem anderen Anbieter. Erstellen Sie einen Business-Case für die Cloud mithilfe der finanziellen und technischen Unterstützung durch Azure. Definieren Sie Ihren Weg zur Umstellung auf die Cloud mit bewährten Tools, Anleitungen und Ressourcen. Finden Sie Beispiele für Innovationen von erfolgreichen Unternehmen jeder Größe und aus allen Branchen. Entdecken Sie die beliebtesten Azure-Produkte Virtuelle Windows- und Linux-Computer in Sekundenschnelle bereitstellen Sichere Remotedesktopnutzung von überall aus Migrieren, Modernisieren und Innovieren mit der modernen SQL-Familie von Clouddatenbankdiensten Schnelle NoSQL-Datenbank mit offenen APIs für jede Größenordnung Entwickeln und skalieren Sie Software mit Managed Kubernetes. Stellen Sie hochwertige KI-Modelle als APIs bereit Leistungsstarke Cloud-Apps für Web- und Mobilgeräte schnell erstellen Alles für die Entwicklung und den Betrieb eines Livespiels auf einer einzigen Plattform Ausführen ereignisgesteuerter serverloser Codefunktionen mit End-to-End-Entwicklungsumgebung Steigen Sie ein, und erkunden Sie eine vielfältige Auswahl heutiger Quantum-Hardware, -Software und -Lösungen. Infrastruktur, Apps und Azure Services überall schützen, entwickeln und betreiben Vereinfachen sie den Betrieb und die Verwaltung von der Cloud bis zum Edge mit einem KI-Begleiter Erstellen Sie Anwendungen der nächsten Generation – mit KI-Funktionen für jeden Entwickler und jedes Szenario Erstellen, Trainieren und Bereitstellen von Modellen – von der Cloud bis zum Edge Ihre Plattform für die Entwicklung von generativen KI-Lösungen und benutzerdefinierten Copiloten Ein Suchdienst auf Unternehmensniveau für die App-Entwicklung Anwenden erweiterter Programmier- und Sprachmodelle auf eine Vielzahl von Anwendungsfällen Vereinheitlichter Sprachdienst für Spracherkennung, Sprachsynthese und Sprachübersetzung Fügen Sie natürliche Sprachfunktionen mit einem einzelnen API-Aufruf hinzu. Einfach durchzuführende maschinelle Übersetzung mit einem einfachen REST-API-Aufruf Erkenntnisse aus Bild- und Videoinhalten mit KI gewinnen Beschleunigen Sie die Extraktion von Informationen aus Dokumenten Verwenden von KI, um aus Sicherheitsgründen Text- und Bildinhalte zu überwachen KI-basierte Erkenntnisse aus Videos extrahieren Daten jeglicher Art in beliebiger Menge oder Geschwindigkeit sammeln, speichern, verarbeiten, analysieren und visualisieren Analysedienst mit grenzenlosen Möglichkeiten und unerreichter Time-to-Insight Entwickeln Sie KI mit auf Apache Spark™ basierenden Analysen. Steuern, schützen und verwalten Sie Ihren Datenbestand Hybriddatenintegration auf Unternehmensebene leicht gemacht Cloudbasierte Hadoop-, Spark-, R Server-, HBase- und Storm-Cluster bereitstellen Echtzeitanalyse für blitzschnelle Streamingdaten Erstellen, Trainieren und Bereitstellen von Modellen – von der Cloud bis zum Edge Für Unternehmen geeignete Analyse-Engine-as-a-Service Skalierbare, sichere Data Lake-Funktionen für Hochleistungsanalysen Schneller und hochgradig skalierbarer Dienst zum Untersuchen von Daten Greifen Sie auf Daten und Erkenntnisse zu, verwalten Sie sie, und reagieren Sie darauf, indem Sie jede Datenquelle und jeden Analysedienst auf einer einzigen Plattform zusammenführen. Profitieren Sie von der Rechenpower der Cloud – und zahlen Sie nur, was Sie wirklich nutzen Virtuelle Windows- und Linux-Computer in Sekundenschnelle bereitstellen Tausende von virtuellen Linux- und Windows-Computern verwalten und hochskalieren Entwickeln und skalieren Sie Software mit Managed Kubernetes. Erstellen und Bereitstellen von Spring Boot-Anwendungen mit einem vollständig verwalteten Dienst von Microsoft und VMware Leistungsstarke Cloud-Apps für Web- und Mobilgeräte schnell erstellen Ausführen ereignisgesteuerter serverloser Codefunktionen mit End-to-End-Entwicklungsumgebung Ein dedizierter physischer Server zum Hosten Ihrer Azure-VMs für Windows und Linux Skalieren Sie die Auftragsplanung und die Verwaltung der Rechenleistung in der Cloud Migrieren Sie SQL Server-Workloads in die Cloud zu niedrigeren Gesamtbetriebskosten Bereitstellung nicht genutzter Computekapazität mit hohen Rabatten zum Ausführen unterbrechbarer Workloads Moderne Apps und Microservices mit serverlosen Containern erstellen und bereitstellen Optimieren Sie die Entwicklung mit sicheren, codefertigen Arbeitsstationen in der Cloud Entwickeln und verwalten Sie Ihre Containeranwendungen mit den integrierten Tools noch effizienter Entwickeln und skalieren Sie Software mit Managed Kubernetes. Vollständig verwalteter OpenShift-Dienst, der gemeinsam mit Red Hat betrieben wird Moderne Apps und Microservices mit serverlosen Containern erstellen und bereitstellen Ausführen ereignisgesteuerter serverloser Codefunktionen mit End-to-End-Entwicklungsumgebung Das Bereitstellen und Ausführen von containerisierten Web-Apps unter Windows und Linux war noch nie so einfach. Container ganz einfach in Azure ausführen – kein Servermanagement erforderlich Unter Windows oder Linux Microservices entwickeln und Container orchestrieren Speichern und verwalten Sie Containerimages für alle Arten von Bereitstellungen. Kubernetes-Cluster im großen Stil nahtlos verwalten Azure Kubernetes Service Edge Essentials is an on-premises Kubernetes implementation of Azure Kubernetes Service (AKS) that automates running containerized applications at scale. Rasantes Wachstum und hohes Innovationstempo dank vollständig verwalteter Datenbankdienste Migrieren, Modernisieren und Innovieren mit der modernen SQL-Familie von Clouddatenbankdiensten Schnelle NoSQL-Datenbank mit offenen APIs für jede Größenordnung Erstellen Sie skalierbare Anwendungen mit verwalteten und intelligenten SQL-Datenbanken in der Cloud Schnellere Innovation mit vollständig verwalteten, intelligenten und skalierbaren PostgreSQL-Lösungen Modernisieren Sie Microsoft SQL Server-Anwendungen mit einer verwalteten, stets aktuellen SQL-Instanz in der Cloud Vollständig verwaltete skalierbare MySQL-Datenbank Migrieren Sie SQL Server-Workloads in die Cloud zu niedrigeren Gesamtbetriebskosten Leistungsstärkere Anwendungen dank hohem Durchsatz und Datencaching mit geringer Latenz Accelerate your data migration to Azure Cassandra-Daten flexibel, kontrolliert und skalierbar in die Cloud verschieben Verwalteter MariaDB-Datenbankdienst für App-Entwickler Continuous Delivery mit einfachen und zuverlässigen Tools für noch schnellere Innovation Dienste für Teams, die gemeinsamen Code nutzen, Arbeitsschritte nachverfolgen und Software bereitstellen Führen Sie Builds, Tests und Bereitstellungen auf allen Plattformen und in der Cloud durch Arbeit teamübergreifend planen, verfolgen und erörtern Unbegrenzt viele private, in der Cloud gehostete Git-Repositorys für Ihr Projekt Pakete erstellen, hosten und mit dem Team teilen Zuverlässige Tests und Lieferungen mit einem Testtoolkit für manuelle und explorative Tests So erstellen Sie schnell Umgebungen mithilfe von wiederverwendbaren Vorlagen und Artefakten Bevorzugte DevOps-Tools mit Azure verwenden Vollständiger Einblick in Ihre Apps, Ihre Infrastruktur und Ihre Netzwerke Optimieren der App-Leistung mit umfangreichen Auslastungstests Schnelles Einrichten von App-Infrastrukturumgebungen mit projektbasierten Vorlagen Entwicklung, Verwaltung und Continuous Delivery für Cloudanwendungen. Egal welche Plattform, egal, welche Sprache Die leistungsstarke und flexible Umgebung für die Entwicklung von Anwendungen in der Cloud Ein leistungsstarker, schlanker Code-Editor für die Cloudentwicklung Weltweit führende Entwicklerplattform mit nahtloser Integration in Azure Umfassende Sammlung von Ressourcen zum Erstellen, Bereitstellen und Verwalten von Apps Leistungsstarke Low-Code-Plattform zur schnellen Erstellung von Apps Alle SDKs und Befehlszeilentools, die Sie brauchen Kontinuierliches Erstellen, Testen, Veröffentlichen und Überwachen von mobilen Apps und Desktop-Apps Vollständiger Einblick in Ihre Apps, Ihre Infrastruktur und Ihre Netzwerke Optimieren der App-Leistung mit umfangreichen Auslastungstests Schnelles Einrichten von App-Infrastrukturumgebungen mit projektbasierten Vorlagen Optimieren Sie die Entwicklung mit sicheren, codefertigen Arbeitsstationen in der Cloud Nutzen Sie Azure-Innovationen überall – Profitieren Sie von der Flexibilität und Innovation des Cloud Computing für Ihre lokalen Workloads. Infrastruktur, Apps und Azure Services überall schützen, entwickeln und betreiben Cloudnative SIEM-Lösungen und intelligente Sicherheitsanalysen für den Schutz Ihres Unternehmens Erstellen und Ausführen innovativer Hybrid-Apps über Cloudgrenzen hinweg Dedizierte private Glasfaserverbindungen mit Azure Lokale Verzeichnisse synchronisieren und das einmalige Anmelden aktivieren Migrieren, Modernisieren und Innovieren mit der modernen SQL-Familie von Clouddatenbankdiensten Dienste für Teams, die gemeinsamen Code nutzen, Arbeitsschritte nachverfolgen und Software bereitstellen Schnellere Innovation mit vollständig verwalteten, intelligenten und skalierbaren PostgreSQL-Lösungen Erweitern Sie Cloud Intelligence und Analytics auf durch Azure IoT Hub verwaltete Edgegeräte Vollständiger Einblick in Ihre Apps, Ihre Infrastruktur und Ihre Netzwerke Verwalten Sie Benutzeridentitäten und Zugriffsrechte zum Schutz vor komplexen Bedrohungen für Geräte, Daten, Apps und Infrastruktur Identitäten und Zugriff von Endverbrauchern in der Cloud verwalten Virtuelle Azure-Computer ohne Domänencontroller in eine Domäne einbinden Integrieren Sie im Unternehmen nahtlos lokale und cloudbasierte Anwendungen, Daten und Prozesse Automatisieren Sie den Cloudzugriff und die cloudübergreifende Nutzung von Daten. Verbindung zwischen privaten und öffentlichen Cloudumgebungen APIs für Entwickler, Partner und Mitarbeiter sicher und in großem Umfang veröffentlichen Zuverlässige Nachrichtenzustellung im großen Stil Reduzieren Sie Zeit, Risiken und Kosten für die Erforschung und Produktion von Energie Azure Data Manager für Landbau erweitert die Microsoft Intelligent Data Platform um branchenspezifische Datenconnectors und -funktionen, um landwirtschaftliche Daten aus unterschiedlichen Quellen zusammenzuführen. So können Unternehmen qualitativ hochwertige Datensätze nutzen und die Entwicklung digitaler Agrarlösungen beschleunigen Verbinden Sie Ressourcen oder Umgebungen, gewinnen Sie Erkenntnisse, und fördern Sie sachkundige Aktionen, um Ihr Unternehmen zu transformieren. Gewinnen Sie Erkenntnisse, um intelligente lokale Aktionen und globale Sichtbarkeit zu erreichen. Aktiviert durch Azure Arc Verbinden, überwachen und verwalten Sie Milliarden von IoT-Assets Entwickeln Sie IoT-Lösungen der nächsten Generation, die ganze Umgebungen in Echtzeit modellieren Erweitern Sie Cloud Intelligence und Analytics auf durch Azure IoT Hub verwaltete Edgegeräte Vom Proof of Concept (Konzeptnachweis) zum Proof of Value (Wertnachweis) wechseln Erstellen, Verbinden und Verwalten geschützter intelligenter IoT-Geräte von Edge bis zur Cloud Erstellen Sie intelligente Edgelösungen mit erstklassigen Entwicklertools, langfristigem Support und Sicherheit auf Unternehmensniveau. Die Entwicklung eingebetteter IoT-Anwendungen und die Konnektivität vereinfachen Verwenden eines Diensts auf Unternehmensniveau für den End-to-End-Machine Learning-Lebenszyklus Standortdaten hinzufügen undVisuals zu Geschäftsanwendungen und -lösungen zuordnen Vereinfachen, automatisieren und optimieren Sie die Verwaltung Ihrer Cloudressourcen und deren Konformität Sämtliche Azure-Produkte in einer einzigen einheitlichen Konsole erstellen, verwalten und überwachen Steuern, schützen und verwalten Sie Ihren Datenbestand Jederzeit und überall mit Ihren Azure Ressourcen in Verbindung bleiben Azure-Verwaltung durch eine browserbasierte Shell optimieren Ihr personalisiertes Azure-Empfehlungsmodul mit Best Practices Datensicherheit vereinfachen und Daten vor Ransomware schützen Überwachen, Zuordnen und Optimieren von Cloudkosten mit Transparenz, Genauigkeit und Effizienz. Unternehmensgovernance und Standards im großen Stil implementieren Aufrechterhalten der Geschäftskontinuität mit integriertem Notfallwiederherstellungsdienst Verbessern Sie die Resilienz von Anwendungen, indem Sie Fehler einführen und Ausfälle simulieren. Vollständiger Einblick in Ihre Apps, Ihre Infrastruktur und Ihre Netzwerke Liefern Sie Videoinhalte in höchster Qualität – überall, jederzeit und auf jedem Gerät Audio- und Videoinhalte nach Maß verschlüsseln, speichern und streamen Codierung in Studioqualität für die Cloud Ein einzelner Player für alle Wiedergabeanforderungen Content Streaming auf jedes Gerät im Unternehmen. Auch für anspruchsvollste Anwendungsfälle Inhalte mit AES, PlayReady, Widevine und Fairplay sicher bereitstellen Schnelles, zuverlässiges Content Delivery Network mit globaler Reichweite Vereinfachen und beschleunigen Sie die Migration in die Cloud mithilfe von Leitfäden, Tools und Ressourcen. Vereinfachen Sie Migration und Modernisierung mit einer einheitlichen Plattform Aufrechterhalten der Geschäftskontinuität mit integriertem Notfallwiederherstellungsdienst Accelerate your data migration to Azure Appliances und Lösungen für die Datenübertragung zu Azure und das Edgecomputing Überwachen, Zuordnen und Optimieren von Cloudkosten mit Transparenz, Genauigkeit und Effizienz. Verbinden Sie die physische Welt mit der digitalen, und erschaffen Sie packende Umgebungen für die Zusammenarbeit. Mixed Reality-Erfahrungen für mehrere Benutzer mit räumlichem Bezug erstellen Rendern Sie hochwertige interaktive 3D-Inhalte, und streamen Sie sie in Echtzeit auf Ihre Geräte. Entwickeln Sie IoT-Lösungen der nächsten Generation, die ganze Umgebungen in Echtzeit modellieren Erstellen Sie Modelle für maschinelles Sehen und Spracheingabe mit einem Entwicklerkit mit fortschrittlichen KI-Sensoren. Sie können 3D-Inhalte automatisch an Objekten in der physischen Welt ausrichten und verankern. Erstellen und implementieren Sie plattformübergreifende und native Apps für jedes mobile Gerät Pushbenachrichtigungen an jede Plattform und von jedem Back-End aus senden Kontinuierliches Erstellen, Testen, Veröffentlichen und Überwachen von mobilen Apps und Desktop-Apps Cloudfähige mobile Apps noch schneller erstellen Standortdaten hinzufügen undVisuals zu Geschäftsanwendungen und -lösungen zuordnen APIs für Entwickler, Partner und Mitarbeiter sicher und in großem Umfang veröffentlichen Ein Suchdienst auf Unternehmensniveau für die App-Entwicklung Stellen Sie hochwertige KI-Modelle als APIs bereit Mixed Reality-Erfahrungen für mehrere Benutzer mit räumlichem Bezug erstellen Leistungsstarke Cloud-Apps für Web- und Mobilgeräte schnell erstellen Erstellen von Multichannelkommunikationsumgebungen Bieten Sie Ihren Kunden und Benutzern höchste Servicequalität – durch Vernetzung von Cloud- und lokaler Infrastruktur und Diensten Erstellen Sie Ihre eigene private Netzwerkinfrastruktur in der Cloud. Sichere, skalierbare und hochverfügbare Web-Front-Ends in Azure erstellen Dedizierte private Glasfaserverbindungen mit Azure Schützen Ihrer Azure Virtual Network-Ressourcen mit cloudnativer Netzwerksicherheit Privater Zugriff auf in Azure gehostete Dienste, sodass Ihre Daten im Microsoft-Netzwerk verbleiben Entdecken Sie die Azure-Lastenausgleichsdienste, und nutzen Sie das benutzerfreundliche Dienstauswahltool, um die geeignete Lösung für Ihre Workloads zu finden Sichere, standortübergreifende Verbindungen einrichten Schützen Sie Ihre Azure-Ressourcen vor verteilten Denial-of-Service-Angriffen (Distributed Denial-of-Service, DDoS). Hosten Sie Ihr Domain Name System (DNS-Domäne) in Azure Modernes Cloud-CDN, das Ihren Benutzern überall optimierte Erfahrungen bietet Konnektivität zwischen Zweigstellen über Azure optimieren und automatisieren Ein cloudnativer Web Application Firewall-Dienst (WAF) für einen leistungsstarken Schutz von Web-Apps Schützen Sie Ihr Unternehmen vor komplexen Bedrohungen Ihrer Hybridcloud-Workloads Cloudnative SIEM-Lösungen und intelligente Sicherheitsanalysen für den Schutz Ihres Unternehmens Sichere, skalierbare und hochverfügbare Web-Front-Ends in Azure erstellen Schlüssel und andere Geheimnisse schützen und unter Kontrolle halten Sichere, standortübergreifende Verbindungen einrichten Schützen Sie Ihre Azure-Ressourcen vor verteilten Denial-of-Service-Angriffen (Distributed Denial-of-Service, DDoS). Vollständig verwalteter Dienst, der den Remotezugriff auf Ihre virtuellen Computer schützt Ein cloudnativer Web Application Firewall-Dienst (WAF) für einen leistungsstarken Schutz von Web-Apps Schützen Ihrer Azure Virtual Network-Ressourcen mit cloudnativer Netzwerksicherheit Zentrale Verwaltung von Netzwerksicherheitsrichtlinien und Routen für global verteilte softwaredefinierte Umkreise Erhalten Sie sicheren, skalierbaren Cloudspeicher für Ihre Daten, Apps und Workloads Hochgradig leistungsfähiger, langlebiger Blockspeicher Skalierbare, sichere Data Lake-Funktionen für Hochleistungsanalysen Einfache, sichere und serverlose Dateifreigaben in der Cloud für Unternehmen Azure-Dateifreigaben im Unternehmen, unterstützt von NetApp Datensicherheit vereinfachen und Daten vor Ransomware schützen Hochgradig skalierbarer und sicherer Objektspeicher Appliances und Lösungen für die Datenübertragung zu Azure und das Edgecomputing Branchenführendes Preisniveau für die Speicherung selten benötigter Daten Elastic SAN ist ein cloudnativer SAN-Dienst (Storage Area Network), der auf Azure basiert. Erhalten Sie Zugriff auf eine End-to-End-Erfahrung wie Ihr lokales SAN. Verwalten persistenter Volumes für zustandsbehaftete Containeranwendungen Azure Managed Lustre ist ein vollständig verwaltetes, cloudbasiertes paralleles Dateisystem, mit dem Kunden ihre Hochleistungs-Computing(HPC)-Workloads in der Cloud ausführen können. Vereinfachen Sie Aufgaben zur Datenverwaltung von Speichern in großem Umfang Leistungsstarke Webanwendungen – schnell und effizient erstellen, implementieren und skalieren Erstellen und implementieren Sie unternehmenskritische Web-Apps im großen Stil. APIs für Entwickler, Partner und Mitarbeiter sicher und in großem Umfang veröffentlichen Schnelles, zuverlässiges Content Delivery Network mit globaler Reichweite Ein Suchdienst auf Unternehmensniveau für die App-Entwicklung Echtzeit-Webfunktionen ganz einfach hinzufügen Mithilfe von WebSockets und dem Publish-Subscribe-Muster (Veröffentlichen/Abonnieren) können Sie unkompliziert Anwendungen für Echtzeitmessaging entwickeln Standortdaten hinzufügen undVisuals zu Geschäftsanwendungen und -lösungen zuordnen Ein moderner Web-App-Dienst, der die gesamte Entwicklung vom Quellcode bis hin zur Hochverfügbarkeit optimiert. Erstellen von Multichannelkommunikationsumgebungen Optimieren der App-Leistung mit umfangreichen Auslastungstests Zusammenarbeitserfahrungen in Echtzeit ganz einfach zu Ihren Apps mit Fluid Framework hinzufügen Moderne Apps und Microservices mit serverlosen Containern erstellen und bereitstellen Die beste virtuelle Desktopumgebung – in Azure Sichere Remotedesktopnutzung von überall aus Bereitstellen von Windows-Desktops und -Apps mit VMware und Azure Virtual Desktop Bereitstellen von Windows-Desktops und -Apps in Azure mit Citrix und Azure Virtual Desktop Einrichten virtueller Labs für Kurse, Schulungen, Hackathons und andere vergleichbare Szenarien Optimieren Sie die Entwicklung mit sicheren, codefertigen Arbeitsstationen in der Cloud Entwicklung, Verwaltung und Continuous Delivery für Cloud-Apps – unabhängig von Plattform oder Sprache Bildanalysen, Sprachverständnis und Vorhersagen auf Grundlage von Daten Vereinfachen und beschleunigen Sie Ihre Migration und Modernisierung mit Leitfäden, Tools und Ressourcen. Daten jeglicher Art in beliebiger Menge oder Geschwindigkeit sammeln, speichern, verarbeiten, analysieren und visualisieren Erweitern Sie Ihre lokalen Workloads um die Agilität und die Innovationskraft der Cloud. Verbinden, überwachen und steuern Sie Geräte mit sicheren, skalierbaren und offenen Edge-to-Cloud-Lösungen. Leisten Sie mit vertrauenswürdigen Sicherheitsdiensten einen Betrag zum Schutz von Daten, Apps und Infrastruktur Erleichtern und beschleunigen Sie das Entwickeln und Testen (Dev/Test) für alle Plattformen. Bringen Sie Menschen, Prozesse und Produkte zusammen, um für Kunden und Kollegen einen kontinuierlichen Mehrwert zu schaffen. Erstellen Sie sichere Apps auf einer vertrauenswürdigen Plattform. Betten Sie die Sicherheit in Ihren Entwicklerworkflow ein, und fördern Sie die Zusammenarbeit zwischen Entwicklern, Sicherheitsexperten und IT-Operatoren. Bieten Sie Ihren Kunden genau, was sie brauchen: ein personalisiertes, skalierbares und sicheres Einkaufserlebnis. Mit den richtigen Tools machen Sie schneller Anwendungen aus Ihren Ideen. Entwickeln Sie zuverlässige Apps und Funktionen im großen Umfang, und bringen Sie diese schneller auf den Markt. Bieten Sie Ihre mobile App Kunden weltweit an – mit nur einem Build für alle Geräte. Reagieren Sie schneller auf Änderungen, optimieren Sie die Kosten, und liefern Sie zuverlässig. Da Sie keine Infrastruktur verwalten müssen, können Sie Apps jetzt noch schneller erstellen. Verbinden Sie moderne Anwendungen mit verschiedenen Messagingdiensten in Azure Beschleunigen Sie die Markteinführungszeit, bieten Sie innovative Erfahrungen, und verbessern Sie die Sicherheit mit der Modernisierung von Azure-Anwendungen und -Daten. Nutzen Sie Business Insights und intelligente Features von Azure, um Software-as-a-Service-Apps (SaaS) zu erstellen. Wechseln Sie schneller zu einem SaaS-Modell mit einem Kit aus vordefiniertem Code, Vorlagen und modularen Ressourcen. Erkunden Sie Dienste, die Sie beim Entwickeln und Ausführen von Web3-Anwendungen unterstützen. Entwickeln Sie unternehmenswichtige Lösungen, um Bilder zu analysieren, Sprache zu verstehen und Vorhersagen aus Daten zu treffen. Gewinnen Sie mithilfe von KI ganz neue Erkenntnisse aus Ihrem Geschäftsdatenbestand. Schützen Sie Ihre Daten und Ihren Code während der Verwendung in der Cloud. Erstellen Sie Machine Learning-Modelle schneller mit Hugging Face in Azure. Sparen Sie Geld, und verbessern Sie die Effizienz, indem Sie Ihre Workloads mithilfe bewährter Tools und Leitfäden zu Azure migrieren. Optimieren Sie Kosten, arbeiten Sie zuversichtlich, und bringen Sie Features schneller auf den Markt, indem Sie Ihre ASP.NET-Web-Apps zu Azure migrieren. Erleichtern und beschleunigen Sie das Entwickeln und Testen (Dev/Test) für alle Plattformen. Nutzen Sie die erweiterte Sicherheit und Hybridfunktionen für Ihre unternehmenskritischen Linux-Workloads. Reduzieren Sie die Infrastrukturkosten, indem Sie Ihre Mainframe- und Midrange-Apps zu Azure migrieren. Erweitern Sie SAP-Anwendungen und schaffen Sie Innovationen in der Cloud, der SAP vertraut. Verschieben Sie Ihre SQL Server-Datenbanken mit nur wenigen oder keinen Änderungen am Anwendungscode zu Azure. Migrieren Sie Ihre Windows Server-Workloads zu Azure, um Innovation und Sicherheit zu fördern. Schützen Sie Ihre Daten und Ihren Code während der Verwendung in der Cloud. Beschleunigen Sie die Markteinführungszeit, bieten Sie innovative Erfahrungen, und verbessern Sie die Sicherheit mit der Modernisierung von Azure-Anwendungen und -Daten. Integrieren Sie Anwendungen, Systemen und Daten für Ihr Unternehmen nahtlos. Ihre Oracle-Datenbank- und -Unternehmensanwendungen in Azure ausführen. Migrieren Sie MongoDB-Workloads in die Cloud, und modernisieren Sie die Dateninfrastruktur mit MongoDB Atlas in Azure. Maximieren Sie den Cloudgeschäftswert für Ihre Organisation, indem Sie Azure-Produkte und -Dienste nutzen, um bewährte FinOps-Methoden zu implementieren, die die Optimierung der Cloudkosten unterstützen können. Erstellen Sie cloudnative Anwendungen, oder modernisieren Sie vorhandene Anwendungen mit vollständig verwalteten, flexiblen Datenbanken. Treffen Sie schneller und effizienter Entscheidungen, indem Sie fundiertere Erkenntnisse aus Analysen gewinnen. Verkürzen Sie die Zeit Time-to-Insight mit einer umfassenden Cloudanalyselösung. Minimieren Sie Unterbrechungen des Geschäftsbetriebs mit kostengünstigen Lösungen für die Sicherung und Notfallwiederherstellung. Erhalten Sie vollständig verwaltete Supercomputer mit nur einem Mandanten, einschließlich Hochleistungsspeicher und ohne Datenverschiebung. Sorgen Sie für Innovationen in allen Bereichen Ihrer Hybridumgebung – lokal, für mehrere Clouds und am Edge. Netzwerke, Anwendungen und Dienste mit extrem niedriger Latenz im Unternehmensedge bereitstellen Führen Sie Ihre unternehmenskritischen Anwendungen für eine gesteigerte betriebliche Flexibilität und Sicherheit in Azure aus. Nutzen Sie noch heute den Quanteneffekt, indem Sie von den Vorteilen des weltweit ersten umfassenden Cloudökosystems für Quantencomputing profitieren. Stellen Sie Netzwerke, Anwendungen und Dienste mit extrem geringer Latenz am Edge des Mobilfunkanbieters bereit. Erkunden Sie Dienste, die Sie beim Entwickeln und Ausführen von Web3-Anwendungen unterstützen. Bringen Sie Azure mit nahtloser Netzwerkintegration und Konnektivität an den Edge, um moderne verbundene Apps bereitzustellen. Migrieren Sie Ihre Windows Server-Workloads zu Azure, um Innovation und Sicherheit zu fördern. Verbinden Sie Geräte, analysieren Sie Daten, und automatisieren Sie Prozesse mit sicheren, skalierbaren und offenen Edge-to-Cloud-Lösungen. Erstellen Sie offene, interoperable IoT-Lösungen, die Industriesysteme schützen und immer auf dem neuesten Stand halten. Schützen Sie physische Arbeitsumgebungen mit skalierbaren IoT-Lösungen, die für eine schnelle Bereitstellung entwickelt wurden. IoT-Technologien unterstützen Sie dabei, umweltbedingte Nachhaltigkeitsziele zu erfüllen und Umweltschutzprojekte zu beschleunigen. Sorgen Sie für Konformität dank integrierter Funktionen für Cloudgovernance. Minimieren Sie Unterbrechungen des Geschäftsbetriebs mit kostengünstigen Lösungen für die Sicherung und Notfallwiederherstellung. Schützen Sie Ihre Daten und Ihren Code während der Verwendung in der Cloud. Cloudnative Netzwerksicherheit für Ihre Anwendungen, Ihr Netzwerk und Ihre Workloads. Erkunden Sie Dienste, die Sie beim Entwickeln und Ausführen von Web3-Anwendungen unterstützen. Einfacher Einstieg, schlanke Prozesse, garantierte Agilität und schnelles Wachstum mit Azure für Startups Beschleunigen Sie Geschäftsauswirkungen, befeuern Sie Innovationen, und optimieren Sie die Effizienz – mit Sicherheit der Spitzenklasse. Finden Sie Referenzarchitekturen, Beispielszenarios und Lösungen für häufig verwendete Workloads in Azure. Schaffen Sie mehr mit weniger – erkunden Sie Ressourcen, um Effizienz zu erhöhen, Kosten zu senken und Innovationen zu fördern Nutzen Sie den umfangreichen Katalog mit mehr als 17.000 zertifizierten Apps und Diensten. Definieren Sie Ihren Weg zur Umstellung auf die Cloud mit bewährten Tools, Anleitungen und Ressourcen. Profitieren Sie in jeder Phase Ihrer Cloud Journey vom optimalen Preis-Leistungs-Verhältnis Erfahren Sie, für welche Dienste kostenlose monatliche Kontingente angeboten werden. Bezahlen Sie nur für das, was Sie nutzen, und profitieren Sie von kostenlosen Diensten. Finden Sie die besten Optionen für sich. Entdecken Sie Sonderangebote, Vorteile und Anreize. Kosten für Azure-Produkte und -Dienste schätzen Schätzen Sie Ihre Gesamtbetriebskosten und Kosteneinsparungen. Erfahren Sie, wie Sie Ihre Cloudausgaben verwalten und optimieren können. Lernen Sie den Nutzen und die wirtschaftlichen Vorteile einer Migration zu Azure kennen. Suchen, testen und erwerben Sie vertrauenswürdige Apps und Dienste. Starten Sie mit der Unterstützung eines erfahrenen Partners in der Cloud durch Die neuesten Inhalte, Nachrichten und Anleitungen finden, um Kunden in die Cloud zu führen Entwickeln, erweitern und skalieren Sie Ihre Apps auf einer vertrauenswürdigen Cloudplattform. Erhalten Sie kostenlose Tools und Anleitungen, um Lösungen zu erstellen, sie im Marketplace zu veröffentlichen und Millionen von Kunden zu erreichen. In the contemporary digital landscape, the establishment of robust business continuity strategies is imperative for organizations navigating the complexities of technology. Given the heavy reliance on digital infrastructure, fortifying these systems against potential disruptions is crucial. In response to this challenge, we are thrilled to introduce the Public Preview of Azure Business Continuity (ABC) Center a groundbreaking initiative designed to enhance your business's resilience across all regions. With the Azure Business Continuity Center, enterprises can seamlessly govern, monitor, operate, and analyze protection at scale. This release includes support for the following key features: Learn more about ABC Center to understand how it can revolutionize your business continuity journey for the resources "
}