{
    "title": "Microsoft's OpenAI investment could trigger EU merger review | Associated \nPress",
    "date": "1/13/2024",
    "url": "https://businessmirror.com.ph/2024/01/13/microsofts-openai-investment-could-trigger-eu-merger-review/",
    "text": "LONDON—Microsoft’s multibillion-dollar investment in ChatGPT-maker OpenAI could trigger a European Union merger investigation, the bloc’s executive branch said on Tuesday. The European Commission said it’s “checking whether Microsoft’s investment in OpenAI might be reviewable” under regulations covering mergers and acquisitions that would harm competition in the 27-nation EU. The review could lead to a formal investigation into whether the deal should be unconditionally cleared, allowed with concessions from the companies or blocked. Britain’s antitrust watchdog opened a similar review last month. Antitrust enforcers in the US also have signaled concerns about competition in the AI industry. The Federal Trade Commission in November approved new measures enabling it to easily investigate AI products and services, noting that “AI can raise competition issues in a variety of ways, including if one or just a few companies control the essential inputs or technologies that underpin AI.” OpenAI has received several rounds of funding from Microsoft, including an initial $1 billion in 2019 and a multibillion-dollar investment last year. OpenAI’s generative AI chatbot ChatGPT has captured world attention with its advanced capabilities, catapulting the San Francisco-based startup to the top ranks of AI companies. Generative AI systems like ChatGPT can spit out new text, images, videos or audio recordings based on prompts from users. The European Commission, the bloc’s top antitrust enforcer, is asking businesses and experts for input on any competition issues that they see in generative AI and has asked “several large digital players”—which it didn’t identify—for information. The commission is “also closely monitoring AI partnerships to ensure they do not unduly distort market dynamics,” the EU’s antitrust enforcer, Margrethe Vestager, said in a press release. Vestager is due to meet with OpenAI executives on a trip this week to the US, as well as Google CEO Sundar Pichai, Apple CEO Tim Cook and Nvidia CEO Jensen Huang. AP Image credits: AP \n\n\n\n\n0\n\n\n\n\n\n0\n\n\n\n\n\n0\n\n\n\n\n\n0\n\n\n\n\n\n\n\n\n\nShare\n0\n\n\n\n\n\nTweet\n0\n\n\n\n\n\nPin it\n0\n\n\n\n\n\nShare\n0 0\n\n\n\n\n\n0\n\n\n\n\n\n0\n\n\n\n\n\n0\n\n\n\n\n\n\n\n\n\nShare\n0\n\n\n\n\n\nTweet\n0\n\n\n\n\n\nPin it\n0\n\n\n\n\n\nShare\n0 Input your search keywords and press Enter. "
}