{
    "title": "Microsoft fires almost 2, 000 employees in \"painful decision\"",
    "date": "1/26/2024",
    "url": "https://mpasho.co.ke/entertainment/2024-01-26-microsoft-fires-almost-2-000-employees-in-painful-decision/",
    "text": "• Microsoft video games division lays off 1,900 staff • In the letter, verified as genuine by Microsoft, Mr Spencer says losing staff was a \"painful decision\". Almost 2,000 workers in Microsoft's gaming division are to be laid off after its $69bn (£54.3bn) merger deal. A memo from Xbox boss Phil Spencer to workers says the company plans to shed 1,900 of its 22,000 staff. It was sent three months after the software giant acquired Activision-Blizzard, known for the Call of Duty and Warcraft series. In the letter, verified as genuine by Microsoft, Mr Spencer says losing staff was a \"painful decision\". First published by tech website The Verge, the message suggests staff within the Xbox division and at publisher Zenimax - which oversees studios including Bethesda and Arkane - will also be affected. BBC Newsbeat has asked Microsoft for details of how many employees in each business will be affected. A second letter, also published by the Verge and verified by Microsoft, was sent to Blizzard staff from Microsoft Studios head Matt Booty. He said meetings with affected staff would take place throughout the day, with workers outside North America being informed later. The message also echoed Mr Spencer's, saying the company \"would provide our full support... including severance benefits informed by local employment laws\". It also confirmed that development on a survival game project widely known as Odyssey had stopped. Microsoft finally purchased Activision-Blizzard and Candy Crush creator King last September after a series of battles with regulators. After the deal went through, Activision CEO Bobby Kotick left the company and was not directly replaced. And in the wake of the latest news, another senior figure at the company announced he was departing. Blizzard boss Mike Ybarra, who previously worked at Microsoft, said in a statement it had been \"an honour\" to lead the company \"through an incredible time\" and he would return to being its \"biggest fan from the outside\". The video game industry has been hit by a string of layoffs already this year, following a series of redundancy announcements in 2023. Earlier this week Riot Games, which makes League of Legends, announced it was shedding 11% of its global workforce. It followed 1,800 job losses at game engine maker Unity, 500 layoffs at Amazon-owned streaming platform Twitch, and redundancy rounds at smaller studios. Estimates put the total number of gaming industry job losses last year at more than 10,000, although the true total is thought to be higher. Experts believe the cost-of-living crisis and the games industry scaling back after a boost from the Covid pandemic have played a large part in the trend. The wider tech sector also saw big cuts, and Microsoft itself announced 10,000 job losses last January across the wider company, with Amazon, Meta and others also losing staff. The BBC has asked Microsoft for further comment on the redundancies in its gaming division. Check out the latest news here and you are welcome to join our super exclusive Mpasho WhatsApp group for all the latest and breaking news in entertainment. We would also like to hear from you, WhatsApp us on +254 736 944935. "
}