{
    "title": "Microsoft overtakes Apple as the world’s most valuable company",
    "date": "1/22/2024",
    "url": "https://theboar.org/2024/01/micapple/",
    "text": "Microsoft (MSFT) has surpassed Apple (AAPL) to claim the title of the world’s most valuable company in market capitalisation. The Redmond, Washington-based software giant saw a 1% increase to $388.47 on Friday, concluding with a market valuation of $2.89 trillion. In comparison, Apple experienced a 0.2% increase and concluded with a market capitalisation of $2.87 trillion. This marks the first instance since November 2021 that Microsoft has closed with a higher value than Apple. This achievement is attributed to Microsoft’s intensified focus on generative artificial intelligence (AI), a sector gaining growing favour among investors. This marks the first instance since November 2021 that Microsoft has closed with a higher value than Apple In early 2023, Microsoft made a significant move by unveiling a multiyear investment of $10 billion in Sam Altman’s OpenAI, the groundbreaking startup responsible for ChatGPT. Integrating OpenAI’s technology into its suite of productivity software, Microsoft successfully catalysed a resurgence in its cloud-computing business during the July-September quarter. Unlike Microsoft, which along with Nvidia and Amazon saw a substantial market surge in AI, Apple has notably lagged behind in this regard. This decline is particularly evident in China, a key market, where slow economic recovery from the COVID-19 pandemic is contributing to reduced demand for iPhones. Additionally, heightened competition from a resurgent Huawei is substantially impacting Apple’s market share. D.A. Davidson Analyst, Gil Luria told Reuters, “It was inevitable that Microsoft would overtake Apple since Microsoft is growing faster and has more to benefit from the generative AI revolution”. Looking at recent developments, at least 3 out of 41 analysts covering Apple have lowered their ratings since the beginning of 2024. In contrast, Microsoft enjoys a favourable outlook on Wall Street with no “sell” ratings and almost 90% of brokerages recommending buying the stock. Apple, on the other hand, has two “sell” ratings, with only two-thirds of analysts rating it as a “buy”. “China could be a drag on performance over the coming years”, brokerage Redburn Atlantic said in a client note on Wednesday, downgrading Apple’s shares to “neutral”. Looking at recent developments, at least 3 out of 41 analysts covering Apple have lowered their ratings since the beginning of 2024 This ongoing competition between Microsoft and Apple for the title of the most valuable public company has been a persistent narrative, with positions frequently swapping in recent years. The rivalry between these tech giants can be traced back to the 1980s, when Apple, co-founded by Steve Jobs and Steve Wozniak, accused Bill Gates’ Windows maker of appropriating the “Look and feel” of its Macintosh computer software. In the early 1990s, Apple faced a setback in a high-profile copyright lawsuit against Windows, paving the way for Microsoft to dominate the PC market for decades. However, fueled by the success of the iPhone, Apple’s market value surpassed Microsoft’s in 2010 – a position it has maintained for several years as Windows grappled with the transition to mobile computing. However, Microsoft briefly surged ahead of Apple during the COVID-19 pandemic in 2020 and 2021, leveraging its strength in cloud computing amid the remote working boom, but Apple swiftly reclaimed the top spot on both occasions. Microsoft’s ascension to the top spot highlights that Apple has ground to cover. While OpenAI’s ChatGPT soared to prominence last year, Apple remained relatively inactive. Both Google and Microsoft Corp. introduced generative AI iterations of their search engines, producing responses with striking human-like qualities. In addition, Microsoft further enhanced its Windows applications with intelligent assistants, and Amazon.com Inc. revealed an AI-infused revamp of Alexa. Meanwhile, the most noteworthy AI release from Apple was an enhanced auto-correct system in iOS 17. Despite indications that Apple is working on an in-house large language model, the company is faced with the task of catching up in the rapidly evolving field of artificial intelligence. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. © 2024 Copyright The Boar. Powered by\t\t\t\tTom, Hamish & Aaron. "
}