{
    "title": "Market Highlights: Bitcoin up again, Microsoft makes another huge AI bet, \nand 5 ASX small caps to watch",
    "date": "2/28/2024",
    "url": "https://stockhead.com.au/news/market-highlights-bitcoin-up-again-microsoft-makes-another-huge-ai-bet-and-5-asx-small-caps-to-watch/",
    "text": "Microsoft makes another huge AI bet. Picture Getty News February 28, 2024February 28, 2024 |  Eddy Sunarto Link copied to clipboard    The ASX is poised to open slightly higher on Wednesday after a mixed session on Wall Street. At 8am AEDT, the ASX 200 index futures contract was pointing up by +0.1%. The S&P 500 rose by +0.17%, the blue chips Dow Jones index was down by -0.25%, and tech-heavy Nasdaq lifted by +0.37%. Wall Street saw another busy bond auction sale, with strong demand for US$42bn worth of 7-year Treasuries, ahead of a key US CPI reading on Thursday. “We continue to recommend investors act soon to lock in currently attractive bond yields,” Solita Marcelli at UBS Global Wealth told Bloomberg. Investors also digested economic updates, including another 5.5% rise in US home prices, and a 6.1% fall in US durable goods orders, the highest drop in four years. To stocks, Apple rose +0.8%, reversing earlier losses, after Bloomberg reported the company will shift its focus from building an electric car to developing AI. Viking Therapeutics surged by +121% after the company’s weight loss drug, VK2735, demonstrated a 13.1% mean reduction in body weight at the highest dose tested. Janux Therapeutics was the best stock overnight, up +229% after the company released promising results for its prostate cancer drug. In one dosing group, 83% of patients saw their PSA (prostate-specific antigen) levels decline by 50% following treatment with Janux’s drug. Meanwhile, Bitcoin continues to trade higher, and was up another +4% in the last 24 hours to US$56,796. Back home, the monthly CPI indicator will be released by the ABS at 11.30am AEDT today, while the RBNZ will hand down its interest rates decision at 12pm.  Microsoft has been at the forefront of AI through its US$13bn stake in Open AI, but now says that it wants to expand more into AI than just OpenAI. Microsoft is making other AI bets, and has announced an investment of US$2.1 billion in French startup Mistral AI. Mistral’s tech is expected to be made available to Microsoft Azure users. Mistral AI is building an alternative to OpenAI’s GPT-4, and the company has just released a new model of its own chat assistant, Le Chat. Mistral AI has claimed that it currently ranks second after GPT-4 based on several benchmarks, but expects to exceed it sooner or later. The EU is upset with Microsoft’s investment in Mistral, and plans to look into it. Microsoft president Brad Smith told Axios that OpenAI CEO Sam Altman is “brilliant,” but “just like the printing press quickly evolved beyond Gutenberg, AI is quickly evolving beyond any single individual.”  Gold price traded flat at US$2,029.96 an ounce. Oil prices rose by +1.5%, with Brent now trading at US$82.21 a barrel. The benchmark 10-year US Treasury yield lifted around 1 basis point (bond prices lower) to 4.30%. Iron ore futures rebounded by +1.7% to US$117.40 a tonne. The Aussie dollar was up by +0.05% to US65.42c.  Proteomics (ASX:PIQ)\nEuropean patent has been granted for PIQ’s OxiDx diagnostic test technology. OxiDx’s novel technology offers a solution for monitoring levels of oxidative stress using a simple fingerprick blood test. Oxidative stress has been implicated in many disease and injury states. Adavale Resources (ASX:ADD)\nLarge presence of prospective palaeochannel system has been identified from historical electromagnetic (EM) data. The data covers ~1,000 sq km of Adavale’s Mundowdna licences. The processing of the historical EM dataset secured a significant time and cost saving for Adavale, obviating the need to re-fly the large licence area. Bigtincan (ASX:BTH)\nThe sales enablement platform delivered record EBITDA for the half, up 136% over pcp to $1.9m. The company has now guided the market to a full year FY24 EBITDA outlook of $10m+. Bigtincan is also expecting net positive free cash flow outlook for H1 FY24 of $5m. Swoop Holdings (ASX:SWP)\nRevenue for the half was $43.5m, up 17% on pcp. Underlying EBITDA was $8.2m, up 13% on pcp. Free cash flow continues to improve, up +$1.3m from $(2.4m) in the first half, as the company heads towards cash generation from its core business. Argent Minerals (ASX:ARD)\nExtensive gold, silver and lead mineralisation has been confirmed by a rock chip reconnaissance program over the Golden Wattle and Scabben Flat Prospects within the Kempfield Project in NSW. High-grade polymetallic assays up to 73.5g/t gold, 16.2g/t silver and 1.84% lead were received.  At Stockhead we tell it like it is. While Adavale Resources is a Stockhead advertiser, it did not sponsor this article. Link copied to clipboard Get the latest Stockhead news delivered free to your inbox.  It's free. Unsubscribe whenever you want. By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy. News March 25, 2024   |        Eddy Sunarto News February 12, 2024   |        Eddy Sunarto News February 7, 2024   |        Eddy Sunarto Mining Mining Mining Get the latest stock news and insights straight to your inbox.  By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy. Stockhead is providing factual information where there is a reasonable likelihood of doubt.\n\t\t\t\t\t\tThe information is not intended to imply any recommendation or opinion about a financial product. A note about relevant advertising \n\t\t\t\t\t\tWe collect information about the content (including ads) you use across this site and use it to make both advertising and content more relevant to you on our network and other sites.\n\t\t\t\t\t\tThis is also known as Online Behavioural Advertising. You can find out more about our policy and your choices, including how to op-out here For investors, getting access to the right information is critical. Stockhead’s daily newsletters make things simple: Markets coverage, company profiles and industry insights from Australia’s best business journalists – all collated and delivered straight to your inbox every day. Markets coverage, company profiles and industry insights from Australia’s best business journalists – all collated and delivered straight to your inbox every day. It’s free. Unsubscribe anytime. By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy.  Get the latest Stockhead news delivered free to your inbox.   Email Lists\n\n\nMorning Update\n\n\nLunch Update\n\n\nMarket Close Update\n\n\nWeekend Update By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy "
}