{
    "title": "Wall Street sets Microsoft stock price for the next 12 months",
    "date": "2/27/2024",
    "url": "https://finbold.com/wall-street-sets-microsoft-stock-price-for-the-next-12-months-6/",
    "text": "Being one of the biggest big tech companies for multiple decades and an early investor in the current iteration of artificial intelligence (AI) through its long-standing support for OpenAI, it is hardly surprising that Microsoft’s (NASDAQ: MSFT) performance in the stock market in recent years has not only been strong but also managed to make it the biggest company in the world in January 2024. This year’s developments have also been positive for Microsoft.  On the one hand, MSFT unleashed its own large language model (LLM) – Copilot – closely based on ChatGPT. On the other hand, the company revealed at the end of January that its latest-quarter results were strong, with the growth of Microsoft Azure being particularly impressive. Given Microsoft’s business side successes, it comes as no surprise that the company’s stock has also been doing well. The last 52 weeks, in fact, saw MSFT shares rise as much as 62.91%. This year – and particularly February – saw a slowdown in the blue-chip’s rise, though Microsoft is, nonetheless, 9.89% in the green year-to-date. Despite a more than solid earnings report on January 30, the last 30 trading days have been noticeably weaker for Microsoft stock. After logging significant volatility, MSFT is 0.53% in the red in the time frame. The latest full trading week has been somewhat more positive for the technology giant as it is 1.13% up, though Microsoft’s close on Monday, February 26, highlights the persistent uncertainty as it placed MSFT stock at $407.54 following a daily decline of 0.68%. Despite the recent jitters, Wall Street analysts remain highly bullish when it comes to the Bill Gates-founded company. In fact, out of the 35 experts represented on the stock analysis platform TipRanks, 33 rate Microsoft stock as a “buy,” while 1 is neutral, and 1 considers selling the right call. MSFT shares also find themselves in a peculiar position when it comes to the price targets, as even the lowest one – $440 – would constitute a 7.96% upside upon being reached. The average price target is, as could be expected, even higher, and would see Microsoft stock climb 15.22% to $469.58. The highest forecast of $600 – assigned by Truist Securities – would see MSFT surge as much as 47.22%. It is also interesting to note that Microsoft’s sole “sell” rating, reiterated on January 31, 2024, by CFRA, also forecast a significant 11.65% upside for Microsoft as its associated price target stands at $455. Buy stocks now with eToro – trusted and advanced investment platform Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}