{
    "title": "Microsoft: Azure And AI Are Set To Drive Growth In The Next Decade \n(NASDAQ:MSFT)",
    "date": "2/14/2024",
    "url": "https://seekingalpha.com/article/4670331-microsoft-azure-and-ai-are-set-to-drive-growth-in-the-next-decade",
    "text": "LIONEL BONAVENTURE/AFP via Getty Images LIONEL BONAVENTURE/AFP via Getty Images Recently, Microsoft Corporation (NASDAQ:MSFT) has become the world's most valuable company, surpassing Apple Inc. (AAPL) once again. From my perspective, the gap between the two will continue to widen in the coming years. Not because I believe Apple will perform poorly, but because I anticipate Microsoft will excel. Satya Nadella has successfully positioned Microsoft in the right place at the right time. Microsoft is poised to lead two of the most revolutionary waves of our time: cloud computing and artificial intelligence. In this article, I will explain why I believe Azure will eventually emerge as the undisputed leader in the cloud industry and why Microsoft will be the biggest beneficiary of artificial intelligence among the big caps (excluding Nvidia). Furthermore, I posit that Microsoft is also likely to capitalize most effectively on this growth and will face the least risk during this transition. Microsoft is undoubtedly the company that will find the most synergies between its traditional business and cloud computing and AI. Let's examine some of the ones I consider most relevant: As you may know, Microsoft owns Xbox and a large number of video game developers, including Activision Blizzard, following the completed merger last quarter. In this case, the synergies are quite clear. Despite the slow start of cloud gaming (or, as I like to call it, Gaming-As-A-Service), it is poised to become a massive business in the next decade, with compounded growth rates of 40% until 2030. Grand View Research Grand View Research Among the three major console manufacturers-Sony, Nintendo, and Microsoft-only Microsoft has a significant cloud service. Thanks to the years invested in developing Azure, Microsoft can now leverage its unparalleled scale, unmatched by either of the other two competitors, to provide the best cloud gaming experience in the market. In fact, I believe that the acquisition of Activision may have been undertaken to enhance the catalog of its cloud gaming service and ensure that their titles dominate the platform in the coming years. On the other hand, Amazon.com, Inc. (AMZN) and NVIDIA Corporation (NVDA) do provide cloud gaming services of a certain quality, such as Amazon Luna and Nvidia GeForce Now. However, these two players can only serve as cloud service providers and not as game developers themselves; they must seek alliances with third-party developers. Microsoft is the sole player capable of offering an integrated product that combines cloud gaming with low latency and its own array of games. This, I believe, could give them a certain advantage over others. Nevertheless, given the rapidly expanding nature of this market, it is likely that all players will experience significant growth in the coming years. However, thanks to the comprehensive integration Microsoft offers with Xbox, it will be challenging for them to lag behind and not be among the foremost beneficiaries of this trend. The synergies between the Office suite and the development of artificial intelligence are already beginning to be seen in action. Just a few weeks ago, Copilot Pro was launched, an artificial intelligence service for all Microsoft applications, from Excel, Word, and PowerPoint to Bing and Edge. This service is focused on increasing productivity in the business environment, so although its price may seem high for the general public ($20/month), at the enterprise level, it has a price that could be considered even cheap for the exponential increase in productivity it can provide. The integration of these types of artificial intelligence tools can help continue to drive sales in the Productivity & Business Process segment. This sector is more mature than the cloud segment, which until recently was seen as unlikely to maintain double-digit growth rates in the long term. However, with these new services, it is now much more probable. Let's say that Microsoft has once again been able to reinvent the wheel with its Office suite. One aspect of Microsoft that receives relatively little attention is Dynamics, its ERP and CRM solution, which competes with SAP, Salesforce, or Workday, among others. Here, Microsoft's advantage is quite clear: it is the only provider capable of offering these SaaS services alongside cloud infrastructure services. This integration strengthens Microsoft's Dynamics business by consolidating everything within the company, and it enables clients to be offered broader solutions than those available from other SaaS providers. This has led Dynamics to maintain growth rates exceeding 15% since the pandemic, gradually capturing market share from its competitors. Another positive aspect for Microsoft is the integration of artificial intelligence into its Dynamics services, although this feature can be replicated by its competitors. In summary, clients seek comprehensive solutions for their infrastructure and software-as-a-service needs, and practically the only company capable of offering this complete solution is Microsoft, thanks to the synergies between Dynamics and Azure. Author's calculations Author's calculations This could be one of the biggest growth opportunities for Microsoft in the future: gaining market share in internet searches. However, this is no easy feat, and until a few years ago, I would have said it was impossible for anyone to steal market share from Alphabet Inc. (GOOG), (GOOGL). But now, I do believe Microsoft has a chance to do so. As you may already know, Microsoft's search engine, Bing, has integrated a conversational chat feature that assists you with internet searches, allowing for natural interactions. This could truly be a paradigm shift if it were to gain popularity. However, this type of search requires more computing power to process, which will likely reduce the margin for searches permanently, as Satya Nadella has mentioned. In this scenario, and imagining that this type of search becomes dominant (which is yet to be seen), Microsoft has much to gain and very little to lose. Consider this: if they fail to boost Bing as a search engine with a significant market share, Microsoft would lose practically nothing. The resources allocated to this artificial intelligence are easily convertible to other purposes, and the costs of attempting this move are minimal. However, if Microsoft were to achieve a relevant market share in searches, the potential gains would be enormous. Let's consider that Google earns nearly $200 billion a year from advertising on its search engine, while Bing earns less than $10 billion. The market share to be captured is enormous, and every percentage point Microsoft takes from Google represents billions of dollars in revenue. Certainly, challenging Google's dominant position will not be easy, and success is not guaranteed. However, I believe the risk/benefit ratio favors Microsoft, and being the first mover in this matter may give them some advantage. On the other hand, Google has a lot to lose in this matter. Searches are their main business, and any changes to the search engine that affect user experience could cause them to lose market share if Bing becomes a popular alternative. In this case, we encounter the typical innovator's dilemma: Google is interested in maintaining the status quo, so they must be very careful with their moves because they have practically nothing to gain (they are already a monopoly in searches) and much to lose, whereas Microsoft doesn't mind taking risky moves because the potential gains could be enormous. For now, this is not happening, but it is certainly a very positive optionality we have when investing in Microsoft, and in the event that it does not materialize, the rest of the business would still justify the valuation of the company. StatCounter Global Stats StatCounter Global Stats As we've been discussing throughout the article, following its investment in OpenAI, Microsoft has positioned itself as one of the leading companies in the field of artificial intelligence. Another way they can capitalize on this is through Azure, where they not only offer their own AI in their products but also a wide range of services and tools for developing, implementing, and managing AI solutions on a large scale. But, how can Microsoft maximize its potential in this competitive and ever-changing market? The masterstroke is to integrate Azure and AI more seamlessly, giving their customers the option to access their pre-trained models or use their computing power to train their own custom models. Microsoft is already generating revenue by charging for access to their models via APIs and selling additional training power to their customers, allowing them to use their cloud infrastructure for this purpose. Apart from Google and Amazon, no other provider has the capacity to offer these services, as they require massive investments in equipment and cutting-edge technology from Nvidia or Advanced Micro Devices, Inc. (AMD) to build and maintain data centers. As we can see in the following graph, sales of services related to artificial intelligence are once again accelerating the growth of Azure, which was already quite substantial. If artificial intelligence ends up being as significant as many believe, Microsoft will be one of the biggest beneficiaries, even if its own AI products were to fail, all thanks to Azure. @jaminball @jaminball For several years, I have held the belief that Microsoft would eventually become the leading provider of cloud services, surpassing AWS, and it seems that the trend is pointing in that direction. While Google and Amazon are two players with very solid cloud solutions that are sure to experience exponential growth in the next decade and generate a substantial amount of revenue, Microsoft is in the best position to capitalize on this opportunity. Before the era of cloud computing, Microsoft's clients were primarily large enterprises and institutional organizations, unlike Google and especially Amazon. This established customer base gives Microsoft a significant advantage in the market. Additionally, its focus on integration and interoperability, along with its wide range of products and services, allows it to offer comprehensive and customized solutions that uniquely meet the needs of business clients. In the following graph, we see how Amazon is slightly losing market share due to its strategy of lowering prices to increase customer loyalty (which I find very appropriate from Amazon's position). On the other hand, Google is gaining some market share, mainly because it is the smallest player, and Microsoft is gaining the most market share. Again, my scenario is that in 2 or 3 years, Microsoft will be the leading player in the global cloud market. Synergy Research Group Synergy Research Group Finally, another piece of data that supports my prediction is observing the growth rates of the three main players. Microsoft, thanks to the momentum we've already seen in artificial intelligence, is once again the fastest-growing, even surpassing Google, which is much smaller. I reiterate that Amazon's strategy is geared towards lowering prices, so it's logical to see a slower growth rate, although I believe they are making good decisions given their position. @EricFlaningam @EricFlaningam When we talk about Microsoft, they really hold such a dominant position that it's hard to think of risks that could completely break the long-term thesis. However, I do believe we should closely monitor potential technological disruptions and see if Microsoft is adapting to them correctly. In past decades, several technological waves were missed due to poor decisions such as mobile telephony and their operating systems, search engines, browsers, social networks, etc. Under Satya Nadella's leadership, it seems that this is changing as he has managed to ride and lead the waves of cloud and artificial intelligence, but it's certainly something we should keep an eye on. Finally, I would like to provide a brief overall assessment of the company to see if despite this significant increase we've seen in recent months, we might be facing a good opportunity to buy Microsoft shares. To do this, I have projected growth rates and margins for each of the company's segments. Although these growth rates may be very high, they are lower than those expected by analysts themselves, as I prefer to be somewhat more conservative. Nevertheless, Microsoft is a company that has been consistently surpassing estimates for many years and is likely to surpass mine as well. In my valuation, I have projected a final multiple of around 23x EBIT, which, despite being very high, I believe a quality company like Microsoft with so many recurring revenues may deserve. Author's calculations Author's calculations With these projections, we arrive at a target value of $567 per share in 2024 and a fair value for this year of $340. Therefore, I believe it is prudent to wait for a pullback in the stock before buying. However, as I often reiterate, selling high-quality stocks solely due to potential temporary overvaluation is a mistake; therefore, I would not recommend selling for those who already hold shares. In summary, I currently assign it a \"Hold\" rating and look forward to seeing how all the synergies and tailwinds we've discussed in this article materialize in the upcoming quarterly results. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of MSFT either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}