{
    "title": "AI to create new jobs & enable faster learning: Microsoft CEO Satya Nadella",
    "date": "2/13/2024",
    "url": "https://www.businesstoday.in/technology/news/story/ai-to-create-new-jobs-enable-faster-learning-microsoft-ceo-satya-nadella-417369-2024-02-13",
    "text": "Feedback While artificial intelligence (AI) is likely to displace certain jobs, it will simultaneously create new opportunities and facilitate accelerated learning, Satya Nadella, the CEO of Microsoft told CNBC-TV18. Nadella further shared his insights on the transformative potential of AI. His optimism about AI stems from its capacity to democratize access to technology and knowledge, making it easier for people to climb the learning curve. Nadella said, \"I think this is the fastest rate of diffusion of anything new I've ever seen,\" referring to the widespread integration of AI across various sectors. He goes beyond simply acknowledging its popularity, emphasizing its transformative potential: \"Why is this excitement? Because I think it's tangibly changing economic productivity.\" Nadella envisions a future where AI could serve as a personal tutor for children, breaking down complex information and alleviating the fear associated with learning. He believes that while AI will enhance our cognitive capabilities—likening it to a \"steam engine for the mind\"—critical thinking will remain a distinctly human endeavor. He offered a refreshing perspective on the potential benefits of AI in the labor market. Contrary to the lump of labor fallacy, which posits a fixed amount of work within an economy, Nadella suggests that labor markets are dynamic entities capable of adapting to technological advancements. The lump of labor fallacy has been a topic of discussion in relation to AI and job displacement. This misconception assumes that there is a finite volume of work, and that the introduction of AI and automation will inevitably lead to a reduction in the total number of jobs available. However, evidence contradicts this belief, indicating that while AI may displace certain jobs, particularly those involving routine and repetitive tasks, it simultaneously creates new opportunities. For instance, the World Economic Forum predicts that by 2025, AI will have displaced 75 million jobs but will also have generated 133 million new ones. In the interview, Nadella stressed on the role of AI in reducing the learning curve for workers, even those who are mid-career, enabling them to acquire new skills more rapidly and efficiently. “This aspect of AI can be particularly empowering, as it facilitates career development and personal growth,” he added. Moreover, AI brings expertise to the fingertips of frontline workers, enhancing their ability to perform tasks with greater proficiency. By providing real-time skills training and on-the-job guidance, AI empowers workers across various sectors, potentially leading to improved wages due to their enhanced capability to deliver expert advice or services, he said. Furthermore, Nadella sees AI as a competitive advantage for countries like India, where he believes the strong market and growth rate are well-suited to harness AI-led growth for increased productivity. Also Read: 'Dilli Chalo' protest: Farmers call ceasefire for now, say will try again tomorrow Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}