{
    "title": "DoxAI partners with Perpetual Corporate Trust and Microsoft",
    "date": "2/8/2024",
    "url": "https://thepaypers.com/online-mobile-banking/doxai-partners-with-perpetual-corporate-trust-and-microsoft--1266687",
    "text": " This collaboration combines Perpetual's experience in financial services, Lakeba's expertise in AI and technology through DoxAI, and Microsoft's cloud infrastructure to establish a marketplace of technology solutions designed for the Australian financial services industry. Representing a significant advancement in the Australian financial services sector, this partnership integrates financial services expertise, AI and technology capabilities, and cloud infrastructure to develop innovative and scalable solutions. In essence, the technology solutions marketplace will enable financial institutions to adapt to evolving consumer and market demands, ensuring they remain competitive in the industry. The inaugural AI project of this collaboration, QAAI, focuses on quality checks for securitised loans and mortgages. QAAI utilizes AI and machine learning technologies to conduct comprehensive analyses of loan and mortgage portfolios, aiding financial institutions in identifying potential risks and enhancing loan performance. Representatives from DoxAI cited by Yahoo, expressed enthusiasm about the collaboration's potential to deliver innovative and scalable solutions to the Australian financial services sector. In turn, officials from Perpetual Corporate Trust (PCT) highlighted the collaboration's role in enhancing document custody operations and exploring AI technology applications across their business to improve efficiency and manage cyber security risks. Microsoft officials talked about the company's commitment to empowering organisations with digital tools and technology. They also view the collaboration as a significant step forward in supporting the Australian financial services industry.    DoxAI leverages AI/ML technology to streamline and automate clients' workflows. With a team of experts, DoxAI offers innovative solutions to help businesses manage growth and compliance risks more effectively. In May 2023, crn.com reported that DoxAI incorporated GPT-4 into its e-signature AI solution using Microsoft Azure OpenAI. This collaboration aims to enhance the user experience in handling complex documents. With GPT-4 integration, users gained the ability to pose specific questions and receive clear responses before digitally signing or witnessing documents. The AI solution also aimed to simplify digital transactions, enhancing accessibility and user-friendliness across industries. It is securely integrated with Microsoft Azure Cloud Services to ensure client data protection and privacy. Additionally, DoxAI's e-signature solution offered improved scalability and adaptability. This integration opened up possibilities to extend AI-driven solutions across diverse applications and industries through the DoxAI Virtual Assistant. DoxAI's e-signature solution includes features such as e-witnessing, redaction AI, categorisation AI, extraction AI, data exchange, and asset verification. Every day we send out a free e-mail with the most important headlines of the last 24 hours. Subscribe now The Paypers is the Netherlands-based leading independent source of news and intelligence for professionals in the global payment community.\r\n                        The Paypers provides a wide range of news and analysis products aimed at keeping the ecommerce, fintech, and payment professionals informed about latest developments in the industry. tp:news\ntp:research\ntp:events The Paypers\r\n                        Prinsengracht 777e\r\n                        1017 JZ Amsterdam\r\n                        The Netherlands Telephone: +31 20 658 0652 © 2024 The Paypers BV. All rights reserved.\r\n                    No part of this site can be reproduced without explicit permission of The Paypers(V2.7). Privacy Policy\nCookie Statement\nTerms and Conditions "
}