{
    "title": "CommBank demonstrates the real-world benefits of AI - Microsoft Australia \nNews Centre",
    "date": "2/7/2024",
    "url": "https://news.microsoft.com/en-au/features/commbank-demonstrates-the-real-world-benefits-of-ai/",
    "text": " By\t\t\t\t\n\t\t\t\tMicrosoft News Center\t\t\t\n7 February, 2024 One year into the current AI revolution, we’re all getting a clearer sense of how organisations can gain practical business value from generative AI and the breakthrough large language models that underpin it. We’re also seeing fantastic examples of early mover businesses and governments realising that value right here in Australia and New Zealand. At Microsoft, we believe there are four key areas of opportunity where our latest AI innovations can be used to help address longstanding organisational priorities in a responsible way. These areas are enriching employee experiences, reinventing customer engagement, reshaping business processes and bending the curve on innovation. One of the most high-profile and progressive organisations that is seeing gains on all these fronts is the Commonwealth Bank of Australia (CommBank). As Gavin Munroe, the bank’s Group Executive for Technology and Group Chief Information Officer, discussed at our AI Tour in Sydney today, AI has been a core strategic focus for CommBank for several years. The bank has rightly seen the technology as a powerful tool for improving customer experiences and optimising internal processes, while managing it responsibly to ensure it delivers better outcomes for customers and the community. Improving outcomes for customers and staff When it comes to reinventing customer engagement, CommBank is using AI to help protect customers from fraud, scams and financial abuse. The bank is also using generative AI specifically to deliver highly personalised experiences to customers, such as tailored notifications via its app. It is also piloting the use of generative AI to power a Q&A tool that will enable its retail and business call centre staff to answer policy and procedure questions more quickly, and also enable mortgage brokers to better access information to make faster decisions as they support customers. In another advance, CommBank is using AI to read, analyse and process customer documentation more quickly and accurately than humans. This is enabling the bank to half the time it takes to verify someone’s income when it processes a loan, for instance. These tools are a win for staff as well, who can spend less time on repetitive tasks and focus more on having high-quality conversations with customers. Accelerating innovation, responsibly CommBank is also using the new generative AI–powered Copilot for Microsoft 365 to simplify internal operations and innovate. Three hundred of the bank’s staff have had early access to the technology since late 2023 and been using it for tasks like accelerating market research and summarising text.. While CBA works through expanding learning across the Group, early feedback is positive. A survey of the bank’s early adopters found that 85 percent wouldn’t want to go back to working without Copilot for Microsoft 365 and 96 percent said they were more productive. The bank’s team was among the first in Australia to test GitHub Copilot too, with the goal of delivering code faster, protecting the bank and getting more done for its customers. CommBank began testing the service with 200 people and discovered that 75 per cent of its engineers found it “very helpful”. They accepted nearly 80,000 lines of code that GitHub CoPilot recommended – a third of all the recommendations made. Finally, it’s important to note that CommBank has put robust frameworks and governance in place around data safety and security to guide its use of AI. The bank has also been a leader in shaping Australia’s national approach to the responsible and ethical use of AI. In fact, it was recently ranked joint first globally for its responsible AI leadership in the Evident AI Index for banks. By focusing on innovation and responsibility, CommBank stands to benefit from a virtuous circle. On behalf of Microsoft, I’d like to thank Gavin for sharing CommBank’s experiences and being such a valued, long-term partner. The bank truly is showing how AI can be embraced at scale in a way that is cutting-edge and beneficial to all stakeholders. GHD’s productivity surge: How AI is reinventing the RFP process in construction and engineering Copiloting construction: John Holland embraces generative AI to enhance the productivity of its workforce How Aurizon’s pioneering use of Microsoft Fabric is helping it get closer to its predictive analytics and optimisation goals Microsoft’s Commitment to Trust in Australia: Introducing 2024 Azure, Dynamics 365, and Microsoft 365 IRAP Assessments Microsoft, NAB and CITT partnership helps boost Victoria’s cyber skills and protect small business Telstra scales up AI adoption following promising pilots of generative AI solutions improving customer experience Follow us: Share this page: "
}