{
    "title": "Microsoft India: Microsoft India looks to demystify AI to push business \nadoption",
    "date": "2/4/2024",
    "url": "https://startupnews.fyi/2024/02/04/microsoft-india-microsoft-india-looks-to-demystify-ai-to-push-business-adoption/",
    "text": "Share via:   “The statement of purpose is to unlock AI for India and South Asia’s potential,” Chandok said, adding that India is one of the most crucial markets for Microsoft. This depends on Microsoft’s ability to bring its portfolio together to drive customers’ digital transformation and move fast on AI to meet their needs, he said.Ensuring ‘AI fluency’ is the first priority and Microsoft is aiming to simplify AI for customers for greater adoption, he said. The idea is to clear confusion over AI and Microsoft’s approach is to take use cases by industry to bring clients onboard the AI journey, said Chandok. At the same time, work on cloud and data remain important as AI cannot be leveraged unless they are in place, he added. In 2024, Microsoft will also work with the government to train 3 million government officers on AI fluency in India, he said.AI adoption in India is three-pronged, Chandok said. The first aspect covers productivity use cases across sectors like manufacturing, banking, services firms and digital businesses. Second, leveraging AI infrastructure to build large language models (LLMs) focused on India’s language, culture and context. The next one is where companies use LLMs and small language models to serve their customers better. Digital businesses, which have less technical debt and are more experimentative, are more active in this space, Chandok said. Technology enterprises like Infosys and HCLTech are building AI-driven industry solutions and intelligent applications in partnership with Microsoft, Chandok said, adding digital businesses are another focus area where a lot of work is being done. Ecommerce company Myntra last week unveiled MyFashionGPT, a generative AI shopping assistant on Microsoft’s Azure OpenAI Service to help customers shop using natural language prompts. Online travel company MakeMyTrip in May launched generative AI-powered voice-based bookings in Indian languages on its platform powered by Azure OpenAI Service. Chandok said more such partnerships can be expected in 2024. “Our belief is that you will have AI embedded into pretty much every application…It’s a question of when, not why and how it will happen,” Chandok said. “Customers who are moving ahead on this journey, who are moving fast, are seeing a significant uptick in both customer retention, growth, top line impact, and the people who don’t adopt it will be left behind.” AI technology has evolved from conversations to intelligence, with AI being able to summarise meetings and make recommendations, Chandok said. The next step in the evolution will be agency, whereby AI can actually carry out tasks on its own. Startups too are a big part of Microsoft’s mission in India, Chandok said, adding it currently engages with 8,000 startups through the Founder’s Hub. “We have quite a few programmes that are focused on AI startups. The intent is to help them where they need help,” whether through credits to access compute infrastructure or with technical capabilities and expertise, he said. With GitHub Copilot, the 13 million Indian developers on GitHub are seeing a 55% improvement in their productivity, Chandok said. We strive to uphold the highest ethical standards in all of our reporting and coverage. We StartupNews.fyi want to be transparent with our readers about any potential conflicts of interest that may arise in our work. It’s possible that some of the investors we feature may have connections to other businesses, including competitors or companies we write about. However, we want to assure our readers that this will not have any impact on the integrity or impartiality of our reporting. We are committed to delivering accurate, unbiased news and information to our audience, and we will continue to uphold our ethics and principles in all of our work. Thank you for your trust and support.   “The statement of purpose is to unlock AI for India and South Asia’s potential,” Chandok said, adding that India is one of the most crucial markets for Microsoft. This depends on Microsoft’s ability to bring its portfolio together to drive customers’ digital transformation and move fast on AI to meet their needs, he said.Ensuring ‘AI fluency’ is the first priority and Microsoft is aiming to simplify AI for customers for greater adoption, he said. The idea is to clear confusion over AI and Microsoft’s approach is to take use cases by industry to bring clients onboard the AI journey, said Chandok. At the same time, work on cloud and data remain important as AI cannot be leveraged unless they are in place, he added. In 2024, Microsoft will also work with the government to train 3 million government officers on AI fluency in India, he said.AI adoption in India is three-pronged, Chandok said. The first aspect covers productivity use cases across sectors like manufacturing, banking, services firms and digital businesses. Second, leveraging AI infrastructure to build large language models (LLMs) focused on India’s language, culture and context. The next one is where companies use LLMs and small language models to serve their customers better. Digital businesses, which have less technical debt and are more experimentative, are more active in this space, Chandok said. Technology enterprises like Infosys and HCLTech are building AI-driven industry solutions and intelligent applications in partnership with Microsoft, Chandok said, adding digital businesses are another focus area where a lot of work is being done. Ecommerce company Myntra last week unveiled MyFashionGPT, a generative AI shopping assistant on Microsoft’s Azure OpenAI Service to help customers shop using natural language prompts. Online travel company MakeMyTrip in May launched generative AI-powered voice-based bookings in Indian languages on its platform powered by Azure OpenAI Service. Chandok said more such partnerships can be expected in 2024. “Our belief is that you will have AI embedded into pretty much every application…It’s a question of when, not why and how it will happen,” Chandok said. “Customers who are moving ahead on this journey, who are moving fast, are seeing a significant uptick in both customer retention, growth, top line impact, and the people who don’t adopt it will be left behind.” AI technology has evolved from conversations to intelligence, with AI being able to summarise meetings and make recommendations, Chandok said. The next step in the evolution will be agency, whereby AI can actually carry out tasks on its own. Startups too are a big part of Microsoft’s mission in India, Chandok said, adding it currently engages with 8,000 startups through the Founder’s Hub. “We have quite a few programmes that are focused on AI startups. The intent is to help them where they need help,” whether through credits to access compute infrastructure or with technical capabilities and expertise, he said. With GitHub Copilot, the 13 million Indian developers on GitHub are seeing a 55% improvement in their productivity, Chandok said. We strive to uphold the highest ethical standards in all of our reporting and coverage. We StartupNews.fyi want to be transparent with our readers about any potential conflicts of interest that may arise in our work. It’s possible that some of the investors we feature may have connections to other businesses, including competitors or companies we write about. However, we want to assure our readers that this will not have any impact on the integrity or impartiality of our reporting. We are committed to delivering accurate, unbiased news and information to our audience, and we will continue to uphold our ethics and principles in all of our work. Thank you for your trust and support. Website Upgradation is going on for any glitch kindly connect at [email protected] Startup Information that matters. Get in your inbox Daily! Δ Startup Information that matters. Get in your inbox Daily! Δ © 2024 StartupNews.fyi | DOTFYI Media Ventures Private Limited. All Rights Reserved. StartupNews.fyi is India's leading news & Technology media company that focuses on Startups in India and to stories across the globe. © 2024 StartupNews.fyi | DOTFYI Media Ventures Private Limited. All Rights Reserved. "
}