{
    "title": "2 Millionaire-Maker Artificial Intelligence (AI) Stocks",
    "date": "2/25/2024",
    "url": "https://www.fool.com/investing/2024/02/25/2-millionaire-maker-artificial-intelligence-ai/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More There have never been more millionaires than today. Indeed, Statista estimates that as of December 2023, there were 22.7 million millionaires in the United States, roughly 9% of the American population. One big reason why: The current bull market, and, in particular, the artificial intelligence (AI) stocks that are powering it higher. So, let's take a look at two millionaire-maker AI stocks that still have plenty of room to run. These stocks may not be cheap today, but they may be worth every premium penny in the long run. Image source: Getty Images. First up is Microsoft (MSFT -0.15%). There are many reasons why the world's largest company has made, and will continue to make, countless millionaires, but I want to cover one specifically: Microsoft is poised to grow its often underappreciated search and news advertising business. In its most recent quarter (the three months ending on Dec. 31), Microsoft's search and news ad segment generated $3.2 billion in revenue. That's a tidy sum, similar to the revenue Roku generated over the last 12 months ($3.4 billion). However, for Microsoft, the $3.2 billion it generates from advertising is but a drop in the bucket. The company makes about $62 billion in quarterly revenue. So to some investors, its digital ad segment revenue is often an afterthought -- particularly when compared to the true digital ad giants like Alphabet and Meta Platforms. However, thanks to its partnership with OpenAI, Microsoft might be able to force its way into the digital ad conversation. Recent reports suggest that OpenAI may be working on a search engine designed to rival Alphabet's flagship Google Search. Crucially, Microsoft was quick to adopt key ChatGPT features into its Bing search engine last year, leading to the possibility that Microsoft might once again quickly adopt any future breakthroughs. At any rate, it is clear Microsoft has room to grow when it comes to the digital ad market. The overall market is likely to expand to $966 billion by 2028. If Microsoft can use AI innovations to improve the popularity of its search and news products, it could turn an unsung revenue stream into a giant in its own right. Next is Nvidia (NVDA 3.12%), the undisputed AI king. Indeed, Nvidia has undergone nothing short of an explosion in demand, both for its products and its stock, since AI took the limelight last year. In terms of market cap, Nvidia is now America's third-largest company, trailing only Microsoft and Apple. The company's surging fortunes are partly thanks to its graphics processing units (GPUs), which are used to train large language models like ChatGPT. There is, however, another reason that isn't discussed as often: Nvidia's compute unified device architecture (CUDA) interface. Without getting too technical, CUDA is a proprietary software framework that helps developers tap into the power of GPUs for training AI models. In short, it is Nvidia's secret weapon that makes its GPUs so desirable for AI developers, and it helps explain why Nvidia likely has around 90% share of the data center GPU market. Financially, CUDA gives Nvidia a strong, strategic moat -- making it difficult for rivals like Advanced Micro Devices or Intel to gain market share. They rely on the OpenCL standard instead, but this open-source system offers significantly slower performance than Nvidia's proprietary language. At any rate, there's no doubt that Nvidia is like a freight train cruising downhill -- seemingly unstoppable. In its latest quarter (the three months ending Jan. 28), Nvidia reported $22.1 billion in revenue, up 265% from a year earlier. Yes, you read that correctly, Nvidia's quarterly revenue almost tripled from a year ago. Its data center revenue increased 409%, going from $4.5 billion to $18.4 billion.  NVDA Revenue (Quarterly) data by YCharts In short, Nvidia's CUDA moat is driving enormous shareholder returns, and it remains a company that could make more millionaires for some time. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Jake Lerch has positions in Alphabet and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Apple, Meta Platforms, Microsoft, Nvidia, and Roku. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short February 2024 $47 calls on Intel, and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}