{
    "title": null,
    "date": "2/15/2024",
    "url": "https://www.marketscreener.com/quote/stock/MICROSOFT-CORPORATION-4835/news/Microsoft-to-invest-3-2-bln-eur-in-Germany-in-AI-push-45960683/",
    "text": "Log In   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België)   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België) BERLIN, Feb 15 (Reuters) - U.S. software giant Microsoft will invest 3.2 billion euros\n($3.44 billion) in Germany in the next two years with a focus on\nartificial intelligence, Microsoft chairperson Brad Smith said\nat an event in the German capital on Thursday. In the biggest investment made by the company in Germany in\nthe last 40 years, Microsoft will spend mostly on setting up\ndata centres and on training people in artificial intelligence\nin 2024 and 2025. \"We are doing this today because of the enormous\nconfidence we have in Germany,\" said Smith. German Chancellor Olaf Scholz welcomed the move, saying\nit represented a vote of confidence for Europe's biggest\neconomy. Marianne Janik, CEO of Microsoft Germany, declined to\nsay exactly where the investments would be made, but said they\nwere mostly looking in the western Rhineland region and around\nthe banking hub of Frankfurt.\n($1 = 0.9315 euros)\n(Reporting by Madeline Chambers; editing by Bartosz Dabrowski\nand Matthias Williams)  0 selected Bill Gates, co-founder of Microsoft, on AI: Less work, more wealth January 16, 2024 at 11:51 am EST  Currency / Forex Commodities Cryptocurrencies Best financial portal +951% of historicalperformance More than 20 yearsat your side +     \n                    \n    950,000\nmembers Quick & easycancellation Our Expertsare here for you OUR EXPERTS ARE HERE FOR YOU Monday - Friday 9am-12pm / 2pm-6pm GMT + 1 "
}