{
    "title": "Wall Street Breakfast Podcast: MSFT Pitched Bing to AAPL",
    "date": "2/26/2024",
    "url": "https://seekingalpha.com/article/4673381-wall-street-breakfast-podcast-google-says-microsoft-pitched-bing-sale-to-apple",
    "text": "RiverNorthPhotography  RiverNorthPhotography Listen below or on the go on Apple Podcasts and Spotify  Google (GOOGL) (GOOG): Microsoft (MSFT) offered to sell Bing to Apple (AAPL) when pitching default deal. (00:23) Walt Disney (DIS), Reliance sign pact to merge Indian media operations - report. (01:27) Ford (F) halts shipments of electric F-150 truck due to quality issue. (02:36) This is an abridged transcript of the podcast. Microsoft (NASDAQ:MSFT) offered to sell Bing to Apple (NASDAQ:AAPL) in 2018, or form a joint venture related to the search engine. This information is coming from a recently unsealed post-trial brief from the U.S. Justice Department's antitrust case against Google (NASDAQ:GOOG) (NASDAQ:GOOGL). The case relates Google's (GOOG) (GOOGL) alleged search monopoly and the methods it employed to ensure dominance, such as spending billions of dollars to make its search engine the default option in phones. Google argued that it had been competing fairly. Google (GOOG) told the court that Microsoft (MSFT) approached Apple (AAPL) in 2009, 2013, 2015, 2016, 2018 and 2020 to make Bing the default option for its Safari browser. \"In each instance, Apple took a hard look at the relative quality of Bing versus Google and concluded that Google was the superior default choice,\" said Google (GOOG). \"That is competition.\" Apple (AAPL) executive Eddy Cue said this was because Bing's search quality wasn't as good as Google (GOOG) and Microsoft (MSFT) wasn't investing at \"any level comparable\" to Google. Walt Disney Co. (NYSE:DIS) and Reliance Industries Ltd. signed a binding agreement for a merger of their media operations in India. The media unit of Reliance, which is controlled by billionaire Mukesh Ambani, and its affiliates will own at least 61% of the combined entity, according to a Bloomberg report on Sunday, which cited people familiar with the matter. The latest update on the deal is expected to be announced this week, according to the report. The stake split could still change depending on how Disney’s other local assets are factored in by the time the deal is closed. A Disney (DIS) representative declined to comment to Bloomberg and a Reliance spokesperson didn't immediately respond to request for comment. Disney's (DIS) Indian operations have reportedly suffered significant losses over the past year due to the loss of streaming rights to air cricket matches. Media reports in the last month indicate that Disney's preliminary deal to sell majority control of its Indian business to Reliance Industries is at a sharply lower valuation than when it was acquired. The deal reportedly values the operation at $3.9B. However, when Disney acquired it via its $71.3B Fox media assets buyout in 2019, the unit was valued somewhere between $7B and $16B. Ford Motor Co. (NYSE:F) has halted shipments of the F-150 Lightning electric truck due to an undisclosed quality issue. The automobile manufacturer said it stopped shipping the electric truck on Feb. 9 to \"ensure quality,\" according to media reports including from Bloomberg, which cited a statement from late Friday. Ford didn't specify when shipping of the Lightning would resume delivery to dealers, though the automaker noted it has started shipping gas-powered versions of the truck. The news comes after Ford (F) a little more than a month ago said it was ramping up the manufacture of its gas-powered Bronco and Ranger line and reducing production of the F-150 Lightning EV. Production at the Rouge EV Center will now be reduced to one shift effective April 1 as the company expects global growth in EV sales in 2024 will be \"less than anticipated.\" Other articles to look out for on Seeking Alpha: Earnings week ahead: Salesforce, Plug Power, Zoom, Snowflake, AMC Entertainment and more ECB has one message for crypto investors: Bitcoin is bad Warren Buffett talks Charlie Munger, earnings, markets, risk in annual letter On our catalyst watch for the day, Amazon (AMZN) will join the Dow Jones Industrial Index to replace Walgreens Boots Alliance (WBA). Following the Dow switch, Amazon's weight in the Dow will rank 17th out of the 30 stocks in the index, while Walmart's weighting will drop to 26th from 17th. UnitedHealth Group (UNH) will remain the most heavily weighted stock in the index. The four-day MWC Barcelona Conference begins. Keynote speakers include Accenture (ACN) CEO Julie Sweet, China Mobile Chairman Yang Jie, and Dell Technologies (DELL) CEO Michael Dell. MWC is described as one of the industry’s largest and most influential connectivity events. Presentations during the event have jolted share prices of participating companies on occasion in the past. The World Trade Organization will hold its 13th Ministerial Conference in Abu Dhabi, UAE. The meetings are designed to bring together representatives of the WTO’s 164 member countries, business leaders, and civil society representatives to discuss trade negotiations. U.S. stocks on Friday ended mixed as investors took a beating following a stunning rally the previous day. The Nasdaq (COMP.IND) slipped 0.28%. The S&P (SP500) rose as much as 0.47% shortly after the opening bell to cross the historic 5,100 points mark. It eventually concluded 0.03% higher at 5,088.85 points. The Dow (DJI) added 0.16%. Of the 11 S&P sectors, seven ended in the green, led by Utilities. Energy topped the losers. For the week, the S&P 500 (SP500) advanced 1.66%, the Nasdaq (COMP.IND) rose 1.40% and the Dow (DJI) increased 1.30%. Now let’s take a look at the markets as of 6 am. Ahead of the opening bell today, Dow, S&P and Nasdaq futures are mixed. The Dow is up 0.1%, the S & P 500 is flat and the Nasdaq is also flat. Crude oil is down 0.4% at more than $76 per barrel. Bitcoin is down 1% at more than $51,000. In the world markets, the FTSE 100 is down 0.2% and the DAX is down 0.04%. The biggest movers for the day premarket: Intuitive Machines' (NASDAQ:LUNR) is down 33% after its spacecraft tipped over on the moon despite a successful landing. The Texas-based company had seen its stock nearly double following the historic landing, but a late-day sell-off occurred after news of the tip-over emerged. Intuitive Machines stated that the spacecraft Odysseus remained operational, with engineers actively sending commands. On today’s economic calendar: 10am New home sales This article was written by "
}