{
    "title": "Sora AI frenzy prompts Chinese fintech firm to tout 'priority' access",
    "date": "2/21/2024",
    "url": "https://www.scmp.com/tech/tech-trends/article/3252726/chinese-fintech-firm-claims-priority-access-sora-api-through-microsoft-amid-new-text-video-ai-frenzy",
    "text": "Beijing-based Sinodata said it will be one of the first companies to apply for a Sora API subscription once the text-to-video tool becomes available on Azure, the cloud computing platform of Microsoft, which is OpenAI’s biggest backer. In a statement on its website on Tuesday, the company said it held a business seminar with Microsoft China on the potential application scenarios of Sora. Sinodata will gain priority access by joining Microsoft’s AI Cloud Partner Programme, according to the statement, and become one of the US tech giant’s solution partners for data and AI in a deal the company signed last month. Shares of Sinodata jumped 10 per cent on the news, reaching 14.40 yuan (US$2) before trading was suspended for reaching the daily limit. 05:03 How does China’s AI stack up against ChatGPT? Chinese internet giants have expedited research and development into creating their own text-to-video models. Other public Chinese companies have sought to assure investors that they are watching developments in this area closely. In response to questions from investors on Hudongyi, an interactive communications platform operated by the Shenzhen exchange, Shanghai-based game operator Giant Network Group said it expects the “breakthrough progress” of Sora to “improve the efficiency of content creation in the game industry”. Intelligent interactive tablet manufacturer HiteVision also said on the platform that it expects education to be an important application of generative AI products. Education is an important market segment for the company, it added. Zhejiang Enjoyor Electronics, a construction service provider for smart cities, said on the Shanghai Stock Exchange’s platform that text-to-video generation tools may be applied in multiple digital city use cases in the future, such as assessing and determining fault in traffic accidents. "
}