{
    "title": "Elon Musk Sues Sam Altman And OpenAI For 'Refining AGI' To Maximize Profits \nFor Microsoft: 'Stark Betrayal Of ...",
    "date": "3/1/2024",
    "url": "https://www.tradingview.com/news/benzinga:45bae106a094b:0-elon-musk-sues-sam-altman-and-openai-for-refining-agi-to-maximize-profits-for-microsoft-stark-betrayal-of-founding-agreement/",
    "text": "Tech billionaire Elon Musk has sued Sam Altman and OpenAI whilst also taking a shot at the largest company in the world, Microsoft Corp. MSFT. Musk claims Altman and OpenAI have betrayed the ‘Founding Agreement' of the AI startup. What Happened: Musk filed a lawsuit on Thursday night in the San Francisco Superior Court alleging that Altman and OpenAI have compromised on the founding principles of the artificial intelligence startup, especially due to their relationship with Microsoft. \"OpenAI, Inc. has been transformed into a closed-source de facto subsidiary of the largest technology company in the world: Microsoft. Under its new board, it is not just developing but is actually refining an AGI to maximize profits for Microsoft, rather than for the benefit of humanity.\" See Also: OpenAI, Closed Source? Elon Musk Takes Aim At Sam Altman After Sora AI Reveal Musk wants OpenAI to return to its open-source roots instead of its current closed-source approach. Notably, OpenAI no longer reveals the weights it uses in its newer GPT models, a metric that is crucial for AI models. Musk has some specific demands that he wants the court to enforce against OpenAI. This includes labeling GPT-4 as artificial general intelligence or AGI. The lawsuit says that this will result in GPT-4 being out of the scope of Microsoft's agreement with OpenAI, so Microsoft should not be able to use it. Next up, Musk also wants \"Q*\" and other future next-generation large language models to be called AGI and as such, beyond the scope of OpenAI's license to Microsoft. Musk claims that OpenAI \"solicited tens of millions of dollars\" in donations from him by promising that the company would remain a non-profit dedicated to \"creating safe AGI for public benefit.\" However, by licensing its technology to Microsoft in exchange for billions of dollars, Musk claims OpenAI has \"betrayed\" him and the \"Founding Agreement\" as well. Microsoft has invested $13 billion in OpenAI so far. He further hones in on the point that only OpenAI, and by extension, Microsoft, know the internal details of GPT-4. Musk also underscored the fact that Microsoft CEO Satya Nadella intervened during the infamous firing of Altman from OpenAI. Not only did Altman return to the company, the previous board was also revamped and Microsoft got an \"observer\" seat on it as well – something that it did not have before. Why It Matters: Musk has been having a go at Altman and OpenAI for a long time now. He has been a vocal critic of OpenAI transitioning from a non-profit to a profit-oriented company after his departure in 2018. He has also criticized OpenAI's collaboration with Microsoft on multiple occasions. Most recently, Musk criticized OpenAI after it unveiled its latest product, the Sora AI model that can generate videos using text prompts. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: ‘Not That Interested In Killer Robots:' Instead, OpenAI CEO Sam Altman Is Worried ‘Subtle Misalignments' Could Make AI Dangerous Photo courtesy: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @profitable_trades @TradingView @ozonlayerfx @aggressivecalculator @most_luxurious_lifestyle @life_of_lorena.fx @chartfeed @tradingview @TradingView @fxdelta @lifestylewith_ashley26 @TradingView @aitor_avatar @rok_trader @Cenobar @trading_tools.ir @Market Mentor Network @itzi71 Whatever the trade "
}