{
    "title": "Submission on Microsoft-OpenAI “partnership” merger inquiry - Irish Council \nfor Civil Liberties",
    "date": "1/9/2024",
    "url": "https://www.iccl.ie/news/submission-on-microsoft-openai-partnership-merger-inquiry/",
    "text": "9 January 2024 Along with a coalition of civil society organisations, ICCL has submitted comments in response to the UK's competition authority's Microsoft-OpenAI merger enquiry. Microsoft's investments in OpenAI and the events of November 2023 indicate the influence Microsoft has on OpenAI, which is highly likely to be anti-competitive. In our submission, we raise a number of issues that should be investigated along with a set of example questions that can guide the investigation. See ICCLs related work on artificial intelligence. For comment: Dr Kris Shrishak, Enforce Senior Fellow, ICCL For media queries: ruth.mccourt@iccl.ie / +353874157162 8 January 2024 Submission to CMA on Microsoft-OpenAI “partnership” merger inquiry The Microsoft-OpenAI “partnership” Why this investment must be investigated Why Microsoft's investment in OpenAI gives it significant influence Competition issues the CMA should investigate 1. On 22 July 2019, OpenAI and Microsoft announced an exclusive computing partnership, initially underpinned by $1bn in investment and later supplemented with further funding.[11] What is the nature and the extent of this exclusivity? 2. How much of this investment was compute budget, and at what rate is OpenAI being offered computing power? How does this rate compare with market rates Microsoft offers other companies using Azure? 3. On 22 September 2020, Microsoft announced that it “exclusively license[d] GPT-3”.[12] What are the details of this exclusive relationship, and to what extent does this exclusivity apply to subsequent models and products developed by OpenAI, including DALL-E and GPT-4? 4. Does Microsoft have an exclusive license to OpenAI’s intellectual property?[13] 5. Do any of these exclusive arrangements have an end date? 6. OpenAI switched from non-profit to a capped profit in March 2019.[14] At the time, OpenAI justified this switch as necessary in raising capital to pay for computational power. What role, if any, did Microsoft play in influencing OpenAI’s change in legal structure? 7. Does Microsoft have any tacit or explicit agreement with OpenAI that restricts the latter’s ability to directly compete against it? 8. In 2021, OpenAI released Codex, a fine-tuned GPT-3 model that generated code, in beta phase as an API. This model underlies Microsoft’s coding assistance product GitHub CoPilot. OpenAI subsequently shut down Codex in March 2023.[15] What role did OpenAI’s partnership with Microsoft play in Codex not receiving a product release and being shut down? 9. Since its initial $1bn investment, Microsoft is reported to have invested a total of up to $13bn in OpenAI, including $10bn in January 2023.[16] More recently, after a chaotic weekend at OpenAI,[17] Microsoft is now a non-voting observer on OpenAI’s board.[18] This gives Microsoft exclusive access to knowledge and information with technical or commercial significance. To what extent does this access give Microsoft an unfair competitive advantage? 10. Is there an explicit link between Microsoft’s partnership with OpenAI and the deprecation of existing Microsoft products, which reduces competition? 11. In 2023, Microsoft ended support for its AI-driven virtual assistant Cortana.[19] Which of Microsoft’s other AI products have been deprecated since the beginning of its partnership with OpenAI? 12. Which Microsoft internal AI research and product teams have been shrunk or eliminated since the beginning of the partnership with OpenAI? Which AI staff have been reassigned from Microsoft’s deprecated AI products, such as Cortana, to OpenAI-related work? 13. It has been reported that Microsoft will receive 49% of OpenAI’s profits, after OpenAI pays back its early investors.[20] What are the precise details of this arrangement? 14. Microsoft’s Azure powers “all OpenAI workloads across research, products and API services”.[21] What level of insight does this privileged role give Microsoft into OpenAI’s technical and commercial operations and decision-making? 15. How much direct insight does Microsoft have into the development of OpenAI’s models? 16. Does Microsoft have access to the weights, source code, training data and model architecture for OpenAI’s trained models, including GPT-3 and GPT-4? 17. How much insight does Microsoft have into the integration of OpenAI’s trained model into Microsoft products? 18. How much insight does Microsoft have into the integration of OpenAI’s trained models into the products of other organisations? 19. At which layers in the AI stack (e.g., through its ownership of the infrastructural layer) does Microsoft collect insights and information about OpenAI’s operations? 20. Do these insights give Microsoft a competitive advantage over its rivals? 21. Do these insights eliminate or diminish OpenAI's ability to compete against Microsoft? 22. Does OpenAI depend on Microsoft for gathering insight into how enterprises use OpenAI’s products, for example through the OpenAI Azure-hosted API?  Signed, Irish Council for Civil Liberties (ICCL) The Open Markets Institute (OMI) Foxglove Balanced Economy Project Rebalance Now ARTICLE 19 Mozilla Foundation   [1] Microsoft, \"Microsoft and OpenAI extend partnership\", 23 January 2023. URL: https://blogs.microsoft.com/blog/2023/01/23/microsoftandopenaiextendpartnership/ [2] Cade Metz, and Karen Weise, \"Microsoft to Invest $10 Billion in OpenAI, the Creator of ChatGPT\", 23 January 2023. URL: https://www.nytimes.com/2023/01/23/business/microsoft-chatgpt-artificial-intelligence.html [3] OpenAI, \"Microsoft invests in and partners with OpenAI to support us building beneficial AGI\", 22 July 2019. URL: https://openai.com/blog/microsoft-invests-in-and-partners-with-openai [4] Bundeskartellamt, Case B6-34/23 summary (Decision date 25 September 2023), 15 November 2023. [5] Brian Callaci, \"The Antitrust Lessons of the OpenAI Saga\", 12 December 2023. URL: https://www.thenation.com/article/economy/the-antitrust-lessons-of-the-openai-saga/ [6] Charles Duhigg, \"The Inside Story of Microsoft’s Partnership with OpenAI\", 1 December 2023. URL: https://www.newyorker.com/magazine/2023/12/11/the-inside-story-of-microsofts-partnership-with-openai [7] Karen Hao, and Charlie Warzel, “Inside the Chaos at OpenAI”, 19 November 2023. URL: https://www.theatlantic.com/technology/archive/2023/11/sam-altman-open-ai-chatgpt-chaos/676050/ [8] Competition & Markets Authority, “AI Foundation Models: Initial Report”, 18 September 2023. URL: https://assets.publishing.service.gov.uk/media/65081d3aa41cc300145612c0/Full_report_.pdf [9] OpenAI and Microsoft have claimed that the use of code on GitHub to train AI models is “fair use”. This claim is being contested in court. URL: https://githubcopilotlitigation.com/ [10] Amba Kak, Sarah Myers West, and Meredith Whittaker, \"Make no mistake---AI is owned by Big Tech\", 5 December 2023. URL: https://www.technologyreview.com/2023/12/05/1084393/make-no-mistake-ai-is-owned-by-big-tech/ [11] OpenAI, \"Microsoft invests in and partners with OpenAI to support us building beneficial AGI\", 22 July 2019. URL: https://openai.com/blog/microsoft-invests-in-and-partners-with-openai [12] Microsoft, \"Microsoft teams up with OpenAI to exclusively license GPT-3 language model\", 22 September 2020. URL: https://blogs.microsoft.com/blog/2020/09/22/microsoft-teams-up-with-openai-to-exclusively-license-gpt-3-language-model/ [13] Financial Times, \"How Microsoft’s multibillion-dollar alliance with OpenAI really work\", 16 December 2023. URL: https://www.ft.com/content/458b162d-c97a-4464-8afc-72d65afb28ed [14] OpenAI, “OpenAI LP”, 11 March 2019. URL: https://openai.com/blog/openai-lp [15] The Decoder, “OpenAI kills its Codex code model, recommends GPT3.5 instead”, 22 March 2023. URL: https://the-decoder.com/openai-kills-code-model-codex/ [16] Financial Times, \"How Microsoft’s multibillion-dollar alliance with OpenAI really work\", 16 December 2023. URL: https://www.ft.com/content/458b162d-c97a-4464-8afc-72d65afb28ed [17] Financial Times, \"‘I’ve never seen anything like this’: how OpenAI’s dramatic weekend unfolded\", 20 November 2023. URL: https://www.ft.com/content/fce218fb-6873-4891-8860-091ff8cf0389 [18] Dina Bass, and Rachel Metz, \"Microsoft Picks Dee Templeton as OpenAI Board Observer\", 5 January 2024. URL: https://www.bloomberg.com/news/articles/2024-01-05/microsoft-picks-dee-templeton-as-openai-board-observer [19] Tom Warren, \"Microsoft shuts down Cortana app on Windows 11\", 11 August 2023. URL: https://www.theverge.com/2023/8/11/23828311/microsoft-shuts-down-cortana-windows-11 [20] Financial Times, \"How Microsoft’s multibillion-dollar alliance with OpenAI really work\", 16 December 2023. URL: https://www.ft.com/content/458b162d-c97a-4464-8afc-72d65afb28ed [21] Microsoft, \"Microsoft and OpenAI extend partnership\", 23 January 2023. URL: https://blogs.microsoft.com/blog/2023/01/23/microsoftandopenaiextendpartnership/  "
}