{
    "title": "Why upcoming tech earnings may be 'parabolic' for the market",
    "date": "1/23/2024",
    "url": "https://finance.yahoo.com/video/why-upcoming-tech-earnings-may-172129783.html",
    "text": "Nvidia (NVDA) and Microsoft (MSFT) saw their stock prices jump thanks to their big push to invest and make advancements in AI. Thanks to that outsized growth, there is a potential that they will continue to maintain their dominance on the S&P 500 (^GSPC). As they hold their dominance, the outcome of their earnings can have major sway over the broader market. Ken Mahoney, CEO of Mahoney Asset Management, joins Yahoo Finance to discuss upcoming earnings from major tech companies and how they could have a sizable impact on the broader market that investors would not want to miss out on. When it comes to expectations for the outcome of potential tech earnings, Mahoney affirms : \"There could be a little sell on the news reaction, but I think the guidance is going to be key. The law of big numbers is incredible, I mean Nvidia as an example, last 12 months has doubled topline revenue, expected to double topline revenue in '24 and '25 and the CEO of Nvidia said 'Hey, we're in the second, third inning.' I hear this all the time. 'Ken, I missed it, I missed it.' Well, the CEO, who is really at the epicenter of all this, is telling you that we're probably in the second or third inning. You might not want to stay around until the ninth or extra innings, but there's a pretty long runway to make some money akin to what we saw in the mid 1990s. \" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino RACHELLE AKUFFO: The AI-fueled surge in tech shares though pulling stocks out of their lackluster start to 2024. The S&P 500 and Dow notching another record-high close on Monday, that was thanks to Wall Street's optimism for potential rate cuts, an upbeat read on consumer sentiment, and the AI euphoria continuing to power stocks to new record highs. With tech earnings on the horizon, our next guest sees earnings from the likes of NVIDIA and Microsoft pushing markets into a parabolic mode. Let's bring him in, Ken Mahoney, Mahoney Asset Management CEO. So Ken, talk about this parabolic rise and as well as the risks that the tech sector could face that might upend some of this market euphoria. KEN MAHONEY: I love the word parabolic. I think my high school teacher would be very proud of me that I've actually still used it I don't know how many years later, 40 years later. But again, there's a lot of reason why they have a strong tailwind, you know, NVIDIA, Microsoft, and so forth. But first off, one thing that doesn't get mentioned a lot in the media, I believe, is a weaker dollar, right? So inflation has come down, interest rates have come down, and a weaker dollar really helps out earnings from multinationals. And I think the analysts on these companies have sniffed that out. When you look at NVIDIA, by the way, even the last couple of weeks, we saw Taiwan Semiconductor, their largest contract manufacturer in the world for chips, they own about 55% dominant. They are smoking over there. They're doing really well. Zuckerberg and Meta basically last week say 350,000 new chip orders coming in about $9 billion in capital expenditure. So this is not like, oh OK, this is AI is something around, a concept, and isn't that pretty? It's resulting in real earnings. And those companies like NVIDIA, they're in all the growth areas, autonomous cars and so forth, gaming. And you go to Microsoft, you get all the verticals and you get AI. So you have cloud, you have gaming, you have Microsoft Windows, and all that. And then on top of that, you get AI. So I think there's a really strong reason why there is such a strong tailwind for the leadership, especially these companies that already have strong foundational businesses and then add that to a creatively AI and all the different revenue sources and streams that could come from that. AKIKO FUJITA: Ken, how much of that upside in earnings has already been baked into the stock price though? We were saying yesterday, if you look at the financials that kick things off last week, they didn't necessarily get rewarded in a big way for any kind of beat. Do you see things playing out differently for tech? KEN MAHONEY: I do. You know, we look at the banks, I have to tell you, first of all, we're growth managers. So we wouldn't find ourselves in banks. JP Morgan, the best bank and best managed bank, basically a lot of their earnings is interest income. I mean, that's not really exciting you know. You want to hear about loan demand growing or some other parts of the business. But I mean interest income was a big chunk of their earnings, so that's not really good. I think NVIDIA and Microsoft, you know, there could be a little sell-on news reaction, but I think the guidance is going to be key. I mean the law of big numbers is incredible. I mean, NVIDIA as an example, last 12 months of double top line revenue expected to double top line revenue into '24 and '25. And the CEO of NVIDIA said, hey, we're in a second or third inning. Because I hear this all the time, Ken, I feel like we missed it, I missed it, I missed it. Well, the CEO, you know, who's really at the epicenter of all this, is telling you that we're probably in the second or third inning. Yeah, you might want to not want to stay around to the ninth inning or extra innings, but certainly there's a pretty long runway to make some money akin to what we saw in the mid 1990s. RACHELLE AKUFFO: So Ken, if this is going to be a parabolic ride then, how do you know when to get off versus getting thrown off, as you mentioned there, when it does get to that ninth inning point? KEN MAHONEY: Got you. Hey, Ken, thrown off those wagons, right? So look, to avoid around trip, let's say I'm making this up. Let's say you bought NVIDIA $400 and now it's up to $600. There's nothing wrong with taking 25% off the table, 30% off the table. Incrementally be smart because god forbid it comes back to $400 and you break even. That's what they call a round trip. We don't want to invest in this round trip. So there's nothing wrong with taking some piece off the table. But the temptation is to sell and take these short profits. I think these are longer-term winners, especially if we're in the second or third inning. AKIKO FUJITA: Ken, you mentioned NVIDIA as well as Microsoft. I mean, you could argue those are the stocks that have benefited the most on the back of this exuberance around AI. What about some other names you're watching? If you look at the chip makers, for example, AMD as well as Intel, I mean they're really starting to push out their AI offerings as well. Is that maybe a better value just given the run up that we have seen in a name like NVIDIA? KEN MAHONEY: Yeah, AMD is hard. I mean, it was late October, the spooky time when the Fed's going to keep rates for longer and the market was selling off. And AMD was $100 a share and you know kissed $174 a share just a couple of days ago. So I don't necessarily see value in that. But you can look at Google and Amazon. I think Google is up about 5% year to date. Amazon's about 3.5% year to date. Again, NVIDIA is up 20%, 25%. AMD is about 25%. So if you're looking and say, hey, I don't want to jump on that momentum train, that parabolic move, which you could fall off the wagon here and there, Google and Amazon both have great opportunities in AI for the work they do, especially Amazon with the cloud and Google what they're doing. So if you feel like you miss those names, I think your next bet would be Google and Amazon. RACHELLE AKUFFO: And what about small caps, Ken? Any opportunities you see there because they did have their moment. They seem to taper off towards the end of last year. What are your expectations this year? KEN MAHONEY: Yeah, I guess I'm a contrarian with that. I don't see that. And I know they had a good run yesterday, a good close, which is nice. I think this market still wants to liquid stocks, big companies that are consistent. They tend to beat estimates. They raise guidance. We're getting a lot of foreign investment. You know multinationals are investing into our markets. They tend to want to be in liquid names, not small cap. I think, again, if you're a really good stock picker maybe you could pick that out. But as an overall index, I still think the Magnificent Seven-- by the way, minus Tesla, Magnificent Six-- I would say, are still the way to go. They're going to be consistent for you. There really shouldn't be too many surprises. In the small cap space, unfortunately, especially around earnings season, there's always a lot of surprises. And some of those surprises are to the downside. AKIKO FUJITA: Ken Mahoney, Mahoney Asset Management CEO, good to talk to you today. Appreciate the time. KEN MAHONEY: Right, me as well. Thank you. Related Quotes "
}