{
    "title": "Microsoft: AI Focus Driving bid to be Most Valuable Company",
    "date": "1/8/2024",
    "url": "https://technologymagazine.com/articles/microsoft-ai-focus-driving-bid-to-be-most-valuable-company",
    "text": "Microsoft is close to regaining the title of the most valuable company in the United States from Apple, with slowing iPhone demand and Microsoft’s recent AI announcements closing the gap between the two companies to US$100bn. Apple has been the US’ most valuable company since July 2022, recently reaching a landmark US$3tn valuation. But the company’s poor recent stock performance, in combination with a number of AI-focused announcements from Microsoft, has closed the gap significantly, with about US$177bn in market value erased so far in January 2024 according to Bloomberg data. Apple’s stock decline has been attributed to competitive pressures from Chinese rivals, particularly Huawei, with Reuters reporting that its iPhone sales in China had dropped by 30% in the first week of 2024. With a Microsoft-sponsored study by IDC projecting that generative AI will add nearly US$10tn to global GDP over the next 10 years, Microsoft has embraced the Gen AI revolution: building it into its consumer and enterprise offerings. The company’s Copilot, an AI assistant feature for Microsoft 365 applications and services, is built into its Windows 11 operating system. Described as an ‘AI assistant at work,’ Copilot builds on Bing Chat Enterprise, but includes enterprise-grade security, privacy, compliance and responsible AI to ensure all data processing happens inside the user’s Microsoft 365 space. Microsoft also has a well known relationship with OpenAI – reportedly owning 49% of the ChatGPT creator, and announcing a ‘multibillion dollar’ investment in the AI leader in January 2023. And in October 2023 Microsoft closed its largest acquisition ever, exceeding the US$26bn it paid to acquire LinkedIn in 2016 and the US$7.5bn it reportedly paid to acquire Bethesda in 2021, as UK regulators approved its bid to purchase Activision Blizzard. The deal means Microsoft is now the world’s third-largest gaming company by revenue, behind market leader Tencent and Sony. ****** Make sure you check out the latest edition of Technology Magazine and also sign up to our global conference series - Tech & AI LIVE 2024 ****** Technology Magazine is a BizClik brand Europe’s largest telecommunications provider Deutsche Telekom is using RISE with SAP to accelerate its journey to the cloud… We speak with Dr Li Feifei, President of Database Products Business at Alibaba Cloud, about the benefits of combining AI with serverless cloud computing… Microsoft has announced it has hired Inflection and DeepMind cofounder Mustafa Suleyman as the CEO of Microsoft AI, focusing on its commercial AI products… Technology Magazine is the ‘Digital Community’ for the global technology industry. Technology Magazine covers the '7 Pillars of Digital Journey' - Digital Transformation, Cloud Computing, Cybersecurity, Digital Ecosystems, Strategic Alliances, Data & Data Analytics and AI - connecting the world’s largest community of enterprise IT and technology executives. Technology Magazine focuses on technology news, key technology interviews, technology videos, the 'Technology Podcast' series along with an ever-expanding range of focused technology white papers and webinars. "
}