{
    "title": "Phil Spencer sends an email to Microsoft employees informing them of a new \nround of layoffs",
    "date": "1/28/2024",
    "url": "https://www.gizchina.com/2024/01/28/microsoft-layoffs-gaming-department/",
    "text": "In an email to employees, Phil Spencer recently informed Microsoft employees of a new round of layoffs. This layoff mainly affects the gaming department. Spencer said in the message that the company will have to let go of about 1900 people. Players and industry insiders expressed dissatisfaction with Microsoft’s senior management. Phil Spencer promised that the laid-off workers would get severance compensation and transition support. However, the email does not provide any information or details about the severance compensation and transition support.  Xbox head Phil Spencer explained the layoff decision in an internal email, saying it was to “establish a sustainable cost structure.” He thanked the laid-off employees for their contributions and promised to provide severance compensation and transition support. However, players obviously couldn’t accept this explanation, and the Internet was filled with angry accusations against Spencer. “Its been a little over three months since the Activision, Blizzard and King teams joined Microsoft. As we move forward in 2023, the leadership of Microsoft Gaming and Activision Blizzard is committed to aligning on a strategy and an execution plan with a sustainable cost structure that will support the whole of our growing business. Together, we’ve set priorities, identified areas of overlap, and ensured that we’re all aligned on the best opportunities for growth. As part of this process, we have made the painful decision to reduce the size of our gaming workforce by approximately 1,900 out of the 22,000 people on our team. The Gaming Leadership Team and I are committed to navigating this process as thoughtfully as possible. The people who are directly impacted by these reductions have all played an important part in the success of Activision, ZeniMax and the Xbox teams, and they should be proud of everything they’ve accomplished here. We are grateful for all of the creativity, passion and dedication they have brought to our games, our players, and our colleagues. We will provide our full support to those who are impacted during the transition, including severance benefits informed by local employment laws. Those whose roles will be impacted will be notified, and we ask that you please treat your departing colleagues with the respect and compassion that is consistent with our values. Looking ahead, we’ll continue to invest in areas that will grow our business and support our strategy of bringing more games to more players around the world. Although this is a difficult moment for our team, I’m as confident as ever in your ability to create and nurture the games, stories and worlds that bring players together. Phil”  It is worth noting that this layoff occurred less than half a year after Microsoft spent $70 billion to acquire Activision Blizzard. This is also happening at a time when Microsoft hit a market value of more than $3 trillion. This has led many to question why Microsoft, which has so much money, is still laying off employees. In addition to layoffs, CNBC reports that Blizzard Entertainment President Mike Ybarra also announced his resignation. Also, an unnamed survival game Blizzard was developing was cancelled.  Microsoft has a long history of layoffs whose recent history dates back to 2009. The company’s layoff history reflects a series of significant workforce reductions over the years, with the largest being in 2014 when the company announced plans to lay off 18,000 employees, amounting to a 14% reduction of its workforce at the time. This marked the largest-ever layoff in Microsoft’s history, including 12,500 professional and factory personnel. Previously, in 2009, Microsoft eliminated 5,800 jobs in line with the Great Recession of 2008-2017. In July 2014, Microsoft announced a second wave of layoffs, totalling 2,100 employees, including 747 in the Seattle-Redmond area. This brought the total number of layoffs to over 15,000 out of the 18,000 expected cuts. In October 2014, Microsoft revealed that it was almost done with the elimination of 18,000 employees. In July 2015, Microsoft announced another 7,800 job cuts in the next several months. By May 2016, the company announced it was laying off 1,850 workers. More recently, Microsoft announced plans to cut 10,000 jobs, which represents about 5% of its workforce of over 220,000 employees. This is the second-largest workforce reduction in Microsoft’s history. The company cited a need to “align our cost structure with our revenue and where we see customer demand.” Microsoft’s layoffs have been a topic of discussion and concern among employees and the tech industry. In July 2023, Microsoft laid off over 200 employees in a fresh round of layoffs, with an impacted employee sharing his story on LinkedIn, emphasizing that layoffs have nothing to do with a person’s capabilities. These layoffs reflect the broader trend of tech companies cutting jobs in response to changing market conditions and economic pressures. Despite improving fundamentals, technology companies have continued to lay off staff in 2024. Forbes believes that the layoffs could be a result of redundancies after the acquisition of Activision Blizzard.  The recent layoffs by Microsoft’s game department, affecting 1,900 employees, have stirred criticism within the gaming community. Despite Xbox head Phil Spencer’s explanation of the decision to establish a sustainable cost structure, players and industry insiders remain dissatisfied. The timing of the layoffs, came shortly after Microsoft acquired Activision Blizzard for $70 billion. Microsoft’s soaring market value has also raised questions about the company’s priorities and treatment of employees. The outpouring of frustration and disappointment on social media reflects a deep concern within the gaming community about the human cost of corporate decisions in the industry. Efe Udin is a seasoned tech writer with over seven years of experience. He covers a wide range of topics in the tech industry from industry politics to mobile phone performance. From mobile phones to tablets, Efe has also kept a keen eye on the latest advancements and trends. He provides insightful analysis and reviews to inform and educate readers. Efe is very passionate about tech and covers interesting stories as well as offers solutions where possible. Efe Udin, a government tech policy expert is a seasoned tech writer with over seven years of tech writing experience. Efe's true passion lies in exploring the intersection of technology, politics, and brand feuds.\n\r\nWith an astute understanding of the power dynamics and competitive landscape within the tech world, Efe delves into the intricacies of how technology influences political discourse and how brand rivalries shape the industry.     GizChina Follow @gizchina  Accredited technology blog dedicated to providing breaking news, expert reviews and original content related to mobile tech and EV industry, smartphones, gadgets and IoT. Keep up to date with the latest Android phone news and reviews on our social media channels: "
}