{
    "title": "Microsoft Teams services are down, as thousands of users report issues",
    "date": "1/26/2024",
    "url": "https://www.cbsnews.com/news/microsoft-teams-outages-block-limit-user-access/",
    "text": "Watch CBS News By Elizabeth Napolitano Updated on:  January 26, 2024 / 6:08 PM EST\n          / CBS/AP Microsoft Teams is experiencing a service outage that has blocked access and limited features for some users. The outage began Friday at around 11 a.m. Eastern Time, with reports of technical issues spiking in the afternoon and peaking shortly before 2 p.m. More than 14,500 service incidents were reported by then, outage tracker DownDetector's data shows. By 5:44 p.m., the number of reports fell to a little less than 1,100, according to the tracker. Microsoft did not immediately respond to CBS MoneyWatch's request for comment. According to DownDetector, 67% of the user-reported issues involved the Teams app, 25% are service connection-related problems and 8% are website issues. Users complained they were unable to use the service, citing messaging delays and problems with graphic displays. Although it was unclear how many users were affected by the outages, Microsoft was deluged with complaints on social media. It’s cool @MicrosoftTeams I didn’t plan on doing any work today or anything 🙃 In an X post on Friday, Microsoft 365 Status, the company's office account for service incidents, said it identified \"a networking issue impacting a portion of the Teams service\" and that it has moved the affected processes to a backup system. The company added that it was making headway restoring Teams service in Europe and the Middle East. Microsoft also said it was working to protect its network in North and South America as it monitors the outages, adding that it was optimizing traffic patterns and applying configuration changes to reduce customer impact as quickly as possible. —With reporting by the Associated Press. Elizabeth Napolitano is a freelance reporter at CBS MoneyWatch, where she covers business and technology news. She also writes for CoinDesk. Before joining CBS, she interned at NBC News' BizTech Unit and worked on The Associated Press' web scraping team. First published on January 26, 2024 / 3:12 PM EST © 2024 CBS Interactive Inc. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report. Copyright ©2024 CBS Interactive Inc. All rights reserved. Quotes delayed at least 15 minutes. Market data provided by ICE Data Services. ICE Limitations. Powered and implemented by FactSet. News provided by The Associated Press. Legal Statement. "
}