{
    "title": "Microsoft closes in on Apple's 'most valuable company' title",
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/video/microsoft-closes-apples-top-market-173748393.html",
    "text": "The fight is on in 2024's first trading week as Microsoft (MSFT) dukes it out with Apple for the title of most valuable US company. The tech giants' market caps are neck following two analyst downgrades to the iPhone maker's stock this week. Yahoo Finance Senior Reporter Jared Blikre observes the two tech companies, also discussing Apple's prior history of annual sales growth. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. RACHELLE AKUFFO: Well, Microsoft is about $100 billion away from overtaking Apple as the most valuable company in the US. This comes after two analysts downgraded Apple this week. \"Yahoo Finance's\" own Jared Blikre is here to break it down for us. The battle of the tech giants, Jared. JARED BLIKRE: Yes. And Thank. You for the introduction there. Here is a market cap over the last five years of these two giant companies. And by the way, they're very different companies. But we can compare them. Apple is in purple here. It's currently on top. And here is its $3 trillion plus peak. And here is Microsoft in cyan, just a little bit lower right now. But you can see Microsoft, at times, over the last five years has led Apple for brief periods of time, including coming out of those pandemic lows. But really you go back 10, 20, 30, 40 years and you can really see the difference between those two companies. I'm going to compare now the stock prices of these two companies over the last 10 years. You can see Apple's up 842%. Microsoft is up 904%. So neck and neck right there with Microsoft a slight edge. You look at the 20-year chart. What happened? Apple's up 45,000%. Microsoft up 1,200%. I think a lot of investors would take that. But essentially, if you had to buy 2008 to 2010 to reach any comparable number with Apple, and if you got in between 2000 and 2008, that was dead money. That was a losing trade. And that's because in the wake of the tech bubble, and also the antitrust suit that Microsoft was facing 20 years ago, it just became dead money for about a decade. Let me now show you the story in terms of sales growth. This is Apple sales growth going back into the late '90s. This is when Steve Jobs took over. And let's not forget, Apple was left for dead, almost went bankrupt. How about that? But this incredible years-- these years of sales growth here, a lot of them topping 75%. That's the iPod. And then that's the iPhone. And you can see things have trailed off. The services side of the equation has gotten a lot of play here, but it doesn't always live up to expectations. Right now, four quarters of declining revenue growth. That is a negative situation for Apple. Expectations are for that to be broken. But we'll have to see how this plays out in earnings season. Give it another month. RACHELLE AKUFFO: Looking forward to that. Our very own Jared Blikre. Thank you so much. Related Quotes "
}