{
    "title": "3 BlackRock Stock Favorites That You Need to Know About",
    "date": "2/26/2024",
    "url": "https://investorplace.com/2024/02/3-blackrock-stock-favorites-that-you-need-to-know-about/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. These BlackRock stocks are some of its best holdings Advertisement Source: Shutter_M / Shutterstock BlackRock (NYSE:BLK) stocks stand as a towering testament to market influence and financial prowess. Leading the financial stage as the largest asset manager on a global scale, BlackRock boasts a whopping $10 trillion in assets under management at the end of the fourth quarter (Q4) last year. The financial behemoth serves various clients, from institutional and corporate to individual investors, by effectively managing equity, fixed-income and balanced portfolios across multiple funds and investment vehicles. Its massive influence stretches across global markets, including equities, fixed income, ETFs and more, positioning it as a pivotal player in the financial domain. Furthermore, BlackRock’s consistent ability to return capital to shareholders emphasizes its robust influence. Drawing on insights from HedgeFollow.com, BlackRock reported a 3-year cumulative return of 34% from its top 20 holdings (weighted). Moreover, BlackRock stocks recently made headlines as the firm reported quarterly earnings of $9.66 per share, outperforming analyst estimates of $8.84. This represents a notable earnings surprise of 9.3%, underscoring BlackRock’s financial health and its knack for surpassing analyst expectations. That said, here are three stocks that are the cornerstones of BlackRock’s impressive portfolio. Apple (NASDAQ:AAPL), a titan among Warren Buffett’s favored stocks, remains a cornerstone of BlackRock’s portfolio. Despite a trimming of AAPL stock by Buffett during Q4, BlackRock’s steadfast investment is noteworthy. Holding 1.04 billion shares of Apple, with an additional 11 million acquired in Q4, BlackRock’s commitment is a testament to Apple’s lasting appeal. That is particularly significant in light of Apple’s fiscal first-quarter (Q1) performance for 2024, which, despite a 13% sales dip in China, still surpassed analysts’ expectations for sales and revenue. Moreover, the company’s strategic pivot towards service expansion and its foray into the burgeoning cloud computing sector positions it for sustained growth. Moreover, Apple’s innovative stride into the virtual reality landscape with the Apple Vision Pro headset should be a long-term growth catalyst. With OpenAI CEO Sam Altman lauding the Vision Pro as the “second most impressive” tech marvel since the iPhone, Apple’s trajectory seems set for the stars. The sale of upwards of 200,000 Vision Pro headsets already is a testament to Apple’s brand value. Jeff Bezos’ relentless pursuit for greater customer satisfaction has transformed an online bookstore into a trillion-dollar behemoth, extending its reach beyond eCommerce. Moreover, BlackRock’s sizeable investment in Amazon (NASDAQ:AMZN), holding 627.2 million shares and boosting its stake by 13.8 million in Q4, reflects confidence in its trajectory. That investment strategy is vindicated by AMZN’s Q4 results, where the company surpassed expectations with a 14% surge in net sales along with an 82% improvement in operating cash flow year-over-year (YOY). Additionally, Amazon Web Services (AWS) and advertising continue to impress, with AWS boasting a 13% growth to $24 billion in Q4. Furthermore, the launch of Amazon Bedrock, which efficiently integrates top AI models, and Amazon CodeWhisperer, enhancing coder efficiency, should redefine its eCommerce and cloud services. These advancements, coupled with improved Alexa models for more natural user interactions, cement Amazon’s position as a leader in retail innovation. Microsoft’s (NASDAQ:MSFT) strategic investment in OpenAI has positioned the company as a leading AI stock, increasing its allure among investors. With its software and cloud operations flourishing, MSFT has generated ample cash flow, fueling multiple growth endeavors. The growing demand for cloud services positions Microsoft for sustained long-term expansion due to its formidable AI and cloud computing capabilities. Moreover, BlackRock’s investment in Microsoft, totaling 538.9 million shares with an addition of 5.3 million in Q4, is a major stamp of approval in MSFT’s continued expansion and innovation. Microsoft’s Q4 performance was exceptionally strong, with the company reporting a GAAP EPS of $2.93, surpassing expectations by 16 cents, and a revenue of $62 billion, up 17.7% YOY, exceeding forecasts by $890 million. Notably, Productivity and Business Processes sales reached $19.2 billion, marking a 13% increase, while the Intelligent Cloud segment saw a 20% increase to $25.9 billion. These figures testify to Microsoft’s robust financial health and dynamic growth across multiple tech verticals. On the date of publication, Muslim Farooque did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Muslim Farooque is a keen investor and an optimist at heart. A life-long gamer and tech enthusiast, he has a particular affinity for analyzing technology stocks. Muslim holds a bachelor’s of science degree in applied accounting from Oxford Brookes University.   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/3-blackrock-stock-favorites-that-you-need-to-know-about/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Crypto & Blockchain Stocks to Buy Market Analysis Stocks to Sell Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}