{
    "title": "AI Would Improve Productivity, Increase Employee Wellbeing – Microsoft",
    "date": "2/1/2024",
    "url": "https://independent.ng/ai-would-improve-productivity-increase-employee-wellbeing-microsoft/",
    "text": "Independent Newspaper Nigeria - Breaking News from Nigeria and the World Blessings NG Drops New Singles, ‘What He Said’ LuckyDChampion Is Making His Mark In Afrobeats Nollywood Producer, Andy Best Dies Lagos Island Councilor Empowers Over 800 Vulnerable Persons Yahaya Bello: Why EFCC Leadership Shouldn’t Subject Commission To Ridicule Withdraw All Court Cases Or Be Expelled, APC Threatens Benue Litigants Next Man Utd Manager: Ten Hag ‘Sack Decision Reached’ Man City Willing To Pay €90 Million To Sign Eberechi Eze Man Utd Contemplating Swoop To Sign Joshua Zirkzee Don Advocates Agricultural Machinery Engineering For Food Security In Nigeria Safeguarding The Source: World Water Day And The Crucial Role Of Home Water Filters 9th Agrofood, Plastprintpack Tradeshow Kicks Off March 26 Several Injured As Russia Targets Kyiv In Missile Attack, Mayor Says Russia Says Arrested Man For Spying For Ukraine Russia Painting Decoy Submarines At Black Sea Ports Amid Mounting Losses—UK Analysts Propose Deployment Of Cutting-Edge Technology, Others As Insecurity,… Cost Of Living Crisis Worsens Why We Revoked Over 4000BDC Operators Licences — CBN Celestial Church Loses Founder’s Daughter, Prophetess Deborah Oshoffa, At 51 How To Make God’s Words Change Your Life Liberation From Leprosy And Other Infectious Diseases LAGOS – In a bid to debunk widespread myths and misconceptions about Artificial Intelligence (AI) and its applications and how it would take over jobs, Microsoft Corporation has provided insights into how it ap­proaches AI development and ethics. Speaking during a virtual session of Microsoft Africa AI Journalists Academy, organised by the leading global vendor of computer software, Ayanda Ngcebetsha, Director, Data and AI, Microsoft South Africa, and Trusha Vanmali, Business Program Manager, Microsoft South Africa, who spoke at the AI Journalist Academy, organised by Microsoft, stressed that AI would only improve productivity rather than take over jobs. “The importance of AI tools in summarising reports, carrying out accurate research, imputing language translation and coordinating several meetings in one day, while making the best use of the available time cannot be underestimated,” they explained. The duo noted that although 2023 was the year AI went mainstream, 2024 would be the year in which AI tools would help free up time for more creative and fulfilling cognitive work. Ngcebetsha said that AI was around us, yet invisible, and working aside from us to enhance creativity rather than working against creativity. He said copilot, which is an AI tool, could help content developers in writ­ing, coding, summarising and search­ing for specific information like charts and tables that would help them devel­op good reports in less time. Accord­ing to him, Chief Executive Officers (CEOs) are more interested in using AI to increase productivity than to cut headcount. The Microsoft director said that, from the data available to the corpo­ration, reducing headcount was last on the list of what leaders would value from AI. “After ‘increasing productivity’, leaders’ top hopes for AI are to help employees with necessary but repet­itive tasks and increase employee wellbeing. “They also want to eliminate em­ployee time spent on low-value activi­ties, enhance employees’ capabilities, and accelerate employees’ pace of work,” he said. Prev Post Cybersecurity Trends To Watch In 2024 Next Post Femi Otedola Emerges Chairman Of FBN Holdings Comments are closed.  Independent Newspapers Limited, registered on July 17, 2001 (RC No: 419927), commenced publication on October 1, 2001. With registered office at 15b, Daranijo street, off Odusami street, off Wemco road, Ogba, Ikeja, it publishes DAILY INDEPENDENT, Monday - Friday; Saturday Independent, Sunday Independent, independent.ng, TV Independent on YouTube and IndependentNgr (Facebook, Twitter & Instagram). Blessings NG Drops New Singles, ‘What He Said’ LuckyDChampion Is Making His Mark In Afrobeats Nollywood Producer, Andy Best Dies Lagos Island Councilor Empowers Over 800 Vulnerable Persons Yahaya Bello: Why EFCC Leadership Shouldn’t Subject Commission To Ridicule Withdraw All Court Cases Or Be Expelled, APC Threatens Benue Litigants Next Man Utd Manager: Ten Hag ‘Sack Decision Reached’ Man City Willing To Pay €90 Million To Sign Eberechi Eze Man Utd Contemplating Swoop To Sign Joshua Zirkzee Don Advocates Agricultural Machinery Engineering For Food Security In Nigeria Safeguarding The Source: World Water Day And The Crucial Role Of Home Water Filters 9th Agrofood, Plastprintpack Tradeshow Kicks Off March 26 Several Injured As Russia Targets Kyiv In Missile Attack, Mayor Says Russia Says Arrested Man For Spying For Ukraine Russia Painting Decoy Submarines At Black Sea Ports Amid Mounting Losses—UK Analysts Propose Deployment Of Cutting-Edge Technology, Others As Insecurity,… Cost Of Living Crisis Worsens Why We Revoked Over 4000BDC Operators Licences — CBN Celestial Church Loses Founder’s Daughter, Prophetess Deborah Oshoffa, At 51 How To Make God’s Words Change Your Life Liberation From Leprosy And Other Infectious Diseases Blessings NG Drops New Singles, ‘What He Said’ LuckyDChampion Is Making His Mark In Afrobeats Nollywood Producer, Andy Best Dies Lagos Island Councilor Empowers Over 800 Vulnerable Persons Yahaya Bello: Why EFCC Leadership Shouldn’t Subject Commission To Ridicule Withdraw All Court Cases Or Be Expelled, APC Threatens Benue Litigants Next Man Utd Manager: Ten Hag ‘Sack Decision Reached’ Man City Willing To Pay €90 Million To Sign Eberechi Eze Man Utd Contemplating Swoop To Sign Joshua Zirkzee Don Advocates Agricultural Machinery Engineering For Food Security In Nigeria Safeguarding The Source: World Water Day And The Crucial Role Of Home Water Filters 9th Agrofood, Plastprintpack Tradeshow Kicks Off March 26 Several Injured As Russia Targets Kyiv In Missile Attack, Mayor Says Russia Says Arrested Man For Spying For Ukraine Russia Painting Decoy Submarines At Black Sea Ports Amid Mounting Losses—UK Analysts Propose Deployment Of Cutting-Edge Technology, Others As Insecurity,… Cost Of Living Crisis Worsens Why We Revoked Over 4000BDC Operators Licences — CBN Celestial Church Loses Founder’s Daughter, Prophetess Deborah Oshoffa, At 51 How To Make God’s Words Change Your Life Liberation From Leprosy And Other Infectious Diseases Welcome, Login to your account. Recover your password. A password will be e-mailed to you. "
}