{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.datacenterdynamics.com/en/news/microsoft-azure-poaches-aws-infrastructure-hardware-chief/",
    "text": "More churn at the top of Amazon's cloud platform A senior hardware executive from Amazon Web Services (AWS) has jumped ship to join rival Microsoft Azure. Ahmed Shihab, who was VP for infrastructure hardware for eight years at Amazon’s public cloud platform, has joined Azure as corporate vice president for storage. The move was first reported by CRN AU. Microsoft has not released details of his role, but on LinkedIn, Shihab wrote that he is “building out world-class storage services” for Azure. At AWS his role encompassed “innovation, build and operation” of all AWS's compute and storage systems. Prior to joining Amazon in 2016, he was VP and chief architect at data infrastructure vendor NetApp, and before that spent eight years at another cloud infrastructure company, Xyratex, ascending to the role of senior vice president and general manager. AWS has been experiencing some churn in senior positions over recent months. Last May, DCD reported that the company’s head of data center design, planning, construction, and operation, quietly exited the business. Chris Vonderhaar, who had been with Amazon 13 years and who had previously been touted as a potential future AWS CEO, subsequently joined Google Cloud as vice president for demand and supply management. The company’s India and South Asia division has also lost two leading figures in the space of a few months. Vaishali Kasture, the interim head of AWS India, resigned in December. Kasture, who had been at AWS for five years, was appointed after her predecessor, Puneet Chandok, abruptly left the role and took a position at Microsoft, India. AWS remains the largest public cloud provider, and had a 31 percent share of the market in the fourth quarter of 2023 according to figures from Synergy Research Group. Azure is the second biggest player in the space on 24 percent, with Google Cloud taking an 11 percent share. Data Centre Dynamics Ltd (DCD), 296-300 St John St, London EC1V 4PAEmail. [email protected]DCD is a subsidiary of InfraXmedia "
}