{
    "title": "Snowflake Stock, Software Firms Rise After Amazon, Microsoft Reports",
    "date": "2/2/2024",
    "url": "https://www.investors.com/news/technology/snowflake-stock-amazon-microsoft-cloud-2024/",
    "text": "BREAKING: Futures Mixed Cloud software stocks — led by Snowflake (SNOW) and Datadog (DDOG) — rallied Friday following strong earnings results this week from the big three of cloud computing: Amazon (AMZN) Microsoft (MSFT) and Alphabet (GOOGL). Snowflake stock rose more than 9% to close at 218.76 on the stock market today. Shares of Datadog gained 6% to 134.31. Other cloud data-focused companies such as Elastic (ESTC), Confluent (CFLT) and MongoDB (MDB) each gained more than 5% Friday. The big three cloud providers each said this week that spending trends are improving. The growth rate for cloud revenue growth slowed for much of the industry late in 2022 and into 2023. That's in part because companies focused on cloud spending \"optimization,\" as it became known industrywide. But trends appeared to be improving in the second half of the year. December-quarter results from the cloud giants point to further momentum. \"We continue to see the diminishing impact of cost optimizations,\" Amazon Chief Financial Officer Brian Olsavsky told analysts Thursday. \"And as these optimizations slow down, we're seeing more companies turning their attention to newer initiatives and reaccelerating existing migrations.\" Amazon Web Services is the world's largest cloud-computing infrastructure provider. The division posted  a 13% year-over-year revenue increase to $24.2 billion. That marked a slight acceleration from the 12% annual growth rate in the third quarter. AWS' growth rate had been slowing for several quarters. Microsoft said Tuesday that its Azure cloud business grew 30% year over year in its December quarter, exceeding the high end of its guidance. The tech giant said it got a lift from clients using its servers and software to build generative artificial intelligence tools. \"That period of massive, I'll call it, 'optimization-only and no new workload starts,' I think has ended at this point,\" Microsoft Chief Executive Satya Nadella said on the firm's earnings call. And Google Chief Executive Sundar Pichai told analysts Tuesday that cost optimizations are \"something we have mostly worked through.\" Google said cloud-computing revenue rose 25% to $9.19 billion for the December quarter, topping estimates of $8.94 billion. The Big Tech results this week bode well for smaller industry players, according to Wall Street analysts. \"Azure once again stood out for its strong AI contribution, but positive commentary by both AWS and (Google Cloud Platform) should be viewed as encouraging for the broader ecosystem in our view,\" wrote Barclays analyst Raimo Lenschow in a client note Friday. Cloud-software companies typically design their products to run across the three cloud platforms. They also offer their products on marketplaces run by the cloud providers. \"We believe that the environment for other cloud consumption companies, such as Snowflake, continues to stabilize and Generative AI will potentially accelerate the shift of data and workloads to the cloud as more compelling Gen AI services for the enterprise emerge,\" Evercore ISI analyst Kirk Materne wrote to clients on Friday. Consumption refers to companies that charge based on usage of their software. The commentary for the big cloud providers indicates \"that cloud enterprise spending has effectively turned the corner,\" wrote Stifel analyst Brad Reback. YOU MIGHT ALSO LIKE: Meta Stock Forecast: This Could Be Mark Zuckerberg's Trillion-Dollar Year These Are The Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today AI Stocks: Tech Giants, Cloud Titans, Chipmakers Battle For An Edge Is Amazon Stock A Buy? 3/24/2024\nThe dovish Fed and the Nvidia-led AI boom continue to be the big stock market catalysts. Uber and Eli Llly... 3/24/2024\nThe dovish Fed and the Nvidia-led AI boom continue to... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}