{
    "title": null,
    "date": "2/15/2024",
    "url": "https://indianexpress.com/article/technology/tech-news-technology/google-enables-os-upgrades-for-older-pcs-post-windows-10-support-cutoff-9162462/",
    "text": "Google will allow businesses to install an auto-updating version of the Chrome operating system to Windows devices, potentially preventing millions of PCs from hitting landfills after Microsoft ends support for Windows 10 next year, parent company Alphabet said on Wednesday. The company said ChromeOS Flex will continue receiving regular security updates and features like data encryption, allowing users to keep using their Windows 10 systems. Microsoft has said that its Windows 10 will reach the end of support on Oct. 14 2025, and will no longer provide regular security updates, bug fixes, or technical support. It has asked customers to transition to Windows 11 or explore other options. However, a report from Canalys Research suggests that the termination of Windows 10 support could send about 240 million PCs to landfills, as demand for devices without security updates could be low. Still, many PCs with Windows 10 could remain functional for years after the end of OS support. ChromeOS is significantly less popular than other operating systems. In January 2024, it held a 1.8% share of the worldwide desktop OS market, far behind Windows’ share of about 73%, according to data from research firm Statcounter. ChromeOS has struggled with wider adaptability due to its incompatibility with legacy Windows applications and productivity suites used by businesses. Google said that ChromeOS would allow users to stream legacy Windows and productivity applications, which will help deliver them to devices by running the apps on a data centre.  BJP drops Hindutva poster boy Hegde and gives fresh lease of life to two losing candidates from 2023 Karnataka Assembly polls. Sudhakar, a former minister with deep pockets, gets Chikkaballapur seat. Retains MP Naik for Raichur seat. Jagadish Shettar, who left party in 2023, gets ticket for Belgaum. Party workers question Hegde's absence from politics.    "
}