{
    "title": null,
    "date": "2/6/2024",
    "url": "https://timesofindia.indiatimes.com/gadgets-news/google-microsoft-and-8-other-companies-cut-more-than-1000-jobs-in-the-first-month-of-2024/photostory/107428291.cms",
    "text": "You must login to keep earning daily check-in points  Lifetime Expired Redeemed Total redeemable TimesPoints * TimesPoints expire in 1 year from the day of credit   Refrain from posting comments that are obscene, defamatory or inflammatory, and do not indulge in personal attacks, name calling or inciting hatred against any community. Help us delete comments that do not follow these guidelines by marking them offensive. Let's work together to keep the conversation civil. Now Reading: The year 2024 started on a brutal note for technology tech companies. According to data from layoffs.fyi website, 115 technology companies across the globe cut more than 30,000 jobs in January 2024. The names include some of the biggest technology giants like Microsoft, Google and others. Here are ten companies that reportedly cut more than 1,000 jobs in January 2024. The tech major announced 1000 job cuts on January 10. Google-parent Alphabet’s CEO Sundar Pichai has also warned employees to expect more layoffs in 2024. The tech giant asked 1900 workers to exit the company on January 25. The e-commerce company laid off 1100 employees on January 8 which affected 5% of its staff. The game engine developer sacked 1800 workers on January 8 which impacted 25% of its employees. The cloud computing and software firm cut 1000 jobs on January 10 and trimmed its manpower by 12% This US-based e-commerce platform that deals in home decor ousted 1650 employees on January 19 reducing the company’s workforce by 13% On January 23, the e-commerce company announced 1000 job cuts and reduced its staff by 9%. This Germany-based multinational software company laid off 8,000 employees to cut its human resources short by 7%. Twitter (now X) co-founder Jack Dorsey’s fintech startup axed 1,000 jobs on January 30 that affected 10% of its employees. The fintech company that was once owned by billionaire Elon Musk exited 2500 workers and reduced its staff by 9% Smartwatch not syncing with your phone? Here are 9 things you can do How to improve charging speed on your iPhone: 9 tips to follow Managing your Google Drive storage: 8 essential tips to follow 9 reasons why AppleCare is important for Apple devices 10 common issues you may encounter when using Microsoft Teams Sent money to a wrong UPI ID? 9 key things to do immediately Xiaomi's HyperOS rolled out globally: Eligible devices, features and more Cybersecurity in sports: Protecting data and fans Lost an item or mobile in an Uber? Here’s what to do next 10 tips for recording better video with your smartphone Can Kejriwal pose a challenge to BJP sitting in jail? In the Hindi heartland, farmers are still waiting for ‘acche din’ Reminder alert: Food doesn’t have a religion. It is a religion What’s the excise case that landed Delhi CM in ED net? Copyright © 2024 Bennett, Coleman & Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service "
}