{
    "title": "Microsoft Surpasses Tesla as Top Overseas Stock Gifted by South Korean \nInvestors Amid Tech Sector Surge",
    "date": "2/12/2024",
    "url": "http://koreabizwire.com/microsoft-surpasses-tesla-as-top-overseas-stock-gifted-by-south-korean-investors-amid-tech-sector-surge/272475",
    "text": "Companies like Microsoft and Nvidia are expected to maintain their upward trend due to anticipated improvements in their financial performance. (Image courtesy of Pixabay/MS) SEOUL, Feb. 12 (Korea Bizwire) –Amidst strong performance in the technology sector that has propelled the U.S. stock market to new heights, Microsoft has emerged as the most popular overseas stock gifted by South Korean investors since the beginning of this year. According to an analysis by KB Securities, Microsoft topped the list of most gifted stocks through its overseas stock gifting service from the start of the year until February 6. Tesla, which was the most gifted stock by South Korean investors last year, has been relegated to second place this year, followed by IonQ in third. Apple and Alphabet A rounded out the top five, securing the fourth and fifth spots, respectively. Tesla’s relinquishment of the top spot to Microsoft this year can be attributed to investors’ growing interest in artificial intelligence (AI)-related stocks, including Microsoft, which recently partnered with OpenAI, the developer of ChatGPT. This shift reflects the market’s response to concerns over the electric vehicle sector’s outlook and the notable decline in Tesla’s stock price at the start of the year, contrasted with the rise in Microsoft’s shares. Securities industry insiders note that the choice of stocks to gift is influenced by a favorable perception of the company’s image. Givers tend to prefer stocks on an upward trend, considering the recipient’s feelings, over those that have recently experienced a decline. Since the beginning of the year, Tesla’s stock had fallen by 23.7% as of February 8, whereas Microsoft saw a 10.1% increase over the same period. Experts anticipate Tesla’s stock price may continue to face challenges, with concerns over a potential slowdown in the electric vehicle and battery markets if an administration unfriendly to the electric vehicle industry emerges from the U.S. election. On the other hand, companies like Microsoft and Nvidia are expected to maintain their upward trend due to anticipated improvements in their financial performance. The “Stock Gifting Service” allows investors to gift stocks through a brokerage’s Home Trading System (HTS) or Mobile Trading System (MTS). With KB Securities’ overseas stock gifting service, for example, investors can select a foreign stock they own, enter the recipient’s name and mobile number, and easily gift it through the MTS “Stock Gifting” menu. This photo provided by Tesla Inc, shows the carmaker’s service center in western Seoul. Kevin Lee (kevinlee@koreabizwire.com) Your email address will not be published. Required fields are marked * Name * Email * Website Comment You may use these HTML tags and attributes:   Currently you have JavaScript disabled. In order to post comments, please make sure JavaScript and Cookies are enabled, and reload the page. Click here for instructions on how to enable JavaScript in your browser. The Korea Bizwire is committed to reporting on \"uniquely Korean\" stories for our readers. But we also provide enhanced coverage of useful news from all over the world if we find them of interest or relevance to our global audience. Kobiz Media, the parent company of this site, offers highly competent press release distribution and localization services aimed at South Korea -- an increasingly important and attractive market for global businesses who want to have an upper hand in the Asia Pacific region since Korea serves as a stepping-stone for forward-looking brands’ future success in these lucrative markets. We wish you all good luck for extraordinary success in your businesses and life. Username: Password: Lost your password? Username: Email: Password: Re-enter:  Please enter your username or e-mail address. You will receive a new password via e-mail. Username/Email:  "
}