{
    "title": "It is analyzed that Microsoft (MS) is chasing Amazon Web Services (AWS) at \na fast pace with artifici.. - MK",
    "date": "2/13/2024",
    "url": "https://www.mk.co.kr/en/it/10941330",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share It is analyzed that Microsoft (MS) is chasing Amazon Web Services (AWS) at a fast pace with artificial intelligence (AI). According to Synergy Research Group, Amazon ranks first in the global cloud services market with 32 percent. This is followed by MS Azure at 23% and Google Cloud at 10%. Amazon accounts for 65% of the total market, followed by the remaining 20 companies. CNBC said on the 12th (local time), \"Amazon Web Services is still a leader in the cloud market,\" but diagnosed, \"Microsoft is rapidly narrowing the gap.\" Analysts in the IT industry reported that just five years ago, Microsoft was one-fifth the size of AWS in terms of revenue, but has now narrowed it to three-quarters. Amy Hood, MS's chief financial officer, said in an earnings release on January 30 that \"AI's share of revenue growth in Azure and cloud services increased by 6 percentage points in the previous quarter,\" adding, \"This is a significant increase compared to the previous quarter's 3 percentage points.\" MS Azure's gross revenue growth rate reached 30%. MS is actively providing customers with AI incentives that can provide services such as recognition with a learned model. A large number of GPUs are also being secured so that customers can run AI models through Azure. In particular, OpenAI GPT-4 is also powered by Azure. In addition, numerous global companies are building similar Generative AI services through Azure. Earlier, MS Chairman Satya Nadella stressed, \"We now have 53,000 Azure AI customers.\" In response, Jimin Ball, a partner at Altimeter Capital, explained, \"A significant number of companies perceive MS and OpenAI as a close relationship.\" It is explained that it is seeing an open AI effect. Cloud accounts for 29% of Microsoft's total revenue. The Intelligent Cloud segment generated 46% of Microsoft's overall operating profit. This is a significant increase from about 27% in 2016. Microsoft's cloud group's gross margin expanded to 72% in the latest quarter from 42% in 2016. The segment includes commercial office subscriptions, LinkedIn's commercial arm, and Dynamics 365 enterprise software as well as Azure. Yoon Kim, an analyst at Loop Capital, noted in a note that Acer's earnings growth could accelerate. \"With new cloud deployments and a meaningful increase in new workloads in Generative AI initiatives, we expect Azure business to accelerate from the next fiscal year or the second half,\" he said. AWS has come up with a variety of models to prevent the offensive. In particular, Amazon has invested in Nsropics, which is called the OpenAI Opponent. Amazon Chief Executive Officer Andy Jesse emphasized in the last conference call that \"AWS is using Nvidia chips to provide the widest range of computational instances.\" He also added that customers, including Airbnb and Snap, are using Amazon's own AI processors. 2024-03-24 14:09:45 2024-03-24 17:27:00 2024-03-24 09:46:12 2024-03-24 06:18:24 2024-03-24 15:26:58 2024-03-24 07:29:38 2024-03-19 17:09:10 2024-03-24 18:04:01 2024-03-24 17:13:22 2024-03-23 21:16:20 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}