{
    "title": "From Hyderabad to Redmond: Satya Nadella completes ten years as Microsoft \nCEO",
    "date": "2/7/2024",
    "url": "https://www.businesstoday.in/technology/news/story/from-hyderabad-to-redmond-satya-nadella-completes-ten-years-as-microsoft-ceo-416529-2024-02-07",
    "text": "Feedback Microsoft's CEO, Satya Nadella, is celebrating his 10-year anniversary at the helm of the company. The Hyderabad-born leader, also known for his love for cricket, has led Microsoft to new heights making it the most valued    company in the world. Nadella took over as CEO in 2014, and under his leadership, Microsoft has seen its fair share of ups and downs. Nadella’s India Connection Born and raised in Hyderabad, India, Nadella's Indian roots have played a significant role in shaping his worldview. He often credits his upbringing in India for instilling in him the values of hard work, perseverance, and the importance of education. His primary education was at the Hyderabad Public School, Begumpet.\nAfter completing his primary education, he moved to Manipal Institute of Technology, Karnataka. There, he pursued a Bachelor’s degree in Electrical Engineering and graduated in 1988. Nadella joined Microsoft in 1992, initially working on the development of Windows NT. He steadily rose through the ranks, leading major projects related to cloud computing. By 1999, he was named vice president of the Microsoft bCentral small-business service, and two years later, he became the corporate vice president of Microsoft Business Solutions. In 2014, he took over as CEO, becoming the third person to hold the office in the company’s history. Microsoft’s Growth Under Nadella Under Nadella’s leadership, Microsoft’s market cap has grown from approximately $314 billion to over $3 trillion. This growth has been driven in no small part by its cloud offering, Azure. While Azure got underway under Nadella’s predecessor, Steve Ballmer, it has been under Nadella’s tenure that the cloud platform has cemented itself as one of the dominant options for enterprise. When it comes to share price, Microsoft's stock increased by more than 1,000 per cent since the Indian-origin CEO took the helm in 2014. In comparison, the S&P 500 index in the US has only shown a 185 per cent growth in the same period. AI: The next frontier? Microsoft’s ambitious developments in the field of AI can help it balloon forward in the coming years. The company has introduced AI tools for enterprise and individual users using multiple LLMs including OpenAI’s ChatGPT and Dall-E. During a keynote delivered in India, Nadella highlighted the importance of AI in the country’s economy. He projected that AI could contribute up to $500 billion if India realises its dream of achieving a 3 trillion GDP by 2025. During the event, he also announced a new initiative where the company will skill over 2 million Indians in AI. Also read: India’s $500 billion AI GDP by 2025: Microsoft CEO Satya Nadella highlights potential of AI in economic growth Also read: Microsoft to equip over 2 million people in India with AI skills: Satya Nadella Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}