{
    "title": "Microsoft Co. (NASDAQ:MSFT) is Cornerstone Wealth Management LLC's 7th \nLargest Position",
    "date": "3/1/2024",
    "url": "https://www.americanbankingnews.com/2024/03/01/microsoft-co-nasdaqmsft-is-cornerstone-wealth-management-llcs-7th-largest-position.html",
    "text": "Posted by ABMN Staff on Mar 1st, 2024 Cornerstone Wealth Management LLC raised its holdings in Microsoft Co. (NASDAQ:MSFT – Free Report) by 3.4% during the third quarter, according to its most recent filing with the Securities and Exchange Commission. The institutional investor owned 61,271 shares of the software giant’s stock after purchasing an additional 2,003 shares during the quarter. Microsoft accounts for about 1.8% of Cornerstone Wealth Management LLC’s holdings, making the stock its 7th biggest position. Cornerstone Wealth Management LLC’s holdings in Microsoft were worth $19,349,000 at the end of the most recent quarter. Other hedge funds and other institutional investors also recently modified their holdings of the company. Adero Partners LLC raised its holdings in Microsoft by 2.7% in the 2nd quarter. Adero Partners LLC now owns 16,815 shares of the software giant’s stock valued at $5,726,000 after acquiring an additional 435 shares during the last quarter. Cadian Capital Management LP boosted its position in Microsoft by 15.1% during the 2nd quarter. Cadian Capital Management LP now owns 107,000 shares of the software giant’s stock worth $36,438,000 after purchasing an additional 14,000 shares during the period. Trivant Custom Portfolio Group LLC boosted its position in Microsoft by 1.2% during the 2nd quarter. Trivant Custom Portfolio Group LLC now owns 19,877 shares of the software giant’s stock worth $6,769,000 after purchasing an additional 229 shares during the period. C M Bidwell & Associates Ltd. boosted its position in Microsoft by 5.2% during the 2nd quarter. C M Bidwell & Associates Ltd. now owns 5,075 shares of the software giant’s stock worth $1,728,000 after purchasing an additional 253 shares during the period. Finally, Geneos Wealth Management Inc. boosted its position in Microsoft by 4.1% in the 3rd quarter. Geneos Wealth Management Inc. now owns 82,267 shares of the software giant’s stock valued at $25,976,000 after buying an additional 3,209 shares during the last quarter. 69.20% of the stock is currently owned by institutional investors and hedge funds. Shares of NASDAQ MSFT opened at $413.64 on Friday. Microsoft Co. has a 1-year low of $245.61 and a 1-year high of $420.82. The company has a 50-day moving average of $395.52 and a two-hundred day moving average of $361.63. The company has a current ratio of 1.22, a quick ratio of 1.20 and a debt-to-equity ratio of 0.19. The company has a market cap of $3.07 trillion, a PE ratio of 37.40, a P/E/G ratio of 2.17 and a beta of 0.90. Microsoft (NASDAQ:MSFT – Get Free Report) last issued its quarterly earnings results on Tuesday, January 30th. The software giant reported $2.93 EPS for the quarter, topping the consensus estimate of $2.76 by $0.17. The company had revenue of $62.02 billion during the quarter, compared to analysts’ expectations of $61.14 billion. Microsoft had a net margin of 36.27% and a return on equity of 38.40%. Microsoft’s revenue was up 17.6% on a year-over-year basis. During the same quarter in the previous year, the company earned $2.32 EPS. As a group, equities analysts expect that Microsoft Co. will post 11.63 earnings per share for the current fiscal year. In other Microsoft news, EVP Kathleen T. Hogan sold 24,681 shares of the company’s stock in a transaction that occurred on Friday, December 8th. The shares were sold at an average price of $369.00, for a total value of $9,107,289.00. Following the completion of the sale, the executive vice president now owns 183,761 shares of the company’s stock, valued at $67,807,809. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through the SEC website. In other Microsoft news, EVP Kathleen T. Hogan sold 24,681 shares of the company’s stock in a transaction that occurred on Friday, December 8th. The shares were sold at an average price of $369.00, for a total value of $9,107,289.00. Following the completion of the sale, the executive vice president now owns 183,761 shares of the company’s stock, valued at $67,807,809. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, major shareholder Corp Microsoft sold 1,000,000 shares of the company’s stock in a transaction that occurred on Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the sale, the insider now directly owns 11,677,398 shares of the company’s stock, valued at approximately $22,770,926.10. The disclosure for this sale can be found here. Over the last 90 days, insiders sold 1,072,984 shares of company stock valued at $30,928,803. Corporate insiders own 0.03% of the company’s stock. MSFT has been the topic of a number of recent analyst reports. Argus upped their target price on shares of Microsoft from $390.00 to $430.00 and gave the company a “buy” rating in a research note on Tuesday, December 5th. BMO Capital Markets raised their price target on shares of Microsoft from $420.00 to $455.00 and gave the company an “outperform” rating in a research note on Wednesday, January 31st. Wells Fargo & Company increased their price objective on shares of Microsoft from $435.00 to $460.00 and gave the company an “overweight” rating in a report on Wednesday, January 31st. Evercore ISI reiterated an “outperform” rating and issued a $432.00 price objective on shares of Microsoft in a report on Monday, November 20th. Finally, Tigress Financial raised their target price on shares of Microsoft from $433.00 to $475.00 and gave the stock a “buy” rating in a report on Wednesday, November 29th. Four analysts have rated the stock with a hold rating and thirty-six have assigned a buy rating to the company. Based on data from MarketBeat.com, the company has a consensus rating of “Moderate Buy” and an average target price of $411.06. Check Out Our Latest Stock Report on MSFT (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.    Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. FutureFuel (NYSE:FF) Rating Increased to Buy at StockNews.com Apple Inc. (NASDAQ:AAPL) Shares Sold by Forefront Wealth Management Inc. "
}