{
    "title": "Microsoft warns businesses as Russian-backed hackers broke into its system",
    "date": "1/12/2024",
    "url": "https://nairametrics.com/2024/01/21/microsoft-warns-businesses-as-russian-backed-hackers-broke-into-its-system/",
    "text": "Software giant, Microsoft, has reported a breach on its system by Russian government-backed hackers known as Midnight Blizzard, with a warning that all organizations now face risks from well-resourced nation-state threat actors. The company disclosed this in a filing with the U.S. Securities and Exchange Commission on Friday. Microsoft disclosed that the hackers gained access to some of its corporate email accounts, including members of its senior leadership team and employees in its cybersecurity, legal, and other functions. It said the attackers were able to exfiltrate some emails and attached documents from its system. According to Microsoft, the hackers who gained access to its system from late November 2023 until they were discovered on January 12, 2024, were targeting information relating to them on Microsoft’s system. Providing the details of the attack in the SEC filing, Microsoft said: Microsoft added that its investigation indicates the attackers were initially targeting email accounts for information related to Midnight Blizzard itself. The company said it was in the process of notifying employees whose email was accessed. The company, however, noted that the attack was not the result of a vulnerability in its products or services as customers were not affected. According to Microsoft, to date, there is no evidence that the threat actor had any access to customer environments, production systems, source code, or AI systems. Microsoft said it would notify its customers if any action is required. Microsoft said this would likely cause some level of disruption while it adapts to this new reality, but it is a necessary step, and only the first of several we would be taking to embrace this philosophy.   Samson Akintaro is a tech enthusiast and has over a decade experience covering and writing about the tech industry. He is currently the Tech Analyst at Nairametrics. Software giants like Microsoft should really increase their focus on the security of their systems, otherwise business can seek alternatives if these kind of hacking thing persists on. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.   Δ       Business News | Stock Market | Money Market | Cryptos | Financial Literacy | SME | Follow us on social media: © 2024 Nairametrics Login to your account below   Remember Me  Fill the forms below to register    Please enter your username or email address to reset your password.   © 2024 Nairametrics "
}