{
    "title": "Here is What to Know Beyond Why Microsoft Corporation (MSFT) is a Trending \nStock",
    "date": "1/8/2024",
    "url": "https://www.zacks.com/stock/news/2206874/here-is-what-to-know-beyond-why-microsoft-corporation-msft-is-a-trending-stock",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Zacks Equity Research\n                    January 08, 2024 MSFT Quick QuoteMSFT Better trading starts here. You follow Tale of the Tape - edit You follow Zacks Equity Research - edit Zacks Equity Research Tale of the Tape Microsoft (MSFT Quick QuoteMSFT  -  Free Report)     is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock. Shares of this software maker have returned -1.7% over the past month versus the Zacks S&P 500 composite's +2.9% change. The Zacks Computer - Software industry, to which Microsoft belongs, has lost 2.2% over this period. Now the key question is: Where could the stock be headed in the near term? Although media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision. Earnings Estimate Revisions Here at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock. We essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements. For the current quarter, Microsoft is expected to post earnings of $2.75 per share, indicating a change of +18.5% from the year-ago quarter. The Zacks Consensus Estimate has changed +0.2% over the last 30 days. The consensus earnings estimate of $11.14 for the current fiscal year indicates a year-over-year change of +13.6%. This estimate has changed +0.1% over the last 30 days. For the next fiscal year, the consensus earnings estimate of $12.70 indicates a change of +14% from what Microsoft is expected to report a year ago. Over the past month, the estimate has remained unchanged. With an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for Microsoft. The chart below shows the evolution of the company's forward 12-month consensus EPS estimate: 12 Month EPS Revenue Growth Forecast While earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth. For Microsoft, the consensus sales estimate for the current quarter of $61.03 billion indicates a year-over-year change of +15.7%. For the current and next fiscal years, $242.41 billion and $275.28 billion estimates indicate +16.8% and +13.6% changes, respectively. Last Reported Results and Surprise History Microsoft reported revenues of $56.52 billion in the last reported quarter, representing a year-over-year change of +12.8%. EPS of $2.99 for the same period compares with $2.35 a year ago. Compared to the Zacks Consensus Estimate of $54.4 billion, the reported revenues represent a surprise of +3.9%. The EPS surprise was +12.83%. The company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates three times over this period. Valuation No investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance. Comparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is. The Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued. Microsoft is graded D on this front, indicating that it is trading at a premium to its peers. Click here  to see the values of some of the valuation metrics that have driven this grade. Conclusion The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Microsoft. However, its Zacks Rank #2 does suggest that it may outperform the broader market in the near term. Microsoft Corporation (MSFT) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy   |   No cost, no obligation to buy anything ever. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.18%  per year. These returns cover a period from January 1, 1988 through January 1, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}