{
    "title": "Microsoft launches AI Odyssey to empower 100,000 developers in India",
    "date": "1/9/2024",
    "url": "https://www.wionews.com/business-economy/microsoft-launches-ai-odyssey-to-empower-100000-developers-in-india-678238",
    "text": "The initiative offers an immersive learning experience designed to enable developers to gain and showcase the essential skills required for executing pivotal projects utilising AI technologies aligned with business objectives.  Microsoft on Monday unveiled AI Odyssey, a transformative initiative with a mission to equip 100,000 developers in India with the latest AI technologies and tools. The initiative offers an immersive learning experience designed to enable developers to gain and showcase the essential skills required for executing pivotal projects utilising AI technologies aligned with business objectives. As AI continues to reshape the work landscape, Microsoft aims to foster a skilled workforce capable of leveraging AI to address intricate challenges and drive value. AI Odyssey provides a platform for developers to contribute to India's growth by crafting solutions and demonstrating their prowess in solving real-world issues. To participate, developers can register on aka.ms/AIOdyssey, accessing learning modules and resources. This month-long program, open to all AI enthusiasts in India, irrespective of their background or experience level, comprises two levels that participants must complete by January 31, 2024. The first level guides participants in utilising Azure AI services to develop and deploy solutions for diverse scenarios, providing access to valuable resources, code samples, and guides to master practical AI skills. Irina Ghose, Managing Director, Microsoft India, said, “AI is the future of innovation, and India is leading the way with its tech talent. The Microsoft Applied Skills credential will help developers demonstrate their competence and creativity in the most in-demand AI skills and scenarios. We welcome all developers to join us in creating meaningful AI solutions that will contribute to India’s economy.” The second level of AI Odyssey challenges participants to validate their AI skills through an online assessment featuring interactive lab tasks, earning them the Microsoft Applied Skills credentials—a verifiable credential attesting to their ability to address real-world problems using AI. Successful participants in both levels also have the chance to win a VIP Pass for the Microsoft AI Tour scheduled in Bangalore on February 8, 2024. WATCH WION LIVE HERE  "
}