{
    "title": "Microsoft Surpasses Apple as Largest Company by Market Cap",
    "date": "1/11/2024",
    "url": "https://watcher.guru/news/microsoft-surpasses-apple-as-largest-company-by-market-cap",
    "text": "In a significant development for the overall business landscape, Microsoft has officially surpassed Apple as the largest company by Market Cap. Indeed, Reuters reported that the iPhone developer was passed up as the most valuable company on the planet for the first time since 2021. The brand notoriety and popularity of both companies cannot be overstated. However, the flip was expected by many considering the growth rate of Microsoft. Additionally, its strides in the world of generative artificial intelligence amid an AI revolution poised the Redmond Washington Tech company to take the world’s top spot. JUST IN: Microsoft $MSFT surpasses Apple $AAPL becoming the largest company in the world by market cap. Also Read: Microsoft Seeks Nuclear Expert to Fuel AI Energy Strategy Within the modern tech landscape, there is no denying the undeniable power of both Microsoft and Apple. For several decades, these companies have been a the forefront of consumer technology. Subsequently, their competition has continued with a rather interesting wrinkle occurring today. On the heels of their continued jockeying for superiority, Microsoft has surpassed Apple as the largest company in the world by market cap. Indeed, Apple had long held the top spot, but many had predicted a flip to take place. Especially considering the growth trajectory and accomplishments of this past year. Also Read: Apple Removes Wallet of Satoshi as Bitcoin Lightning Payments Surge “It was inevitable that Mircost would overtake Apple,” D.A. Davidson analyst Gil Luria told Tuerts. “Microsoft is growing faster and has more to benefit from the generative AI revolution.” Indeed, Luria noted the ongoing collaboration between OpenAI and Microsoft. The relationship led Microsoft to win big from the meteoric rise in popularity of AI chatbot ChatGPT. Apple’s decline was primarily connected to concerns over iPhone sales, which had continued to be weak. Specifically, it was hindered by a lack of sales in China, which is a major market for the company. Over the last year, Apple saw an increase in market cap of 48%. However, that wasn’t able to match the 57% increase that Microsoft obtained in that same time frame. Disclaimer: Our articles are NOT financial advice, we are not financial advisors. All investments are your own decisions. Please conduct your own research and seek advice from a licensed financial advisor. "
}