{
    "title": "Google Stock Is Holding Up In A Rocky Market. Here's Why.",
    "date": "1/4/2024",
    "url": "https://www.investors.com/research/google-stock-is-holding-up-in-a-rocky-market-heres-why/",
    "text": "BREAKING: Futures Mixed Google-parent Alphabet (GOOGL) is one of the few major tech stocks that has sidestepped the sector's sell-off in the new year. That is one reason why Google stock is Thursday's selection for IBD 50 Stocks To Watch. Google is among the so-called \"Magnificent Seven\" stocks and boasts a gain of 58% in 2023 despite an earnings breakdown in October. IBD MarketSmith shows the company's shares are near a buy point of 139.42 in a cup with handle. It's primarily due to two reasons. In December, shares rose as the search giant stepped up its efforts to integrate artificial intelligence and automation in its digital ads business. Also in December, parent company Alphabet launched its newest and most advanced artificial intelligence product, Gemini. The program is trained to understand text, image and audio. Sales growth for Google over the past seven quarters has ranged between 1% and 23%. The company started posting earnings growth again in the two most recent quarters after a series of declines. In the third quarter ended Sept. 30, sales grew 11% to $76.7 billion while earnings per share of $1.56 jumped 42%. Revenue from both Google Services and Google Cloud contributed most to the sales growth. Google Services includes Search, Google Play, Google Ads, YouTube and other products and services. Google Cloud provides software and collaboration tools for businesses. But there was one caveat that accompanied the results: cloud computing revenue came in at $8.41 billion and missed views of $8.64 billion. That prompted Google stock to gap down, as investors feared the company was losing market share to tech titans Microsoft (MSFT) and Amazon (AMZN) in cloud services. The stock since has climbed back and formed its current base, with the support of sound technical ratings. Investor's Business Daily gives Google stock a Composite Rating of 96 while its EPS Rating is 97 out of a best-possible 99. Google's Relative Strength Rating at 85 is up sharply from 21 a year ago. And GOOGL stock ranks third in IBD's Internet Content group. Mutual funds own 42% of outstanding shares of the company, and more funds have come in as net buyers of the stock over the past seven quarters. The MFS Growth Fund (MFEGX) and the AllSpring Growth Fund (SGRAX) are among those holding shares of GOOGL. Among exchange traded funds, the iShares Global Communications Services ETF (IXP) and State Street's Communication Services Select Sector SPDR Fund (XLC) hold shares of Google stock. Please follow VRamakrishnan on X/Twitter for more news on the stock market today. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders MarketSmith: Research, Charts, Data And Coaching All In One Place How To Research Growth Stocks: Why This IBD Tool Simplifies The Search For Top Stocks 3/22/2024\nWhat are the Magnificent Seven stocks? How much market cap weighting do AAPL, MSFT, GOOGL, AMZN, META, TSLA and NVDA... 3/22/2024\nWhat are the Magnificent Seven stocks? How much market cap... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}