{
    "title": "Microsoft & Google's Cloud Revenue Boosted By Generative AI",
    "date": "2/2/2024",
    "url": "https://techreport.com/news/microsoft-googles-cloud-revenue-significantly-boosted-by-generative-ai/",
    "text": " Although both Microsoft and Google had faced temporary dips in cloud revenue, the reports for the last quarter show a massive rise in profits, all thanks to generative AI. The two tech giants made their revenue reports for the December quarter of 2023 public on Tuesday and the numbers look very promising. Lee Sustar, the principal analyst at Forrester said that the last quarter’s profits not only helped Google make up for all the losses in the previous quarters but the revenue from Google Cloud now accounts for 10% of the total revenue generated by Alphabet— Google’s parent company. Google Cloud reported a total revenue of $9.19 billion for the last quarter which is 28% more than the previous quarter. For the same quarter, Alphabet reported a total revenue of $86 billion. Microsoft too has reported similar numbers. Its cloud tools (Azure and other SaaS products) together generated a total revenue of $33 billion which is 24% (22% in constant currency) more than the previous quarter. Seeing how AI has benefited the company in the last quarter, Google has smartly decided to pair its Bard chatbot with the new Gemini Pro model. If you didn’t know, Gemini is the first model to outperform human experts in MMLU (Massive Multitask Language Understanding). As of now, the product is expected to support more than 40 Global languages which include Japanese, Arabic, Chinese, Dutch, French, and so on. On top of that, Google is also planning to add image generation support which will allow users to create images through texts typed in the chat. Right now the feature will only be available for English speakers. AI has drastically increased Google’s user base. CEO Sundar Pichai said that while cost optimization strategies were helping them stay afloat during the macroeconomic headwinds, it’s providing better AI services that helped them bring in new customers. Microsoft on the other hand managed to revive its struggling cloud services by offering an array of AI features. Integration with OpenAI and ChatGPT was a huge step towards this success. Many other services such as Microsoft 365 and Azure also went through a makeover with Copilot—an AI-based chatbot. The last year saw rapid advancement with AI. The collaboration of Microsoft and OpenAI was a huge trigger that left all other competing tech companies to launch their own chatbots. Now that the financial reports of both Google and Microsoft are out, it would be interesting to see whether Amazon’s AWS platform (that launched its own AI model to compete with Microsoft) made similar profits. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Krishi is an eager Tech Journalist and content writer for both B2B and B2C, with a focus on making the process of purchasing software easier for businesses and enhancing their online presence and SEO. Krishi has a special skill set in writing about technology news, creating educational content on customer relationship management (CRM) software, and recommending project management tools that can help small businesses increase their revenue. Alongside his writing and blogging work, Krishi's other hobbies include studying the financial markets and cricket. The United Nations General Assembly approved the first-ever global resolution on artificial intelligence on Thursday. The resolution recognizes the danger of improper development and use of AI and encourages nations... After a very exciting period when Bitcoin, Ethereum, Dogecoin, Shiba Inu, and many other cryptos went through a price increase, it seems that now is calm before the storm. All... REGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website. Crypto promotions on this site do not comply with the UK Financial Promotions Regime and is not intended for UK consumers. © Copyright 2024 Techreport. All Rights Reserved. "
}