{
    "title": "Riding the AI Wave: Is Microsoft Unstoppable in 2024?",
    "date": "2/5/2024",
    "url": "https://investorplace.com/2024/02/riding-the-ai-wave-is-microsoft-unstoppable-in-2024/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. Microsoft is the world's most valuable company again for a reason, and should stay there for a while Advertisement Source: gguy / Shutterstock.com Microsoft (NASDAQ:MSFT) is number one again, thanks to the artificial intelligence (AI) boom. It passed Apple (NASDAQ:AAPL) in January and is now worth over $3 trillion. Since the launch of ChatGPT in November 2022, MSFT stock is up over 55%. That’s a gain of over $1.5 trillion in market cap. Microsoft’s valuation crossed $1 trillion less than five years ago. However, even with its post-earnings fall on January 30, MSFT stock is far from cheap. You’re paying nearly 36 times the company’s $11.06/share of earnings at its current price. The yield on its $3/share annual dividend is down to 0.75%. Small wonder traders took some profits. What should investors do? The post-earnings fall from a high of $411 was overdue. I’m a big-tech investor, but valuations made me antsy. My recent piece on Advanced Micro Devices (NASDAQ:AMD) reflects it. That stock kept climbing after my story and is now only slightly higher than it was when I sold it. My personal view on MSFT stock is that you own it; don’t trade it. I have always reinvested Microsoft dividends, letting them compound, giving me 63 shares of “free” stock for every 100 I own by my last count. I expect Microsoft stock to have rough days in February as traders pick apart the most recent earnings. Consumer revenue growth is slowing to below 10%, while cloud services are up 21% and Office365 15%. Is that sustainable? Microsoft has aggressively monetized AI on a gross level, charging $30 per user for its Office Co-Pilot. If you bought a consumer version of Office at roughly $100/year, that’s now $460! How many of the 78.4 million consumer Office customers will buy Co-Pilot? More important, what value will we get from it? These questions will drive analysts’ view of the whole industry. The AI complex will catch a cold the next time Microsoft sniffles. 2024 will be a year of heavy marketing at Microsoft, which now has 221,000 employees, up 50% since I bought my shares in 2018. (The stock is up 800%.) The company has moved from gross deals like one with (womp womp!) Amazon (NASDAQ:AMZN) to industry-specific offerings sold through case studies on early customers. It’s the kind of beneath-the-radar selling International Business Machines (NYSE:IBM) did in the 20th century, when it was the business computing leader. The fate of IBM, now worth 2% of Microsoft with about one-quarter of its sales, should keep Microsoft people paranoid. Microsoft doesn’t have nearly the pre-eminence “Big Blue” did when I started covering technology 40 years ago. What was a monopoly then is an oligopoly now, engaged in “coopetition.” Microsoft is ready to cooperate with Apple on its Vision Pro and sell Co-Pilot seats to Amazon while slurping data from Alphabet’s (NASDAQ:GOOG, NASDAQ:GOOGL) Chrome. This is an era of Cloud “Czars,” not a single Cloud Czar. It’s a world where consumers, businesses, and governments are just starting to get their arms around. It’s the reason the U.S. economy is as dominant as it has ever been. How long can the good times roll? Nothing grows straight up. The post-earnings fall of Microsoft and the other winners of the Cloud Wars was welcome, given stretched valuations. I expect some follow-through over the next few months. The Federal Reserve will continue to disappoint. The globe will continue to simmer with war. Political uncertainty will rise through the end of the year. There will be many predictions of imminent doom. Watch Microsoft carefully and accumulate it on weakness. As of this writing, Dana Blankenhorn has had LONG positions in AMZN, GOOGL, MSFT, and AAPL. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Dana Blankenhorn has been a financial and technology journalist since 1978. He is the author of Technology’s Big Bang: Yesterday, Today and Tomorrow with Moore’s Law, available at the Amazon Kindle store. Tweet him at @danablankenhorn, connect with him on  Mastodon or subscribe to his Substack. Artificial Intelligence, Cloud, Technology Blue-Chip Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/riding-the-ai-wave-is-microsoft-unstoppable-in-2024/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Crypto & Blockchain Market Analysis Stocks to Sell Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}