{
    "title": "Tech Stocks Ease On Hot PPI, Yields Rise, Microsoft, Amazon Snap 5-Week \nPositive Streak: What's Driving Markets ...",
    "date": "2/16/2024",
    "url": "https://markets.businessinsider.com/news/stocks/tech-stocks-ease-on-hot-ppi-yields-rise-microsoft-amazon-snap-5-week-positive-streak-what-s-driving-markets-friday-1033077263",
    "text": "Wall Street paused for a breather Friday following a stronger-than-anticipated producer inflation report that once again caught investors off guard, echoing the heat of a similarly strong consumer inflation report earlier in the week. The Producer Price Index (PPI) for January 2024 saw a 0.3% month-over-month increase, surpassing the projected 0.1% surge, while the Consumer Price Index (CPI) surged by 3.1% year-on-year, exceeding the forecasted 2.9%, highlighting the ongoing intensity of the inflation battle. “The January inflation data vindicates the Fed’s wait-and-see approach,” Bank of America economist Stephen Juneau said in a note. As a result, traders trimmed their expectations for Fed rate cuts, delaying the anticipated start to this summer. Yields surged higher, with the policy-sensitive two-year note yield climbing by over 10 basis points to reach 4.67%. As of noon trading in New York, the S&P 500 showed minimal change for the day, while the tech-heavy Nasdaq 100 lagged behind, potentially ending a five-week winning streak. A similar trend was observed with both Microsoft Corp. (NYSE:MSFT) and Amazon.com Inc. (NASDAQ:AMZN)  The SPDR S&P 500 ETF Trust (NYSE:SPY) was 0.2% lower to $500.96, the SPDR Dow Jones Industrial Average (NYSE:DIA) fell 0.3% to $386.90 and the tech-heavy Invesco QQQ Trust (NASDAQ:QQQ) fell 0.5% to $432.16, according to Benzinga Pro data. The Consumer Staples Select Sector SPDR Fund (NYSE:XLP), outperformed, up 0.5%, while the Communication Services Select Sector SPDR Fund (NYSE:XLC) was the laggard, down 1.4%. Read now: Roku Stock Down 22% Despite ‘Almost Perfect Quarter’: Analyst Expects Stock To Be ‘Range-Bound Until Platform Growth Returns’ Illustration created using artificial intelligence via MidJourney. Indices Commodities Currencies Stocks "
}