{
    "title": "Elon Musk calls on Microsoft CEO for laptop issues",
    "date": "2/27/2024",
    "url": "https://www.businessinsider.com/elon-musk-calls-out-microsoft-ceo-laptop-issues-2024-2",
    "text": "       You're not the only one who hits up your computer-savvy friend when you're having tech issues — billionaires do it too, apparently. Tesla CEO Elon Musk was setting up a new laptop when he went on X and complained that it required him to create a Microsoft account, which he claimed would be \"giving their AI access\" to his computer. \"There used to be an option to skip signing into or creating a Microsoft account,\" Musk's post said. Related stories The site's Community Notes feature said Musk had got it wrong. The note said there's a way to skip creating a Microsoft account, albeit more difficult to do than it used to be. But Musk doubled down. \"Community Notes is failing here. This option no longer exists,\" he said in a follow-up post. A popular Community Notes contributor replied and said he was wrong again. Thanks to his followers' instructions, Musk was able to get around creating an account by disconnecting his WiFi. But Musk picked up the issue again on Monday when he reached out to Microsoft CEO Satya Nadella. Satya, I don’t mean to be a pest, but please allow people setting up a new Windows PC to skip creating a Microsoft account. This option disappears if the computer is connected to WiFi. Also, even if you do want to sign up, it won’t allow you use a work email address and I… \"Satya, I don't mean to be a pest, but please allow people setting up a new Windows PC to skip creating a Microsoft account,\" Musk wrote. \"Also, even if you do want to sign up, it won't allow you use a work email address.\" He added that he had only work email addresses. In the past, Musk criticized Microsoft's partnership with OpenAI. Nadella has rejected the billionaire's claims that Microsoft controlled OpenAI, ChatGPT's creator. Still no word from Nadella about whether he's taking Musk's suggestion to heart. Read next Jump to "
}