{
    "title": "Microsoft seeks to shine light on AI's transformative power with Super Bowl \nad",
    "date": "2/9/2024",
    "url": "https://coingeek.com/microsoft-seeks-to-shine-light-on-ai-transformative-power-with-super-bowl-ad/",
    "text": " Home » Business » Microsoft seeks to shine light on AI’s transformative power with Super Bowl ad Business   9 February 2024 As the Super Bowl approaches and excitement around it builds, Microsoft (NASDAQ: MSFT) has announced that it will have a Super Bowl commercial for the first time in four years, and this time, it will be dedicated to artificial intelligence (AI). Excited for all that people will achieve with this next generation of AI, as we bring the power of Copilot to anyone, anywhere, on any device. https://t.co/FU9bDmw5gN — Satya Nadella (@satyanadella) February 7, 2024  Microsoft is choosing to use its ad space to shine a light on the transformative power of AI, particularly through Copilot, Microsoft’s generative AI assistant that integrates into everyday workflows. The core message of the advertisement is that AI is a transformative technology that allows its users to bring ideas to life and acquire new skills faster and more efficiently than ever before. width=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"> The decision to spotlight Copilot during the Super Bowl could signal a broader trend that we will see in Super Bowl advertisements this year, especially from tech companies. Just as blockchain and digital currency commercials flooded the Super Bowl when non-fungible tokens (NFTs) were reaching their peak, we’re likely to see a wave of AI commercials during the Super Bowl, showcasing each company’s latest AI advancements and innovations. Microsoft premieres AI product In their announcement of their upcoming Super Bowl commercial, Microsoft also alluded to the idea that the AI initiatives and integration that it planned around its search product “Bing” would be sunsetted in favor of making Copilot Microsoft’s “singular experience for people looking to get more out of AI creation, we are today introducing further image creation capabilities.” Microsoft initially focused on integrating AI into Bing with the vision of transforming users’ search experience by understanding and anticipating user queries, allowing the delivery of more relevant search results. Additionally, by infusing Bing with AI, the tech giant aimed to increase the number of users of its product and enhance engagement. However, Bing remained unpopular as a search engine, with Google (NASDAQ: GOOGL) taking the lion’s share of the search engine market with 91% dominance. After recognizing the minimal impact of the AI-infused Bing approach, the Microsoft team pivoted to Copilot, a more personalized and creative AI experience that integrates into a user’s everyday workflow. Copilot: The AI assistant that enhances workflow Copilot is an AI assistant that users can summon and seamlessly integrate into the task(s) they have in front of them on their screen. It was designed to be a dynamic tool that adapts to the user’s needs, offering tailored suggestions and solutions given the workflow they choose for Copilot to assist them in. In-line image editing is the latest feature that Microsoft has added to Copilot. This feature was announced at the same time Microsoft revealed they would have a commercial in the upcoming Super Bowl. In-line image editing allows users to directly customize AI-generated images within the Copilot interface, such as enhancing an object’s color to make it stand out, blurring the background for a more focused subject, or applying artistic effects like pixel art. width=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"> Everyday AI integration Microsoft seems to have tapped into what users are demanding from AI systems. Recently, AI has been featured in popular media for its potential to revolutionize our work lives, serve as personal assistants for daily tasks, solve complex problems, and even create unimaginable innovations. Despite these visions that are being marketed, consumer-facing AI products have predominantly been limited to generative AI chatbots and image generators. While these products have gained traction for their unique abilities, they are still very broad, and when you take a closer look at how people are primarily using AI, you would see that they have a preference for using generative AI chatbots in niches as specialized consultants and sophisticated search tools. Microsoft’s Copilot takes that into consideration and boils these functionalities into a single application that integrates with the user’s current screen activity. This integration eliminates the need to juggle multiple tabs or switch to split-screen mode and streamlines the AI-assisted task completion process that users already go through. Microsoft’s investment in Copilot should not be overlooked either, and it might actually be the start of a significant shift in how we interact with technology. Microsoft has such a strong belief in Copilot that the company has introduced a dedicated Copilot key on its keyboards—the first new key in nearly three decades. This key summons Copilot, seamlessly integrating AI assistance with the user’s current on-screen activities. While generative AI models have been the primary winners so far, the race to deliver consumer-friendly products that leverage AI is ongoing. On that front, we also saw Microsoft announce AI PCs, computers equipped with chips specializing in executing AI functions. This reflects the eagerness within the tech industry to create consumer-facing AI products and wearables that could achieve mass adoption by not only riding the AI trend the world is experiencing but also delivering products and services that increase efficiency and productivity. It’s clear that Microsoft, among others, sees immense opportunity in making AI an integral, easily accessible part of our everyday lives, which means we are likely to see other tech companies follow suit and launch their AI tools soon. In order for artificial intelligence (AI) to work right within the law and thrive in the face of growing challenges, it needs to integrate an enterprise blockchain system that ensures data input quality and ownership—allowing it to keep data safe while also guaranteeing the immutability of data. Check out CoinGeek’s coverage on this emerging tech to learn more why Enterprise blockchain will be the backbone of AI. Watch: Artificial intelligence needs blockchain width=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"> New to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology. As interest in digital asset investments grows, Deutsche Börse eyes developing a platform that would make tokenized assets fungible for institutional clients and boost its profit in the long run. Microsoft is ramping up its AI efforts as tech giants race to become the frontrunner in the industry, hiring key players from Inflection AI to spearhead its consumer AI arm. The ECB is establishing seven new ‘workstreams’ to develop the digital euro rulebook, and experts in payments infrastructure and architecture were encouraged to apply by April 5. Join the official Bitcoin SV Discord channel: www.discord.gg/bsv "
}