{
    "title": "Second of the 'Fabulous Five' reaches $3T market cap",
    "date": "2/8/2024",
    "url": "https://vator.tv/news/2024-02-08-second-of-the-fabulous-five-reaches-3t-market-cap",
    "text": "Microsoft hit the $3 trillion market cap recently, becoming the second company in the world to reach this milestone. After a stellar run in 2023, the tech corporation gained an additional 10% in the first month of this year and reached its record high of $415.32 per share.  And one would actually call “stellar” the past decade of Microsoft’s public trading, with the exception of 2022, when stocks took a hit across the board. Between early 2014 and late 2018, MSFT stock tripled in value, then it quadrupled in the five years since. All that thanks to CEO Satya Nadella’s leadership and his going all-in on technologies like cloud and generative AI. From fading in the background of the FAANG, Microsoft is now one of the “Magnificent Seven” or the “Fabulous Five”, listed next to Nvidia, Amazon, Apple, and Meta (Tesla also, depending on the analyst) – and it’s consistently outperformed the S&P 500. Early on, Microsoft pushed into cloud services, building infrastructure for business applications and data storage with Azure. It is now competing against Amazon Web Services (AWS), Google Cloud, and IBM Cloud, but for organizations using the Windows operating system and other Microsoft products, Azure promises better integration. In market share, AWS has been ahead of Azure, but the latter held 24% in Q4 – a significant chunk of the global market. To pinpoint another force factor behind Microsoft, there is its multibillion-dollar partnership with OpenAI. The software giant is the exclusive provider of cloud infrastructure for the world’s top generative AI company – and in turn, Microsoft integrates AI assistance tools from OpenAI into its platforms like GitHub. In the hardware space, Microsoft is also building its first AI chip; the Azure Maia AI chip able to train large language models is coming this year, as reported by The Verge. Other areas of focus for Microsoft have been gaming and social media. A few of its big acquisitions in these areas were networking website LinkedIn, video platform Skype, Minecraft developer Mojang Studios, and game companies ZeniMax and Activision Blizzard. Microsoft had also greatly advanced its browser, Edge, and search engine, Bing, powering them with AI tools, but its market share remains low in that space. Looking into 2024, many analysts named MSFT a top pick as the giant begins to monetize its AI investments. These included analysts at Mizuho Securities, Wells Fargo, Wedbush Securities, Jefferies, and Loop Capital Markets. AAPL slides from $3 trillion Looking at other tech giants, Apple surpassed $3 trillion in mid-2023, but in early February it sat slightly below that market cap. Apple has held the title of the most valuable publicly traded company for years, but over the past year or so, the gap tightened. At $2.6 trillion in mid-2022, it was worth both Microsoft and Meta combined – now Microsoft has reached the same level. The world’s Number One phone brand has slowed its pace of growth, cutting back on acquisitions and sales. But while it saw net sales decline in 2023 compared to 2022, it did win over Samsung in the big picture, holding 20.1% of the world’s phone market share, according to preliminary data from IDC. There are analysts – Ming-Chi Kuo of TF International Securities in particular – who forecast Apple’s 2024 sales decline further as consumers turn to foldable phones and Huawei resurges in China. GOOGL, AMZN, NVDA (and META) under $2 trillion Sitting between $1.7 trillion and $1.8 trillion in market value are Alphabet (Google), Amazon, and Nvidia. Of these, Nvidia witnessed the fastest rise – a whopping 1,800% over the past five years. The chip maker only recently reached the level of the other two tech giants – just in 2024, NVDA surged 46%. That’s thanks to Nvidia’s expensive and highly-demanded chips that make generative AI work. And while AI is still at the emerging stage, meaning there’s no ceiling in sight to this segment, Nvidia is also diversifying into software and expanding its international presence. The company also makes graphics cards for gaming and operates data centers, but it’s the AI boom that make analysts bullish about the stock. Next up, investors in Google operator Alphabet enjoyed a 165% stock increase over the past five years. Of these top techs, GOOGL is the cheapest stock based on the price-to-earnings (P/E) ratio, as The Motley Fool pointed out, now trading near $145 per share. Chrome remains the top browser in the United States, holding just over half of the market, while Google Search dominates among the search engines worldwide, at about 91%. Naturally, Google was on top of the trend to embed generative AI into its search engine, having launched its Bard and Gemini models in 2023 – and the latter has been evaluated as superior to ChatGPT’s GPT-4. On to Amazon, this tech giant saw its stock gain 115% over the past five years – and it’s trading at 10 times its share price a decade ago. This one remains the king of e-commerce, and it continues to generate the majority of its sales from online stores, with third-party seller services coming in second. However, its cloud infrastructure AWS, as mentioned earlier, remains the leading choice worldwide, followed by Microsoft and Google in second and third positions in market share. This giant is also going aggressive on generative AI, applying it to cybersecurity and productivity, among other things. We’ll close this story with Meta. Formerly the “F” in the FAANG for “Facebook,” this tech giant has fallen behind the others, commanding a market value of $1.2 trillion. As a social media giant benefiting from targeted ads, this one has probably struggled the most in the public eye, battling multiple court cases from copyright infringement to children’s privacy and media addiction issues. Still, the giant remains the world’s Number One social media conglomerate after integrating Instagram and WhatsApp, as well a diving into metaverse development and headsets. One could say that what doesn’t kill you makes you stronger – and we, the forever consumers of those perfect products of Instagram’s targeted ads, hope that Meta will come out better (and safer) than ever.   BabyPeek is a genetic test that allows parents to discover features and traits as early as 10 weeks SMBs get more benefits from niche CRM providers. Here are a few that make you stand out. The app will officially launch on Web, iOS and Android April 3rd "
}