{
    "title": "Microsoft partners with OpenAI's French rival Mistral",
    "date": "2/26/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024:newsml_L3N3FB3XL:0-microsoft-partners-with-openai-s-french-rival-mistral/",
    "text": "Microsoft MSFT will make French startup Mistral AI's artificial intelligence models available through its Azure cloud computing platform under a new partnership, the companies said on Monday. The multi-year deal signals Microsoft's efforts to offer a variety of AI models beyond its biggest bet in OpenAI as the tech giant seeks to attract more customers for its Azure cloud services. Microsoft will take a minority stake in Mistral as part of the deal, the startup told Reuters without disclosing details. Microsoft confirmed its investment in Mistral, but said it holds no equity in the company. The tech giant is under regulatory scrutiny in Europe and the U.S. for its outsized funding in OpenAI. The Paris-based startup works on open source and proprietary large language models (LLM), similar to the one OpenAI pioneered with ChatGPT, that understands and generates text in a human-like fashion. Its latest proprietary model, Mistral Large, will be first available to Azure customers under the partnership. Mistral's technology will be hosted on Microsoft's cloud computing platform. Mistral has also been working with Amazon AMZN and Google to distribute its models. It plans to make Mistral Large available on other cloud platforms in the next few months, a spokesperson said. Mistral was founded by Timothée Lacroix and Guillaume Lample, who previously worked on Meta's artificial intelligence teams; and Arthur Mensch, a former researcher at Google's DeepMind GOOG. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @profitable_trades @TradingView @ozonlayerfx @aggressivecalculator @most_luxurious_lifestyle @life_of_lorena.fx @chartfeed @tradingview @TradingView @fxdelta @lifestylewith_ashley26 @TradingView @aitor_avatar @rok_trader @Cenobar @trading_tools.ir @Market Mentor Network @itzi71 Whatever the trade "
}