{
    "title": "Microsoft's deal with Mistral AI faces EU scrutiny",
    "date": "2/28/2024",
    "url": "https://theedgemalaysia.com/node/702628",
    "text": "LONDON/BRUSSELS (Feb 27): Microsoft's deal with French tech startup Mistral AI has provoked outcry in the European Union, with lawmakers demanding an investigation into what they see as a concentration of power by the tech giant. Antitrust authorities are already looking at Microsoft's partnership with ChatGPT-maker OpenAI, with the European Commission earlier warning the companies' relationship could be in breach of EU competition rules. But lawmakers were taken by surprise on Monday, when Microsoft announced it had made a €15 million (RM77.75 million) investment in Paris-based Mistral, and would soon make the company's AI models available via its Azure cloud computing platform. A Microsoft spokesperson told Reuters on Monday it invested in Mistral without holding a stake. Later, Microsoft clarified to say its investment would convert into equity in the company's next funding round, a common practice among big tech companies investing in AI startups without putting a valuation. Mistral was last valued at €2 billion in a funding round in December led by investors such as Andreessen Horowitz and Lightspeed. When facing regulatory pressure over its multi-billion dollar investment in OpenAI late last year, Microsoft sought to clarify that it did not in fact own a stake in the company, and therefore could not control it. Microsoft has gained access to OpenAI's cutting edge models and rights to share OpenAI's profits in return for the investment, which is under antitrust scrutiny in both EU and the US. The deal with Mistral has raised eyebrows anew in Brussels, where last year lawmakers spent months hashing out the details of the bloc's wide-sweeping AI Act. Behind closed doors, Mistral lobbied for exemptions for some AI systems, warning that overly strict laws would hamper European startups' chances of competing with US-based giants. Mistral's deal with Microsoft has led some lawmakers to question the company's motivations. \"What is emerging shows even more that it was good not to water down our ambition on the safety of GPAI (general purpose AI) models with systemic risks, following legitimate but strong lobbying from companies like Mistral,\" said Brando Benefei, a member of the European Parliament (MEP) who oversaw the drafting of the AI Act. Alongside Germany and Italy, France also pushed for exemptions for companies making generative AI models, to protect European startups such as Mistral from over-regulation. \"That story seems to have been a front for American-influenced big tech lobby,\" said Kim van Sparrentak, an MEP who worked closely on the AI Act. \"The Act almost collapsed under the guise of no rules for 'European champions', and now look. European regulators have been played.\" A third MEP, Alexandra Geese, told Reuters the announcement raised legitimate questions over Mistral and the French government's behaviour during the negotiations. \"There is a concentration of money and power here like the world has never seen, and I think this warrants an investigation.\" The French government did not immediately respond to a request for comment. Microsoft and Mistral AI declined to comment. Max von Thun, Europe director at Open Markets Institute, a non-profit organisation focused on strengthening antitrust law, said the EU should move quickly to investigate the partnership. \"This announcement exposes as a farce Mistral’s efforts to derail the AI Act based on its status as a supposed ‘European champion’.\"    Copyright © 1999-2023 The Edge Communications Sdn. Bhd. 199301012242 (266980-X). All rights reserved "
}