{
    "title": "Cloud services made 55% of Microsoft's revenue in 2023, 15% more than four \nyears ago",
    "date": "3/1/2024",
    "url": "https://tynmagazine.com/cloud-services-made-55-of-microsofts-revenue-in-2023-15-more-than-four-years-ago/",
    "text": "Although the productivity suite Microsoft 365 might be the tech giant’s best-known front-facing product, cloud services have had a major role in the company’s success over the past years. According to data presented by Altindex.com, cloud services made 55% of Microsoft’s revenue in 2023, or 15% more than four years ago. Microsoft Cloud Services Brought in $65.5 Billion in H2 2023, Almost Double the Figure Reported in H2 2020 The public cloud market has snowballed over the past years as billions worldwide have started using cloud storage to manage and store private data. Last year alone, public cloud platforms grossed $595 billion, or 175% more than just five years before. This figure is expected to grow by a further 16% and hit over $690 billion in 2024. As one of the biggest players in the cloud computing landscape, Microsoft has always had the lion’s share in total market revenue. According to Statista and the official company data, out of $118.5 billion Microsoft generated in the second half of its fiscal year 2024, matching the period between July and December 2023, cloud computing was responsible for $65.5 billion, or 55% of total revenue. This shows that cloud solutions continue to overtake Microsoft’s other products regarding their fiscal importance. In the same period of 2022, cloud services brought in $52.8 billion, or 46% of Microsoft`s total revenue. Four years ago, in the second half of 2020, sales linked to cloud services and properties generated $31.9 billion in revenue, or only half the figure reported last year, representing 41% of the company’s total revenue in this period. One reason why Microsoft has doubled its cloud services revenue in the past three years is the surging number of companies shifting from on-premises to cloud solutions. However, the tech giant also decided to invest a further $13 billion into OpenAI last January, with the plan to gradually integrate the AI startup’s large language model GPT-4 into every Microsoft product, including Azure. This confirmed cloud revenue will become an even more crucial company pillar in the future. Microsoft Azure Edges Closer to Amazon Web Servies; Market Share Hit an All-Time High of 24% in 2023 The impressive cloud services revenue growth has also helped Microsoft to increase its market share and edge closer to its biggest rival, Amazon. According to estimates from Synergy Research Group, Amazon had a 31% share in the cloud infrastructure market in the fourth quarter of 2023, down from 33% a year earlier. On the other hand, Microsoft’s market share hit an all-time high of 24% in Q4 2023, or 1% more than in the same period a year ago. With Google Cloud Services` 11% market share, the “Big Three” accounted for two-thirds of the global cloud market. The rest of the competition, including Alibaba Cloud, Salesforce, IBM Cloud, Oracle, and Tencent Cloud, were stuck in the low single digits, with their market shares ranging between 2% and 4%. See more: MWC24: Viettel unveils 5G Chipset and Human AI to the Global Technology Community See more: Cloud mining is about to usher in the spring of making money See more: How identifying a liquidity zone in forex can elevate your profits Tags: TyN marca tendencia, publicando diariamente lo más importante que nuestros lectores deben conocer para tomar las mejores decisiones. TyN es tu “punto de encuentro” con la información. – Founder and Editor: Gustavo Martínez (gustavom@tynmagazine.com) – Content Marketing: Graciela Salas (gracielas@tynmagazine.com) –  Special Editor: Damián Martínez (damianm@tynmagazine.com) –  Special Journalist: Joaquín Pereira (redaccion@tynmagazine.com) –  Special Journalist: Christian López Fuentes (redaccion@tynmagazine.com)  –  Special Journalist: Ludmila Gianantonio (redaccion@tynmagazine.com) TyN Magazine © . "
}