{
    "title": "3 Stocks That Could Be Worth More Than Apple by 2030",
    "date": "1/4/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/MSFT/pressreleases/23112754/",
    "text": "Apple (NASDAQ: AAPL) needs little introduction. The iPhone maker has built an unrivaled consumer tech ecosystem, selling high-priced devices and related high-margin services like the App Store and Apple Pay. Its business model and reputation for quality products have allowed Apple to generate enormous profits and made it the most valuable company in the world, with a market cap today of about $2.9 trillion. With modest growth, the company could be worth $5 trillion by 2030. However, just because Apple is the most valuable company in the world today doesn't mean it will always be. Just ask ExxonMobil, General Electric, and IBM, all of which have fallen sharply from their earlier positions as the most valuable companies in the country. While Apple still appears to be in great shape, a number of companies have the potential to move past it by 2030. Let's take a look at three of them. Image source: Getty Images. Of all the companies that could top Apple in market cap by 2030, Microsoft (NASDAQ: MSFT) has the best chance of doing so. In fact, it's already knocking on the door with a market cap of $2.76 trillion, just 5% smaller than Apple. But that's not the only reason why Microsoft could reclaim the title of the world's most valuable company. It is on the cutting edge of the artificial intelligence (AI) business thanks to its partnership with OpenAI, and it's in the process of incorporating generative AI technologies across its portfolio of products, including its Azure cloud infrastructure business, Office software suite, and Bing search engine. Microsoft Azure is also growing faster than rivals like Amazon Web Services, and the company has a history of making smart acquisitions under CEO Satya Nadella, including Linkedin, GitHub, and Activision Blizzard. Finally, Microsoft is more diversified than Apple and its fellow tech giants, making it more resistant to recessions and better able to adapt to changing circumstances. Nvidia (NASDAQ: NVDA) was the breakout star of 2023. The company's AI chips have been in high demand as cloud infrastructure companies, start-ups, and other tech companies look to build out their capacity to run complex generative AI models. Nvidia's revenue tripled year over year in the third quarter, and it has built out a commanding lead in artificial intelligence (AI) chips and components. In fact, there's a shortage of the kind of graphics processing units (GPUs) and accelerators that Nvidia produces. Demand for generative AI components and infrastructure seems set to explode as many tech CEOs expect generative AI to be revolutionary, and that could fuel Nvidia's growth over the coming years. Currently, the company enjoys a large competitive advantage in AI chips with a profit margin above 50%, which could enable the company to grow from $1 trillion to $5 trillion by 2030, potentially topping Apple by then. Finally, Tesla (NASDAQ: TSLA) has a chance to exceed Apple's market cap in the next six years. It has already disrupted the auto sector once by proving that electric vehicles (EVs) can be a profitable business, and it essentially took the concept mainstream. Now, it has a chance of disrupting the sector again with autonomous vehicle technology and robotaxis. Tesla bulls like Ark Invest's Cathie Wood expect the company to deploy a fleet of robotaxis in the coming years, and predict that autonomous vehicles will eventually produce the majority of its revenue. That could still be several years away, but Tesla's track record and its commitment to innovation in areas like its autonomous robot, Optimus, give the stock significant upside potential. For Tesla to reach $5 trillion in market cap, it would have to grow roughly six times larger, but that's as much as investors such as Wood expect it to appreciate. If Tesla can pull off the pivot to autonomous vehicles, its stock could skyrocket from here. While that may seem impossible, Tesla has shown its ability to overcome long odds in the past, and it could do it again. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of December 18, 2023  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Jeremy Bowman has positions in Amazon. The Motley Fool has positions in and recommends Amazon, Apple, Microsoft, Nvidia, and Tesla. The Motley Fool recommends International Business Machines. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Microsoft Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}