{
    "title": "AAPL: Are AAPL, MSFT, and GOOGL Solid 2024 Buys?",
    "date": "1/8/2024",
    "url": "https://stocknews.com/news/aapl-msft-googl-lly-nvs-are-aapl-msft-and-googl-solid-2024-buys/",
    "text": "Login \n        Join Login \n                                            Join AAPL – The tech industry is thriving on the seamless integration of generative AI, advancing cloud computing, and perpetual innovations. Against this backdrop, are Apple (AAPL), Microsoft (MSFT), and Alphabet (GOOGL) positioned for potential gains this year? Read more to find out…. Jan 8, 2024 The Magnificent Seven stocks, which include Apple Inc. (AAPL), Microsoft Corporation (MSFT) and Alphabet Inc. (GOOGL), concluded a stellar year, outperforming the S&P 500 index. Vanguard Mega Cap Growth Index Fund ETF Shares (MGK) secured a 6.9% gain over the past six months, surpassing the S&P 500’s 5.6% increase. Additionally, investors’ interest in these mega caps is evident from MGK’s 49.2% gains over the past year. Before exploring individual stocks, let’s analyze the factors poised to benefit these companies. The technology industry is experiencing exponential growth propelled by the pervasive integration of generative AI, advancing cloud computing, and continuous innovations. Generative Artificial Intelligence (AI) integration has sparked a transformative shift, promoting increased collaboration and tailored digital interactions across various sectors. This year, generative AI is expected to stand out as a pivotal focal point for technological intrigue, set to reshape the landscape with transformative capabilities and personalized advancements. Gartner (IT) forecasts substantial growth, with AI expected to constitute 10% of the overall data landscape by 2025. It also anticipates generative AI revolutionizing 70% of new web and mobile app design and development processes by 2026, fundamentally transforming the industry. This projection has the potential to markedly expedite growth in the internet sector, underscoring AI’s transformative impact on application development. Cloud infrastructure is also poised to be instrumental in democratizing AI accessibility. Projections indicate businesses will exceed a $1 trillion spending milestone on cloud computing infrastructure in 2024. The escalating necessity propels a surge in adopting new platforms and embracing as-a-service offerings. Furthermore, the upswing in technological innovations encompassing the Internet of Things (IoT), 5G networks, blockchain, spatial computing, homomorphic encryption, metaverse, 3D printing, additive manufacturing, robotics, and automation is poised to propel substantial industry expansion, notably expanding its horizons. Considering this encouraging outlook, let’s look at the fundamentals of the three tech frontrunners. 2024 STOCK MARKET OUTLOOK Stock to Watch: Apple Inc. (AAPL) AAPL designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories. Additionally, it offers AppleCare support, cloud services and operates platforms such as the App Store, empowering customers to explore and acquire applications and digital content on a global scale. On January 4, AAPL’s Fitness+ unveiled innovative features that enhance user engagement and foster well-being. The incorporation of a novel sound meditation theme and an exclusive workout program showcasing golf sensation Rose Zhang could position AAPL for substantial market expansion and heightened fiscal success. Moreover, on December 11, the company unveiled Journal, an innovative iPhone app fostering user well-being by facilitating reflection and gratitude through journaling, a practice proven to enhance mental health. With Journal, users can document daily experiences, incorporating photos, videos, audio recordings, locations, and more, thereby cultivating enriched memories. This development could hold promising implications for user satisfaction and AAPL’s continued success. For the fiscal 2023 fourth quarter that ended September 2023, AAPL’s net sales from Services increased 16.3% year-over-year to $22.31 billion. Its gross margin grew 6.1% from the year-ago value to $40.43 billion. Also, the company’s net income and EPS rose 10.8% and 13.2% from the prior year’s period to $22.96 billion and $1.46, respectively. Analysts expect AAPL’s revenue to increase 3.6% year-over-year to $397.16 billion for the fiscal year ending September 2024. The company’s EPS for the ongoing year is estimated to rise 7.6% from the prior year to $6.60. Shares of AAPL have gained 44.9% over the past year to close the last trading session at $181.18. AAPL’s fundamentals are reflected in its POWR Ratings. The stock has an A grade for Quality. It is ranked #19 out of 35 stocks within the B-rated Technology – Hardware industry. The POWR Ratings are calculated by considering 118 different factors, each weighted to an optimal degree. In addition to the POWR Ratings I’ve highlighted, you can see AAPL’s Growth, Value, Momentum, Stability, and Sentiment ratings here. Stocks to Buy: Microsoft Corporation (MSFT) MSFT is a multifaceted tech giant. Its Productivity and Business Processes segment encompasses Office, SharePoint, Microsoft Teams, Office 365 Security, Microsoft Viva, and Microsoft 365 Copilot. The Intelligent Cloud segment delivers server products and cloud services, whereas the More Personal Computing segment centers on Windows. On January 4, MSFT ushered in a transformative era for Windows 11 PCs with the introduction of the Copilot key, marking the first substantial modification to the Windows PC keyboard in almost three decades. This could position MSFT at the forefront of technological advancement and enhance the company’s user engagement. Additionally, on December 19, MSFT unveiled a collaboration with Suno, a frontrunner in AI-based music creation, integrating their expertise into Microsoft Copilot. The alliance empowers users to craft personalized, witty, and enjoyable songs with a straightforward prompt, amplifying creative possibilities within the user community. For the fiscal 2024 first quarter that ended September 30, 2023, MSFT’s total revenue increased 12.8% year-over-year to $56.52 billion. Its operating income rose 25% from the year-ago value to $26.90 billion. Additionally, the company’s net income and EPS grew 27% and 27.2% from the prior year’s period to $22.29 billion and $2.99, respectively. Analysts expect MSFT’s revenue to increase 14.7% year-over-year to $243 billion for the fiscal year ending June 2024. The company’s EPS for the current period is expected to come in at $11.21, up 14.2% from the prior year. Moreover, the company topped the consensus EPS estimates in all of the trailing four quarters. The stock has gained 65.4% over the past year, closing the last trading session at $367.75. MSFT’s robust outlook is apparent in its POWR Ratings. The stock has an overall rating of B, which equates to Buy in our proprietary rating system. MSFT has a B grade for Stability, Sentiment, and Quality. It is ranked #10 out of 42 stocks within the B-rated Software – Business industry. Click here to access additional MSFT ratings for Growth, Value, and Momentum. Alphabet Inc. (GOOGL) GOOGL delivers a range of products and services through its Google Services segment, encompassing ads, Android, Chrome, Gmail, and more. The Google Cloud segment deals with infrastructure, cybersecurity, data, analytics, AI, and machine learning services, while the Other Bets segment explores health technology and internet services. Today, it was reported that GOOGL made a significant stride with the introduction of Gemini, a revolutionary generative AI platform. As a long-promised, next-gen AI model family, Gemini’s multimodal capabilities theoretically enable diverse tasks, including speech transcription, image and video captioning, and artwork generation. While some capabilities are still being developed, GOOGL anticipates a comprehensive rollout in the near future. This advancement underscores GOOGL’s commitment to pushing the boundaries of AI innovation across various domains. Yesterday, Isomorphic Labs, a unit of GOOGL, revealed strategic research partnerships with pharmaceutical giants Eli Lilly and Company (LLY) and Novartis AG (NVS). The collaborations are centered around small-molecule treatments targeting multiple objectives. These partnerships could amplify GOOGL’s innovative prowess in AI-driven drug discovery, reinforcing its leadership. The upfront cash and potential milestone payments would further enhance GOOGL’s financial strength, solidifying its influential role at the nexus of technology and healthcare. During the fiscal 2023 third quarter that ended September 20, 2023, GOOGL’s total revenues increased 11% year-over-year to $76.69 billion. Its income from operations rose 24.6% from the year-ago value to $21.34 billion. Moreover, the company’s net income and EPS grew 41.5% and 46.2% from the prior year’s period to $19.69 billion and $1.55, respectively. The consensus revenue estimate of $305.77 billion for the fiscal year that ended December 2023 reflects an 8.1% year-over-year improvement. Likewise, the consensus EPS estimate of $5.74 for the ongoing period exhibits a 26% growth from the previous year. Moreover, the company surpassed the consensus revenue and EPS estimates in three of four trailing quarters. Shares of GOOGL have gained 57.5% over the past year, closing the last trading session at $135.73. GOOGL’s sound prospects are reflected in its POWR Ratings. The stock has an overall rating of B, which translates to Buy in our proprietary rating system. GOOGL has a B grade for Stability and Quality. It has ranked #5 in the 55-stock Internet industry. Click here to access the additional GOOGL ratings (Growth, Value, Momentum, and Sentiment). What To Do Next? 43 year investment veteran, Steve Reitmeister, has just released his 2024 market outlook along with trading plan and top 11 picks for the year ahead. 2024 Stock Market Outlook > Want More Great Investing Ideas? 3 Stocks to DOUBLE This Year Updated: 2024 Stock Market Outlook > 10 Stocks to SELL NOW! AAPL shares were trading at $183.63 per share on Monday morning, up $2.45 (+1.35%). Year-to-date, AAPL has declined -4.62%, versus a -1.02% rise in the benchmark S&P 500 index during the same period. Aanchal's passion for financial markets drives her work as an investment analyst and journalist. She earned her bachelor's degree in finance and is pursuing the CFA program.\r\n\r\nShe is proficient at assessing the long-term prospects of stocks with her fundamental analysis skills. Her goal is to help investors build portfolios with sustainable returns. More... Copyright © 2024. Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions.Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use, please see disclaimer. "
}