{
    "title": "Microsoft Becomes The Most Valuable Company in The World Beating Apple",
    "date": "1/13/2024",
    "url": "https://propakistani.pk/2024/01/13/microsoft-becomes-the-most-valuable-company-in-the-world-beating-apple/",
    "text": "Microsoft has emerged as the most valuable publicly traded company, a position long held by Apple. This shift in fortunes occurred briefly during intraday trading on Thursday but was solidified by the end of Friday’s U.S. trading session. Microsoft’s impressive performance in the stock market saw its shares rise by more than 3% over the week, propelling the company’s market capitalization to a staggering $2.89 trillion. In contrast, Apple experienced a dip of over 3% in its stock price, resulting in a reduction of its overall valuation to $2.87 trillion. On Wednesday, Apple faced a downgrade from Redburn Atlantic Equities analyst James Cordwell, who shifted their stance on the tech giant from a “buy” to a “neutral” rating. Cordwell’s decision was influenced by the belief that Apple’s iPhone growth potential in the coming years is limited, and there are concerns about the anticipated performance in the upcoming March quarter, which is expected to be underwhelming. In a separate development, Apple announced that former Vice President Al Gore would be retiring from the company’s board next month. Gore had been a director at Apple since 2003. On the other hand, Microsoft received a vote of confidence on Thursday as it showcased its artificial intelligence capabilities to developers at an event in San Francisco. Piper Sandler analysts expressed their optimism about the strong momentum surrounding Microsoft’s mature AI products. They highlighted the positive trend in GitHub website traffic, which has been steadily increasing year over year for three consecutive months. As a result, analysts have given Microsoft shares an equivalent of a “buy” rating, signaling their positive outlook on the company’s performance. For more than a year, Apple has maintained its position as the most valuable publicly traded company. It held this title consistently, with only brief periods when other entities like Saudi Aramco and Microsoft temporarily surpassed it in market capitalization. 📢 For the latest Tech & Telecom news, videos and analysis join ProPakistani's WhatsApp Group now! Follow ProPakistani on Google News & scroll through your favourite content faster!  Shares after apple reads this news they will work hard to become valuable. ProPakistani is the premier and most trustworthy resource for all happenings in technology, telecom, business, sports, auto, education, real estate and entertainment news in Pakistan. \nWhether it's the top trending news, inside scoops or features, interviews, market trends and analysis, product reviews, How to's or tutorials – we cover it all. © 2024 ProPakistani.PK - All rights reserved  Follow ProPakistani to get latest news and updates.  Join the groups below to get latest news and updates. Session expired Please log in again.\nThe login page will open in a new tab. After logging in you can close it and return to this page. "
}