{
    "title": null,
    "date": "1/18/2024",
    "url": "https://techeconomy.ng/microsoft-leads-as-the-most-sought-after-ai-stock-in-2024-drawing-interest-from-39-of-big-tech-investors/",
    "text": "Home » Microsoft Leads as the Most Sought-after AI Stock in 2024, Drawing Interest from 39% of Big Tech Investors The demand for generative AI continues to intensify, capturing investors’ attention with its dynamic appeal. While major tech firms are integrating AI into their institutional profiles, the extent of expansion varies. According to Stocklytics.com, Microsoft takes the lead in the AI race, attracting almost 40% of investors seeking its AI stock in 2024. The site’s financial analyst, Edith Reads, comments: Microsoft is envisioning high-end profits with growing AI collaborations and personal projects. The tech firm has been actively immersed in the AI wave for over six months. The announcement of significant pricing adjustments for Copilot within Microsoft 365 heralded the AI-driven future of Office documents. This resulted in a discernible surge in the company’s stock. Since that pivotal moment, scarcely a week has transpired without Microsoft unveiling fresh AI features or implementing modifications to its software and services. Investors are projecting Microsoft’s takeover of OpenAI with little effort in the recent employee shifts. Stocklytics Financial Analyst, Edith Reads Tech leaders are poised for a promising 2024 as new tech developments capture investors’ interest. Among the tech giants, Microsoft is anticipated to secure 44% of investors’ backing, with Amazon following closely at 24%, slightly exceeding half of Microsoft’s expected support rate. Nvidia leads the investment race, expecting 12% of investor support. Simultaneously, Alphabet, Meta, Apple, and Tesla lag slightly behind, anticipating single-digit investor backing. The AI space commands the most attention among tech developments. With its genuine investment in OpenAI and recent employee acquisitions, Microsoft particularly intrigues most investors. Following Microsoft’s 39% support is Nvidia’s 35%. AMD claims the third position with 13%, challenging Amazon and Alphabet, which expect 9% and 4% investor backing, respectively.  Microsoft has significantly led the AI charge, especially after funding Open AI’s development with nearly $13 billion. In 2019, Microsoft and OpenAI’s management struck an alliance to bolster outreach and research. However, in November 2023, Open AI’s board fired Sam Altman from his CEO position.  Microsoft didn’t waste any time and proposed a role for Altman to take over as the head of their internal AI division. However, Open AI quickly retracted their decision to fire Altman and hired him back. While Sam was back in his position, Microsoft secured top talents from Open AI to work on its subsidiary, placing itself in a good position for future AI projects. Besides, Microsoft owns a considerable 49% stake in OpenAI, making it the most significant player in the AI space. The projected investment in 2024 is the beginning of this transformative industry. The AI domain has a lot of room to maneuver, mainly due to the lack of limiting regulations. Microsoft being at the forefront of the AI force does place the industry in a position of new improvements. Joel Nwankwo is a tech journalist. He is passionate about telling stories as it relates to Africa's social and financial tech advancements. You can reach him at joel.nwankwo@techeconomy.ng The pulse of African music resonates worldwide. Fueled by the success of top sensations like Burnaboy, Davido, Tyla and Wizkid,... Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Privacy Policy Agreement *\n I agree to the Terms & Conditions and Privacy Policy.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Follow Us © 2023 Techeconomy - Designed by Opimedia. © 2023 Techeconomy - Designed by Opimedia. "
}