{
    "title": "Microsoft (MSFT), OpenAI Boost AI Capabilities With GPT Store",
    "date": "1/11/2024",
    "url": "https://finance.yahoo.com/news/microsoft-msft-openai-boost-ai-143100705.html",
    "text": "Microsoft MSFT and OpenAI, the creator of the popular artificial intelligence (AI) chatbot ChatGPT, are continuously making significant strides that will further solidify their presence in the global chatbot market. The global chatbot market size is expected to hit $7.01 billion in 2024 and reach $20.8 billion by 2029, witnessing a CAGR of 24.3% between 2024 and 2029.OpenAI has launched the GPT Store to create a marketplace for specialized chatbot agents based on their language models, particularly ChatGPT. This move allows users to buy and sell customized bots beyond what is offered through ChatGPT Plus. Users can develop chatbot agents with unique personalities or themes for various purposes, such as salary negotiation, creating lesson plans and developing recipes.The store was initially scheduled to open in November but faced delays due to internal upheaval at OpenAI, including the firing and subsequent reappointment of CEO Sam Altman. The company plans to launch a revenue-sharing program in the first quarter, where builders will be compensated based on user engagement with their GPTs, although specific details have not been shared yet.To feature in the GPT Store, developers have to verify their user profiles and submit their GPTs to OpenAI’s new review system. This involves a mix of human and automated review to ensure the GPTs comply with the company’s terms of use.OpenAI has emphasized the need for users to ensure that their chatbots adhere to usage policies and brand guidelines. The store is accessible to subscribers of premium services, such as ChatGPT Plus, Enterprise and the new subscription tier called Team, which costs $25 per month for each user. Team subscribers can create custom GPTs for their team’s specific needs.During a demo day for developers, the company has offered to cover legal costs for developers facing potential copyright law issues related to products based on ChatGPT and OpenAI's technology. OpenAI has been sued multiple times for alleged copyright infringement related to the use of copyrighted text in training its language models. Microsoft Corporation price-consensus-chart | Microsoft Corporation Quote Microsoft, which has gained 15.3% in the past three months, is being propelled by the success of ChatGPT. The launch of enterprise capabilities of Azure OpenAI and Copilots across Microsoft 365, Dynamics 365 and Power Platform is expected to be a game changer for this Zacks Rank #3 (Hold) company. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.The Zacks Consensus Estimate for fiscal 2024 revenues is pegged at $242.41 billion, indicating 14.3% growth from fiscal 2023. The consensus estimate for fiscal 2024 earnings is pinned at $11.14 per share, up 13.5% from the year-ago actual figure.The launch of the GPT store underlines Microsoft and OpenAI’s efforts to rapidly evolve their offerings in an attempt to stay ahead of rivals, such as Amazon AMZN, Alphabet GOOGL-owned Google and Adobe ADBE in the AI arms race. ChatGPT had about 100 million weekly active users as of November, according to OpenAI, and more than 92% of Fortune 500 companies use the platform.Alphabet is launching a range of features for Google Bard starting in 2024. The upcoming updates include custom bots, tasks, shared queries, \"Power Ups,\" and a paid \"Advanced\" tier. Further, Google will introduce new sections in Bard, namely Gallery and Tasks, to showcase its capabilities, including image generation and prompt improvement through the \"Power Up\" button.Amazon’s cloud-computing arm, Amazon Web Services, introduced Amazon Q, an AI-powered chatbot that assists in content creation and action-taking based on customer information repositories, code and enterprise systems. Further, Amazon Q streamlines tasks, accelerates decision-making and fosters creativity by providing personalized information and advice tailored to individual user identities, roles and permissions.Adobe has announced the commercial release of its family of creative generative AI models, Firefly. Adobe Firefly supports text prompts in more than 100 languages, helps creators make several changes to their content, creates endless variations seamlessly and bolsters image generation capabilities. The company is gaining strong momentum among content creators with Firefly. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Adobe Inc. (ADBE) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}