{
    "title": "With 72% institutional ownership, Microsoft Corporation (NASDAQ:MSFT) is a \nfavorite amongst the big guns",
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/news/72-institutional-ownership-microsoft-corporation-110019865.html",
    "text": "Significantly high institutional ownership implies Microsoft's stock price is sensitive to their trading actions 43% of the business is held by the top 25 shareholders Insiders have sold recently A look at the shareholders of Microsoft Corporation (NASDAQ:MSFT) can tell us which group is most powerful. With 72% stake, institutions possess the maximum shares in the company. That is, the group stands to benefit the most if the stock rises (or lose the most if there is a downturn). Given the vast amount of money and research capacities at their disposal, institutional ownership tends to carry a lot of weight, especially with individual investors. As a result, a sizeable amount of institutional money invested in a firm is generally viewed as a positive attribute. In the chart below, we zoom in on the different ownership groups of Microsoft. Check out our latest analysis for Microsoft Institutional investors commonly compare their own returns to the returns of a commonly followed index. So they generally do consider buying larger companies that are included in the relevant benchmark index. As you can see, institutional investors have a fair amount of stake in Microsoft. This implies the analysts working for those institutions have looked at the stock and they like it. But just like anyone else, they could be wrong. It is not uncommon to see a big share price drop if two large institutional investors try to sell out of a stock at the same time. So it is worth checking the past earnings trajectory of Microsoft, (below). Of course, keep in mind that there are other factors to consider, too. Institutional investors own over 50% of the company, so together than can probably strongly influence board decisions. We note that hedge funds don't have a meaningful investment in Microsoft. Our data shows that The Vanguard Group, Inc. is the largest shareholder with 8.7% of shares outstanding. In comparison, the second and third largest shareholders hold about 7.2% and 3.9% of the stock. A deeper look at our ownership data shows that the top 25 shareholders collectively hold less than half of the register, suggesting a large group of small holders where no single shareholder has a majority. While studying institutional ownership for a company can add value to your research, it is also a good practice to research analyst recommendations to get a deeper understand of a stock's expected performance. Quite a few analysts cover the stock, so you could look into forecast growth quite easily. The definition of an insider can differ slightly between different countries, but members of the board of directors always count. Management ultimately answers to the board. However, it is not uncommon for managers to be executive board members, especially if they are a founder or the CEO. I generally consider insider ownership to be a good thing. However, on some occasions it makes it more difficult for other shareholders to hold the board accountable for decisions. Our most recent data indicates that insiders own less than 1% of Microsoft Corporation. It is a very large company, so it would be surprising to see insiders own a large proportion of the company. Though their holding amounts to less than 1%, we can see that board members collectively own US$950m worth of shares (at current prices). It is good to see board members owning shares, but it might be worth checking if those insiders have been buying. With a 28% ownership, the general public, mostly comprising of individual investors, have some degree of sway over Microsoft. While this size of ownership may not be enough to sway a policy decision in their favour, they can still make a collective impact on company policies. While it is well worth considering the different groups that own a company, there are other factors that are even more important. Take risks for example - Microsoft has   1 warning sign   we think you should be aware of. If you would prefer discover what analysts are predicting in terms of future growth, do not miss this free report on analyst forecasts. NB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}