{
    "title": "How Microsoft catapulted to $3 trillion on the back of AI | Mint",
    "date": "1/26/2024",
    "url": "https://www.livemint.com/companies/how-microsoft-catapulted-to-3-trillion-on-the-back-of-ai-11706250100474.html",
    "text": "Microsoft on Thursday became the second company ever to end the trading day valued at more than $3 trillion, a milestone reflecting investor optimism that one of the oldest tech companies is leading an artificial-intelligence revolution. In the past decade, Microsoft’s success has come from smart bets by Chief Executive Satya Nadella. One of his biggest gambles in recent years has been partnering with an untested nonprofit startup—generative AI pioneer OpenAI—and quickly folding its technology into Microsoft’s best-selling products. That move made Microsoft a de facto leader in a burgeoning AI field many believe will retool the tech industry. Because of the OpenAI relationship “Microsoft to me is ahead of Alphabet and Meta and has a great shot of being a software leader in AI,\" said Synovus Trust portfolio manager Daniel Morgan, who owns Microsoft shares. Microsoft’s capitalization first rose about $3 trillion in midday trading Wednesday but closed below the mark. Microsoft’s ascendence on the back of AI excitement may signal a changing guard atop tech. Apple became the first company to close above the $3 trillion mark in June, reflecting the lasting impact and resilience of the iPhone. Earlier this month, Microsoft briefly dethroned Apple as the most highly valued publicly-listed company in the world. Apple has since regained the top spot. Apple shares have underperformed versus other tech giants so far this year, amid concerns about the company’s sales and its position in the AI race. The AI boom unofficially kicked off in November 2022 with the release of ChatGPT, a chatbot built by Silicon Valley nonprofit startup OpenAI that uses so-called “large language models\" to write poems, craft emails and generate computer code. Microsoft is the largest investor in OpenAI. In multiple rounds over the past five years, it has agreed to invest $13 billion in OpenAI in exchange for what is essentially a 49% stake in the earnings of its for-profit arm. The relationship has also given Microsoft early access to OpenAI’s latest models, which are trained and hosted on the company’s cloud computing service, Azure. Microsoft’s aggressive adoption and expansion of the technology have helped it leapfrog rivals in investors’ minds. Since Microsoft’s multibillion-dollar investment in OpenAI in January 2023, the stock has gained nearly 70%, adding more than $1.2 trillion to Microsoft’s market value. Nadella has forged a close relationship with OpenAI’s CEO Sam Altman and incorporated his startup’s technology into top Microsoft products. Investors have been bullish on the prospect that these AI tools—including an assistant Copilot that plugs into key Microsoft software like Word, Outlook and Teams—will become a major new revenue stream for the company. “They have a huge head start owing to OpenAI and innovating quickly and moving faster than other enterprise software companies have been able to,\" said Rishi Jaluria, an analyst at RBC Capital. While the AI hype has boosted stocks across the tech sector, Microsoft has ridden the wave better than the rest. In 2023, Microsoft’s stock rose more than 55%, outpacing the Nasdaq Composite Index, which rose less than 45%. Some investors worry there could be a bubble forming around the soaring prices of AI-driven stocks. It is still unclear how much new revenue the AI boom will add to any of the companies. Even for some of the biggest beneficiaries, it could take years before enterprises and individuals embrace AI tools at the scale the technology’s biggest proponents expect. Microsoft’s early attempt to integrate AI into its products has been hit or miss. The AI chat added to its Bing search engine hasn’t done much to boost its market share against Google’s. Its GitHub Copilot product, which uses AI to speed up coding, has been popular. The sheer size of Microsoft and peers like Apple means that tech stocks play an outsize role in the broader stock market’s performance. When the year began, the two tech giants accounted for 14% of the market-value weighted S&P 500, according to S&P Dow Jones Indices Microsoft and Apple both now surpass the value of five of the 11 sectors within the S&P 500, according to Dow Jones Market Data, including consumer staples, energy, real estate, materials, and utilities. Microsoft’s recent success is the latest capper for one of the oldest companies in tech that has ridden its tight ties with corporate customers to thrive through multiple waves of technological change. Started in 1975, Microsoft has navigated the evolution from personal computers to the internet to mobile devices—some shifts better than others. Through it all, its operating systems are still in most of the world’s computers, and its workplace software remains a stalwart in companies across the globe. In recent years, as some tech companies have struggled with slowdowns, Microsoft has found ways to grow revenue. Its core businesses have generated enough cash to allow it to become one of the most acquisitive companies in tech. Not long ago, the Redmond, Wash., company was considered the stodgy old uncle of technology, not on par with the leading names in the industry. Despite its size, it was left out of the FAANG acronym some investors once used to describe what were considered the most dynamic names in tech: Facebook, Amazon, Apple, Netflix and Google. “There was a time when Microsoft was not part of FAANG and now Microsoft is absolutely in the magnificent seven,\" said Soma Somasegar, a venture capitalist with Madrona Ventures and a former Microsoft executive. The magnificent seven refers to the leaders in tech today: Google parent Alphabet, Amazon.com, Apple, Meta Platforms, Nvidia, Tesla and Microsoft. Nadella, who’s nearly a decade into the CEO job, has rapidly led the company across trillion-dollar valuation landmarks. It crossed the $1 trillion market capitalization mark in 2019 and $2 trillion two years later. Under Nadella, Microsoft’s Azure cloud service has become the main engine of its growth, and the company’s stock rises and falls based on how well the division does. Today, it is the second-largest player in the sector behind Amazon’s Web Services. The AI boom is expected to accelerate growth at Azure. Last quarter, customer spending on Microsoft’s AI services was responsible for three percentage points of Azure’s revenue growth. Write to Tom Dotan at tom.dotan@wsj.com and Charley Grant at charles.grant@wsj.com Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp Chat with\n                    MintGenie I am Genie, Mint’s AI enabled assistant to help you with your queries related to: "
}