{
    "title": "Call Of Duty's Open-World Transition Starts With 2024's Black Ops Gulf War: \nReport - Microsoft (NASDAQ:MS",
    "date": "2/5/2024",
    "url": "https://www.benzinga.com/general/gaming/24/02/36940239/call-of-dutys-open-world-transition-starts-with-2024s-black-ops-gulf-war-report",
    "text": "In a notable departure from its traditional linear campaigns, Call of Duty is set to introduce an open-world campaign in its upcoming release, Black Ops Gulf War. While the series previously flirted with open-world elements in Modern Warfare 3, sources reveal that Gulf War's campaign has been meticulously constructed from the ground up, avoiding reliance on assets from previous entries, Insider Gaming reported. Similar to previous mainline Call of Duty launches, the upcoming Black Ops installment aims for a release in October or November 2024. See Also: Call Of Duty Community Cleans Up - Activision Reports 50% Drop In Chat Toxicity The open-world experience in Gulf War is likened to the exploration style seen in Far Cry, allowing players and their squad to navigate the map using vehicles and a fast travel system. Although the exact number of linear missions remains uncertain, sources told Insider Gaming that there'll be integration of some linear missions within the broader open-world structure. Developed by Microsoft Corp.'s MSFT Raven Software, with multiplayer and zombies handled by Treyarch Games, the campaign will feature the return of familiar Black Ops characters, including Adler. Also, the shift towards open-world campaigns may extend beyond Gulf War, indicating a potential trend in future Call of Duty titles. The next installment, Call of Duty 2025 (codenamed Saturn), is also rumored to embrace an open-world approach, with a map divided into various biomes or locations. However, the specifics of this design are subject to change as the game is still in early development, with approximately 20 months until its expected release in October 2025. Read Next: Call Of Duty 2025, Codenamed 'Saturn,' Is A Semi-Futuristic Sequel To Black Ops 2 Image credits: Casimiro PT on Shutterstock. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}