{
    "title": "Premarket Mover: Microsoft Corp (MSFT) Up 1.08%",
    "date": "2/2/2024",
    "url": "https://www.investorsobserver.com/news/stock-update/premarket-mover-microsoft-corp-msft-up-1-08",
    "text": "Microsoft Corp (MSFT) has risen Friday morning, with the stock adding 1.08% in pre-market trading to 408.15. \n\n\nMSFT's short-term technical score of 96 indicates that the stock has traded more bullishly over the last month than 96% of stocks on the market. In the Software - Infrastructure industry, which ranks 49 out of 146 industries, Microsoft Corp ranks higher than 97% of stocks.\n\nMicrosoft Corp has risen 8.87% over the past month, closing at $367.75 on January 5. During this period of time, the stock fell as low as $367.75 and as high as $415.32. MSFT has an average analyst recommendation of Strong Buy. The company has an average price target of $421.75.\n\n\n\n\n\n MSFT has an Overall Score of 75. Find out what this means to you and get the rest of the rankings on MSFT!\nSee Full MSFT Report\n\n\n\nMicrosoft Corp has a Long-Term Technical rank of 86. This means that trading over the last 200 trading days has placed the company in the upper half of stocks with 14% of the market scoring higher. In the Software - Infrastructure industry which is number 47 by this metric, MSFT ranks better than 47% of stocks.\n\n\n\nImportant Dates for Investors in MSFT:\n\n\n-Microsoft Corp is set to release earnings on 2024-04-29. Over the last 12 months, the company has reported EPS of $10.33.\n\n\n-Microsoft Corp has a dividend yield of 0.007545651 with their ex-dividend date set for 2/14/2024.\n\nClick Here To Get The Full Report on Microsoft Corp (MSFT) Microsoft Corp (MSFT) has risen Friday morning, with the stock adding 1.08% in pre-market trading to 408.15. \n\n\nMSFT's short-term technical score of 96 indicates that the stock has traded more bullishly over the last month than 96% of stocks on the market. In the Software - Infrastructure industry, which ranks 49 out of 146 industries, Microsoft Corp ranks higher than 97% of stocks.\n\nMicrosoft Corp has risen 8.87% over the past month, closing at $367.75 on January 5. During this period of time, the stock fell as low as $367.75 and as high as $415.32. MSFT has an average analyst recommendation of Strong Buy. The company has an average price target of $421.75.\n\n\n\n\n\n MSFT has an Overall Score of 75. Find out what this means to you and get the rest of the rankings on MSFT!\nSee Full MSFT Report\n\n\n\nMicrosoft Corp has a Long-Term Technical rank of 86. This means that trading over the last 200 trading days has placed the company in the upper half of stocks with 14% of the market scoring higher. In the Software - Infrastructure industry which is number 47 by this metric, MSFT ranks better than 47% of stocks.\n\n\n\nImportant Dates for Investors in MSFT:\n\n\n-Microsoft Corp is set to release earnings on 2024-04-29. Over the last 12 months, the company has reported EPS of $10.33.\n\n\n-Microsoft Corp has a dividend yield of 0.007545651 with their ex-dividend date set for 2/14/2024.\n\nClick Here To Get The Full Report on Microsoft Corp (MSFT) Subscribe to our daily morning update newsletter and never miss out on the need-to-know market news, movements, and more. Thank you for signing up! You're all set to receive the Morning Update newsletter Stock Price data may be delayed up to 15 minutes. Copyright © 2024. Portions of this content may be copyrighted by Fresh Brewed Media, Investors Observer, and/or O2 Media LLC. All Rights Reserved. Portions of this content protected by US Patent numbers 7,865,496, 7,856,390, and 7,716,116. Investing in stocks, bonds, option and other financial instruments involve risks and may not be suitable for everyone. Portfolio results are unaudited and based on varying investment expiration dates. Terms of Service | Privacy Policy "
}