{
    "title": "Anne Sheehan moves from Irish role to senior European post with Microsoft",
    "date": "2/21/2024",
    "url": "https://www.irishtimes.com/business/2024/02/21/anne-sheehan-moves-from-irish-role-to-senior-european-post-with-microsoft/",
    "text": "Microsoft Ireland general manager Anne Sheehan: moving on after more than two years in the role. Microsoft is on the hunt for a new general manager for its Irish business, as Anne Sheehan moves on to a new role in the company after more than two years. It is understood Ms Sheehan is moving to a European post, and will step down from the Irish one in April. The search for her successor is already under way. The tech giant confirmed Ms Sheehan would move on from the Irish role in the coming weeks but did not make any further comment. Ms Sheehan was appointed to the role of general manager with Microsoft Ireland in 2021, moving from Vodafone UK to lead the Dublin-based business in October of that year. She replaced then-managing director Cathriona Hallahan, who left the role after nine years, and took on responsibility for Microsoft’s sales, marketing and services business in Ireland. [ Microsoft beats quarterly revenue estimates ] Microsoft Ireland acts as a hub for its operations in Europe, the Middle East and Africa across a number of business areas, including operations, sales, engineering and product development. The tech sector has seen significant turmoil in recent months, with thousands of jobs lost across the sector as the Covid-19 pandemic boost for technology companies lost steam. Microsoft was among those companies to cut jobs in the past 12 months, announcing in January 2023 that it would reduce its workforce by 5 per cent globally. The company ramped up hiring in recent years, adding more than 40,000 jobs worldwide in the year to the end of June 2022, more than double the year before and a new record for the company, after the Covid-19 pandemic fuelled a boom in digital demand. [ Microsoft cuts 1,900 jobs in gaming, including at division with Dublin and Cork offices ] Chief executive Satya Nadella predicted that customers would continue to spend heavily on technology, but the boom faded, leaving companies scrambling to correct their cost bases. But it has also forged ahead with artificial intelligence, with Mr Nadella overseeing the integration of Open AI’s technology into Microsoft products. Ciara O'Brien is an Irish Times business and technology journalist © 2024 The Irish Times DAC © 2024 The Irish Times DAC "
}