{
    "title": "World Street | Britain, Japan in recession, Cisco, Morgan cut jobs; Apple \nsharpens war with Microsoft",
    "date": "2/16/2024",
    "url": "https://www.moneycontrol.com/news/business/markets/world-street-britain-japan-in-recession-cisco-morgan-cut-jobs-spacex-shifts-to-texas-apple-sharpens-war-with-microsoft-12284491.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now While Britain and Japan slide into recessions, the ECB goes cautious on rate cuts. Economic headwinds force Cisco to cut jobs along with Morgan Stanley with too plans laying off manpower. Coinbase sees profit surge as cryptos revive. In the US, while SpaceX shifts to Texas, Berkshire Hathaway reduces Paramount stake. China's chooses to hold the rates for a stable policy. In the tech sphere, Apple intensifies rivalry with Microsoft with a new developer tool. All this and more on this edition of World Street. Macro Matters Britain's economy entered into a recession in the second half of 2023 after it shrank by a worse-than-expected 0.3 percent in the three months to December having also contracted by 0.1 percent between July and September, official data showed. A Reuters poll of economists had pointed to a smaller 0.1 percent fall of gross domestic product (GDP) in the October-to-December period. Japan Too Japan unexpectedly slipped into recession at the end of last year, losing its title as the world's third-biggest economy, to Germany and raising doubts about when the central bank would begin to exit its decade-long ultra-loose monetary policy, reports Reuters. Some analysts are warning of another contraction in the current quarter as weak demand in China, sluggish consumption and production halt at a unit of Toyota Motor all point to a challenging path to an economic recovery and policymaking. Not Yet The Euro Zone inflation is heading back towards the 2 percent target but the European Central Bank needs more confirmation before it could cut the rates. \"The latest data confirms the ongoing disinflation process and is expected to bring us gradually further down over 2024,\" ECB President Christine Lagarde told a European Parliament hearing in Brussels. \"The current disinflationary process is expected to continue, but the Governing Council needs to be confident that it will lead us sustainably to our 2% target,\" Lagarde added. Job Cuts Cisco Systems said it would cut 5 percent of its global workforce, or more than 4,000 jobs, and lowered its annual revenue target as the company navigates a tough economy that has led to thousands of layoffs by tech firms this year. Shares of the networking equipment maker fell more than 5% in extended trading on Wednesday, after Cisco cut the forecast to $51.5 billion to $52.5 billion from $53.8 billion to $55 billion, it projected earlier. Morgan’s Moves Investment banking giant Morgan Stanley is planning to cut hundreds of jobs in its wealth management unit, according to Reuters, the latest in a string of layoffs that Wall Street firms have undertaken since last year. While hopes of a soft landing for the economy have grown in recent months, companies are still looking to trim costs amid uncertainty around the trajectory of interest rate cuts by the U.S. Federal Reserve. Crypto Crescendo Coinbase Global (COIN) posted its first quarterly profit in two years as trading surged on a new wave of optimism about digital assets. The largest US cryptocurrency exchange earned $273 million in profits during the fourth quarter which lifted its full-year result to a net profit of $95 million. The surprising performance is on the back of attracting more traders to its platform and more clients for its subscription and services business. SpaceX State Shuffle SpaceX CEO Elon Musk has announced that the company converted its registration state from Delaware to Texas after a court in Delaware voided his $56 billion compensation package at Tesla. \"SpaceX has moved its state of incorporation from Delaware to Texas! If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible,\" Musk wrote in a post on X (formerly Twitter). Paramount Paradox Warren Buffett's Berkshire Hathaway, sold approximately 30.4 million shares of its Paramount Global investment in Q4, marking a 32 percent decrease from the previous quarter's holding of about 93.7 million shares. Berkshire Hathaway's stake in Paramount now stands at over 63.3 million shares, valued at $936.5 million. Rate Roulette The People’s Bank of China is likely to keep cash conditions and monetary policy broadly stable as policymakers focus on a weakening currency. China's central bank will leave the rate on its one-year policy loans — called the medium-term lending facility — steady at 2.5 percent, according to the median estimate in a Bloomberg survey of analysts. Tech wars Apple Inc is close to completing a significant new software tool designed for app developers, intensifying its rivalry with Microsoft. Over the past year, Apple has been working on this tool as part of the forthcoming major version of Xcode, its flagship programming software. With internal testing of the features expanded and development accelerated, the tech giant aims to launch it to third-party software makers as early as this year, reported Bloomberg. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}