{
    "title": "Returns On Capital Are A Standout For Microsoft (NASDAQ:MSFT)",
    "date": "2/29/2024",
    "url": "https://finance.yahoo.com/news/returns-capital-standout-microsoft-nasdaq-120015367.html",
    "text": "Finding a business that has the potential to grow substantially is not easy, but it is possible if we look at a few key financial metrics. Typically, we'll want to notice a trend of growing return on capital employed (ROCE) and alongside that, an expanding base of capital employed. Basically this means that a company has profitable initiatives that it can continue to reinvest in, which is a trait of a compounding machine. With that in mind, the ROCE of Microsoft (NASDAQ:MSFT) looks great, so lets see what the trend can tell us. If you haven't worked with ROCE before, it measures the 'return' (pre-tax profit) a company generates from capital employed in its business. The formula for this calculation on Microsoft is: Return on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities) 0.29 = US$101b ÷ (US$471b - US$121b) (Based on the trailing twelve months to December 2023). Therefore, Microsoft has an ROCE of 29%. That's a fantastic return and not only that, it outpaces the average of 7.6% earned by companies in a similar industry. See our latest analysis for Microsoft Above you can see how the current ROCE for Microsoft compares to its prior returns on capital, but there's only so much you can tell from the past. If you'd like to see what analysts are forecasting going forward, you should check out our free analyst report for Microsoft . Microsoft is displaying some positive trends. The data shows that returns on capital have increased substantially over the last five years to 29%. The amount of capital employed has increased too, by 68%. This can indicate that there's plenty of opportunities to invest capital internally and at ever higher rates, a combination that's common among multi-baggers. A company that is growing its returns on capital and can consistently reinvest in itself is a highly sought after trait, and that's what Microsoft has. And a remarkable 283% total return over the last five years tells us that investors are expecting more good things to come in the future. With that being said, we still think the promising fundamentals mean the company deserves some further due diligence. Microsoft does have some risks though, and we've spotted   1 warning sign for Microsoft  that you might be interested in. If you'd like to see other companies earning high returns, check out our free list of companies earning high returns with solid balance sheets here. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}