{
    "title": "Microsoft to build new high-tech data centre in South Africa",
    "date": "2/7/2024",
    "url": "https://technext24.com/2024/02/07/microsoft-build-new-data-centre-africa/",
    "text": "Microsoft has unveiled its plan to construct a state-of-the-art data centre campus in Kosmosdal, Centurion in South Africa. This investment in technology infrastructure will solidify the big tech company’s commitment to advancing data management capabilities. According to the tech company, “Still in the early phases of development, Microsoft aims to build out its cloud infrastructure in new areas of South Africa to meet growing demand from public sector and private organisations for cloud and AI services and solutions in Africa,” The company added that it is looking forward to working with the municipality, local organisations, and the residents of Kosmosdal as it develops the data centre plans in a sustainable way. In a report by Broadband, Microsoft was said to be the second “hyperscaler” to officially launch cloud computing services in South Africa after delaying the launch of its local Azure nodes several times. Due to this, Huawei surpassed them by a day. Microsoft formally inaugurated data centres in South Africa in March 2019, located in Johannesburg and Cape Town. Azure Availability Zones were introduced in the South Africa North region by Microsoft in October 2021. The company affirmed its 30-year presence in South Africa, expressing dedication to expediting technology transformation, and digital empowerment and making substantial investments in infrastructure, innovation, skills, and enterprise development for the benefit of all South Africans. According to the Bill Gate-founded company, “This campus for data centres signifies the subsequent phase in Microsoft’s dedication to fostering and hastening the pace of digital transformation in South Africa and across the African continent, ensuring inclusivity, trustworthiness, and responsibility in its approach.” Read More: Microsoft hires former OpenAI executives Sam Altman and Greg Brockman to lead advanced AI team In September 2023, TechNext reported that Microsoft was considering an investment of at least $1 billion in South Africa, with plans to potentially power its data centres using nuclear energy. The company posted a job listing for a Principal Program Manager for Nuclear Technology, suggesting a focus on integrating controversial nuclear energy into future data centres. The successful candidate was expected to oversee the development and implementation of a global Small Modular Reactor (SMR) and microreactor energy strategy. According to the job listing spotted by CNBC, Microsoft’s potential move aligns with exploring the use of small nuclear power plants, with an estimated cost of around $1 billion. Such plants could have the capacity to power approximately 300,000 homes, but costs might escalate to as much as $6.8 billion depending on the nuclear reactor’s capacity. If realized, Microsoft could be allocating between $1 billion to $6.8 billion to each country hosting its data centres. This undertaking is prominent, considering the company’s vast network of over 200 data centres across 35 countries worldwide. Notably, South Africa stands as the sole African country housing Microsoft’s data centres, with two facilities in Johannesburg and Cape Town. Before last year September, the company had earlier announced the general availability of Dynamics 365 and the Power platform at its enterprise-grade data centres in Johannesburg and Cape Town. The company emphasized it to be a testament to its commitment to investing in South Africa. During an online press conference, Microsoft highlighted that this step would enhance cloud capacity and capabilities, facilitating faster growth for organizations. The South African data centres began offering Azure, Microsoft 365, Dynamics 365, and Power Platform online services to support various organizations. Additionally, Microsoft pointed out that Power Platform, a low-code/no-code solution, enables individuals within an organization to swiftly build custom solutions without extensive reliance on IT resources. Karin Jones, Microsoft South Africa Director of Business Applications GTM, mentioned that leaders in organizations are actively seeking digital solutions to enhance innovation flow across businesses, breaking down silos between data sources, people, processes, and insights. She highlighted the significance of these cloud services being delivered from South Africa, enabling local companies to securely move their businesses to the cloud while adhering to data residency, sovereignty, and compliance requirements. Microsoft’s announcement coincided with Google’s launching of a new Google Cloud region in South Africa. This followed the footsteps of Amazon Web Services (AWS) and Microsoft Azure, both of which had previously invested in significant cloud infrastructure and data centres in the country. Microsoft Azure established data centres in Johannesburg and Cape Town in March 2019, making it the first global provider to do so. AWS launched its Africa Region in Cape Town in April 2020. Karin Jones noted the growing recognition of cloud value in South Africa, citing the State of Cybersecurity in South Africa report, which revealed that nearly half (48%) of organizations in the country were utilizing the cloud as a platform and driver of digital innovation. Furthermore, 61% of South African organizations reported increased spending on cloud solutions in 2021 compared to 2020. Read More: Microsoft could be investing $1bn in South Africa with nuclear-powered data centre plans Get the best of Africa’s daily tech to your inbox – first thing every morning.Join the community now! Thanks for subscribing to Technext Newsletter  If you’d like to get featured on our Entrepreneur Spotlight, click here to share your startup story with us. Get the best of Africa’s daily tech to your inbox – first thing every morning.Join the community now! Thanks for subscribing to Technext Newsletter  Get the best of Africa’s daily tech to your inbox – first thing every morning.Join the community now! Thanks for subscribing to Technext Newsletter  "
}