{
    "title": "Investors punish Microsoft, Alphabet as AI returns fall short of lofty \nexpectations",
    "date": "2/1/2024",
    "url": "https://tribune.com.pk/story/2455121/investors-punish-microsoft-alphabet-as-ai-returns-fall-short-of-lofty-expectations",
    "text": "As customers lap at generative AI products, tech giants unable to satiate investors who expect big boost in sales Tech giants on Tuesday talked up how customers are lapping up their generative AI-powered products, but mounting costs of developing the cutting-edge features irked investors hoping for a big boost to sales from the new technology. Shares of Alphabet closed 7.5% lower, while those of Microsoft fell 2.7%, bringing down heavyweight tech stocks including Apple, Meta and Amazon. Both Microsoft and Alphabet reported generous increases to their cloud revenue in the December quarter, beating Wall Street estimates, as customers lined up to test new AI features and build their own AI services. But costs surged as well, highlighting the heavy investments these companies are making in servers, data centers and research as they compete fiercely for new customer dollars. This hurt investor expectations that were fueled by the promise of AI, which powered a stock rally to record highs in recent months. \"A lofty valuation means even the slightest hint of disappointment will be seized on by investors, and Microsoft's guidance for revenue growth in its cloud division to slacken a little in the current quarter was enough to see the shares dip modestly,\" said Russ Mould, investment director at AJ Bell. Gene Munster, a managing partner at Deepwater Asset Management, said he is looking for more from his firm's stakes in Alphabet and Microsoft. \"Investors want to see more contribution from AI,\" he said about Alphabet. \"Microsoft is still nascent, but showing some AI uptick.\" Alphabet's shares, which rose 58% in 2023, were trading at 22.26 times expected earnings, compared with a forward PE of 33.09 for Microsoft, 22.46 for Meta, 42.60 for Amazon and 27.73 for Apple.  \"The only problem here is that Google reported earnings the same night as Microsoft ... (it is) hard to get that AI multiple pixie dust if larger cloud players are growing faster off of larger revenues,\" Bernstein analysts wrote in a note. Google and Microsoft's stock drop wiped off about $140 billion and $80 billion in their market value, respectively. Shares of chipmaker AMD, which boosted its 2024 forecast for AI processors to $3.5 billion on Tuesday, fell 2.5%. Analysts had previously expected AMD to sell $4 billion to $8 billion worth of AI chips, said Summit Insights analyst Kinngai Chan, adding the stock's valuation is also pegged to those figures. Alphabet's capital expenditure in the reported quarter shot up 45% to $11 billion. Meanwhile, Chief Financial Officer Ruth Porat said spending would be notably larger this year than 2023.  Microsoft also reported a 69% jump in capital expenditure to $11.5 billion and said it expects the metric to \"increase materially\" on a sequential basis. \"By providing a positive outlook ... (Microsoft) gave investors just enough to justify the current share price, but will need to continue to deliver on its growth trajectory in order to justify an even higher share price,\" said Gil Luria, analyst at D.A. Davidson. Luria expects Microsoft to still be able to increase margins based on keeping its overall headcount relatively flat, and investments to come back down next year once Microsoft has enough data center capacity to meet demand.  COMMENTS \n\n\n\n\nReplying to \nX\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSaved ! Your comment will be displayed after the approval.\n\n\nError !\n\n\nError! Invalid Email.\n\n\n\nComments are moderated and generally will be posted if they are on-topic and not abusive. \nFor more information, please see our Comments FAQ Comments are moderated and generally will be posted if they are on-topic and not abusive. For more information, please see our Comments FAQ 104 K UN Secretary-General Calls for Humanitarian Ceasefire in Gaza at Rafah Crossing Visit Pakistan Day Honors: Celebrities Shine at Presidential Civil Awards Ceremony Putin Suggests Ukrainian Involvement in Moscow Concert Attack At Least 133 Killed in Moscow Concert Shooting Tragedy President Zardari Honors Saudi Defense Minister with Nishan-e-Pakistan Award Russia and China veto US call for Gaza ceasefire AOC Calls for Action Against Gaza Famine in US Senate Address Pak Army Showcases Parade in Islamabad for Pakistan Day Celebrations Princess Kate Middleton Reveals Her Cancer Battle Ye urges music industry to shun his 'slave name' Kanye West Bureaucratic upheaval expected in K-P Russians lower flags in mourning, suspects charged in deadly concert-hall attack Court issues Imran, Bushra’s production orders for April 4 Kim Kardashian faces backlash, calls for apology over Kate Middleton post Drake Bell calls out Nickelodeon's 'empty' response to 'Quiet on Set’ Makeup Mastery Revolutionising Runways From Disorder to Tranquillity: The Art of Minimalist Living ڈرائیور کے موڈ کے مطابق گاڑیوں میں تبدیل ہونے والی لائٹ شمسی پینل ٹیکنالوجی میں اہم پیش رفت ایپل نے صارفین کے لیے نئی سیکیورٹی اپ ڈیٹ جاری کردی جرمنی میں قدیم تدفینی ٹیلے دریافت ایمازون میں قدیم ترین ڈولفن کی باقیات دریافت بڑھتے برقی کچرے سے دنیا کو شدید مسائل کا سامنا Losers emerge victorious in recount Govt to offer OGDCL shares to Gulf investors Two PTI leaders accused of misusing $2m party donations for ‘anti-state propaganda’ National Day: Iran’s Azadi Tower dazzles with Pakistani colours EASA clearance to sweeten PIA sell-off FM says govt to ‘seriously’ consider reviving trade with India Fall of religio-political parties in Feb 8 vote Will AI benefit humanity or destroy it? Pakistan, Afghanistan impasse Writer, punctuation and style Putin reelected president; will Biden survive? Can we stay out of space? This material may not be published, broadcast, rewritten,\nredistributed or derived from. Unless otherwise stated, all content is\ncopyrighted © 2024 The Express Tribune. "
}