{
    "title": "Microsoft Chooses South Wales to Receive Part of £2.5 Billion Data Centre \nInvestment",
    "date": "2/20/2024",
    "url": "https://newsfromwales.co.uk/microsoft-chooses-south-wales-to-receive-part-of-2-5-billion-data-centre-investment/",
    "text": "News from Wales Wales Community and Business News from Need To See it News from Wales As technology develops, there is a never-ending need for advanced infrastructure to keep it running smoothly. That’s why Microsoft is making significant investments into new AI data centres that will power the tech of the future. Now they have chosen South Wales as the recipient of a significant £2.5 billion investment. Microsoft’s new investment is the largest the UK has seen since the 1980s, with the Cardiff area earmarked to receive a substantial portion of it. It aims to get ahead of a predicted spike in demand for AI tools, as the technology behind them advances and gets more mainstream exposure. This will be achieved with data centres, which are needed to house and compute digital tools. They’re also vital for website management, another exploding sector as more businesses make their way online. Some British industries like iGaming rely on data centres to house their websites, for example. Meanwhile, internet services continue to grow, partly through the use of promotions. This is best seen with Betfair’s latest casino offers where free spins are offered to new users, alongside other bonuses. As those services grow, they also need more server rooms to accommodate increasing data requirements, or at least novel ways to process that data more efficiently. Microsoft has a similar goal with this new round of investment, seeding proprietary data centres across the UK to future-proof its AI and cloud services. Microsoft’s £2.5 billion investment plan aims at three crucial areas in the UK. The first is London, a predictable target for companies looking to invest in British infrastructure. The government in London has launched initiatives like Smarter London Together and Digital Access for All, both aimed at upgrading the capital’s infrastructure to become a smart city of the future while bringing economically deprived Londoners online. The other regions targeted by this investment plan are the north of England and the Cardiff Capital Region (CCR). The capital region spans more than just Cardiff, with Bridgend, Merthyr Tydfil, Newport, and Rhondda Cynon Taf included in the area. Compared to the south of England, both the north and parts of the CCR have fallen behind when it comes to internet infrastructure. Historically, this has been named as the digital divide by ONS. In recent years, both governmental and private sector efforts have been addressing it.  Photo by Callum Blacoe on Unsplash While much of the plan remains unclear, Newport is set to receive special attention from the investment plan. A 760,000-square-foot building at Imperial Park has been acquired by Microsoft, who will demolish it and construct two data centres instead. Over a hundred new jobs may be created by the new facility once it’s finished. These centres will store and distribute AI models, which are comprised of very large amounts of data. While Microsoft peddles a lot of AI technology, the 2023 boom in generative AI likely inspired this new round of investments. Generative AI functions using Large Language Models (LLMs) that can generate text and other content from prompts. You can find an in-depth explanation of LLMs on Amazon’s site, one of Microsoft’s biggest competitors in the AI space. Crucially, AI models grow over time as they are fed more data, meaning they can outgrow their data centre and make server operations even more costly. More details of Microsoft’s AI investment plan are to follow. Currently, the project should be finished in the next three years. — Header image: Photo by Tadas Sar on Unsplash https://newsfromwales.co.uk/say-no-to-20mph/ https://petitions.senedd.wales/petitions/245548 Check out our other news sites: To advertise on any of our sites please email premium@newsfromwales.co.uk For editorial enquiries, please submit news via the ‘submit your news’ link or enquire at news@newsfromwales.co.uk We would like to thank our image providers: Canva Storyblocks Deposit Photos Freepik Pixabay Pexels Unsplash As well as the many talented photographers, too many to mention, whose work is shared by storytellers and credited in the story.  The information provided by this news site is for general informational purposes only and is not intended to be a substitute for appropriate professional or legal advice. All information on the Site is provided in good faith, however we make no representation or warranty of any kind, express or implied, regarding the accuracy, adequacy, validity, reliability, availability or completeness of any information on the Site. Tumblr Terms and Conditions - Privacy Policy "
}