{
    "title": "Mistral AI Company Partnering with Microsoft: Who is the French Startup \nRivaling OpenAI?",
    "date": "2/27/2024",
    "url": "https://www.ccn.com/news/mistral-ai-microsoft-investment/",
    "text": "Mistral founder Arthur Mensch was committed to open-source AI until recently. Photo by Toby Melville - WPA Pool/Getty Images. Key Takeaways Nearly 5 years since Microsoft first invested in OpenAI to help fund its research into artificial general intelligence, the Big Tech firm shows no signs of slowing down its activity in the space. At just 15 million euros, Microsoft’s latest investment in Mistral AI is dwarfed by its now multi-billion dollar partnership with OpenAI. But don’t underestimate the French startup. Nor the deal’s potential value to Microsoft. Through its partnership with OpenAI, Microsoft secured access and distribution rights to some of the most valuable AI resources in the world. In a sector that moves as fast as AI, even that doesn’t guarantee the company’s ongoing relevance. Today, Large Language Models (LLMs) dominate, and thanks to OpenAI, Microsoft controls access to some of the most sought-after models on the market via Azure AI studio. But 2 emerging trends could potentially upset the status quo. Firstly, small language models are fast catching up with their larger peers. At the current pace of development, SLMs could soon be able to perform the same tasks as contemporary LLMs but at just a fraction of the financial and computational cost to users. Secondly, open-source models have emerged as viable rivals to OpenAI’s GPT family, offering developers unrestricted access to increasingly sophisticated AI capabilities for free. With a research focus on smaller, open-source language models, Mistral is everything OpenAI isn’t. As Mistral founder Arthur Mensch has previously discussed , the modern field of machine learning (ML) is built on open-source foundations and prior to the recent AI business boom, permissive licenses were the norm. 1. Who is Mistral? Mistral is a Paris-based AI startup who has released incredible open source LLM (Mistral 7B & Mixtral 8x7B) that gained popularity in the open source community. Mistral Medium with 32k is their commercial model which boasts comparable performance to GPT-3.5 pic.twitter.com/SN2GxWxNAB — Min Choi (@minchoi) February 26, 2024  However, referring to OpenAI’s ironically closed approach to distributing LLM services, he observed that “all of a sudden in 2020 with GPT-3, this tide reversed.” Founded in 2022, Mistral initially open-sourced all its AI models, which came in a range of small and medium sizes. However, that all changed on Monday with the launch of Mistral Large. As the name suggests, Mistral Large is an LLM. It is also not open source. Unlike previous Mistral products, the new AI system will be distributed to paying customers via –  you guessed it  – Microsoft Azure. Today, we are releasing Mistral Large, our latest model. Mistral Large is vastly superior to Mistral Medium, handles 32k tokens of context, and is natively fluent in English, French, Spanish, German, and Italian. We have also updated Mistral Small on our API to a model that is… pic.twitter.com/MO4m6UIJUV — Guillaume Lample (@GuillaumeLample) February 26, 2024  In other words, through its partnership with Mistral, Microsoft has added another LLM to its existing lineup, prevented a potential GPT rival from being offered for free and acquired a stake in the burgeoning SLM space. Not bad for 15 million euros. As well as making its first foray into the market for paid LLM services. Mistral also unveiled Le Chat, a new chatbot built on top of its large and small language models. Described as “a pedagogical and fun way to explore Mistral AI’s technology,” the new interface isn’t currently positioned as a rival to ChatGPT. Instead, Le Chat lets Mistral showcase how its underlying AI models function in a live environment. But if the French startup continues advancing its technology at the pace it has been, it may not be long before it stands shoulder-to-shoulder with more established AI giants. With Microsoft controlling access to a growing number of AI models, its deal with Mistral is already facing scrutiny from the EU’s antitrust authorities. Even before the latest announcement, the European Commission had already opened an antitrust probe into Microsoft’s relationship with OpenAI. Following similar investigations by the Federal Trade Commission and the UK’s Competitions and Markets Authority, the Commission is looking into whether the Microsoft-OpenAI partnership stifles competition in the AI market. According to Bloomberg , the antitrust probe will now consider the firm’s investment in Mistral too. The issue is especially sensitive given the role startups like Mistral played during negotiations over the EU’s AI Act, when the French government pushed for exemptions to protect the interests of European AI developers. This is a mind-blowing announcement. Mistral AI, the French company that has been fighting tooth and nail to water down the #AIAct 's foundation model rules, is partnering up with Microsoft. So much for 'give us a fighting chance against Big Tech'. A 🧵1/8https://t.co/WJtKNkq1K8 — Luca Bertuzzi (@BertuzLuca) February 26, 2024  As quoted  by Reuters,  European Parliament member Kim van Sparrentak said that the argument for granting concessions to AI developers “seems to have been a front for American-influenced big tech lobby.” Commenting on the latest deal, she added that “the Act almost collapsed under the guise of no rules for ‘European champions’, and now look. European regulators have been played.” "
}