{
    "title": "Rising to the Challenge: This Aspiring \"Magnificent Seven\" Stock Is One to \nWatch in 2024",
    "date": "2/26/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/MSFT-Q/pressreleases/24348208/rising-to-the-challenge-this-aspiring-magnificent-seven-stock-is-one-to-watch-in-2024/",
    "text": "The \"Magnificent Seven\" stocks have been leading the stock market higher over the last couple of years. Without them -- and the ongoing frenzy for artificial intelligence (AI) investments -- Wall Street wouldn't be enjoying an official bull run yet. But this elite group doesn't come with a lifetime membership. Or, investors will eventually move on to a new market-moving club with a different set of members. The FANG and FAANG groupings used to be the gold standard, but Netflix dropped out while Apple, Tesla, Microsoft, and Nvidia(NASDAQ: NVDA) moved in. 60 years ago, there was the \"Nifty Fifty.\" And the paragons of industry in the Dow Jones Industrial Average(DJINDICES: ^DJI) index are always on a rolling schedule -- the current Dow only has 17 names in common with the version you saw 20 years ago. Image source: Getty Images. I would posit that the \"Magnificent Seven\" won't be the hot ticket forever, either. Tesla seems to be slipping away while a hungry bunch of potential next-level winners are gaining ground. On that note, it won't surprise me if Advanced Micro Devices(NASDAQ: AMD) punches a ticket to the next era-defining league of Wall Street's crown jewels. Yes, I expect the unstoppable AI trend to promote another name into the sequel. Let me explain why AMD might belong in the \"Return of the Seven.\" If Nvidia is the king of AI hardware, I think of AMD as the crown prince. And the kid looks hungry for a higher status over time. For instance, let's look at the world's largest and most powerful supercomputers. Many of these big-iron systems are hard at work training AI engines right now, with a heavy focus on the generative AI back-ends used in tools like ChatGPT or DALL-E 3. In the latest top-ten list, six systems rely on Nvidia's AI accelerator chips in the A100 and H100 series. But AMD's Instinct MI250X serves the same purpose in two of the ten largest number-crunching systems -- including the top spot. So AMD has some catching up to do in terms of broad market wins, but the company can compete at the highest level. Moreover, Nvidia's AI accelerator chips reportedly cost about four times as much as a comparable AMD solution. It's not surprising to see heavyweight generative AI system builders such as Hewlett Packard Enterprise(NYSE: HPE) and Super Micro Computer(NASDAQ: SMCI) offering both Nvidia H100 and AMD Instinct solutions side by side. I'm sure their hyperscale customers are clamoring for the most cost-effective AI computing options, and AMD has certainly earned a spot in that discussion. So AMD undercuts Nvidia's pricing without sacrificing AI-crunching performance. On top of that, the company runs a diverse and flexible business with several potential game-changers in its product portfolio. AMD offers everything from PC and server processors to AI accelerators and custom embedded chips. The $35 billion Xilinx buyout made AMD a giant of custom semiconductors with a heavy interest in industrial automation and defense systems. I'm not throwing mighty Nvidia under the bus here, just pointing out that AMD is a robust competitor in many ways and actually superior in a few fields. Sure, Nvidia's annual revenues are about twice the size of AMD's and its profit margins are wider overall, but I think it's unfair to give Nvidia a $2 trillion market cap while AMD is stuck at \"just\" $295 billion. The financial gap is nowhere near that large, and AMD should pose a stronger challenge to Nvidia's AI dominance over time. Even if AMD never takes Nvidia's AI throne, investors could see massive returns from a milder reshuffling of the booming AI industry's power balance. AMD is not just rising to the challenge but is also setting the stage for a seismic shift in the dynamics of Wall Street's elite. The perennial underdog of the PC processor wars has come a long way under resourceful CEO Lisa Su. The chip designer stands out as a stock to watch in 2024 and beyond, and I think it deserves consideration for membership in the next \"Magnificent Seven\" or FAANG club. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Advanced Micro Devices made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks  *Stock Advisor returns as of February 20, 2024  Anders Bylund has positions in Netflix and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Microsoft, Netflix, Nvidia, and Tesla. The Motley Fool recommends Super Micro Computer and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Microsoft Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}