{
    "title": "Microsoft Teams suffers global outage, slowly recovers",
    "date": "1/27/2024",
    "url": "https://www.businesstoday.in/technology/news/story/microsoft-teams-suffers-global-outage-slowly-recovers-415042-2024-01-27",
    "text": "Feedback Microsoft Teams, a popular communication platform used by millions worldwide, grappled with a widespread outage across various regions, causing disruptions to users' workflow. The outage, which commenced on Friday evening, persisted into the early hours of Saturday, affecting numerous functionalities within the application. Reports flooded in via DownDetector, indicating a significant surge in problems encountered by Teams users. The disruption encompassed issues such as login failures, missing messages, absent attachments, and noticeable delays, amplifying frustration among affected individuals. Microsoft swiftly attributed the outage to a networking glitch that impeded a portion of the Teams service. In response, the company initiated failovers in an attempt to rectify the situation. While these measures yielded \"significant improvements or full remediation in many of the Teams features affected by this incident\" after several hours, some users in North and South America continued to experience persistent difficulties despite the failover operations. In a statement released on Saturday, Microsoft assured users that they were diligently monitoring the situation and actively addressing any lingering impact scenarios associated with the outage. The company emphasised ongoing efforts to optimise its network and backend services, aiming to minimise disruptions and enhance overall service reliability. “Our network and backend service optimisation efforts are ongoing, and we’re monitoring positive internal telemetry signals to confirm that our mitigations are effectively reducing the impact to customers,” said the company in a statement. This recent outage marks another significant disruption for Microsoft Teams, following a four-hour outage experienced exactly a year ago. We apologize for the inconvenience; our engineering team is aware and actively working to resolve the current Teams outage. Additional updates can be found in the admin portal under TM710344 or posted to https://t.co/LRg6AIcXd5. Also Read Microsoft Mesh unveiled: A virtual meeting platform on Teams Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}