{
    "title": "Microsoft to add big bucks on AI: Wedbush (MSFT)",
    "date": "1/17/2024",
    "url": "https://seekingalpha.com/news/4053553-microsoft-add-big-bucks-ai",
    "text": "Alexander Koerner Microsoft (NASDAQ:MSFT) annual sales will jump nearly 12% in 2025 thanks to artificial intelligence, Wedbush said. Based on recent work in the field, Wedbush sees more than 60% of Microsoft's installed base using AI over the next three years. Use cases are going to be rolled out over the next three to six months. \"We believe the stock still has yet to price in what we view as the next wave of cloud and AI growth coming to the Redmond story in FY24 with a strong competitive cloud edge vs. Amazon (AMZN) and Google (GOOG) (GOOGL),\" Dan Ives and his team wrote in a note. \"Our recent partner checks have been incrementally strong around Co-Pilot deployments with MSFT customers...we estimate this could add another ~$25 billion to Redmond's top-line by FY25.\" Microsoft is set to report fiscal second-quarter results on Jan. 30 after the close of trading. A consensus of analysts expect the company to earn $2.76 per share on $61.05B in revenue. Concerns over high valuations and fears of recession have Wall Street looking to guidance for 2024 and fourth quarter earnings to gauge demand. \"Our recent checks in the field shows an uptick in demand around enterprise software, cyber security, and a clear surge in demand around major AI projects and use cases exploding for 2024,\" the bank said, noting that despite some recent weakness, overall there is less caution coming from companies. Microsoft and Nvidia (NVDA) are leading the AI revolution and demand of an unprecedented nature is poised to explode. The two companies, along with Google, Datadog (DDOG) and Palantir (PLTR) are showing that AI use cases are multiplying across the enterprise and consumer landscape, Ives and team wrote. \"While the bears will continue to fret about tech valuations, we believe Street numbers (and valuations) for 24/25 will move higher as this AI spending tidal wave hits the tech industry,\" the analysts said. "
}