{
    "title": "Microsoft to lay off 1900 Activision Blizzard, Xbox staff",
    "date": "1/25/2024",
    "url": "https://www.oann.com/tech/microsoft-to-lay-off-1900-activision-blizzard-xbox-staff/",
    "text": "January 25, 2024 – 11:13 AM PST (Reuters) – Microsoft (MSFT.O) will let go of 1,900 employees at Activision Blizzard and Xbox this week, it said on Thursday, the latest cuts in the technology sector that has extended massive layoffs over the past years into 2024.  The cuts represent about 8% of the overall Microsoft Gaming division and will mostly happen at Activision Blizzard. Blizzard President Mike Ybarra and Chief Design Officer Allen Adham are also leaving the company, while a previously announced survival game by Blizzard has been canceled, Microsoft said. The news comes months after Microsoft closed its $69 billion deal for Activision Blizzard, boosting its heft in the videogaming market with best-selling titles, including “Call of Duty”, to better compete with industry leader Sony. “Microsoft’s announcement that it will be laying off 1,900 video game workers makes clear that, even when you work at a successful company in an extremely profitable industry, your livelihood is not protected without a voice on the job,” Communications Workers of America (CWA) said. “We will continue to support workers at Microsoft and across the video game industry who want to have a union voice on the job,” it added. Several other big firms such as Alphabet (GOOGL.O), Amazon.com (AMZN.O) and ebay (EBAY.O) have also laid off thousands of staff in recent weeks to lower costs and boost profitability. Overall, more than 21,000 workers have been let go of in 76 tech companies in January, according to tracking website Layoffs.fyi. The tech sector shed 168,032 jobs in 2023 and accounted for the highest number of layoffs across industries, according to a report by Challenger, Gray and Christmas earlier this month. That included more than 10,000 cuts at Microsoft. Analysts and industry experts have said they expect fewer layoffs this year, with firms that are racing to catch up in the AI space more likely to downsize to offset the billions of dollars they are spending on the technology. The Verge was the first to report the news on the latest job cuts by Microsoft. Reporting by Aditya Soni and Akash Sriram in Bengaluru; Additional reporting by Samrhitha Arunasalam; Editing by Devika Syamnath, Arun Koyyur and Krishna Chandra Eluri  Share this post!   ISIS reportedly claims responsibility for the attack at Crocus City Hall near Moscow, The House passes a continuing resolution, and MTG files a motion to vacate against Mike Johnson. Chino Valley Unified School Board’s President Sonja Shaw who is fighting for parental rights is being assaulted by the left for standing up for parents. President Biden’s sexual assault accuser Tara Reade has filed a request to testify in front of Congress. New York Attorney General urges the appeals court to compel Trump to pay the full bond by Monday. Trump said he has over half a billion dollars in cash that he intends to use for his campaign. The U.S. government’s antitrust lawsuit against Apple draws on the watershed 1998 case that broke Microsoft’s stranglehold on desktop software. Reddit’s shares jumped in their debut, signaling that investor appetite for IPOs of promising yet loss-making companies could be returning. The U.S. Department of Justice and 15 states sued Apple, alleging it drove up prices for its services and hurt smaller rivals. Social media platform Reddit geared up for its high-profile market debut on the New York Stock Exchange. Advertisement Accessibility Tools "
}