{
    "title": "Microsoft and others are making new tools to help small businesses \ncapitalize on A.I.",
    "date": "1/23/2024",
    "url": "https://apnews.com/article/small-business-ai-microsoft-copilot-chatgpt-0c357ab978ecb87329339f95ebfbf201",
    "text": "Copyright 2024 The Associated Press. All Rights Reserved. The Microsoft logo is displayed at an event at the Chatham House think tank in London, Monday, Jan. 15, 2024. Microsoft’s Copilot lets users ask software to perform tasks like summarize an email or a Teams meeting, come up with key themes in a document, or draft emails in a conversational tone in Outlook.(AP Photo/Kin Cheung) NEW YORK (AP) — The influx of generative artificial intelligence software is transforming small businesses. Small business owners are using A.I. tools like OpenAI’s ChatGPT, Google’s Bard and others to check grammar in emails, punch up marketing copy and research business plans. What’s more, bigger companies are developing tools specifically to help small businesses integrate A.I. into their operations in more advanced ways. AP correspondent Mae Anderson reports on this week’s Small Business Monitor. Microsoft’s Copilot lets users ask software to perform tasks like summarize an email or a Teams meeting, come up with key themes in a document, or draft emails in a conversational tone in Outlook. The service, which costs $30-a-month per employee, was recently expanded from companies with at least 300 employees to all companies, so smaller businesses — even “solopreneurs” with no employees — can use Copilot for Microsoft 365. Meanwhile, MasterCard is piloting a product called MasterCard Small Business A.I., aimed at helping small business owners analyze data and offer other resources to help grow their business. It uses information from MasterCard’s content library as well as information licensed from media companies focused on inclusivity, including digital media company Blavity Media Group and Spanish-language media company TelevisaUnivision, to answer small business owners’ queries. Mastercard plans to pilot the tool in the U.S. later this year, with international markets to follow. Copyright 2024 The Associated Press. All Rights Reserved. "
}