{
    "title": "Microsoft replaces Apple as the world's most valuable company",
    "date": "1/12/2024",
    "url": "https://www.editorji.com/business-news/microsoft-replaces-apple-as-the-world-s-most-valuable-company-1705055224638",
    "text": "Hong Kong equity market rebounds, regains 4th position as the largest market from India Border-Gavaskar Trophy between India and Australia extended to 5 Tests BJP president JP Nadda's wife's car stolen from Delhi's Govindpuri Public sector banks' dividend payout may exceed Rs 15,000 cr in FY24 Hardik batting at 7 was a collective decision, not his alone: Pollard Taapsee Pannu marries longtime boyfriend Mathias Boe in Udaipur, co-actor Pavail Gulati shares pic Paytm UPI transaction decline to persist until new customer addition Holi 2024: Combat post festive season weight gain with these detox tips Editorji News Desk Microsoft on Thursday replaced Apple as the most valuable company in the world. The tech giant has achieved this feat for the first time since 2021. The market capitalisation of the company has reached $2.87 trillion. Azure, Microsoft's cloud computing platform has become a dominant force challenging Amazon Web Services for market share. In the last quarter, Azure's revenue soared 40% year-over-year. Also Read: Apple's earnings boosting strategy; here's how the subtle price rise works Microsoft shares have also gotten a boost since last year after the company's early lead in generative artificial intelligence when it invested in ChatGPT-maker OpenAI. Meanwhile Apple's shares were 0.9% lower on Thursday. The company is also facing an antitrust case from the US Department of Justice. Foxconn has also seen its year-on-year decline in revenue. Analysts have also downgraded Apple's stock citing lacklustre iPhone15 sales in China. However, Apple has scope to recover from its losses as it is preparing to launch its next big product VisionPro. ADVERTISEMENT Microsoft replaces Apple as the world's most valuable company Hong Kong equity market rebounds, regains 4th position as the largest market from India Public sector banks' dividend payout may exceed Rs 15,000 cr in FY24 Paytm UPI transaction decline to persist until new customer addition India mulls replacing minimum wage with living wage by 2025 Gold, Silver Price Today March 25, 2024: Check Latest Rates in Mumbai, Delhi, Chennai, Bengaluru ADVERTISEMENT Gold, Silver Price Today March 13, 2024: Check Latest Rates in Mumbai, Delhi, Chennai, Bengaluru Formal job creation slows down in January, EPFO data reveals Goldman Sachs commences coverage on Metro Brands and Bata India Aviation regulator DGCA slaps Rs 80 lakh fine on Air India Zomato CEO Deepinder Goyal ties the knot with Mexican model-entrepreneur Munoz: Reports UBS expects Reliance Industries' share price to surge to this level... This summer, Indian airlines will operate more domestic flights than they did in 2023 Lok Sabha elections fever is boosting e-commerce sales: Here's how iPhone maker Apple loses $133 billion in market cap: Here's what went wrong SEBI directs Mutual Funds to halt inflows into overseas ETFs Editorji is a popular short video news and information platform based in India. It was founded in 2018 by Vikram Chandra, one of India’s leading journalists, and has risen to prominence in the digital news space in a relatively short span of time. The platform is primarily designed for mobile devices, with applications available for Android and iOS.  +91 11 4035 6666 / info@editorji.com 3rd floor, Plot B, Khasara no 360, Sultanpur, New Delhi, Delhi 110030 Send Feedback Contact Us "
}