{
    "title": "Microsoft briefly overtakes rival Apple as world's most valuable company",
    "date": "1/11/2024",
    "url": "https://news.sky.com/story/microsoft-briefly-overtakes-rival-apple-as-worlds-most-valuable-company-13046295",
    "text": "Apple and Microsoft are neck and neck - as AI investment starts paying off. Business reporter\n              @taaffems Thursday 11 January 2024 18:41, UK Two tech giants are battling it out for the title of the world's most valuable company. Microsoft had overtaken Apple for the first time since 2021 to become the world's most valuable firm by market capitalisation - which measures the value and number of a company's shares. Money latest:'Huge announcement' on car finance could see millions get payout Microsoft surpassed Apple at numerous points throughout Thursday's trading on the New York Stock Exchange (NYSE) when its value reached $2.87trn (£2.25trn) and Apple shares fell by 1%. But Apple reclaimed the top spot as the trading day wore on. This latest movement comes on the back of a major investment in artificial intelligence (AI) by Microsoft. It's the largest backer of OpenAI, the company behind the game-changing generative AI chatbot ChatGPT. US justice department sues Apple for 'having illegal monopoly on smartphones' Grandmother awarded £2.95m payout after SWAT team mistakenly raid her home based on 'Find My' phone data Apple fined £1.5bn for not notifying users of cheaper music streaming options Please use Chrome browser for a more accessible video player  AI is also being embedded into Microsoft products such as its Bing search engine. At the same time, Apple has faced concern over demand for iPhone sales, especially in the key China market. The long-time rivals have traded places as the world's most valuable firms before. During the COVID-19 pandemic, Microsoft was most valuable when the remote working boom boosted demand for its software. At the same time, Apple suffered from supply chain difficulties and COVID-related restrictions at its factories in China. It had warned about the delayed delivery of models as a result. Be the first to get Breaking News Install the Sky News app for free Apple had been in pole position since 2010 due to the success of the iPhone, which Microsoft struggled to compete with. The AI boom has been a boon for some company valuations, though, including Microsoft. Earlier this year a company that makes computer chips for AI, Nvidia, became the first chipmaker to be worth $1trn. © 2024 Sky UK "
}