{
    "title": "Europe probes Microsoft's €15M stake in AI upstart Mistral",
    "date": "2/28/2024",
    "url": "https://www.theregister.com/2024/02/28/eu_microsoft_mistral/",
    "text": "The European Commission is investigating Microsoft's €15 million ($16.3 million) investment in French startup Mistral, which came just after the latter released a large language model to compete with OpenAI's ChatGPT. Founded in 2023 by researchers from Google DeepMind and Meta, Mistral has raised over €385 million ($417.1 million) from investors such as Andreessen Horowitz and Lightspeed. The upstart is valued at around €1.8 billion ($2 billion) today. On Monday, Mistral announced its latest and most powerful large language model, Mistral Large, and released a web app netizens can use to experiment with a chatbot powered by the model. It also put out a smaller model, Mistral Small, which - as the name suggests - is optimized to be faster and more compact. Mistral has previously shared other models, such as its seven-billion parameter Mistral-7B in September. To give developers more access to its technology, Mistral also revealed it partnered with Microsoft to bring its open and commercial models to Azure. In return, Microsoft will support Mistral by providing it with hardware and infrastructure from its cloud computing platform to train and run its future systems. Mistral co-founder and CEO Arthur Mensch offered enthusiastic endorsement of the deal in a Microsoft statement that outlined a shared enthusiasm for \"impactful progress in the AI industry and delivering unparalleled value to our customers and partners globally.\" It is not uncommon for cloud providers to invest in AI startups and for those deals to involve access to cloudy infrastructure. Microsoft has invested $13 billion into OpenAI, while Google and Amazon Web Services have invested heavily into Anthropic. But Mistral's deal has attracted the attention of EU regulators These deals are a win-win for both parties. Hosting the latest large language models drives more business to cloud platforms, while startups need large clusters of GPUs to develop new models. The European Commission, however, is wary that AI mergers with Big Tech could consolidate power and crush innovation, making it potentially more difficult to regulate the technology and for smaller companies to compete. \"The commission is looking into agreements that have been concluded between large digital market players and generative AI developers and providers,\" European Commission spokesperson Lea Zuber told Politico. \"In this context, we have received the mentioned agreement, which we will analyze.\" Last month, EU regulators launched an inquiry into Microsoft's stake in OpenAI. \"We are inviting businesses and experts to tell us about any competition issues that they may perceive in these industries, whilst also closely monitoring AI partnerships to ensure they do not unduly distort market dynamics,\" Margrethe Vestager, executive vice-president in charge of competition policy for the European Commission, declared in a statement. The commission has agreed on the wording of an AI Act – a sweeping plan to enforce rules for AIs based on the risks each represents. Generative AI models like Mistral Large or ChatGPT are considered as \"high-impact general-purpose\" systems that might pose \"systemic risk\". Developers will be required to disclose the source of their training data and design guardrails to prevent them producing worrisome content. The Register has asked Microsoft and Mistral for comment. ® Send us news The Register   Biting the hand that feeds IT Copyright. All rights reserved © 1998–2024 "
}