{
    "title": "Microsoft announces $2.1bn AI infrastructure investment in Spain",
    "date": "2/20/2024",
    "url": "https://www.verdict.co.uk/microsoft-announces-2-1bn-ai-infrastructure-investment-in-spain/",
    "text": "Microsoft President Brad Smith said the AI investment in Spain is beyond “just building data centers”. Microsoft has announced it will expand its AI and cloud infrastructure in Spain through an investment of $2.1bn (€1.9bn) over the next two years. In a post on X, Microsoft Vice Chair and President Brad Smith said the AI investment in Spain is beyond “just building data centers”. The gold standard of business intelligence. Find out more “It’s a testament to our 37-year commitment to Spain, its security, and development and digital transformation of its government, businesses, and people,” Smith said. The move follows the US tech giant’s announcement of $3.45bn in AI investment in Germany, as the company looks to gain a competitive edge in the emerging technology across Europe. The value of AI deals grew in 2023 but peaked in 2020, according to GlobalData’s Deal Database. In 2023, the value of AI deals in Spain totalled $1.3bn, a substantial increase over 2022 which totalled $751m. Access the most comprehensive Company Profiles\n            on the market, powered by GlobalData. Save hours of research. Gain competitive edge. Your download email will arrive shortly We are confident about the\n                        unique\n                        quality of our Company Profiles. However, we want you to make the most\n                        beneficial\n                        decision for your business, so we offer a free sample that you can download by\n                        submitting the below form Deals in Spain peaked in 2020 with a total value of $1.9bn, which marked a huge increase from the year prior which saw AI deals total just $110m. According to GlobalData forecasts, the total AI market, including software, hardware, and services, will be worth $383.3bn in 2030, having grown at a compound annual growth rate (CAGR) of 21.4% from $81.3bn in 2022. The global specialized AI applications market will be worth $146bn in 2030, up from $31.1bn in 2022 at a CAGR of 21.3%.  Give your business an edge with our leading industry insights. The gold standard of business intelligence. Find out more Give your business an edge with our leading industry insights. Give your business an edge with our leading industry insights.  Thematic Take (monthly) I consent to Verdict Media Limited collecting my details provided via this form in accordance with  Privacy Policy View all newsletters from across the GlobalData Media network. Decrypting the latest technology news Powered by © Verdict Media Limited 2024 "
}