{
    "title": "Microsoft isn't disabling computers for 'non-mainstream content' | \nverifythis.com",
    "date": "2/9/2024",
    "url": "https://www.verifythis.com/article/news/verify/technology-verify/microsoft-disabling-computers-non-mainstream-content-false/536-473878fb-7dd4-43eb-abdc-308f058b0fd7",
    "text": "Tech leaders have been talking about their planned efforts to curb the abuse of artificial intelligence and the spread of misinformation on their platforms ahead of the 2024 presidential election. Some people claim such efforts could amount to censorship. A post on X viewed more than 1 million times shared a screenshot of an article with the headline: “Microsoft To Disable Computers of Users Who Share ‘Non-Mainstream Content’ Online.” The viral post claims Microsoft’s supposed plan is part of “an attempt to combat so-called ‘misinformation’ in the run-up to the 2024 election.” Since then, questions and information about this claim have become popular Google searches. Did Microsoft announce it would disable computers of people who share “non-mainstream content” online? No, Microsoft did not announce it would disable computers of people who share “non-mainstream content.” Microsoft has no plans to disable the computers of people who share certain content online. There is no evidence Microsoft ever suggested doing this, and the company denies they plan on doing it. \"No, there are no plans to disable any computers for users as described in these claims,” a Microsoft spokesperson told VERIFY. The false claim stems from the headline of an article on the digital media site The People’s Voice, which doesn't even say Microsoft will disable people’s computers, outside of the headline. The article is instead about an NBC interview with Microsoft CEO Satya Nadella in which Nadella talks about how Microsoft might detect misinformation such as deepfakes. The People’s Voice has been fact-checked previously for multiple stories with false headlines. The article itself is four paragraphs long, none of which mention disabling computers. The story references misinformation and disinformation, not “non-mainstream content.” The article also includes a link to a YouTube video posted by NBC News of an interview between Lester Holt and Microsoft CEO Satya Nadella. There is also no mention of disabling computers in that video clip. NBC posted a longer version of the same interview with Nadella in two parts on its website and there is no mention of disabling computers there either. Holt does ask Nadella a question about AI and misinformation in reference to the upcoming presidential election. Nadella talks about ways tech companies can detect AI and misinformation, but he doesn’t say anything about Microsoft or other tech companies policing it. VERIFY also could not find any announcement on Microsoft’s website suggesting it would disable computers based on the content people shared online. The VERIFY team works to separate fact from fiction so that you can understand what is true and false. Please consider subscribing to our daily newsletter, text alerts and our YouTube channel. You can also follow us on Snapchat, Instagram, Facebook and TikTok. Learn More » Text: 202-410-8808 "
}