{
    "title": "FWD Group amplifies AI strategy with extended Microsoft partnership",
    "date": "2/27/2024",
    "url": "https://www.insurancebusinessmag.com/asia/news/technology/fwd-group-amplifies-ai-strategy-with-extended-microsoft-partnership-478768.aspx",
    "text": "By\n                                Roxanne Libatique FWD Group Holdings Limited has revealed a strategic expansion of its partnership with tech giant Microsoft, solidifying a four-year deal focused on the integration of the latest in generative artificial intelligence technology. This agreement is a key part of FWD's ongoing commitment to a cloud-first approach, tapping into the capabilities of Microsoft's Azure OpenAI Service among other technological advancements. The extended collaboration with Microsoft is poised to strengthen FWD's initiative to pioneer generative AI projects, taking advantage of the enhanced AI models, as well as the robust networking, security, and monitoring features available through Microsoft Azure. The initiative aims to refine and improve various facets of FWD's operations, touching on client acquisition, marketing strategies, performance metrics for channels and agents, as well as processes for underwriting, claims, and overall customer service. Ryan Kim (pictured, left), group chief digital officer of FWD, underscored the significance of digital innovation in the company's mission to transform public perception of insurance across Asia's swiftly growing markets. “Digital innovation has always been core to FWD's vision of changing the way people feel about insurance. This collaboration marries FWD's pioneering spirit in Asia in some of the fastest growing insurance markets in the world, with the global scale and skill that Microsoft brings in engineering and AI,” he said. “We're excited to harness more next-generation innovations to develop new industry use cases and standards that we believe will shape the insurance journey of the future.” FWD has also adopted Microsoft 365 Copilot, an AI-driven tool designed to enhance employee productivity in their everyday tasks. “AI is driving transformation across the financial services industry, opening new opportunities for innovation and business growth with agility and at scale,” said Bill Borden (pictured, right), Microsoft corporate vice president of worldwide financial services. “We are thrilled to strengthen our AI partnership with FWD by offering Azure OpenAI Service and Copilot for Microsoft 365 capabilities to enable world-class customer experiences and operations securely and responsibly. “As a pivotal player in the global financial landscape, the Asia Pacific region stands out for its dynamism and adaptability, fostering continuous growth and driving innovation. We are committed to empowering our customers in the region with generative AI capabilities in a responsible way. With Microsoft's enterprise-grade AI advancements, we are helping the financial services ecosystem accelerate innovation to drive operational efficiency and greater value creation to customers.” Since initiating its AI journey in 2019, FWD has made significant strides, implementing nearly 200 active AI models across its operations, with more than 600 specific applications, marking a significant leap towards its goal of technological and operational excellence. In other news, FWD recently became the exclusive provider of life insurance products and protection solutions to Bank Simpanan Nasional customers.  "
}