{
    "title": "How Microsoft Power Platform is driving real-world impact—January customer \nsuccess stories",
    "date": "2/12/2024",
    "url": "https://www.microsoft.com/en-us/power-platform/blog/2024/02/12/how-microsoft-power-platform-is-driving-real-world-impact-january-customer-success-stories/",
    "text": "Industry leading organizations across the globe are using Microsoft Power Platform to build applications, automate business processes, and drive innovation. In our recent earnings call, we highlighted that there are more than 10,000 organizations already utilizing Microsoft Copilot Studio to craft tailored copilots. With more than 230,000 organizations that have already used AI capabilities within Microsoft Power Platform, the impact is tangible—from groundbreaking solutions to measurable outcomes, our customer stories demonstrate the transformative power of our technology in advancing their operations. We’re excited to showcase some of the inspiring stories published in January, illustrating how our products are making a meaningful impact. Our hope is to inspire you to build your next solution. If you’re already utilizing Microsoft Power Platform within your organization and would like to share your experience, we’d love to hear your story. Customer: Coca-Cola Beverages Vietnam Country: Vietnam Industry: Consumer Goods Coca-Cola Beverages Vietnam, a prominent bottler within the Coca-Cola global network, strategically adopted Microsoft Power Platform to enhance operational efficiency and elevate customer experiences. Led by Vice President & CIO Rahul Shinde, the company swiftly automated numerous business processes, including purchase orders, warehouse operations, and retail placement approvals, using Microsoft Power Automate and Microsoft Power Apps. With a network of digital champions spearheading the adoption of Microsoft Power Platform tools, Coca-Cola Vietnam successfully digitized more than 60 workflows within six months, empowering employees and realizing significant time savings. This agile approach aligns with the company’s vision to become the most digitally advanced consumer packaged goods company in Vietnam, demonstrating its commitment to innovation and continuous improvement through technology. “In just six months, our digital champions created 60 automated processes using Power Automate to digitize previously manual workflows.” See full story.  Customer: Nsure.com Country: USA Industry: Insurance Nsure.com, a licensed digital insurance agency, facilitates the purchase of home and auto insurance online across all 50 US states. Initially reliant on proprietary algorithms, Nsure.com turned to Microsoft Power Platform to automate processes as site traffic increased. Power Automate streamlined tasks like contacting customers for missing information, boosting agent efficiency, and allowing for rapid growth. Using generative AI, Nsure.com further optimized operations, reducing manual tasks by over 60% and associated costs by 50%. Notably, AI-driven solutions manage data from multiple carriers, extract information from insurance documents, and prioritize customer emails. With a fusion development approach and tools like Copilot in Power Automate, Nsure.com ensures rapid innovation and expansion. Future plans involve utilizing copilots for advanced customer interactions, enhancing analytical capabilities with Microsoft Power BI and Microsoft Azure services, and delivering a smarter, faster insurance buying experience. “Automation using [Microsoft] Power Platform has allowed us to grow rapidly, while maintaining high quality of service. We can sell many times more policies per agent in comparison to offline agencies.” See full story. Customer: Standard Bank of South Africa Country: South Africa Industry: Banking and Capital Markets Standard Bank, Africa’s largest bank, has harnessed Microsoft Power Platform since 2017 to create more than 1,500 solutions catering to diverse business requirements spanning finance, operations, and HR. Their journey began by recognizing the potential of Power Apps and Power Automate within its Microsoft 365 subscription, leading to transformative efficiencies. An early success story involved developing a mobile app for ATM inspections, showcasing the platform’s agility and impact. Establishing a Center of Excellence empowered more than 1,500 citizen developers worldwide to address complex business challenges creatively. Now, the bank is venturing into enterprise-level applications, integrating sensitive backend systems seamlessly. It aims to use emerging capabilities like generative AI in Microsoft Power Platform products, exemplified by its Technology Service Desk bot, Karabo. Standard Bank remains committed to nurturing innovation, with a keen focus on unlocking the limitless potential offered by Microsoft Power Platform and its AI capabilities. “With [Microsoft] Power Platform, we can make rapid changes and enhancements in an environment where business requirements change frequently.” —Richard Blackwell: Head, Employee Experience Engineering, SA Technology, Standard Bank of South Africa See full story.  Customer: City of Everett Country: USA Industry: Government The Total Economic Impact™ of Microsoft Power Platform Premium Capabilities The City of Everett, Washington, home to more than 115,000 people, overcame manual processes and disjointed systems by adopting Microsoft Power Platform. Using existing Microsoft 365 licenses, the city developed low-code/no-code applications tailored to various departments, led by employees. Power Apps streamlined data reporting, saving up to $120,000 in software costs. The initiative fostered a culture of innovation, transforming employees into proficient developers. Accelerated adoption across departments established a thriving low-code/no-code development community, enhancing efficiency and adaptability. Everett solidified its reputation as a leader in municipal progress, delivering cost-effective solutions to meet community needs. Future plans include extending Microsoft Power Platform solutions across departments, reinforcing the city’s commitment to innovation and community-driven solutions. “One of the ways you attract and retain talent is by providing tools like [Microsoft] Power Platform that can help staff develop these skills and do their best work. Part of our goals for next year is to continue to increase our maturity and grow our number of community leaders within the city.” See full story. Share your Microsoft Power Platform experience with us. Data shows Microsoft Power Platform improves business outcomes.  Accelerate innovation and reduce costs as you analyze data, automate processes, and build apps, websites, and virtual agents with Power Platform. "
}