{
    "title": "Microsoft Partner, HSO, Joins The Digital Revolution Awards",
    "date": "2/22/2024",
    "url": "https://finance.yahoo.com/news/microsoft-partner-hso-joins-digital-155500368.html",
    "text": "LONDON, February 22, 2024--(BUSINESS WIRE)--HSO, one of the world’s leading Microsoft partners, has been unveiled as the latest sponsor of the 2024 Digital Revolution Awards. The firm, which was also shortlisted for the 2023 event, has put its name behind the Tech for Good category. The award is open to individuals and organizations working with any cloud technology platform. With less than half (46%) of people believing that tech has delivered on its promise to do good, the category recognizes those using the power of cloud technology for the betterment of the world, whether that’s for an individual, humanitarian, or environmental cause. \"Innovation lies at the heart of what we do,\" said David Johnson, Operations Director at HSO. \"Recognizing those who are using the cloud to add genuine value on a human level is something we are incredibly passionate about and really wanted to get behind. We’re delighted to join the Digital Revolution Awards to help celebrate the pioneers and visionaries within the cloud industry.\" HSO is no stranger to success within the cloud either, having won 26 Partner of the Year awards, five Eagle Awards as well as being recognized in the 2023 Digital Revolution Awards for the Best Microsoft Partner to Work For award—and the organization has also been a Microsoft Inner Circle partner for 20 consecutive years. \"Our Tech For Good category is one that always attracts a lot of interest amongst nominees and also during our awards ceremonies,\" added Kashif Naqshbandi, co-founder and Chief Marketing Officer of the Digital Revolution Awards. \"That’s why it was important to us to align with someone that is also leading the way within cloud technology themselves. With over 30 years of technical experience behind them, I couldn’t think of a more perfect partner and am thrilled to welcome HSO on board as sponsor of this category.\" Last year’s Tech For Good award was won by Bankuet (UK), Amboss and Climeworks (DACH), and Food Rescue (North America). Climeworks were also crowned as winners in the awards’ best-of-the-best global show as well. Founded in 2020 by Tenth Revolution Group, the Digital Revolution Awards has become a key fixture in the cloud industry’s calendar since its formation in 2020, receiving over 1,500 nominations and handing out 113 trophies in that time. Not only have they crowned some of the cloud’s biggest and brightest names, but they have also raised money for a number of incredible causes through our awards ceremonies and fundraisers. The shortlist for this year’s UK awards have now been revealed, with a ceremony taking place at the stunning Grosvenor Hotel in London in May to help raise money for St. Martin’s School in Kenya and Teenage Cancer Trust. The global shortlist is announced on March 15 and the ceremony will take place in June, and is to be broadcast online. View source version on businesswire.com: https://www.businesswire.com/news/home/20240222092246/en/ Contacts Media Enquiries: Jamie MercerE: j.mercer@tenthrevolution.com W: digitalrevolutionawards.com "
}