{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.itpro.com/business/leadership/how-satya-nadellas-first-decade-at-microsoft-took-it-from-tech-giant-to-undisputed-industry-titan",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Microsoft’s spike in value under Satya Nadella has taken it to lofty heights amid a sharpened focus on cloud and artificial intelligence It’s been ten years since Satya Nadella took the reins at Microsoft and in that time the firm has undergone something of a market revolution. When Nadella took on the title of chief executive in February 2014, Microsoft’s market cap sat at approximately $314 billion (£250 billion). Today, it’s exceeded $3 trillion (£2.39 trillion) and shows every sign of continuing to rise. Looking back at the Microsoft of 2014 – embarking on further investment in the ill-fated Windows Phone and without a strong direction of travel for cloud – only goes to highlight how far things have come with Nadella in charge. Microsoft’s expansion in the past decade has been driven in no small part by its cloud offering, Azure. While Azure got underway under Nadella’s predecessor Steve Ballmer, it has been under Nadella’s tenure that the cloud platform has cemented itself as one of the dominant options for enterprise and given Amazon Web Services review (AWS) a run for its money. Now in its sixteenth year, the service has become a mainstay for enterprise cloud operations and successfully argued its case with a strong offering of complementary technologies such as generative AI. In its Q1 2023 results, Microsoft returned better results than analysts had expected, with revenue growth of 13% buoyed by Azure’s AI offerings. At the time, Nadella said Microsoft was moving to install AI across “every layer of the tech stack and for every role and business process to drive productivity gains for our customers”. Receive our latest news, industry updates, featured resources and more. Sign up today to receive our FREE report on AI cyber crime & security - newly updated for 2023. Microsoft is all-in on AI, having invested more than $10 billion in OpenAI to date and releasing a multitude of generative AI offerings in its ‘Copilot’ range throughout 2023. It’s clear that generative AI has had a profound impact on Microsoft’s market cap, leading the firm to surpass Apple. While AWS and Google Cloud have AI offerings of their own, Microsoft’s sprint to ally itself with OpenAI and its race against time to bring AI to Bing ahead of similar efforts by Google speak to a focus and urgency on the technology.  Nadella has described Google as an “800-pound gorilla” in the browser market and previously emphasized the opportunity for Microsoft to claw back a share for itself through its AI features. This strategy appears to be paying off, with Bing hitting 100 million daily users for the first time ever in March 2023 driven by AI interest. Microsoft’s control of GitHub has also teed it up nicely for the AI boom, with Nadella’s focus on enterprise AI being key. Early fears that Microsoft’s $7.5 billion acquisition of the developer platform would see it snuff out open source competition haven’t come to fruition, ensuring the platform retains its 100-million strong developer community. This, in turn, has allowed Microsoft to capture a hefty chunk of the AI pair-programmer market through GitHub Copilot Enterprise, which leverages generative AI to improve developer productivity. It’s this joined-up, long-term vision for the company that Nadella has helped craft. With its firm cloud offering, AI capabilities, and ever-growing portfolio of services, the firm is in a stronger position than it ever has been and has grown far less reliant on consumer shocks. In Nadella’s decade of power, he’s been forced to contend with some serious challenges at Microsoft, both direct and indirect. His leadership of Microsoft on its journey to a cross-platform provider of cloud and intelligent computing services has been largely successful, but course corrections have been necessary along the way. As early as 2016, Nadella was pitching the potential of human-machine collaboration and predicting a future defined by talking bots. Microsoft had been burned by the scandal around its Tay chatbot, which had been given its own Twitter account in a public-facing test of its conversational AI abilities.  AWS, Microsoft, and Google see massive cloud opportunities in Japan - here’s whyVodafone eyes cloud overhaul and generative AI gains in $1.5 billion deal with MicrosoftSneak-and-peek Midnight Blizzard attack highlights “worrying flaws” in Microsoft security processes Malicious users flooded Tay with discriminatory tweets, causing the chatbot to quickly begin producing racist and inflammatory tweets of its own, leading Microsoft researchers to turn Tay off just 16 hours after setting it live. This was a humiliating chapter in Microsoft’s journey toward useful AI. Nadella later stated that Tay forced Microsoft to “take accountability” for its projects and subsequent endeavors have not become public-facing without extensive testing beforehand. But his vision for Microsoft, in which it would deliver AI services that respond to natural language inputs and backed by the power of Azure’s processing capabilities, has now been brought to life. A recent example of this can be found in the chaos at OpenAI in November, which saw CEO Sam Altman ousted for several days amidst an apparent board revolt. The much-publicized spat lasted five days, in which time OpenAI had two interim CEOs and ended with Altman returning to the firm alongside a heavily reshuffled board.  Deliver engaging digital experiences across every touchpoint in 5 simple steps\n\nDOWNLOAD NOW The chaos put Nadella in a difficult position. Microsoft had worked hard for the previous year to make OpenAI core to its value proposition, with GPT-4 powering Copilot and the firm’s models forming the backbone of Azure’s AI offerings. After publicly welcoming OpenAI CTO Mira Murati as interim CEO, Nadella was forced to welcome her successor Emmett Shear just three days later as Murati left the post. On November 20, 2023, Nadella announced that Altman and Greg Brockman, former president of OpenAI, would be joining Microsoft to lead a new “advanced AI research team”. This role seemingly evaporated just a day later with the news that Altman was back in charge at OpenAI.  The week of confusion put a spotlight on Nadella’s interest in OpenAI, and by extension the relationship between the startup and Microsoft. Shortly after, the Competition and Markets Authority (CMA) announced an initial review into OpenAI and Microsoft’s relationship and impact on competition in the AI market. Nadella has described OpenAI and Microsoft’s ties as a “pro-competition partnership”, but depending on the temperament of regulators may come to regret the lengths to which his bet on OpenAI has extended. Nadella’s reign has arguably been one of curious contradictions. While he has overseen the undisputable rise of the company in its cloud and intelligent computing segments, he has also been the de-facto steward of decline when it comes to Microsoft’s devices division. There are a number of factors at play here, as PC shipments have suffered their worst decline in history and initial pandemic spend on devices wanes amid a return to office and economic woes. Aside from Tay, Nadella has also had to deal with his fair share of controversy.  New Microsoft Copilot updates target individual users, small businesses with ‘Pro’ subscription tier and cheaper pricing“A long time coming” - Microsoft data residency plans will see firm store all cloud customer data in the EUGoogle Cloud just waived data transfer fees for customers, and took a big swipe at Microsoft in the process HoloLens is a prime example of a Microsoft misstep under Nadella. The firm pinned great hopes on its augmented reality headsets, through which it hoped to carve out a solid place for itself in the burgeoning wearables market. At the time they were announced, Business Insider reported Nadella describing them as “the new desktop”, but the market responded with apathy. HoloLens hasn’t quite suffered the same fate as Google Glass, which finally ended life in March 2023 after its enterprise model failed to generate business interest. The goggles have endured as mixed reality headsets for industrial environments, from manufacturing floors to construction sites in collaboration with the industry solutions firm Trimble. The devices that Nadella initially sold as the future of consumer computing have also found a second life at the US Department of Defense. A $480 million contract with the US Army, signed in 2018, sparked protests within the firm. Nadella spoke out in defense of the deal in 2019, telling CNN that Microsoft “made a principled decision that we’re not going to withhold technology from institutions that we have elected in democracies to protect the freedoms we enjoy”. This could be a fight that Nadella will be forced to revisit, as Microsoft scored a $22 billion order for HoloLens in 2021 – though Congressional reductions on this spending have reduced its value to approximately $165 million. Reports by The Intercept that OpenAI’s fresh leadership team has removed its ban on using its models for military usage could add to these concerns for Nadella, as his work to align Microsoft closer with the AI firm puts him in the firing line for future discussions on ethical AI. Rory Bathgate is Features and Multimedia Editor at ITPro, overseeing all in-depth content and case studies. He can also be found co-hosting the ITPro Podcast with Jane McCallion, swapping a keyboard for a microphone to discuss the latest learnings with thought leaders from across the tech sector. In his free time, Rory enjoys photography, video editing, and good science fiction. After graduating from the University of Kent with a BA in English and American Literature, Rory undertook an MA in Eighteenth-Century Studies at King’s College London. He joined ITPro in 2022 as a graduate, following four years in student journalism. You can contact Rory at rory.bathgate@futurenet.com or on LinkedIn. How tech leaders can manage conflict in the workplace Equinix announces leadership changes with former Google exec joining as CEO CI/CD comes into focus as enterprises ramp up application modernization efforts By Daniel ToddMarch 21, 2024 By George FitzmauriceMarch 21, 2024 By Steve RangerMarch 20, 2024 By Steve RangerMarch 20, 2024 By Daniel ToddMarch 20, 2024 By Solomon KlappholzMarch 20, 2024 By Solomon KlappholzMarch 20, 2024 By Emma WoollacottMarch 20, 2024 By George FitzmauriceMarch 20, 2024 By Steve RangerMarch 19, 2024 By George FitzmauriceMarch 19, 2024 Posted Posted Posted Posted IT Pro is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}