{
    "title": null,
    "date": "1/18/2024",
    "url": "https://finance.yahoo.com/news/3-large-cap-stocks-buy-120000838.html",
    "text": "There is little doubt that Wall Street remains certain the Fed will cut rates in 2024. Investors are instead getting a bit nervous that the Fed and other influential central banks won’t race to dramatically cut rates while inflation lingers solidly above target levels. On the other hand, the selling heading into the heart of fourth quarter earnings season makes sense to help cool things off following the blistering run off the October lows. The S&P 500 and the Nasdaq were always likely to test their longer-term 50-day and 200-day moving averages in the early months of 2024. The Q4 earnings outlook has improved since the big banks kicked things off late last week. Investors who can handle the near-term uncertainty that earnings season brings might want to consider buying these three large-cap stocks ahead of their upcoming earnings releases and holding them for the long haul since timing the market precisely is extremely difficult. Microsoft (MSFT) Microsoft reports its Q2 FY24 earnings results on January 30. Cloud computing reshaped MSFT and turned it back into a consistent sales and EPS growth juggernaut. Now AI appears to be the next expansion-focused frontier, with Microsoft introducing artificial intelligence features across various parts of its business such as Office. On top of AI, MSFT closed its roughly $70 billion deal to buy Activision Blizzard in October as a massive bet on gaming and the future of VR and the metaverse. Microsoft is also sitting on $144 billion in cash and equivalents that will help it continue to pursue expansion through strategic acquisitions. Image Source: Zacks Investment Research Microsoft is projected to grow its revenue by roughly 14% in both FY24 and FY25 to jump from $212 billion last year to $275 billion next year. The firm is projected to grow its adjusted earnings by 14% during both periods as well. MSFT has consistently beaten our bottom line estimates, and its EPS outlook has remained intact over the last several months to help it land a Zacks Rank #3 (Hold) at the moment. MSFT stock has more than doubled Tech over the past 20 years. MSFT shares have surged 65% during the last 12 months vs. the Zacks Tech sector’s 46%. Despite sitting near new all-time highs, Microsoft trades below its average Zacks price target. The stock might be a little overheated right now, and it could pull back to its 21-day or 50-day moving averages in the near-term. But Microsoft is trading solidly above its 21-month moving average, as it has for most of the last decade. Image Source: Zacks Investment Research Valuation-wise, MSFT trades at a 10% discount to its 10-year highs at 32.5X forward 12-month earnings. Microsoft appears far cheaper when factoring in its longer-term earnings growth outlook since its PEG ratio of 2.1 offers 5% value vs. its 10-year median and a 32% discount to its highs—MSFT is also trading nearly in line with the Zacks Tech sector. MSFT boosted its FY24 dividend by 10% and it is committed to repurchasing more shares. All in, investors who are bullish on big tech and the possibilities of AI might want to add Microsoft ahead of earnings and hold it forever. Procter & Gamble (PG) Procter & Gamble, one of the powerhouses of the consumer packaged goods world, is set to report its second quarter fiscal 2024 earnings results on January 23. Procter & Gamble is one of the largest makers of household and personal essentials, with brands ranging from Febreze and Swiffer to Head & Shoulders and Pampers and tons more. PG breaks down its business into five categories: Beauty, Grooming, Health Care, Fabric & Home Care, and Baby, Feminine & Family Care. Image Source: Zacks Investment Research Procter & Gamble’s standing as a consumer staples standout helps it succeed during most economic environments, good or bad. The company is projected to post roughly 4% sales expansion both this year and next to help boost its adjusted earnings by 9% and 8%, respectively, based on current Zacks estimates. PG has regularly topped EPS estimates in the last five years and its upward revisions help it land a Zacks Rank #2 (Buy) right now. PG stock has climbed 65% in the last five years vs. the Zacks Consumer Staples sector’s 9%. Procter & Gamble has lagged the market during the past three years, up 11% vs. the S&P 500’s 26% run. PG shares are trading roughly 8% below their highs and 12% under their average Zacks price target. Procter & Gamble is trading above its very long-term 21-month moving average and around neutral RSI levels on a 20-year timeframe. Image Source: Zacks Investment Research The stock might be able to break out of its prolonged holding pattern in 2024 as investors look for gains outside of big tech. Procter & Gamble is trading at a 16% discount to its decade-long highs and near its median at 22.4X forward earnings. PG’s dividend yields 2.5% to outpace its industry’s 2.4% average. P&G is also one of fewer than 70 S&P 500 Dividend Aristocrats, which are firms that have both paid and raised dividends for at least 25 years running. United Rentals (URI) United Rentals, an equipment rental star, said it will release its Q4 FY23 results on January 24. URI’s growing portfolio of large equipment includes scissor lifts, towable light towers, generators, excavators, and nearly everything else under the sun its clients might need. Customers across construction, utilities, energy, home builders, and beyond count on United Rentals for various offerings across different timeframes. United Rentals has lifted prices alongside inflation and it is benefiting from its Ahern Rentals acquisition in late 2022. The firm’s revenue was booming before the pandemic, with sales up between 15% to 21% for three straight years until they slipped in 2020. URI quickly left its Covid setbacks behind and posted 14% sales growth in FY21 and 20% in 2022. Image Source: Zacks Investment Research United Rentals carried over its momentum in 2023, topping our Q2 and Q3 earnings estimates. The company reaffirmed its 2023 guidance last quarter, and URI’s management team remains confident in its longer-term outlook. The firm expects it will benefit from the ongoing investment super cycle in the U.S. across infrastructure, industrial manufacturing, and energy and power. The company’s earnings outlook has slipped slightly compared to where it was this time last year. But its 2025 estimates have improved recently. Plus, URI’s sales are projected to jump by 22% in 2023 and another 4% in 2024 against a difficult-to-compete-against period. Meanwhile, its adjusted earnings are projected to surge by 26% and 6%, respectively. Image Source: Zacks Investment Research URI has surged 590% in the past 10 years to crush the S&P 500’s 170% and the Zacks Construction sector’s 155%. United Rentals is up 42% in the last 12 months, including some large swings. URI’s recent slip below its 21-day moving average might mean it will be forced to test its 50-day soon. Thankfully, it is already at neutral RSI levels vs. overbought in December. Some investors might want to wait for it to slide to the longer-dated trendlines such as the 21-month depicted in the nearby chart. Yet, the stock appears to be worth simply buying and holding through any near-term downturns since it trades at a 21% discount to its sector despite its huge long-term outperformance and 25% below its highs at 12.9X 12-month forward earnings. And its dividend yields 1.1%. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Microsoft Corporation (MSFT) : Free Stock Analysis Report Procter & Gamble Company (The) (PG) : Free Stock Analysis Report United Rentals, Inc. (URI) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}