{
    "title": "Despite free access to GPT-4, Microsoft's Copilot app hasn't impacted \nChatGPT installs or revenue",
    "date": "1/8/2024",
    "url": "https://finance.yahoo.com/news/despite-free-access-gpt-4-165821010.html",
    "text": "Microsoft Copilot, the company's recently launched AI chatbot built with OpenAI technologies, does not yet appear to be siphoning users away from OpenAI's own ChatGPT, according to a new analysis of app store data. Copilot, which combines an AI chatbot with an Image Creator feature powered by DALL-E 3, is notable for offering free access to OpenAI's newer GPT-4 technology -- something that OpenAI charges for in ChatGPT, which runs on GPT-3.5. Given it's a free alternative, it's somewhat surprising that Copilot's launch hasn't seemingly impacted ChatGPT's installs or revenue as of yet -- but that could be explained by the lack of promotion. App store intelligence provider Appfigures, which ran the new analysis, theorizes that Copilot's launch has been largely unnoticed by potential consumers, something that could be due to several factors. Microsoft's app first launched on Google Play on December 20, but in the first few days, it wasn't ranked at all, most likely because there was no promotion on the Play Store during this time. The app then launched on the App Store on December 28, but isn't using Apple's Search Ads to gain attention from potential iOS users. With Search Ads, Copilot could be returned as a top search result when users keyed in related terms like \"AI chatbot\" or even \"ChatGPT.\" But Microsoft doesn't appear to be leveraging this ad opportunity. Image Credits: Appfigures To date, Copilot has only seen 2.1 million downloads across iOS and Android (as of January 5, 2024). Daily downloads peaked at 413,000 and have since slowed, the data indicates. On January 5, the app saw only 194,000 total installs, for example. The U.S. is Copilot's largest market with 24% of downloads, followed by Germany, India, Italy, and the U.K. Unlike some apps, Copilot's installs are also somewhat evenly split across iOS and Android, with 59% on Google Play versus 41% on the App Store. According to Appfigures, ChatGPT's downloads have also been slowing in December -- but this started before Copilot's release. During the time that Copilot was amassing its 2.1 million installs, ChatGPT gained another 4.2 million downloads. The firm told TechCrunch there's nothing to indicate that Copilot itself is having any impact on ChatGPT's installs or its revenue, the latter of which continues to rise, in fact. As of ChatGPT's first anniversary in November, its mobile apps had netted nearly $30 million in revenue. Some other apps have more successfully monetized on mobile, but ChatGPT's subscription service can also be bought on the web, where many of its users prefer to interact with the AI chatbot. So mobile revenue is not a complete picture. ChatGPT was a breakout success at launch, topping 500,000 downloads in its first six days. Though that record was later beaten by Instagram Threads, the AI chatbot's launch was still one of the highest-performing app releases of the past couple of years, having been previously topped only by the February 2022 arrival of Trump-backed Truth Social. Copilot, meanwhile, is not seeing the same attention -- perhaps because ChatGPT already has a devoted install base that isn't interested in a switch, or because the holiday launch and lack of promotion meant many potential users missed the news of its arrival. Some may also find the Bing-heavy integration undesirable, though there's no way to tell how many considered, but then did not download, Copilot in that case. In any event, Copilot has yet to unseat ChatGPT from its AI chatbot throne. In the meantime, Microsoft is finding other ways to put the AI tech to use -- including via the addition of a Copilot button on PCs. This article originally appeared on TechCrunch at https://techcrunch.com/2024/01/08/despite-free-access-to-gpt-4-microsofts-copilot-app-hasnt-impacted-chatgpt-installs-or-revenue/ Related Quotes "
}