{
    "title": "Up 63% Since The Beginning Of 2023, How Will Microsoft Stock Trend After Q2 \nEarnings?",
    "date": "1/19/2024",
    "url": "https://www.forbes.com/sites/greatspeculations/2024/01/19/up-63-since-the-beginning-of-2023-how-will-microsoft-stock-trend-after-q2-earnings/",
    "text": "The Microsoft logo on the facade of the new Miscrosoft Germany Centre in Munich, Germany, 6 March ... [+] 2017. Photo: Matthias Balk/dpa | usage worldwide   (Photo by Matthias Balk/picture alliance via Getty Images) Microsoft (NASDAQ: MSFT) is scheduled to report its fiscal Q2 2024 results on Tuesday, January 30, 2024. We expect the results to top the consensus estimates of revenues and earnings. The company surpassed expectations in the last quarter (FY July- June), with net revenues increasing 13% y-o-y to $56.5 billion. It was driven by a 13% rise in the productivity & business processes unit, followed by a 19% growth in the intelligent cloud segment. Further, total expenses as a % of revenues witnessed a favorable decrease in the quarter. We expect the same trend to continue in the second-quarter results. Our interactive dashboard analysis on Microsoft’s Earnings Preview has more details. Amid the current financial backdrop, MSFT stock has seen extremely strong gains of 75% from levels of $220 in early January 2021 to around $390 now, vs. an increase of about 25% for the S&P 500 over this roughly 3-year period. However, the increase in MSFT stock has been far from consistent. Returns for the stock were 52% in 2021, -28% in 2022, and 57% in 2023. In comparison, returns for the S&P 500 have been 27% in 2021, -19% in 2022, and 24% in 2023 - indicating that MSFT underperformed the S&P in 2022. In fact, consistently beating the S&P 500 - in good times and bad - has been difficult over recent years for individual stocks; for other heavyweights in the Information Technology sector including AAPL, NVDA, and AVGO, and even for the megacap stars GOOG, TSLA, and AMZN. In contrast, the Trefis High Quality Portfolio, with a collection of 30 stocks, has outperformed the S&P 500 each year over the same period. Why is that? As a group, HQ Portfolio stocks provided better returns with less risk versus the benchmark index; less of a roller-coaster ride as evident in HQ Portfolio performance metrics. Given the current uncertain macroeconomic environment with high oil prices and elevated interest rates, could MSFT face a similar situation as it did in 2022 and underperform the S&P over the next 12 months - or will it see a strong jump? Our forecast indicates that Microsoft’s valuation is $409 per share, which is 5% above the current market price. MSFT Earnings Estimates for FY 2024Q2 (1) Revenues expected to beat the consensus On the cost front, the operating expenses as a % of revenues decreased in the quarter. Overall, it resulted in a 27% y-o-y improvement in the net income to $22.3 billion. Microsoft’s revenues grew 7% y-o-y to $211.9 billion in FY 2023. Further, the top line posted growth in the first quarter of FY2024.   Trefis estimates Microsoft’s fiscal Q2 2024 net revenues to be around $61.74 billion, slightly above the $61.13 billion consensus estimate. (2) EPS to edge past the consensus estimates Microsoft Q2 2024 adjusted earnings per share is expected to be $2.82 per Trefis analysis, marginally above the consensus estimate of $2.78. The company’s net income decreased 1% y-o-y to $72.4 billion in FY2023. However, the numbers improved in Q1, with net income increasing by 275 y-o-y to $22.3 billion. We expect the second quarter results to follow the same trend. Overall, Microsoft is likely to report an annual GAAP EPS of $11.28 for FY 2024. (3) Stock price estimate is at par with the current market price We arrive at Microsoft’s valuation, using a GAAP EPS estimate of around $11.28 and a P/E multiple of just above 36x in fiscal 2024. This translates into a price of $409, which is 5% above the current market price. Note: P/E Multiples are based on Share Price at the end of the year and reported (or expected) Adjusted Earnings for the full year MSFT Return compared with Trefis Reinforced Value Portfolio Invest with Trefis Market Beating Portfolios See all Trefis Price Estimates  "
}