{
    "title": "Microsoft sets price for premium version of Copilot AI software for \nconsumers at $20 per user",
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/microsoft-sets-price-for-premium-version-of-copilot-ai-software-for-consumers-at-20-per-user-070144397.html",
    "text": "Microsoft (MSFT) on Monday announced that it is launching a paid version of its generative AI-powered Copilot platform for consumers. The option, called Copilot Pro, will cost $20 per month per user, and give users access to a number of additional capabilities, including access to the latest AI models and improved AI image generation via Image Creator from Designer. The move comes as Microsoft looks to monetize its massive investment in ChatGPT developer OpenAI and continue to build on the momentum behind generative AI that kicked off in 2023. Microsoft says Copilot Pro was developed for individual users who want to get priority access models, including GPT-4 Turbo, OpenAI’s latest offering, during peak usage hours for improved overall performance, as well as the ability to access Copilot across Microsoft’s Word, Excel, PowerPoint, Outlook, and OneNote apps. The company says that Copilot Pro will provide a single experience on the PC, web, and apps, as well as iOS and Android. Microsoft says Copilot Pro will also include access to its Image Creator and the option to customize your own Copilot GPTs for certain topics, whether that’s for working out, cooking, or any other interest you might have. In addition to Copilot Pro, Microsoft has also announced that it’s dropping the minimum user limit for Copilot for Microsoft 365. Microsoft previously limited the offering to companies purchasing licenses for 300 seats or more. The change opens up the software to small and medium businesses. Copilot for Microsoft 365 brings Copilot to the company’s suite of productivity apps, including Word, Excel, OneNote, Teams, and more. The enterprise edition of the software also allows companies to expand Copilot to their internal data, giving them the ability to search for and summarize their own content, not just data from the web. Access to the service is priced at $30 per user per month. Microsoft is investing $10 billion over 10 years in OpenAI as a means of expanding its position in the enterprise productivity market and with the hope that it can simultaneously steal market share away from rival Google (GOOG, GOOGL) in the search market via its AI-powered Bing chat and Edge browser. It’s difficult to imagine the average consumer subscribing to Copilot Pro, especially for $20 per month, but users who want to dive deeper into using generative AI or need quick access to high-powered AI models could find the service extremely useful. More importantly, for Microsoft, the addition of Copilot Pro and opening up Copilot for Microsoft 365 to a larger number of business users will bring in more revenue for its AI efforts, providing Wall Street with further proof that the company is monetizing its investments. Microsoft is moving quickly to push AI as one of its main product offerings. In addition to its Copilot platforms, the company recently debuted a Copilot key for Windows laptop and desktop keyboards. The first new key for the Windows keyboard since the introduction of the Windows key itself, the Copilot key, provides instant access to the Copilot app on users’ PCs. Elevating Copilot to such a position shows how much Microsoft is set on showing that AI is an enormously important part of its future on a par with cloud computing. But Microsoft isn’t the only company working to seize the AI moment. Google is also selling access to its enterprise-grade productivity suite with its Duet AI platform, while Amazon (AMZN), Salesforce (CRM), and others look to gain more traction as well. Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}