{
    "title": "MARKET REPORT: Microsoft joins Apple in the $3trillion club as it cashes in \non booming demand for AI",
    "date": "1/24/2024",
    "url": "https://www.thisismoney.co.uk/money/markets/article-13002621/MARKET-REPORT-Microsoft-joins-Apple-3trillion-club-cashes-booming-demand-AI.html",
    "text": "By John Abiona Updated:  22:02 GMT, 24 January 2024  2 View  comments  US tech giant Microsoft has become the second public company to be valued at $3trillion as it cashes in on booming demand for artificial intelligence (AI). On another historic day in Wall Street, the firm’s shares hit a record high of $404.4. That made it the second stock market-listed firm to hit the $3trillion milestone – £2.4trillion at current exchange rates – after Apple. The pair have been vying for the top spot, with Microsoft briefly becoming the world’s most valuable company two weeks ago before Apple bounced back. Backed by its investment in ChatGPT maker OpenAI, Microsoft is widely seen as a frontrunner in the race for market dominance in the rollout of generative artificial intelligence among other tech heavyweights including Google owner Alphabet, Amazon, Oracle, and Facebook owner Meta Platforms. Milestone: On another historic day in Wall Street, Microsoft shares hit a record high of $404.4, making it the second stock market-listed firm to be valued at $3trillion Referring to the surge in Microsoft shares, Stifel analyst Brad Reback said: ‘I think it’s AI optimism.’ He added that Apple does not seem to have the same ‘clear AI story’, while there are also concerns about iPhone sales. The latest rally among the tech stocks came after Netflix posted another set of stellar results. Such performances have helped push the S&P 500 index – home to America’s biggest companies – to a record high for the third time in less than a week. In London, the FTSE 100 rose 0.56 per cent, or 41.94 points, to 7527.67 and the FTSE 250 was up 0.94 per cent, or 179.06 points, to 19,171.68. Gold and silver miners soared following a surge in production. Fresnillo gained 4.2 per cent, or 20.3p, to 501.2p after the Mexican explorer increased silver output at its new mine. And South America-focused Hochschild Mining rose 7.6 per cent, or 6.7p, to 95.5p after it met annual production forecasts. Revolution Bars plunged after it warned its profits will be hit by a fall in spending among the young. After its best Christmas in four years, the city centre bar chain said trading has slowed in January. It expects to make an annual profit of around £3m to £5m, having made £6.6m the previous year. It will be affected by the national minimum wage rise, hike in business rates and upcoming train strikes. Shares, which listed at 200p in March 2015, plunged 22.1pc, or 0.85p, to 3p. Fresnillo reported a 12.2 per cent rise in silver production in the final three months of 2023. Over the year output was up 4.7 per cent, driven by its new Juanicipio mine. But gold production fell as one mine approached the end of its life. At Hochschild, a ‘robust’ fourth quarter of 2023 helped it end the year at the top of its revised production forecast as it gears up for its Mara Rosa project in Brazil to start producing gold in February. The upbeat outlooks sparked a rally among fellow gold miners. It sent Endeavour up 4.8 per cent, or 66p, to 1443p while Centamin increased 5.2 per cent, or 4.8p, to 97.85p. The industry is also benefiting from higher gold prices, with the precious metal remaining above the $2,000 benchmark. There were also gains for other mining giants on the back of higher metal prices. Anglo American added 4 per cent, or 71.2p, to 1860.8p, Antofagasta climbed 5.3 per cent, or 85p, to 1682p and Glencore increased 3 per cent, or 11.95p, to 417.1p. Haleon, which makes Sensodyne toothpaste and Advil painkillers, sank into the red after a broker downgrade. Investment bank JP Morgan flagged up concerns that business is likely to slow for the consumer health group as Covid-related demand starts to ease. The shares slid by 2.5 per cent, or 8.05p, to 313.35p. Nursing even heavier losses was Senior after Barclays downgraded the engineer and warned it could be affected by a slowdown in supplier production rates. It dropped 6.7 per cent, or 11.4p, to 159.6p. Diversified Energy hit back at a short-seller concerned over its finances. The US natural gas producer said the ‘opportunistic’ report published by Snowcap Research the day before was inaccurate. Shares, which tumbled 12 per cent on Tuesday, rose 11.5 per cent, or 97.5p, to 942.5p. Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence. Share what you think The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. MORE HEADLINES This is Money is part of the Daily Mail, Mail on Sunday & Metro media group "
}