{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.mobihealthnews.com/news/ai-enabled-administrative-task-company-outbound-ai-joins-microsofts-pegasus-program",
    "text": "Photo: Eva-Katalin/Getty Images Seattle-based Outbound AI, a company offering AI-powered virtual agents that perform administrative tasks, announced it was selected to participate in Microsoft's invite-only Pegasus Program. Outbound AI is a conversational AI tool for healthcare with 24/7 virtual agents that focus on the revenue cycle, including eligibility and benefits verification, claims status and prior authorization. The platform utilizes Outbound's proprietary Conversational AI Cloud and is hosted on Microsoft's Azure. Pegasus assists startups that have demonstrated product-market fit with scaling by providing cloud resources and mentoring services. The program is only available to companies building their platforms utilizing the tech giant's technology and those engaged in Microsoft for Startups Founders Hub. \"Being invited to join the Microsoft for Startups Pegasus Program is not only a tremendous honor, it’s validation of the work we’re doing and the value we’re creating. We look forward to furthering all aspects of our enterprise go-to-market initiatives with the expertise, guidance and support of the Microsoft team,\" Stead Burwell, founder and CEO of Outbound AI, said in a statement. MARKET SNAPSHOT Last year, Outbound AI scored $16 million in seed funding. At the time, Burwell told MobiHealthNews it would use the funds to accelerate its sales and marketing efforts, evaluate new use cases of its technology for administrative work, and launch new programs with new partners. Another conversational AI platform is Hyro, which offers providers a call center using AI assistants for automated conversations with patients. Hyro also has a GPT-powered assistant, dubbed Spot, that offers explainability around AI outputs. In May, Hyro announced it raised $20 million in Series B funding led by Macquarie Capital, bringing its total raise to $35 million.   © 2024 MobiHealthNews is a publication of HIMSS Media MobiHealthNews: The latest news in digital health delivered daily to your inbox.  "
}