{
    "title": "Touch Down! 3 Stocks That Look a Lot More Promising After Their Successful \nSuper Bowl Ads",
    "date": "2/19/2024",
    "url": "https://investorplace.com/2024/02/touch-down-3-stocks-that-look-a-lot-more-promising-after-their-successful-super-bowl-ads/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. These companies scored big touchdowns during the Super Bowl Advertisement Source: kovop / Shutterstock.com Not every touchdown during Super Bowl 58 happened on the field. Advertising slots are very competitive during the big game and cost companies millions of dollars to run. These corporations only have 30 seconds to make a lasting impression on viewers as they wait for the game to resume. Commercials can bring awareness to new products or highlight core products that have helped a corporation for many years. These three stocks looked promising before their Super Bowl ad campaigns. However, they look more enticing for long-term investors. Microsoft (NASDAQ:MSFT) has made big investments in artificial intelligence. This technology is a key component of the bullish thesis as the corporation has been “applying AI at scale.” Super Bowl viewers got to see that vision first-hand through Microsoft’s “Watch Me” commercial. The Super Bowl ad starts off by presenting several underdogs who want to do ambitious things like start a business or get a degree. Then, the commercial shows Microsoft Copilot in action. Copilot is Microsoft’s artificial intelligence tool. It lets people create documents and access information quickly. Microsoft touted that the app is available in the App Store and Google Play. The advertisement will lead to more people using Microsoft’s AI tool. That tool can lead to consumers going deeper into Microsoft’s ecosystem. The company reported solid earnings in Q2 FY24 which featured 18% year-over-year revenue growth and 33% year-over-year net income growth. Continued financial strength has led to a 264% gain over the past five years. Crowdstrike (NASDAQ:CRWD) had an attention-grabbing commercial that brings viewers to a futuristic western setting. The commercial depicts enemy cyborgs going into the small town and disrupting the technology that helps the place operate. The sheriff is called in to stop the threat, but a woman tells the sheriff that she has it under control. She greets a few cyborgs at the center of the town in a classic standoff fashion. Instead of pulling for a gun, the woman opens a digital dashboard and removes the threat with a few taps. The commercial concludes by stating the following: “Adversaries move fast but Crowdstrike moves faster. We stop breaches.” It’s a simple way to describe the cybersecurity firm. While Crowdstrike moves faster than its adversaries, the corporation’s stock price has moved even faster. The stock is up by 413% over the past five years and has almost tripled over the past year. Intuit (NASDAQ:INTU) took a more straightforward approach with its Super Bowl commercial. This commercial is a case study of first-time homeowners who turned to Turbo Tax because they needed help with filing their taxes. Viewers get to see a Turbo Tax representative discuss what happened and how the first-time homeowners were assisted along the way. The commercial comes to an end with Intuit mentioning Turbo Tax’s 100% accuracy guarantee. It’s a good and concise way to close out the commercial as it gives people another reason to feel comfortable with using the popular software. Turbo Tax isn’t the only financial software under the Intuit umbrella. The company also owns several business software companies like Mailchimp. Intuit doesn’t seem to get as much buzz as high-flying tech companies that are invested in AI. However, the stock has marched 62% higher over the past year and is up by 161% over the past five years. That’s enough to outperform the major indices. On this date of publication, Marc Guberti held a long position in MSFT. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Marc Guberti is a finance freelance writer at InvestorPlace.com who hosts the Breakthrough Success Podcast. He has contributed to several publications, including the U.S. News & World Report, Benzinga, and Joy Wallet. Artificial Intelligence, Cloud, Cybersecurity, Financial, Software, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/touch-down-3-stocks-that-look-a-lot-more-promising-after-their-successful-super-bowl-ads/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Crypto & Blockchain Stocks to Buy Market Analysis Stocks to Sell Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}