{
    "title": "Microsoft has improved Nearby Share transfer speed on Windows 11",
    "date": "2/16/2024",
    "url": "https://mspoweruser.com/microsoft-has-improved-nearby-share-transfer-speed-for-users-on-the-same-network/",
    "text": "Follow us Share this article Latest news 2 min. read Published on February 16, 2024 published on \n\nFebruary 16, 2024 Share this article Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Microsoft has released Windows 11 Builds 22621.3227 and 22631.3227 (KB5034848) to Insiders in the Release Preview Channel on Windows 11, version 22H2 (Build 22621) and version 23H2 (Build 22631), bringing several improvements and bug fixes. One notable change is an enhancement to Nearby Share, a feature allowing users to wirelessly transfer files between nearby devices. Previously, Nearby Share, soon to be called Quick Share, primarily optimized transfer speeds for devices on the same private network. The update expands this functionality to include public and private networks, potentially resulting in faster file transfers for users sharing content within the same location. Here are some other updates: This update is currently available for Windows Insiders in the Release Preview Channel. It will be rolled out to all Windows 11 users in the coming weeks. For those interested in early access, joining the Windows Insider program provides an opportunity to experience these improvements and contribute to further development. More here. More about the topics: nearby share Devesh Beri Tech Journalist These are the things that motivate me - creating informative and helpful content, pursuing my passion for motorsports and music, engaging in expeditions, maintaining a healthy lifestyle, and spending time with my adorable cat Taco. Devesh Beri Tech Journalist Devesh is our tech journalist. His main mission is to break and break down the complex jargon-y tech news for MSPowerUser readers. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}