{
    "title": "Universal Print, Microsoft's one-stop solution for printing in cloud \nservices, now arrives on macOS",
    "date": "2/8/2024",
    "url": "https://mspoweruser.com/universal-print-microsofts-one-stop-solution-for-printing-in-cloud-services-now-arrives-on-macos/",
    "text": "Follow us Share this article Latest news The company initially planned for a full launch last year, but that didn't happen. 2 min. read Published on February 8, 2024 published on \n\nFebruary 8, 2024 Share this article Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes It’s been at least four years since Microsoft first launched Universal Print, its one-stop solution for businesses to print documents without installing drivers locally. Now, the Redmond company is rolling this out for macOS users. Now supported for users of macOS Ventura 13.3, Universal Print can be accessed through the Microsoft Azure Portal for Microsoft 365 businesses. From there, you can go to the Settings page and then click on “macOS Support (preview).” Folks over at Neowin also spotted (via the Microsoft 365 roadmap site) that the company had initially planned a full launch of Universal Print last year in September. That plan did not come to fruition, for whatever reason. Now, you can also download the Universal Print mobile app on Apple’s App Store and choose between entering a personalized PIN code or scanning a QR code on the printer using the app. And soon, as Microsoft promises, you’ll also be able to swipe a badge on the printer for even more security. It also has a feature called Delegation Administration to do just-in-time (JIT) rights without third-party tools, allowing admins to manage printers by using a specific connector. Compatible printers include (but possibly not exclusive to) Canon, Epson, HP, Xerox, Toshiba, and more. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Currently reporting news on Microsoft-related products, tech, and AI on Windows Report and MSPowerUser.\nGot a tip? Send it to [email protected]. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}