{
    "title": "\"Work From Anywhere, Free Snacks\": Microsoft Employees' Video Of Office \nPerks Is Viral",
    "date": "2/14/2024",
    "url": "https://www.ndtv.com/offbeat/work-from-anywhere-free-snacks-microsoft-employees-video-of-office-perks-is-viral-5056403",
    "text": "A nap room at the Microsoft office. Tech giant Microsoft is known for its services and extraordinary culture. Microsoft employees seem to have everything, including a gorgeous campus, free refreshments, a nap room, a healthy work-life balance, and workplace flexibility. A video of the perks available to the employees at the company was recently shared on social media and went viral in no time. The reel was shared by a software development engineer at the company. In the clip, the staff members joined in on a trend that showcased the benefits they get at work. The company's enormous 54-acre Hyderabad facility appears to have served as the location for filming the video. The workplace features a multi-cuisine restaurant open around the clock on each floor with informal meeting spaces for coffee breaks. Further, an employee stated that they are allowed to work from anywhere and have enough company t-shirts which they can wear the entire week. They also have a great work-life balance, a nap room and they work on stuff ranging from AI to gaming. A post shared by twosisterslivingtheirlife (@twosisterslivingtheirlife) As per Microsoft's website, \"The campus also affords amenities like a 24x7 ambulance & pharmacy, a landscaped 800-seater outdoor amphitheatre, air-conditioned bus services with WiFi connectivity, dedicated banks and ATMs as well as a fully equipped gymnasium with trainers, yoga and aerobics classes.\" Since being shared, the video has amassed over 20,000 likes.  The video got approval from the company itself who said in the comments section, \"It's a post by our Microsoft employees, ofcourse it's gonna be wholesome!\" along with a heart emoji. \"We are not Microsoft employees of course we are very jealous,\" said another person. Another joked, \"Ofcourse you have windows in Microsoft's office and Microsoft office in windows.\" \"We are Microsoft employees of course we have time to create reels in office,\" stated a person. \"We are Microsoft employees and we are totally spoilt,\" remarked a person. PromotedListen to the latest songs, only on JioSaavn.com A person also said, \"I'm a Google employee Of course I go to the office only for food.\" \"We are non Microsoft of course we want to crack the interview,\" added a user. Track Latest News Live on NDTV.com and get news updates from India  and around the world. Watch Live News: Follow Us: ................................ Advertisement ................................ "
}