{
    "title": "3 Practices to Create Inclusive Experiences at Your Company",
    "date": "2/21/2024",
    "url": "https://www.microsoft.com/insidetrack/blog/disability-as-a-strength-three-practices-to-help-you-create-inclusive-experiences-at-your-company/",
    "text": "How Microsoft does IT Feb 21, 2024\t\t\t\t\t  |  Dawn Lee Microsoft’s mission is to empower every person and every organization on the planet to achieve more. Our Microsoft Digital Employee Experience team lives this mission every day by empowering employees across the organization with inclusive digital and physical experiences. Leading our accessibility efforts over the past two years, I’ve seen teams make great progress—not just in those experiences, but also in the culture we’ve created across the organization. It’s energizing when you hear someone share an accessibility tip in a meeting or see the “Accessibility: Good to Go” message in someone’s PowerPoint presentation. We have continued to evolve the way we incorporate accessibility practices into our employee experiences—from meeting etiquette to the digital experiences that enable our employees to do their best work. And with the recent explosion of generative AI using machine learning to further drive productivity improvements, it’s important we continue to extend these practices to new experiences, so everyone benefits. We worked with the Accessibility team to create a quick guide of best practices for large, internal meetings like Town Halls that serves as a checklist for administrators, meeting organizers and leaders. It helps us all be consistent on what to do when planning a meeting to help everyone fully participate. —Michelle Strub, executive communications lead, Microsoft Digital Employee Experience Following are three practices our teams have learned and do regularly that can be applied across your own organization. Adopting and championing these can increase productivity and higher engagement. [Learn how to create inclusive content with the new Accessibility Assistant in Microsoft 365. Take our accessibility fundamentals training. Learn about our responsible AI program. Find out about our pursuit of inclusive AI.] Meetings are critical to getting work done, whether it’s communicating priorities, driving alignment, brainstorming ideas, or making decisions. Features in Microsoft Teams and Microsoft 365 help people customize their experience, but we found many people weren’t aware of the options available. And while our accessible events guide gives lots of useful information, we found it was sometimes hard for people to know what to adopt and when. “We worked with the Accessibility team to create a quick guide of best practices for large, internal meetings like Town Halls that serves as a checklist for administrators, meeting organizers and leaders,” says Michelle Strub, an executive communications lead in Microsoft Digital Employee Experience. “It helps us all be consistent on what to do when planning a meeting to help everyone fully participate.” It really brought to light the customer pain point by having the employee walk through and share their experience with the tool. I tried to put myself in their shoes by closing my eyes and trying to follow along. That’s when I realized how confusing it was. —Jaimie Larsen, product manager, Microsoft Digital Employee Experience Companies can develop their own checklists to increase awareness of important practices, building up adoption over time. While some of these features were initially designed to support individuals with disabilities, we found the following practical tips encouraged everyone to participate and engage effectively. Creating connections is central to the human experience. We’ve seen employees across Microsoft share their stories, and the stories of others, to improve understanding about why it’s important to create experiences that consider the needs of everyone. Jaimie Larsen, a product manager in Microsoft Digital Employee Experience, was new to accessibility when she met with engineers across her organization to understand their needs and challenges. She quickly realized that the engineers didn’t always understand the impact a poorly designed tool could have on someone’s daily work. She found inspiration to start a quarterly series that featured employees and how they use different tools. “It really brought to light the customer pain point by having the employee walk through and share their experience with the tool. I tried to put myself in their shoes by closing my eyes and trying to follow along. That’s when I realized how confusing it was,” Larsen says. Due to this session, Larsen created a stronger understanding of the importance of the work to the engineering team for the specific tool and others were able to learn from it. It’s been a multi-year journey as we have shared our expertise at Microsoft and worked with ServiceNow to develop practices and processes that continually improve the experiences for our employees. —Sherif Mazhar, principal program manager, Microsoft Digital Employee Experience “It was great because we needed multiple teams to do work to make the experience better,” Larsen says. “This session really helped anchor the goal and impact for everyone.” We partner with teams across Microsoft and external organizations to deliver employee experiences globally. Using international accessibility standards including Web Content Accessibility Guidelines (WCAG), teams have developed strong partnerships and commitment to ensure that accessibility is included as a key requirement and measure of success. One of these partnerships has been with ServiceNow, where Sherif Mazhar, a principal program manager, worked closely with ServiceNow to align accessibility goals and drive improvements together. “It’s been a multi-year journey as we have shared our expertise at Microsoft and worked with ServiceNow to develop practices and processes that continually improve the experiences for our employees,” Mazhar says. Leaders at Microsoft and ServiceNow have aligned on accessibility goals and now review progress quarterly against common goals. It takes time to build up relationships and expertise when the primary job someone is used to doing is not focused on technology. I’ve found it helpful to explain the impact and show what happens, rather than just talking about an issue. It can be easy for people to get lost if you use too much technical jargon. —Erika Retikis, principal product manager, Microsoft Digital Employee Experience Our Microsoft Digital Employee Experience team works with our colleagues in Microsoft Human Resources to build internal and external partnerships that are increasing accessibility awareness and knowledge. Erika Retikis, a principal product manager in Microsoft Digital Employee Experience, has worked with multiple customer companies over the last few years and sees many unique challenges, especially for those companies or teams that aren’t as tech savvy. “It takes time to build up relationships and expertise when the primary job someone is used to doing is not focused on technology. I’ve found it helpful to explain the impact and show what happens, rather than just talking about an issue. It can be easy for people to get lost if you use too much technical jargon,” Retikis says. Looking ahead: Artificial Intelligence needs accessibility from the start As we and other companies look at how artificial intelligence is embedded into different experiences, it will be critical to think about accessibility from the start to ensure that the data and the experiences include everyone. One area of focus is ensuring data sets include a variety of people and situations. We also regularly include employees with disabilities at various product development stages to benefit from their perspective and create more accessible and inclusive experiences. So, when you are thinking about building and adopting inclusive experiences, you should try and keep the above tips in mind, as well as other best practices included in some of the resources below, to ensure that your employee experiences are created with everyone at the center.  Tags: accessibility, AI and Machine Learning, culture, Microsoft Teams Mar 22, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tDodd Willingham Microsoft is a big company with thousands of teams working in different ways based on the work they do. Despite that complexity, when our employees go looking for something, they expect an internal search portal that will find exactly what they’re looking for instantly—just like when they search on the internet. Yet when talking to... Mar 21, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Several years into the era of hybrid work, most of us are used to appearing in a Brady Bunch-style gallery. We click or tap an emoji to ask a question or applaud an achievement and still have to remember to not be “on mute” when it’s our turn to talk. Half of workers have gone... Mar 20, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tJoshua Deans Microsoft Digital (MSD) is the organization that powers, protects, and transforms Microsoft. As part of its mission, MSD builds and manages the cloud network infrastructure that supports Microsoft products and services. MyWorkspace is a browser-based cloud-provisioning tool created by MSD to allow Microsoft employees to rapidly deploy Azure-based infrastructure environments for solution testing and development... Mar 20, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush If you’re on a sales team, you know that there are all kinds of distracting tasks that eat away at your time and get in the way of what you do best—building relationships with and solving problems for customers. There’s no doubt that modern salespeople need to rely on too many tools and services to... This content has been archived, and while it was correct at time of publication, it may no longer be accurate or reflect the current situation at Microsoft. Hybrid work has inspired many changes at Microsoft, including how we support employees with accessibility needs. “We’re all working differently now because of hybrid work,” says Dawn Lee,...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more Building inclusive, accessible experiences is a catalyst for digital transformation, because without accessible tools, people can’t do their best work. And if people can’t do their best work, the company, its culture, and its customers are directly impacted. Building experiences that reflect the true diversity of the people who use them requires a shift in...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more Here at Microsoft, we wanted to improve the experience our employees have in meetings, whether they’re at home, at a coffee shop, or in a meeting room in one of our offices. “It’s been quite the journey over the last few years—we’re very much in a hybrid world,” says Keshav Puttaswamy, a partner director of...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more "
}