{
    "title": "How to try Microsoft Office 2024 right now",
    "date": "2/22/2024",
    "url": "https://www.xda-developers.com/microsoft-office-2024-coming/",
    "text": "Microsoft hasn't announced it yet, but Office 2024 is in the works, and you can try it right now with some fiddling. Microsoft 365 has become a core part of Microsoft's business over the last decade or so. This subscription service gets you access to all the Microsoft Office apps you've always known, like Word or PowerPoint, with frequent feature additions, all for a relatively low monthly price. However, the subscription model isn't for everyone, and some still prefer buying Office outright with a one-time payment for a perpetual license. Since Office 2021, Microsoft has been quiet about a potential new version of Office, but thanks to some sleuthing, we've found evidence that Office 2024 is indeed in the works, and in fact, you can download it right now. The process of doing so is certainly not easy, but if you just can't wait to take a peek at what's next for Microsoft Office, then here's how you can try Office 2024 before anyone else. To grab an early copy of Office 2024, we're relying on Microsoft's structure of update channels, which is used to distribute versions of Office to the users enrolled in said channel. There are a few consumer-facing channels available, but to get access to Office to 2024, we need to grab a build from one of Microsoft's internal channels, called DevMain. Thankfully, you don't need anything like special credentials in order to fetch these builds, just the right programs. We are going to use two awesome open-source projects by a developer named abbodi1406 for downloading as well as the installation of the Office binaries. The first one is called \"Yet Another Office Click To Run URL Generator\" (or YAOCTRU for short), while the second tool is known as \"Yet Another Office Click To Run Installer\" (aka YAOCTRI). Downloading early versions of software always comes with risks, especially when it's not meant for public use. We recommend using a virtual machine or a secondary PC to avoid losing data or impacting your workflow.  Don't copy all the files. The files that start with YAOCTRIR aren't useful in for this process. After Office is successfully installed, you can open any Office app, then go to File > Account to see the Office 2024 branding. Visually, Office 2024 is still very similar to Office 2021, but you can expect many of the changes that have rolled out to Microsoft 365 subscribers in the past three years to show up in this release. This should include the new default font, Aptos, which is already available in the latest builds, though not as the default setting. In case you want to revert back and reinstall the retail/volume build of Office you had earlier, you should use the Office Scrubber project from the same developer. Just download the latest version of the script (v11 at the time of writing), execute it, reboot, initiate the installer of the stable channel release of Microsoft Office, and you're good to go. One thing to note are that you can't currently activate this version of Office 2024 with a retail key. Since we're downloading from a volume licensing channel, only KMS keys would work, meaning you have to be in a business environment. That means you'll only have a bit of time to play around with it and see what it's like before you can't use it anymore. As Microsoft still hasn't acknowledged Office 2024, we can't hazard a guess as to when it will be fully available. For now, though, you can get a taste of using this method.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. DIY enthusiast (i.e. salvager of old PC parts). An avid user of Android since the Eclair days, Skanda also likes to follow the recent development trends in the world of single-board computing. DisplayPort connectivity remains the only viable workaround If you don't want to use ChatGPT but still want to use a chatbot, then these are the best ChatGPT alternatives out there. The MacBook Air is one of the best lightweight laptops, but how does it compare to the new Samsung Galaxy Book 4 Pro? Let's take a look. The Nvidia GeForce RTX 4070 Super brings even more value to the best of the 40-series. A new 2-in-1 Latitude business laptop leads the way with plenty of other refreshes for 2024. Discover how these ergonomic office chairs can transform your workday comfort and well-being. "
}