{
    "title": "Microsoft and OpenAI Pave the Way for AI Cloud Dominance - Techiexpert.com",
    "date": "2/2/2024",
    "url": "https://www.techiexpert.com/microsoft-and-openai-pave-the-way-for-ai-cloud-dominance/",
    "text": "In a significant change within the cloud industry, two distinct paths are emerging, each with its own direction and market dynamics. On one front, the “AI Cloud” is gaining momentum, fueled by Nvidia GPUs and advanced language models. Microsoft and OpenAI are teaming up to come up with super advanced AI services over the internet that one can use and rent. It is like getting access to the latest and coolest AI technology without having to own it. Microsoft, with its Azure cloud business, is at the forefront of the AI Cloud movement. The recent quarterly earnings report revealed a 28% revenue growth, but a closer look raises concerns. Analysts point out that 6 percentage points of this growth are attributed to new AI workloads, leaving the traditional “Cloud 1.0” business with a 22% growth. Investors are concerned that regular computer tasks on the internet might be slowing down. Mark Schilsky, who is an expert in selling tech stuff at Bernstein Research, is a bit worried about the big cloud market. He thinks there might be a slowdown in how much regular tech stuff (not the super smart AI stuff) is growing for Microsoft’s Azure. Financial analysts at Goldman Sachs are wondering if the entire cloud industry is spending less money on regular tech because the super smart AI stuff is growing really fast. Amazon Web Services (AWS), the longstanding giant in the Cloud 1.0 business, is set to report its Q4 earnings later this week. Wall Street anticipates a 13% to 14% year-over-year growth in AWS revenue. However, analysts at Bernstein suggest that investors might be less excited if AWS, historically a high-teens to 20% grower, reports a shift to mid-teens growth. The cloud industry is changing a lot and everyone is watching to see how the smart AI Cloud and the regular Cloud 1.0 are doing. Subscribe to our newsletter to get our newest articles instantly!    Sign in to your account Username or Email Address Password Remember Me  "
}