{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.taipeitimes.com/News/biz/archives/2024/02/23/2003813929",
    "text": "Intel Corp has landed Microsoft Corp as a customer for its made-to-order chip business, marking a key win for an ambitious turnaround effort under chief executive officer Pat Gelsinger. Microsoft plans to use Intel’s 18A manufacturing technology to make a forthcoming chip that the software maker designed in-house, the two companies said at an event on Wednesday. They did not identify the product, but Microsoft recently announced plans for two homegrown chips — a computer processor and an artificial intelligence (AI) accelerator. Photo: AP Intel has been seeking to prove it can compete in the foundry market, where companies produce custom chips for clients. It is a major shift for the semiconductor pioneer, which once had the world’s most advanced chipmaking facilities and kept them to itself. These days, Intel is racing to catch up with companies such as Taiwan Semiconductor Manufacturing Co (台積電), which leads the foundry industry. Meanwhile, Microsoft is looking to secure a steady supply of semiconductors to power its data-center operations — especially as demand for AI grows. Designing its own chips also lets Microsoft fine-tune the products to its specific needs. “We need a reliable supply of the most advanced, high-performance and high-quality semiconductors,” Microsoft chief executive officers Satya Nadella said in a statement. “That’s why we are so excited to work with Intel.” The broader industry has struggled to get enough advanced silicon — particularly Nvidia Corp’s highly prized accelerator chips, which help develop chatbots and other AI services. For Intel, securing a large customer for its foundry business should help reassure investors that Gelsinger’s comeback bid remains on track. His plan involves building out the chipmaker’s factory operations to handle the increased load — a costly gamble — as well as restoring Intel’s once-dominant technological prowess. The company is looking to governments in the US and Europe to help defray the costs, and seeing Microsoft on board might help that effort. Intel has held talks with the administration of US President Joe Biden to secure more than US$10 billion in subsidies under the Chips and Science Act, Bloomberg reported last week. Microsoft and cloud-computing rivals Amazon.com Inc and Alphabet Inc’s Google are among the largest buyers of advanced chips, which they use to power their data centers. They have increasingly turned toward using their own designs — a trend that’s hurt Intel in its most lucrative business. Acting as a foundry for Microsoft and others could help grab back at least a portion of that lost revenue. DECOUPLING?\n                                         In a sign of deeper US-China technology decoupling, Apple has held initial talks about using Baidu’s generative AI technology in its iPhones, the Wall Street Journal said                                        China has introduced guidelines to phase out US microprocessors from Intel Corp and Advanced Micro Devices Inc (AMD) from government PCs and servers, the Financial Times reported yesterday.\r\nThe procurement guidance also seeks to sideline Microsoft Corp’s Windows operating system and foreign-made database software in favor of domestic options, the report said.\r\nChinese officials have begun following the guidelines, which were unveiled in December last year, the report said. \r\nThey order government agencies above the township level to include criteria requiring “safe and reliable” processors and operating systems when making purchases, the newspaper said.\r\nThe US has been aiming to boost domestic semiconductor ’SWARM OF BEES’:\n                                        Central bank Governor Yang Chin-long last week described the enthusiasm for exchange-traded funds as a “herding effect” in the market                                        A record rally in Taiwanese stocks is luring retail investors to pile into exchange-traded funds (ETFs), as local regulators stepped up warnings on the herding behavior.\r\nTwo new stock ETFs this month raised a combined NT$223.1 billion (US$7.05 billion), with the latest one which ended subscriptions on Friday last week setting a new record. \r\nThis brings the total inflows into equity ETFs to about NT$340 billion, more than half of last year’s, underscoring how the global market frenzy around artificial intelligence (AI) is spurring local demand for exposure to a technology-heavy market.\r\nCentral bank Governor Yang Chin-long (楊金龍) last week described the Hon Hai Technology Group (鴻海科技集團) yesterday showcased its latest liquid-cooled server racks at Nvidia Corp’s developers’ conference in San Jose, California, with the products aimed at helping customers build artificial intelligence (AI) data centers.\r\nThe racks are developed by Hon Hai subsidiary Ingrasys Technology Inc (鴻佰科技) and support Nvidia’s new GB200 flagship chip, Hon Hai said in a statement.\r\nTo fuel a new wave of generative AI applications, Ingrasys is leveraging the Nvidia GB200 NVL72, a next-generation AI liquid-cooled rack solution, Hon Hai said. \r\n“Our collaboration with Nvidia helps us deliver the latest accelerated computing technologies to our customers so they can The US is to award Intel Corp US$8.5 billion in grants and as much as US$11 billion in loans to help fund an expansion of its semiconductor fabs, the US Department of Commerce announced yesterday, marking the largest award from a program designed to reinvigorate the nation’s chip industry.\r\nThe package would support more than US$100 billion in US investments from Intel, including efforts to produce cutting-edge semiconductors at large-scale plants in Arizona and Ohio, the department said.\r\nThe money would also help pay for equipment research and development, and advanced packaging projects at smaller facilities in Oregon and New Mexico.\r\nIn addition, "
}