{
    "title": null,
    "date": "2/15/2024",
    "url": "https://uwm.edu/engineering/uwm-alum-and-microsoft-chairman-and-ceo-satya-nadella-marks-ten-years-since-taking-the-lead-at-the-worlds-largest-company/",
    "text": "It’s been a great decade for Satya Nadella (’90 MS Computer Science), who took over as CEO of Microsoft Corp. on Feb. 4, 2014. Since then, he’s led the company to its present pinnacle of success, with the company now valued at $3 trillion. A few of his recent accolades in the last year include: The company’s rise has coincided with its support for STEM education and automation research at UWM with the College of Engineering & Applied Science as the main recipient. “Microsoft’s support of UWM has revolved around some of the same priorities that fueled the company’s business in the last decade,” said Brett Peters, dean of UWM’s College of Engineering & Applied Science. “For instance, Microsoft donated credits of its leading Cloud processing software service, Azure, to UWM’s Connected Systems Institute. And Satya and his wife Anu have expanded that to also focus on workforce development and diversity, with their generous support of our local students.” Support for UWM research Microsoft has been a key partner in UWM’s Connected Systems Institute (CSI), a statewide research hub that brings together academia, industry and government to solve real-world problems using the industrial internet of things. In 2019, Microsoft gave UWM more than $1.5 million in cash, Microsoft Azure cloud computing credits and Surface Hub devices to advance CSI. Microsoft followed that up recently, in January 2024, with a second donation of $1.2 million to CSI. The gift will be used to educate Wisconsin’s talent pipeline for Industry 4.0 manufacturing, which allows small and medium manufacturers to integrate new technologies, such as the internet of things, AI and smart robotics, into their production processes. “CSI, with the help of Microsoft, has moved rapidly into the AI space with the hopes of providing tangible technology solutions to manufacturers,” said Microsoft Chief AI Officer Balamurugan Balakreshnan. “For example, CSI recently completed research on an AI vision system and deployed at CSI an AI chatbot that assists manufacturers on the shop floor in accessing information quickly.” Shamar Webster (’23 MS Computer Science) worked with Balakreshnan in creating the factory chatbox last fall in his final semester before graduation. Scholarships for students from underserved communities In 2021, Nadella and wife Anu Nadella also donated $2 million to support scholarships for undergraduate students from marginalized and underserved communities, preparing them with the skills to pursue careers in computer science, data science and information technology. The gift also funds expanded student services, such as advising, mentoring and tutoring, as well as emergency grant support to help these students remain successful in pursuing their degrees. Finally, the gift supports pre-college programming to encourage students from marginalized and underserved communities to enroll in these STEM fields. The College of Engineering & Applied Science welcomed the first and second cohorts of scholarship winners with full-ride scholarships in Fall 2022 and 2023, respectively. In 2018, Nadella made a $250,000 contribution to an endowed scholarship fund set up in emeritus professor K. Vairavan’s name. Many computer science, electrical and computer engineering students have benefited annually from this fund. Nadella grew up in the southern India and earned a bachelor’s degree in electrical engineering at Mangalore University. He moved to the U.S. to study at UWM. In 2013, he received the UWM Chancellor’s Innovation Award for his leadership of Microsoft’s Server & Tools Division, a year before being named as CEO of Microsoft. In 2021, “Chairman” was added to his title. View all View all © 2024 Board of Regents of the University of Wisconsin System "
}