{
    "title": "Microsoft to build new data centre in Centurion",
    "date": "2/12/2024",
    "url": "https://www.citizen.co.za/lifestyle/technology/microsoft-build-data-centre-centurion-sa/",
    "text": "Home » Lifestyle » Technology and Science By Faizel Patel Senior Digital Journalist 3 minute read 12 Feb 2024 07:33 am Microsoft last week published an advertisement in a number of newspapers providing details of its intention to build the data centre. Photo: Microsoft South Africa will be getting a new data centre in Centurion, north of Johannesburg, tech giant Microsoft said. Microsoft last week published an advertisement in a number of newspapers providing details of its intention to build the data centre campus situated in Kosmosdal in Centurion, Gauteng. Still in the early phases of development, Microsoft said it aims to build its cloud infrastructure in new areas of South Africa to meet “growing demand” from the public sector and private organisations for cloud and AI services and solutions in Africa. In March 2018, Microsoft became the first hyperscale public cloud provider to provide services from data centres in Africa. “We look forward to working with the municipality, local organisations, and the residents of Kosmosdal as we develop our data centre plans in a sustainable way,” Microsoft said. Microsoft has a 30-year history in South Africa. The software giant said it is committed to accelerating the pace of technology transformation and digital enablement in the country, through key investments in infrastructure, innovation, and skills and enterprise development, to benefit all South Africans. “This data centre campus represents the next step in Microsoft’s commitment to enabling and accelerating the pace of digital transformation in South Africa, and Africa, in an inclusive, trusted, and responsible manner.” ALSO READ: AI tools will manage time, boost work, but won’t take over jobs, Microsoft says Microsoft already has two current two data centres – located in Johannesburg and Cape Town In 2022, the company expanded the cloud service offerings in both SA locations, adding the Dynamics 365 and Power Platform. Microsoft said it will share more information as its plans for the data centre are formalised. Meanwhile, with Artificial Intelligence (AI) advancing at rapid speed, Microsoft said that while AI tools will help manage time and boost cognitive work, it will not take over jobs. Microsoft demonstrated the power of AI during the Microsoft Africa AI Journalist Academy this month which was held virtually across select African countries, including South Africa. Experts at the forum highlighted the rapidly evolving landscape of generative AI, noting its emergence as a crucial technology of our era, as evidenced by the $20 billion funding in Gen AI startups over the past three years. ALSO READ: Google launches Gemini Advanced AI tool in South Africa Catch up with the latest news from The Citizen on WhatsApp by following our channel. Click here to join. Click here to get The Citizen news and updates on Whatsapp. Do not miss a single story.Get all the latest news in your inbox. Access to the top content, vouchers and other member only benefits 2024 The Citizen. All Rights Reserved. "
}