{
    "title": "Microsoft's Move in Telecom - 5G Partnership with Etisalat and AI \nInnovations Reshape Industry",
    "date": "3/1/2024",
    "url": "https://www.tradingview.com/news/benzinga:5008caee0094b:0-microsoft-s-move-in-telecom-5g-partnership-with-etisalat-and-ai-innovations-reshape-industry/",
    "text": "Microsoft Corp MSFT is intensifying its efforts to become a significant player in the telecom equipment market, traditionally dominated by giants like Huawei Technologies. The software behemoth has inked a deal with Etisalat (e&), headquartered in Abu Dhabi, to construct a 5G standalone network across the United Arab Emirates. This collaboration marks Microsoft’s second major telecom project, following a partnership with AT&T, leveraging its Azure Operator Nexus hybrid cloud, Nikkei Asia reports. Announced at the Mobile World Congress in Barcelona, the world’s largest telecom industry event, this move is a significant stride for Microsoft and a victory for the Open RAN initiative. Open RAN seeks to democratize the telecom infrastructure market, long ruled by a few key players, by promoting common standards for base stations and enhancing competition and innovation. The launch of the AI radio access network (RAN) Alliance alongside industry leaders such as Nvidia Corp NVDA, Ericsson ERIC, Softbank, and T-Mobile US, Inc TMUS further underscores Microsoft’s commitment to integrating AI into connectivity solutions, showcasing its potential to reshape the future of telecom infrastructure. Meanwhile, Microsoft Corp, OpenAI, and Nvidia are backing Figure AI, a Silicon Valley startup focused on creating AI-powered humanoid robots, with a substantial investment of $675 million, elevating the company’s worth to $2.6 billion. This financial boost will enhance AI training, robotics manufacturing, and engineering capabilities. CEO Brett Adcock anticipates these robots will soon be operational commercially, potentially occupying up to 10 million job roles in the U.S. that are undesirable or hazardous. The funding round attracted notable investors such as Bezos Expeditions, Parkway Venture Capital, and Intel Capital. Price Action: MSFT shares are trading lower by 0.22% at $412.71 on the last check Friday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo by Volodymyr Kyrylyuk on Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @profitable_trades @TradingView @ozonlayerfx @aggressivecalculator @most_luxurious_lifestyle @life_of_lorena.fx @chartfeed @tradingview @TradingView @fxdelta @lifestylewith_ashley26 @TradingView @aitor_avatar @rok_trader @Cenobar @trading_tools.ir @Market Mentor Network @itzi71 Whatever the trade "
}