{
    "title": "Microsoft hits $3 trillion value, only second to Apple",
    "date": "1/25/2024",
    "url": "https://www.republicworld.com/business/industry/microsoft-hits-3-trillion-value-only-second-to-apple/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated January 25th, 2024 at 19:21 IST Microsoft briefly pipped Apple Inc., which became world’s first company to hit $3 trillion. American multinational technology corporation Microsoft has said its stock market value crossed the $3 trillion mark for the first time. Apple is presently the most capitalised stock on Wall Street since the beginning of 2024. The Bill Gates-owned operating systems and product company on Wednesday retained its place as the world's second most valuable company, just behind Apple. It briefly surpassed Apple to become the most-valuable company in January. The two companies have been racing for the tag of the most capitalised stock on Wall Street since the beginning of the year. Microsoft crossing $3 trillion market valuation comes as part of its foray into artificial intelligence, and optimism over emerging technologies fuelling a seemingly unstoppable advance in the software giant, Bloomberg reported. The stock rose as much as 1.3 per cent to $403.95, which resulted in the market capitalisation of $3 trillion. The milestone secures the Redmond, Washington-based company's status as one of the largest public stocks. Notably, Microsoft is among the so-called Magnificent 7. The company gained about 57 per cent last year, fuelling the market’s advance over 2023. Upward trends have continued into this year, with a 7.4 per cent rise which exceeds the 4.6 per cent gain of the Nasdaq 100 Index. Notably, Microsoft accounts for 7.3 per cent of the S&P 500 Index. Most of the company's gain is on the back of investor interest in artificial intelligence, with a potential to accelerate growth in both earnings and revenue. Microsoft's partnership with OpenAI Inc., has resulted in the company becoming the biggest gainer from the benefits of AI. It has also released AI-supported services to customers. A demand for services in the AI segment and cloud computing which supports it, is projected to support Microsoft’s growth in the long term. Revenue for the company is expected to rise to about 15 per cent in the 2024 fiscal year, at a speedier rate than the overall tech sector, Bloomberg Intelligence data reflects. This growth has resulted in Microsoft being one of the most popular stocks on Wall Street, with over 90 per cent of the analysts recommending buying shares, and the average analyst price target points to upside of about 7 per cent from current levels. (With agency inputs) Published January 25th, 2024 at 19:20 IST Send us your views, we’ll publish them. This section is moderated. Viral: 5-ft Alligator Discovered Inside The Stomach Of An 18-Foot Python A Terrorist is a Terrorist in Any Language: EAM Jaishankar in Singapore RSP Chief Mahadev Jankar Pledges Support to BJP-Led Mahayuti AP Assembly Polls: Pawan Kalyan's Janasena Announces 11 More Candidates BJP Declares Six More Candidates; All Names Out for LS Seats in Gujarat BJP Fields State Chief Surendran Against Rahul Gandhi in Wayanad BJP Fields Sandeshkhali Victim Rekha Patra Against Shahjahan's Aide Delhi Crime: 4-Year-Old Girl Raped, Police Releases Statement BJP Drops Varun Gandhi in 5th List: Know Who Will Contest from Pilibhit Drew Barrymore Admits Feeling 'Shame' Around Her Divorce © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}