{
    "title": "Microsoft's Russian breach teaching: activate multi-factor authentication \n(MFA) ASAP",
    "date": "1/27/2024",
    "url": "https://mspoweruser.com/microsofts-russian-breach-teaching-activate-multi-factor-authentication-mfa-right-now/",
    "text": "Follow us Share this article Latest news 2 min. read Published on January 27, 2024 published on \n\nJanuary 27, 2024 Share this article Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Microsoft confirmed today that unauthorized actors gained access to a limited number of internal email accounts, including those of some executives and employees. The company attributed the breach to a compromised legacy test account that lacked multi-factor authentication (MFA) safeguards. According to Microsoft’s official statement, the incident involved a technique known as password spraying, where attackers attempt multiple password combinations on a specific account. The actors gained a foothold within the company’s network by exploiting a legacy test account without MFA enabled. They subsequently compromised an OAuth application, granting them access to several employee email accounts. Microsoft detected the unauthorized access on January 12, 2024, and immediately took steps to contain the breach and remediate the vulnerability. The company confirmed that the compromised accounts belonged to a “very small percentage” of its employee base. The nature and extent of the accessed data remain under investigation. In response to the incident, Microsoft emphasized its commitment to strengthening its security posture. The company announced plans to accelerate the rollout of MFA across all accounts, including legacy systems, and to conduct a comprehensive review of its security protocols. The incident has raised concerns about cybersecurity practices within the tech industry, particularly the importance of implementing robust authentication measures like MFA. More here. More about the topics: Data Breach Devesh Beri Tech Journalist These are the things that motivate me - creating informative and helpful content, pursuing my passion for motorsports and music, engaging in expeditions, maintaining a healthy lifestyle, and spending time with my adorable cat Taco. Devesh Beri Tech Journalist Devesh is our tech journalist. His main mission is to break and break down the complex jargon-y tech news for MSPowerUser readers. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}