{
    "title": "Audiencerate Joins the Microsoft Partner Ecosystem to Explore New Markets \nand Consolidate Its Presence Globally",
    "date": "1/11/2024",
    "url": "https://finance.yahoo.com/news/audiencerate-joins-microsoft-partner-ecosystem-160600010.html",
    "text": "MILAN, January 11, 2024--(BUSINESS WIRE)--Audiencerate, a company that operates in the data management sector for marketing and advertising, today announces its entry into the Microsoft partner ecosystem, stating the start of a strategic collaboration to promote the adoption of its Customer Data Platform to an increasingly broader audience of marketers, thus accelerating its global expansion and achieving a leadership position in the MarTech sector also thanks to Microsoft's digital innovation. Audiencerate enters the AI Cloud Partner Program, which allows each partner to leverage a complete portfolio of value-added solutions and technologies by exploiting Artificial Intelligence and the power of the Microsoft Cloud platform. The AI Cloud Partner Program integrates the entire partner business cycle, from onboarding, skilling, go-to-market and co-selling projects, adding access to new specific offers and AI-specific benefits. Audiencerate also participates in Microsoft's ISV Success program, offering personalized support, technical expertise and resources for business development and growth through Microsoft marketplace. Thanks to its presence in the Microsoft marketplace, Audiencerate aims at scaling globally, improving accessibility and bringing the advanced solutions of its CDP to an increasingly wider audience. The agreement also includes the integration of generative AI solutions, which will allow Audiencerate to offer even more sophisticated and customized solutions for different market segments, helping to strengthen their presence on the MarTech market. Marco del Tongo, CEO of Audiencerate says: \"I am excited about this strategic partnership, which will help us grow in the marketer’s data platform market. This collaboration will allow us to develop new versions of the CDP, incorporating the use of AI and thus opening up new business opportunities such as the development of specific solutions for vertical markets, fintech for example.\" Gianluca Leotta, business lawyer and main investor of Audiencerate, comments: \"The partnership with Microsoft will allow us to improve the levels of security and reliability of Audiencerate's new Customer Data Platform, guaranteeing compliance with the regulations in force in the various countries of the world using the Azure cloud. The implementation and development of new versions of the CDP that will leverage Microsoft's AI and BI will guarantee an even more effective and valuable use of data by Audiencerate's client companies.\" \"We are happy to support Audiencerate in its growth path in the global market. The partner ecosystem has always played a crucial role as a driver for the digital transformation of the country and an accelerator of innovation. The programs dedicated to partners represent valuable tools to accompany the realities of the supply chain in the acquisition of new skills, in the development of new solutions and in the creation of new projects for the benefit of all. Together we can help the local realities to face today's challenges\" explains Vincenzo Esposito, CEO of Microsoft Italy. Microsoft Microsoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more. More information about Microsoft is available at https://www.microsoft.com/it-it/ Audiencerate Audiencerate leads companies and brands towards effective and privacy-compliant audience targeting, through innovative technologies and advanced use of Artificial Intelligence. The goal is to offer cutting-edge marketing solutions that enhance the use of secure and reliable data. For more information, visit https://www.audiencerate.com/ View source version on businesswire.com: https://www.businesswire.com/news/home/20240110649931/en/ Contacts Microsoft Italia https://news.microsoft.com/it-it/ Chiara Mizzi, Director of External Relationschiaram@microsoft.com Roberta Bertolotti, Senior Communications Managerroberb@microsoft.com BCW Marta Grassinimarta.grassini@bcw-global.com – Tel. +39 346 9565753Martina Navamartina.nava@bcw-global.com – Tel. +39 320 8255390 Audiencerate Italia Marco del Tongo, Managing Directormarco.deltongo@audiencerate.com Gianluca Leotta, Board Member and Lead Investorgl@audiencerate.com Claudio Codispoti, Chief Product Marketing Officerclaudio.codispoti@audiencerate.com – Tel. +39 347 0488251 "
}