{
    "title": "Microsoft earnings: What to expect from Azure, Office and AI",
    "date": "1/30/2024",
    "url": "https://www.marketwatch.com/story/microsoft-earnings-what-to-expect-from-azure-office-and-of-course-ai-65115a56",
    "text": "Artificial intelligence will be the name of the game once again when Microsoft Corp. reports earnings Tuesday afternoon. AI is an engine for Microsoft’s \n        MSFT,\n        -0.15%\n       Azure cloud-computing business, and analysts expect that business to have grown at a 27% rate on a constant-currency basis during the latest quarter. They have the same growth projection for the current quarter as well. “While macro continues to linger, we have broadly heard of stabilization and in some cases acceleration in cloud consumption,” Jefferies analyst Brent Thill wrote recently. Meanwhile, Wall Street will also be watching to see how AI is impacting the company’s software portfolio. Microsoft is an investor in OpenAI, and it’s been putting AI features within its software products lately, including through the Copilot launch for Microsoft 365 enterprise customers late last year. Evercore ISI’s Kirk Materne wrote that “the interest level in Copilot is extremely high,” and investors will want to see how that factors into the company’s financials. Wolfe Research analyst Alex Zukin, meanwhile, saw a buying opportunity. “We see this quarter as another opportunity to buy before expectations start to get out of control,” he wrote. “While our preview does call for Azure acceleration and Copilot upside, our view is that sentiment remains mixed.” See more: Microsoft earnings are on deck, and the whole software sector is riding on them Here are the key numbers to watch in the fiscal second-quarter report. Earnings: The FactSet consensus calls for $2.77 in fiscal second-quarter adjusted earnings per share, up from $2.32 in the year-earlier period. Revenue: Analysts tracked by FactSet are modeling $61.1 billion in revenue, up from $52.7 billion a year before. The consensus view calls for 10% growth, to $18.8 billion, in revenue from the productivity and business-processes segment, which houses Office. Analysts are looking for Intelligent Cloud revenue to rise 18% to $25.3 billion. That unit includes Azure. The More Personal Computing business, which includes Xbox and Windows, is expected to have grown 18% to $16.8 billion. Stock movement: Microsoft shares have gained 21% over the past three months, and they’re up 69% over a 12-month span. The stock has gained following two of the company’s past five earnings reports, though it gained 3.1% after the most recent report. Of the 52 analysts tracked by FactSet who cover Microsoft’s stock, 48 have buy ratings and four have hold ratings. Guggenheim analyst John DiFucci said that the company’s guidance of 16% constant-currency Office 365 commercial revenue growth looks “achievable” as it bakes in “a drastic decline” in new annual recurring revenue. “While we do not expect a sizable impact from M365 Copilot…in the quarter, the business should continue to benefit from the combination of broad price increases that started to take effect in March 2022, renewals of sweetener E3 deals from three years ago at much higher prices, and incentivized upgrades to the higher-priced E5 [plan],” he wrote. Truist Securities analyst Joel Fishbein will be focused on the company’s security commentary. “Historically, this has been the quarter that the company gives the size of its security business,” he wrote recently. “Based on these disclosures, we believe that MSFT is the largest cybersecurity vendor in the world. We believe that the segment will be given extra attention following the reported breach two weeks ago.” Read: These 4 software stocks are ‘underloved.’ Here’s what could get them appreciated. Morgan Stanley’s Keith Weiss will be looking for clues about the prospect of an Azure acceleration. “Despite optimism around growing AI contributions, near-term investor expectations have been kept in check by third-party data releases (which may not be fully capturing [generative] AI contributions, in our view),” he wrote. As such, the focus has largely been “on how to think about generative AI’s contribution to results and Microsoft’s potential to drive an acceleration in Azure growth in the back half of FY24 versus management’s commentary looking for constant currency Azure growth in [the fiscal second half] to ‘remain roughly stable compared to Q2’ against easier [year-over-year] compares,” Weiss continued. Alphabet earnings: What to expect from the Google parent company The latest sign of demand issues for Tesla? A reported production cutback in China. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}