{
    "title": null,
    "date": "1/18/2024",
    "url": "https://arstechnica.com/ai/2024/01/report-microsofts-ai-infusion-hasnt-helped-bing-take-share-from-google/",
    "text": "Front page layout Site theme Andrew Cunningham\n    -      Updated \nJan 18, 2024 9:52 pm UTC Not quite one year ago, Microsoft announced a \"multi-year, multi-billion dollar investment\" in OpenAI, a company that had made waves in 2022 with its ChatGPT chatbot and DALL-E image creator. The next month, Microsoft announced that it was integrating a generative AI chatbot into its Bing search engine and Edge browser, and similar generative AI features were announced for Windows in the apps formerly known as Microsoft Office, Microsoft Teams, and other products. Adding AI features to Bing was meant to give it an edge over Google, and reports indicated that Google was worried enough about it to accelerate its own internal generative AI efforts. Microsoft announced in March 2023 that Bing surpassed the 100 million monthly active users mark based on interest in Bing Chat and its ilk; by Microsoft's estimates, each percentage of Google's search market share that Bing could siphon away was worth as much as $2 billion to Microsoft. A year later, it looks like Microsoft's AI efforts may have helped Bing on the margins, but they haven't meaningfully eroded Google's search market share, according to Bloomberg. Per Bloomberg's analysis of data from Sensor Tower, Bing usage had been down around 33 percent year over year just before the AI-powered features were added, but those numbers had rebounded by the middle of 2023. Microsoft hasn't given an official update on Bing's monthly active users in quite a while—we've asked the company for an update, and will share it if we get one—though Microsoft Chief Marketing Officer Yusuf Medhi told Bloomberg that \"millions and millions of people\" were still using the new AI features. StatCounter data mostly tells a similar story. According to its data, Google's worldwide market share is currently in the low 90s, and it has been for virtually the entire 15-year period for which StatCounter offers data. Bing's worldwide market share number over the same period has been remarkably stable; it was about 3.5 percent in the summer of 2009, when what had been known as Live Search was renamed Bing in the first place, and as of December 2023, it was still stuck at around 3.4 percent. Recent US data is slightly more flattering for Microsoft, where Bing's usage rose from 6.7 percent in December 2022 to 7.7 percent in December 2023. But that doesn't necessarily suggest any kind of AI-fueled influx in new Bing search users—usage remained in the mid-to-high 6 percent range through most of 2023 before ticking up right at the end of the year—and Bing's US usage has floated in that same 6–7 percent zone for most of the last decade. It even seems like Microsoft is making moves to distance its AI efforts from Bing a bit. What began as \"Bing Chat\" or \"the new Bing\" is now known as Windows Copilot—both inside Windows 11 and elsewhere. Earlier this week, the Bing Image Creator became \"Image Creator from Designer.\" Both products still feature Bing branding prominently—the Copilot screen in Windows 11 still says \"with Bing\" at the top of it, and the Image Creator tool is still hosted on the Bing.com domain. But if these new AI features aren't driving Bing's market share up, then it makes sense for Microsoft to create room for them to stand on their own. That's not to say Google's search dominance is assured. Leipzig University researchers published a study earlier this week (PDF) suggesting Google, Bing, and the Bing-powered DuckDuckGo had seen \"an overall downward trend in text quality,\" especially for heavily SEO-optimized categories like purchase recommendations and product reviews. When asked about Bing's active user numbers, a Microsoft spokesperson released the following statement to Ars: \"With the introduction of Copilot last year, we set out to reinvent the way people find answers; building upon traditional search methods with new conversational tools that better harness the world's knowledge. We've already driven tremendous results and growth for Copilot, with more than 5 billion chats to date. The search industry is in the midst of a transformation as AI is helping us turn information into action. We are excited to see how Copilot continues to advance new behaviors in this next era of search.\" January 18, 2024: We've updated this article to add a statement from Microsoft. Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox. Sign me up → CNMN Collection\n  WIRED Media Group\n  © 2024 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 1/1/20) and Privacy Policy and Cookie Statement (updated 1/1/20) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights |  Do Not Sell My Personal Information\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices "
}