{
    "title": "Introducing Microsoft Copilot for Finance in Microsoft 365",
    "date": "2/29/2024",
    "url": "https://www.microsoft.com/en-us/microsoft-365/blog/2024/02/29/introducing-microsoft-copilot-for-finance-transform-finance-with-next-generation-ai-in-microsoft-365/",
    "text": "The finance department is the heart of the organization, juggling a myriad of critical, yet complex tasks—from quote-to-cash processes like credit and collections to risk management and compliance. Financial teams are not only responsible for these mandatory, labor-intensive operations, but are increasingly tasked with real-time insights into business performance and recommendations for future growth initiatives. In fact, 80% of finance leaders and teams face challenges to take on more strategic work beyond the operational portions of their roles.¹ On the one hand, teams are poised and ready to play a larger role in driving business growth strategy. On the other hand, however, they can’t walk away from maintaining a critical and mandatory set of responsibilities. Microsoft is introducing a solution to help finance teams reclaim time and stay on top of the critical decisions that can impact business performance. Microsoft Copilot for Finance is a new Copilot experience for Microsoft 365 that unlocks AI-assisted competencies for financial professionals, right from within productivity applications they use every day. Now available in public preview, Copilot for Finance connects to the organization’s financial systems, including Dynamics 365 and SAP, to provide role-specific workflow automation, guided actions, and recommendations in Microsoft Outlook, Excel, Microsoft Teams and other Microsoft 365 applications—helping to save time and focus on what truly matters: navigating the company to success. By harnessing AI, it automates time-consuming tasks, allowing you to focus on what truly matters. Finance teams play a critical role in innovating processes to improve efficiency across the organization. As teams look to evolve and improve how time is spent to support more strategic work, it’s evident there are elements of operational tasks that are more mundane, repetitive, and manually intensive.  Instead of spending the majority of their day on analysis or cross-team collaboration, 62% of finance professionals are stuck in the drudgery of data entry and review cycles.² While some of these tasks are critical and can’t be automated—like compliance and tax reporting—we also hear from majority of finance leaders that they lack the automation tools and technology they need to transform these processes and free up time.¹ With the pace of business accelerating every day, becoming a disruptor requires investing in technology that will drive innovation and support the bottom line. In the next three to five years, 68% of CFOs anticipate revenue growth from generative AI (GenAI).³ By implementing next-generation AI to deliver insight and automate costly and time-intensive operational tasks, teams can reinvest that time to accelerate their impact as financial stewards and strategists. Copilot for Finance provides AI-powered assistance while working in Microsoft 365 applications, making financial processes more streamlined and automated. Copilot for Finance can streamline audits by pulling and reconciling data with a simple prompt, simplify collections by automating communication and payment plans, and accelerate financial reporting by detecting variances with ease. The potential time and cost savings are substantial, transforming not just how financial professionals work, but how they drive impact within the organization. Users can interact with Copilot for Finance in multiple ways. It both suggests actions in the flow of work, and enables users to ask questions by typing a prompt in natural language. For example, a user can prompt Copilot to “help me understand forecast to actuals variance data.” In moments, Copilot for Finance will generate insights and pull data directly from across the ERP and financial systems, suggesting actions to take and providing a head start by generating contextualized text and attaching relevant files. Like other copilot experiences, users can easily check source data to ensure transparency before using Copilot to take any actions. Copilot for Finance connects to existing financial systems, including Dynamics 365 and SAP, as well as thousands more with Microsoft Copilot Studio. With the ability to both pull insight from and update actions back to existing sources, Copilot for Finance empowers users to stay in the flow of work and complete tasks more efficiently. Copilot for Finance is well versed in the critical and often time-consuming tasks and processes across a finance professional’s workday, providing a simple way to ask questions about data, surface insights, and automate processes—helping to reduce the time spent on repetitive actions. While today’s modern finance team is responsible for a litany of tasks, let’s explore three scenarios that Copilot for Finance supports at public preview. Audits of a company’s financial statements are critical to ensuring accuracy and mitigating risk. Traditionally, accounts receivable managers were required to pull account data manually from ERP records, reconcile it in Excel, and look for inaccuracies manually. With Copilot for Finance, these critical steps are done with a single prompt, allowing AR managers to act on inconsistencies and any delinquencies found with Copilot suggested copy and relevant invoices. “Finance organizations need to be utilizing generative AI to help blend structured and unstructured datasets. Copilot for Finance is a solution that aggressively targets this challenge. Microsoft continues to push the boundary of business applications by providing AI-driven solutions for common business problems. Copilot for Finance is another powerful example of this effort. Copilot for Finance has potential to help finance professionals at organizations of all sizes accelerate impact and possibly even reduce financial operation costs.” The collections process is another critical responsibility as it affects company cash flow, profitability, and customer relationships. Collection coordinators spend their time reviewing outstanding accounts and attempting to reconcile them in a timely manner. This often means phone calls, emails, and negotiating payment plans. With Copilot for Finance, collection coordinators can focus their time on more meaningful client-facing interactions by leaving the busy work to Copilot. Copilot for Finance supports the collections process end-to-end by suggesting priority accounts, summarizing conversations to record back to ERP, and providing customized payment plans for customers. Copilot for Finance can also help financial analysts to reduce the risk of reporting errors and missing unidentified variances. Rather than manually reviewing large financial data sets for unusual patterns, users can prompt Copilot to detect outliers and highlight variances for investigation. Copilot for Finance streamlines variance identification with reusable natural language instructions in the enterprise context. A financial analyst can direct Copilot to identify answers for variances, and Copilot will gather supporting data autonomously. Copilot will suggest financial context contacts and will provide auto summaries for streamlined tracking of action items and follow ups. Copilot for Finance can generate fine-tuned financial commentary, PowerPoint presentations, and emails to report to key stakeholders. Microsoft employs thousands across its finance team to manage and drive countless processes and systems as well as identify opportunities for company growth and strategy. Who better to pilot the latest innovation in finance? For the first phase, we worked closely with a Treasury team focused on accounts receivable as well as a team in financial planning and analysis—who need to reconcile data as a part of their workflow before conducting further analysis. After trialing the data reconciliation capabilities in Copilot for Finance, the initial value and potential for scale for these teams was clear. “Financial analysts today spend, on average, one to two hours reconciling data per week. With Copilot for Finance, that is down to 10 minutes. Functionality like data reconciliation will be a huge time saver for an organization as complex as Microsoft.” “The accounts receivable reconciliation capabilities help us to eliminate the time it takes to compare data across sources, saving an average 20 minutes per account. Based on pilot usage, this translates to an average of 22% cost savings in average handling time.” Ready to take the next step? Microsoft Copilot for Finance is available for public preview today. Explore the public preview demo and stay tuned for additional announcements by following us on social. Copilot for Finance joins other Copilot offerings designed for business functions, including Microsoft Copilot for Sales and Microsoft Copilot for Service, both now generally available. For research insights on the future of work and generative AI, subscribe to WorkLab. ¹ Microsoft Future of Finance Trends Report, 2023² Metric of the Month: Time Allocation in Finance, CFO, Perry D. Wiggins. December 7, 2020. ³ Accelerating the GenAI Journey with Use Cases in the Functional and Application Areas, IDC, Mickey North Rizza. February 2024. Help people and teams do their best work with the apps and experiences they rely on every day to connect, collaborate, and get work done from anywhere. "
}