{
    "title": "Microsoft Corporation (MSFT) Appreciated on Excitement Over Generative AI",
    "date": "2/9/2024",
    "url": "https://finance.yahoo.com/news/microsoft-corporation-msft-appreciated-excitement-125634676.html",
    "text": "The Ithaka Group, an investment advisory firm, released the “Ithaka US Growth Strategy” fourth-quarter 2023 investor letter. A copy of the same can be downloaded here. After a difficult 2022, most major market indices rebounded in 2023 with a 42.7% gain for the Russell 1000 Growth (R1G), the strongest performance in about 25 years. In the strong market, the strategy outperformed by rising 18.4% vs the R1G rising 14.2%. The outperformance was entirely due to stock selection, with a slight benefit from sector allocation. In addition, please check the fund’s top five holdings to know its best picks in 2023. Ithaka US Growth Strategy featured stocks such as Microsoft Corporation (NASDAQ:MSFT) in its Q4 2023 investor letter. Headquartered in Redmond, Washington, Microsoft Corporation (NASDAQ:MSFT) is a multinational software company that develops, and licenses software, services, devices, and solutions. On February 8, 2024, Microsoft Corporation (NASDAQ:MSFT) stock closed at $414.11 per share. One-month return of Microsoft Corporation (NASDAQ:MSFT) was 6.60%, and its shares gained 57.40% of their value over the last 52 weeks. Microsoft Corporation (NASDAQ:MSFT) has a market capitalization of $3.077 trillion. Ithaka US Growth Strategy stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its fourth quarter 2023 investor letter: \"Microsoft Corporation (NASDAQ:MSFT) builds best-in-class platforms and provides services that help drive small business productivity, large business competitiveness, and public-sector efficiency. Microsoft’s products include operating systems, cross-device productivity applications, server applications, software development tools, video games, and business-solution applications. The company also designs, manufactures, and sells devices, including PCs, tablets, and gaming/entertainment consoles that all integrate with Azure, its cloud computing service. In the quarter Microsoft’s stock appreciated on the back of excitement surrounding the company’s positioning in the generative AI market and its ability to monetize the coming wave of corporate investment in supercomputing and AI, which will be through both Azure and Microsoft Copilot, the companies new GenAI personal assistant.\" Image by Tawanda Razika from Pixabay Microsoft Corporation (NASDAQ:MSFT) is in first position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 306 hedge fund portfolios held Microsoft Corporation (NASDAQ:MSFT) at the end of third quarter which was 300 in the previous quarter. We discussed Microsoft Corporation (NASDAQ:MSFT) in another article and shared the list of largest companies in the world by revenue. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: 16 Easiest Countries to Immigrate to Without a Degree 12 Most Useless Associate Degrees if You Want a High-Paying Job 20 Fastest Growing Professions in 2024 Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}