{
    "title": "Microsoft Stock: Q2, Cloud Shines But Valuation Is Cloud-High (NASDAQ:MSFT)",
    "date": "2/1/2024",
    "url": "https://seekingalpha.com/article/4666943-microsoft-q2-cloud-shines-but-valuation-is-cloud-high",
    "text": "FinkAvenue  FinkAvenue Microsoft Corporation (NASDAQ:MSFT) recently reported its Q2 numbers as Seeking Alpha has covered here. The stock lost nearly 3% following the report on the market's worst day since September 2023. Interestingly, my most recent coverage of Microsoft was also back in September 2023 right after the company had announced its annual dividend increase. I had rated the stock a \"Hold\" citing the market's struggle for a direction and valuation. Since then, the stock has gone up nearly 21% compared to the market's 9% run. How did Mr. Softie do in Q2? Let's find out in the latest edition of The Good, The Bad, and The Ugly. MSFT Revenue (Seekingalpha.com) MSFT Revenue (Seekingalpha.com) MSFT Azure Rev (Author, data from microsoft.com) MSFT Azure Rev (Author, data from microsoft.com) MSFT Rev and Cost of Rev (Microsoft.com) MSFT Rev and Cost of Rev (Microsoft.com) MSFT Net Debt (Seekingalpha.com) MSFT Net Debt (Seekingalpha.com) The two points below are not directly related to Q2 but it is impossible to review Microsoft's stock at $400 and $3 Trillion market-cap without talking about valuation and the law of large numbers. MSFT PE (YCharts.com) MSFT PE (YCharts.com) MSFT Moving Avgs (barchart.com)  MSFT RSI (stockrsi.com) MSFT Moving Avgs (barchart.com) MSFT RSI (stockrsi.com) The \"new\" Microsoft under Nadella isn't afraid to experiment, as evidenced by the earlier aggressive push towards Copilot. This is now reaping rewards as we are not only seeing improvements in developer productivity but also seeing meaningful partnerships and support coming from outside. The company wasn't afraid to call out its investments (aka increase in expenses) in data centers, cloud, and AI infrastructure during the conference call because the proof is in the pudding. Microsoft has shown time and again that its investments are more likely to pay off than not. It is hard to slap a price target or even a rating on momentum stocks and technology disruptors. Microsoft happens to be both and I acknowledge that investors may miss out on some gains by not buying here. Case in point, since my previous \"Hold\" rating, the stock has gone up more than 20%. But I'd argue that majority of those gains were due to the market picking its direction rather than Microsoft improving fundamentally as a company by 20% (in my previous article, I called out that the market was stalling and that being a reason for my \"Hold\" rating). Acknowledging that Microsoft is one of a kind, I'd be willing to buy the stock at around $340. At $340, the stock would have pulled back around 20% from its all time high of $415 and have a PEG of 1.8. Textbook definition-wise, that PEG would still be pricey but quality rarely comes too cheap. To conclude, Microsoft delivered the classic \"beat and raise\" report but the stock did not rise, unsurprisingly. At 35 times forward earnings and a $3 trillion market capitalization, we can't blame Mr. Market and investors for being cautious about Microsoft here. After a 60% run in the last year and nearly 5 times that in the last 5 years, even the most ardent supporter of the stock would do well to pause here and reevaluate their position in the stock. Given the company's ecosystem and deep-rooted presence in our personal and professional lives, I won't dare rating Microsoft stock a \"Sell\" anytime soon. But, I am very comfortable to say the stock does not deserve to be added at this price. MSFT Chart (Seekingalpha.com) MSFT Chart (Seekingalpha.com) This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of MSFT either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}