{
    "title": "AI Driving Acceleration For Big 3 Cloud Stocks",
    "date": "2/13/2024",
    "url": "https://seekingalpha.com/article/4669865-ai-driving-acceleration-for-big-3-cloud-stocks",
    "text": "koiguo/Moment via Getty Images koiguo/Moment via Getty Images Big Tech's participation in the market's push to all-time highs is becoming increasingly narrow, with NVIDIA Corporation (NVDA), Meta Platforms, Inc. (META), Microsoft Corporation (MSFT), and Amazon.com, Inc. (AMZN) serving as the primary contributors to 2024's rally. Though Alphabet Inc. (GOOG) (GOOGL) fell more than 7% on somewhat disappointing Google ad revenue, Alphabet's Google Cloud, Microsoft's Azure, and Amazon's AWS all shined as generative AI products drove an acceleration in cloud revenue growth in the recent quarter. TradingView TradingView The Big Three's cloud segments are crucial to business performance on both the top and bottom lines: Azure sits as Microsoft's fastest growing segment (excluding Xbox's more than 40 percentage point impact from Activision in Q2), AWS is driving a lion's share of Amazon's operating income, while Google Cloud is now generating more than 10% of revenue as Alphabet's fastest growing segment while expanding its operating margin. Azure witnessed the strongest AI contribution by far, as Microsoft works to extend its lead as the first major tech player to monetize enterprise and consumer AI subscriptions at scale. Azure is also powering a handful of the largest LLMs and AI assistants on the market, from OpenAI's ChatGPT to Meta's Llama and Llama 2 to Microsoft's own Bing Copilot. We highlighted in October in our free newsletter that AI would help drive a 'noticeable acceleration' for Microsoft's revenue this year, and that's exactly what we're seeing: revenue growth accelerated from 8.3% YoY in fiscal Q4 2023 (calendar Q2) to 17.7% YoY in fiscal Q2 2024 (calendar Q4). Azure growth was 30% in fiscal Q2, a 200 bp QoQ acceleration driven by strong demand for consumption-based services. Yet, AI's impact was quite notable: Microsoft said the 30% growth rate for Azure included \"6 points from our AI services.\" MICROSOFT MICROSOFT This 6-point contribution is impressive, given that AI services contributed 3 points to growth last quarter and 1 point in fiscal Q4 - a significant ramp considering the scale that this growth is attached to, with Azure's revenue at a $74 billion run rate. This AI-related growth has helped Azure's growth re-accelerate after seeing decelerating growth for five straight quarters. Azure's AI customer growth has also been rapid, and Microsoft is seeing an increase in larger commitments for Azure. Microsoft reported that Azure AI customers totaled more than 53,000 last quarter, with one-third of these new customers over the past twelve months. That implies a customer growth rate of approximately 50% YoY, given that Microsoft added nearly 18,000 customers through 2023. More than half of the Fortune 500 are using Azure OpenAI Services, highlighting the strength of Microsoft's AI offerings. For Azure specifically, management said on the earnings call that \"customers continue to choose Azure to simplify and accelerate their cloud migrations. Overall, we are seeing larger and more strategic Azure deals with an increase in the number of $1 billion-plus Azure commitments.\" An increase in customer count and an increase in deal size are foundations for sustainable long-term growth and are supportive of further acceleration in the coming quarters. Q4 was a busy quarter for Amazon as it rolled out many new features, capabilities, and hardware designed to capture generative AI demand, with AWS showing a hint of accelerated growth. AWS finally accelerated in Q4 for the first time in two years, with Amazon reporting 13.2% growth in Q4, up just over 1% from Q3's 12%. AWS is now quickly approaching a $100 billion annual run rate, delivering $24.2 billion in revenue in Q4 and $90.8 billion in revenue for 2023. What's more important is that AWS' operating leverage has improved over the last two quarters, with operating income growing at 3x the rate of revenue in Q4. AMAZON AMAZON AWS' operating income increased 39% YoY on a constant currency basis in Q4, with the operating margin increasing 530bp YoY to 29.6%. For the full year, AWS' operating margin was 27.1%, down 140bp YoY as operating leverage decreased in the first half of the year as growth decelerated from the 20% range to the 12% range. AWS remains Amazon's primary generator of operating income (67% of Amazon's total operating income in 2023), a trend that can strengthen with AI driving accelerated customer and revenue growth and decreased costs. CEO Andy Jassy explained that AWS \"added more than $1.1 billion in incremental quarter-over-quarter revenue, which on an FX neutral basis is more than any other cloud provider as far as we can tell.\" AWS' existing customers \"are renewing larger commitments over longer periods and migrations are growing,\" and \"while cost optimization continued to attenuate, larger new deals also accelerated.\" That includes recent agreements with Nvidia to be the first CSP to deploy the GH200 Grace Hopper Superchips with multi-node NVLink technology, and with Salesforce to deepen AI and data integrations between the two. Bedrock is already witnessing strong adoption, with management seeing \"many thousands of customers using the service after just a few months\" as AWS continues to add \"new models from Anthropic, Cohere, Meta with Llama2, Stability AI, and our own Amazon Titan family of LLMs.\" Although AWS' quarterly growth rates look paltry compared to Azure's 30% and Google Cloud in the high-20% range, it is still showing all the ingredients for a sustained AI-driven acceleration. Google Cloud revenue accelerated four points from 22% in Q3 to 26% in Q4, topping $9 billion for the first time, helped by an increasing contribution from AI. Q4's $9.2 billion in revenue implies that Google Cloud is just crossing above a $36 billion annual run rate, less than half of Azure's run rate and 60% below AWS' $90 billion run rate. Google Cloud's operating margin in Q4 came in at 9% compared to 3% in the previous quarter and (0.2%) in Q4 last year. Margins are naturally worse than AWS and Azure as Google Cloud does not benefit from the same efficiencies at scale; however, it is positive to see strong QoQ and YoY improvement in operating margin as it bodes well for future performance at a larger revenue scale. ALPHABET ALPHABET This acceleration in Q4 also helped narrow the gap to 4 percentage points with Azure, compared to 7 percentage points in the previous quarter. Google Cloud had previously topped Azure's growth rates in late 2022 and the first half of 2023 before a rather swift deceleration in Q3. What's crucial here over the next few quarters is Google Cloud continuing to close this growth rate gap with Azure, and possibly surpass Azure once more - it should be theoretically easier to realize higher growth rates at a smaller scale, more so when leveraging AI. Like AWS and Azure, Google Cloud is seeing strong momentum with AI products. Management said that the \"strong demand we are seeing for our vertically integrated AI portfolio is creating new opportunities for Google Cloud across every product area,\" while its generative AI portfolio helped win and expand deals. CEO Sundar Pichai said that \"greater than 70% of gen AI unicorns are using Google Cloud,\" and customers including Anthropic and Mistral AI are building and serving LLMs on Google Cloud's AI Hypercomputer, which combines Google's \"TPUs and GPUs, AI software and Multislice and Multi-host technology to provide performance and cost advantages for training and serving models.\" Google Cloud led the charge in monetizing AI via subscriptions with Duet AI for $30/month, and management noted that customers are \"increasingly choosing Duet AI\" to \"boost productivity and improve their operations.\" Duet AI will soon incorporate Google's Gemini, its multi-modal family of LLMs developed to challenge OpenAI's GPT-4. Google Cloud is \"intensely focused on bringing the benefits of Gemini\" to its cloud customers, and the rollout of the top iteration, Gemini Ultra, at a $20/month subscription could help Google gain share away from OpenAI and thus Azure while increasing revenue. Big Tech's cloud units reported strong growth in calendar Q4, with AI helping drive a noticeable acceleration for Azure, while AWS and Google Cloud touted strong contributions from generative AI products. The trio all possess the necessary ingredients for sustained accelerations or maintained growth at higher levels: increased customer migrations, larger and longer duration contracts, monetization opportunities within the suite via subscriptions, and improvements in productivity and cost reductions for cloud customers. Tech Insider Network Equity Analyst Damien Robbins contributed to this analysis. We offer tech sector coverage that combines fundamentals and technicals. After recommending a stock, we provide entries and exits. Our audited 3-year results of 47% prove we are a top-performing tech portfolio. This compares to popular tech ETFs at negative 46% and the Nasdaq at 19%. We are the only retail team featured regularly in Tier 1 media, such as Fox, CNBC, TD Ameritrade and more. Our services include an automated hedge, portfolio of 10+ positions, broad market analysis, real-time trade alerts PLUS a weekly webinar every Thursday at 4:30 pm Eastern. Learn more. This article was written by Beth Kindig is the CEO and lead technology analyst for the I/O fund and has ten years of experience as a professional in the tech industry. She is a regular speaker at tech conferences and on financial news programs such as: Fox Business, TDAmeritrade, CoinDesk, NPR, Bloomberg TV Asia, Motley Fool podcast, This Week in Startups and more discussing her stock analysis. She is known for making bold calls on tech stocks. Analyst’s Disclosure: I/we have a beneficial long position in the shares of NVDA, MSFT either through stock ownership, options, or other derivatives.   I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}