{
    "title": "Microsoft announces partnership with AI development company 'Mistral AI', \nMistral AI will be able to use Azure ...",
    "date": "2/27/2024",
    "url": "https://gigazine.net/gsc_news/en/20240227-microsoft-azure-mistral-large/",
    "text": " On Monday, February 26, 2024, Microsoft announced that it has formed a multi-year partnership with AI development company   Mistral Large is already available on Aure, and costs are $0.024 (about 3.61 yen) per 1000 tokens for output and $0.008 (about 1.2 yen) per 1000 tokens for input. Microsoft Azure Marketplace https://azuremarketplace.microsoft.com/en-us/marketplace/apps/000-000.mistral-ai-large-offer ◆Text about open source community disappears from Mistral AI top page The top page of Mistral AI's official website states that until February 25, 2024, the day before announcing the partnership with Microsoft, ``We believe in the power of the open source community'' and ``We will continue to make machine learning models and various tools available under permissive licenses.'' It included phrases such as ``Publish,'' and ``We benefit from and give back to the open source community.''  However, on February 26, 2024, when the partnership with Microsoft was announced, the wording was removed from the top page. In response to this, speculation is spreading on the Internet that Mistral AI will stop contributing to the open source community and focus on closed source products. However, on February 26, 2024, when the partnership with Microsoft was announced, the wording was removed from the top page. In response to this, speculation is spreading on the Internet that Mistral AI will stop contributing to the open source community and focus on closed source products. Related Posts: << Next NVIDIA announces 'RTX 500/1000 Ada Generation', a GPU for notebook PCs that allows you to fully utilize AI locally while on the go Prev >> It is reported that EU regulators have started an investigation into Apple's ``abolition of PWA on iPhone'' Feb 27, 2024 10:59:00 in Software, Posted by log1o_hf  "
}