{
    "title": "Microsoft's upcoming custom chip will be made by Intel",
    "date": "2/22/2024",
    "url": "https://au.finance.yahoo.com/news/microsofts-upcoming-custom-chip-will-be-made-by-intel-063323035.html",
    "text": "Intel's relatively new Foundry division — formerly known as Intel Foundry Services until earlier today — has just landed a notable order from a big name. According to Bloomberg and The Wall Street Journal, Microsoft CEO Satya Nadella announced that his company will be tapping into Intel's latest 18A (1.8nm) fabrication process for an upcoming in-house chip design. But given Intel's process roadmap, this means we likely won't be seeing Microsoft's new chip until 2025. While neither company disclosed the nature of said silicon, Microsoft did unveil its custom-made Azure Maia AI Accelerator and Azure Cobalt 100 CPU server chips last November, with an expected rollout some time \"early\" this year to bolster its own AI services. The Cobalt 100 is based on Arm architecture, and it just so happens that Intel has been optimizing its 18A process for Arm designs since April last year (it even became an Arm investor later), so there's a good chance that this collaboration may lead to the next-gen Cobalt CPU. In addition to the usual efficiency improvements as node size decreases, Intel 18A also offers \"the industry's first backside power solution\" which, according to IEEE's Spectrum, separates the power interconnect layer from the data interconnect layer at the top, and moves the former to beneath the silicon substrate — as implied by the name. This apparently allows for improved voltage regulation and lower resistance, which in turn enable faster logic and lower power consumption, especially when applied to 3D stacking. In Intel's Q4 earnings call, CEO Pat Gelsinger confirmed that \"18A is expected to achieve manufacturing readiness in second half '24.\" Given that Intel's very own 18A-based processors — \"Clearwater Forest\" for servers and \"Panther Lake\" for clients — won't arrive until 2025, chances are it'll be a similar time frame for Microsoft's next chip. At Intel's event earlier today, the exec shared an extended Intel Foundry process technology roadmap, which features a new 14A (1.4nm) node enabled by ASML's \"High-NA EUV\" (high-numerical aperture extreme ultraviolet) lithography system. According to AnandTech, this 14A leap may help Intel play catchup after its late EUV adoption for its Intel 4 (7nm) node, though risk production won't take place until the end of 2026. Intel Foundry is the brainchild of Gelsinger, who launched this department right after he assumed the CEO role in February 2021, as part of his ambitious plan to put Intel up against the likes of TSMC and Samsung in the contract chip-making market. Before Microsoft, Intel Foundry's list of clients already include MediaTek, Qualcomm and Amazon. The company still aims to become \"the second largest external foundry by 2030\" in terms of manufacturing revenue, which it believes is achievable as early as this year. A man accused of murdering his nine-year-old stepdaughter and dumping her body in a barrel did something in the lead-up to the alleged crime, a court has been told. Cara Delevingne just posed naked in the new Stella McCartney campaign alongside a pile of trash and a trio of grey Falabella bags  Latrell Mitchell and the Rabbitohs are under immense pressure. Find out more here. Four gunmen are among 11 people arrested following a shooting massacre in a packed Moscow concert hall, according to Russia's President Vladimir Putin.  The men were from Tajikistan, according to Russian news reports.  Mr Putin has claimed the gunmen attempted to flee to Ukraine in the aftermath of the mass shooting, in which at least 133 people were killed. President Biden poked fun at former President Trump for boasting about winning two golf trophies at his own golf club’s awards last night on Sunday. “Congratulations, Donald. Quite the accomplishment,” Biden wrote on X, formerly Twitter. Biden attached a screengrab of Trump’s post earlier in the night on Truth Social. “It is my great honor…  Sunday night's episode finally revealed that Jono McCullough had been texting Ellie Dix behind his partner Lauren Dunn’s back. Read more. Meghan Markle and Prince Harry know little more than the general public about their sister-in-law Kate Middleton’s health status. Here's why. The cruise missile entered the Polish airspace for as long as 39 seconds  The Daily Beast/Getty Images/BBCA controversial British royal commentator is under fire for a “disgusting” tweet ahead of Kate Middleton’s Friday announcement that she has cancer and is undergoing chemotherapy.An hour before the Princess of Wales released the video announcement of her diagnosis, Omid Scobie posted a photo on X, formally known as Twitter, of his alarm clock being set to 6 p.m. GMT. Scobie told The Daily Beast that hearing “there would be an announcement of some kind from the Pala Trump and his MAGA allies have been working for years to pre-rig the 2024 election. Here’s how Team Biden is planning to fight them The Aussie driver's grim revelation does not bode well for his F1 prospects. More here.  The mum with two young kids said she was intrigued by the plant's bizarre 'sweet-smelling' fruit. Locals say she made a dangerous error. Find out why. \"This may feel aggressive, and I do not believe in physical altercation, but when it comes to protecting my daughter, do not cross me,\" she captioned her video. The Giants skipper broke his own rule in the win over the Eagles.  Gary Goldsmith spoke about the family before knowing about his niece Kate Middleton’s cancer diagnosis MAFS' Lucinda Light has revealed some big news that is sure to disappoint fans. Radio host Ben Fordham has made a shock claim about NSW Police Commissioner Karen Webb after she cancelled an interview. 2024 Subaru Crosstrek Review, Pricing, and Specs \"He’s hired a crisis PR manager and lawyers.\" My eyes are not equipped to deal with this. Fancy the ultimate lifestyle change? These countries will pay you to move there. Read more here. "
}