{
    "title": "Microsoft Azure: The Hidden Insights Beneath The Surface (NASDAQ:MSFT)",
    "date": "2/2/2024",
    "url": "https://seekingalpha.com/article/4667196-microsoft-azure-the-hidden-insights-beneath-the-surface-reiterate-buy-rating",
    "text": "Ethan Miller/Getty Images News  Ethan Miller/Getty Images News Microsoft Corporation (NASDAQ:MSFT) fiscal Q2 2024 earnings once again beat expectations, sustaining its leadership position in the artificial intelligence (\"AI\") race. Investors were focused on two main details going into the print, the growth rate of Azure and the uptake of Copilot. While the company didn’t reveal the monetization rate of Copilot, Microsoft did offer valuable insights into the Azure growth story, a key narrative driving the share price. Nexus maintains a \"buy\" rating on Microsoft stock. In the previous article covering Microsoft Azure, we simplified the initiatives the company is taking to improve the profitability of Azure, capitalizing on the AI opportunity in a pragmatic manner. In addition, in August 2023, we discussed the importance of the company’s new data management solution, Microsoft Fabric, the early success of which served as a leading indicator for Azure’s upcoming AI-fueled growth. The fact that customers were increasingly using Fabric for data storage and management was strongly reflective of their intentions to run customized AI models and applications on the Azure platform. Where the data flows, the workloads flow. It is of no surprise then that Microsoft delivered stronger Azure growth this quarter, with CFO Amy Hood revealing on the Q2 2024 Microsoft Earnings Call that: “Azure and other cloud services revenue grew 30% and 28% in constant-currency, including 6 points of growth from AI services.” Nexus, data compiled from company filings Nexus, data compiled from company filings A 30% growth rate marks a faster growth rate than rival Google Cloud, which is trying to catch up to Azure and grew by 25.66% over the same period. For context, market leader AWS saw revenue grow by 13% last quarter. In fact, not only is Microsoft successfully attracting more and more cloud customers, but it is also succeeding at inducing larger enterprises to sign bigger and longer-term contracts with Azure, as CEO Satya Nadella shared on the call: “Overall, we are seeing larger and more strategic Azure deals with an increase in the number of $1 billion-plus Azure commitments. Vodafone, for example, will invest $1.5 billion in Cloud and AI services over the next 10 years as it works to transform the digital experience of more than 300 million customers worldwide.” Such larger deals are important not just because they imply a steady flow of recurring revenue for shareholders, but also incurs the opportunity for Microsoft to cross-sell other Azure services over such long-term contract periods, to optimally monetize sticky customers. For instance, longer-term commitments on the Azure platform improve Microsoft’s ability to sell more data storage and management services like Cosmos DB and Microsoft Fabric, translating to more revenue and earnings for shareholders. But there is more to the long-term growth opportunity. On the earnings call, CEO Satya Nadella delved into customers’ AI workloads on Azure:  “I think it may be helpful to sort of think about, like what is the new workload in AI? The new workload in AI, obviously, in our case starts with one of the frontier -- I mean, starts with the Frontier model Azure OpenAI. But it's not just about just one model, right. So, you first -- you take that model, you do RLHF, you may do some fine-tuning, you do retrieval, which means you are sort of either heating some storage meter or you're heating some compute meters. …you could even say these AI workloads themselves will have a lifecycle which is they'll get rebuilt, then there'll be continuously optimized over time.” So there is a lot to unpack there. Let’s start with clarifying some of the jargon to better understand the insights beneath the surface. Fine-tuning is a technique for customizing a pre-trained AI model, such as OpenAI’s GPT-4 model, to new tasks for companies to utilize in their own processes and services, using their own proprietary data. RLHF stands for Reinforcement Learning from Human Feedback. To put it simply, it is a technique used for training AI models, whereby human assessors provide feedback to the system, in terms of which outputs are preferable, and which responses need to be modified, in order to prevent any undesirable outcomes. Note that these processes can be repetitive in nature as businesses continuously gain new data relating to how consumers use the new AI-powered products and services, requiring more and more fine-tuning and RLHF, driving recurring revenue for Azure. Nadella also mentioned the process of “retrieval,” which refers to AI models finding relevant information from a large collection of documents or data, based on a user’s query. In order for cloud customers to conduct retrieval, they indeed need to store their data on the Azure platform, leading to increased usage of Microsoft’s various data storage and management solutions. In fact, on the last earnings call, Nadella offered details into the increased demand for such services:  “Cosmos DB data transactions increased 42% year-over-year and for those organizations who want to go beyond in-database vector search, Azure AI search offers the best hybrid search solution. OpenAI is using it for retrieval augmented generation as part of ChatGPT. And this quarter, we made Microsoft Fabric generally available, helping customers like Milliman and PwC go from data to insights to action, all within the same unified SaaS solution. Data stored in Fabric's multi-cloud data lake, OneLake increased 46% quarter-over-quarter.” And as these cloud customers launch their own AI-powered products and services and collect more and more consumer data, the amount of data stored and analyzed on Azure will also increase, enabling Azure to generate more revenue from Cosmos DB and Microsoft Fabric, to the benefit of shareholders. Another key point made by the CEO was that these workloads have “lifecycles.” What does he mean by that? Well keep in mind that new and more advanced AI models will continue to be introduced over time, which cloud customers will adopt to power their business services, replacing their old workloads using previous generation models. This will incur processes like fine-tuning and RLHF being conducted all over again, which will repeatedly require more cloud computing instances on Azure, conducive to recurring revenue for shareholders over the long-term. All the major cloud providers are spending heavily on AI infrastructure in order to be able to optimally capitalize on the anticipated surge in cloud computing demand as industries and businesses inevitably transform in this new era. Nonetheless, despite the heavy AI-related capex, Microsoft sustained the operating profit margin for the Intelligent Cloud segment (which includes Azure) at 48%, through a disciplined cost structure and pragmatic growth approach. Nexus, data compiled from company filings Nexus, data compiled from company filings In fact, CFO Amy Hood also outlined how the Microsoft expects company-wide margins to expand this year: “As we scale these investments, we remain focused on driving efficiencies across every layer of our tech stack and disciplined cost management across every team. Therefore, we expect full-year operating margins to be up 1 to 2 points year-over-year, even as AI capital investments drive COGS growth. This operating margin expansion excludes the impact from the Activision acquisition and the headwind from the change in useful lives last year.” As per the disclosures available, Microsoft’s Intelligent Cloud unit boasts the highest operating profit margins out of all three major cloud providers, at 48%, compared with 29.6% for AWS and 9.40% for Google Cloud. (Note that Google Cloud also includes Google Workspace, while for Microsoft the productivity applications business is separate from its cloud services.) So not only is Microsoft delivering compelling cloud revenue growth to take market share, but it is also doing so without compromising profitability, enhancing Microsoft stock’s appeal as an investment security. Copilot monetization details needed to sustain rally: While the market is now convinced about Azure’s AI growth story, another important aspect of the bullish narrative is the rollout of Microsoft’s Copilot assistant for Microsoft 365 productivity suites. After all, the ‘Productivity and Business Processes’ segment accounted for 31% of Microsoft’s total revenue in FY Q2 2024. While the executives offered upbeat commentary regarding the pace of growth for the AI assistant, the lack of financial details and projections regarding the monetization of Copilot was a disappointment for investors. If executives continue to choose not to disclose Copilot monetization figures over the next few quarters, it may undermine stock price performance. MSFT Stock Valuation: Microsoft stock currently trades at a forward P/E of 34.42x, considerably above its 5-year average of 30.39x, given the notable re-rating of the stock over the past year as the market priced in the tech giant’s AI-driven growth prospects. Bears argue that the expensive valuation raises the risk of a correction. Although that being said, the stock isn’t too expensive relative to historical valuations when considering the PEG ratio. While forward P/E is a popular valuation metric, it doesn’t take into consideration the company’s future earnings growth prospects. Oftentimes, a stock’s high P/E ratio can be justified if the company’s earnings are indeed growing at a high rate. And this is where the forward PEG ratio comes in, which measures the forward P/E relative to projected EPS growth rates. The PEG ratio is essentially calculated by dividing a stock’s forward P/E ratio by the estimated earnings growth rate over a period of time. And a PEG ratio of 1 is considered a fairly valued stock, whereby the forward P/E ratio should equate the future growth rate of the company’s earnings. Although it is important to note that highly sought-after growth stocks rarely tend to trade at a PEG of 1, and instead the market often assigns a premium to these stocks’ valuations, based on factors such as market leadership position, product strength and differentiation, confidence in a company’s executive team, as well as balance sheet strength. Microsoft stock currently trades at a forward PEG of 2.30. While this is a lofty valuation, take into consideration that the 5-year average PEG for the stock is 2.28, reflecting the market’s willingness to pay a considerable premium for the investment security given Microsoft Corporation’s dominant market position and safe-haven nature. Hence from this perspective, the stock is trading in-line with its historical valuation, despite the new AI-driven growth prospects. For context, key rivals Amazon and Google are trading at a PEG of 2.34 and 1.28, respectively. So Microsoft stock trades at a similar valuation to Amazon, and a premium relative to Google. Although it is worth noting that Microsoft Azure is much more profitable than Google Cloud. In addition, Microsoft’s flagship business segment, Productivity and Business Processes (selling Microsoft 365 apps), is much better positioned to benefit from AI than Google’s main source of revenue, Search advertising, which is perceived to be disrupted by the generative AI revolution. Therefore, Microsoft stock deserves to trade at a premium relative to Google. So while Microsoft stock is certainly expensive, it should not deter long-term investors from taking a position in the stock, as such high-quality names will rarely trade at a cheap valuation. We maintain a \"buy\" rating on Microsoft Corporation stock. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of MSFT either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}