{
    "title": "Microsoft to invest €3.2bn in doubling AI infrastructure and cloud capacity \nin Germany",
    "date": "2/16/2024",
    "url": "https://www.datacenterdynamics.com/en/news/microsoft-to-invest-32bn-in-doubling-ai-infrastructure-and-cloud-capacity-in-germany/",
    "text": "Will also train up skilled workers Microsoft has committed to investing €3.2 billion ($3.44bn) to double its AI infrastructure and cloud computing capacity in Germany. The investment will span the next two years and focus on the expansion of Microsoft's cloud region in Frankfurt and newly planned infrastructure in North Rhine-Westphalia. The largest economy in Europe is the first to experience serious legislation relating to data centers In total, this will double capacity in the country. Specific details about the development in North Rhine-Westphalia - a region of northwest Germany encompassing Cologne, Dortmund, Essen, and Düsseldorf - have not been shared. “We want to enable the German economy to benefit from AI in order to continue to expand its global leadership position in competitiveness,” said Brad Smith, vice chair and president of Microsoft. He continued: “We see increasing demand for AI applications in key economic sectors such as manufacturing, automotive, financial services, pharmaceuticals, life sciences, and medical technology. Because these industries are fundamentally changing due to economic change, it is important to equip companies in Germany with world-leading technology.” The company said the investment will increase the availability of Microsoft's cloud computing and AI services to small start-ups and large corporations, including their ability to develop and apply AI models. The data centers will reportedly be 100 percent powered by renewable energy. Microsoft announced plans to launch cloud regions in Germany in 2018, with the Germany West Central Azure region becoming widely available in early 2021. The cloud region, when announced, was hosted in three separate data centers. The company also has the Germany North Azure region, though this is listed as \"not supported,\" and is paired with the West Central region. Chancellor Olaf Scholz said: “Microsoft's billion-dollar investment in Germany announced today is very good news for Germany as a business location. Microsoft is thus promoting the necessary structural change in the Rhineland region, advancing the computing infrastructure in our country, and strengthening the German ecosystem around artificial intelligence. Such projects show how attractive the location and the trust of investors in Germany is.” In addition to expanding infrastructure in the country, Microsoft will teach digital skills to more than 1.2 million people in Germany by the end of 2025. Those training programs will focus on AI skills, and will include the first professional certificate for generative AI. For this training, Microsoft is partnering with other organizations including the Federal Association of German Employers' Associations, Schaeffler, the DHL Group, and the ReDI School of Digital Integration. Data Centre Dynamics Ltd (DCD), 296-300 St John St, London EC1V 4PAEmail. [email protected]DCD is a subsidiary of InfraXmedia "
}