{
    "title": "Microsoft unveils new Copilot AI for finance teams",
    "date": "3/1/2024",
    "url": "https://www.siliconrepublic.com/machines/microsoft-copilot-ai-finance-windows-365",
    "text": "by Leigh Mc Gowran 1 Mar 2024 Image: © Robert/Stock.adobe.com Microsoft said its latest Copilot offering will help finance teams focus more on strategic work and quickly get insights from data sets. Microsoft has shared a public preview of the latest version of its AI assistant Copilot – with the goal of making its mark on modern finance. The tech giant said this new version of Copilot will “revolutionise” how finance teams approach their work. The AI assistant includes Copilot for 365, which means it will also be able to work with Excel, Outlook and other Windows apps. Microsoft said Copilot for Finance will free up time for finance teams by streamlining financial tasks, automating workflows and providing insights in the flow of work, allowing these teams to take on more strategic work instead of being stuck in data entry workloads. One of the features of this version of Copilot is quick reviews of data sets in Excel to spot anomalies, risks and unmatched values. Microsoft said this can help businesses figure out where and why they are falling short of planned financial outcomes. Copilot for Finance can also provide summaries of relevant customer account details in Outlook – such as balance statements and invoices – or let users turn raw data in Excel into visuals and reports for presentations. The company said it has used its own finance team to create the capabilities and roadmap of its latest Copilot offering. “Our finance organisation is just like any other – looking for technology to help us do our work in a more efficient and impactful way – and we’re excited to track our journey as customer zero of Microsoft Copilot for Finance,” said Microsoft modern finance lead Cory Hrncirik. Microsoft has been putting more focus on expanding its Copilot AI assistant in recent months to support more sectors. In January, the company launched Copilot Pro, offering advanced features for customers that pay a monthly subscription fee. Meanwhile, Microsoft has also revealed a collaboration with Nvidia, AMD and Intel to boost the visual quality of games. The company said its DirectSR API is designed to integrate super resolution – a technique that increases resolution and visual quality – into the next generation of games more easily. Microsoft said DirectSR will allow a single code path to activate a variety of products including the Nvidia DLSS Super Resolution, AMD FidelityFX Super Resolution and the Intel XeSS. Microsoft said DirectSR will soon be available as a public preview in Agility SDK, which will let developers test it out and provide feedback. Find out how emerging tech trends are transforming tomorrow with our new podcast, Future Human: The Series. Listen now on Spotify, on Apple or wherever you get your podcasts. Related:\n                    Microsoft,             AI,             software development,             software,             gaming,             finance Leigh Mc Gowran is a journalist with Silicon Republic editorial@siliconrepublic.com 22 Feb 2024 26 Feb 2024 11 Jan 2024 3 days ago 3 days ago 4 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago All content copyright 2002-2024 Silicon Republic Knowledge & Events Management Ltd. Reproduction without explicit permission is prohibited. All rights reserved.\n            Website by Square1.io "
}