{
    "title": "Microsft, Meta: What each has going for them in Q4 earnings",
    "date": "1/28/2024",
    "url": "https://finance.yahoo.com/video/microsft-meta-going-them-q4-130016329.html",
    "text": "A number of Big Tech players will continue to report earnings next week: Microsoft's (MSFT) results are due out on Tuesday, January 30, followed by Meta Platforms (META) on Thursday, February 1. CFRA Research Senior Equity Analyst Angelo Zino joins Yahoo Finance Live to comment on some of the biggest fourth-quarter drivers for these Magnificent Seven components. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. JULIE HYMAN: How about Meta, which just made up all of its pre-pandemic losses, right? So it seems like maybe there's some pretty good expectations baked in there. ANGELO ZINO: Yeah, I mean, listen, as far as Meta is concerned, I mean, if you look at the two best performers since the market lows in October in terms of the Mag Seven, it's of course, been NVIDIA and the other kind of big outperformer has been Meta. And a big reason for that is the valuation. And the valuation to us is still somewhat enticing. We're talking about 19, 20 times on its calendar 25 basis, but on a net cash basis even more attractive, about 18, 18.5 times. So our view here is the numbers are going to look very good. It should be another kind of beat and raise quarter, given what we've seen out of the digital ad space here. All eyes, I think, are really going to be on what they have to say on AI and how it's improving their kind of ecosystem, but also in terms of China. China, when you think about companies like Shein and Temu, they're spending a lot more on Meta's ecosystem as they look to aggressively advertise outside of China because of the slowing market over there. So within the US, emerging markets like Brazil, we think is going to be a big theme for Meta in 2024. We think they're going to continue to show those beats and raises in the first half of this year. Again, offer some easy comps. And in the second half of the year, you do have a huge election going on, right? So if there are investors out there looking to play the election here. That is potentially a way to do it via Meta. JULIE HYMAN: So finally, while we got you, I want to ask about Microsoft also, just around them all up, right? You mentioned AI, of course, as a factor for Meta. Is AI the factor for Microsoft? Do you think investors are even going to pay attention to the rest of the business, which is still most of the business? And do you think Microsoft is going to have to show some profitability tied to AI? ANGELO ZINO: So when we think about Microsoft, really, there are going to be three key secular growth drivers to this company, right? The cloud is one, AI is the other, and then gaming is the other with that recent acquisition of Activision. And we think all three areas are going to show very good prospects here for the December quarter. On the cloud side of things, they pointed towards some deceleration here for the December quarter from the September quarter, still very healthy 27 or 28%. If we see a number above that with greater contribution from AI. AI was about three percentage points of contribution to cloud growth in the September quarter. If we get something closer to 4 to 5 percentage points, and again, a beat on the cloud side of things, we think that's where the upside potential is and where some excitement grows for Microsoft. And then of course, what they have to say about Copilot 365, that just launched in November. We think they're going to be very excited about it. But the trajectory of Copilot, of course, is going to be a kind of a huge kind of area of interest out there for investors. So that's what we would be looking out for Microsoft. It is our top play in terms of it being a strong buy. And 12-month target price is $440. Related Quotes "
}