{
    "title": "Microsoft Laying Off 1,900 In Game Division After Activision Merger",
    "date": "1/25/2024",
    "url": "https://deadline.com/2024/01/microsoft-layoffs-game-division-after-activision-merger-1235804618/",
    "text": "By Jill Goldsmith Co-Business Editor Microsoft is laying off about 1,900 people in its gaming division following the closing of its acquisition of Activision Blizzard. In a memo sent to employees today, the company said the move was to address “areas of overlap.” Blizzard President Mike Ybarra is also leaving. In a post on X, Ybarra called it “an incredibly hard day.” His post said: “I want to thank everyone who is impacted today for their meaningful contributions to their teams, to Blizzard, and to players’ lives. It’s an incredibly hard day and my energy and support will be focused on all those amazing individuals impacted – this is in no way a reflection on your amazing work. If there’s anything I can help with, connections, recommendations, etc., DM me. To the Blizzard community: I also want to let you all know today is my last day at Blizzard. Leading Blizzard through an incredible time and being part of the team, shaping it for the future ahead, was an absolute honor. Having already spent 20+ years at Microsoft and with the acquisition of Activision Blizzard behind us, it’s time for me to (once again) become Blizzard’s biggest fan from the outside. To the incredible teams at Blizzard – thank you. Words can’t express how I feel about all of you. You are amazing. Continue to do incredible things and always keep Blizzard blue and the player at the forefront of every decision. To all of those impacted today – I am always available to you and understand how challenging today’s news is. My heart is with each one of you.” The circa 1,900 layoffs were noted in a memo to staff Microsoft Gaming CEO Phil Spencer today, according to news outlets that have seen it. Microsoft closed its $69 billion acquisition of Activision in October after a battle with regulators. The videogame business has been hit by layoffs recently along with big tech and media. Subscribe to Deadline Breaking News Alerts and keep your inbox happy. Signup for Breaking News Alerts & Newsletters By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Get our latest storiesin the feed of your favorite networks We want to hear from you! Send us a tip using our annonymous form. Sign up for our breaking news alerts By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Deadline is a part of Penske Media Corporation. © 2024 Deadline Hollywood, LLC. All Rights Reserved. By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. "
}