{
    "title": "Microsoft Azure revenue up 30%, with help from AI, as tech giant beats \noverall expectations",
    "date": "1/30/2024",
    "url": "https://www.geekwire.com/2024/microsoft-azure-revenue-up-30-with-help-from-ai-as-tech-giant-beats-overall-expectations/",
    "text": "by Todd Bishop on January 30, 2024 at 1:33 pmJanuary 30, 2024 at 3:11 pm Microsoft’s revenue from its Azure cloud platform and related services rose 30% in the quarter ended Dec. 31, including a 6 percentage point boost from its artificial intelligence technologies. The company’s overall revenue increased 18% to $62 billion, with profits of $21.9 billion and earnings per share of $2.93, up 33% by both measures, topping Wall Street’s expectations across the board on the key metrics. “We’ve moved from talking about AI to applying AI at scale,” said Microsoft CEO Satya Nadella, in the company’s earnings release, citing the growing adoption of Microsoft’s AI tools across different industries and technologies. Activision Blizzard, the video game developer acquired by Microsoft for $69 billion last year, was included in Microsoft’s results for the first time, with revenue of $2.08 billion and an operating loss of $44 million for the quarter. From a revenue perspective, at least, the Activision acquisition means that Microsoft Gaming is now a bigger business than Microsoft Windows for the first time, according to Microsoft’s detailed quarterly report filed with the SEC. The company did not report any material revenue gain from Microsoft 365 Copilot, its AI tool for businesses, which launched Nov. 1, one month into the quarter. Those results will be included in the company’s Office Commercial product line, which posted a revenue increase of 15% for the quarter. Other notable segment and product results: Update: On Microsoft’s earnings conference call, Nadella transitioned seamlessly from addressing the recent breach of the company’s internal systems and executive email accounts by Russian hackers to discussing its security technology business. “The recent security attacks including the nation-state attack on our corporate systems we reported a week and a half ago have highlighted the urgent need for organizations to move even faster to protect themselves from cyber threats,” he said. Microsoft’s blending of these two issues — security problems in its products, and the security technology business —  has drawn criticism from some corners of the industry. Nadella did not disclose revenue from security products as he has before at this time of year. At last report, a year ago, the total was $20 billion annually. Subscribe to GeekWire's free newsletters to catch every headline Have a scoop that you'd like GeekWire to cover? Let us know. Microsoft tops expectations as tech giant looks to AI to fuel growth Risk vs. revenue: Microsoft results will offer a new AI benchmark after a tumultuous quarter Microsoft earnings preview: Growth slows as tech giant awaits payoff from big AI bets Microsoft’s resurgence: Reflecting on Satya Nadella’s leadership, a decade after he became CEO Catch every headline in your inbox "
}