{
    "title": "Seegene Announces Collaboration with Microsoft to Realize 'a World Free \nfrom All Diseases' - PR Newswire APAC",
    "date": "1/24/2024",
    "url": "https://en.prnasia.com/releases/apac/seegene-announces-collaboration-with-microsoft-to-realize-a-world-free-from-all-diseases--434948.shtml",
    "text": "SEOUL, South Korea, Jan. 24, 2024 /PRNewswire/ -- Seegene Inc. (KQ096530), a leading South Korean company providing a total solution for PCR molecular diagnostics, announced its selection of Microsoft as a technology partner for its SG OneSystemTM business in London, UK, on January 23 to realize 'a world free from all diseases.' Microsoft's General Manager of Global Health and Life Sciences Elena Bonfiglioli, left, and Dr. Jong-yoon Chun, CEO and founder of Seegene, pose for a photo during the OneSystem™ Strategic Collaboration Signing Ceremony between Seegene and Microsoft in London, UK, on January 23. Seegene will collaborate with Microsoft to help propel the growth of its SG OneSystemTM business, an unprecedented strategy by Seegene to share its unique syndromic quantitative PCR technologies with leading companies across the world to drive cross-industry innovation in molecular diagnostics. The expansion of participating companies, with whom Seegene intends to form a global consortium, will empower countries around the world with optimal solutions, enabling them to effectively address future pandemics and collectively move closer to 'a world free from all diseases.' To realize such a goal, Seegene will work with Microsoft's global healthcare team to help further SG OneSystemTM's growth by advocating the collective vision, bridging potential partners, and jointly participating in SG OneSystemTM's annual symposium. Other key events connecting current and prospective SG OneSystemTM partners, such as a declaration ceremony for scientific communities and other partners participating in the SG OneSystemTM business will be held within the first half of this year to commemorate the shared vision. Seegene's Digitalized Development System (SGDDS) will integrate Microsoft Azure services, including Azure OpenAI Service, which will be used by Seegene to handle the landscape of data interaction and analysis for researchers dealing with extensive data generated by the SGDDS. The implementation of the highly secure and compliant Azure Trusted Research Environment (TRE) will push the boundaries of PCR research, helping ensure both privacy and regulatory adherence. Seegene will implement Microsoft Fabric, a single AI-powered analytics platform that will unify Seegene's data and reshape how everyone accesses, manages, and acts on that data with capabilities that span data integration, data engineering, data science, data monitoring, real-time analytics, and business intelligence. The integration of AI-driven assistance through Copilot for Microsoft 365 is expected to accelerate productivity, foster innovation and enhance creativity. Furthermore, Seegene will collaborate with Microsoft on collective healthcare innovation research, including next-generation management and analytics for PCR data, and explore future ventures within the healthcare sector. Seegene aims to improve the healthcare ecosystem with Microsoft by delivering accurate early disease diagnoses that provide the foundation for effective treatment and prevention. \"The strategic collaboration with Microsoft will allow us to have a more structured SG OneSystemTM business model,\" said Dr. Jong-Yoon Chun, CEO and founder of Seegene. \"Through our joint efforts, we expect synergetic effects to pave the way for a world free from all diseases.\" \"We support Seegene's vision of realizing 'a world free from all diseases,'\" said Elena Bonfiglioli, General Manager, Global Health and Life Sciences at Microsoft. \"In addition to working with Seegene on its digital transformation, we will collaborate to discover global partners and to further enhance the healthcare ecosystem.\" About Seegene Seegene has 23 years of dedicated R&D, manufacturing and business experience around syndromic quantitative PCR technologies, which was highlighted during the COVID-19 pandemic when it provided over 340 million COVID-19 tests to more than 100 countries worldwide. The core feature of Seegene's unique syndromic PCR technologies is the ability to simultaneously test 14 pathogens that cause similar symptoms in a single tube and provide quantitative information on the infectivity profile to correlate with the severity of illness. SG OneSystemTM business SG OneSystemTM business is a global strategy to realize 'a world free from all diseases.' The SG OneSystemTM aims to allow scientists and experts to locally develop syndromic quantitative PCR diagnostic tests covering diseases in all organisms and fields utilizing SGDDS through global collaboration. Seegene is committed to sharing its unique syndromic quantitative PCR technologies with leading companies across the world to ally as consortium partners to develop, manufacture, and distribute diagnostics tests. The SG OneSystemTM expects to ease the burden of developing products covering all diseases from a single company to a cumulative global effort, which includes, not only development, but regulatory affairs, manufacturing, marketing, and sales. The success of the SG OneSystemTM will offer a comprehensible preventative measure that contributes to a sustainable future for the entire biological ecosystem. As a part of SG OneSystemTM business, Seegene unveiled the inaugural 'Open Innovation Program powered by Seegene' in September 2023 with Springer Nature to empower experts, scientists, and clinicians to develop syndromic quantitative PCR assays across all fields.  "
}