{
    "title": "Level up your retail workforce with Microsoft Teams",
    "date": "1/11/2024",
    "url": "https://www.microsoft.com/en-us/microsoft-365/blog/2024/01/11/level-up-your-retail-workforce-with-smart-simple-solutions-from-microsoft-teams/",
    "text": "Smart dressing rooms, personalized marketing, customized end-to-end shopping experiences—these are a few of the baseline experiences expected by retail customers today. As retail’s frontline workforce rises to meet these customer expectations, they face crunched supply chains, and a digital deficit of outdated technology and siloed systems.  Microsoft Teams In the race to deliver engaging in-store experiences, Microsoft Teams is uniquely positioned to equip retailers, such as La Vie en Rose and Domino’s, with a single platform to transform their store team’s operations and deliver first-in-class customer experiences. And with the potential to streamline tasks and save valuable time, AI is quickly becoming a critical layer on top of existing communication solutions to help retailers deliver. Even employees are ready and waiting for AI to be introduced, with 65% of frontline workers optimistic about how AI will help them in their job. With Microsoft Teams, you can level up your retail workforce with smarter and simpler experiences for communications and operations in your stores. It’s no secret that store associates can work more effectively when they have the right tools. By harnessing the power of smart solutions in the communication tools they use every day, retailers can not only make their operations more productive but also keep their store communications agile. We’ve enhanced essential communication tools in Microsoft Teams—like chat, channels, phone calls, and meetings—with Microsoft 365 Copilot. Copilot combines the power of large language models (LLMs) with your data in the Microsoft Graph—your calendar, emails, chats, documents, meetings, and more—and Microsoft 365 apps to turn your words into the most powerful productivity tool on the planet. This fosters a smart workplace that elevates productivity and streamlines information access for retail teams. Learn more about Copilot in Microsoft Teams. In November, we announced Microsoft Copilot Studio, a low-code tool designed to customize Microsoft Copilot for Microsoft 365 with plugins that connect to your existing systems and build standalone copilots. For example, a retail business can use Copilot Studio to create a custom Q&A copilot that connects to product information hosted on SharePoint, making it easy for store associates to quickly get answers to customer questions. Reaching the frontline with key information and news can be difficult, both in targeting the right groups and then engaging them with the content once delivered. It especially gets difficult if different communications are being sent to different apps, adding cognitive load onto the frontline to find the right information across multiple communication sources. Continuing to deliver on a single destination for frontline communications, we’re excited to announce Copilot in Viva Engage in Teams, available in public preview in January 2024. This Copilot experience uses AI-created conversation starters, prompts, and images to help inspire retail leadership and corporate communications teams to post in frontline communities and increase engagement with store teams right from the same place where they work. And this AI-enhanced communication tool helps frontline retail teams increase the quality of questions being asked with suggested prompts. Copilot in Viva Engage in Teams speeds up your ability to create impactful and dynamic communications for your organization. Combining this with the power of Teams simplifies your ability to target communications to specific teams, whether at the company, store, or role level. We are excited to share that retail corporate communications teams will soon be able to easily send important announcements like safety policy changes and store sales targeted to frontline employees based on location, department, and job roles from the Teams home experience. These operational announcements will be pinned at the top of frontline workers’ home experience so they will never miss key messages that keep your business running smoothly. This feature in Teams will be generally available in March 2024. Microsoft Teams helps automate and streamline processes across your organization, keeping all information in one place to simplify frontline workers’ daily work. We’re building on the existing task publishing and automation capabilities in Microsoft Planner, formerly known as the Tasks app in Microsoft Teams. Your retail organization will be able to schedule recurring lists within task publishing. With this new capability, you can now choose the cadence of recurring task lists—for example, let’s say every Monday you send a store audit task, then task publishing will automatically take care of scheduling the publication. Retail organizations will be able to enforce additional rules for a task to be marked as completed, such as uploading photos, completing a form, as well as requiring approval before marking a task complete. With this feature, tasks can only be marked as complete once specific conditions are met, ensuring high-quality work across the frontline. Task publishing will also allow your organization to create a task that every member of the recipient team must complete. Retailers can use this to publish a training task—for example, health and safety trainings—to designated stores and locations. These task management features will be generally available in March 2024. Sign up to be notified when these enhancements to Planner are available. Teams Phone is a cloud calling service that keeps your entire workforce connected with flexible, reliable, and smart calling—all in Teams. We are excited to announce a new Teams Phone for Frontline Workers offer that will be generally available in February 2024.1 With Teams Phone, frontline workers can securely communicate and collaborate with customers, teammates, and suppliers through an intuitive and easily customizable solution. Heads-up and hands-free communication is key for real-time collaboration and quick problem-solving in retail settings. To continue to enable seamless store communication, we are excited to announce that Walkie Talkie in Teams will now work with any generic wired headsets on Android. This feature will be generally available starting in February 2024. To further enhance and simplify store communication, frontline workers who use Walkie Talkie in Teams can now choose to automatically listen to incoming messages from any of the channels they have pinned as favorites. With this new feature, users can easily stay connected to multiple channels without needing to switch channels manually. This feature is now generally available. Microsoft is committed to empowering retail organizations around the world to modernize the in-store experience. We continue to invest in Microsoft 365 and Microsoft Teams innovations for the frontline, with solutions like Microsoft Copilot and Microsoft Teams Phone. This week at the National Retail Federation (NRF) 2024, we are announcing new solutions designed to enable store teams to efficiently meet customers’ expectations and improve the retail experience in this new era of AI. We’ll be in New York City for retail’s biggest show January 14 to 16, 2024, on level 3 at booth #4503, conveniently located at the main entrance of the Javits Exhibition Hall. We can’t wait to see you there. 1 Microsoft Teams Phone Standard for Frontline Workers ($4 user/month) will be available as an add-on to Microsoft 365 F1 ($2.25 user/month) and F3 ($8 user/month). Listed pricing may vary due to currency, country, and regional variant factors. Contact your Microsoft sales representative to learn more. Help people and teams do their best work with the apps and experiences they rely on every day to connect, collaborate, and get work done from anywhere. "
}