{
    "title": "Microsoft’s OpenAI investment could face EU merger probe, EU regulators say",
    "date": "1/10/2024",
    "url": "https://www.bworldonline.com/world/2024/01/10/568000/microsofts-openai-investment-could-face-eu-merger-probe-eu-regulators-say/",
    "text": " BRUSSELS – Microsoft’s financial backing for ChatGPT maker OpenAI may be subject to European Union merger rules, EU antitrust regulators said on Tuesday, underscoring a similar warning from its UK peer in December. The US software giant, which last year committed to invest over $10 billion into OpenAI with a non-voting position on the board, has said it does not own any portion of OpenAI. The European Commission had previously said it was following developments closely. “The European Commission is checking whether Microsoft’s investment in OpenAI might be reviewable under the EU Merger Regulation,” the EU executive, which acts as the EU competition enforcer, said in a statement. Microsoft said its partnership with OpenAI forged in 2019 has fostered more AI innovation and competition while preserving independence for both companies. “The only thing that has changed recently is that Microsoft will now have a non-voting observer on OpenAI’s Board,” a Microsoft spokesperson said. The Commission said some agreements agreed between large digital market players and generative AI developers and providers were being investigated for their impact on market dynamics. It did not name the companies. The Commission on Tuesday also gave interested parties until March 11 to provide feedback on competition in virtual worlds and generative artificial intelligence. It also sent requests for information to several large digital companies on the two topics. “We are inviting businesses and experts to tell us about any competition issues that they may perceive in these industries, whilst also closely monitoring AI partnerships to ensure they do not unduly distort market dynamics,” EU antitrust chief Margrethe Vestager said. — Reuters "
}