{
    "title": "Join us in 2024 — events to get your teams AI-ready - The Official \nMicrosoft Blog",
    "date": "2/28/2024",
    "url": "https://blogs.microsoft.com/blog/2024/02/28/join-us-in-2024-events-to-get-your-teams-ai-ready/",
    "text": "Feb 28, 2024\n\n| \n\tTakeshi Numoto - Executive Vice President and Chief Marketing Officer 2023 was a year of exciting growth and innovation here at Microsoft. This year’s focus is to empower our customers and partners through AI transformation, and we’re excited to share what will be an impactful lineup of events for 2024. Attending any of these events provides you with the opportunity to learn, grow and make defining connections with experts from around the world. Expect to see enhancements in some of this year’s events. Azure AI-powered natural language assistants will provide personalized session recommendations, summarize content and answer your event-related questions. To meet the needs of a global audience, we are also offering options to participate in person, online and on-demand so you can choose what format works best for you. We structure these events to support the goals of our audiences and ensure that anyone attending has a great experience. Visit our events site to find out which ones are right for you. It’s not too late to register for this ongoing series of one-day, in-person experiences around the world. These events bring together those on the cutting edge of innovation — including decision-makers, industry experts, thought leaders and developers — to focus on how AI will revolutionize work. So far, we’ve welcomed thousands of senior leaders and developers in six locations around the globe with keynotes highlighting the latest innovations in AI. Tour stops remain in Berlin, Paris, São Paulo and Seoul, where you can attend interactive workshops and learn how you can unlock the power of AI. Go to the Microsoft AI Tour  site to sign up. In-demand experts, distinguished engineers and developers are gathering in Seattle for our annual Microsoft Build. This celebration of technology is a chance to hear the latest announcements and get hands-on with new technology. Learn how to create new features and opportunities with AI and copilots, dive deep into the latest tech, and develop the skills that are needed for tomorrow — today. Seattle, Washington & online | May 21-23, 2024 We are evolving the event previously known as Microsoft Inspire. In July, we will kick off our fiscal year with partners in tandem with our Microsoft sellers by providing a digital engagement to share strategic priorities, investments and key program changes. We look forward to sharing more details soon.\nOnline | July 2024 With this change, we will also welcome partners to join us at Microsoft Ignite for an in-person experience in November to see the latest Microsoft innovations, network and celebrate the Partner of the Year Award winners. Our biggest event of the year is getting even bigger for customers and partners, and we’re returning to Chicago! Join IT professionals, implementers, developers, architects and more in checking out the latest tech Microsoft has to offer. With demos and firsthand access to new AI solutions and copilots, this is your chance to explore the latest tools, receive deep technical training and get questions answered by Microsoft experts. We’re bringing the best of our customer and partner event experiences to the Windy City and online so you can participate in the festivities and discover how AI can enhance your organization. In addition to seeing the latest technology firsthand, senior leaders and decision-makers are invited to learn more about how to lead in the era of AI and find robust networking opportunities. If you’re looking to expand your AI knowledge, create connections and push the boundaries of what we can accomplish together, there’s no better event than Microsoft Ignite. Chicago, Illinois & online | Nov. 18-22, 2024 Find an event in your region Visit our full global events catalog for a complete list of events, including some that could even be in your area. There, you can filter events by product, role or industry to find something specific to your needs or interests. We hope to see you It’s very exciting to bring you opportunities that showcase the growth and innovation that’s being done at Microsoft to help you do more with AI. Whether you’re a customer, partner, IT professional, decision-maker or developer, if you’re looking to achieve more ― there’s an event for you. Tags: Microsoft AI Tour, Microsoft Build, Microsoft Ignite, Microsoft Inspire Feb 25, 2024\t\t\t\t\t\t\t\t\n|\nJason Zander Feb 13, 2024\t\t\t\t\t\t\t\t\n|\nSatish Thomas Feb 7, 2024\t\t\t\t\t\t\t\t\n|\nYusuf Mehdi Jan 29, 2024\t\t\t\t\t\t\t\t\n|\nJudson Althoff Jan 15, 2024\t\t\t\t\t\t\t\t\n|\nYusuf Mehdi Follow us: "
}