{
    "title": "Xcel selling Microsoft land to build new data center in Minnesota",
    "date": "2/16/2024",
    "url": "https://www.startribune.com/microsoft-building-data-center-in-becker-xcel-stress-on-grids/600344079/",
    "text": "Xcel Energy sold land in Becker this week to Microsoft for a new data center, the latest potential project in what is turning into a lucrative and energy-hungry business for the Minneapolis-based utility. The $17.7 million sale of roughly 295 acres, made public in records published by the state Department of Revenue, is an early step toward what could be the second data center near Xcel's large coal plant in Becker. Little else is known about the Microsoft project. Xcel declined to say more about the venture and Microsoft did not immediately respond to a request for comment. But it could be a large project. State utility regulators last year approved the sale of 348 acres of land in Becker to Elk River Technologies, a mysterious company that could invest up to $1 billion in a new data center. The Public Utilities Commission in October also approved Xcel electricity contracts with Meta Platforms for a $700 million data center project in Rosemount. The potential rush of data centers is notable not only for the potential boost of jobs and other benefits to local communities. Data centers — and electric vehicles — are at the heart of why Xcel is predicting a rare and significant jump in demand for energy on its Upper Midwest system. In a new long-term energy plan, the company forecasted an average of 2% annual growth in energy needs, which it called a \"marked divergence\" from a long period of ultra-slow growth. Gabe Chan, a University of Minnesota professor who specializes in energy and climate policy, said the spike in predicted energy sales is \"massive\" and fits with industry trends elsewhere in the country. \"Really we haven't seen this kind of load growth all hitting at the same time since probably the mass adoption of air conditioners,\" Chan said. Xcel's plan says the company expects annual average growth of 2% for overall energy demand between now and 2040 and a similar rise in peak demand. That may not sound enormous, but over time it adds up. Xcel is expecting to increase its electric load by roughly one-third over that time span when the company had projected only a slight uptick in its last long-range plan. The primary cause of the spike is data centers and electric vehicles, the company said, followed by other energy use like the switch to electric space heating. Electricity use has long been flat in the region and the country because of improvements in energy efficiency both in heavy industry but also in homes, Chan said, such as adoption of better air conditioners, appliances and light bulbs. Xcel's predictions — and its request to build new power sources that it could financially benefit from — will likely be questioned as part of what will be a long regulatory planning process. But the new uptick is also happening in many places nationwide. Chan said Xcel's forecast is even somewhat muted compared with the East Coast, where regional grid operator PJM recently announced a sharp increase in forecasted growth, primarily because of data centers and electric vehicles. Beth Soholt, executive director of Clean Grid Alliance, a nonprofit trade group for wind, solar and battery storage developers, said the local grid operator has also struggled to plan and respond to load growth across its 15-state footprint and is seeing rising energy demand not just from data centers but also manufacturing spurred by the Inflation Reduction Act. Chan said the rise in energy demand also comes as Xcel and others are shutting down coal plants, creating the challenge of beefing up energy supply with enormous new fleets of wind, solar and battery power while also losing large power sources. \"The amount of new building that has to happen to replace what's retiring and to meet this one-third increase in load is really really big,\" he said. \"Nothing like this has ever happened before in at least the recent history of the grid.\" Last year, Xcel predicted that the number of electric vehicles in its service area would grow at least tenfold by 2033, from about 34,500 light-duty cars in June to somewhere between 350,400 and almost 1 million. Chan said the substantial jump in EVs would put pressure on Xcel's power distribution grid, requiring costly upgrades to infrastructure such as substations. Xcel said in regulatory filings that demand for data centers has surged because of an expansion in machine learning and artificial intelligence technologies, which are more energy-intensive than traditional data processing methods. The companies are largely after renewable and carbon-free energy options with Xcel, the utility said. \"The data center will bring investment and jobs to the area, providing the economic development the community has been seeking,\" Xcel spokesman Kevin Coss said about the Microsoft deal. \"As the electric provider for the area, we will be engaged in the site development process.\" Data centers traditionally have been an attractive customer for utilities, Chan said, because their energy needs are large but consistent. And the rise in energy sales to those data centers can benefit all Xcel customers. But he said planning for the data centers is tricky as the power supply relies more on variable renewable energy. Plus, even as more are being built, deals can fall through so utilities like Xcel must be careful not to build more power generation than it needs and leave ratepayers on the hook for infrastructure costs. In 2022, Google backed out of a planned $600 million data center in Becker. The data centers are often wrapped in secrecy, too, with much information about deals shrouded as trade secrets at the PUC. Whether there is a larger company behind the Elk River Technologies facility is unknown, for example. Xcel declined to say on Friday. The involvement of Meta in the Rosemount center was shielded for a while before the company was eventually revealed. Both Elk River and Meta could be among Xcel's largest customers. State officials determined the Meta data center would ultimately benefit Xcel ratepayers. A second, even bigger center data center, has been floated in Rosemount. Last week, before the Microsoft deal became public, Xcel wrote in PUC filings that it's \"actively engaged with several hyperscale and colocation data centers,\" and the company is studying how to potentially connect projects to the grid. Walker Orenstein  covers energy, natural resources and sustainability for the Star Tribune. Before that, he was a reporter at MinnPost and at news outlets in Washington state. © 2024 StarTribune. All rights reserved. "
}