{
    "title": "Microsoft to build new data centre in Centurion",
    "date": "2/13/2024",
    "url": "https://www.georgeherald.com/News/Article/Business/microsoft-to-build-new-data-centre-in-centurion-202402120958",
    "text": "Monday 11:38 - few clouds 24°C Monday 11:38 few clouds Tomorrow: light rain 18° George BUSINESS NEWS - South Africa will get a new data centre in Centurion, north of Johannesburg, tech giant Microsoft said. Microsoft last week published an advertisement in a number of newspapers providing details of its intention to build the data centre campus situated in Kosmosdal in Centurion, Gauteng. Still in the early phases of development, Microsoft said it aims to build its cloud infrastructure in new areas of South Africa to meet “growing demand” from the public sector and private organisations for cloud and AI services and solutions in Africa. Accelerating technology In March 2018, Microsoft became the first hyperscale public cloud provider to provide services from data centres in Africa. “We look forward to working with the municipality, local organisations, and the residents of Kosmosdal as we develop our data centre plans sustainably,” Microsoft said. Microsoft has a 30-year history in South Africa. The software giant said it is committed to accelerating the pace of technology transformation and digital enablement in the country, through key investments in infrastructure, innovation, and skills and enterprise development, to benefit all South Africans. “This data centre campus represents the next step in Microsoft’s commitment to enabling and accelerating the pace of digital transformation in South Africa, and Africa, in an inclusive, trusted, and responsible manner.” Microsoft already has two current two data centres – located in Johannesburg and Cape Town In 2022, the company expanded the cloud service offerings in both SA locations, adding the Dynamics 365 and Power Platform. Microsoft said it will share more information as its plans for the data centre are formalised. Power of AI Meanwhile, with Artificial Intelligence (AI) advancing rapidly, Microsoft said that while AI tools will help manage time and boost cognitive work, they will not take over jobs. Microsoft demonstrated the power of AI during the Microsoft Africa AI Journalist Academy this month which was held virtually across select African countries, including South Africa. Experts at the forum highlighted the rapidly evolving landscape of generative AI, noting its emergence as a crucial technology of our era, as evidenced by the $20 billion funding in Gen AI startups over the past three years. Article: Caxton publication, The Citizen ‘We bring you the latest Garden Route, Hessequa, Karoo news’ Read more about:\n\n\r\n                                    centurion\r\n                                \n\n\n\r\n                                    microsoft\r\n                                \n\n\n\r\n                                    south africa Please enable JavaScript to view the comments powered by Disqus. No related articles found. No more  articles found. I'm a 62 year old man looking to meet women between the ages of 54 and 60.\nView Profile I'm a 61 year old man looking to meet women between the ages of 32 and 55.\nView Profile I'm a 30 year old woman looking to meet men between the ages of 25 and 68.\nView Profile I'm a 38 year old woman looking to meet men between the ages of 35 and 42.\nView Profile George Herald proudly displays the “FAIR” stamp of the Press Council of South Africa, indicating our commitment to adhere to the Code of Ethics for Print and online media which prescribes that our reportage is truthful, accurate and fair. Should you wish to lodge a complaint about our news coverage, please lodge a complaint on the Press Council’s website, www.presscouncil.org.za or email the complaint to enquiries@ombudsman.org.za. Contact the Press Council on 0114843612. Copyright 2024 Group Editors Company (Pty) Ltd, Registration Number 1963/002133/07 t/a George Herald "
}