{
    "title": null,
    "date": "2/6/2024",
    "url": "https://gulfbusiness.com/det-microsoft-to-power-emirates-innovation-drive/",
    "text": "Get daily business news from the region delivered straight to your inbox The joint effort will focus on logistics, technology enablement and adoption within the SME and education sectors The Dubai Department of Economy and Tourism (DET) and Microsoft have inked a deal to fuel the emirate’s innovation ambitions, marking a significant step towards achieving the goals outlined in the Dubai Economic Agenda D33. This strategic collaboration targets key sectors – logistics, SMEs and education – by leveraging smart solutions and applications to drive Dubai’s technology transformation. The tech company will contribute to optimising Dubai’s logistics network through an integrated trade platform, enhancing global competitiveness and attracting technology-driven manufacturers. Supporting the D33‘s focus on innovation, the tech major will provide affordable technology solutions and expertise to SMEs, fostering data-driven growth and positioning Dubai as a global innovation hub. The partnership aims to solidify Dubai’s leadership in digital education by integrating the tech giant’s solutions and methodologies into higher education institutions. Startups and entrepreneurs will gain access to Microsoft’s resources and expertise, fueling the emirate’s burgeoning innovation ecosystem. “This landmark collaboration leverages our unique strengths to showcase Dubai’s ability to build strong public-private partnerships,” said Hadi Badri, CEO of Dubai Economic Development Corporation. “Our agreement with Microsoft is central to our strategy of harnessing global partners for economic growth.” “Dubai stands at the forefront of global technology, and we are honoured to contribute to its progress,” said Naim Yazbeck, general manager of Microsoft UAE. “This collaboration represents a shared commitment to drive innovation and build a thriving knowledge-based ecosystem.” © 2021 MOTIVATE MEDIA GROUP. ALL RIGHTS RESERVED. "
}