{
    "title": null,
    "date": "2/23/2024",
    "url": "https://lifehacker.com/tech/sharing-microsoft-365-subscription",
    "text": "There are ways to get Microsoft Office for free—but if you're using it regularly, you may want to take advantage of the different productivity features in the software. A Microsoft 365 subscription unlocks benefits that go beyond the occasional use of Word, Excel, and PowerPoint. Once you're ready to commit, you can choose between the two available subscription plans offered by Microsoft 365—Personal and Family. Family covers up to six people total, so if you have anyone in your circle (they don't have to be family!) who wants to use Microsoft Office, then it's worth it to get the Family subscription and share. Sharing the Microsoft 365 Family subscription is a straightforward exchange between you as the Family organizer and the other five people. There are two methods—an invite email or a shared link. You can go with either. Log into the Microsoft account page using the same Microsoft account you used to purchase your subscription; select Manage sharing on the top right. This opens the Services & subscriptions page in your account. Select the Share button. In the pop-up overlay screen, choose Copy link or Email invite. If you've chosen Copy link, send the link to your fellow subscribers.  Once each member of the Family group accepts the invite, they can install all the Microsoft Office apps on their devices and access their own private 1 TB of OneDrive storage by signing into Microsoft with their personal Microsoft account. To remove someone from the group, go to the Services & subscriptions page and then to the Share subscription section. Select the person you want to remove from the You’re sharing Microsoft 365 benefits section, and choose the Stop sharing option next to their name. The group member will be notified about the change. Anyone using a shared subscription can also exit from the group on their own by logging in to their Microsoft account. Go to the Sharing page, and in the Subscription sharing section, select Stop using this shared subscription. Click Leave in the confirmation box. There are some obvious (and some not-so-obvious) benfits to using a Microsoft 365 Family subscription for collaboration. Each member of the family group uses every Microsoft Office app independently with their own Microsoft log-ins. Everything like email, calendar, cloud storage, or OneNote notebooks of others stays private. Like any other Microsoft 365 subscription, all members automatically get the latest versions of Word, Excel, PowerPoint, and OneNote with the updated features. Each member gets 50 GB of an Outlook mailbox and an ad-free experience. This is considerably more than the 15 GB of space shared by Gmail with Google Drive and Google Photos. Microsoft Outlook also has Microsoft's advanced real-time protection against phishing and malicious attachments. The 1 TB OneDrive storage gives you an encrypted Personal Vault and seamless integration with Windows and Microsoft Office. It could work out to be one of the best value cloud storage solutions to store your sensitive files in the cloud. You can use Outlook to email your Family group and share any news, photos, or files. Add events to the Family calendar or create more detailed plans on the Family OneNote notebook. Every group member can also use the 60 minutes of free Skype calls to mobiles and landlines every month to more than 60 countries worldwide. You can also have virtual get-togethers on the Microsoft Teams app from anywhere in the world. You can share the Family plan with your kids and use different features like Content filters, Screen time, and Family Safety activity reporting to keep them safe. The Family Safety app is a useful install for your peace of mind.  Saikat is a freelance tech writer for Lifehacker. Saikat is a freelance tech writer for Lifehacker. Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better. © 2001-2024 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED. Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the\nendorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. Lifehacker supports Group Black and its mission to increase\ngreater\ndiversity in media voices and media ownerships. "
}