{
    "title": "Google, Microsoft, Nvidia will dominate AI as computing costs surge",
    "date": "2/19/2024",
    "url": "https://www.moneycontrol.com/news/opinion/google-microsoft-nvidia-will-dominate-ai-as-computing-costs-surge-12303041.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Sam Altman’s goal of raising about $7 trillion to make artificial-intelligence chips tells a story beyond his borderline-insane ambitions. First, the infrastructure needed to build AI has become exorbitantly expensive. Second, most of that value is still — still! — held by a handful of large technology companies — and the oligopoly is only going to get worse. For all the competition that was spurred by the launch of ChatGPT in late 2022, and the flurry of new startups that jumped into the hyped-up generative AI market, most of those new players will likely fold or be folded into the incumbents over the next year or so. The costs of doing business are too high for them to survive on their own. Take Sasha Haco, the chief executive officer of Unitary, which scans videos on social media for rule-breaking content. It would cost her company 100 times more than it charges clients to subscribe to OpenAI’s video-scanning AI tools. So Unitary makes its own models, which is a high-wire balancing act in itself. Her startup needs to rent access to those rare AI chips via cloud vendors like Microsoft Corp. and Amazon.com Inc’s Amazon Web Services. Those chips have doubled in price since 2020, Haco says, and they’re difficult to reserve. “We’ve had times when we can’t get access to what we need and so we have to pay 10 times the price,” she told me. Unitary makes it work, but Haco admits that no generative AI startup has figured out how to run a low-cost business at scale, at least not in the same way that large tech firms have. Another AI founder in San Francisco tells me that some of his peers who have to rent AI chips and cloud computing find that the only way they make money “is if people don’t use the product.” “The best analogy is electricity,” says Ronald Ashri, CEO of startup Dialogue.ai, which creates tailored chatbots for regulated industries. “You’re plugged into a foundation model and that is your electricity, and you are consuming it constantly. The consumption is the single highest cost in the solution that we deliver to clients.” Generative AI startups can build their technology in two different ways. They can develop their own version of OpenAI’s GPT-4 or Google’s Gemini for instance, a so-called foundation model that requires hundreds of millions of dollars in investment. Or they can build on top of an existing model, which only needs tens of millions in investment and which the vast majority of AI startups do today. In both cases, the prime beneficiaries are cloud-computing giants Microsoft, Amazon and Alphabet Inc’s Google, and AI chip maker Nvidia Corp. \"Right now all these startups take money from venture capital investors and give it to cloud companies and Nvidia,” says Rodolfo Rosini, CEO of chip company Vaire Computing.  That’s why Nvidia has seen its shares more than double in the last year, putting it near a $2 trillion valuation. You would think that large tech firms would look across the landscape of AI startups and lick their chops at this dynamic, hungry to acquire new talent and ideas. But it’s not that simple. Most new generative AI startups don’t have many hard-core AI research scientists to make them an attractive way to buy talent, since they’re reliant on the bigger, third-party models. Those startups are often staffed with regular software engineers. On top of that, big tech acquirers like Meta Platforms Inc. are already investing heavily in their own internal AI efforts, says Nathan Benaich, founder of London-based AI-focused venture capital firm Air Street Capital, and many of those companies were cutting significant costs just last year. An even bigger stumbling block is regulation. Big tech firms are rightly wary of antitrust blowback on any major AI deals thanks to the recent wave of stricter antitrust enforcement. Hence the shift to investing instead. Big tech investments in AI startups hit more than $24.6 billion in 2023, up from $4.4 billion in 2022 — a shift aimed at avoiding regulatory scrutiny, according to Brendan Burke, a senior analyst at market research firm Pitchbook, who also provided the figures. Now that the US Federal Trade Commission is probing some of those investments — including Microsoft’s multibillion-dollar bet on OpenAI and Amazon’s investment in Anthropic — the pendulum could swing back towards conventional acquisitions, Burke says. The view is mixed among venture capital investors and startups about how much M&A will happen in the coming year. What seems most likely: Regulatory pressure will prevent takeovers of leading AI startups that have valuations over $1 billion, like Perplexity, Cohere, Character.ai and Inflection. They’ll attract investment instead — at least for the time being — with some of the long tail of smaller players getting scooped up while the rest of the upstarts fold under cost pressures. The result will be a playing field that looks very similar to the one we have today, where the biggest players continue to get larger. That’ll be a win for big tech and arguably for consumers, who will continue getting cheap access to AI. But it’s a loss for competition and society too. When the general-purpose AI that gets woven into all aspects of our lives is dominated by a small handful of firms, that gives enormous power and influence to those firms. We’d be better off avoiding that outcome. Parmy Olson is a Bloomberg Opinion columnist. Views do not represent the stand of this publication. Credit: Bloomberg  DAILY-EVENING DAILY-EVENING Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}