{
    "title": "S&P 500 hits 5,000 for first time; Microsoft topples Apple as world's \nlargest company",
    "date": "2/9/2024",
    "url": "https://www.foxbusiness.com/markets/sp-500-hits-5000-for-first-time-microsoft-apple",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy BMO Capital Markets Chief Investment Strategist Brian Belski argues the stock market rally is broader than investors think on 'Making Money.' The S&P 500 has never been higher, closing above the 5,000 level for the first time ever as improving corporate earnings and better-than-expected economic data fuel investor optimism. That optimism got an extra push Friday after revised data showed consumer inflation moderated at the end of last year, according to the Bureau of Labor Statistics. However, strategists caution the upward move is heavily tied to just a handful of companies. \"Technology is really important, as you know. Look at Microsoft, Apple, Nvidia make up 18% of the S&P 500, and the total is about 30% and it's actually more today than it was the peak in 2000 when we had that tech bubble burst,\" Crossmark Global Investments CEO Bob Doll said during an interview with FOX Business. ARM CEO TALKS GROWTH AS STOCK ROCKETS APPLE STORE IN CALIFORNIA DECIMATED BY MASKED THIEF To Doll's point, Microsoft displaced Apple as the world's largest company as its market cap moved above $3 trillion on Friday, compared to the iPhone maker's $2.9 trillion, as tracked by Dow Jones Market Data Group. Microsoft CEO Satya Nadella speaks during the OpenAI DevDay event Nov. 6, 2023, in San Francisco. (Justin Sullivan/Getty Images / Getty Images) Under CEO Satya Nadella, Microsoft is the first U.S. company to close with a market value of $3.124 trillion. The company is coming off a record year, pulling in $62 billion in revenues driven by cloud computing and artificial intelligence. WHAT IS ARTIFICIAL INTELLIGENCE (AI)? \"We’ve moved from talking about AI to applying AI at scale by infusing AI across every layer of our tech stack,\" Nardella said during a January earnings call. Apple vs. Microsoft  (Dow Jones Market Data Group ) Communication, technology and consumer discretionary stocks are the top-performing S&P sectors over the past three months, rising over 17%, 16% and 10%, respectively. \"Consider that over the past 12 months only three sectors have outperformed the SPX: Information Technology, Communication Services, and Consumer Discretionary. The first two have dramatically outperformed the index. We consider these sectors to be overvalued and favor investors trimming exposures down to our suggested neutral allocations for Technology and Communication Services and an unfavorable (underweight) allocation in Consumer Discretionary,\" Scott Wren, senior global market strategist at Wells Fargo Investment Institute, wrote in a note to clients. Both are outperforming the broader index, which has gained 5% this year and over 22% during the past 12 months as of Friday. S&P 500 CLICK HERE TO READ MORE ON FOX BUSINESS Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}