{
    "title": "Intel signs Microsoft as foundry customer, says on track to overtake TSMC",
    "date": "2/21/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024:newsml_L2N3F61XA:0-intel-signs-microsoft-as-foundry-customer-says-on-track-to-overtake-tsmc/",
    "text": "Intel INTC said on Wednesday that Microsoft MSFT plans to use its services to manufacture a custom computing chip and that the company expects to beat an internal deadline of 2025 to overtake its biggest rival, Taiwan Semiconductor Manufacturing Co 2330, in advanced chip manufacturing. The American chipmaker also gave new details on how it plans to maintain a lead over TSMC 2330 into 2026 and beyond. Intel made the disclosures at an event in San Jose, California, at the first technology conference for Intel Foundry, the contract manufacturing operation it established to compete with TSMC. Intel says it plans to retake the mantle of making the world's fastest chips from TSMC later this year with what it calls Intel 18A manufacturing technology and extend that lead into 2026 with new technology called Intel 14A. It said Microsoft will use its 18A technology to make an undisclosed chip and that it now expects $15 billion of foundry orders, up from the $10 billion that the company had earlier told investors to expect. TSMC said it had \"no comment on the competitiveness of our advanced technologies\" beyond what its CEO C.C. Wei said at the company's last investor conference in January. TSMC's Taipei-listed stock has jumped almost 17% so far this year due to its dominance in producing the kinds of advanced chips used in AI applications by companies like Nvidia NVDA. The news of 14A technology is the first time the Silicon Valley company has given details of its plans beyond 2025. That is the deadline Intel's CEO, Pat Gelsinger, had set to regain the chipmaking crown when he took the reins three years ago. For decades, Intel made chips only for itself and used its lead in manufacturing to create a cycle in which it made chips with industry-leading performance and charged a premium for them. Those margins, in turn, helped fund manufacturing advances. But when Intel lost its manufacturing lead, its chips became less competitive and margins slipped, sapping the source funding for a manufacturing rebound. Now, Intel is counting on potentially billions of dollars in U.S. government subsidies and business from outside customers to help it get back on track. It is hoping some customers will be enticed by its long history of operating cutting-edge factories on multiple continents, especially those with concerns about TSMC's practice of keeping its most advanced factories clustered in Taiwan. \"It's a sales pitch that's resonating right now. People want that,\" Stu Pann, the executive overseeing Intel Foundry, said of the company's geographic diversity. Intel says it has four \"large\" customers signed up for its 18A manufacturing technology but has yet to name them. It is not clear if Microsoft is among those financially important customers. Intel said on Wednesday it was partnering with Arm Holdings ARM to make it easier to make chips with Arm technologies in its factories. Intel also said it will work with the University of California, Berkeley, and the University of Michigan to allow students to access its 18A manufacturing technology. Intel also has a special technology that analysts say will be useful for speeding up power-hungry artificial intelligence chips. Nvidia, the leader in the AI chip market, has said it is evaluating Intel's manufacturing technology, but the two companies have not announced a deal. Intel's effort to lure in outside customers \"is the key to the turnaround story,\" said Ben Bajarin, chief executive of consulting firm Creative Strategies. \"Unfortunately, it's an unanswered question, because this is a two-to-three-year journey before we have any inkling of knowing that this is working.\" Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @profitable_trades @TradingView @ozonlayerfx @aggressivecalculator @most_luxurious_lifestyle @life_of_lorena.fx @chartfeed @tradingview @TradingView @fxdelta @lifestylewith_ashley26 @TradingView @aitor_avatar @rok_trader @Cenobar @trading_tools.ir @Market Mentor Network @itzi71 Whatever the trade "
}