{
    "title": "Microsoft launches Copilot internally to boost AI adoption by developers: \nReport",
    "date": "2/8/2024",
    "url": "https://www.thehindu.com/sci-tech/technology/microsoft-launches-copilot-internally-boost-ai-adoption-developers-report/article67824041.ece",
    "text": "To enjoy additional benefits CONNECT WITH US February 08, 2024 10:27 am | Updated 11:11 am IST COMMents SHARE READ LATER Microsoft did not immediately respond to a Reuters request for comment [File]\n| Photo Credit: REUTERS Microsoft is launching Microsoft 365 Copilot tool for employees as it looks to get more developers to use artificial intelligence, Business Insider reported on Wednesday. The company has been running pilot tests to up the usage of AI tools among its community of developers and was planning a wider release of Microsoft 365 to its teams for the first time, the report said, citing an internal message. Microsoft did not immediately respond to a Reuters request for comment. The company's investment and partnership with OpenAI, along with a rapidly growing cloud business thanks to customers looking to build AI applications, has made Microsoft the world's most valuable company, surpassing Apple. (For top technology news of the day, subscribe to our tech newsletter Today’s Cache) The Copilot tool is Microsoft's generative AI assistant, built using OpenAI's large language models. The Microsoft 365 Copilot product is an iteration of the tool in the company's productivity suite which includes Word, Outlook and Teams. In November, Microsoft started selling Copilot, an AI assistant that can summarise an email inbox or craft a slide show, for $30 per month. COMMents SHARE technology (general)\n\n/\n\ninternet\n\n/\n\nArtificial Intelligence BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. "
}