{
    "title": "Elon Musk is suing OpenAI for partnering with Microsoft",
    "date": "3/1/2024",
    "url": "https://www.theshortcut.com/p/elon-musk-is-suing-openai",
    "text": "🧑‍⚖️ Elon Musk has sued OpenAI over the company’s pursuit of profit instead of the greater good 💰 Musk was an early backer of OpenAI, investing over $44 million 🌍 However, this was under the promise that OpenAI would remain non-profit and serve to benefit humanity 📈 OpenAI has since shifted its focus to become a for-profit company with Microsoft becoming its main partner Elon Musk has filed a lawsuit against OpenAI and its CEO and president, Sam Altman and Greg Brockman, that accuses the company of breaching its founding mission by putting profit ahead of benefiting humanity. Musk, who was an early backer of OpenAI and co-founder, has claimed that Altman and Brockman convinced him to help bankroll the company in 2015 under the promise that it would remain non-profit-focused. However, OpenAI has since received significant investment from Microsoft, the world’s most valuable company, breaching the original terms of the agreement. The Shortcut is a reader-supported publication. To receive new posts and support our work, consider becoming a free or paid subscriber. Musk claims he invested over $44 million into OpenAI between 2016 and 2020, which made him the largest contributor to the company, according to the lawsuit. The South African billionaire wants OpenAI to stick to its original mission and stop it from monetizing the technology that was created before it shifted to a for-profit company. He contends that by partnering with Microsoft, the company is no longer working towards the best interests of humanity and promoting open-source AI for the greater good. The shift started with the release of GPT4 in March 2023, which remains a closed model and has been opted by Microsoft to power its CoPilot AI integration in Windows 11 and Edge browser. OpenAI’s next big breakthrough is its video generation technology, Sora. The AI model can create incredibly realistic and imaginative scenes from text instructions. We’ll have to wait and see whether Musk’s lawsuit is successful, but the outcome could reshape the rapidly growing AI space. No posts Ready for more? "
}