{
    "title": null,
    "date": "1/18/2024",
    "url": "https://www.kiplinger.com/investing/worlds-most-valuable-company-apple-and-microsoft-battle-for-top-spot",
    "text": "Save up to 74% Subscribe to Kiplinger When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Apple and Microsoft are running a tight race as they close in on $3 trillion in market capitalization. Apple (AAPL) and Microsoft (MSFT) find themselves in a tight race over bragging rights to the title of world's most valuable publicly traded company after AAPL stock popped following a big analyst upgrade. A poor start to the year already had some bulls saying it's time to buy the dip in Apple stock. But when one of Wall Street's largest broker-dealers joined the chorus before Thursday's opening bell, it helped Apple recover billions in market value. BofA Securities lifted its recommendation on AAPL stock to Buy from Neutral (the equivalent of Hold), citing the iPhone maker's investments in generative artificial intelligence (AI) and the launch of its Vision Pro mixed reality headset, among other impending catalysts. Be a smarter, better informed investor. Profit and prosper with the best of expert advice on investing, taxes, retirement, personal finance and more - straight to your e-mail. Profit and prosper with the best of expert advice - straight to your e-mail. With a new price target of $225 – up from $208 – BofA Securities gives AAPL stock implied upside of about 20% over the next 12 months or so. The Street's average target price stands at $199.40, according to data from S&P Global Market Intelligence, good for implied upside of only 6% in the next year. Importantly, while some analysts have cited weaker iPhone sales in China as reasons to become more cautious on AAPL stock, the BofA Securities team led by analyst Wamsi Mohan argued as part of its upgrade that Apple's \"China weakness is largely offset by strength in other countries.\" Although Apple routinely makes the list of Wall Street's top-ranked Dow Jones stocks, worries over demand in China have AAPL off to a rough start in 2024. Apple stock is up about 38% over the past 52 weeks, but shares have spent all of January in the red on a year-to-date basis, hurt partly by downgrades. Piper Sandler analyst Harsh Kumar cut his recommendation on the stock in early January to Neutral (the equivalent of Hold) from Overweight (Buy), citing a weak macroeconomic backdrop in China. Kumar's downgrade followed a more bearish downgrade by Barclays analyst Tim Long – to Underweight from Neutral – two days earlier. Long also cited weaker revenue in China as a concern. Apple has seen iPhone sales soften in China amid an economic slowdown and other factors. Consumers are holding onto their pricey iPhones longer between refresh cycles, analysts note, while a new 5G phone from rival Huawei is also chipping away at iPhone demand. While Apple stock has traded essentially sideways for six months on worries that growth has peaked, fellow Magnificent 7 stock Microsoft overtook it as the global leader in market capitalization thanks to exuberance over generative AI. Microsoft, which enjoys a sort of first-mover advantage in AI via its partnership with OpenAI, had already been an outstanding long-term holding thanks to its dominance in cloud services. Not only was MSFT one of the 30 best stocks in the world for three decades, anyone who put $1,000 into Microsoft stock 20 years ago would have clobbered  the broader market. Check out the stocks billionaires are buying or hedge funds' top blue chip stocks and you'll see that much of the putative smart money agrees with the Street's view, which gives MSFT a rare consensus recommendation of Strong Buy. \"Microsoft continues to pursue long-term growth through its AI and cloud investments, and may just hold the premier position in business technology,\" writes Argus Research analyst Joseph Bonner, who rates shares at Buy. \"It also has a large and loyal customer base, a large cash cushion and a rock-solid balance sheet.\"  Have a look at the above chart and you'll see how bullishness like Bonner's helped Microsoft stock return nearly 65% over the past 52 weeks, allowing it to surpass Apple in market capitalization. As of Thursday's close, the two tech giants were separated by less than $10 billion in market cap: $2.927 trillion for MSFT vs $2.917 trillion for AAPL, or essentially tied. Whether the companies' market values diverge from here is the big question. Happily for investors in both names, the Street very much expects AAPL stock and MSFT stock to continue to beat the broader market in the year ahead. Dan Burrows is Kiplinger's senior investing writer, having joined the august publication full time in 2016.  A long-time financial journalist, Dan is a veteran of SmartMoney, MarketWatch, CBS MoneyWatch, InvestorPlace and DailyFinance. He has written for The Wall Street Journal, Bloomberg, Consumer Reports, Senior Executive and Boston magazine, and his stories have appeared in the New York Daily News, the San Jose Mercury News and Investor's Business Daily, among other publications. As a senior writer at AOL's DailyFinance, Dan reported market news from the floor of the New York Stock Exchange and hosted a weekly video segment on equities.  Once upon a time – before his days as a financial reporter and assistant financial editor at legendary fashion trade paper Women's Wear Daily – Dan worked for Spy magazine, scribbled away at Time Inc. and contributed to Maxim magazine back when lad mags were a thing. He's also written for Esquire magazine's Dubious Achievements Awards.  In his current role at Kiplinger, Dan writes about equities, fixed income, currencies, commodities, funds, macroeconomics, demographics, real estate, cost of living indexes and more.  Dan holds a bachelor's degree from Oberlin College and a master's degree from Columbia University.  Disclosure: Dan does not trade stocks or other securities. Rather, he dollar-cost averages into cheap funds and index funds and holds them forever in tax-advantaged accounts. If you’ll have multiple income streams in retirement, you’ll need to coordinate everything so you don’t end up paying taxes on your Social Security benefits. By Nick Stahl\n\nPublished 22 March 24 The U.S. government is heavily investing in water infrastructure, and that’s just one reason to dip your toe into investing in water. By Peter J. Klein, CFA®, CAP®, CSRIC®, CRPS®\n\nPublished 22 March 24 The main indexes erased early losses Tuesday as mega-cap tech stock Nvidia swung higher. By Karee Venema\n\nPublished 19 March 24 The main indexes started the week strong after several mega-cap stocks rallied. By Karee Venema\n\nPublished 18 March 24 Weakness in several Magnificent 7 stocks created headwinds for the main indexes Friday. By Karee Venema\n\nPublished 15 March 24 The main indexes erased an early lead Thursday as several semiconductor stocks sold off. By Karee Venema\n\nPublished 14 March 24 The Magnificent Seven have been driving stock returns. Here, we take a close look at the mega-cap hotshots to see what's next. By Nellie S. Huang\n\nPublished 10 March 24 A few small changes in your investing strategy can result in big tax advantages. By Jeff Reeves\n\nPublished 9 March 24 The Berkshire Hathaway portfolio is a diverse set of blue chips and some lesser-known growth bets. Here, we look at all stocks picked by Buffett and his lieutenants. By Dan Burrows\n\nPublished 7 March 24 Markets took a breather ahead of a busy week with big implications for rate cuts. By Dan Burrows\n\nPublished 4 March 24 Kiplinger is part of Future plc, an international media group and leading digital publisher.  Visit our corporate site.\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}