{
    "title": null,
    "date": "1/31/2024",
    "url": "https://news.microsoft.com/en-in/microsoft-is-copiloting-every-sector-industry-and-citizen-in-india-to-transform-with-ai/",
    "text": "January 31, 2024\t\t\t\n\t\t\t | Microsoft Source Mumbai, January 31, 2024: Microsoft in India is empowering thousands of enterprises, digital natives and SMBs to harness the potential of AI, enabling organizations to transform processes, foster innovation and attain increased business value. As leaders across industries seek to keep pace with today’s advancements, they rely on Microsoft to bring comprehensive industry expertise, scale, and capabilities like Copilot across Microsoft products and Azure Open AI to help turn their AI visions into reality. At the Microsoft AI Tour in Mumbai today, senior business leaders and decision makers got a first-hand view into how AI solutions are designed to solve business challenges, improve efficiency, and accelerate development. Much of India’s dynamic landscape is being shaped by sector-agnostic adoption of the intelligent cloud and AI, together creating a new class of distributed, connected applications and breakthrough business outcomes. According to a recent report commissioned by Microsoft, for every USD that a company invests in AI, it realizes an average return of USD 3.50. Infusing AI into every layer of the tech stack is delivering real productivity gains for organizations, amplifying human ingenuity, and reducing digital debt. Some of India’s leading businesses across sectors are using Microsoft’s AI solutions to improve efficiency and enhance customer experiences. India’s biggest online fashion retailer, Myntra, is solving the open-ended search problem by using generative AI to help shoppers figure out what they should wear based on occasion. Genpact’s AI Guru, a chatbot powered by OpenAI’s GPT-3.5 via Azure OpenAI Service, is enhancing learning for senior employees globally. Cognizant’s Innovation Assistant, a generative AI-powered tool built on Microsoft Azure OpenAI Service is designed to assimilate enterprise knowledge and enable greater creativity and innovation among teams working to solve client challenges across industries. Arvind Ltd digitized the shop floor and sampling process using PowerApps and significantly reduced human errors in the sampling and production process. Air India’s generative AI virtual agent, “Ask AI.g,” powered by Azure OpenAI service enhanced customer experiences by managing queries across 1,300 areas in four languages. Sharing his views on the potential of AI and driving impact at scale, Ahmed Mazhari, president, Microsoft Asia, said, “We are in the midst of the biggest and most innovative developments that tech has experienced over several decades. The pace of diffusion of this technology is unprecedented and we are confident that AI will touch every facet of our lives in 2024. Tech services companies are doubling down and intensifying their focus on building new capabilities and skills to serve customers’ needs in generative AI. We are excited that, today, one in four AI projects on GitHub comes from India and, by 2026, India will have eclipsed the US. India is very uniquely positioned to enable the adoption of AI at scale at home and in international markets.” Puneet Chandok, president, Microsoft India & South Asia said, “India is emerging as a leader both in AI adoption and as a hub of talent, and our mission at Microsoft is to enable AI for everyone, democratizing access for every sector, organization and citizen in the country. We are working closely with businesses across India to scale and transform with AI, in line with our commitment to being India and South Asia’s most trusted and innovative AI partner. Building on our tech stack with GitHub Copilot, Bing Chat and Microsoft 365 Copilot, we envision a world where everyone will have a copilot for everything they do regardless of their profession.” At the event, Microsoft engaged with leaders from organizations across industry sectors, such as Axis Bank, Wipro, Indigo, HighRadius and others. These leaders spoke about the use cases of Copilot for M365, Azure Open AI and Azure AI Studio and how it has improved productivity, efficiency, unlocked creativity and enhanced safety and security in their business. Highlighting the AI collaboration with Microsoft, Avinash Raghavendra, president & CIO of Axis Bank said, “Our collaboration with Microsoft through its technologies has helped drive our workforce to deliver strong results to the organization through a robust productivity stack that is now embedded with generative AI. As a bank that cares abouts its employees, we believe that our AI collaboration with Microsoft does not just help us drive optimized and robust processes, but also help in deliver employee satisfaction by providing the means to be always productive and resourceful.” Anup Purohit, chief information officer, Wipro said, “Embracing generative AI and foundational AI has been pivotal in our company’s transformation story. Our teams are embracing AI, thereby amplifying and bolstering our influence in the marketplace. Solutions such as Copilot have aligned with our objective of empowering our teams to achieve more efficient workflows and deliver high quality output. It has driven innovation and reinvention of our processes while helping us render better services to our clients.” About Microsoft India Microsoft (Nasdaq “MSFT” @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more. Microsoft set up its India operations in 1990. Today, Microsoft entities in India have over 23,000 employees, engaged in sales and marketing, research, development, customer support, and industry solutions across 10 Indian cities – Ahmedabad, Bengaluru, Chennai, New Delhi, Gurugram, Hyderabad, Kolkata, Mumbai, Noida, and Pune. Microsoft offers its global cloud services from local data centers to accelerate digital transformation across Indian startups, businesses, and government organizations. Follow us: Share this page: "
}