{
    "title": "Microsoft beats Apple as world's most valuable company",
    "date": "1/15/2024",
    "url": "https://rollingout.com/2024/01/15/microsoft-beats-apple/",
    "text": "Home » Tech Microsoft has beaten Apple as the world’s most valuable company for the first time in two years. The firm’s market capitalization stood at $2.887 trillion — its highest ever — on Jan. 12, while Apple’s market capitalization was $2.875 trillion a day earlier. Worries about smartphone demand have pushed Apple’s shares down 3 percent so far in 2024. Microsoft, on the other hand, is up about 3 percent on the year-to-date after, surging 57 percent in 2023 in a rally driven in part by its lead in generative artificial intelligence through an investment in ChatGPT-maker OpenAI. Apple’s market capitalization peaked at $3.081 trillion on Dec. 14. Microsoft has incorporated OpenAI’s technology across its suite of productivity software, and its lead on AI adoption has also created an opportunity to challenge Google’s dominance of web search. Apple has been grappling with a dip in demand, including for its flagship iPhone. Demand in China, a major market, has slumped as the country’s economy makes a slow recovery from the Covid-19 pandemic. Microsoft has briefly taken the lead over Apple as the planet’s most valuable company only a handful of times since 2018. The most recent occurrence was in 2021, when concerns about supply-chain shortages related to the pandemic hit Apple’s stock price. Apple’s most recent quarterly report, released in November, gave a sales forecast for the holiday quarter that missed Wall Street expectations, which was impacted by weak demand for iPads and wearables. Analysts predict Apple will post revenue up 0.7 percent to $117.9 billion for the December quarter, with the firm due to report its results on Feb. 1. Your email address will not be published. Required fields are marked * Comment * Name * Email *  Sign up for Rolling Out news straight to your inbox. By clicking “submit,” you agree to receive emails from Rolling Out and accept our web terms of use and privacy and cookie policy. *Terms apply. "
}