{
    "title": "Microsoft's first-in-three-decades 'key' change is a tangible symbol of CEO \nSatya Nadella's AI bet",
    "date": "1/4/2024",
    "url": "https://finance.yahoo.com/news/microsoft-first-three-decades-key-183827166.html",
    "text": "Hi there, it’s Rachyl Jones with the tech team. The first major change in three decades is coming to Windows computer keyboards. In the coming days and weeks, Windows 11 PCs from Microsoft and its partners will include a physical Copilot button that activates the company’s artificial intelligence assistant, the company said in a blog post on Thursday. The new key—which sports an icon that looks a bit like a folded piece of origami—means users can summon AI features with a quick tap of the button instead of clicking through the taskbar on-screen. “AI will be seamlessly woven into Windows from the system, to the silicon, to the hardware,” Yusuf Mehdi, Microsoft’s consumer chief marketing officer, said in the blog post. “This will not only simplify people’s computing experience but also amplify it, making 2024 the year of the AI PC.” Whether the key will make any material difference in PC sales is unclear, but the move underscores Microsoft’s investment in Copilot as the future of how consumers interact with computers. Built on ChatGPT technology—which Microsoft has played a key role in funding—Copilot began as a feature for Bing and Edge in February 2023. It has since become available throughout Windows 11 and Microsoft 365 products for both business and personal use, marketing as “your everyday AI companion.” The most recent significant change to Microsoft’s keyboards was nearly 30 years ago when it added the Windows button to launch the “Start” menu. Depending on the product, the new Copilot key will either stand in the place of the Menu key or the right Control key, CNBC reported. Larger computers will have enough keyboard space for both the Copilot button and the right Control key, according to CNBC. While Microsoft Windows remains the dominant PC operating system globally, the company’s Surface computers (which will integrate the new key) have failed to reach more than a few percentage points of market share. Any Windows PC maker, including industry leaders Lenovo, Dell, and HP, can offer keyboards with the new Copilot button of course. But the Copilot button will give Microsoft one more way to tout the AI capabilities of its Surface computers. At a presentation for journalists and industry professionals in September, Microsoft Surface marketing director Adrienne Brewbaker ran a live demonstration comparing the speed of a Surface PC against Apple’s MacBook Pro. In the presentation, the Microsoft product rendered GPUs, graphic processing units essential to run generative AI, twice as fast. And while Bloomberg has reported Apple is working on its own large language model, the closest product Apple has at the moment is Siri (which does not have a special button on MacBooks). With that, here are more of today's top tech stories. Rachyl Jones Want to send thoughts or suggestions to Data Sheet? Drop a line here. This story was originally featured on Fortune.com Related Quotes "
}