{
    "title": "Microsoft, Intel and AI Veteran, Merrie Williamson, to Join Equinix as \nChief Customer and Revenue Officer",
    "date": "2/27/2024",
    "url": "https://finance.yahoo.com/news/microsoft-intel-ai-veteran-merrie-140000227.html",
    "text": "As Digital Infrastructure Continues to Enable the Necessities of Today's Society, Williamson Brings Decades of Experience Helping Customers Navigate Their Digital Transformation REDWOOD CITY, Calif., Feb. 27, 2024 /PRNewswire/ -- Equinix, Inc. (Nasdaq: EQIX), the world's digital infrastructure company®, today announced the appointment of Merrie Williamson as Executive Vice President and Chief Customer and Revenue Officer (CCRO), effective March 25. With more than 20 years of experience in helping companies evolve their digital business through her leadership roles at Microsoft and Intel, Williamson joins Equinix as the company continues to grow its position as the trusted platform for enterprise digital transformation. \"Merrie is an operational and visionary leader with the unique skills and experience to help drive the next chapter of our growth and the increasing value we provide to customers,\" said Charles Meyers, President and CEO of Equinix. \"She also has extensive experience aligning complex go-to-market (GTM) organizations to deliver revenue growth. Her proven track record positions her well to build new routes to market, strengthen existing revenue streams, and continue our journey to becoming a true platform company.\" As CCRO, Williamson will be responsible for the company's entire customer experience and overall go-to-market strategy. This includes Sales, Marketing, Customer Care and Experience, Revenue Operations, and the company's regional management across the Americas, EMEA and Asia-Pacific regions. Additionally, she will have the opportunity to leverage the company's technology leadership and partner ecosystem to generate exceptional customer experiences and enable businesses to capitalize on emerging areas such as Private AI. She will serve on the Equinix Executive Staff reporting to Equinix CEO Charles Meyers. \"For years, Equinix has played an important role in providing the digital infrastructure critical for enterprises as their businesses become increasingly digital,\" said Williamson. \"As we enter the age of AI and multicloud as the architecture of choice, I am thrilled to be part of the platform that is enabling the success of thousands of companies globally. In addition to the world-class services it provides, Equinix also has a compelling vision where technology and company culture combine to drive outstanding business outcomes.\" Williamson previously served as Corporate Vice President of Azure Infrastructure and Digital and Application Innovation at Microsoft. In this role, she was responsible for commercial sales strategy and execution for the core multibillion-dollar Azure business, leading a global team enabling customers across segments, industries and geographies to reap the benefits of digital transformation and the cloud. Before joining Microsoft in 2019, Williamson spent two decades at Intel. Through a succession of increasingly senior roles, from technical program manager to senior director of data center sales and marketing, she drove strategic product investments from inception to launch—typically in emerging areas of the business—and brought together internal stakeholders, external partners and sales teams to drive revenue growth. Williamson is passionate about service and community. She has served on the boards of MESA (STEM pipeline for Seattle underrepresented schools) and the Seattle YMCA, where she also spent two years as chairperson. She is dedicated to creating opportunities for women and other underrepresented communities in STEM, sales and the technology industry overall. She earned B.S. and M.S. degrees in Industrial Science at the University of Michigan. About EquinixEquinix (Nasdaq: EQIX) is the world's digital infrastructure company®. Digital leaders harness Equinix's trusted platform to bring together and interconnect foundational infrastructure at software speed. Equinix enables organizations to access all the right places, partners and possibilities to scale with agility, speed the launch of digital services, deliver world-class experiences and multiply their value, while supporting their sustainability goals. Forward-Looking StatementsThis press release contains forward-looking statements that involve risks and uncertainties. Actual results may differ materially from expectations discussed in such forward-looking statements. Factors that might cause such differences include, but are not limited to, risks to our business and operating results related to the current inflationary environment; foreign currency exchange rate fluctuations; increased costs and increased challenges to procure power and the general volatility in the global energy market; the challenges of acquiring, operating and constructing IBX® and xScale® data centers and developing, deploying and delivering Equinix products and solutions; unanticipated costs or difficulties relating to the integration of companies we have acquired or will acquire into Equinix; a failure to receive significant revenues from customers in recently built out or acquired data centers; failure to complete any financing arrangements contemplated from time to time; competition from existing and new competitors; the ability to generate sufficient cash flow or otherwise obtain funds to repay new or outstanding indebtedness; the loss or decline in business from our key customers; risks related to potential cybersecurity breaches; risks related to our taxation as a REIT and other risks described from time to time in Equinix filings with the Securities and Exchange Commission. In particular, see recent and upcoming Equinix quarterly and annual reports filed with the Securities and Exchange Commission, copies of which are available upon request from Equinix. Equinix does not assume any obligation to update the forward-looking information contained in this press release. View original content to download multimedia:https://www.prnewswire.com/news-releases/microsoft-intel-and-ai-veteran-merrie-williamson-to-join-equinix-as-chief-customer-and-revenue-officer-302071877.html SOURCE Equinix, Inc. Related Quotes "
}