{
    "title": "Windows Weekly 866: Squishmallows With Guns",
    "date": "2/1/2024",
    "url": "https://www.thurrott.com/podcasts/windows-weekly/297165/windows-weekly-866-squishmallows-with-guns",
    "text": "   Leo, Richard, and Paul discuss Microsoft’s blockbuster financial quarter, other quarterly financial reports, Windows, Microsoft 365, AI, Xbox, and much more. Stream this episode and subscribe Enjoy Windows Weekly on YouTube Sign up for our new free newsletter to get three time-saving tips each Friday — and get free copies of Paul Thurrott's Windows 11 and Windows 10 Field Guides (normally $9.99) as a special welcome gift! \"*\" indicates required fields Δ Microsoft announced Tuesday that it earned a net income of $21.9 billion on revenues of $62 billion in the quarter ending December 31, 2023. Those figures are up 33 percent and 18 percent, respectively, year-over-year (YOY). Windows Insider Program: https://www.thurrott.com/cloud/296758/google-releases-arm64-build-of-chrome-for-windows. A new era? Microsoft Edge is at it again. But aren’t we just getting numb to this now? Microsoft Edge 121 adds several new features OneDrive gets a new design on the web Teams goes down for the count, making us realize how much we hate Teams Microsoft adds porn deepfake guardrails to Designer AI – So, this wasn’t there before now? FTC is investigating Microsoft/OpenAI and other Big Tech AI partnerships Nvidia RTX Video HDR can now convert SDR video to HDR Microsoft can finally bring Xbox Cloud Gaming to the iPhone (and Fortnite is coming back to the iPhone in the EU) Xbox president joins the chorus of complaints around Apple’s EU DMA non-compliance compliance Xbox Series S screenshots will be restricted to Full HD 1900 layoffs at Activision Blizzard, Zenimax, and Xbox If you need OneDrive or Google Drive on Linux, Insync does the job. But there are other benefits and one semi-major missing feature. Semi-related: Arc Search for iPhone is the future of Arc on mobile https://runasradio.com/Shows/Show/917 https://www.florafaunawhisky.com/collection/1991-release/dailuaine-16-years/   Paul Thurrott is an award-winning technology journalist and blogger with over 25 years of industry experience and the author of 30 books. He is the owner of Thurrott.com and the host of three tech podcasts: Windows Weekly with Leo Laporte and Richard Campbell, Hands-On Windows, and First Ring Daily with Brad Sams. He was formerly the senior technology analyst at Windows IT Pro and the creator of the SuperSite for Windows from 1999 to 2014 and the Major Domo of Thurrott.com while at BWW Media Group from 2015 to 2023. You can reach Paul via email, Twitter or Mastodon. comment comment comment comments Join the crowd where the love of tech is real - become a Thurrott Premium Member today! Sign up for our new free newsletter to get three time-saving tips each Friday \"*\" indicates required fields Δ Get a completely free copy of Paul Thurrott’s knowledge-packed Windows 11 and Windows 10 Field Guides when you sign up for our new Windows Intelligence newsletter. Three fresh tips in your inbox each Friday:  \"*\" indicates required fields Δ "
}