{
    "title": "Is Microsoft Stock a Buy?",
    "date": "2/5/2024",
    "url": "https://www.fool.com/investing/2024/02/05/is-microsoft-stock-a-buy/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Microsoft (MSFT -0.15%) posted its latest earnings report on Jan. 30. For the second quarter of fiscal 2024, which ended on Dec. 31, its revenue rose 18% year over year to $62 billion and exceeded analysts' estimates by $890 million. Its earnings per share climbed 33% to $2.93 and also cleared the consensus forecast by $0.16. Those headline numbers were dazzling, but Microsoft's stock has already rallied more than 60% over the past 12 months and is hovering near its all-time high. Should investors still buy more shares of this tech giant today? Microsoft CEO Satya Nadella. Image source: Microsoft. In the second quarter, Microsoft generated 42% of its revenue from its Intelligent Cloud division, which handles its Azure cloud infrastructure platform along with its other cloud and server products. It generated 31% of its revenue from the Productivity and Business Processes division, which houses Office, Dynamics, and LinkedIn. The remaining 27% came from the More Personal Computing division, which manages its Windows, Xbox, Surface, Bing, and digital advertising businesses. As the following table illustrates, Microsoft's year-over-year revenue growth accelerated for four consecutive quarters. That acceleration was driven by the robust growth of its cloud and productivity divisions and the stabilization of its personal computing division. Metric Q2 2023 Q3 2023 Q4 2023 Q1 2024 Q2 2024 Intelligent Cloud Revenue Growth (YOY) 18% 16% 15% 19% 20% Productivity and Business Processes Revenue Growth (YOY) 7% 11% 10% 13% 13% More Personal Computing Revenue Growth (YOY) (19%) (9%) (4%) 3% 19% Total Revenue Growth (YOY) 2% 7% 8% 13% 18% Data source: Microsoft. YOY = Year over year. Over the past year, Microsoft's Intelligent Cloud business drove most of its growth as Azure gained more customers. That growth was amplified by its investments in OpenAI, which enabled it to weave the start-up's AI tools into its cloud-based services. Within that business, its \"Azure and other cloud services\" revenue rose 30% year over year in the second quarter, compared to its 29% growth in the first quarter and 26% growth in the fourth quarter of fiscal 2023. Those two consecutive quarters of accelerating growth set it apart from other cloud software companies, which suffered slowdowns over the past year. Azure is also growing faster than its closest rivals. In their latest quarters, Azure's larger competitor Amazon Web Services (AWS) grew its revenue 13% year over year, while Alphabet's Google Cloud -- which ranks a distant third in the cloud race after AWS and Azure -- grew its revenue 26% year over year. Azure's superior growth suggests its early-mover's advantage in the generative AI market is paying off. During the conference call, CFO Amy Hood said Azure's growth would \"remain stable\" in constant currency terms relative to the second quarter with a \"strong contribution from AI.\" Therefore, Azure probably won't lose its mojo anytime soon. Microsoft's productivity and business processes division suffered a slowdown in fiscal 2023 as more companies reined in their software spending. But it returned to double-digit growth over the past year as Office 365, LinkedIn, and Dynamics locked in more users. Dynamics is also notably growing faster than its larger competitor Salesforce in the customer relationship management (CRM) market. Dynamics' product and cloud services revenue rose 21% year over year in the second quarter, while Salesforce's total revenue only grew 11% in its latest quarter. Its More Personal Computing division struggled throughout fiscal 2023 as sales of new PCs and gaming consoles cooled off in a post-pandemic market. However, that segment returned to growth over the past two quarters as those two markets stabilized -- and it should expand significantly as the Xbox division gobbles up Activision Blizzard. Microsoft continues to ramp up its spending -- especially across its cloud, AI, and gaming ecosystems -- but its operating margin still expanded 490 basis points year over year to 43.6% in the second quarter. For the full year, analysts expect its operating margin to expand from 42.3% in fiscal 2023 to 43.7% in fiscal 2024. From fiscal 2023 to fiscal 2026, analysts expect Microsoft's revenue to grow at a compound annual growth rate (CAGR) of 15% as its EPS rises at a CAGR of 17%. We should take those estimates with a grain of salt, but Microsoft's disciplined expansion over the past decade suggests it can hit those targets. But Microsoft's stock isn't cheap at 35 times forward earnings. Alphabet, which is expected to grow its EPS at a similar rate over the next three years, trades at just 21 times forward earnings. That higher valuation could limit Microsoft's upside potential and set it up for a steep drop if Azure's growth abruptly slows down. That said, I believe Microsoft's stock is still worth buying today. It's firing on all cylinders, expanding its business, and seemingly growing faster than Amazon, Google, and other tech giants in the cloud and AI markets. Its stock could go through some wild near-term swings, but it should head much higher over the next few years. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Leo Sun has positions in Amazon. The Motley Fool has positions in and recommends Alphabet, Amazon, Microsoft, and Salesforce. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}