{
    "title": "Microsoft Puts Copilot AI to Work for Sustainability Management",
    "date": "2/13/2024",
    "url": "https://virtualizationreview.com/Articles/2024/02/13/sustainability-copilot.aspx",
    "text": "Advanced Search News Microsoft is previewing new AI technology for its cloud sustainability initiative, introducing new data and AI solutions including a Copilot to help guide decision-making and reporting. These solutions and the company's latest \"Copilot\" AI assistant -- called Copilot in Microsoft Sustainability Manager -- join a raft of preview tech available in the  Microsoft Cloud for Sustainability. It's described by the company as a set of environmental, social, and governance (ESG) capabilities provided by Microsoft and its global partners to help organizations accelerate sustainability progress and business growth. The company wraps up those ESG capabilities into its Microsoft Fabric offering, an all-in-one enterprise analytics solution covering everything from data movement to data science, real-time analytics and business intelligence. \"With sustainability data solutions in Microsoft Fabric (preview), you can analyze your organization's environmental, social, and governance (ESG) data together with your other enterprise data to inform more holistic decisions and better-targeted outcomes,\" the company said in a post today (Feb. 13). \"Gather, harmonize, and transform sustainability data into meaningful, actionable insights, and use advanced analytics and powerful AI to help you prepare data for analysis, regulatory reporting, and AI-driven innovation.\" Another Feb. 13 post describes the capabilities of the new AI Copilot tasked with improving sustainability interactions. \"With centrally managed data and Copilot in Microsoft Sustainability Manager, now in preview, organizations can use powerful generative AI and natural language queries to gain faster lines of sight into and answers out of data,\" Microsoft said. The company said that when asked questions in natural human language, the Copilot sustainability tool --  trained on Microsoft Cloud for Sustainability data schemas -- will work across that cloud data for use cases including: Other preview tech, called \"intelligent insights in Microsoft Sustainability Manager,\" provides organizations with an integrated and interactive AI model to enable deeper analysis of calculated emissions data. It reportedly helps users: The company summarized preview sustainability offerings thusly: Microsoft offers an \"Essentials\" Microsoft Sustainability Manager plan and a \"Premium\" plan that can be compared here. The company on Feb. 13 broadcast a free digital event that shows how Microsoft data and AI solutions can support organizational sustainability journeys, available here. About the Author David Ramel is an editor and writer for Converge360. Subscribe on YouTube More Tech Library More Webcasts Problems? Questions? Feedback? E-mail us. "
}