{
    "title": "3 Mega-Cap Stocks That Could Replace Tesla in the 'Magnificent Seven'",
    "date": "2/22/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/MSFT-Q/pressreleases/24279600/3-mega-cap-stocks-that-could-replace-tesla-in-the-magnificent-seven/",
    "text": "Today's latest batch of corporate earnings seems to confirm what many market-watchers already knew - artificial intelligence (AI) stocks are in, and electric vehicle (EV) stocks are out. While startup EV stocks Rivian (RIVN) and Lucid (LCID) are selling off hard in the early going after their latest quarterly reports, AI chip giant Nvidia (NVDA) continues to defy gravity after its highly anticipated Q4 results, with the shares leading today's rally on Wall Street. Sitting out today's upside is EV giant Tesla (TSLA), whose market cap now stands at $620.3 billion - down from a peak north of $1 trillion at its highs. Today's remarkably lopsided earnings reactions could add fuel to the fire for those who argue that TSLA should be booted from the elite group of stocks known as the “Magnificent Seven,\" which also includes Nvidia, Microsoft (MSFT), Amazon (AMZN), Meta (META), Apple (AAPL) and Alphabet (GOOGL). While it's an informal title, the Magnificent Seven moniker isn't just window dressing. These companies collectively added a staggering $5.1 trillion in total market cap during 2023, and the universe of all U.S.-listed stocks would have advanced by just 12.6% last year without the Magnificent Seven's influence, compared to 23.3% with their returns included. That's why debates are starting to flare about Tesla's inclusion in the group, as the Elon Musk-led company has been pressured by a litany of troubles since the start of the year. With Tesla stock now down 22.6% on a YTD basis, here's a look at three mega-cap stocks worthy of replacing the EV maker in the Magnificent Seven. Founded in 1961 and based out of Palo Alto, Calif., Broadcom (AVGO) is a global leader in infrastructure technology, providing a wide range of semiconductor and infrastructure software solutions for data centers, cloud computing, networking, and wireless communications. It currently commands a massive market cap of $574.2 billion. AVGO stock is up 15.4% on a YTD basis. Moreover, the stock offers a dividend yield of 1.71%, backed by 13 years of growth. In its third-quarter earnings report, Broadcom beat Wall Street's expectations on both the top line and bottom line. Revenues for the quarter came in at $9.3 billion, up 4% from the previous year. Adjusted EPS improved 6% to $11.06, surpassing the consensus estimate of $10.96. Notably, the company's EPS has topped expectations in each of the past five quarters. Further, Broadcom is expected to be one of the primary beneficiaries of the booming AI market. It's the second-largest AI chip company by revenue, behind only Nvidia - powered by heavy demand from partners like Google. Plus, its recent acquisition of VMware should bolster AVGO's cloud credentials. Analysts have an average rating of “Strong Buy” for AVGO stock, which is already trading above its mean price target of $1,171.43. However, the Street-high target price of $1,550 indicates an upside potential of about 20% from current levels. Out of 25 analysts covering the stock, 21 have a “Strong Buy” rating and 4 have a “Hold” rating. After its latest blowout earnings report, streaming giant Netflix (NFLX) is next up on our list as a potential new entrant in the “Magnificent Seven” club. Established in 1997, Netflix is a global subscription streaming service, primarily offering original and acquired films and TV shows that are personalized according to the viewer's preferences. Its market cap currently stands at $248.1 billion. Netflix stock has rallied 19.6% on a YTD basis, easily outperforming the broader equities market. For the December quarter, Netflix posted a robust set of numbers, highlighted by a significant jump in the bottom line. While revenues rose by 12.5% from the previous year to $8.8 billion, this pales in comparison to the streamer's earnings growth. EPS shot up from a mere $0.12 in the prior year to $2.11 in the latest quarter, though still fell short of consensus estimates. However, investors overlooked the EPS shortfall, as Netflix shattered subscriber growth expectations by adding 13.1 million members globally during Q4. With its laser focus on content and a large dedicated user base, Netflix outshines its upstart streaming competitors, with its shows dominating the ratings charts consistently. Coupled with one of the lowest churn rates in the industry and a strong lineup of shows set for 2024, the company is well-positioned to maintain its dominance in streaming. Analysts are largely optimistic about Netflix stock, with a consensus rating of “Moderate Buy” and a Street-high target price of $700. This denotes an upside potential of about 19.6% from current levels. Out of 40 analysts covering the stock, 22 have a “Strong Buy” rating, 1 has a “Moderate Buy” rating, 15 have a “Hold” rating, and 2 have a “Strong Sell” rating. We round out our list with Eli Lilly and Company (LLY), whose market value has soared as its anti-obesity drugs explode in popularity. Eli Lilly was founded in 1876, and is a pharmaceutical company focused on the research, development, manufacturing, and commercialization of human and animal health products. With its products selling in 125 countries worldwide, the company's market cap currently stands at a mammoth $708 billion. Eli Lilly stock is up by an impressive 32% on a YTD basis. The stock also offers a dividend yield of 0.7%, and these shareholder payouts have grown consistently for the past nine years. Eli Lilly recently reported its results for the fourth quarter, and delivered solid growth in both revenue and earnings. Revenues rose by 28% from the prior year to $9.3 billion, while EPS grew by 19% to $2.49. Both figures surpassed Wall Street's consensus estimates. The drug giant also remains confident that revenues will continue to grow in 2024. Beyond its blockbuster weight-loss and diabetes drugs, LLY recently landed approval for Ebglyss (approved in November by the European Commission for the treatment of atopic dermatitis), Jaypirca (approved in December by the FDA for the treatment of chronic lymphocytic leukemia), and Omvoh (approved by the FDA in October for the treatment of ulcerative colitis). Overall, the company expects to generate revenues of $40.4 billion to $41.6 billion for fiscal year 2024, compared to $34.12 billion in 2023. Analysts have an average rating of “Strong Buy” for LLY stock, which has a Street-high target price of $950. This indicates an upside potential of about 23% from current levels. Out of 21 analysts covering the stock, 18 have a “Strong Buy” rating, 1 has a “Moderate Buy” rating, and 2 have a “Hold” rating. Provided Content: Content provided by Barchart. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Microsoft Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}