{
    "title": "Microsoft teams up with Mistral to bring start-up's AI model on Azure",
    "date": "2/26/2024",
    "url": "https://seekingalpha.com/news/4071598-microsoft-teams-up-with-mistral-to-bring-start-ups-ai-model-on-azure",
    "text": "BlackJack3D Microsoft (NASDAQ:MSFT) is collaborating with AI start up Mistral amid efforts to look beyond OpenAI. The Paris-based company said on Monday that it will bring its open and commercial models to Microsoft's Azure cloud computing platform, its first distribution partner. The company's latest language model called Mistral Large — which can be used for multilingual reasoning tasks, including text understanding, transformation, and code generation — is available through Azure AI Studio and Azure Machine Learning. Mistral added that the AI model achieves strong results on commonly used benchmarks, making it the world's second-ranked model generally available through an API, next to OpenAI's GPT-4. The figure below shows the comparison made by Mistral for its AI model with other large language models, or LLMs such as GPT-4 and GPT 3.5, from OpenAI, LLaMA from Meta Platforms (META), Alphabet's Google (GOOG) (GOOGL) Gemini Pro 1.0, and Claude 2 from Anthropic, an AI start up backed by Google and Amazon (AMZN).  Picture courtesy Mistral's press release Microsoft will also take a minor stake in Mistral, but financial details were not disclosed, according to a report from The Financial Times. The collaboration makes Mistral the second company to provide commercial language models available on Azure cloud computing platform, the report added. Microsoft has invested billions of dollars in OpenAI, an alliance which is already facing potential scrutiny in the U.S. and the EU. Earlier this month, it was reported that OpenAI's CEO Sam Altman is in talks with investors to raise as much as $5T-$7T for a major project which would boost the world's chip-making capacity and its ability to power AI. OpenAI was estimated to be worth about $86B during its recent secondary share sale in 2023. "
}