{
    "title": "Microsoft develops AI server gear to lessen reliance on Nvidia, The \nInformation reports",
    "date": "2/20/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024:newsml_L3N3F5419:0-microsoft-develops-ai-server-gear-to-lessen-reliance-on-nvidia-the-information-reports/",
    "text": "Microsoft MSFT is developing a new network card that could improve the performance of its Maia AI server chip and potentially reduce the company's reliance on chip designer Nvidia NVDA, The Information reported on Tuesday. Microsoft CEO Satya Nadella has tapped Pradeep Sindhu, who co-founded networking gear developer Juniper Networks JNPR, to spearhead the network card effort, the report said citing a person with knowledge of the matter. Microsoft acquired Sindhu's server chip startup, Fungible, last year. The new network card is similar to Nvidia's ConnectX-7 card, which the chip developer sells alongside its graphic processor units (GPUs), the report added. The equipment could take more than a year to develop and, if successful, could lessen the time it takes for OpenAI to train its models on Microsoft servers as well as make the process less expensive, according to the report. Microsoft did not immediately respond to a Reuters request for comment. Microsoft has invested billions of dollars in ChatGPT-maker OpenAI and has incorporated its technology in a wide variety of products, giving the Windows-maker a leg up in the race to sell artificial-intelligence software. The company had introduced Maia, a chip meant to run large language models and support AI computing, in November. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @profitable_trades @TradingView @ozonlayerfx @aggressivecalculator @most_luxurious_lifestyle @life_of_lorena.fx @chartfeed @tradingview @TradingView @fxdelta @lifestylewith_ashley26 @TradingView @aitor_avatar @rok_trader @Cenobar @trading_tools.ir @Market Mentor Network @itzi71 Whatever the trade "
}