{
    "title": "Microsoft chairman and CEO Satya Nadella highlights key role of India's \ndeveloper community in global AI innovation ...",
    "date": "2/8/2024",
    "url": "https://news.microsoft.com/en-in/microsoft-chairman-and-ceo-satya-nadella-highlights-key-role-of-indias-developer-community-in-global-ai-innovation/",
    "text": "February 8, 2024\t\t\t\n\t\t\t | Microsoft Source Bengaluru, February 8, 2024: Microsoft chairman and chief executive officer Satya Nadella today highlighted the pivotal role of India’s developer community in building cutting-edge products and solutions that solve challenges for the nation and can be deployed around the world. During his address to 1,100 developers and technology leaders at the Microsoft AI Tour in Bengaluru today, Nadella spoke about the impact Indian developers are making in accelerating AI innovation globally. India is the fastest-growing market on GitHub, a Microsoft-owned software collaboration and innovation platform, with 13.2 million developers using the platform. It is expected to overtake the US as the largest developer community on GitHub by 2027. India also has the second-highest number of generative AI projects on GitHub after the United States. “This next generation of AI is changing how and what developers build everywhere, including in India,” said Satya Nadella, chairman and CEO, Microsoft. “It’s fantastic to see how India’s developer community is applying our technology and tools to build the future for India and the world.” Nadella also said that Microsoft will expand its Code; Without Barriers program to India this month, as the company aims to democratize access to tech skills nationwide. The program was launched in 2021 across nine Asia Pacific (APAC) countries to help close the gender gap in the region’s fast-growing cloud, AI, and digital technology sectors. The program provides support, training, and networking opportunities for female developers and coders, and those in other technical roles to contribute to inclusive economic growth, encourage innovation, and reflect the region’s social makeup. Through Code; Without Barriers, Microsoft will provide skilling and certification to 75,000 women developers in India in 2024. The Code; Without Barriers expansion builds on other recent developer and skilling initiatives by Microsoft in India. On Wednesday, Nadella announced Microsoft’s new skilling investment in India to empower people and organizations to thrive in the AI era. The investment will see Microsoft provide 2 million people in India with AI skilling opportunities by 2025 through its ADVANTA(I)GE INDIA initiative. In January 2024, Microsoft enabled 100,000 developers to advance their careers in AI through its AI Odyssey initiative. The initiative allowed participants to take the first step towards becoming a subject matter expert in AI by learning new skills and earning Microsoft credentials. Microsoft is expanding the AI Odyssey program to other Asian countries, including Australia, New Zealand, Japan, Indonesia, Korea, China, Vietnam, and Thailand, after receiving an overwhelming response from India. The program will also welcome Indian developers who could not participate in the AI Odyssey challenge in January 2024. Phase 2 of the AI Odyssey will run from February 8th, 2024, to June 25th, 2024, aiming to reach another 150,000 developers across Asia. In November 2022, Microsoft India launched the Azure Society of Excellence (ASE) in collaboration with premier technology institutes like IITs, IIMs and BITS Pilani to work with startups and their incubation cells. The exclusive program provides technological support and mentorship to startups, helping them to become future-ready. Microsoft has successfully onboarded over 1700 Indian startups to the Microsoft Founders Hub through the ASE. It has also signed memorandums of understanding with 10 leading incubators across Indian technology and management institutes. Microsoft India engages with a community of 2 million professional and student developers across 100 cities in India to help them acquire skills and prepare for jobs. This is done with the help of community leaders, Microsoft Valuable professionals (MVP’s) and Azure industry experts along with partnerships with over 100 academic institutions across the country. At the Microsoft AI Tour, Bengaluru, developers from nonprofit organizations, student developers, and large enterprises showcased how Microsoft technologies have accelerated their AI adoption and empowered them to innovate. These included the following: Click here to learn more about Satya Nadella’s visit and how Microsoft is empowering organizations in India with AI. About Microsoft India Microsoft (Nasdaq: MSFT; @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more. Microsoft set up its India operations in 1990. Today, Microsoft entities in India have over 23,000 employees engaged in sales and marketing, research, development, customer support, and industry solutions across 10 Indian cities – Ahmedabad, Bengaluru, Chennai, New Delhi, Gurugram, Hyderabad, Kolkata, Mumbai, Noida, and Pune. Microsoft offers its global cloud services from local datacenters to accelerate digital transformation across Indian startups, businesses, and government organizations. Follow us: Share this page: "
}