{
    "title": "Microsoft Tops Apple Ahead of Q4 Earnings: 5 ETFs to Invest",
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/news/microsoft-tops-apple-ahead-q4-160500798.html",
    "text": "Microsoft MSFT overtook Apple AAPL as the world's most valuable company, with a market valuation of $2.888 trillion.The iPhone maker lost share due to growing demand concerns, while Microsoft benefited from generative artificial intelligence (AI) (read: ETFs In Focus as Microsoft Tops Apple as Most Valuable Public Company).Microsoft has gained about 18% over the past three months, outperforming the industry’s average growth of 11.9%. The solid performance is expected to continue going into Q4 earnings, given its solid growth prospects. Investors could tap the strength of this software leader through ETFs having double-digit exposure to Microsoft. These are Select Sector SPDR Technology ETF XLK, MSCI Information Technology Index ETF FTEC, iShares Global Tech ETF IXN, Vanguard Information Technology ETF VGT and iShares Dow Jones US Technology ETF IYW. Microsoft has an Earnings ESP of -2.93% and a Zacks Rank #3 (Hold). According to our methodology, the combination of a positive Earnings ESPand a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 increases the chances of an earnings beat. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.This software maker witnessed no earnings estimate revision over the past 30 days for the fourth quarter of fiscal 2024. Microsoft’s earnings surprise history is good, as it delivered an earnings surprise of 7.83%, on average, in the last four quarters. The company is expected to post substantial earnings and revenue growth of 18.5% and 15.7%, respectively, for the to-be-reported quarter.Microsoft currently has an average brokerage recommendation (ABR) of 1.24 on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell etc.) made by 38 brokerage firms. The current ABR compares to an ABR of 1.23 a month ago based on 39 recommendations.Of the 38 recommendations deriving the current ABR, 32 are Strong Buy and three are Buy. Strong Buy and Buy, respectively, account for 84.21% and 7.89% of all recommendations. A month ago, Strong Buy made up 84.62%, while Buy represented 7.69%.Based on short-term price targets offered by 36 analysts, the average price target for Microsoft comes to $408.89. The forecasts range from a low of $232.00 to a high of $600.00.  MSFT has a top Growth Score of A and falls under a top-ranked Zacks industry (top 41%). Select Sector SPDR Technology ETF (XLK)Select Sector SPDR Technology ETF is the most popular and liquid ETF in the technology space, with AUM of $58 billion and an average daily volume of 6.6 million shares. It offers broad exposure to the technology sector and follows the Technology Select Sector Index. Select Sector SPDR Technology ETF holds about 64 securities in its basket, with Microsoft occupying the top position at 23.1%.Select Sector SPDR Technology ETF charges 10 bps in fees per year from investors and has a Zacks ETF Rank #1 with a Medium risk outlook (read: 5 Technology ETFs to Buy on a Rebound in PC Sales).MSCI Information Technology Index ETF (FTEC)MSCI Information Technology Index ETF is home to 303 technology stocks with AUM of $8 billion. It follows the MSCI USA IMI Information Technology Index. Microsoft is the second firm with a 20.6% allocation.MSCI Information Technology Index ETF has 0.08% in expense ratio, while volume is solid at 228,000 shares a day. It carries a Zacks ETF Rank #1 with a Medium risk outlook.iShares Global Tech ETF (IXN)iShares Global Tech ETF provides exposure to electronics, computer software and hardware, and informational technology companies by tracking the S&P Global 1200 Information Technology 4.5/22.5/45 Capped Index. Holding 115 stocks in its basket, Microsoft occupies the top spot with a 20.6% share.iShares Global Tech ETF has amassed $4 billion in its asset base and trades in a good volume of 181,000 shares a day, on average. The expense ratio is 0.41%.Vanguard Information Technology ETF (VGT)Vanguard Information Technology ETF manages about $59 billion in its asset base and provides exposure to 312 technology stocks. It currently tracks the MSCI US Investable Market Information Technology 25/50 Index. Here, MSFT occupies the second position with a 19.7% share (read: Microsoft & Apple in Tug-Of-War: ETFs in Focus).Vanguard Information Technology ETF has 0.10% in expense ratio, while volume is solid at nearly 487,000 shares. It has a Zacks ETF Rank #1 with a Medium risk outlook.iShares U.S. Technology ETF (IYW)iShares U.S. Technology ETF provides exposure to U.S. electronics, computer software and hardware, and informational technology companies. It tracks the Russell 1000 Technology RIC 22.5/45 Capped Index, holding 133 securities in its basket. Of these, Microsoft occupies the top position in the basket, with 17.2% of the assets.iShares Dow Jones US Technology ETF has AUM of $14.2 billion and charges 40 bps in fees and expenses. Volume is good as it exchanges nearly 649,000 shares a day. IYW has a Zacks ETF Rank #1 with a Medium risk outlook. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Technology Select Sector SPDR ETF (XLK): ETF Research Reports Fidelity MSCI Information Technology Index ETF (FTEC): ETF Research Reports iShares U.S. Technology ETF (IYW): ETF Research Reports Vanguard Information Technology ETF (VGT): ETF Research Reports iShares Global Tech ETF (IXN): ETF Research Reports To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}