{
    "title": "Microsoft vs Apple: Who Wins the World's Most Valuable Company Race? - Tech \n| Business | Economy",
    "date": "1/13/2024",
    "url": "https://techeconomy.ng/microsoft-vs-apple-who-wins-the-worlds-most-valuable-company-race/",
    "text": "Home » Microsoft vs Apple: Who Wins the World’s Most Valuable Company Race? FILE PHOTO: Microsoft logo is seen on the smartphone in front of displayed Apple logo in this illustration taken, July 26, 2021. REUTERS/Dado Ruvic/Illustration/File Photo Bill’s Gate brain child, the Microsoft incorporation, surged ahead of its long-term rivalry (Apple) to briefly become the world’s biggest company by market Value, on Thursday. The boom in artificial intelligence brought a new twist to the decades-long rivalry between the two Big Tech groups. Microsoft and Apple, has been in a neck to  neck fight in quest of the   world’s most valuable company. The software company’s shares climbed around 1 per cent in early trading on Thursday to take its market value to $2.87tn, just ahead of the iPhone maker, whose shares fell by almost 1 per cent. By midday in New York, Apple had retaken the top spot as the broader market turned lower. At the close of trading in New York, Apple remained ahead at $2.89tn compared to Microsoft’s $2.86tn. The AI-driven shake-up in the rankings of the world’s top companies, also brought AI chipmaker Nvidia, whose stock is up around 11 per cent this year, within reach of surpassing Amazon’s market capitalization of $1.6tn. The Investors’ excitement about the new wave of generative AI has fuelled a rally in the shares of Microsoft, which is the biggest backer of OpenAI, the maker of the popular AI-powered chatbot ChatGPT. Apple has largely been left out of the AI fervour that has propelled Microsoft, which is OpenAI’s largest backer and cloud hosting provider as well as a pioneer in deploying AI chatbots across its search and workplace products. At the same time, concerns about weaker iPhone sales — particularly in China — have weighed on Apple’s stock in the first few days of 2024, prompting a series of Wall Street analyst downgrades. It is import to note that, Apple and Microsoft have been rivals since the 1980s, when the company founded by Steve Jobs and Steve Wozniak accused Bill Gates’ Windows maker of stealing the “look and feel” of its Macintosh computer software. Apple lost a high-profile copyright lawsuit targeting Windows in the early 1990s, clearing the way for Microsoft to dominate the PC market for decades. But driven by the success of the iPhone, Apple’s market value finally overtook Microsoft in 2010, a position it retained for several years as Windows struggled with the transition to mobile computing. Microsoft briefly rallied above Apple during the Covid-19 pandemic in 2020 and 2021, as its strength in cloud computing during the boom in remote working made its business more resilient at a time when iPhone production was disrupted by factory closures and supply issues. However, on each occasion Apple reclaimed the top spot soon after. While its old rival is focused on AI, Apple is hoping the launch of its new Vision Pro headset next month will usher in a new era of “spatial computing” that relies on rich 3D graphics and new kinds of hand gestures to make interaction more natural and intuitive. Despite hints that Apple is developing the same kind of large language models that power the latest AI chatbots to run on its own devices, the runaway success of ChatGPT and the industry-wide scramble to catch up with it has buoyed demand for Microsoft’s cloud services as well as the Nvidia processors that are needed to create such tools.  Aliko Dangote, Africa’s richest man's net worth has reached a total of $15.3 billion according to data collated from the... Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Privacy Policy Agreement *\n I agree to the Terms & Conditions and Privacy Policy.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Follow Us © 2023 Techeconomy - Designed by Opimedia. © 2023 Techeconomy - Designed by Opimedia. "
}