{
    "title": "EU to probe Microsoft's $10B investment in OpenAI",
    "date": "1/9/2024",
    "url": "https://www.upi.com/Top_News/World-News/2024/01/09/EU-eyes-Micsosoft-OpenAI-tie-up/6981704807653/",
    "text": "Jan. 9 (UPI) -- The European Commission announced Tuesday it was looking into whether U.S. software giant Microsoft's $10 billion partnership with ChatGPT maker OpenAI comes under the remit of its anti-trust powers to investigate tie-ups that could limit competition.\nThe query over whether Microsoft's investment was \"reviewable\" under the European Union's Merger Regulation was part of a consultative exercise being launched into the competitive landscape of the virtual reality and generative Artificial Intelligence sectors, the commission said in a news release.\nAdvertisement\nWith more than $7.9 billion of new capital investment in AI in the EU in 2023 growing the value of the bloc's \"virtual worlds\" market to $12 billion, the exponential growth forecast in coming years was likely to have a major impact on how businesses compete, said the commission.\n\"Virtual worlds and generative AI are rapidly developing. It is fundamental that these new markets stay competitive, and that nothing stands in the way of businesses growing and providing the best and most innovative products to consumers,\" said Margrethe Vestager, EU Commission executive vice president in charge of competition policy.\nRelated\nThe New York Times sues Microsoft, OpenAI, alleging copyright infringement\nOpenAI co-founder Sam Altman re-hired as CEO days after being ousted by board\nTop tech CEOs call for AI regulation in closed-door Senate meeting\n\"We are inviting businesses and experts to tell us about any competition issues that they may perceive in these industries, whilst also closely monitoring AI partnerships to ensure they do not unduly distort market dynamics.\"\nAdvertisement\nThe commission said it might follow up the consultation with a workshop in the second quarter of the year to bring together the different perspectives gathered from contributors.\nHowever, it stressed it was also investigating into \"the impact on market dynamics\" of other partnership deals between large players in the digital market and AI developers and was not singling out Microsoft for scrutiny.\nBritish regulators launched a similar preliminary probe in December into whether Microsoft's $10 billion investment in OpenAI over a period of years was, in fact, a merger that could lead to a \"substantial lessening of competition.\"\nThe Competition and Markets Authority's four-week so-called \"invitation to comment\" consultation asked Microsoft and OpenAI and third parties to opine on the tie-up and its potential impact on Britain's AI market.\nThe scrutiny comes on top of a Dec. 27 lawsuit by The New York Times seeking billions of dollars in statutory and actual damages from Microsoft and OpenAI for unlawful use of its content and alleging their business model is based on mass copyright infringement.\nThe suit alleges the companies' AI tools \"rely on large-language models that were built by copying and using millions of The Times's copyrighted news articles, in-depth investigations, opinion pieces, reviews, how-to guides, and more.\"\nAdvertisement\n\n\n\nTopics\nBusiness\n\n\n\n\n\n\nLatest Headlines\n\n\n\n\n\n\n\nWorld News // 1 hour ago\nNigerian army rescues kidnapped students\n March 25 (UPI) -- The Nigerian army has rescued more than 130 staff and students who were kidnapped from their school in northern Kaduna State earlier this month, officials and authorities said.\n\n\n\n\n\n\n\n\n\n\nWorld News // 1 hour ago\nNorth Korea says Japanese PM Kishida requested summit\n SEOUL, March 25 (UPI) -- North Korean leader Kim Jong Un's influential sister said Monday that Japanese Prime Minister Fumio Kishida has requested a summit \"as soon as possible,\" but warned that Tokyo would have to steer clear of contentious iss\n\n\n\n\n\n\n\n\n\n\nWorld News // 2 hours ago\nRussia charges 4 men over Moscow concert hall terrorist attack\n March 25 (UPI) -- Russia has charged four men on accusations of killing more than 130 people Friday in a coordinated attack on a Moscow concert hall.\n\n\n\n\n\n\n\n\n\n\nWorld News // 5 hours ago\nIsrael bans UNRWA from delivering aid to northern Gaza\n March 25 (UPI) -- The United Nations said Sunday that Israel is banning its relief agency from delivering humanitarian aid to northern Gaza, which is under the gravest threat of famine of the entire Palestinian enclave.\n\n\n\n\n\n\n\n\n\n\nWorld News // 12 hours ago\nPoland scrambles air force after Russian missile breaches its air space in attacks on Ukraine\n March 24 (UPI) -- Poland has put its air force on alert after a Russian missile breached its air space during a massive attack on the Ukrainian capital Kyiv, Polish officials announced.\n\n\n\n\n\n\n\n\n\n\nWorld News // 12 hours ago\nGerman Foreign Ministry condemns illegal Israeli settlements\n March 24 (UPI) -- The German Foreign Ministry condemned illegal Israeli settlements on Sunday after Israel confiscated 800 hectares, or about three square miles, of Palestinian land.\n\n\n\n\n\n\n\n\n\n\nWorld News // 16 hours ago\nHamas blasts terror attack in Moscow, praises Russia for rejecting U.N. Security Council vote\n March 24 (UPI) -- The Palestinian militia Hamas condemned the terror attack in Moscow that claimed the lives of at least 133 people after praising Russia for rejecting a U.S.-led vote of the U.N. Security Council for a Gaza cease-fire.\n\n\n\n\n\n\n\n\n\n\nWorld News // 15 hours ago\nChristians express support for Gaza in traditional Palm Sunday procession in East Jerusalem\n March 24 (UPI) -- Christians from around the world flocked to East Jerusalem on Sunday to march in a traditional Palm Sunday procession amid Israel's war in Gaza.\n\n\n\n\n\n\n\n\n\n\nWorld News // 17 hours ago\nRussian universities may accept arts students from North Korea\n March 24 (UPI) -- Russian universities may consider accepting arts students from North Korea amid growing cooperation between the two countries.\n\n\n\n\n\n\n\n\n\n\nWorld News // 18 hours ago\nPope Francis, Patriarch Kirill pray for victims of Moscow attack\n March 24 (UPI) -- Pope Francis and Patriarch Kirill, the head of the Russian Orthodox Church, have blasted the \"cowardly terrorist attack\" in Moscow that has killed at least 133 people and prayed for the victims, finding common ground. Jan. 9 (UPI) -- The European Commission announced Tuesday it was looking into whether U.S. software giant Microsoft's $10 billion partnership with ChatGPT maker OpenAI comes under the remit of its anti-trust powers to investigate tie-ups that could limit competition. The query over whether Microsoft's investment was \"reviewable\" under the European Union's Merger Regulation was part of a consultative exercise being launched into the competitive landscape of the virtual reality and generative Artificial Intelligence sectors, the commission said in a news release.\nAdvertisement With more than $7.9 billion of new capital investment in AI in the EU in 2023 growing the value of the bloc's \"virtual worlds\" market to $12 billion, the exponential growth forecast in coming years was likely to have a major impact on how businesses compete, said the commission. \"Virtual worlds and generative AI are rapidly developing. It is fundamental that these new markets stay competitive, and that nothing stands in the way of businesses growing and providing the best and most innovative products to consumers,\" said Margrethe Vestager, EU Commission executive vice president in charge of competition policy.\nRelated\nThe New York Times sues Microsoft, OpenAI, alleging copyright infringement\nOpenAI co-founder Sam Altman re-hired as CEO days after being ousted by board\nTop tech CEOs call for AI regulation in closed-door Senate meeting \"We are inviting businesses and experts to tell us about any competition issues that they may perceive in these industries, whilst also closely monitoring AI partnerships to ensure they do not unduly distort market dynamics.\"\nAdvertisement The commission said it might follow up the consultation with a workshop in the second quarter of the year to bring together the different perspectives gathered from contributors. However, it stressed it was also investigating into \"the impact on market dynamics\" of other partnership deals between large players in the digital market and AI developers and was not singling out Microsoft for scrutiny. British regulators launched a similar preliminary probe in December into whether Microsoft's $10 billion investment in OpenAI over a period of years was, in fact, a merger that could lead to a \"substantial lessening of competition.\" The Competition and Markets Authority's four-week so-called \"invitation to comment\" consultation asked Microsoft and OpenAI and third parties to opine on the tie-up and its potential impact on Britain's AI market. The scrutiny comes on top of a Dec. 27 lawsuit by The New York Times seeking billions of dollars in statutory and actual damages from Microsoft and OpenAI for unlawful use of its content and alleging their business model is based on mass copyright infringement. The suit alleges the companies' AI tools \"rely on large-language models that were built by copying and using millions of The Times's copyrighted news articles, in-depth investigations, opinion pieces, reviews, how-to guides, and more.\"\nAdvertisement "
}