{
    "title": null,
    "date": "1/6/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/microsoft-openai-hit-new-lawsuit-authors-over-ai-training",
    "text": "Hello, your email is unverified. Please confirm  for access to all your SPH accounts. Create a free account with Business Times  for seamless access across SPH Media products. Welcome,  Create a free account with Business Times  for seamless access across SPH Media products. Welcome,   \"Microsoft, OpenAI hit with new lawsuit by authors over AI training\" Already have an account? Log in The Business Times Personal Edition at$9.90/month*\nSUBSCRIBE NOW\nFind out more about subscription packages here. Find out more about subscription packages here. The Business Times Personal Edition at $9.90/month*\n*Terms and conditions apply.\nSUBSCRIBE NOW\nFind out more about subscription packages here. *Terms and conditions apply. Find out more about subscription packages here. Subscribe to The Business Times Personal Edition at $9.90/month*\n*Terms and conditions apply.\nSUBSCRIBE NOW\nFind out more about subscription packages here. *Terms and conditions apply. Find out more about subscription packages here. OPENAI and its financial backer Microsoft were sued on Friday (Jan 5) in Manhattan federal court by a pair of nonfiction authors who say the companies misused their work to train the artificial-intelligence models behind the popular chatbot ChatGPT and other AI-based services. Writers Nicholas Basbanes and Nicholas Gage told the court in a proposed class action that the companies infringed their copyrights by including several of their books as part of the data used to train OpenAI’s GPT large language model. Representatives for Microsoft and OpenAI did not immediately respond to requests for comment on the complaint. The lawsuit follows several others filed by fiction and nonfiction writers ranging from comedian Sarah Silverman to “Game of Thrones” author George R.R. Martin against tech companies over the alleged use of their work to train AI programs. The New York Times also sued OpenAI and Microsoft last week over the use of its journalists’ work to train AI applications. Basbanes and Gage are both former journalists. Their lawyer, Michael Richter, said it was “outrageous” that the companies could use their works to “power a new billion-dollar-plus industry without any compensation.” REUTERS The hottest news on all things startup and tech to kickstart your week. BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to t.me/BizTimes Now that you have experienced myBT with just a few keywords, subscribe to BT Premium to get full-access. You have reached your limit of 30 keywords.\nTo follow new keywords, edit your myBT settings. Get the latest coverage and full access to all BT premium content. Browse corporate subscription here  SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}