{
    "title": "Microsoft Corp. stock underperforms Monday when compared to competitors \ndespite daily gains",
    "date": "1/8/2024",
    "url": "https://www.marketwatch.com/data-news/microsoft-corp-stock-underperforms-monday-when-compared-to-competitors-despite-daily-gains-8715e914-45fdca813ed2",
    "text": "Shares of Microsoft Corp. \n        MSFT,\n        -0.15%\n       rose 1.89% to $374.69 Monday, on what proved to be an all-around favorable trading session for the stock market, with the S&P 500 Index \n        SPX,\n        -0.14%\n       rising 1.41% to 4,763.54 and the Dow Jones Industrial Average \n        DJIA,\n        -0.77%\n       rising 0.58% to 37,683.01. The stock's rise snapped a four-day losing streak. Microsoft Corp. closed $9.61 below its 52-week high ($384.30), which the company reached on November 29th. The stock underperformed when compared to some of its competitors Monday, as Apple Inc. \n        AAPL,\n        +0.53%\n       rose 2.42% to $185.56, Alphabet Inc. Cl C \n        GOOG,\n        +2.04%\n       rose 2.29% to $140.53, and Alphabet Inc. Cl A \n        GOOGL,\n        +2.15%\n       rose 2.29% to $138.84. Trading volume (22.3 M) remained 4.5 million below its 50-day average volume of 26.8 M. Editor's Note: This story was auto-generated by Automated Insights, an automation technology provider, using data from Dow Jones and FactSet.  See our market data terms of use. Smaller, more targeted government intervention in the property sector offers little guidance on what measures will be implemented. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Visit a quote page and your recently viewed tickers will be displayed here. "
}