{
    "title": "Microsoft to invest 3.2 bln euros in German AI infrastructure",
    "date": "2/16/2024",
    "url": "https://english.news.cn/20240216/dfe62147352e496abfa0273d58637fc2/c.html",
    "text": "Source: Xinhua Editor: huaxia 2024-02-16 06:08:15  Photo taken on Nov. 13, 2021 shows the logo of Microsoft in London, Britain. (Photo by Tim Ireland/Xinhua) Microsoft plans to train more than 1.2 million people in Europe's largest economy in digital skills by the end of 2025. BERLIN, Feb. 15 (Xinhua) -- Microsoft will invest 3.2 billion euros (3.5 billion U.S. dollars) over the next two years to expand its cloud and artificial intelligence (AI) infrastructure in Germany, the company's largest investment so far in this country, the U.S. tech giant said here on Thursday. Through the addition of new structures, Microsoft will expand its existing cloud region in Frankfurt am Main in the state of Hesse and more than double its capacities in North Rhine-Westphalia, the company said. Meanwhile, the company plans to train more than 1.2 million people in Europe's largest economy in digital skills by the end of 2025. \"We want to enable the German economy to benefit from AI in order to continue to expand its global leadership in competitiveness,\" Microsoft's Vice Chair and President Brad Smith said, adding that the demand for AI has been on the rise in critical sectors such as manufacturing, automotive and pharmaceuticals.  Photo taken in Munich, Germany, on Feb. 19, 2021 shows Microsoft co-founder Bill Gates (on the screen) attending a virtual special edition of the Munich Security Conference(MSC) via video link. (Marc Mueller/MSC/Handout via Xinhua) Microsoft's billion-euro investment was very good news for Germany, said Chancellor Olaf Scholz, adding that such projects show \"how attractive the location and the trust of investors in Germany is.\" At the end of last year, the German government announced a 1.6-billion-euro investment in the research, development and application of AI by 2025. Renowned German businesses like Siemens, Bayer and Commerzbank are already using Microsoft's AI applications, according to the U.S. company. The majority of Germans expect AI to noticeably change society in just a few years, according to a recent survey by the digital association Bitkom. They are particularly open to AI in areas such as cybersecurity. (1 euro = 1.08 U.S. dollar)  ■ "
}