{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.punjabnewsexpress.com/news/news/microsoft-to-skill-2-mn-indians-in-ai-to-further-invest-in-country-satya-nadella-239245",
    "text": "BENGALURU: Microsoft Chairman and CEO Satya Nadella on Wednesday announced that the company will train more than two million people in India in generative AI skills,  to address talent shortage in the AI era. Addressing an event here,  Nadella said that making sure that youth has the necessary skills in order to be able to thrive in this new AI age is the most important thing that we should be doing. \"We are happy to play our role in it. But it's not just the skills but also the jobs that will get created with AI, \" Nadella told the gathering. He said that India has the best software developers and has a robust AI engineering community on Microsoft-owned developer platform Github,  second only to the US. \"In rural India,  people are now participating in the AI economy, \" he added. Nadella said that it is very exciting in a country like India,  where there is so much investment and so much capital going into the core basic science-driven industries to be able to really come to help India leapfrog even some of the scientific revolution would be very exciting. The Microsoft CEO said that the company will continue to invest more in the country. \"We have more Cloud regions in India than any other hyperscaler around the world. We have three regions and the fourth one is coming soon. We are definitely investing more in India to make sure that compute with low latency at scale,  including the AI,  are available for all of you to be able to take advantage, \" said Nadella. Microsoft is integrating the power of AI across the entire data and tech stack,  seeing increased usage from AI-first start-ups and some of the world's largest companies,  he added. In June last year,  Prime Minister Narendra Modi,  during his US visit,  met Nadella,  along with other Big Tech CEOs. Following the meeting,  Nadella's office issued a statement outlining his meeting with PM Modi. \"One important topic was the power of technology,  particularly Artificial Intelligence,  to help improve the lives of Indians, \" Microsoft's statement said. \"India is home to one of the most vibrant developer and start-up ecosystems in the world,  and Microsoft remains deeply committed to the growth of Indian technology -- that will impact both India and markets across the globe, \" it added. "
}