{
    "title": "Microsoft's Edge browser is now more popular than ever – but why?",
    "date": "2/2/2024",
    "url": "https://www.techradar.com/computing/edge/microsofts-edge-browser-is-now-more-popular-than-ever-but-why",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Should Google start to worry a little now? At least with the desktop market, anyway Microsoft’s Edge browser is carving out more market share on desktop PCs and has hit a new record high for adoption, at least going by one set of web browser stats. These are the global statistics provided by Statcounter for last month, January 2024, in which Chrome still leads by a long way (no surprise), sitting on a 64.84% market share – but Edge is in second, now on 12.96% for desktop browsers. As noted, that’s the best ever performance for Microsoft’s Chromium-based browser, which is almost at 13%. Edge has been at just over the 11% mark before, but drifted down to as low as 10.6% during the course of last year, so Microsoft will be heartened to see it recovering, no doubt. Edge is quite some way ahead of its nearest rivals, Safari (8.83%) and Firefox (7.57%), and in fact, it’s not too far off having double the user base of Mozilla’s browser. It’s also worth mentioning that elsewhere in the world of OS market share, Statcounter has observed Windows 11 gaining 1.29% to be on a 27.83% share. That’s notable because we have seen some wobbles for Windows 11 adoption in the recent past, so the OS is rising up the ranks again – just very, very slowly compared to how Windows 10 progressed. Microsoft Edge is slowly becoming more popular, then, by the looks of things (at least on desktop – mobile adoption is still not happening, at all, but that’s a very different kettle of browsing fish). So, the question is: why is Edge gaining momentum in this respect? In fairness, Microsoft has been making some notable progress with Edge in recent times. The desktop browser is nicely performant (and continues to push forward on this front), and has witnessed some impressive feature additions such as bolstering search with a novel trick. Not to mention a myriad of minor but useful steps forward (like integrated video translation chops). Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. Plus Copilot is becoming a more and more recognizable AI brand, now it’s in Windows, and is part and parcel of Edge’s constant improvements, so may be attracting users too. Just as importantly, Microsoft has been on a broad streamlining drive with its software, notably Windows 11 (cutting away some default apps for example) and Edge too. So, the browser is getting useful new features while having some of the chaff cut away. The result is a tighter app all-round, and perhaps more people are now noticing that. We always feel that Edge popularity is a bit of a tug of war, though, in some ways. Pulling on one side of the rope is the progress with feature advancements and fine-tuning, but on the other side, yanking back, there’s the more negative aspect of Microsoft’s constant prodding to try and get people to use Edge (or find out why they’re not using it). At the moment, the positive aspects around Edge are winning, but we can’t help but feel the tide of the battle against Chrome could turn Microsoft’s way even more if it laid off the nagging. Via Neowin Darren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013). Fed up with Edge being pushed in Windows 11? Next update brings some good news, but Microsoft still needs to do better Microsoft just updated Edge – and completely broke the browser according to some reports Quordle today – hints and answers for Monday, March 25 (game #791) By Marc McLarenMarch 24, 2024 By Alex WhitelockMarch 23, 2024 By Wayne WilliamsMarch 23, 2024 By David NieldMarch 23, 2024 By Wayne WilliamsMarch 23, 2024 By Mackenzie FrazierMarch 23, 2024 By Wayne WilliamsMarch 23, 2024 By David NieldMarch 23, 2024 By Darren AllanMarch 23, 2024 By Hamish HectorMarch 23, 2024 By Wayne WilliamsMarch 23, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}