{
    "title": "Microsoft vs. Google: Which Is the Better AI Stock to Buy Now",
    "date": "2/4/2024",
    "url": "https://www.fool.com/investing/2024/02/04/microsoft-vs-google-which-better-ai-stock-buy/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More OpenAI launched its current version of ChatGPT in late 2022 and along with it came heightened investor interest in anything related to artificial intelligence (AI). Since then, Microsoft (MSFT -0.15%) and Alphabet (GOOG 2.04%) (GOOGL 2.15%) have emerged as two AI leaders, defining the category and its applications. Microsoft is a close partner of OpenAI, and Alphabet quickly revealed its answer to ChatGPT -- Bard -- shortly after ChatGPT was released. Nearly a year after Microsoft unveiled its AI-infused Bing Chat and Alphabet launched Bard, the two companies reported earnings for the October-to-December quarter. Investors sold off both stocks on the news they reported, suggesting that the AI stock boom may be overdone. And yet, both companies delivered solid numbers. Let's dig into each company's recently released report and see which one is the better AI stock to buy today. Image source: Getty Images. Microsoft recently took the title of the world's most valuable company from Apple, and the company's earnings show why. To be fair, the enterprise software company closed on its acquisition of Activision Blizzard in October, so its results are getting a modest bump from the quarter a year ago. Microsoft's fiscal 2024 second-quarter revenue rose 18% year over year to $62 billion, which topped analyst estimates at $61.14 billion. Its operating income jumped 33% year over year, or 25% on a non-GAAP (generally accepted accounting principles) basis. On the bottom line, earnings per share (EPS) also rose 33% year over year, or 26% on a non-GAAP basis, to $2.93. That too came in ahead of estimates. Microsoft's cloud was once again a bright spot for the company as its intelligent cloud segment grew 20% year over year with Azure revenue up 30%. Search and news advertising revenue growth was modest at 8% year over year, indicating that Bing Chat hasn't taken off the way the company hoped. Microsoft finished the after-hours session down 0.3%. Alphabet delivered a solid fiscal 2023 fourth-quarter report overall as the company continues to recover from the slowdown in the digital ad market. Revenue rose 13% year over year to $86.3 billion, ahead of the consensus at $85.3 billion, but ad revenue of $65.5 billion was slightly below expectations, which helped drive the stock price down 6% in after-hours trading. The weaker-than-expected ad-revenue growth seemed to indicate that Alphabet was losing ad-market share to competitors or that AI has yet to have a significant impact on ad spending. On the bottom line, EPS surged from $1.05 to $1.64 due to a $2 billion improvement in equity securities. Operating income rose 30% to $23.7 billion. Ad revenue rose 11% to $65.5 billion in part due to continued weakness in Google Network, where revenue declined again. Google Cloud, its other closely watched business segment, posted 26% growth to $9.2 billion, and it reported operating income of $864 million, up from a loss of $186 million in the quarter a year ago. Both Microsoft and Alphabet saw strong stock-price appreciation last year, and each company reported similar growth on the top and bottom lines in the recent quarter. The difference between the two companies comes down to their AI strategies, and Microsoft appears to have the edge here. The company introduced its AI-powered Copilot into a wide range of products, including the Office 365 suite, Github, Azure, and Bing. Microsoft management also said that AI drove six percentage points of revenue growth in Azure, pushing it from 24% growth to 30%, which is significant and likely to improve. Finally, compared to Alphabet, Microsoft seems to have been better prepared for the AI revolution as it made acquisitions like Github that fit well with its AI Copilot tools, and its investment in OpenAI has been a game-changer. Alphabet, on the other hand, acquired the AI research lab DeepMind several years ago but didn't integrate with Google Brain until last year. The Google parent has had the technology to roll out its own chatbot, but it let OpenAI and ChatGPT set the narrative with AI chat. Alphabet is no slouch in AI, but the Google parent lacks the strategy and applications to fully leverage the power of generative AI in the way that Microsoft has. Microsoft, on the other hand, has planned for this moment and has taken smart risks, including allying with OpenAI. It also has a much more diversified product range compared to Alphabet, which makes most of its money from ads, a business that so far has not seemed to benefit significantly from AI. Microsoft stock is more expensive than Alphabet, but it's the better AI stock to buy here. Its long-term prospects with the new technology still look considerably more promising. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Jeremy Bowman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Apple, and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}