{
    "title": "Microsoft surpasses Apple to become the most valuable company ever",
    "date": "2/12/2024",
    "url": "https://www.sharecafe.com.au/2024/02/12/microsoft-surpasses-apple-to-become-the-most-valuable-company-ever/",
    "text": "  February 12, 2024 By Glenn Dyer | More Articles by Glenn Dyer In a historic turn of events, Microsoft has officially dethroned Apple to claim the title of the most valuable company ever. Founded decades ago by Bill Gates and others, and listed in 1986, Microsoft's journey reached a pinnacle last week with a staggering market capitalization of $US3.125 trillion, marking the highest value ever recorded for any company. This milestone comes as Microsoft's market value surpassed the previous record set by Apple, which reached $US3.09 trillion last July. As of Friday, Apple's market cap stood at $US2.916 trillion, underscoring Microsoft's significant lead in the race for valuation supremacy. Notably, Microsoft is also the first US company to close a session and a week with a market cap exceeding $US3.1 trillion, further solidifying its position as a market powerhouse. The company's stock closed the week at $US420.55, just shy of its all-time high of $US420.82, achieved in Friday's trading frenzy. Driving Microsoft's meteoric rise is its deepening involvement in artificial intelligence (AI), with its shares surging by a remarkable 60% over the past 12 months alone. In contrast, Apple's shares closed last week at $US188.85, marking a modest 25% increase over the past year, with a peak of $US196.62 recorded in mid-December. Examining key financial metrics, Microsoft boasts a price-earnings ratio of 38.03, surpassing Apple's ratio of just over 28. Comparatively, the S&P 500 index had a price-earnings ratio of 27.55 during the same period. Despite market fluctuations and global challenges, both Microsoft and Apple have outperformed the S&P 500 over the past five years, starting from February 2019, a year before the onset of the pandemic. While the index witnessed an 81% increase, Microsoft's shares soared by an astounding 288%, showcasing the company's resilience and growth trajectory. Similarly, Apple's shares experienced a remarkable uptick of 342% during the same period, underscoring the enduring appeal of the tech giants in the eyes of investors. As the technology landscape continues to evolve and reshape the global economy, Microsoft's ascension to the summit of corporate valuation serves as a testament to the company's enduring innovation and strategic prowess. With AI poised to redefine industries and unlock new frontiers, Microsoft's leadership position underscores its potential to shape the future of technology and drive further value creation for shareholders and stakeholders alike. Glenn Dyer has been a finance journalist and TV producer for more than 40 years. He has worked at Maxwell Newton Publications, Queensland Newspapers, AAP, The Australian Financial Review, The Nine Network and Crikey. March 25, 2024 March 25, 2024 March 25, 2024 March 25, 2024 March 25, 2024 March 25, 2024 The daily resource for hands-on investors. Market insights and investment ideas delivered free to your inbox.   Get daily updates straight to your inbox. Copyright 2023 Informed Investor Pty Ltd ABN 42 162 871 589. All rights reserved.\nNo portion of this website maybe reproduced, copied or in any way released without written permission.\nShareCafe is a Corporate Authorised Representative (001283561) of Sequoia Asset Management Pty Limited who holds an Australian Financial Services Licence (Number: 341506) Terms of Service | Privacy Policy | Contact | Advertise  First Name (required)\n \n\n Last Name (required)\n \n\n Email Address (required)\n \n\nSMSFBrokerFinancial Adviser\n\nPlease prove you are human by selecting the plane.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the plane.     First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the star.   ABx Group continues to add value to their Northern Tasmania Rare Earths Project with the announcement of highly encouraging drill results at their Wind Break Prospect. The Wind Break prospect lies 15-16km to the north east of the Mineral resource already discovered at Deep Leads, Rubble Mound & Leech Scrub (DLRM Prospect) and is further confirmation that the resource potential could be of considerable size. Mineralisation remains open in all directions.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the cup.   ABx Group have announced another significant increase to the Mineral Resource Estimate (MRE) at the Deep Leads Ionic Adsorption Clay (IAC) Rare Earths deposit in Northern Tasmania.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the flag.   Tamboran heads into 2024 with a number of exciting developments on the horizon. Production testing on Shenandoah South 1H (SS-1H) is due early in the new year and we expect to see positive results given the early data\nfrom logging indicated high porosity and gas saturation relative to offset wells and DFIT analysis demonstrated pore pressure gradients of at least 0.54 psi/ft (in-line with the most productive regions of the Marcellus Shale\nin the US). A successful flow test at SS-1H will allow Tamboran to sanction a 40 MMcf/d pilot project in the region, supporting the local NT gas grid.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the key.   CTQ’s recent 1Q FY24 update confirmed operating cash flow of -$0.55m, a significant improvement on -$0.81m in the pcp. The company secured ~1,000 subscriber adds in the 1Q. Combined with a 1,500 unit TEQ-Secure order by ADT New Zealand, this will lift CTQ’s Sofihub subscriber base to >7,000.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the cup.   Empire Energy provides exposure to the development of the world class unconventional gas resource located in the Beetaloo Sub basin in Australia’s Northern Territory.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the heart.     First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the star.     First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the cup.   Increases across the board for the Deep Leads Resource – Grade, tonnage & target area ABx Group have reported a 30% increase to their Mineral Resource Estimate (MRE) at the Deep Leads Ionic Adsorption Clay (IAC) Rare Earths deposit in Northern Tasmania. The increase to the MRE comes from 36 assayed step-out holes – representing a significant extension to the north for the existing Deep Leads prospect.  Error: Contact form not found. SYA has plans to build out two vertical integrated processing hubs in Québec Canada. The first hub comprises NAL, Authier and Tansim projects  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the car.   NVX has just formed an agreement with LG Energy Solutions (LGES), the world’s 3 rd largest battery maker, to develop a synthetic (artificial) graphite that matches their specific needs. Once the product is qualified by LGES, the expectation is that multi-phase offtakes will result. Earlier in March, NVX announced a 40%/60% JV with TAQAT Development Company to build a 30kt/year synthetic graphite anode plant in Saudi Arabia.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the star.   We initiate coverage on ABx Group with a valuation of $0.33 per share.ABx Group is currently progressing three businesses, including discovering and developing an ionic adsorption clay rare earth project in northern Tasmania, establishing a plant to produce hydrogen fluoride and aluminium fluoride from recycled industrial waste to replace imports (ALCORE), and mining and enhancing bauxite resources for the cement, aluminium and fertiliser industries.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the plane.   European Metals Holdings (EMH.ASX) – The large Cinovec Project (EMH 49%), is strategically located in the heart of the growing European EV ecosystem in the northwest of the Czech Republic. Cinovec is a large historic lithium resource, with a clean pathway to underground development, resulting in minimal surface impact or disturbance. EMH’s 51% JV partner is the national utility CEZ a subsidiary of CEZ Group, which is owned 70% by the Czech Government. The Czech auto industry is important as it makes up ~10% of local GDP. Hence a local gigafactory, in addition to three in southern Germany, would accelerate the transition to EV’s and with broader EU support underwrite Cinovec’s development.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the key.   CTQ has developed a leading proprietary assistive living technology platform\n(Sofihub) with a portfolio of best-in-class solutions for the global aged care,\nhome care, disability care and personal security sectors. Key products\ninclude falls detection, vital signs monitoring and medication management. The health-tech industry enjoys significant tailwinds for assistive living\nproducts, driven by the ageing population, rising costs and labour shortages,\ntechnology innovation and recommendations from the Royal Commission into\nAged Care. The market is very fragmented, with no competitor offering CTQ’s\nbroad suite of products. CTQ’s income stream is non-discretionary and largely funded by federal and\nstate governments and insurers. There is a growing recurring revenue\ncomponent built on SaaS-based subscriptions to its platform. The company has built a significant new contract pipeline in recent quarters\nand is targeting c.15,000 subscribers on its platform by Dec 2023, which\nrepresents sufficient scale to reach profitability. Cash on hand of $3.6m (2Q\nFY23) is likely sufficient to fund operations until breakeven is reached.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the cup.   Sayona Mining (ASX.SYA) – Production has commenced, on time and within budget, at the North American Lithium (NAL) Project (SYA 75%) in Québec and is presently ramping towards a steady state concentrate production of 226kt/year. This is a significant achievement for the NAL JV and for Canada, as it re-joins the global Lithium Producers Club. In short, NAL is Canada’s only producing lithium project and supports its aim to be the world’s 3rd largest supplier of EV raw materials by 2027. Canada also aims to lift EV sales from ~5% of new car sales in 2021 to 20% in 2026 before expanding to 60% by 2030 and 100% by 2035. Importantly, the Government supports the development of a vertically integrated EV ecosystem, as it seeks to return to its glory days as the world’s #5 in auto manufacturing. Financial support for SYA’s expansion is expected via Government grants, guarantees and loans. First Name (required)\n \n\n Last Name (required)\n \n\n Email Address (required)\n \n\nSMSFBrokerFinancial Adviser\n\nPlease prove you are human by selecting the truck.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the truck.   The record high coal prices seen in 2022, combined with continual operating improvements at their Blair Athol mine in Australia, has enabled TerraCom (ASX:TER) to resume dividend payments to shareholders in the first half of FY2023 and will continue to allow it to pay healthy dividends in the future.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the plane.   SGI recently reported its 1H FY23 results, delivering a record profit and building on the steady improvement of recent years. The strong result was driven by organic growth, recent acquisitions and associated scale benefits, combined with positive supply and demand dynamics.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the cup.   Magnis Energy Technologies (MNS.ASX) – MNS is planning an anode active facility in the US and recently announced a binding, yet conditional, contract for the supply of anode active with Tesla. The contract is for a minimum 17.5kt/year with an option to purchase another 17.5t/year. Conditions precedent carry a tight development timeframe, with first production scheduled for February 2025. Site selection is underway and co-locating with an OEM on a brownfields site makes sense. Long lead items have been ordered and detailed engineering and design is expected to commence soon.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the star.   TerraCom released their operating results for the December quarter FY2023 with operating metrics being in line with our forecasts. Unseasonal rains in both Australia and South Africa contributed to operational and logistical issues across all mines, however guidance for annual production at Blair Athol is unaffected and highlights the quality of TerraCom’s skills in operational management. We continue to like the stable operating metrics around the company’s Australian operations and see potential for the South African operations to benefit from increased management focus given the rationalisation of operations following the closure of the Ubuntu mine. Corporate Connects overall financials remain unchanged as does our target price of $1.35 share. We maintain our forecast for a fully franked quarterly dividend of 7.5c/share to be paid in the March and June quarters of FY2023.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the flag.   NOVONIX (ASX:NVX) – is scaling a synthetic anode materials plant in the US and piloting nickel rich cathode material in Canada. Why? China is dominant and growing – 100% of global natural anode and 68% of synthetic anode is refined in China. In short, China controls the global midstream battery chain by controlling 60% of chemical refining, 87% of anode manufacturing, 61% of cathode manufacturing and 73% of battery manufacturing. It is global battery supply and price domination at scale.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the tree.   We initiate coverage on Tamboran Resources with a 12-month target price of $1.10 – representing 520% upside from the current share price. The company provides investors with a pure exposure to the development of the world class unconventional gas resource located in the Beetaloo Sub basin in Australia’s Northern Territory. The drilling of 2 wells before the end of 2022, Amungee 2H and 3H, will provide significant visibility on the commerciality of the proposed EP 98 Pilot Development – both wells are fully funded with the company having a current cash balance of ~A$130million.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the truck.   RareX Limited is an Australian Rare Earths company that has set its sights on becoming one of the largest light rare earth elements (LREEs) producers in Australia. The company’s flagship project is the Cummins Range deposit, a carbonatite deposit with a current 18.1Mt resource at 1.15% TREO (0.5% cut-off grade) that has significant potential for expansion. Recent exploration results have confirmed high-grade extensions at depth and along strike with an additional 30,000m drilling program commencing in the second quarter of FY2022. The companies scoping study suggests upside from phosphate and economic viability over the Life of Mine (LOM). We initiate on RareX Ltd with a A$0.12 price target – risked at 25%  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the flag.   This report looks at the results of a collaborative study Antisense undertook which looked at the largest protein expression database in Long COVID-19 patients who experienced neurologic symptoms well after the primary or acute SARS-CoV-2 infection was considered over (Groups 1 & 2, with 48 subjects Group 2 comprising a single patient from a different clinical site). The symptoms and others experienced by such patients result in a highly significant amount of illness, possibly more than all primary SARS-CoV-2 infections i.e COVID-19.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the truck.   Kazia Therapeutics (KZA) announced yesterday morning that paxalisib did not meet the threshold to move into stage 2 of the GBM AGILE clinical trial (NCT03970447). The study was an adaptive trial designed to assess the potential of new therapeutics to treat the highly aggressive brain cancer glioblastoma (GBM) in a cost-effective manner. Demonstrating efficacy in GBM is an extremely high hurdle as shown by the fact that there is only one approved drug for the disease, temozolomide, and it is only effective in 1/3 of patients. Given the high nature of the hurdle, in our original initiating coverage report on KZA, we only gave paxalisib a small chance of returning a positive result from the overall study. That is the nature of drug development with one group estimating only 6% to 7% of new chemical entities that commence clinical trials reach launch (Dowden & Munro (2019) Nat Rev Drug Discov). The small percentage that do make it to launch, however, more than make up for the cash spent on those that don’t.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the truck.    First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the house.   Lake Resources (LKE. ASX) – LKE has signed two non-binding MOU’s in the space of 10 days. Ford Company (Ford) has signed an MOU for ~25,000t/year and last week Hanwa, a Japanese commodity trader signed a MOU for up to 25,000t/year. Subject to execution, this is an amazing feat as Ford and Hanwa are prepared to enter into longer-term strategic partnerships with LKE. Commercial negotiations are still ongoing but are expected, especially if Ford & Hanwa inject new equity into LKE, to further de-risk the project financing & thus ensure LKE and Kachi are fully funded.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the house.   TNG Ltd is an ASX-listed technology owner and developer of the world-class Mount Peake near-surface vanadiferous titanomagnetite deposit. To unlock value, TNG will concentrate ore from its central Northern Territory mine for processing through its patented TIVAN® process produce three premium quality revenue streams: hi-purity vanadium pentoxide (V2O5) for steel alloys and Vanadium Redox Flow batteries, a quality titanium pigment for paints and a premium steel input with >64%Fe iron ore fines.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the key.   Two recent gravity surveys have considerably exceeded expectations and revealed potential for extensions to the existing MRE at Lake Throssell, plus a material growth opportunity at Lake Yeo. This reinforces the potential for a multi-decade, Tier-1 SOP production hub based around Lake Throssell. TMG is currently completing work towards the PFS due early 2023, including drilling to start in Q3 2022, evaporation trials and permitting activities. Results from these programs will support the PFS and any future resource upgrade. Benchmark SOP prices have risen to ~US$940/t due to recent geopolitical developments. The Oct 2021 Scoping Study assumed a SOP price of US$550/t and contained a sensitivity analysis showing every 10% increase in price drives a +$144m increase in the project NPV of $364m. The c.70% increase above the Scoping Study thus implies a project NPV of ~$1.4bn. First Name (required)\n \n\n Last Name (required)\n \n\n Email Address (required)\n \n\nSMSFBrokerFinancial Adviser\n\nPlease prove you are human by selecting the tree.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the tree.   Despite  the  lower  realised  oil  and  gas  price,  which  fell  by  5.4%  and  19.7% respectively in August, Calima managed to show improvement in its key business metrics. We expect higher production in November due to the contribution by the new Thorsby wells which will be drilled in August/September which will see Calima meet its 2021 production guidance of 4,500 boe/d.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the heart.   WT Financial Group Limited (WTL) is a growing diversified financial services company, founded in 2010 and listed on the Australian Stock Exchange (ASX) in 2015. Its advice and product offerings are delivered primarily through a group of independent financial advisers operating as authorised representatives of WTL under its Wealth Today Pty Ltd (Wealth Today) and Sentry Group Pty Ltd (Sentry Group) dealer group operations. It has around 275 advisers across more than 200 financial advice practices Australia-wide. It also operates a direct-to-consumer operation under its Spring Financial Group brand.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the truck.   In May 2021, Corporate Connect analyst Marc Sinatra published a comprehensive research report on ASX-listed biotech Immutep Ltd (ASX: IMM). So impressed was he with IMM that Corporate Connect felt it imperative that a follow-up report be released placing a valuation on the company, because the market was not seeing the vast potential of eftilagimod alpha (efti). This follow-up report has been released today. Using comparables, after adding cash back to their EV estimate and dividing by the total number of issued shares, Corporate Connect now places the fair value of an Immutep share at $A2.20.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the car.   PayGroup (PYG) delivers multi-country BPO services and cloud SaaS HCM solutions, assisting companies to manage employees in multiple, complex jurisdictions. The company has many growth opportunities, including new clients, new jurisdictions, new products, partner expansion, and new revenue sources. PYG’s scalable business model allows operating leverage and with savings from in-housing third party technology, support margin expansion.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the tree.   OpenLearning (OLL) is a higher education technology company that operates a scalable online learning platform through a software-as-a-service (SaaS) business model and provides a global marketplace of high quality courses for learners of all levels. Its primary customers are education providers based in Australia and South-East Asia (primarily Malaysia). OLL started operations in Australia in 2012 and expanded to Malaysia in 2015, Singapore in 2018, and recently also Indonesia.  First Name (required) Last Name (required) Email Address (required) SMSFBrokerFinancial Adviser Please prove you are human by selecting the truck.   "
}