{
    "title": "Microsoft’s Nadella woos Indian developers to the company’s AI tools",
    "date": "2/8/2024",
    "url": "https://www.marketwatch.com/story/microsofts-nadella-woos-indian-developers-to-the-companys-ai-tools-55e7c8ad",
    "text": "BENGALURU, India — Microsoft CEO Satya Nadella urged in a speech to more than a thousand Indian computer-code developers on Thursday that they use the company’s artificial-intelligence tools being deployed across its products. Speaking in Bengaluru, India’s “Silicon Valley,” Nadella noted that more than 13.2 million Indian developers are currently on GitHub, an internet hosting service for software development, second only to the number from the United States, and that India is likely to move into first place by 2027 or 2028. Nadella said Microsoft Corp. \n        MSFT,\n        -0.15%\n       expects that use of AI can help achieve 10%, or $500 billion, of India’s GDP target for 2025. He did not elaborate. Microsoft is building its fourth data center in India near the city of Hyderabad, where Nadella grew up. It already has data centers in Mumbai, Pune and Chennai. Nadella will visit Hyderabad before returning to the United States. “Our investments here obviously start with the raw infrastructure itself,” Nadella said. Microsoft’s partnership with OpenAI, the developer of ChatGPT, gave it a head start in the boom involving generative AI, but the software giant faces competition from Google \n        GOOG,\n        +2.04%\nGOOGL,\n        +2.15%\n       and other rivals. Nadella boasted in a speech in Mumbai on Wednesday that his company is still ahead on most benchmarks. “We have the best model, today even,” he said. “We’re waiting for the competition to arrive. It’ll arrive, I’m sure.” Earlier this week, Nadella marked his 10th year as Microsoft CEO. The company now has a market value of $3 trillion, more than any publicly traded company, including longtime rival Apple Inc. \n        AAPL,\n        +0.53% Microsoft’s India subsidiary, which is headquartered in Hyderabad, has 11 offices across the country employing nearly 18,000 people. The company has announced various programs targeting the Indian market and Indian talent, including a monthlong AI training program for 100,000 developers and an announcement in Mumbai on Wednesday that the company will offer AI skills training for 2 million Indians by 2025. India is a key market for Microsoft. Indian Prime Minister Narendra Modi met with Nadella during a visit to the U.S. last June. Microsoft said AI was among the key topics they discussed. Digital World Acquisition Corp.’s stock rallied Friday, as investors awaited results of a shareholder vote that would determine the fate of the special purpose acquisition vehicle’s proposed purchase of former President Donald Trump’s social-media company. Visit a quote page and your recently viewed tickers will be displayed here. "
}