{
    "title": "Fast Moving Stocks: Microsoft Corporation (NASDAQ:MSFT), Vodafone Group Plc \n(ADR) (NASDAQ:VOD), Tengasco ...",
    "date": "2/19/2024",
    "url": "https://www.insiderfinancial.com/post/fast-moving-stocks-microsoft-corporation-nasdaqmsft-vodafone-group-plc-adr-nasdaqvod-tengasco-inc-nysemkttgc-schlumberger-limited-nyseslb",
    "text": "Don't miss the next big opportunity. Subscribe for timely alerts on potential market movers. Tech firms including Google Inc, Facebook Inc and Microsoft Corporation (NASDAQ:MSFT) have pursued artificial intelligence to analyse the data and improve computers' ability to recognize faces, objects or learn languages. Microsoft Corporation (NASDAQ:MSFT) in last trading activity moved down -3.97% to close at $44.03. Company weekly performance is -4.47% while its quarterly performance stands at 5.13%. Microsoft Corporation (NASDAQ:MSFT) is -7.44% away from its 52 week high.Bombay High Court has ruled in favour of British multinational telecom company Vodafone Group Plc (ADR) (NASDAQ:VOD) in a transfer pricing dispute, the media reported on Friday. Vodafone had appealed against the country's tax office's decision to add about Rs 3200 crore ($523 million) to its taxable income for the financial year 2009/10, CNBC TV 18said. Vodafone is among several multinational companies involved in transfer pricing disputes with Indian tax authorities. Vodafone Group Plc (ADR) (NASDAQ:VOD) in last trading activity decreased -1.59% to close at $30.85. Company weekly performance is -5.11% while its quarterly performance stands at -6.26%. Vodafone Group Plc (ADR) (NASDAQ:VOD) is -24.06% away from its 52 week high.Oil and gas company Tengasco Inc. (NYSEMKT:TGC) has sued the U.S. Department of the Interior, saying the agency unfairly upheld a $386,000 fine imposed after the company failed to turn over certain safety records following a 2011 platform inspection. Tengasco Inc. (NYSEMKT:TGC) has 0.40% insider ownership while its institutional ownership stands at 11.80%. In last trading activity company's stock closed at $0.50.Schlumberger Limited. (NYSE:SLB) last announced its earnings results on Thursday, July 17th. The company reported $1.37 EPS for the quarter, beating the Thomson Reuters consensus estimate of $1.36 by $0.01. The company had revenue of $12.05 billion for the quarter, compared to the consensus estimate of $11.94 billion. During the same quarter in the prior year, the company posted $1.15 earnings per share. The company’s quarterly revenue was up 7.8% on a year-over-year basis. On average, analysts predict that Schlumberger Limited. will post $5.64 earnings per share for the current fiscal year. On Friday shares of Schlumberger Limited (NYSE:SLB) closed at $93.07. Company's sales growth for last 5 years was 11.00% and EPS growth for next 5 years is recorded as 17.03%. Don't miss the next big opportunity. Subscribe for timely alerts on potential market movers. "
}