{
    "title": "Toys for Bob announces plans to become an independent company after \nMicrosoft acquisition",
    "date": "2/29/2024",
    "url": "https://www.globalvillagespace.com/tech/toys-for-bob-announces-plans-to-become-an-independent-company-after-microsoft-acquisition/",
    "text": "Toys for Bob, the renowned game development studio known for creating popular titles like Skylanders and the recent Crash Bandicoot and Spyro games, has made an exciting announcement. The studio has decided to become an independent developer after being acquired by Microsoft as part of Activision’s studios acquisition. This move signifies a return to the studio’s roots of being a smaller and more flexible company. Studio heads Paul Yan and Avery Lodato expressed their enthusiasm for this new chapter in a blog post, stating, “With the same enthusiasm and passion, we believe that now is the time to take the studio and our future games to the next level. This opportunity allows us to return to our roots of being a small and nimble studio.” Toys for Bob is already working on plans for its first game as an independent developer and is considering a potential partnership with Microsoft. While details about the upcoming project are scarce, Yan and Lodato teased that their team is excited to create new stories, characters, and gameplay experiences. They also highlighted the support they have received from both Activision and Microsoft, indicating a continued collaboration in the future. Having been in the gaming industry since 1989, Toys for Bob has a rich history of successful games. One of its early hits was the Star Control series, and it has published several games under Crystal Dynamics. In 2005, the studio was acquired by Activision, and it gained immense popularity with the introduction of the Skylanders franchise, which featured physical toys and became a multi-billion dollar success before eventually being discontinued. Toys for Bob’s decision to become independent is not unique in the industry. Saber Interactive recently disengaged from Embracer Group to establish itself as a privately-owned company, and Gearbox is rumored to follow suit. It remains uncertain whether Toys for Bob will still have the rights to develop games featuring beloved characters like Crash and Spyro without being an official Activision studio. The gaming community eagerly awaits the future endeavors of Toys for Bob, as they embark on this new journey as an independent developer. With their proven track record of creating beloved games, fans can expect exciting new stories, characters, and experiences from the studio. As a small and nimble company once again, Toys for Bob has the freedom to explore new creative avenues and leave their mark on the industry. In conclusion, Toys for Bob’s decision to become an independent developer after being acquired by Microsoft is a testament to the studio’s desire for flexibility and creative freedom. With plans for their first game underway and potential collaborations with Microsoft on the horizon, the future looks promising for this renowned game development studio. Fans can anticipate fresh and innovative experiences from Toys for Bob as they embark on this exciting new chapter. © 2023 | Email: contact@globalvillagespace.com "
}