{
    "title": null,
    "date": "1/18/2024",
    "url": "https://stockhead.com.au/tech/ascendant-in-ai-and-bigger-than-apple-is-microsoft-the-new-nvidia/",
    "text": "Via Getty Tech January 18, 2024 |  Christian Edwards Link copied to clipboard  Up again so far this week is an American tech firm called Microsoft (MSFT). With a clever artificial fire under the share price, Microsoft has become the world’s most valuable company by market cap, snatching the title away from long-time nemesis Apple. How has it managed to claw its way back to the top? While Apple’s been fiddling with blood oxygen measurements in wristwatches, MSFT’s just about burned Rome by established itself as a firestarter in a handful of fast growth fields and in industries like cloud computing, video games, and OFC… artificial intelligence (AI). Now, the House of Bill has eclipsed all comers, renewed by its deep focus on generative artificial intelligence (AI), a sector that has garnered increasing investor favour. Wall Street is bullish on Microsoft, in the same way it’s gone off Apple. According to a FactSet poll of Wall St analysts, nine out of every 10 currently have either a Buy or Overweight rating on the stock. The average price target implies a gain of 6.2% over the next year, adding to its advance of circa 60% in 2023. Wells Fargo has made the most recent tweak to Microsoft’s price target, lifting it to US$435 per share from US$425. The bank predicts a further uplift the company’s enormous valuation with artificial intelligence playing a key role. “We see key AI-related product cycles taking shape as further upside,” the bank noted on Monday. That was when MSFT’s valuation clocked in at US$2.887 trillion, its most ever, while –  after peaking at US$3.081tn on December 15 – Apple’s was worth a relatively humiliating US$2.875t.  Apple is living on borrowed tech, while Microsoft has learned fastest when it comes to using what Nvidia built; the shiny thing in tech, AI. XM Australia CEO Peter McGuire told Stockhead that Microsoft had a seat at the front of the AI revolution, seeing the changes in real-time via its controlling stake in OpenAI, the company behind the ChatGPT model. Investors increasingly believe that even if the global economy loses steam, demand for AI products will still remain elevated, shielding corporate profits from any macroeconomic weakness.   Microsoft has incorporated OpenAI’s technology across its suite of productivity software, a move that helped spark a rebound in its cloud-computing business in the July-September quarter. AI is now front and centre of MSFT’s own business. It’s transformed its Azure division into the go-to cloud service for AI-curious companies. And it’s added another one trillion US dollars to its own market cap in the same time. Already this week, the software giant launched an AI comms tool and rejigged it as a pro-version, consumer-first product and added it to the company’s monthly-rent-a-subscribe-software-forever model, which has proven such a terrific way to bleed end users. The timing is consummate from a business which knows as much about making money as it does about making computers. Microsoft (MSFT) unwrapped the new Pro version of its Artificial IntelligenceAI chatbot Microsoft Copilot. Subscriptions to Microsoft Copilot Pro are reportedly set to start at US$20 per month. Every month. The Gates machine has gone all out on AI –  more so even than Nvidia and Amazon –  and has since reaped a thrilling stock price harvest over the past year, showing just how fast the AI season can shift. Shares in MSFT have locked in a well over 60% climb in the last year, more than tripling the 20% rise in the S&P 500 as AI afficianados recognised its early moves in generative, exemplified by the early $10bn, one-third move to get a piece in OpenAI’s ChatGPT, secured in late 2022. Today Microsoft’s stake in OpenAI, sits at 49% – valued at $86 billion – after a pumping $3 billion into the headline generating firm. In that time Microsoft went straight into monetising AI, and that’s been under the Copilot brand, which leverages AI to go make its productivity software suite more sweet and productive. Previously Copilot was selling at US$30 per month. That can shift as MSFT backs it’s capabilities. Even so, Wall Street analysts have reckoned that at $30 a pop, per month… Copilot could boost Microsoft’s fiscal 2025 revenue by as much as US$9bn.  Analysts are drawing parallels with the dot.com boom of the 2000’s, when internet companies began to replace consumer and financial firms as the drivers of market movements. On top of its stake into OpenAI, MSFT has pumped R&D using its treasure vaults of cash, wooing industry partners and broadened its reach through strategic acquisitions like LinkedIn and GitHub. The mission to swallow up and maximise reams of inhouse data and unleash inhouse AI expertise has paid off. In the 12 months since Nvidia burst into the US$1trn cap club and joined the most magnificent 7 tech firms, Microsoft has successfully rolled out AI solutions willy-nilly. Microsoft’s clients are mostly other businesses that are investing in their AI capabilities, not regular consumers that are struggling under the cost of living crisis. This sense of resilience has helped fuel the stonking rally in Microsoft shares, which reached a new record high during a week of growing uncertainty and doubt around the pace and direction of interest rates worldwide.  Pete McGuire says hype surrounding artificial intelligence has started to translate into a massive earnings boost for Microsoft. “That said, the market reaction will depend on whether the actual results are stronger or weaker than markets anticipate, as well as any guidance by management about the future outlook.” For Q4 2023, The Street expects Microsoft to report earnings per share of US$2.78, which’d be a jump of circa 20% from the same quarter in the previous year. Similarly, revenue is projected to have risen by nearly 16% from last year. “I think it’s worth highlighting that Microsoft has the kind of strong history of beating earnings estimates which brings to mind the word consistency, having done so in all four of the preceding quarters,” McGuire says. “Hence, another upside surprise seems like the most likely outcome, which could generate even greater demand for Microsoft shares.”     On the charts, McGuire says the most important spot to watch on the upside might be the 400.00 psychological region. “Looking at the chart (above), Microsoft shares are already trading at record highs, so on the flipside, in case of a disappointment in earnings that catches optimistic investors off guard, the previous high of 390.00 could come into play to halt any selloff. “If sellers manage to pierce below it, the focus would then shift towards the 377.00 zone.”  McGuire says that the major red flag about Microsoft shares is how expensive they’ve become from a valuation perspective. “The stock price is currently trading at over 32 times what analysts expect earnings to be this year, which even for Microsoft is a stretched valuation.”  Pete says that excluding the pandemic years, the last time Microsoft traded at a similar valuation was back in 2002, as the ‘dot com’ bubble was bursting. “So, the market has already priced in much of the future growth prospects, which limits the upside potential for the stock, as the bar has already been set quite high. “All told, the future for Microsoft as a company seems bright as the AI revolution might still be in its early stages. That said, the stock’s hefty valuation already reflects this optimism, so the scope for further near-term gains appears somewhat limited.”  Link copied to clipboard Get the latest Stockhead news delivered free to your inbox.  It's free. Unsubscribe whenever you want. By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy. Mining Mining Mining Get the latest stock news and insights straight to your inbox.  By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy. Stockhead is providing factual information where there is a reasonable likelihood of doubt.\n\t\t\t\t\t\tThe information is not intended to imply any recommendation or opinion about a financial product. A note about relevant advertising \n\t\t\t\t\t\tWe collect information about the content (including ads) you use across this site and use it to make both advertising and content more relevant to you on our network and other sites.\n\t\t\t\t\t\tThis is also known as Online Behavioural Advertising. You can find out more about our policy and your choices, including how to op-out here For investors, getting access to the right information is critical. Stockhead’s daily newsletters make things simple: Markets coverage, company profiles and industry insights from Australia’s best business journalists – all collated and delivered straight to your inbox every day. Markets coverage, company profiles and industry insights from Australia’s best business journalists – all collated and delivered straight to your inbox every day. It’s free. Unsubscribe anytime. By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy.  Get the latest Stockhead news delivered free to your inbox.   Email Lists\n\n\nMorning Update\n\n\nLunch Update\n\n\nMarket Close Update\n\n\nWeekend Update By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy "
}