{
    "title": "Microsoft (MSFT), Vodafone Sign $1.5B Deal for AI, Cloud & IoT",
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/news/microsoft-msft-vodafone-sign-1-142400485.html",
    "text": "Microsoft MSFT has entered into a 10-year strategic partnership with Vodafone to harness their respective strengths in creating new digital and financial services tailored for businesses, particularly small and medium-sized enterprises (SMEs) across Europe and Africa.Microsoft's generative artificial intelligence (AI) will be employed to revamp Vodafone's customer experience, aiming to provide a more personalized and differentiated service across various channels.Vodafone's managed Internet of Things (IoT) connectivity platform will be expanded and enhanced with this collaboration. The goal is to hyperscale this telecommunication company's IoT platform, connecting more devices, vehicles and machines.Vodafone has committed to investing $1.5 billion over the next decade in cloud and customer-focused AI services developed in conjunction with Microsoft. This investment is intended to drive innovation and improvement in Vodafone's digital offerings.The companies will overhaul Vodafone's global data center cloud strategy, presumably with a focus on optimizing efficiency, scalability and security. MSFT will utilize Vodafone's fixed and mobile connectivity services as part of the collaboration.Microsoft plans to invest in the telecommunication company's managed IoT connectivity platform. By April 2024, this platform will become a separate and standalone business, attracting new partners and customers to foster growth in applications and expand its reach.The digital services resulting from the partnership will be built on unbiased and ethical privacy and security policies, adhering to Vodafone's established framework for responsible AI. Microsoft Corporation price-consensus-chart | Microsoft Corporation Quote The partnership aims to leverage the power of Microsoft Azure OpenAI to enhance customer satisfaction. This includes delivering real-time, proactive and highly personalized experiences across various touchpoints, including Vodafone's digital assistant TOBi.This Zacks Rank #3 (Hold) company-owned Copilot’s AI capabilities will also be utilized to transform Vodafone employees' working practices, boosting productivity and digital efficiency. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.MSFT plans to invest in Vodafone's new standalone global IoT-managed connectivity platform. With 175 million connected devices and platforms worldwide, Vodafone aims to become part of the Azure ecosystem, making the IoT platform accessible to a broader developer and third-party community through open APIs.The collaboration also includes scaling M-Pesa, Africa's largest financial technology platform, by hosting it on Microsoft Azure. This move is intended to facilitate the launch of new cloud-native applications. The partnership also involves a purpose-led program focusing on enriching the lives of 100 million consumers and one million SMEs across Africa.Vodafone commits to distributing MSFT’s services, including Microsoft Azure, security solutions and modern work offerings, such as Microsoft Teams Phone Mobile. The collaboration seeks to support approximately 24 million SMEs across Europe by providing a managed platform that can grow with their businesses.The telecommunication company will accelerate its cloud transformation by modernizing its data centers on Microsoft Azure. This initiative aims to improve responsiveness to customers, simplify operational processes and reduce IT estate operational costs.Other tech companies have also partnered with Microsoft to infuse AI into their core functionalities. The Zacks Consensus Estimate for Microsoft’s fiscal 2024 revenues is pegged at $242.41 billion, indicating 14.3% growth from fiscal 2023. The consensus estimate for fiscal 2024 earnings is pinned at $11.14 per share, up 13.5% from the year-ago actual figure.Cognizant Technology Solutions CTSH is also leveraging Microsoft Azure OpenAI Service to introduce the Innovation Assistant, an advanced generative AI-powered tool that forms a cornerstone of Cognizant's internal innovation initiative, Bluebolt.Cerence CRNC has also collaborated with the company to integrate OpenAI's ChatGPT model into vehicles through Microsoft Azure, enhancing in-car user experiences with CRNC's automotive technology and MSFT's cloud capabilities.Ceridian HCM CDAY partnered with MSFT to launch Dayforce Co-Pilot, a generative AI assistant, leveraging Microsoft's capabilities and OpenAI connection to automate tasks and enhance productivity in the Dayforce human capital management platform. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Microsoft Corporation (MSFT) : Free Stock Analysis Report Cognizant Technology Solutions Corporation (CTSH) : Free Stock Analysis Report Ceridian HCM (CDAY) : Free Stock Analysis Report Cerence Inc. (CRNC) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}