{
    "title": "Microsoft Tops Apple as Most Valuable Company",
    "date": "1/12/2024",
    "url": "https://247wallst.com/technology-3/2024/01/12/microsoft-tops-apple-as-most-valuable-company/",
    "text": "It didn’t last for the entire trading session, but Microsoft Corp.’s (NASDAQ: MSFT) market cap passed that of Apple Inc. (NASDAQ: AAPL), dethroning a company that had held the top position for two years. Artificial intelligence (AI) and cloud computing have trumped hardware and consumer services. Each company has a market cap just shy of $2.9 trillion. (Here are seven more stocks that will join the trillion-dollar club.) What happened? Of Microsoft, Tom Hancock, head of focused equity at GMO, said, “Big picture, they got there by embedding themselves in every IT department in the world,” according to The Wall Street Journal. Years ago, that meant Windows on personal computers (PCs), then Windows on servers, Azure for cloud computing and now AI applications. Apple, in the meantime, seems to have a product in the hands of everyone in the world. This includes the iPhone, Mac, iPad and Apple Watch. It has started to sell services like Apple Pay and Apple TV+ to those people. Looking at the recent past, Apple, which will announce earnings again next month, had a mediocre quarter. Revenue uncharacteristically dropped. It was down 1% to $89.5 billion. Per-share earnings were up 13% to $1.46. And iPhone sales faltered. They were $48.3 billion, up from $42.6 billion in the year-ago period. Investors are not used to such slow growth. iPad sales dropped from $7.2 billion to $6.6 billion. The bright spot, Services, jumped from $19.2 billion to $22.3 billion, but is that enough to keep Apple a growth company. Finally, sales in China were lackluster. They fell from $15.5 billion to $15.1 billion. China is the largest smartphone market in the world. The biggest question about Apple is whether iPhone sales will continue to be flat. There are concerns that each Apple smartphone generation is not different enough from the one before it. That, by itself, would make some investors turn away from the company. Microsoft’s fortunes are very different. Its partnership with industry leader OpenAI set the tech investment world on fire. AI is considered the largest advance in tech since the internet and PC. In addition, Microsoft’s cloud computing operation Azure is second only to Amazon’s AWS in global revenue. Microsoft’s revenue was up 13% to $56.5 billion in the most recent quarter. Earnings rose 27% to $2.99 a share. Cloud revenue rose 24% to $31.8 billion. “With copilots, we are making the age of AI real for people and businesses everywhere,” Satya Nadella, board chair and CEO, commented. AI, it seems, is the tech of the future. Hardware may never sunset, but it is much less exciting to Wall Street. Are you ready for retirement? Planning for retirement can be overwhelming, that’s why it could be a good idea to speak to a fiduciary financial advisor about your goals today. Start by taking this retirement quiz right here from SmartAsset that will match you with up to 3 financial advisors that serve your area and beyond in 5 minutes. Smart Asset is now matching over 50,000 people a month. Click here now to get started.  Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}