{
    "title": "Microsoft briefly edged out Apple as the most valuable company in the US",
    "date": "1/11/2024",
    "url": "https://appleinsider.com/articles/24/01/11/microsoft-edges-out-apple-as-the-most-valuable-company-in-the-us",
    "text": "Copyright © 2024, Quiller Media, Inc. Contact Us | Privacy Policy Credit: Microsoft In intraday trading on Thursday, Apple was usurped as the most valuable company in the US for about two hours, with Microsoft temporarily taking the crown more than two years after the last time it happened.\r  The cross-over happened at about 9:50 AM ET, shortly after the market opened, and reversed itself around 11:10 AM ET. Apple has been hit by a few downgrades to its stock in the last few days, and Microsoft has seen the opposite. \rTrading has been slightly above-average overall on Thursday, with the NASDQ down by about a half-percent. Apple's stock has been hit by about $3 a share for losses today. Microsoft stock is down now, after briefly being up from Wednesday's close.\rIn August 2020, Apple became the first publicly-traded US company to reach a $2 trillion market cap, and Microsoft became the second one in June 2021.\rLater in October 2021, Microsoft took over the top spot, and for a few months was more valuable than Apple by $100 billion.\rMicrosoft's stock rose 57% in 2023, compared to Apple's which rose 48%. Microsoft shares have also seen slimmer losses at the start of 2024.\rApple, ohas seen its shares take a considerable drop in recent days. The first hit was taken following a claim by Barclays that iPhone demand is weakening and that the iPhone 16 range will not offer any compelling new features to tempt upgraders. \rThe analyst view that Apple is dependent on iPhone sales is part of why Microsoft is doing better. Analysts see Microsoft has being less attached to any hardware, and more attached to subscription software such as Office 365, and so therefore less attached to any falling demand for phones or computers.\rAnd, Microsoft has launched an AI tool in Copilot, while Apple has not unveiled any similar ChatGPT-style app or service. Analysts appear to be ignoring that Apple has been using AI for many years, under the name Machine Learning, though, and also that it is never first to a market, even ones that it later comes to dominate.\rUpdate January 11, 11:36: Updated with Apple going back into the lead. The cross-over happened at about 9:50 AM ET, shortly after the market opened, and reversed itself around 11:10 AM ET. Apple has been hit by a few downgrades to its stock in the last few days, and Microsoft has seen the opposite. Trading has been slightly above-average overall on Thursday, with the NASDQ down by about a half-percent. Apple's stock has been hit by about $3 a share for losses today. Microsoft stock is down now, after briefly being up from Wednesday's close. In August 2020, Apple became the first publicly-traded US company to reach a $2 trillion market cap, and Microsoft became the second one in June 2021. Later in October 2021, Microsoft took over the top spot, and for a few months was more valuable than Apple by $100 billion. Microsoft's stock rose 57% in 2023, compared to Apple's which rose 48%. Microsoft shares have also seen slimmer losses at the start of 2024. Apple, ohas seen its shares take a considerable drop in recent days. The first hit was taken following a claim by Barclays that iPhone demand is weakening and that the iPhone 16 range will not offer any compelling new features to tempt upgraders. The analyst view that Apple is dependent on iPhone sales is part of why Microsoft is doing better. Analysts see Microsoft has being less attached to any hardware, and more attached to subscription software such as Office 365, and so therefore less attached to any falling demand for phones or computers. And, Microsoft has launched an AI tool in Copilot, while Apple has not unveiled any similar ChatGPT-style app or service. Analysts appear to be ignoring that Apple has been using AI for many years, under the name Machine Learning, though, and also that it is never first to a market, even ones that it later comes to dominate. Update January 11, 11:36: Updated with Apple going back into the lead. After his exit from the Navy in 1999, Mike spent 11 years as a tech analyst, and supported a large swathe of Apple customers in the Washington DC area. With over two decades on the Apple beat, Mike has served as Apple... Does it really matter? Does it really matter? tech_traveller said:\nDoes it really matter?\n\r\nIt hurts. M$ copied the Mac - it can never be #1. And then MS lost on mobile, on tablets (at least round one), on MP3 players (Zune), and AWS started eating into their server business. And now that company is worth more than Apple. And the main reason for that is Apple.So, Mac and iPad sales are dropping big time, iPhone is static, R&D is going to an Apple Car that seems stuck, and then Microsoft understood AI, while we in 2023 had the same old Siri and the option to buy a new HomePod, which was exactly the same as... the old HomePod. Flatlining companies don't attract the best talents. We need for Apple to grow, add more users, and enter big markets (cars). Competing with Zuckerberg on doing the heaviest headset is taking away talent, and now MS is once again #1. It hurts. M$ copied the Mac - it can never be #1. And then MS lost on mobile, on tablets (at least round one), on MP3 players (Zune), and AWS started eating into their server business. And now that company is worth more than Apple. And the main reason for that is Apple.So, Mac and iPad sales are dropping big time, iPhone is static, R&D is going to an Apple Car that seems stuck, and then Microsoft understood AI, while we in 2023 had the same old Siri and the option to buy a new HomePod, which was exactly the same as... the old HomePod. Flatlining companies don't attract the best talents. We need for Apple to grow, add more users, and enter big markets (cars). Competing with Zuckerberg on doing the heaviest headset is taking away talent, and now MS is once again #1. Heaviest headset, how do we need this, in a fitness gymnasium? Heaviest headset, how do we need this, in a fitness gymnasium? tech_traveller said:\nDoes it really matter?\n\r\nIf you are an investor who actively trades to get the best returns it does. If you are an investor who actively trades to get the best returns it does. Both are fluctuating with Apple currently ahead ~$30-35B. Let's see today's closing price, and more importantly, the after hours price in exactly three weeks (Feb 1st earnings report). Both are fluctuating with Apple currently ahead ~$30-35B. Let's see today's closing price, and more importantly, the after hours price in exactly three weeks (Feb 1st earnings report). Amazon's Big Spring Sale 2024 is live, offering bargain hunters deals of up to $1,850 off on Apple gear, docks, Wi-Fi 6E routers, portable power stations and more. And unlike Prime Day, the blowout deals are available to the general public. Among a slew of new features reported to be coming to iOS 18 later this year, the home screen is said to be more customizable for users. On April 8, a thin band of North America, Canada, Mexico will be in the path of totality for the 2024 Solar Eclipse, and you probably don't want to use your iPhone to capture it. Here's how you can snag some pictures of the event without ruining your equipment. Apple CEO Tim Cook, currently in China for talks with suppliers, told state media there that the Apple Vision Pro will come to mainland China later this year. The cost of a lifetime Babbel language learning subscription just dropped to $139.97, reflecting a $460 discount off retail and ringing in within $10 of the lowest price on record. High altitude combined with bad weather caused a group of hikers to become stranded, but they were rescued within 24 hours thanks to SOS via Satellite for iPhone. Apple's Journal app automatically opts you into sharing your location with people around you — kind of. The truth is complicated. Here's what it specifically means, and how to opt out. Blowout savings are in effect for standalone Microsoft Office licenses, as well as Microsoft 365 12-month subscriptions. Save up to 90% on the software this weekend. With the earliest possible trial date start likely in late 2026, analysts are generally nonplussed by the Department of Justice omnibus antitrust suit and are telling investors to stick with Apple. Aiming to show that its carbon reduction efforts are not mere \"climate-washing,\" Apple has spotlighted how its Restore Fund is contributing to the restoration of a Brazilian rainforest, and attempts to save over 3,000 types of tree from extinction. Investment firm Evercore says Apple is facing weakening demand and strong competition from AI rivals, but investors should stick with it for the long term.  "
}