{
    "title": null,
    "date": "1/31/2024",
    "url": "https://www.microsoft.com/en-us/microsoft-365/blog/2024/01/31/the-right-way-to-ai-what-were-learning-from-customers/",
    "text": "In the quarterly earnings call on Tuesday, Satya laid out a bold direction for AI in 2024. “We’ve moved from talking about AI to applying AI at scale.“ Already, we see AI rapidly transforming work for organizations across the world. In the latest Work Trend Index report, 70% of early Copilot for Microsoft 365 users said they were more productive, and 68% felt it improved the quality of their work. Overall, users were 29% faster in a series of tasks like searching, writing, and summarizing. The best Copilot users even saved more than 10 hours per month. Today on WorkLab, we shared key insights and learnings from our customers and our own employees as they roll out Copilot. These inspiring examples show that with the right approach, AI can be a powerful tool for innovation and growth, but it is not a one-size-fits-all solution. Copilot is unlike any new technology that’s come before it, and leaders need to take a deliberate approach to embrace, deploy, and adopt it. Copilot Lab We’ve also received valuable early feedback from customers on how we can improve Copilot. And we’re applying that feedback to make the experience better for everyone. We introduced Copilot Lab to help customers turn a good prompt into a great one, share favorite prompts with coworkers, and get inspired. And customers who want to leverage the power of Copilot in Teams meetings—but without creating a recording—now have the option to enable it without transcription. As the technology continues to evolve and get better, the extent to which an organization gets value from it will also largely depend on its intentional and programmatic approach to rolling it out. Start applying these critical lessons to your rollout today, and be sure to share your own Copilot tips with us on social media. Copilot for Microsoft 365 is now available to businesses of all sizes—with no seat minimum. Help people and teams do their best work with the apps and experiences they rely on every day to connect, collaborate, and get work done from anywhere. "
}