{
    "title": "Microsoft joins forces with VB Lab for 3 stops on the AI Impact Tour",
    "date": "1/30/2024",
    "url": "https://venturebeat.com/ai/microsoft-joins-forces-with-vb-lab-for-3-stops-on-the-ai-impact-tour/",
    "text": "SAN FRANCISCO, January 29, 2024 — In January 2024, VentureBeat launched the AI Impact Tour, a series of intimate events in cities across the U.S., each focusing on distinct aspects of the current and upcoming AI revolution. VB Lab just announced a partnership with Microsoft to sponsor three of these events, kicking off in New York in February. Each invitation-only salon is an evening of networking, insights and conversation with leaders and technical decision-makers in enterprise AI, talking about the AI issues relevant to each city. Attendees will gain critical intel into what other AI decision-makers are doing and why, while enjoying appetizers, cocktails and industry connections new and old. “We’re excited to join forces with VB Lab to sponsor three crucial stops on the VentureBeat AI Impact Tour in 2024,” says Alysa Taylor, corporate vice president, Azure + Industry, Microsoft. “With these events, we’re looking forward to exploring the latest developments and trends in generative AI, and how every organization can benefit from this wave of technology advancement while safeguarding their business, their data and their customers.” “Microsoft’s AI innovation and commitment to building communities in AI and data tech is strongly aligned with VB Lab’s mission,” says Gina Joseph, chief strategy officer at VentureBeat. “VB Lab is proud to feature thought leaders like Microsoft that are making a real impact in the AI world, and bringing value to those around them.” Microsoft is also a sponsor at VentureBeat’s flagship event, Transform 2024, live in San Francisco, CA and featuring two days of content,  40+ speakers and 400 decision-makers. Read on for more information about Microsoft’s stops on the VB Impact Tour, and VB Transform 2024. “VB Lab and Microsoft will explore topics that are top of mind for every business leader, starting in New York City with Responsible AI,” Taylor says. “Every decision-maker will come away with insight into how their organization can benefit from this wave of technology advancement while safeguarding their business, their data and their customers.” As part of the NYC event on February 29, Sarah Bird, global lead for responsible AI engineering at Microsoft, will talk about the ways companies can balance the risks and rewards of AI applications, plus ethics, transparency, accountability and fairness in implementing AI applications. Attendees will walk away with the knowledge they need to design, implement and evaluate responsible AI applications. Plus, they’ll have the opportunity to network with other enterprise technical executives who are interested in responsible AI, and share their own questions and ideas. Stay tuned for more information on the following two Microsoft events in Boston and Atlanta, and request an invitation for the AI Impact Tour event in your city. This July, Microsoft takes its place as a prominent sponsor at VentureBeat 2024, happening live in San Francisco. Attendees will explore the big questions around the opportunities and challenges of gen AI, including ethics, governance, security and reliability. Plus they’ll have the opportunity to network with peers and tech providers who can help them advance their gen AI strategy and implementation, as well as discover the latest data, cloud and AI applications that can help improve their efficiency, quality and customer satisfaction. For more information on VB Transform 2024, visit transform24.venturebeat.com. And to learn more about upcoming AI Impact Tour events, visit impact.venturebeat.com (don’t forget to request your invitation here). About Microsoft CloudAs companies across industries look for new ways to take advantage of the latest advancements in AI, the right partner can make the difference between being a leader or being a follower. Microsoft’s advancements in AI align with its mission to help every person and organization on the planet to achieve more. The era of AI is here today, and it’s powered by the Microsoft Cloud. The Microsoft Cloud brings together solutions spanning the entire technology stack, from the global cloud infrastructure powering AI innovation, to the data and application services every developer needs, to the productivity and workflow solutions that empower every end user—all built on a foundation of trust and security. Learn how Microsoft is unlocking productivity across every business with Microsoft Copilot, enabling every organization to craft transformative experiences with Azure AI, and helping safeguard businesses, data, and customer trust with a secure and responsible AI approach. Check out microsoft.com/AI to learn more. About VB LabVB Lab presents how VentureBeat and GamesBeat work with their partners. Its focus on strategic thought leadership consultancy, demand generation, and branded content studio services offers exceptional business results for our strategic partners using proven processes where we listen, ideate & create innovative opportunities and custom go-to-market solutions. Visit venturebeat.com/vb-lab to learn more. Join us in Boston an exclusive invitation-only evening of networking and insights to discuss how to ensure data integrity for enterprise AI. © 2024 VentureBeat. All rights reserved. "
}