{
    "title": "Microsoft poised to overtake Apple as world’s most valuable company",
    "date": "1/5/2024",
    "url": "https://macdailynews.com/2024/01/05/microsoft-poised-to-overtake-apple-as-worlds-most-valuable-company/",
    "text": "Update font size. Reset  Microsoft is poised to retake the title of the world’s most valuable company from Apple after a bad start to the new year by the Mac-maker. Emily Bary for MarketWatch:\n ‎ Now valued at $2.73 trillion, Microsoft s worth about $100 billion less than Apple, which is valued at $2.83 trillion. Apple hasn’t been worth less than Microsoft since a 14-session stretch that ended Nov. 17, 2021, and the market-cap gap hasn’t been this small since Nov. 22, 2021. Microsoft’s stock is coming off a slightly stronger year than Apple’s, having risen 57% in 2023 as compared with 48% for Apple. Microsoft shares have also seen slimmer losses to start 2024. The rally in Microsoft shares comes as enterprise spending has held up, aiding the company’s Azure cloud-computing business. Azure has also benefited from the artificial-intelligence frenzy… Microsoft’s business is levered to AI in other ways… Apple, meanwhile, has seen its business stagnate in recent quarters as the company deals with heightened competition in China and general macroeconomic pressure that is weighing on consumer spending. ‎\nMacDailyNews Take: Apple’s next earnings report and executive commentary will tell the story. Based on historical earnings dates, Apple is expected to announce earnings between January 26, 2024 and February 02, 2024 (the company has not yet set a date for the release of Q124 results).\n ‎\nPlease help support MacDailyNews. Click or tap here to support our independent tech blog. Thank you! Support MacDailyNews at no extra cost to you by using this link to shop at Amazon.   Apple needs to supercharge AI. Honestly, all Apple products looks like they come from a conservative company afraid of risk and unsure of where to go next. Is it VR goggles? Not convinced. This isn’t surprising.  MS, for a number of yrs,  has been regularly putting efforts into new ventures.  Just heard this morn they will be working with hardware vendors to have a command option on machines to employ “their” ChatGPT.  Apple has been iterative for a long time–unreleased Vision Pro–is an exception.  Apple seems MUCH more interested in content…where they do seem vigorously involved.  The migration of top employees AWAY f/ Apple probably tells a lot more than the outsider can see. Haven’t they taken over 500B in buy backs off the table? So yea, not surprising. Imagine if MSFT had kept its 5% of AAPL… Maybe Apple should start marketing to White people again. Maybe Apple should market based on pure qualitative & truth substance, instead of woke garbage, which is driven by “we know what’s best for you and the World,” hubris? Tim Cook’s Apple will struggle to figure AI out. Tim is too worried that an Apple branded AI will recommend or promote “fake news” or an unapproved narrative. AI is in the early days wild Wild West and it’s impossible to control its output without diminishing its functionality. No one is interested in a Tim Cook approved AI model. On the other hand Microsoft’s buy into open A.i. was strategically brilliant. Microsoft will overtake Apple in market value as Tim struggles with reality This site uses Akismet to reduce spam. Learn how your comment data is processed. CNBC’s Jim Cramer threw cold water on the U.S. DOJ’s antitrust case against Apple, calling this action a buying opportunity for AAPL stock… Ahead of a a high-profile business forum in Beijing which Apple CEO Tim Cook is attending, China has relaxed rules governing cross-border… Apple is scrapping a long-running project to design and develop its own smartwatch displays, putting an end to another pricey research… Apple has held preliminary talks with Baidu about using the Chinese company’s generative AI technology in its devices in China… A newly discovered vulnerability baked into Apple’s M-series of chips allows attackers to extract secret keys from Macs when they… Enter your email address to follow MacDailyNews and receive notifications of new posts by email. Email Address Follow :-) "
}