{
    "title": "MSFT, CRWD, PANW: Which Cybersecurity Stock is Best for 2024?",
    "date": "1/23/2024",
    "url": "https://finance.yahoo.com/news/msft-crwd-panw-cybersecurity-stock-220335002.html",
    "text": "Cyber threats continue to evolve over time, with state-backed groups and other entities that could embrace the power of artificial intelligence (AI) to bypass even the most secure systems. Indeed, the stakes of having top-of-the-line cybersecurity defenses have never been higher, and they could get even higher from here as the technology landscape changes while what’s at stake (more than just customer data) increases. While generative AI, blockchain, and the Metaverse may be the buzzier themes to invest in tech, I’d argue that it’s a mistake to count cybersecurity out. I believe cybersecurity plays stand out as one of the most defensive ways to get next-level growth. Cyber defenses are an absolute must, even amid a budget-tightening cycle as the rate, breadth, and severity of breaches climb. Therefore, let’s use TipRanks’ Comparison Tool to weigh in on three cybersecurity plays that Wall Street remains upbeat on for 2024. Microsoft isn’t just a major player in the generative AI race; it’s very much a cybersecurity play with its Microsoft Security Copilot. Indeed, many Windows OS users may have chosen to forgo purchasing third-party security software in favor of Microsoft’s own security essentials. For the most part, Microsoft’s footing in cybersecurity has been impressive. However, after Microsoft’s own security was breached by Russian hackers, questions linger as to whether the enterprise behemoth can stay a credible player in the cybersecurity scene. Despite the hack, I remain bullish on Microsoft’s ability to navigate this latest crisis. As you’d imagine, it can be quite embarrassing for a provider of cybersecurity solutions to be compromised by hackers. The company is bound to go on the defensive, but one thing is clear: the recent breaches are not a good look through the eyes of investors and customers. The real risk is that the breaches could drive Microsoft’s cybersecurity customers to pursue alternative cybersecurity solutions. In any case, I expect Microsoft will bounce back from its recent cybersecurity fumble. At the end of the day, Russian hacker groups are incredibly sophisticated, perhaps so much so that Microsoft may just be the first of many behemoths to take a hit. Either way, the breach shines a very bright light on the importance of having not just acceptable cybersecurity solutions in place but the very best on the market. The cybersecurity breach hasn’t had too big of an impact on MSFT stock, which is just a hair shy of all-time highs. Nonetheless, moving forward, I expect more gains to be coming courtesy of AI, rather than cybersecurity. Microsoft stock is a Strong Buy, according to analysts, with 36 Buys and one Hold assigned in the past three months. The average MSFT stock price target of $434.21 implies 9.8% upside potential. CrowdStrike stands out as one of the gold standards when it comes to cybersecurity software, especially in the modern era. Over the past year, shares have skyrocketed by more than 180%. With a recent parabolic pop propelling shares to new all-time highs, I’d not be willing to bet against the firm as it looks to gain a share in the bustling cybersecurity market. After the Microsoft hack, I’d argue that CrowdStrike stands out as a potential share-gainer, given its ecosystem of cybersecurity protection products. Though the stock’s gotten noticeably more expensive in recent quarters, I can’t help but stay bullish. WestPark Capital recently downgraded CRWD stock to Hold from Buy, citing the stock’s valuation as its primary concern. Though shares slipped following the downgrade, it didn’t take long for the stock to resume its impressive rally. At this juncture, CRWD stock may be tough to stop in its tracks as it looks to win over business from clients who are beginning to gain the full grasp of what’s at stake by skimping on cybersecurity spending. At 24.5 times price-to-sales (P/S), CRWD is starting to get on the expensive side of its historical range again. I believe the premium is warranted, though, given its “leading” product and a cybersecurity landscape that stands to get scarier in the age of AI. At this juncture, I consider CRWD stock as my favorite cybersecurity pure-play right now. CrowdStrike stock is a Strong Buy, according to analysts, with 37 Buys and two Holds assigned in the past three months. Nevertheless, the average CRWD stock price target of $291.00 implies 1.6% downside potential. Speaking of parabolic moves, check out shares of Palo Alto Networks, which is also cashing in on increased enthusiasm for cybersecurity stocks in recent months. Over the past year, the stock is up over 130%. With a $109 billion market cap, PANW is a heavyweight in the industry and one that could use its size as an advantage to gain market share over rivals. As a relatively large company, Palo Alto has the funds to pour into improving its end-point cybersecurity offering by leaps and bounds. That has me incredibly bullish on PANW stock, even after its breathtaking ascent. Morgan Stanley (NYSE:MS) recently pounded the table on Palo Alto, naming it as its top pick in the cybersecurity scene. For 2024, the bank sees rising demand powering industry gains further, with PANW stock sporting a juicy $395.00 price target from the firm (implying 15% upside from current levels). I think Morgan Stanley’s right to stick with PANW, especially if more headline-making breaches follow the Microsoft one through the year. Like CrowdStrike, the stock’s valuation has expanded considerably amid the scorching rally, with shares now going for 16.2 times P/S. It’s hard to chase stocks that have already gone parabolic, but if you lack cybersecurity exposure, PANW stock is still worth consideration. BellBring stock is a Strong Buy, according to analysts, with 30 Buys and three Holds assigned in the past three months. The average PANW stock price target of $334.19 implies 2.7% downside potential. Despite scorching-hot runs to new highs, I still believe it makes sense to keep top cybersecurity stocks atop your watchlist in a year where cyber attacks may be bigger news than the latest AI innovations. The Microsoft hack was a bombshell piece of news to kick off the year, and it may not be the last of the big breaches as we move into year’s end. At writing, analysts expect the most upside from Microsoft (9.8%) for the year ahead. I’m in agreement; it’s likely the best Buy at this juncture. Disclosure Related Quotes "
}