{
    "title": "Microsoft adds new AI Copilot button to Windows keyboards in device's first \nchange in 30 years",
    "date": "1/4/2024",
    "url": "https://www.foxbusiness.com/technology/microsoft-adds-new-ai-copilot-button-windows-keyboards-devices-first-change-30-years",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Wall Street Alliance Group partner Aadil Zaman and Peapack Private Wealth Management managing principal David Dietze react to Sam Altman returning to OpenAI five days after his firing on 'Making Money.' Microsoft is adding a new artificial intelligence (AI) chatbot button to some Windows keyboards to empower users to take part more easily in what the company called \"the AI transformation.\" Beginning this month, some personal computers with the Windows 11 operating system will have redesigned keyboards with a \"Copilot key\" that launches Microsoft’s AI companion, Yusuf Mehdi, Microsoft’s executive vice president and consumer chief marketing officer, said in a blog post Thursday. The new key marks the first major redesign to the Windows PC keyboard in nearly three decades, \"making 2024 the year of the AI PC,\" according to Mehdi. \"Nearly 30 years ago, we introduced the Windows key to the PC keyboard that enabled people all over the world to interact with Windows,\" the executive said. \"We see this as another transformative moment in our journey with Windows where Copilot will be the entry point into the world of AI on the PC.\" NEW AI-POWERED FRIDGE TECHNOLOGY GENERATES RECIPES BASED ON DIET, FOOD ON ITS SHELVES Microsoft is adding a new button to its PC keyboards to amplify users' ability to use its artificial intelligence chatbot. (Microsoft) The Copilot button will be unveiled at the CES technology trade show in Las Vegas later this month, though Microsoft has not said which computer makers are adding the Copilot button. WHAT IS ARTIFICIAL INTELLIGENCE (AI)? The Copilot key is the first major change to Microsoft's PC keyboards since the Windows key was added in the 1990s. (Microsoft) The company said the key is expected to become available to users later this month on some of its own line of devices, including upcoming Surface devices. OPENAI RAKED IN OVER $1.6 BILLION IN REVENUE THIS YEAR AMID CEO SAM ALTMAN DRAMA Microsoft’s push to amplify the AI experience for PC users comes after The New York Times filed a lawsuit against OpenAI and Microsoft, alleging that the companies used the Times’ content to train artificial intelligence models without permission, infringing on the outlet’s copyrights in the process. GET FOX BUSINESS ON THE GO BY CLICKING HERE Microsoft has invested in OpenAI, and the two companies have a close relationship. FOX Business’ Eric Revell contributed to this report. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}