{
    "title": "Microsoft set to discuss its visions for the future of Xbox in this week’s \nofficial event",
    "date": "2/12/2024",
    "url": "https://9to5toys.com/2024/02/12/xbox-games-nintendo-switch-playstation-5/",
    "text": "Microsoft has now officially announced an upcoming Xbox business update event for later this week. After getting a good look at some upcoming big-time game releases for the platform, not the least of which was the first gameplay footage for the new Indiana Jones and the Great Circle, Microsoft is turning its attention to the big picture this Thursday. Many are expecting to hear about the company’s vision for the future of Xbox moving forward and, more specifically, about rumors involving Xbox exclusives landing on the other two major platforms. More details below. This week’s event will come in the form of an “official Xbox Podcast” and is scheduled to feature “Phil Spencer, Sarah Bond and Matt Booty as they share updates on the Xbox business.” Specific details on what will be on the slate for this discussion are relatively thin at this point. But with recent rumors all over the place for the past few weeks regarding Microsoft exclusives games coming to Nintendo Switch and PlayStation 5, it would appear many folks think this will, at least, be apart of the discussion. It is important to note that Microsoft has yet to give any specifics or really any confirmation on its titles landing on consoles from the direct competition at this point. But there have been more than few reasons to think this might be the case. Reports surfaced recently showing assets buried within the code of Microsoft exclusives, like Hi-Fi Rush, suggesting versions of the game would be coming to PS5 and Switch relatively soon (as in potentially this month). Recent rumors have also suggested some of the big-time Bethesda titles, including Starfield and the aforementioned Indiana Jones and the Great Circle, might indeed be getting the same treatment in the near future. And while there hasn’t been any official confirmation from Microsoft has of yet on any of this, Phil Spencer, the CEO of Microsoft Gaming, didn’t exactly deny them either: “We’re listening and we hear you.” Well, it won’t be long now before we find out if any of this is true or, at least, whether or not Microsoft is ready to talk about just yet. This week’s Xbox business update event will be giving us some details on what’s to come on Thursday, February 15, 2024 at 12 p.m. PT/3 p.m. ET Add 9to5Toys to your Google News feed. \n\t\t\t\t\n\t\nGoogle News FTC: 9to5Toys is reader supported, we may earn income on affiliate links Subscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more! "
}