{
    "title": "Microsoft and 1910 Genetics Partner to Build the Infrastructure Layer for \nDrug Discovery and Development Using AI ...",
    "date": "2/29/2024",
    "url": "https://www.biospace.com/article/releases/microsoft-and-1910-genetics-partner-to-build-the-infrastructure-layer-for-drug-discovery-and-development-using-ai-and-high-performance-computing/",
    "text": "Skip to main content Published: Feb 29, 2024 First-of-its-kind, fully integrated, AI-driven drug discovery and development platform will enable pharmaceutical R&D teams to generate therapeutics faster and more cost-effectively BOSTON--(BUSINESS WIRE)-- 1910 Genetics (or “1910”), the only biotechnology company advancing small and large molecule drug discovery with a multimodal AI platform powered by laboratory automation, today announced a new five-year commercial agreement and go-to-market collaboration with Microsoft to harness advanced artificial intelligence (AI) and next-generation, high-performance computing (HPC) to reverse 70 years of declining pharmaceutical R&D productivity. This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20240229216281/en/ 1910’s state-of-the-art laboratory automation facility in Boston's Seaport District. (Photo: Business Wire) 1910 will combine its massive computational and wet lab biological data, robotics-driven laboratory automation and multimodal AI models for drug discovery with Microsoft’s HPC platform, Azure Quantum Elements, empowering researchers worldwide with a groundbreaking cloud platform purpose-built at the intersection of AI and HPC to accelerate scientific discovery. 1910 will offer the platform to pharmaceutical, biotechnology, government, academic, and research institutions via three partnership models: Co-discovery, Co-engineering, and Platform-as-a-Service. Potential partners can sign up here for early access. “We are thrilled to be collaborating with 1910 Genetics to bring their pioneering AI drug discovery engines to Azure Quantum Elements,” said Jason Zander, Executive Vice President of Strategic Missions and Technologies at Microsoft. “This groundbreaking technology holds immense promise for accelerating the design of small and large molecule therapeutics. Our collaboration with 1910 Genetics demonstrates our shared commitment to innovation and our aspiration to solve some of the most challenging problems the world faces in drug discovery. We look forward to what our shared efforts will empower drug researchers to accomplish.” AI enables a paradigm shift for scientific discovery Since the 17th century, the scientific method has remained largely unchanged, relying on slow, human-intensive, and iterative cycles of observation, hypothesis, experimentation, and analysis. AI offers an unprecedented opportunity to compress these cycles, accelerate the time from observation to discovery, and reduce the need for experimentation. This paradigm shift, AI for Scientific Discovery, will transform discovery across all industries, and especially the pharmaceutical industry, where on average, it takes 12 to 15 years and costs over $2 billion to develop a new drug. To realize the promise of AI for Scientific Discovery for pharmaceutical R&D, a new end-to-end drug discovery and development process must be reimagined from the ground up using AI, and it must overcome historically fragmented and disparate data, create new types of data at scale, and put massive parallel data, AI, and laboratory automation in the same, iterative loop. 1910 Genetics is realizing the promise of AI to accelerate R&D productivity Founded in 2018 and backed by leading investors, including OpenAI’s Sam Altman, M12-Microsoft’s Venture Fund, and Playground Global, 1910 was built from the ground up as a next-generation, AI-native biotechnology company with three differentiating capabilities: For pharmaceutical R&D teams, 1910’s platform significantly reduces the time and cost of designing novel lead molecules for a variety of therapeutic targets across target classes, ranging from proteases, kinases, and transmembrane receptors, and disease areas, ranging from neuroscience, infectious diseases, autoimmune diseases, and cancer. Microsoft Azure Quantum Elements is purpose built to accelerate scientific discovery “Azure Quantum Elements brings the most powerful AI engine created to facilitate this new AI for Scientific Discovery wave,” said Zulfi Alam, Corporate Vice President of Quantum at Microsoft. “Together with 1910, Microsoft is charting a course for a billion-dollar business in AI-driven drug discovery and development.” In June 2023, Microsoft introduced Azure Quantum Elements (AQE), a supercomputer for chemistry that contains AI models trained on hundreds of millions of molecules, making it an expert in chemistry and materials science, and, using generative AI, a “Copilot for Azure Quantum” to write code and answer tough questions for computational chemists and material scientists. Just six months after launching, on January 9, 2024, Microsoft announced its first concrete case study in Azure Quantum Elements for chemistry, demonstrating that Azure Quantum Elements used advanced AI to screen 32.6 million candidates in record time to discover and synthesize a new material that could reduce the use of lithium in batteries by 70 percent, paving the way for the next generation of sustainable batteries. This landmark discovery is a first-of-its-kind in the application of AI for Scientific Discovery for the design of new materials and foreshadows the transformative potential of Azure Quantum Elements to increase productivity in more industries, including pharmaceuticals. 1910 Genetics and Azure Quantum Elements are building the infrastructure layer “We are excited to embark on this collaboration with Microsoft and integrate our small and large drug discovery platform into Azure Quantum Elements,” said Founder and CEO, Jen Nwankwo, PhD. “By building the infrastructure layer for AI-driven drug discovery, we will expand the reach and impact of our platform to researchers around the world.” The relationship between 1910 and Microsoft began in 2021 when M12-Microsoft’s Venture Fund led a $22M Series A investment in 1910 Genetics. In June 2023, Microsoft announced that 1910 was one of six Azure Quantum Elements launch customers, and its only collaborator in the biotech and pharmaceutical industry. With today’s announcement, 1910 and Microsoft will expand their pilot collaboration into a five-year commercial agreement and go-to-market collaboration that combines the biotechnology company’s massive computational and wet lab biological data, robotics-driven laboratory automation, and multimodal AI models for drug discovery with Azure Quantum Elements. Together the companies will build the infrastructure layer on which pharmaceutical and R&D teams across the world begin, accelerate, and realize their transition to AI-driven drug discovery today and drug development, commercialization, post-marketing surveillance, and real world evidence tomorrow. Added 1910 Founder and CEO Jen Nwankwo: “We believe that as the biopharma industry prepares for the inevitable transition from human-intensive, rational drug design to AI-enabled discovery with generative AI at the frontier, the winning companies will, like 1910, be those who innovate across the entire drug discovery tech stack to use optimized, high-performance computing today and quantum computing tomorrow, in concert with high-throughput lab automation to generate large-scale, multimodal data sets. By bringing 1910 and Azure Quantum Elements together, we enable biopharma companies worldwide to realize the potential of AI and reverse decades of declining R&D productivity.” Potential customers interested in learning more about 1910 Genetics’ small and large molecule drug discovery platform in Azure Quantum Elements can sign up here for early access. About 1910 Genetics 1910 Genetics is the only biotechnology company advancing small and large molecule drug discovery with a multimodal AI platform powered by laboratory automation. We integrate AI with three proprietary data streams – computational data, wet lab proxy biological data, and wet lab ground truth biological data – to deliver novel drug candidates and software solutions to leading pharma and tech partners, and advance our internal pipeline for neurological, autoimmune diseases, and cancer. 1910 was launched in 2021 with a combined seed and Series A funding of $26.1M backed by M12-Microsoft’s Venture Fund, Playground Global, OpenAI’s Sam Altman, FoundersX Ventures, and other leading investors. We have since established our HQ and lab facilities in Boston’s Seaport District and continue to hire a world-class team. To learn more visit 1910Genetics.com.  View source version on businesswire.com: https://www.businesswire.com/news/home/20240229216281/en/ Contacts Media: \r\n1910 Genetics PR\nmedia@1910Genetics.com Source: 1910 Genetics 1910’s state-of-the-art laboratory automation facility in Boston's Seaport District. (Photo: Business Wire)   View this news release and multimedia online at:\nhttp://www.businesswire.com/news/home/20240229216281/en Back to news Back to top © 1985 - 2024 BioSpace.com. All rights reserved. Powered by Madgex Job Board Software "
}