{
    "title": "Mistral's deal with Microsoft is causing controversy",
    "date": "2/28/2024",
    "url": "https://sifted.eu/articles/mistral-microsoft-deal-controversy",
    "text": "Startup Europe.\nGrown up reporting. Backed by © 2024 Sifted EU Ltd. All Rights Reserved. Analysis February 28, 2024 Daphné Leprince-Ringuet 5 min read In just a few months, Mistral AI has become France’s most prized AI company. Much of the goodwill has come from the promise of creating a European champion that could compete against US giants like ChatGPT creator OpenAI, with an open-source product that reflects the continent’s push for more transparency in the sector. From the start, Mistral has made a point of providing open-source AI models — which means that users can download and use the technology’s source code for free — as a European alternative to less transparent products such as those developed by OpenAI, which are known as closed source or proprietary. So when the startup announced it is partnering with US tech behemoth Microsoft — in a deal that saw the tech giant take a stake in Mistral— to distribute its new large language model (LLM), Mistral Large, which is not open source, some sceptical eyebrows were raised. Unlike Mistral’s first open-source model releases, Mistral Large is a ready-made API that can be used for a fee, and gives no access to the code. Some critics see the move as a U-turn on Mistral’s original commitment to open source that is not unlike OpenAI’s shift from open to closed models. It wasn’t long before social media filled up with debates as to whether this means the company is going down the same route as its US competitor. “It is so over,” wrote one user on an open source subreddit. “GREED,” wrote another. “The idealistic stance they initially had around openness and transparency is now probably not going to be implemented fully,” says Andreas Goeldi, an AI-focused partner at Swiss VC firm b2venture. “They still have open models and they seem to want to continue to do that, but it is not as clear as it was until now.” Some will see the uproar as hysterical hand wringing. Mistral has always made clear its strategy was to offer commercial models alongside its open-source offering. Monetising open source, which is by definition free software, is a challenge for many European startups. Some, like the UK’s Stability AI, have also moved away from a fully open-source business model to generate more revenue. “It’s always relatively hard to monetise open source, and you have to find a way to make people pay anyway,” says Goeldi. “To turn this into a real business, [Mistral] had to find a way to monetise it more.” But it’s not only about the technicalities of AI models. Mistral has always presented its open-source strategy as part of what makes it a distinctly European alternative to closed-source US companies like OpenAI. “We have been pursuing a clear trajectory: that of creating a European champion with a global vocation in generative artificial intelligence, based on an open, responsible and decentralised approach to technology,” said the company’s cofounder Arthur Mensch last December, when the company released Mixtral 8x7B. This is why the company’s release of a closed-source model at the same time as it inks a partnership with Microsoft has raised some concerns with critics who say the deal has the potential to further strengthen the tech giant’s control of the generative AI market. In a leaked pitch deck seen by Sifted in June, shortly after the company raised a €105m seed round, the company wrote: “An oligopoly is shaping up… All major actors are currently US-based, and Europe has yet to see the appearance of a serious contender.” The European Commission has said that it will scrutinise whether the Microsoft partnership aligns with the bloc’s competition rules, according to Bloomberg. As part of the deal, Mistral’s models will be distributed on the tech giant’s cloud computing platform Azure. Microsoft will also provide Mistral with the computing infrastructure it needs to develop and train its models — in exchange for a small stake in the company. It is a very similar setup to that of OpenAI — the only other AI company to have a distribution deal with Microsoft — and one that will reinforce the dominance of Microsoft in the sector. “It’s one large step for Mistral, one giant leap for Microsoft,” says Yann Lechelle, former CEO of French cloud computing platform Scaleway and now founder of open-source startup Probabl. The deal has the potential to enable Mistral to access a much larger pool of potential customers and to significantly increase its revenues, but does show that it’s hard to do business in this field without the support of a Big Tech partner. “This partnership between Microsoft is a major and logical opportunity for Mistral,” says Lechelle.“Unfortunately, it shows that distribution of any major…SaaS offering, AI or otherwise, depends and reinforces already dominating hyperscalers.\" Whether this is problematic is up for debate. Mistral’s deal with Microsoft could enable the company to grow bigger and eventually compete against monopolistic US technologies. “I think they are trying to find an approach that enables them to keep their positioning — a European AI company that is sovereign and open source — while accelerating their revenue,” says Maxime Corbani, senior associate at deeptech VC firm Runa Capital. And if anyone did think it could develop a world-leading AI company without signing a deal with a member of the oligopoly it sought to oppose, Goeldi says it was shortsighted. “It’s the reality facing Europe at this time,” he says. “Maybe people were a bit naive about how easy it would be to do this in standalone.” Mistral have not responded to a request for comment. Editor's pick Interview Zenly's founder is back with amo — and this time he's not looking for buyers Interview Pirate Bay’s Peter Sunde: “No one does tech for good — especially not in fintech” Analysis How PhotoRoom became France’s hot young GenAI thing Daphné Leprince-Ringuet Daphné Leprince-Ringuet is a reporter for Sifted based in Paris and covering French tech. You can find her on X and LinkedIn Recommended Stable Diffusion maker leaves Stability AI Robin Rombach helped build the tech that made Stability AI famous, now he's leaving the company Tim Smith A robot’s brain that won’t hallucinate: Stanhope AI raises £2.3m The robotic revolution is coming but our most powerful AI systems aren't yet reliable enough to run them — Stanhope AI wants to fix that Tim Smith UK startup to roll out robot-built “lego” houses in the US and Europe Automated Architecture has raised £2.6m and wants to help tackle the housing shortage Kai Nicol-Schwarz Backed by © 2024 Sifted EU Ltd. All Rights Reserved. "
}