{
    "title": "5 Best Big Company Stocks to Buy",
    "date": "2/9/2024",
    "url": "https://www.insidermonkey.com/blog/5-best-big-company-stocks-to-buy-2-1256590/5",
    "text": "Microsoft Corporation (NASDAQ:MSFT) is one of the biggest and best-known tech companies in the world and develops computer software, operating systems, cloud computing, and more. It takes the top spot on our list of the best big company stocks to buy. In the third quarter, hedge fund sentiment was positive toward Microsoft Corporation (NASDAQ:MSFT), as 306 hedge funds had investments in the stock, compared to 300 in the previous quarter. With 39.286 million shares worth $12.4 billion, Michael Larson’s Bill & Melinda Gates Foundation Trust was the top investor in the company. On January 30, Microsoft Corporation (NASDAQ:MSFT) announced its Q2 earnings result with a GAAP EPS of $2.93, topping the estimates by $0.16. The revenue of $62.02 billion jumped 17.7% YoY, surpassing the estimates by $890 million. Madison Investments stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its fourth quarter 2023 investor letter: “Microsoft Corporation’s (NASDAQ:MSFT) sustainable scorecard was updated with an unchanged rating of Above Average. The company’s board has an official Environmental, Social, and Public Policy Committee in addition to the traditional Audit, Compensation, and Governance committees. For ten years, Microsoft has publicly released data measuring the diversity of its workforce. With the prominence of Artificial Intelligence (AI), the company has launched a 5-point blueprint for governing AI to address public policy and regulation. Environmentally, Microsoft has multiple programs to be carbon negative by 2030. The company has signed Purchase Power Agreements for carbon-free energy totaling 13.5 Gigawatts.” Follow Microsoft Corp (NASDAQ:MSFT) Follow Microsoft Corp (NASDAQ:MSFT)              or     Subscribe with Google      We may use your email to send marketing emails about our services. Click here to read our privacy policy. You can also look at the 15 Best Cities for Hedge Fund Managers and the 10 Best Discount Retailer Stocks to Buy. Insider Monkey focuses on uncovering the best investment ideas of hedge funds and investors. Please subscribe to our daily free newsletter to get the latest investment ideas from hedge funds’ investor letters by entering your email address below. NYSE:MANASDAQ:METANASDAQ:AMZNNASDAQ:MSFTNASDAQ:GOOGLAlphabet Inc. (NASDAQ:GOOGL)Amazon.com Inc. (NASDAQ:AMZN)5 Best Big Company Stocks to BuyMastercard Incorporated (NYSE:MA)Meta Platforms Inc. (NASDAQ:META)Microsoft Corporation (NASDAQ:MSFT)15 Best Cities for Hedge Fund Managers10 Best Discount Retailer Stocks to BuyShow more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                 Get our editor’s daily picks straight in your inbox!  "
}