{
    "title": "Big 3 Cloud Providers Continue to Outperform as AI Drives Growth",
    "date": "2/2/2024",
    "url": "https://www.itprotoday.com/iaas-and-paas/big-3-cloud-providers-continue-outperform-ai-drives-growth",
    "text": "IT Pro Today is part of the Informa Tech Division of Informa PLC This site is operated by a business or businesses owned by Informa PLC and all copyright resides with them. Informa PLC's registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. Number 8860726. Sean Michael Kerner | Feb 02, 2024 There just seems to be no end in sight for the growth of the public cloud. The big three public cloud providers — Microsoft Azure, Google Cloud Platform, and Amazon Web Services (AWS) — all reported their most recent financial earnings this week, once again highlighting big gains in cloud computing revenues, ostensibly driven by the juggernaut of demand coming from artificial intelligence (AI). Related: AWS, Azure, and GCP: 4 Major Areas in Which They Differ Google's parent company Alphabet reported its fourth-quarter fiscal 2023 earnings on Jan. 30, with cloud computing revenue rising 25% to $9.19 billion. That same day, Microsoft reported its second-quarter fiscal 2024 earnings, with Microsoft Cloud revenue of $33.7 billion, up 24%. The final member of the big three — Amazon — reported revenue on Feb 1, with AWS posting $24.20 billion in revenue in the quarter for a 13% year-over-year gain. According to Synergy Research Group, overall cloud spending reached an all-time high in terms of total revenue and percentage growth in the most recent quarter. Related: Cloud and Edge Computing Trends and Predictions 2024 From Industry Insiders Synergy Research Group  \"The year-on-year growth rate was 20% in Q4, markedly higher than the previous three quarters,\" Synergy Research wrote in a research note. \"Notably, the market grew by $5.6 billion from Q3. That is by far the largest quarter-on-quarter increase ever achieved.\" Alphabet CEO Sundar Pichai strongly emphasized the positive influence that generative AI services running on Google Cloud are having for boosting usage and revenues. \"Throughout 2023, we introduced thousands of product advances, including broad GenAI capabilities across our AI infrastructure, our Vertex AI platform, and our new Duet AI agents,\" Pichai said during his company's earnings call. Pichai said the go-to-market growth for Google Cloud is coming from both direct and indirect channels. With independent software vendors (ISVs), Google has nearly tripled the number of co-selling cloud deals from 2022 to 2023, he said. \"In our ecosystem, there are nearly 90,000 Google Cloud GenAI-enabled consultants,\" Pichai said. A major driver of Microsoft Cloud growth was demand for its AI services. Microsoft CEO Satya Nadella highlighted during his company's earnings call how more than half of the Fortune 500 are now using Azure OpenAI and pointed to Walmart as an example. Microsoft's cloud momentum is being fueled in part by larger long-term deals. Nadella said Microsoft is seeing larger and more strategic Azure deals, with an increase in the number of billion-dollar-plus Azure commitments. He said Vodafone, for example, will invest $1.5 billion in cloud and AI services over the next 10 years as it works to transform the digital experience of more than 300 million customers worldwide. \"Customers continue to choose Azure to simplify and accelerate their cloud migrations,\" Nadella said. Like its cloud rivals, Amazon is seeing AI driving cloud growth. Amazon CEO Andy Jassy commented during his company's earnings call that the cloud customer pipeline is strong as existing customers are renewing at larger commitments over longer periods and migrations are growing. He also noted that 2023 was \"a very significant year of delivery and customer trial for generative AI\" in AWS. While all three major cloud providers highlighted AI-driven gains, Jassy emphasized that AWS is different in several ways, notably with security. \"Security is a big deal, an important differentiator between cloud providers,\" Jassy said. \"With AWS' advantaged security capabilities and track record relative to other providers, we continue to see momentum around customers wanting to do their long-term GenAI work with AWS.\" About the author More information about text formats Follow us: "
}