{
    "title": "Elon Musk 'Doesn't Mean To Be A Pest,' But Still Wants Satya Nadella To \nChange How Microsoft Lets Users Setup A ...",
    "date": "2/26/2024",
    "url": "https://www.tradingview.com/news/benzinga:d0822aca1094b:0-elon-musk-doesn-t-mean-to-be-a-pest-but-still-wants-satya-nadella-to-change-how-microsoft-lets-users-setup-a-windows-pc/",
    "text": "Elon Musk has now directly asked Microsoft Corporation MSFT CEO Satya Nadella to allow people to skip the process of creating a Microsoft account when setting up a new Windows PC. What Happened: On Monday, the SpaceX and Tesla CEO took to X, formerly Twitter, and responded to Nadella's post about Microsoft's multi-year partnership with MistrialAI. Musk also owns X. The entrepreneur said, \"Satya, I don't mean to be a pest, but please allow people setting up a new Windows PC to skip creating a Microsoft account,\" echoing his earlier accusations. See Also: Elon Musk Responds After Bakery Owner Says Tesla Ordered 4,000 Mini Pies And Then Cancelled The Order Without Paying, Causing $16K Loss He went on to say that the option to \"skip\" disappears once the computer connects to WiFi. \"Also, even if you do want to sign up, it won't allow you use a work email address and I only *have* work emails addresses!\" Satya, I don't mean to be a pest, but please allow people setting up a new Windows PC to skip creating a Microsoft account. This option disappears if the computer is connected to WiFi. Also, even if you do want to sign up, it won't allow you use a work email address and I... Why It's Important: Previously, on Sunday, Musk accused Microsoft of forcing him to sign up with an account when using his new PC laptop. The tech mogul said that he cannot use his new laptop unless he creates a Microsoft account, which by default also means giving the Nadella-led company \"AI access to my computer! This is messed up.” Musk has criticized Microsoft’s AI development before. He has time and again focused on the connection between ChatGPT-parent OpenAI and Microsoft. “They own the code, the weights, everything! And GPT runs in a Microsoft data center.” Image Via Shutterstock Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Elon Musk Pushes xAI's Grok AI Chatbot After Google Gemini Comes Under Fire: ‘Truth... Never Been More Essential' © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @profitable_trades @TradingView @ozonlayerfx @aggressivecalculator @most_luxurious_lifestyle @life_of_lorena.fx @chartfeed @tradingview @TradingView @fxdelta @lifestylewith_ashley26 @TradingView @aitor_avatar @rok_trader @Cenobar @trading_tools.ir @Market Mentor Network @itzi71 Whatever the trade "
}