{
    "title": "Microsoft's AI Ventures and Qualcomm's Autotalks Acquisition Face \nRegulatory Scrutiny, Global Tech Competition ...",
    "date": "2/27/2024",
    "url": "https://www.tradingview.com/news/benzinga:3a70dca28094b:0-microsoft-s-ai-ventures-and-qualcomm-s-autotalks-acquisition-face-regulatory-scrutiny-global-tech-competition-concerns/",
    "text": "U.S. Big Tech’s artificial intelligence investments and takeover plans are increasingly drawing regulatory scrutiny worldwide. Significant merger deals, including Nvidia Corp NVDA – Arm Holdings Plc ARM and  Intel Corp’s INTC – Tower Semiconductor Ltd TSEM, succumbed to regulatory opposition over anticompetitive grounds. The European Union’s competition watchdog plans to examine Microsoft Corp’s MSFT recent investment in Mistral AI, alongside its ongoing scrutiny of Microsoft’s close relationship with OpenAI Inc. Microsoft has formed a strategic partnership with Mistral, investing €15 million ($16.3 million) to make Mistral’s artificial intelligence models available on its Azure cloud platform. Unlike OpenAI’s models, which are proprietary, Mistral’s are open for sharing. This investment in Mistral, known for developing algorithmic models for AI services similar to those by OpenAI, will turn into equity in Mistral’s next funding round, Bloomberg reports. While Microsoft has primarily collaborated with OpenAI, investing about $13 billion, its ties with OpenAI and its new investment in Mistral are closely watched by U.K. and EU regulators, raising concerns about potential formal investigations that could impact Microsoft’s AI endeavors. Separately, the U.K.’s Competition and Markets Authority (CMA) has initiated a formal investigation into Qualcomm Inc’s QCOM acquisition of the Israeli semiconductor company Autotalks Ltd for terms undisclosed due to concerns that the deal might restrict competition in the market. The CMA has set a deadline of April 25 to determine whether to greenlight the acquisition or escalate it to a more detailed investigation, Bloomberg reports. Qualcomm, headquartered in San Diego, California, announced its intention to acquire Autotalks through its subsidiary, Qualcomm Technologies Inc, aiming to enhance its portfolio in automotive safety systems, specifically in crash-prevention technology. Additionally, the European Union is examining the takeover, following requests from 15 EU member states, indicating significant regulatory scrutiny over the transaction’s potential impact on competition. Price Actions: Microsoft shares traded lower by 0.55% at $405.32 on the last check Tuesday. QCOM shares traded higher by 0.89% at $158.43. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo by Igor Omilaev on Unsplash © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @profitable_trades @TradingView @ozonlayerfx @aggressivecalculator @most_luxurious_lifestyle @life_of_lorena.fx @chartfeed @tradingview @TradingView @fxdelta @lifestylewith_ashley26 @TradingView @aitor_avatar @rok_trader @Cenobar @trading_tools.ir @Market Mentor Network @itzi71 Whatever the trade "
}