{
    "title": "Apiax releases AI Policy Assistant based on Microsoft Azure OpenAI Service \nthat provides accurate and verified ...",
    "date": "2/1/2024",
    "url": "https://news.microsoft.com/de-ch/2024/02/01/apiax-releases-ai-policy-assistant-based-on-microsoft-azure-openai-service-that-provides-accurate-and-verified-answers-to-internal-compliance-policies/",
    "text": "Februar 1, 2024 Read the original announcement here Zurich, January 30, 2024 – Apiax has launched a new compliance solution today, aiming to enhance operational efficiency and the accuracy of policy searches. The platform is a synthesis of Apiax’s compliance expertise, rule-based technology, and Generative AI, creating a new standard for financial institutions in accessing and verifying company policy details with ease. Apiax, a leading provider of embedded compliance solutions for the financial industry, released its AI Policy Assistant today, an innovative Generative AI-driven solution transforming compliance policies into dynamic conversations. Based on Microsoft’s Azure OpenAI services, the solution offers instant, precise, and verified answers to policy queries, ensuring governance is maintained anytime through its robust verification layer. It seamlessly integrates with the existing rules-based solution, enhancing decision-making efficiency without compromising compliance standards . “We developed the AI Policy Assistant with the expertise gained from serving multiple global financial institutions. The solution doesn’t compromise on control and transparency and is fully integrated into our comprehensive compliance workbench, ready to tackle complex and multi-faceted policy frameworks,» said Nicolas Blanchard, Chief Product Officer at Apiax. “Being part of the Microsoft for Startups Program accelerated our innovation process massively by leveraging the extensive resources and expertise of Microsoft.” «Working closely with numerous financial institutions in Switzerland and all over the world, we see our customers› need to deliver precise and accurate policy answers, while maintaining strict institutional governance. In this landscape, Apiax is providing an innovative generative AI solution,» says René Huerlimann, Director Solution Sales at Microsoft Switzerland. «Their competitive AI policy assistant is integrating proprietary rule-based frameworks with the Azure OpenAI Service hosted in our Swiss datacenters, while ensuring rigid compliance oversight.» Follow us: Share this page: "
}