{
    "title": "Microsoft pours $2B into AI infrastructure development in Spain",
    "date": "2/20/2024",
    "url": "https://www.tradingview.com/news/cointelegraph:7f5a943b1094b:0-microsoft-pours-2b-into-ai-infrastructure-development-in-spain/",
    "text": "Microsoft has announced another major investment into Europe with a $2.1 billion commitment to expand its artificial intelligence (AI) and cloud infrastructure in Spain. In a post on social media platform X after a meeting with the Prime Minister of Spain, Pedro Sánchez, Brad Smith, Microsoft’s vice chair and president, said the company will be fulfilling its investment in Spain over the next two years. Smith said it’s not just about building data centers but committing to helping develop the country’s “security, and development and digital transformation of its government, businesses, and people.” I’m thrilled to announce that we will expand our AI and cloud infrastructure in Spain by $2.1B USD in the next two years. Our investment is beyond just building data centers, it’s a testament to our 37-year commitment to Spain, its security, and development and digital… https://t.co/arJnZzyDpc According to the Microsoft exec, the company has been investing in Spain for 37 years. In September 2021, the firm announced a new research and development hub for AI technologies based in Barcelona, Spain. At the time, Alberto Granados, the president of Microsoft Spain, said Microsoft’s investment was proof of Spain’s talent in the digital sector. This investment comes on the heels of another investment Microsoft made into Europe on Feb. 15, with 3 billion euros going toward developing Germany’s AI ecosystem. Like its plans in Spain, over the next two years, Microsoft has pledged to invest the funds to boost German AI infrastructure, build new data centers and train people to develop AI skills. Big Tech companies are piling into Europe with AI development-related investments as the European Union is about to implement its landmark EU AI Act legislation. On the same day that Microsoft announced its investment in Germany, the Ministry of the Economy, Finance and Industrial and Digital Sovereignty of France and Google announced plans to set up a new AI-dedicated hub in Paris, which will house nearly 300 researchers and engineers to support the country’s AI ambitions. Two days prior, Google announced its “AI Opportunity Initiative for Europe,” through which it said it would be investing 25 million euros ($26.9 million) in skills training for Europeans in the AI sector. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @profitable_trades @TradingView @ozonlayerfx @aggressivecalculator @most_luxurious_lifestyle @life_of_lorena.fx @chartfeed @tradingview @TradingView @fxdelta @lifestylewith_ashley26 @TradingView @aitor_avatar @rok_trader @Cenobar @trading_tools.ir @Market Mentor Network @itzi71 Whatever the trade "
}