{
    "title": "Microsoft and OpenAI thwart AI use by state-affiliated hackers",
    "date": "2/14/2024",
    "url": "https://www.geekwire.com/2024/microsoft-and-openai-say-theyre-watching-and-thwarting-ai-use-by-russian-and-chinese-hackers/",
    "text": "by Todd Bishop on February 14, 2024 at 7:50 amFebruary 14, 2024 at 7:52 am State-affiliated online attackers are finding ChatGPT and other AI tools useful for improving their productivity, and streamlining and accelerating their work, but they have yet to unleash the technology’s full potential. Microsoft and OpenAI say they’re doing their best to keep it from happening. That’s the takeaway from a new research report issued by the companies this morning, detailing the use of large language models by nation-state attackers affiliated with China, Russia, North Korea, and Iran. “These actors generally sought to use OpenAI services for querying open-source information, translating, finding coding errors, and running basic coding tasks,” OpenAI said in a post Wednesday morning. The San Francisco-based company said it worked with Microsoft to identify and terminate accounts associated with five state-affiliated groups. State-affiliated threat actors “have not yet observed particularly novel or unique AI-enabled attack or abuse techniques resulting from threat actors’ usage of AI,” Microsoft said in its own post. “However, Microsoft and our partners continue to study this landscape closely.” Microsoft announced several principles for disrupting the malicious use of its AI technologies and APIs. In addition to detecting and suspending the accounts of state-affiliated threat actors, the company says it will notify other service providers, collaborate with key stakeholders, and issue public reports about its findings. The Redmond company also discussed the ways that AI will help to defend against online attacks. Microsoft said its Copilot for Security product, currently in customer preview, “showed increased security analyst speed and accuracy, regardless of their expertise level, across common tasks like identifying scripts used by attackers, creating incident reports, and identifying appropriate remediation steps.” Subscribe to GeekWire's free newsletters to catch every headline Have a scoop that you'd like GeekWire to cover? Let us know. Sam Altman’s ouster puts a new twist into OpenAI’s complicated relationship with Microsoft Copilot Pro vs. ChatGPT Plus: Microsoft’s new paid service offers alternative to OpenAI subscription Satya Nadella: Microsoft will never again get blindsided by OpenAI board if Sam Altman returns The New York Times sues OpenAI and Microsoft for training AI chatbots on its copyrighted work Catch every headline in your inbox "
}