{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.arabianbusiness.com/industries/technology/microsoft-dubais-det-partner-to-boost-innovation-goals-under-d33-economic-agenda",
    "text": "بالعربية Русский  Arabian Business Technology > Microsoft, Dubai’s DET partner to boost innovation, goals under D33 economic agenda by\nStaff Writer The partnership will focus on innovation initiatives focusing on logistics, SMEs, education and startups to support the goals of Dubai’s 2033 economic agenda Dubai’s Department of Economy and Tourism (DET) has signed an agreement with Microsoft to accelerate innovation in the emirate. The partnership aims to support Dubai’s economic vision outlined in the D33 – Dubai’s economic agenda which aims to double the size of the economy and secure a top three global city status by 2033. The collaboration will focus on leveraging technology to achieve Dubai’s goals in key sectors like logistics, SMEs and education. “Our agreement with Microsoft is central to our proven development strategy in harnessing the strengths of global partners, facilitating economic growth through exceptional access to sector knowledge, technical expertise and mentorship opportunities for key sectors,” said Hani Badri, CEO of DET. For SMEs, Microsoft will offer affordable technology solutions in priority industries. This enhances productivity and innovation to contribute to business growth aligned with the D33 Agenda. On education, innovative solutions will digitally advance institutions and cement Dubai’s leadership in smart learning. Startups will gain access to Microsoft resources, expertise and a network to increase success rates. The initiative aims to position Dubai as a global innovation hub. “Dubai stands at the forefront of global technology, and we are honoured to contribute to its progress. This planned collaboration represents a shared commitment to drive innovation, promote economic development and build a thriving knowledge-based ecosystem for the future,” said Naim Yazbeck, General Manager of Microsoft UAE. Follow us on  "
}