{
    "title": "Why is Microsoft investing $3.45 billion in Germany?",
    "date": "2/16/2024",
    "url": "https://mspoweruser.com/why-is-microsoft-investing-3-45-billion-in-germany/",
    "text": "Follow us Share this article Latest news 2 min. read Published on February 16, 2024 published on \n\nFebruary 16, 2024 Share this article Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft has announced a €3.2 billion ($3.45 billion) investment in Germany over the next two years to expand its cloud and AI infrastructure and to upskill 1.2 million people in digital skills after recently announcing 2M trainees in India by 2025. The investment will see Microsoft: Microsoft President Brad Smith said the investment was aimed at helping German businesses benefit from AI and continue to be globally competitive. Here are his words: We want to help the German economy benefit from AI to continue to build on its global leadership position in competitiveness. We see a growing demand for AI applications in key industries such as manufacturing, automotive, financial services, pharmaceuticals, life sciences, and medical technology. As these industries undergo fundamental change due to economic change, it is important to equip companies in Germany with world-leading technology. German Chancellor Olaf Scholz said the investment was a “very good message” for Germany as a business location. North Rhine-Westphalia Minister-President Hendrik Wüst said the investment was a “strong signal” for Germany and a “great contribution” to the structural change in the Rhineland region. The investment is part of Microsoft’s commitment to sustainability and responsible AI. The company has set a goal of using 100% renewable energy for its global operations by 2025. It has also developed a standard for responsible AI for its own AI platforms and services. It has established an AI Assurance Program to share best practices and promote responsible AI practices. More here. More about the topics: germany Devesh Beri Tech Journalist These are the things that motivate me - creating informative and helpful content, pursuing my passion for motorsports and music, engaging in expeditions, maintaining a healthy lifestyle, and spending time with my adorable cat Taco. Devesh Beri Tech Journalist Devesh is our tech journalist. His main mission is to break and break down the complex jargon-y tech news for MSPowerUser readers. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}