{
    "title": "Will Microsoft Ever Come Cheap With A Market Cap Of $3.06 Trillion? \n(NASDAQ:MSFT)",
    "date": "2/5/2024",
    "url": "https://seekingalpha.com/article/4667445-will-microsoft-ever-come-cheap-with-a-market-cap-of-3-06-trillion",
    "text": "boonstudio/iStock via Getty Images  boonstudio/iStock via Getty Images We previously covered Microsoft Corporation (NASDAQ:NASDAQ:MSFT) in November 2023, discussing the Intelligent Cloud's expanding top/ bottom lines and backlog, attributed to the robust demand for OpenAI-enabled SaaS offerings across legacy and startup companies. Combined with the sustained cloud migration and likely to be completed ATVI deal, we had believed that its prospects might be very bright after all. However, these had also triggered the stock's premium valuations and prices then, resulting in our cautious Buy recommendation only after a moderate pullback. In this article, we shall discuss why we have been overly greedy, with us missing out on MSFT's rally by +16.3% over the past three months and the gap widening by +34.8% to our previous recommended entry point. It is apparent by now that MSFT is an Alpha that one may chase at every dips, since the CEO's brilliance, the company's highly profitable growth, and the growing partnership with OpenAI may never come cheap after all. If anything, the Market Capitalization continues to race upwards, with it already nearly doubling to $3.06T since the November 2022 bottom of $1.6T. For now, MSFT has reported an excellent double beat FQ2'24 earnings call, with revenues of $62.02B (+9.7% QoQ/ +17.6% YoY) and GAAP EPS of $2.93 (-2% QoQ/ +33.2% YoY). Its top-line tailwinds are attributed to the excellent growth reported across three of its segments, with the most notable one being its More Personal Computing at $16.89B (+23% QoQ/ +18.6% YoY), thanks to the new PC replacement cycle of between three to four years after the 2020 boom. The same has been reported by Intel (INTC) in the latest quarter, with Canalys also projecting 267M units in 2024 PC shipments (+8% YoY), likely to trigger further tailwinds to MSFT's PC SaaS offerings. At the same time, MSFT also benefits from its partnership with OpenAI, as observed in the sustained expansion in the Microsoft Cloud revenues to $33.7B (+5.9% QoQ/ +24.3% YoY) in FQ2'24. This is attributed to the \"application of AI across every layer of its tech stack driving new benefits, such as growing consumer base, cross selling, and up to +70% in productivity gains.\" The same is observed in Intelligent Cloud's expanding operating profit margins of 48.1% (-0.3 points QoQ/ +6.8 YoY), implying its ability to generate improved returns despite the elongated sales cycle, based on the Cloud backlog of $17.69B (-9.1% QoQ/ +11.8% YoY). Therefore, while the growth of MSFT's Cloud backlog has paled in comparison to its peers, such as Amazon's (AMZN) AWS at $155.7B (+17% QoQ/ +41% YoY) and Alphabet's (GOOG) Google Cloud at $74.1B (+14.1% QoQ/ +15.2% YoY), we are not overly concerned. This is because MSFT's Cloud operating profit margins excel over AWS' at 29.6% (-0.6 points QoQ/ +5.3 YoY) and GOOG's at 9.3% (+6.2 points QoQ/ +15.8 YoY) over the same time period. The same is also observed in MSFT's bottom line driver, the Productivity and Business Processes segment, with expanding profit margins of 53.4% (-0.2 points QoQ/ +5.4 YoY) by the latest quarter, naturally contributing to its accelerating bottom line. Demand for its commercial offerings remain healthy as well, thanks to the consistent license renewals, ARPU growth, and healthier than expected LinkedIn performance from the uncertain global labor market. Lastly, MSFT still boasts a robust net cash situation of $36.06B (-64.6% QoQ/ -34.8% YoY) and a relatively reasonable effective interest rate range of between 2.46% and 5.49%, despite the hefty ATVI price tag of $69B. Readers must note that the tech giant still reports $27.04B of short-term debt (+4.8% QoQ) with an elevated weighted average interest rate of 5.5% (+0.1 points QoQ), likely to bridge the recently completed deal. However, due to MSFT's robust profitability and Satya Nadella's stellar handling of the recent OpenAI crisis, we are not concerned at all. These developments demonstrate that the SaaS company is in good hands after all, with the AI industry likely to experience rapid growth and expansion in the future. MSFT Valuations Seeking Alpha Seeking Alpha Combined with the expanding AI SaaS TAM across gaming, ad spending, IT, and business services from $1.86B in 2022 to $661.79B in 2032 at an accelerated CAGR of +79.94%, we believe that MSFT remains well poised for excellent growth over the next decade. The same profitable growth premium is also embedded in its FWD P/E stock valuations of 34.42x, compared to its 1Y mean of 30.41x, 3Y pre-pandemic mean of 24.55x, and sector median of 24.48x. MSFT is also notably trading way higher than its Cloud/ SaaS/ ad peers, such as GOOG at FWD P/E of 21.18x and META at 20.37x, though still lower than AMZN at 44.25x, implying the market's conviction of the former's ability to deliver record growth ahead. The Consensus Forward Estimates Seeking Alpha Seeking Alpha The same has also been observed in the consistently raised consensus estimates, with MSFT expected to generate a top/ bottom line CAGR of +14.6%/ +16.7% through FY2026. This is compared to the previous estimates of +12.4%/ +12.9%, while building upon its historical growth at a CAGR of +12.7%/ +19.7% between FY2016 and FY2023, respectively. Assuming that MSFT is able to hold to its higher P/E valuations, it appears that the stock is trading at a slight premium of +8% to its fair value of $380.60, based on the LTM EPS of $11.06 and FWD P/E of 34.42x. However, based on the consensus FY2026 EPS estimates of $15.67, there seems to be a more than decent upside potential of +31.1% to our long-term price target of $539.30, sustaining its growth story ahead. MSFT 4Y Stock Price Trading View Trading View For now, MSFT has rapidly broken out of its 50/ 100/ 200 day moving averages, while also charting new heights way above the previous November 2021 top. With almost all of the Magnificent 7 stocks recently reporting their stellar earnings, aside for Nvidia (NVDA) scheduled on February 21, 2024 and Tesla's (TSLA) top/ bottom line misses, it is unsurprising that sentiments are somewhat lifted, with the market index skewed towards greed at the same time. With MSFT's recovery easily outpacing the SPY and QQQ over the past few months, we believe that the stock may never come cheap after all, especially due to the multiple growth drivers over the next decade. On the one hand, while we may rate MSFT as a Buy, investors may want to add according to their dollar cost averages and risk appetite, preferably after a moderate pullback to its previous support levels of $370s for an improved margin of safety. On the other hand, we believe that MSFT remains a long-term winner and deserves a spot in most growth oriented investors' portfolio, with it similarly being an Alpha that may be chased at every dips, along with NVDA. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of MSFT, TSLA, GOOG, NVDA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. The analysis is provided exclusively for informational purposes and should not be considered professional investment advice. Before investing, please conduct personal in-depth research and utmost due diligence, as there are many risks associated with the trade, including capital loss. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}