{
    "title": "Techie leaves ‘dream company’ Microsoft after just a year. She explains why",
    "date": "1/7/2024",
    "url": "https://www.hindustantimes.com/technology/techie-leaves-dream-company-microsoft-after-just-a-year-she-explains-why-101704605829811.html",
    "text": "Subscribe Now! Get features like A techie from Siliguri, West Bengal, has spoken about leaving job at her ‘dream company’ – Microsoft – after working there for about a year. It took Haimantika Mitra, who is currently based in Bengaluru, more than 30 attempts to get hired by the tech giant. “I was introduced to the Microsoft community during Covid and during my interactions with members, including engineers and other senior professionals, I felt being drawn to the company,” the Siliguri Institute of Engineering (SIT) graduate told Moneycontrol. On why the Satya Nadella-led giant was her ‘dream company,’ Mitra elaborated: “The first technical group that I was active in there was the Student Ambassador community and I really started falling in love with Microsoft tools. Being a part of the community allowed me to interact with engineers and senior professionals and that's when I began to like the work culture. Slowly, I realised that it was my dream place and I had to work with them.” She was asked by the publication about why then she resigned so soon. To this, the Developer Advocate by profession replied that the position she got hired for (support engineer) ‘wasn’t exactly what I wanted to do in life.' “Due to Microsoft's policies, I would have had to continue in this role for a few years and only then would I be considered for other and more desirable positions at Microsoft. I, however, wanted a faster pace and felt that if I spent two-to-three years as a support engineer only, I would have lost my relevance in the industry, and therefore, I had to quit,\" Mitra said. Mitra, who now works for a Bengaluru-based tech firm, further said that she would ‘love to return’ to Microsoft in future if a suitable position came up. “Not right now, but definitely some day,” she stated.       Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}