{
    "title": "DOJ, FTC consider antitrust probe into Microsoft-OpenAI: RPT",
    "date": "1/22/2024",
    "url": "https://finance.yahoo.com/video/doj-ftc-consider-antitrust-probe-212021938.html",
    "text": "The Department of Justice (DOJ) and Federal Trade Commission (FTC) regulators are currently discussing a potential antitrust into artificial intelligence firm OpenAI and its relationship with Microsoft (MSFT) — which owns 49% of OpenAI — according to reporting by Politico. Yahoo Finance Tech Editor Dan Howley explains the antitrust concerns laid out in this Politico report. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. - OpenAI is the latest tech firm reportedly caught in the crossfire of antitrust investigators. The Justice Department and FTC are in discussions about a probe into the company's involvement with Microsoft that's according to Politico. Yahoo Finance's very own Dan Howley joins us now for more. Dan. DAN HOWLEY: Yeah, I mean, this would be a huge deal if either the FTC or DOJ went after OpenAI and Microsoft. If you think about it, Microsoft has invested billions of dollars into OpenAI to date. They're more or less Microsoft's AI arm at this point. Microsoft has their own AI business, of course. But OpenAI really is a huge part of that. And so if they're forced to separate or break up their partnership, we really don't anything along those lines if that would happen. Or really how this investigation would unfold if it actually happens. But it could throw a huge wrench into Microsoft's plans for its growth on the cloud part. Now, we keep talking about AI in general. But really where that kind of shows up is in its cloud business, right? Its Azure business. Its whether that's helping companies run their own AI capabilities or Microsoft running its own AI capabilities through Copilot for 365 or Copilot Pro, which is a new consumer offering, $20 a month per person. So it would really damage what Microsoft is trying to build up here. As well as OpenAI. Because let's face it. They're getting a ton of money from Microsoft. And they're using Microsoft to help build out their capabilities. So they're really super reliant on each other at this point. And one of the points that they bring up in this Politico article is the influence that Microsoft had during the kind of kerfuffle with Sam Altman being ousted and then coming back, I guess, taking a long weekend we could say. They were going to hire him, right? And then seemingly they helped make everything copacetic again. But the fact that they're so reliant on each other at this point, it raises concerns if this is an actual investigation or if there's even an inkling of it. - Right. I mean, there's a lot of interesting stuff in here because there's now seems to be-- it's very, very early to the point where they can't even decide if it's the FTC or the DOJ who should be doing an investigation if there even should be an investigation. So that also raises the question, it's an election year, right? So even if they figure that out, is it going to change if someone else gets into office? DAN HOWLEY: Yeah, I mean, look, these investigations take years, right? I mean, we're talking about the potential for Apple to maybe sort of have an antitrust suit brought by the DOJ. We've been talking about since 2020, right? I mean, we've been writing about that. How this has been coming for so long? And so this is something that still could take years and years if, again, if it ever actually gets off the ground. There's no guarantee that will happen, that these things are very complicated. And sometimes they come and go. And companies are totally left intact. But I do think it's just important to keep in mind how necessary the two companies almost are for each other. Microsoft basically being the engine that's powering OpenAI. And then OpenAI putting that horsepower to work for Microsoft. So, I mean, they're very intertwined at this point. You can consider them. You can't really consider in one company. But, you know, it's close enough where you're like, oh, you guys are real tight. - Dan, always great to see you. Thanks for that. Appreciate it. DAN HOWLEY: For sure. Related Quotes "
}