{
    "title": null,
    "date": "1/18/2024",
    "url": "https://www.forbes.com/sites/jonmarkman/2024/01/18/microsofts-copilot-revolutionizes-ai-investing/",
    "text": "In this photo illustration the American multinational technology software and computer company ... [+] Microsoft logo seen displayed on a smartphone with an economic stock exchange index graph in the background. (Photo Illustration by Budrul Chukrut/SOPA Images/LightRocket via Getty Images)  It is the beginning of a new year and the artificial intelligence buzz is building. The hype is real. This is a big opportunity for investors in the right businesses. Microsoft\nMSFT\n product managers announced Last week that another premium Copilot experience is rolling out. The expansion is a tell. Demand for AI is stronger than anticipated. Investors should continue to accumulate Microsoft shares. To be clear, the new AI experience, Microsoft Copilot Pro is not Microsoft Copilot 365. This is confusing, I understand. Unfortunately, large technology companies are not great with nomenclature. Don’t get things twisted, though. This business is going to be huge. Microsoft Copilot 365 is an enterprise AI that is embedded within the cloud-based 365 productivity suite. This AI tool is especially powerful because Copliot considers context for the logged in account holder. This means the AI assistant has access to read emails, summarize content, and generate responses based on content. Copilot can even build spreadsheets and power point presentations based on context. It is a powerful productivity tool with a dramatic return on investment. More importantly, all of the data is protected inside the enterprise silo. This is vital to corporate customers who are increasingly worried about cybersecurity and data protection. Copilot is a home run for enterprises.The benefit to Microsoft should not be ignored. Copilot 365 creates another moat, a distinct advantage over competitors. Copilot 365 increases the costs of switching away from Microsoft enterprise services, including Azure, the firm’s fast-growing cloud computing platform. Analysts were stunned in July 2023 when executives at Microsoft launched Copilot 365. At $30 monthly per license the fee seemed excessive. Microsoft generated $63.4 million in 2022 from 365 licenses, based on 345 million paid seats. Based on the pricing, researchers at Jefferies and Bank of America\nBAC\n immediately raised the price target for share. And Karl Keirstead, an analyst at UBS said Copilot fees could add up to $4 billion in annual sales by 2025, according to a report at Yahoo Finance. Copilot Pro brings many of the Copilot 365 capabilities to non-corporate users for $20 per month per seat. The official Microsoft blog notes that subscribers will be able to create custom Copilot assistants to write emails, help code, design, and perform research, among other tasks. Although the Pro version will not be contextually aware, subscribers will have the option to export data to their connected Microsoft products, such as Outlook, Word, and PowerPoint. iOS and Android smartphones will also get Copilot via dedicated mobile applications. Small businesses have been clamoring for these features and general Copilot availability. Until now Copilot subscriptions were restricted to corporations willing to pony up a minimum license of 300 seats. This Copilot envy from small businesses has been amplified by stories of fantastic increases in productivity at real businesses. The London Times reported last May that Octopus Energy, a U.K. firm, used a trial version of Copilot to write generative emails to customers. Satisfaction increased from 65% to 85%, while saving the company millions in human labor costs. Increased productivity is the big selling feature for Copilot. It is not hard to imagine smaller companies rolling out Copilot to salespeople, analysts, software developers, and executives. Saving even one hour per month, the cost of a subscription, could lead to a dramatic return on investment. Deployed correctly, Copilot could significantly impact the bottom line of a corporation. The buzz for investors is even more important. They are currently skeptical about AI. Many feel it is overhyped, and will not catch-on with enterprises. This is unlikely. Microsoft executives had a pilot program long before the official launch. They consulted with enterprises regarding pricing and availability. When executives at the Redmond, Wash.-based company report earnings on January 23 they should announce that Copilot sales exceeded forecasts. Buzz is important. What investors believe about the future drives share prices. At $388.47 Microsoft shares trade at 30 times forward earnings and 13.2 times sales. These metrics are at the higher end of the historical range; however, this is the beginning of a major new business at Microsoft. It’s a revenue stream with extremely strong competitive advantages. Investors should buy Microsoft shares into any pullback to the $370 level, the rising 50-day moving average. Want to read more about lesser-known tech companies making millions for investors? Sign up for our FREE weekly newsletter here. We call it Foresight Friday because your future self will have loved your current foresight for signing up... Seriously... Members invested in Nvidia in 2014. Do not delay, sign up today!  "
}