{
    "title": "Satya Nadella, from computer-science student to CEO of $3T Microsoft",
    "date": "1/28/2024",
    "url": "https://www.businessinsider.com/satya-nadella-life-career-microsoft-ceo-computer-science-2024-1",
    "text": "When Satya Nadella took over as Microsoft CEO on February 4, 2014, the company was struggling. Windows 8 had been a disaster. Microsoft employees were constantly battling behind the scenes for supremacy. And all the while, consumers and developers alike were losing faith in the company cofounded by Bill Gates. How times have changed. In January, as 56-year-old Nadella neared a decade in charge, Microsoft overtook Apple to become the world's most valuable public company and is now worth about $3 trillion. It's a resurgence that's been credited to his savvy embrace of partnerships, dedication to innovation, and considered leadership style. Here's how Nadella worked his way up the ranks of Microsoft and executed this startling turnaround. This article has been updated since its original publication in 2016. Satya Narayana Nadella was born in Hyderabad, India in 1967. His father was a civil servant and his mother was a professor of the ancient language Sanskrit. From a young age, Nadella wanted to be a professional cricket player, and played in school. However he realized that his athletic talent was outmatched by his passion for science and technology. He's credited his parents for giving him the confidence to become his own person. Nadella received his bachelor's degree in electrical engineering from the Manipal Institute of Technology in 1988. \"I always knew I wanted to build things,\" he once said. The institution didn't have a comprehensive computer-science program, so he traveled to the US to attend University of Wisconsin-Milwaukee and graduated in 1990. He followed that with an MBA from the University of Chicago. Nadella remained in the US and got a job on the technology team at Sun Microsystems, then one of the most innovative tech companies. But in 1992 he joined Microsoft, where cofounder Bill Gates was still CEO and Windows had just begun its march to world domination. \"I remember distinctly walking into building 22 at Microsoft in 1992 thinking that's the greatest job on earth I have and I don't need anything more,\" he said in an interview with LinkedIn CEO Ryan Roslansky. Nadella's first projects included Microsoft's ill-fated interactive TV product and the Windows NT operating system. A baby-faced Nadella also helped pitch Microsoft's Visual Basic in a telethon-style broadcast designed for developers, circa 1993. At the time, Nadella was one of a small number of Indian immigrants working at Microsoft. Although he held a green card, his wife, Anu, was still living in India. When her visa application was rejected, Nadella gave up his permanent resident status and took an H-1B visa in 1994, allowing him to bring his wife to the US. He's since been a dual citizen. The unconventional immigration move did not go unnoticed by his colleagues. \"What I didn't expect was the instant notoriety around campus,\" Nadella wrote in his 2017 book \"Hit Refresh\". \"'Hey, there goes the guy who gave up his green card.'\" During his first years at Microsoft, Nadella impressed his coworkers and managers alike by commuting every weekend from Microsoft's Redmond, Washington campus to Chicago to finish his MBA. He'd finally graduated in 1997. His inquisitiveness and passion for innovation soon saw him rise within Microsoft. By 1999, Nadella landed his first executive role as vice-president of the newly created Microsoft bCentral, a set of web services for small businesses that included website hosting and email.  In 2000, Microsoft got its second CEO: Steve Ballmer. One year later, Nadella was promoted to corporate VP of Microsoft Business Solutions. The group had been formed through a series of acquisitions, including Great Plains, which made accounting software for small and midsize businesses. The team was also building a cloud-based CRM system to compete with Salesforce. Eventually, all these products would be rebranded as \"Dynamics.\" By 2007, Nadella had taken another step up the ladder. He was made senior VP of Microsoft Online Services, putting him in command of the Bing search engine, as well as early online versions of Microsoft Office and the Xbox Live gaming service. In February 2011, Nadella was promoted to president of the Server and Tools division. It encompassed cash-cow products for data centers such as Windows Server and the SQL Server databases. But it was also home to one of CEO Steve Ballmer's boldest gambles, the Microsoft Azure cloud platform. When Nadella took over the server and tools business, it produced $16.6 billion in revenues. By 2013, that was up to $20.3 billion. At this point, Microsoft was running into trouble. On the PC side, Windows 8 was a disaster, the iPhone and Android were outrunning Windows phones by leaps and bounds, and Bing just couldn't make a dent in Google's search dominance. The company was facing an antitrust suit from the European Union and its stock price kept dropping.  In August 2013, an embattled Ballmer announced his departure, sparking a search for a new CEO. The search committee included Ballmer and Gates. In February 2014, after much rumor and speculation, Nadella was announced as CEO, with the support of Ballmer and Gates. He was awarded an $84 million first-year compensation package. Nadella quickly won over employees by making big changes, quickly, in an effort to right the ship and win back customers. He sent a company-wide email when he took over, calling for Microsoft to \"prioritize innovation that is centered on our core value of empowering users and organizations.\" He ended the message with an Oscar Wilde quote: \"We need to believe in the impossible and remove the improbable.\" Change was coming to Microsoft. Nadella proved he wasn't afraid to shake things up and invigorate the company by embracing partnerships with rivals including Apple, Google, and Amazon. He started by adopting the rival Linux operating system for the Azure cloud – a once-unthinkable move. But soon Nadella had overseen the release of Microsoft Office for the Apple iPad; spent $2.5 billion buying Mojang, the studio behind the hit game Minecraft; and released first-class iPhone and Android apps including Outlook. Innovation also led to the development of HoloLens, Microsoft's super-futuristic holographic goggles, and its first laptop, the Surface Book. When something didn't work he was unafraid to ditch projects, such as skipping Windows 9 to go straight to the superior Windows 10. Nadella's approach to leadership was credited with reforming the company's culture and has said he tries to create energy among employees. Many workers are fond of his leadership style, which emphasizes learning and making mistakes as a hedge against overconfidence and arrogance. \"It doesn't matter if you're a top executive or a first-line seller — he has exactly the same quality of listening,\" Microsoft executive vice-president Jean-Philippe Courtois has said. Nadella, 56, and his wife, Anu, have had three children and live in Bellevue, Lake Washington. Their oldest son, Zain, was born with severe cerebral palsy and required specialized care. He died in 2022, aged 26. \"Becoming a father of a son with special needs was the turning point in my life that has shaped who I am today,\" Nadella wrote in a 2017 essay on LinkedIn. He called Zain \"the joy of our family, whose strength and warmth both inspire and motivate me to keep pushing the boundaries of what technology can do.\" Nadella has said the experience has encouraged him to lead with empathy, telling Good Housekeeping \"it has had a profound impact on how I think, lead and relate to people.\" Nadella's philosophy is about partnering and ensuring Microsoft software and services are available wherever customers are — even if that's not Windows. In fact, in 2015, Nadella used an iPhone on stage at an event to show off his favorite Microsoft apps. His predecessor Steve Ballmer, famously pretended to stomp on one at a company meeting. That's also why his first big hire was former Qualcomm exec Peggy Johnson to be VP of business development. She left to become CEO of Magic Leap in 2020. Under Nadella Microsoft has made some of its biggest acquisitions, including the $26 billion purchase of LinkedIn in 2016, the $7.5 billion acquisition of code-sharing site GitHub in 2018, and the $69 billion deal with video games publisher Activision Blizzard in 2023. Nadella has said he has two main criteria when eyeing acquisitions: what value Microsoft can add and how much financial sense it makes. Nadella's biggest move in recent years has been investing $10 billion in OpenAI. During the week of leadership chaos at OpenAI, Nadella stuck firm to ousted CEO Sam Altman, offering him a job at Microsoft. This provided crucial leverage for Altman to reclaim his position, while cementing Microsoft as an essential partner for the pioneering AI company. In his post on X announcing his return, Altman highlighted \"Satya's support\" and said he looked forward to \"building on our strong partnership\" with Microsoft. In investors' eyes, Microsoft is now well-positioned to continue its dominance in the AI revolution. Microsoft is also making its own mark with a generative \"AI companion\" called Copilot to be integrated into its suite of apps. It's a bet on a future in which every person and organization has their own personal AI agent to handle mundane tasks. Gaming is the company's other focus. A leak in September revealed it hopes to build a hybrid cloud gaming platform. Vodafone and Microsoft have also recently announced a $1.5 billion 10-year partnership to bring gen AI, digital and cloud services to European and African markets. Nadella's been busy. And investors love it: From 2014 to 2015, his first year, Microsoft stock jumped 14%. But over the past decade it's soared by 1,006%, and revenue was up 13% on the year to September 2023. That growth is expected to continue in 2024. Microsoft started the year by knocking Apple off the top spot to become the world's most valuable public company and becoming only the  second to exceed a $3 trillion valuation.  Nadella has largely avoided controversy, notwithstanding a couple of slip-ups over the years. In 2014, he said women should rely on \"good karma\" to get raises and trust that the system will eventually reward their work. He later told staff in an email he'd \"answered that question completely wrong.\" Nadella's also spoken out against improper relationships between executives and employees, saying in 2021 that \"the power dynamic in the workplace is not something that can be abused in any form.\"  Nadella wakes up at 7 a.m. and starts the day by thinking of one thing he's grateful for, he told Balance the Grind. He then does 15 minutes of stretching and a 30-minute run no matter where he is or how little sleep he's had. He leaves work at the office, walking out the door about 5 p.m. and spends the rest of the day with his family. Nadella's also encouraged workers not to answer emails on weekends. \"I want to be engaged in conversations and do deep work, rather than over-scheduling and adding more burden to feel like I'm productive,\" he told Men's Journal. In 2022, Nadella took home just under $48.5 million, with $2.5 million from salary and almost $40 million in stock. At one point Nadella owned more than 1.5 million shares in Microsoft but, ahead of Washington state's introduction of a higher rate of capital gains tax in 2022, he sold almost half his stake for around $285 million, according to SEC filings. That left him with about 830,000 shares in the company, worth about $335 million. Comparatively, founder Bill Gates has more than 100 million shares. Nadella also serves on the board of trustees to his alma mater, the University of Chicago, as well as the Starbucks board. Nadella's biggest tip for success? \"Don't wait for your next job to do your best work,\" he told LinkedIn CEO Ryan Roslansky in an interview last year. January 31, 2024: This story was updated to clarify that the specific figures associated with Microsoft's investment in OpenAI haven't been officially confirmed. Read next Jump to "
}