{
    "title": "Business Tech Roundup: What To Know About Microsoft Office CoPilot Pro",
    "date": "1/21/2024",
    "url": "https://www.forbes.com/sites/quickerbettertech/2024/01/21/business-tech-roundup-what-to-know-about-microsoft-office-copilot-pro/",
    "text": "UKRAINE - 2023/12/29: In this photo illustration, Microsoft Copilot AI logo is seen on a smartphone ... [+] screen. (Photo Illustration by Pavlo Gonchar/SOPA Images/LightRocket via Getty Images) Here are five things in tech that happened this week and how they affect your business. Did you miss them? 1 – Microsoft’s new CoPilot Pro brings AI-powered office features to the rest of us. On Monday Microsoft announced their CoPilot Pro premium service for $20 dollars per month. The subscription fee gives users access to features including Microsoft 365 apps – Excel, PowerPoint, Microsoft Teams – with “priority access” to GPT-4. As stated on the Microsoft Blog, it will also be available on iOS and Android. For those who already use Microsoft 365, CoPilot Pro will activate CoPilot in all apps, offering AI-powered capabilities for each. (Source: The Verge) Why this is important for your business: CoPilot Pro will help your employees draft better emails, write better documents, create better presentations and take better notes – among other things – which will all combine to making them more productive. My recommendation, if your company uses Office 365, is to lean into this. Start with a small group and expand its use. Get training and consultation. But take advantage of these tools as they’ll significantly help your people get more things done quickly. 2 – ChatGPT will have video functionality and more accuracy in future versions – Sam Altman says ChatGPT-5 will be a big improvement. An improved version of ChatGPT was the topic of conversation on the Unconfuse Me podcast where Sam Altman shared with Bill Gates what users can expect with GPT-5. Altman detailed that issues with accuracy and query commands are being worked on. Images and video will also receive noticeable enhancements. In the 10 months since GPT-4 was launched, numerous accuracy issues were reported and many users voiced frustrations. Altman also touched on what’s known as “hallucinations,” meaning instances where the chatbot produces irrelevant data. Now – ahead of GPT-5’s official launch yet to be announced – OpenAI is getting ahead of the glitches by promoting a much-improved product. (Source: Tom’s Guide) Why this is important for your business: Microsoft is a significant partner to OpenAI (a Microsoft spokesperson says while details of the agreement between Microsoft and Open AI remain confidential, it is important to note that Microsoft does not own any portion of OpenAI and is simply entitled to share of profit distributions) so Office users can expect to benefit from any new features in the highly anticipated GPT-5. 3 – Mastercard is developing AI-powered tool for small business mentorship. Mastercard is planning to launch Mastercard Small Business AI – a tool to help entrepreneurs and small businesses “adapt, keep pace, and thrive” in the evolving landscape of technology and consumer demands. In partnership with Create Labs, the AI will contain key data while also offering a “conversational experience” on various business-related questions.. (Source: ASBN) Why this is important for your business: I’m still a little unclear on what this service will actually do for small businesses, but hoping its generative AI functionality will provide us with a better way for getting financing and cash flow guidance. The launch is still a few months away so I’m assuming we’ll get more clarity as the time approaches. 4 – Email automation from GoDaddy offers custom emails to deliver the right message at the right time. Continuing with their mission to empower entrepreneurs, GoDaddy has launched email automation to lighten the load of email marketing. Available for new and existing users at no extra cost, the feature is listed on GoDaddy’s product page. (Source: CRN India) Why this is important for your business: Included are templates – welcome messages, appointment reminders – and personalized emails that users can draft for specific recipients then schedule them to be sent at a chosen date and time. Templates can be tailored with color schemes/graphics that reflect the users’ company or brand. For GoDaddy customers using email this is definitely a good tool to try. 5 – Before you buy a Windows 11 ‘AI PC’ in 2024, read this. Chris Hoffman of Computer World recommends taking a pause if you’re in the market for the Windows 11 “AI PC.” Promoted as a major boost in laptop performance, AI PCs were also on display at last week’s CES 2024 event. For more, visit the link. (Source: Computerworld) Why this is important for your business: As Hoffman points out, we as consumers should “cut through the hype” and take a closer look. First, the AI-powered performance isn’t occurring on the device itself, Hoffman says. That process occurs on an external “data center” your laptop communicates with. Technology is working toward a self-operating AI laptop, which requires NPUs (neural processing unit) and “soon” every PC will have one. Hoffman concludes the better option would be to get a laptop with a powerful GPU (graphics processing unit).  "
}