{
    "title": "Microsoft reveals Dynamics 365 and Power Platform 2024 Release Wave 1 Plans",
    "date": "1/26/2024",
    "url": "https://msdynamicsworld.com/story/microsoft-reveals-dynamics-365-and-power-platform-2024-release-wave-1-plans",
    "text": "Joining MSDynamicsWorld.com gives you free, unlimited access to news, analysis, white papers, case studies, product brochures, and more. You can also receive periodic email newsletters with the latest relevant articles and content updates. \n\n              Learn more about us here The next release wave for Dynamics 365 and Power Platform spans April to September 2024 and will span a range of foundational and forward-looking features. Copilot remains nearly omnipresent, with Microsoft refining existing generative AI features and adding new ones across the product line. “This release reinforces our dedication to developing applications and experiences that contribute value to roles by dismantling barriers between data, insights, and individuals,” wrote Microsoft CVP and Business Applications and Platform COO Mo Osborne. A range of early access features across Dynamics 365 apps will be reaching general availability in April 2024. For example: While this release wave continues Microsoft’s heavy focus on AI and the expansion of Copilot-related features, Osborne noted differences across apps and services. Updates to D365 Finance include “AI powered experiences, easing setup of financial dimension defaulting with AI rules guidance, increasing automation in bank reconciliation, netting, expanding country coverage, tax automation, and scalability.” And, she wrote, the Business Central team “is focused on Copilot-driven capabilities to streamline and enhance productivity through enhanced reporting and data analysis capabilities, elevated project and financial management, and simplified workflow automation.” By contrast, in D365 Project Operations “the spotlight is on core functionality improvements.” Joining MSDynamicsWorld.com gives you free, unlimited access to news, analysis, white papers, case studies, product brochures, and more. You can also receive periodic email newsletters with the latest relevant articles and content updates. \n              Learn more about us here As the editor of MSDynamicsWorld.com, Jason oversees all editorial content on the site and at our events, as well as providing site management and strategy. He can be reached at jgumpert@msdynamicsworld.com. Prior to co-founding MSDynamicsWorld.com, Jason was a Principal Software Consultant at Parametric Technology Corporation (PTC), where he implemented solutions, trained customers, managed software development, and spent some time in the pre-sales engineering organization. He has also held consulting positions at CSC Consulting and Monitor Group. 100% free membership "
}