{
    "title": "Microsoft surpasses Apple to become world's most valuable company",
    "date": "1/13/2024",
    "url": "https://www.republicworld.com/business/industry/microsoft-surpasses-apple-to-become-of-world-s-most-valuable-company/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated January 13th, 2024 at 11:42 IST Microsoft's incorporation of OpenAI's technology into its suite of productivity software has contributed to a rebound in its cloud-computing business. Microsoft versus Apple: Microsoft has emerged as the world's most valuable company, surpassing Apple in terms of stock market value. The milestone was achieved as Apple faced concerns about demand, leading to a 0.2 per cent increase in its stock on Friday, while Microsoft saw a 1 per cent gain. As a result, Microsoft's market capitalisation reached $2.887 trillion, its highest ever, according to data from LSEG, outpacing Apple's market capitalisation of $2.875 trillion. Worries about smartphone demand have impacted Apple, causing its shares to decline by 3 per cent in 2024, following a 48 per cent surge in the previous year. In contrast, Microsoft has seen a 3 per cent uptick year-to-date, building on a remarkable 57 per cent surge in 2023, driven in part by its leadership in generative artificial intelligence through an investment in ChatGPT-maker OpenAI. Microsoft's incorporation of OpenAI's technology into its suite of productivity software has contributed to a rebound in its cloud-computing business, particularly in the July-September quarter. The company's AI advancements have positioned it to challenge Google's dominance in web search. Conversely, Apple has faced challenges in meeting demand, particularly for its flagship product, the iPhone, amid economic recovery challenges in China and increasing competition from Huawei. Sales of Apple's Vision Pro mixed-reality headset are set to begin on February 2 in the United States, marking a significant product launch for the company. While Microsoft has briefly taken the lead over Apple in market valuation a few times since 2018, the recent shift highlights the ongoing competition between the two tech giants. Both companies, however, face scrutiny for relatively high valuations compared to their expected earnings. Apple is trading at a forward PE of 28, well above its 10-year average of 19, while Microsoft's forward earnings are trading around 32 times, exceeding its 10-year average of 24. As Apple gears up to report its results on February 1, analysts expect a 0.7 per cent revenue increase to $117.9 billion for the December quarter, marking its first year-on-year revenue growth in four quarters. On the other hand, Microsoft, reporting in the coming weeks, is anticipated to reveal a 16 per cent revenue increase to $61.1 billion, driven by sustained growth in its cloud business. (With Reuters inputs.)  Published January 13th, 2024 at 11:32 IST Send us your views, we’ll publish them. This section is moderated. Viral: 5-ft Alligator Discovered Inside The Stomach Of An 18-Foot Python A Terrorist is a Terrorist in Any Language: EAM Jaishankar in Singapore RSP Chief Mahadev Jankar Pledges Support to BJP-Led Mahayuti AP Assembly Polls: Pawan Kalyan's Janasena Announces 11 More Candidates BJP Declares Six More Candidates; All Names Out for LS Seats in Gujarat BJP Fields State Chief Surendran Against Rahul Gandhi in Wayanad BJP Fields Sandeshkhali Victim Rekha Patra Against Shahjahan's Aide Delhi Crime: 4-Year-Old Girl Raped, Police Releases Statement BJP Drops Varun Gandhi in 5th List: Know Who Will Contest from Pilibhit Drew Barrymore Admits Feeling 'Shame' Around Her Divorce © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}