{
    "title": "Microsoft Earnings Preview: Can the growth of its cloud business help \nMicrosoft maintain its position as the world's ...",
    "date": "1/23/2024",
    "url": "https://www.cmcmarkets.com/en-au/analysis/microsoft-earnings",
    "text": " Trade on the go Download our apps CFD app Share Trading app Trade the way that suits you Invest in Shares Invest in over 35,000 domestic and international shares and ETFs from 15 global markets. Plus a wide range of domestic products including Options, mFunds, warrants and more. Trade CFDs Trade contracts for difference (CFDs) on over 12,000+ products including FX Pairs, Indices, Commodities, Shares, Cryptocurrencies, and Treasuries.  Written by Zhujun Li Market Analyst 23 Jan 2024, 17:00 Share this Microsoft's AI Model ChatGPT, backed by OpenAI, has seen Microsoft gradually become a leading company in the field of artificial intelligence, resulting in a 58.7% increase in its stock price in 2023. In the third quarter of the 2024 fiscal year, as reported in the October earnings release, revenue increased by 13% to $565.2 billion, with a net profit growth of 27% to $22.29 billion. Notably, Intelligent Cloud revenue showed strong performance, growing 19% to $24.3 billion, accounting for 43% of the overall revenue. Azure and other cloud services revenue increased by 28% (calculated at a fixed exchange rate). Microsoft is set to release its financial performance for the second quarter of the 2024 fiscal year after the U.S. market closes on January 30, 2024. According to Zacks consensus estimates, revenue is expected to be $610.3 billion, a 15.7% year-over-year increase, with an expected earnings per share of $2.76, an 18.5% year-over-year growth. Microsoft's management anticipates Azure's growth to reach 26% to 27% in the second quarter. The company continued its upward trajectory in January 2024, surpassing Apple to become the world's most valuable company with a market capitalization close to $2.9 trillion. This reflects investor confidence in the future development of the artificial intelligence field. Recently, Microsoft announced the launch of Copilot Pro for the M365 Family and Personal edition, priced at $20 per month. This means individual users can now access the latest OpenAI models. Additionally, Copilot for the enterprise has eliminated the minimum purchase requirement for corporate users, indicating potential growth in small and medium-sized enterprise customers. The potential growth of M365 users and Azure services in 2024 may propel Microsoft's market capitalization beyond $3 trillion, making it a matter of time. Microsoft's leadership in the AI field may secure its position as the global market leader. Meanwhile, its competitor Apple faces challenges with declining iPhone 15 sales and sluggish adoption of Vision Pro. Currently, it seems Apple may need to find new growth points to support its stock price, but due to its relatively subdued noise in the AI field, a turnaround could be difficult to foresee, leading to some rating downgrades by investment banks. Currently, Microsoft's P/E ratio has reached 37 times, higher than the five-year average of 30 times and the ten-year average of 24 times. In the short term, the high P/E ratio reflects optimistic expectations of investors for the future. However, some potential risks are being overlooked, including:   Latest from CMC The 2024 Bitcoin halving explained: Critical factors for investors This analysis will break down the underlying mechanics of the halving, explain how it can impact Bitcoin's price, and review key considerations for the upcoming April 2024 halving. 14 Mar 2024 Navigating temptation: Strategies to avoid going short too early AI and Semiconductor boom: A look at AMD and ARM's Trajectory Nvidia: Amazon down, Alphabet next? Related articles The 2024 Bitcoin halving explained: Critical factors for investors This analysis will break down the underlying mechanics of the halving, explain how it can impact Bitcoin's price, and review key considerations for the upcoming April 2024 halving. 14 Mar 2024 Navigating temptation: Strategies to avoid going short too early As many markets hover around all-time highs, investors are increasingly opting for short positions. This timely analysis addresses risk management and pitfalls to avoid during this period, with a focus on leveraging divergences as a valuable trading signal. 27 Feb 2024 AI and Semiconductor boom: A look at AMD and ARM's Trajectory This analysis examines the technical trends, price drivers, and future trajectory for these stocks. 21 Feb 2024 Nvidia: Amazon down, Alphabet next? NVIDIA is vying for the top spot among tech giants like Amazon and Alphabet, but what are the current dynamics shaping this competition? 18 Feb 2024 Aus 1300 303 888 CFD lines open 24hrs, Monday morning–Saturday morning Share Trading lines open 7.30am – 7.00pm (Sydney time), Monday–Friday Contact Download our app Get greater control and flexibility for peak performance trading when you're on the go. CFD app Share Trading app Investing in CMC Markets derivative products carries significant risks and is not suitable for all investors. You do not own, or have any interest in, the underlying assets. We recommend that you seek independent advice and ensure you fully understand the risks involved before trading. Spreads may widen dependent on liquidity and market volatility. The information on this website is prepared without considering your objectives, financial situation or needs. Consequently, you should consider the information in light of your objectives, financial situation and needs. CMC Markets Asia Pacific Pty Ltd ABN 11 100 058 213, AFSL No. 238054 (the derivative product issuer), CMC Markets Stockbroking Limited, Participant of the ASX Group (Australian Securities Exchange) and SSX (Sydney Stock Exchange) and Cboe (previously known as Chi-X), ABN 69 081 002 851, AFSL No. 246381 (the stockbroking services provider) provides the financial products and/or services. It's important for you to consider the relevant Product Disclosure Statement ('PDS') or Information Memorandum (for CMC Pro accounts) and any other relevant CMC Markets Documents before you decide whether or not to acquire any of the financial products. Please also refer to our Financial Services Guide and Information Memorandum (for CMC Pro accounts) containing details of our fees and charges and our Target Market Determinations for our CFD products and Exchange Traded Options which include a description of who our financial products are suitable for. All of these documents are available at cmcmarkets.com.au or you can call us on 1300 303 888. Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. Android is a trademark of Google Inc. © 2024 CMC Markets Welcome to CMC Markets Support! To begin, please select the product your query is related to. "
}