{
    "title": "EU checking if Microsoft’s OpenAI investment falls under merger rules",
    "date": "1/9/2024",
    "url": "https://techcrunch.com/2024/01/09/openai-microsoft-eu-merger-rules/",
    "text": "The European Union is checking whether Microsoft’s investment in generative AI giant OpenAI is reviewable under the bloc’s merger regulations, it said today. The development comes in the wake of the turmoil at OpenAI in late November when the then board voted to oust founder and CEO Sam Altman — a shock move that triggered an aggressive counter maneuver by OpenAI investor Microsoft, which stepped in to say it was hiring Altman. The tech giant also extended an offer to any other OpenAI staffers who wanted to jump ship during the leadership upheaval. The episode ended with the return of Altman to lead OpenAI and a new board being appointed — a configuration that saw the departure of number of members who had voted to remove him. Notably, Microsoft also gained representation on the board for the first time in the form of a non-voting board observer. The development, along with the tech giant’s ongoing stake in OpenAI — where Microsoft is a major investor, owning 49% of the for-profit OpenAI entity that a nonprofit to which the board belongs controls — appears to have stirred competition regulators’ interest in the arrangement. Last month the U.K.’s competition authority launched an inquiry to decide whether the pair of tech giants are in a “relevant merger situation.” Its invitation to comment closed on January 3 — but the scrutiny procedure remains ongoing. Germany’s Federal Cartel Office (FCO), meanwhile, has also looked at the connection between the pair. Last fall, just a couple of weeks before Altman’s shock ouster/swift return, the FCO concluded the “cooperation” between OpenAI and Microsoft was not “currently” subject to merger control. But it also warned then: “If Microsoft were to increase its influence on OpenAI in the future, it would have to be re-examined whether a notification obligation exists under competition law.” The Commission’s announcement today that it’s putting an eye on the arrangement coincides with it making two calls for contributions on competition — one focused on generative AI the other on virtual worlds — so it’s looking to build up its knowledge of the goings-on in these cutting-edge markets. The EU said it’s inviting views from interested stakeholders “on the level of competition in the context of virtual worlds and generative AI, and their insights on how competition law can help ensure that these new markets remain competitive.” The deadline for contributions is March 11. “The European Commission will carefully review all input received through the calls for contributions. Following that review, the Commission may organise a workshop in the second quarter of 2024 to bring together all different perspectives emerging from the contributions and continue this reflection,” it wrote. The Commission also said it’s “looking into some of the agreements that have been concluded between large digital market players and generative AI developers and providers,” saying it’s “investigating the impact of these partnerships on market dynamics.” “Finally, the European Commission is checking whether Microsoft’s investment in OpenAI might be reviewable under the EU Merger Regulation,” it added. Commenting in a statement, EU competition chief Margrethe Vestager said: Virtual worlds and generative AI are rapidly developing. It is fundamental that these new markets stay competitive, and that nothing stands in the way of businesses growing and providing the best and most innovative products to consumers. We are inviting businesses and experts to tell us about any competition issues that they may perceive in these industries, whilst also closely monitoring AI partnerships to ensure they do not unduly distort market dynamics. A spokesperson for the Commission declined to confirm which “large digital players” have been sent requests for information regarding the generative AI market. They also told us there are no “particular concerns” the EU has identified yet vis-à-vis competition and generative AI as yet. “It is essential for us to gather information and develop a thorough understanding of these markets as soon as possible. There are no particular concerns identified for the moment, we will need to analyse the input received,” they noted. Per the spokesperson, a transaction would be notifiable to the Commission under the EU Merger Regulation if it involves ” a change of control on a lasting basis.” Were that to happen, the Commission would be empowered to examine whether the notified transaction negatively impacts competition — with the ability to impose far-reaching remedies to tackle any problems they identify. Even, potentially, ordering a tie-up to be undone (as happened, for instance, in the case of the U.K.’s CMA and Facebook-Giphy back in 2021) — although it’s fair to say the EU’s competition unit under Vestager has, historically, been reluctant to block tech tie-ups outright, preferring behavioral remedies to address concerns. “While this transaction has not been formally notified, the Commission has been following very closely the situation of control over OpenAI, including Microsoft’s role on the OpenAI board and the investment agreements between Microsoft and OpenAI,” the Commission spokesperson added — declining to speculate on any possible next steps. Microsoft and OpenAI were contacted for a response to the EU’s announcement. Update: A Microsoft spokesperson sent this statement via email: Since 2019, we’ve forged a partnership with OpenAI that has fostered more AI innovation and competition, while preserving independence for both companies. The only thing that has changed recently is that Microsoft will now have a non-voting observer on OpenAI’s Board. While the bloc recently rebooted its approach to digital competition, with an ex ante reform called the Digital Markets Act (DMA) that’s targeted at so-called internet gatekeepers, the flagship new regulation risks looking outdated before the compliance deadline has even kicked in for the six tech giants it applies to. This is because the DMA’s list of gatekeeper “dos and don’ts” is drawn from the EU’s past experience with Big Tech competition cases — lending the whole approach a rigid, retrospective feel. And while Microsoft has been designated a gatekeeper under the DMA for its Windows OS (aka, its “core platform service”), not for its cloud infrastructure, it’s the latter that the tech giant is leveraging to gain a strategic competitive edge in the fast unfolding generative AI market via its cozy partnership with OpenAI. It’s not clear whether the DMA, which gatekeepers are expected to be in compliance with by early March, can do much to rein in the power of hyperscalers like Microsoft to use their vast muscle in cloud infrastructure to own the keys to dominance in the generative AI era. However, traditional merger regulations could prove a powerful regulatory check on tech giant overreach here — assuming competition authorities are able to use them. That said, carefully structured deals and cooperations between tech giants and AI startups are likely to have been designed to avoid this lever being pulled and it remains to be seen whether the EU will deem it has powers under merger laws to step in and scrutinize the detail of the commercial love-in between Microsoft and OpenAI. As noted above, the FCO previously found national merger rules did not apply. Though the German authority made a point of noting that any deepening of the relationship between the pair would merit a review of its decision not to act. (And, well, a lot has gone down at OpenAI since the FCO’s assessment last year.) Digital rights and pro-competition groups are among those pushing for competition regulators not to sit on their hands this time. In a submission to the U.K.’s competition authority made public today — which urges the regulator to investigate Microsoft’s investment in the AI giant — the Irish Council for Civil Liberties, the Open Markets Institute, Foxglove, Balanced Economy Project, Rebalance Now, Article 19 and the Mozilla Foundation warn: “Weak antitrust enforcement has helped create a world in which a handful of dominant technology firms control most of the world’s digital technologies and markets — the bedrock of the modern economy. These gatekeepers are now leveraging their unparalleled access to computing infrastructure, data and expertise to shape the development and commercialisation of AI — including driving the narrative that ever-larger models and ever-greater scale are inevitable.” “In a fairer and more open digital economy, AI development would be pluralistic, decentralised, competitive, and more responsive to the needs of consumers, businesses, governments and citizens. Firms such as OpenAI or Anthropic might, in time, have threatened giants like Amazon, Google and Microsoft. Unfortunately, this is not the path we are on,” they also write, arguing: “Only by acting early and aggressively against anti-competitive behaviour in AI can regulators prevent this oligopolistic control from being extended further.” Microsoft and OpenAI tie-up faces ‘relevant merger’ scrutiny by UK regulator CMA  Don’t expect competition authorities to wade into the Microsoft-OpenAI power-play — yet  "
}