{
    "title": "Unpacking how Microsoft Moved its SAP Workload to the Cloud",
    "date": "1/8/2024",
    "url": "https://www.microsoft.com/insidetrack/blog/hello-azure-unpacking-microsoft-moved-sap-workload-cloud/",
    "text": "How Microsoft does IT Jan 8, 2024\t\t\t\t\t  |  Lukas Velush [Editor’s note: This story on how Microsoft moved its SAP workload to the cloud has been updated with new details and updated terminology. A new SAP on Microsoft Azure video has been added below. This content was written to highlight a particular event or moment in time. Although that moment has passed, we’re republishing it here so you can see what our thinking and experience was like at the time.] Microsoft is heavily invested in SAP applications—it uses them extensively to run finance, human resources, global trade, supply chain, and other parts of its $168.1 billion global business. That’s why it was a big deal when Microsoft moved its SAP workload to the cloud and Microsoft Azure. Moving to the cloud saved us money, but this was really about becoming more agile and innovative. —Krassimir Karamfilov, general manager, Microsoft SAP program, Microsoft Digital In early 2018, the company finished moving its entire SAP landscape—an estimated 50 terabytes—to Microsoft Azure. It was at that time, when the last, most important systems were moved over one busy weekend, that the company was able to seize on a new opportunity. “Moving to the cloud saved us money, but this was really about becoming more agile and innovative,” says Krassimir Karamfilov, general manager of the Microsoft SAP program in Microsoft Digital. “This allowed our teams to stop worrying about keeping our infrastructure up and running and to focus on innovating without a lot of heartburn. They can now run experiments, learn, and then use those learnings to take us in new directions—and if an experiment doesn’t work? They can easily shut it down and move on to something else.” Moving from on-premises to Microsoft Azure slashed the Microsoft SAP budget by 20 percent to 25 percent, cost savings that came from fine-tuning usage, snoozing systems at night and on weekends, and by leaving behind old processes that weren’t needed anymore. “We’re 100 percent in the cloud, and since Azure is the trusted cloud provider, our entire SAP landscape is now more secure than ever,” says Karamfilov, explaining that the employees who manage the company’s SAP in many instances were given new tools to work with. “The shift to the cloud enabled us to start using machine learning and artificial intelligence to look at the data underneath our entire landscape, and to start learning from that.” Reutter answers questions about the company’s SAP on Microsoft Azure migration and lessons learned along the way. At the time, the move to the cloud represented how committed Microsoft was and still is to its partnership with SAP, Karamfilov says. Officially and publicly, SAP has adopted a “multi-cloud strategy” where it supports all hyperscale cloud providers to enable customers to use their preferred cloud. Also at the time, SAP announced it had selected Microsoft Azure to run many of its internal mission-critical SAP business systems (since then SAP has moved a lot of those internal systems to the cloud on Microsoft Azure). [Learn how Microsoft uses telemetry and monitoring on its SAP on Microsoft Azure workload. Here’s how Microsoft is examining SAP transactions with Microsoft Azure Anomaly Detector. Find out how Microsoft is optimizing SAP for Microsoft Azure.] Making the move to Azure Looking back at how Microsoft moved its SAP workload to the cloud, the Microsoft SAP team had been thinking about making the move since 2013, but it was only in 2017 that Azure added virtual machine SKUs big enough to handle a Microsoft-sized SAP ERP system, says Hans Reutter, the Microsoft Digital engineering manager who led the cloud migration. “It wasn’t just the size, it was the complexity,” Reutter says, giving the example of several independent enterprise-scale purchasing processes needing to come together seamlessly at the point of purchase so the customer has a good buying experience. “All of these production landscapes were highly dependent on each other because of the traffic that flows back and forth between them.” We started with the low-risk stuff—the low-hanging fruit. First we moved the sandbox systems because we knew that there wouldn’t be any impact on our customers if something went wrong. —Hans Reutter, group engineering manager, Microsoft Digital Microsoft Azure developed the M-Series specifically to address the enterprise market demand for larger virtual machines capable of running SAP landscapes at companies just like Microsoft. “We just happened to be one of the enterprises waiting for the M-Series,” Reutter says. “It was exactly what we needed to make our move to the cloud.” With Azure’s M64 and M128 SKUs in hand, Reutter’s team migrated the company’s largest and most complex SAP systems to Azure over one weekend (the team used smaller virtual machines to move most of the Microsoft landscape over the prior year). To understand how they did it, Reutter says think horizontally and vertically. “We started with the low-risk stuff—the low-hanging fruit,” Reutter says. “First, we moved the sandbox systems because we knew that there wouldn’t be any impact on our customers if something went wrong.” That was the base layer. Next came the next least important layer, and the next, and the next. The team worked up layer by layer until it eventually got to the most important production systems. That was the horizontal approach. “If we missed anything, we found out really quickly—before we got to the really important systems,” Reutter says. The team wrote migration scripts, found landmines, and worked out kinks while working in the base layers, which allowed it to get everything down pat by the time things got serious. Now to the vertical. The team also used an end-to-end vertical strategy, migrating a few systems—from development all the way to production—all at once. “We tested the whole stack to make sure there were no gaps or surprises,” Reutter says. “This vertical strategy allowed the team to accelerate learning and getting a jump on production processes.” By getting it right in both dimensions, they were able to migrate the mission critical systems seamlessly. “It’s one thing to move some small stuff,” Reutter says. “You want to make sure the crown jewels land in a safe spot.” And while the migration wasn’t without bumps, it went smoothly and the crown jewels were kept safe. Getting it right at home Juergen Thomas hears it all the time. If a customer is considering moving his or her SAP systems to Microsoft Azure, they always ask the same question. The ask? “Does Microsoft run its landscape in Azure?” Thomas, a partner architect who manages a team in Microsoft Azure that helps SAP customers move to the cloud, was happy when he could start answering with a resounding “yes,” and even more importantly, that he also then had a good answer to their inevitable second question, which is “how did you do it?” It’s proof that the Microsoft Azure platform can carry and sustain such a complex SAP platform on our Azure infrastructure. We talk about it in customer briefings and conferences—it is our poster child. Running our own backend business processes with SAP in Azure is a main differentiator between us and our competitors who don’t run SAP at all, or not in their own clouds. —Juergen Thomas, partner architect, Microsoft Azure “Then they immediately want to get into the details, which is a good thing,” Thomas says. “It was very important to be able to say that Microsoft is leading again and is ahead of the mass of companies.” Thomas says the story of moving the Microsoft ERP systems to the cloud has become a key showcase for the Microsoft Azure team because it shows Microsoft Azure can handle the biggest and most complicated SAP instances. “It’s proof that the Microsoft Azure platform can carry and sustain such a complex SAP platform on our Azure infrastructure,” he says. “We talk about it in customer briefings and conferences—it is our poster child. Running our own backend business processes with SAP in Azure is a main differentiator between us and our competitors who don’t run SAP at all, or not in their own clouds.”  If you’re getting ready to move your SAP systems to the cloud, here are four quick things to think about to help you get started.  Tags: Microsoft Azure, SAP Mar 22, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tDodd Willingham Microsoft is a big company with thousands of teams working in different ways based on the work they do. Despite that complexity, when our employees go looking for something, they expect an internal search portal that will find exactly what they’re looking for instantly—just like when they search on the internet. Yet when talking to... Mar 21, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Several years into the era of hybrid work, most of us are used to appearing in a Brady Bunch-style gallery. We click or tap an emoji to ask a question or applaud an achievement and still have to remember to not be “on mute” when it’s our turn to talk. Half of workers have gone... Mar 20, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tJoshua Deans Microsoft Digital (MSD) is the organization that powers, protects, and transforms Microsoft. As part of its mission, MSD builds and manages the cloud network infrastructure that supports Microsoft products and services. MyWorkspace is a browser-based cloud-provisioning tool created by MSD to allow Microsoft employees to rapidly deploy Azure-based infrastructure environments for solution testing and development... Mar 20, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush If you’re on a sales team, you know that there are all kinds of distracting tasks that eat away at your time and get in the way of what you do best—building relationships with and solving problems for customers. There’s no doubt that modern salespeople need to rely on too many tools and services to... This content has been archived, and while it was correct at time of publication, it may no longer be accurate or reflect the current situation at Microsoft. Editor’s note: This story has been updated with new details and updated terminology. A new SAP on Microsoft Azure video also has been added below. Microsoft expected that...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more This content has been archived, and while it was correct at time of publication, it may no longer be accurate or reflect the current situation at Microsoft. It’s now much easier for Microsoft to extract important SAP telemetry insights from its business operations data. Microsoft relies on SAP to handle a multitude of business processes,...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more Microsoft has implemented auto-scaling SAP on Microsoft Azure to help its SAP workloads run more efficiently. Why? Like many enterprises, Microsoft runs on SAP. It uses the software to run everything from tracking servers in its supply chain to making sure the company’s 140,000 employees are paid on time. It has one of the largest...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more "
}