{
    "title": "Microsoft and Google are proud AI is helping you (other companies not so \nmuch)",
    "date": "2/18/2024",
    "url": "https://www.zdnet.com/article/microsoft-and-google-are-proud-ai-is-helping-you-other-companies-not-so-much/",
    "text": "Most Popular AI making lives better. You're likely still in some state of recovery after America's great escape. I refer, of course, to a Super Bowl full of eating, drinking, and other related drama. Also: AI will have a big impact on jobs this year. Here's why that could be good news It's worth asking, though, whether you've recovered from discovering just how AI will change your life. Quite a few companies chose the Super Bowl to air their artificially intelligent wares before the maximum possible, suitably vulnerable audience. It was moving, however, how some wanted to say those wares were AI-powered and how some declined the opportunity. Microsoft attempted to inspire you with the sheer possibilities engendered by having an AI assistant. Your Copilot can do so many things for you -- no, not just things you can't be bothered doing, but things that you genuinely believe you can't do at all. The result? Your dreams, entrepreneurial or otherwise, will come true  and you'll become the happiest you imaginable. It was all quite  persuasive and placed AI at the very heart of the company's future. Google, too, showed an exceptionally touching example of AI overtly improving someone's life. Here, the company revealed how, with the new AI-powered Pixel 8, those with blindness or low vision can now frame photographs beautifully, as the phone's AI assistant guides them to the optimum framing. The feature is quite clearly labeled as \"Guided Frame with Google AI.\" In both these cases, the message was similar: \"AI isn't to be feared. It's something that truly improves lives.\" Yet as my eyes became increasingly squinty during the game, I began to notice that not every company wanted to crow overtly about AI and its heady future. Cybersecurity company Crowdstrike, for example. Perhaps you still recall -- though I wouldn't blame you if you didn't -- the Crowdstrike ad that featured an old wild western saloon in a little old wild western town. Some oddly cyberpunkish characters ride into town -- but not on futuristic Trojan horses. These are the so-called adversaries, leaders of the Cyberattack community. A lone young woman is prepared to fight them off. Not with a gun, but with a little bit of Crowdstrike software. But listen to the sell from the voiceover: \"Protecting your business from cyberattacks can be unrelenting. Today's adversaries move fast. Crowdstrike moves faster.\" As the cyberpunkists are routed -- the voiceover continues: \"Crowdstrike. We stop breaches.\" Notice the missing word? Well, you'll find it if or when you get to Crowdstrike's website: \"The world's leading AI-native cybersecurity platform.\" It's interesting, then, that Crowdstrike didn't feel moved to insert the AI-native element into its ad. Also: The 3 biggest risks from generative AI - and how to deal with them Could it be that some companies are still concerned that the overt mention of AI may be offputting for some? Why, a recent Pew study offered this headline: \"Growing public concern about the role of artificial intelligence in daily life.\" And then there was Etsy. This certainly wasn't the first brand I'd associate with Super Bowl advertising. Or, indeed, any advertising. I rather thought of it as the very nice place to go where real people make real things for other real people to buy. Also: This is why AI-powered misinformation is the top global risk Yet here it was in the big game with a curious concoction. It, too, chose a historical scenario to sell a modern problem. In this case, the American people have just received the Statue of Liberty from France. What can we gift the French in return? Why, they have everything, don't they? Well, everything worth eating, drinking, and enjoying. (Oh, except perhaps baseball.) A wise American warrior suggests the president could use Etsy's new Gift Mode. This requires you to prompt the Mode as to what sort of gift you seek. The president, therefore, wonders what the French actually like, and then the whole thing takes a peculiar turn when a young servant suggests \"Cheese.\" So it is that the president uses this fine new Etsy tool to purchase a cheeseboard for the French. You'll likely whisper that a cheeseboard is a fairly mundane offering in return for America's quintessential statue. I, though, will likely whisper that this Gift Mode -- apparently -- uses AI and human input to make suggestions. Also: Generative AI in commerce: 5 ways industries are changing how they do business No mention of AI in the ad, however. Wouldn't one be a touch more fascinated by what an AI-powered suggestion tool might come up with? But no. Etsy chooses merely to say \"Gift Easy with Gift Mode.\" Perhaps you'll tell me I'm splitting hairs. Perhaps I'll tell you I'm bald. But it remains interesting -- to me, at least -- which brands will use the promise of AI to overtly sell their AI-powered items and which will choose to downplay that little detail, focusing simply on the consumer benefit. Or will there come a moment when, if a product or service isn't in some way powered by AI, it simply isn't any good? "
}