{
    "title": "Microsoft and Sarvam are teaming up to dominate the AI market in India.",
    "date": "2/8/2024",
    "url": "https://www.cointribune.com/en/ai-microsoft-partners-with-sarvam-ai-to-establish-itself-in-india/",
    "text": "Home » News » Technology News In recent months, the digital behemoth Microsoft has heavily invested in an attempt to reinvent itself through artificial intelligence (AI). The company founded by Bill Gates continues this trajectory by engaging in a collaboration with Sarvam AI, a startup based in India. The stake is a position in the Asian AI market. Microsoft Azure, the cloud computing platform offered by Microsoft, has concluded a strategic alliance with the Indian startup Sarvam AI. A deal that is immensely strategic for Microsoft. The company aims to strengthen through this its presence in the Asian AI market. The second strategic focus of this collaboration is centered on improving its AI offerings. This involves integrating Sarvam’s Indic voice Large Language Model (LLM) into Microsoft Azure AI infrastructure. To achieve this, the company is relying on the OpenAI services and Machine Learning of Azure. A technical support that should foster the hosting and scaling of LLMs in a relevant manner. According to Puneet Chandok, President of Microsoft India and South Asia, this partnership pursues a much broader goal. It aims to support India’s plans to become an “AI-leading nation.” The executive has expressed his dream of a future where AI solutions, driven by voice interfaces, transcend language barriers for the benefit of individuals from diverse backgrounds. Indian startup Sarvam AI collaborates with Microsoft to bring its Indic voice large language model (LLM) to Azure https://t.co/mviLEM50ze pic.twitter.com/GYHcMQ6Uir Sarvam’s LLM targets inputs in Indian languages and contextual nuances. This with a promise of greater accuracy and better value for AI applications in India. Initially focused on Hindi, one of the most spoken languages in India with over 609 million speakers, the LLM aims to offer a seamless voice interface. But especially one that is natural and adapted to local preferences. Aware of the importance of voice interfaces in Indian languages, Microsoft considers them as the ideal medium for generative AI applications. The partnership intends to facilitate rapid and responsible adoption of generative AI by local businesses. Aligning with Microsoft’s broader strategy to integrate AI across its technological infrastructure. It is worth recalling that Microsoft’s commitment to AI has been evident in its recent financial performance, characterized by a notable 18% increase in profits year over year. Simultaneously, the company’s valuation has exceeded 3 trillion dollars. This outcome is attributed to the integration of AI which has enabled Microsoft to consolidate its stock market position, surpassing Apple in the process. Maximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits. Diplômé de Sciences Po Toulouse et titulaire d'une certification consultant blockchain délivrée par Alyra, j'ai rejoint l'aventure Cointribune en 2019.\nConvaincu du potentiel de la blockchain pour transformer de nombreux secteurs de l'économie, j'ai pris l'engagement de sensibiliser et d'informer le grand public sur cet écosystème en constante évolution. Mon objectif est de permettre à chacun de mieux comprendre la blockchain et de saisir les opportunités qu'elle offre. Je m'efforce chaque jour de fournir une analyse objective de l'actualité, de décrypter les tendances du marché, de relayer les dernières innovations technologiques et de mettre en perspective les enjeux économiques et sociétaux de cette révolution en marche. The views, thoughts, and opinions expressed in this article belong solely to the author, and should not be taken as investment advice. Do your own research before taking any investment decisions. Receive the latest and best crypto news directly to your inbox in daily, weekly, or special format, to stay updated at your own pace Receive the latest and best crypto news directly to your inbox in daily, weekly, or special format, to stay updated at your own pace "
}