{
    "title": "Microsoft Shares Lessons Learned on Building AI Copilots",
    "date": "2/11/2024",
    "url": "https://www.infoq.com/news/2024/02/ms-lessons-learned-copilots/",
    "text": "A monthly overview of things you need to know as an architect or aspiring architects. View an example  We protect your privacy. InfoQ Dev Summit Boston (June 24-25): Get practical advice to make development decisions easier and less risky. \n\n                            Register Now Facilitating the Spread of Knowledge and Innovation in Professional Software Development   Back to login  Back to login Starting your first project with Spring Boot can be a bit \u2028daunting given the vast options that it provides. This updated version of the book \u2028will guide you step by step along the way to be a Spring Boot \u2028hero in no time. Cellular architecture is a design pattern that helps achieve high availability in multi-tenant applications. The goal is to design your application so that you can deploy all of its components into an isolated \"cell\" that is fully self-sufficient. It can benefit your customers regarding availability and ensure you hit your SLAs. Joran Greef discusses TigerBeetle, a new database, and why OLTP has a growing impedance mismatch, why the OLTP workload is becoming more contentious, why row locks, why storage faults, write stalls, and why non-determinism is now a problem. In this podcast Shane Hastie, Lead Editor for Culture & Methods spoke to Joyce Tompsett about the 17th State of agile report. The panelists discuss the human and technical dimensions of platform engineering, sharing insights into establishing, implementing, and sustaining successful platform engineering programs. Discover new ideas and insights from senior practitioners driving change in software. Attend in-person. Discover transformative insights to level up your software development decisions. Register now with early bird tickets. Get practical advice from senior developers to navigate your current dev challenges. Register now with early bird tickets. Level up your software skills by uncovering the emerging trends you should focus on. Register now. InfoQ Homepage\nNews\nMicrosoft Shares Lessons Learned on Building AI Copilots Feb 11, 2024\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\tmin read by Andrew Hoblitzell Researchers at Microsoft and GitHub Inc. have conducted an in-depth study into the challenges, opportunities, and needs associated with building AI-powered product copilots. The research involved interviews with 26 professional software engineers from various companies responsible for developing these advanced tools. The race to embed advanced AI capabilities into products is on, with virtually every technology company looking to add these features to their software; however, many problems remain. Orchestrating multiple data sources and prompts can increase the risk of failure cases while testing LLMs is difficult due to their inherent variability. Developers also struggle to keep up with best practices in this rapidly evolving field, often resorting to social media or academic papers for guidance. Safety, privacy, and compliance are major concerns that require careful management to avoid potential damage or breaches. \"A one-stop shop for integrating AI into projects remains a challenge. Developers are seeking a place to get started quickly, transition from a playground to an MVP, connect their various data sources to the prompts, and then move the AI components into their existing codebase efficiently,\" Austin Henley wrote. \"A prompt linter could provide quick feedback. Developers also asked for a library or \"toolbox\" of prompt snippets for common tasks. Additionally, tracing the effect of prompt changes would be of huge value,\" Henley continued. One significant challenge identified was prompt engineering, the process of creating prompts that trigger an AI model's inference process. \"Because these large language models are often very, very fragile in terms of responses, there’s a lot of behavior control and steering that you do through prompting,\" said one participant (P7). This unpredictability makes it more art than science as developers have to navigate through trial-and-error processes, which can be time-consuming.  Another issue raised was related to testing benchmarks. With generative models like LLMs (Large Language Models), writing assertions becomes difficult when each response might differ from the last one—it's like every test case is a flaky test. One participant explained: “That’s why we run each test 10 times” (P1) while another added: “Experimenting is the most time-consuming if you don’t have the right tools\" (P12). Furthermore, participants expressed concerns about safety, privacy, and compliance issues associated with integrating AI into products. For instance: \"Do we want this affecting real people? This runs in nuclear power plants,” voiced P11, highlighting potential risks in using such technologies without proper safeguards. Finally, keep up-to-date or even know where they should focus their efforts on learning new skills or tools. \"This is brand new to us. We are learning as we go. There is no specific path to do the right way!” (P1) The changes come as Microsoft recently launched design changes and upgrades to its own CoPilot. For example, all English-speaking Copilot users in the U.S., U.K., Australia, India and New Zealand can now edit images in the flow of a chat. The changes come as several Microsoft Copilot Pro subscribers report performance issues. I’ve tested the experience in the latest Windows 11 Canary builds, and it works well for text, summarizing anything you copy. While the icon also animates when you copy images, this feature isn’t quite ready to test yet. - Tom Warren Developers interested in learning more about the study can read a summary or the full article.    Get expert guidance on building intelligent apps on Microsoft Azure. Learn more. A round-up of last week’s content on InfoQ sent out every Tuesday. Join a community of over 250,000 senior developers.\r\n        \r\n\t\t\tView an example  We protect your privacy. A round-up of last week’s content on InfoQ sent out every Tuesday. Join a community of over 250,000 senior developers.\n\t\t\n\t\t\tView an example  We protect your privacy. June 24 - 25, 2024Actionable insights to clarify today's critical dev priorities.InfoQ Dev Summit Boston, is a two-day conference hosted by InfoQ, focusing on the most critical technical decisions senior software developers face today.\n                Deep-dive into 20+ technical talks and get transformative learnings from senior software developers navigating Generative AI, security, modern web applications, and more.Register Now InfoQ.com and all content copyright © 2006-2024 C4Media Inc.\nPrivacy Notice, Terms And Conditions, Cookie Policy "
}