{
    "title": "Gaming giant Activision was already planning ‘significant’ layoffs: \nMicrosoft",
    "date": "2/9/2024",
    "url": "https://www.thestatesman.com/technology/gaming-giant-activision-was-already-planning-significant-layoffs-microsoft-1503268089.html",
    "text": " The tech giant is laying off at least 1,900 employees at gaming company Activision Blizzard as well as at Xbox. IANS | New Delhi | February 9, 2024 1:47 pm Microsoft.(Photo:Twitter) Microsoft has revealed that Activision Blizzard, which it acquired recently for $68.7 billion, was already planning to slash a significant number of jobs before the acquisition. The tech giant is laying off at least 1,900 employees at gaming company Activision Blizzard as well as at Xbox. In a response to the US Federal Trade Commission (FTC), the company said that consistent with broader trends in the gaming industry, “Activision was already planning on eliminating a significant number of jobs while still operating as an independent company.”  Advertisement “The recent announcement thus cannot be attributed fully to the merger,” said Microsoft. The FTC is still appealing a district court’s decision not to block Microsoft’s Activision Blizzard acquisition. “In continuing its opposition to the deal, the FTC ignores the reality that the deal itself has substantially changed. Since the FTC lost in court last July, Microsoft was required by the UK competition authority to restructure the acquisition globally and therefore did not acquire the cloud streaming rights to Activision Blizzard games in the United States,” a Microsoft spokesperson said on the FTC filing. “Additionally, Sony and Microsoft signed a binding agreement to keep Call of Duty on PlayStation on even better terms than Sony had before,” added the company spokesperson, reports The Verge. The latest job cuts will affect around 8 per cent of the overall Microsoft gaming division that has some 22,000 employees. “We have made the painful decision to reduce the size of our gaming workforce by approximately 1900 roles out of the 22,000 people on our team,” Microsoft Gaming CEO Phil Spencer had said in an internal memo. Activision Blizzard President Mike Ybarra has also left the company. “I want to thank everyone who is impacted today for their meaningful contributions to their teams, to Blizzard, and to players’ lives. It’s an incredibly hard day and my energy and support will be focused on all those amazing individuals impacted – this is in no way a reflection on your amazing work,” Ybarra posted on X. Microsoft completed its $68.7 billion acquisition of Activision Blizzard in October last year, after a long battle with regulators in the UK and the US.  Advertisement Microsoft Chairman and CEO Satya Nadella on Tuesday welcomed Mustafa Suleyman as CEO of the company’s artificial intelligence (AI) venture. The investigation primarily focused on Meta's handling of consumer issues within the Facebook Marketplace and Instagram Marketplace, they added. In a setback for Microsoft-backed OpenAI, the US Patent and Trademark Office (PTO) has refused to allow the Sam Altman-run company to register the word GPT (generative pre-trained transformer) as a trademark. Advertisement  PEOPLE'S PARLIAMENT, ALWAYS IN SESSION Address\r\n                                    The Statesman Net Private Limited\r\n                                    Statesman House, First Floor 148 Barakhamba Road\r\nNew Delhi – 110001\r\n(+91) (011) 41605781, 41605958 © 2023, thestatesman.com | All rights reserved "
}