{
    "title": "Microsoft launches Copilot for Finance in public preview",
    "date": "2/29/2024",
    "url": "https://candid.technology/microsoft-copilot-finance/",
    "text": "Microsoft has announced a new set of upgrades improving Copilot in Windows 11 including new plugins and skills, creative tools, and Android integration, among others. The company also launched Copilot for Finance in early access. While users will be able to see most of the updates today, some features will be available in late March allowing users to turn on the battery saver, Narrator, and Magnifier, see the WiFi coverage, and empty the recycle bin by giving simple commands like “turn off battery saver” to the Copilot. Introducing plugins from popular applications such as OpenTable, Shopify, and Kayak takes Copilot beyond mere convenience. With the new upgrades, users can seamlessly integrate these plugins into their Copilot experience, transforming routine tasks into streamlined, interactive processes. Microsoft has also introduced some upgrades to the Photos app. The introduction of Generative Erase allows users to remove unwanted elements from their images. This feature, when coupled with the Clipchamp, can offer multiple options for content creators, providing editing capabilities akin to specialised software. Voice Shortcuts, a novel addition to Copilot, introduces voice-activated commands to expedite tasks. Users can paste text and open folders hands-free. Furthermore, users can now access recent photos on their Windows 11 PC directly from their Android phones via the Phone Link and can also use their Android phones as a webcam for video conferencing applications. Intelligent Snap suggestions along with a revamped Widgets board will allow users to optimise screen real estate as per their preference and set up specific applications and tasks for a more productive workflow. With the new updates, Microsoft has finally let users stop the ‘Microsoft Start’ feed. For users with a Windows tablet, the new update brings in the write-to-text feature whereby users can write anything via stylus and it will be converted to text. Microsoft has also expanded the Windows Ink feature to Photos, Paint, WhatsApp and Messenger apps. For enterprise users, Windows Autopatch will now take the role of the ultimate Windows update management platform giving organisations a one-stop solution to manage updates. The company has also announced a public preview of Microsoft Copilot for Finance. This tool integrates with Microsoft 365 apps like Excel and Outlook with workflow and data-specific insights tailored for financial professionals. The Copilot for Finance leverages data from existing financial repositories including Microsoft Dynamics 364, SAP, and Microsoft Graph. Using this tool, analysts can perform a variance analysis in Excel, generate a summary of customer details in Outlook, and convert raw data into presentable visuals. In the News: Malicious AI model in Hugging Face creates backdoor on a user’s device Deputy Editor at Candid.Technology. Hemant writes at the intersection of tech and culture and has a keen interest in science, social issues and international relations.\r\n\r\nYou can contact him here: kumarhemant@pm.me We may earn a commission if you buy something from a link on this page. Thanks for your support. We may earn a commission if you buy something from a link on this page. Thanks for your support. Session expired Please log in again.\n\t\tThe login page will open in a new tab. After logging in you can close it and return to this page. "
}