{
    "title": null,
    "date": "1/16/2024",
    "url": "https://www.thenews.com.pk/latest/1148379-microsoft-offers-20-copilot-pro-ai-subscription-service-for-businesses",
    "text": "Microsoft has announced a new subscription-based offer for consumers and business owners that allows them to incorporate AI in applications that people use daily such as Word and Excel, The Daily Star reported. Corporate Vice President Jared Spataro said in an interview: \"Copilot Pro would stand apart because it is integrated into applications that people use every day.\" Microsoft will charge $20 per month for what it calls Copilot Pro, an AI assistant. It launched a free version of the programme called AI copilot for its Bing search engine last year. With the subscription, users will have access to new tools and AI models like GPT-4 Turbo in addition to an AI assistant that can aid with text authoring and number crunching in Microsoft Word and Excel, two of the company's most popular programmes. The firm also announced that it was eliminating the requirement for an enterprise version of the programme to have 300 employees, allowing smaller organisations to benefit from the security controls and Microsoft Teams upgrade that comes with the $30 per user, per month Copilot subscription. Microsoft believes virtually all of its business customers will sign up, Spataro said: \"I can't imagine a commercial organisation out there that will not buy at least a seat of Copilot to see what it's all about.\" Alphabet's Google is competing with Microsoft in marketing AI for productivity and cloud software to business customers. Fund says Pakistan’s economic and financial position has improved in the months since the first review Old method advises splitting your income 50% for needs , 30% for wants , and 20% for savings Pakistan signs agreement with KSA’s Najd Gateway Holding Company to cultivate 5,000 acres of cattle fodder MPC notes inflation, in line with earlier expectations, has begun to decline noticeably from H2-FY24 Regulator to hear SNGPL plea on March 25 in Lahore and on March 27 in Peshawar Most financial experts believe rates will remain unchanged, while some expect a 1% reduction Copyright © 2024. The News International, All Rights Reserved | Contact Us | Authors "
}