{
    "title": "Microsoft closes in on Apple as world's most valuable company",
    "date": "1/9/2024",
    "url": "https://readwrite.com/microsoft-is-closing-in-on-apple-as-worlds-most-valuable-company/",
    "text": "James Jones is a highly experienced journalist, podcaster and digital publishing specialist, who has been creating content in a variety of forms for online publications… Microsoft is edging closer to becoming the world’s most valuable company. Apple currently leads the way with a market cap of $2.89 trillion, although its rivals are closing in with a market cap of $2.79 trillion. That’s despite Apple gaining a larger gain over the last 30 days, having grown by $68.2 billion compared to Microsoft’s $51.7 billion. Microsoft has been heavily investing in AI of late, most recently teaming up with Siemens to drive cross-industry adoption for artificial intelligence. Meanwhile, Apple has experienced a 30% drop in sales in China – their third-largest market – in the first week of 2024. There is still a $100 billion difference in valuation between the two companies but that’s relatively small when you consider how much each company has moved in value over the last month. It does appear, at first glance, that Apple will hold off Microsoft for some time, though. Today (January 9) they are seeing a 2.42% increase in share price, as opposed to Microsoft’s 1.89%. This may be down to January 8’s announcement that Apple’s Vision Pro will hit stores in February, with pre-orders set to open on January 19. However, both companies have experienced a decline in share price over the last 30 days, the only two to do so in the stock market in the top 13 most valuable companies in the world. There is only one other company in the world that can boast a market cap of more than $2 trillion, which is oil giant Saudi Aramco. Fellow tech giants Google ($1.75 trillion), Amazon ($1.54 trillion) and Meta ($921.7 billion) are some way behind the aforementioned juggernauts of the tech industry when it comes to market cap. Meanwhile, Walmart lead the way for pure revenue with $638.8 billion, followed closely by Amazon with $554 billion. In comparison, Apple’s revenue stands at $383.3 billion and Microsoft only brings in over $218 billion. Featured Image: Photo by Matthew Manuel on Unsplash The ReadWrite Editorial policy involves closely monitoring the tech industry for major developments, new product launches, AI breakthroughs, video game releases and other newsworthy events. Editors assign relevant stories to staff writers or freelance contributors with expertise in each particular topic area. Before publication, articles go through a rigorous round of editing for accuracy, clarity, and to ensure adherence to ReadWrite's style guidelines. James Jones is a highly experienced journalist, podcaster and digital publishing specialist, who has been creating content in a variety of forms for online publications in the sports and tech industry for over 10 years. He has worked at some of the leading online publishers in the country, most recently as the Content Lead for Snack Media's expansive of portfolio of websites, including Football Fancast.com, FootballLeagueWorld.co.uk and GiveMeSport.com. James has also appeared on several national and global media outlets, including BBC News, talkSPORT, LBC Radio, 5 Live Radio, TNT Sports, GB News and BBC’s Match of the Day 2. James… We may still be getting used to the Samsung Galaxy S24 line after it was released in January this year, but we’re already looking ahead to the hugely anticipated Samsung...   By signing up, you agree to our Terms and Privacy Policy. Unsubscribe anytime. Explore the latest in tech with our Tech News. We cut through the noise for concise, relevant updates, keeping you informed about the rapidly evolving tech landscape with curated content that separates signal from noise. Explore tech impact in In-Depth Stories. Narrative data journalism offers comprehensive analyses, revealing stories behind data. Understand industry trends for a deeper perspective on tech's intricate relationships with society. Empower decisions with Expert Reviews, merging industry expertise and insightful analysis. Delve into tech intricacies, get the best deals, and stay ahead with our trustworthy guide to navigating the ever-changing tech market. REGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website Registered Address: Clickout Media Ltd AA PH, Camilleri Buildings, Oratory Street, Naxxar, NXR 2504 Malta Company Number 103525. All Rights Reserved. "
}