{
    "title": "MSFT Stock: Microsoft Seeks To Build On AI Momentum In 2024",
    "date": "1/10/2024",
    "url": "https://www.investors.com/research/ibd-stock-of-the-day/msft-stock-microsoft-seeks-to-build-on-ai-momentum-in-2024/",
    "text": "BREAKING: Futures Mixed Composite Rating Industry Group Ranking Emerging Pattern Flat Base One of three positive chart patterns to look for when doing technical analysis. It usually occurs after a stock has advanced off of a “cup with handle” or “double bottom” pattern. The “flat base” moves straight sideways in a fairly tight price range for at least five weeks and does not correct more than 15%. Microsoft (MSFT) is the IBD Stock of the Day for Wednesday, as MSFT stock rises toward a buy point from a flat base pattern. The tech giant is popular among Wall Street analysts who expect Microsoft to build off its momentum in generative artificial intelligence in 2024. On the stock market today, MSFT stock climbed 1.9% to close at 382.77. With early gains Wednesday, Microsoft cleared a recent downward sloping trendline. The stock has bounced up after testing its 50-day moving average last week. According to IBD MarketSmith, MSFT stock is in a flat base pattern with a buy point of 384.30. Further, Microsoft gained 57% in 2023. A big part of Microsoft's gains last year was its head start in the generative AI market. The Redmond, Wash.-based company invested $10 billion in the startup OpenAI late in 2022. OpenAI's ChatGPT chatbot helped launch the current frenzy around generative AI. Now, Microsoft is steadily integrating AI into its massive consumer and enterprise tech portfolio. Last week, the company announced it would add an AI key to its Windows PC keyboard. The button will launch Microsoft's AI assistant feature, called Copilot. It is the first significant change to the keyboard in three decades, as described by the company. Before that, Microsoft made Copilot services available within its enterprise Office suite of apps on Nov. 1 of last year. The tool uses generative AI to offer suggestions and automate some tasks in software such as Word and Excel. Moreover, offering businesses access to generative AI tools has helped boost sales for Microsoft's Azure cloud-computing business, the company said on its October earnings call. Microsoft's AI push has fueled bullish views for the stock among Wall Street analysts. Jefferies analyst Brent Thill recently named Microsoft a top pick for 2024. In a client note, Thill said gen AI applications will help reaccelerate growth for Azure, while the introduction of AI PCs could help drive a refresh cycle for personal computers. Meanwhile, in a December note, Wedbush analyst Daniel Ives described the Copilot feature as a \"game changer.\" Further, Ives said the price of the stock is \"yet to price in what we view as the next wave of cloud and AI growth coming\" to Microsoft. He added that he sees Microsoft's \"FY24 with a strong competitive cloud edge vs. Amazon and Google.\" But there are challenges ahead. The European Union disclosed Tuesday it is considering whether it can launch a review of Microsoft's OpenAI investment under its merger regulations, the Wall Street Journal reported. In late December, the New York Times (NYT) sued Microsoft and OpenAI for alleged copyright infringement. The lawsuit is among several that will test OpenAI's argument that training algorithms on copyrighted works should be considered fair use, as The Associated Press reported. And of course, tech rivals are readying their own AI offensives. Amazon (AMZN) is already the market leader for cloud services and late last year launched its own AI-powered chatbot for businesses, plus an AI-focused computing chip. The next big test for Microsoft will come when it reports fiscal second quarter earnings. Analysts project the company will post a 19% year-over-year earnings increase, to $2.76 per share, for the December quarter, according to FactSet. Further, consensus estimates see sales rising 16% to $61 billion. Meanwhile, Microsoft is the top-ranked stock among the computer-software desktop group tracked by IBD MarketSmith. IBD Stock Checkup shows MSFT stock has an IBD Composite Rating of 96 out of a best-possible 99. The score combines five separate proprietary ratings into one rating — with the best growth stocks scoring above 90. Further, MSFT has an IBD Relative Strength Rating of 90 out of 99. The Relative Strength Rating shows how a stock's price performance stacks up against all other stocks over the last 52 weeks. The best growth stocks typically have RS Ratings of at least 80. Also, MSFT stock is on the IBD 50 premier growth-stock list and the Tech Leaders list. Microsoft is also on the Long-Term Leaders list and IBD SwingTrader. Microsoft is also among the Magnificent Seven stocks that powered the market rally in 2023. YOU MAY ALSO LIKE: Is Microsoft Stock A Buy As Software Giant Touts Artificial Intelligence? Looking For The Next Big Stock Market Winners? Start With These 3 Steps Learn How To Time The Market With IBD's ETF Market Strategy Best Growth Stocks To Buy And Watch: See Updates To IBD Stock Lists Futures: MSFT Eyes Apple's Title; SEC OKs Bitcoin ETFs 3/24/2024\nThe dovish Fed and the Nvidia-led AI boom continue to be the big stock market catalysts. Uber and Eli Llly... 3/24/2024\nThe dovish Fed and the Nvidia-led AI boom continue to... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}