{
    "title": "How CarMax organized and scaled innovation with Microsoft AI solutions | \nThe Microsoft Cloud Blog",
    "date": "1/22/2024",
    "url": "https://www.microsoft.com/en-us/microsoft-cloud/blog/2024/01/22/how-carmax-organized-and-scaled-innovation-with-microsoft-ai-solutions/",
    "text": "With the adoption of generative AI spreading across industries, it has been fascinating to see how Microsoft customers are applying this groundbreaking technology to tackle their unique business challenges. I spoke with Shamim Mohammad, Chief Information and Technology Officer at CarMax, on the Pivotal podcast about his company’s approach to data and AI. CarMax has applied AI to improve the experience for both customers and employees. For instance, it is using machine learning to provide the best images, reviews, and details for each car. It has built patented technologies to optimize that process, including a recommendation engine that can understand what the customer is trying to do and offer targeted car content. When customers look at a car, AI also helps aggregate information about the car from multiple data sets and turns it into easily digestible summaries for the shopper. ChatGPT working in the background to draft these summaries frees time for CarMax’s employees to work on higher-value projects. CarMax was one of the early adopters of Microsoft Azure OpenAI Service, and its success in scaling AI has a lot to do with how it organized itself to drive innovation across the company. Here are some highlights from my conversation with Shamim. Microsoft is empowering the world to achieve more with AI CarMax has set itself up like a digital startup, creating dozens of small, cross-functional innovation teams. Each team is focused on tackling a defined set of business challenges, and resourced with engineering, marketing, and operations talent. They are encouraged to move fast to build and test their solutions. AI transformation Every few weeks, these teams present their progress and results at a product showcase. CarMax senior leaders watch these presentations, provide feedback, and decide which projects to scale. When a good idea is proved effective, teams are empowered to move their solutions to production with minimal bureaucracy. This allows them to quickly iterate and scale. When our teams have a good idea, they can optimize and scale it on their own, and then they present their progress on a biweekly basis, and we make a joint determination how and if to proceed further as a team. That’s how the teams work today at CarMax, which is amazing. I feel like I have this massively large company, but it’s still working like a startup. This cross-functional team structure would not have been possible without close leadership alignment. When Shamim first became Chief Information Officer, he partnered closely with the Chief Operating Officer and Chief Marketing Officer to organize these teams so that they could become digital-first. That collaboration has thrived to this day. CarMax has created a strong model for AI governance to support its innovation. It set up an AI Center of Excellence that includes top technical leaders, as well as leaders from legal, operations, finance, and marketing. foundations for AI success This center’s chief role is to ensure that any innovation with AI remains consistent with the company’s core values of transparency and integrity. It focuses on educating CarMax teams about the power and risks of AI, provides guidelines on how to use AI responsibly, and offers tools to help teams evaluate their ideas and projects. The work of the AI Center of Excellence has created a culture of responsible innovation within CarMax, allowing teams to feel safe to experiment with AI. It starts with creating a culture that empowers employees to experiment and learn. And that’s supported by a strong data foundation. Because if a company is not good with data, they cannot be good with AI. CarMax knew that the transformation it sought depended heavily on getting its data estate in order. Starting five years ago, the company invested to build a clean and organized data estate in the cloud. That has allowed it to combine the power of AI with its massive trove of car and customer data. It started by moving its data to Microsoft Azure. It worked to make that data scalable, updated, and constantly refreshed. It also applied strong data governance policies to ensure security and privacy. Today, that data is available for its teams to use. Its early data estate investment has positioned it to drive AI innovation at an incredible pace. Our teams have been leveraging our data and AI to create great customer experiences, drive competitive differentiation, and also make the lives of our associates better. CarMax is an exciting example of what an organization can accomplish if it makes some foundational changes to prime itself for AI innovation. Pivotal By clearly defining achievable goals, providing teams with the environment to experiment and scale, and putting strong AI and data governance in place, it was able to unleash a wave of AI innovation that completely transformed its business. CarMax’s journey offers important lessons for organizations wanting to succeed with AI. If you want to hear more about CarMax’s approach, tune into the episode on the Pivotal podcast. Explore a few of the emerging best practices that are helping leaders position their organizations for success in the age of AI Explore how an Oscar-winning global visual effects studio uses cloud computing to bring flexibility and scale to their rendering pipeline. Learn how skill building with Microsoft Learn is a critical element of your AI transformation strategy. Discover how the most trusted and comprehensive cloud can help you meet the challenges of a rapidly changing world. "
}