{
    "title": "Microsoft Co. (NASDAQ:MSFT) Stake Raised by Suncoast Equity Management",
    "date": "1/20/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-msft-sec-filing-2024-01-20/",
    "text": "Suncoast Equity Management boosted its position in Microsoft Co. (NASDAQ:MSFT - Free Report) by 2.8% during the third quarter, according to the company in its most recent disclosure with the Securities & Exchange Commission. The fund owned 175,254 shares of the software giant's stock after buying an additional 4,811 shares during the period. Microsoft makes up approximately 8.4% of Suncoast Equity Management's investment portfolio, making the stock its largest holding. Suncoast Equity Management's holdings in Microsoft were worth $55,337,000 at the end of the most recent quarter. A number of other large investors have also recently bought and sold shares of MSFT. Monumental Financial Group Inc. purchased a new stake in Microsoft in the first quarter valued at approximately $28,000. Atlantic Private Wealth LLC boosted its position in Microsoft by 534.5% in the 2nd quarter. Atlantic Private Wealth LLC now owns 184 shares of the software giant's stock worth $63,000 after purchasing an additional 155 shares in the last quarter. Hibernia Wealth Partners LLC purchased a new stake in Microsoft in the 3rd quarter worth approximately $69,000. Iron Horse Wealth Management LLC boosted its position in Microsoft by 89.0% in the 3rd quarter. Iron Horse Wealth Management LLC now owns 223 shares of the software giant's stock worth $70,000 after purchasing an additional 105 shares in the last quarter. Finally, MayTech Global Investments LLC purchased a new stake in Microsoft in the 4th quarter worth approximately $83,000. Hedge funds and other institutional investors own 69.20% of the company's stock. Insider Activity at Microsoft In related news, EVP Kathleen T. Hogan sold 24,681 shares of the firm's stock in a transaction dated Friday, December 8th. The stock was sold at an average price of $369.00, for a total transaction of $9,107,289.00. Following the completion of the transaction, the executive vice president now directly owns 183,761 shares in the company, valued at approximately $67,807,809. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this hyperlink. 0.03% of the stock is currently owned by company insiders. Wall Street Analyst Weigh In Several research firms have commented on MSFT. Truist Financial began coverage on Microsoft in a research report on Wednesday, December 13th. They issued a \"buy\" rating on the stock. HSBC upgraded Microsoft from a \"hold\" rating to a \"buy\" rating and upped their price objective for the stock from $347.00 to $413.00 in a research report on Thursday, October 26th. Piper Sandler restated an \"overweight\" rating and issued a $455.00 price objective on shares of Microsoft in a research report on Friday, January 12th. DA Davidson reaffirmed a \"buy\" rating and set a $415.00 target price on shares of Microsoft in a research note on Monday, October 16th. Finally, Loop Capital started coverage on Microsoft in a research note on Tuesday, October 17th. They set a \"buy\" rating and a $425.00 target price for the company. Three equities research analysts have rated the stock with a hold rating and thirty-seven have assigned a buy rating to the company's stock. According to data from MarketBeat, Microsoft presently has a consensus rating of \"Moderate Buy\" and an average price target of $403.16. Check Out Our Latest Stock Analysis on MSFTMicrosoft Stock Performance NASDAQ MSFT opened at $398.67 on Friday. The stock has a market cap of $2.96 trillion, a PE ratio of 38.59, a P/E/G ratio of 2.27 and a beta of 0.88. The company has a current ratio of 1.66, a quick ratio of 1.64 and a debt-to-equity ratio of 0.19. Microsoft Co. has a twelve month low of $230.90 and a twelve month high of $398.67. The stock has a fifty day simple moving average of $376.04 and a 200-day simple moving average of $347.52. Microsoft (NASDAQ:MSFT - Get Free Report) last released its quarterly earnings results on Tuesday, October 24th. The software giant reported $2.99 earnings per share for the quarter, topping analysts' consensus estimates of $2.65 by $0.34. The business had revenue of $56.52 billion during the quarter, compared to analysts' expectations of $54.52 billion. Microsoft had a return on equity of 38.79% and a net margin of 35.31%. The company's revenue was up 12.8% compared to the same quarter last year. During the same period in the prior year, the business posted $2.35 EPS. Equities analysts anticipate that Microsoft Co. will post 11.14 earnings per share for the current year. Microsoft Announces Dividend The company also recently announced a quarterly dividend, which will be paid on Thursday, March 14th. Investors of record on Thursday, February 15th will be issued a dividend of $0.75 per share. This represents a $3.00 dividend on an annualized basis and a yield of 0.75%. The ex-dividend date of this dividend is Wednesday, February 14th. Microsoft's dividend payout ratio (DPR) is 29.04%. About Microsoft (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.See AlsoFive stocks we like better than MicrosoftETF Screener: Uses and Step-by-Step Guide Investing in coffee: 3 great strategies to consider Best Stocks Under $5.00How to invest in wheat: Is it a hedge against inflation?What is a SEC Filing?20 best healthcare dividend stocks to invest inThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ top AI stock (it’s not MSFT, GOOGL, AMZN or AAPL) (From Traders Agency) (Ad)Should you invest $1,000 in Microsoft right now?Before you consider Microsoft, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Microsoft wasn't on the list.While Microsoft currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here Elon Musk's Next MoveWondering when you'll finally be able to invest in SpaceX, StarLink, or The Boring Company? Click the link below to learn when Elon Musk will let these companies finally IPO.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Microsoft, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Microsoft wasn't on the list. While Microsoft currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering when you'll finally be able to invest in SpaceX, StarLink, or The Boring Company? Click the link below to learn when Elon Musk will let these companies finally IPO. Microsoft's stock price is pulling back following the Q4 results, suggesting a top is in play, but investors should not be so quick to shed their shares. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}