{
    "title": "Intel strikes major chip deal with Microsoft amid AI push",
    "date": "2/22/2024",
    "url": "https://www.siliconrepublic.com/business/intel-microsoft-ai-chips-semiconductors-foundry-deal",
    "text": "by Vish Gain 22 Feb 2024 Image: © Tada Images/Stock.adobe.com CEO Pat Gelsinger said at an Intel event yesterday that AI is ‘profoundly’ transforming how we think about technology and the silicon that powers it. Intel has struck a major deal with Microsoft that will see the chipmaker manufacture chips designed by the software giant as it looks to make the most of AI. Announced yesterday (21 February) at Intel’s first foundry event called Foundry Direct Connect, the deal will see Intel produce advanced semiconductors for Microsoft as part of foundry deals that have an estimated lifetime value of $15bn. “We are in the midst of a very exciting platform shift that will fundamentally transform productivity for every individual organisation and the entire industry,” said Microsoft CEO Satya Nadella, who was one of the many tech leaders present at the event. “To achieve this vision, we need a reliable supply of the most advanced, high-performance and high-quality semiconductors. That’s why we are so excited to work with Intel Foundry, and why we have chosen a chip design that we plan to produce on Intel 18A process.” The event marks an attempt by Intel, once the world’s foremost chipmaker, to regain its position at the top spot by outcompeting Asian rivals such as TSMC in Taiwan and Samsung in South Korea. Some other figures present included US secretary of commerce Gina Raimondo, Arm CEO Rene Haas and OpenAI CEO Sam Altman. AI is creating an unprecedented opportunity for the world's most innovative chip designers. What we shared today is just a glimpse of what lies ahead for Intel Foundry. This moment was 3 years in the making and I'm proud of Team @Intel for the progress we’ve made.… pic.twitter.com/xL28wFBPAu — Pat Gelsinger (@PGelsinger) February 21, 2024  Intel CEO Pat Gelsinger, who has been trying to reinvent Intel as a foundry business since he took the helm three years ago, said yesterday that AI is “profoundly” transforming how we think about technology and the silicon that powers it. “This is creating an unprecedented opportunity for the world’s most innovative chip designers and for Intel Foundry, the world’s first systems foundry for the AI era. Together, we can create new markets and revolutionise how the world uses technology to improve people’s lives.” At its latest earnings call last month, Intel revealed that while it ended 2023 on a positive note, the Santa Clara-headquartered chipmaker had a lacklustre year overall with revenue drops among its key businesses, including the client computing group. Intel expects revenue of between $12.2bn and $13.2bn in the first quarter of 2024, which is below analyst expectations of $14.15bn, according to CNBC. The company confirmed last year that it would focus on a strategy of cost reductions and job cuts. The latest deal with Microsoft is part of a string of AI-focused moves Intel has been making since last year. In August, it was one of several major tech players to invest in AI start-up Hugging Face. It also backed AI21 Labs, an Israeli generative AI start-up co-founded by Amnon Shashua, who previously founded Intel’s self-driving car unit Mobileye. Last month, Intel announced the formation of Articul8, an independent spin-out providing businesses a generative AI software platform. Find out how emerging tech trends are transforming tomorrow with our new podcast, Future Human: The Series. Listen now on Spotify, on Apple or wherever you get your podcasts. Related:\n                    Intel,             electronics,             Microsoft,             AI Vish Gain is a journalist with Silicon Republic editorial@siliconrepublic.com 26 Jan 2024 4 days ago 4 days ago 5 days ago 5 days ago 14 Mar 2024 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago All content copyright 2002-2024 Silicon Republic Knowledge & Events Management Ltd. Reproduction without explicit permission is prohibited. All rights reserved.\n            Website by Square1.io "
}