{
    "title": "New data and AI solutions in Microsoft Cloud for Sustainability help move \norganizations from pledges to progress - The ...",
    "date": "2/13/2024",
    "url": "https://blogs.microsoft.com/blog/2024/02/13/new-data-and-ai-solutions-in-microsoft-cloud-for-sustainability-help-move-organizations-from-pledges-to-progress/",
    "text": "Feb 13, 2024\n\n| \n\tSatish Thomas - Corporate Vice President, Microsoft Industry Clouds As global sustainability progress becomes more pressing, organizations need tangible, transformative solutions to help them move forward faster. Most have not progressed as much as they’d like. While 85% of executives report that sustainability is strategically important to their company, only 16% have integrated sustainability into their business strategies. Today, we’re introducing new data and AI solutions in Microsoft Cloud for Sustainability that provide capabilities organizations need to progress in their sustainability journey. These include faster environmental, social and governance (ESG) data analytics and insights, an AI assistant to help accelerate impactful decision-making and reporting, and other advanced capabilities — all designed to help organizations move the needle faster. YouTube Video Click here to load media In May 2023, we unveiled Microsoft Fabric, an end-to-end, analytics SaaS platform that brings together all of an organization’s enterprise data, including ESG data that the company may not have had access to before. With Microsoft Fabric, your teams can connect to data from anywhere, uncover insights using AI-powered analytics tools in a unified experience, and embed those insights in the applications your people use every day to drive action and improve decision-making. Now in preview, sustainability data solutions in Microsoft Fabric allows organizations to accelerate their time to insights and sustainability progress by providing out-of-the-box ESG data model, connectors and reporting. By connecting your ESG data with Microsoft Fabric you can turn volumes of sustainability data into meaningful insights and progress. With centrally managed data and Copilot in Microsoft Sustainability Manager, now in preview, organizations can use powerful generative AI and natural language queries to gain faster lines of sight into and answers out of data. Organizations can ask Copilot questions, and Copilot will work across Microsoft Sustainability Manager to: With intelligent insights in Microsoft Sustainability Manager, also in preview, organizations get an integrated and interactive AI model enabling deeper analysis of calculated emissions data. Using it, they can: Södra, Sweden’s largest forest-owner association with 52,000 owners of responsibly managed forests, processes sustainable raw materials from members’ forests into renewable products. Using Microsoft Sustainability Manager with new AI capabilities, Södra has improved sustainability practices like reporting through automated flows that enable employees to more easily collect detailed information. “With the AI capabilities in Microsoft Sustainability Manager, we can be more productive, which is our ultimate goal,” shares Cristian Brolin, Chief Digital Officer at Södra. “We found the Copilot feature very easy to use and my vision and ambition is that this will help accelerate the way we work. We are excited to see how this solution helps accelerate our sustainability progress.” For most organizations, supplier activities can account for upward of 80-90% of their emissions footprint. Getting a handle on this data is critical to meeting reduction targets and reporting requirements. ESG value chain solution in Microsoft Sustainability Manager, now generally available, allows organizations to simplify data collection and provides a seamless and more secure process for suppliers. Organizations can run advanced analytics on ESG value chain data in one place and find emissions reduction opportunities within their value chain. At Microsoft, our procurement team has found that getting data out of siloed reports, spreadsheets, and systems into one data estate and sharing learnings with others is key to advancing our own progress as well as others’ progress. Through more automated data gathering and management, such as through ESG value chain solution, we can not only more easily share data but also respond more nimbly to changing regulatory requirements. According to research by the United Nations and Accenture, 98% of CEOs see sustainability as a core to their role, and two out of three are forming partnerships and taking action on sustainability. Many are also translating these actions into new business models and growth. Allegiant Stadium, home to the Las Vegas Raiders, is using Microsoft Sustainability Manager to support a state-of-the art and energy efficient facility that hosted the 2024 Super Bowl. Allegiant obtained LEED Gold certification, is 100% powered by renewable energy from local solar farms and is using Microsoft solutions to help organize data to inform decisions about resource utilization. Microsoft Cloud for Sustainability is designed to be extensible by partners, including experts operating at the intersections of sustainability and AI. For example, Avanade’s copilot for ESG takes the friction out of regulatory compliance reporting, generating audit-ready reports against new and existing ESG frameworks. We are proud to have a growing, global ecosystem of sustainability solution, advisory and implementation partners working closely with us, to build and deploy capabilities that can address the broad, multifaceted and complex challenges in sustainability. At the intersection of sustainability and AI, the possibilities are vast for any organization to refocus business around transforming operations, reinventing brands and exploring new business opportunities. Microsoft AI delivers on this potential and the needs of our customers with a responsible approach to AI that’s based on robust evaluation, verification and validation. Using the power of data and AI, sustainability progress isn’t just possible but tangible. Organizations can gain efficiency and accuracy in decision-making and reporting as well as new ways of doing and growing business — on an exciting, shared path to a transformative future. Tags: Microsoft Cloud for Sustainability, Microsoft Copilot, Microsoft Fabric, Microsoft Sustainability Manager Feb 7, 2024\t\t\t\t\t\t\t\t\n|\nYusuf Mehdi Jan 29, 2024\t\t\t\t\t\t\t\t\n|\nJudson Althoff Jan 15, 2024\t\t\t\t\t\t\t\t\n|\nYusuf Mehdi Jan 9, 2024\t\t\t\t\t\t\t\t\n|\nShelley Bransten Dec 14, 2023\t\t\t\t\t\t\t\t\n|\nCorey Sanders Follow us: "
}