{
    "title": "Microsoft acquires Fungible to accelerate datacenter innovation",
    "date": "2/21/2024",
    "url": "https://mspoweruser.com/microsoft-acquires-fungible-to-accelerate-datacenter-innovation/",
    "text": "Follow us Share this article Latest news 2 min. read Updated on February 21, 2024 updated on \n\nFebruary 21, 2024 Share this article Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Fungible is now officially a part of Microsoft. Both Microsoft and Fungible and Microsoft posted about the acquisition on their respective websites. The acquisition will help Microsoft enhance its Data Center Infrastructure effort. However, both companies are silent on how much the deal cost Microsoft. For those who do not know, Fungible was invented in 2016, and addressing the problems in scale-out data centers was its purpose. It is a provider of composable infrastructure in datacenters with high-efficiency, low-power data processing units (DPUs). Now that the acquisition is complete, Fungible engineering teams will deliver multiple DPU solutions, network innovation, and hardware systems advancements, which will accelerate networking and storage performance in datacenters and help Microsoft enable high-performance, scalable, disaggregated, scaled-out datacenter infrastructure with reliability and security. In the acquisition, Fungible said the following: We are proud to be part of a company that shares Fungible’s vision and will leverage the Fungible DPU and software to enhance its storage and networking offerings. We would like to thank our loyal employees for their dedication and hard work over these last seven years and our customers, partners, and investors for their belief and support in our technology. Microsoft, on the other hand, noted: Today’s announcement further signals Microsoft’s commitment to long-term differentiated investments in our datacenter infrastructure, which enhances our broad range of technologies and offerings including offloading, improving latency, increasing datacenter server density, optimizing energy efficiency and reducing costs. In other Microsoft-related news, Microsoft is planning to inject OpenAI’s ChatGPT language AI tool into its Office apps. Bing will be the first Microsoft service to get the ChatGPT treatment as early as this March, according to reports. More about the topics: acquisition, Data Processing Unit, datacenter, Datacenter infrastructure, DPU, Fungible, hardware, microsoft Joe Rogun Tech Journalist Joe is a Journalist, with years of experience in covering software, primarily Windows and Android. She also loves to share her opinions on diverse tech topics. Joe Rogun Tech Journalist Joe is a Journalist, with years of experience in covering software, primarily Windows and Android. She loves to share her opinions on diverse tech. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}