{
    "title": "Exclusive: Google steps up Microsoft criticism, warns of rival's monopoly \nin cloud",
    "date": "2/26/2024",
    "url": "https://ca.finance.yahoo.com/news/exclusive-google-steps-microsoft-criticism-194847058.html",
    "text": "For homeowners thinking about renovating, the federal tax benefit buffet is pretty sparse By Foo Yun Chee BRUSSELS (Reuters) - Alphabet's Google Cloud on Monday ramped up its criticism of Microsoft's cloud computing practices, saying its rival is seeking a monopoly that would harm the development of emerging technologies such as generative artificial intelligence. Microsoft and Amazon have recently attracted scrutiny in Britain, the European Union and the United States over their market power in cloud computing. Google trails a distant third behind the two leaders. Microsoft's collaboration with ChatGPT creator OpenAI has also ratcheted up the concerns. \"We worry about Microsoft wanting to flex their decade-long practices where they had a lot of monopoly on the on-premise software before and now they are trying to push that into cloud now,\" Google Cloud Vice President Amit Zavery said in an interview. \"So they are creating this whole walled garden, which is completely controlled and owned by Microsoft, and customers who want to do any of this stuff, you have to go to Microsoft only,\" he said. \"If Microsoft cloud doesn't remain open, we will have issues and long-term problems, even in next generation technologies like AI as well, because Microsoft is forcing customers to go to Azure in many ways,\" Zavery said, referring to Microsoft's cloud computing platform. He urged antitrust regulators to act. \"I think regulators need to provide some kind of guidance as well as maybe regulations which prevent the way Microsoft is building the Azure cloud business, not allow your on-premise monopoly to bring it into the cloud monopoly,\" Zavery said. Microsoft dismissed that argument. \"As the latest independent data shows, competition between cloud hyperscalers remains healthy,\" said a Microsoft spokesperson. \"In 2023, Microsoft and Google made small gains on AWS, which continues to remain the global market leader by a significant margin.\" Microsoft President Brad Smith on Monday took a veiled swipe at Google. \"Today, only one company is vertically integrated in a manner that includes every AI layer from chips to a thriving mobile app store,\" he told the Mobile World Congress in Barcelona. Zavery also criticised Microsoft's agreements with individual cloud vendors, saying these ignore the broader issues. Trade group CISPE last month said it was in talks with Microsoft to resolve its EU antitrust complaint about its cloud computing licensing practices. \"Microsoft has been very smart, picking individual vendors who complain and do one-side deals but they don't solve the broader problem. So they can choose the winners and losers in many case as well, so they kind of pick who they want to compete with,\" Zavery said. Microsoft refuted the criticism. \"We have listened to and work constructively and directly with independent cloud providers to change our licensing terms, addressing their concerns and providing more opportunity for them. Worldwide, more than 100 cloud providers have already taken advantage of these changes,\" a Microsoft spokesperson said. (Reporting by Foo Yun Chee; Editing by Richard Chang) A group of Chinese researchers from Nanjing University School of Aeronautics unveiled the designs last month. In this article, we discuss the 11 stocks that will profit from AI evolution. If you want to skip our detailed analysis of these stocks, go directly to 5 Stocks That Will Profit From AI Evolution. Artificial intelligence products like automated assistants, chatbots, robotics, and even self-driving vehicles have become all the rage in the […]  Saudi Arabia's first humanoid robot, Sara, has been designed by Riyadh-based QSS to avoid discussing sex or politics, the company's CEO told BI. Despite high labor costs, restaurants with automation are saving money by retaining employees and increasing their agency within the company. People using the app reduced booze intake by an extra two units a week, compared to those who followed standard NHS advice, research indicated.  If you’re looking for the biggest deals included in Amazon’s Big Spring Sale, we’ve got you covered. TVLine has rounded up 17 of the best tech deals, from those little gadgets you never buy (but always need) to major TV discounts. Below are all the best Big Spring Sale tech deals from Amazon’s event. And … Toronto police say a child was taken to hospital with serious, life-altering injuries after being bitten and dragged by a dog at a waterfront playground on Saturday.Officers were called to Little Norway Park, near Lake Shore Boulevard West and Bathurst Street, at about 10:15 a.m.A news release issued Saturday said a woman was inside the playground area with a dog that was off-leash when a father approached the same area with his child.The dog allegedly \"charged toward\" the child through an open The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach You will never turn off your computer again. As some celebrities issued apologies to Kate Middleton, people are demanding Kim Kardashian follow suit. Italy’s one-euro-home sales have attracted interest in recent few years, but towns like Patrica, located south of Rome, have struggled to offload their empty homes. Affected Stellantis employees were “expected to work from home unless otherwise instructed by your manager.\"  “No one’s ever seen a bond this big,\" he complained to Fox News' Maria Bartiromo. The far-right lawmaker's pic goes under the microscope on social media. Snopes looked for the facts about a young girl who had purportedly once been abandoned in a vacant house in the Russian city of Yaroslavl. 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ The Daily Beast/Getty Images/BBCA controversial British royal commentator is under fire for a “disgusting” tweet ahead of Kate Middleton’s Friday announcement that she has cancer and is undergoing chemotherapy.An hour before the Princess of Wales released the video announcement of her diagnosis, Omid Scobie posted a photo on X, formally known as Twitter, of his alarm clock being set to 6 p.m. GMT. Scobie told The Daily Beast that hearing “there would be an announcement of some kind from the Pala ABC News' Jonathan Karl took the Florida Republican on a \"quick trip down memory lane\" with his past comments about the former president. Trump and his MAGA allies have been working for years to pre-rig the 2024 election. Here’s how Team Biden is planning to fight them 網上或實體課專業教師團隊，適合所有程度報讀，定期免費文化活動，體驗不同國家風俗，太子屯門元朗天水圍沙田荃灣均有分校！ Lady Amelia Spencer looked like a breathtaking beach babe as she lounged in a bridal-white swimsuit from Melissa Odabash during her romantic trip to the Maldives with her husband, Greg Mallet A 70-year-old woman said starting a simple workout routine transformed her health, helping her balance blood sugar and heal chronic pain. Commentary as expressed by readers of The Fresno Bee. "
}