{
    "title": "Microsoft, NAB & CITT join forces to boost cybersecurity for Victoria's SMBs",
    "date": "2/17/2024",
    "url": "https://itbrief.com.au/story/microsoft-nab-citt-join-forces-to-boost-cybersecurity-for-victoria-s-smbs",
    "text": "A unique partnership between tech giant Microsoft, the National Australia Bank (NAB), and Communications and Information Technology Training (CITT) has been unveiled, designed to improve the cybersecurity proficiency of the small enterprise sector across Victoria. The venture, amounting to $1 million in financial commitment, also aims to provide practical industry experience to cybersecurity students. Labeled as the Student and Small Business Cyber Risk Project, the scheme partners TAFE Victoria students enrolled in a cybersecurity course with an industry mentor and a small Victoria-based business, to carry out a cybersecurity risk assessment. Small enterprises often grapple with understanding the basics of cybersecurity or where to begin safeguarding their digital assets. Mark Anderson, National Security Officer at Microsoft Australia and New Zealand, expressed satisfaction in assisting with this unique programme, saying, “In many cases, taking a few simple steps can be enough to protect against 99% of cyber threats.” According to the Australian Signals Directorate's recent Annual Cyber Threat Report, the average cost per cybercrime reported for a small business escalated by 15% year on year, reaching $46,000 in 2023. Research from NAB indicates that small businesses feel unprepared to tackle potential cyberattacks. NAB's Chief Security Officer, Sandro Bucchianeri, reflected on the bank's commitment to supporting small businesses, stating, “They are a huge driver of economic growth, employing two in every three Australian workers. Yet, they remain one of the most vulnerable communities to cyber attack.\" He further emphasised the importance of initiatives such as these in preparing small businesses to respond effectively to cyberattacks. The inaugural round of the Student and Small Business Cyber Risk Project concluded successfully in December. Bravo Careers, a Melbourne-based career development firm, was one of the first enterprises to participate. Jonathon Hazelton, Client Relations Manager, oversaw the project and highlighted the impact it had on the business stating, \"The risk assessment was key in helping us understand our current systems and processes, and to receive guidelines and recommendations on how to improve them.\" The pilot round of the programme saw the successful involvement of 64 students and 24 small businesses, with organisers now inviting more small businesses and mentors for the 2024 intake. The expectation is to enrol 200 new students this year and to take this project nationwide in the coming two years. The Victorian Government has invested approximately $400,000 in the programme, which has a total value of close to $1 million with in-kind contributions. Minister for Skills and TAFE Gayle Tierney regarded the Student and Small Business Cyber Risk Project as aligning with their state's initiatives to boost their digital economy and industries like cybersecurity. Similarly, Dominic Schipano, National Executive Officer at CITT, emphasised how the programme fosters new talent while offering small businesses access to a beneficial understanding of cybersecurity within their business. This initiative illustrates the crucial role collaborations can play in bolstering our cybersecurity measures and creating a more secure digital landscape, as stated by Mark Anderson from Microsoft. "
}