{
    "title": "Microsoft UK collaborates with the Digital Revolution Awards",
    "date": "2/16/2024",
    "url": "https://finance.yahoo.com/news/microsoft-uk-collaborates-digital-revolution-080000213.html",
    "text": "LONDON, February 16, 2024--(BUSINESS WIRE)--The Digital Revolution Awards has announced Microsoft as the first of its sponsors for its 2024 edition. Now into its fourth year, the awards recognize brilliance in the cloud technology community, celebrating individuals and organizations that are helping lift up the industry. And now, Microsoft will be supporting the Outstanding Contribution to the Microsoft Community category. The award recognizes individuals who’ve gone above and beyond to inspire and empower users and businesses of all kinds to accomplish more by using Microsoft Cloud products. \"The Digital Revolution Awards has become a prestigious event for Microsoft customers and professionals that work with our products around the world,\" said Rob Smithson, UK Business Applications Lead at Microsoft. \"It offers a perfect chance to celebrate what they have achieved using cloud technology and we’re delighted with this new partnership.\" \"We’re thrilled to welcome Microsoft on board for this year’s awards,\" added Kashif Naqshbandi, Chief Marketing Officer and co-founder of the Digital Revolution Awards. \"As one of the most recognizable names in cloud technology, their knowledge and expertise of what success looks like in the ecosystem is unparalleled. For the individuals and organizations taking part in this year’s awards, either as nominees or sponsors, this is a really exciting announcement.\" Last year’s Outstanding Contribution to the Microsoft Community awards were won by Gregor Suttie (UK and Global), Thomas Maurer (DACH), and Bradley Wyatt (North America). From hosting podcasts or tutorial videos and writing courses, to speaking at or arranging events that help benefit others, the category offers the opportunity to celebrate the unsung heroes who make the cloud a better place to live and work through their passion and advocacy. Speaking on Microsoft’s decision to join the awards as sponsor for 2024, Naqshbandi added: \"I think this is recognition that the Digital Revolution Awards are one of the ultimate accolades for those in the cloud, and we look forward to celebrating those who’ve made a profound impact on the Microsoft community during our awards ceremonies and fundraising later this year.\" As well as raising money for incredible causes around the world through its unforgettable awards ceremonies, the Digital Revolution Awards also highlight a range of topics where individuals and organizations are achieving true brilliance in giving back through cloud technology. These include Outstanding Contribution to the Earth, Tech For Good and Diversity Ally of the Year. Founded in 2020 by Tenth Revolution Group as a way to shine a light on the tech industry as it kept many people and businesses going during the pandemic, the Digital Revolution Awards has become a fixture in the calendar for some of the industry’s biggest and brightest names in the process. This year’s shortlists will be revealed on March 15, with the awards ceremony and fundraiser for the UK taking place in May. The awards’ global show will be broadcast live online in June. View source version on businesswire.com: https://www.businesswire.com/news/home/20240215746378/en/ Contacts Media Enquiries: Jamie MercerE: j.mercer@tenthrevolution.com W: digitalrevolutionawards.com "
}