{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.indiatimes.com/worth/news/satya-nadella-first-email-microsoft-employees-after-becoming-ceo-628207.html",
    "text": "On 4th February 2014, Satya Nadella was named Microsoft’s CEO, becoming only the third person to lead the tech giant after Bill Gates founded it in 1975. Fast forward to today, a decade later, the indian-origin CEO has taken Microsoft onto newer heights, making it only the second company in the world (after Apple) to hit the $3 trillion market cap mark. But how did it all begin? What was Satya Nadella’s reaction to becoming Microsoft CEO? And what was his first email to Microsoft employees? WSJ Talking about his reaction when he learned about Steve Ballmer's departure, Satya Nadella had revealed last year \"Having grown up at Microsoft, first during Bill Gate's tenure, and then Steve Ballmer's tenure, I don't think I ever got up in the morning and thought that someday Microsoft would have neither Bill nor Steve. And quite frankly, when Steve announced that he was going to leave, it was a real shock to me.\" \"I remember quite distinctly one of the board members asking me, \"Do you want to be the CEO?\" And I replied, \"Only if you want me to be the CEO.\" I told this to Steve Ballmer, because the board members were like, \"You know, if you want to be the CEO, you really need to want to be the CEO.\" I said, \"God, I've not thought about it, I don't know.\" Steve Ballmer was very interesting. He said, \"It's too late to change, so just be yourself and see what happens.\" Nadella further added, \"In retrospect, I think the board did what they had to do in the succession process. They looked broadly on the outside, and they looked deep on the inside, and then they made their decision.\" Also Read: Mark Zuckerberg Shares Pic With Satya Nadella satya nadella/getty In his first email to Microsoft employees after becoming the CEO, Satya Nadella mentioned this: Today is a very humbling day for me. It reminds me of my very first day at Microsoft, 22 years ago. Like you, I had a choice about where to come to work. I came here because I believed Microsoft was the best company in the world. I saw then how clearly we empower people to do magical things with our creations and ultimately make the world a better place. I knew there was no better company to join if I wanted to make a difference. This is the very same inspiration that continues to drive me today. It is an incredible honor for me to lead and serve this great company of ours. Steve and Bill have taken it from an idea to one of the greatest and most universally admired companies in the world. I’ve been fortunate to work closely with both Bill and Steve in my different roles at Microsoft, and as I step in as CEO, I’ve asked Bill to devote additional time to the company, focused on technology and products. I’m also looking forward to working with John Thompson as our new Chairman of the Board. While we have seen great success, we are hungry to do more. Our industry does not respect tradition — it only respects innovation. This is a critical time for the industry and for Microsoft. Make no mistake, we are headed for greater places — as technology evolves and we evolve with and ahead of it. Our job is to ensure that Microsoft thrives in a mobile and cloud-first world. As we start a new phase of our journey together, I wanted to share some background on myself and what inspires and motivates me. shutterstock Who am I? I am 46. I’ve been married for 22 years and we have 3 kids. And like anyone else, a lot of what I do and how I think has been shaped by my family and my overall life experiences. Many who know me say I am also defined by my curiosity and thirst for learning. I buy more books than I can finish. I sign up for more online courses than I can complete. I fundamentally believe that if you are not learning new things, you stop doing great and useful things. So family, curiosity and hunger for knowledge all define me. Why am I here? I am here for the same reason I think most people join Microsoft — to change the world through technology that empowers people to do amazing things. I know it can sound hyperbolic — and yet it’s true. We have done it, we’re doing it today, and we are the team that will do it again. Click here to read the complete email. getty Before Satya Nadella was named Microsoft CEO in February 2014, the Bill Gates’ founded company was headed by Steve Ballmer. Steve Ballmer had served as Microsoft CEO from 2000-2014, and was a former assistant of Bill Gates as well. Steve Ballmer had joined Microsoft as its 24th employee in 1980. Steve Ballmer had attended Harvard University, where he met Bill Gates. Ballmer had begun his career at Microsoft as an assistant to the president, though his role at the time was more of a business manager. For the latest and more interesting financial news, keep reading Indiatimes Worth. Click here  Get the NEWS that fits your groove. Subscribe to Indiatimes Newsletter and get handpicked updates based on your interests! Connect With Us On "
}