{
    "title": "With AI, you can bend the curve on innovation: Nadella",
    "date": "2/8/2024",
    "url": "https://www.newindianexpress.com/business/2024/Feb/08/microsoft-to-impart-ai-skills-to-2-mn-people-in-india-by-2025-nadella",
    "text": "BENGALURU: Microsoft chairman and CEO Satya Nadella on Thursday stressed on AI (Artificial Intelligence) opportunities before us and said it can change employee experience, reinvent customer engagement and reshape business processes. \"And most importantly, the curve of innovation in any organisation can fundamentally be bent... that's the transformational opportunities in front of us,\" he said. Addressing 1,100 developers and technology leaders at the Microsoft AI tour in Bengaluru, Nadella said, \"This next generation of AI is changing how and what developers build everywhere, including in India. It’s fantastic to see how India’s developer community is applying our technology and tools to build the future for India and the world.” He also said the company will expand its Code; Without Barriers program to India. This will provide skilling and certification to 75,000 women developers in India in 2024. The programme was launched in 2021 across nine Asia Pacific (APAC) countries to help close the gender gap in the region’s fast-growing cloud, AI, and digital technology sectors. Last year, when he visited Bengaluru, the focus was on ChatGPT. He said, \"We were excited about ChatGPT and in a year's time things have progressed.\" He also spoke about Copilot, which changes the way we work. Also, India is the fastest-growing market on GitHub, a Microsoft-owned software collaboration and innovation platform, with 13.2 million developers using the platform. It is expected to overtake the US as the largest developer community on GitHub by 2027. India also has the second-highest number of generative AI projects on GitHub after the US. On Wednesday in Mumbai, Nadella announced Microsoft’s new skilling investment in India to empower people and organisations to thrive in the AI era. The investment will see Microsoft provide 2 million people in India with AI skilling opportunities by 2025 through its ADVANTA(I)GE INDIA initiative. Follow The New Indian Express channel on WhatsApp Download the TNIE app to stay with us and follow the latest  Copyright - newindianexpress.com 2024. All rights reserved. "
}