{
    "title": "Analysts warn that Microsoft's Windows 10 decision could lead to massive \nconsequences — here are your options",
    "date": "2/3/2024",
    "url": "https://www.thecooldown.com/green-business/microsoft-ending-windows-10-support-recycle-pcs/",
    "text": " © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. \"Microsoft has repeatedly reported on its progress, or lack thereof …\" Photo Credit: iStock Microsoft is not only failing to meet its stated goal to \"advance sustainability,\" but the company is also taking giant strides in the wrong direction — again. Microsoft recently announced that it's ending its support for the Windows 10 operating system in October 2025, which could render hundreds of millions of personal computers obsolete. While Microsoft has laid out plans to provide security updates for devices running on Windows 10 until October 2028, for a price, many devices will be left without security updates as well as any software updates whatsoever. For many, it would be more cost-effective to just move on to a new device. While not every soon-to-be obsolete PC will find its way to a landfill, the potential for added waste is huge. The electronic waste from these PCs could weigh over 1 billion pounds. This flies in the face of Microsoft's stated goal of being \"carbon negative by 2030,\" which the company announced in January 2020. Microsoft has repeatedly reported on its progress, or lack thereof, in decreasing its carbon footprint but has yet to address its contribution to landfills. With this move, Microsoft could join hundreds of other large corporations that are responsible for the huge majority of plastic waste around the world, waste that will take hundreds or even thousands of years to decompose. There are options for those looking to hang on to their Windows 10 PCs and keep them out of the landfill, but Microsoft doesn't leave much room for anything other than ditching your PC and buying new. The best bet is to upgrade your old hardware to Windows 11, but if your device doesn't meet the minimum system requirements, Microsoft has disclaimers informing you that there may be malfunctions and that you're not guaranteed to receive updates, including security updates. Recycle your PC. There are parts that can be reused. PC hard drives contain materials that can be recycled for use in the production of electric vehicle motors and batteries and renewable energy sources such as wind turbines. Join our free newsletter for cool news and actionable info that makes it easy to help yourself while helping the planet. © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. "
}