{
    "title": "Big Tech's earnings season has taught us 2 big lessons — so far",
    "date": "2/10/2024",
    "url": "https://finance.yahoo.com/news/big-techs-earnings-season-has-taught-us-2-big-lessons--so-far-152744093.html",
    "text": "Big Tech’s earnings season is in full swing, and though AI chip giant Nvidia (NVDA) won’t report its results until Feb. 21, there are plenty of insights to glean already. Chief among them is that AI continues to push a huge portion of the conversation for corporate earnings and that fundamental business practices are still important. So far, Alphabet (GOOG, GOOGL), Amazon (AMZN), AMD (AMD), Apple (AAPL), Intel (INTC), Meta (META), and Microsoft (MSFT) have largely posted solid reports, but not every company is seeing positive stock moves. Shares of Apple and Google parent Alphabet fell after they reported disappointing sales in their China and advertising businesses, respectively, while shares of Intel and AMD were hammered on lower-than-expected outlooks for the current quarter. Amazon, Meta, and Microsoft, meanwhile, are riding high thanks to big moves in their most important business segments, including consumer sales, advertising, and the cloud. And while it might not seem like it, there are some common threads running through the stock market’s reaction to these earnings reports. From AI investments to advertising and regional sales, Big Tech’s latest earnings have laid out some valuable lessons. If you need more proof that Wall Street’s obsession with AI is still going strong, look no further than how many companies talked up the technology during their earnings calls. Microsoft said its AI offerings added a 6% revenue boost to its Azure cloud business, up from a 3% contribution in the prior quarter, and 1% in the quarter before that. That might not sound like a huge amount, but it allows Microsoft to illustrate that its AI moves are beginning to pay off. UBS analyst Karl Keirstead wrote in an investor note following the company’s earnings that the quarter-over-quarter increase in AI’s growth is proof Azure is seeing a “flow-through of AI demand”’ and a return on capital expenditures. Wedbush analyst Dan Ives, meanwhile, said that Microsoft’s AI-powered Copilots are drawing plenty of interest from enterprise customers. Microsoft’s Copilots are essentially AI-powered apps and include Copilot for Microsoft 365 and the Windows Copilot, which now comes installed on Windows 11 computers. “Copilot conversions appear to be exploding across the MSFT ecosystem as the AI Revolution has begun with partners/customers lining up for the Copilot deployments,” Ives wrote in a note. Microsoft wasn’t the only company to call out AI. Amazon debuted its new Rufus generative AI shopping bot just ahead of earnings, helping the company better illustrate how generative AI fits into its consumer offerings. Alphabet CEO Sundar Pichai also brought up his company’s AI investments at the top of its earnings call, laying out how the technology is being integrated into Google Search, while Meta CEO Mark Zuckerberg hit on that company’s AI moves and investments. “If we succeed, everyone who uses our services will have a world-class AI assistant to help get things done, every creator will have an AI that their community can engage with, every business will have an AI that their customers can interact with to buy goods and get support, and every developer will have a state-of-the-art open-source model to build with,” Zuckerberg said during his company’s earnings call. Intel and AMD, meanwhile, discussed their AI chips and the momentum they’re seeing in the space. Finally, Apple’s Tim Cook revealed that the company is diving deeper into AI with generative AI investments. “We’ve got some things that we are incredibly excited about that we will be [showing] later this year,” Cook said during the call. \"I think there is a huge opportunity for Apple with [generative] AI and AI,\" he later added in response to an analyst's question. We’ll likely learn more about Apple’s AI moves during its Worldwide Developers Conference (WWDC) in June. Investors hope the technology will provide a boost to iPhone sales by adding new features that get customers itching to upgrade. While AI continues to drive much of the conversation around Big Tech earnings, this season also taught us that business fundamentals are still key to driving share prices on Wall Street. Alphabet and Apple proved that the hard way. While both companies beat analysts’ expectations on the top and bottom lines, they also missed anticipated revenue in specific business segments. Alphabet fell short on ad revenue in the quarter, posting $65.5 billion versus expectations of $65.8 billion. Alphabet shares dropped following the news. Apple, meanwhile, reported better-than-anticipated earnings and revenue, as well as iPhone sales, but the company’s stock took a hit on news that sales in China not only missed expectations but also fell year over year as well. While analysts didn’t seem too concerned about the slowdown in sales in Apple’s third-largest market behind North America and Europe, investors clearly were, as shares went south after the report. Nvidia will be the last of the Big Tech companies to report its earnings, on Feb. 21. Expectations for the company are sky-high after it posted better-than-anticipated earnings in the prior quarter. And if it manages to beat with strong AI sales, it’ll prove both of this earnings season’s lessons true. Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. For the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here Read the latest financial and business news from Yahoo Finance Related Quotes "
}