{
    "title": "Work smarter not harder: Microsoft employee shares what it's like having \nunlimited vacation time",
    "date": "1/8/2024",
    "url": "https://www.dailymail.co.uk/news/article-12938733/Work-smarter-not-harder-Microsoft-employee-shares-like-having-unlimited-vacation-time.html",
    "text": "By Emma Saletta For Dailymail.Com Published:  17:05 GMT, 8 January 2024   |  Updated:  17:13 GMT, 8 January 2024  124 View  comments  A woman who works at Microsoft shared what it's like to work with the company and her outstanding amount of vacation time. Mariana Antaya posted a TikTok video on December 25 confirming that Microsoft allows all their employees to have unlimited paid vacation time. 'We have unlimited paid time off,' Antaya stated. Antaya, who recorded the video while relaxing on a beach, added in its description that she took the clip in Abu Dhabi. The video has racked in nearly 900,000 views and is now one of her most-watched clips on her TikTok handle @mar_antaya. Microsoft employee Mariana Antaya posted a TikTok video on December 25 confirming that that the company allows all their employees to have unlimited paid vacation time Antaya's video has racked in nearly 900,000 views since she posted the video and one of her most-watched clips on her TikTok handle @mar_antaya Antaya, who recorded the video while relaxing on a beach, added in its description that she took the clip in Abu Dhabi According to Antaya's LinkedIn, the TikToker has been a full-time product manager at Microsoft since June 2023. She is currently building a crypto strategy portfolio optimization tool for financial advisors and independent traders. It's unclear how big Antaya's workload is, but it does play a small role in the unlimited vacation time Microsoft gives her. 'You can go on vacation as long as you get your work done and you're finishing and accomplishing all of your tasks,' said Antaya. It can also depend on the work team, and the product manager said that she is 'very lucky' that hers is focused on 'work-life balance.' 'They actually encourage us to take vacation whenever we need it and spend time with our families.' Antaya's unlimited paid time off is appealing to some TikTokers, but others have expressed how much they dislike the Microsoft corporation. Antaya's LinkedIn has been a full-time product manager at Microsoft since June 2023 and is building a crypto strategy portfolio optimization tool for financial advisors and independent traders Work smarter not harder #worklifebalance #bigtech #FAANG #microsoft #google #hubspot She explained that employees can go on vacation as long as you get your work done and you're finishing and accomplishing all of your tasks 'Need to look you up at teams and see what product you are working for. I have the exact opposite experience at Microsoft lmao,' a TikTok user wrote. Some TikTok users called paid time-off 'a scam,' but one user who worked at Microsoft expressed his love for the company. 'I worked at MSFT as a TPM for 4 years and LOVED it. Starting at Google on Monday,' wrote TikToker Haley Diederich. Others have written about their own work experiences with unlimited paid time-off, one of which called it 'the best thing' while she worked at an Adtech company. Antaya has not replied to every comment, but she did confirm that she works in the 'teams' unit at Microsoft while responding to a TikToker who works at the company. The Microsoft employee also gave shout outs to Google and HubSpot for their work-life balances and gave advice to TikTokers hoping to work for either company.   Antaya has hardly responded to any of the TikTokers who commented on her video, but she did confirm that she is a member of the Teams unit at Microsoft Some TikTokers have trashed the company in the comment section. One of the commenters works at Microsoft and wrote that they do not have the same luxury Antaya explained that Google and HubSpot are two other tech companies with great work-life balances and that one of them has 'a really healthy work-life balance' Antaya stated that employees at Google should know that the company is very 'team dependent' and applicants can get a feel of the work-life during interviews. 'When you're interviewing, kind of get a feel in the sense of what the work-life balance is like and if your manager encourages you to take vacations, spend time with family, etc.,' she stated. The project manager then stated in her video that HubSpot has 'a really healthy work-life balance.' Antaya, who's never worked at HubSpot, learned about this from her peers and other company employees she knows. 'I think their culture really puts their employees first, and that is definitely apparent through the happiness that I know from people who work there,' she said. Daily Mail has reached out to Antaya for comment. Share what you think The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group "
}