{
    "title": "Microsoft introduces Copilot Pro AI assistant to small businesses",
    "date": "1/17/2024",
    "url": "https://dynamicbusiness.com/topics/technology/microsoft-introduces-copilot-pro-ai-assistant-to-small-businesses.html",
    "text": "via blogs.microsoft Yajush Gupta January 17, 2024 Microsoft is enhancing accessibility to its AI assistant, Copilot, through the introduction of a $20-per-month consumer version. This version incorporates the latest ChatGPT technology and image creation tools from OpenAI, with a primary objective of expanding the user base, particularly among smaller businesses. Moreover, Copilot for Microsoft 365 is now accessible to small businesses subscribed to Microsoft 365 Business Premium and Business Standard, allowing customers to obtain between one and 299 seats at a rate of $30 per person per month. For consumers utilizing Office’s cloud services, Copilot is now available to assist in tasks such as answering queries, summarizing data, and content generation in Word, Outlook, Excel, and PowerPoint. A notable enhancement is the removal of the previous 300-seat purchase minimum for commercial plans, making Copilot accessible to Office 365 E3 and E5 customers without requiring a Microsoft 365 license. This strategic move aims to provide a more inclusive and flexible experience for a broader range of users. Copilot Pro introduces several new features for users: In early 2023, Microsoft introduced Copilot, an AI chatbot powered by ChatGPT, and later integrated it with Microsoft 365 productivity services. The company reported that within a year of launch, Copilot facilitated five billion chats, and users generated over five billion photos using the text-to-image feature. As of January 2024, marking a year since its launch, Microsoft has rolled out standalone Copilot apps for Android and iOS platforms. Now, the company introduces Copilot Pro, an enhanced service with advanced AI capabilities. While Copilot Pro delivers an optimal experience for individuals, Copilot for Microsoft 365 stands out as our premier offering for organizational use. Previously accessible to enterprises since November, Copilot for Microsoft 365 has seen significant adoption, with 40% of Fortune 100 companies participating in our Early Access Program. Since its general availability for enterprises, esteemed customers such as Visa, BP, Honda, Pfizer, and partners like Accenture, KPMG, and PwC have embraced Copilot, leading to a transformative shift in how thousands of professionals work across various industries. Excitingly, we are thrilled to announce the broadened availability of Copilot for Microsoft 365, now accessible to organizations of all sizes without any seat minimum requirement. This expansion aligns with our commitment to democratizing AI capabilities and empowering businesses to leverage the benefits of an AI-powered copilot. Keep up to date with our stories on LinkedIn, Twitter, Facebook and Instagram. Yajush Gupta Yajush is a journalist at Dynamic Business. He previously worked with Reuters as a business correspondent and holds a postgrad degree in print journalism. Dynamic Business sat down with Mr Rynenberg to discuss how his latest venture, Flexigrow, can help SMEs thrive despite the challenges that lie ahead. Clare Loewenthal September 4, 2023 Expert Judge Jo Buchanan shares winning tips for 2023 Small Business Champion Awards Precedent Productions June 8, 2023 Even as businesses across Australia and New Zealand brace for rising costs ahead, protecting one’s cash flow has never been more crucial. EC Credit Control August 15, 2022 Phone systems have evolved a lot in recent years, bringing cost-savings, and efficiencies that could truly benefit small businesses. Aircall August 8, 2022 For businesses able to pivot, embracing technology and new ideas can provide some exciting momentum and opportunities. Shift July 13, 2022 About Us Dynamic Business has been helping business owners and managers for 27 years © Copyrights 2020 by Dynamic Business - All rights reserved. "
}