{
    "title": "Microsoft's Windows Faces a New Threat From an Old Enemy",
    "date": "1/7/2024",
    "url": "https://www.fool.com/investing/2024/01/07/microsofts-windows-faces-a-new-threat-from-an-old/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Windows is the overwhelmingly dominant operating system running on PCs around the world, and it's been that way for decades. Microsoft's (MSFT -0.15%) ubiquitous OS enjoyed a 72% share of the global desktop operating system market at the end of 2023, with Apple's OS X a distant second at 16%. These figures come from Statcounter and should be interpreted as ballpark estimates, but it's clear that Windows reigns supreme. While Windows remains dominant, it has lost some of that dominance over time. According to Statcounter, Windows' market share has dropped more than 20 percentage points since 2009. The increasing popularity of Apple's Mac computers explains most of that decline, but not all of it. Linux, in all its variants, has become far more prevalent over the past 15 years. Linux had a market share of just 0.68% in 2009. In 2023, that share had ballooned to 3.82%. That's still tiny compared to Windows, but a fivefold increase is notable, nonetheless. While the odds have always been stacked against Linux in the battle for OS supremacy, a fairly recent development could pave the way for further erosion of Microsoft's market share. While Linux distributions have become more user-friendly over time, with some even doing a pretty good job of mimicking the Windows experience, they still require a level of technical know-how that is beyond the typical PC user. Linux is extremely popular among software developers, with around 45% of developers reporting Linux as their preferred OS. But most PC users are not writing code or doing anything more technical than the occasional spreadsheet. For users who are tech-savvy enough to use Linux but don't, one reason for sticking with Windows is the state of the PC gaming industry. Because Windows dominates in terms of market share, PC games are often developed for Windows exclusively. Going through the trouble of porting a game to Linux rarely makes commercial sense, given its minuscule market share. Steam, the leading PC gaming platform, recently published a list of the top-grossing games of 2023. Except for a handful, nearly all of them are built for Windows only. The latest Call of Duty is Windows-only. Cyberpunk 2077 is Windows-only. Grand Theft Auto 5, one of the best-selling games of all time, is Windows-only. The list goes on. With almost no chance that major game developers will ever bother bringing their games to Linux natively, Valve, the company behind Steam, has taken matters into its own hands. Driven by the need to make its handheld Steam Deck, which is powered by Linux, a success, Valve has been working on a compatibility layer called Proton. Built on top of work done by others over the years, Proton translates the Windows-specific bits and enables games built for Windows to run on Linux-based systems. Proton is not perfect, and some games still have major issues. But according to ProtonDB, a website that tracks compatibility, more than 4,300 games are verified to work well on the Linux-powered Steam Deck, while over 13,000 are playable. This is a sea change compared to a few years ago. Windows is still an important business for Microsoft, with the OS generating $21.5 billion of revenue in fiscal 2023, which ended on June 30. The dominance of Windows also contributes to the dominance of Microsoft's Office suite of productivity software, as well as ancillary products like OneDrive cloud storage. Windows will also be critical in Microsoft's efforts to monetize its massive investments in artificial intelligence (AI). Copilot in Windows is an early attempt at an AI-powered assistant, and while its functionality is limited, it could evolve into a powerful tool for Windows users. On the commercial side, Microsoft already charges $30 per user per month for an AI-powered assistant that integrates with its Office applications. Microsoft is likely aiming to eventually generate recurring revenue from AI-powered features built into Windows. Windows will remain the dominant OS for the foreseeable future, but the progress made in bringing PC games to Linux-based systems will likely peel away some tech-savvy users. Windows accounted for just 10% of Microsoft's revenue in fiscal 2023, but its dominance drives revenue in other parts of the company. Windows is going to be at the center of Microsoft's push to turn AI into a real business, and any market share losses will act as a headwind. Timothy Green has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}