{
    "title": "22 Most Famous Hedge Fund Managers and Their Top Stock Picks",
    "date": "1/20/2024",
    "url": "https://finance.yahoo.com/news/22-most-famous-hedge-fund-221339553.html",
    "text": "In this article, we will take a detailed look at the 22 Most Famous Hedge Fund Managers and Their Top Stock Picks. For a quick overview of such stocks, read our article 5 Most Famous Hedge Fund Managers and Their Top Stock Picks. Hedge funds on average underperformed the market in 2023 as investors continued to pull out money amid rise in bond yields, overall volatility and a changing financial landscape. But the $3.4 trillion hedge fund industry saw many blockbuster returns from select hedge funds. For example, SoMa Equity Partners posted a massive 62% gain in 2023, according to a Reuters report. Many notable hedge funds like Coatue Management of Philippe Laffont, Millennium Management of billionaire Israel Englander,  Anson Funds' Investments Master fund posted double-digit returns. Chase Coleman's Tiger Global, which was devastated in 2022 due to its tech investments, rebounded strongly in 2023 and posted  a 28.5% gain in the period, with most of the gains coming in the last quarter of the year, helped largely by tech stocks. While there's no shortage of hedge funds that performed extremely poorly during the year, you have funds like Mulvaney Capital Management which reportedly posted a 51.22% return, according to Reuters. This mixed bag of results and the average underperformance of the hedge fund industry when compared to the S&P 500's strong returns in 2023 only prove Insider Monkey's long-held thesis about the hedge fund industry, recently summarized by its founder and research director Dr. Inan Dogan: \"Hedge funds, usually, underperform the market during bull markets and outperform during bear markets. Most investors don’t understand that hedge funds are “hedged”. When the S&P 500 Index returns 20+% like it did in 2021, it is a certainty that hedge funds will underperform. It is also a certainty that hedge funds will significantly outperform the market when the market declines 18.2% like it did in 2022. Hedge funds lost 4.25% in 2022 according to HFR. That’s an outperformance of 14 percentage points. \" Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this often-ignored indicator Top Stock Pick: Microsoft Corp (NASDAQ:MSFT) Israel \"Izzy\" Englander founded Millennium Management in 1989 with Ronald Shear. As of 2023 the fund has a whopping $61 billion worth of assets under management. The hedge fund operates relative value, equity arbitrage, fixed income and quantitative strategies. As of the end of the third quarter of 2023, Microsoft Corp (NASDAQ:MSFT) was the biggest position of Millennium Management as the fund had a $1.6 billion stake in Microsoft Corp (NASDAQ:MSFT). In its fourth quarter 2023 investor letter, ClearBridge Dividend Strategy stated the following regarding Microsoft Corporation (NASDAQ:MSFT): “Microsoft Corporation (NASDAQ:MSFT) is the largest holding in our portfolio. Given its partnership with OpenAI and leading position in the cloud, Microsoft is well-positioned to profit from the boom in AI. However, due to Microsoft’s tremendous scale and diversification, the company is not dependent upon AI for its success. Microsoft’s diverse portfolio of software and cloud offerings ensures the company will thrive even if the next hot thing, like AI, fizzles out. In this way, Microsoft is emblematic of our broader investing approach. We seek to benefit from powerful trends, but we do so with an eye toward managing risk and limiting downside in case the future turns out to be less rosy than hoped for.” Top Stock Pick: Boston Scientific Corp (NYSE:BSX) Worth about $35 billion today, Ken Griffin started Citadel LLC back in 1990. As of December 2022, the fund had assets under management worth over $62 billion. As of the end of the third quarter of 2023, Microsoft was the biggest position of the fund but since it would be a repetition, we focus on the fund's second-biggest holding, Boston Scientific Corp (NYSE:BSX). Citadel had a $1.1 billion stake in Boston Scientific Corp (NYSE:BSX). Baron Health Care Fund made the following comment about Boston Scientific Corporation (NYSE:BSX) in its Q3 2023 investor letter: “We added to our position in Boston Scientific Corporation (NYSE:BSX), a global developer, manufacturer, and marketer of medical devices that are used in a broad range of interventional medical specialties. We wrote about Boston Scientific last quarter. We believe Boston Scientific can grow revenue in the high single digits, driven by differentiated products used to treat atrial fibrillation, among others. The company held an Investor Day during the quarter at which management established financial targets for the 2024– 2026 period calling for an organic sales CAGR of 8% to 10%, 150 basis points of margin expansion and strong double-digit adjusted EPS growth and improved free-cash-flow conversion. We think this growth profile makes Boston Scientific a compelling name within the large medical device universe.” Top Stock Pick: Horizon Therapeutics Public Ltd Co. (NASDAQ:HZNP) John Paulson, who has a net worth of about $3.5 billion as of January 11, rose to fame in 2007 when he earned a whopping $4 billion, thanks to his bets against the U.S. subprime mortgage lending market via credit default swaps. Paulson founded Paulson & Co. in 1994. The hedge fund's biggest position as of the end of September was Horizon Therapeutics Public Ltd Co. (NASDAQ:HZNP) in which the fund had a $243 million stake. Top Stock Pick: Green Brick Partners Inc (NYSE:GRBK) David Einhorn founded Greenlight Capital in 1996. The fund returned 36.6% in 2022, easily outperforming the S&P 500’s fall of 18.1%. Since its launch in 1996, Greenlight Capital has returned 2,358.3% for an annualized return of 12.8% net. Over the same timeframe, the S&P 500 gained 864% for an annualized return of 8.9%. The fund's biggest stock holding is Green Brick Partners Inc (NYSE:GRBK). Here is what Greenlight Capital has to say about Green Brick Partners, Inc. (NYSE:GRBK) in its Q3 2023 investor letter: “Green Brick Partners, Inc. (NYSE:GRBK) fell from $56.80 to $41.51 during the quarter. The company announced second quarter earnings of $1.63 per share, which far exceeded consensus estimates of $1.18 per share. Full-year estimates for 2023 and 2024 rose from $5.16 and $5.54 to $6.13 and $6.49, respectively. However, the market has become concerned about the impact of higher mortgage rates, and most homebuilding stocks reversed a portion of the gains achieved earlier this year.” Top Stock Pick: Novo Nordisk A/S (NYSE:NVO) James Harris Simons is an American billionaire, award-winning mathematician and hedge fund manager who founded Renaissance Technologies in 1982. According to data compiled by Bloomberg, Jim Simons’ secretive Medallion Fund — closed for outsiders — posted a whopping $55 billion in profit over the last 28 years, about $10 billion more profitable than hedge funds of giants like Ray Dalio and George Soros. Renaissance Technologies' biggest stock holding as of the end of September 2023 was Novo Nordisk A/S (NYSE:NVO)in which the fund had a $1.5 million stake. ClearBridge Sustainability Leaders Strategy made the following comment about Novo Nordisk A/S (NYSE:NVO) in its Q3 2023 investor letter: “Our health care holdings also fared well. The sector has been largely overlooked in 2023 amid AI exuberance, but its defensiveness is looking more salutary as tighter monetary policy begins to sap market sentiment. Novo Nordisk A/S (NYSE:NVO) shares rose on continued unprecedented demand for GLP-1s, which treat diabetes and obesity, and of which Novo Nordisk is one of two major providers. GLP-1s represent the largest commercial opportunity and investable theme in health care.” Top Stock Pick: Tesla Inc (NASDAQ:TSLA) Cathie Wood is one of the most followed hedge fund managers in the Wall Street and is known for her bets on innovative, high-growth companies. In 2014, Wood founded ARK Invest. Cathie Wood's ARK Innovation exchange-traded fund ($ARKK) rallied about 70% in 2023. This was the fund's third best performance in a year since its inception. The biggest position of ARK Invest as of the end of September 2023 was Tesla Inc (NASDAQ:TSLA) in which the fund had a $1 billion stake. Here is what White Brook Capital has to say about Tesla, Inc. (NASDAQ:TSLA) in its Q3 2023 investor letter: “The magnificent seven, that underpin the S&P 500 performance, which includes Tesla, Inc. (NASDAQ:TSLA), now comprise almost 30% of the market capitalization of the S&P500. At least three of the seven stocks have heightened downside risk and suffer from already high penetration, weakening end markets, competitive risk, and lofty valuation. They have been remarkably resilient to increased interest rates and the potential for slowing growth. Small and midcap stocks, on the other hand, have been systemically penalized by fears of recession and continue to price that eventuality even as significantly better outcomes have become more probable. Today, it’s relatively easy to find attractive investments in this segment.” Top Stock Pick: Berkshire Hathaway Inc Class A (NYSE:BRK.A) Guy Spier has risen to fame over the past few years, thanks to his obsession with Warren Buffett and his value principles. The author of the famous value investing book The Education of a Value Investor famously paid $650,100 along with Mohnish Pabrai to have lunch with Warren Buffett. Spier founded the Aquamarine Fund after leaving investment banking career. The fund's biggest position as of the end of the third quarter was, you guessed it, Warren Buffett's Berkshire Hathaway Inc Class A (NYSE:BRK.A) as the fund owned 140,600 shares of the conglomerate. Top Stock Pick: Stellantis NV (NYSE:STLA) Michael Burry is almost always in the news thanks to his blunt predictions which often warn about recessions and market crashes. The Big Short investor rose to fame after he correctly bet against the housing bubble in 2007. In 2000, Michael Burry founded Scion Capital. The fund's biggest stock holding as of the end of September was Stellantis NV (NYSE:STLA) in which the fund had a $7.6 million stake. Top Stock Pick: Energy Transfer LP Unit (NYSE:ET) Billionaire Leon Cooperman is the chariman and CEO of Omega Advisors, which had about $1.9 billion under managed securities as of the end of the third quarter. The biggest stock holding of the fund was Energy Transfer LP Unit (NYSE:ET), in which the fund had a $167 million. Top Stock Pick: Herc Holdings Inc (NYSE:HRI) Billionaire Mario Gabelli is the man behind GAMCO Investors, Inc., formerly known as Gabelli Asset Management Company. Gabelli is a value investor and has impressed the market with high returns over the past several years. Talking to Columbia Business School, the 81-year-old investor talked about the essence of value investing: \"Value investing isn’t focused on short-term market movements. It’s about finding the ignored and unloved companies that nobody covers for whatever reason, with a good business, solid management, and a good price. But you do need to evaluate new trends as they come up. AI, for example, might accelerate the problem of income inequality. Also, there are food, water, and energy shortages. There’s the way capital is allowed to be allocated on a global basis — the regulatory hurdles and the challenges to the free market’s system of allocation. So you have to figure out how to bridge all that.\" The biggest stock holding of GAMCO as of the end of the third quarter of 2023 was Herc Holdings Inc (NYSE:HRI). Top Stock Pick: Amazon.com Inc (NASDAQ:AMZN) Billionaire David Tepper is the man behind Appaloosa Management, a Florida-based hedge fund. Tepper, who also owns Carolina Panthers, managed to post about 18% to 19% gains in 2023, according to a report by Institutional Investor. Tepper's top two holdings as of the end of September were Meta Platforms Inc (NASDAQ:META) and Microsoft Corp (NASDAQ:MSFT). But since these two stocks are already mentioned in our article as the top picks of other hedge funds, let's look at the third biggest position of the billionaire. Tepper's fund had a $477 million stake in the ecommerce giant Amazon.com Inc (NASDAQ:AMZN). In its fourth quarter 2023 investor letter, ClearBridge Large Cap Growth Strategy stated the following regarding Amazon.com, Inc. (NASDAQ:AMZN): “Much of that differential can be attributed to the performance of the Magnificent Seven (Alphabet, Amazon.com, Apple, Meta Platforms, Microsoft, Nvidia and Tesla), a basket of mega cap growth stocks that accounted for 47.8% of the benchmark return for the quarter and 65.4% for 2023. The ClearBridge Large Cap Growth Strategy maintains exposure to six of the seven stocks, with overweights in Amazon.com, Inc. (NASDAQ:AMZN), Meta and Nvidia. Amazon benefited from strong margin expansion across segments, most notably its core e-commerce business, while Meta saw accelerated revenue growth and share gains in online advertising. Active management of our mega cap exposure contributed to the Strategy outperforming the benchmark both in the fourth quarter and through the narrow leadership market of 2023. We also attribute these improved results to solid stock picking, being opportunistic in adding to or initiating new positions in growth companies at or near the bottom of their earnings cycle, and maintaining a commitment to diversification across our three buckets of growth: select, stable and cyclical.” Top Stock Pick: Activision Blizzard Inc (ATVI) Billionaire Paul Tudor Jones  founded Tudor Investment Corporation in 1980. As of the end of the September quarter the hedge fund had a portfolio worth about over $9 billion. The biggest stake of the company was in Activision Blizzard which is now going under the ownership of Microsoft. Jones' fund had a $284 million stake in the company as of the end of the September quarter. Top Stock Pick: PG&E Corporation (NYSE:PCG) Daniel Seth Loeb started Third Point in 1995. The fund today has $10.8 billion in assets for sovereign wealth funds, endowments, foundations, corporate & public pensions, high-net-worth individuals, and employees. The fund returned -2.2% on a NAV basis in September 2023, compared with a -4.3% return for the MSCI World Index and a -4.8% return for the S&P 500 Index. As of the end of the September 2023 quarter, PG&E Corporation (NYSE:PCG) was the biggest position of the hedge fund. Third Point reported owning 57 million shares of the company. Top Stock Pick: Chipotle Mexican Grill Inc. (NYSE:CMG) Bill Ackman is currently in the news for his relentless outburst against Harvard University and reports alleging his wife was involved in academic plagiarism. Regardless of this hullaballoo, Ackman is among the top money managers in the world, having started Pershing Square Capital in 2004. In 2023, Pershing returned  26.7%. As of the end of the September quarter, the hedge fund's biggest position was Chipotle Mexican Grill Inc. (NYSE:CMG), in which the fund had a $1.7 billion stake. Over the past one year the stock has gained about 51%. ClearBridge Mid Cap Growth Strategy made the following comment about Chipotle Mexican Grill, Inc. (NYSE:CMG) in its Q3 2023 investor letter: “In the consumer discretionary sector, Chipotle Mexican Grill, Inc. (NYSE:CMG) proved a detractor as investors were disappointed in management’s decision not to push additional menu pricing, which resulted in full year guidance falling short of expectations. However, we believe this is just a timing mismatch as their value proposition relative to peers leaves room for continued strong pricing power.” Top Stock Pick: Apple Inc (NASDAQ:AAPL) Worth $7.9 billion today, Ken Fisher is one of the most renowned hedge fund managers in the world. Ken Fisher founded Fisher Investments back in 1979. Fisher Investments today manages over $236 billion in assets. Ken Fisher is bullish on the market. He recently wrote in an article for that The Globe and Mail that he sees \"double-digit gains for both S&P 500 and the MSCI World Index, with tech and big growth stocks leading early on.\" Apple Inc (NASDAQ:AAPL) is the biggest holding of Fisher Investments as of the end of the third quarter of 2023. The fund owned a whopping $9.2 billion stake in Apple Inc (NASDAQ:AAPL). In its fourth quarter 2023 investor letter, ClearBridge Dividend Strategy stated the following regarding Apple Inc. (NASDAQ:AAPL): “We meaningfully reduced our exposure to Apple Inc. (NASDAQ:AAPL) in 2023. Apple is the largest company in the world and produces terrific products that engage users for hours each day. Despite the company’s size, ubiquity and relevance, however, Apple’s growth has slowed dramatically. Its fiscal 2023 earnings were flat with those of 2022. Apple trades at 30x earnings; sustaining that multiple will require a meaningful acceleration in revenues. While such an improvement is possible, we do not see any obvious catalysts for adding tens of billions of dollars to Apple’s topline. Consequently, the risk-reward skews negatively.” Top Stock Pick: Procter & Gamble Co (NYSE:PG) Ray Dalio in 1975 founded Bridgewater Associates which went on to become the largest hedge fund in the world. According to Forbes, the hedge fund has over $124 billion in assets under management. According to Bloomberg, Bridgewater's flagship hedge fund lost about 7.6% in 2023, while its long-only All Weather fund climbed 10.6% in the period. As of the end of the third quarter of 2023, Procter & Gamble Co (NYSE:PG) was the biggest holding of Ray Dalio's Bridgewater as the fund reported owning a $700 million stake in Procter & Gamble Co (NYSE:PG). Hayden Capital made the following comment about The Procter & Gamble Company (NYSE:PG) in its third 2023 investor letter: “It’s not just emerging markets either, where one could argue a “scarcity premium” given fewer quality public companies. Even in the US, Coca-Cola trades at ~30x P/E despite having the same earnings as 10 years ago. The Procter & Gamble Company (NYSE:PG) is likewise at ~27x P/E, with earnings only ~12% higher than a decade ago (or a ~1% annual growth rate). This equates to a mere 3.3% – 3.7% earnings yield. Both of these companies actually have lower revenues than 10 – 15 years ago too, indicating that their profit growth is mostly from margin expansion. This can only last for so long before there’s no more excess expenses left to cut. I find it ironic that all these companies trade as “bond-equivalents” in the minds of investors – even commanding lower yields than US treasuries, the safest security in the world. But it’s clear that their businesses are not nearly as safe. Proctor & Gamble is facing disruption from direct-to-consumer brands that offer their products for a fraction of the price. But these companies are ~35% more expensive than US Treasuries, despite the heightened risk. On a risk-adjusted basis, one could argue the implied premium is even higher. Perhaps the explanation is simply the price volatility difference between these stocks and treasuries over the last two years. For example, 10-year Treasury bonds are down ~-20% since the beginning of 2022. By comparison, KO and PG are remarkably down only -4 – 6% over that time frame.” Top Stock Pick: Meta Platforms Inc (NASDAQ:META) Having worked under legendary investor Julian Robertson, Chase Coleman rose to higher ranks in the money management industry with speed thanks to Robertson giving Coleman about $25 million after he shuttered his own fund Tiger Management. The famous tiger cub founded Tiger Global in 2001. According to Forbes, Coleman's worth today is about $5.7 billion. Tiger Global's biggest stock position as of the end of September 2023 was Meta Platforms Inc (NASDAQ:META), in which the fund had a $2.7 billion stake. In its fourth quarter 2023 investor letter, ClearBridge Large Cap Growth Strategy stated the following regarding Meta Platforms, Inc. (NASDAQ:META): “Much of that differential can be attributed to the performance of the Magnificent Seven (Alphabet, Amazon.com, Apple, Meta Platforms, Microsoft, Nvidia and Tesla), a basket of mega cap growth stocks that accounted for 47.8% of the benchmark return for the quarter and 65.4% for 2023. The ClearBridge Large Cap Growth Strategy maintains exposure to six of the seven stocks, with overweights in Amazon.com, Meta and Nvidia. Amazon benefited from strong margin expansion across segments, most notably its core e-commerce business, while Meta Platforms, Inc. (NASDAQ:META) saw accelerated revenue growth and share gains in online advertising. Active management of our mega cap exposure contributed to the Strategy outperforming the benchmark both in the fourth quarter and through the narrow leadership market of 2023. We also attribute these improved results to solid stock picking, being opportunistic in adding to or initiating new positions in growth companies at or near the bottom of their earnings cycle, and maintaining a commitment to diversification across our three buckets of growth: select, stable and cyclical.”  Click to continue reading and see the 5 Most Famous Hedge Fund Managers and Their Top Stock Picks.  Suggested Articles: Billionaire Paul Singer's Recent Activist Targets and Top Stock Picks Cliff Asness Stock Portfolio: 10 Top Stock Picks Dan Loeb Stock Portfolio: 10 Top Stock Picks Disclosure. None. 22 Most Famous Hedge Fund Managers and Their Top Stock Picks was initially published on Insider Monkey. Related Quotes "
}