{
    "title": "Microsoft: Azure Taking Share With AI Push (NASDAQ:MSFT)",
    "date": "1/23/2024",
    "url": "https://seekingalpha.com/article/4664547-microsoft-azure-taking-share-with-ai-push",
    "text": "Gary Hershorn/Corbis News via Getty Images Gary Hershorn/Corbis News via Getty Images Microsoft (NASDAQ:MSFT) isn't the cheapest stock, but it has set itself up to be one of the biggest beneficiaries of the AI revolution, making it a \"Buy.\" MSFT is a technology company that operates in three segments: Productivity and Business Processes, Intelligent Cloud, and More Personal Computing. Its Productivity and Business Processes segment houses its Office 365 business that includes its well-known software programs such as Word, Excel, and Outlook. It also includes employment social media site LinkedIn, as well as Dynamics 365, which includes ERP and CRM applications. The segment represented 33% of its FY23 (ended June) revenue and 39% of its operating income. MSFT's Intelligent Cloud segment, meanwhile, is home to its public, private, and hybrid server products and cloud services offerings. This includes Azure, as well as SQL Server, Windows Servers, Visual Studio, and System Center. The segment also includes Nuance, its voice recognition and transcribing business, and its AI-powered developer platform GitHub. The segment also includes enterprise and partner services. The segment accounted for 41% of its FY23 revenue and 43% of its operating income. Finally, its More Personal Computing Segment is home to its Windows Operating System. The segment is also comprised of its Xbox gaming unit and its Bing search engine. Devices, such as Surface, HoloLens, and PC accessories are also found in this segment. The segment was 26% of its FY23 revenue and 19% of its operating income. The company also has an investment and partnership with OpenAI, the maker of ChatGPT. While it seems like nearly every company is looking to drive growth through AI, MSFT is at the forefront leading the charge. It is going all-in on AI across its tech stack, from Azure, to Office 365 applications, to Bing search, to LinkedIn. The biggest growth driver for MSFT has been with Azure, which has been taking share as organizations continue to migrate to the cloud. Fiscal year 2024 has been off to a hot start with Azure revenue up 29%, 28% in constant currencies, in FQ1 (ended September). For FYQ2, which will be reported at the end of the month, the company is projecting Azure growth of 26-27% in constant currencies. Given its usage model and the rapid consumption of AI that it has seen, I'd expect it to moderately top this number. Company Presentation Company Presentation The strong Azure growth is being fueled by increased AI consumption. Azure uses a pay-as-you-go model, so the more customers use services, such as Azure AI, the more revenue MSFT generates. Prices are often based on hourly rates or usage. In addition to AI, Azure is also benefiting from cloud migrations to Azure Arc, which is MSFT's solution for hybrid and multi-cloud management. It is the only cloud provider running Oracle's (ORCL) database services, which is allowing customers to migrate their on-prem ORCL databases to the cloud. The company saw its number of Arc customers increase 140% in the quarter to 21,000 as a result. Speaking at a UBS conference at the end of November, Corporate VP of Azure Alysa Taylor said: How critical data is to building out unique AI experiences, the partnership that we have with Oracle was actually a direct request from our customers of being able to bring their Oracle databases into Azure. And so we have a very unique partnership where you can run your OCI database directly in Azure. So as you're modernizing and that governance management and modernization can happen in a very integrated way. And for us, it gives Oracle's over 400,000 customers the ability to bring OCI directly into Azure and run natively in an Azure environment. And so we've worked to be able to architect that in a way that is most beneficial to customers so they can just literally take OCI, run it in Azure and then have all of the ancillary Azure services that we talked about to be able to do the management, governance and modernization.\" In addition to AI helping Azure, the company is also bringing AI services and Copilots, its AI chatbot and assistant, to various of its offerings. This fall the company began introducing a number of Copilot options, such as 365 Copilot AI assistant, which can help users do things such as summarize documents and improve upon Excel analysis. The add-on is being sold to enterprises for $30 per month per user, with a minimum of 300 users needed. On its FQ1 call, MSFT said that 40% of the Fortune 100 was already testing the service as part of its early access program. The company is also launching other copilots into areas such as sales and services, as well as employee engagement & performance through its Viva offering. Gitbub, meanwhile, has seen a huge boost after the introduction of its copilot, with a 40% sequential increase in organizations subscribed to Copilot for business. MSFT has even brought AI to LinkedIn earlier in 2023 introducing AI-assisted messages for recruiters. This helped LinkedIn grow revenue by 8% in FQ1 despite a tough environment for recruiting and advertising. MSFT could also see a boost in Windows revenue, as AI is likely to lead to a PC refresh cycle. Many programs that run AI need more powerful computing. With Windows deployed on most non-Apple (AAPL) computers, MSFT could see a nice boost from a part of its business that has struggled. Gaming is another nice opportunity for MSFT, especially after its recent acquisition of Activision Blizzard which was completed in October. Xbox Game Pass has been doing well, and Activision Blizzard will only improve the depth of its content. Meanwhile, it will be interesting to see how AI can be applied to games in areas such as NPCs (non-player characters) and customization. MSFT's next-gen console isn't expected until 2028, but it could be one of the most important, and profitable, refreshes in its history. When it comes to risks, competition in the cloud service space is perhaps the biggest. Amazon (AMZN) has seen its AWS growth slow in 2023, as well as its operating margins, which were 26.2% through the first nine months of the year versus 30.0% last year. AMZN is a company that will fight for shares and has shown in the past that it is willing to sacrifice margin. Cloud Infrastructure Market Share (Statista/Synergy Research Group) Cloud Infrastructure Market Share (Statista/Synergy Research Group) Regulation is another risk. According to reports, both the Department of Justice and the Federal Trade Commission are looking into antitrust issues with MSFT and its relationship with and investment in OpenAI. With MSFT's biggest push being AI solutions powered by OpenAI, this adds a bit of risk to the story. MSFT currently trades at about 24x FY24 EBITDA (ending June) estimates of $121.3 billion. Based on the current FY25 EBITDA consensus of $149.2 billion, the stock trades at a 19.5x multiple. Revenue is projected to grow 14.6% in FY24 and 14.1% in FY25. MSFT currently has a free cash flow yield of about 2.1% based on FCF of $63.3 billion in the last trailing twelve months. MSFT is among the more expensive mega-cap tech stocks but towards the middle of large-cap software names. MSFT Valuation Vs Peers (FinBox) MSFT Valuation Vs Peers (FinBox) Since after the pandemic, MSFT has traded between 20-26x EBITDA. Given that multiple ranges, its fair value range based on FY25 EBITDA would be $410-$530, with a midpoint of $470. Given that the company historically tops estimates, I would expect it to continue to do so, led by Azure AI consumption and adoption of AI copilots. MSFT has really taken the lead with AI, and the company has a lot of potential growth in front of it due to this. Azure has been the biggest beneficiary so far, and it has clearly been taking shares away from AWS. The rollout of AI to the rest of its products and services, as well as a potential PC refresh cycle, set the company up well in the coming years. MSFT's stock is not cheap, but it does actually trade at a bit of a discount to some of its large-cap software peers. The stock is right on the brink of \"Buy\" territory for me, but given its tailwinds, I will start it out as a \"Buy\" with a $470 target. I expect the company to continue to see strength in Azure and a nice boost to Office 365 when it reports its results later this month. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}