{
    "title": null,
    "date": "1/18/2024",
    "url": "https://blogs.microsoft.com/on-the-issues/2024/01/18/2024-washington-state-legislative-priorities-ai-education/",
    "text": "Jan 18, 2024\n\n| \n\tColleen Kerr - Senior Director, Government Affairs In keeping with our commitment to transparency regarding Microsoft’s public policy priorities, we annually share our legislative agenda for the coming year. This year, that agenda is prefaced by two major milestones. First, this will be the last legislative session of Jay Inslee’s tenure as Governor of Washington. Microsoft thanks him, his administration, and the legislators with whom he has partnered over the past 12 years, for their many contributions to the health and well-being, vitality, and future success of our state. During Gov. Inslee’s administration, Washington faced the unprecedented challenge of a global pandemic, an event that changed all of us. But our state also made major investments in housing, infrastructure, education, and clean energy – including passing the most comprehensive climate policy of any state. These are investments that will benefit generations to come. We have another major milestone on the horizon: Microsoft’s 50th anniversary as a company, which we will celebrate in April 2025. Over its history, our company evolved from selling packaged software to providing digital services to creating a connected cloud computing environment to now being a leader in both the development of generative AI and in helping to establish a foundation for the responsible use of artificial intelligence technology. Like everything, we owe our ability to grow to the environment in which we sit. For Microsoft, our home is Washington state. It’s not an exaggeration to say that our success as we have evolved over our history has depended on decisions like those made by Gov. Inslee and current legislative leaders, and by those who have come before them. These public leaders have worked to create an environment focused on innovation, growth, and equity. This approach has helped position both Microsoft and the region as leaders in a range of game-changing technologies like AI and cloud computing, quantum computing, and hydrogen energy production and fusion. Together, we are now at the forefront of the global economy. In short, Microsoft has grown and thrived because we are located in a state that has created the conditions allowing our company and many others to grow and thrive. Given this history, and with both our corporation and some 50,000 of our employees calling Washington home, we remain committed to seeing the Pacific Northwest maintain its competitive economic position globally, ensure equitable economic opportunities, and provide a high quality of life for everyone living here. These are the foundational goals we keep in mind as we continue our long-standing policy partnerships and investments in education, housing, transportation, and economic opportunity. Both economic opportunity and quality of life begin with a good job. More than ever, rewarding and satisfying job opportunities require skills and credentials beyond a high school diploma. This includes high-demand fields like computing and health care. In fact, the most recent estimates are that 72% of the jobs in the future will require some form of post-secondary credential, but only 40% of Washington high school students earn such a credential by age 26. In response to these trends, we have two policy priorities for the 2024 session: We must continue to expand rigorous computer science education at all levels – K-12, community and technical colleges, and our four-year public universities; and we must increase enrollment in all manner of post-secondary education for Washington students so that Washington students are prepared for Washington jobs. For context, legislators have made significant commitments to create pathways for all students to pursue those credentials; we rank second in the nation in financial aid availability, with a broad range of programs ranging from the Washington College Grant to the unique public-private partnership that funds the Washington State Opportunity Scholarship. Unfortunately, these resources are not being fully utilized; we are second-to-last in the nation for student completion of the FAFSA form that’s required to secure many sources of aid. Thus, we encourage legislative and education leaders to: Another key component of quality of life is safe and stable housing that is affordable and convenient to jobs, services, and community. Put simply, we need more housing of all types and for all income levels, across Washington – and especially in the Puget Sound region. In its 2023 session, the legislature made substantial progress in support of that goal: A billion dollars in new housing investments were made, including the historic investments in the Housing Trust Fund and the expansion of the Land Acquisition Program overseen by the Washington State Housing Finance Commission, a program that Microsoft was proud to support with three-to-one matching funds and that is already producing results. Additional progress was made in removing zoning and other regulatory barriers to the creation of new housing options. But a Department of Commerce analysis shows that Washington still needs an additional one million housing units over the next two decades; this isn’t a problem that appeared overnight, and it’s not a problem that can be solved in a single year. So, lawmakers must continue to pursue a wide range of additional housing strategies to address the growing demand for and rising cost of housing. In addition to spurring housing construction and significantly increasing the supply of housing, we must also take steps to address other impacts of the housing shortage. Homelessness, coupled with the opioid crisis and other behavioral health issues, has led to unprecedented challenges for the state’s emergency rooms, which are being overrun. Challenge Seattle has issued a report that includes a series of recommendations for responding to this emergency, and we are asking the legislature to review and adopt those strategies. Transportation is critical to maintaining regional economic competitiveness, supporting sustainable growth, and preserving and improving our local quality of life. The next major transportation budget will be developed in 2025. In advance of that, however, there are key decisions to be made around existing projects, namely ensuring timely completion of the 520 bridge corridor project. We also made some progress moving high-speed rail closer to reality when we received recognition and an initial grant from the Federal Corridor Identification Program. This puts us in line for additional federal investment and it’s critical that we preserve the matching state dollars in the current transportation budget to leverage those federal investments. In 2020, when Microsoft announced its commitment to become carbon negative by 2030, we pledged to also become active participants in public policy discussions to emphasize the unbreakable link between electricity policy and carbon policy and help advance global decarbonization efforts We must work together to get as much firm, green power onto the power grid as quickly as possible. This will require taking a hard look at our permitting and siting processes and identifying ways to make them more efficient, so that green resources can be brought on line more quickly. Use of digital tools, including artificial intelligence, must be considered to further improve resource siting and permitting processes. Ultimately, we cannot afford to focus on a single solution; we need an “all of the above” approach to plotting our clean energy future. In addition to hydro, solar, wind, and other energy sources traditionally considered renewable, the state must now turn its attention to continuing to meaningfully advancing research and development of nuclear and fusion as potential sources of safe and abundant energy. Microsoft is a technology company and today, we are collectively in a new age of reason, powered by technology, led by people, and fueled by innovation. We are also at an inflection point and a unique AI moment. How we manage and respond to rapid advances in artificial intelligence is critical to our collective future. Just as new technologies will redefine the transportation and energy sectors, artificial intelligence will redefine how technology serves all of us, advancing humanity’s ability to think, reason, and express ourselves. We are inspired by the vast potential of AI development to support public good; we are equally realistic about the risk of the technology being used in harmful ways. As such, Microsoft has been and will remain a leader in advocating for the responsible use of AI. Our perspective on this issue, as a company that has been working on these issues directly for a number of years, is contained in our most recent Principles for Responsible AI. We will work with the governor, legislators, and other elected officials as they engage in policy deliberations, and we will support responsible approaches that promote innovation and opportunity for Washington state. As we look forward to the 2024 legislative session, we are energized by how lawmakers’ past decisions have positioned Washington state for success, and we are even more optimistic about the opportunities that lie ahead. Tags: affordable housing, AI, artificial intelligence, carbon neutral, education, Responsible AI, sustainability Follow us: "
}