{
    "title": "Microsoft Copilot is now available on iOS and Android",
    "date": "1/3/2024",
    "url": "https://techcrunch.com/2024/01/03/microsoft-copilot-is-now-available-on-ios-and-android/",
    "text": "Over the holiday season, Microsoft quietly launched its Copilot app on Android and iOS, along with iPadOS. The app gives users access to Copilot, formerly known as Bing Chat, which operates similarly to OpenAI’s ChatGPT. Like other AI chatbot, you can type in a question or a prompt and receive responses generated by artificial intelligence. Users can leverage the AI assistant to draft emails, compose stories or scripts, summarize complex texts, create personalized travel itineraries, write and update job resumes and more. Plus, You can use the app’s Image Creator feature, which is powered by DALL·E 3, to explore new styles and ideas, curate social media content, develop brand motifs, generate logo designs, create custom backgrounds, build a portfolio, visualize film and video storyboards and more. Image Credits: Microsoft Image Credits: Microsoft “By combining the power of GPT-4 with the imaginative capabilities of DALL·E 3, Copilot not only enhances your design workflow, but can also bring your creativity to inspiring new heights,” the app’s description reads. Since the app’s launch over the holidays, Copilot been downloaded more than 1.5 million times so far worldwide across both Android and iOS, according to data provided to TechCrunch by mobile intelligence provider, data.ai. With Copilot, you’re getting access to OpenAI’s GPT-4 technology for free, which is pretty significant because OpenAI’s GPT app runs on GPT-3.5 technology and charges for access to GPT-4. The launch of Copilot on mobile comes as Microsoft rebranded Bing Chat to Copilot back in November. It’s worth noting that prior to the launch of Copilot on mobile, you could access similar functionality via the Bing Chat feature on the Bing app. It’s possible that Microsoft may plan to replace the Bing app with the Copilot app, but the tech giant hasn’t shared anything on that front so far. The mobile launch also comes as Copilot has already been available on the web for some time now. With this latest launch, Microsoft is looking to offer Copilot as a standalone service and expand its reach even more. Microsoft brings Copilot to Windows 10  "
}