{
    "title": "Microsoft Teams outage pose issues",
    "date": "1/27/2024",
    "url": "https://borneobulletin.com.bn/microsoft-teams-outage-pose-issues/",
    "text": "NEW YORK (AP) – Microsoft Teams is experiencing an outage that has blocked access for some and led to what Microsoft calls “multiple issues” for many users. The issue began around 11am EST Friday and grew rapidly in scope, according to outage tracker DownDetector. Users have complained of an inability to access the service, delays in sending and receiving messages, and issues displaying graphics. Microsoft said in messages on X, the social network formerly known as Twitter, that it has identified “a networking issue impacting a portion of the Teams service” and had moved some services to backup systems. At roughly 1.30pm EST, the company reported that the backup transition was complete for Europe, Africa and the Middle East and that its tracking systems were showing improvements. The company said that backup switchovers for North and South America were ongoing. Outage reports on DownDetector had fallen to almost half their peak level as of 3pm EST but subsequently leveled off, indicating continued issues. Teams is a messaging and videoconferencing app with over 300 million monthly average users as of March, 2023. X users based in the US continued to complain about Teams service issues, with several sarcastically thanking Microsoft for fixing the problem quickly in regions where the workday is already over. In a subsequent tweet, Microsoft acknowledged that its backup switchover “did not provide immediate relief to all end users in North and South America regions” but said its other attempts at mitigation aimed to “reduce customer impact as quickly as possible.” Microsoft’s public tweets on the subject have pointed to additional detail available in a document posted in an administrative dashboard for Microsoft 365 software. When asked about that document, a Microsoft spokesperson at the public relations firm WE Communications said the company’s X posts were the only information it would share on the subject. But Microsoft offered a somewhat bleaker outlook to its customers in that document, which was obtained by the Associated Press. The document detailed roughly a dozen different issues caused by the outage, including inability to log into the service, missing or delayed messages, and inability to access or view images, video, audio recordings and other media. In an update at 4.26pm EST, the company said its efforts to route around problems had led to issues with backend parts of its system that effectively “throttled” data traffic. At 5.02pm EST, Microsoft also acknowledged that “many customers remain impacted by this issue” but said the company is seeing “a reduction in errors and an increase in (service) availability.” The company has also said its working to address specific failures of Teams functions in parallel with its broader network efforts. According to DownDetector, reported issues with Teams have continued to decline but remained well above normal levels as of 6pm EST. Borneo Bulletin is the leading English daily in the country. It was first published by Brunei Press. Today, Borneo Bulletin has become the foremost source of information on local and foreign affairs, and the region’s business news. © 2013 Borneo Bulletin Online - The Independent Newspaper in Brunei Darussalam, Sabah and Sarawak "
}