{
    "title": "Unlike Alphabet That Seems Locked In The AI Battle, Microsoft Shined With \nIts Quarterly Results",
    "date": "2/1/2024",
    "url": "https://finance.yahoo.com/news/unlike-alphabet-seems-locked-ai-184148131.html",
    "text": "On Tuesday, Google-parent Alphabet Inc (NASDAQ: GOOG)(NASDAQ: GOOGL) and Microsoft Corporation (NASDAQ: MSFT) reported their quarterly results. While Alphabet disappointed Wall Street as its holiday-season advertising sales were short of expectations, Microsoft topped analyst estimates. On Wednesday, Microsoft also became the second-ever company worth $3 trillion, joining Apple Inc (NASDAQ: AAPL) with its value topping that of France’s GDP. For the quarter ended on December 31st, Microsoft reported revenue rose roughly 17.5% YoY to $62 billion, topping analyst expectations of $61 billion. Net income grew 33% YoY to $21.9 billion, or $2.93 per diluted share, also topping Visible Alpha’s estimates of $20.6 billion or $2.77 per diluted share. Azure drove the overall cloud revenue up 20%, with personal computing revenue recording a 19% increase, while the productivity and business processes revenue grew 13%. Although Google also topped estimates with its Google Cloud revenue of $9.2 billion, Microsoft Azure grew faster at 30%, leaving behind Google Cloud whose growth reaccelerated from the previous quarter, but 25.7% was still a slower growth rate compared to last year's comparable quarter when growth amounted to 32%. Microsoft proudly touted that Azure AI has 53,000 customers, a third of whom are new to the service as they came on board last year. Microsoft attributed this success to its service offering top performance for AI training, inference and a diverse selection of AI accelerators that include both in in-house chip, as well as Advanced Micro Devices (NASDAQ: AMD) and Nvidia Corporation (NASDAQ: NVDA). By the words of CEO Satya Nadella, Microsoft moved from talking about AI to applying AI at scale by infusing it across every layer of its activities and offerings. Microsoft took an early leadership in the AI race with its ongoing partnership with ChatGPT-maker OpenAI as well as developing its own AI tools and hardware. Nadella also mentioned the company’s AI tools are being used by corporation giants such as Walmart (NYSE: WMT) and Coca-Cola (NYSE: KO). Microsoft shares rose 7% year-to-date, while last year, they recorded more than a 40% increase due to the company’s prospects on the AI front. Together with Apple, Nvidia, Amazon.com Inc (NASDAQ: AMZN), Alphabet, Meta Platforms (NASDAQ: META) and Tesla Inc (NASDAQ: TSLA), these Magnificent 7 companies almost single-handedly pushed markets to new highs since 2024 kicked off. Together, the market cap of these seven stocks exceeds any country’s entire stock market except for the United States. As of last week, Nvidia and Microsoft alone made about 75% of the S&P 500’s gain this year. In a note that was published on Tuesday, Morgan Stanley believes that Microsoft’s play for AI “getting even stronger and therefore predicts more growth is ahead for the tech titan. DISCLAIMER: This content is for informational purposes only. It is not intended as investing advice. This article is from an unpaid external contributor. It does not represent Benzinga's reporting and has not been edited for content or accuracy. \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? ALPHABET (GOOG): Free Stock Analysis Report This article Unlike Alphabet That Seems Locked In The AI Battle, Microsoft Shined With Its Quarterly Results originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}