{
    "title": "Microsoft quadruples its investment in AI and Cloud infrastructure in Spain \nto promote the deployment of responsible ...",
    "date": "2/20/2024",
    "url": "https://news.microsoft.com/es-es/2024/02/20/microsoft-quadruples-its-investment-in-ai-and-cloud-infrastructure-in-spain-to-promote-the-deployment-of-responsible-and-secure-artificial-intelligence-in-companies-and-public-administration/",
    "text": "febrero 20, 2024\t\t\t\n\t\t\t | Microsoft Prensa In the main picture, from left to right: José Luis Escrivá, Minister of Digital Transformation; Pedro Sánchez, President of the Government; Brad Smith, President of Microsoft Corp; Carol Ann Browne, Brad Smith’s Chief of Staff; Alberto Granados, President of Microsoft in Spain; and Natalia Escobedo, Director of Public Sector for Microsoft in Spain. As part of Microsoft’s commitment to promote digital innovation and the responsible use of Artificial Intelligence (AI) that benefits Spanish companies and public administrations, the company plans to quadruple its investments in Artificial Intelligence and Cloud infrastructure in Spain during 2024-2025, to reach $2.1 billion dollars.  This is Microsoft’s largest investment in Spain in its 37 years of presence in the country. Microsoft will soon open a Cloud Region of Data Centers located in the Community of Madrid, and has announced its intention to build a Data Center Campus in Aragon that will serve European companies and public entities. This infrastructure will provide Microsoft’s cloud services with the maximum guarantee of security, privacy and data sovereignty, and will make the company’s entire range of Artificial Intelligence solutions available to Spanish and European companies and public administrations. Microsoft’s data centers in Spain could also add $8.4 billion Euros to the national GDP and contribute to the creation of 69,000 jobs in the period 2026 – 2030, according to an analysis by IDC. This investment commitment is part of the collaboration framework established today by the President of the Government, Pedro Sánchez, and the Chairman of Microsoft, Brad Smith. Microsoft and the Government of Spain will work together on the application of Responsible Artificial Intelligence in the improvement of citizen services, the promotion of AI-based innovation, as well as in the reinforcement of national cybersecurity and the cyber-resilience of Spanish companies, public bodies and critical infrastructure.  This collaboration is established within the framework of the National Artificial Intelligence Strategy and the National Cybersecurity Strategy defined by the Government of Spain, which is focused on four lines of action: La empresa de gestión de personas superó los 1.000 millones de dólares de valoración tras de levantar una ronda de inversión de Serie C de 120 millones. La compañía apostó por Microsoft Azure como plataforma en la nube para la migración de sus datos y servicios por su máxima seguridad, escalabilidad y confianza en los datos. Factorial utiliza la IA generativa de Microsoft para importar y exportar datos de herramientas externas, ayudando así a ahorrar tiempo a sus clientes. Hoy publicamos la sexta edición de Cyber Signals, en la que destacamos cómo estamos protegiendo las plataformas de Inteligencia Artificial de las amenazas emergentes relacionadas con los ciberataques por parte de estados-nación. En colaboración con OpenAI, publicamos información sobre los actores de amenazas vinculados a estados y rastreados por Microsoft. Microsoft anuncia nuevas soluciones de datos e IA en Microsoft Cloud for Sustainability que proporcionan una vía eficaz y accesible para que organizaciones de todos los tamaños integren la sostenibilidad en sus estrategias empresariales. Aviation Group, compañía de formación aeronáutica integral, que se está posicionando como uno de los centros de referencia en el sector en nuestro país, apuesta por Dynamics 365 y las gafas de realidad mixta de Microsoft, HoloLens 2, para mejorar la calidad de la enseñanza impartida y, en concreto, proporcionar a sus alumnos prácticas avanzadas con una mejor comprensión de los conceptos y una mayor tasa de retención de conocimiento. Con motivo del Safer Internet Day, Microsoft acaba de lanzar los resultados de su Estudio Global de Seguridad Online, que examina las percepciones y actitudes que tienen las personas de todo el mundo sobre la seguridad online. Síguenos: Compartir esta página: "
}