{
    "title": "Microsoft employees share video showcasing perks of working at tech giant; \nvideo goes viral (WATCH)",
    "date": "2/14/2024",
    "url": "https://newsable.asianetnews.com/business/microsoft-employees-share-video-showcasing-perks-of-working-at-tech-giant-video-goes-viral-watch-gcw-s8uil2",
    "text": "A video of the perks available to the employees at the company was recently shared on social media and went viral in no time. The reel was shared by a software development engineer at the company. The IT behemoth Microsoft is renowned for its exceptional culture and services. It seems like Microsoft employees have it everything, with a beautiful campus, complimentary refreshments, a sleep room, flexible work schedules, and a positive work-life balance. Recently, a video showcasing the company's employee benefits was posted on social media and quickly gained popularity. The reel was shared by a software development engineer at the company. In the video, the employees participated in a trend that highlighted the advantages of their jobs. It looks that the video was filmed at the company's massive 54-acre site in Hyderabad. A post shared by twosisterslivingtheirlife (@twosisterslivingtheirlife) Every level of the office has a 24-hour multi-cuisine restaurant that is available to the public, along with casual gathering areas for coffee breaks. An employee said that they have enough business t-shirts to last them the entire week and that they are permitted to work from anyplace. They also work on projects spanning from AI to gaming, have a sleep room, and have an excellent work-life balance. According to Microsoft's website, \"The campus also affords amenities like a 24x7 ambulance & pharmacy, a landscaped 800-seater outdoor amphitheatre, air-conditioned bus services with WiFi connectivity, dedicated banks and ATMs as well as a fully equipped gymnasium with trainers, yoga and aerobics classes.\" The video has accumulated over 35,000 likes since it was shared. The video was approved by the corporation itself, which posted a heart-emoji-filled response in the comments section stating, \"It's a post by our Microsoft employees, ofcourse it's gonna be wholesome!\" Zomato launches 'Pure Veg Mode' with 'Pure Veg Fleet', CEO Deepinder Goyal steps out for delivery Infosys founder Narayana Murthy gifts 4-month-old grandson shares worth Rs 240 crore US investigating billionaire Gautam Adani and his group over bribery charges: Report BBMP locks down Bengaluru's Mantri Mall over unpaid tax of Rs 32 crore TikTok's revenue in United States surges to $16 billion amid ban threat: Report Numerology Prediction for March 20, 2024: Here's what you can expect today as per your birth number Daily Horoscope for March 20, 2024: Good day for Sagittarius, Libra; be careful Cancer 'PM Modi should be shot in the skull': RJD leader Awadhesh Singh Yadav's shocker (WATCH) 'Stop calling me King it's embarrassing, just call me Virat': RCB star Kohli's request to fans (WATCH) IPL 2024: Royal Challengers Bangalore officially renamed Royal Challengers 'Bengaluru'; new logo unveiled Paris Olympics 2024: Intimacy ban lifted, Olympic Village stocked with 300,000 condoms (WATCH) Did you know? Albert Einstein's brain was stolen, cut into 240 pieces! (WATCH) IAF lands aircraft on National Highway 16 in Andhra Pradesh (WATCH) What to know about Airbnb's new camera ban before booking your next stay (WATCH) How inventor of karaoke machine Shigeichi Negishi revolutionized music industry (WATCH) Follow us on: "
}