{
    "title": "Boss at one of Microsoft's largest resellers quits, admits secret share \ndeals",
    "date": "2/22/2024",
    "url": "https://www.theregister.com/2024/02/22/boss_ms_reseller_resigns/",
    "text": "Neil Murphy, the boss of Bytes Technology Group – one of Microsoft’s largest cloud and software licensing resellers – has quit with immediate effect, at the same time admitting to making secret stock trades in the company. London Stock Exchange-listed biz confirmed yesterday that Sam Mudd is being appointed as a caretaker until a permanent successor is found. BTG said yesterday that Murphy, who has run the business since October 1997, had tendered his resignation \"effective today,\" adding: \"Neil Murphy has also notified the Board today that he has made a number of trades in the Company's shares that had not been disclosed to the Company or the market in compliance with the PDMR disclosure requirements.\" The directors on the board are currently \"working to clarify the details of these undisclosed trades,\" and based on information provided, Murphy has a shareholding of 2,890,218 units, which remains unchanged from the position notified to the LSE on 28 November, 2023. Soon-to-be replacement CEO Mudd is currently the executive director of BTG and managing director of Phoenix Software Lit. Phoenix was acquired by BTG in 2017 in a buy that opened the door to agreements with Dell, VMware, Checkpoint, Citrix, and Mimecast. According to the most recent full-year trading figures for the 12 months ended February 20, 2023, the company turned over £1.439 billion ($1.82 billion) in sales, up 19.1 percent year-on-year, and booked an operating profit of £50.9 million ($64.5 million), up 20.6 percent. Bytes is positively dripping in certifications, and remains one of the few local solution providers to have all six Microsoft designations for business applications, data & AI, distal and app innovation, infrastructure, security and modern workplace. The company, established in a shop in Epsom, floated on the LSE in December 2020 for 332 pence and is currently trading at 545 pence. The valuation dipped by almost 13 percent after Murphy’s resignation was made public. ® Send us news The Register   Biting the hand that feeds IT Copyright. All rights reserved © 1998–2024 "
}