{
    "title": "After a Worrying Period, Microsoft's Stock Looks Safe for Now After Xbox \nAnnouncement",
    "date": "2/16/2024",
    "url": "https://fandomwire.com/microsofts-stock-looks-safe-for-now-after-xbox/",
    "text": "  You are here: Gaming segment could be a game changer for Microsoft.  The Activision Blizzard deal was a tough nut to crack for Microsoft with all those legal hindrances emerging during the process. But they did crack it and the Call of Duty publishers are now a part of a bigger ecosystem. The company executives including Phil Spencer, Sarah Bond, and Matt Booty recently shared some insights during the official Xbox podcast that promise a robust future for the organization’s gaming endeavors. Alongside it, Xbox President Sarah Bond says they are focused on “delivering the largest technical leap” people have ever witnessed in hardware generation. It could signal the new console that the company might be planning to bring in the future. All of this, from the Activision deal to the latest announcement, will hopefully keep the Microsoft stock (listed as MSFT at NASDAQ) away from turbulence. Since its inception, it has been a rollercoaster ride when the console sales are concerned. Its first installment sold nearly 24 Million units during its lifespan. The second installment, the 360 series, initially sold 1.18 Million units upon its launch and sold 13.97 Million at its peak in 2011 according to data aggregator Statista. The company’s rivals in the gaming segment, Sony, too will be looking at increasing their sales numbers despite being at the top. Naomi Matsuoka, senior vice president of Sony, believes the console’s sales will decline in the fiscal year beginning April 2024. Last year’s data indicates Sony sold 22.5 Million units in 2023 globally, over three down than Xbox Series X/S combined. Considering this, both companies would try to outshine their competition if they decide to annex their existing console fleet. Microsoft would require more effort as PlayStation is still the gamers’ favorite console if the global sales are taken into consideration. MSFT stock was trading at the market price of $407.65 in the pre-market at the time of writing. Since the year’s beginning, it has gained over 10 percent in its value. When long-term growth is concerned, the company shares have added 90 percent to its price since the Activision Blizzard deal was announced. Hopefully, the announcements shared in the latest podcasts will do the same for the company’s shares, but who knows, stock prices aren’t an easy nut to crack. Although indicators like moving average convergence divergence (MACD), simple moving average (SMA), and more do not indicate any upcoming positive momentum in upcoming days or weeks. Wherever the stock prices move, it is certain players are going to see some interesting initiatives coming from the company. Among them will be the addition of Diablo IV in the Game Pass where 34 Million users will be awaiting the fastest seller of Blizzard Entertainment. How do you think the new announcements will affect Microsoft’s stock? Tell us in the comments! Activision BlizzardMicrosoftXbox Anurag Batham is a Gaming Writer at FandomWire. He aspires to become a proper Writer and a Journalist in the days to come. With an experience of over two years in writing for different industries, his past works show his passion towards the metaverse and awareness towards environment. A gaming enthusiast who can prove when you have a round of Call of Duty (COD) with him. And it may take more than a coffee with him if you are to talk to him about Marvel. One can find a reader in him who's always keen to perfect what he already knows and to learn everything new. Copyright © 2024 FandomWire, LLC. All rights reserved. "
}