{
    "title": "Microsoft Buys Carbon Removal Credits from Grassroots Carbon",
    "date": "2/8/2024",
    "url": "https://carboncredits.com/microsoft-buys-carbon-removal-credits-from-grassroots-carbon/",
    "text": "Microsoft has entered into an agreement with Grassroots Carbon, a leading provider of high-quality carbon removal credits, to purchase soil carbon drawdown credits. This marks Microsoft’s first investment in carbon credits generated from regeneratively managed grasslands. The credits represent additional carbon sequestration over a 30-year period and support regenerative ranching practices. Grassroots Carbon offers nature-based soil carbon removal solutions to entities wanting to  reduce their carbon emissions. The company also provides ranchers an easy, transparent way of rewarding their regenerative practices through carbon credits. Grasslands play a crucial role in combating climate change by serving as effective carbon storage reservoirs. They surpass other ecosystems primarily due to the unique rooting characteristics of their vegetation. Adapted to frequent fire and grazing, these systems have evolved with deep root systems essential for their carbon storage. Remarkably, grasslands and shrubland carbon stocks constitute 34% of the total carbon in the U.S. Great Plains region. The extensive root systems of native grassland species can reach the depths of up to 15 feet. Estimates further suggest that 60% of soil carbon sequestration in grasslands is happening between 1 to 3 feet. Surprisingly, the majority of the biomass of these native species is located below ground. About 90% of the carbon that grasslands store is in their soil and roots. The significance of deep root systems extends to the deposition of carbon into deeper soil layers, a critical factor as the rate of carbon sequestration tends to increase with soil depth. Global studies also suggest that up to 7.3 billion tons of carbon dioxide equivalents (CO2e) per annum could be captured with grassland diversity restoration initiatives. Plus, another 699 million tons of CO2e per year can be sequestered in pasture through improved grazing management. Brad Tipper, CEO of Grassroots Carbon, expressed excitement about Microsoft’s inclusion of soil credits in their carbon removal strategy. He emphasized the importance of soil carbon storage as a crucial element of the climate solution. Improved soil health not only contributes to carbon reduction but also provides benefits such as enhanced water storage, erosion prevention, and improved grasslands ecology. The investment in carbon credits directly supports ranchers implementing regenerative land management practices. Most of the profit from credit revenues will go to these land managers. Currently, 40% of U.S. grasslands are for livestock grazing, with the potential to sequester over 500 million tons of carbon dioxide annually. However, 95% of these grasslands are under conventional management which depletes soil carbon. This is where Grassroots Carbon comes in to change that. The company aims to facilitate the transition to regenerative practices by offering opportunities for land managers to earn income from carbon storage. The project uses rigorous measurement, reporting, and verification (MRV) processes. It is employing PastureMap software to incentivize ranchers’ transition to rotational grazing. Microsoft sees this collaboration as part of its carbon removal strategy, contributing to the advancement of the soil carbon market through MRV innovations and the generation of large datasets of soil carbon and ecological data. “Soil carbon storage is an essential part of the climate solution, and our regenerative ranchers are trusted partners in that solution… Microsoft not only made a choice to reduce atmospheric carbon levels, but to do so with impacts far beyond just carbon.” However, the parties didn’t disclose how much the credit costs and how many credits Microsoft would buy. Still, their groundbreaking collaboration signals a shift towards prioritizing soil carbon storage in climate strategies. By supporting regenerative ranching practices, this partnership not only reduces carbon emissions but also fosters ecosystem health and resilience. CarbonCredits.Com is your source for carbon news, carbon pricing, carbon opportunities and more. ©2024 CarbonCredits.Com. All rights reserved. "
}