{
    "title": "Three things to watch this week: Microsoft earnings; Netflix earnings; \nResmed earnings",
    "date": "1/22/2024",
    "url": "https://www.proactiveinvestors.com.au/companies/news/1038961/three-things-to-watch-this-week-microsoft-earnings-netflix-earnings-resmed-earnings-1038961.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Advertising Cookies collect information about your browsing habits such as the pages you visit and links you follow. These audience insights are used to make our website more relevant. Performance Cookies collect anonymous information designed to help us improve the site and respond to the needs of our audiences. We use this information to make our site faster, more relevant and improve the navigation for all users. Jonathan Jackson is an experienced writer and editor. Over the past 20 years, he has worked in print and digital media across several business and finance titles amd is currently the Australian news editor at Proactive Investors covering the latest news for ASX listed companies as well as current financial trends. He was previously managing editor with Business First magazine, Wealth Creator Magazine and StocksDigital. Jonathan has interviewed some of the world's top CEOs and covered... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Last updated: 09:57 22 Jan 2024 AEDT, First published: 09:40 22 Jan 2024 AEDT Josh Gilbert, market analyst at eToro, shares his three things to watch in Australia in the coming days. After knocking Apple off its perch in the last few weeks by taking the crown of ‘world’s most valuable stock’, Microsoft shareholders will expect more good news when its earnings arrive next week. In the last 12 months, shares have had a terrific run, climbing by 70%, leaving little margin for error heading into the results. It’s been all about AI, with Microsoft chasing the tail of Nvidia, looking to capture the first adoption benefits. Microsoft has invested significantly, from its big stake in Chat-GPT pioneer Open AI to AI chips and a copilot AI subscription service. Its results this week will give a clearer picture of both the AI spending wave and the transition to the cloud, with Azure Cloud usually a focal point from Microsoft’s results. The consensus is for earnings to rise by 20%, whilst revenue is seen climbing by 16%, the highest growth for two years. The good news for investors is that Microsoft knows how to deliver on earnings; missing earnings expectations just once in the last seven years, demonstrating why it's now the world's most valuable company. It’s been a rollercoaster few years for Netflix; struggling to maintain growth after its pandemic surge, losing its place amongst the world’s top stocks, FAANG’s replacement by the magnificent seven – and finally sparking a comeback in the last year with shares up more than 50%. This resurgence is partly thanks to its new advertising plan and crackdown on password sharing. Netflix has also stepped up its games service, adding the world-renowned Grand Theft Auto, which should provide a boost in the quarter. The consensus is another big quarter from Netflix, with net subscriber additions at nine million and revenue projected to see the fastest growth in three years at $8.7 billion. The focus for the quarter is likely to be on the outlook for the full year 2024, with consumer spending set to slow, and investors wanting to see strong profit growth with subscribers now at record levels. It was a pretty torrid year for ResMed on the ASX. The company, perhaps best known for its CPAP masks, saw shares drop 18% due to headwinds from the internationally trending Ozempic drug, which some investors felt would dampen ResMed’s sales due to the connection between obesity and sleep apnoea. On top of this, the business has also suffered product recalls but the main headwind has been margins, which look set to fall again this week. Gross margins are expected at 56%, down from a year ago. The good news is that the consensus is for net income to rise by 9% to US$245 million and revenue growth in double digits thanks to strength across masks and software. Its valuation also remains attractive at 23 times forward earnings, much lower than its historical average, pricing in recent challenges. A good result would give shares the next leg up after a solid three months, but a miss on estimates could put shares under pressure, given its recent strong performance. Sign up to receive alerts and news direct to your inbox Digbee Limited founder and CEO Jamie Strauss and Black Rock Mining Ltd (ASX:BKT) MD John de Vries discuss the significance of the second Digbee assessment for Black Rock Mining, highlighting its utility in identifying areas of strength and opportunity from the first report, and its role as a... Copyright © Proactive Group Holdings Inc, 2024 All Rights Reserved - Proactive Australia PTY LTD ACN:132787654 ABN:19132787654. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}