{
    "title": "3 Top AI Stocks to Buy and Hold for the Next 5 Years",
    "date": "1/1/2024",
    "url": "https://markets.businessinsider.com/news/stocks/3-top-ai-stocks-to-buy-and-hold-for-the-next-5-years-1032935462",
    "text": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips As we ring in a new year, investors have plenty to consider when it comes to rebalancing their portfolios. In 2023, AI stocks were among the leading gainers. Accordingly, outsized interest is expected in this group throughout the new fiscal year. The prevailing theme that AI stocks will continue to provide exceptional performance and market-beating returns in 2024 is one that isn’t necessarily the consensus. Some investors believe that certain stocks in this group have seen their valuations balloon to unsustainable levels. And while some companies in this space have certainly seen their revenue and earnings growth surpass expectations, that’s not the case across the board. Therefore, let’s dive into three AI stocks investors will want to keep their eye on in 2024. These three companies may be worth buying as long-term investments, for those who will hold five years or longer. In the generative AI boom, Nvidia (NASDAQ:NVDA) has dominated by supplying essential tools to the sector. The company’s advanced GPUs are crucial for training and running AI applications in data centers.  Thus, demand is soaring, indicating this trend is sustainable. Nvidia’s Q3 revenue surged by 206% to $18.1 billion. This was driven by sales of the company’s high-margin products, like the $30,000 H100 data center chip, expected to fuel this growth moving forward. As consumer preferences shifted to premium Nvidia GPUs, the company’s Q3 net income margin rose from 46% to 51%, with profits soaring 588% to $10 billion. So, this trajectory positions Nvidia as a potential global powerhouse. Before the AI surge, Nvidia dominated 80% of the data center market. The rapid evolution of their GPUs for AI applications, exemplified by the H200 chip, signals their commitment to innovation. However, skeptics question the company’s ability to meet soaring AI chip demand promptly. This could potentially pose an opening for competitors. Despite trading at 65-times trailing earnings and 44-times forward earnings, analysts project 65% earnings growth this year. That would lead to a consensus target price of $668.11, implying a 34% stock price increase. Further, out of 52 analysts, 42 give NVDA stock a strong buy rating. Frankly, it’s hard to disagree with the experts. I’m maintaining my bullish outlook on Microsoft (NASDAQ:MSFT) as a global software and computing powerhouse. The tech giant has built out a robust quantum ecosystem, and remains a leader in other high-growth tech segments.  A pioneer in AI, Microsoft has swiftly integrated this technology into tools like Teams, Office, and Copilot. In healthcare, Nuance Dax automates patient interaction documentation. Analyst Dan Ives, optimistic about Microsoft’s AI future, has set a $450 price target on this stock. Other analysts remain very bullish, with plenty of upside being priced in by the experts. Of course, much of this has to do with Microsoft’s major investment in OpenAI and the potential of large language models and other AI-related applications. Beyond AI, the company plays a key role in cybersecurity. This is especially crucial with rising ransomware attacks and new SEC disclosure rules intensifying the need to safeguard networks, applications, and data. On the hardware front, a high-risk, high-reward strategy in research and development positions Microsoft for a competitive edge in quantum computing and AI. Undoubtedly, Microsoft will remain a top AI stock to watch in 2024 and beyond. Google’s parent company Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) is another company that’s expanding its horizons. Outside of its core search business and YouTube, Alphabet has emerged as a key AI player. In fact, it continues to be a tech powerhouse many investors feel the need to own. CEO Sundar Pichai highlights their success in integrating AI into its portfolio. A recent key development from Alphabet is its Wing delivery drone network, resembling an intelligent data system. Aimed at handling millions of orders, Alphabet is currently engaged in talks with UK regulators. This will be a catalyst to watch in the upcoming year.  Additionally, the company has collaborated with NASA and the Universities Space Research Association to establish a Quantum Artificial Intelligence Lab. This open-source library, featuring applications spanning quantum computing, includes Cirq, a Python-based tool for quantum circuit creation. Beyond software, Google is actively engaged in quantum computing hardware development. Thus, like the other names on this list, Alphabet is a well-rounded tech giant that’s more than just an AI play. However, the company’s core AI competencies should provide a nice catalyst for investors to ride, if this bull market continues in 2024. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. The post 3 Top AI Stocks to Buy and Hold for the Next 5 Years appeared first on InvestorPlace. Indices Commodities Currencies Stocks "
}