{
    "title": "FTC sends subpoenas to Microsoft, Alphabet, Amazon amid antitrust concerns \nover AI startups relying on Big Tech for financing, infrastructure",
    "date": "1/25/2024",
    "url": "https://fortune.com/2024/01/25/ftc-probes-microsoft-alphabet-amazon-ai-antitrust-concerns-openai-anthropic/",
    "text": "Alphabet Inc., Amazon.com Inc. and Microsoft Corp. received inquiries from the US Federal Trade Commission on their investments and partnerships with artificial intelligence startups Anthropic and OpenAI, part of a study on how AI is impacting competition in the technology industry. The antitrust and consumer protection agency on Thursday said it sent subpoenas to the companies to gather information. The probe focuses on more than $19 billion in investments by Microsoft, Amazon and Alphabet’s Google, a series of transactions that cemented alliances between the world’s cloud-services giants and the leading developers of artificial intelligence software. Antitrust enforcers across the world have become concerned as many of the most promising AI startups now depend heavily on the old guard of dominant tech companies for their financing and infrastructure needs. In comments during a public workshop Thursday, FTC Chair Lina Khan said the agency is closely monitoring the industry and warned that AI companies “cannot use claims of innovation as cover for law breaking.” “There is no AI exemption from the laws on the books,” she said. Google, Amazon and Anthropic declined to comment. Microsoft and OpenAI didn’t immediately respond to requests for comment. The inquiry comes as technology giants take a bigger role in backing nimble AI startups in a bid to stake a claim in the booming sector. Over the past year, Microsoft has revamped nearly all of its products around AI tools powered by OpenAI’s technology, while Google has said it plans to embed its most powerful large language model, Gemini, into its experimental search tool sometime this year. Microsoft has invested more than $13 billion in ChatGPT maker OpenAI. The ouster and subsequent reinstatement of Sam Altman, OpenAI’s chief executive officer, in November exposed how inextricably linked Microsoft and the company have become. Those ties have already spurred antitrust reviews in both the UK and the European Union. Meanwhile, Google in October committed to back Anthropic with $2 billion, and Amazon last year also agreed to an investment of as much as $4 billion. Anthropic was founded in 2021 by former employees of OpenAI, who left that company amid differences over the direction of the business. Read More: Big Tech’s Massive AI Startup Deals, By the Numbers Rebecca Kelly Slaughter, one of the FTC’s three Democrats, criticized the tech giants for structuring their transactions in a way designed to avoid the US merger law that would have required them to notify antitrust enforcers. “It’s reasonable to wonder whether these investments could lead to a heavily consolidated market dominated by only a few,” she said at the same workshop where Khan spoke. But, she warned, “studying a market is a compliment to, and not a substitute for, appropriate enforcement.” Microsoft didn’t report the OpenAI transaction to the agency because the investment doesn’t amount to control of the company under US law, Bloomberg has reported. OpenAI is also a nonprofit, and acquisitions of non-corporate entities aren’t reported under US merger law, regardless of value. In the case of Google and Amazon, the deals were structured as convertible notes, a type of debt that will convert to equity at the startup’s next funding round. Those don’t require notification to the agency until they’re converted. The FTC is conducting the inquiry under its so-called 6(b) authority that allows it to issue subpoenas to conduct market studies. The agency generally issues a report on its findings after analyzing the information from companies, though that process can take years to complete. The agency is still finalizing the results of studies on pharmaceutical middlemen and supply chains that it started in 2021 and 2022. Although the information is collected for research purposes, the FTC can use any details it gleans to open official investigations or aid in existing probes. Last summer, the agency opened an investigation into whether OpenAI has violated consumer protection laws with its popular ChatGPT conversational AI bot. The FTC and its sister agency, the Justice Department, share jurisdiction over antitrust probes and have been debating internally which should take the lead on AI. The Justice Department has generally handled antitrust issues related to Microsoft since its blockbuster monopolization case against the Windows maker in the late 1990s. The FTC, however, recently handled Microsoft’s acquisition of game developer Activision Blizzard Inc. In addition, the European Commission is looking into some of the agreements that have been struck between large digital market players and generative AI developers and providers. The EU’s executive arm is investigating the impact of these partnerships on market dynamics. The UK’s Competition and Markets Authority said in December that it also would probe Microsoft and OpenAI’s partnership. — With assistance from Shirin Ghaffary, Julia Love, Matt Day, and Jackie Davalos © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}