{
    "title": "UK: Submission to the Competition and Markets Authority on Microsoft-OpenAI \nmerger - ARTICLE 19",
    "date": "1/9/2024",
    "url": "https://www.article19.org/resources/uk-submission-to-the-competition-and-markets-authority-on-microsoft-openai-merger/",
    "text": "To make our website work, we save some essential small files (cookies) on your computer. With your permission, we would also like to save some extra cookies that help us improve how people find out about Article 19. Read more about the cookies we use in our Cookie Policy. Photo by Mojahid Mottakin on Unsplash ARTICLE 19 joined the Irish Council for Civil Liberties, the Open Markets Institute, Foxglove, Balanced Economy Project, and Rebalance Now in responding to a call for comments from the Competition and Markets Authority (CMA) as part of its current investigation of the Microsoft-OpenAI partnership. The CMA must investigate Microsoft’s most recent investment and ensure that a small number of dominant technology firms are not permitted to dictate how AI develops. Read the submission below. 8 January 2024\nSubmission to CMA on Microsoft-OpenAI “partnership” merger inquiry 1. This submission from diverse civil society organisations welcomes the Competition and Markets Authority’s investigation into the Microsoft-OpenAI partnership. Our submission is structured in four sections: The Microsoft-OpenAI “partnership” 2. Microsoft’s most recent investment (announced just under a year ago) in OpenAI, reported to be worth up to $10bn, was the largest sum committed so far by a large digital gatekeeper to “support” a leading AI startup. Microsoft’s “support” to OpenAI dates back to a $1bn investment in 2019, followed by another similar-sized investment in 2021. 3. We understand Microsoft has argued that the latest investment, while much larger in size, did not change the nature of its relationship with OpenAI which it claims remains at arm’s-length. Until recently these arguments appeared to have been successful, as none of Microsoft’s several rounds of investment were investigated by any competition authority, including the CMA. 4. That this is highly unsatisfactory is confirmed by the fact that the German competition authority, the Bundeskartellamt, opened a formal investigation into whether Microsoft should have notified the investment based on German merger control rules. The Bundeskartellamt concluded (in its decision dated 25 September 2023) that while Microsoft did not formally violate German merger control notification requirements, this did not mean that there were no substantive issues with the investment, and that the case would have to be re-examined if Microsoft increased its influence on OpenAI. Recent events at OpenAI appear to have met this condition, as the CMA’s investigation recognises. Why this investment must be investigated 5. The events of late November 2023 involving the CEO and the Board of OpenAI, in which Microsoft played a prominent role (ostensibly to protect its investment), expose as a fiction the idea of an “arm’s-length relationship” between the two companies. Indeed, they demonstrated that Microsoft has a real role in the operation and strategic direction of OpenAI, with profound implications for competition between the two companies, and in AI more generally. More broadly, Microsoft’s investment in OpenAI should be seen in the context of the past two decades of economic history. 6. Weak antitrust enforcement has helped create a world in which a handful of dominant technology firms control most of the world’s digital technologies and markets—the bedrock of the modern economy. These gatekeepers are now leveraging their unparalleled access to computing infrastructure, data and expertise to shape the development and commercialisation of AI—including driving the narrative that ever-larger models and ever-greater scale are inevitable. 7. In a fairer and more open digital economy, AI development would be pluralistic, decentralised, competitive, and more responsive to the needs of consumers, businesses, governments and citizens. Firms such as OpenAI or Anthropic might, in time, have threatened giants like Amazon, Google and Microsoft. Unfortunately, this is not the path we are on. 8. Instead, smaller AI firms are becoming increasingly dependent on the tech giants’ infrastructure and financial support. Microsoft’s partnership with OpenAI as well as Google and Amazon’s combined $6bn investment in Anthropic illustrate this point. Letting the largest incumbents dictate how AI develops, by leveraging their current monopoly power into future markets and technologies, will serve their profit margins but will not serve the public interest. We have seen how the failure to block anti-competitive investments and acquisitions in social media, digital advertising and other markets harmed innovation, privacy and choice and allowed the online “public square” to be captured by a handful of private platforms with little interest in promoting the public good and protecting democracy. 9. Only by acting early and aggressively against anti-competitive behaviour in AI can regulators prevent this oligopolistic control from being extended further. Why Microsoft’s investment in OpenAI gives it significant influence 10. Commercial arrangements between dominant tech companies and smaller AI firms – seemingly designed to avoid the antitrust scrutiny that would accompany outright acquisition – give dominant tech companies access to startups’ technology and influence over their commercial strategies in ways that are highly likely to be anti-competitive. These companies are deliberately reconfiguring their “deals” to look like innocent “agreements”, which is fundamentally a circumvention of scrutiny. This is particularly true for Microsoft’s partnership with OpenAI. 11. First, Microsoft influence over OpenAI goes far beyond its reported $13bn financial investment. As OpenAI’s exclusive cloud provider, Microsoft can prevent its cloud rivals from doing business with OpenAI while enjoying a significant and consistent revenue stream. Although the details have not been disclosed to the public, Microsoft also appears to benefit from privileged access to OpenAI’s technology and the ability to license this technology on its behalf. 12. Meanwhile, as mentioned above, the recent turmoil at OpenAI further exposed the strength of the tech giant’s influence over its smaller partner. When OpenAI’s supposedly independent not-for-profit board fired CEO Sam Altman, Microsoft reportedly placed heavy pressure on the board to reverse its decision, before offering jobs to Altman and every other OpenAI employee. This effectively forced the OpenAI board to back down, resulting in the reinstatement of Altman as CEO and the appointment of a new board, with Microsoft joining as a non-voting observer. These events make clear that despite OpenAI’s nominal independence, it is Microsoft that ultimately pulls the strings when it comes to critical strategic and business decisions. 13. Second, Microsoft has a prominent role throughout the AI stack as both an upstream developer and a downstream service deployer (terms the CMA uses in its report on AI Foundation Models), reinforcing OpenAI’s dependence while enabling Microsoft to leverage the startup’s technology to further entrench its own dominance across different markets. Microsoft develops and commercialises AI models and tools, and builds and runs popular user-facing applications and platforms including Microsoft Office, Bing, GitHub and LinkedIn. 14. Most importantly, Microsoft also controls the Azure high-performance computing infrastructure and the Windows operating system upon which such tools, platforms and applications are hosted. In addition, Microsoft has access to immense amount of data gathered through these services and platforms. As an illustration of how deeply the two companies are intertwined, Microsoft was the “provider” of data for Codex, the OpenAI model that powers Microsoft’s GitHub CoPilot. Publicly accessible code repositories on GitHub were used as training data by OpenAI to develop Codex. 15. In short, as a recent article in the MIT Technology Review put it, “they [Microsoft] own and control the ingredients necessary to develop and deploy large-scale AI.” This power puts Microsoft in an unprecedented position of influence and oversight when it comes to OpenAI’s inner workings and decision-making. 16. Without regulatory intervention, the Microsoft/OpenAI “partnership” risks undermining fair competition in the market for AI. The likely result would be higher prices and less choice for consumers and businesses, less innovation and resilience in the wider economy, and a handful of actors monopolising the growth, profits and other benefits from this critical technology. As the first competition authority to formally investigate the Microsoft/OpenAI partnership, the CMA can lead the way in preserving an open and diverse AI ecosystem. Competition issues the CMA should investigate 17. We see several broader competition issues arising from the investment that we believe the CMA needs to investigate: 18. To assess the true extent of Microsoft’s control, the CMA should look beyond carefully lawyered contractual terms and thoroughly investigate how its relationship with OpenAI functions in practice. The following are suggested questions to help guide the CMA’s inquiry: Signed, Irish Council for Civil Liberties (ICCL) The Open Markets Institute (OMI) Foxglove Balanced Economy Project Rebalance Now ARTICLE 19 Mozilla Foundation View as PDF Join our email list Accessibility Tools "
}