{
    "title": "Microsoft's OpenAI investment risks EU merger probe, EU regulators say",
    "date": "1/10/2024",
    "url": "https://www.rappler.com/technology/microsoft-openai-investment-risks-european-union-merger-probe/",
    "text": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article. CHATGPT. OpenAI and ChatGPT logos are seen in this illustration taken, February 3, 2023 Dado Ruvic/Reuters BRUSSELS, Belgium – Microsoft’s financial backing for ChatGPT maker OpenAI may be subject to EU merger rules, EU antitrust regulators said on Tuesday, January 9, underscoring a similar warning from its UK peer in December. The US software giant, which last year committed to invest over $10 billion into OpenAI with a non-voting position on the board, has said it does not own any portion of OpenAI. The European Commission had previously said it was following developments closely. “The European Commission is checking whether Microsoft’s investment in OpenAI might be reviewable under the EU Merger Regulation,” the EU executive, which acts as the EU competition enforcer, said in a statement. It said some agreements agreed between large digital market players and generative AI developers and providers were being investigated for their impact on market dynamics. It did not name the companies. The Commission on Tuesday also gave interested parties until March 11 to provide feedback on competition in virtual worlds and generative artificial intelligence. It also sent requests for information to several large digital companies on the two topics. “We are inviting businesses and experts to tell us about any competition issues that they may perceive in these industries, whilst also closely monitoring AI partnerships to ensure they do not unduly distort market dynamics,” EU antitrust chief Margrethe Vestager said. – Rappler.com Error. Please abide by Rappler's commenting guidelines. There are no comments yet. Add your comment to start the conversation. How does this make you feel? JOIN OUR NEWSLETTER Fearless reporting delivered to you follow us      "
}