{
    "title": null,
    "date": "1/18/2024",
    "url": "https://www.fool.com.au/2024/01/18/better-ai-stock-microsoft-vs-amazon-usfeed/",
    "text": " Access all of your premium services in our Member Centre Click here to learn more about our premium services TO MAKE THE WORLD\nSMARTER, HAPPIER, AND RICHER. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show, and premium investing services. These companies are rapidly expanding in AI, but one is trading at a better value. Image source: Getty Images You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More This article was originally published on Fool.com. All figures quoted in US dollars unless otherwise stated. The launch of OpenAI's ChatGPT in November 2022 triggered a boom in artificial intelligence (AI), with countless tech firms pivoting their businesses toward the budding industry. According to Grand View Research, the AI market is projected to expand at a compound annual growth rate of 37% through 2030. That trajectory would see the sector exceed a value of $1 trillion before the end of the decade, suggesting there's no better time than the present to invest in AI-minded companies. Microsoft (NASDAQ: MSFT) and Amazon (NASDAQ: AMZN) are two attractive options, with both companies investing heavily in the market and active in one of the biggest growth areas of AI: cloud computing. These companies have emerged as some of the biggest threats in the industry and could deliver significant gains over the long term. So, let's take a closer look at these companies and determine whether Microsoft or Amazon is the better AI stock right now. Microsoft was an early investor in AI, sinking $1 billion into OpenAI in 2019. The company has since increased its investment, achieving a 49% stake in the start-up. The partnership with OpenAI has granted Microsoft exclusive access to some of the most advanced AI models, which it has used to bring upgrades across its product lineup. Over the last year, elements of ChatGPT have been integrated into Microsoft's search engine Bing, a range of new AI tools have been added to its cloud platform Azure, and its various Office services now offer improved productivity with the help of AI. Microsoft is a behemoth in the tech world, with millions of consumers and businesses relying on its software. The popularity of its services and OpenAI's tech could be a powerful combination over the long term. In the first quarter of 2024 (ending September 2023), Microsoft posted 13% in year-over-year revenue growth, beating Wall Street estimates by nearly $2 billion. Significant gains came from the company's cloud and productivity segments, which saw revenue rise 19% and 13%, respectively. These divisions are hyperfocused on AI development, which appears to be paying off. Alongside free cash flow that hit $63 billion last year, Microsoft is on a promising growth path. The company has the brand power and financial resources to become one of the biggest threats in AI. Amazon pulled off an impressive turnaround in 2023 after its stock plunged roughly 50% the year before. Since last January, its shares have soared over 62% thanks to a return to profitability in its e-commerce business and significant potential in AI. Over the last year, various cost-cutting measures have seen Amazon's free cash flow skyrocket 427% to $16 billion. The company has restructured its business to prioritize profit growth and is, therefore, investing heavily in its most profitable division: Amazon Web Services (AWS). The cloud platform is responsible for over 62% of Amazon's operating income despite earning the lowest revenue out of its three segments. In Q3 2023, AWS achieved nearly $7 billion in profits, representing growth of 29% year over year. The cloud market is expanding quickly, boosted by the emergence of AI. Businesses are increasingly looking for ways to boost efficiency with the help of AI and turning to cloud services to do so. Meanwhile, AWS' leading 32% market share in cloud computing positions it well to see big gains as AI develops. Amazon's dominant position in cloud computing makes the company one of the best ways to invest in AI. Microsoft and Amazon have emerged as two of the biggest names in AI over the last year. These companies have similar potential in the industry thanks to booming cloud businesses and lucrative opportunities in other areas of tech. As a result, the best way to determine the better AI stock is to consider which is trading at a better value.  Data by YCharts. PS Ratio = price-to-sales ratio. PEG Ratio = price-to-earnings-to-growth ratio. This chart compares Amazon and Microsoft's price-to-sales (P/S) and price-to-earnings-to-growth (PEG) ratios. These are helpful valuation metrics as they take into account a company's financial health against its stock price. P/S is calculated by dividing a firm's market cap by its revenue. Meanwhile, PEG divides a stock's price-to-earnings ratio by the growth rate of its earnings. For both metrics, the lower the figure, the better the value. In this case, Amazon's stock is a bargain compared to Microsoft. So, if you're between these two AI stocks, Amazon is the better buy this month and a screaming buy at the start of 2024. This article was originally published on Fool.com. All figures quoted in US dollars unless otherwise stated. Dani Cook has no position in any of the stocks mentioned. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. The Motley Fool Australia's parent company Motley Fool Holdings Inc. has positions in and has recommended Amazon and Microsoft. The Motley Fool Australia has recommended Amazon. The Motley Fool has a disclosure policy. This article contains general investment advice only (under AFSL 400691). Authorised by Scott Phillips. March 19, 2024 |\n        Jeremy Bowman Buying Nvidia when the disruptive AI chatbot launched would have been a smart move. Read more » March 19, 2024 |\n        Jeremy Bowman Investors were encouraged by news of a price hike on the Model Y. Read more » March 16, 2024 |\n        Keithen Drury Nvidia last split its stock when it traded for a pre-split $744 in 2021. Read more » March 14, 2024 |\n        Howard Smith Tesla is no longer a magnificent stock, according to a Wells Fargo analyst. Read more » March 14, 2024 |\n        Dani Cook The company's stock could rise 40% over the next two years and outperform the S&P 500. Read more » March 13, 2024 |\n        Will Healy Nvidia stock has split five previous times in the company's history. Read more » March 13, 2024 |\n        Danny Vena Nvidia stock has gained nearly 300% over the past year. Can investors still profit from this AI stock? Read more » March 12, 2024 |\n        Tristan Harrison This stock has rocketed higher. How do we get access to it? Read more » View All Sign Up for Take Stock\nInvestment news, stock ideas, and more, straight to your inbox. Get Started Investing\nYou can do it. Learn about investing with our Investing Education hub. Win at Retirement\nOur latest articles and strategies for the post-work life you want. Listen to Our Podcast\nHear our experts take on shares, the market & how to invest. Join Our Premium Community\nJoin our flagship membership service, Share Advisor. The Motley Fool stands behind our products and our membership-fee-back guarantee. If for any reason you are not 100% satisfied with your premium subscription, simply notify us within the first 30 days and you won't pay a cent. By taking up this offer, you will also be enrolled in our auto-renewal program, which is our way of making your ongoing subscription easier by ensuring uninterrupted service.  Don't worry, though – you're not locked in, and can cancel your auto-renewal at any time before each 'anniversary' date without question or penalty. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. The Motley Fool launched its Australian presence in 2011, and since then has grown to reach over 1 million Australians. Read more about us >  This Service provides only general, and not personalised financial advice, and has not taken your personal circumstances into account. The Motley Fool Australia operates under AFSL 400691. For more information please see our Financial Services Guide. Please remember that investments can go up and down. Past performance is not necessarily indicative of future returns. The Motley Fool Australia does not guarantee the performance of, or returns on any investment. We respectfully acknowledge the Traditional Custodians of the land where we live and work and pay our respects to all Elders, past and present, of all Aboriginal and Torres Strait Islander nations. © 2010 - 2023 The Motley Fool Australia Pty Ltd. All rights reserved. ACN: 146 988 052 Australian Financial Services Licence (AFSL): 400691 The Motley Fool Australia, PO Box 104, Isle of Capri, Qld 4217 Contact Details:\nPhone: (03) 8592 4841\nEmail: [email protected]\nOur friendly customer service team will happily get back to you as soon as they can. Notifications Scott Phillips just released his 5 best stocks to buy right now and you could grab the names of these stocks instantly! "
}