{
    "title": "Update: Microsoft follows Activision Blizzard merger with 1,900 layoffs",
    "date": "1/26/2024",
    "url": "https://www.gamedeveloper.com/business/report-microsoft-follows-activision-blizzard-merger-with-1-900-layoffs",
    "text": "Microsoft has confirmed the authenticity of the letters obtained by IGN. January 25, 2024 Update (01/26/24): Microsoft has confirmed the authenticity of the letters obtained by IGN in an email sent to Game Developer but has so far declined to comment on the scale of the layoffs, including which departments and studios have been hit. Since the news broke yesterday, a number of Activision Blizzard and Xbox employees have indicated that major internal studios like Blizzard Entertainment and Sledgehammer Games have been heavily impacted. Windows Central managing editor Jez Corden is also reporting that Microsoft is shutting down departments involved with the physical retail of Xbox products. Update (01/25/24): The ZeniMax Workers Union released a statement on the layoffs. In it, the ZWU said the affected workers weren't part of its union. Written by senior QA tester Wayne Dayberry, he noted how layoffs have hit \"[studios] that continue to deliver huge profits. It hurts to see our coworkers, who are so passionate... be the first impacted by any cuts.\" \"Your livelihood is not protected without a voice on the job,\" he continued. \"Companies will claim that we’re all a family. But a family doesn’t layoff or outsource people.\" While acknowledging how unions can't always shield against layoffs, Dayberry argued they lead to better transparency policies. He went on to call for more ZeniMax workers to join the ZWU and help set new industry standards. \"The only way forward is for all of us to come together as workers to protect each other,\" he said. \"We'll continue [supporting] workers at Microsoft and across the video game industry who want to have a union voice on the job.\"Original story: Microsoft completed its seismic $68.7 billion merger with Activision Blizzard just over three months ago. Now, the company is reportedly laying off 1,900 people across its video game divisions. That's according to IGN, which claims to have spoken with sources familiar with those plans and has obtained an internal memo penned by Xbox boss Phil Spencer that details the extent of the cuts. In that message, Spencer explains Microsoft will offer its \"full support to those who are impacted during the transition, including severance benefits informed by local employment laws.\" \"It’s been a little over three months since the Activision, Blizzard, and King teams joined Microsoft. As we move forward in 2024, the leadership of Microsoft Gaming and Activision Blizzard is committed to aligning on a strategy and an execution plan with a sustainable cost structure that will support the whole of our growing business. Together, we’ve set priorities, identified areas of overlap, and ensured that we’re all aligned on the best opportunities for growth,\" added Spencer. \"As part of this process, we have made the painful decision to reduce the size of our gaming workforce by approximately 1,900 roles out of the 22,000 people on our team. The Gaming Leadership Team and I are committed to navigating this process as thoughtfully as possible. The people who are directly impacted by these reductions have all played an important part in the success of Activision Blizzard, ZeniMax and the Xbox teams, and they should be proud of everything they’ve accomplished here.\" Spencer said Microsoft is \"grateful\" for the commitment shown by its development teams over the years, but said it's now time to invest in areas that will grow its business and support its strategy of \"bringing more games to more players around the world.\" \"Although this is a difficult moment for our team, I'm as confident as ever in your ability to create and nurture the games, stories and worlds that bring players together,\" he continued. The news comes a week after Xbox laid out some of its plans for 2024 during a well-received Developer Direct that spotlighted first-party titles like Indiana Jones and The Great Circle, Avowed, and Senua's Saga: Hellblade II. Those projects are being developed by the company's internal roster of Xbox Game Studios, which includes notable names like Obsidian, Playground Games, Mojang, Double Fine, Bethesda Game Studios, 343 Industries, Rare, and Arkane. Following its purchase of Activision Blizzard in October 2023, Microsoft added even more names to that line-up and became the owner of major franchises like Call of Duty, Diablo, and World of Warcraft. The fact Microsoft has chosen to put so many workers to the sword (including high-profile figures like Blizzard Entertainment president Mike Ybarra) less than four months after sealing its earth-shaking merger with Activision Blizzard won't go unnoticed. It continues a dismal trend that has seen conglomerates like Embracer, Thunderful, Unity, and more spend huge sums on M&A before turning those same studios and their employees into sacrificial lambs in the name of sustainability and shareholder value. Game Developer has reached out to Microsoft for more information on the layoffs. Read more about: Chris Kerr News Editor, GameDeveloper.com Game Developer news editor Chris Kerr is an award-winning journalist and reporter with over a decade of experience in the game industry. His byline has appeared in notable print and digital publications including Edge, Stuff, Wireframe, International Business Times, and PocketGamer.biz. Throughout his career, Chris has covered major industry events including GDC, PAX Australia, Gamescom, Paris Games Week, and Develop Brighton. He has featured on the judging panel at The Develop Star Awards on multiple occasions and appeared on BBC Radio 5 Live to discuss breaking news. You May Also Like Mar 21, 2024 Mar 14, 2024 Mar 13, 2024 Copyright © 2024. All rights reserved. Informa Tech, a trading division of Informa PLC. "
}