{
    "title": "Microsoft launches AI-powered 'Copilot for Finance'",
    "date": "2/29/2024",
    "url": "https://www.tradingview.com/news/cointelegraph:deda30b0f094b:0-microsoft-launches-ai-powered-copilot-for-finance/",
    "text": "Microsoft launched “Copilot for Finance” in a public preview on Feb. 29. The new artificial intelligence-powered service integrates with the Microsoft 365 suite of productivity tools and provides generative AI and automation solutions to new and existing workflows. Copilot is Microsoft’s version of a virtual AI assistant. Its integration into the Windows and Microsoft 365 ecosystems essentially adds ChatGPT-like functionality in a modality tailored specifically for productivity. With the newly launched “Copilot for Finance” version of the AI service, Microsoft is introducing end-to-end solutions specifically tuned for finance professionals.Cointelegraph According to a blog post from Microsoft, Copilot for Finance was tested by thousands of the company’s own financial professionals and in the finance departments of numerous business partners. The biggest challenge for many finance professionals is time — or a lack of it. Microsoft said its new AI tool is the solution: The new service joins Microsoft’s other professional AI assistant offerings, Copilot for Sales and Copilot for Service. Meanwhile, Copilot, the original version, has been hot-patched into Windows 11 users’ taskbars by default. Related: Microsoft revenue up 18% after ‘infusing AI’ across tech stack The influx of OS and app-specific AI services may be lucrative for the top tech firms, but they also answer longstanding expert calls for AI models trained on finance data and built specifically to handle the level of accuracy necessary to augment finance professionals. While Copilot and its Finance, Sales, and Service derivatives may have been built on OpenAI’s technology — the very same that underpins ChatGPT — it’s been fine-tuned for finance. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @profitable_trades @TradingView @ozonlayerfx @aggressivecalculator @most_luxurious_lifestyle @life_of_lorena.fx @chartfeed @tradingview @TradingView @fxdelta @lifestylewith_ashley26 @TradingView @aitor_avatar @rok_trader @Cenobar @trading_tools.ir @Market Mentor Network @itzi71 Whatever the trade "
}