{
    "title": "Microsoft invests $2.1 billion to improve AI infrastructure in Spain",
    "date": "2/25/2024",
    "url": "https://coingeek.com/microsoft-invests-2-1-billion-to-improve-ai-infrastructure-in-spain/",
    "text": " Home » Business » Microsoft invests $2.1 billion to improve AI infrastructure in Spain Business   25 February 2024 Microsoft (NASDAQ: MSFT) has moved to strengthen its grasp on Spain’s tech ecosystem with a fresh $2.1 billion investment pledge to expand cloud and artificial intelligence (AI) infrastructure in the country. In a post on X (formerly Twitter), Microsoft President Brad Smith noted that the investment sum is the largest since the company began its operations in the nation 37 years ago. I’m thrilled to announce that we will expand our AI and cloud infrastructure in Spain by $2.1B USD in the next two years. Our investment is beyond just building data centers, it’s a testament to our 37-year commitment to Spain, its security, and development and digital… https://t.co/arJnZzyDpc — Brad Smith (@BradSmi) February 19, 2024  Microsoft plans to release the funds in tranches over two years, focusing on establishing new data centers to power its AI ambitions. A chunk of Microsoft’s investment will be deployed toward building generative AI products for government agencies and the private sector. The company says it will establish a data centers in Madrid, a region that has seen significant tech investment from other global players. A similar data center is expected to be established in Aragon to provide cloud services to both public entities and private firms. “I’m thrilled to announce that we will expand our AI and cloud infrastructure in Spain by $2.1B USD in the next two years,” said Smith. “Our investment is beyond just building data centers, it’s a testament to our 37-year commitment to Spain, its security, and development and digital transformation of its government, businesses, and people.” Rather than merely splurging funds, Microsoft confirmed that the investment will extend toward ironing out a framework for responsible artificial intelligence to ensure safe use. The country is targeting an increase in AI use across key sectors of the economy, reinforcement of national cybersecurity, and advancing the cyber-resilience of private enterprises. Spain President Pedro Sanchez described Microsoft’s investment as a “[show] of confidence in the Spanish economy and our roadmap for an inclusive and secure digital transformation.” While heavily focused on the regulatory and infrastructure side of things, Microsoft announced plans to earmark a portion of the funds for massive human capital development. The technology giant noted that the investment in data centers will create 69,000 new jobs before the end of 2030. A streak of partnerships under its belt Microsoft has garnered a streak of high-profile partnerships in recent months. In late 2023, the company pledged sizable sums to expand data centers for AI in Australia and the U.K. while inking multi-year deals with KPMG to focus on generative AI and other emerging technologies. Microsoft’s latest investments in AI are an attempt to hold off competition from Google (NASDAQ: GOOGL), Meta (NASDAQ: META), and Anthropic as it tries to hold onto its market share. The company has seen its fortune rise to become the largest firm by market capitalization, valued at $2.9 trillion ahead of Apple (NASDAQ: AAPL), Saudi Aramco, and Alphabet. In order for artificial intelligence (AI) to work right within the law and thrive in the face of growing challenges, it needs to integrate an enterprise blockchain system that ensures data input quality and ownership—allowing it to keep data safe while also guaranteeing the immutability of data. Check out CoinGeek’s coverage on this emerging tech to learn more why Enterprise blockchain will be the backbone of AI. Watch: The Future Internet: Uniting Blockchain, AI & IPv6 width=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"> New to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology. As interest in digital asset investments grows, Deutsche Börse eyes developing a platform that would make tokenized assets fungible for institutional clients and boost its profit in the long run. Microsoft is ramping up its AI efforts as tech giants race to become the frontrunner in the industry, hiring key players from Inflection AI to spearhead its consumer AI arm. The ECB is establishing seven new ‘workstreams’ to develop the digital euro rulebook, and experts in payments infrastructure and architecture were encouraged to apply by April 5. Join the official Bitcoin SV Discord channel: www.discord.gg/bsv "
}