{
    "title": "Microsoft announces initiative to train 2 million Indians on AI skills by \n2025",
    "date": "2/8/2024",
    "url": "https://www.thehindu.com/sci-tech/technology/microsoft-announces-initiative-to-train-2-million-indians-on-ai-skills-by-2025/article67824200.ece",
    "text": "To enjoy additional benefits CONNECT WITH US February 08, 2024 11:20 am | Updated 12:34 pm IST COMMents SHARE READ LATER FILE PHOTO: Microsoft announced an initiative to equip 2 million people in India with skills in artificial intelligence by 2025.\n| Photo Credit: AP On Wednesday, Microsoft announced an initiative to equip two million people in India with artificial intelligence (AI) skills by 2025. Called ADVANTAG(I)GE INDIA, the programme intends to push India’s AI transformation and empower its workforce for jobs in the future. The announcement is part of Microsoft’s wider Skills for Jobs initiative, which aligns with the company’s responsible AI principles. Training will be given through partnerships with the government, non-profit firms, and businesses across the country. CEO Satya Nadella, who is currently visiting India, spoke at a conference in Mumbai about the spread of the technology. “I hope consensus emerges and that is what really helps, in some sense, (with) the diffusion of this technology,” he said, referring to global efforts to regulate AI. (For top technology news of the day, subscribe to our tech newsletter Today’s Cache) He added that he hoped distribution of AI across the country would lead to “equal distribution of economic growth”. The goal of ADVANTA(I)GE INDIA is to bridge the gap in Tier-2 and Tier-3 cities by training individuals while also focusing on rural areas to ensure AI-induced progress is more inclusive. “The ADVANTA(I)GE INDIA initiative is a significant step towards democratising access to AI skills across the nation and reflects Microsoft’s deep commitment to enabling inclusive growth with technology,” said Puneet Chandok, President of Microsoft India & South Asia. “India has a huge opportunity to be a global leader in AI, and creating AI fluency at scale is a critical step in that journey. This initiative aims to propel India into a promising era of AI fluency, empowering citizens across India with the right skills to thrive in the age of AI,” said Chandok. Microsoft has partnered with India’s Ministry of Skill Development and Entrepreneurship as well as 10 state governments to provide basic and advanced training in AI to 500,000 students and job seekers in 100 rural vocational education institutions and training centres. In-depth training in AI technical skills will also be given to 100,000 young women through 5,000 trainers at higher education institutions in Tier-2 and Tier-3 cities. Microsoft will provide access to Azure AI services to facilitate this. The company will also raise awareness about responsible AI and AI-related jobs for 400,000 students in schools located in remote and tribal regions. Additionally, Microsoft will help 250,000 government officers understand generative AI better to deliver next-generation citizen services. It will also convene a summit for 2,500 nonprofits to leverage AI in their work, through a collaboration with LinkedIn. COMMents SHARE technology (general)\n\n/\n\ninternet\n\n/\n\nArtificial Intelligence\n\n/\n\nemerging technologies BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. "
}