{
    "title": "Next-Gen Xbox To Be The 'Largest Technical Leap' For A New Console \nGeneration: Microsoft",
    "date": "2/17/2024",
    "url": "https://news.abplive.com/gaming/xbox-upgrade-microsoft-update-release-launch-price-specifications-technical-leap-console-1665240",
    "text": "Microsoft revealed fresh details about its plans for Xbox hardware, hinting at the upcoming generation of Xbox consoles and providing updates about its gaming business in a special edition of the Official Xbox Podcast on Thursday. While confirming that four Xbox-exclusive games would launch on PS5 and Nintendo Switch, the company reiterated its commitment to developing Xbox hardware and exclusive titles for the platform. In the podcast, Xbox president Sarah Bond stated that Microsoft was focused on delivering the “largest technical leap” for a new console generation with the next Xbox. Bond also affirmed that fans could anticipate new Xbox hardware later this year in the holiday season — likely the speculated mid-generation refresh of the Xbox Series S/X consoles. The Xbox president said, “There's some exciting stuff coming out in hardware that we're going to share this holiday. And we're also invested in the next-generation roadmap. And what we're really focussed on there is delivering the largest technical leap you will have seen in a hardware generation.” Xbox currently features the Xbox Series X, its flagship current-generation console, along with the lower-end, digital-only Xbox Series S. In September last year, leaked court documents from the Federal Trade Commission's antitrust trial concerning Microsoft's acquisition of Activision-Blizzard unveiled the company's plans for a mid-gen refresh of its Xbox Series X and Series S consoles anticipated in 2024. These documents included concept images of upcoming Xbox hardware, outlining the platform's future releases. As per the leaked concept images, Microsoft's mid-gen refresh for the Xbox Series X carries the codename ‘Brooklin.' It's an all-digital console featuring the same performance and features as the original, with the exception of the optical disc drive. The console showcases a cylindrical design, and upgraded 2TB storage, and is likely to retain the Series X's pricing — $499 or Rs. 54,990. The leaked documents indicated a potential release in October 2024 for 'Brooklin.' Alongside the console, Xbox intends to launch an enhanced controller with gyro, haptic feedback, and adaptive triggers, akin to PlayStation's DualSense controller. During the podcast, where Bond was joined by Microsoft Gaming CEO Phil Spencer and Xbox Game Studios head Matt Booty, the Xbox president did not disclose a launch window for the next generation of Xbox consoles. However, court documents from the FTC trial in June of the previous year suggested that Microsoft anticipates the release of the next-gen Xbox and PS6 in 2028. \"This term would, in any case, go beyond the expected starting period of the next generation of consoles (in 2028),\" the company stated in the documents. The current generation of consoles — Xbox Series S/X and PS5 — was launched in 2020. "
}