{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.geekwire.com/sponsor-post/87-of-young-people-are-talking-to-their-parents-about-online-risks-says-new-research-from-microsoft-however-greater-awareness-of-safety-features-and-tools-is-needed-2/",
    "text": "by Courtney Gregoire on February 23, 2024 at 12:00 amFebruary 22, 2024 at 9:13 am  Earlier this month, Microsoft celebrated Safer Internet Day – an annual event that brings people around the world together to create a safer and better online environment for all. The day provided an opportunity for people of all ages to engage and discuss online activities and safety, particularly with growing interest in emerging technologies. However, we should have conversations about online safety every day, not just on Safer Internet Day. To support that goal, Microsoft released the latest findings from our annual Global Online Safety Survey, along with a Family Safety Toolkit. We share our results publicly so that others can benefit from the insights as we collectively strive to create a safer digital ecosystem. Compared to our 2023 research, our results showed a significant increase in teens who talked to their parents about online risks. In fact, our survey found young people are more likely to speak to their parents than their peers and friends. While more teens are talking to their parents, our research suggests a decline in the use of safety features. For example, the use of private accounts, the most popular safety feature in last year’s research, fell from 64% in 2023 to 56% in 2024. Parental control use remained steady – 90% of caregivers reported using at least one parental control. Enabling users and their families to support informed choices about their online activity is even more important with the advent of generative AI. Importantly, our survey results show that young people trust their parents and go to them for support and guidance around online risk in addition to using safety features. We realize parents and caregivers are busy, and that the tech landscape keeps evolving. Our new Microsoft Family Safety Toolkit seeks to provide support on how to leverage Microsoft’s safety features and family safety settings. It also includes guidance for families looking to navigate the world of generative AI together. Top tips include: Beyond the Family Safety Toolkit, Minecraft Education recently released CyberSafe: Good Game, an immersive adventure that teaches players the responsibilities, tools, responses, and strategies that enable healthy online interactions, collaboration, and rewarding digital experiences, whether those are part of multiplayer gaming or other online activities. We recognize the important role we play as a tech company in empowering young people to use technology safely, mindfully, and in pursuit of social, economic and educational opportunity. The resources we’re sharing today sit alongside our efforts to prevent harm online. Safety by design is at the core of our approach, and we remain committed to continuing to support and work closely with partners across industry, government and civil society to create a safer online world for all. Subscribe to GeekWire's free newsletters to catch every headline Catch every headline in your inbox "
}