{
    "title": "Microsoft developing its own networking chip - report",
    "date": "2/21/2024",
    "url": "https://www.datacenterdynamics.com/en/news/microsoft-developing-its-own-networking-chip-report/",
    "text": "Latest signal the company is looking to reduce its reliance on Nvidia Microsoft is reportedly developing a networking card to move data between its servers, in an effort to reduce the company’s reliance on Nvidia hardware. According to a report in The Information, the project is being led by Juniper Networks co-founder Pradeep Sindhu and could take over a year to develop. Microsoft acquired Sindhu’s server chip startup Fungible for $190 million at the start of 2023. By developing its own networking card, Microsoft is reportedly looking to address traffic issues that have arisen from deploying Nvidia AI chips in its data centers. Due to the large amounts of information that needs to move between servers during the AI development process, they’ve become overloaded, leading to concerns that the company is at a compute disadvantage compared to its competitors. Citing a person with knowledge of the project, The Information reported that the Microsoft network chip will be similar to Nvidia’s ConnectX-7 card, which the chip developer sells alongside its GPUs. If the chips come to fruition, it will enable Microsoft-backed OpenAI to develop its AI models faster and more efficiently. The development of new networking cards is yet another move from Microsoft that signals its desire to reduce its reliance on Nvidia. In November 2023, the company unveiled its Azure Maia AI Accelerator, a 5nm node with 105 billion transistors that reportedly has a performance of 1,600 Tflops of MXInt8 and 3,200 Tflops of MXFP4. In a comment provided to The Information, Microsoft said: “As part of our systems approach to Azure infrastructure, we are focused on optimizing every layer of our stack. We routinely develop new technologies to meet the needs of our customers, including networking chips.” The same month Microsoft debuted Maia, Bloomberg reported that OpenAI CEO, Sam Altman, had been seeking investment to build an artificial intelligence chip company codenamed project ‘Tigris,' possibly more focused on the design of chips. A month prior, Reuters reported the company had evaluated a potential acquisition target in an effort to bring AI chip manufacturing in-house, having hired the former lead of Google's TPU AI chip as the company’s head of hardware. Altman is also an investor in neuromorphic semiconductor company Rain AI, which OpenAI has pledged to buy chips from. Data Centre Dynamics Ltd (DCD), 296-300 St John St, London EC1V 4PAEmail. [email protected]DCD is a subsidiary of InfraXmedia "
}