{
    "title": "Microsoft Bookings, popular scheduling tool from MS365, gets new homepage \nin recent update",
    "date": "2/27/2024",
    "url": "https://mspoweruser.com/microsoft-bookings-popular-scheduling-tool-from-ms365-gets-new-homepage-in-recent-update/",
    "text": "Follow us Share this article Latest news Microsoft Bookings is available for Business Premium subscribers. 2 min. read Published on February 27, 2024 published on \n\nFebruary 27, 2024 Share this article Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft is making appointment scheduling a breeze with a major update to its popular tool, Microsoft Bookings. This update focuses on simplifying the user experience with a central hub on the Bookings homepage and boosting features for both personal and shared bookings. This new revamped homepage acts as a central hub for all Booking activities. Users can now access both personal and shared bookings from a single location, so you don’t need to switch between different interfaces. And not just that, but personal bookings in Microsoft Bookings now allow you to manage your own schedule and share it with others. You can define different types of appointments and customize their details. The platform provides quick-start templates and a guide to help you get started easily. Additionally, the Get Started Guide on the homepage helps you navigate Microsoft Bookings with ease. It offers a three-step process covering key aspects like previewing the experience for those booking appointments, customizing your meeting types, and sharing your booking page. New users will also enjoy an engaging and interactive onboarding process with coach marks and tutorials to help them learn the ropes. The update also features a fresh and intuitive user interface designed to improve your appointment management experience, regardless of whether you’re a seasoned user or just starting out. Microsoft Bookings is available for Business Premium subscribers to Office 365 and integrates seamlessly with Teams and Skype for Business. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Currently reporting news on Microsoft-related products, tech, and AI on Windows Report and MSPowerUser.\nGot a tip? Send it to [email protected]. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}