{
    "title": "$15 billion deal with Microsoft boosts Intel’s chipmaking vision",
    "date": "2/22/2024",
    "url": "https://www.networkworld.com/article/1309384/15-billion-deal-with-microsoft-boosts-intels-chipmaking-vision.html",
    "text": "Intel set up a new business unit, Intel Foundry, to make chips for other companies, and Microsoft is its biggest customer so far.  Microsoft will design its own advanced semiconductor chip and use Intel Foundry to manufacture it, in a long-term deal worth up to US $15 billion. The Microsoft chip will use Intel’s 18A chip manufacturing process, due to roll out later this year, Intel announced Wednesday during an Intel Foundry event. Intel also revealed an aggressive product roadmap designed to make it the world’s second-largest chipmaker by 2030. To achieve that goal, Intel needs signature customers like Microsoft. Intel Foundry is focused on designing chips for the “AI era,” company officials said. Some observers suggested the Intel deal is an attempt by Microsoft to reduce its reliance on Nvidia. However, Microsoft and Nvidia have announced a series of partnerships in recent years, including a 2022 collaboration to build a huge AI supercomputer, an early 2023 collaboration on the industrial metaverse, and a mid-2023 collaboration on enterprise-grade generational AI. The deal gives Microsoft’s business to a US foundry, and Mike Demler, an independent analyst of the chip industry, suggested that the tech giant’s motivation might be reducing its reliance on another huge chipmaker, Taiwan Semiconductor Manufacturing Co. (TSMC). In November, Microsoft announced two custom-designed chips, the Azure Maia AI Accelerator, optimized for AI tasks, and the Arm-based Azure Cobalt CPU, for running general-purpose computing workloads in the cloud. The Intel deal focuses on the future fabrication of these two new chips, Demler said. Microsoft will likely design more chips beyond the AI and cloud models, added Glenn O’Donnell, vice president and research director at Forrester. “This is only the beginning, as it will need more chips to serve other purposes in its cloud operations as well as processing AI at the edge and in PCs,” he said. O’Donnell agreed that the announcement had little to do with Nvidia. The Intel deal is about manufacturing chips, and Nvidia isn’t a chip manufacturer, he noted. “This does not come at the expense of Nvidia,” he added. “They are different relationships.” Microsoft will continue to use Nvidia GPUs in addition to its own chips, O’Donnell added. “Microsoft’s AI ambitions erode a bit of Nvidia’s dominance in powering AI, but Nvidia will remain the juggernaut in AI.” Intel’s flurry of chip announcements this week represents a second attempt for the company to build a foundry ecosystem that supports external customers, Demler said. Intel had announced an internal foundry model, for both external customers and its internal product lines, in October 2022. The company’s new efforts to work with Arm, Cadence Design Systems, and other companies is a “good sign” for future success, Demler added. Intel has turned to making chips for external customers in an effort to rebuild its market share in a competitive industry dominated by TSMC and Samsung. Intel, once the world’s largest chipmaker, began losing market share in the late 2010s due to manufacturing missteps, competition from Arm, Nvidia and other chip designers, and declining PC sales. Intel’s goal is to rebuild the Western chipmaking market, CEO Pat Gelsinger said at Wednesday’s event. Intel wants about 50 percent of the world’s semiconductor chips to be built in the U.S. and Western Europe within 10 years, compared to about 20 percent today, he said. Grant Gross edits and assigns stories and writes about technology and telecom policy in the U.S. government for the IDG News Service. He is based outside of Washington, D.C. Sponsored Links "
}