{
    "title": "Microsoft brings four Xbox games to rival consoles",
    "date": "2/16/2024",
    "url": "https://finance.yahoo.com/video/microsoft-brings-four-xbox-games-175134411.html",
    "text": "Microsoft (MSFT) has announced that it will release four previously exclusive gaming titles for its Xbox consoles to rival console makers Sony (SONY) and Nintendo (NTDOY). The move is a shift in Microsoft's previous strategy and a push to end what has been seen as \"console wars\". Lewis Ward, IDC Research Director of Gaming, joins the Live show alongside Yahoo Finance Tech Editor Dan Howley to discuss the latest development for Microsoft and what it could mean for the gaming sector moving forward. Giving more detail on the announcement, Ward states: \"I think there was a large share of Xbox players who were concerned that a lot of the crown jewels of the Xbox game studios are going to be eventually playable on Playstation 5, and so that was the thing that really caused a lot of consternation, let's say, among the Xbox fanbase. But Phil Spencer and company really tamped that down by saying, no, this is a limited approach that we're taking with four specific games that are a few years old at least. They are successful games... so the idea is to basically monetize a sunken investment at this point, and if they put it on PS5 and Switch, they're going to go to both by the end of this year, It's going to be... several million dollars more coming into the Xbox ecosystem.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino [AUDIO LOGO] AKIKO FUJITA: is opening up its gaming vault. Xbox is rolling out a handful of its previously Xbox exclusive games to Sony's PlayStation, and Nintendo Switch. Microsoft's Xbox CEO Phil Spencer saying on a podcast Thursday, the console maker will also release four exclusive video game titles on external platforms. For more on what this means for Microsoft's growth strategy. I'm joined by Lewis Ward, IDC gaming esports and VR and AR research director alongside our very own tech editor Dan Howley. Good to talk to you today Lewis. We've heard Phil Spencer say in the past, this new strategy about making sure that every screen is an Xbox. How does this announcement fit into that vision? LEWIS WARD: Thanks for having me. So yeah, it's true that Microsoft has been emphasizing the software and the capabilities of offering games on pretty much every screen that consumers have for several years now. So this is an extension of a strategy that's been out there for many years and obviously they want the best experience to be on Xbox console hardware. And then they've pushed into PCs to a significant extent over the past few years. And then mobile is more aspirational. But something they clearly view as a growth opportunity outside of most developed economies is going to be, can we put those same games in the cloud and offer it on iOS and Android devices that people have counted in the billions worldwide? DANIEL HOWLEY: But Lewis, I want to ask, when it comes to Microsoft, their console sales are slower than the PlayStation 5. I think the estimate was take-two, it said there were 77, 9th generation consoles sold the Xbox Series S and X and the PlayStation 5. And Sony recently said that they sold 50 million PlayStation 5. So I guess that leaves 27 million Xbox units. So almost 2 to 1 difference. What does it mean now that they're thinking of taking these or they are taking these first party titles to other devices. We heard Phil Spencer say that they're sticking with the hardware strategy. But it seems increasingly like they're moving to a software focused side of things. LEWIS WARD: absolutely. So the four titles are not like the crown jewels, it's not halo, it's not gears of war or Forza. It seems to be sea of thieves, a live service game, grounded was another one that appears to be, I don't think they've finally released the titles. But that's certainly the online speculation. And yes, I think there was a large share of Xbox players who were concerned that a lot of the crown jewels of the Xbox Game Studios are going to be eventually playable on PlayStation 5 and so that was the thing that really caused a lot of consternation, let's say among the Xbox fan base. But Phil Spencer and company really tamp that down yesterday by saying, no this is a limited approach that we're taking with four specific games, that are a few years old at least. They are successful games, very high Metacritic ratings and so the idea is to basically monetize a sunk investment at this point. And if they put it on PS5 and switch it sounds like they're going to go to both all four games, are going to go on both by the end of this year. It's going to be a few, I don't know, several million dollars coming into the Xbox ecosystem from a revenue angle and hopefully grow some more fans even on competitor's hardware as it were. So I think that's the plan, the vision. DANIEL HOWLEY: I guess what does it say then that people were nervous that Microsoft was just going to move out of the hardware business. I guess, it gives the feeling that there's a sense that there's a lack of security for Xbox. LEWIS WARD: and I mean, I guess there was a leak or something, a week or two ago that hinted that it could be much more than what was ultimately announced yesterday and presumably, it's plausible that some games we don't know about will follow the same trajectory. I might add that Minecraft is a hugely successful game for Microsoft. That's on every platform under the sun and no one seems to particularly care about it. But yeah, at the end of the day, there has been significant concern that perhaps they're even going to get out of the hardware business or that again, some of their real mainstay franchises first party stuff are going to show up on other console platforms. And in effect as far as I'm concerned, Phil Spencer and company Matt Booty, Sarah Bond basically said that is not going to happen for the foreseeable future, at least. So to my mind, the podcast interview really should have assuaged a lot of the concerns that were expressed by Xbox gamers that expressed concerns that that might happen. Related Quotes "
}