{
    "title": "Microsoft creates new Gen AI team to develop smaller and cheaper language \nmodels: Report | Mint",
    "date": "1/24/2024",
    "url": "https://www.livemint.com/technology/tech-news/microsoft-creates-new-gen-ai-team-to-develop-smaller-and-cheaper-language-models-openai-large-language-model-ai-report-11706075901101.html",
    "text": "Microsoft is reportedly working on developing artificial intelligence technology that is smaller and cheaper to run than the current technology it is currently sourcing from OpenAI. Also Read | State-backed Russian hackers breach Microsoft's email system, says tech giant According to a report by The Information, Microsoft has formed a new team to develop conversational AI that requires lower processing power compared to OpenAI's technology. The report also notes that Microsoft has moved several top developers from its research group to the new-Gen AI team. The new team is expected to be part of the Azure cloud unit and could be led by Microsoft corporate vice president Misha Bilenko. So far, Microsoft has relied heavily on OpenAI for the development of its artificial intelligence-based products. For example: Microsoft's Bing Chat is powered by the GPT-4 language model, while the Bing AI Image Creator uses the Dall-E 3 image generator to create AI images. Microsoft doubles down on Copilot:In other AI news, Microsoft recently launched its Copilot Pro subscription which gives users access to Microsoft's AI powered Office features, priority access to latest language models like OpenAI's GPT-4 Turbo, ability to create a custom version of Copilot: Copilot GPT and brings better-detailed image quality with Bing AI image generator.\n   Also Read | Microsoft launches consumer version of Copilot AI assistant. Details here\n   Microsoft has also launched a CoPilot for Microsoft 365 which is now available for available for enterprise customers and is touted to help businesses become AI-powered. The company had also announced the launch of Copilot Android and iOS app.\n\n\n\n\nYou may be interested in\n\n\n\n\n\n\n\n\n\n\n\n\n    With the new subscription, Microsoft now offers its Copilot AI assistant in 3 variants: the free version of Copilot which can function like any other chatbot like ChatGPT or Bard, Copilot Pro subscription which costs $20 per month and a Copilot for Microsoft 365 subscription which costs $30 per month.\n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Chip(per) ambitions: Why India needs its wafer fabs          Dholera chip fab: India's leap into electronics manufacturing          Mint Primer| Google vs Indian startups row: its global implications          Ask me anything: Inside the race to build desi GPTs          A Google Maps competitor in India's tech revolution          ‘Need another technology leap for AI to start reasoning like humans’          Govt's ₹1-trillion deep tech fund: why we need it, and is it enough?          Telepathy: Would you allow a chip implant in your brain?          Budget 2024: India's digital public infra now a new 'factor of production'          Rights issue caps Byju's wild ride from top startup to throwaway valuation       Explore Premium  \n\n\n                Catch all the  Technology News and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 24 Jan 2024, 12:26 PM IST\n\t\nTopics You May Be Interested In \n microsoft \n microsoft ai \n artificial intelligence \n openai \n ai \n chatgpt \n microsoft bing ai \n microsoft bing \n microsoft copilot \n copilo In other AI news, Microsoft recently launched its Copilot Pro subscription which gives users access to Microsoft's AI powered Office features, priority access to latest language models like OpenAI's GPT-4 Turbo, ability to create a custom version of Copilot: Copilot GPT and brings better-detailed image quality with Bing AI image generator. Also Read | Microsoft launches consumer version of Copilot AI assistant. Details here Microsoft has also launched a CoPilot for Microsoft 365 which is now available for available for enterprise customers and is touted to help businesses become AI-powered. The company had also announced the launch of Copilot Android and iOS app. With the new subscription, Microsoft now offers its Copilot AI assistant in 3 variants: the free version of Copilot which can function like any other chatbot like ChatGPT or Bard, Copilot Pro subscription which costs $20 per month and a Copilot for Microsoft 365 subscription which costs $30 per month. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}