{
    "title": "Small Business News | Microsoft launches AI assistant, SMBs combat surge in \ncybersecurity, Jan. 31 tax deadline",
    "date": "1/23/2024",
    "url": "https://www.asbn.com/small-business/small-business-news/small-business-news-microsoft-launches-ai-assistant-smbs-combat-surge-in-cybersecurity-jan-31-tax-deadline/",
    "text": "Microsoft Copilot virtual assistant now open to small businesses, individuals\nSmall business owners can now access the artificial intelligence-powered Microsoft Copilot virtual assistant through their Microsoft 365 Business Premium or Business Standard subscriptions. Microsoft Copilot is a generative text platform giving users the ability to receive detailed answers to queries or create content based on specific inputs. Read More Small business owners combat surge in cybersecurity threats\nCybersecurity remains one of the top concerns for entrepreneurs as the number of small businesses impacted by a digital attack hits 44%. That data comes from online security platform McAfee in collaboration with Dell Technologies, who conducted a survey of 700 company owners, managers, and leading I.T. professionals across six countries, including the U.S. Read More Jan. 31 is the last day to submit wage statements, independent contractor forms to IRS\nThe Internal Revenue Service (IRS) has issued a reminder to employers that the deadline for submitting wage statements and independent contractor forms is January 31. Employers must file their copies of Form W-2, Wage and Tax Statement, and Form W-3, Transmittal of Wage and Tax Statements, with the Social Security Administration by January 31. Read More SBA celebrates record number of business applications in 2023\nAmericans submitted 5.5 million business applications in 2023, an all-time high marking the third consecutive year of record-breaking growth. According to Census data, the number of business applications filed in 2022 and 2021 reached 5.3 million (third-highest) and 5.4 million (second-highest), respectively. Read More Did you know? ASBN America’s Small Business Network is now available to stream in over 70 million broadcasting households for users with Roku, Firestick, AppleTV, and mobile Android [download] and Apple IOS [download] devices. ASBN, from startup to success, we are your go-to resource for small business news, expert advice, information, and event coverage. While you’re here, don’t forget to subscribe to our email newsletter for all the latest business news know-how from ASBN. We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. "
}