{
    "title": "Microsoft rides AI wave to $3 trillion valuation",
    "date": "1/28/2024",
    "url": "https://coingeek.com/microsoft-rides-ai-wave-to-3-trillion-valuation/",
    "text": " Home » Business » Microsoft rides AI wave to $3 trillion valuation Business   28 January 2024 Microsoft (NASDAQ: MSFT) has become the second company globally to hit $3 trillion in market valuation after Apple (NASDAQ: AAPL) as its bet on artificial intelligence (AI) continues to pay off. Microsoft’s shares have climbed 7% in the past three weeks to hit $404.5 on Wednesday, pushing the company’s valuation to $3.004 trillion. The stock has since dipped slightly to $402.5, and the valuation has dropped just below $3 trillion. Apple was the first company to hit this milestone in June last year. The landmark achievement caps what has been one of Microsoft’s best years. The company’s bet on AI has pushed its stock to new heights as investors continue to bet on the technology. For a brief time, Microsoft eclipsed Apple to become the world’s most valuable company, but the iPhone maker has reclaimed its spot, although the gap between the two is getting smaller. Microsoft is scheduled to announce its fourth-quarter earnings on Tuesday, January 30, and if it beats Wall Street’s estimates, it could retake the top spot from Apple. Microsoft’s achievement is no mean feat. A decade ago, the Redmond-based software giant was losing its edge, and its stock had taken a beating. Its foray into the mobile world had been disastrous as iOS and Android outmuscled its Windows system. Its cloud business was facing intense competition from Amazon (NASDAQ: AMZN) and other newcomers. Satya Nadella’s appointment as CEO was the catalyst that sparked a change of fortunes for the company. His acquisitions, including LinkedIn, GitHub, Minecraft maker Mojang Studios, and Xamarin, have all been great successes. However, his bet on AI has been his crowning glory. As far back as nine years ago, Nadella was waxing lyrical about the power of machine learning and, later on, AI. Today, Microsoft is the most significant player in the technology as the primary investor in ChatGPT maker OpenAI. Its existing solutions also leverage AI, including its Bing search engine and Office suite; it has also launched new products like Copilot. Azure has become the cloud computing platform of choice for the AI sector. Companies betting on AI have been the biggest gainers in market cap globally, with Nvidia (NASDAQ: MSFT) joining the $1 trillion club in June. In order for artificial intelligence (AI) to work right within the law and thrive in the face of growing challenges, it needs to integrate an enterprise blockchain system that ensures data input quality and ownership—allowing it to keep data safe while also guaranteeing the immutability of data. Check out CoinGeek’s coverage on this emerging tech to learn more why Enterprise blockchain will be the backbone of AI. Watch: Cybersecurity fundamentals in today’s digital age with AI & Web3 width=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"> New to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology. In this CoinGeek Weekly Livestream AMA session, Kurt Wuckert Jr. covered topics like the recent COPA v Wright trial, alternative blockchains, decentralization, private blockchains, and more. As interest in digital asset investments grows, Deutsche Börse eyes developing a platform that would make tokenized assets fungible for institutional clients and boost its profit in the long run. Microsoft is ramping up its AI efforts as tech giants race to become the frontrunner in the industry, hiring key players from Inflection AI to spearhead its consumer AI arm. Join the official Bitcoin SV Discord channel: www.discord.gg/bsv "
}