{
    "title": "Microsoft CoPilot vs ChatGPT: How Do They Compare?",
    "date": "1/29/2024",
    "url": "https://tech.co/news/chatgpt-vs-microsoft-copilot",
    "text": "Going into 2024, generative AIs are the buzziest tech topic. But just one of them — ChatGPT — is getting nearly all the attention. Granted, Elon Musk's new tool, “Grok,” is attempting to steal some limelight, but let's not forget one of the oldest competitors: Microsoft Copilot. Microsoft's AI-powered Copilot service works with any Microsoft application you can name: It's accessible for Microsoft 365, Edge, Bing, and Windows 11. Microsoft has announced Copilot will even roll out on Windows 10, despite plans to end support for that generation of the platform within a few years. What does Microsoft Copilot do that ChatGPT or others don't? What makes it worth figuring out? Here's everything you need to know. Copilot is a chatbot, designed for a back-and-forth conversation with any given user. This is similar to the basic iteration of ChatGPT. Copilot lets users pick what style of conversation they want to have: More creative, more balanced, or more precise. It will help you with tasks like meal prep plans or to recommend furniture brands — answering questions that are a little too complex to just Google. 🔎 Want to browse the web privately? 🌎 Or appear as if you're in another country?Get a huge 86% off Surfshark with this special tech.co offer. But the secret here is that “Microsoft Copilot” can refer to multiple different applications, depending on where you're accessing them. The version on the search engine Bing has been around since February 2023 as “Bing Chat” and was recently rebranded. On Windows 11, Copilot has appeared since late September as a button that you can click to pull up a righthand sidebar that hosts the chatbot. It works the same way on Windows 10, as of November 16. Microsoft Copilot functions in Windows 10 with a sidebar, as it does on Windows 11. Image source: Microsoft Like any massive multinational technology corporation, Microsoft has so many different products and services, often gained through a long history of acquisitions, that establishing a single throughline can be difficult or even impossible in some cases. Calling all its AI applications “Copilot” helps the company to spackle over these differences. We've mentioned the Bing version and the Windows version. Here are all the other applications: Of these all, Github Copilot is the odd one out, as it's functions aren't anchored in the same “foundational LLMs” that the other tools rely on. No matter which version you use, you're getting an AI tool that typically functions as a chat bot, delivering answers fine-tuned to the needs of the product you're using. The search engine AI gives general answers, the 365 AI helps pull out insights from your company data, and in 2024, the Viva Insights AI will analyze employee data to deliver business-specific insights. Microsoft Copilot is more of an add-on than a standalone service, so its “pricing” is tough to quantify: Enterprise pricing for Microsoft 365 starts at $36.00 per user, per month, with an annual commitment, and it's the only way to get Copilot on Microsoft 365. But you'll also be getting a huge licensing package that includes Word, Outlook, Microsoft Teams, and way more. A GitHub Copilot subscription costs $10 per month, or $100 per year when billed annually, although businesses must pay $19 per user per month. Copilot for Sales, Service, or Viva Insights is bundled with the cost for those services. Some versions of Microsoft Copilot — but not all — won't cost you a cent. Head over to Bing and you'll get that version of Copilot for the low, low cost of zero dollars. You can also get Copilot on Windows 10 and 11 for free: Just download the most recent software updates and they'll be included. In sharp contrast, ChatGPT pricing is easy to explain: There's a free GPT-3 version, and there's a paid $20-a-month version that opens up access to third-party ChatGPT plugins, a newer GPT-4 model, and integrations with the image-based AI DALL-E 3. There's an enterpise tier of ChatGPT as well, which lets businesses train their own version with custom data. The large language models (LLM) behind ChatGPT were trained on a vast range of data publically available on the internet, scraping everything from artists' oeuvres to entire libraries and news archives. However, both the GPT-3.5 and GPT-4 models only use data from prior to September 2021, meaning that current news stories won't be in the mix. Copilot, once again, is hard to explain, since it refers to different models. Here's what to know about Copilot data sources for GitHub Copilot and the other Microsoft services. Microsoft says that its “AI-powered LLMs are trained on a large but limited corpus of data” and while this is a little vague, Microsoft works closely with OpenAI (which it has invested billions into) and draws on ChatGPT to at least some extent. So, if you use ChatGPT you get ChatGPT, and if you use a Microsoft Copilot tool, you get ChatGPT plus all the data available on your Microsoft products. One thing we can confirm for sure: No version of Microsoft Copilot is trained on its customers' proprietary data — it will use your data locally in order to deliver tailored business insights, but customer data won't be added to the pool of data that the AI itself learns from.   ChatGPT is owned by OpenAI, one of the biggest brands in AI companies right now. The LLM that powers ChatGPT is considered the best in the business, beating even a new coding-centric LLM Microsoft was working on this last summer. Meanwhile, GitHub Copilot is powered by the OpenAI Codex, owned by, you guessed it, OpenAI. Even the platform that launched the entire suite of Microsoft's Copilot AI products was powered by the company behind ChatGPT. There's no better way to start trying out Microsoft Copilot than with its free chatbot iterations: Hop over to the search engine Bing or download the latest version of Windows 11. They're both free, and they're both great ways to hold a conversation with the version of AI that Microsoft has stamped its brand name onto. Verifying Get the latest tech news, straight to your inbox Stay informed on the top business tech stories with Tech.co's weekly highlights reel. By signing up to receive our newsletter, you agree to our Privacy Policy. You can unsubscribe at any time. We're sorry this article didn't help you today – we welcome feedback, so if there's any way you feel we could improve our content, please email us at contact@tech.co The iPhone maker is hiring for a wide range of positions... AI systems are particularly vulnerable to security... The settlement centers around anyone who owned an Apple... Email drafts, meeting recaps, and much more: The average... "
}