{
    "title": "Microsoft briefly dethroned Apple as the world's most valuable company",
    "date": "1/12/2024",
    "url": "https://www.techspot.com/news/101498-apple-briefly-dethroned-microsoft-takes-lead-world-most.html",
    "text": "In context: Apple achieved a groundbreaking milestone in August 2018 by becoming the first ever company to surpass the $1 trillion market capitalization. Since then, its market value has experienced substantial growth, with a notable surge that momentarily reached the $3 trillion threshold in June 2023. Following this peak, Apple's market cap stabilized in the upper $2 trillion range, consistently maintaining its status as the world's most valuable company and outpacing Big Tech competitors. That status quo changed temporarily this week when fellow tech giant Microsoft briefly overtook the iPhone maker as the world's most valuable company, marking the first time since 2021 that Apple was removed from its perch. Microsoft has surpassed Apple's market cap multiple times in recent years, including in 2018, 2020, and 2021. Every time, Apple has managed to regain its leading position. Also read: Biggest Rivalries in Computing History Microsoft managed to once again overtake Apple's market value this week after its shares rose around 1 percent in early trading on January 11, increasing its market value to $2.903 trillion, while Apple's shares fell almost 1 percent. By the end of the day, however, Apple had regained its position at the top, with the company's shares recovering somewhat, while Microsoft's stock corrected marginally. At the close of trading in New York, Apple was valued at $2.886 trillion and Microsoft's market cap closed at $2.859 trillion.  Microsoft's most recent stock surge is attributed to ongoing investments in generative AI, a sector considered by many analysts as the tech industry's future. Microsoft is a significant investor in OpenAI, the creator of ChatGPT and AI image generator Dall-E. In contrast, Apple's involvement in AI appears more conservative. The lion's share of the company's revenue still come from hardware sales and related services, with iPhones remaining its bread and butter. However, weaker iPhone sales, especially in China, have led a number of leading Wall Street analysts to downgrade the company's stock in recent weeks. While Microsoft is betting big on artificial intelligence and the cloud, Apple remains focused on consumer hardware, and is set to throw its hat into the VR ring with the launch of its Vision Pro mixed reality headset next month. The company also plans to launch a slew of new Macs, iPads, and iPhones later this year, while Microsoft is tipped to release the next version of Windows, provisionally named Windows 12, in June 2024. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}