{
    "title": "Investing Preview 2024: Buy These 4 \"Magnificent Seven\" Stocks. Avoid the \nOthers.",
    "date": "1/1/2024",
    "url": "https://finance.yahoo.com/news/investing-preview-2024-buy-4-132100193.html",
    "text": "Any investing exposure to the \"Magnificent Seven\" stocks has made your 2023 investing year a big success. This group of mega-cap tech stocks, including Nvidia (NASDAQ: NVDA), Amazon (NASDAQ: AMZN), Tesla (NASDAQ: TSLA), Apple (NASDAQ: AAPL), Microsoft (NASDAQ: MSFT), Meta Platforms (NASDAQ: META), and Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL), has outperformed the broader market despite the Nasdaq Composite surging over 45% last year. If it's not broken, don't fix it... right? Well, not exactly. A look at the numbers signals that some of these genuinely magnificent stocks could soon run out of steam. Here are the four stocks in this group worth buying in 2024, and the three to leave behind in 2023. Nvidia's chips, which specialize in demanding, high-compute applications, have become a focal point of the artificial intelligence (AI) breakthrough. The company has quickly established dominance, controlling as much as 90% of the market for AI chips. That's pushed the business to new heights, accelerating revenue growth to 200% year over year in its most recent quarter to $18 billion. AI demand doesn't seem to be going anywhere, which should create plenty of growth for Nvidia moving forward. Analysts believe the company's earnings will grow by 42% annually over the coming years, arguably justifying Nvidia's valuation at 40 times 2023 profits. That's a PEG ratio of just 1, signaling the stock is still attractive despite its massive 250% climb in 2023. Not every \"Magnificent Seven\" company has grown enough to keep up with its stock. Apple's revenue has fallen over the past year, and net income is up just 1%. Apple's business can be cyclical, gyrating between periods of growth depending on key iPhone releases. That's fine, but it can complicate things when share prices and operating results go in different directions. Analysts have lowered their growth expectations for Apple moving forward. At more than 29 times 2023 earnings, that PEG ratio over 3 makes buying Apple here a tough pill to swallow. Investors should wait for the price to make sense again. Wall Street was down on Meta in 2022 when the company was fighting a slowing advertising business, harmful privacy changes to iPhones, and expensive metaverse projects that weren't showing any return on investment. Shares fell to $89 before CEO Mark Zuckerberg righted the ship by cutting costs, working through the iPhone challenges, and getting revenue growth and profits back on track. Astonishingly, the stock is still attractive at just 25 times 2023 earnings, with expected annual growth of 20% on average moving forward. It turns out that Meta is still a great business, and Wall Street forgot that in a big way. The rally in 2023 undid the pessimism, but there is still room for the growth Meta can achieve in 2024 and beyond. ChatGPT was a viral sensation in 2023, and Microsoft swiftly jumped in, tying itself to its creator, OpenAI, with a multibillion-dollar investment and extended partnership. Between enterprise software, cloud computing, gaming, and more, Microsoft is one of the world's largest and most diversified technology companies. Its cloud positioning amid the AI opportunity has seemingly boosted analyst expectations for its earnings growth in the coming years. Mid-teens growth is nothing to dismiss, but it's becoming harder to call Microsoft a growth stock at its whopping $2.8 trillion market cap. At a forward P/E over 33, the stock's resulting PEG ratio over 2 isn't as appealing as some other \"Magnificent Seven\" stocks. It's not abhorrently expensive, but after its 57% single-year gallop, there are better deals out there. It's OK for investors to be picky. Interestingly, e-commerce and cloud leader Amazon trades at a similar PEG ratio to Microsoft of just over 2. So, why should investors consider buying Amazon over similarly valued Microsoft? Amazon is famous for investing its profits into the business, which can understate its true profit potential. The stock trades at 57 times its bottom-line earnings but just 22 times its operating profits, which are earnings from day-to-day business. Over the past decade, that's over 20% below Amazon's average price-to-cash-from-operations ratio. Amazon has tons going on, including investing in developing its AI technology, a critical ingredient to its future. That's not touching on e-commerce, which still has room to grow over the coming decades (e-commerce is just 15% of U.S. retail). Electric vehicle and energy company Tesla is another example of share price and fundamentals heading in opposite directions. Tesla began cutting prices in 2023 to boost unit sales. The idea is that more units made and sold will let Tesla lower its prices, a cycle that will price competitors out of the market. It's a bold move that has brought short-term consequences to Tesla's operating results. Gross profit margin is down 22% over the past year. Hopefully, unit sales will grow enough for Tesla to realize the cost savings it's striving for soon. Analysts have aggressively lowered their expectations for Tesla's future earnings growth due to the price cuts. If analysts are correct, Tesla's stock has become far more pricey at a PEG ratio over 4. After the stock ran 130% last year, investors might be better off waiting to buy until the numbers prove Tesla right in its price-cutting strategy. Alphabet's dominance with Google and YouTube overshadows its behind-the-scenes AI potential. The company is leaning on AI to help customers maximize their advertising spend on its platforms (how Alphabet makes most of its money). Its massive pile of user data and pole position among the world's most trafficked websites makes Alphabet a boring but effective money-printing machine. The company spends much of that cash flow buying back tons of stock, lowering the number of outstanding shares by 10% in the past five years. That recipe of growth and buybacks has analysts expecting earnings to compound at over 17% annually. The stock's 57% run in 2023 has raised its valuation, but it remains a solid deal for long-term investors at a PEG ratio of 1.4. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of December 18, 2023  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has a disclosure policy. Investing Preview 2024: Buy These 4 \"Magnificent Seven\" Stocks. Avoid the Others. was originally published by The Motley Fool Related Quotes "
}