{
    "title": "Microsoft Replaces Apple as Most Valuable Public Company",
    "date": "1/15/2024",
    "url": "https://www.entrepreneur.com/business-news/microsoft-replaces-apple-as-most-valuable-public-company/468348",
    "text": "Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC By          \n            Amanda Breen\n          \n                                                    •\n            \n            \n              Jan 15, 2024 Share A new tech giant is reigning supreme on Wall Street. Microsoft Corp reclaimed the top spot as the world's most valuable company, eclipsing tech giant Apple Inc. during Friday's trading session for the first time in over a year, The New York Times reported. Related: This U.S. Tech Giant Is About to Outperform France's Whole Stock Market Microsoft's upward shift in market capitalization arrived at an all-time high of $2.89 trillion, beating out Apple's last recorded market cap of $2.87 trillion. Apple's stock value surged 48% in the previous year, but concerns over lower iPhone demand have already driven it down 3% in 2024, Reuters reported. In contrast, Microsoft's stock is up roughly 3% year to date thanks to its strong push into generative AI in 2023, during which its value ballooned 57%. Microsoft's early focus on the cloud computing business also gave it an advantage that remains significant, per the NYT. Apple consumers are holding onto their iPhones for longer periods of time — cognizant of \"incremental improvements\" to new models, AP News reported in November. And in China, the restriction of foreign smartphone usage and Huawei's new phone release are presenting additional hurdles. Microsoft's chief executive Satya Nadella made Microsoft's first of several investments in GPT-4-creator OpenAI in 2019, and by the summer of 2022, was adding generative AI to his company's products at what he admitted was a \"frantic pace,\" per the NYT. \"It simply comes down to gen A.I.,\" Brad Reback, an analyst at the investment bank Stifel, told the outlet. \"Apple doesn't have much of an A.I. story yet.\" Related: Apple Becomes the First Company to Cross an M-Cap of $3 Trillion Even Apple's launch of its most significant product since the iPhone in 2007, the Vision Pro mixed-reality headset, is expected to have a minimal impact on Apple's earnings in 2024. In December, UBS analyst David Vogt predicted that sales of 400,000 units of the headset in the first year would add about $1.4 billion in revenue, which he noted would be \"relatively immaterial,\" per The Wall Street Journal. Entrepreneur Staff Senior Features Writer Want to be an Entrepreneur Leadership Network contributor?\n                \n  Apply now to join. At 41, Josh Grinstead knew he was at a crossroads. Sarah Michelle Boes knew there had to be a better way to prepare for her stress-inducing nurse practitioner's exam — so she created it. The winning applicants span 38 states, Washington, D.C., and Puerto Rico. Dell laid off 5% of its workforce, around 6,650 workers, in February 2023. We are constantly told what to do if we want success — but what about the habits to avoid? Here are three value-add products and services that can help your business scale. Successfully copied link We'll be in your inbox every morning Monday-Saturday with all the day’s top business news, inspiring stories, best advice and exclusive reporting from Entrepreneur. Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC  "
}