{
    "title": "Microsoft introduces AI tools to drive business cloud sustainability",
    "date": "2/17/2024",
    "url": "https://itbrief.com.au/story/microsoft-introduces-ai-tools-to-drive-business-cloud-sustainability",
    "text": "In a compelling advancement toward bridging the gap between sustainability pledges and tangible progress, Microsoft unveiled a suite of new data and AI solutions within its Cloud for Sustainability. Announced by Satish Thomas, Corporate Vice President of Microsoft Industry Clouds, this initiative is designed to equip organizations with the essential tools to accelerate their sustainability journeys amidst a backdrop where urgent action is increasingly paramount. Despite 85% of executives recognizing sustainability as strategically crucial, a mere 16% have successfully integrated it into their business strategies. Microsoft's latest offerings aim to address this disparity, providing organizations with the means to transform sustainability pledges into actionable progress. Central to this initiative is the introduction of Microsoft Fabric, an analytics SaaS platform launched in May 2023. It promises an end-to-end solution for managing sustainability data, offering a unified analytics experience powered by AI. This platform enables organizations to harness ESG data previously inaccessible, offering insights that can drive informed decision-making and action across all levels of an organization. The preview of sustainability data solutions within Microsoft Fabric highlights the company's commitment to accelerating sustainability efforts. By facilitating easier access to ESG data, organizations can swiftly translate vast volumes of sustainability data into actionable insights and progress. Moreover, the integration of Copilot and intelligent insights in Microsoft Sustainability Manager, currently in preview, signifies a leap forward in utilizing generative AI for sustainability. This technology allows organizations to analyze environmental data efficiently, identify reduction opportunities, and streamline sustainability reporting. The AI's capability to interact with sustainability data using natural language queries enhances decision-making processes, offering a faster and more efficient route to sustainability progress. One notable case study underscoring the impact of these innovations is Södra, Sweden's largest forest-owner association. Through the utilization of Microsoft Sustainability Manager's AI capabilities, Södra has streamlined its sustainability practices, particularly in reporting. \"With the AI capabilities in Microsoft Sustainability Manager, we can be more productive, which is our ultimate goal,\" shared Cristian Brolin, Chief Digital Officer at Södra. He emphasized the Copilot feature's ease of use and its potential to expedite their work processes, highlighting the excitement surrounding the acceleration of their sustainability progress. Addressing the significant role of supplier activities in an organization's emissions footprint, Microsoft has also launched an ESG value chain solution. This solution simplifies data collection from suppliers, offering a more secure and streamlined process that enables organizations to pinpoint emissions reduction opportunities within their supply chain. This suite of solutions not only facilitates efficiency and accuracy in sustainability decision-making and reporting but also opens new avenues for business growth. The United Nations and Accenture's research indicates that sustainability is increasingly central to CEOs' roles, with many translating sustainability actions into new business models. An exemplar of this transformative potential is Allegiant Stadium, which leveraged Microsoft Sustainability Manager to achieve LEED Gold certification and 100% renewable energy utilization. This underscores the broader implication of Microsoft's initiatives: leveraging the convergence of sustainability and AI to not only achieve compliance and efficiency but also to drive innovation and new growth opportunities in a sustainable future. Microsoft's commitment to sustainability, articulated through these new data and AI solutions, embodies a significant stride towards empowering organizations to transition from sustainability pledges to measurable progress. Through the strategic application of technology, the path to a sustainable future appears not just feasible but filled with potential for transformation and growth. "
}