{
    "title": "This \"Magnificent Seven\" Stock Proved Once Again Why It's the Surest of \nThem All",
    "date": "2/8/2024",
    "url": "https://www.fool.com/investing/2024/02/08/this-magnificent-seven-stock-proved-once-again-why/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The \"Magnificent Seven\" is a nickname given to the seven largest tech companies on the market: Apple, Amazon, Alphabet, Meta Platforms, Microsoft (MSFT -0.15%), Nvidia, and Tesla. Over the past decade, the worst-performing stock out of the seven is Alphabet -- and it's up over 400%. Considering their performances, the nickname for the collective is warranted. Each company in the Magnificent Seven is a market leader in its own right, and there are legitimate bullish investing cases for each. However, if there were one stock from the bunch that you could be the surest of over the long run, it's Microsoft. Here's why. Each company in the Magnificent Seven has a specific product or service that serves as its bread and butter. The iPhone is 58% of Apple's revenue; Google advertising is more than three-fourths of Alphabet's revenue; advertising is 96% of Meta's revenue; and GPUs make up most of Nvidia's revenue. The story is a bit different with Microsoft. Here's a breakdown of the company's fiscal 2024 second-quarter earnings (ended Dec. 31).  In its latest quarter, Microsoft made $62 billion in revenue (up 17.6% year over year). Its largest business segment, Intelligent Cloud, only accounted for around 41% of it. Even then, Microsoft's Intelligent Cloud segment is fairly broad and includes cloud service Azure and other server products. Microsoft's Productivity and Business Processes segment includes its Office and Dynamics products and LinkedIn. Its More Personal Computing segment includes Windows, Xbox, search and news advertising, and other devices. So even though Microsoft categorizes its business into three broad segments, many products and services make up its broad and diversified ecosystem. Having a diverse business is great and has its benefits. Not many people would argue against that point. What's better, though, is having a diverse business that other corporations and businesses rely on to run their businesses. The latter is the case for Microsoft. Countless companies globally rely on Windows, Office products, Azure, LinkedIn, and other services for their operations. This gives Microsoft a buffer during rough economic times. When the economy isn't the best and consumers need to be more price conscious, it's relatively easy to say no to the latest iPhone, cut back on online shopping, or reduce an advertising budget. It's more challenging for companies to switch to new operating systems, migrate from the cloud back to on-premise solutions, or not recruit on LinkedIn. Microsoft's business may not be as flashy as some of the other Magnificent Seven stocks, but there's no doubt that it continues to be a cash cow. Its $21.9 billion in net income is the second-highest of the Magnificent Seven, trailing only Apple. Having net income growth outpace revenue growth by so much shows the company is operating and scaling more efficiently. In the coming years, a lot of Microsoft's growth will rely on the growth of its cloud business. Azure trails Amazon Web Services (AWS) in market share, but the business is growing impressively. It gained market share in the past quarter and sits comfortably in second place, with a 24% share of the global cloud infrastructure services industry as of 2023's fourth quarter. AWS and Google Cloud are at 31% and 11%, respectively. The emergence of AI and Microsoft's partnership with ChatGPT creator OpenAI has helped boost the company's competitive advantage in the space. Microsoft Azure had 53,000 AI customers at the end of its last quarter, and over a third were added within the past 12 months. As the cloud industry grows, Azure should continue to drive a lot of Microsoft's growth. The increase in research and development spending shows the company is committed to innovation and staying with the times. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Stefon Walters has positions in Apple and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}