{
    "title": "Amazon's AWS Vs. Microsoft's Azure Vs. Google Cloud: Which Company Won The \nCloud Race In Q4? - Microsoft",
    "date": "2/3/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/36923696/amazons-aws-vs-microsofts-azure-vs-google-cloud-which-company-won-the-cloud-race-in-q4",
    "text": "Cloud titans Amazon, Inc. AMZN, Microsoft Corp. MSFT and Alphabet, Inc. GOOGL GOOG all reported fourth-quarter results this week, and the spotlight was on their Cloud businesses, given their high-margin nature. The Q4 Cloud Race: Amazon’s Amazon Web Services, or AWS, is the frontrunner in the cloud market, with Microsoft’s Azure public cloud and Alphabet’s Google Cloud Platform, or GCP, playing catch-up. AWS: In the fourth quarter, Amazon’s AWS reported revenue of $24.20 billion, marking a 13% year-over-year growth and a 5% sequential increase. The year-over-year growth inflected higher after declining from 28% in the third quarter of 2022 to 12% in both the second and third quarters of 2023. Operating profit from the segment rose a robust 38% to $7.17 billion, with operating margin at 39%. The AWS business accounted for 14.24% of Amazon’s total revenue and 54.26% of its operating income, helping to mitigate the operating loss incurred by the company’s international e-commerce business. See Also: Best Tech Stocks Right Now Azure: Microsoft’s December quarter is the second quarter of its fiscal year. Intelligent Cloud business fetched revenue of $25.9 billion of the company’s total revenue of $62 billion. This marked a 20% year-over-year growth,  and excluding the currency impact, the growth was a more modest 19%. Intelligent cloud business comprises server products and cloud services, as well as enterprise and product services. Business revenue was driven by  Azure’s 30% revenue growth. That growth accelerated from 29% in the fiscal first quarter. The company does not give a dollar breakdown for the components of the Intelligent Cloud business. “We now have 53,000 Azure AI customers. Over one-third are new to Azure over the past 12 months,” CEO Satya Nadella said on an earnings call. “Overall, we are seeing larger and more strategic Azure deals, with an increase in the number of billion-dollar-plus Azure commitments.” CFO Amy Hood clarified that six percentage points of Azure growth came from AI services. Overall, Microsoft Cloud revenue grew 24% to $33.7 billion, and the segment has a gross margin of 72%. GCP: Alphabet’s Cloud business fetched the company $9.19 billion in revenue in the fourth quarter, up 25.66% from the $7.32 billion reported in the year-ago period. The year-over-year growth jumped from third quarter’s 22.47% number. Revenue from the GCP segment accounted for roughly 10.65% of Alphabet’s total revenue. It generated operating income of $864 million. Although Amazon led in terms of absolute Cloud revenue dollars, Microsoft saw the fastest growth followed by Google. Microsoft, with its lead in AI over the rest of the two companies, could be in for a strong growth in the mid- to long-term. Amazon ended Friday’s session up 7.87% at $171.81, Microsoft rose 1.84% to $411.22 and Alphabet gained 0.86% to $142.38, according to Benzinga Pro data. Read Next: Meta Breaks The Mold: Time For Tesla, Amazon And Alphabet To Join The ‘Magnificent Seven’ Dividend Party? Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}