{
    "title": "Microsoft, Amazon, Nvidia, Arm, and Others Join Forces To Form AI-RAN \nAlliance",
    "date": "2/26/2024",
    "url": "https://www.investopedia.com/microsoft-amazon-nvidia-arm-and-others-join-forces-to-form-ai-ran-alliance-8600108",
    "text": " Marc Asensio / NurPhoto / Getty Images Amazon (AMZN), Arm (ARM), Microsoft (MSFT), Nvidia (NVDA), and others are joining forces to launch the AI-RAN Alliance, a group focused on revamping cellular technology for artificial intelligence (AI), as big tech companies work together to bolster their positions in the AI boom. The group's founding members notably include Ericsson (ERIC), Samsung, Nokia (NOK), Northeastern University, SoftBank, T-Mobile (TMUS), and DeepSig as well. The alliance's goal is to \"enhance mobile network efficiency, reduce power consumption, and retrofit existing infrastructure, setting the stage for unlocking new economic opportunities for telecommunications companies with AI, facilitated by 5G and 6G,\" according to a release. \"Network operators in the alliance will spearhead the testing and implementation of these advanced technologies developed through the collective research efforts of the member companies and universities,\" the AI-RAN Alliance said. The AI-RAN Alliance's launch comes as several tech heavyweights look to partnerships to strengthen their ability to capitalize on surging demand for AI products and services. Palo Alto Networks (PANW) announced a partnership Monday too, with several companies including Nvidia teaming up to provide private 5G security services and solutions. Meta (META) and IBM (IBM) launched the AI Alliance in December 2023, an international community focused on \"open, safe, responsible AI\" with members including Advanced Micro Devices (AMD), Dell (DELL), and Intel (INTC). The AI-RAN Alliance also comes after a record-breaking week for Nvidia in which the chipmaker recorded the largest-ever single-day jump in market capitalization Thursday, and briefly surpassed a $2 trillion market cap on Friday, driven by AI optimism. AI-RAN Alliance. \"Industry Leaders in AI and Wireless Form AI-RAN Alliance.\" PR Newswire. “Palo Alto Networks Launches Private 5G Security Solutions with Partner Ecosystem.” "
}