{
    "title": "EU Competition Authority To Examine Microsoft's Investment In Mistral AI \nStartup",
    "date": "2/27/2024",
    "url": "https://technewsspace.com/eu-competition-authority-to-examine-microsofts-investment-in-mistral-ai-startup/",
    "text": "Microsoft’s approximately $16.3 million investment in startup Mistral AI has attracted the attention of the European Union (EU) antitrust watchdog. As part of this strategic partnership, the latest AI models of the French developer will be available to customers of the Microsoft Azure cloud platform.  Image source: Mistral AI A distinctive feature of Mistral AI’s AI models is that they are publicly available, unlike similar OpenAI algorithmic models used to create smart chatbots and other AI services. According to the terms of the deal, Microsoft’s investment will be converted into an equity stake in the startup during the next round of financing. Microsoft’s long-term partnership with California startup OpenAI, valued at approximately $13 billion, is also under scrutiny from UK and EU regulators. A European Commission spokesman said Tuesday that the agency will review Microsoft’s investment in Mistral AI after receiving a copy of the agreement. This process could result in an official investigation that could hinder Microsoft’s plans. The analysis shows that the close attention of regulators to the activities of technology giants in the field of AI is becoming increasingly relevant. Investments in Mistral AI and partnership with OpenAI open new horizons for Microsoft in the field of cloud technologies and AI, but also expose the corporation to additional control from antitrust authorities. Robbie Elmers is a staff writer for Tech News Space, covering software, applications and services. Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  TECH NEWS SPACE The Tech News Space team monitors news from the world of high technology, science, the gaming industry and delivers them to its readers in a timely manner. "
}