{
    "title": "Billionaire David Tepper Has Invested 38% of His Portfolio in These 5 \nDividend Stocks",
    "date": "2/10/2024",
    "url": "https://finance.yahoo.com/news/billionaire-david-tepper-invested-38-193200477.html",
    "text": "Is David Tepper an income investor? Nope. The hedge fund manager (and Carolina Panthers owner) probably doesn't factor dividends into his thinking much, if at all, when picking stocks. However, that doesn't mean Tepper doesn't own plenty of dividend stocks. There are more of them in the billionaire's Appaloosa Management hedge fund than you might think. He's invested 38% of his portfolio in these five dividend stocks. Meta Platforms (NASDAQ: META) ranks as the top holding in Tepper's Appaloosa hedge fund. As of Sept. 30, 2023, it owned 1.95 million shares -- more than 11.5% of the overall portfolio at the time. Until recently, Meta wouldn't have made a list featuring Tepper's dividend stocks. However, the social media leader announced on Feb. 1, 2024 that it's initiating a quarterly dividend of $0.50 per share. This translates to a dividend yield of around 0.44%. It's not great, but it's a start. Microsoft (NASDAQ: MSFT) trails Meta as Tepper's second-largest position. Appaloosa owned 1.64 million shares of the technology giant at the end of the third quarter of 2023, enough to make up nearly 10.2% of the hedge fund's portfolio. Many big tech companies don't pay dividends. Microsoft, though, initiated a dividend program way back in 2003. Its dividend currently yields 0.74%. The company has increased its dividend payout by an impressive 168% over the last 10 years. Nvidia (NASDAQ: NVDA) isn't the third-largest position for Tepper. That honor belongs to Amazon. However, the graphics processing unit (GPU) maker is the billionaire's No. 4 holding, comprising 8.8% of his total portfolio. Appaloosa owned 1.02 million shares of Nvidia at the end of Q3. Unlike Amazon, Nvidia pays a dividend. Granted, it's not a huge one: The chipmaker's dividend yield is only 0.02%. Still, the company has increased its payout by 88% since initiating a dividend program in 2015. With a dividend payout ratio of barely over 2%, the company could easily boost its dividend a lot more if it chooses. Intel (NASDAQ: INTC) is Appaloosa's ninth-largest holding, lagging behind several stocks that don't pay dividends. At the end of the third quarter of 2023, the hedge fund owned 6.25 million shares of Intel, representing nearly 4.4% of its portfolio. Ordinarily, Intel's dividend yield of close to 1.2% wouldn't be anything to get excited about. Compared to most of Tepper's top holdings, though, this yield looks fantastic. However, there's a yellow flag to note: Intel slashed its dividend payout by more than 65% last year as part of a larger cost-cutting effort. Not every dividend stock that Tepper owns is in the tech sector. Federal Express (NYSE: FDX) ranks as his 10th largest position. As of Sept. 30, 2023, Tepper's hedge fund owned 650,000 shares of FedEx, making up 3.4% of its portfolio. FedEx's dividend yield of over 2.1% is quite respectable. So is the company's payout ratio of under 29%. Arguably, the best thing about FedEx's dividend program is its track record of dividend increases. Over the last 10 years, the shipping and logistics giant has boosted its dividend payout by a whopping 740%. I wouldn't recommend buying any of these stocks solely for their dividends. However, several of them should deliver strong growth over the next decade and beyond. If I had to pick just one as the best of the bunch, I'd go with Meta Platforms. I like Microsoft and Nvidia, too, but Meta has been underrated by Wall Street, in my view. The company's recent blowout quarterly results underscore how much potential it has. Should you invest $1,000 in Meta Platforms right now? Before you buy stock in Meta Platforms, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 5, 2024 Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Keith Speights has positions in Amazon, Meta Platforms, and Microsoft. The Motley Fool has positions in and recommends Amazon, FedEx, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Billionaire David Tepper Has Invested 38% of His Portfolio in These 5 Dividend Stocks was originally published by The Motley Fool Related Quotes "
}