{
    "title": null,
    "date": "2/15/2024",
    "url": "https://www.dw.com/en/germany-microsoft-to-invest-33-billion-in-ai-capacities/a-68265103",
    "text": "Microsoft's massive investment aims to double the company's AI and data center infrastructure in Germany. Chancellor Olaf Scholz has said it highlights Berlin's commitment to an \"open economy.\" The tech giant Microsoft said on Thursday that it was planning to invest almost €3.3 billion ($3.5 billion) in expanding its presence in Germany. The investment will go towards doubling the capacity of Microsoft's \"AI and data center infrastructure,\" in the EU country, vice chair Brad Smith said in Berlin at an event with Chancellor Olaf Scholz. In addition to artificial intelligence (AI), the company wants to boost its cloud computing applications, Smith said in Berlin. Germany is \"constantly at the forefront\" of technological progress, Smith said. But it suffers from a lack of AI skills. Microsoft's investment would \"help build out infrastructure to help the German economy continue its use of AI and build out the skill base to fill the jobs required,\" according to the company's vice chair. The investment will include a program for training up to 1.2 million people in new AI capabilities. Microsoft's focus on Germany will bring it closer to its major companies located there such as pharmaceutical company Bayer AG and energy giant RWE. To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video The investment would be the largest that the company has ever made in Germany in its 40-year history. The majority would be focused on the country's most populous state, North Rhine-Westphalia, news agency DPA reported. State Premier Hendrik Wüst described the investment as \"a strong signal for Germany and a great contribution to structural change in the Rhine region.\" Chancellor Scholz said the investment highlighted the \"fact that Germany remains very determined to be an open economy.\" \"This is a really good commitment to progress, to growth, to modernity and to global openness as the basis for these opportunities,\" according to the German leader. \"Not only are we probably the most successful export economy in the world in terms of the size of our country, but we are also a country that trades with the whole world, that invests everywhere, but also invests in our own country,\" Scholz said. Microsoft's announcement will be a welcome sign from the tech giant as the German government reels from public anger and a languishing economy. The move tops the list of the tech giant's investments, with investments in the UK and Australia last year coming to $3.14 billion and $3.25 billion, below the $3.5 billion earmarked for Germany. ab/dj (dpa, AFP) While you're here: Every Tuesday, DW editors round up what is happening in German politics and society. You can sign up here for the weekly email newsletter Berlin Briefing.  "
}