{
    "title": "Microsoft Will Use Intel to Manufacture Home-Grown Processor",
    "date": "2/22/2024",
    "url": "https://tech.hindustantimes.com/tech/news/microsoft-will-use-intel-to-manufacture-home-grown-processor-71708544952561.html",
    "text": "Copyright © HT Media Limited  All rights reserved. Intel Corp. has landed Microsoft Corp. as a customer for its made-to-order chip business, marking a key win for an ambitious turnaround effort under Chief Executive Officer Pat Gelsinger. Microsoft plans to use Intel's 18A manufacturing technology to make a forthcoming chip that the software maker designed in-house, the two companies said at an event Wednesday. They didn't identify the product, but Microsoft recently announced plans for two homegrown chips: a computer processor and an artificial intelligence accelerator. Intel has been seeking to prove it can compete in the foundry market, where companies produce custom chips for clients. It's a major shift for the semiconductor pioneer, which once had the world's most advanced chipmaking facilities and kept them to itself. These days, Intel is racing to catch up with companies like Taiwan Semiconductor Manufacturing Co., which leads the foundry industry. Microsoft, meanwhile, is looking to secure a steady supply of semiconductors to power its data-center operations — especially as demand for AI grows. Designing its own chips also lets Microsoft fine-tune the products to its specific needs. “We need a reliable supply of the most advanced, high-performance and high-quality semiconductors,” Microsoft CEO Satya Nadella said in a statement. “That's why we are so excited to work with Intel.” Read More: Microsoft Unveils Its First Custom-Designed AI, Cloud Chips The broader industry has struggled to get enough advanced silicon — particularly Nvidia Corp.'s highly prized accelerator chips, which help develop chatbots and other AI services. For Intel, securing a large customer for its foundry business should help reassure investors that Gelsinger's comeback bid remains on track. His plan involves building out the chipmaker's factory operations to handle the increased load — a costly gamble — as well as restoring Intel's once-dominant technological prowess. The company is looking to governments in the US and Europe to help defray the costs, and seeing Microsoft on board may help that effort. Intel has held talks with the Biden administration to secure more than $10 billion in subsidies under the Chips and Science Act, Bloomberg reported last week. Microsoft and cloud-computing rivals Amazon.com Inc. and Alphabet Inc.'s Google are among the largest buyers of advanced chips, which they use to power their data centers. They've increasingly turned toward using their own designs — a trend that's hurt Intel in its most lucrative business. Acting as a foundry for Microsoft and others could help grab back at least a portion of that lost revenue. Most so-called chipmakers don't actually own plants and instead outsource their production, mainly to TSMC and Samsung Electronics Co. Intel is far behind both companies in the foundry market, but it aims to at least overtake Samsung by the end of the decade. Last year, Intel had less than $1 billion of revenue from outsourcing, compared with almost $70 billion at TSMC, which has a market share of nearly 60%. Samsung has about 15% of the business, according to Bloomberg Intelligence. Gelsinger also has promised that he will have the world's best production technology again by 2025 — a timeline that remains on track, the company said. Intel also has a new product that uses the 18A process, showing that the technology is ready for adoption by outside customers. And it announced an even more advanced approach called 14A. The Santa Clara, California-based company is also separating its design and product groups from Intel's manufacturing and process development arms. That's another major shift. Throughout most of Intel's 55-year history, the old arrangement had been touted as a key advantage: Designers worked closely with production teams to make sure that Intel's products got the best transistors in the industry. But the new approach makes it easier to work with designers from outside customers. And it helps ensure that Intel doesn't favor its own production needs over those of clients, according to Stu Pann, who runs the foundry division. Customer orders will be “sacrosanct,” he said in an interview ahead of the event. Pann said Intel will hold separate staff meetings and take all other steps required to keep its production teams at arm's length. And unlike manufacturers concentrated in East Asia, Intel will be able to offer customers a geographically diverse factory network, he said. That helps reduce the risk of supply chain snags. “From our board on down, people understand what we're getting into,” Pann said. “There is no going back. This is a zero tolerance business. The minute we make a visible mistake, we will burn the bridges we've made.” AI-created images and audio are so good most people can't tell them from the real thing. But we can rely on critical thinking instead. Some interesting details in this article. Check it out here. Lockbit ransomware gang in lockup! The US has charged two Russian nationals with deploying Lockbit ransomware against companies and groups around the world. Check it all out here. Tinder targets fraudsters! Tinder is expanding its identity verification program at a time when AI can make it hard to tell who's real and crime is rising on dating apps. The new verification process requires a valid driver's license or passport and a self-recorded video. Know what it is all about here. One more thing! We are now on WhatsApp Channels! Follow us there so you never miss any updates from the world of technology. ‎To follow the HT Tech channel on WhatsApp, click here to join now! Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71708544952561 "
}