{
    "title": "Microsoft becomes the second company to hit $3 trillion market cap",
    "date": "1/24/2024",
    "url": "https://mspoweruser.com/microsoft-becomes-the-second-company-to-hit-3-trillion-market-cap/",
    "text": "Follow us Share this article Latest news 2 min. read Published on January 24, 2024 published on \n\nJanuary 24, 2024 Share this article Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Microsoft (MSFT) reached a historic milestone on Wednesday, becoming the second company in the world to achieve a market capitalization of $3 trillion. The software giant’s shares rose 1.1% to reach $403.28, giving it a valuation of $3 trillion. The company’s stock has been on a tear since last year, gaining 66.45% and outperforming the S&P 500 index, which rose 21.80%. Microsoft has benefited from strong demand for its cloud computing, gaming, and productivity software products, as well as its diversified business model that spans both consumer and enterprise markets. Microsoft’s growth has also been fueled by its strategic acquisitions, such as the $7.5 billion purchase of video game maker ZeniMax Media in March 2023, and the $19.7 billion deal to buy speech recognition company Nuance Communications in April 2023. The company has also invested heavily in research and development, spending $20.3 billion in fiscal year 2023, up 15% from the previous year. Analysts are bullish on Microsoft’s prospects, with an average price target of $425. According to Bloomberg data, 37 analysts have a buy rating on the stock, while four have a hold rating and none have a sell rating. Microsoft’s achievement of the $3 trillion mark comes less than two years after it became the second company to cross the $2 trillion threshold in June 2022, following Apple Inc. (AAPL). Apple, which is currently the most valuable company in the world, has a market cap of $3.02 trillion. More about the topics: microsoft Pradeep Viswav Software and Services Expert Pradeep is a Computer Science and Engineering Graduate. He was also a Microsoft Student Partner. He is currently working in a leading IT company. Pradeep Viswav Software and Services Expert Pradeep is a technical manager at a large tech company and a seasoned technology blogger. He reports on software, hardware, industry trends, and more. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}