{
    "title": "Microsoft says state-sponsored Russian hacking group accessed email \naccounts of senior leaders",
    "date": "1/19/2024",
    "url": "https://www.cnn.com/2024/01/19/tech/microsoft-russian-hacking-executives/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Follow: A Russian hacking group gained access to some email accounts of Microsoft senior leaders, the software giant disclosed in a regulatory filing Friday afternoon. “The Microsoft security team detected a nation-state attack on our corporate systems on January 12, 2024, and immediately activated our response process to investigate, disrupt malicious activity, mitigate the attack, and deny the threat actor further access,” the Microsoft Security Response Center said in a blog post. “Microsoft has identified the threat actor as Midnight Blizzard, the Russian state-sponsored actor also known as Nobelium.” Nobelium, notably, is the same group responsible for the infamous SolarWinds breach back in 2020. Hackers were able to gain access to “a very small percentage of Microsoft corporate email accounts,” the blog post added, including accounts belonging to members of its senior leadership team and employees in its cybersecurity and legal departments. The company said that hackers were able to exfiltrate some emails and attached documents, though the preliminary investigation indicates that the attackers seemed to be seeking information related to Midnight Blizzard itself. That mirrors what the same group did when it used tampered software made by SolarWinds to infiltrate US agencies in 2020 — and then sought to track how the US government was responding to its intrusions. Microsoft said it is in the process of notifying employees whose email was accessed. There is currently no evidence that the hackers had any access to customer environments or AI systems, Microsoft said. The attack began in late November 2023, the company said, and hackers gained an initial foothold using a so-called “password spray attack.” Password spraying refers to the attempt to access a large number of accounts using commonly known passwords. The company said the investigation is ongoing and it will continue working with law enforcement and appropriate regulators, pledging to share more information publicly as it becomes available. The attack highlights “the continued risk posed to all organizations from well-resourced nation-state threat actors like Midnight Blizzard,” the company said. Microsoft systems have been the target of multiple recent high-profile hacking efforts. The Cybersecurity and Infrastructure Security Agency did not immediately respond to CNN’s request for comment on the hack Friday. Microsoft declined a request for additional comment. In an emailed statement to CNN, the FBI said: “The FBI is aware of the incident and we are diligently working with our federal partners to provide assistance. As always, we encourage any victim of a cyber incident to contact their local FBI field office.” This story has been updated with additional developments. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}