{
    "title": "Microsoft unlocks Copilot AI inside Office apps for all businesses",
    "date": "1/15/2024",
    "url": "https://www.theverge.com/2024/1/15/24038726/microsoft-copilot-microsoft-365-business-launch-availability",
    "text": "By  Tom Warren, a senior editor covering Microsoft, PC gaming, console, and tech. He founded WinRumors, a site dedicated to Microsoft news, before joining The Verge in 2012. Microsoft is unlocking the doors for all businesses to get access to its AI-powered Office features. Microsoft’s Copilot for Microsoft 365 launched in November, with enterprise customers having to commit to at least 300 users and pick up the phone to get on the list. That was an additional $9,000 cost minimum for businesses, but now Microsoft’s AI-powered assistant is generally available for all businesses, large and small, with no minimum amount of users. “Given the demand and interest we’ve heard from small and medium-sized businesses, we’re removing that 300 seat minimum,” says Divya Kumar, global head of marketing for search and AI at Microsoft, in a one-on-one with The Verge. “So now businesses of all sizes can get the $30 option and enable Copilot in Microsoft 365.” The 300-seat purchase requirement removal is a big change, but Microsoft is also removing the need for Microsoft 365 plans, opening up Copilot inside Office apps to Office 365 E3 and E5 customers. Microsoft 365 Business Standard or Business Premium subscribers will also be able to purchase Copilot for Microsoft 365 at $30 per user per month. Copilot for Microsoft 365 still demands a steep entry price for now, but it feels like the type of launch we were originally expecting. The November launch was more like a preorder event, as most businesses couldn’t get it right way and only the biggest enterprise users could get Copilot access. Microsoft is promising that Copilot inside Office apps will change the way documents are created and edited. The Copilot, powered by GPT-4 from OpenAI, will sit alongside Microsoft 365 apps much like an assistant, appearing in a sidebar as a chatbot. It will also be available to summon inline, allowing users to generate text in documents, create PowerPoint presentations based on Word documents, or even help use features like PivotTables in Excel. Copilot is also available in Teams, ideal if you want to summarize a meeting you never attended or one that you arrived late to. Email threads in Outlook can also be summarized, and Copilot can create draft email responses with a variety of tones or lengths. Microsoft now has three different versions of Copilot. There’s the regular Copilot that’s available free of charge to both consumers and businesses, which is essentially a chatbot much like ChatGPT. Then, there’s the new Copilot Pro option that’s launching for consumers today for a $20 per month premium, offering AI-powered Copilot features inside Office apps and elsewhere. Microsoft now also offers the same premium subscription with more features to businesses in the form of Copilot for Microsoft 365 at $30 per user per month pricing. You can read more about the new Copilot Pro offering right here. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}