{
    "title": "Microsoft posts 23% net income growth in Q4",
    "date": "1/23/2024",
    "url": "https://www.ig.com/uk/news-and-trade-ideas/microsoft-s-strategic-wins--fy23-q4-marked-by-strong-cloud-and-c-240124",
    "text": "Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money.\n\n Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money. WHY IG? GET TO KNOW US TRADING THE FINANCIAL MARKETS IMPORTANT INFO SHARES AND ETFS KEY MARKETS MORE OPPORTUNITIES EXTENDED HOURS OUR PLATFORM AND FEATURES THIRD-PARTY PLATFORMS START EXPLORING NEWS AND ANALYSIS LEARN TO TRADE View more search results Discover how Microsoft's strategic focus on cloud services and AI technology has propelled a significant 20% increase in net income and an 18% rise in operating income in FY23 Q4. Microsoft Corp is scheduled to report its fiscal Q2 2024 results on Tuesday, 30 January after the market closes. Wall Street's expectations for the upcoming results are as follows: Investors cheered Microsoft's first-quarter results, reported in late October, as it beat Wall Street's estimates and promised future product offerings infused with AI. \"With copilots, we are making the age of AI real for people and businesses everywhere,\" said Satya Nadella, Chairman and Chief Executive Officer of Microsoft. \"We are rapidly infusing AI across every layer of the tech stack and for every role and business process to drive productivity gains for our customers.\" Within the details, Microsoft reported the following highlights.  During Q1, Microsoft experienced a notable acceleration in its Azure cloud revenue growth, marking a significant shift after two years of slowing momentum. This uptick has captured the attention of analysts who anticipate a continuation of this trend in the upcoming Q2 Earnings Report. Additionally, there's a growing interest in the performance of the Microsoft 365 CoPilot AI add-on, which was launched last year and is available on a subscription basis. Despite its innovative approach, the add-on has so far received mixed reviews. Microsoft's recent completion of the $68.7 billion acquisition of video game publisher Activision Blizzard is set to influence Q2 earnings. This acquisition, finalised in mid-October, is expected to be a topic of discussion by Microsoft executives, particularly in regards to its impact on the financial guidance for Q3. Another point of interest is the management's perspective on the recent developments at OpenAI, along with their viewpoints on the current structure of the OpenAI board, which has been the subject of much discussion. Building on an almost 57% gain in 2023, Microsoft's share price has surged over 6% in the opening weeks of 2024, as investors began the new year with renewed enthusiasm for tech stocks that offer exposure to AI. The chart of Microsoft's share price is a textbook example of a market in an uptrend, putting in place a sequence of higher highs and higher lows punctuated by corrective and orderly pullbacks. The RSI is now pushing into overbought territory, which offers hope that a pullback may not be too far away, providing an opportunity to buy Microsoft shares at better levels. Near-term horizontal support comes in at $380/378 and below that at around $360, coming from July highs/ December lows. Medium-term support is strong in the $350/335 area, coming from the uptrend drawn from January 2023's $219.35 low and the 200-day moving average at $337.00. To note, a sustained break below $335 would negate the uptrend and warn that a deeper pullback is underway.   This information has been prepared by IG, a trading name of IG Markets Limited. In addition to the disclaimer below, the material on this page does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. No representation or warranty is given as to the accuracy or completeness of this information. Consequently any person acting on it does so entirely at their own risk. Any research provided does not have regard to the specific investment objectives, financial situation and needs of any specific person who may receive it. It has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such is considered to be a marketing communication. Although we are not specifically constrained from dealing ahead of our recommendations we do not seek to take advantage of them before they are provided to our clients. See full non-independent research disclaimer and quarterly summary.  Learn how shares work – and discover the wide range of markets you can spread bet on – with IG Academy's free ’introducing the financial markets’ course. Try out what you’ve learned in this shares strategy article risk-free in your demo account. Put the lessons in this article to use in a live account – upgrading is quick and easy. Put your new knowledge into practice. Log in to your account now. Prices above are subject to our website terms and agreements. Prices are indicative only. All share prices are delayed by at least 15 minutes. Prices above are subject to our website terms and agreements. Prices are indicative only. All shares prices are delayed by at least 15 mins.  Get the week’s market-moving news sent directly to your inbox every Sunday. The Week Ahead gives you a full calendar of upcoming economic events, as well as commentary from our expert analysts on the key markets to watch.  For more info on how we might use your data, see our privacy notice and access policy and privacy webpage. Find out what charges your trades could incur with our transparent fee structure. Discover why so many clients choose us, and what makes us a world-leading provider of spread betting and CFDs. Stay on top of upcoming market-moving events with our customisable economic calendar. Forex Indices Shares Options Other markets Spread betting CFD trading Share dealing Web platform Mobile trading MetaTrader 4 ProRealTime Compare features The Week Ahead News and trade ideas Strategy and planning Contact us  IG | Sitemap | Terms and agreements | Privacy | IG Community | Cookies | Investors | Modern slavery act | Vulnerability Follow us online: Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money. Professional clients can lose more than they deposit. All trading involves risk.\n\nThe value of shares, ETFs and ETCs bought through a share dealing account, a stocks and shares ISA or a SIPP can fall as well as rise, which could mean getting back less than you originally put in. Past performance is no guarantee of future results.\n\nCFD accounts provided by IG Markets Ltd, spread betting provided by IG Index Ltd and share dealing and stocks and shares ISA accounts provided by IG Trading and Investments Ltd. IG is a trading name of IG Markets Ltd (a company registered in England and Wales under number 04008957), IG Index Ltd (a company registered in England and Wales under number 01190902) and IG Trading and Investments Ltd (a company registered in England and Wales under number 11628764). Registered address at Cannon Bridge House, 25 Dowgate Hill, London EC4R 2YA. IG Markets Ltd (Register number 195355), IG Index Ltd (Register number 114059) and IG Trading and Investments Ltd (Register number 944492) are authorised and regulated by the Financial Conduct Authority.\n\nThe information on this site is not directed at residents of the United States, Belgium or any particular country outside the UK and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation. Careers | Marketing partnership "
}