{
    "title": null,
    "date": "1/2/2024",
    "url": "https://seekingalpha.com/article/4660676-microsoft-stock-worth-holding-onto-long-term-investors",
    "text": "David Becker  David Becker Microsoft Corporation’s (NASDAQ:MSFT) presence in enterprise software and cloud services has strengthened, and the company may be able to recoup its increased spending on generative AI technology by attracting new customers and adjusting pricing for its offerings. MSFT’s 2024 sales-growth estimates are trending upward, which I expect to continue into 2025 driven partly by a rebound in cloud growth and monetization of various AI copilots. Although the stock is currently trading at the higher end of its three-year range, I remain optimistic on the company's growth prospects and assign a buy rating to the stock. Microsoft reported significant improvements during Q1 2024, with revenue beating across the three major segments, highlighted by Azure reaccelerating to 28% in cc, and beating the high end of the guide. Microsoft Azure's fiscal 1Q24 expansion was about 200 bps ahead of consensus, with AI workloads contributing about 300 bps to the growth rate. This metric is encouraging for Microsoft's cloud growth over the next 12 months, even as the guidance of 26-27% indicates a slight deceleration from 1Q24, which I attribute to conservatism amid rising geopolitical tensions globally. The company provided guidance for 2Q24, with top-line guidance coming in mostly in-line with consensus expectations for PBP and IC, and notably higher for MPC, mostly driven by Activision. Also, profitability came in better than expected for both gross margins and operating margins, with the company taking a prudent approach to spending in the coming fiscal year and still a relatively easy y/y comp in Q2. Microsoft is not only incorporating generative AI into its Azure cloud services but also across its various software applications. The company has introduced AI assistants called Copilot to enhance productivity for its users. Despite the rising costs associated with increased AI usage, Microsoft expects to maintain a flat operating margin for the year and believes that the investments in AI will lead to higher revenues in the future. Gartner Gartner Microsoft's M365, which encompasses most of its productivity software from Office (Excel, Word, etc.) to Outlook, is emerging as a far more stable and dependable source of growth, while other key areas like cloud and PC sales have slowed in the past 12 months. Microsoft's Office suite plays a crucial role in the company's financial stability, especially when other business segments are affected by geopolitical and economic challenges. The introduction of enhanced security features in Microsoft's premium E5 suite, priced at $57 per month per user, is expected to motivate enterprises to upgrade from the E3 suite, priced at $36 per month. I anticipate that sales growth for Office products and cloud services will continue at a low-double-digit rate over the next two years, regardless of the economic conditions. Currently, less than 15% of the total Office user base is using the premium E5 suite, indicating a potential for steady growth over several years. The segment represents about 23% of Microsoft's total sales, and I expect it to experience modest double-digit sales growth in the next year. This growth will be supported by various factors, including recent price increases, including for the company's Copilot generative AI, which can assist with cloud usage and appeals to customers looking to control expenses. Microsoft's collaboration tool, Teams, has expanded its reach by making its software accessible to front-line workers such as retail employees and factory staff who traditionally didn't use Microsoft Office. The company has introduced the Microsoft 365 F3 suite, tailored for front-line workers, priced at $8 per user per month. Microsoft’s bundling of various offerings has been a key driver of this growth. Usage of teams among corporations have continued to increase, with 91% of the Fortune 100 companies using Microsoft Teams for collaborations. Moreover, corporations have started to build custom applications using Teams as a communications tool, which I anticipate will make Teams a stickier product, as it will then make it a product with high switching costs. The consensus estimates for Microsoft Azure's sales for FY 2024 have risen following strong first-quarter results, driven by increased AI workloads and some stabilization in clients managing the overall cloud spending. In the first quarter, Microsoft's operating margins expanded by approximately 470 basis points, driven by improved gross margins and effective cost management. This indicates that the company can handle the higher processing costs associated with AI workloads as the year progresses. I expect the pace of hiring to remain modest, despite the potential for higher organic sales growth. Additionally, the acquisition of Activision may temporarily impact operating margins. However, I anticipate that this impact will be offset by rigorous cost control measures. Microsoft's stock is up 57% YTD. The forward 12-month P/E ratio now stands at 33.2x, compared to around 24x at the same time last year. The multiple is also at a premium to its tech comps that include AMZN, ADBE, INTU, and META. MSFT’s premium multiple is justified in my view given the company’s relatively stickier & more recurring enterprise software revenue streams as well as long-term upside revenue potential being unlocked by AI capabilities; and materially less exposure to advertising, eCommerce, compared to the peer group. While MSFT’s current multiple is slightly above the three-year median of 29.3x, it falls within the range of 20-35.x over the past three year. I expect margins and earnings growth to improve in 2025, especially once the financials of the Activision acquisition complete a full year. Moreover, MSFT continues to benefit significantly from increased enterprise spending on generative AI, which could potentially drive sales growth even higher than what the market currently expects. Hence, I remain positive on the company and assign a buy rating to the stock. Capital IQ Capital IQ There are several downside risks to investing in Microsoft at the moment. Microsoft's AI practices and copyright policies might face substantial regulatory and media scrutiny due to the company's significant investment in OpenAI and recent European Union regulations. Stricter regulations around AI might be a hindrance to the company's progress in AI, which may fizzle the hype around the stock. Moreover, increased competition, particularly from major tech giants like Google, Facebook, and Amazon, and the possibility of margin compression due to investments in Azure and OpenAI are also additional risks that the stock faces. I remain optimistic on Microsoft, due to the ongoing growth opportunities in substantial IT spending categories, the potential to capitalize further on its strong presence in various markets, and a robust financial profile characterized by consistent margin expansion. Microsoft's stock is currently trading at the higher end of its range, I believe the premium is justified due to the company's early leadership in AI and its dominant position in a competitive market, which is especially advantageous in the current economic climate. Hence, I remain optimistic on the company and assign a buy rating to the stock. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}