{
    "title": "Microsoft and Apple battle to be world's most valuable company",
    "date": "1/12/2024",
    "url": "https://www.investorschronicle.co.uk/news/2024/01/11/microsoft-surpassed-apple-as-the-world-s-most-valuable-company/",
    "text": "The hype around artificial intelligence (AI) has helped Microsoft (US:MSFT) exceed Apple (US:AAPL) as the most valuable company in the world, before a pullback sent the US phone maker back to the top. Yesterday, Microsoft’s market capitalisation hit $2.87tn (£2.25tn), which pushed it temporarily past Apple. Since last summer this crossover has looked likely as Microsoft has cemented itself as the market leader in AI. Its investment in ChatGPT creator OpenAI has enabled it to roll out an AI enabled software product 365 Co-Pilot, while Apple has seen its hardware sales fall at the same time. AI is already accelerating Microsoft's cloud computing business. In the three months to September, Microsoft Azure sales grew 29 per cent of which 3 percentage points were directly from its AI services. This contributed to group net income rising 27 per cent across the group. Wedbush Securities analyst Dan Ives believes that Microsoft’s Co-Pilot could add another $25bn to revenue by 2025.  This earnings growth expansion has helped Microsoft's share price rise 62 per cent over the last 12 months. However, Microsoft’s market cap hasn’t just been driven by earnings growth. In the past 12 months its forward price to earnings ratio has expanded from 23 to 31, showing that investors have bought into the potential AI growth story. “We believe the stock still has yet to price in what we view as the next wave of cloud and AI growth coming to the Microsoft story with FY24 with a strong competitive cloud edge vs. Amazon and Google,” said Ives. This hype is grounded in some reality. A recent survey conducted by Morgan Stanley found that 63 per cent of chief information officers expect to use at least one of Microsoft’s generative AI products over the next year. Meanwhile 37 per cent plan to use Azure OpenAI services, up from 27 per cent in the second quarter of last year.  Contrastingly, Apple has been struggling to convince the market it will able to keep growing iPhone sales at the same pace. In the 12 months to September, iPhone sales dropped 2 per cent to $201bn as consumers cut back on spending. There is a concern that with a saturated smartphone market iPhone sales might slow in the same way as Mac sales, which saw revenue drop 27 per cent to $29bn in same period. The positive for Apple is its high margin service business has continued to grow. Last year, service revenue rose 9 per cent which meant that although total revenue fell 3 per cent, earnings per share were flat.  Although Apple appears to have been left behind in the AI race, the company is working on the technology behind the scenes. Additionally, if generative AI becomes widespread then the AI processing will need to be done on smartphones and computers rather than just in cloud servers. The new iPhone 15 Plus released at the end of last year is powered by the 3-nanometer A17 chip, designed by Apple and manufactured by TSMC (TW:2330), and is the most advanced ever put in a smartphone, and can already handle some AI capabilities. Some more precise details on Apple's AI products have already leaked. Bloomberg has reported that Apple has built its own large language model called Ajax. It is dubbed “Apple GPT” and is being used internally to test its functionality. Meanwhile, Morgan Stanley believes there could be an “AI iPhone” launched as soon as the autumn of 2024. It is hard to bet against a company with a return on invested capital above 50 per cent over the last three years. These remarkable figures suggest Apple is good at picking where to invest its money. However, given that it is trading at 27 times its forward earnings and revenue growth has slowed to a standstill, it will need to pull something out the hat soon. Or risk falling further behind Microsoft.  "
}