{
    "title": "Microsoft: Retail AI Operations Indicate Continued Growth Amid Valuation \nRisk",
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/news/microsoft-retail-ai-operations-indicate-190017625.html",
    "text": "Microsoft Corp. (NASDAQ:MSFT) recently briefly surpassed Apple Inc. (NASDAQ:AAPL) as the highest-valued company in the world; it has very sound management focused on shareholder returns, which is elicited in the financial statements. Its largest contributor to growth will likely be artificial intelligence, which places it in direct competition with Alphabet's (NASDAQ:GOOG) (NASDAQ:GOOGL) Google as a peer with the most advanced capabilities in the industry. Particularly, both companies are focusing on artificial intelligence integrations for retailers, creating tension over market share. Warning! GuruFocus has detected 5 Warning Sign with MSFT. While Microsoft has valuation risks, it remains a strong growth stock considering its operational strengths. However, its above-index returns are largely dependent on AI success, with considerable regulatory risks that could inhibit stock growth and create volatility. Nonetheless, the company remains one of the safer ways to gain exposure to AI. Microsoft has introduced generative AI and data solutions for retailers, with a focus on personalized shopping experiences. A copilot template for Azure OpenAI Service assists with engaging customer interactions. As an example, Canadian Tire Corp. (CDNAF) is launching an AI shopping assistant to aid customers in purchasing automotive products. The company is also integrating generative AI into tools used by store associates and managers with the intention of enhancing productivity and customer service. Voice-enabled task creation and real-time access to insights and information should further improve retail efficiencies. Microsoft Fabric is a unified analytics platform for unlocking retail data, improving the planning and design of data solutions and driving forward AI-driven retail analytics. The company is also integrating models of GPT-4 Turbo on Azure OpenAI Service, increasing the broad range of applications due to the partnership with OpenAI. To counter Microsoft's retail AI progress, Google Cloud has launched new GenAI products, which are aimed at personalizing online shopping experiences and making back-office operations more efficient. Conversational Commerce Solution and Catalog and Content Enrichment use advanced AI models to enhance engagement and automate content creation. Additionally, Google introduced an AI Hypercomputer, which integrates software, hardware and machine learning. It improves productivity and efficiency and includes support for various machine learning tools such as PyTorch and TensorFlow. Its recent launch of Gemini, a new AI model that is statistically the most advanced in the world right now, accompanied its AI Hypercomputer developments. Both Microsoft and Google seem to be competing directly, but taking nuanced approaches to their respective projects. As such, the competitive risk to Microsoft is both arguably enhanced and reduced by Google's abilities, as larger traction in the AI market will drive awareness of Microsoft's tools as well. As I mentioned, statistically based on 30 out of 32 academic benchmarks, Gemini is above OpenAI's ChatGPT at current in terms of technical proficiencies. Microsoft is arguably strongest in the area of profitability, with industry-leading margins that should increase further as operational efficiencies get stronger due to AI. This is largely expected due to reduced headcount in specific sections of the business as automation takes over human labor. The company's net margin is 35.32% at the moment, which is better than 97.28% of companies in the software industry, according to GuruFocu' data. The gross margin is also an impressive 69.44%. Google has a net margin of 22.46%, significantly lower than Microsoft's, and Google's gross margin is only 55.88%. This positions Microsoft in a very strong position to invest further in advanced AI. For its first quarter of fiscal year 2024, Microsoft reported $56.5 billion in revenue, which is a 13% year-over-year increase. Its operating income was $26.9 billion, a 25% increase. Its net income was $22.3 billion, with diluted earnings per share of $2.99. Revenue for the company's Intelligent Cloud segment increased 19% year over year, with server products and cloud services revenue increasing 21% due to Azure; other cloud services growth was 29%. The company's Intelligent Cloud segment, largely responsible for its AI initiatives, is the greatest component of the organization's revenues: Microsoft's balance sheet is also quite strong, with 50.49% of its total assets balanced by total liabilities and 49.51% balanced by total equity for the last trailing 12 months. Total equity has risen from 31.96% in 2018, showing considerable financial prudence on the part of the management team. The company has also issued more debt in the last 12 months, with $22.515 billion in net issuance. However, its total cash flow from financing over the period is -$18.291 billion, largely due to dividend payments and stock repurchases, showing continued investment in shareholder returns. The largest weakness with an investment in Microsoft is its valuation, which is no surprise as it briefly became the world's most valuable company with a market cap of around $2.89 trillion, surpassing Apple's market cap of around $2.87 trillion. Microsoft has a forward price-earnings ratio of around 35, compared to Apple's ratio of 28 and Google's ratio of 21. Assuming Microsoft maintains its strong annual earnings per share without NRI growth rates, which have increased from 17.50% as a 12-year average to 22% as a five-year average and 19.40% as a three-year average, the stock could be considered moderately overvalued at present based on my discounted cash flow calculation. By taking a moderate estimate of a 19% annual earnings per share without NRI growth rate for the next 10 years, which I think is conservative but would price in inhibitions such as regulatory constraints on progress in AI, the fair value of the stock is around $336, approximately a 15.5% downside on the current stock price of around $388. The discounted cash flow analysis assumes a 4% growth rate for a 10-year terminal stage following the 19% growth period and a 10% discount rate. By a different method, the GF Value chart shows the stock to be fairly valued, and so investors must realize they are not allocating capital to undervalued shares, but instead to a high-growth enterprise that particularly shines on profitability and has operational strengths already priced in. The company might see significant inhibition to its earnings and revenue growth if regulatory hurdles slow down retail AI operations. In addition, there are severe security risks associated with the transfer and collection of data crucial to advanced AI practices in retail and other workplaces. As a company focused intently on artificial intelligence for its continued growth, I think investors should expect periods of slower growth as markets accustom themselves to new technologies related to AI. Microsoft will potentially be at the forefront of case studies related to policy and regulation in jurisdictions around the world. In addition, even if the stock is fairly valued, this means there is no margin of safety if the AI industry performs less promising than expected. The hopes and estimates for the industry are well-founded, and Grand View Research estimates an annual growth rate of 37.3% for the sector from 2023 to 2030. By 2030, the AI market is projected to be worth over $1.3 trillion, but some volatility on the way to this high estimate is likely and should be expected, in my opinion. I think Microsoft is one of the most stable ways to gain exposure to AI, particularly as it is also diversified beyond these operations. The company's venture into retail AI and its partnership with OpenAI make a strong foundation to compete with Google to become the dominant player in the field. Its financials are sound with exceptional margins and the main real risk to consider is a potentially overvalued stock. My rating for the stock is buy. This article first appeared on GuruFocus. Related Quotes "
}