{
    "title": "EU examines Microsoft investment in OpenAI",
    "date": "1/10/2024",
    "url": "https://www.malaymail.com/news/money/2024/01/09/eu-examines-microsoft-investment-in-openai/111536",
    "text": "About Us Advertise BRUSSELS, Jan 10 — The EU, racing to regulate the fast-moving world of artificial intelligence, said yesterday it has started a preliminary study of Microsoft’s multi-billion-dollar investment in ChatGPT developer OpenAI to see if it could be a disguised merger. The early-level examination is “checking whether Microsoft’s investment in OpenAI might be reviewable under the EU Merger Regulation,” the European Commission said. The move is part of efforts by Brussels to make sure its regulatory oversight can catch up with AI developments and stop major players shutting out competitors in a field promising upheaval in multiple sectors. EU competition chief Margrethe Vestager, who will meet top tech bosses in California this week, said “it is fundamental that these new markets stay competitive”. “We are inviting businesses and experts to tell us about any competition issues that they may perceive in these industries, whilst also closely monitoring AI partnerships to ensure they do not unduly distort market dynamics,” she said. Alongside meetings with Apple boss Tim Cook and Google chief Sundar Pichai, Vestager is also set to hold talks with OpenAI’s head of technology and strategy chief. The launch of the ChatGPT chatbot in November 2023 — at the time the fastest-adopted app the world has seen — marked the popular arrival of the AI revolution. Microsoft last year invested around US$13 billion (RM60 billion) in OpenAI and got a seat on the board as a non-voting observer after an abortive boardroom coup against CEO Sam Altman, whom it supported and even briefly hired. Britain’s competition watchdog last month also said it was looking into whether the partnership between Microsoft and OpenAI resembles a merger. Massive investment for AI Generative AI can produce text, images and audio that are often indiscernible from those made by humans, having been trained on massive amounts of data giving it many examples that allow it replicate the same patterns when prompted to do so. Its use is expected to infuse and augment — or even upend — many sectors, including legal services, business consulting, artistic and journalistic production, design, customer relations, transport and education. While individuals dabble with generative AI’s abilities to write essays and churn out digital art, companies are already turning to it in an effort to boost production and competitivity. The United States is seen to be leading the curve with China on its heels. Europe has ambitions of nurturing its own AI champions, such as Germany’s Aleph Alpha and France’s Mistral AI. But the massive financial investments needed to develop AI at scale requires have regulators that worried deep-pocketed corporations like Microsoft, Google owner Alphabet, Facebook parent Meta and China’s Baidu could scoop up start-ups. Venture capital investment in the AI sector in the European Union was estimated to have topped €7.2 billion (RM36 billion) last year — but much more is needed to grow computer power and cloud capacity. The EU in December reached agreement on a legislative text that, once adopted, aims to rein in the potential for AI misuse — such as for biometric surveillance and behavioural manipulation — while fostering innovation. Brussels views the bill as a possible legal template for regulation in other areas of the world. The United States already has a presidential executive order on AI safety standards, while China has implemented a law specifically regulating generative AI. The EU legislation would add to a regulatory arsenal that already includes a Digital Markets Act cracking down on anticompetitive practices by online giants. — AFP   "
}