{
    "title": "Microsoft Will Be One Of The Biggest Beneficiaries Of Artificial \nIntelligence (NASDAQ:MSFT)",
    "date": "2/24/2024",
    "url": "https://seekingalpha.com/article/4673167-microsoft-will-be-one-of-the-biggest-beneficiaries-of-artificial-intelligence",
    "text": "LIONEL BONAVENTURE/AFP via Getty Images LIONEL BONAVENTURE/AFP via Getty Images I think Microsoft (NASDAQ:MSFT) is in a very attractive position to capitalize on the AI opportunities that lie ahead. Because Satya Nadella's foresight has ensured that Microsoft has a lot of synergy between its existing products and what AI can do. The co-pilots available for Microsoft 365 and GitHub will help people be more productive by enabling them to work faster and more efficiently. Additionally, they help automate the tedious, repetitive tasks so customers can focus on the creative tasks. As a result, Azure has gained market share in the second quarter thanks to this AI advantage with Azure AI and its LLM and SLM access. And just how important the Copilot is to Microsoft can be seen by the fact that the Windows keyboard now has a Copilot button, the first major keyboard change in 30 years. And to put that in perspective, GitHub's Copilot was a major contributor to GitHub's 40% year-over-year revenue growth. And with OpenAI, Dall-E, and especially Sora's impressive showcases of the last few days, Microsoft has a lot going for it. I also believe that generative AI will disrupt the search market and could threaten Google's dominance. And the fact that OpenAI with its Transformers technology could be responsible for this is remarkable, since it originally came from the Google Research Labs. Microsoft has a fortress-like balance sheet. $80 billion in cash and only $44 billion in long-term debt. So the cash position is almost twice the long-term debt, and they also generated $82 billion in net income over the last 12 months. In this way, it provides liquidity and protects the downside of the balance sheet. Additionally, the Azure growth story continues. The Server Products and Cloud Services segment, which includes Azure, SQS Server, Windows Server and GitHub, had the following revenue growth rates since the second quarter of 2023: However, if you look at Azure alone, Azure is actually growing faster than the segment and is being dragged down by the server products, which in some cases had negative growth rates. And datacenter and server revenue will most likely benefit from the current AI trend and probably see better growth numbers over the course of 2024 and 2025. So Microsoft is well positioned to take advantage of the growth opportunities. Then there are also the Dynamics products, which include intelligent, cloud-based applications. This segment also grew 22% and 21% in the first two quarters of the current fiscal year. So Microsoft has several fast-growing segments. Data by YCharts Microsoft has a very favorable ROIC-WACC spread as their WACC is around 9%. Therefore, the spread is 31% - 9% = 22%. Many companies would be happy if their ROIC was 22%, which is already a very good value, but Microsoft simply achieves this value as a spread. This is a testament to the fact that Microsoft is one of the highest quality companies in the world. Without significant competitive advantages, this would not be possible. Data by YCharts For comparison, let's look at the ROICs of Google / Alphabet (GOOG), Meta / Facebook (META), Tesla Inc (TSLA), TSMC (TSM), and Broadcom (AVGO), all of which are incredibly strong and leading companies in their respective fields, but have a ROIC that is roughly the same as Microsoft's ROIC-WACC spread. Microsoft Investor Relations Microsoft Investor Relations Plus Microsoft is a truly shareholder-friendly company. The cash returned to shareholders through buybacks and dividends increases almost every year. Microsoft's dividend CAGR over the past 20 years has been about 13%, and the annual dividend growth rate has typically been about 10% since 2017. From 2004 to 2024, the average annual return on MSFT stock is approximately 14.67% and increases to 16.96% with drip, so you can see that the increasing dividends, when reinvested, have increased the total return by approximately 2% per year. This is another sign that Microsoft's dividend policy is working for shareholders. DRIP Returns Calculator Dividend Channel DRIP Returns Calculator Dividend Channel It also shows that Microsoft has outperformed the S&P 500 by nearly four times over a 20-year period, assuming an investment of $10,000. Author Author I think it is always important to know what the market is pricing in, and a reverse DCF is probably the best way to find out. And right now, based on the TTM diluted EPS of $11.06, the market is pricing in EPS CAGR of about 12% to 13% over the next 10 years. Historically, the EPS growth rate has been as follows: 10Y: 15.14%, 5Y: 20.74% and 3Y: 18.14%. All of these numbers are higher than what the market is pricing in. So if Microsoft can continue this trend and deliver a CAGR in line with its track record, the stock looks undervalued. There are plenty of growth opportunities in generative AI and cloud, and share buybacks should also help EPS. So let's look at the guidance for EPS to get a better picture. Seeking Alpha Earnings Estimates Seeking Alpha Earnings Estimates Microsoft's earnings estimates for Jun 2028 are $20.52 in EPS, which at a 30x multiple gives a share price of about $615. Which represents an upside of ~50% over the period. However, looking at EPS beats and misses, since June 2015, Microsoft has only missed yearly estimates once and beaten them eight times. Therefore, it is not unlikely that Microsoft will beat EPS estimates in the future as estimates tend to be conservative. Now, if we assume that Microsoft will continue to beat earnings for the next several years, and that it will do so in 4 out of 5 years, EPS of $23-$24 is realistic, which would put the stock between $690 and $720. Data by YCharts I used a multiple of 30x as this is roughly the 10Y median and mean P/E ratio. However, I would not be surprised if the multiple is closer to 35x in 5 years due to generative AI and all the new opportunities. But to be more conservative, I used a 30x multiple. That way, I have a margin of safety. I really think that AI is going to change our lives a lot, probably more than smartphones did. But the big question will be which companies will benefit the most. And right now it looks like Microsoft will be one of the big beneficiaries because they have OpenAI and Sam Altman. Plus they also have a kind of first mover advantage. However, I think this advantage is often overestimated, as we have seen with Google and Yahoo. In the end, the best product usually wins. And just as generative AI threatens to disrupt traditional search engines. A new technology could pose a threat to generative AI in the future, as our world becomes more fast-paced. Additionally, the first results of Microsoft's Copilot are mixed and leave room for improvement. But we have to keep in mind that this is only one of the first versions and that much will be improved. On the other hand, many companies have succeeded in streamlining and optimizing their work processes with the help of Microsoft and its AI offerings. In the near future, Microsoft Copilot will allow you to create your own GPTs with a simple set of prompts to further personalize the AI experience. And multimodal search, which combines GPT 4 with vision, is likely to change the search experience enough to allow Microsoft to take more market share from Google. Similarly, the Deep Search feature is designed to improve search results. It is designed to help answer complex and very specific questions that today's generation of search engines can only partially answer. This, combined with Azure AI and the AI capabilities of the various Office products, should ensure that Microsoft has tremendous opportunities for future growth. The impact on workflow is enormous when you can create a Word or PowerPoint document from a data set with a single click. And ideally, the data is analyzed immediately and key conclusions are presented. If Microsoft comes up with a satisfactory solution, it will shake up a lot of areas and probably will have a very positive impact on Microsoft's future profits. Therefore, I firmly believe that Microsoft will be a stronger company in five years than it is today. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of META, TSM either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}