{
    "title": "Revolutionizing SAP and ADP connectivity with Microsoft Azure VWAN and VPN \n- Inside Track Blog",
    "date": "2/22/2024",
    "url": "https://www.microsoft.com/insidetrack/blog/revolutionizing-sap-and-adp-connectivity-with-microsoft-azure-vwan-and-vpn/",
    "text": "How Microsoft does IT Feb 22, 2024\t\t\t\t\t  |  Christian Dobler, Chakri Thammineni and Eric Scheffler Connecting line-of-business solutions into the Microsoft Azure networking environment is a critical part of enabling an efficient hybrid network environment and an important step in transforming enterprise networking using Azure. We’ve recently helped SAP, one of our key business partners, replace an outdated VPN connectivity solution with a highly secure, cost-efficient connection into Azure for integration with ADP payroll using Azure VWAN and Azure VPN. As cloud networking has matured, so have the requirements for security and traffic control. SAP’s pre-existing solution for connecting their VPN clients lacked support for critical IKEv2 security and traffic control mechanisms such as AES256 and SHA256 encryption and border gateway protocol (BGP). To support these new requirements, the existing hardware used in SAP’s VPN solution needed to be replaced to be compliant with IKEv2 standards. Our cloud networking engineers at Microsoft Digital (MSD), the company’s IT organization, proposed a different solution: a cloud-first VPN solution using Azure VWAN and Azure VPN. The cloud-first solution uses Azure VPN policies and tunneling to bypass the requirement for routing hardware in SAP’s environment. It also provides full support for IKEv2 and removes dependency on outdated VPN hardware and controls. This is the first Azure-based solution using IKEv2 policy-based VPN connectivity for SAP and ADP support. This cutting-edge solution introduces a highly secure and cost-efficient way for business partners to connect with Azure while ensuring strict adherence to regulatory compliance. The introduction of IKEv2 VPN connectivity allows partners’ systems to securely communicate with Microsoft’s SAP environment in Azure, fostering a seamless integration of services. It sets the stage for unprecedented connectivity, creating a robust ecosystem for business partners to collaborate and exchange data securely. Azure VWAN provides native IKEv2 VPN connectivity support. By taking advantage of Azure’s powerful networking capabilities, the solution is instantly scalable and highly available. The Azure-native approach streamlines the entire connectivity process by simplifying set up, management, and monitoring. With IKEv2 VPN and Azure VWAN, all communications between partners’ or providers’ systems and Microsoft’s SAP environment are encrypted and authenticated, safeguarding sensitive information from unauthorized access. As a result, we can provide our partners with peace of mind and uphold the highest standards of data protection. By eliminating the need for complex hardware and streamlining the set-up process, we enable our internal businesses and partners to achieve significant cost savings. This cost-effectiveness empowers them to invest resources strategically and fuel their growth. Regulatory compliance is non-negotiable in today’s business landscape. Our VPN connectivity and native network solutions are designed with strict adherence to regulatory requirements in mind. By meeting industry standards and regulatory mandates, we ensure that our business partners can confidently operate within the bounds of compliance, mitigating potential risks and challenges. The first IKEv2 policy-based VPN connectivity solution for SAP and ADP support through Azure native network solutions represents an entirely new way to approach SAP and ADP connectivity for Microsoft partners. With improved security, better cost efficiency, and support for regulatory compliance adherence, we’re reshaping the standards for business partner connectivity in the cloud. We’re continuing to innovate and explore new approaches to secure and efficient VPN connectivity to support SAP systems.  To navigate the integration of your network with Microsoft Azure networking solutions, consider the following:  Here’s how you can create a peer-to-site VPN connection using Azure Virtual WAN. Want more information? Email us and include a link to this story and we’ll get back to you. Please share your feedback with us—take our survey and let us know what kind of content is most useful to you. Tags: Azure Network, Microsoft Azure, SAP Mar 22, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tDodd Willingham Microsoft is a big company with thousands of teams working in different ways based on the work they do. Despite that complexity, when our employees go looking for something, they expect an internal search portal that will find exactly what they’re looking for instantly—just like when they search on the internet. Yet when talking to... Mar 21, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Several years into the era of hybrid work, most of us are used to appearing in a Brady Bunch-style gallery. We click or tap an emoji to ask a question or applaud an achievement and still have to remember to not be “on mute” when it’s our turn to talk. Half of workers have gone... Mar 20, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tJoshua Deans Microsoft Digital (MSD) is the organization that powers, protects, and transforms Microsoft. As part of its mission, MSD builds and manages the cloud network infrastructure that supports Microsoft products and services. MyWorkspace is a browser-based cloud-provisioning tool created by MSD to allow Microsoft employees to rapidly deploy Azure-based infrastructure environments for solution testing and development... Mar 20, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush If you’re on a sales team, you know that there are all kinds of distracting tasks that eat away at your time and get in the way of what you do best—building relationships with and solving problems for customers. There’s no doubt that modern salespeople need to rely on too many tools and services to... Cloud-based networking has become a core pillar of Microsoft’s core infrastructure. Here at Microsoft Digital (MSD), Microsoft’s internal IT organization, our unwavering commitment to an exceptional user experience for our employees has led us to transform how we monitor our network. We’re transitioning from traditional network performance monitoring to a powerful integration between AppNeta by...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more We’re using Microsoft Azure Automation Update Management to facilitate and automate updates for on-premises servers that provide Domain Name Service (DNS), Dynamic Host Configuration Protocol (DHCP), and IP address management (IPAM) services internally here at Microsoft. Our solution allows us to monitor the compliance of our servers and deploy updates as they become available. Update...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more Editor’s note: This is the fifth in an ongoing series on moving our network to the cloud internally at Microsoft. Tap here to read the full series. In the modern workplace, Microsoft employees access their work from diverse locations. To ensure secure and efficient connectivity to cloud and on-premises resources for our global workforce, we’re...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more "
}