{
    "title": "Microsoft Plans New Data Centre Campus in South Africa",
    "date": "2/14/2024",
    "url": "https://www.techinafrica.com/microsoft-plans-new-data-centre-campus-in-south-africa/",
    "text": " by\n\n\nSylvia Duruson\n\n\nFebruary 14, 2024, 2:04 am \n\n428 Views Microsoft has revealed plans to construct an expansive data centre campus in Kosmosdal, Centurion, South Africa. This facility will expand Microsoft’s cloud infrastructure footprint in the country amid surging demand for services like Azure and Dynamics 365. While still in early development phases, Microsoft said the new campus aligns with its commitment to enabling digital transformation and powering AI adoption across Africa. The company emphasized it looks forward to collaborating with local stakeholders in Centurion to develop the project sustainably. This upcoming facility represents the latest in Microsoft’s continued infrastructure investments in South Africa, a pivotal innovation and growth market. In 2019, Microsoft launched its first Azure data centres in Johannesburg and Cape Town, marking the inaugural hyperscale public cloud on the continent. Then last October, Azure Availability Zones went live to enhance redundancy. Additionally, Microsoft continues exploring innovative data centre power sources in Africa like small modular nuclear reactors. The company recently posted a job listing for a Principal Program Manager of Nuclear Technologies to oversee this forward-looking strategy. Analyst estimates indicate Microsoft could allocate between $1 billion to $6.8 billion per country hosting its data centres globally. As Microsoft’s sole current data centre location in Africa, South Africa is likely in line for substantial financial commitment with the new campus. According to Microsoft, the Kosmosdal data centre will enable the company to meet elevated demand from organisations of all sizes for reliable, low-latency cloud services. Microsoft already unveiled Dynamics 365 and Power Platform availability in South Africa last year. Per Microsoft citing industry reports, over 48% of South African institutions currently utilize the cloud for digital innovation and transformation. With many local regulations requiring in-country data residency, establishing regional data centres also unlocks access for new cloud consumers. Microsoft cloud rivals like AWS and Google Cloud have similarly targeted South Africa for expansion to serve growing continental demand. Just this February, Google Cloud launched its first African region in Johannesburg. As connectivity and technology maturation accelerates across Africa, Microsoft is striving to cement itself as the cloud platform of choice for developers, enterprises and the public sector. With a new data centre campus solidifying Azure cloud capacity in South Africa, Microsoft can differentiate on performance, localization and compliance. The company also emphasized commitments to sustainability and community partnership as guiding principles. While the Cape Town and Johannesburg facilities focus on southern Africa, future data centres in other locales would further expand addressable markets. With the Kosmosdal build, Microsoft appears intent on maintaining its pole position as Africa continues rapidly digitizing. Source See more Total votes: 0 Upvotes: 0 Upvotes percentage: 0.000000% Downvotes: 0 Downvotes percentage: 0.000000% Trending\t\t\t\t\n\n\t\t\t\t\tHot by\n\n\nSylvia Duruson\n\n\nMarch 20, 2024, 11:32 am Trending by\n\n\nSylvia Duruson\n\n\nMarch 20, 2024, 11:11 am by\n\n\nSylvia Duruson\n\n\nMarch 12, 2024, 3:21 am Hot by\n\n\nSylvia Duruson\n\n\nFebruary 26, 2024, 10:26 pm by\n\n\nSylvia Duruson\n\n\nFebruary 25, 2024, 3:01 pm by\n\n\nSylvia Duruson\n\n\nFebruary 9, 2024, 2:42 pm Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.   Δ Trending\t\t\t\t\n\n\t\t\t\t\tHot by\n\n\nGrace Ashiru\n\n\nMarch 21, 2024, 5:52 am Trending\t\t\t\t\n\n\t\t\t\t\tHot by\n\n\nGrace Ashiru\n\n\nFebruary 14, 2024, 7:18 am Hot by\n\n\nGrace Ashiru\n\n\nFebruary 22, 2024, 2:52 am Hot by\n\n\nGrace Ashiru\n\n\nMarch 14, 2024, 5:37 am Hot by\n\n\nGrace Ashiru\n\n\nFebruary 27, 2024, 1:01 am Trending\t\t\t\t\n\n\t\t\t\t\tHot by\n\n\nGrace Ashiru\n\n\nMarch 15, 2024, 5:22 am Get the best viral stories straight into your inbox! Email address:  Don't worry, we don't spam Get the best viral stories straight into your inbox! Email address:  Don't worry, we don't spam The hottest and most popular news, stories, interviews, press releases and opinions about startups, entrepreneurs and new technologies in Africa. https://www.soccernews.com/en/video/chelsea-vs-west-ham-live-football-match-04-12-2021_0fa8b065e.html\nhttps://www.soccernews.com/en/video/west-ham-united-vs-chelsea-live-stream-line-ups-and-score-04-12-2021_16b7b7d62.html\nhttps://www.soccernews.com/en/video/west-ham-vs-chelsea-live-premier-league-21-22-full-match-live-04-12-2021-2_bc98e8182.html\nhttps://www.soccernews.com/en/video/west-ham-vs-chelsea-live-match-score-04-12-2021_fbf3c04c3.html\nhttps://www.soccernews.com/en/video/west-ham-vs-chelsea-live-premier-league-21-22-full-match-live-04-12-2021-1_96a10d968.html\nhttps://www.soccernews.com/en/video/west-ham-vs-chelsea-live-premier-league-21-22-full-match-live-04-12-2021_2253955f2.html Get the best viral stories straight into your inbox! Email address:  Don't worry, we don't spam © 2016-2020 - Tech in Africa - Startup news, stories and interviews from in Africa Username or Email Address Password  Enter your account data and we will send you a link to reset your password. Username or Email Address  Processing files… "
}