{
    "title": "Where Will Microsoft Stock Be in 3 Years?",
    "date": "2/10/2024",
    "url": "https://www.fool.com/investing/2024/02/10/where-will-microsoft-stock-be-in-3-years/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Microsoft (MSFT -0.15%) has rewarded investors handsomely in the past year with impressive gains of 55%. Even better, the tech giant's latest results indicate that it could sustain its impressive rally going forward. What's sparked this heightened investor enthusiasm? Microsoft has a solid growth driver in the form of artificial intelligence (AI) pushing it higher. Microsoft stock did see a dip in its stock price following the release of the company's fiscal 2024 second-quarter results on Jan. 30. It seems investors had some concern about an increase in its operating expenses. What those investors seemed to ignore however is that Microsoft's fiscal Q2 revenue jump was the fastest since 2022. Let's take a closer look at the factors that have led to an acceleration in Microsoft's growth and check how much upside this \"Magnificent Seven\" stock could deliver over the next three years. Microsoft's fiscal Q2 revenue (for the three months ended Dec. 31, 2023) was up 18% year over year to $62 billion. The company's non-GAAP net income increased at a faster pace of 33% from the prior-year period to $2.93 per share. The numbers were well ahead of consensus expectations of $2.77 per share in earnings on revenue of $61.1 billion. Microsoft's cloud business played a key role in powering its growth last quarter. The company's Intelligent Cloud business segment, which includes revenue from the Azure cloud platform, increased 20% year over year to $25.9 billion. What's more, Microsoft's Azure cloud revenue increased an impressive 30% year over year, exceeding the 27.7% increase that Wall Street was looking for. Microsoft management pointed out on the latest earnings conference call that AI services accelerated Azure's growth by 6 percentage points last quarter. That was an improvement over the 3 percentage point increase seen in the first quarter of the fiscal year, and Microsoft claims that the integration of AI-focused services into its cloud offerings is helping it gain market share. CEO Satya Nadella said on the earnings call: \"We now have 53,000 Azure AI customers. Over one-third are new to Azure over the past 12 months.\" He pointed out that the Azure platform gives customers access to a wide range of large language models (LLMs) and small language models (SLMs), which they can use to run AI training and inference applications with the help of accelerators from Nvidia and Advanced Micro Devices. As a result, multiple corporations are lining up to use Microsoft's Azure OpenAI service and the company is witnessing \"larger and more strategic Azure deals with an increase in the number of billion-dollar-plus Azure commitments.\" This explains why Microsoft's cloud business grew at a faster pace when compared to rivals. Alphabet's Google Cloud, for instance, saw a 26% year-over-year increase in revenue last quarter. Amazon Web Services, on the other hand, saw a 13% year-over-year jump in revenue in the fourth quarter of 2023. This makes it clear that Microsoft is indeed gaining share in the lucrative cloud computing market. Mordor Intelligence estimates that the size of the AI-based cloud computing market could grow from $67 billion in 2024 to $275 billion in 2029 at a compound annual rate of 32%. So, Microsoft's growing share of the cloud computing market should allow it to capitalize on this huge opportunity and boost its growth. Analysts anticipate Microsoft will finish the current fiscal year with $244 billion in revenue, an increase of 15% over the previous year. That points toward a nice acceleration over the 7% revenue growth Microsoft delivered in fiscal 2023. More importantly, Microsoft is expected to sustain its healthy growth rate over the next couple of years as well.  MSFT Revenue Estimates for Current Fiscal Year data by YCharts If Microsoft's revenue indeed jumps to $319 billion at the end of fiscal 2026 and it maintains its current price-to-sales ratio of 13.5 at that time, its market cap could jump to just over $4.3 trillion. That points toward a 43% jump within the next three years. However, Microsoft could deliver stronger growth if it continues to capture a bigger share of the cloud computing market thanks to AI, which is why investors can still buy this AI stock even after the impressive returns it has clocked in the past year. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}