{
    "title": "Bill Gates' 5 Dividend Stocks To Buy",
    "date": "2/25/2024",
    "url": "https://www.insidermonkey.com/blog/bill-gates-5-dividend-stocks-to-buy-1264648/5",
    "text": "Bill Gates’ Stake: $14,368,815,179 Microsoft Corp (NASDAQ:MSFT) tops our list of the best dividend stocks to buy according to Bill Gates because Bill & Melinda Gates Foundation has the biggest stake in Microsoft Corp (NASDAQ:MSFT), worth about $14.3 billion, as of the end of the fourth quarter of 2023. In September 2023, Microsoft’s board of directors approved a 10% increase in Microsoft Corp’s (NASDAQ:MSFT) quarterly dividend. As of February 24 the stock’s dividend yield stands at 0.73%. Earlier this month The Information reported that Microsoft Corp (NASDAQ:MSFT) is working on a networking card to cut its reliance on Nvidia. Baron Fifth Avenue Growth Fund stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its fourth quarter 2023 investor letter: “Our biggest purchase in the fourth quarter was a new position we initiated in the software platform Microsoft Corporation. While we have owned shares of Microsoft Corporation (NASDAQ:MSFT) in the large-cap core growth Baron Durable Advantage Fund, we have been reluctant to add Microsoft to this Fund for many years namely since we viewed it as a better fit for a post high-growth strategy. However, Microsoft’s transformation under the helm of Satya Nadella has changed the company’s trajectory as it went from a windows-centric, on – premises technology provider to one of the top two global cloud providers. Cloud now represents over 55% of total revenues and has been growing rapidly. Over time, Microsoft was able to build a $125 billion run-rate cloud business that is still growing at a rapid pace and continues to take market share, while becoming a more important driver for the company. For example, in the last quarterly earnings release, Microsoft Cloud grew 23% year-over-year in constant currency, significantly outpacing the company’s 12% overall constant currency growth as well as the growth of its main competitors. A 23% growth rate at this scale essentially implies that Microsoft added a run rate of around $24 billion of cloud revenues year-over-year. Just to put this in perspective, $24 billion is nearly the size of Mastercard’s business, it is over 8 times Snowflake’s total revenue and is nearly 3 times ServiceNow’s total revenue. We continue to view cloud as early in its penetration opportunity – according to latest estimates from Gartner, global cloud spend is expected to be $564 billion3 which still represents only 12% of the total $4.7 trillion worldwide IT spending. We also believe that Microsoft is one of the best competitively positioned large-cap companies with its vertically integrated software stack (infrastructure + applications), while the inflection in the adoption of artificial intelligence (AI) and GenAI represents potentially the biggest addressable market expansion for the company in recent history. We also view Microsoft’s competitive positioning in AI as advantaged thanks to both the fact that it does not face an innovators dilemma in its core business (as compared with Alphabet’s core search business, which could potentially be at risk due to GenAI). Microsoft also has a tight partnership with OpenAI, has a large proprietary data asset built over time, and has a go-to-market advantage through a vast and robust partner ecosystem and its significant installed base and product bundling opportunities. These should enable it to cross-sell its existing user base as AI becomes embedded into current and new products…” (Click here to read the full text) Insider Monkey focuses on uncovering the best investment ideas of hedge funds and insiders. Please subscribe to our free daily e-newsletter to get the latest investment ideas from hedge funds’ investor letters by entering your email address below. You can also look at the What Ray Dalio Is Doing These Days? – Top 10 Stock Picks in 2023 and the 15 Stocks Dumb Money’s Steve Cohen Is Betting On Now. NYSE:WMNYSE:DENYSE:CNINYSE:CATNASDAQ:MSFTDeere & Co (NYSE:DE)Caterpillar Inc. (NYSE:CAT)Microsoft Corp (NASDAQ:MSFT)Waste Management Inc (NYSE:WM)Bill Gates' 5 Dividend Stocks To BuyCanadian National Railway Co (NYSE:CNI)15 Stocks Dumb Money’s Steve Cohen Is Betting On NowWhat Ray Dalio Is Doing These Days - Top 10 Stock Picks in 2023Show more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                 Get our editor’s daily picks straight in your inbox!  "
}