{
    "title": "Pushing Buttons: What Microsoft’s ‘vision for the future of Xbox’ could \nlook like",
    "date": "2/7/2024",
    "url": "https://www.theguardian.com/games/2024/feb/07/pushing-buttons-xbox-future-phil-spencer",
    "text": "In this week’s newsletter: Company head Phil Spencer is planning an update next week on the console – what could he announce? Don’t get Pushing Buttons delivered to your inbox? Sign up here Something big is about to happen to Xbox. On Monday, Phil Spencer, the head of Microsoft’s gaming division, revealed that the company will share its “vision for the future of Xbox” next week. What has brought this about? In January, reports started to emerge that Microsoft was considering porting its excellent first-party title Hi-Fi Rush on to other hardware platforms, with the Nintendo Switch widely named as the recipient. At the time, rumours were also swirling that multiplayer pirate adventure Sea of Thieves may be coming to Switch and PS5. On Sunday, Verge suggested that Microsoft was considering a multiplatform release for the forthcoming Indiana Jones and the Great Circle (below), with a “short” period of exclusivity on Xbox. A day later, the story widened. News site XboxEra claimed that Microsoft is planning to bring Starfield, its biggest Xbox exclusive of 2023 to PlayStation 5 soon after the game’s expansion pack for Xbox and PC. According to XboxEra, the decision has caused “fierce internal debate” within the Xbox division. So what is Spencer about to announce, and why? The problem he is contending with is that Xbox has become almost unmanageable as a brand. It started as a console, the Xbox, which sold 24m units but failed to make an impact in the Asian market. The Xbox 360 followed in 2005, shifting 85m units, but still falling just behind PS3 on 87m. Then came the Xbox One, which sold a reported 58m units, half of PS4, partially due to an ill-advised attempt to market the console as an all-round media platform while Sony stuck with its “PlayStation is a games machine” motto. Now Xbox is also a software application that runs on PC, phones and some TVs, and it’s a streaming platform that consists of both Game Pass for downloads and the Xbox Cloud Gaming service for playing classic games over the internet. The company also went through an arduous anti-monopoly investigation to complete a vast $68bn purchase of Activision Blizzard, a company whose major series, Call of Duty, must remain multiplatform. Then you have the fact that the Xbox hardware has been consistently outsold by PlayStation machines for more than a decade. The latest figures suggest that the PS5 outsold the Xbox Series X by three to one last year, bolstered by the huge success of Marvel’s Spider-Man 2. Microsoft stopped reporting console sales in 2015, saying it doesn’t consider those numbers to be a key indicator of the brand’s success, due to its other platform manifestations; instead pointing toward Game Pass subscriptions. But since January, it also hasn’t been reporting those numbers, which are believed to stand at around 30-33m worldwide, but may well have plateaued. Microsoft has effectively backed itself into a corner from which no escape route is totally desirable. In many ways, the smart thing would be to combine the business models of Sega, which abandoned console development after the failure of Dreamcast and became a third-party games publisher, and Valve, which stopped being a developer and became a digital platform holder with Steam. In effect, it could abandon the Xbox hardware and concentrate on bringing Microsoft exclusives to other platforms while maintaining the Xbox name for a streaming service accessible via PC, phones and smart devices. But that would leave a lot of extremely unhappy Xbox fans. The worry is that Microsoft will opt for a series of half measures: porting some smaller games to PS5 and Switch, but not all; bringing out a new Xbox machine, but perhaps only as an elite option; trying to get Game Pass on more platforms, while still attempting to ringfence key exclusives. To ask a brutal question: has it ever really mastered the console hardware market in the way Sony and Nintendo have? Is it time to let go? But my goodness, the backlash from the Xbox fanbase would be vast, and that alone may be enough to keep Microsoft’s hand in console manufacturing. Whatever the case, it’s all a bit of a mess and it symbolises the strange, slightly uncomfortable role Xbox has always had in the Microsoft empire. When Xbox gets it right, it really gets it right. The whole Xbox 360 era, with its revolutionary online multiplayer infrastructure; the legacy of Halo, Gears of War, Forza Horizon, Sea of Thieves, Minecraft, Fable; the sheer bargain of Game Pass. Xbox has been a necessary third runner in the console race, putting money into big ideas and pushing the technical agenda. Now we must wait for this announcement regarding, Spencer’s “vision for the future”. And fans of the console will just have to hope it isn’t blurred beyond recognition. Imagine Streets of Rage crossed with the Michael Douglas movie Falling Down and you have Rising Up, a pixel-art brawler about an office worker losing it when the printer malfunctions and going on a destructive equipment smashing rampage. Created by a tiny team led by Erik H Jørgensen and Laurent Gehin, the art style, tone and simple kick-punch-jump action perfectly recall the classic scrolling beat-em-ups of the late 1980s, and it’s filled with ridiculous comic moments. You can play for free on the indie gaming site Itch.io. Available on: PC/iOSEstimated playtime: One hour I loved this Eurogamer piece about the origins of Die Hard Trilogy and how UK developer Probe set out to make three games in one – and largely succeeded. But I also like how the article starts as a profile of Simon Pick, developer of 8bit classic Daredevil Dennis. You have to read it to see how they’re connected. Kotaku has a really interesting article on ageism in the games industry, talking to industry veterans about the challenges of staying active in the business when you pass your 30s. “The difficulty of the work, the low pay, drives even young developers away,” says legendary designer Warren Spector. But to mature as a culture, older voices are definitely needed. And finally, a nice positive piece from Polygon entitled “Palworld is the culmination of every game I’ve ever loved”, a review of the unexpected smash hit, which combines elements of Pokémon and online shooters and now has around 19 million players. Sign up to Pushing Buttons Keza MacDonald's weekly look at the world of gaming after newsletter promotion Suicide Squad: Kill the Justice League review – straddles the brilliant and the banal Tekken 8 review – 3D fighter packs more punch than ever ‘It’s rotting young people’s brains’: the murky world of gambling in video games Video games can teach us more about philosophy than books – if only they’d dare | Dominik Diamond The man who owes Nintendo $14m: Gary Bowser and gaming’s most infamous piracy case This week’s question comes from Pushing Buttons’ own Keza MacDonald, who is on sabbatical but slid into my DMs to ask: “What Xbox game from history would you like everyone to experience?” I will always feel guilty for giving Sea of Thieves a three-star rating , but it was fair at the time as I just couldn’t get a stable game and there was a slight lack of content – although when everything worked, it was magical. Now I think that everyone should play it ; it’s such a joyful, rich and hilarious experience and there is so much to do. From further back, the Ninja Gaiden games were ruthlessly brilliant, Gears of War 2 was enthralling and I loved the digital titles such as Trials and Geometry Wars. Oh and Forza Horizon 4. And Minecraft. Always, always Minecraft. If you’ve got a question for Question Block – or anything else to say about the newsletter – email us on pushingbuttons@theguardian.com "
}