{
    "title": "No Microsoft announcement about disabling computers sharing fringe content \n| Fact check",
    "date": "2/8/2024",
    "url": "https://news.yahoo.com/no-microsoft-announcement-disabling-computers-183151732.html",
    "text": " A Feb. 3 Instagram post (direct link, archive link) shows the headline of an article with a picture of Microsoft co-founder Bill Gates. \"Microsoft To Disable Computers of Users Who Share ‘Non-Mainstream Content’ Online,\" reads the headline. The post garnered more than 7,000 likes in two days. Similar versions of the claim were shared on Instagram, Facebook and X, formerly Twitter. More from the Fact-Check Team: How we pick and research claims | Email newsletter | Facebook page A spokesperson for the company said no such plan has been announced. The claim originated from a website that regularly publishes misinformation. Emelia Katon, a senior account executive at Microsoft, told USA TODAY in an email that the claim was false. The article, published by The People's Voice, bases its claim on a January NBC interview with Microsoft CEO Satya Nadella. The interview doesn't show the CEO discussing the disabling of personal computers, however. Nadella talks about misinformation, the upcoming election and the tech industry's work to detect deepfakes and AI. When asked if he wanted to put a stop to any of the misinformation online, Nadella expressed his desire to work alongside tools such as AI. \"With all of the technology, I am more in the camp of 'Let us make sure that the technology ultimately is just a tool,'\" he said in the interview before advertising Microsoft's new AI-powered software called Copilot. Fact check: UN didn't say digital IDs would be required; post distorts aim of new project The People's Voice, previously known as NewsPunch, has repeatedly published fabricated stories. Among those debunked by USA TODAY in recent months are false claims that the World Health Organization demanded surveillance powers to monitor every person on earth and that Republican presidential candidate Nikki Haley said only Bill Gates 'can save humanity.' USA TODAY reached out to The People's Voice and the user who shared the post for comment but did not immediately receive a response. Lead Stories and the Associated Press also debunked the claim. Emelia Katon, Feb. 7, Email exchange with USA TODAY NBC News (YouTube), Jan. 30, Exclusive: Microsoft CEO Nadella on the promise and problems of A.I. Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or e-newspaper here. USA TODAY is a verified signatory of the International Fact-Checking Network, which requires a demonstrated commitment to nonpartisanship, fairness and transparency. Our fact-check work is supported in part by a grant from Meta. This article originally appeared on USA TODAY: No Microsoft announcement about disabling computers | Fact check "
}