{
    "title": "Today’s Cache | Microsoft surpasses Apple to become world’s most valuable \ncompany; CES 2024 Day 2 highlights; OpenAI CEO discusses AI risks",
    "date": "1/12/2024",
    "url": "https://www.thehindu.com/sci-tech/technology/todays-cache-microsoft-surpasses-apple-to-become-worlds-most-valuable-company-ces-2024-day-2-highlights-openai-ceo-discusses-ai-risks/article67733788.ece",
    "text": "To enjoy additional benefits CONNECT WITH US January 12, 2024 02:38 pm | Updated 05:41 pm IST COMMents SHARE READ LATER Microsoft claimed the title of the world’s most valuable company on Thursday.\n| Photo Credit: REUTERS (This article is part of Today’s Cache, The Hindu’s newsletter on emerging themes at the intersection of technology, innovation and policy. To get it in your inbox, subscribe here.) Microsoft claimed the title of the world’s most valuable company on Thursday, seizing the lead from Apple, which faced a challenging start to 2024 amid concerns over demand. Redmond-based Microsoft’s shares surged by 1.5%, securing a market valuation of $2.888 trillion. This ascent was propelled by Microsoft’s early success in capitalizing on generative artificial intelligence, attracting eager investors. In contrast, Cupertino’s Apple experienced a 0.3% dip, resulting in a market capitalization of $2.887 trillion, marking the first time since 2021 that Apple’s valuation fell below Microsoft’s. Apple’s stock woes, down 3.3% in January, stem from rating downgrades and apprehensions about iPhone sales, particularly in China, where competition with Huawei and geopolitical tensions pose challenges. CES 2024’s second day brought a wave of tech announcements. Google, under the theme “Better Together,” partnered with Samsung to streamline Android inter-device communication. Honda unveiled futuristic EV concepts—the sleek Saloon and innovative Space Hub. Hyundai’s updated S-A2 Air Taxi promises efficient urban transport. In smart homes, Amazon embraced the Matter standard, and AI-powered innovations like the Clicks iPhone keyboard case and Rabbit R1 assistant stood out. Accessibility took center stage with products like the OrCam Hear system and GyroGlove for hand tremors. CES 2024 marks a positive shift towards meaningful advancements in assistive technology, diverging from industry norms. OpenAI CEO Sam Altman engaged in discussions about the risks associated with artificial intelligence with Republican U.S. House of Representatives Speaker Mike Johnson on Capitol Hill. The meeting addressed the pressing need for AI regulation, particularly as the Biden administration seeks legislative action. The polarized US Congress, with Republican control in the House and Democrats holding a Senate majority, faces challenges in passing effective regulations. AI’s rapid ascent has raised concerns, including its potential to disrupt democratic processes, escalate fraud, and contribute to job displacement. Notably, Europe is leading the way in AI regulation, with lawmakers actively drafting rules to address these concerns. COMMents SHARE BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. "
}