{
    "title": "Does Microsoft's Latest Artificial Intelligence (AI) Product Make It a \nScreaming Buy?",
    "date": "1/20/2024",
    "url": "https://www.fool.com/investing/2024/01/20/does-microsofts-latest-artificial-intelligence-ai/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Microsoft's (MSFT -0.15%) Office suite has long been the choice of productivity tools for businesses and customers. While this will continue to be the case, Microsoft is also launching more tools to cement its place on top of the competition. Recently, Microsoft has announced its generative AI tool meant to increase productivity within these programs: Copilot. This tool comes in a business and consumer-focused variety, but does it make Microsoft stock a buy now? Generative AI was first made popular through the launch of OpenAI's Chat GPT. When this platform took the world by storm in late 2022, it amazed people with what it could do, but it wasn't refined enough to be useful for typical productivity tasks. With the integration of generative AI in tools like Copilot, we've finally reached the stage where this technology can increase productivity. With Copilot, it can search an inbox full of emails to summarize a topic, take notes in a meeting, create incredible PowerPoint presentations, and provide the formulas you need for your worksheet. But Microsoft isn't going to give this add-on away for free. Copilot for Microsoft 365 costs an additional $30 per month for business licenses. On the consumer side, Copilot Pro is available for $20 per month, giving its users even more tools than the base Copilot product. Copilot Pro gives users access to OpenAI's latest generative AI model: GPT-4. It also boasts a better image creation tool (DALL·E 3) than the standard Copilot. If businesses want this additional functionality, it will also cost them an extra $20 per month, bringing the total to $50 for Copilot Pro. With Microsoft's global customer base, these figures can easily transform into a massive revenue stream. But what can investors reasonably expect? As of 2022, about 345 million people were using Microsoft 365. While Microsoft hasn't updated that figure in a while, it's safe to assume it's probably growing a fair amount (in its first-quarter fiscal-year 2024 earnings report, Microsoft stated its paid 365 seats rose 10%). So, I'll assume paid seats are currently around 380 million. If 10% of these users adopt Copilot on the business side, and 5% use Copilot Pro on the consumer side, that would provide $13.68 billion and $4.56 billion annually, respectively. For reference, Microsoft's trailing-12-month revenue is $218 billion, so this would provide an 8% revenue boost. That's not growth that can be ignored, even if the adoption figures are lower than that. Furthermore, this would be a massive profit boost, as Microsoft has already spent significant money on engineers to build the product and data centers to crunch the workloads. But does this overcome Microsoft's already expensive price tag? With a lot of change expected in the coming year, the market has already baked in quite a bit of growth into Microsoft stock, as it trades for an astounding 35 times forward earnings.  MSFT PE Ratio (Forward) data by YCharts For reference, Nvidia, a stock many investors complain is already too expensive, trades at 46 times forward earnings, so Microsoft isn't too far away from hitting this level. So, is Microsoft a buy here? I'd say no. Other AI companies are launching similarly impactful products that can be purchased at a much lower price tag. Microsoft is priced for perfection, and even though it has a strong track record, it may be set up for failure if it can't nail or exceed analyst expectations. Keithen Drury has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Microsoft and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}