{
    "title": "Alphabet (GOOGL) to Boost Bard Capabilities With New Updates",
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-boost-bard-capabilities-150700144.html",
    "text": "Alphabet GOOGL is launching a range of new features for Google Bard starting in 2024.The upcoming updates include custom bots, tasks, shared queries, \"Power Ups,\" and a paid \"Advanced\" tier.Further, Google will introduce new sections in Bard, namely \"Gallery\" and \"Tasks,\" to showcase its capabilities, including image generation and prompt improvement through the \"Power Up\" button. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Alphabet’s growing chatbot capabilities will further solidify its presence in the global chatbot market. This, in turn, will strengthen the company’s generative AI efforts, which are acting as key catalysts for the company. Alphabet’s shares have gained 56.2% in the past year compared with the Zacks Computer & Technology sector’s growth of 47.6%.Moreover, these efforts are expected to strengthen its presence in the booming generative AI market space. Per a Mordor Intelligence report, the chatbot market size is expected to hit $7.01 billion in 2024 and grow to $20.8 billion by 2029, witnessing a CAGR of 24.3% between 2024 and 2029.A Markets and Markets report indicates that the generative AI market will reach $76.8 billion by 2030, exhibiting a CAGR of 31.5% during the forecast period of 2023-2030.Solidifying prospects in these promising markets presents a significant growth opportunity for Alphabet. This, in turn, is expected to benefit its overall financial performance in the near term.The Zacks Consensus Estimate for 2024 total revenues stands at $283.39 billion, indicating year-over-year growth of 11.26%.The consensus mark for 2024 earnings is pegged at $6.74 per share, indicating year-over-year growth of 15.6%. The estimate has been revised upward by 0.7% in the past 30 days. The latest move is likely to aid this Zacks Rank #2 (Buy) company to strengthen its competitive position against peers like Microsoft MSFT, Amazon AMZN and Baidu BIDU, which are also making continuous efforts to capitalize on the growth opportunities present in the chatbot market. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Microsoft is gaining from the integration of OpenAI’s next-generation LLM — GPT-4 — into its search engine Bing and browser Edge.Microsoft‘s OpenAI also introduced fine-tuning for GPT-3.5 Turbo, enabling developers to customize models for specific use cases and run them at scale. This version outperforms GPT-4 on tasks, shortens prompts and speeds up API calls.Meanwhile, Amazon’s cloud-computing arm, Amazon Web Services, introduced Amazon Q, an AI-powered chatbot that assists in content creation and action-taking based on customer information repositories, code and enterprise systems.Further, Amazon Q streamlines tasks, accelerates decision-making and fosters creativity by providing personalized information and advice tailored to individual user identities, roles and permissions.Baidu, on the other hand, launched its chatbot, Ernie Bot, allowing users to ask questions, prompt it for market analysis and summarize documents.Additionally, Baidu's Ernie Bot chatbot has attracted over 100 million users in China, indicating strong growth potential and potentially boosting its Cloud business. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Baidu, Inc. (BIDU) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}