{
    "title": "Statcounter: Microsoft Edge edges near 12% market share for the first time",
    "date": "1/1/2024",
    "url": "https://www.neowin.net/news/statcounter-microsoft-edge-edges-near-12-market-share-for-the-first-time/",
    "text": "16 minutes ago 1 hour ago 10 hours ago 16 hours ago 16 minutes ago 1 hour ago 18 hours ago 19 hours ago 16 minutes ago Mar 22, 2024 Mar 20, 2024 Mar 20, 2024 Mar 23, 2024 Mar 22, 2024 Mar 21, 2024 Mar 20, 2024 1 hour ago 4 hours ago 14 hours ago Mar 23, 2024 Mar 23, 2024 Mar 20, 2024 Mar 17, 2024 Mar 9, 2024 Dec 31, 2023 Oct 14, 2023 Apr 11, 2023 Mar 10, 2024 Mar 3, 2024 Jan 24, 2024 Dec 3, 2023 19 hours ago Mar 21, 2024 Sep 23, 2023 Sep 21, 2023 23 hours ago Mar 23, 2024 Mar 23, 2024 Mar 21, 2024 Feb 23, 2024 Jan 20, 2024 Dec 6, 2023 Jun 6, 2023 16 hours ago Mar 23, 2024 Mar 22, 2024 Mar 21, 2024 Taras Buria\n\nNeowin\n@TarasBuria        ·\n    \n\n    Jan 1, 2024 05:24 EST\n    \n         · Hot! \nwith 5 comments  At the beginning of each month, Statcounter publishes its regular reports, revealing fresh data about browsers, operating systems, search engines, and other products. The December 2023 report is now available on the official website. It details Microsoft Edge getting to its new all-time high, Safari taking a sudden nosedive, and Chrome climbing up. After losing second place to Safari in May 2023, Microsoft Edge is back from third to second most popular desktop browser. It increased its market share in December 2023, going up from 11.23% to 11.9%. That is an all-time high for Edge, which is available on Windows, macOS, and Linux. Apple's Safari, on the other hand, is the only non-cross-platform desktop browser in the report. Last month, it went from 13.3% to 8.96% (there is no information on what is behind such a drastic change), coming dangerously close to Firefox with its 7.62% (+0.93 points). Google Chrome is still the go-to browser for most users on desktop computers. It owns the market with its massive 65.23% market share, which increased by 3.17 points in December 2023. Finally, Opera closes the top 5 desktop browser list with a 3.8% market share (-0.74 points). And here is what things look like on the mobile side of the market: Microsoft Edge also has a fair share of users on iPhone and Android, but it is nowhere near its competitors. Statcounter says Edge's mobile market share is about 0.24%. You can learn more about the latest Statcounter browser report on the official website. Remember that third-party stats reports cannot be 100% accurate. More info on how Statcounter gathers its data is available here. Taras Buria\n                                                ·\n                    \nFeb 1, 2024\n\nwith\n5\n                            comment\n                                s Taras Buria\n                                                ·\n                    \nAug 1, 2023\n\nwith\n5\n                            comment\n                                s Taras Buria\n                                                ·\n                    \nFeb 1, 2023\n\nwith\n4\n                            comment\n                                s Taras Buria\n                                                ·\n                    \nJan 2, 2023\n\nwith\n30\n                            comment\n                                s Login or Sign Up to read and post a comment. Please enter your reason for reporting this comment. baseus beestation promo windows 11 insider preview promo twirl windows 11 insider preview promo microsoft weekly windows 11 moment 5 windows 11 moment 5 baseus pb tails © Since 2000 Neowin®\n                                    All trademarks mentioned are the property of their respective owners. "
}