{
    "title": "Microsoft, Amazon, Google AI Investments Get Federal Scrutiny",
    "date": "1/25/2024",
    "url": "https://www.crn.com/news/cloud/2024/microsoft-amazon-google-ai-investments-get-federal-scrutiny",
    "text": "The FTC “will scrutinize corporate partnerships and investments with AI providers to build a better internal understanding of these relationships,” according to a statement.  The U.S. Federal Trade Commission has required Microsoft, OpenAI, Amazon, Google parent Alphabet and Anthropic to provide information on their recent investments and partnerships within 45 days of receiving the FTC order. The FTC “will scrutinize corporate partnerships and investments with AI providers to build a better internal understanding of these relationships and their impact on the competitive landscape,” according to a release Thursday. The orders are focused on three separate multibillion-dollar investments, which are Microsoft’s investment in OpenAI and Amazon and Google’s separate investments in Anthropic. OpenAI and Anthropic are based in San Francisco. [RELATED: These Are The 10 Hottest AI Startups To Watch For 2024] A Google spokesperson said in a statement to CRN that “we hope the FTC’s study will shine a bright light on companies that don’t offer the openness of Google Cloud or have a long history of locking-in customers – and who are bringing that same approach to AI services.” Microsoft, for its part, defended the tech giant’s relationship with OpenAI and said it looks forward to the FTC’s findings. “The U.S. has assumed a global AI leadership position because important American companies are working together,” said Rima Alaily, corporate vice president, competition and market regulation group at Microsoft, in a statement to CRN. “Partnerships between independent companies like Microsoft and OpenAI, as well as among many others, are promoting competition and accelerating innovation. We look forward to providing the FTC with the information it needs to complete its study.” CRN has also reached out to Amazon, Anthropic and OpenAI for comment. One executive from a U.S.-based Amazon Web Services partner, which counts AWS as its largest vendor, said he’s unconcerned that the FTC issue will impact the channel or the three cloud market share leaders’ AI push in general. “Amazon, Microsoft and Google are the biggest companies in the world who are literally yelling into a megaphone everyday, ‘AI this and AI that. We are the AI leaders,’” said the top executive of the AWS partner who declined to be identified. “All those three companies are known—for better or worse—for monopolizing entire industries. Amazon for ecommerce, Google for search and information, everybody uses Microsoft products, etcetera” he said. “So I would say this type of government scrutiny is expected. … I’m not sure what the FTC could find valuable in terms of, if their goal is to find dirty tactics on their partnerships or business transactions.” Regardless of the conclusion of the investigation, the partner executive expects the three tech giants to continue business as usual. “Google just formed a partnership with an AI company, like today,” he said. “The worst that will happen is one of these companies gets a slap on the wrist, in my opinion. I hope it’s not AWS, but I don’t think it will affect us in any way.” FTC Chair Lina Khan, who has gathered a reputation as tough on the tech giants, said in the statement that “history shows that new technologies can create new markets and healthy competition. As companies race to develop and monetize AI, we must guard against tactics that foreclose this opportunity.” “Our study will shed light on whether investments and partnerships pursued by dominant companies risk distorting innovation and undermining fair competition,” Khan said. The information the FTC seeks includes the following, according to the release: The orders and AI investments and partnerships study was approved in a 3-0 vote by the FTC, according to the release. The Wall Street Journal related the FTC investigation into AI to comments Khan made last year on cloud computing giants potentially pursuing anti-competitive behavior against smaller rivals in AI because of the need for immense data and computing power. AWS, Microsoft and Google are often considered No. 1, No. 2 and No. 3 in the cloud market. Microsoft has invested $13 billion into OpenAI since 2019 for the right to 49 percent of future profits, according to the Journal. The FTC was concerned over Microsoft and OpenAI not reporting the transaction in advance and worried that this model could avoid early AI antitrust reviews. OpenAI CEO Sam Altman almost joined Microsoft during his brief ouster in November over his communications with the OpenAI board. OpenAI’s transformation from nonprofit to a nonprofit parent with a for-profit arm has also drawn attention. Anthropic, cofounded by siblings and former OpenAI executives, raised up to $4 billion from Amazon in September. Amazon also received minority ownership. Anthropic raised about $2 billion from Google in October. "
}