{
    "title": "AI Would Improve Productivity And Increase Employee Wellbeing - Microsoft",
    "date": "1/29/2024",
    "url": "https://independent.ng/ai-would-improve-productivity-and-increase-employee-wellbeing-microsoft/",
    "text": "Independent Newspaper Nigeria - Breaking News from Nigeria and the World Blessings NG Drops New Singles, ‘What He Said’ LuckyDChampion Is Making His Mark In Afrobeats Nollywood Producer, Andy Best Dies Lagos Island Councilor Empowers Over 800 Vulnerable Persons Yahaya Bello: Why EFCC Leadership Shouldn’t Subject Commission To Ridicule Withdraw All Court Cases Or Be Expelled, APC Threatens Benue Litigants Next Man Utd Manager: Ten Hag ‘Sack Decision Reached’ Man City Willing To Pay €90 Million To Sign Eberechi Eze Man Utd Contemplating Swoop To Sign Joshua Zirkzee Don Advocates Agricultural Machinery Engineering For Food Security In Nigeria Safeguarding The Source: World Water Day And The Crucial Role Of Home Water Filters 9th Agrofood, Plastprintpack Tradeshow Kicks Off March 26 Several Injured As Russia Targets Kyiv In Missile Attack, Mayor Says Russia Says Arrested Man For Spying For Ukraine Russia Painting Decoy Submarines At Black Sea Ports Amid Mounting Losses—UK Analysts Propose Deployment Of Cutting-Edge Technology, Others As Insecurity,… Cost Of Living Crisis Worsens Why We Revoked Over 4000BDC Operators Licences — CBN Celestial Church Loses Founder’s Daughter, Prophetess Deborah Oshoffa, At 51 How To Make God’s Words Change Your Life Liberation From Leprosy And Other Infectious Diseases  In a bid to debunk widespread myths and misconceptions about Artificial Intelligence (AI) and its applications and how it would take over jobs, Microsoft Corporation has provided insights into how it approaches AI development and ethics. Speaking during a virtual session of Microsoft Africa AI Journalists Academy, organised by the leading global vendor of computer software, Ayanda Ngcebetsha, Director, Data and AI, Microsoft South Africa, and Trusha Vanmali, Business Program Manager, Microsoft South Africa,  who spoke at the AI Journalist Academy, organised by Microsoft, stressed that AI would only improve productivity rather than take over jobs. “The importance of AI tools in summarising reports, carrying out accurate research, imputing language translation and coordinating several meetings in one day, while making the best use of the available time cannot be underestimated,” they explained. The duo noted that although 2023 was the year AI went mainstream, 2024 would be the year in which AI tools would help free up time for more creative and fulfilling cognitive work. Ngcebetsha said that AI was around us, yet invisible, and working aside from us to enhance creativity rather than working against creativity. He said copilot, which is an AI tool, could help content developers in writing, coding, summarising and searching for specific information like charts and tables that would help them develop good reports in less time. According to her, copilot is like a personal assistant that works alongside the user in all sorts of digital applications, helping with things like writing, coding, summarising and searching. It can also help the user to make decisions and understand lots of data. The recent development of large language models made copilots possible, allowing them to comprehend natural human language and provide answers, create content or take action as people work within different computer programs. According to him, Chief Executive Officers (CEOs) are more interested in using AI to increase productivity than to cut headcount. The Microsoft director said that, from the data available to the corporation, reducing headcount was last on the list of what leaders would value from AI. “After ‘increasing productivity’, leaders’ top hopes for AI are to help employees with necessary but repetitive tasks and increase employee wellbeing. “They also want to eliminate employee time spent on low-value activities, enhance employees’ capabilities, and accelerate employees’ pace of work,” he said. According to him, “If we make AI our friend, we will be more productive in what we do and what we know how to do best. AI was about working alongside humans as an everyday companion.” He said that AI could help lift the burden on humans, adding that to date, AI had mostly been on autopilot, but the next-generation copilots would work alongside people. “Organisations that embrace AI will unleash creativity and unlock productivity for everyone, ushering in a new wave of productivity growth and value creation,” he added. Also speaking at the virtual session, Business Programme Manager Trusha Vanmali highlighted the benefits of AI as a copilot, especially to journalists. Vanmali said that AI, as a copilot, had a conversational assistant tool that enhanced creativity and helped with more specific results in search engines. She said that as journalists, AI helped to improve productivity, enhance creativity, and provide the workflow that was needed. The Chairman and Chief Executive Officer of Microsoft, Satya Nadella, described AI, and more specifically, generative AI, as leading the technology charge. He said that 2023 was the year AI went mainstream, but 2024 was the year in which AI tools would help free up time for more creative and fulfilling cognitive work. Speaking recently at Microsoft Ignite 2023, Nadella noted: “We’re about to enter this fascinating new era of AI, where it’s no longer just a novel and fascinating technology. AI, and more specifically generative AI, is leading the technology charge, and as 2024 commences. Justus Adejumoh is an IT / Telecom Reporter who has been covering the ICT sector for over a decade. He is currently the IT / Telecom Editor of Independent Newspapers Limited.  With a knack for the industry’s issues and trends, he has given impetus to the industry through agenda-setting reports, analysis of issues and interfacing with industry stakeholders. A graduate of Nigerian Institute of Journalism (NIJ), he also attended Delta State University, Abraka, Delta State for his first degree and Master from University of Lagos. Also, he has attended several training courses and workshops on media and other fields. They include CNN / MultiChoice Media Training, CSR Training- Pan-Atlantic University (Lagos Business School), and Microsoft Advanced Media Training, among others. He is currently the General Secretary of Nigeria Information Technology Reporters’ Association (NITRA) and a Senior Member of Chartered Institute of Public Diplomacy and Management (CIPDM). Prev Post Benue: Unidentified Lady Killed, Lifeless Body Dumped In Dungeon Next Post Heroic Homecoming: Mammoth Crowd Storm Okene Streets To Welcome Yahaya Bello Comments are closed.  Independent Newspapers Limited, registered on July 17, 2001 (RC No: 419927), commenced publication on October 1, 2001. With registered office at 15b, Daranijo street, off Odusami street, off Wemco road, Ogba, Ikeja, it publishes DAILY INDEPENDENT, Monday - Friday; Saturday Independent, Sunday Independent, independent.ng, TV Independent on YouTube and IndependentNgr (Facebook, Twitter & Instagram). Blessings NG Drops New Singles, ‘What He Said’ LuckyDChampion Is Making His Mark In Afrobeats Nollywood Producer, Andy Best Dies Lagos Island Councilor Empowers Over 800 Vulnerable Persons Yahaya Bello: Why EFCC Leadership Shouldn’t Subject Commission To Ridicule Withdraw All Court Cases Or Be Expelled, APC Threatens Benue Litigants Next Man Utd Manager: Ten Hag ‘Sack Decision Reached’ Man City Willing To Pay €90 Million To Sign Eberechi Eze Man Utd Contemplating Swoop To Sign Joshua Zirkzee Don Advocates Agricultural Machinery Engineering For Food Security In Nigeria Safeguarding The Source: World Water Day And The Crucial Role Of Home Water Filters 9th Agrofood, Plastprintpack Tradeshow Kicks Off March 26 Several Injured As Russia Targets Kyiv In Missile Attack, Mayor Says Russia Says Arrested Man For Spying For Ukraine Russia Painting Decoy Submarines At Black Sea Ports Amid Mounting Losses—UK Analysts Propose Deployment Of Cutting-Edge Technology, Others As Insecurity,… Cost Of Living Crisis Worsens Why We Revoked Over 4000BDC Operators Licences — CBN Celestial Church Loses Founder’s Daughter, Prophetess Deborah Oshoffa, At 51 How To Make God’s Words Change Your Life Liberation From Leprosy And Other Infectious Diseases Blessings NG Drops New Singles, ‘What He Said’ LuckyDChampion Is Making His Mark In Afrobeats Nollywood Producer, Andy Best Dies Lagos Island Councilor Empowers Over 800 Vulnerable Persons Yahaya Bello: Why EFCC Leadership Shouldn’t Subject Commission To Ridicule Withdraw All Court Cases Or Be Expelled, APC Threatens Benue Litigants Next Man Utd Manager: Ten Hag ‘Sack Decision Reached’ Man City Willing To Pay €90 Million To Sign Eberechi Eze Man Utd Contemplating Swoop To Sign Joshua Zirkzee Don Advocates Agricultural Machinery Engineering For Food Security In Nigeria Safeguarding The Source: World Water Day And The Crucial Role Of Home Water Filters 9th Agrofood, Plastprintpack Tradeshow Kicks Off March 26 Several Injured As Russia Targets Kyiv In Missile Attack, Mayor Says Russia Says Arrested Man For Spying For Ukraine Russia Painting Decoy Submarines At Black Sea Ports Amid Mounting Losses—UK Analysts Propose Deployment Of Cutting-Edge Technology, Others As Insecurity,… Cost Of Living Crisis Worsens Why We Revoked Over 4000BDC Operators Licences — CBN Celestial Church Loses Founder’s Daughter, Prophetess Deborah Oshoffa, At 51 How To Make God’s Words Change Your Life Liberation From Leprosy And Other Infectious Diseases Welcome, Login to your account. Recover your password. A password will be e-mailed to you. "
}