{
    "title": "Microsoft adds Copilot AI key to Windows 11 keyboard",
    "date": "1/4/2024",
    "url": "https://finance.yahoo.com/video/microsoft-adding-copilot-ai-key-153022734.html",
    "text": "Microsoft (MSFT) is adding a Copilot key to its Windows 11 PC keyboards, giving users direct access to its AI assistant program. It's Microsoft's first big update to its Windows keyboard in 30 years. Yahoo Finance’s Seana Smith and Madison Mills discuss Microsoft's AI initiatives amid excitement surrounding its partnership with OpenAI. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Eyek Ntekim. SEANA SMITH: Microsoft hitting a Controt-Shift AI on its computer keyboards. The tech giant adding an AI feature called the Copilot key to its windows 11 PCs, which will allow consumers to have text conversations with a virtual assistant. Now, Microsoft calling this the biggest change to its Windows PC keyboard in nearly three decades. We know Microsoft obviously closely linked with their investment in OpenAI has really helped propel the stocks over the last 12 months-- propel shares over the last 12 months. We'll hear a little bit more about this at CES next week. We're expecting to get some demos. We're expecting to get a little bit more info on how exactly this is going to play out and the impact that this is going to have on Microsoft's hardware partners there at CES next week. But clearly, this shows Microsoft further investing in AI, or I should say, incorporating AI into their hardware products and could really set them apart obviously from some of their competitors. MADISON MILLS: Yeah, I wonder if it's the first indication of how hardware and the AI software is gonna come together because we know that the AI powered phones are something that's really heavily anticipated. Is this our first kind of clue of what that might start to look like? It's interesting. Related Quotes "
}