{
    "title": "EU regulators examine Microsoft’s OpenAI investment",
    "date": "1/9/2024",
    "url": "https://www.businesslive.co.za/bd/world/europe/2024-01-09-eu-regulators-examine-microsofts-openai-investment/",
    "text": "Bank governor Lesetja Kganyago is due to announce the latest interest rate decision on Wednesday Central banks should be transparent about their uncertainty and how they make decisions Higher education department says Educor institutions have not submitted financial certificates and annual reports Raid on her home amid allegations she solicited R2.3m is the latest in her brushes with the law The future of Mafube Coal is in jeopardy after the department declined its application Improved confidence among high-income households suggests retail sales volumes may start to recover, the survey shows President looks to more support from government and private secto In 2023, the UK said Chinese spies were targeting British officials in sensitive positions in politics, defence and business The Lions policy of building through backing their youngsters and keeping them together appears to be bearing fruit With each stroke, I am not only reorientating my body but I am also changing my relationship with time Brussels — Microsoft’s financial backing for ChatGPT maker OpenAI may be subject to EU merger rules, EU antitrust regulators said on Tuesday, underscoring a similar warning from its UK peer in December. The US software giant, which committed in 2023 to investing more than $10bn into OpenAI with a nonvoting position on the board, has said it does not own any portion of OpenAI. The European Commission had previously said it was following developments closely. “The European Commission is checking whether Microsoft's investment in OpenAI might be reviewable under the EU Merger Regulation,” the EU executive, which acts as the EU competition enforcer, said in a statement. It said some agreements agreed between large digital market players and generative AI developers and providers were being investigated for their effects on market dynamics. It did not name the companies. On Tuesday, the commission also gave interested parties until March 11 to provide feedback on competition in virtual worlds and generative artificial intelligence. It also sent requests for information to several large digital companies on the two topics. “We are inviting businesses and experts to tell us about any competition issues that they may perceive in these industries, while also closely monitoring AI partnerships to ensure they do not unduly distort market dynamics,” EU antitrust chief Margrethe Vestager said. Reuters Would you like to comment on this article? Sign up (it's quick and free) or sign in now. Please read our Comment Policy before commenting. Published by Arena Holdings and distributed with the Financial Mail on the last Thursday of every month except December and January. Published by Arena Holdings and distributed with the Financial Mail on the last Thursday of every month except December and January. © 2024 Arena Holdings. All rights reserved. Use of this site constitutes acceptance of our Terms & Conditions and Privacy Policy. "
}