{
    "title": "New to Investing? 2 Easy Stocks to Start Building Wealth Today",
    "date": "2/10/2024",
    "url": "https://www.fool.ca/2024/02/10/new-to-investing-2-easy-stocks-to-start-building-wealth-today/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. Microsoft (NASDAQ:MSFT) and another great stock are perfect for new investors. Image source: Getty Images New investors shouldn’t let sudden moves in the stock markets get to their emotions. With such a strong start to the month of February, as tech earnings season injects a bit of euphoria into the hearts of some investors, it’s certainly tempting to chase what’s hot again in the tech scene right now. Indeed, chasing momentum can end in tears, especially if you pay zero attention to the fundamentals. At the end of the day, valuations matter, even in the high-tech world of artificial intelligence (AI) and the so-called metaverse. In 2022, many new investors learned the pitfalls of chasing hot stocks without paying careful attention to the price paid. In this piece, we’ll check out a duo of simple stocks that can help you kickstart your TFSA (Tax-Free Savings Account) wealth-building journey. The following plays, I believe, are terrific to hang onto for years (or, if you have the investment horizon, decades) at a time. Let’s check out the names. Microsoft (NASDAQ:MSFT) is the legendary tech titan that keeps finding new ways to grow its top and bottom line. With plenty of AI innovation going on, it’s no mystery as to why the stock has been scorching hot in the past year, rising nearly 60% over the timespan. Despite the hot AI-driven pop, however, MSFT shares are up only 20% from their 2021 peak. Undoubtedly, when you look at Microsoft through the long-term chart, shares don’t seem all that bubbly when you consider the impressive large language models (LLMs) being built in the background. With CoPilot and a budding partnership with OpenAI, Microsoft is a $3.05 trillion mega-cap that’s likely a must-own for any portfolio aimed at outperforming over the long haul. It’s now the world’s largest company, and it’s thanks in part to generative AI and the incredible stewardship of its chief executive officer (CEO), Satya Nadella. Though the exchange rate isn’t great, Canadian investors may wish to consider watching the stock as a top U.S. AI play after its latest applaud-worthy quarterly result. The numbers were another win for Microsoft. And more could be in the cards in the near future! Of course, it’d be nice to have gotten MSFT stock at a lower multiple (let’s say closer to 25-30 times price-to-earnings). However, I’d argue 37.2 times trailing price to earnings isn’t all too absurd, given its earnings growth prospects. Up next, we have railway giant CP Rail (TSX:CP), which could be nearing a breakout, with shares now going for $112 and change. Indeed, the railroad stock could really benefit as the North American economy gets running back to full speed. I have no idea when it will happen, but it’s less of a concern if you’re going to be in the name for at least five years. The stock goes for 26.6 times trailing price to earnings, with a 0.68% yield. It’s not a low price to pay for a stock that’s not exactly bountiful on the dividend front. Regardless, I like the firm as a (dividend) growth play for the next 10 years and beyond. The rail network looks virtually unmatched following the Kansas City Southern deal — an asset that could pay major dividends for decades to come! This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 24, 2024 |\n        Amy Legate-Wolfe These three stocks have always done well for me and should continue well into the future -- especially with dividends… Read more » March 24, 2024 |\n        Christopher Liew, CFA Resourceful taxpayers will try to find out available tax credits and tax refunds to get their money back in this… Read more » March 24, 2024 |\n        Puja Tayal The market turned bearish on dividend stocks. Now is the time to buy them at their dip and bulletproof your… Read more » March 24, 2024 |\n        Joey Frenette Quebecor (TSX:QBR.B) and another top stock are among my favourite from RBC's latest quant top-40 list. Read more » March 24, 2024 |\n        Amy Legate-Wolfe BCE (TSX:BCE) stock has been cutting and cutting some more, but it needs to add to its already strong arsenal… Read more » March 23, 2024 |\n        Rajiv Nanjapla Given their healthy growth prospects and attractive valuations, these three stocks offer attractive buying opportunities. Read more » March 23, 2024 |\n        Andrew Button If you take CPP at age 70, you may supplement your income with dividend stocks like Brookfield Asset Management (TSX:BAM)… Read more » March 23, 2024 |\n        Rajiv Nanjapla These three high-yielding dividend stocks could boost your passive income. Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. ©  2024 The Motley Fool Canada, ULC. All rights reserved. "
}