{
    "title": "If You Invested $1,000 in Microsoft When It First Declared a Dividend, This \nIs How Much You'd Have Now",
    "date": "2/11/2024",
    "url": "https://www.fool.com/investing/2024/02/11/if-invested-microsoft-first-dividend-how-much-now/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More When a company starts paying a dividend to its shareholders, it is often seen as a signal of confidence that the company is at a stage where it can produce stable and growing earnings and cash flow. But when a tech growth company like Microsoft (MSFT -0.15%) starts paying a dividend, it's often seen as a sign that the high-growth days are over. That's a signal for some that it's time to invest elsewhere. In reality, a dividend is mostly just a signal that management may not see as many investment opportunities, so instead of wasting the money or letting it sit in its coffers, they return funds to shareholders. That should be a signal for investors to get into the stock. When talking about tech companies, particularly software companies, this is the point where their high operating leverage generates more and more revenue every year without a significant increase in operating expenses. So when a tech company starts paying a dividend, it's more often a signal that it's reached \"escape velocity\" so to speak, and that leverage will start producing a lot more free cash flow and earnings well into the future. That's been quite evident in the returns Microsoft has produced since it first declared a dividend in 2003. Image source: Getty Images. Microsoft declared its first dividend for shareholders on Jan. 16, 2003, alongside its second-quarter earnings report for that year. The dividend, paid annually, was $0.16 per share, or just $0.08 per share after the stock split in February of that year. A lot has changed at Microsoft since then. In 2003, Microsoft was generating the bulk of its revenue from sales of the Windows operating system and Office suite. The two combined to account for about 60% of sales in the first six months of fiscal 2003. Its server platform business was focused on providing software tailored toward different enterprise applications. It also had a burgeoning home and entertainment segment bolstered by Xbox. Total revenue in the first six months of fiscal 2003 was $16.3 billion, which resulted in a profit of $5.3 billion and $8.9 billion in cash from operations. Microsoft looks a lot different today. Microsoft's biggest segment these days contains that server platform business. It also added Github, a code repository for software developers. However, the biggest driver of the segment is its Azure cloud computing platform. The product didn't even exist in 2003, but it's become the driving force behind Microsoft's business over the past decade. The segment accounted for over 40% of revenue through the first half of the year, and it's the fastest-growing reporting segment at the company. Meanwhile, Microsoft has seen shifts in its Office business, which is now largely a software-as-a-service subscription business. Windows is lumped in with its devices and gaming segment, which recently added Activision Blizzard to the mix. In the first six months of fiscal 2024 (July to December 2023), Microsoft generated almost $119 billion, resulting in $44 billion in net income and $49 billion in cash from operations. That's a sevenfold increase in sales and an eight-fold increase in net income since 2003. If you bought shares of Microsoft the day after it announced its dividend (since it was announced after the bell), the most you'd pay would be $53 per share. Let's say you bought 19 shares for $1,000. After the stock split in February 2003, you'd have 38 shares. Those 38 shares are now worth about $15,700. But that's just the half of it. Microsoft also paid you a dividend every year. Total dividends received from those 38 shares would amount to $1,067 in that time. That's right, you'd have received more in dividends than your original investment. But if you'd chosen to reinvest those dividends instead, you'd have seen your total investment climb to about $24,800. That's over $8,000 more than if you took your dividends in cash. Microsoft's total return over the last 21 years blew away the S&P 500. $1,000 invested an S&P 500 index fund would've turned into a respectable $8,300, but that's just one-third of what you'd have today by investing in Microsoft.  MSFT Total Return Level data by YCharts Microsoft continues to show strong momentum, producing tons of profit and cash flow for shareholders. It's consistently raised its dividend most years, now paying $3 per share annually. The outlook remains strong, as its investment in OpenAI put it in a leading position in drawing AI developers to its Azure platform. It's one reason shares remain attractive even as they trade around their all-time high. But there's a broader lesson for investors in Microsoft's story. Investing in a tech company when it declares a dividend can be a great idea as the company begins leveraging fixed costs and growing earnings. What's more, it's not an admission that it has no better way to invest cash to grow the company -- see the growth of Azure, the transformation of Office, and the acquisitions of LinkedIn, GitHub, and Activision Blizzard. That should point investors to take a closer look at Meta Platforms (META 0.36%), which just initiated a dividend alongside its fourth-quarter earnings release. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Adam Levy has positions in Meta Platforms and Microsoft. The Motley Fool has positions in and recommends Meta Platforms and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}