{
    "title": "Microsoft says US rivals using generative AI in offensive cyber operations",
    "date": "2/16/2024",
    "url": "https://jamaica-gleaner.com/article/business/20240216/microsoft-says-us-rivals-using-generative-ai-offensive-cyber-operations",
    "text": "BOSTON: MICROSOFT SAID on Wednesday that United States (US) adversaries – chiefly Iran and North Korea and to a lesser extent Russia and China – are beginning to use its generative artificial intelligence (AI) to mount or organise offensive cyber operations. The technology giant and business partner OpenAI said they had jointly detected and disrupted the malicious cyber actors’ use of their AI technologies – shutting down their accounts. In a blog post, Microsoft said the techniques employed were “early-stage” and neither “particularly novel or unique”, but it was important to expose them publicly as US adversaries leverage large-language models to expand their ability to breach networks and conduct influence operations. Cybersecurity firms have long used machine-learning on defence, principally to detect anomalous behaviour in networks. But criminals and offensive hackers use it as well, and the introduction of large-language models led by OpenAI’s ChatGPT upped that game of cat and mouse. Microsoft has invested billions of dollars in OpenAI, and Wednesday’s announcement coincided with its release of a report noting that generative AI is expected to enhance malicious social engineering, leading to more sophisticated deepfakes and voice cloning – a threat to democracy in a year where over 50 countries will conduct elections – magnifying disinformation. Here are some examples Microsoft provided. In each case, it said, all generative AI accounts and assets of the named groups were disabled: — The North Korean cyber espionage group known as Kimsuky has used the models to research foreign think tanks that study the country, and to generate content likely to be used in spear-phishing hacking campaigns. — Iran’s Revolutionary Guard has used large-language models (LLM) to assist in social engineering, in troubleshooting software errors, and even in studying how intruders might evade detection in a compromised network. That includes generating phishing emails, “including one pretending to come from an international development agency and another attempting to lure prominent feminists to an attacker-built website on feminism”. The AI helps accelerate and boost the email production. — The Russian GRU military intelligence unit known as Fancy Bear has used the models to research satellite and radar technologies that may relate to the war in Ukraine. — The Chinese cyber espionage group known as Aquatic Panda – which targets a broad range of industries, higher education, and governments from France to Malaysia – has interacted with the models “in ways that suggest a limited exploration of how LLMs can augment their technical operations”. — The Chinese group Maverick Panda, which has targeted US defence contractors among other sectors for more than a decade, had interactions with LLMs, suggesting it was evaluating their effectiveness as a source of information “on potentially sensitive topics, high-profile individuals, regional geopolitics, US influence, and internal affairs”. In a separate blog published on Wednesday, OpenAI said its current GPT-4 model chatbot offers “only limited, incremental capabilities for malicious cybersecurity tasks beyond what is already achievable with publicly available, non-AI powered tools”. Cybersecurity researchers expect that to change. Last April, the director of the US Cybersecurity and Infrastructure Security Agency, Jen Easterly, told Congress that “there are two epoch-defining threats and challenges. One is China, and the other is artificial intelligence”. Easterly said at the time that the US needs to ensure AI is built with security in mind. Critics of the public release of ChatGPT in November 2022 – and subsequent releases by competitors, including Google and Meta – contend it was irresponsibly hasty, considering security was largely an afterthought in their development. “Of course, bad actors are using large-language models – that decision was made when Pandora’s box was opened,” said Amit Yoran, CEO of the cybersecurity firm Tenable. Some cybersecurity professionals complain about Microsoft’s creation and hawking of tools to address vulnerabilities in LLMs models, when it might more responsibly focus on making them more secure. “Why not create more secure black-box LLM foundation models, instead of selling defensive tools for a problem they are helping to create?” asked Gary McGraw, a computer security veteran and co-founder of the Berryville Institute of Machine Learning. NYU professor and former AT&T Chief Security Officer Edward Amoroso said that while the use of AI and LLMs may not pose an immediately obvious threat, they “will eventually become one of the most powerful weapons in every nation-state military’s offence”. AP View the discussion thread. "
}