{
    "title": "Microsoft to provide AI skilling opportunities to 2 million people in India \nby 2025 - Microsoft Stories India",
    "date": "2/7/2024",
    "url": "https://news.microsoft.com/en-in/microsoft-to-provide-ai-skilling-opportunities-to-2-million-people-in-india-by-2025/",
    "text": "February 7, 2024\t\t\t\n\t\t\t | Microsoft Source Mumbai, February 7, 2024: Today, Microsoft unveiled a significant skilling initiative in India, aiming to equip 2 million people with AI skills by 2025. The ADVANTA(I)GE INDIA initiative is part of Microsoft’s Skills for Jobs program, which is designed to empower India’s workforce with future-ready skills. The initiative is part of Microsoft’s broader commitment to accelerate India’s AI transformation. The skilling initiative is aligned with the company’s responsible AI principles, and training will be delivered in partnership with governments, nonprofit and corporate organizations, and communities. According to Microsoft’s recent Work Trend Index, 90 percent of Indian leaders say the people they hire will need new skills to prepare them for the growth of AI. Furthermore, 78 percent of Indian workers say they don’t have the right AI capabilities to complete their current work. To address this needs gap, ADVANTA(I)GE INDIA will focus on training individuals in Tier 2 and Tier 3 cities, as well as rural areas, enabling people to participate in the new era of AI and unlock inclusive socio-economic progress. “In the years ahead, AI innovation will play a pivotal role in shaping our future, and we at the Directorate General of Training, Ministry of Skill Development & Entrepreneurship, stay dedicated to realizing the potential of the AI era for India, in partnership with Microsoft and others,” said Smt. Trishaljit Sethi, Director General (Training), Ministry of Skill Development & Entrepreneurship. “This commitment involves equipping the youth with skills through training in tools that redefine how people work, connect, address real-world challenges, and live. Our institutions like ITIs, NSTIs, and our skilling platform are driving the skilling mission for the youth. Our commitment extends to advancing India’s digital future by empowering a substantial workforce across the length and breadth of the country, ensuring that key sectors in India become AI-first and AI-ready.” “The ADVANTA(I)GE INDIA initiative is a significant step towards democratizing access to AI skills across the nation and reflects Microsoft’s deep commitment to enabling inclusive growth with technology,” said Puneet Chandok, president of Microsoft India & South Asia. “India has a huge opportunity to be a global leader in AI, and creating AI fluency at scale is a critical step in that journey. This initiative aims to propel India into a promising era of AI fluency, empowering citizens across India with the right skills to thrive in the age of AI.” Ameya Vanjari, COO, Tata STRIVE, said, “Given the rising need for professionals in AI and security skills and the shortage of skilled talent especially in AI domain, building a diverse and inclusive talent pool is an imperative for organizations. Tata Strive is glad to partner with Microsoft in this skilling journey, training students and connecting them to job opportunities or internships, enabling growth opportunities for young women and girls. We are excited to help strengthen the ecosystem through sustained skilling efforts to bridge the skills gap, providing organizations with industry-ready talent.” The ADVANTA(I)GE INDIA initiative will focus on three key areas to create AI fluency – Equipping India’s future workforce, upskilling government officials in AI and working to build the AI capability of nonprofit organizations. Training the future workforce to harness AI’s potential To deliver ADVANTA(I)GE INDIA, Microsoft will partner with India’s Ministry of Skill Development and Entrepreneurship and 10 state governments to provide basic and advanced training in AI to 500,000 students and job seekers in 100 rural vocational education institutions and training centers. This will expand on Microsoft’s existing collaboration with the ministry to train young people in digital and cybersecurity skills. In addition, Microsoft will provide in-depth AI technical skills training for 100,000 young women through 5,000 trainers at higher education institutions in Tier 2 and Tier 3 cities. This will be achieved by making Microsoft’s AI Trainer Toolkit Guide available for trainers and strengthening skilling programs for women in cloud, AI, and cybersecurity with AI credentials. Microsoft will also provide access to Azure AI services to build tech solutions, and foster industry collaborations for mentorship, internships, and jobs. As part of the initiative, Microsoft will raise awareness of responsible AI use and AI-enabled careers for 400,000 students in schools in remote and tribal regions, enabling them to be next-generation AI innovators. This will be achieved by piloting three of Microsoft’s global initiatives: Technology Education and Literacy in Schools (TEALS), Farm Beats for Students, and the AI Guidance for Schools Toolkit for teachers. Strengthening the AI capability of government officers to deliver next-generation citizen services Microsoft will strengthen its partnership with India’s National Programme for Civil Services Capacity Building, equipping 250,000 government officers with essential knowledge of generative AI and increasing their AI fluency. This partnership will help enhance the productivity of government officers and transform digital governance in rural India. It will also build capabilities for investments in the next generation of AI-enabled citizen services, meeting citizens where they are located. Enabling nonprofit organizations to accelerate their AI transformation and maximize social impact Building on the Generative AI Skills Challenge, Microsoft and LinkedIn will convene India Nonprofit Leaders Summit in April 2024. The summit will enable 2,500 nonprofits and nongovernment organizations to leverage AI skilling resources and technologies to further train 750,000 learners – including underserved youths, young women, and jobseekers – in AI fluency and technical skills. Microsoft will also provide nonprofits in India with access to the Microsoft Resources Hub and the LinkedIn for Nonprofits Resource Hub to help maximize their social impact and lead change in the AI era. Over the past three years, Microsoft has provided more than 5,000 nonprofits in India with relevant, affordable, and innovative cloud and technology solutions. It has also helped more than 20,000 nonprofit employees use technology to accelerate their mission. Click here to learn more about Satya Nadella’s visit and how Microsoft is empowering organizations in India with AI. About Microsoft India Microsoft (Nasdaq: MSFT; @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more. Microsoft set up its India operations in 1990. Today, Microsoft entities in India have over 23,000 employees engaged in sales and marketing, research, development, customer support, and industry solutions across 10 Indian cities – Ahmedabad, Bengaluru, Chennai, New Delhi, Gurugram, Hyderabad, Kolkata, Mumbai, Noida, and Pune. Microsoft offers its global cloud services from local datacenters to accelerate digital transformation across Indian startups, businesses, and government organizations. Follow us: Share this page: "
}