{
    "title": "Microsoft Copilot Studio Enables AI-Driven Conversational Interfaces for \nBusiness Applications",
    "date": "2/12/2024",
    "url": "https://www.infoq.com/news/2024/02/copilot-studio-powerva-available/",
    "text": "A monthly overview of things you need to know as an architect or aspiring architects. View an example  We protect your privacy. InfoQ Dev Summit Munich (Sep 26-27): Learn practical strategies to clarify critical development priorities. \n\n                            Register Now Facilitating the Spread of Knowledge and Innovation in Professional Software Development   Back to login  Back to login Starting your first project with Spring Boot can be a bit \u2028daunting given the vast options that it provides. This updated version of the book \u2028will guide you step by step along the way to be a Spring Boot \u2028hero in no time. Cellular architecture is a design pattern that helps achieve high availability in multi-tenant applications. The goal is to design your application so that you can deploy all of its components into an isolated \"cell\" that is fully self-sufficient. It can benefit your customers regarding availability and ensure you hit your SLAs. Joran Greef discusses TigerBeetle, a new database, and why OLTP has a growing impedance mismatch, why the OLTP workload is becoming more contentious, why row locks, why storage faults, write stalls, and why non-determinism is now a problem. In this podcast Shane Hastie, Lead Editor for Culture & Methods spoke to Joyce Tompsett about the 17th State of agile report. The panelists discuss the human and technical dimensions of platform engineering, sharing insights into establishing, implementing, and sustaining successful platform engineering programs. Discover new ideas and insights from senior practitioners driving change in software. Attend in-person. Discover transformative insights to level up your software development decisions. Register now with early bird tickets. Get practical advice from senior developers to navigate your current dev challenges. Register now with early bird tickets. Level up your software skills by uncovering the emerging trends you should focus on. Register now. InfoQ Homepage\nNews\nMicrosoft Copilot Studio Enables AI-Driven Conversational Interfaces for Business Applications This item in\n\t\t\t\t\t\n\n\t\t\t\t\t\tjapanese Feb 12, 2024\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t4\n\t\t\t\t\t\t\t\t\tmin read by Bruno Couriol Microsoft recently announced the low-code tool Microsoft Copilot Studio at Ignite 2023. Copilot Studio users can both build standalone copilots and customize Microsoft Copilot for Microsoft 365 — thus using AI-driven conversational capabilities for ad-hoc enterprise use cases. Copilot Studio is an end-to-end conversational AI platform that empowers IT professionals and makers to create and customize copilots using natural language or a graphical interface. Copilot Studio users can design, test, and publish copilots that can later be leveraged within a Microsoft 365 context or for custom enterprise purposes.  Standalone copilots are applications that address users’ natural language queries through a conversational interface. Besides handling the dialog with the user, copilots may need to retrieve information from authorized databases or execute actions on behalf of the user on external systems. Copilot Studio uses the same authoring canvas as Microsoft Power Virtual Agent which it supersedes.  Makers implement conversational dialogs as a tree of nodes, each node representing an action (e.g., displaying information to the user, prompting the user with a question, calling an API, running a Power Automate flow). Part (or all) of a dialog tree can be constituted into topics. Oftentimes, a topic has a set of trigger phrases— phrases, keywords, and questions that end users are likely to use to express needs handled by the topic.  The Copilot Studio AI analyzes an end user’s natural language input and assign a confidence score to each configured topic. The topic confidence score reflects how close the user input is to the topic’s trigger phrases. In case of several topics with a confidence score above a confidence threshold (e.g., 85%), the end user may be asked to select the topic that applies (disambiguation mechanism). If only one topic clears the confidence threshold, the dialog for that topic is executed immediately. Microsoft Copilot Studio can also delegate the natural language understanding to Azure AI Language Studio’s suite of tools. Makers can use the generative capabilities of large language models inside topic dialogs. Gary Pretty, principal product manager at Microsoft, demonstrated how a prospective customer of Holland America Line could query a standalone bot for information on a cruise (e.g., “Do I need a passport for my cruise?”). A maker would create that bot with just a few clicks simply by referencing www.hollandamerica.com as a key source of information. The bot would pass the end user input on to a generative model that would use the referenced content to answer the query (e.g., “Yes, you will need a passport for your cruise […]”). The conversation continues with the bot keeping track of the context and conversation history so the user can implicitly or explicitly reference past information. This use case corresponds to what has been seen extensively with generative models like ChatGPT. However, this time the bot answer is grounded in the referenced content. Such grounding may help reduce erroneous answers from the bot. Copilots can also provide a natural language interface to an application programming interface, for example, pretty detailed tasks such as the “Get Excursions” topics in which the bots asks a user whether he has an existing booking. The user subsequently provides a booking number. After that, the bot calls the relevant API (through Power Automate) and displays its results. Goal-oriented applications may however require an amount of domain-specific handcrafting that correlates with the goal complexity (e.g., number of steps, conditions and branches, management of errors and edge cases). David Conger, principal product manager at Microsoft, provided at Ignite 2023 an example of complex orchestration of APIs to achieve users’ goals. Microsoft 365 Copilot can create Power Point presentations from a text document and subsequently modify that document on command. Conger explained that to ensure the correct identification of steps to go through, the safe execution of identified actions, and to recover from errors, Microsoft resorted to a domain-specific language for Office (ODSL) that would be LLM-friendly. Microsoft 365 Copilot dynamically constructs a prompt within the token limit with relevant information to help the LLMs produce the correct ODSL program. The ODSL program is then parsed, validated — with automatic code correction, and transpiled to native Office APIs, which are then executed. Arguably, many enterprise use cases will be far simpler and fit a no-code approach. Generative AI coupled with no-code authoring tools make for attractive demos for the simplest use cases. However, technology buyers may want to relate the licensing, configuration, and no-code development costs attached to the technology with concrete and valuable use cases for their specific entreprise. Copilots can be distributed through miscellaneous channels, including Microsoft Teams, a website, or even Skype. Microsoft Copilot for Microsoft 365 can additionally leverage copilots created with Copilot Studio. Makers can also use multilingual copilots, which can communicate with customers in different languages while keeping all the content in a single copilot. In many cases, such copilots can automatically detect the desired language based on the user’s web browser setting and respond in the same language. Capabilities of Microsoft Power Virtual Agents (also known as Power VA) are fully included in Microsoft Copilot Studio. Copilot Studio integrates with Microsoft Azure OpenAI Studio, Azure Cognitive Services, Azure Bot Service, and other Microsoft conversational AI technologies. Copilot Studio’s integration with Copilot for Microsoft 365 is now available in public preview.    Get expert guidance on building intelligent apps on Microsoft Azure. Learn more. A round-up of last week’s content on InfoQ sent out every Tuesday. Join a community of over 250,000 senior developers.\r\n        \r\n\t\t\tView an example  We protect your privacy. A round-up of last week’s content on InfoQ sent out every Tuesday. Join a community of over 250,000 senior developers.\n\t\t\n\t\t\tView an example  We protect your privacy. June 24 - 25, 2024Actionable insights to clarify today's critical dev priorities.InfoQ Dev Summit Boston, is a two-day conference hosted by InfoQ, focusing on the most critical technical decisions senior software developers face today.\n                Deep-dive into 20+ technical talks and get transformative learnings from senior software developers navigating Generative AI, security, modern web applications, and more.Register Now InfoQ.com and all content copyright © 2006-2024 C4Media Inc.\nPrivacy Notice, Terms And Conditions, Cookie Policy "
}