{
    "title": "Will Microsoft Disable Your Computer If You Share Fake News?!",
    "date": "2/4/2024",
    "url": "https://www.techarp.com/facts/microsoft-disable-computer-facts/",
    "text": "Is Microsoft planning to disable your computer if you post or share fake news / misinformation?! Take a look at the viral claim, and find out what the facts really are!  People are sharing an article (archive) by The People’s Voice (formerly NewsPunch), which claims that Microsoft is planning to disable your computer if you post or share fake news / misinformation! Microsoft To Disable Computers of Users Who Share ‘Non-Mainstream Content’ Online Microsoft has announced plans to disable the computers of people who share ‘non-mainstream’ content online, in an attempt to combat so-called ‘misinformation’ in the run-up to the 2024 election. During an interview with NBC’s Lester Holt, Microsoft CEO Satya Nadella was questioned about how AI might either assist or endanger the future election. Reclaimthenet.org reports: However, Nadella’s response seemed to imply a willingness to use technology for censoring content in pursuit of fighting what he identified as disinformation. Nadella stated, “This is not the first election where we dealt with disinformation or propaganda campaigns by adversaries and election interference. “We’re doing all the work across the tech industry around watermarking, detecting deep fakes and content IDs. There is going to be enough and more technology quite frankly in order to be able to identify the issues around disinformation and misinformation.” Recommended : Is Interpol Investigating Bill Gates For Murder?!   This is yet another example of FAKE NEWS created / promoted by The People’s Voice, and here are the reasons why… Fact #1 : Microsoft Did Not Announce Plans To Disable Computers Let me start by pointing out that Microsoft did not announce any plans to disable computers of people who share “non-mainstream” content online, in an attempt to combat “misinformation” in the run-up to the 2024 US Presidential election. If Microsoft actually announced such plans, it would have been major news covered by news outlets all over the world. It would also have gone viral on social media, with conservative and right-wing personalities criticising those plans. Microsoft certainly made no such announcement, and The People’s Voice offered no evidence to back up its “fact checked” claim. Fact #2 : Satya Nadella Is Microsoft CEO, Not Bill Gates Interestingly, The People’s Voice article used a photo of Bill Gates, even though he handed over day-to-day operations at Microsoft more than 15 years ago. He also stepped down as Microsoft Chairman, when Satya Nadella was appointed as CEO in February 2014. If Microsoft does indeed plan to disable computers to fight fake news, that decision would have to be approved by its CEO and Chairman, Satya Nadella. Not its former founder, Bill Gates. How is Bill Gates involved in this “story”? Nothing in the article even remotely suggests that Bill Gates is, in any way, involved in Microsoft affairs, or the non-existent plan to disable computers of people who share fake news / misinformation. Recommended : Is Bill Gates Planning To Kill Billions Using Turbo AIDS?!  Fact #3 : Satya Nadella Never Said Anything About Disabling Computers The People’s Voice article used a video of Lester Holt from NBC News interviewing Satya Nadella as evidence that Microsoft plans to disable computers of people who share misinformation. However, that’s completely nonsensical. The NBC News video only shows Satya Nadella saying that the tech industry is using technological solutions like watermarking [AI created content], detecting deep fakes, and implementing content IDs, to fight disinformation and misinformation. This is not the first election where we dealt with disinformation or propaganda campaigns by adversaries and election interference. We’re doing all the work across the tech industry around watermarking, detecting deep fakes and content IDs. There is going to be enough and more technology quite frankly in order to be able to identify the issues around disinformation and misinformation. Fact #4 : Microsoft Can’t “Magically” Disable Computers Remotely Even if Microsoft is so inclined, disabling a computer remotely isn’t like waving a magic wand, or chanting “Abracadabra”! With the possible exception of specifically hacking into your computer to gain access, or tricking you into installing malware, it is not possible for Microsoft to remotely disable your computer simply because you shared fake news or misinformation. The People’s Voice article certainly offered no explanation of how Microsoft might conceivably disable your computer remotely… like magic! Recommended : Is Bill Gates Facing Life Behind Bars For Child Rape?!  Fact #5 : The People’s Voice Is Known For Publishing Fake News The People’s Voice is the current name for NewsPunch, which possibly changed its name because its brand has been so thoroughly discredited after posting numerous shocking but fake stories. Founded as Your News Wire in 2014, it was rebranded as NewsPunch in November 2018, before becoming The People’s Voice. A 2017 BuzzFeed report identified NewsPunch as the second-largest source of popular fake news on Facebook that year. Its articles have been regularly debunked as fake news, so you should never share anything from NewsPunch / The People’s Voice.  Here are some of its fake stories that I fact checked earlier: Please help us FIGHT FAKE NEWS by sharing this fact check article out, and please SUPPORT our work!  Support my work through a bank transfer /  PayPal / credit card! Name : Adrian Wong\nBank Transfer : CIMB 7064555917 (Swift Code : CIBBMYKL)\nCredit Card / Paypal : https://paypal.me/techarp Dr. Adrian Wong has been writing about tech and science since 1997, even publishing a book with Prentice Hall called Breaking Through The BIOS Barrier (ISBN 978-0131455368) while in medical school. He continues to devote countless hours every day writing about tech, medicine and science, in his pursuit of facts in a post-truth world.  Recommended Reading Go Back To > Fact Check | Cybersecurity | Tech ARP  Support Tech ARP! Please support us by visiting our sponsors, participating in the Tech ARP Forums, or donating to our fund. Thank you!  "
}