{
    "title": "Microsoft co-founder Bill Gates visits Maa Mangla Basti in Odisha's \nBhubaneswar | Watch | Mint",
    "date": "2/28/2024",
    "url": "https://www.livemint.com/news/india/microsoft-co-founder-bill-gates-visits-maa-mangla-basti-in-odishas-bhubaneswar-watch-11709094556232.html",
    "text": "Microsoft co-founder and philanthropist Bill Gates on Wednesday visited the Maa Mangla Basti in Bhubaneswar in Odisha. Gates arrived in the Odisha capital on Tuesday night. On Wednesday, Gates is scheduled to attend several programmes, including one with focus on use of artificial intelligence for farmers. On his visit, the Microsoft co-founder will meet Chief Minister Naveen Patnaik, and attend other functions related to the ‘Jaga Mission’ (scheme for development of slums), the ‘Mukta’ scheme (localised employment opportunities for the urban poor) and ‘Mission Shakti’, officials said. Since 2017, Odisha government’s Department of Agriculture and Farmer Empowerment and the Fisheries and Animal Resource Department have collaborated with the Bill and Melinda Gates Foundation for innovation in data-driven decision-making, they said. Earlier on February 25, in his blog 'Gate Notes', Gates mentioned that he will be visiting a low-income community in Odisha where a government programme is helping women get the skills to fulfil government construction contracts. “Since 2018, this programme has helped 22,000 groups of women deliver on more than 52,000 projects including building roads, drains, and toilets,\" he wrote. Sharing his admiration for India’s innovative spirit, especially digital public infrastructure, or DPI, Gates said that during his trip, he will get to see India’s DPI in action. \"I’ll visit an agricultural monitoring center in the state of Odisha where government officials use DPI to give farmers real-time guidance. Thanks to Aadhaar, this center is able to maintain a registry of 7.5 million farmers—even if they don’t own land—and their crops, so officials can keep track of who is growing what (and, therefore, what kind of farming advice they need). It has also developed a chatbot that makes it easy for farmers to get the latest information about their crops, using AI to tailor content to their particular needs and in their local language,\" he added. 'India’s greatest gift is its ability to innovate'Bill Gates, in his blog, said that India’s most important contributions to the world is its ability to innovate. \"India’s greatest gift is its ability to innovate. This country has a long history of important breakthroughs. (Mathematicians in ancient India are widely credited with introducing the decimal system for numbers.) More recently, India has made advances that are saving and improving millions of lives in India and around the world.\"\n   Gates will also meet Prime Minister Narendra Modi during his visit to India and said that their main topic of discussion would be to learn how the Bill & Melinda Gates Foundation, can continue to help India with its ideas.\n   \"The Gates Foundation has been a partner in some of these efforts, and I’m visiting this week to learn about how we can continue working with India to help its ideas and inventions reach everyone who needs them, no matter where they live. This will be a main topic when I meet with Prime Minister Modi this week,\" he wrote.\n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Is corruption but an excuse to wipe out opposition?          ‘Innovation will be key differentiator in SaaS’          Mint Primer | Happiness report: Why it has raised eyebrows in India          For private InvITs, a new asset category is about to open up          How celebrity brands finally reach the point of sale          DLAI, FACE rally for fintech self-regulation amid regulatory scrutiny          A 140-year-old policy puts its stamp on postal department’s life insurance biz          Mint Explainer: What falling total fertility rate will mean for India          No silver lining for buyers in this India-UAE treaty          Mint Primer | Mind the income gap: Is India becoming a plutocracy?       Explore Premium  \n\n\n                Catch all the Business News, Market News, Breaking News Events and Latest News Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates.\n    \nMore\nLess\n \n\t\tPublished: 28 Feb 2024, 10:36 AM IST\n\t\nTopics You May Be Interested In \n bill gates news \n bill gates in odisha \n odisha \n odisha mata mangla basti \n bill & melinda gates \n naveen pattnaik Bill Gates, in his blog, said that India’s most important contributions to the world is its ability to innovate. \"India’s greatest gift is its ability to innovate. This country has a long history of important breakthroughs. (Mathematicians in ancient India are widely credited with introducing the decimal system for numbers.) More recently, India has made advances that are saving and improving millions of lives in India and around the world.\" Gates will also meet Prime Minister Narendra Modi during his visit to India and said that their main topic of discussion would be to learn how the Bill & Melinda Gates Foundation, can continue to help India with its ideas. \"The Gates Foundation has been a partner in some of these efforts, and I’m visiting this week to learn about how we can continue working with India to help its ideas and inventions reach everyone who needs them, no matter where they live. This will be a main topic when I meet with Prime Minister Modi this week,\" he wrote. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}