{
    "title": "Microsoft to Invest $2.1B in Spain Amid AI & Could Expansion",
    "date": "2/22/2024",
    "url": "https://www.cryptotimes.io/2024/02/21/microsoft-to-invest-2-1b-in-spain-amid-ai-could-expansion/",
    "text": "Microsoft has revealed that it will invest up to $2.1 billion in AI and cloud computing during the next two years to substantially enhance its presence in the Spanish market. This deal is one of the go-ahead measures the tech giant has taken to bring forth AI innovation progress and a globally robust cloud infrastructure. During a talk in Madrid, Microsoft Vice Chair and President Brad Smith stated that this money would be used to build new cloud data centers in Spain and to enhance its in-country cloud services, making it possible for all companies, regardless of their size, to take advantage of improved artificial intelligence tools. The new buildings will use entirely renewable energy. I’m thrilled to announce that we will expand our AI and cloud infrastructure in Spain by $2.1B USD in the next two years. Our investment is beyond just building data centers, it’s a testament to our 37-year commitment to Spain, its security, and development and digital… https://t.co/arJnZzyDpc “Our investment is beyond just building data centers. It’s a testament to our 37-year commitment to Spain, its security, and development and digital transformation of its government, businesses, and people,” said Smith. The expansion builds on Microsoft’s long-running presence in Spain and will further position the country as a strategic hub for cloud and AI innovation in Europe. It follows the company’s recent commitment to invest $3.45 billion over three years in Germany, focusing on advancing sustainability and skilling initiatives domestically. Spain’s Prime Minister Pedro Sánchez welcomed Microsoft’s plans, saying, “This new investment is proof, one more time, of the confidence foreign companies have in Spain.” He added that the country has become “a point of reference for innovation, for artificial intelligence development.” The $2.1 billion investment is expected to create new high-skilled jobs locally, enabling Spanish innovators and businesses to tap into the latest advancements in cloud computing and data-driven technologies. Also Read: Aptos Labs Advances Web3 with Microsoft Azure OpenAI Service Subscribe to our newsletter to get our newest articles instantly! Email address:  Bitcoin NewsEthereum NewsAltcoin NewsDeFi NewsMarket NewsNFT NewsBlockchain NewsAI News EditorialPress ReleaseWrite for us About UsContact UsCareerEditorial Policy "
}