{
    "title": "Microsoft to discuss the future of Xbox exclusives at an event on Thursday",
    "date": "2/13/2024",
    "url": "https://mspoweruser.com/microsoft-to-discuss-the-future-of-xbox-exclusives-at-an-event-on-thursday/",
    "text": "Follow us Share this article Latest news 2 min. read Published on February 13, 2024 published on \n\nFebruary 13, 2024 Share this article Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft Gaming has scheduled a business update event on Thursday, February 15th, at 12 PM PT / 3 PM ET, generating anticipation within the gaming community. The event, delivered as an official Xbox Podcast video on YouTube, will feature key figures such as Microsoft Gaming CEO Phil Spencer, Xbox President Sarah Bond, and Head of Xbox Studios Matt Booty. The event may reveal Microsoft’s plans for Xbox exclusives on other platforms. For weeks, speculation has swirled around the fate of several popular Xbox titles, including Hi-Fi Rush, Sea of Thieves, and Bethesda games like Starfield and the upcoming Indiana Jones. Please join us for a special edition of the Official Xbox Podcast.Hear from Phil Spencer, Sarah Bond and Matt Booty as they share updates on the Xbox business. pic.twitter.com/TxwWJVUbgx Microsoft’s upcoming business update event is an opportunity to clarify the future vision for Xbox. The implications for platform exclusivity are noteworthy, given the shift towards multi-platform releases in the gaming industry. Microsoft’s stance on exclusivity has been a subject of ongoing debate, and the upcoming event might offer definitive answers and insights into the company’s strategic direction. Beyond mere speculation, Microsoft’s recent actions point towards an evolving approach to content exclusivity. In August 2023, Microsoft signed a binding agreement with Sony to ensure Call of Duty remains available on PlayStation platforms for the next ten years. The move hinted at sharing game titles across platforms, indicating more such arrangements at the upcoming event. However, it’s crucial to note that Microsoft has also reiterated its commitment to providing compelling exclusive experiences for Xbox players, as evidenced by the recent acquisition of studios like Arkane Austin and MachineGames. Overall, Xbox’s upcoming business update event is important for its future and relationship with the gaming community. Microsoft has not disclosed its agenda, but attendees can expect strategic insights regarding exclusives, platform availability, and the overall vision for the Xbox ecosystem. The event will offer clarity and direction for Xbox players and shape their expectations for the platform’s future. More about the topics: xbox Devesh Beri Tech Journalist These are the things that motivate me - creating informative and helpful content, pursuing my passion for motorsports and music, engaging in expeditions, maintaining a healthy lifestyle, and spending time with my adorable cat Taco. Devesh Beri Tech Journalist Devesh is our tech journalist. His main mission is to break and break down the complex jargon-y tech news for MSPowerUser readers. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}