{
    "title": "Elon Musk sues OpenAi and Altman: \"They made the company a subsidiary of \nMicrosoft\"",
    "date": "3/1/2024",
    "url": "https://www.breakinglatest.news/technology/elon-musk-sues-openai-and-altman-they-made-the-company-a-subsidiary-of-microsoft/",
    "text": " Elon Musk is suing OpenAI and its CEO Sam Altman. According to Musk, the ChatGPT maker’s multibillion-dollar alliance with Microsoft has compromised the startup’s original mission to build artificial intelligence systems for the benefit of humanity. And non-profit. Musk was among the first financiers of OpenAi and until 2018 a member of the Board of Directors. “OpenAI, Inc. has been transformed into a de facto closed-source subsidiary of the largest technology company in the world: Microsoft,” Musk’s lawyers wrote in a document filed Thursday in a San Francisco court. The choice to accept Microsoft’s investments, Musk’s lawyers argue, would have effectively distorted the company’s nature. Bringing it into the hands of an IT giant who would secret its projects. The lawyers claim that the company has kept “absolute secrecy” about the design of the GPT-4, its most advanced artificial intelligence model. Musk co-founded OpenAI in 2015, but resigned from its board of directors six years ago. Today he leads the electric vehicle manufacturer Tesla and the rocket manufacturer SpaceX and purchased Twitter for 44 billion dollars in October 2022. Many believe that the basis of his departure from OpenAi are disagreements with Sam Altman, linked above all to the fact that the second would have denied him a leadership role in society. Musk launched his own generative artificial intelligence project a year ago: Grok. OpenAI is planning to appoint several new board members in March, the Washington Post reported Thursday. ChatGPT, OpenAI’s chatbot, became the world‘s fastest-growing software application within six months of its launch in November 2022. It was the program that effectively kicked off a frantic race in Generative Artificial Intelligence, causing many companies to accelerate their projects. Meta, Google and Microsoft themselves published their large-scale linguistic systems in the following months. Subjects     Save my name, email, and website in this browser for the next time I comment.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More "
}