{
    "title": "Microsoft touts AI strength, but shares dip as market digests costs",
    "date": "1/30/2024",
    "url": "https://www.xm.com/fr/research/markets/allNews/reuters/microsoft-touts-ai-strength-but-shares-dip-as-market-digests-costs-53751648",
    "text": "7 classes d’actifs - 10+ plateformes de trading - Plus de 1000 instruments Marre d’avoir encore raté un séminaire ? Nous vous présentons la formation en direct XM. Voir. \n LIVE Ce site internet est exploité par XM Global (FSC). Accédez instantanément aux marchés mondiaux grâce aux plateformes de trading XM MT4 ou MT5. Commencez à trader les instruments de votre choix sur XM MT4 et MT5, disponibles pour PC et Mac. Sinon, vous pouvez également essayer le XM WebTrader, accessible instantanément depuis votre navigateur. De plus, nos plateformes complètes pour les appareils mobiles, compatibles avec MT4 comme avec MT5, vous faciliteront l’accès aux marchés et vous permettront de trader sur votre compte à partir de votre smartphone ou de votre tablette. Vous pouvez choisir dans la liste votre plateforme mobile ou bureau favorite. Avertissement sur les risques : le trading des produits à marge implique un niveau de risque élevé. Accédez instantanément aux marchés mondiaux grâce aux plateformes de trading XM MT4 ou MT5. Notre centre de recherche et de formation propose des mises à jour quotidiennes sur les plus importantes sessions des bourses, avec de nombreux points quotidiens sur tous les événements financiers critiques qui façonnent chaque jour les marchés mondiaux. Avec 20 professionnels des marchés plurilingues, nous avous offrons une base de connaissances pour former nos clients et leur donner des avantages concurrentiels compétitfs. Avertissement sur les risques : le trading des produits à marge implique un niveau de risque élevé. Accédez instantanément aux marchés mondiaux grâce aux plateformes de trading XM MT4 ou MT5. XM a des normes élevées de qualité pour ses services. Nous croyons que les services financiers polyvalents exigent de la polyvalence dans la pensée et une politique unifiée de principes commerciaux. Notre mission est de suivre le rythme des demandes du marché mondial et d'aborder les objectifs d'investissement de nos clients avec un esprit ouvert. Avertissement sur les risques : le trading des produits à marge implique un niveau de risque élevé. Accédez instantanément aux marchés mondiaux grâce aux plateformes de trading XM MT4 ou MT5. Choisissez comment vous souhaitez obtenir de l’aide. Chat en direct En utilisant notre chat en direct, vous acceptez que toutes les données personnelles fournies via le chat en direct soient traitées par nous, conformément à notre politique de confidentialité, afin d’obtenir de l’aide de la part de notre équipe expérience client. Viber Scannez le code QR ci-dessous avec votre smartphone. En utilisant notre fonctionnalité de chat Viber, vous acceptez que toutes les données personnelles que vous fournissez à XM Global Limited via Viber soient traitées conformément à notre politique de confidentialité et à la politique de confidentialité de l’application, afin d’obtenir de l’aide de la part de notre équipe expérience client. Centre d’aide 30 janv. 2024 à 9h05 GMT Adds financial details, CEO comments and industry background, paragraphs 2-3, 5, 8-9, 15 By Stephen Nellis, Yuvraj Malik and Anna Tong Jan 30 (Reuters) -Microsoft MSFT.O beat market estimates for quarterly profit and revenue on Tuesday, as new artificial-intelligence features helped attract customers to its Azure cloud service as they built out their own AI services. But Microsoft shares were down 1% after-hours as investors absorbed news about rising costs to develop these AI features. The company forecast operating expenses of $15.8 billion to $15.9 billion in the current quarter, up from $15.4 billion in the previous one. It also said it expects capital expenditures to \"increase materially\" on a sequential basis. Microsoft, in collaboration with ChatGPT creator OpenAI, has pushed chatbots into its core products such as its Office software and Bing search engine over the past year, attracting business customers eager to try the tech industry's next breakthrough. Investor buzz over AI helped Microsoft's shares rise by 57% in 2023. But this has also increased Microsoft's costs, and investors are watching growth in its Azure and Office business closely to see if that keeps up with the massive investments it plans to pour into data centers this year to deliver generative AI. \"We've moved from talking about AI to applying AI at scale,\" CEO Satya Nadella said in a statement. \"By infusing AI across every layer of our tech stack, we're winning new customers and helping drive new benefits and productivity gains across every sector.\" Brett Iversen, Microsoft's vice president for investor relations, told Reuters that 6 percentage points of the growth rate of cloud-computing platform Azure in the second quarter was attributable to AI. That is double the 3 percentage points in the first quarter. There are now 53,000 Azure AI customers, a third of whom were new to the service in the past 12 months, Nadella told analysts on a conference call. \"Overall, we are seeing larger and more strategic Azure deals with an increase in the number of billion dollar plus Azure commitments,\" he said, without giving a time frame. Total revenue grew 18% to $62 billion in the quarter ended Dec. 31, compared with the average analyst estimate of $61.12 billion, according to LSEG data. Adjusted profit of $2.93 per share beat an average estimate of $2.78 per share. Revenue at Microsoft's Intelligent Cloud unit, which houses the Azure cloud computing platform, grew 20% to $25.9 billion. Sales of Azure grew 30% - its best growth rate in four quarters - compared with a 27.7% consensus estimate from Visible Alpha, and outstripping a 25.7% growth in Google Cloud. Sales at Microsoft's More Personal Computing segment, which includes its Windows operating system and gaming business, grew 19% to $16.9 billion, powered in part by the close of its $69 billion purchase of \"Call of Duty\" maker Activision Blizzard. Analysts had expected $16.8 billion. Microsoft's Productivity and Business Process segment, which contains the LinkedIn social network in addition to Office sales, reported that sales rose 13% to $19.2 billion, just beating estimates. \"The software giant has delivered a healthy set of results, but not in a strong enough dose to appease the market,\" said Sophie Lund-Yates, lead equity analyst at Hargreaves Lansdown. AI-related companies lost $190 billion in stock market value late on Tuesday after Microsoft, Alphabet GOOGL.O and Advanced Micro Devices AMD.O delivered quarterly results that failed to impress investors who have sent their stocks soaring.  AI-POWERED SURGE While analysts have said that any meaningful gains from AI may not come before next year, investors have rewarded the company's push into AI and strategic partnership with Silicon Valley startup OpenAI. In November, Microsoft started selling Copilot, an AI assistant that can summarize an email inbox or craft a slide show, for $30 per month, which analysts say is a premium price. Early sales of the product showed up in the firm's commercial sales of Office software, where revenue grew 17%, compared with analyst expectations of commercial Office sales growth of 14.2%, according to data from Visible Alpha. Microsoft does not provide an absolute dollar figure for the sales. Microsoft's Iversen said on Tuesday that Office's commercial offerings, where Copilot is being sold, now stand at 400 million paid seats, up from 382 million in April 2023. The company's capital expenditures grew by $300 million from the previous quarter to $11.5 billion, putting the company on track to spend more than $46 billion this fiscal year. \"That's a sign of the customer demand that we're seeing,\" Iversen said. Microsoft's stock surge has helped it topple Apple AAPL.O as the world's most valuable listed company in the past few trading sessions. That was undented by a power struggle within OpenAI that highlighted the software giant's lack of direct control over its important partner. Microsoft also faces some legal and regulatory challenges.   Reporting by Yuvraj Malik in Bengaluru and Anna Tong and Stephen Nellis in San FranciscoEditing by Krishna Chandra Eluri, Sayantani Ghosh and Matthew Lewis  Avertissement : Les entités de XM Group proposent à notre plateforme de trading en ligne un service d'exécution uniquement, autorisant une personne à consulter et/ou à utiliser le contenu disponible sur ou via le site internet, qui n'a pas pour but de modifier ou d'élargir cette situation. De tels accès et utilisation sont toujours soumis aux : (i) Conditions générales ; (ii) Avertissements sur les risques et (iii) Avertissement complet. Un tel contenu n'est par conséquent fourni que pour information générale. En particulier, sachez que les contenus de notre plateforme de trading en ligne ne sont ni une sollicitation ni une offre de participation à toute transaction sur les marchés financiers. Le trading sur les marchés financiers implique un niveau significatif de risques pour votre capital. Tout le matériel publié dans notre Centre de trading en ligne est destiné à des fins de formation / d'information uniquement et ne contient pas – et ne doit pas être considéré comme contenant – des conseils et recommandations en matière de finance, de fiscalité des investissements ou de trading, ou un enregistrement de nos prix de trading ou une offre, une sollicitation, une transaction à propos de tout instrument financier ou bien des promotions financières non sollicitées à votre égard. Tout contenu tiers, de même que le contenu préparé par XM, tels que les opinions, actualités, études, analyses, prix, autres informations ou liens vers des sites tiers contenus sur ce site internet sont fournis \"tels quels\", comme commentaires généraux sur le marché et ne constituent pas des conseils en investissement. Dans la mesure où tout contenu est considéré comme de la recherche en investissement, vous devez noter et accepter que le contenu n'a pas été conçu ni préparé conformément aux exigences légales visant à promouvoir l'indépendance de la recherche en investissement et, en tant que tel, il serait considéré comme une communication marketing selon les lois et réglementations applicables. Veuillez vous assurer que vous avez lu et compris notre Avis sur la recherche en investissement non indépendante et notre avertissement sur les risques concernant les informations susdites, qui peuvent consultés ici. Politique de confidentialité | Politique de cookies | Politique de vulnérabilités | Conditions générales Juridique : Ce site internet est exploité par XM Global Limited, dont l’adresse de domiciliation est Suite 101, 63 Eve Street, Belize City, Bélize. XM Global Limited, enregistrée auprès de la Financial Services Commission (FSC) en vertu du Securities Industry Act 2021 (numéro de licence : 000261/397) et Trading Point of Financial Instruments Limited, autorisée et réglementée par la Cyprus Securities and Exchange Commission (CySEC) (numéro de licence : 120/10), font partie de Trading Point Group. Avertissement sur les risques : nos services impliquent un risque significatif, ce qui peut avoir pour conséquence la perte du capital que vous avez investi.Merci de lire et de vous assurer que vous comprenez parfaitement notre Divulgation des risques. Régions restreintes : XM Global Limited ne fournit pas de services pour les résidents de certains pays, tels que États-Unis d'Amérique, Canada, Israël et République islamique d'Iran. XM n’adresse pas son site internet et ses services à n’importe quelle personne dans n’importe quel pays dans lequel l’utilisation de son site internet et de ses services sont interdits par les lois ou réglementations locales. Lorsque vous accédez à ce site internet depuis un pays dans lequel son utilisation peut ou non être interdite, il en va de la responsabilité de l’utilisateur de s’assurer que toute utilisation du site internet ou des services est conforme aux lois ou réglementations locales. XM n’affirme pas que son site internet est adapté à toutes les juridictions. Qu’est-ce qu’un cookie ? Les cookies sont de petits fichiers de données. Lorsque vous visitez un site internet, le site internet envoie un cookie à votre ordinateur. Votre ordinateur le stock dans un fichier situé à l'intérieur de votre navigateur. Les cookies ne transmettent pas de virus ou de logiciels malveillants à votre ordinateur. Parce que les données d'un cookie ne changent pas lorsqu'il se déplace, il n'a aucun moyen d'affecter le fonctionnement de votre ordinateur, mais ils agissent plus comme des journaux (c.-à-d. ils enregistrent l'activité de l'utilisateur et se souviennent des informations) et sont actualisés chaque fois que vous visitez un site internet. Nous pouvons obtenir des informations vous concernant en accédant à des cookies envoyés par notre site internet. Différents types de cookies permettent de suivre vos différentes activités. Par exemple, les cookies de session ne sont utilisés que lorsqu'une personne navigue activement sur un site internet. Une fois que vous quittez le site internet, le cookie de session disparaît. Pourquoi les cookies sont-ils utiles ? Nous utilisons des cookies fonctionnels pour analyser la manière dont les visiteurs utilisent notre site internet, ainsi que pour suivre et améliorer les performances et le fonctionnement de notre site internet. Cela nous permet d'offrir une expérience client de haute qualité, en identifiant et en réglant rapidement tout problème qui pourrait survenir. Par exemple, nous pouvons utiliser des cookies pour savoir quelles pages du site internet sont les plus populaires et quelle méthode de liaison entre les pages du site internet est la plus efficace. Ce dernier nous aide également à savoir si vous nous avez été renvoyé par un autre site internet et à améliorer nos futures campagnes publicitaires. Une autre utilisation des cookies est de stocker vos sessions de connexion, ce qui signifie que lorsque vous vous connectez à l'Espace membre pour déposer des fonds, un \"cookie de session\" est défini de sorte que le site internet se souvient que vous vous êtes déjà connecté. Si le site internet n'a pas défini ce cookie, on vous demandera votre nom d'utilisateur et votre mot de passe à chaque nouvelle page au fur et à mesure que vous progressez dans le processus de dépôt de fonds. En outre, des cookies fonctionnels, par exemple, sont utilisés pour nous permettre de nous souvenir de vos préférences et de vous identifier en tant qu'utilisateur, de garantir la sécurité de vos informations et de fonctionner de manière plus fiable et plus efficace. Par exemple, les cookies vous évitent de taper votre nom d'utilisateur chaque fois que vous accédez à notre plateforme de trading et vous rappellent vos préférences, comme la langue que vous souhaitez lire quand vous vous connectez. Voici un aperçu de quelques fonctions que nos cookies nous fournissent : Ce site internet utilise Google Analytics, un service d'analyse internet fourni par Google, Inc. (\"Google\"). Google Analytics utilise des cookies analytiques placés sur votre ordinateur pour aider le site internet à analyser l'utilisation du site internet par l'utilisateur. Les informations générées par les cookies concernant votre utilisation du site internet (y compris votre adresse IP) peuvent être transmises et stockées par Google sur leurs serveurs. Google peut utiliser ces informations pour évaluer votre utilisation du site internet, pour répondre aux rapports sur l'activité du site internet et pour fournir d'autres services liés à l'activité du site internet et à l'utilisation d'internet. Google peut également transmettre ces informations à des tiers si la loi l'exige ou si ces tiers traitent ces informations pour le compte de Google. Google n'associera pas votre adresse IP avec d'autres données détenues. En utilisant ce site internet, vous donnez votre consentement à Google pour traiter les données vous concernant de la manière et aux fins décrites ci-dessus. Changez les paramètres Veuillez sélectionner le type de cookies que vous voulez avoir sur votre appareil. Nous utilisons des cookies pour vous donner la meilleure expérience possible de notre site internet. En savoir plus ou modifier vos paramètres de cookies. Avertissement sur les risques :  votre capital est à risque. Les produits à effet de levier ne sont pas recommandés pour tous. Veuillez consulter notre Divulgation des risques Merci d’entrer vos coordonnées. Si vous possédez déjà un compte XM, merci d’indiquer votre identifiant de compte pour que notre équipe d’aide puisse vous apporter le meilleur service possible. "
}