{
    "title": "Microsoft vs Apple: Who Will Win The Market Cap Race?",
    "date": "1/12/2024",
    "url": "https://www.ccn.com/analysis/microsoft-apple-market-cap-race/",
    "text": "Microsoft's market capitalizion briefly surpassed Apple's: who will be the most valuable company? Key Takeaways In the realm of technology, two titans stand head and shoulder above the rest: Microsoft and Apple. These tech giants have been locked in an epic battle for years, vying for supremacy in the market capitalization race. While Apple held the top spot for much of the past decade, Microsoft has been making a strong comeback, and the two companies are now neck and neck. The question is: who will ultimately emerge victorious? In a stunning reversal of fortunes, Microsoft (MSFT) briefly reclaimed its throne as the world’s most valuable company on Thursday, overtaking Apple (AAPL) for the first time in three years. This seismic shift in the tech landscape is attributed to Microsoft’s surging generative artificial intelligence (AI) business, spearheaded by its investment in ChatGPT-maker OpenAI. Microsoft’s stock price soared by 0.5%, boosting its market capitalization to a staggering $2.859 trillion. The company’s shares even briefly touched the $2.903 trillion mark, marking a significant victory in its ongoing battle for supremacy with Apple. Despite this setback, Apple remains a formidable force in the tech industry, with a market capitalization of $2.886 trillion. However, concerns over iPhone demand and slowing growth have weighed on its stock price, allowing Microsoft to seize the moment. D.A. Davidson analyst Gil Luria told  Reuters: “It was inevitable that Microsoft would overtake Apple since Microsoft is growing faster and has more to benefit from the generative AI revolution.” The battle for market dominance between these tech giants is far from over, but Microsoft’s recent surge in value indicates that it is firmly on the offensive. With its investments in cutting-edge AI technologies, Microsoft will solidify its position as a leader in the next generation of computing. A significant contributor to Microsoft’s notable gains last year was its early foray into the generative AI market. The company, headquartered in Redmond, Washington, strategically invested $10 billion in the startup OpenAI in late 2022. The impact of OpenAI’s ChatGPT chatbot was instrumental in igniting the current surge of interest in generative AI. Microsoft is now methodically incorporating AI into its expansive consumer and enterprise technology portfolio. In a recent announcement, the company unveiled plans to introduce an AI key on its Windows PC keyboard. This innovative button is designed to activate Microsoft’s AI assistant, named Copilot, marking the first substantial modification to the keyboard in three decades. Before this development, Microsoft had integrated Copilot services into its enterprise Office suite of apps on November 1 of the previous year. Leveraging generative AI, the tool provides suggestions and automates tasks within software applications such as Word and Excel. Microsoft has reported that offering businesses access to generative AI tools has significantly contributed to increased sales for its Azure cloud-computing business, as highlighted in the company’s October earnings call. Jefferies analyst Brent Thill recently designated  Microsoft as a top pick for 2024. In a client note, Thill expressed confidence that applications in generative AI will play a pivotal role in reaccelerating growth for Azure, and the introduction of AI PCs could potentially stimulate a refresh cycle for personal computers. Echoing this sentiment, Wedbush analyst Daniel Ives, in a December note, characterized  the Copilot feature as a “game changer.” He underscored the transformative impact Microsoft’s AI initiatives will have in the industry. Microsoft has seamlessly integrated OpenAI‘s technology across its suite of productivity software, contributing to a resurgence in its cloud-computing business during the July-September quarter. In contrast, Apple is contending with weakened demand. Particularly for its flagship product, the iPhone, which has historically been its primary revenue driver. Challenges in China, a critical market, persist as the country’s economy gradually recovers from the pandemic, and competition from resurgent Huawei erodes Apple’s market share. As of the most recent close, Apple’s shares have dipped by 3.3% in January so far, while Microsoft has seen a 1.8% rise. This reflects a discrepancy in their market performance. Both technology giants currently carry a relatively high share price-to-earnings (PE) ratio, a common metric for valuing publicly listed companies. Apple trades at a forward PE of 28, notably exceeding its 10-year average of 19, according to data from LSEG. Meanwhile, Microsoft is trading around 31 times forward earnings, surpassing its 10-year average of 24. Yesterday, Microsoft [@Microsoft ] overtook Apple [@Apple ] as the world's most valuable company: pic.twitter.com/upT3HFNVQi — Mwango Capital (@MwangoCapital) January 12, 2024  Despite Apple’s market capitalization peaking at $3.081 trillion on December 14, the company closed the previous year with a gain of 48%, trailing behind Microsoft’s impressive 57% rise. Microsoft has intermittently surpassed Apple as the most valuable company, a trend observed since 2018. It also notably occurred in 2021 amid concerns about COVID-induced supply chain disruptions affecting Apple’s stock price. Currently, Wall Street sentiment favors Microsoft, with the absence of any “sell” rating. Furthermore, an overwhelming 90% of brokerages covering the company recommend a “buy.” In contrast, Apple faces two “sell” ratings, and only two-thirds of analysts covering the company rate it as a “buy.” "
}