{
    "title": "Microsoft might abandon physical games for an all-digital Xbox future",
    "date": "1/26/2024",
    "url": "https://www.theshortcut.com/p/microsoft-might-abandon-physical-xbox-discs",
    "text": "Fans of physical games may have to brace themselves for an all-digital Xbox future, as a new report suggests Microsoft is making plans to ditch discs for good. As part of Microsoft’s wide-ranging job cuts, which saw 1,900 staff laid off across Xbox, Bethesda and the recently acquired Activision Blizzard, Microsoft appears to have shut down the departments responsible for bringing physical games to market. The Shortcut is a reader-supported publication. To receive new posts and support our work, consider becoming a free or paid subscriber. According to Windows Central editor Jez Corden’s post on X, who commented on the recent job cuts, “Microsoft has also shut down departments dedicated to bringing Xbox games to physical retail … which if you’ve seen the digital-only Xbox console leaks … well, you can get an idea of where Microsoft is going here.” 🤔 A new report suggests Xbox is leaving physical games behind 😓 Recent layoffs may have spurred Microsoft’s digital goals 👋 The next Xbox Series X design could ditch the disc drive 📉 Physical game sales have been on the decline for many years A huge Xbox leak last year laid Microsoft’s plans bare. It included an Xbox Series X Slim without a disc drive, which Microsoft’s marketing materials dubbed as being “adorably all-digital”. Microsoft has experimented with digital consoles in the past with the Xbox One All-Digital Edition, before releasing the Xbox Series S which doesn’t have a disc drive. The company has also shifted its primary focus to its subscription service Xbox Game Pass, which is available on consoles, PC and mobile devices, and is also pushing Xbox Cloud Gaming. With digital sales increasing every year, with many gamers preferring the convenience of being able to switch to different titles without getting up to change a disc, the move isn’t too surprising. Recent titles like Alan Wake 2, Hi-Fi Rush and the upcoming Senua’s Saga: Hellblade 2 are only available digitally. However, there is still demand for physical copies, particularly among those who value game preservation. We’ve seen digital titles disappear from storefronts countless times, often due to licensing issues. There’s nothing to safeguard your digital purchases from potentially disappearing one day, but like the music and movie industry, it appears that video games will be next to embrace a digital future with Microsoft leading the way. No posts Ready for more? "
}