{
    "title": "Cognizant unveils gen AI-powered Innovation Assistant, in collaboration \nwith Microsoft",
    "date": "1/17/2024",
    "url": "https://www.financialexpress.com/business/industry-cognizant-unveils-gen-ai-powered-innovation-assistant-in-collaboration-with-microsoft-3366780/",
    "text": "The Financial Express Cognizant announced its collaboration with Microsoft on the launch of the Innovation Assistant, a generative AI-powered tool built on Microsoft Azure OpenAI Service, which, it said, will augment Cognizant’s internal innovation program, Bluebolt. The Innovation Assistant is a tool designed to assimilate enterprise knowledge and enable greater creativity and innovation among teams of Cognizant employees working to solve client challenges across industries. “The creativity and ingenuity of Cognizant’s people is one of the things that sets us apart in our industry, and we see our Innovation Assistant as a game-changer in the way we generate and implement ideas. Together with Microsoft, we are harnessing the power of generative AI to revolutionize our approach to innovation, with the goal of ensuring we, and our clients, stay ahead in a rapidly evolving business environment,” said Ravi Kumar S, Cognizant’s CEO. The Innovation Assistant is integral to Cognizant’s Bluebolt grassroots innovation movement, which provides a framework for Cognizant employees anywhere and at any level, to contribute to the innovation process from ideation to implementation. Harnessing the power of generative AI for Bluebolt will help Cognizant employees develop a unique combination of virtual guidance and real-world support that can utilize the company’s full depth of expertise and co-innovation for the benefit of clients. “It’s amazing to see the power of gen AI enable innovation at different levels of an organization with Cognizant’s Innovation Assistant. They have used AI to create a platform that unlocks the potential of individuals and teams. Built on Microsoft Azure OpenAI Service, Cognizant’s platform is a force multiplier that aims to enable customers to gain access to insights from enterprise data and stay ahead in the ever-evolving digital landscape,” said Puneet Chandok, President, Microsoft, India & South Asia. Get live Share Market updates, Stock Market Quotes, and the latest India News and business news on Financial Express. Download the Financial Express App for the latest finance news.   "
}