{
    "title": "Microsoft's Bold AI Bet: Will It Pay Off for MSFT Stockholders?",
    "date": "1/20/2024",
    "url": "https://investorplace.com/2024/01/microsofts-bold-ai-bet-will-it-pay-off-for-msft-stockholders/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. Microsoft Co-Pilot is exciting investors like nothing since Internet Explorer Advertisement Source: The Art of Pics / Shutterstock.com Microsoft (NASDAQ:MSFT) stock represents the U.S. market’s most valuable company overtaking Apple (NASDAQ:AAPL) by capitalizing on AI with Co-Pilot, a $20/month add-on to Microsoft Office 365. With 345 million subscribers, Office was a $63 billion business in 2022, with one-third of revenue coming from the U.S. If even 10% of those users buy the add-on, that’s over $8 billion in incremental revenue. The estimate is on the low side. The consumer version of Co-Pilot will let you summarize documents on command and create graphs from Excel spreadsheets. Initially, it won’t let you generate entire slide decks from a text prompt, because it isn’t built on Microsoft Graph. In a way, this is a price cut. Microsoft charges $30 per seat per month to corporate customers. Before January, only customers with 300 users could even buy Co-Pilot, but that requirement is now gone. Small wonder Piper Sandlin now calls MSFT its best AI pick. Tipranks counts 37 Microsoft analysts, with all but one telling investors to buy now. Along with the Co-Pilot announcement, Microsoft signed a $1.5 billion partnership with Vodafone (NYSE:VOD) to sell AI and cloud services across Europe and Africa. This isn’t just co-marketing. Vodafone is scrapping its own data centers, while Microsoft is investing in Vodafone’s Machine Internet operation, which will be spun out in April. What of the risks of AI that companies like Microsoft partner OpenAI warned about all last year? CEO Satya Nadella has his fingers planted firmly in his ears and is whistling a happy tune. “We have to take the unintended consequences of any new technology along with all the benefits,” he told the World Economic Forum. Microsoft Co-founder Bill Gates is already on-board with that message. But the European Union has also approved an AI Act. The European Parliament will vote it on early this year and go into effect next year. It limits biometric classification systems, harvesting of facial images, and the use of AI to limit free will. The industry is already lined up against it, fearing it will limit Europe’s ability to compete. Commenters are comparing this year in AI with the rise of the Internet in 1995. I happened to be around for that. I had an editor who got a 45 Mbps line to the Web that year and felt like he’d discovered fire. Maybe he had, but the publication he was editing burned down within months. Entire industries collapsed before the Internet boom itself did in 2000. Microsoft faced government intervention and stock decline for 15 years until Nadella’s appointment and the company’s cloud commitment. Microsoft was years late with Internet Explorer, launching it in August 1995. This time, Microsoft is leading the market. Will that make a difference in how the government treats it? Will Nadella do any better than Bill Gates did defending integration with his market-leading application suite? Most analysts take that for granted. But Co-Pilot is putting political risk into MSFT stock. That’s just what it rejected when it sold MSNBC to Comcast (NASDAQ:CMCSA) almost 20 years ago. AI has already lifted MSFT stock by 54% in the last year, adding over $1 trillion to its market cap, lifting its price to earnings multiple to nearly 38. Everyone, it seems, is telling you to buy more. Just know that the easy money has already been made. As of this writing, Dana Blankenhorn had LONG positions in MSFT and AAPL. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Dana Blankenhorn has been a financial and technology journalist since 1978. He is the author of Technology’s Big Bang: Yesterday, Today and Tomorrow with Moore’s Law, available at the Amazon Kindle store. Tweet him at @danablankenhorn, connect with him on  Mastodon or subscribe to his Substack. Artificial Intelligence, Cloud, Software, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/microsofts-bold-ai-bet-will-it-pay-off-for-msft-stockholders/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Crypto & Blockchain Market Analysis Stocks to Sell Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}