{
    "title": "Microsoft CEO Satya Nadella to visit India in February, key focus likely on \nAI | Mint",
    "date": "1/29/2024",
    "url": "https://www.livemint.com/companies/people/microsoft-ceo-satya-nadella-to-visit-india-in-february-key-focus-likely-on-ai-11706515244843.html",
    "text": "Microsoft CEO Satya Nadella will visit India on February 7 and 8 as part of his annual visit to the country with artificial intelligence (AI) and its opportunities serving as the focal point for 2024, according to a report published by MoneyControl. Microsoft India and South Asia's President Puneet Chandok, in an internal email sent a few weeks ago, stated that the tech giant is committed to using technology to create more opportunities in the nation, as demonstrated by Nadella's visit. “AI is playing a game-changing role in shaping ‘India’s Techade’ and will make India and South Asia one of the most exciting markets for technology,\" the email read as quoted by MoneyControl. In June 2023, Prime Minister Narendra Modi met up with the top CEOs and Chairmen from the US and India at the White House. The guest list included Sundar Pichai, Satya Nadella, and Tim Cook among others. During the meeting, Satya Nadella stressed the importance of cloud-based services, which are energy efficient. He said the adoption of such technologies is rising and proving to be a \"game changer\". \"Cloud-native applications have yet not begun...by 2025 you are going to have most of the application anybody builds really at that efficient frontier of cloud net,\" Nadella said. Microsoft has operated in India for more than 32 years now. While interacting with top business leaders at the Microsoft summit, Nadella reinforced the digital imperative for every organisation. He mentioned how Microsoft Cloud can foster innovation, create broad economic progress, and accelerate the growth of businesses in India. \"Our mission is to empower every person and every organization on the planet to achieve more, and ultimately, we have to measure our success by achieving that mission, said Nadella, sharing his vision for a tech-enabled India. He also highlighted how organisations big and small, across India are transforming with the power of Microsoft's tech stack and solutions. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp Chat with\n                    MintGenie I am Genie, Mint’s AI enabled assistant to help you with your queries related to: "
}