{
    "title": null,
    "date": "1/2/2024",
    "url": "https://www.proactiveinvestors.co.uk/companies/news/1037267/microsoft-taking-the-clear-lead-in-the-ai-arms-race-analyst-1037267.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Advertising Cookies collect information about your browsing habits such as the pages you visit and links you follow. These audience insights are used to make our website more relevant. Performance Cookies collect anonymous information designed to help us improve the site and respond to the needs of our audiences. We use this information to make our site faster, more relevant and improve the navigation for all users. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence William kickstarted his career as a researcher and reporter for a global legal publication, covering everything from public law to M&A. Before moving to Proactive Investors, he worked as a reporter for a major fintech company with a focus on cryptocurrency and blockchain technology.\r\n\r\nHarking from Queensland, Australia, William obtained first-class honours in journalism and media from Birkbeck University before going on to complete an MA in creative and critical writing. Other jobs have... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 11:10 02 Jan 2024 GMT 2024 is the year of the dragon in the Chinese Zodiac. Similarly, there’s a fire inside the technology sector in the form of artificial intelligence (AI) and its flames are growing ever larger. Such is the importance of AI in the tech sector that it will be the key to tech stock growth and overall demand in the year ahead, according to a recent enterprise survey conducted by Wedbush. According to the poll, Microsoft Corporation (NASDAQ:MSFT) “is taking the clear lead in the AI arms race” given its close association with ChatGPT developer OpenAI. Microsoft’s exclusive integration of ChatGPT into its suite of products is now well underway and “the company has a significant AI monetisation opportunity” within its Azure cloud-computing service, said Wedbush. Though Microsoft is a frontrunner in the AI revolution, Wedbush analysts believe the tech sector as a whole stands to benefit from the burgeoning field of innovation. The analysts said: “In our opinion, the new tech bull market has now begun and tech stocks are set up for a strong 2024 led by Big Tech, software, and the overall chip sector as the AI spending tidal wave hits the shores of the broader tech sector. “We believe now the rest of the tech sector joins the Magnificent 7 party in this rally into 2024 with AI tailwinds abound.” Among the Magnificent 7 stocks, Google parent Alphabet Inc (NASDAQ:GOOG) was also viewed by survey participants as a major generative AI player as it further improves its core technology platform. Wedbush also predicted a “tidal wave” of mergers and acquisitions in the software and microchip sectors. Outside of the Magnificent 7, Wedbush cited Palo Alto, Palantir, Zscaler, CyberArk, Crowdstrike and MongoDB as major AI beneficiaries in the year ahead. Sign up to receive alerts and news direct to your inbox The FTSE 100 climbed in early trading, adding to strong gains seen late last week which took the index close to twelve-month highs.\r\n\r\nIn focus was B&Q owner Kingfisher, which dipped in early trading after reporting profits fell by a fifth to £475 million for the year on the back of stagnant... © Proactive Group Holdings Inc, 2024 Proactive Investors Limited, trading as “Proactiveinvestors United Kingdom” is registered in England with the Company Registration number 05639690. Group VAT registration number 872070825. You can contact us here. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}