{
    "title": "Forget Apple: This \"Magnificent Seven\" Stock Could Be the World's Biggest \nCompany in 2024",
    "date": "1/8/2024",
    "url": "https://finance.yahoo.com/news/forget-apple-magnificent-seven-stock-103500633.html",
    "text": "So far, Apple (NASDAQ: AAPL) is the only company in the world that has been valued above $3 trillion. Even with some recent pullbacks for the stock, the tech giant still has a market capitalization of $2.82 trillion and ranks as the world's most valuable business. But fellow \"Magnificent Seven\" member Microsoft (NASDAQ: MSFT) currently has a market cap of $2.73 trillion and is nipping at the iPhone maker's heels. While there's no doubt that Apple is a great business, I believe that it will lose the title of \"World's Most Valuable Company\" in 2024 and that Microsoft will hold on to it for a while. Here's why. With its most recent earnings report, Apple delivered revenue of $89.5 billion and net income of roughly $23 billion. Meanwhile, Microsoft posted sales of $56.5 billion and net income of $22.3 billion. Apple is still recording much more revenue, but the more software-focused nature of Microsoft's business allows it to command superior margins. Given the recent trajectories for both businesses, Microsoft could be on track to surpass Apple's profits in the near future. Take a look at the chart below, which tracks Apple's sales and earnings growth over the last five reported quarters. Even though Apple has generally managed to keep growing earnings, its sales have slipped for four consecutive quarters. Now take a look at this chart tracking Microsoft's sales and earnings progression. While significant earnings declines show up at the beginning of Microsoft's chart, the comparative performance decline largely stems from tax benefits recorded in the previous year. On an adjusted basis, earnings would have grown 4% year over year in the company's September-ended quarter in 2022 and declined a more moderate 6% in the December-ended quarter in 2023. Overall, Microsoft's recent business momentum has been significantly more impressive than Apple's. And there are good reasons to think this trend will continue in the near future. The overall progression of Apple's tech and products over the last five years has been iterative rather than revolutionary. The big improvements for the iPhone have largely come down to 5G compatibility and improvements in camera technology. Overall adoption for 5G is still at a relatively early stage. Because developers do not want to miss out on addressing the 4G market, this means that the number of applications specifically designed to take advantage of the new generation of network tech remains limited. Meanwhile, the jumps in camera technology that are included with each generation of iPhone technology are nice, but the point of diminishing returns has clearly been reached. By comparison, Microsoft continues to deliver more significant improvements for its Azure cloud infrastructure platform. Crucially, its cloud service positions the company to be one of the absolute top players in the rise of artificial intelligence (AI). In addition to strong momentum for Azure, Microsoft has built a forefront position in AI-powered personal assistants. Its operating systems, productivity software, search unit, gaming business, and other products should also benefit from artificial intelligence integration. While Apple is undoubtedly working on many artificial intelligence projects and has natural strengths in the space thanks to its massive and loyal user base, Microsoft's position in the category currently looks stronger overall. Again, the more software-focused nature of Microsoft's business puts it in a position to record better margins than Apple due to manufacturing costs and other expenses that come with being more hardware-oriented. Apple still has what it takes to be a strong long-term investment, and the company will undoubtedly release some innovative and highly influential products in the near future. However, I believe Microsoft will soon become the world's most valuable company, and I expect it to have the better-performing stock over the next five years. Should you invest $1,000 in Apple right now? Before you buy stock in Apple, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Apple wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of December 18, 2023  Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Microsoft. The Motley Fool has a disclosure policy. Forget Apple: This \"Magnificent Seven\" Stock Could Be the World's Biggest Company in 2024 was originally published by The Motley Fool Related Quotes "
}