{
    "title": "How Satya Nadella transformed Microsoft in 10 years",
    "date": "2/3/2024",
    "url": "https://www.thehindubusinessline.com/info-tech/how-satya-nadella-transformed-microsoft-in-10-years/article67808024.ece",
    "text": "Get businessline apps on Connect with us TO ENJOY ADDITIONAL BENEFITS Connect With Us Get BusinessLine apps on By K V Kurmanath Comments READ LATER On February 4, ten years ago, Satya Nadella took charge as the Chief Executive Officer (CEO) of Microsoft. The company was at cross roads. It lost its rhythm over the year and was unable to keep pace with the radically transforming technology space. Google, Apple and Amazon, the tech companies much younger to it, were on a growth trajectory. Amazon, primarily an e-commerce company, made giant strides in the cloud space, while Google could further cement its position in the digital space, and Apple became a rage globally with its phones and tabs. The company, which turned 40 in 2014, made an attempt to find some space in the phone segment. Its multi-billion dollar acquisition of Nokia’s phone business failed. The Office suite was found to be too restrictive as its users were unable to get a seamless experience. Nadella made some quick decisions as he took over the Redmond (US)-based tech giant. The $7.6 billion acquisition of Nokia’s phone business was written off within a year after his taking over as the CEO. It meant heavy job losses. Admitting that the job losses were painful, Nadella defended the decision. Consequently, LinkedIn, the professional networking site, was acquired. Gaming company Minecraft, which has huge application in sectors like education, construction and technology, was also added to the portfolio. The company turned its focus on the cloud. Though a late start, Microsoft invested heavily under his leadership and emerged as a key cloud player globally. Nadella saw opportunity in AI too. The company invested in OpenAI, the US-based startup that wowed the world with its Large Language Model (LLM) solution ChatGPT. Being a majority stakeholder in the startup, Microsoft has launched ‘CoPilot’ and is integrating it across all its platforms, offering its customers the power of an LLM. Nadella wrote the book ‘Hit Refresh’, a kind of autobiography of his self and the company post 2014. Nadella initiated a strategic shift in the company’s business, emphasising a Mobile-First and Cloud-First’ approach, focusing on expanding the cloud business. The tech behemoth initiated collaborations with startups. As he focussed on rebuilding the company culture, he fostered a growth mindset and emphasised on the importance of customer obsession, diversity, and inclusivity. “The reason I talk about empathy is that I believe this is the leading indicator of success. Innovation comes only when you are able to meet unmet, unarticulated needs—and this comes from a deep sense of empathy we all have,” Nadella articulates. “But you can’t go to work and, say, “turn on the empathy button.” Your life’s experience will give you that passion and understanding for a particular customer, a particular use case. How you can connect (your life experience) to your work is what we want to invoke in the 1,00,000 people who work at Microsoft,” he says. B Ashok, Director of Applied Sciences and Engineering at Microsoft Research in Bengaluru, says the last 10 years have been completely different. “Nadella brought in a completely new culture in the company with a focus on collaboration and openness. One of the first strategic moves he made was to make Microsoft Office suite available on iOS and Android platformsand offering Office on subscription model.” Joined a little ahead of Satya in Microsoft, Ashok, who’s better known as Bash, said that Nadella ensured all of the top executives received Non-Violent Communication training (a communication technique advocated by Marshall Rosenberg). He did away with ‘precision questioning’, which was designed to try and destroy the ideas proposed and encouraged a different way of questioning that promoted creative ideas. “Another key aspect that he brought in was a growth mindset, a learn-it-all attitude as opposed to a fixed mindset or a know-it-all attitude,” he said. These changes are evident in the way the company operates today. As it completes 50 years in 2025, the company faces fresh challenges. The New York Times, which filed a case against OpenAI over copyright issues, has made Microsoft too, a respondent. The company needs to find an answer to this question as it is actively integrating the Co-Pilot across all of its products and services. The copyright petition could open a Pandora’s box as there is a chance that more and more content-led organisations might seek part of the revenues from LLM companies. It also faces serious challenges in the cloud space and nimble-footed startups that are coming up with productivity and collaboration solutions, challenging its leadership. Comments BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Terms & conditions  |  Institutional Subscriber "
}