{
    "title": "Satya Nadella's first decade as Microsoft CEO was defined by cloud. What's \nnext?",
    "date": "2/4/2024",
    "url": "https://www.cnbc.com/2024/02/04/microsoft-ceo-satya-nadella-hits-10-year-anniversary.html",
    "text": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article When Satya Nadella replaced Steve Ballmer as Microsoft CEO in February 2014, the software company was mired in mediocrity. Its market cap was just over $300 billion. A decade later, Microsoft's valuation has swelled tenfold, to $3.06 trillion, making it the world's most valuable public company, ahead of Apple. It's firmly entrenched as a leader in key areas, such as cloud and artificial intelligence. As Nadella marks his 10-year anniversary at the helm, he's widely praised across the tech industry for changing the narrative at Microsoft, whose stock fell 30% during Ballmer's 14 years at the top. In that era, the company was squelched by Google in web search and mobile and was completely left behind in social media. Many tech industry analysts and investors would say that, thanks largely to Nadella, Microsoft is now set up to be a powerhouse for the foreseeable future. Nadella \"is special and someone to be considered as one of the GOATs among tech CEOs,\" said Aravind Srinivas, co-founder and CEO of AI startup Perplexity, which has the backing of Amazon founder Jeff Bezos. The acronym GOAT stands for greatest of all time. There are plenty of obstacles in Nadella's way as he pursues further growth. Regulators are concerned about Microsoft's power. Rivals are jealous. Some clients are skeptical about spending even more money on the company's AI tools when they already allocate so much budget to so many Microsoft products. And Microsoft, along with its tech peers, has dealt with mass layoffs of late, cutting 10,000 jobs in early 2023, and eliminating 1,900 in January from its gaming division. One of Microsoft's biggest sore spots when Nadella took over was the closed nature of its products. Microsoft was known to defend its proprietary Windows and Office software and denounce open-source alternatives. Interoperability wasn't the most popular word. \"There was a little bit of a take-it-or-leave-it culture,\" said Aaron Levie, co-founder and CEO of cloud storage vendor Box, which spent its early years going directly after one of Microsoft's products. Nadella has made the company more attentive to customers' needs, Levie said. The two companies now have multiple product integrations. Nadella's Microsoft has also formed partnerships with some of its fiercest rivals. In 2023 Oracle co-founder Larry Ellison visited Microsoft's headquarters in Redmond, Washington, for the first time, as the companies made a joint cloud announcement. In a 2020 interview, Pat Gelsinger, then CEO of VMware, said offering his company's software on Microsoft's Azure cloud was akin to a \"Middle East peace treaty.\" Gelsinger now runs Intel, which makes chips for PCs running Microsoft Windows and clouds such as Azure. In the Nadella age, Microsoft has also contributed to open-source projects, released software under open-source licenses and released a version of its Teams communications app for Linux. Nadella has surprised people in other ways. Michael Nathan was a senior director at Microsoft until 2016, when he left for a job in venture capital. Nathan said he told Nadella about the opportunity after the two of them left a customer meeting in Silicon Valley. Instead of getting angry or making the situation awkward, Nadella told him to take what he'd learned at Microsoft and share it. \"I was like, 'What?'\" Nathan said. \"That was amazing. He totally lifted the burden of having that conversation.\" He's also decisive. In 2018, Nadella came to believe in the idea of buying GitHub just 20 minutes after Nat Friedman, then a Microsoft corporate vice president, started pitching him on it. Right away, Nadella suggested that Friedman become GitHub's new CEO, Friedman said. Microsoft paid $7.5 billion for the code-storage startup. Microsoft declined to provide a comment for this story. Nobody would mistake Nadella for Ballmer, the showman. His predecessor was known for dancing on stage at conferences and hyping up crowds of thousands. Ballmer is now the owner of the NBA's Los Angeles Clippers and can frequently be seen behaving similarly courtside. While Nadella may not bring as much entertainment value, he's proven to be more effective than Ballmer when it comes to dealmaking. In addition to GitHub, Nadella has made pricey acquisitions such as LinkedIn, Minecraft parent Mojang, and Nuance Communications that have contributed to Microsoft's top line. Ballmer was not so lucky. His aQuantive and Nokia deals were disastrous. More recently, Nadella helped Microsoft land the $75 billion acquisition of game publisher Activision Blizzard, a deal that investors won't know how to assess for a while. And in AI, Nadella is credited for investing billions of dollars in startup OpenAI, leading to product enhancements and cloud revenue from customers both new and old, and giving Microsoft a leadership position in an emerging market. Nadella is perhaps best known in the tech industry for pushing Microsoft deeper into cloud computing. Azure, which delivered 30% revenue growth in the most recent quarter, was started during the Ballmer years. But Nadella brought it to life, transforming it from a research project into a product, said Kevin Dallas, CEO of database software company EDB and a 24-year Microsoft veteran. \"I'm shameless in saying I look at him as a leader that I've learned from, grown from,\" Dallas said. \"I continue to watch him.\" In looking at the road ahead for the 56-year-old Nadella, here are some of the biggest challenges in his way: Microsoft looked at buying TikTok in the U.S. in 2020, but nothing came of those discussions. While some in the younger generations have Microsoft software at work, it's not necessarily what they grew up using and may not be what they prefer. The company must prepare for the era when Gen Z is in charge of IT budgets. OpenAI's ChatGPT, which some students use, could be a start. Some Microsoft employees have been there for over 20 years. Many will leave after far less time. For years, employees have said they can make more money at other big tech companies. Some have received higher compensation after leaving and then returning. Microsoft has $81 billion in cash and might want to use more of the stash to keep talent — especially the top tier — around for longer. Microsoft critics often say the company rarely gets it right the first time with new hardware or software and that it's best to wait for the third version. Reviewers didn't take kindly to the original 2012 Surface tablet, for example. Today's Surface gets better marks, but it's nowhere near the most popular tablet on Amazon — the iPad is. Microsoft remains weak when it comes to building products in new categories, a former executive said. The company's dual-screened Surface Duo phones running Android haven't caught on, and Microsoft Loop, a response to modern productivity apps such as Notion, has yet to catch fire in app stores. Antitrust officials have recently blocked acquisitions at Adobe and Amazon. They tried and failed to squash Microsoft's purchase of Activision. But Microsoft's big push in AI has come through an investment, not a purchase. The Federal Trade Commission's Lina Khan said in January that the agency will examine cloud providers' investments in AI startups. Microsoft has also drawn inquiries in Europe over its cloud practices. Regulatory crackdowns are nothing new at Microsoft, which infamously changed some of its behavior following a high-profile case brought by the U.S. Justice Department in the 1990s. In regulatory filings, Microsoft calls OpenAI \"our strategic partner.\" The unusual nature of the arrangement was on display in November, as Nadella worked overtime to get Sam Altman back on top at the startup after the board fired Altman suddenly. Microsoft and OpenAI compete to sell AI services to companies and have a relationship that can cause internal tension. In allocating graphics processing units to OpenAI, for example, Microsoft is sometimes depriving its other departments of them, two people familiar with the matter told CNBC. Altman told Nadella onstage at an event in November that the two companies have \"the best partnership in tech.\" However, OpenAI isn't always satisfied relying on Microsoft as its cloud supplier, one of the people said. Following the November brouhaha, Nadella was at least able to get Microsoft a seat on OpenAI's board. An OpenAI spokesperson told CNBC that the company views Microsoft as a very good partner. Nadella is constantly searching for the next category that can generate revenue and profit. The company's HoloLens augmented reality headset, announced in 2016, hasn't become a big hit. Nadella hoped that an AI Copilot added to the Bing search engine in February 2023 would convert into share gains, but Google remains the clear leader in that category. Nadella did say on a conference call this week that Bing gained share in the fourth quarter. While AI might be Microsoft's next big thing, the company will have to continue to find new ways to drive growth. Nadella has plenty to keep himself busy for now. Analysts on average see enough expansion to project a 12% gain in the stock price over the next year, according to FactSet. WATCH: Microsoft is 'so far' ahead of competition and taking market share, says Jefferies' Thill Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by "
}