{
    "title": "Intel launches new foundry businesses dedicated to AI Systems, signs \nMicrosoft as major client",
    "date": "2/22/2024",
    "url": "https://www.firstpost.com/tech/intel-launches-new-foundry-businesses-dedicated-to-ai-systems-signs-microsoft-as-major-client-13740754.html",
    "text": "Intel has launched a new foundry business, dedicated to client who work extensively with AI. They have also signed Microsoft as a major client and will be making chips and other hardware for their AI data centres Intel has launched Intel Foundry, a sustainable systems foundry business aimed at catering to the demands of businesses working with AI. The semicon giant also unveiled a comprehensive roadmap to consolidate its position as an industry leader in the coming years. During an event in San Jose, California, marking the inaugural technology conference for Intel Foundry, the company disclosed plans to outpace its major rival, Taiwan Semiconductor Manufacturing Co (TSMC), in advanced chip manufacturing. Intel aims to reclaim the title of producing the world’s fastest chips from TSMC with its Intel 18A manufacturing technology later this year and extend this lead into 2026 with the introduction of Intel 14A. The company’s roadmap now encompasses Intel 14A, alongside specialized node evolutions, demonstrating its commitment to the ambitious five-nodes-in-four-years (5N4Y) plan. This strategy seeks to introduce cutting-edge solutions, including the industry’s first backside power solution with Intel 18A by 2025. Advancements in Intel 3, Intel 18A, and Intel 14A process technologies are integrated into the roadmap to address diverse customer requirements, ensuring a continual enhancement in product offerings. At the unveiling of their new venture, Intel also announced that they have signed Microsoft on as one of their major customers. Microsoft is planning to start making some of the equipments used in AI data centres, in order to reduce their reliance on NVIDIA. Microsoft is set to leverage Intel’s 18A technology to manufacture a custom computing chip, contributing to an increase in foundry orders forecasted at $15 billion, up from the previously expected $10 billion. With this, Intel also hopes to take on TSMC. The unveiling of Intel’s 14A technology marks the company’s first detailed plan beyond 2025, aligning with CEO Pat Gelsinger’s vision to reclaim chipmaking dominance set three years ago. Intel is banking on receiving billions from the US government subsidies and business from external customers to facilitate its resurgence, leveraging its long-standing reputation for operating cutting-edge factories across multiple continents. Intel has already secured agreements with four significant customers for its 18A manufacturing technology, with further partnerships established with Arm Holdings to streamline chip production and collaborations with universities to provide access to its advanced manufacturing technology. Analysts view Intel’s efforts to attract external customers as crucial for its turnaround, acknowledging that tangible results may take two to three years to materialize. (With inputs from agencies) Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}