{
    "title": "Microsoft's last minute Super Bowl ad showcases everyday uses of AI",
    "date": "2/7/2024",
    "url": "https://www.campaignlive.com/article/microsofts-last-minute-super-bowl-ad-showcases-everyday-uses-ai/1860661",
    "text": "Sixty second spot will broadly launch the company’s Copilot AI chatbot. Microsoft will return to the Super Bowl with a 60-second spot focused on the everyday use cases of artificial intelligence, from illustrating a story to writing code for a game. Called Watch Me, the spot features a series of “everyday people” who use Microsoft’s Copilot to help them learn a topic or build their business. The spot will serve as a broad launch platform for Copilot, the AI chatbot that first launched as Bing Chat in February 2023 and has since been integrated across Microsoft’s suite of products. Built with OpenAI’s latest GPT-4 and DALL-E 3 large language models, Copilot offers consumers and businesses a variety of text and image generation tools. Created by Panay Films, the ad has been designed to tap into growing curiosity among consumers about how AI can transform everyday tasks, Microsoft chief brand officer Kathleen Hall told Campaign US. The technology giant had been conducting “a ton of social listening and mapping” on consumer sentiment towards AI last year and decided “we want to make a statement in this field.” “We’ve seen this movement from fear to curiosity — there’s been a pretty marked shift from ‘Oh, what’s this scary thing called AI?’ to ‘Hey, I’m seeing more and more of this, I’m starting to wonder what I could do with it or how I could use it,’” she said. Through its work tracking social conversations, Microsoft identified a cohort of the population — “about 20%” of those online, Hall said — who are “leaned in, tech adept and excited and positive about what AI may do.” These are people who see AI as a vehicle for improvement and learning. Microsoft calls them “AI optimists.” The Super Bowl spot and surrounding digital activations are targeted at these “AI optimists”; Microsoft is not looking to convert consumers who are convinced AI is a negative force. “It’s to show there’s a ton of really useful goodness that can happen that isn’t threatening or scary or worrisome at all,” said Hall. Copilot was used to generate the goals featured within the ad: the chatbot was asked what people’s hopes and dreams are and responded with themes like “start my own business,” “get my degree” and “write my story.” Microsoft was a last-minute entrant to the Super Bowl this year. It decided on the theme of its spot in November and bought the last 60-second spot available in CBS’ broadcast in early December, Hall said. Navigating production around the holidays was a challenge. “It’s been quite a sprint,” she said. Thead will air during fourth quarter of the game. While some major brands have told Campaign US they managed to negotiate CBS down from the roughly $7 million per 30-seconds of ad time the broadcaster was charging for the Big Game, Microsoft wasn’t in a position to haggle. “What happens when you’re late is that you don’t have a lot of negotiating power, so I would not say we got a bargain. But based on our analysis, it's worth the investment,” said Hall. She said there are “very few, if any” opportunities for marketers to gain immediate reach at such a scale as the Super Bowl. “There used to be more opportunities for communal experience of messaging — the final episode of Mash or Seinfeld — and that gave marketers an opportunity for really broad exposure really quickly,” Hall said. “There aren’t many left; football is one of them. So, if you’re looking to change perceptions, and reach a mass audience with immediacy, it’s the thing to do.” This is Microsoft’s fifth Super Bowl spot; it first entered the Big Game a decade ago with an ad showing how its software products can “empower” humans by transforming medicine, education and everyday life — a theme the brand continues to adopt today. The brand also ran ads in the 2015, 2019 and 2020 game. Its 2019 spot focused on the Xbox Adaptive Controller, designed for gamers with disabilities. This year’s Super Bowl spot will be supported by search ads across Bing and Google, YouTube ads and paid, organic and influencer ads across TikTok, Meta and X. Dentsu’s Carat was responsible for media buying and planning. Despite the continuous stream of negative headlines about the safety of Elon Musk’s X as a platform for consumers and advertisers, Hall said “we have had no issues with X.” “We are super diligent in reviewing brand safety and brand safety measures,” she said. “We’re very satisfied with the boundaries that they have in place as it relates to brands.” She said the “immediacy of the conversation” that happens on X around major events is what continues to attract Microsoft to the platform, an element that competitors like Threads have struggled to replicate. The Super Bowl spot will eventually be translated into 30 markets to form a global campaign marketing Copilot that will run throughout the year. Get the very latest news and insight from  Campaign  with unrestricted access to  campaignlive.com  , plus get exclusive discounts to  Campaign  events. Don’t miss your daily fix of breaking news, latest work, advice and commentary.  Elmo stars in mental health PSA following social media trauma dump The Guggenheim says it was ‘not informed’ it would be part of Beyoncé’s album promotion Movers & Shakers: Solo Stove, Hard Mtn Dew, Republica Havas and more Brands weigh in on Kate Middleton controversy on social media Moving beyond one-dimensional multicultural representation The politics behind the US TikTok ban is not what you think The habits of highly effective women  "
}