{
    "title": "Microsoft tried to sell Bing to Apple in 2018, according to Google court \nfilings",
    "date": "2/24/2024",
    "url": "https://9to5mac.com/2024/02/24/microsoft-sell-bing-to-apple/",
    "text": "In September, Bloomberg reported that Apple had held exploratory talks with Microsoft about acquiring Bing as recently as 2020. In newly unsealed court filings this week, more details about the acquisition talks between Apple and Microsoft have surfaced. As reported by CNBC, these documents come as part of the US Justice Department’s lawsuit alleging Google has a monopoly in the web search industry. In documents made public on Friday, Google argued that the relationship between Microsoft and Apple – including acquisition talks – is evidence that Google does indeed have “competition” in the search industry. According to Google’s filings, Microsoft pitched Apple on making Bing the default search engine in Safari on at least seven different occasions: 2009, 2013, 2015, 2016, 2018, and 2020. Each time, Google says that Apple passed on the opportunity due to search quality. “In each instance, Apple took a hard look at the relative quality of Bing versus Google and concluded that Google was the superior default choice for its Safari users. That is competition,” Google explained. Also in the filing, Google wrote that Microsoft approached Apple in 2018 to tout improvements it had made to Bing’s search quality. Microsoft’s goal was to either “sell Bing to Apple or establish a Bing-related joint venture.” The filing includes comments from Eddy Cue, Apple’s services boss: “Microsoft search quality, their investment in search, everything was not significant at all. And so everything was lower. So the search quality itself wasn’t as good. They weren’t investing at any level comparable to Google or to what Microsoft could invest in. And their advertising organization and how they monetize was not very good either.” Google and Apple, of course, have a lucrative partnership through which Google pays billions of dollars to be the default search engine on Apple’s platforms. The revenue generated from its deal with Google was a “key reason” Apple’s talks to acquire Bing never advanced beyond exploratory stages, multiple reports have explained. Follow Chance: Threads, Twitter, Instagram, and Mastodon.  FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Chance is an editor for the entire 9to5 network and covers the latest Apple news for 9to5Mac. Tips, questions, typos to chance@9to5mac.com "
}