{
    "title": "2 \"Magnificent Seven\" Stocks That Are AI Buys in 2024",
    "date": "2/19/2024",
    "url": "https://www.fool.com/investing/2024/02/19/2-magnificent-seven-stocks-safe-ai-buys-2024/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More As the cloud leaders serving a growing market for artificial intelligence (AI), Microsoft (MSFT -0.15%) and Amazon (AMZN 0.40%) are the two \"Magnificent Seven\" stocks I would feel the most comfortable buying and holding in almost any economy. They are experiencing growing demand in their cloud service businesses that make them relatively low-risk bets right now. Most importantly, Microsoft and Amazon are producing growing free cash flow that can fuel investments in new AI tools for many years. These two have tremendous customer followings that make them look unstoppable as long-term investments. Here's more about why I would feel safe owning these two stocks in 2024 and beyond. The interest in AI only seems to be placing a bigger spotlight on the advantages that large tech companies bring to the table with their enormous profitability and cash resources. Smaller software start-ups in AI are losing money, but Microsoft can deliver new AI features while raking in profits. It says it now has 53,000 customers using AI in its Azure cloud business, with over a third of those new to Azure in the last year. Azure is rapidly gaining share of the cloud market and might give the cloud leader Amazon Web Services (AWS) a run for its money soon enough. The early success of Microsoft 365 Copilot, which uses generative AI to bring information to users, gives management confidence in future revenue opportunities. The company is already very profitable, generating $67 billion in free cash flow on $227 billion of revenue over the last four quarters. But analysts at Goldman Sachs expect Microsoft's AI Azure service alone to reach $200 billion in annual revenue in the next five years. The emergence of AI plays right to the strengths of the company's leadership in software. Adding AI to its productivity suite (e.g., in Word, Excel) and cloud services spells significant upside potential for Microsoft's revenue and stock performance over the next decade. Amazon is seeing the same demand for AI in its cloud business as Microsoft is. These two companies, along with Alphabet's Google Cloud, are the big three that will likely continue to dominate the market for AI services over the long term. What makes Amazon stand out is its dominant e-commerce business, where the company can use its AI capabilities to bolster its advantages over competing retailers. In its fourth-quarter earnings report, management said that generative AI will continue to be an area of focus. New AI tools, such as the recently announced Rufus shopping assistant, could enhance the browsing experience by allowing customers to find exactly what they are looking for, increasing traffic and order frequency, and therefore solidifying its competitive position. Amazon's cloud business gives it enormous advantages that will allow it to use AI to transform the retail business in ways other retailers won't be able to keep up with. It's already reworking its cost structure to boost its cash resources for future investment. Amazon has been streamlining its inventory assortment across its regional fulfillment centers to lower costs and boost profits. Over the last four quarters, it generated $32 billion in free cash flow on $574 billion of revenue. There's more coming beyond Rufus. Amazon has a massive amount of customer data that will lead to more tools to enhance the shopping experience. In noting the opportunities to transform the customer experience with AI, CEO Andy Jassy said, \"We believe it will ultimately drive tens of billions of dollars of revenue for Amazon over the next several years.\" It's for these reasons the stock is surging back toward its previous peak and will almost certainly hit new highs over the next decade. The growing $5 trillion global e-commerce market is enough opportunity on its own for Amazon to enjoy plenty of long-term growth. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Ballard has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Goldman Sachs Group, and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}