{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.fudzilla.com/news/58392-microsoft-boss-turns-company-around-in-10-years",
    "text": "It is worth ten times more While we might miss the shy and retired former Microsoft CEO Steve [there’s a kind of hush] Ballmer, his replacement has undoubtedly done a lot better with the company. When Satya Nadella took over the software firm in February 2014, it was stuck in a rut and worth just over €270 billion. A decade later, Microsoft's value has shot up ten times, to €2.76 trillion, making it the world's top public company, cleaning Apple’s clock and a significant player in critical areas, like cloud and AI, As Nadella celebrates his 10th anniversary as the boss, he's widely praised across the tech world for changing the story at Microsoft, whose shares dropped a third during Ballmer's 14 years. At that time, the company was crushed by Google in web search and mobile and missed social media. Many tech experts and investors would say that thanks to Nadella, Microsoft is now ready to be a force for the future. In a 2020 chat, Pat Gelsinger, then-head of VMware, said selling his company's software on Microsoft's Azure cloud was like a \"Middle East peace deal.\" In the Nadella era, Microsoft has also given to open-source projects, launched software under open-source licences and launched a version of its Teams chat app for Linux. In 2018, Nadella liked buying GitHub just 20 minutes after Nat Friedman, then a Microsoft bigwig, started selling him on it. Straight away, Nadella said that Friedman should be GitHub's new boss, Friedman said. Microsoft paid €6.77 billion for the code-storing start-up. While Nadella may not be as fun, he's shown to be better than Ballmer regarding deals. As well as GitHub, Nadella has bought pricey firms like LinkedIn, Minecraft maker Mojang, and Nuance Communications that have added to Microsoft's money. More recently, Nadella helped Microsoft bag the €67.7 billion buy of game maker Activision Blizzard.   "
}