{
    "title": null,
    "date": "2/15/2024",
    "url": "https://www.computerworld.com/article/3712941/microsoft-and-google-invest-in-ai-in-europe.html",
    "text": "By Grant Gross Computerworld | Google parent company Alphabet and Microsoft have both announced huge investments in artificial intelligence in Western Europe this week, likely to get ahead of proposed European Union AI regulations likely to be introduced in April. A new Google AI hub in Paris will eventually host more than 300 Google researchers and engineers, including members of the Chrome and YouTube development teams, according to the French Finance Ministry. The goal of the new AI hub is to accelerate the development of AI-based products in France, to create new academic and research partnerships, and to increase adoption of AI tools among French workers, the French Finance Ministry said in a Feb. 14 news release. France has promoted itself as a European hub for AI development. For example, Mistal AI, a French AI company, was founded in April 2023 by researchers who previously worked for Google DeepMind and Meta. The company already has a valuation of about US $2 billion, with an early funding round raising about US $415 million. Meanwhile, Microsoft will invest €3.2 billion (US $3.4 billion) by the end of 2025 to build up the company’s AI infrastructure and cloud capacity in Germany. “Microsoft is committed to enabling companies across the German economy to use AI to remain at the cutting edge of global competitiveness,” Microsoft President Brad Smith wrote in a Tweet. “This … investment will double Microsoft’s AI infrastructure and cloud capacity to meet the country’s accelerating demand for AI services.” German Chancellor Olaf Scholz praised the investment, saying in a news release that it will improve the computing infrastructure in the county and strengthen the German AI ecosystem. The investment will be used to build new data centers near Frankfurt and in North Rhine-Westphalia, according to Smith. Some of the funding will also go toward training about 1.2 million German workers. Both companies’ investments in Western Europe appear to be an effort to comply with EU AI regulations, said Jason Wong, distinguished vice president analyst at Gartner.“Microsoft, Google, and other companies that host generative AI models will need to build the requisite infrastructure and operations in Europe to be compliant with existing and emerging regulations on AI data and usage by consumers and businesses,” he said by email. This week, two groups of lawmakers in the European Parliament ratified a provisional agreement as a step toward an April vote on landmark legislation that would create the world’s first AI regulations. The proposed EU AI Act would ban the use of AI to create “unacceptable risk,” including cognitive behavioral manipulation of people or classifying people based on behavior, socio-economic status, or other personal characteristics. The legislation would also require AI tools that represent a “high risk” to be registered with the EU. High-risk AI applications include those used in cars, medical devices, and aviation. AI developers would also have to register AIs used in law enforcement, education, operation of critical infrastructure, and several other applications. General-use AIs like ChatGPT or Google’s Gemini would be subject to transparency requirements, including disclosure of content generated by AI. The EU legislation would require AI developers to design their models to prevent them from generating illegal content. Copyright © 2024 IDG Communications, Inc. Copyright © 2024 IDG Communications, Inc. "
}