{
    "title": "Google sounds alarm on Microsoft`s cloud monopoly, calls for regulatory \naction",
    "date": "2/27/2024",
    "url": "https://www.wionews.com/business-economy/google-sounds-alarm-on-microsofts-cloud-monopoly-calls-for-regulatory-action-694303",
    "text": "In an interview, Google Cloud Vice President Amit Zavery expressed concerns over Microsoft's alleged attempts to establish a closed ecosystem, asserting that such a strategy would limit customer choice and hinder technological progress. Alphabet's Google Cloud has intensified its critique of Microsoft's cloud computing practices, cautioning against the emergence of a monopolistic environment that could stifle innovation, particularly in emerging technologies like generative artificial intelligence. In an interview, Google Cloud Vice President Amit Zavery expressed concerns over Microsoft's alleged attempts to establish a closed ecosystem, asserting that such a strategy would limit customer choice and hinder technological progress. Zavery highlighted that Microsoft's historical dominance in on-premise software and raised apprehensions about the company replicating this monopoly within the cloud computing domain. He warned against Microsoft's purported creation of a \"walled garden,\" emphasising the risk of customers being compelled to solely engage with Microsoft's cloud offerings, thereby curbing competition and restricting innovation. Zavery stressed the importance of maintaining an open and competitive cloud market to foster advancements, especially in areas like artificial intelligence. The Google executive urged antitrust regulators to intervene and scrutinise Microsoft's cloud practices to ensure fair competition and prevent monopolistic tendencies. Zavery advocated for regulatory guidance and potential regulations to address what he perceives as anticompetitive behaviour by Microsoft in the cloud computing arena. He highlighted the need to prevent the transition of Microsoft's on-premise software monopoly into a cloud monopoly. In response, Microsoft refuted Google's assertions, asserting that competition in the cloud hyperscaler market remains robust. A Microsoft spokesperson cited independent data showing that Microsoft and Google made incremental gains in 2023, although Amazon Web Services (AWS) continues to maintain a significant lead as the global market leader. Microsoft President Brad Smith indirectly addressed Google's concerns during his keynote address at the Mobile World Congress in Barcelona, highlighting Microsoft's vertical integration across various AI layers. While not explicitly naming Google, Smith's remarks appear to challenge Google's criticisms regarding monopolistic tendencies. Zavery also criticised Microsoft's approach to resolving complaints from individual cloud vendors, alleging that the company's selective agreements fail to address broader industry concerns. He questioned the efficacy of Microsoft's dealings with cloud vendors, suggesting that such practices enable Microsoft to dictate winners and losers within the competitive landscape. (With inputs from Reuters) "
}