{
    "title": "Nvidia Stock Headed To $800, Goldman Sachs Calls It 'Gold Standard' - \nMicrosoft (NASDAQ:MSFT), Meta Platf",
    "date": "2/5/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/36933548/nvidia-stock-on-path-to-800-goldman-sachs-says-industry-gold-standard-for-the-futur",
    "text": "Goldman Sachs raised NVIDIA Corp.’s NVDA 12-month price forecast to $800. The move signals a 21% potential leap from its current levels. It also underscores the bullish approach analysts are taking regarding the company’s pioneering role in the rapidly evolving field of accelerated computing. What Happened: Goldman Sachs analysts Toshiya Hari and Anmol Makkar highlighted “various data points from the broader ecosystem that point to sustained strength in demand for accelerated computing.” A pivotal element of their bullish stance is NVIDIA’s successful foray into AI monetization, particularly its contributions to Microsoft Corp. MSFT’s Azure and Meta Platforms Inc. META revenue streams. Analysts spotlight the optimistic outlook on AI-related capital investments, with Meta’s capex guidance adjustment from $30-35 billion before $30-37 billion being a case in point. This not only reflects a growing commitment to AI but also boosts NVIDIA’s growth narrative. “We believe Nvidia will remain as the industry gold standard for the foreseeable future given its robust hardware and software offerings and, importantly, the pace at which it continues to innovate,” analysts at Goldman Sachs assert. This conviction is backed by the staggering growth of NVIDIA’s market share in the Data Center Compute sector, from roughly 15% five years ago to an overwhelming 75% today. According to Goldman Sachs, projected increases in data center revenue by 14% in the next year are highlighted as pivotal for NVIDIA’s overall revenue surge, with an anticipated uptick of 19.8% in 2024 and 21% in 2025. With an eye on the evolving geopolitical landscape, Goldman Sachs anticipates NVIDIA’s unveiling of export-compliant GPUs tailored for the Chinese market. This move, expected to be confirmed in the upcoming earnings call, aligns with the U.S. government’s updated export regulations and underscores NVIDIA’s adaptability to geopolitical shifts. Risks: Despite the optimistic outlook, Goldman Sachs does not shy away from outlining potential risks, including fluctuations in AI infrastructure spending, further export restrictions, and supply chain uncertainties, among others. Yet, NVIDIA’s valuation, according to Goldman Sachs, suggests an attractive entry point for investors. “NVDA is currently trading well below its historical premium relative to the median stock in our coverage universe,” reinforcing the investment bank’s bullish stance on NVIDIA, especially when considering its revenue forecasts for 2024 and 2025 are significantly above the street’s consensus. Price Action: Shares of Nvidia were up 3.3% in premarket trading on Monday, with the chipmaker giant projected to surpass a $1.7 trillion market valuation. Its performance has increased by 210% from a year ago, and by over 50% in the past three months alone. The VanEck Semiconductor ETF SMH, with Nvidia accounting for about a fourth of its portfolio, was trading 1% higher in the premarket Monday. Read Now: Will Jerome Powell Spoil Wall Street’s Party? US Stock Futures Slip As Fed Chief Maintains Hawkish Tone Ahead Of More Earnings Image: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}