{
    "title": "How I Found the Hottest AI Stock On Wall Street… Before Everyone Else",
    "date": "2/10/2024",
    "url": "https://investorplace.com/market360/2024/02/how-i-found-the-hottest-ai-stock-on-wall-street-before-everyone-else/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. I’m proud to say that I found the company well before it turned into the hottest AI stock on Wall Street. Advertisement Source: Shutter_M / Shutterstock About 20 years ago, Super Micro Computer Inc.’s (SMCI) founder and CEO Charles Liang walked into a movie theater. (I promise this is not the start of a joke.) He sat down and watched “The Day After Tomorrow,” a sci-fi disaster film. In the movie, humans’ high energy consumption from fossil fuels causes extreme climate effects, which ultimately triggers a new ice age. This got Charles to thinking. Super Micro Computer manufactures motherboards, which are circuit boards that contain the principal components of a computer. Now, this requires a lot of energy. So, the movie’s lesson struck him… He decided that his company should design high-efficiency power supplies and then entire systems and data centers. This decision led Super Micro Computer to become one of the best-performing tech stocks of the past few years. I bring this up because there’s a leadership change taking place in the market right now. As you may recall, the “Magnificent Seven” stocks – Amazon.com, Inc. (AMZN), Apple Inc. (AAPL), Alphabet, Inc. (GOOG), Microsoft Corporation (MSFT), Meta Platforms, Inc. (META), NVIDIA Corporation (NVDA) and Tesla, Inc. (TSLA) – dominated the S&P 500 and NASDAQ 100 indices last year. But now, they are beginning to show signs of weakness. Only three of the six stocks that have reported earnings so far have had a great earnings season for the fourth quarter. (NVIDIA reports on Wednesday, February 21, after the bell.) SMCI is now at the head of the pack. It’s hit new highs again and again for the past few weeks. It’s up 159% year-to-date, and is now up a whopping 745% in the last 12 months! So, I’d like to use today’s Market 360 to shine the spotlight on Super Micro Computer and explain what’s behind its explosive rally. I’m proud to say that I found the company well before it turned into the hottest AI stock on Wall Street. So, I’ll also share why I recommended the stock back in 2022 – and if it’s still a buy today. Here’s what you need to know about Super Micro Computer and its massive rally… The company primarily develops computer servers and infrastructure for data centers and the cloud. It has experienced robust demand for these technologies, and also for its AI platform. Now, SMCI’s rally started on Thursday, January 18. Super Micro announced preliminary results for the second quarter of fiscal year 2024. The numbers from the preview were simply stunning, and it was thanks to strong demand for AI servers. Wall Street cheered the news – driving the stock more than 30% higher on Friday, January 19. But that was just the beginning. On Monday, January 29, SMCI released its full quarterly results. During its second quarter in fiscal year 2024, total sales more than doubled year-over-year to $3.66 billion and earnings jumped 71.5% year-over-year to $5.59 per share. The consensus estimate called for earnings of $4.93 per share on $3.06 billion in sales, so Super Micro posted a 13.4% earnings surprise and a slight sales surprise. Thanks to continuing demand, Super Micro also increased its outlook for fiscal year 2024 again! The company now expects full-year revenue between $14.3 billion and $14.7 billion, compared to previous estimates for $10.0 billion to $11.0 billion. In turn, the analyst community has continued to increase earnings estimates for the third and fourth quarters. Third-quarter earnings are now forecast to soar 249.7% year-over-year to $5.70 per share, up from previous estimates for $4.30 per share a month ago. Since then, it’s been off to the races for SMCI.  Super Micro Computer first hit my screens back in June 2022… well before it caught Wall Street’s attention. At the time, it had just achieved record results for its third quarter in fiscal year 2022. Third-quarter revenue jumped 51% year-over-year to $1.36 billion, which topped analysts’ estimates for $1.32 billion. Earnings soared 210% year-over-year to $1.55 per share, compared to $0.50 per share in the third quarter of 2021. Analysts expected earnings of $1.12 per share, so SMCI posted a 38.4% earnings surprise. When I saw that SMCI also earned an A-rating in Portfolio Grader for both its Fundamental and Quantitative Grades, I knew it was time to buy. So, I recommended that my Accelerated Profits subscribers scoop up shares of SMCI while it was still trading around $50. Since then, SMCI is up an incredible 1,332% on my Accelerated Profits Buy List!  Given SMCI’s incredible run this year, I know some folks have started to wonder… is SMCI still a good buy? Well, according to my Portfolio Grader, that’s a big yes.  As you can see in the report card above, SMCI still holds an A-rating, and although its Fundamental Grade has dropped to a B-rating, it’s still a good buy. Now, SMCI does trade at 21.6 times forecasted median earnings, but it also has 204% forecasted sales growth and 249.7% forecasted earnings growth. In other words, as long as earnings continue to work, SMCI could easily continue to rally. The bottom line: SMCI is a great stock (it’s one of my favorite AI stocks) with huge upside potential. I also think SMCI will continue to lead the market. In fact, I believe many of my Accelerated Profits stocks will continue to emerge and lead the market higher. Currently, my Buy List is characterized by 36.8% average forecasted sales growth and 204.6% average forecasted earnings growth. And the stocks on my Buy List have also benefited from positive analyst revisions. My Accelerated Profits Buy List stocks are the crème de la crème of the stock market – the stocks that are primed to post strong earnings results. If you join me at Accelerated Profits, you’ll get immediate access to my Buy List today. Not only that, but you will also get access to my Monthly Issues, Weekly Updates, Special Market Podcasts – and much more. Click here to sign up for Accelerated Profits now. (Already an Accelerated Profits member? Go here to log in to the members-only website.) Sincerely, Louis Navellier Editor, Market 360 The Editor hereby discloses that as of the date of this email, the Editor, directly or indirectly, owns the following securities that are the subject of the commentary, analysis, opinions, advice, or recommendations in, or which are otherwise mentioned in, the essay set forth below: Super Micro Computer, Inc. (SMCI), Microsoft Corporation (MSFT) and NVIDIA Corporation (NVDA)   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/02/how-i-found-the-hottest-ai-stock-on-wall-street-before-everyone-else/. ©2024 InvestorPlace Media, LLC Stocks to Buy Artificial Intelligence Market Analysis Stocks to Buy Uncategorized Stocks to Buy Stocks to Buy Stocks to Sell Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}