{
    "title": "Ten Namibian dollars for Microsoft shares – Windhoek Observer",
    "date": "2/16/2024",
    "url": "https://www.observer24.com.na/ten-namibian-dollars-for-microsoft-shares/",
    "text": "FNB Namibia announced this week the dual listing of the FirstRand Bank Limited Exchange Traded Note (ETN) programme on the Namibian Stock Exchange (NSX). The ten listed instruments will provide ordinary Namibians the ability to invest in quality international companies like Amazon, Berkshire Hathaway and Microsoft with for as little as N$10. FNB said International diversification is important to any investment portfolio and the FNB ETN’s provide an easy and cost-effective manner to start diversifying your investment portfolio. “The ETN note programme makes use of the concept of micro investing thus promoting financial inclusion. Because the programme is listed on the Namibian Stock Exchange the ETN’s may be purchased directly through your local NSX stockbroker without the need of complex offshore account opening process which requires large investment amounts. Each ETN represents a fractional share in each of the companies listed and provides full protection against any currency depreciation of the Namibia Dollar, that is it is like owning the share directly offshore just in a more affordable and accessible manner.” In addition to the eight quality international companies, there is also an ETN that provides exposure to the iShare core MSCI World index. This index provides exposure to more than 1500 of the world’s largest companies across more than 20 countries. This provides investors in Namibia with a unique opportunity to ensure that the offshore component of their investment portfolio is fully diversified – the iShares fund is managed by BlackRock – the world’s largest portfolio manager. FNB said another widely diversified index being provided is the MSCI Socially Responsible Investment Index. This ETN is ideal for the ESG conscious investor as the index seeks to overweight global companies with good environmental and social scores whilst not investing in controversial investments like weapons manufacturing. The index provides global diversification to more than 400 companies and is managed by UBS. FNB said as the ETN’s are listed instruments these can only be traded through a registered Namibian stockbroker. The ETN’s have an embedded management fee of 1% and is worked into the price at which the ETN trades on the exchange. “FNB also provides active market making on the primary exchange ensuring that sufficient liquidity is always available to exit your investment.”   "
}