{
    "title": "Why FOMO Is Fueling Nvidia Stock",
    "date": "12 hours ago",
    "url": "https://www.vanityfair.com/news/nvidia-stock-ai-fomo",
    "text": "To revisit this article, visit My Profile, then View saved stories. By Nick Bilton In mid-October 2022, Nvidia, the AI chipmaker, was worth around $280 billion. Less than a year and a half later, the company is worth $2.2 trillion. Yes, that’s an eight-times increase—from a relatively sane number with a b (billion) to a truly insane number with a t (trillion)—in just 17 months. That growth is because of the frothy excitement, or perhaps frothy insanity, around AI in Silicon Valley. In fact, Nvidia might be one of the most talked-about stocks in recent history. It’s constantly mentioned on CNBC and debated on social media, and it’s part of the buy-buy-buy circuit for almost every tech and Wall Street analyst, investor, or armchair stock dabbler I chat with. And while there is a legitimate reason to discuss the value of the company that is making AI chips for virtually every major tech firm, including Amazon, Alphabet, Meta, Microsoft, and OpenAI, the endless discussion of Nvidia’s valuation and stock price is being driven by one distinct thing: FOMO. This fear of missing out on another tech boom has not only engulfed Nvidia but also spread across the entire sector—particularly with AI, Bitcoin and all things crypto, as well as the makers of GLP-1 drugs being used for weight loss (think Ozempic). These surges are emblematic of a broader trend in which both seasoned and novice investors pour money into what they perceive as the next big thing, but risk causing the collapse of these potential next big things by doing so. Similarly, other AI-related tech stocks, like C3.ai and Palantir, are experiencing valuations that are incredibly high. Fueling the insanity of these tech stocks is none other than social media, with everyone sharing screenshots of their “hot” stock take and how much money they’ve made. This frenzied investment landscape is leading to a greater concern among lots of investors that they have missed out on significant moneymaking opportunities, which ironically is the same sentiment that is fueling this ongoing cycle of irrational exuberance, where we start to reach that thin line between opportunity and volatility. Depending on whom you ask, we’re either just at the beginning or coming to the end of the cycle. One investor, who has been talking to me about his Nvidia investment for the past year as if it were his favorite child, thinks this is just the start. “AI is shaping up to be an investor’s dream come true. It’s all about huge promises and the potential for staggering profits that seem limitless,” he told me. “We’re really just at the beginning, and there’s a sense that the next few years could generate wealth for generations. It’s like trying to catch lightning in a bottle to find that one standout stock.” Another institutional investor sees it differently, telling me this is no different from tulip mania, the housing crisis, or the dot-com collapse. “It’s a bubble. It’s a bubble. It’s a bubble,” the institutional investor said. “The question, which is the question with all bubbles, is: Does a stock like Nvidia collapse at $1,000 a share or at $25,000 a share? It’ll definitely fall; it’s simply not sustainable. But timing is the key here to winning big or losing everything.” Suppose the housing crisis had Bear Stearns as its poster child, which collapsed when the mortgage-backed securities market imploded. Then the dot-com bubble had pets.com as its symbol of excess and failure, as it went from an IPO worth hundreds of millions of dollars to bankruptcy almost overnight. Today’s poster child is clearly going to be Nvidia. Many wonder if Nvidia’s staggering $2.2 trillion valuation reflects its underlying value or represents an overly bloated figure disconnected from the company’s financial health. Only time will tell if the company can justify growing even more, if its financial metrics justify such a colossal market cap, or if we are witnessing a speculative bubble inflated by the frenzy around artificial intelligence. While it’s impossible to predict where we are in the mountainous financial landscape of peaks and dips, it’s clear that there is a frenetic level of FOMO-ism around AI. On Monday evening, Nvidia took over a convention center in San Jose. The company’s leather-jacket-wearing CEO, Jensen Huang, unveiled the latest AI chips to throngs of adoring fans. One person I spoke to at the event likened it to seeing a rock star’s concert in the 1980s. Another analyst dubbed it the “AI Woodstock.” And on social media, frantic investors, programmers, and Nvidia fans (yes, they’re a thing) posted photos of a computer chip called Blackwell as if they had captured the moment Michael Jackson did the moonwalk for the first time. But it’s not just Nvidia that has been taken by extreme FOMO. Even crypto has made a vertiginous comeback, driving the weirdest asset on earth to new heights. Though Bitcoin fell to around $16,000 last November and didn’t seem like it would ever make a comeback, mainstream retail investors are again increasingly flocking to Bitcoin and its associated ETFs. Buyers have started scooping up more of this nebulous digital thing with no physical value or mainstream use case. As such, the market has driven Bitcoin to break records, with the cryptocurrency surpassing $70,000 a coin earlier this month. Memecoins and shitcoins and even NFTs are making a comeback. A venture capitalist told me the problem is that there is just too much money flowing into tech, and as a result, everything is rising—and not necessarily in a good way. “Too much water, and you get malarial mosquitoes; too much cash, and you get shitcoins,” the VC aptly noted. You can look further than tech companies to see other markets’ valuations also soaring because of FOMO. For example, several of the Big Pharma companies producing GLP-1 drugs like Ozempic and Mounjaro have also seen their market caps skyrocket, with stocks like Eli Lilly and Novo Nordisk more than doubling or nearly doubling over the past year. So how does this all end? The institutional investor thinks badly. “We have two Americas right now. We have the America where people have money in the markets, and they are chasing three exciting narratives—GLPs, AI, and crypto—in the face of irrationality in the markets. And the FOMO is getting out of control,” he said. “Then you have another America, who, despite what the Consumer Price Index claims, can’t afford their rent, can’t afford food, and can’t afford to take their kids to Disneyland, or even to the movies. If this divide continues, the American experiment and capitalism itself are at risk.” Once again, we’re at a crossroads similar to what was faced in 1636 (tulips), 1999 (dot-com), and 2008 (housing), with speculation and innovation indistinguishably intertwined. As more companies grow to trillion-dollar valuations, or companies like Nvidia grow to be worth another trillion and another and another, it’s become increasingly clear that the current euphoria surrounding companies like Nvidia—and, by extension, the broader tech, crypto, and pharma markets—is a double-edged sword. For some, there have been unprecedented opportunities for wealth creation. But the FOMO investors are only adding pressure to pressure points already set to burst, and if this bubble collapses—or should I say, when it collapses—it could bring more than just Nvidia down with it. The Dream House That Became a Nightmare on Hollywood Boulevard Lorraine Nicholson’s Childhood at the Playboy Mansion How a Murder Spree Collided With Hollywood’s Punk Revolution Inside Trump’s Pants-Pissingly Terrifying Plans for a Second Term Who Were the Swans? A Deep Dive into Truman Capote’s Best Frenemies Queen Elizabeth’s “Awkward” Evening With the Kennedys From the Archive: The Bettencourt Affair (2010) Stay in the know and subscribe to Vanity Fair for just $2.50 $1 per month. By Kase Wickman By Mark McKinnon By Savannah Walsh By Karen Valby By Scott Nover By Bess Levin By Jack McCordick More from Vanity Fair Contact © 2024 Condé Nast. All rights reserved. Vanity Fair may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Entertainment "
}