{
    "title": "Tech Fund Beating 99% of Peers Says AI Rally Is Just Starting",
    "date": "6 hours ago",
    "url": "https://finance.yahoo.com/news/tech-fund-beating-99-peers-030839409.html",
    "text": "(Bloomberg) -- The artificial-intelligence stock rally is far from over, according to the manager of one of the best-performing tech funds this year. Most Read from Bloomberg Baltimore Wants to Sell Hundreds of Vacant Homes for $1 Each Sam Bankman-Fried Says 50-Year Sentence Only Suitable for a ‘Super Villain’ Justice Department to Sue Apple for Antitrust Violations as Soon as Thursday Trump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New Team Fed Signals Three Rate Cuts Are Still Likely, Despite Inflation Uptick Tony Wang, whose $9 billion T Rowe Price Science & Technology Fund beat 99% of peers last year too, says the AI sector isn’t in a bubble. Nvidia Corp., the poster child for the AI craze that’s up more than 80% year-to-date, is the fund’s biggest holding. Multiples “are very reasonable right now,” Wang said in an interview. “We will get a downturn eventually, but I think it’s really hard to call the top here and I think it still feels a little early.” Nvidia’s stellar earnings results in the past couple of quarters helped trigger a fierce rally in AI-related stocks like its supplier Taiwan Semiconductor Manufacturing Co. and others like Micron Technology Inc. They’re riding on optimism that an inflection point has arrived thanks to accelerated computing. But the speed and pace of the rally have caused skepticism and rekindled memories of the dot-com bubble in the late 1990s, when fund managers like Ryan Jacob rode the hot tech market to triple-digit annual returns. The Nasdaq Composite Index almost quadrupled from the end of 1996 through its peak in March 2000, before tumbling nearly 80% to a 2002 trough. To Wang, a crucial difference with the current rally as compared to the dot-com bubble is backing from real corporate profits, rather than pure valuation expansion. Nvidia, for example, is trading at about 35 times forward earnings, down from a peak around 70 in 2021. So he’s taking advantage of the skepticism. “Heading into the year, the reason why we bet so big on AI and Nvidia is because everyone was concerned about it,” Wang said. “They have like tremendous free cash flow, they’re well capitalized, they have real businesses.” Nvidia’s GPU Earlier this week, Nvidia’s co-founder Jensen Huang answered critics with a new GPU, Blackwell, the next generation of its hardware that is multiple times faster at handling the models that underpin AI. Nvidia Expects to Win Outsized Chunk of Data Center Spending Wang isn’t bullish on everything. He sold holdings in Chinese companies and invested them in US names this year. His fund exited China’s biggest stocks including Baidu Inc. and Alibaba Group Holdings Ltd. — which have been boosting spending on their own large language models. Now he holds a small number of Chinese companies. He cited opportunity cost as a key reason. “There’s a ton of innovation in the US where companies are seeing significant AI traction and earnings acceleration,” Wang said. “That’s where I’m finding the most opportunities.” Most Read from Bloomberg Businessweek Elon Musk’s Don Lemon Implosion Selling Shohei Ohtani: Can Baseball’s Biggest Talent Transform the Sport? OpenAI Sprinting to Keep Up With Startups on AI-Generated Video Julius Baer Hits Reboot to Escape Swiss Banking’s New Malaise China’s Super-Cheap EVs Offer Hope for Average American Buyers ©2024 Bloomberg L.P. Related Quotes "
}