{
    "title": "Google Stock Perks Up, Joins Nvidia On Breakout Index",
    "date": "11 hours ago",
    "url": "https://www.investors.com/research/breakout-stocks-technical-analysis/google-stock-joins-nvidia-on-breakout-index/",
    "text": "BREAKING: Futures Tilt Higher, Micron Soars     While shares of Tesla (TSLA) have become a sloppy mess and Apple (AAPL) remains mired below its 10-week and 40-week moving averages, fellow Magnificent Seven stocks Meta Platforms (META), Microsoft (MSFT) and Amazon (AMZN) continue to hold near their recent highs. But only two Mag 7 names — the omnipresent Nvidia (NVDA) and newly resurgent Google stock — make this week's update of the IBD Breakout Stocks Index. After hitting an all-time high in December, Apple pulled back, ultimately falling below its 50-day and 200-day moving averages. In a further sign of technical weakness. the shorter-term 21-day and 50-day lines have slowly slipped below the longer-term 200-day benchmark. But the iPhone maker has now popped back above its 21-exponential moving average. Shares of Google-parent Alphabet (GOOGL) have rebounded back above the 10-week moving average. The online search, artificial intelligence and cloud computing leader has formed an early stage consolidation pattern showing a 153.78 buy point. On Monday, Google stock gapped up in heavy volume on a report that said Alphabet and Apple are in talks to license Alphabet's Gemini AI training model for use in Apple's iPhones. Google soared above its 50-day line and cleared the 150 mark before pulling back. Yet it closed with more than a 4% gain on Monday. Shaking off a hiccup on Tuesday, the stock rose over 1% Wednesday in light volume. See Who Joins Google Stock, Nvidia On The IBD Breakout Stocks Index As Google stock looks to build on Monday's gap-up in heavy volume, shares of Nvidia, Meta, Microsoft and Amazon show tight, healthy trading. Just named a top pick by a team of Mizuho analysts, Meta stock continues to hold the big gains from a \"monumental\" earnings report in February. It recently cleared a 488.62 buy point it cleared in a three-weeks-tight pattern. Amazon and Microsoft are also holding strong above their 10-week moving averages. AI and Wall Street superstar Nvidia is on pace for a third-straight week of tight closes. Since breaking out in January, shares of Nvidia stock have skyrocketed to just under 900. On Monday, Nvidia previewed its next-generation AI computing platform, Blackwell. The company also highlighted how it is bringing AI technology into industries like health care, manufacturing and beyond. In other news, Nvidia is collaborating with Teradyne (TER) to bring AI capabilities to the industrial-equipment maker's commercial robots. Nvidia plans to price its latest AI processor for data centers at only a modest premium to its current processors. The strategy is to avoid losing market share to Advanced Micro Devices (AMD), which has ramped up its rivalry with Nvidia. The IBD Breakout Opportunities ETF (BOUT) from Innovator Capital Management tracks the IBD Breakout Stocks Index. As with other index ETFs, this fund allows you to invest in the entire index in addition to, or rather than, buying individual issues such as Google stock. Learn more here about the ETF and Innovator. Follow Matthew Galgani on X (formerly Twitter) at @IBD_MGalgani. YOU MAY ALSO LIKE: Apple, Google In Talks Over Gemini AI System Licensing For iPhone Yes, Top Funds Adore Nvidia. But They Love This Non-AI Sector. Nvidia Reveals 8 'Secrets' For When To Sell Stocks. No. 2 Is Key. MarketSmith Is Now MarketSurge. Explore What Else Is New. IBD Meetup Groups: How To Invest In Stocks — Socially 3/20/2024\nThe Justice Department reportedly will file an antitrust suit as soon as Thursday for alleged iPhone dominance. Apple stock fell... 3/20/2024\nThe Justice Department reportedly will file an antitrust suit as... Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}