{
    "title": "Isn't Nvidia (NASDAQ:NVDA) Stock Overvalued? Not Quite",
    "date": "6 hours ago",
    "url": "https://finance.yahoo.com/news/isn-t-nvidia-nasdaq-nvda-032248694.html",
    "text": "Nvidia (NASDAQ:NVDA) has been one of the best-performing stocks globally over the past 18 months. The chip manufacturer’s shares are up nearly 7x over the period. This extraordinary growth can certainly turn some investors off, making them believe it’s overvalued. However, it’s worth remembering that momentum can actually be one of the best indicators of forward stock performance, especially if the company has a track record of beating expectations. Personally, I remain bullish on NVDA stock, not just because of momentum but because the company is so central to the AI revolution, which has only just begun. Nvidia, as a company, is at the very heart of the AI revolution due to its graphics processing units (GPUs), which possess the capabilities required for huge AI and large language models. The units were originally built for the gaming sector, but GPUs are also perfect for AI’s massive data processing needs. Unlike central processing units (CPUs) that handle tasks one by one, GPUs excel at parallel processing, allowing them to take on multiple tasks simultaneously. Without this technology, the step forward we’ve seen in AI, which includes developments in facial recognition technology and self-driving cars, wouldn’t be possible. Nvidia’s dominance stems from the architecture of its GPU. Unlike CPUs with a few cores, Nvidia packs a massive number of cores onto a single chip. In turn, this allows for high processing power within a smaller space, and this is hugely important for efficient AI processing. Moreover, Nvidia has focused on high-bandwidth memory, which allows these cores to access data rapidly, further accelerating AI computations. As such, Nvidia has earned a significant edge in the AI hardware race. However, in the AI world, it’s not just about hardware. Nvidia’s CUDA software provides direct access to the GPU’s virtual instructions. This software ecosystem empowers developers to build and refine AI projects and has made Nvidia a one-stop shop for all things AI. Nvidia stock is expensive in that it’s becoming less affordable for many investors. Trading around $900 a share, some investors may struggle to purchase a single Nvidia share as part of a diverse portfolio of holdings. However, from a valuation perspective, I don’t think Nvidia stock is expensive or overpriced. In fact, it may still represent good value. Nvidia currently trades at 35.4x forward earnings, making it more expensive than the S&P 500 (SPX), but it’s by no means too expensive for the tech sector. Moreover, the company is expected to continue delivering stellar growth throughout the medium term. In fact, Nvidia’s earnings are forecasted to grow by 34.78% annually throughout the medium term. This means that Nvidia’s all-important PEG ratio is 1.02. While 1.0 may be considered the benchmark for fair value, I still think this represents good value, noting long-term trends in the AI industry and the market’s bullishness on U.S. tech. In turn, this means that Nvidia is trading at 29.77x earnings for 2026, 25.26x earnings for 2027, and 21.49x earnings for 2028. Moreover, it’s worth recognizing that Nvidia just keeps on beating analysts’ most bullish forecasts. That’s always a good sign, and maybe it could continue to beat expectations, going forward. Due to its enabling position in the AI revolution and its attractive valuation metrics, Nvidia stock earns a Strong Buy from analysts. Currently, Nvidia has 39 Buys, two Hold ratings, and zero Sell ratings. The average Nvidia stock target price is $913.74, inferring 1.1% upside potential. The highest share price target is $1,200, and the lowest share price target is $608.40. Nvidia has been central to the AI revolution, but there are two important things to consider moving forward: Nvidia’s competitive advantage in the all-important generative AI market and the fact that the AI revolution has only just begun. Over the past 18 months, Nvidia has found itself with a formidable moat, which it has successfully built upon. Other companies, including Intel (NASDAQ:INTC), have eyes on Nvidia’s crown, but it’s not clear how they will catch up. The Santa Clara-based firm’s new H200 chipset is the must-have for generative AI and large language models. The H200 is thought to be between 1.4 and 1.9 times faster than the H100 when it comes to large language model inference. That’s an impressive jump in just one year. Moreover, the market is growing and has the potential to grow much faster. SoftBank’s (OTC:SFTBY) Masayoshi Son is considering a $100 billion venture in the AI chip space, and OpenAI’s Sam Altman is reportedly looking for $7 trillion for a string of AI chip factories that would respond to burgeoning demand and restructure the world’s semiconductor sector. Given the near-term momentum in the sector, the fact that demand for GPUs still outstrips supply, and the fact that we really are just at the start of the AI revolution, I remain bullish on Nvidia. Disclosure Related Quotes "
}