{
    "title": "Nvidia Stock: Chipmaker Looks To Maintain AI Market Share",
    "date": "11 hours ago",
    "url": "https://www.investors.com/news/technology/nvidia-stock-nvda-blackwell-gpu-pricing-amd-ai/",
    "text": "BREAKING: Futures Tilt Higher, Micron Soars     Nvidia (NVDA) plans to price its latest AI processors for data centers at only a modest premium to its current processors to avoid losing market share to AMD (AMD) and other competitors, Wall Street analysts say. Nvidia stock rose on the news. Chief Executive Jensen Huang told CNBC that Nvidia's upcoming Blackwell graphics processing units will cost between $30,000 and $40,000 per unit. That compares with $20,000 to $30,000 for the current Hopper series H100 GPU, according to analyst estimates. Huang later added that the GPU is just one component to building a data center for artificial intelligence or high-performance computing. \"The more modest pricing (for Nvidia's Blackwell GPUs) was perceived as positive for (Nvidia) stock,\" Jordan Klein, managing director for tech, media and telecom sector trading at Mizuho Securities, said in a client note. \"It opens the door for more customers to buy vs. only the highly concentrated massive capex spenders in cloud hyperscalers and wealthy sovereign nations.\" Nvidia is choosing to expand the market and maintain market share rather than pursue \"pure margin and profit,\" Klein said. At the same time, Nvidia wants to remain competitive with competing AI chipmakers, he said. Meanwhile, the lower-than-expected pricing on Blackwell GPUs is a \"potential negative\" for AMD stock, Klein said. AMD is likely charging about $25,000 for its MI300 accelerator, he said. However, the high demand for AI processors overall and tight supply for Nvidia chips should help AMD, Klein said. On the stock market today, AMD stock fell 0.9% to close at 179.73. However, Nvidia stock rose 1.1% to 903.72. Nvidia is pricing Blackwell chips \"at more competitive price points than our earlier assumptions,\" Morgan Stanley analyst Joseph Moore said in a client note. Those price points will \"likely dent the enthusiasm for alternatives to Nvidia, both merchant and custom silicon,\" he added. Moore rates Nvidia stock as overweight, but he has a price target of 795. BofA Securities analyst Vivek Arya said Nvidia should be able to maintain its gross profit margins in the mid-70% range, even with the modest price increase for Blackwell chips. That's because Nvidia is likely to sell a richer mix of chips, switches, networking and full systems, Arya said in a client note. Arya rates Nvidia stock as buy with a price target of 1,100. \"We expect Blackwell adoption to be one of the fastest in company history given its 'affordable' price for all customer types,\" Arya said. Nvidia is holding its GTC 2024 conference this week in San Jose, Calif. The four-day event ends Thursday. Follow Patrick Seitz on X, formerly Twitter, at @IBD_PSeitz for more stories on consumer technology, software and semiconductor stocks. YOU MAY ALSO LIKE: Nvidia Is A Step Or Two Ahead Of AI Chip Rivals: Analyst Super Micro Computer Shares Extend Slide After Stock Sale Pricing Apple's AI Focus Could Crimp Profit Margins, Analyst Says Nvidia Adds AI Smarts To Teradyne Industrial Robots See Stocks On The List Of Leaders Near A Buy Point 3/20/2024\nBuying just one share of the typical S&P 500 stock will now cost you a steep $217. And don't count... 3/20/2024\nBuying just one share of the typical S&P 500 stock... Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}