{
    "title": "AMD Ryzen 9 7900X review",
    "date": "1/22/2024",
    "url": "https://www.wepc.com/cpu/review/amd-ryzen-9-7900x-review/",
    "text": "Home » CPU » CPU Reviews » AMD Ryzen 9 7900X review AMD’s Ryzen 7000 series CPUs are here, here’s what we think of the Ryzen 9 7900X so far. WePC is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more AMD has finally released its Ryzen 7000 series CPUs. The wait that felt like forever is finally over. In this review, we will explore the performance, price, specs, use case, and many more aspects of the Ryzen 9 7900X. As well as giving our two cents on the CPU. We have plenty to say about the 7900X, from the brand new Zen 4 core architecture to the strange new IHS design. We’re going to analyze everything new with the 7900X, and the 7000 series in general. Here’s our Ryzen 9 7900X review. Now read: AMD Ryzen 5 7600X review. In our sights today is the Ryzen 9 7900X, the second-highest SKU in the AMD Ryzen 7000 series. Cores 12 Threads 24 Base speed 4.7GHz Boost speed 5.6GHz Cache L3 64MB Socket AM5 Before we fire into the performance of the Ryzen 9 7900X, we must get a grasp of the specifications we’re working with. Spoiler alert: they are very impressive. The specifications of the Ryzen 9 7900X are as follows. As you can see, the 7900X has a pretty impressive list of specifications. We’re excited to see the max boost speed climb higher and higher as we ascend the list of Zen 4-powered CPUs. There’s a lot that has changed in AMD’s newest CPU generation. So to kick things off, let’s start with the architecture itself. The new architecture is named Zen 4 and is built upon TSMC’s 5nm manufacturing process. This is tiny compared to the 7nm process of the 5000 series CPUs. But what does this mean? Essentially, the smaller the manufacturing process, the smaller the transistors inside the CPU core. Transistors are little yes/no logic gates that when put together, are capable of complex instruction. So the more you have the better. More transistors mean that the CPUs ability to process instructions increases, meaning the CPU core’s IPC is higher. AMD aimed for an IPC increase of around 10% over Zen 3 when designing the new Zen 4 CPU core, but overshot that mark, achieving a massive 13% IPC increase. AMD has finally made AM4 obsolete and has instead opted to create an entirely new socket, the AM5 socket. Socket AM4 as amazing as it was can no longer keep up with the advancement of PC hardware so it had to be dropped in favor of a newer, more up-to-date solution. Check out our AM5 motherboard piece if you want to know more. AMD still plans on supporting AM4 and its security and stability through BIOS updates, however, so don’t panic. AM5 brings with it a new socket type, LGA 1718, named after its number of pins. AMD has opted to adopt the socket type that Intel holds near and dear to its heart, LGA. LGA offers way more pin density than PGA (pin grid array), allowing motherboard manufacturers to pack more features into their motherboards. And the cost of AMD is far less when manufacturing LGA-based CPUs, allowing the CPUs to be less expensive at launch. AMD Ryzen 7000 series CPUs as of now are all DDR5 memory-based CPUs. As far as we know AMD has no plans to support the older DDR4 memory standard on the new AM5 and Zen 4 platforms. Well strictly speaking it’s the motherboards that aren’t compatible, but by extension, that means the CPUs aren’t either. The new AM5 socket retains AM4 cooler compatibility. meaning you can use the AM4 portion of your CPU cooler’s mounting hardware to extend your CPU cooler to the AM5 platform. That’s not to say that you should, however. AMD Zen 4 CPUs are recording record high temperatures across the board and are requiring the best cooling solutions to keep temps at bay. More on that later. Lending somewhat into the last new feature, the IHS design looks like something out of an 80’s sci-fi movie, and we love it. The industrial look of the CPU makes it almost a shame the CPU gets covered by a cooler. One piece of first-hand advice, don’t overload it with thermal paste because it’s almost impossible to clean off. The reason the IHS is designed this way is so AMD can retain the AM4 cooler compatibility with AM5 CPU sockets. But boy does it look cool. The performance of the Ryzen 9 7900X is leaps and bounds above some of the other newer CPUs we have tested, and it serves as a testament to just how far AMD has come over the last five or so years. We’ve been following the development of Zen 4 CPUs for around nine months now, and we think that the 7900X is one of the most exciting in the series for a few reasons. We tested the Ryzen 9 7900X in both synthetic and real-world gaming scenarios. The former of which we’ll display first. Before that, however, we need to outline the system we used to test this formidable CPU. The test bench we used to test the Ryzen 9 7900X consisted of: For the majority of the performance segment, we will be comparing the 7900X against the last generation’s Ryzen 9 5900X. As this is the predecessor to the Ryzen 9 7900X. In this segment, we ran the 7900X through synthetic software that’s widely regarded as the industry standard benchmarking software. We ran the Ryzen 9 7900X through CPU Z, Cinebench R23, and Geekbench 5. Reporting on both single and multi-core scores. As we have already said a few times throughout this review, we’ve been incredibly impressed with this CPU. And now you’re going to see why. CPU-Z is one of the world’s leading CPU identification software, handy as it has in-built benchmark software. In CPU-Z the single-core CPU scores are over 120 points higher than 5900X’s. The Ryzen 9 7900X scored a massively respectable 789.1 points in single-core benchmarks, whereas the 5900X only scored 680.2 points. It’s no surprise that AMD has managed to massively surpass the last generation of CPUs, as AMD has been advertising the IPC improvements and single-core performance uplifts for around a month now. These results lend their hand to the increased IPC of the Zen 4 architecture. Interesting to see AMD lean so strongly into single-core performance, as multi-core performance has always been where AMD broke records. Back to the benchmarks then, the Ryzen 9 7900X scores a huge 11,827.7 points, whilst the 5900X trails behind with a score of 9,516.5 points. That’s well over 2,000 pints difference. So, it’s not just single-core performance that the 7900X has over the previous generation. Good to see AMD still going strong. All of these results equate to around a 23% increase in performance over the last generation Ryzen 9 5900X. Cinebench is one of the most notorious CPU benchmarking software available, Cinebench is known for putting even the strongest CPUs through its paces in terms of synthetic rendering workloads. Here are the single-core benchmark results The AMD Ryzen 9 7900X manages to score a massive 2,022 points in the Cinebench single-core benchmarks. This is miles ahead of what the Ryzen 9 5900X managed to achieve. The 5900X brought home 1,591 points, which was respectable two years ago but almost 450 points behind the Ryzen 9 7900X. Here you can see the 13% higher IPC of the Zen 4 CPU cores at work. When we assess the multi-core benchmark results, the Ryzen 9 7900X somehow gets even more impressive. The 7900X managed to score an incredible 28,379 points in the Cinebench multi-core benchmarks, The Ryzen 9 5900X managed nowhere near that, bringing in a score of 21,103. Again, this was respectable two years ago but won’t cut it anymore. All the results here amass to an average performance improvement of 33%. This is based on both results combined. Geekbench is an incredibly in-depth benchmark software that synthetically tests many aspects of your CPU. anything from image compressing to AI capabilities, this software tests it all. We’ll only be using the baseline test results as they are all we need to compare these two CPUs. But we encourage you to go and take a gander at a full benchmark. In the single-core testing portion of the Geekbench benchmark, the Ryzen 9 7900X scored a very impressive 2,259 that’s higher than the i9-12900KS scored (1,998 points). The 5900X’s score pales in comparison, scoring a measly 1,723 points. Multi-core performance is also a massacre, with the 7900X murdering the 5900X’s chances of scoring well against the 7900X. The Ryzen 9 7900X scored 18,720 points in the multi-core benchmarks, with the 5900X trailing behind with 14,509 points. Again the 7900X manages to scrape past the Core i9-12900KS in multi-core benchmarks, despite it being armed with four fewer CPU cores. The 12900KS managed 18,510 points in our testing. All of these results equate to a performance increase of 29%. That is the 7900X over the 5900X. An awe-inspiring state of affairs considering the 7900X can tussle with Alder Lakes’ special edition flagship and win. We put the Ryzen 9 7900X through its paces in not only synthetic workloads but also real-world ones. Here we have five popular games to test the Ryzen 9 7900X in. We are again comparing the 7900X to the 5900X akin to the first synthetic portion of the 7900X’s performance. These are the games we tested and the results we found while benchmarking. All of the games are tested in 1080p and on low settings, except for CS:GO which is set on high. Let’s be honest, CS:GO is already pretty well optimized. As you can see from the table above, the Ryzen 9 7900X can also hold its own in real-world scenarios. Squeezing every drop of FPS out of our games as possible. Onto the real-world benchmark results. In Battlefield V, the Ryzen 9 7900X manages a very respectable 192 FPS, whereas the Ryzen 9 5900X only managed to pull a 189 FPS average. A similar score, but the 7900X still just managed to get out ahead slightly. In Cyberpunk 2077, the Ryzen 9 7900X scores leaps and bounds above the 5900X. The 7900X pulls in an average FPS of 174 in Cyberpunk. Whereas, the 5900X only brings in an FPS average of 147 FPS. This equates to a performance increase of 16% over the 5900X. Elden Ring is another close call. The 7900X manages to bring home a 157 FPS average, however. The Ryzen 5 5900X finds a 150 FPS average, another similar score. but the 7900X still comes out on top by 4%. There’s a notable difference in CS:GO between the 7900X and 5900X. The 7900X brought in a 389 FPS average, whereas the 5900X only achieved a 365 FPS average. This equates to a performance increase of 6% over the 5900X. Finally, we have GTA V, GTA V is either so well optimized for CPUs or we’re hitting a GPU wall. Both the 5900X and 7900X scored the same in GTA V. The 7900X averaged 187 FPS, and the 5900X managed 187 FPS. For anyone interested, that’s a 0.536% increase and the very definition of the word “negligible”. The Ryzen 9 7900X is a phenomenal CPU, with lots of power packed under its wacky IHS. During our testing, none of the games stuttered and everything ran as smoothly as it should. AMD has done an incredible job liaising with TSMC to manufacture the 5nm wafer upon which the 7900X is built. We have to lend the 7900X’s incredible single-core performance to the 13% IPC improvement AMD boasted during its last event. The extra transistors are a massive advantage for AMD to have. AMD and the 7900X have multi-core performance locked down, but it’s great to see AMD pump some resources into bolstering single-core performance wherever they can. This is an area in which AMD has lost to Intel in the past, and it looks like AMD is going to put up more of a fight this time. AMD has improved by a wide margin over the 5900X the results are clear. We know that the performance in games leaves some to be desired, but the 5900X is very much a multitasking CPU. The 7900X is designed to be used for rendering and calculations, but the fact it has a very good single-core performance which then translates to gaming performance is just a bonus. The iGPU contained within every Ryzen 7000 series CPU is the exact same across the board. So we’ll be comparing these results with those of the Ryzen 5 7600X’s. This iGPU is an RDNA 2-based Radeon iGPU with two compute units (graphics cores) clocked at 2200 MHz. This may seem normal or mediocre on the surface, but just wait to see how it performed in benchmarks. We tested the iGPU in one synthetic benchmark and two games. The synthetic benchmark was a run through 3DMARK’s Timespy at 1080P As you can see, the GPU score in 3DMNARK’s Timespy was 739 points, not too shabby for an iGPU with only two compute units. AMD specifically stated that this iGPU was not designed for gaming, so let’s jump into the gaming benchmarks. The Ryzen 9 7900X’s iGPU did well in both games we threw at it, we tested the 7900X in GTA V and CS: GO to get a nice feel for how well the CPU does in different scenarios. In GTA V the Radeon iGPU managed a 56 FPS average. Which is about on par with a 3400G. GTA V was tested in 1080p on the lowest settings preset. In CS:GO the 7900X managed a solid 126FPS, in both situations these frame rates a very playable. CS:GO was also tested in 1080P but this time it was on the high setting, as this game is already well optimized. It’s no secret by now, we’re sure you’ve heard the stories about 7000 series CPUs reaching throttle temperatures during testing. We have been testing the Ryzen 7000 series with the ASUS ROG RYUJIN ii 360mm CPU cooler. This is an AIO with incredible performance, it’s one of the best CPU coolers we’ve ever tested. Even with the RYUJIN, we managed to get the temperature far higher than we would have liked it. As you can see, the 7900X hit almost 85°C during our stress testing. We understand that 85°C is 10°C away from the 7900X’s rated maximum temperature before thermal throttling kicks in. But this is with one of the industry’s best CPU coolers, a cooler with a lesser cooling capacity will hit much closer to the 95°C limits. Quickly, thermal throttling is where the CPU will turn down its core speed and voltage when it reaches a certain internal temperature. Thermal throttling is a process designed to avoid overheating and damage to the CPU or the surrounding CPU socket. Of course, AMD has retained AM4 cooler compatibility on the AM5 platform, but just because it fits does not mean it can be used. AMD has worked very hard to integrate AM4 cooler capacity into its new AM5 motherboards, but you have to be smart about it. in this AMD Ryzen 9 7900X review, we decided to fit a Be Quiet Dark Rock 4 to the 7900X. The Dark Rock has a rated TDP of 200, which is more than the 7900X’s rated TDP of 170W. Of course, we know that the 7900X is capable of a 230W TDP at boost speeds. Needless to say, the CPU overheated eight seconds into an Aida64 test. Just because the cooler fits and the manufacturer states complete AM5 compatibility, doesn’t mean it will be a good idea. We recommend that you splash on the cooling in the case of the Ryzen 7000 series CPUs. The Ryzen 9 7900X is a formidable CPU, with lots to offer in both single and multi-core workloads. The Ryzen 9 7900X is priced at $549 USD (translates to £490 GBP) We don’t know the official UK prices yet. But it will not be more than £549. Considering the 12900KS, Intel’s most powerful CPU to date costs $200 more and performs marginally worse than the 7900X. We’d say AMD has done well this time around, especially in the area of single-core performance. If you’re already sold, here’s our Ryzen 9 7900X where to buy page. Here we will discuss some of the pros and cons of the Ryzen 9 7900X. The Ryzen 9 7900X is one of the best CPUs we have ever tested here at WePC. The performance prevails over all the  CPUs we have tested so far (all bar one). AMD has moved mountains in terms of single-core performance and technical ingenuity. Although the 7900X runs a little cooler than the other 7000 series CPUs we have tested, it still runs very hotly. Needless to say, you’re going to need one heck of a cooler to keep the high temperatures at bay. We used the AUS SROG RYUJIN ii 360, it can be found below in case you’re in the market for one. The interesting IHS design is undoubtedly so that the CPU can retain compatibility with last gens AM4 coolers, but if the IHS is the reason for the hot temperatures, we’d rather buy a new cooler. As most of us are going to have to anyway to negate the monstrous amounts of heat radiating from this CPU die. The Ryzen 9 7900X is truly a technical marvel, pushing the boundaries of what’s possible in the hands of AMD. The 7900X performs astonishingly in both single and multi-core benchmarks. The iGPU even packs a punch, despite it not being designed for gaming at all. We think the 7900X is well worth the money … if you’re going to be doing a lot of workstation tasks or multitasking. If you’re just a gamer on the other hand, then your money might be better spent on a 7700X or 7600X. The single-core performance is very similar across all the zen 4 CPUs, and we all know single-core performance lends its hand to gaming performance almost exclusively. Despite the heat issues, this CPU is a force to be reckoned with. But you’re going to have to fork out if you want to take full advantage of its capabilities. But you should only have to buy one AM5 motherboard, as AMD is expecting to support the AM5 platform for a good 4 years according to AMD. If you have the cooling headroom and the financial allocation, a 7900X will serve you very well as a fantastic 5900 or 5950x replacement. If you’re upgrading from the 3000 series then we envy you. The performance increases from the 3000 series will be absolutely insane. We hope you enjoyed this AMD Ryzen 9 7900X review The AMD Ryzen 9 7900X is a phenomenal CPU with a lot to prove. It’s incredible single and multi-core performance helps propel this CPU into the future. Along with the new hardware it supports on the AM5 platform, the Ryzen 7 7900X brings a plethora of never before seen features on the AMD platform. Such as DDR5 support and AMD EXPO, Jack is a Tech and News Writer who has a vast and proficient knowledge of CPUs, Motherboards, and Computer technology. Trusted Source WePC’s mission is to be the most trusted site in tech. Our editorial content is 100% independent and we put every product we review through a rigorous testing process before telling you exactly what we think. We won’t recommend anything we wouldn’t use ourselves. Read more AMD Ryzen 5 5600X review – is the 5600X worth it? AMD Ryzen 9 7950X3D review – is the 7950X3D worth it? AMD Ryzen 9 5900X review – the best $250 CPU in 2024? Best AM5 CPU cooler 2024 – best coolers for Ryzen 7000 series The Warehouse, Use Space, Paddock St, Manchester M12 6PN WePC is the essential site for serious PC gamers. We offer everything from high end PC custom builds and advice to the latest hardware and component reviews, as well as the latest breaking gaming news. You take your gaming PC seriously. So do we. WePC. ©2024 WePC. All rights reserved. Part of "
}