{
    "title": "AMD confirms \"Strix Halo\" APU, rumored to feature up to 16 Zen5 cores and \n40 RDNA3.5 CUs",
    "date": "1/23/2024",
    "url": "https://videocardz.com/newz/amd-confirms-strix-halo-apu-rumored-to-feature-up-to-16-zen5-cores-and-40-rdna3-5-cus",
    "text": "AMD recent commit to ROCm software mentions next-gen APU series.  The Strix Halo is no longer a rumor. According to patches for ROCm, AMD’s open-source platform for GPU computation, the GFX1150 and GFX1151 codes which were mentioned before are now undoubtedly referring to the Strix series. What’s more, AMD is confirming that there is indeed a Strix Halo coming. Although the patches do not provide detailed information, they do reveal that the initial Strix Point silicon is labeled as STRIX1, following the naming convention of PHOENIX1. The Strix Point APU, designed for next-gen laptops, is a mainstream silicon, while the STRIX HALO aims to be AMD’s competitor to the Apple M-series.   Strix Halo/Strix ROCm commit, Source:AMD  Both products are set to feature the Zen5 microarchitecture with an updated RDNA3.5 graphics architecture. Additionally, the Strix series is expected to incorporate the new XDNA2 AI accelerator, enhancing compute performance to a 45-50 TOPS. This is a significant improvement over Hawk Point, which is projected to offer 16 TOPS, and at least four times the capability of Phoenix (10 TOPS). The Strix Halo, categorized as an elite experience APU is believed to feature up to 16 Zen5 cores and up to 40 Compute Units. This is not a low-power APU, but rather a powerful CPU and GPU replacement packaged into one unit. While details about RDNA3.5 enhancements are yet to be confirmed by AMD, it’s expected that such a silicon would feature more RDNA cores than the upcoming Radeon RX 7600 XT, reportedly reaching up to 40 Compute Units. However, the APU will have limits on how much power it can use. It is thought that it can use between 55 and 120 watts, which will no doubt affect its performance.   Strix Halo/Strix ROCm commit, Source:AMD  AMD officially announced that Zen5 architecture is launching this year, but the company is yet to confirm which product specifically. Recent speculations suggest that the Strix series might make its debut this year, albeit likely after the desktop series. AMD has only just announced its Ryzen 8040 “Hawk Point” series, a minor update to Phoenix mobile chips. Those chips, possibly acting as a stop-gap between Phoenix and Strix Point, are to be launched this quarter.   AMD Ryzen 8000/9000 roadmap, Source: Moore’s Law is Dead  The Strix Halo was first mentioned by Moore’s Law is Dead, who has also revealed that the series may be slipping to 2025 launch. As a result, the Strix Halo could launch under Ryzen 9000 series, or a new class of chips altogether. The Halo series will enable AMD to compete with Apple M-series and establish a new product category for high-end small form factor systems, including gaming Mini-PCs without discrete graphics. Source: ROCm via @Kepler_L2 We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}