{
    "title": "Gigabyte B650 motherboards first to officially support AMD Ryzen 8000 series",
    "date": "1/6/2024",
    "url": "https://videocardz.com/newz/gigabyte-b650-motherboards-first-to-officially-support-amd-ryzen-8000-series",
    "text": "Gigabyte has confirmed their new motherboard supports AMD yet unreleased desktop processor series.  The company has unexpectedly changed its product page, displaying the AORUS B650 Elite AX ICE and B650 GAMING motherboards with updated information. The former SKU is a version of the Elite board but with a white design, while the latter is one of Gigabyte’s more affordable designs. These two now stand as the only boards in Gigabyte’s lineup officially support the Ryzen 8000 series, according to the product page. A quick check showed that none of the X670 motherboards are currently listed as having support for the Ryzen 8000 series, so these two are the first ones to do so.   Gigabyte support for Ryzen 8000, Source:Gigabyte  While Gigabyte confirms support, the complete CPU support list currently lacks any mention of a Ryzen 8000 SKU. It is reasonable to assume that when referring to the 8000 series, Gigabyte is hinting to the upcoming desktop APU models known as Ryzen 8000G. These are slated to be the first  releases in the new series this year and adhere to AMD’s new naming structure, beginning with “8”. The AMD Ryzen 8000G series boasts Hawk Point/Phoenix Point silicon with a maximum of 8 Zen4 cores and powerful RDNA3 graphics featuring up to 12 Compute Units. These processors are specifically designed to provide a great graphics experience for users who may not require discrete graphics. Given their anticipated TDP range of 65W and access to modern RDNA3 graphics, the series is expected to be more suitable for mid-range and entry-level motherboard designs, rather than the premium X670 series. Source: AORUS We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}