{
    "title": "AMD Drops Radeon RX 7900 XT Price to $749 to Battle RTX Super",
    "date": "1/17/2024",
    "url": "https://www.extremetech.com/gaming/amd-drops-radeon-rx-7900-xt-price-to-749-to-battle-rtx-super",
    "text": "At CES last week, Nvidia announced its mid-cycle refresh for the RTX 40-series. The refresh consists of three Super GPUs launching throughout January and includes Super versions of the RTX 4070, 4070 Ti, and 4080. AMD seems particularly concerned about the 4070 Ti Super, as it has officially lowered the price of that card's direct competitor, the Radeon RX 7900 XT. It's just for a \"limited time,\" so AMD is trying to pour cold water on Nvidia's upcoming launch. The Radeon RX 7900 XT has always been a bit of a misfit in AMD's lineup, as it debuted at $899, then quickly had its price dropped to $849 to give it some distance to the $999 7900 XTX. In preparation for the 4070 Ti Super launch, AMD is dropping it even further to $749 or lower. AMD confirmed the price drop to TweakTown, saying it's a limited-time offer for this quarter aimed at specific retail outlets. One of those is Newegg, as this GPU's prices are already surprisingly low, with multiple models selling for just $729. Amazon also has cards for $739 and $729 from ColorPower and Sapphire. In addition to the $100 price cut, on Newegg the card also includes the newest Avatar game—a $70 value— known to destroy GPUs without enough VRAM, especially in \"unobtainium\" mode. This is a good showcase for the 7900 XT as it has 20GB of memory, which Nvidia can't compete with at this price for this generation of GPUs. The upcoming $999 RTX 4080 Super only has 16GB of memory, so AMD has a clear advantage here. It doesn't have an advantage in ray tracing, upscaling, and frame generation, as it's still one generation behind Nvidia there, but quickly closing the gap. It's an interesting move by AMD because when the first Super GPU launched yesterday, gamers wondered how AMD would respond. Now we know, and the move it's making has nothing to do with competing against the $599 RTX 4070 Super, as it already has a competitive card there with the $499 Radeon RX 7800 XT. Instead, it's looking to the next card in the stack and adjusting its prices accordingly. However, when the RTX 4080 Super launches on January 31st, AMD might have to lower the price of its flagship GPU, the Radeon RX 7900 XTX. Both cards have exactly the same price of $999, as Nvidia is targeting AMD directly this time, so we'll see if there are any more price drops to come in the following weeks. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}