{
    "title": "Minisforum BD770i Mini-ITX “AMD Ryzen 7 7745HX” Motherboard Review – 8 Core \nMoTD For Gamers",
    "date": "1/14/2024",
    "url": "https://wccftech.com/review/minisforum-bd770i-mini-itx-amd-ryzen-7-7745hx-motherboard-review-8-core-motd-for-gamers/",
    "text": "The world of Mini PCs is evolving rapidly with new and improved hardware from all tech vendors accelerating performance and innovative designs. Today, we will be testing a recent entrant in the Mini PC segment, the BD770i which is a DIY Mini-ITX motherboard that comes equipped with AMD's Dragon Range-HX CPUs. These CPUs were initially designed for the mobility platforms but it looks like Mini PC vendors are repurposing them for DIY builders. A reason for the move from mobile to desktop-oriented DIY motherboards happens to be the efficient nature of these chips which make perfect sense for SFF, HTPC & NAS builds. Also, not having to deal with higher TDP variants and their higher cooling/power requirements benefits these Mini-ITX designs. Talking about Mini PCs, Minisforum has recently introduced its new BD770i MoTD (Mobile on Desktop) motherboard which comes in a very competitive Mini-ITX design. The board is designed by Minisforum's motherboard brand, EYERTEC, whose AD650i motherboard had also been tested by us a few months back. An even higher-end version, known as the BD790i (with AMD Ryzen 9 7945HX) and the AR900i (with Intel Core i9-13900H), will be released soon but today, we will be testing the BD770i which features the AMD Ryzen 7 7745HX CPU. The Minisforum BD770i Mini-ITX motherboard currently comes in the barebone edition which packs the AMD Ryzen 7 7745HX CPU (the only CPU option you can select with this model), the Mini-ITX motherboard, and the cooling solution. All of this is pre-installed and the whole package is listed for a price of $399 US. In terms of CPU specifications, the AMD Ryzen 7 7745HX comes in an 8-core configuration. The CPU features a total of 16 threads and 32 MB of L3 cache. In terms of clock speeds, you get a base clock of 3.6 GHz and a boost clock of up to 5.1 GHz.The CPU is rated at a default TDP of 45W by default but the BD770i allows it to hit its peak 75W rating out of the box. The Minisforum BD770i Mini-ITX motherboards come with a PCIe 5.0 x16 slot which is essential if you are building a gaming PC around this system since the CPU only comes with a Radeon 610M iGPU which features 2 compute units clocked at 2200 MHz. This iGPU is perfect if you don't plan on gaming on this motherboard and only require its Mini-ITX form factor for CPU-intensive tasks. The GPU does offer support for support for DisplayPort 2.1 and HDMI 2.1 connectivity, supports up to 4 displays, and is DX12 compliant. The iGPU also supports AMD SmartShift MAX and Smart Access Memory so if you want to build a very power-efficient machine for some lowly graphics tasks. the RDNA 2 iGPU has all the necessary features to make it possible. Other specs include two DDR5 SO-DIMM slots which can support up to 64 GB memory capacities with speeds of up to 5200 MT/s. Furthermore, there are 2 M.2 slots, both of which are rated at PCIe 5.0 x4, including one dedicated WIFI M.2 slot. That's a great thing about this motherboard since it's on par with some of the high-end Mini-ITX offerings out there offers two full Gen5 SSD support in a small form factor design and retains a Gen5 x16 slot too. I/O on the EYERTEC AD650I motherboard includes 2 HDMI, 1 USB4, 1 2.5 GbE Ethernet Port, 2 USB 3.2 Gen 1 Type-A ports, 2 USB 2.0  ports, a 3-channel audio jack and two WIFI Antennas. The Minisforum BD770i Mini-ITX motherboard comes in a nicely packaged box with a purple and blue color theme. The front of the box has certain features listed such as a fully customized cooler, PCIe 5.0-Ready design, a Mini-ITX form factor, support for AMD Ryzen 7 7000 CPUs, and full 100% performance ensurance. The back of the box lists some features along with the full specifications of the motherboard that will give users an idea before purchasing the product. The package includes a manual, an I/O shield, and a WIFI Antenna. The motherboard is packed with anti-static wrapping. The Minisforum BD770i MoTD motherboard is a very nice-looking product even if it is stripped to a bare minimum. The black-colored heatsinks and the overall motherboard aesthetics feel very industrial and also have a very premium feel to them. The BD770i measures 170x170x1.6mm. It's a perfect square and conforms to the Mini-ITX standard which means that it can be housed within any standard PC chassis without compatibility worries. It also comes with a low-profile cooling solution which you can also use in a passive-cooled heatsink since you are given the option to house a 120mm fan on the heatsink though I would recommend running the system with a decent fan. The heatsinks on the Minisforum BD770i are divided into two parts. The main block covers the CPU while the secondary block covers the M.2 slots. The AMD Ryzen 7 7745HX CPU comes in the BGA form factor which means that there's no socket on the motherboard and the CPU is permanently etched to the board. You can find two DDR5 SO-DIMM slots that can support up to 64 GB capacities with up to 5200 MT/s speeds. We went with G.Skill's Ripjaws 5200 SO-DIMM 32 GB memory for our test config. Minisforum has included a full-length PCIe 5.0 x16 expansion slot on the BD770i motherboard. This is great for users who want to upgrade to a powerful discrete graphics solutions and the board can support up to an RTX 4090 or 7900 XTX. The back I/O of the Minisforum BD770i Mini-ITX motherboard includes 1 HDMI 2.1, 1 DP 2.1, 1 USB4, 1 2.5 GbE Ethernet Port, 2 USB 3.2 Gen 1 Type-A ports, 2 USB 2.0 ports, a Clear CMOS switch and a 3-channel HD audio jack. There are also two WIFI antenna ports. The whole cooling solution including the motherboard is just as wide as a dual-slot graphics card. The sole storage options on the motherboard are two PCIe Gen 5.0 x4 slots which are housed right under an active cooling solution with its own heatsink. The AMD Ryzen 7 7745HX CPU sits right under the main heatsink. The motherboard comes with a 6+1+1 phase VRM power delivery and the CPU is set to a default 45W mode which can be set to 75 Watts through the BIOS. The thing about the mobile laptop CPUs is that they don't feature an IHS & have the dies exposed. A shielded cover is provided to protect the caps on the front of the package. Coming back to the main heatsink, you will notice that the copper baseplate makes direct contact with the two chiplets on the AMD Ryzen 7 7745HX CPU (1 CCD & 1 IOD). The VRMs are also cooled by this heatsink through a thermal pad that transfers the heat from the VRMs to the unit. Taking a closer look at the heatsink, you will notice that the baseplate is slightly extended to ensure correct contact with the chiplets. The heatsink itself uses a 5-heatpipe design and you can equip any 120mm fan with ease. We went with a Noctua NF-P12 fan.  Minisforum also made a good decision to have an active cooler attached over the M.2 slots. The M.2 heatsink comes with thermal pads that transfer heat to the heatsink and it is then cooled off by the active fan. The fan is connected to the motherboard via a 4-pin header. There is also a 4-pin CPU header along with two additional 4-pin headers for fans. Knowing how hot Gen5 SSDs can get, it is a forward-looking approach by Minisforum but you can also run older Gen4 and Gen3 SSDs in the same slots. The motherboard looks very high-end given all the component choices but lacks SATA I/O which can be considered a major downside for those looking to expand their storage options by buying inexpensive hard drives which still offer a lot of value.  Power to the motherboard is provided via a single 8-pin connector. The motherboard is very slim despite using a huge heatsink and you can see the length of the I/O ports match the heatsink. It also comes with a bundled I/O cover which comes with black aesthetics to match the motherboard. Lastly, we have the M.2 WIFI Key-E slot with which you can select your choice of networking solution in the 2230 form factor. Our unit came with an AX210 WIFI6 add-in-card. For performance testing, we used the standard 54W power profile for the AMD Ryzen 7 5800H APU when testing the Geekom A5 Mini PC. For gaming, we tested a couple of the latest and most played esports titles along with a mix of AAA titles at 1080p resolution. The performance was measured between the AMD Radeon 780, Radeon 680M, AMD Vega 8, Vega 7, Vega 6, and Intel Iris Xe-LP integrated graphics. Following are the power and thermal numbers of the Minisforum BD770i and its AMD Ryzen 7 7745HX CPU at the max 75W power limit. As for thermals, the Geekom A5 Mini PC peaked at around 88C with the 75W profile. Since we were using a Noctua fan, the noise produced wasn't that loud and the CPU never throttled even when running at higher temperatures. Minisforum (Eyertec) has a great record of Mini PCs with its 2023 lineup being a strong one. They have evolved continually with every new APU/CPU release and they are the first to kick off the MoTD revolution in the Mini-ITX space. In that sense, the BD770i can be seen as the 2nd gen of MoTD designs from the company, offering even higher-end CPU support and better I/O support. Starting with the performance, the BD770i with its AMD Ryzen 7 7745HX CPU is a very strong 8-Core option for Mini-ITX builders. It more or less delivers the same performance as the desktop-grade 7700X with slightly better efficiency and that's a plus for productivity and content creators who are building small form factor PCs. Though the HX series lacks a proper iGPU such as the one featured on the Ryzen 7000/8000 APUs, the added PCIe 5.0 x16 slot gives you enough upgradability options to select from a wide variety of discrete graphics cards. We paired up our unit with the top DDR5-5200 SO-DIMM from G.Skill (Ripjaws) and an RX 7700 XT GPU. Now due to the lower clock speeds and power headroom, the gaming performance does take a slight hit but you can still expect great discrete gaming performance from this system. The motherboard is also great with decent CPU cooling and impressive Gen5 SSD cooling solutions. There are a good amount of I/O ports and the added WIFI card is a plus but the one downside is the lack of SATA ports. Users will have to rely on the two M.2 slots for storage needs and that's about it. We hope to see a few SATA III connectors on the next iteration of these motherboards since HDD still offers great value in the GB/$ metric. One huge advantage of the MoTD platform is the price. The BD770i costs $399 US at the moment with the AMD Ryzen 7 7745HX and the built-in cooling solution. If you were to go the DIY route, a Ryzen 7 7700 currently costs around $329 US and the cheapest AM5 Mini-ITX motherboard costs $139 US. So you are already paying $70 US extra when buying these components separately. Add in a cooler and you end up close to $100 US more than the Minisforum solution. So there's a lot of value if you want to go the MoTD route. But you will have to consider one thing buying a MoTD product means that you will have to stick with the platform for a while since there's no CPU upgrade path as these chips are soldered to the motherboard. So if you plan on upgrading, you will have to buy an entirely new motherboard. With a socketed motherboard, you will just have to replace your CPU. So each side has its positives and negatives which you should keep in mind. Overall, I found the Minisforum BD770i to be a rock-solid 8-core CPU platform that offers a great Mini-ITX combo solution to gamers and productivity users. It has great Gen5 I/O capabilities, an impressive low-profile cooling solution, and can let you make some interesting small form factor PC builds. You can buy the Minisforum BD770i (AMD Ryzen 7 7745HX) Mini-ITX motherboard here! Use Code: \"BD770i40\" to get $60 US off Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  You need to login to use this feature. "
}