{
    "title": "AMD AFMF Frame Generation Coming to Radeon Drivers on the 25th of Jan",
    "date": "1/13/2024",
    "url": "https://www.hardwaretimes.com/amd-afmf-frame-generation-coming-to-radeon-drivers-on-the-25th-of-jan/",
    "text": "AMD will release its open-source Fluid Motion Frames (AFMF) frame generation technology with its Radeon public drivers on 24th January. Aaron Steinman (Senior Radeon Manager) confirmed this to PC Gamer at CES 2024. Steinman expressed his confidence in the chipmaker’s cross-vendor technology, stating that it’ll force its arch-rival to innovate similar solutions. I would be curious to know if NVIDIA feels now they have to match what we’ve done in making some of these solutions driver-based. I think what we’re gonna start seeing, DLSS is only available on certain solutions, so either NVIDIA is going to have to benefit from our solution because we did make it open-source and cross-vendor, or they’re probably going to need to do something similar. Unlike FSR and DLSS, Fluid Motion Frame (AFMF) is a driver-level frame-generation technology that works in most DX11/DX12 games across most GPUs. DLSS 3/FSR 3, on the other hand, needs to be implemented on a per-game basis. Of course, there are several benefits to this approach. For example, the images are stable, and the IQ is almost as good as the native image. This is because of the availability of temporal frame data, such as motion vectors and optical flow. AFMF, being a driver-level implementation, lacks motion vectors and low-resolution frame inputs from previous frames. Consequently, it’s more prone to blurring, ghosting, and other artifacts commonly seen with TAA. On the bright side, these are less of an issue if you’re running an iGPU, such as the Radeon 780M on the ROG Ally or the Legion Go. The smaller screens are much better at hiding upscaling defects, and the added performance more than makes up for it. AFMF frame generation can be used as a standalone technology or as part of HYPR-RX that combines it with Radeon Boost, Anti-Lag+, and variable rate shading. Both can be enabled from the Radeon control panel for nearly every game. RSR is the driver-level implementation of FSR 1.0, a spatial upscaling technology that boosts performance with minimal overhead on just about any GPU. Anti-Lag+ is the Radeon alternative to NVIDIA Reflex that reduces input latency, improving competitive gameplay performance. It controls the pace of the CPU work to ensure it doesn’t get too far ahead of the GPU, reducing the amount of CPU work queued up.Radeon Boost dynamically lowers the resolution of the entire frame when fast on-screen motion is detected via user input, boosting performance with little impact on quality. It also leverages variable rate shading (VRS) on newer DX12 GPUs to further improve performance without reducing visual fidelity.  "
}