{
    "title": null,
    "date": "1/1/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/unreleased-nvidia-budget-gpu-to-rival-amd-and-intel-emerges-overseas",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. A weaker RTX 3050 with 2GB less VRAM A GeForce RTX 3050 6GB has been in the works for some time. Although the last-generation Ampere graphics card is unlikely to contend for a spot on the list of best graphics cards, the GeForce RTX 3050 6GB could be a decent alternative for budget gamers if correctly priced. While Nvidia's latest graphics cards are on the Ada Lovelace architecture, the chipmaker still has some Ampere products up its sleeves. However, instead of an upgrade, the forthcoming GeForce RTX 3050 6GB represents a regression from the vanilla GeForce RTX 3050, which has 8GB of onboard memory. Russian retailer Citilink (via VideoCardz) has listed three custom GeForce RTX 3050 6GB models from Nvidia partner Palit on the company's website. The list includes the  GeForce RTX 3050 StormX OC 6GB(NE63050S18JE-1070F), GeForce RTX 3050 StormX 6GB (NE63050018JE-1070F), and GeForce RTX 3050 KalmX 6GB (NE63050018JE-1070H). Although the specifications are from a retailer, it's wise to treat them cautiously since they could be placeholders. For example, the packaging render for the GeForce RTX 3050 StormX OC 6GB still corresponds to the 8GB model, but the specifications and product code are different. *Specifications are unconfirmed. According to the retailer, the GeForce RTX 3050 6GB retains the same 2,560 CUDA cores as the GeForce RTX 3050 8GB. The silicon is unknown. The original GeForce RTX 3050 utilized the GA106 die, but Nvidia later used the GA107 die instead. It's a coin toss on whether the GeForce RTX 3050 6GB will be on the GA106 or GA107 die, although we're more inclined to the latter. At any rate, the CUDA core count remains untouched. The GeForce RTX 3050 StormX OC 6GB features a 1,402 MHz base clock and a 1,777 MHz boost clock. While the base clock is significantly lower, the boost clock appears to be the same as the GeForce RTX 3050 8GB. Therefore, the FP32 performance for both variants should be the same (9.1 TFLOPS). We don't expect any design changes with the GeForce RTX 3050 6GB, meaning it should still be on the PCIe 4.0 x8 interface like the original.  As the model name insinuates, the GeForce RTX 3050 6GB has 6GB of GDDR6 memory clocked at 14 Gbps. Those are the exact memory chips found inside the GeForce RTX 3050 8GB. However, there's a huge twist. Much to our disappointment, the GeForce RTX 3050 6GB has a debilitated memory interface, limited to a 96-bit bus as opposed to the 128-bit bus on the GeForce RTX 3050 8GB. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. The narrower memory interface limits the GeForce RTX 3050 6GB's memory bandwidth to 168 GB/s, 56 GB/s lower than the GeForce RTX 3050 8GB. It's a massive blow to the graphics card since it loses 2GB of memory and 25% of its bandwidth. The GeForce RTX 3050 6GB may have a lower TDP, due to the absence of a few memory chips. Citilink listed the GeForce RTX 3050 StormX OC 6GB with a 115W TDP, 15W lower than the standard GeForce RTX 3040 8GB. It's not a huge deal since it's just a 12% reduction. Nonetheless, there are rumors that the GeForce RTX 3050 6GB thermal design is around 70W to 80W. If accurate, the GeForce RTX 3050 6GB will not require external power connectors. The GeForce RTX 3050 8GB has a $249 MSRP, however, custom models on the market start at $219.99. Citilink sells the GeForce RTX 3050 StormX OC 6GB for $321.79, which aligns with some of the other custom 8GB offerings from the same retailer. Nevertheless, the official MSRP for the GeForce RTX 3050 6GB pricing remains a mystery. The Ampere-based graphics card is rumored to launch in February, so hopefully, more retailer listings arise to give us a better idea of the pricing. Zhiye Liu is a Freelance News Writer at Tom’s Hardware US. Although he loves everything that’s hardware, he has a soft spot for CPUs, GPUs, and RAM. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 OpenAI and Microsoft reportedly planning  $100 billion datacenter project for an AI supercomputer By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}