{
    "title": null,
    "date": "1/31/2024",
    "url": "https://www.videogamer.com/tech/where-to-buy-the-ryzen-7-8700g-expected-retailers/",
    "text": "Posted in Tech Video Gamer is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more As the launch of Ryzen’s 8000G-series APUs is not far off at all now, it’s a good time to start thinking about where to buy the Ryzen 7 8700G, the high-end SKU released in this set. The APU is aimed towards hobbyist PC builders, with less of a gaming angle and instead targeting productivity. With the 5700G now outdated by a few generations of processing architecture, it feels like a natural upgrade to consider the Zen 4 APUs, especially with compatibility with DDR5 memory and PCIe 5.0. Now the release date is here, let’s go over where you’re going to be able to pick these APUs up, alongside what time they’re going to be available. The Ryzen 7 8700G has been spotted on a few retailers already, and Amazon is your best bet for picking it up at the moment. It seems likely that the Ryzen 7 8700G is also going to be available from the expected retailers we’ve listed below when it does become available: None of the retailers in the US or UK have listings for any of the Ryzen 8000G APUs just yet, though as we steer closer to the launch they could very well start to pop up. We’re pretty used to seeing hardware from AMD and Nvidia release at the following times across the world: 2PM GMT / 3PM CEST / 9AM ET / 8AM CT/ 6AM PT. These predicted release times are never really spot on, though, especially since they’re never confirmed by the company itself. On top of that, there’s a lot of freedom for the specific retailers such as Amazon, Best Buy, and Newegg to list the products whenever they want. Sometimes earlier, sometimes later. As CES 2024 continues, we’re anticipating seeing more and more hardware revealed. When it does, we’re going to be covering as much of it as humanly possible, and then some. While it seems unlikely that we’ll hear much more about the Ryzen 7 8700G and related SKUs, there’s plenty of other products we’re excited to write about. Including a gaming PC in a shoe. Frequently Asked Questions Can you pre-order the Ryzen 7 8700G? At the moment, it’s not available to pre-order. To tell the truth, hardware releases such as this never see a pre-order, and are instead unleashed onto retail sites on the day of its release. That’s your best shot at picking one of these up, though we also don’t anticipate the demand for them to be higher than normal. Amaar loves retro hardware and boring games with more words than action. So, he writes about them daily. "
}