{
    "title": "AMD Brings Frame Generation to Its RDNA 3 iGPUs",
    "date": "1/10/2024",
    "url": "https://www.extremetech.com/gaming/amd-brings-frame-generation-to-its-rdna-3-igpus",
    "text": "Integrated GPUs have never been treated the same as desktop GPUs. Due to their small size and modest performance, they've always seemed like an afterthought for companies and consumers, to only be used when your GPU dies or if you need to play light games like Candy Crush on slower PCs. However, iGPUs from AMD and Intel are becoming a lot more competitive, so both companies have begun treating them like real GPUs by offering desktop features. Whether that will allow them to approach desktop-class performance remains to be seen, but it's a step in the right direction. The latest salvo in this burgeoning war between AMD and Intel is that AMD has announced its frame-generation technology for its latest RDNA 3 iGPUs. The company calls it Fluid Motion Frames, and it was previously reserved only for its desktop GPUs. That support included its latest Radeon 7000 GPUs and its older 6000 series cards. Now, it is being offered for CPUs that feature the company's latest built-in graphics, including its 7000 and 8000 series APUs for desktop and mobile. Support for this feature is only currently available in a beta driver as opposed to the official WHQL version, so AMD is still testing it—thus, only the brave and curious should apply. The addition of frame generation to iGPUs opens up a new front in the battle for gaming supremacy between AMD and Intel. The latter's new Meteor Lake CPUs have a relatively powerful Arc-based GPU, which is competitive with AMD's top-shelf iGPU, the Radeon 780M. However, Intel only offers XeSS upscaling and has yet to announce any kind of frame-generation technology. AMD will have a clear advantage on this front, but how useful it will be for laptop and desktop APU owners in the real world remains to be seen. That's simply because AMD only recommends using its Fluid Motion Frames when you're already at 60fps or above. For an integrated GPU, that can be a tall order. Still, frame generation's deployment to iGPUs marks a watershed event for the product category, as they're now beginning to encroach on the territory of desktop GPUs. At CES this week, AMD announced its first desktop APUs with RDNA 3 graphics, which it says is a world's first. Intel has nothing comparable, as its Meteor Lake CPUs with Arc graphics are mobile-only. The company won't bring real firepower to its iGPU lineup until late 2024 when it launches Arrow Lake, which will have some derivative of Arc Alchemist as its GPU tile. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}