{
    "title": "If You Invested $10,000 in AMD When Lisa Su Became CEO, This Is How Much \nYou Would Have Today",
    "date": "1/9/2024",
    "url": "https://www.fool.com/investing/2024/01/09/if-you-invested-10000-in-amd-when-lisa-su-became-c/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Advanced Micro Devices (AMD 0.50%) has come a long way since its founding more than 50 years ago. The company has achieved lucrative positions in different areas of tech. However, the road to success hasn't always been easy for AMD. When Lisa Su took the position of chief executive officer in October 2014, the company was on the brink of bankruptcy, with its stock trading at an all-time low of just over $3 per share. However, in the years after Su's appointment, the company halted investment in markets outside its core competency and focused on what it does best: high-performance central and graphics processing units (CPUs and GPUs). Shedding excess divisions allowed AMD to become a leader in an industry that now fuels high-growth sectors like artificial intelligence (AI), supercomputing, and video games. In fact, with the launch of its Ryzen line of CPUs, the company has consistently taken market share from Intel. AMD's share in CPUs has grown from 18% in 2017 to 36% in the fourth quarter of 2023, while Intel's has dwindled from 82% to 61%.  Data by YCharts This chart shows AMD's stock has skyrocketed over 4,000% since Su took the helm almost a decade ago. As a result, an investment of $10,000 at that time would be worth $422,500 today. However, the company isn't done yet. Budding markets like AI suggest AMD still has much to offer new investors, and here's why. According to Grand View Research, the AI market is projected to expand at a compound annual growth rate of 37% through 2030. That growth trajectory would see the sector exceed a $1 trillion valuation before decade-end. Last year, chipmaker Nvidia cornered the market in AI GPUs, the main chips necessary for training and running AI models. It is responsible for an estimated 90% market share in the industry, and the company has seen its stock and earnings soar during the past 12 months alongside rising chip demand. However, AI's significant growth potential suggests there will be plenty of room for newcomers like AMD to claim a lucrative role in the industry. AMD is gearing up to challenge Nvidia's dominance with the launch of its new MI300X AI GPU this year. The chip has already caught the eye of some of the biggest names in AI, with Microsoft's Azure announcing last November that it will become the first cloud platform to use the MI300X to optimize its AI capabilities. A partnership with Microsoft is a major win for AMD as the Windows company holds a 49% stake in ChatGPT developer OpenAI. Another notable customer of AMD's AI GPU is Meta Platforms, which will employ the chip for AI inferencing. It's still fairly early days for AMD's journey into AI. However, that could mean it's the perfect time to invest. The company could have many years of growth ahead as it expands in the market. Shares in AMD have reached record highs since Su accepted the CEO role. However, tech is an ever-expanding market with a reputation for rewarding innovative companies and their investors with significant long-term gains. Meanwhile, as a leading chipmaker, AMD is well positioned in the industry by supplying its hardware to companies across the industry. Demand for chips will likely continue rising in the coming years, which could boost AMD's stock still more. Wall Street seems to agree, as Rosenblatt Securities analyst Hans Mosesmann has given AMD a price target of $200, which would be 45% higher than its current position.  Data by YCharts Mosesmann's bullish forecast is not unfounded, as this chart shows AMD's earnings could hit $5 per share by its next fiscal year. Multiplying that figure by the company's forward price-to-earnings ratio of 36 yields a stock price of $180, which is not too far off Mosemann's projections. Earnings-per-share estimates would see shares in AMD rise 30% by fiscal 2024. Given its expanding role in AI, AMD is one of the most attractive stocks this January. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}