{
    "title": "AMD Reveals Next-Gen Desktop Processors for Extreme PC Gaming and Creator \nPerformance",
    "date": "1/8/2024",
    "url": "https://www.globenewswire.com/en/news-release/2024/01/08/2805618/0/en/AMD-Reveals-Next-Gen-Desktop-Processors-for-Extreme-PC-Gaming-and-Creator-Performance.html",
    "text": "January 08, 2024 10:30 ET\n\n\r\n            | Source:\r\n            \nAdvanced Micro Devices, Inc.\n\n\n\n\n\nAdvanced Micro Devices, Inc. — AMD Ryzen™ 8000G Series desktop processors bring immense performance for gamers and creators and unlocks new personal AI experiences with Ryzen AI — — AMD bolsters desktop portfolio and extends unprecedented longevity of the AM4 platform with new Ryzen™ 5000 Series desktop processors — — Partners including Lenovo, Razer, Asus, and Acer introduce new AI PCs with AMD Ryzen™ 8040 Series mobile processors — LAS VEGAS, Jan.  08, 2024  (GLOBE NEWSWIRE) -- Today, ahead of CES 2024, AMD (NASDAQ: AMD) announced new products expanding its desktop portfolio, delivering premium experiences to gamers, content creators and everyday users through extraordinary performance and the power of personal AI processing. AMD is introducing the new AMD Ryzen™ 8000G Series desktop processors for the AM5 platform, including the Ryzen™ 7 8700G, with the world’s most powerful built-in graphics.1 AMD is also bringing the power of a dedicated AI neural processing unit (NPU) to desktop PC processors for the first time with the introduction of Ryzen™ AI to unlock more AI capabilities for consumers and improve productivity, efficiency, and advanced collaboration. Building on the unprecedented longevity of socket AM4, AMD is introducing new Ryzen™ 5000 processors, offering users even more choices when it comes to building a system for productivity, gaming, or content creation. The new offerings include the new Ryzen 7 5700X3D, leveraging powerful 3D V-Cache™ technology to provide gamers with a massive boost in gaming performance. “AMD continues to lead the AI hardware revolution by offering the broadest portfolio of processors with dedicated AI engines in the x86 market,” said Jack Huynh, senior vice president and general manager, Computing and Graphics Group at AMD. “Last year at CES, we introduced the first dedicated AI engine in an x86 processor for the mobile market. This year, we are expanding our AI leadership to desktop computing through our Ryzen 8000G Series processors. We’re excited to lead the AI PC era together with our close OEM and ecosystem partners.” AMD Ryzen™ 8000G Series Desktop Processors Deliver Impressive Graphics and Productivity in a Single PackageAMD Ryzen™ 8000G Series is the ultimate all-in-one desktop processor. Featuring up to eight cores and 16 threads, users can expect immense power and dominant performance for intensive workloads including gaming and content creation. These processors are optimized for efficiency with low power draw but don’t sacrifice performance or responsiveness. Built on top of AMD “Zen 4” architecture, the 8000G Series processors enable leadership energy efficiency while still leveraging the incredible speed of “Zen 4”. At the top of the stack, AMD Ryzen™ 7 8700G features eight cores, 16 threads, 24MB of Cache, and Radeon™ 780M graphics. Meanwhile, AMD Ryzen™ 5 8600G offer six cores, 12 threads, 22MB of Cache, and Radeon 760M graphics. Both include AMD Ryzen™ AI technology, including the first NPU on a desktop PC processor, uniquely able to accelerate AI software capabilities in your PC to optimize AI workloads, improve AI processing efficiencies, and unlock exciting experiences like AI-powered noise cancellation. All 8000G Series desktop processor models offer the fastest built-in graphics in its class with the impressive power of Radeon 700M.2 Gamers will benefit from impressive visual fidelity, providing a smooth AAA 1080p gaming experience at an affordable price point, and in small form factors. The Ryzen™ 7 8700G features Radeon 780M graphics with the fastest built-in graphics you can get in a desktop processor.3 The 8000G Series is perfect for those wanting to enter the AM5 ecosystem and enjoy a smooth 1080p experience today, with the option to upgrade with a discrete graphics card later for even higher fidelity gameplay. The entire 8000G Series also features AMD EXPO™ technology, enabling higher memory frequencies and advanced timings to unlock smoother frame rates.4 Precision Boost Overdrive (PBO) allows one-touch overclocking, giving users an extra CPU boost with increased power limits.5 AMD Ryzen™ 8000G Series desktop processors are expected to be available to DIY customers, SI partners starting January 31st, 2024. OEM systems are expected to arrive in Q2 2024. New AMD Ryzen™ 5000 Series Desktop Processors Bring More Performance to Legacy Socket AM4 PlatformsFor gaming enthusiasts seeking unparalleled performance, AMD Ryzen™ 5000 Series desktop processors are built on the proven \"Zen 3\" architecture, which optimizes performance with higher clock speeds and improved efficiency for a seamless gaming experience. AMD extends this series with four new processors: AMD Ryzen™ 7 5700X3D, AMD Ryzen™ 5 5700, AMD Ryzen™ 5 5600GT, and AMD Ryzen™ 5 5500GT. The AMD Ryzen™ 7 5700X3D is purpose-built for gamers looking for a massive boost in gaming performance. With eight cores and 16 threads, the processor leverages AMD 3D V-Cache™ technology to deliver an astonishing 100MB of on-chip memory, providing power and productivity gains for games and applications at any setting and any resolution. The new Ryzen 5000 Series desktop processors are expected to be available to DIY customers and SI partners starting January 31st, 2024. OEM Partners Launch Additional Ryzen™ 8040 Series-Powered Laptops at CESAMD OEM partners including ACER, ASUS, Lenovo, HP and Razer are introducing more AMD Ryzen™ 8040 Series-powered handheld gaming systems, gaming laptops and personal laptops, with incredible performance for gamers, professionals and consumers of all types, and unlocking AI-ready capabilities for content creation and everyday productivity. First announced at the AMD “Advancing AI” event in December 2023, the Ryzen™ 8040 Series helps bring new AI PCs to market with its integrated Ryzen AI NPU on select models. “Through our partnership with AMD, we are able to deliver seamless, AI-backed gaming experiences to customers,” said James Lin, general manager, Notebooks at Acer Inc. “Our latest Nitro V 16 laptop powered by the AMD Ryzen 8040 Series processors is a great example of how we’re bringing AI-ready gaming laptops to gamers everywhere. With Ryzen 8040 Series processors, we will deliver new and enhanced features equipping gamers with more immersive in-game experiences and a competitive edge.” “We’re excited to launch the latest laptops, including the ROG Zephyrus G14 and the ASUS TUF Gaming A15 and A16, all featuring Ryzen 8040 processors aimed at delivering the most exhilarating on-the-go gaming experiences to our customers,” said ASUS Co-CEO S.Y. Hsu. “We’ve completely redefined mobile gaming by partnering with AMD. The new Ryzen 8040 Series processors will provide customers with the highest quality gameplay for hours without drops in speed or game stuttering.” “Lenovo and AMD have a long-standing partnership that continues to deliver to customers the power and flexibility they have come to expect,” said Jun Ouyang, Lenovo’s vice president and general manager of the Consumer Business Segment, Intelligent Devices Group. “This partnership has continued with the expansion of our product portfolio to include the Lenovo Yoga Pro 7 (14\", 9), Lenovo IdeaPad 5 2-in-1 (14\", 9) and Lenovo IdeaPad 5 2-in-1 (16\", 9) all powered by new Ryzen 8040 processors to support the creative and productivity pursuits of today’s brightest thinkers and doers.” \"At HP, we are redefining the PC for the next generation of more personal computing, and partnering with AMD for our future solutions,” said Alex Cho, president, Personal Systems, HP Inc. “With AMD, we are committed to delivering groundbreaking, personalized experiences that revolutionize the way we live, work, and play.” “The Ryzen 8040 Series processors represent a significant milestone for gamers looking for speed, performance and an AI accelerated experience,” said Travis Furst, head of Notebook and Accessories Division at Razer. “We are thrilled to launch the new Razer Blade 14, our most portable Razer Blade, integrating the AMD Ryzen 9 8945HS processor with Ryzen AI to provide gamers with an unparalleled mobile experience.” Supporting Resources About AMDFor more than 50 years AMD has driven innovation in high-performance computing, graphics and visualization technologies. Billions of people, leading Fortune 500 businesses and cutting-edge scientific research institutions around the world rely on AMD technology daily to improve how they live, work and play. AMD employees are focused on building leadership high-performance and adaptive products that push the boundaries of what is possible. For more information about how AMD is enabling today and inspiring tomorrow, visit the AMD (NASDAQ: AMD) website, blog, LinkedIn and X pages. Cautionary Statement  This press release contains forward-looking statements concerning Advanced Micro Devices, Inc. (AMD) such as the features, functionality, performance, availability, timing and expected benefits of AMD products including AMD Ryzen™ 8000G Series desktop processors, AMD Ryzen™ 5000 processors and additional AMD Ryzen™ 8040 Series-powered handheld gaming systems, gaming laptops and personal laptops with OEM partners, which are made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are commonly identified by words such as \"would,\" \"may,\" \"expects,\" \"believes,\" \"plans,\" \"intends,\" \"projects\" and other terms with similar meaning. Investors are cautioned that the forward-looking statements in this press release are based on current beliefs, assumptions and expectations, speak only as of the date of this press release and involve risks and uncertainties that could cause actual results to differ materially from current expectations. Such statements are subject to certain known and unknown risks and uncertainties, many of which are difficult to predict and generally beyond AMD's control, that could cause actual results and other future events to differ materially from those expressed in, or implied or projected by, the forward-looking information and statements. Material factors that could cause actual results to differ materially from current expectations include, without limitation, the following: Intel Corporation’s dominance of the microprocessor market and its aggressive business practices; economic uncertainty; cyclical nature of the semiconductor industry; market conditions of the industries in which AMD products are sold; loss of a significant customer; impact of the COVID-19 pandemic on AMD’s business, financial condition and results of operations; competitive markets in which AMD’s products are sold; quarterly and seasonal sales patterns; AMD's ability to adequately protect its technology or other intellectual property; unfavorable currency exchange rate fluctuations; ability of third party manufacturers to manufacture AMD's products on a timely basis in sufficient quantities and using competitive technologies; availability of essential equipment, materials, substrates or manufacturing processes; ability to achieve expected manufacturing yields for AMD’s products; AMD's ability to introduce products on a timely basis with expected features and performance levels; AMD's ability to generate revenue from its semi-custom SoC products; potential security vulnerabilities; potential security incidents including IT outages, data loss, data breaches and cyber-attacks; potential difficulties in operating AMD’s newly upgraded enterprise resource planning system; uncertainties involving the ordering and shipment of AMD’s products; AMD’s reliance on third-party intellectual property to design and introduce new products in a timely manner; AMD's reliance on third-party companies for design, manufacture and supply of motherboards, software, memory and other computer platform components; AMD's reliance on Microsoft and other software vendors' support to design and develop software to run on AMD’s products; AMD’s reliance on third-party distributors and add-in-board partners; impact of modification or interruption of AMD’s internal business processes and information systems; compatibility of AMD’s products with some or all industry-standard software and hardware; costs related to defective products; efficiency of AMD's supply chain; AMD's ability to rely on third party supply-chain logistics functions; AMD’s ability to effectively control sales of its products on the gray market; impact of government actions and regulations such as export regulations, tariffs and trade protection measures; AMD’s ability to realize its deferred tax assets; potential tax liabilities; current and future claims and litigation; impact of environmental laws, conflict minerals-related provisions and other laws or regulations; impact of acquisitions, joint ventures and/or investments on AMD’s business and AMD’s ability to integrate acquired businesses; impact of any impairment of the combined company’s assets; restrictions imposed by agreements governing AMD’s notes, the guarantees of Xilinx’s notes and the revolving credit facility; AMD's indebtedness; AMD's ability to generate sufficient cash to meet its working capital requirements or generate sufficient revenue and operating cash flow to make all of its planned R&D or strategic investments; political, legal and economic risks and natural disasters; future impairments of technology license purchases; AMD’s ability to attract and retain qualified personnel; and AMD’s stock price volatility. Investors are urged to review in detail the risks and uncertainties in AMD’s Securities and Exchange Commission filings, including but not limited to AMD’s most recent reports on Forms 10-K and 10-Q. © 2024 Advanced Micro Devices, Inc. All rights reserved. AMD, the AMD Arrow logo, FreeSync, Radeon, Ryzen and combinations thereof, are trademarks of Advanced Micro Devices, Inc. Other names are for informational purposes only and may be trademarks of their respective owners. The information contained herein is for informational purposes only and is subject to change without notice. Timelines, roadmaps, and/or product release dates shown in this Press Release are plans only and subject to change. 1An AMD Ryzen 7 8700G processor with integrated Radeon 780M graphics is projected to have the fastest integrated desktop processor graphics in the world. Performance projection by AMD engineering staff. Engineering projections are not a guarantee of final performance. Specific projections are based on reference design platforms and are subject to change when final products are released in market. PXD-02.2 Each of the AMD Ryzen 8000G Series processors with integrated Radeon graphics are projected to have the fastest integrated desktop processor graphics in their respective classes. AMD defines the class as Ryzen 8000G Series processors, Intel Core i7-14700, Intel Core i5-14600, and Intel Core i3-141004 processors. Performance projections by AMD engineering staff as of October 2023. Engineering projections are not a guarantee of final performance. Specific projections are based on reference design platforms and are subject to change when final products are released in market. PXD-01.3 An AMD Ryzen 7 8700G processor with integrated Radeon 780M graphics is projected to have the fastest integrated desktop processor graphics in the world. Performance projection by AMD engineering staff. Engineering projections are not a guarantee of final performance. Specific projections are based on reference design platforms and are subject to change when final products are released in market. PXD-024 Overclocking and/or Undervolting AMD processors and memory, including without limitation, altering clock frequencies / multipliers or memory timing / voltage, to operate outside of AMD’s published specifications will void any applicable AMD product warranty, even when enabled via AMD hardware and/or software. This may also void warranties offered by the system manufacturer or retailer. Users assume all risks and liabilities that may arise out of overclocking / undervolting AMD processors, including, without limitation, failure of or damage to hardware, reduced system performance and/or data loss, corruption or vulnerability. GD-106.5 Precision Boost Overdrive requires an AMD Ryzen Threadripper, Ryzen 3000 Series (excluding Ryzen 3400G and 3200G) or newer desktop processor, or a Ryzen 9 7945HX3D mobile processor, and a compatible motherboard. Because using Precision Boost Overdrive enables operation of the processor outside of AMD’s published specifications, use of the feature invalidates the AMD product warranty and may also void warranties offered by the system manufacturer or retailer. Availability of Precision Boost Overdrive in pre-built OEM systems will vary based on the PC manufacturer’s settings. Check with the PC manufacturer prior to purchase. GD-179.6 Max boost for AMD Ryzen processors is the maximum frequency achievable by a single core on the processor running a bursty single-threaded workload. Max boost will vary based on several factors, including, but not limited to: thermal paste; system cooling; motherboard design and BIOS; the latest AMD chipset driver; and the latest OS updates. GD-150 Contact:Stacy MacDiarmid AMD Communications+1 512-658-2265Stacy.MacDiarmid@amd.com Suresh BhaskaranAMD Investor Relations+1 408-749-2845Suresh.Bhaskaran@amd.com A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/7495b326-1563-40bf-89b2-5d118c9f6e3b "
}