{
    "title": "AMD's Ryzen 8000G \"Hawk Point\" APUs To Bring USB4 Support On AM5 \nMotherboards",
    "date": "1/5/2024",
    "url": "https://appuals.com/am5-usb4-support/",
    "text": "On certain AM5 boards, including the AORUS B650E series, AMD Ryzen 8000G “Hawk Point” APUs will provide extra I/O capabilities, like USB4. According to Benchlife, manufacturers are currently targeting AMD’s Ryzen 8000G Desktop APUs with plans to integrate USB4 into AM5 motherboards. The news source states that Gigabyte and other businesses may soon launch motherboards with USB4 transmission compatibility, a feature that AMD had greatly missed since Intel included the standard in its 11th Generation products and AMD had done little to address the problem. Although add-in cards from manufacturers like MSI made USB4 functionality available, the AM5 side of the platform has not yet provided native support for it. A few months ago, AMD’s CEO Lisa Su visited multiple Taiwanese manufacturers with the intention of reaching USB4 capability on desktop processors, and rumours began circulating around the possibility of USB4 enablement on AMD AM5 motherboards. Rumour has it that the Taiwanese company Asmedia is in charge of adding USB4 capability to the AMD platform, but nothing has been confirmed of this as of late. Many believe that the AORUS B650E ELITE X AX ICE motherboard from Gigabyte will be compatible with AMD’s future Ryzen 8000G “Hawk Point” APUs and may even have USB4 connectivity. In addition to adding support for new architectures, Gigabyte plans to make gains in the “connectivity” field using the AGESA 1.1.0.1a BIOS firmware upgrade that AMD has already released for AM5 motherboards which use Hawk Point APUs. USB4, the new platform can enable transfer speeds of up to 40Gbps. The addition of port extension is the main differentiator from earlier versions, as a single Thunderbolt 4 dock may connect many devices simultaneously. Rumour has it that AMD’s forthcoming Ryzen 8000G “Hawk Point” APU lineup release could mark the introduction of USB4 to their AM5 platform, but this is still just speculation at this point. Source: Benchlife Farhan Ali "
}