{
    "title": "How AMD and Whitestack are breaking new grou...",
    "date": "1/3/2024",
    "url": "https://www.bnamericas.com/en/news/how-amd-and-whitestack-are-breaking-new-ground-for-latam-telcos-with-open-cloud-innovations",
    "text": "Open cloud network technologies, until now only tentatively adopted by telcos in Latin America, could expand in the next few years. “We're already growing with unusual figures in the Latin American market, adding new countries and operators,” José Miguel Guzmán, cloud telco solutions architect at US-based cloud firm Whitestack, told BNamericas. Guzmán expects that “a couple of large operators” in Latin America will begin the transition to open technologies this year. Whitestack is one of the providers for Telefónica's telco cloud, the first telecommunications group in the region to implement this open cloud-based model. In addition to Whitestack, the Spanish operator also works with “a dozen” manufacturers that have decided to adopt a cloud-native deployment model, Guzmán said. Telefónica began the migration three years ago in “practically all the countries where they operate [in Latin America]: Mexico, Colombia, Chile, Argentina, Uruguay and Peru,” he added. Some of the operator's services are already being offered through open technologies. According to Guzmán, the change towards more efficient technologies allowed the financial situation of the Madrid-based company to improve. “In a short time, Telefónica has gone from a scenario in which they were very bad and today they're generating a level of profit comparable to European operations,” said Guzmán. While there is expected to be greater adoption among large operators, mid-sized telcos are also embarking on the transition to open technologies. Whitestack's first open technologies project in telecommunications was for Mundo in Chile. Announced in 2020, it saw the increase of network capacity through open disaggregated networking technologies from IP Infusion and Whitestack. Guzmán says the operator's success in terms of broadband service speed is directly associated with the engineering decisions that have been made in the past. “Open technology meant lower costs and better performance,” he added. PERFORMANCE IMPROVEMENTS In mid-2023, AMD, Whitestack and Dell Technologies announced a telco cloud certification center in Chile. The initiative allows engineers and operators' specialists to develop, test and execute services and applications. One of the advantages of migrating to open environments is the possibility of implementing technologies on conventional X86 servers. AMD offers an improvement in performance, reducing the cost per processor and the existing infrastructure. This is important for the reduction of energy consumption, as well as for the limitations that operators now have when allocating capex. “It’s an industry that is facing an adverse scenario around the world, ARPU is going down but costs aren't. Internet traffic is increasing, but not income,” said Guzmán. In the case of energy consumption, it is not only about reducing electricity bills, but also about making buildings more efficient by putting greater processing capacity in less space. “In Buenos Aires, Montevideo or Santiago there are places that come from the old telephone exchanges and that's where they [the operators] are developing the network today. And they have limited capacity, they need to preserve space and energy,” Juan Moscoso, regional datacenter and cloud leader for AMD's Spanish-speaking South America region, told BNamericas. \"Telco's find it very difficult [to make investments in technology] because they either don't have adequate air conditioning or they don't have additional power capabilities, or they don't have physical rack space,\" he said. \"We're managing to be much more sustainable,\" added Moscoso, who claims to be able to achieve better yields with less infrastructure and at a lower cost. In tests conducted with cloud architecture, virtual machines and Dell servers with AMD, the performance of traditional servers was multiplied by 10. “Normally a network function generates 30-40Gbs on a server, we [with AMD] are achieving 360Gbs,” said Guzmán. According to Moscoso, AMD is achieving between 3.0 and 3.7 times the performance of the competition. At the time of the announcement of the new telco cloud laboratory in Chile, Dell said it had been able to demonstrate that the total cost of ownership fell by 30% and capex by 23% with the new generation of Dell PowerEdge servers. Likewise, reductions in energy consumption, space and infrastructure allow for projected opex savings of almost 37%. Currently a network functions manufacturer is using the laboratory to test its technology. Subscribe to the leading business intelligence platform in Latin America with different tools for Providers, Contractors, Operators, Government, Legal, Financial and Insurance industries. The collaboration benefits both Arelion and Telxius’ customers in North America and Latin America with enhanced access to the companies’ combined g... Although companies in Latin America often have budget restrictions, personal data protection legislation in Brazil, Mexico and Chile is driving the... Subscribe to Latin America’s most trusted business intelligence platform. Get critical information about thousands of ICT projects in Latin America: what stages they're in, capex, related companies, contacts and more. Request Demo Get critical information about thousands of ICT companies in Latin America: their projects, contacts, shareholders, related news and more. Request Demo Subscribe to BNamericas to find news reports, information on projects and contact information relating to thousands of companies that drive business in Latin America. 4 viewing opportunities left Request a demo and access exclusive content "
}