{
    "title": "AMD Ryzen 9000 release date could be much sooner than expected",
    "date": "1/26/2024",
    "url": "https://www.pcgamesn.com/amd/ryzen-9000-release-date",
    "text": "AMD is reportedly planning to launch its new Zen 5 CPU lineup well before Intel Arrow Lake comes out, with X3D chips coming later. Ben Hardwidge Published: Jan 26, 2024 The wait for the AMD Ryzen 9000 release date looks like it could soon be over, as the latest rumors point to the release date of AMD’s next CPU range being as soon as April 2024. AMD has already revealed that it plans to release its next CPU architecture, Zen 5, this year in its official roadmap, but it now looks like it’s going to come out well before the launch of Intel’s Arrow Lake processors. The current Zen 4 CPU lineup offers an incredible amount of processing power per core, with three of the chips listed on our best gaming CPU guide, and the Ryzen 7 7800X3D getting the prestigious “best for gaming” title. According to the latest rumors, AMD isn’t going to rock the boat too much with the Ryzen 9000 series, though, with the company reportedly planning to stick to the same number of cores. We already know that the new CPUs will be manufactured on TSMC’s 4nm process, which is also used to make the cores in AMD’s latest APUs, such as the Ryzen 7 8700G. This means the transistors will be smaller than those in AMD’s current Ryzen 7000-series desktop CPUs, enabling AMD to reduce their power draw, and pack more of them into the CPU cores, resulting in faster performance. All of this latest speculation about the AMD Ryzen 9000 series comes from tech YouTuber and analyst High Yield, who revealed on X (formerly Twitter) that his latest intel tells him that “a launch between April-June is very likely”. High Yield also listed some of the expected specs, saying that AMD Ryzen 9000 CPUs will have the same number of cores as their Ryzen 7000 counterparts (and indeed every other AMD range since the 3000 series). That means there will be six-core, eight-core, 12-core, and 16-core options, and High Yield says they will have similar clock speeds to the current lineup too. High Yield also says the latest information points to a “double-digit IPC uplift”, where IPC is short for “instructions per clock”. In short, a Ryzen 9000 CPU running at 5GHz will be able to process more instructions per MHz than a Ryzen 7000 CPU at the same clock speed.  There’s good news for anyone who already owns a Ryzen 7000 system as well, as the new CPUs will use the same AM5 socket, and High Yield says they “should work with existing X670/B650” motherboards – you’ll just need to flash your BIOS. X3D versions of the chips for gaming are also expected. These CPUs have a big stack of cache on top of the CPU cores, which can give a substantial boost to gaming performance, and this has been borne out in our testing too. However, High Yield doesn’t expect X3D CPUs to be available at launch, instead saying “I expect AMD to launch Zen5 X3D right before ARL”. In this case, ARL is short for Arrow Lake, Intel’s new rival desktop CPU architecture, which is also expected to launch this year. Another regular tech leaker, Kepler_L2, also replied on X that “X3D is CES 2025”, meaning it could be a whole year before we start to see Ryzen 9000 X3D gaming CPUs. Either way, 2024 is shaping up to be a very interesting battleground for CPUs, with new architectures coming from both Intel and AMD. In the meantime, take a look at our best CPU guide if you’re on the lookout to buy yourself a new processor. Ben Hardwidge                 A tech journalist since 1999, and a PC hardware enthusiast since 1989, Ben has seen it all, from the horrors of CGA graphics to the amazing ray-tracing GPUs of today. Ben is mainly interested in the latest CPU and graphics tech. "
}