{
    "title": "Price wars are on! AMD 7800 XT price drops following Nvidia's RTX 4070 deal",
    "date": "2/13/2024",
    "url": "https://www.neowin.net/deals/price-wars-are-on-amd-7800-xt-price-drops-following-nvidias-rtx-4070-deal/",
    "text": "3 hours ago 3 hours ago 6 hours ago 6 hours ago 3 hours ago 13 hours ago 13 hours ago 19 hours ago Mar 28, 2024 Mar 27, 2024 Mar 26, 2024 Mar 26, 2024 Mar 28, 2024 Mar 28, 2024 Mar 26, 2024 Mar 26, 2024 7 hours ago Mar 30, 2024 Mar 30, 2024 Mar 30, 2024 Mar 25, 2024 Mar 23, 2024 Mar 20, 2024 Mar 17, 2024 Dec 31, 2023 Oct 14, 2023 Apr 11, 2023 Mar 27, 2024 Mar 25, 2024 Mar 10, 2024 Mar 3, 2024 Mar 24, 2024 Mar 21, 2024 Sep 23, 2023 Sep 21, 2023 19 hours ago Mar 29, 2024 Mar 28, 2024 Jun 14, 2003 Feb 23, 2024 Jan 20, 2024 Dec 6, 2023 Jun 6, 2023 Sayan Sen\n\nNeowin\n                ·\n    \n\n    Feb 13, 2024 13:30 EST\n    \n\nwith 4 comments  The recent Nvidia RTX 4000 Super series launch has been a good one. Not only has the company pushed down the prices of the GPUs a bit - 4080 Super for $999, 4070 Ti Super for $799, and 4070 Super for $599 - it has also sparked a reaction down the stack for both Teams Green and Red. AMD emailed Neowin announcing an official price cut on its RX 7900 XT and 7900 GRE GPUs as a likely response to the arrival of the GeForce Super cards. And since then, the price of the RX 7900 XT dropped to as low as just $670. While those have run dry, Nvidia too responded with quick price adjustments to its rivaling RTX 4070 Ti which are still available for as low as $700. Meanwhile, further down the stack, the RTX 4070 dropped to $530, and over on the AMD side, one of the 7800 XTs was discounted to $500. It looks like the price wars for the mid-range cards are on as AMD has again dropped price of another 7800 XT, this time the Sapphire Pulse and ASRock models to $490 (buying links below). The RX 7800 XT is around 10% faster than the RTX 4070 in rasterization, but is quite a bit slower in ray tracing (RT), only able to keep up with the RTX 4060 Ti. Though, if you don't prioritize RT, the 7800 XT is a great card to buy. It comes with 16GB VRAM as well so you won't have to worry about texture streaming and popping issues any time soon on 1440p or even 4K. Get the RX 7800 XT at the links below: Sapphire 11330-02-20G Pulse AMD Radeon RX 7800 XT Gaming Graphics Card with 16GB GDDR6: $489.99 (Amazon US) Sapphire 11330-02-20G Pulse AMD Radeon RX 7800 XT Gaming Graphics Card with 16GB GDDR6: $509.99 + $20 off w/ promo code PDSSDPA3464, limited offer (Newegg US) ASRock Challenger Radeon RX 7800 XT 16GB GDDR6 PCI Express 4.0 x16 ATX Video Card RX7800XT CL 16GO: $499.99 + $10 off w/ promo code PDSSDPA3473, limited offer (Newegg US) If this doesn't interest you, you can also browse through Amazon US, Amazon UK, or Newegg US, to see if you find some great deals that we missed. You can also go visit the Deals section of our articles to see if there's something you fancy. As an Amazon Associate I earn from qualifying purchases. Sayan Sen\n                                                ·\n                    \nNov 29, 2023\n\nwith\n5\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nNov 19, 2023\n\nwith\n5\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nOct 3, 2023\n\nwith\n0\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nSep 8, 2023\n\nwith\n3\n                            comment\n                                s Login or Sign Up to read and post a comment. Please enter your reason for reporting this comment. blackview bl8000 horizon forbidden west windows 11 insider preview promo microsoft weekly twirl 158 windows 11 insider preview promo windows 11 moment 5 dragons dogma 2 task manager notepad © Since 2000 Neowin®\n                                    All trademarks mentioned are the property of their respective owners. "
}