{
    "title": "Microsoft's next Xbox release may lag behind Sony due to a delay signing \ncontracts with AMD, leaker claims",
    "date": "2/3/2024",
    "url": "https://www.eurogamer.net/microsofts-next-xbox-release-may-lag-behind-sony-due-to-a-delay-signing-contracts-with-amd-leaker-claims",
    "text": "Long read: The beauty and drama of video games and their clouds \"It's a little bit hard to work out without knowing the altitude of that dragon...\" \"Meanwhile, there are multiple post-PS5 contracts already signed between Sony and AMD.\" Microsoft's next console release may lag behind Sony's due to a delay in signing contracts with technology partner AMD. That's according to podcaster Moore's Law is Dead, who stated earlier this week that Microsoft was \"seriously, seriously shopping around with Intel and even NVIDIA apparently for their next-gen console\". \"As of one month ago, no next-gen contract with AMD had been signed with Microsoft,\" they said. \"Meanwhile, to put things in context, [...] there are multiple post-PS5 contracts already signed between Sony and AMD, meaning that PlayStation handheld – whether it comes out or not – is in high-level development. The PlayStation 6 is in deep development already, and that is really weird if Sony has two contracts with AMD already, and Microsoft still has not signed one.\" Moore's Law is Dead goes on to say that Microsoft often \"shops around\" before signing with AMD in the hopes of brokering a cheaper deal. However, it's thought Microsoft was \"dragging [its] feet\" confirming if a deal was going to go ahead with AMD. Interestingly, Intel took this interest \"super seriously\", and was reportedly considering offering the \"silicon at least at cost, if not even a little below cost\". Most crucially, it's thought that Microsoft's delay in choosing a silicon partner may have put it behind its long-time console sparring partner, Sony. The leaker goes on to confirm that \"in the last couple of weeks\", Microsoft \"stopped ghosting AMD\" and only now is Microsoft \"starting design with AMD\". That means Microsoft is \"way behind Sony\" and while they thinks Microsoft could certainly catch up with Sony, its next-gen system \"may be a little later than people expect, and it might be a bit rushed\" (thanks, wccftech). We've reached out to Microsoft for comment and will update when we hear back. Earlier this week, following Microsoft's decision to cut 1900 staff members, Windows Central's Jez Corden said Microsoft had \"shut down departments dedicated to bringing Xbox games to physical retail\". Whilst not necessarily the end for boxed Xbox games – Corden said Microsoft can outsource physical game production and may be consolidating teams across departments – the news it has cut staff working on physical game releases comes after Microsoft accidentally revealed it had planned for a digital-only console future as early as this year. And, as Tom pointed out for us at the time, only last week, Microsoft said that one of its key games for this year - Hellblade 2 - would be a digital-only launch. From Assassin's Creed to Zoo Tycoon, we welcome all gamers Eurogamer welcomes videogamers of all types, so sign in and join our community! Interview |\n\n\nNiantic: Pokémon Go healthy and growing as it approaches its next decade Fan-made TimeSplitters Rewind reemerges with call for help to reach finish line Halo, Call of Duty support studio Certain Affinity is laying off 25 employees Dead Cells, Vampire Survivors, Slay The Spire devs team up for 45-minute indie showcase in April Next week's Epic Games Store freebies include The Outer Worlds: Spacer's Choice Edition Monster Hunter Wilds reportedly \"fully open world\" and coming Q1 2025 Newscast |\n\n\nIf Larian's not making Baldur's Gate 4, which developer might? Valheim publisher Coffee Stain announces new deckbuilding roguelike As We Descend The latest video game jobs on GamesIndustry.biz Bad puns and video games since 1999. Eurogamer.net is owned by Gamer Network Limited, a ReedPop company and subsidiary of Reed Exhibitions Limited. © 2024 Gamer Network Limited, Gateway House, 28 The Quadrant, Richmond, Surrey, TW9 1DN, United Kingdom, registered under company number 03882481. All rights reserved. No part of this website or its content may be reproduced without the copyright owner's permission. "
}