{
    "title": "AMD Zen 1-4 Processors Have 4 'High Security' Vulnerabilities",
    "date": "2/17/2024",
    "url": "https://gamerant.com/amd-zen-1-4-processors-high-security-vulnerabilities-ryzen/",
    "text": "AMD discloses 'high security' vulnerabilities that currently affect Zen 1-4 processors, including the popular budget Ryzen 3000 series of CPUs. AMD disclosed four \"high security\" vulnerabilities affecting its Zen 1–4 processors, including the popular Ryzen 3000 desktop and 4000 mobile series CPUs. These vulnerabilities can drastically affect performance and security across an array of AMD-based systems, including servers, gaming desktop PCs, and workstation PCs utilizing AMD processors. AMD's latest processors are the Ryzen 5 8600G and Ryzen 7 8700G, which both offer CPU functions and integrated graphics on a single chip often referred to as an APU. APUs are a great budget-friendly option for those wanting to build their first PC and buy a graphics card at a later date, since a dedicated GPU is not required. In addition, PC builders may look at older generation AMD Ryzen CPUs, including the popular Ryzen 5 3600, as an alternative for budget builds. Reported by Guru3D, AMD's latest security bulletin announcement reveals that four vulnerabilities are currently affecting Ryzen 3000, 4000 mobile, Embedded V2000, and Embedded V3000 processors. These vulnerabilities are classified as high risk, since malicious users can bypass certain dual serial peripheral interface processes and remotely execute code. As a result, AMD advises users to be careful and take security precautions until new BIOS updates are released. Ryzen 4000 series APUs will receive BIOS updates before the end of February 2024, followed by Ryzen 3000 series CPUs in March 2024 and embedded processors in April 2024. Those wanting to build a new PC may want to consider newer budget AMD gaming CPUs to avoid these vulnerabilities entirely.  All four vulnerabilities were discovered by AMD security researchers, who normally test current and outdated hardware and software for BIOS revisions. Fortunately, the vulnerabilities have already been patched on AMD's latest gaming processors, including Ryzen 7000 and 8000 processors. Users may want to double-check their current BIOS version to ensure it's up-to-date with the latest version, however. If a new BIOS version is available, users may use a USB drive to initiate a BIOS flash after downloading the files for the latest version. Updating Windows 11 to the latest version is also recommended by AMD, since security updates can help protect a user's PC and data. AMD's latest desktop components and laptops support many features that are currently present on Windows 11, including DirectStorage and USB 4.0. We hope you like the items we recommend and discuss! Game Rant has affiliate and sponsored partnerships, so we receive a share of the revenue from some of your purchases. This won’t affect the price you pay and helps us offer the best product recommendations.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Raul is a freelance writer with four years of writing and editing experience in games journalism. Currently, he is a News Writer at Game Rant and the Managing Editor of Final Weapon, a Japanese gaming and anime/manga-oriented outlet. Raul has a passion for the Japanese gaming industry, but he dabbles into first-person shooters like Call of Duty and Destiny. Apple Watches have paved the way for smartwatches of all kinds, so choosing the best smartwatch for iPhone users should be easy, right? Yes and no. Elon Musk files a lawsuit against OpenAI, sparking a legal battle between the tech entrepreneur and the renowned AI research organization. A prominent Sega leaker offers some additional insights about the recent rumor pointing to the Nintendo Switch 2 release month. A gamer finds what appears to be a super rare Xbox 360 console variant while shopping at their local GameStop. An Xbox gamer makes an exciting discovery after getting their hands on a used Xbox 360 console from the mid-2000s. Logitech produces highly rated peripherals for both work and play. These innovative keyboards deserve special attention from gamers. "
}