{
    "title": "G.Skill Trident Z5 Neo RGB DDR5-6400 review: Gorgeous RAM design with the \nperformance to match",
    "date": "2/18/2024",
    "url": "https://www.xda-developers.com/gskill-trident-z5-neo-rgb-ddr5-6400-review/",
    "text": "An excellent DDR5 RAM kit for AMD and Intel processors Choosing system memory for your PC involves checking what is supported by your processor and motherboard. G.Skill makes numerous modules for different applications. Whether you need some budget-friendly memory for a low-power system or RGB-infused modules with impressive performance for more intensive tasks, G.Skill likely has a RAM kit for you. The Trident Z5 Neo RGB is a gaming series of RAM with a flashy design, solid, reliable performance, and great value compared to more expensive options. Testing the Trident Z5 Neo RGB 32GB DDR5-6400 RAM kit from G.Skill saw impressive results with the AMD Ryzen 7 8700G APU. Not only do the two modules look the part with a striking design and gorgeous RGB diffusers, but they perform well under load and can even be pushed a little harder, depending on your CPU and motherboard configuration. It's a perfect example of DDR5 memory becoming a better buy for newer systems as prices continue to fall and performance improves as the technology matures. About this review: G.Skill provided XDA with a sample for this review but had no input to its contents. Solid DDR5 performance for work and play G.Skill offers its Trident Z5 Neo RGB DDR5 RAM kits in a variety of capacities and speeds, as well as support for either EXPO or XMP. You won't be disappointed with the results. The G.Skill Trident Z5 Neo RGB is a family of DDR5 RAM modules with capacities ranging between 16GB and 96GB for kits. Speeds start at 5600 MT/s and top off at 6400 MT/s. These speeds are breakneck, especially compared to older DDR4 modules. The kit we're reviewing is the DDR5-6400 32GB, which is ample system memory for running apps on Linux or Windows and playing a game or two. The price for this 32GB kit is $120, showing just how affordable DDR5 RAM has become.  G.Skill designed the Trident Z5 Neo RGB memory with sleek heat spreaders and diffused RGB lighting at the top of each module. With a height of 42mm, the modules should be compatible with most CPU air coolers available for Intel and AMD processors. The RGB lighting can be controlled by the motherboard to synchronize with other lighting components or through G.Skill's Trident Z Lighting Control software. By default, the modules will run through a rainbow lighting effect, which looks great on its own but may not be a direct match for your PC theme. Memory is a fairly boring component when it comes to design. Manufacturers can't do too much to differentiate their kits from one another. Adding too much to the modules and you'll run the risk of interfering with the CPU cooler, too little and no one will buy your RAM. Thankfully, G.Skill has nailed its RAM design with the impressive (and super-blingy) Royal Z modules to the Trident Z Neo RGB range, the latter of which look more tailored to gaming rigs. To see just how good this G.Skill kit is, I tested it with an AMD Ryzen 7 8700G APU I also reviewed. As well as the APU, the Ryzen 7950X was used to see how far we could push the modules with a flagship CPU and one of the best processors around. Like other DDR5 RAM modules, the G.Skill Trident Z5 Neo RGB defaults to 4800 MT/s without the activation of Intel XMP or AMD EXPO. The Gigabyte B650 Aorus Elite AX Ice allowed the RAM to run at its rated speed of 6400 MT/s with timings CL32-39-39-102 at 1.4v. AMD states 6400 MT/s as the sweet spot for its 8000 series Ryzen APUs, such as the Ryzen 7 8700G. AMD's 7000 series processors also work well with faster RAM, though your mileage may vary. Overclocking memory on Intel's platform seems to be an easier process with better results. I tested the G.Skill Trident Z5 Neo RGB at its default settings with no overclocking profile applied, then tried the same suite of tests with XMP/EXPO enabled, and finally, I did some light manual overclocking to see how the RAM and processors reacted. Running the RAM at the base speed of 4800 MT/s doesn't allow the processor to flex its mechanical muscle and this shows a good 10-15% drop in performance compared to activating EXPO/XMP. It's always recommended to check the status of the RAM on your OS compared to its rated speeds as this is the easiest way to give your PC a considerable boost with the click of a button. The AMD Ryen 7 8700G enjoyed the high-speed DDR5 RAM, running its integrated GPU with excellent results at 1080p. Overclocking the RAM, I managed to hit 6800 MT/s on 1.4v with timings of CL38, which provided a slight improvement to the integrated GPU on the AMD Ryzen 7 8700G in a suite of games. Scores in 3D Mark reflect this, though your mileage will vary depending on the processor and motherboard. An APU such as the Ryzen 7 8700 will be more sensitive to memory speed changes with the GPU utilizing RAM for buffering over having dedicated VRAM on a discrete graphics card. The competition for DDR5 RAM is hot. There are plenty of brands in play, including Corsair, ADATA, Kingston, and PNY. In our best DDR5 RAM collection, we handpicked the best memory modules for use inside desktop PCs. It's surprising to learn DDR5 has been around for more than a year now with our earlier Kingston Fury Beast DDR5-4800 kit review hitting the site in January 2022. Speeds have improved greatly over the two years, and so have timings to result in better overall performance. In the early days of DDR5, I believed it didn't warrant an upgrade over DDR4 for performance alone. Intel processors still support DDR4 RAM, as well as DDR5. It was with the launch of the AMD Ryzne 7000 series of chips that DDR5 started to make more sense since AMD dropped DDR5 support altogether. It's now possible to find DDR5 modules with speeds up to 8000 MT/s, which is considerably higher than this DDR5-6400 kit. I wouldn't call it settling to buy a kit at this speed either, 6400 MT/s is ample bandwidth for the processor to utilize. The G.Skill Trident Z5 Neo RGB is one of the best kits on the DDR5 block. Still, there are other DDR5 kits to consider, some even undercutting the G.Skill Trident Z5 Neo RGB in price. Where G.Skill sets itself apart is through design, performance, and value. You can't really go wrong with the majority of RAM from reputable brands and the G.Skill Trident Z5 Neo RGB is one of the best kits on the DDR5 block. You should buy the G.Skill Trident Z5 Neo RGB if: You shouldn't buy the G.Skill Trident Z5 Neo RGB if: DDR5 RAM is no longer in its infancy with prices falling and latency improving. Previously, the performance uptick compared to DDR4 RAM wasn't enough to warrant the asking price of early adoption kits. That has changed with the increase in competition between brands, reproducing the same battleground as DDR4 memory. They are more energy efficient, run at lower voltages out of the box, can overclock to higher speeds, and bring with them additional features over DDR4 RAM. G.Skill Trident Z5 Neo RGB is RAM worth considering for the latest AMD and Intel processors. Intel 12th, 13th, and 14th-gen processors, as well as Ryzen 7000 series chips from AMD all work better with DDR5 RAM. Recent motherboards have had BIOS updates made available that improve performance with the newer generation of RAM. Using one of the better LGA 1700 motherboards on the market for your shiny new Intel build or an AM5 motherboard for AMD processors will support superfast speeds and the G.Skill Trident Z5 Neo RGB is a kit worth considering. This flashy RGB DDR5 RAM has plenty of substance, with fast timings and high capacities.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Richard is a Senior Editor at Valnet and has been covering the technology industry for almost two decades. He's been building PCs since young and when not creating content, you can often find him inside a chassis somewhere. What decides how fast your RAM is? Frequency or latency? The update also fixes some annoying bugs. Peak Design's Everyday Backpack has been one of the best tech bags out there for a while, but how does it stack up to competition? 3D printers are more affordable than ever in 2024. Here are our favorite 3D printers to consider before buying. Enjoy a top-tier gaming experience with these low-cost PCs. Keep on top of cleaning the insides of your PC to maximize performance. "
}