{
    "title": null,
    "date": "2/11/2024",
    "url": "https://seekingalpha.com/article/4669336-ocular-therapeutix-diabetic-retinopathy-data-q2-2024-and-wet-amd-advancement",
    "text": " volodyar/iStock via Getty Images Ocular Therapeutix (NASDAQ:OCUL) has been making extensive progress in being able to advance the use of its Elutyx technology to advance several drug candidates to treat patients with eye disorders. The reason why I think investors may want to take a look into this biotech is because it is gearing up to report results from the phase 1/2 HELIOS study, using AXPAXLI for the treatment of patients with diabetic retinopathy. It is expected that preliminary nine-month results from this early-stage study are going to be released Q2 of 2024. This sets up a major catalyst for investors to look forward to. In addition, to the fact that it could provide additional proof of mechanism of action [MOA] in being able to use its Elutyx technology to treat ocular disorders. AXPAXLI is also being advanced in a phase 3 study to treat patients with wet age-related macular degeneration [Wet-AMD] in the soon to be initiated phase 3 SOL study. A catalyst opportunity exists for this late-stage program as well because it is expected that the first patient to be screened for this study will be in Q1 of 2024. The use of AXPAXLI is possible because of the company's Elutyx technology, which is an axitinib intravitreal implant. In essence, a hydrogel incorporates axitinib to treat these types of patients. The way that Elutyx is designed is that it gives Ocular Therapeutix several competitive advantages over other drugs approved to treat Wet-AMD and other eye diseases. A good reason to highlight Ocular Therapeutix would be because of what I stated above, which is that it is gearing up to report preliminary 9-month results from the phase 1/2 study using AXPAXLI for the treatment of patients with diabetic retinopathy. Diabetic retinopathy occurs because of damage to blood vessels in the back of the eye [retina]. As the name suggests it occurs, because of patients who also have diabetes. This is definitely a large market opportunity for this biotech to go after. The global diabetic retinopathy market is projected to reach $13.23 billion by 2030. However, there is an emphasis to focus on better compliance using its Elutyx technology to go after the earlier patient population. What do I mean by this? Well, that's because it believes by targeting patients in the earlier part of the process it could better treat this eye disorder. Preventing the progression to the final stage of disease, which is Proliferative diabetic retinopathy [PDR]. The stages of this disorder are as follows: Thus, the goal of Ocular Therapeutix is to go after NPDR, specifically approximately 3.3 million moderate-to-severe NPDR patients in the United States alone. The rationale for attempting such a study is that AXPAXLI has demonstrated clinical outcomes comparable to that of aflibercept [EYLEA] in patients with Wet-AMD. I believe that there is a good opportunity here, because there is no established standard of care [SOC] for the treatment of patients with NPDR. As a matter of fact, the main option for NPDR patients is just observation to see if it progresses to later stages of disease. Why not give patients treatments like EYLEA from Regeneron Pharmaceuticals (REGN) or LUCENTIS from Roche (OTCQX:RHHBY)? That's because over a 24-month period both of these treatment options require frequent injections, which leads to poor patient compliance. Thus, patients either start to halt treatments for periods of times or stop completely. It is possible that Ocular Therapeutix could completely change the scope of treatment options for these patients. How? That's because of its flexibility with its Elutyx technology, which is composed of axitinib, which is a small molecule Tyrosine Kinase Inhibitor [TKI] drug with anti-angiogenic properties. This allows patients to be dosed with AXPAXLI once every 9 months, which is expected to improve patient compliance. This is possible because the hydrogel has a release formulation that can be tailored for whatever period of time is necessary. That is, the technology is flexible in that it can be altered depending upon what type of eye disorder is being treated. It is expected that Ocular Therapeutix will report upon 9-month preliminary results from its phase 1/2 HELIOS study, using AXPAXLI for the treatment of patients with non-proliferative diabetic retinopathy [NPDR]. It is expected that results from this trial are to be released in Q2 of 2024. This early-stage trial is expected to recruit up to 21 patients who are to be randomized to receive either one of the following doses: The primary efficacy endpoint for these types of early stage studies is always safety of course, thus this is going to be measured over a 52-week period. There are several secondary efficacy measures to be looked at with respect to the preliminary 9-month data, but I believe that best corrected visual acuity [BCVA] will eventually be the most important one. This endpoint is going to look into the change of BCVA change from baseline, between AXPAXLI compared to sham. Another catalyst that investors might want to keep an eye on would be the use of AXPAXLI, which is being advanced to treat patients with Wet Age-Relate Macular Degeneration [Wet-AMD]. That is because Ocular Therapeutix expects to dose the first patient in the phase 3 SOL study, using this axitinib intravitreal implant to treat this patient population. The first patient is expected to be dosed in Q1 of 2024 and this could be another major inflection point for this company. There was a positive development with respect to this late-stage program targeting patients with Wet-AMD. That is, the FDA agreed to a Special Protocol Assessment [SPA] Agreement Modification for this phase 3 SOL study. In my opinion, this is very huge news for Ocular, because it will allow it to recruit Wet-AMD patients at a quicker pace. This SPA also allows the biotech to move forward with a single optimized implant drug load dose of 450 µg. What's the significance of this? It allows for a slightly increased daily release of AXPAXLI. The primary endpoint of this study is going to be proportion of patients who maintain visual acuity, defined by having <15 ETDRS letters of BCVA loss at Week 36. The global age-related macular degeneration market is expected to reach $18.5 billion by 2030. The target that Ocular is going after would be those with wet age-related macular degeneration [Wet-AMD]. However, this is still a strong opportunity, because Wet-AMD accounts for 90% of the revenue generated globally in the AMD space. I talked briefly about some competitors above, such as Regeneron Pharmaceuticals with EYLEA and Roche with Lucentis. However, there are some other competitors that have been able to reduce anti-VEGF injections for these patients with Wet-AMD. One example would be Novartis (NVS) with its drug BEOVU and then Roche with its latest drug VABYSMO. BEOVU and VABYSMO have less frequent injections compared to the other drugs I noted above in the diabetic retinopathy subsection of this article. How does Ocular Therapeutix hope to overcome these major competitors? There is one way it may do so, which is with respect to patient compliance. The ultimate goal is for the extended release hydrogel Elutyx technology to be released for an extended period of time over 9 months. If successful in achieving similar efficacy, plus superior safety with such a long treatment response with fewer injections, then it would create a huge competitive advantage. In terms of safety I would say that AXPAXLI achieving an 89% reduction of treatment burden over a 12-month period is good in itself. The fact that this drug also allows for maximum efficacy, while minimizing off-target effects is also a huge positive, which may ultimately help it fend off competitors. Things look good in terms of efficacy, especially if it holds up well in phase 3 testing, but that remains to be seen. That's because in a phase 1 study, it was shown that out of 15 patients, 60% of APAXLI treated patients were rescue free up to 12 months. Then an additional 4 patients did not need to be rescued until 12 months. All that remains now though would be whether or not the phase 3 SOL study achieves the primary endpoint upon completion. There is one other thing to note here, which is that a second phase 3 pivotal study is expected to be initiated in the 2nd half of 2024. According to the 10-Q SEC Filing, Ocular Therapeutix had cash and cash equivalents of $110.6 million as of September 30th of 2023. It believed that it would have enough cash to fund its operations into 2025. However, despite this cash runway, management chose to enact a cash raise anyways. That is, it announced an underwritten public offering of 35,420,000 shares of its common stock at a public offering price of $3.25 per share. This also includes the underwriters' option to purchase an additional 4,620,000 shares at the public offering price. The total gross proceeds from the offering were approximately $115.1 million. It was able to obtain cash by other means in 2023 and this was with respect to a Barings Credit Agreement with Barings Finance LLC. It entered into a secured term loan facility agreement, in which Ocular was able to obtain a principal amount of $82.5 million at closing. Minus expenses though, it received proceeds of $77.8 million. Another transaction it did was that it sold shares under an Open Market Sales Agreement it made with Jefferies back in August of 2021. That is, it could sell from time to time through Jefferies up to an aggregate of up to $100 million of its common stock. During the three-months ending September 30th 2023, it sold 144,718 and 1,514,926 shares of common stock, resulting in gross proceeds of $0.7 million and $9.9 million, respectively. The good news is that should the company need to raise additional cash using this Open Market Sales Agreement with Jefferies, then it will be able to do so whenever it deems it necessary to do so. There are several risks for investors to be aware of before investing in Ocular Therapeutix. The first risk to consider would be with respect to the phase 1/2 HELIOS study, which is using AXPAXLI for the treatment of patients with non-proliferative diabetic retinopathy [NPDR]. That's because there is no guarantee that top-line 9-month preliminary data to be released from this early-stage study will be successful. The second risk to consider would be with respect to the soon to be initial dosing of the first patient in the phase 3 SOL study, which is going to use AXPAXLI for the treatment of patients with wet age-related macular degeneration [Wet-AMD]. There is no assurance that once the study concludes that the primary endpoint of maintained visual acuity will be achieved. No way of knowing of whether or not this drug will be able to keep patients with a <15 ETDRS letters of BCVA loss at Week 36. A third risk to consider would be with respect to the another shot on goal in Ocular Therapeutix's pipeline, which would be PAXTRAVA. This drug is being explored in the phase 2 randomized, controlled clinical trial for the treatment of patients with open-angle ocular glaucoma [OAG] and ocular hypertension [OHT]. Top-line data from this phase 2 single dose study of PAXTRAVA is expected to be presented at the upcoming ASCRS meeting in April of 2024. This is going to be an important study to track, because PAXTRAVA is being compared to DURYSTA. DURYSTA is a bimatoprost intracameral implant medicine approved to treat intraocular pressure [IOP] in patients with OAG and OHT. The fourth and final risk to consider would be with respect to the competition I provided above, as it relates to targeting a host of these ocular eye disorders such as wet age-related macular degeneration [Wet-AMD], non-proliferative diabetic retinopathy [NPDR] and others. That's because the goal of this biotech is to be able to reduce the need for frequent anti-VEGF injections. If Ocular Therapeutix can get its axitinib intravitreal implant using its Elutyx technology to work for an extended period of time, 9 months or longer, then it will have a huge competitive advantage over EYLEA, BEOVU, LUCENTIS, AVASTIN and VABYSMO. One other possible competitor to mention, which had positive clinical data from its phase 2 expansion dose study was 4D Molecular Therapeutics (FDMT). That's because it was able to achieve an 89% reduction in the annualized anti-VEGF injection rate in patients with Wet-AMD. It is expected that it will initiate a phase 3 clinical trial for this specific program in Q1 of 2025. Regardless, this is a gene therapy to keep an eye on, which could end up being a direct competitor for the treatment of patients with this ocular disorder. Ocular Therapeutix has been able to advance several drugs in its pipeline using its Elutyx technology, which is a hydrogel that allows for extended release of a drug over a period of time. What's the importance of this? To create a drug with maximum efficacy exposure over a longer period of time, reducing treatment burden and minimizing off-target effects. The good news is that this company has the ability to establish additional proof with the release of top-line preliminary 9-month efficacy data from the phase 1/2 HELIOS study, which is testing AXPAXLI for the treatment of patients with NPDR. Such results from this early-stage study, targeting this patient population, are to be released Q2 of 2024. This isn't the only catalyst that investors have to look forward to either. It is expected that the biotech will also release results from the phase 2 randomized study using PAXTRAVA for the treatment of patients with OAG and OHT. Such data is going to be presented at the upcoming ASCRS meeting conference in April of 2024. Lastly, it has the phase 3 program using AXPAXLI for the treatment of patients with Wet-AMD. The first patient in the phase 3 SOL study is expected to be dosed soon in Q1 of 2024, along with the second phase 3 study that is expected to start in the 2nd half of 2024. With a few catalysts on the way, plus the ability to fend off other anti-VEGF competitors using its Elutyx technology, I believe that investors could benefit from any potential gains made. Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks. Please subscribe to my Seeking Alpha Marketplace Service \"Biotech Analysis Central\", whereby you can subscribe to either my \"Full Tier\" at $399/yr or my \"Basic Tier\" service at $299/yr instead. If you want to see what my articles are about you could also check out my \"Free Tier\" where you get a snippet of one of my 4 weekly ExclusiveBAC Articles, whereby I discuss biotechs in detail such as pipeline updates, catalysts, financials, and other information. Please do check out what I have to offer and see if my service is a right fit for you. This article was written by Terry Chrisomalis is a private investor in the Biotech sector with years of experience utilizing his Applied Science background to generate long term value from Healthcare. He is the author of the investing group Biotech Analysis Central which contains a library of 600+ Biotech investing articles, a model portfolio of 10+ small and mid-cap stocks with deep analysis for each, live chat, and a range of analysis and news reports to help Healthcare investors make informed decisions. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}