{
    "title": "AMD Zen 6 CPUs might integrate RDNA 5 for improved iGPU performance",
    "date": "2/21/2024",
    "url": "https://www.techspot.com/news/101957-amd-zen-6-cpus-might-integrate-rdna-5.html",
    "text": "Rumor mill: Although AMD has been integrating graphics into recent generations of its mainstream desktop CPUs, that implementation has been somewhat of an afterthought, with APUs receiving the company's best iGPUs. However, a reliable source suggests that this practice might change with Zen 6. Known leaker Everest recently claimed that Zen 6, a future lineup of AMD Ryzen CPUs, will incorporate graphics hardware based on RDNA 5. If true, the rumor indicates a significant shift in Team Red's approach to integrated graphics. AMD recently launched the Ryzen 8000 series of Zen 4 APUs, featuring RDNA 3-based integrated graphics chips. While the Ryzen 8000 APUs processors deliver impressive iGPU performance, some users might still prefer the earlier Ryzen 7000 CPUs, despite their inclusion of only two RDNA 2-based cores, which severely limits their integrated graphics performance. Memes aside, Medusa has RDNA 5 iGPU, skipping RDNA 4 https://t.co/NBgY6tUenR Furthermore, there is no evidence that Zen 5 / Ryzen 9000 processors, expected later this year, will be any different. Reports indicate that AMD's next major processor lineup features the same chiplet design, core count, and IO-die as Zen 4, with performance improvements coming from other areas. Skipping multiple generations of RDNA graphics could indicate an intention to equip Ryzen processors with much stronger iGPUs. It remains to be seen how this shift will affect future APUs, as their significance could wane if other products offer adequate graphics capabilities. The development of future game consoles is another aspect to consider in relation to upcoming AMD hardware. Everest previously claimed that Sony's next-generation PlayStation 6 would utilize Zen 6 and RDNA 5. Microsoft might also opt for the same generation of AMD graphics for its next Xbox console. Targeting consoles would give RDNA 5 greater importance in AMD's roadmap than RDNA 4. Regarding RDNA 4, which AMD might unveil sometime in 2024, it is suggested that it will only target mid-range products. This approach could mirror the strategy of RDNA 1, which lacked enthusiast-class desktop GPUs. Not much else is known regarding Zen 6. Everest refers to the lineup as \"Medusa,\" but it has previously carried the codename \"Morpheus.\" It's expected to feature a 2.5D interconnect for significantly increased bandwidth and use TSMC's upcoming 2nm process node. DigiTimes recently reported that TSMC plans to begin 2nm risk production in late 2024, with mass production hopefully following next year, so Zen 6 could emerge in 2025 or 2026. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}