{
    "title": "Best graphics cards in 2024 for 1080p, 1440p, and 4K gaming",
    "date": "2/16/2024",
    "url": "https://www.windowscentral.com/best-graphics-cards",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Get the right GPU for your next upgrade or fresh build.  • The quick list ↴\n1. Best overall\n2. Runner-up\n3. Best NVIDIA value\n4. Best AMD value\n5. Ultimate upgrade\n6. Best for 1440p gaming\n7. Best for 1080p gaming\n• How to choose A graphics card is the pivotal component of a gaming PC, and it is the costliest part by a long margin. You'll find plenty of great options across price points and use cases, so if you're looking to pick up a new GPU to slot into your existing rig or are considering a new build and want something that can play the latest AAA games, you've come to the right place. The sheer scale of demand for GPUs over the last two years meant that prices have skyrocketed, with most mid-range cards now being offered for what used to be flagship prices just a few generations ago. That said, the latest cards from NVIDIA and AMD offer tremendous gains, and NVIDIA in particular is positioning its cards as more than just gaming-focused products, with the brand leveraging its generative AI prowess. Although prices are higher than ever, there are good deals to be had now and then, and the latest launches from both NVIDIA and AMD are aimed at delivering a good value. This is the best time to pick up a GPU, and we've collated the best cards you can get at the moment.   Best overall The RTX 4080 Super is the best GPU you can get at the moment. It delivers outstanding performance at both 1440p and 4K, it's much more efficient than its predecessor, and you get all the benefits that DLSS 3 has to offer. It is costly, but it's debuting for $200 less than the standard model, and if you want a high-end card to go with a high-refresh monitor, this is the obvious choice. Read more below   Also great The RX 7900 XTX is over a year old, but it continues to be the best that AMD has to offer, and it holds its own against the RTX 4080 Super. It isn't quite as good as ray tracing and consumes a bit more power in daily use, and AMD's FSR tech isn't as polished as DLSS 3. But when it comes to 4K gaming in general, the RX 7900 XTX is still a terrific choice. Read more below   Best NVIDIA value The RTX 4070 Super currently offers the best value in NVIDIA's portfolio. It is nearly 15% faster than the standard model while costing just $50 more, making it a no-brainer if you're looking to get a card for 1440p gaming. Read more below    Best AMD value The RX 7800 XT doesn't have exciting gains from its predecessor, but it still manages to deliver stellar performance at 1440p. You also get decent efficiency gains, and with 16GB of VRAM, you don't have to worry about the memory being a bottleneck. Read more below    Ultimate upgrade If you don't care about the price and want the best GPU available today, the RTX 4090 is the ultimate option. The card does an outstanding job at 4K gaming, and handles the latest titles without any hassles. Read more below    Best for 1440p gaming The RTX 4070 Ti Super doesn't deliver noticeable gains over the standard model, but it costs the same, and the best part is that you get 16GB of video memory as standard. That alone makes the card a worthy choice, and it is the ideal upgrade if you have a high-refresh 1440p monitor. Read more below Load the next graphics card..   Best for 1080p gaming The RTX 4060 Ti continues to be a decent choice for 1080p gaming, and while it has just 8GB of VRAM, it is much better than its immediate rivals, and you get all of NVIDIA's latest features. Read more below Why you can trust Windows Central \n\n\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test. You'll find our recommendations for the best graphics cards below. I used all of the NVIDIA cards highlighted in this guide, and for the AMD picks, I sourced testing data from Future Labs.  Our expert review: The GeForce RTX 4080 Super isn't affordable by any stretch of the imagination, but if you want a GPU that excels at 4K gaming, this is the one to get. It offers sizeable gains over the RTX 3080 in all areas, and that's down to the Ada Lovelace architecture. The card is  manufactured on a 5nm node, making it much more efficient in regular use. In fact, it's the efficiency that's a big part of what makes the RTX 4080 Super such a great option; while gaming, the card hits 300W on average, 40W less than the RTX 3080. But you're not looking to get a GPU for its efficiency figures — you want something that'll let you take full advantage of your 4K gaming monitor. Thankfully, the RTX 4080 Super is able to do just that; it comfortably hits over 90fps in the latest titles with all the settings turned up in 4K, and in slightly older titles, you'll easily get over 140fps. I reviewed the standard RTX 4080 back when it launched and used the card for over a year, and not once did I notice any issues with 4K performance. The RTX 4080 Super does incredibly well if you have a high refresh rate monitor; I have a Redmagic 4K Gaming Monitor that goes up to 160Hz, and while it doesn't hit the full 160Hz in all 4K titles, it delivers a smooth experience that's enjoyable. The way I see it, the best use case for this card is with a 4K monitor or QHD monitor that goes up to 160Hz or higher. The card absolutely demolishes QHD gaming, easily going over 180fps in most games I tested. Another differentiator is DLSS 3, namely Frame Generation. The feature uses AI to automatically insert frames in between two frames, boosting the overall fps without any noticeable difference in image quality. There weren't many games that leveraged the feature at launch, but it is available in most new titles, and it is without a doubt the biggest advantage that NVIDIA cards have at the moment. The RTX 4080 Super is also $200 less than the standard model while offering 3% overall gains, and that's nothing to scoff at. Sure, it could be said that the regular RTX 4080 was priced a bit too high at launch, but with the 4080 Super debuting at $999, we should see better deals on the card a few months down the line.  Our expert review: AMD's Radeon RX 7900 XTX is still a great overall option if you want a high-end card in 2024. It is a smidgen faster than the RTX 4080 at 4K, and handles anything at 1440p without breaking a sweat. It isn't as gargantuan as the RTX 4080 either, so you can easily slot it into most cases. And with 24GB of VRAM as standard, you're not going to see any issues in this area. That said, the 7900 XTX isn't quite as good at ray tracing, and NVIDIA's cards still have the edge here. And while AMD is constantly improving FSR 3, DLSS 3 is much more polished, and it is available widely. NVIDIA is differentiating its cards by increasingly rolling out unique abilities — like the Chat with RTX feature I tested recently that lets you install an AI chatbot locally — and you just don't get anything like it with AMD. But if you don't need the extras and just want a card that excels at good old-fashioned rasterization, you'll find plenty to like in the RX 7900 XTX. Given that it is a year old, there are a few decent deals on the card, and if you can snag it for around the $850 figure, you're getting a good value. One thing to consider when buying the RX 7900 XTX is that you'll want to stick to brands that primarily produce AMD cards; these include ASRock, Sapphire, XFX, and PowerColor. Taiwanese manufacturers like ASUS also make AMD cards, but they're predominantly focused on NVIDIA offerings, and their AMD products have been found to be lacking in previous years. So if you're interested in buying AMD, go with one of the four brands I listed above.  Our expert review: In my RTX 4070 Super review, I mentioned that it is one of the best cards in NVIDIA's portfolio. This is down to the sizeable gains over the standard model — averaging out to 15% over a dozen games at 1440p — but also because you finally get a good value. That hasn't been the case with most of the other options in the RTX 40 portfolio thus far, so it's great to see NVIDIA making amends in 2024. The 4070 Super has 12GB of video memory, and while it would have been ideal to get 16GB, you'll need to pick up the RTX 4070 Ti Super if you need additional future-proofing in this regard. NVIDIA added 20% more shader cores to the card, and you get all the advantages of DLSS 3; the feature makes a tangible difference in modern games, delivering higher framerates without any noticeable decrease in quality. It doesn't quite deliver playable framerates at 4K, and you'll ideally need to consider the 4080 Super or the 4070 Ti Super if you've got a 4K monitor. The design of the Founders Edition is polished, and the card is significantly smaller than the RTX 4080, so you don't need a giant case to house it. That said, it needs more power than the standard RTX 4070, so it switches over to the 12VHPWR connector. If you need a card with a good value that's great for 1440p gaming, then the 4070 Super should be at the top of your list.  Coming in at $500, the RX 7800 XT hits the sweet spot for value, and is goes up against the RTX 4070 series. The card doesn't deliver heady gains from the 6800 XT, but you get good efficiency figures, and it still does a terrific job at 1440p and 1080p, even hitting decent framerates at 4K provided you're willing to turn down the settings. The RX 7800 XT has DisplayPort 2.1 ports — NVIDIA still hasn't made the switch — and you get AV1 decode/encode as well as HDMI 2.1. The reference design tends to get loud, but it isn't uncomfortably so, and it is considerably smaller than its NVIDIA rivals. While it is great at rasterization, AMD is still on the backfoot when it comes to ray tracing, and NVIDIA's cards have the definite edge in this regard. Similarly, AMD's cards are great for gaming, but you don't get any of the additional features that NVIDIA bundles with its products. Then there's FSR 3; while the tech is gaining momentum, it still isn't as good as DLSS 3, and it isn't in anywhere as many titles.  Our expert review: Right now, there isn't anything faster than the GeForce RTX 4090. NVIDIA set out to create a halo product with the RTX 4090, and the result is a GPU that runs any game at its highest setting without breaking a sweat. The downside is that you'll be shelling out close to $2,000 to get your hands on one of these cards. But if money isn't an object and you want the best GPU available today, the RTX 4090 is the one to get. I switched to the RTX 4090 Founders Edition a few months ago, and honestly, this thing is a beast. It is massive; you'll need a decent-sized case as it takes up three slots, and considering it pulls in up to 460W, you'll need a good PSU. The best part is that it doesn't use much more than NVIDIA's other cards in regular use — it hits 35W while idling, going up to 45W when playing back videos. The RTX 4090 is designed to dominate 4K gaming, and it easily manages to hit 120fps in most titles. Even in games like Starfield that have ridiculous requirements, the card is able to comfortably hit 90fps at 4K — the only one to do so. To put things into context, the card is roughly 40% faster than the last-gen RTX 3090 Ti at 4K gaming. Even if you have a high refresh rate 4K monitor, you won't have any problems driving the latest games at their highest settings. Like I said, the only issue with the RTX 4090 is the cost, but if that isn't a consideration, this is still the ultimate option in 2024.  At the outset, the RTX 4070 Ti Super doesn't do anything markedly different to the standard model. I tested the RTX 4070 Ti when it launched last year, and the new model has gains of up to 7% at 4K, but it doesn't do much better at 1440p. That said, where there's a difference is video memory — the 4070 Ti Super has 16GB as standard. As NVIDIA isn't selling the regular 4070 Ti any longer, the 4070 Ti Super is the default option if you want a card to pair with a high-refresh 1440p monitor. While the 4070 Super is great at 1440p, the 4070 Ti Super has much better headroom and hits 140fps in most titles, and the fact that you get 16GB of memory basically makes it future-proof. The best part is that it slots in at the same $800 price point as the regular 4070 Ti, so you're not paying a premium to get more video memory. Sure, AMD's RX 7900 XT is faster at rasterization, but it isn't as good at ray tracing, and you miss out on DLSS 3. These two features give the 4070 Ti Super the edge, and if you want something that has a bit more grunt than the 4070 Super, you should just get this. If you're debating on a monitor, you should take a look at our best gaming monitors guide.  Our expert review: The RTX 4060 Ti is a divisive card, mostly because of the fact that it has a narrow 128-bit bus with 8GB of video memory. Unlike the rest of the RTX 40 series cards, it doesn't deliver huge performance gains over its predecessor. That said, it comes with all the latest features NVIDIA introduced — including DLSS 3 — and it holds up incredibly well at 1080p. When I reviewed the RTX 4060 Ti, and I wrote that NVIDIA was betting on DLSS 3 as the key differentiator for the card. That's still true in 2024, and while the card has its share of issues, it is noticeably faster than anything else in this segment. AMD's RX 7600 XT retails for $349 as of writing and comes with 16GB of VRAM, which is just great to see. But it has the same memory bottlenecks, and it is considerably slower than the RTX 4060 Ti.  There are a ton of other graphics cards available today, ranging from affordable options, best graphics cards for VR, best graphics cards for 4K, and on up to professional-grade cards intended for  design and development work. But as far as GPUs for gaming go, these are the cards that make the most sense in terms of performance-to-price ratio. Graphics cards are generally available from several different manufacturers; performance and specs are generally the same with just slight differences, though the price, cooling, and overall design will differ. No matter your preferred resolution, preferred games, or preferred manufacturers, you're going to find a GPU that will suit your next fresh PC build or upgrade. The beauty of building your own PC is that there are plenty of graphics card options available to you based on budget and desired performance. You can mix and match hardware as you please and still end up with a powerful rig. For most people, the NVIDIA GeForce RTX 4080 Super is going to be the ideal upgrade; yes, it costs $999, but you are getting a card that outmatches everything in the RTX 30 series by a huge margin, including the 3090 Ti. NVIDIA put a ton of work into custom features, and DLSS 3 genuinely makes a big difference in most recent AAA games. Of course, not everyone needs this level of power, and that's where the 4070 Super comes into the picture — this is the best option in the mid-range segment, and at around $500, you are getting a brilliant overall value. If you're interested in AMD, the RX 7800 XT is the obvious alternative to NVIDIA's mid-range offerings. What it lacks in ray tracing it more than makes up for in pure rasterization, and you get more than enough VRAM. I still think that 1440p is the sweet spot for Windows gaming, and both the RTX 4070 Super and RX 7800 XT do a great job catering to this market. If you're using a high-refresh monitor that goes up to 165Hz and beyond, you should consider upgrading to the RTX 4070 Ti Super — that has much better headroom, and is roughly 10% faster than the non-Ti model. You can use the RTX 4070 Ti Super for 4K as well, and it holds up particularly well in AAA titles. That said, if you've got a 4K monitor that goes beyond 60Hz, you'll ideally need the RTX 4080 Super to be able to get the most out of the monitor.  Trying to figure out whether or not it's time to upgrade your GPU can be challenging. Of course, if you're seeing signs that your GPU isn't holding up in daily use — laggy, screen artifacts, PC crashes, coil whining — it's no doubt time to upgrade. But if your current GPU is working without any issues, do you really need something new? That depends on what types of games you want to play and at what resolution. If you were satisfied with low-impact indie games and built a PC to handle them, you'll no doubt find that your PC struggles to keep up with a hot new AAA title that snagged your eye. The same goes for resolution. If you're upgrading your monitor from 1080p to 1440p or 4K, a new GPU is likely required to make the most of the higher-resolution display. Whenever a new generation of GPUs is released, the previous generation seems to look disproportionately old. Say, for example, you have an NVIDIA GTX 1080 in your PC. It's a great GPU, but it's four generations behind by now, and it misses out on all the ray tracing and AI-focused features that NVIDIA rolled out in recent years. Finally, you don't want to upgrade your GPU if you can't also afford to upgrade the rest of your PC components to keep up. Buying an AMD RX 7800 XT GPU and installing it alongside 8GB of RAM and an older CPU is not going to allow the GPU to realize its full potential. Plus, you might need to look at upgrading the PSU as well; while the latest iteration of cards are energy-efficient, you'll need at least 600W of power output to be able to comfortably use the cards. If you're building a new PC from the ground up, you might be wondering which resolution to go with. There are plenty of great gaming monitors in 1080p, 1440p, and 4K, so it can be tough to choose. What you need to consider is price, fidelity, and the power of the PC hardware you're interested in including. A 1080p gaming monitor will generally be affordable, but will still include a high refresh rate and low response time, both of which are features gamers search out. It's not going to look as crisp as 1440p or 4K, but it will also take quite a bit less power to run games at a high frame rate. You're going to be able to get away with a lower-tier GPU and CPU, saving you more money. Bumping things up to 1440p is going to make everything look better. Once you've made the switch to QHD, dropping back down to 1080p is noticeable. The issue with 1440p, however, is that monitors generally cost more, plus you're going to want beefier hardware to achieve high frame rates. And finally, we have 4K. It's a rather big jump, even from 1440p, and you should have top-tier hardware to get the most of it. 4K displays are expensive, so buying one and pairing it with a subpar PC is not advised. Even with a high-end GPU and CPU, don't expect frame rates to get anywhere near what you can achieve at 1080p and 1440p. All the latest news, reviews, and guides for Windows and Xbox diehards. Harish Jonnalagadda is a Senior Editor overseeing Asia for Android Central, Windows Central's sister site. When not reviewing phones, he's testing PC hardware, including video cards, motherboards, gaming accessories, and keyboards. Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}