{
    "title": "AMD Radeon RX 7900 GRE goes global - arrives on US shores Tuesday, says \nreport",
    "date": "2/25/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/amd-radeon-rx-7900-gre-goes-global-arrives-on-us-shores-tuesday-says-report",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. MSRP of $549 comes in below previous expectations. AMD is set to officially launch its Radeon RX 7900 Golden Rabbit Edition (GRE) globally on February 27, 2024, reports VideoCardz. For now, AMD's Radeon RX 7900 GRE is officially available only in China, as well as inside pre-built PCs in Europe and the U.S. However, the source asserts that AMD Radeon RX 7900 Golden Rabbit Edition (GRE) boxed graphics cards will hit retail in Western countries too, starting Tuesday. AMD's Radeon RX 7900 GRE will carry a manufacturer's suggested retail price (MSRP) of $549, which is lower than the $649 price point indicated previously. The Radeon RX 7900 GRE will be just $50 more expensive than the Radeon RX 7800 XT and significantly cheaper ($354 cheaper) than the Radeon RX 7900 XT. At $549, AMD's Radeon RX 7900 GRE is set to be one of the best graphics cards available today and will likely become very popular among gamers with limited budgets. It is noteworthy that Radeon RX 7900 GRE graphics cards from ASRock, PowerColor, Sapphire, and XFX are pretty widely available in Europe today for €589 – €692 ($528 - $576 without VAT), so AMD's official launch of its Radeon RX 7900 GRE is not completely unexpected. Perhaps the biggest surprise is how long it has taken to come to the U.S. The AMD Radeon RX 7900 GRE is based on the Navi 31 XL GPU, which has 5,120 stream processors operating at frequencies between 1.27 GHz and 2.245 GHz. This GPU has 256 fewer stream processors than the Radeon RX 7900 XT, which is one of the fastest graphics cards that AMD has to offer and provides compute performance ranging from 26 to 46 FP32 TFLOPS. This is marginally lower than the RX 7900 XT's 32 to 51.6 FP32 TFLOPS. The decrease in performance leads to reduced power consumption, with the new graphics card rated for a 260W TGP. It is important to note that the Radeon RX 7900 GRE has a pared-down memory subsystem, with only four active memory controller dies (MCDs). As a result, it comes with 64 MB of Infinity Cache and 16 GB of 18 GT/s GDDR6 memory featuring a 256-bit memory interface. This configuration leads to an Infinity Cache bandwidth of 2.25 GB/s and a memory bandwidth of 576 MB/s for the Radeon RX 7900 GRE. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Anton Shilov is a Freelance News Writer at Tom’s Hardware US. Over the past couple of decades, he has covered everything from CPUs and GPUs to supercomputers and from modern process technologies and latest fab tools to high-tech industry trends. GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 New open source GPU is free to all — FuryGPU runs Quake at 60fps, supports modern Windows software New Windows Insider build gets rid of annoying watermark, adds Copilot support for local accounts By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Roshan Ashraf ShaikhMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Anton ShilovMarch 27, 2024 By Aaron KlotzMarch 27, 2024 By Anton ShilovMarch 27, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}