{
    "title": "AMD Zen 5 CPUs: Mass production in 3 nm process from Q3 2024",
    "date": "2/20/2024",
    "url": "https://www.igorslab.de/en/amd-zen-5-cpus-mass-production-in-3-nm-process-from-q3-2024/",
    "text": "The Zen 5 CPU architecture will be a big step for AMD in 2024 as it will include several lines of CPU families including Granite Ridge “Ryzen Desktop”, Strix Point “Ryzen Mobile” and Torino “EPYC Server”. All of these CPU families will play an important role and it looks like these chips will enter TSMC factories for production next quarter, followed by volume production in the third quarter of 2024, as reported by UDN.  Also emphasized is the AMD Zen 5 “Nirvana” CPU core, which is the standard design of the Zen 5 architecture. The “Prometheus” Zen 5C cores, on the other hand, are aimed at the dense compute segment in client and server chips. Interestingly, it is mentioned that the Zen 5 “Nirvana” CCD will be manufactured on the TSMC 3nm process node, although it is known from previous reports that Zen 5 will use the 4nm node, while Zen 5C will be manufactured using the 3nm process. It is also possible that UDN has confused the Zen 5C “Prometheus” core with Zen 5 “Nirvana”. Just last month, it was rumored that AMD’s Zen 5 “Granite Ridge” CPUs had already reached the mass production phase, although the company has yet to reveal any information about its next-generation desktop CPU plans at major events such as CES 2024. The only upcoming event one could think of to reveal something would be Computex 2024, which will take place in June, so it’s still four months away. As AMD is actively planning to launch new product lines, TSMC will also begin preparations for mass production of AMD’s new products this year. The legal person pointed out that among the AMD Zen 5 architecture platform, the most critical core computing chip is manufactured by TSMC using the 3nm process. In addition, the HPC platform MI300 series has been put into mass production using TSMC’s 4nm and 5nm processes. The order momentum continues unabated, and TSMC’s advanced process order momentum from Advanced Micro Devices this year is very strong. Industry analysis shows that the mass production of the 3nm process will take a relatively long time. It is estimated that AMD’s new 3nm process Zen 5 architecture platform will enter the wafer mass production stage around the second quarter. By then, the production capacity is expected to increase month by month. via UDN Currently, there is not much information about AMD’s Zen 5 core architecture, but according to the company’s official statement, it will offer the following features: UDN has published a report on AMD’s Zen 5 CPUs, the legitimacy of which cannot yet be confirmed. However, UDN has a strong track record in the past with industry stories and insider/analyst reports. Regardless, everyone in the tech community should be looking forward to the Zen 5 CPUs as they usher in the next chapter of Ryzen and EPYC CPUs with stronger performance, efficiency and brand new features. More information is expected in the coming months. Source: Dan Nystedt Zeige alle Kommentare an Kommentar Lade neue Kommentare Veteran Also, die Codenamen sind mal ziemlich Banane! Wer denkt sich das aus? Welche Symbolik will man damit transportieren? Nirvana und Prometheus :unsure: Die aus Nichts bestehende E(nd)rlösung für den gläubigen Buddhisten und der griechische Feuerbringer, der für seine Tat auf ewig an einen Felsen gebunden wurde und mit Qualen durch Tierfraß bestraft wurde... Antwort\n 2 Likes Veteran Nomen est Omen ? 🤣 Antwort\n Gefällt mir Urgestein Wie du schon erkannt hast, sind das CodeName innerhalb der Entwicklung. Granit Ridge ist ein Gebirge, so wie Nirvana: https://de.wikipedia.org/wiki/Mount_Nirvana Prometheus steht in der Mythologie in Verbindung mit Kasbek: https://de.wikipedia.org/wiki/Kasbek Ein jeder Künstler darf seine Schöpfung nennen wie er mag, ein Künstlername eben. :) Antwort\n 1 Like Mitglied Orang-Utang-Klaus! Das wäre mein Name dafür. Hab' ich aber vom Helge geklaut. Antwort\n 2 Likes Alle Kommentare lesen unter igor´sLAB Community → Wir verwenden Technologien wie Cookies, um Geräteinformationen zu speichern und/oder darauf zuzugreifen. Wir tun dies, um das Surferlebnis zu verbessern und um personalisierte Werbung anzuzeigen. Wenn Sie diesen Technologien zustimmen, können wir Daten wie das Surfverhalten oder eindeutige IDs auf dieser Website verarbeiten. Wenn Sie Ihre Zustimmung nicht erteilen oder zurückziehen, können bestimmte Funktionen beeinträchtigt werden. "
}