{
    "title": null,
    "date": "2/5/2024",
    "url": "https://www.investors.com/ibd-videos/videos/powell-comments-cant-keep-market-indexes-down-amd-jfrog-expedia-in-focus",
    "text": "Feb 5, 2024|04:31 PM ET|ALISSA CORAM, JUSTIN NIELSEN Fed Chair Powell gave a rare interview on \"60 Minutes\" reiterating a slow move toward rate cuts. While the market slumped early, it just refuses to stay down. Many of the leaders are extended but there are still a few that are actionable. Advanced Micro Devices formed a recent three-weeks-tight pattern that's worth watching. JFrog broke out of a flat base today. Expedia is forming a very shallow flat base ahead of its earnings report on Thursday. Russell 2000 Hits New High In Quiet Session; TOST, MHO, MLM In Focus Stock Price-To-Earnings Ratio: Don't Be Fooled By This Metric The Problem With Predictions: Why Interpreting Markets Matters More Adobe Outperformed Microsoft In 2023 Thanks To Its Generative AI Tools. Can It Do It Again? Eli Lilly Resilient As Growth Stocks Pressured What Inning Are We In? How To Spot Exhaustion Points And Bull Market Stages ARM Stock Tries For Breakout On China Chip Ban News IBD's Best Mutual Funds Of 2024 This Is How To Tell When A Market Rotation Is Happening Fed Interest Rate Decisions: Market Influence And Investor Psychology Impact Of Cuts And Hikes Russell 2000 Hits New High In Quiet Session; TOST, MHO, MLM In Focus Small Caps Jump, Breadth Improves; Medpace, Nextracker, BROS In Focus Indexes Fade Late; Trump Media, ServiceNow, Royal Caribbean In Focus Indexes Mark Time But Refuse To Give Up Ground; Arm, Axon And Allstate In Focus Two Familiar Catalysts Fuel Strong Market Week; Uber, Eli Lilly, CrowdStrike In Focus Stocks Fade After Strong Start; ARES, DUOL, NBIX In Focus Stocks Soar After Fed Statement; CyberArk, Monday.com, JFrog In Focus Market Resilient With Fed On Tap; Woodward, Arista Networks, Synopsys In Focus Time To Look For Setups In Other Areas? DraftKings, Apollo, RCL In Focus Stocks Pause Ahead Of Big News; ServiceNow, Arista, East West Bancorp In Focus Eli Lilly Resilient As Growth Stocks Pressured ARM Stock Tries For Breakout On China Chip Ban News PVH Stock Triggers Latest Entry As Earnings Near Woodward Aims For Pivot, But Can It Break Out? Here's How To Play GigaCloud's Earnings Boost Dexcom Shows Potential On FDA Approval, But Can It Keep Climbing? Consider This Signal As Archrock Stock Flashes Rare Bullish Pattern How Much Room Does This Bull Market Have To Run? Looking At History May Provide A Clue. Want To Hold On To A Winning Stock Like Nvidia? This Chart Indicator Can Help. Riding Fifth Third Stock's Rise As Financial Stocks Climb The Problem With Predictions: Why Interpreting Markets Matters More What Inning Are We In? How To Spot Exhaustion Points And Bull Market Stages This Is How To Tell When A Market Rotation Is Happening Stocks Vs. Cash: How To Know When To Play Or Step Aside This Chart Legend Shares Why AI Could Usher In Another 20-Year Bull Market Like 1982 Earnings Line: How To Use This New MarketSurge Feature MarketSurge: Three New Features Every Trader Must Know How This NYSE Floor Trader Found His Edge With Technical Indicators Ticker Tape Teachings: What This Trader Learned From Decades At The NYSE Will This Bull Market Change Your Life? This Stat Tells You The Odds. Fed Interest Rate Decisions: Market Influence And Investor Psychology Impact Of Cuts And Hikes Interest Rate Cuts: What Powell Could Signal After March Fed Meeting Real Estate Market Contends With High Interest Rates And Low Inventory. Will The Sector Warm Up This Spring? Apple, Amazon And Google Are Grappling With Antitrust Suits. How The Rulings Could Shape The Hot Tech Sector. What's Squeezing EV Charging Stocks? Elon Musk And Starlink Satellites Are Disrupting The Farming Industry. How Deere Is Looking To Cash In. Can Snap Catch Meta? How The Social Media Platform Is Harnessing AI To Improve Its Revenue Picture Boeing Stock Straps In For A Bumpy Ride As Confidence Crisis Roils Plane Maker These Are The Keys To Big Tech's Continued Domination This Year, Says BlackRock How CES 2024 Made Clear The AI Arms Race For Businesses Is On IBD's Best Mutual Funds Of 2024 IBD's Best Online Brokers Of 2024 What Are Small-Cap Stocks? What Are HSAs And How Do They Work? What Are Treasury Yields And Why Are They Important For Investors? Beating The Market: How To Find Outperforming Stocks What's The Difference Between Growth And Value Investing? What Would An Economic Soft Landing Mean For Investors? What Investors Need To Know About China Stocks What Are Bonds And How Do You Invest In Them? Adobe Outperformed Microsoft In 2023 Thanks To Its Generative AI Tools. Can It Do It Again? CRSP Stock On Wild Ride After FDA's Historic Approval. These Gene Editing Treatments Could Come Next. Microsoft Is Making A Big Bet As The Entire Tech Industry Goes All In On AI. Will It Win Or Lose? Is Tesla's EV Dynasty Over? Here's How Meta's AI Tools Are Set To Supercharge Revenue In Year Of Efficiency What Formula 1's Growing Popularity Says About The Tech Industry What Is Web3? Meet The Future Of The Internet Airlines Want To Reduce Their Carbon Footprint. Are Biofuels The Answer? The Year Of The IPO Supply-Chain Pain: What's Causing Backups At America's Ports? Stock Price-To-Earnings Ratio: Don't Be Fooled By This Metric How To Invest: This Short Interest Metric Can Be Your Secret Weapon For Identifying Powerful Breakouts Dow Jones, S&P 500, Nasdaq: What The Indexes Tell You And How To Use Them Best Investments For Making Money In Stocks With Minimal Effort How To Start Investing In 3 Simple Steps How To Find The Best IPO Stocks Do Your Stocks Meet This Key Standard? Here's Why Institutional Support Matters Stock Market Forecast: Is It Possible To Tell The Market's Future? How To Buy Stocks: Profit From Earnings Reports Using This Option Strategy How To Buy Stocks: Ways To Profit From Earnings Reports How To Make Smarter Trading Decisions How To Find A 10-Bagger Stock Interpreting Market Timing Signals In Times Of Uncertainty How To Find Game-Changing Stocks Understanding Technical Action With Support And Resistance Levels For Stock Charts Don't Just Buy AI Stocks. Here's How To Find The True AI Winners. Key Lessons From 5 Of Bill O'Neil's Biggest Winners Dividend Investing Secrets: Finding Great Income Stocks How To Find The Next Big Winners With Historical Precedents Banking Crisis: How Technical Analysis Helps Traders Spot The Warning Signs AMD Executive Touts These AI Chip Advantages As Battle With Nvidia Heats Up This Megatrend Is Fueling Chip Software Stock Synopsys To New Heights After 61% Move In 2023, CFO Says These 'Robust' Markets Are Helping John Deere Stay Resilient In Current Economic Climate, Says Exec The AI Paradigm Shift Is Reshaping The Tech Industry. Here's How Investors Can Capture Growth. Artificial Intelligence Is Making Waves. Here's How To Harness The Power Of AI. From AI To EVs: Why Qualcomm Says It's Driving Next-Gen Auto Tech Cybersecurity Breaches Are A Concern For Executives. This Is 'Critical' As They Prepare. This Is How Big Tech Should Navigate The 2024 Presidential Election: Former Microsoft, Clinton Strategist How Amazon Is Looking To Disrupt The Industrial Sector With Its Cloud Data Prowess Mobileye Has An Inventory Buildup Problem. Here's How It's Navigating Auto Industry Obstacles. Stock Market Exposure: How To Make Incremental Portfolio Management Decisions Tips For Using Your IBD Digital Membership To Stay Profitable And Protected How To Find Warren Buffett Stocks Is It Time To Get Into — Or Out Of — The Stock Market? Find Top Growth Stocks With The IBD Screen Of The Day How To Use the Screener To Identify Winning Stocks How To Develop A Stock Screening Routine With MarketSmith To Find Big Winners Chris Gessel On Using IBD Live And Research Tools To Gain A Competitive Edge How To Make Money In Stocks In 3 Simple Steps Should You Sell Your ETFs And Mutual Funds When The Market Drops? Getting the Most Out of Your New IBD Subscription: March 2024 Introducing MarketSurge: See What's New Getting the Most Out of Your New IBD Subscription: January 2024 Preparing Your Portfolio for 2024 The 3 Pillars of Successful Investing Crypto Trading with Jim Roppel Smarter Selling Strategies Top Traders Live Trade Like a Champion featuring Mark Minervini IBD National Virtual Meetup 2023 IBD 30: Past, Present, And Future Leaders Bill O'Neil's Message To Investors Who Lost Money In 2008 Bill O'Neil In-Depth Interview CAN SLIM Rules And How They Were Developed Interview with William J. O'Neil Bill O'Neil's Investing Routine How To Use How to Make Money in Stocks What If I Don't Have Time To Invest? When To Get Into And Out Of The Market Common And Costly Investing Mistakes to Avoid Founded by William J. O’Neil, Investor’s Business Daily provides exclusive stock lists, market data and research, helping investors take advantage of the CAN SLIM system to make more money in the stock market. Subscribe to Our Newsletters Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. © 2000-2024 Investor's Business Daily, LLC All rights reserved "
}