{
    "title": "OneXplayer 2 Pro with AMD Ryzen 7 8840U to launch on February 26",
    "date": "2/24/2024",
    "url": "https://videocardz.com/newz/onexplayer-2-pro-with-amd-ryzen-7-8840u-to-launch-on-february-26",
    "text": "The 2 Pro handheld is being updated from Ryzen 7 7840U to 8840U.  On social media, the company is building hype for the upcoming launch of a product featuring the AMD Ryzen 8000 APU, set to be revealed on February 26th. The new product is actually not entirely new, as the OneXplayer 2 Pro has already launched with Ryzen 7 7840U APU last year. This sytem is now being updated to Ryzen 7 8840U version, which is basically the same APU but with a faster XDNA AI-processor. The updated handheld will be one of the first devices alongside the AYANEO Slide, GPD Win Max 2 handheld, and Minisforum V3 tablet, featuring Ryzen 8040U processor.   OneXPlayer 2 Pro (Ryzen 8000) launch date, Source: OneXPlayer  The OneXPlayer 2 Pro stands out as one of the high-end handheld devices, featuring a massive 8.4-inch screen with 2.5K (2560×1600) resolution. This handheld supports also supports LPDDR5X-7500 memory with specifications reaching up to 64GB, along with compatibility for PCIe Gen4x4 storage, extending up to 4TB. It’s clear that the company is trying to differentiate from mainstream competitors like ASUS, MSI, and Lenovo by offering more memory and storage by default. One will not find 16GB RAM and 512GB storage options here.   OneXPlayer 2 Pro, Source: OneXPlayer  Among the interesting features of this system are removable controllers, faster LPDDR5X-7500 memory (only seen on Legion Go thus far), and stylus support. It is marketed as a versatile 5-in-1 product, which in this case means game console, laptop, tablet, TV (screen?), and tabletop. While some of these options should be considered marketing flair, the device aims to offer a multifaceted user experience.   OneXPlayer 2 Pro, Source: OneXPlayer  The system joins a large crowd of high-end AMD based handheld systems, but it is not expected to be anywhere cheap. Similarly to AYANEO Kun, it will almost certainly cost more than Legion Go, which offers very similar specs and features, but fewer memory and storage options. We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}