{
    "title": "Sapphire NITRO+ Radeon RX 7900 GRE Review - AMD Strikes Back",
    "date": "2/28/2024",
    "url": "https://www.tweaktown.com/reviews/10682/sapphire-nitro-radeon-rx-7900-gre-amd-strikes-back/index.html",
    "text": "Although we're at the GPU lifecycle point where we all begin to look toward the next generation and the horizon, this year has already seen quite a significant shake-up to the lineups for the two big players - AMD and NVIDIA. The latter has introduced and refreshed its enthusiast lineup of GeForce RTX 40 Series graphics cards with the new SUPER range, with AMD opting to drop prices and release a new mid-range offering with 16GB of VRAM - a first. However, the arrival or re-launch of the AMD Radeon RX 7900 GRE might be the most exciting regarding competition and overall value. That said, the AMD Radeon RX 7900 GRE or Golden Rabbit Edition is a strange release because it was initially designed for the Chinese market and system builders, offering an efficient and cutdown version of the flagship Radeon RX 7900 XT months before the launch of the company's mid-range and enthusiast-grade Radeon RX 7700 XT and Radeon RX 7800 XT. It uses the same Navi 31 GPU found in the Radeon RX 7900 XT and 7900 XTX, and when stacked up against the Navi 32 GPU in the Radeon RX 7800 XT, you're looking at better performance per watt. What solidifies this global launch of the Radeon RX 7900 GRE as a great move on behalf of AMD is the price point of $549 USD, the same as the GeForce RTX 4070. And when looking at its 1440p and 4K gaming performance, the Radeon RX 7900 GRE's performance sits closer to the new (and impressive) GeForce RTX 4070 SUPER. The only real downside here is that it makes the Radeon RX 7800 XT look a little out of place, with this potentially being the better value option of the two. Per my review of the XFX Radeon RX 7900 GRE reference model, based on the performance and value, AMD should have changed the name for the global release of the Radeon RX 7900 GRE to fit the RDNA 3 lineup better. Radeon RX 7800 XTX or Radeon RX 7900, so as not to confuse consumers checking out a GPU lineup and wondering what 'GRE' means. Either way, the name doesn't change the fact that what you've got here is an excellent 1440p performer that is great for 4K gaming, too - and in Sapphire NITRO+ form, it's one of the best-looking Radeon GPUs on the market. \"The world's first chiplet gaming GPU\" is how AMD described its new RDNA 3-based GPUs when it lifted the lid on the new Radeon RX 7000 Series. In layperson's terms, the GPU chip isn't just one big square or die anymore, with billions of transistors all arranged in a single layout. Like with its Ryzen CPU range, which embraced chiplet design to significant effect (look at how Ryzen has grown in popularity over the years), bringing this design philosophy into the GPU space felt like the natural evolution for AMD's Radeon brand. For RDNA 3, what was once a single Graphics Compute Die (GCD) has now split into a GCD plus a Memory Cache Die (MCD). The GCD still makes up most of the hardware grunt and uses the newer 5nm process technology - a step up from RDNA 2's 7nm process. Interestingly, the MCD uses 6nm process technology, which allows AMD to keep costs down as the complexity and cost of manufacturing high-end tech continue to rise. And to mitigate any performance impact that could arise from going the chiplet route, AMD has also managed to include the \"fastest chiplet interconnect in the world,\" with speeds of 5.3 TB/s. That said, the Radeon RX 7600 entry-level models using the 'Navi 33' GPU follow a more traditional single-chip setup using 6nm process technology to help keep costs down. But with the same RDNA 3 architecture. AMD's groundbreaking chiplet design can be found in the 'Navi 32' and 'Navi 31' GPUs - Radeon RX 7700 XT, 7800 XT, 7900 GRE, 7900 XT, and 7900 XTX. AMD's RDNA 3 architecture also features second-generation AMD Infinity Cache, another CPU-like feature designed to boost performance in 1440p and 4K gaming - a \"bandwidth amplifier\" that sits alongside the GDDR6 memory interface. It helps alleviate the need for more expensive and power-hungry memory buses and is one of those forward-thinking designs we love seeing. RDNA 3 also represents a leap forward for AMD regarding ray-tracing and AI accelerators. RDNA 3 GPUs feature the second generation of dedicated RT hardware and new hardware-based AI acceleration. Real-time ray tracing is hardware intensive; this is one area many were looking for AMD to improve compared to RDNA 2. Which, admittedly, was the company's first attempt at hardware-based ray tracing. RDNA 3 GPUs are the first graphics cards supporting the new DisplayPort 2.1 spec. The latest DisplayPort interface supports up to 4K 480Hz and even 8K 165Hz, which makes it more of a future-proofing measure than something applicable today. But the real benefit comes with 12-bit HDR support and full Rec2020 coverage for improved color accuracy and detail. RDNA 3 also introduces hardware-based AV1 encoding to step up its video game for content creators, which means better quality video using the same bitrate. Very cool. For gamers, the introduction of AMD FSR 2 and FSR 3 (with frame generation) is fully supported here and helps improve performance in intensive games. FSR 2 and FSR 3 support might not be as widespread as NVIDIA DLSS, but its addition to more games in 2024, like Starfield, is an excellent sign. In-game FSR support should grow as time passes. AMD's frame generation technology extends beyond FSR 3 to the driver-based AMD Fluid Motion Frames, which can be enabled in thousands of games via AMD's Adrenaline Software control panel - as part of the new HYPR-RX suite. Although image quality and overall stability aren't quite up to the level of FSR 3 or DLSS 3 (which, as integrated solutions, benefit from raw game data), by opening the door to frame generation in all titles - it's an exciting and notable inclusion to the Radeon lineup. And one that will continue to grow and evolve. Ultimately, RDNA 3 is an impressive leap forward for AMD, bringing massive changes to the underlying hardware while delivering a sizable performance leap over the previous RDNA 2 generation. Here, we can see how the specs and hardware stack up for the AMD Radeon RX 7900 GRE compared to the AMD Radeon RX 7800 XT and 7900 XT. Although the specs make the Radeon RX 7900 GRE look like a significant upgrade over the Radeon RX 7800 XT - with 33% more Stream Processors, Compute Units, and Ray Accelerators, the overall performance sits in between the Radeon RX 7800 XT and the Radeon RX 7900 XT. Although it's got more hardware, the lower clock speeds, memory bandwidth, and power limit are enough to keep the Radeon RX 7900 XT notably ahead in most benchmarks but also enough to give the Radeon RX 7900 GRE a double-digit lead over the Radeon RX 7800 XT. It's a strange GPU when you factor in that we rarely see a more powerful GPU in a lineup using less power than the GPU which outperforms it. The overall difference in power rating and usage between the Radeon RX 7800 XT and Radeon RX 7900 GRE is negligible to the point where you could say that they're the same - but the outcome is a GPU with better overall efficiency about performance-per-watt (a measure of how much power is required to render a single frame). It's the most efficient GPU in the RDNA 3 lineup, even when stacked against the Radeon RX 7900 XT. Compared to its beefier sibling, the Radeon RX 7900 GRE has 20% less VRAM with 6GB of GDDR6 on a 256-bit bus than 20GB of GDDR6 on a 320-bit bus. Clock speeds and other specs are also reduced by 5-6% across the board. However, the $549 price point of the Radeon RX 7900 GRE makes it significantly cheaper, and there's enough performance left over for it to trade blows with the more expensive GeForce RTX 4070 SUPER. It's a strange release - especially when you factor in that the Radeon RX 7800 XT leaves enough room for overclocking to boost performance from the reference specs. For the Radeon RX 7900 GRE, the 260W power limit leaves little room for OC action, and this makes sense for a GPU designed initially for system builders and with a limited release. Sapphire's NITRO+ design is one of the best-looking as far as Radeon GPUs are concerned, and sure, that's a very subjective point of view, but the brushed metal finish with RGB light strip on the top looks legitimately high-end. The full metal shroud is robust, with the Cold Rolled Steel Frame and full metal backplate being of the utmost quality. This is Sapphire's premium design, where you've also got a high-end 'Angular Velocity Fan Blade' design for the triple-fan cooling setup and things like dedicated VRM cooling under the hood. It's a showpiece, and the RGB light strip on the top can be connected directly to your RGB controller (alongside the fans) for syncing. This adds a modern touch that blends in perfectly with the design, adding a layer of customization to what would otherwise be a minimal brushed metal GPU. There are also premium components under the hood, including a copper PCB, 14-phase power, composite heat pipes, and little touches here and there to boost cooling and thermal performance. Sapphire offers its TriXX software for customization and tweaking, but out of the box, you've got a Dual BIOS switch for different profiles. Overall, it's an excellent, stylish GPU design that is built to last with tremendous cooling potential. You've also got some unique features like the ability to remove the fans for easy cleaning - a little touch that goes a long way to solidify the NITRO+ as one of the premiere custom Radeon designs. In 2023, PC gaming is a complicated and varied space, from indie games to major blockbuster releases and titles that push hardware and technology to their limit with the adoption of effects like real-time ray-tracing. This is all a way of saying that the 15 in-game benchmarks we've chosen (run at 1080p, 1440p, and 4K) represent a wide range of styles, not only in terms of genres, like first-person shooters and racing games, but also in the API technology (DirectX 11, 12) and cutting-edge features like ray tracing and upscaling technology. Results include DLSS and FSR 2, where possible, as both technologies are the sorts of things, especially in 1440p and 4K, which you'd turn on. Six of the 15 game benchmarks also feature ray tracing. Also, each title is set to ultra-equivalent quality settings to push GPU hardware and minimize CPU bottlenecks at higher resolutions. Also, it's just fun to max out a game's visual settings and see the results. Here's the breakdown of games, graphics settings, and what's being tested. The Sapphire NITRO+ Radeon RX 7900 GRE is a powerful enthusiast-class GPU that delivers excellent 1440p and 4K performance across various titles. It's the sort of GPU wasted on pure 1080p gaming unless you care about only competitive shooter performance, but it's still a powerhouse at this resolution. The 174 FPS average across our 15-game benchmark suite is enough to make the Sapphire NITRO+ Radeon RX 7900 GRE 10.8% faster than the similarly priced GeForce RTX 4070 and 11.5% faster than the Radeon RX 7800 XT. Individual game results vary from title to title; however, there are only a handful of titles where the GeForce RTX 4070 pulls ahead - Cyberpunk 2077, Hitman, and DOOM Eternal. All three feature ray-tracing; for the most part, the Radeon RX 7900 GRE easily outperforms the GeForce RTX 4070, with overall performance being on par with the GeForce RTX 4070 SUPER. Raw non-RT gaming is where Radeon excels, and in titles like Call of Duty and non-RT Cyberpunk 2077, the Sapphire NITRO+ Radeon RX 7900 GRE is significantly faster than its GeForce competition. 1440p gaming is where the Sapphire NITRO+ Radeon RX 7900 GRE excels, delivering a 130 FPS average across our 15-game benchmark suite. Here, the GPU is 13% faster than the Radeon RX 7800 XT, 14% faster than the GeForce RTX 4070, and only 9% slower than the more expensive Radeon RX 7900 XT. When you factor in the $549 price point, this is one of the best-value RDNA 3 GPUs currently available - if not the best. Overall performance is again on par with the GeForce RTX 4070 SUPER when looking at the average across our 15-game benchmark suite. One of the stand-out titles for Radeon GPUs is Call of Duty, and here, the Sapphire NITRO+ Radeon RX 7900 GRE manages to outperform the GeForce RTX 4080 SUPER - which is a truly impressive feat. This is an exceptional case, of course, and the inverse is true when looking at RT Ultra performance in Cyberpunk 2077 - where performance is 15% slower than the GeForce RTX 4070. Ray-tracing is an area where RDNA 3 and Radeon GPUs are still a step behind, but when it comes to enthusiast-grade GPUs like this, RT performance outside of titles with lots of ray-tracing effects firing off is decent. Ultimately, being 13% faster than the Radeon RX 7800 XT but only 10% more expensive makes it a desirable option for those looking at the $500-$600 price range. Compared to the GeForce RTX 4070, with faster performance and more VRAM, the choice is clear - however, NVIDIA's dominance in ray-tracing and technology like DLSS could be something to consider. 4K gaming, at least in terms of native rendering, requires so much GPU horsepower that there are very few options you'd consider 4K-ready. And with the visual fidelity of games improving each year, something that was 4K-ready a few years ago might no longer be the case in 2024. The Sapphire NITRO+ Radeon RX 7900 GRE is a solid 4K gaming GPU, close to 10% faster than the Radeon RX 7800 XT - which is enough to ensure a comfortable 60+ FPS in a lot of games with detail settings cranked. Here, the Sapphire NITRO+ Radeon RX 7900 GRE is 11% faster than the GeForce RTX 4070 while falling behind the GeForce RTX 4070 SUPER by around 4% on average. It's at 4K where the jump to the Radeon RX 7900 XT is the most prominent; AMD's high-end designed-for-4K option is around 15.7% faster - however, that GPU exists in a very different price range. With its $549 price point, you've got a more powerful option in a highly competitive field that includes two GPUs from Team Green and two from Team Red. Non-RT titles like Call of Duty and others are where the Sapphire NITRO+ Radeon RX 7900 GRE shines - as expected. However, it has to be said that when it comes to 4K gaming upscaling technologies like FSR 2 and FSR 3 from AMD, DLSS from NVIDIA, and XeSS from Intel have proven to be game changers in recent years. With minimal impact on visual fidelity, upscaling is something you want to enable when gaming in 4K. Although FSR 2 and FSR 3 support continues to grow, DLSS is still the most prevalent and impressive option - and something of a killer feature for GeForce RTX GPUs. Synthetic benchmarks are a great way to gauge performance, and the first test on the synth menu is 3DMark FireStrike - a DirectX 11 gaming test that stresses GPU and CPU performance. Looking at the 1440p 3DMark FireStrike Extreme results, the Sapphire NITRO+ Radeon RX 7900 GRE scores 7.3% higher than the Radeon RX 7800 XT and a whopping 28.7% higher than the GeForce RTX 4070. The latter result does not indicate in-game performance, with this particular 3DMark test favoring Radeon GPUs to the point where it does not predict actual in-game performance. The next synthetic benchmark on the menu is the DirectX 12-based 3DMark TimeSpy, and here, the results more accurately reflect in-game performance, which makes sense when you factor in that DirectX 12 is the current API of choice for PC gaming and used by most titles released in recent years. Here, the Sapphire NITRO+ Radeon RX 7900 GRE score is roughly the same as the GeForce RTX 4070 SUPER, a result similar to what we found across our 15-game benchmark suite. It's also 5.3% higher than the Radeon RX 7800 XT and 15.5% higher than the similarly priced GeForce RTX 4070. Overall, the 3DMark TimeSpy results are a close approximation of what to expect with the 'new' Radeon RX 7900 GRE - and that is a GPU with performance that sits in between the Radeon RX 7800 XT and Radeon RX 7900 XT The final synthetic test covers ray-tracing performance. 3DMark Port Royal is always great, with plenty of RT reflection action and impressive lighting bouncing around the screen. Here, the Sapphire NITRO+ Radeon RX 7900 GRE score is 7.9% higher than the Radeon RX 7800 XT, 4.8% higher than the GeForce RTX 4070, and 11.5% lower than the GeForce RTX 4070 SUPER. With more RT hardware than the Radeon RX 7800 XT, the Radeon RX 7900 GRE delivers notably faster RT gaming performance - something to consider if high-end visuals and cinematic immersion are a top priority. However, as mentioned, NVIDIA's DLSS and new RT-enhancing technologies improve ray-tracing image quality when gaming on a GeForce RTX GPU. Here's hoping AMD continues progressing in this side of PC gaming with the upcoming RDNA 4 architecture. Looking at raw performance, the Sapphire NITRO+ Radeon RX 7900 GRE is a powerful GPU that lives up to its enthusiast tag by delivering excellent 1440p and 4K gaming performance. This extends to Radeon software and technologies like FSR 2 and FSR 3, which have only improved since the first RDNA 3 GPU hit the scene in 2022. When gaming in 1440p or 4K, AMD's FSR delivers impressive image quality when using the Quality setting - enough to make it worth enabling in a range of titles for a free performance boost. And as we head into 2024, the good news is that AMD has finally come to the table regarding frame generation - with FSR 3 adoption picking up steam and the new HYPR-RX tech AFMF or AMD Fluid Motion Frames being a driver-based solution that lets you enable frame generation in thousands of games. AFMF is an exciting piece of technology. However, image quality and stability aren't at the same level as FSR 3 or NVIDIA's DLSS 3 Frame Generation. But it does work and is worth enabling in some titles, and AMD has noted that it plans to improve how it works and looks in the months and years to come. A potential killer feature and a game changer for Radeon GPU owners, AFMF is something to keep an eye on. AMD's best frame generation implementation comes with FSR 3, which, like FSR 2, is open-source and must be implemented per game. It also works on all GPUs - Radeon RX and GeForce RTX alike. The number of FSR 3 games has doubled in the first few months of 2024 and looks great in titles like Avatar Frontiers of Pandora and Starfield - where you're getting a perceived performance uplift of 3.2X and 2.3X, respectively. Frame Generation is not the same as raw performance; additional latency reduction is required to ensure that games still feel great to play, and on that front, AMD's Anti-Lag+ is still in a state of flux - which means NVIDIA DLSS 3 and Reflex has the edge when it comes to overall smoothness. However, frame generation is here to stay - and will increasingly become something gamers and developers look at to improve the gaming experience. As mentioned earlier, with its overall power rating of 260W, slightly less than the Radeon RX 7800 XT's 263W, the Radeon RX 7900 GRE is the most efficient GPU in AMD's lineup when it comes to the performance it delivers. In a way, it makes the Radeon RX 7800 XT look inferior. However, the Radeon RX 7900 GRE features a cutdown version of the flagship Navi 31 GPU - so it was never really intended to be cut down to this extent and competitively priced to compete directly with the GeForce RTX 4070. NVIDIA's 40 Series and Ada GPUs are still in a different league regarding power efficiency, with the similarly performant GeForce RTX 4070 SUPER being a far more efficient option. As for the cooling performance of the Sapphire NITRO+ Radeon RX 7900 GRE, the GPU temperature hit 66 degrees Celsius with a hot spot of 84 degrees. This has a modest fan curve and speed of under 1000 RPMs or 25% of the total capacity. So, in addition to being power efficient (for an RDNA 3 GPU), the Sapphire NITRO+ Radeon RX 7900 GRE also runs cool and quiet - even when stressed. And when not being put through its paces, the fans turn off for a completely silent performance. Initially released for the Chinese market in 2023, before the arrival of the Radeon RX 7800 XT, the Radeon RX 7900 GRE wasn't something we expected to get a wide release on account of it being an oddity in the RDNA 3 lineup. Here, you've got a cutdown Navi 31 GPU, albeit one that still outperforms the Radeon RX 7800 XT while giving the GeForce RTX 4070 SUPER a run for its money. It's not hard to see why AMD has opted to re-launch the Radeon RX 7900 GRE with a competitive $549 USD price tag; it offers some real competition after NVIDIA dropped the price of the GeForce RTX and launched the new GeForce RTX 4070 SUPER. As for the Sapphire NITRO+ Radeon RX 7900 GRE, you've got one of the best-looking and well-built Radeon GPUs currently available - a premium design that will cost a bit more than MSRP models. And it's a great GPU, no matter the model, with excellent 1440p and 4K performance in an efficient package that delivers on all fronts. The competitive price adds quite a bit of context to the point where there's an argument to be made for picking this up over the Radeon RX 7800 XT and the GeForce RTX 4070. Performance 92% Quality 92% Features 90% Value 92% Overall 92% Confusing name aside, the Radeon RX 7900 GRE is one of the best Radeon releases (or re-releases) in a long time, bringing some real competition to the table. For $549, it trades blows with the more expensive GeForce RTX 4070 SUPER, and in Sapphire NITRO form, it looks fantastic doing it. Kosta Andreadis Kosta is a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit. Similar Content Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}