{
    "title": "AMD Ryzen 5700x3D Review, Revive That Old AM4 PC You Have",
    "date": "2/1/2024",
    "url": "https://www.storagereview.com/review/amd-ryzen-5700x3d-review-revive-that-old-am4-pc-you-have",
    "text": "The AMD Ryzen 7 5700X3D with its powerful 3D V-Cache technology, is designed to boost gaming performance significantly. AMD recently released an exciting extension to the life of its AM4 platform with new Ryzen 5000 Series desktop processors. These processors, including the Ryzen 7 5700X3D with its powerful 3D V-Cache technology, are designed to boost gaming performance significantly.  When we mentioned that we had an old AMD 1700x in our Edge Lab, our friends at AMD took matters into their own hands and provided a drop-in upgrade for the platform, the top SKU AMD Ryzen 7 5700x3D. We conducted the standard test suite and included the newly released 8000G APU for comparison.  Faithfully running as a media server for several years, we had an AM4 platform just begging to be upgraded. Key Specifications: All of the tests for the AM4 platform were recorded back to back on the same OS installation, with the only change being the CPU. Default “AI” overclock and maximum stable memory bandwidth were used. Focusing on the generational improvement from Zen to the latest and last Zen3 AM4 platform, we saw some remarkable performance lifts in the test rig. Thanks to the sizeable 100MB of Cache on the CPU, you get some pretty interesting results if your workload can take advantage of it.  The 3DMark CPU Profile is a benchmarking tool tailored to gauge CPU performance through a series of custom simulations. This benchmark includes six distinct tests, each employing the same workload but with varying threading capacity. These tests are meticulously designed to challenge the CPU across different threading levels — 1, 2, 4, 8, 16, and up to the maximum available threads of a given system. 3DMark Night Raid is a DirectX 12 benchmark tailored for devices with internal graphics, and Fire Strike is a DirectX 11 benchmark designed for gaming PCs. Fire Strike includes two graphics tests, one physics test, and a combined test for the CPU and GPU simultaneously. Geekbench 6 is a cross-platform benchmark that measures the performance of a system and provides a score for comparison. It is designed to work on multiple platforms and provides a consistent performance measure across many devices, from smartphones and tablets to desktops and servers. *The 8600G had some issues through our OpenCL tests, which have since been fixed with driver updates. Keep updated with the latest drivers and firmware on your system, and if you build one of these, as usual with any new platform, plan on the first thing being BIOS and driver updates directly from AMD and your motherboard manufacturer and not rely on Windows Update. Cinebench is a widely used benchmarking tool that measures the performance of CPUs and GPUs using Maxon Cinema 4D for rendering. It provides a score that can compare the performance of different systems and components. We ran four popular versions of Cinebench so you can compare the results on popular leaderboards online. And, of course, our old favorite, y-cruncher 0.8.3.9532, a multi-threaded and scalable program that can compute Pi and other mathematical constants to trillions of digits. Since its launch in 2009, it has become a popular benchmarking and stress-testing application for overclockers and hardware enthusiasts. It is worth noting here the 8000G Series is more for reference, as this benchmark depends highly on memory bandwidth, and the 5700x3D uses DDR4, the same as the 1700X, while the 8000G series uses much faster DDR5 The popular 7-Zip utility has a built-in memory benchmark demonstrating the CPU’s performance. We run this test at a 128MB dictionary size with ten passes. Blender OptiX is an open-source 3D modeling application. This benchmark was run using the Blender Benchmark CLI utility. The score is samples per minute, with higher being better. Next is LuxMark, an OpenCL GPU benchmarking utility. The APU’s integrated graphics put up some impressive numbers for what it was. Unfortunately, we could not get a clean, valid run on the 8600G. Our next test is SPECviewperf 2020, the worldwide standard for measuring graphics performance of professional applications under the OpenGL and Direct X application programming interfaces. The viewsets (or benchmarks) represent graphics content and behavior from actual applications without having to install the applications themselves. The last test, the Blackmagic RAW speed test, tested the decoding speed of Blackmagic RAW frames. AMD continues to impress, releasing a CPU in 2024 for a platform released in 2016. But if you have been keeping up with GPU upgrades and have a decent platform already built on the aging AM4 platform, for $250, and performance on par with the 8600G in non-memory bound tasks, you can get a worthy upgrade to bring relevance back to the build.  We could see a clear performance increase demonstrated across the test suite. It was straightforward to make the change; a simple BIOS update and some fresh thermal paste was all it took. We will also be doing some additional testing on this platform to put it into homelab service, so stay tuned on our YouTube for that. Engage with StorageReview Newsletter | YouTube | Podcast iTunes/Spotify | Instagram | Twitter | TikTok | RSS Feed AI Specialist; navigating you through the world of Enterprise AI. Writer and Analyst for Storage Review, coming from a background of Financial Big Data Analytics, Datacenter Ops/DevOps, and CX Analytics.\nPilot, Astrophotographer, LTO Tape Guru, and Battery/Solar Enthusiast. Subscribe to the StorageReview newsletter to stay up to date on the latest news and reviews. We promise no spam! 1  Copyright © 1998-2024 Flying Pig Ventures, LLC Cincinnati, Ohio. All rights reserved. "
}