{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.tradingview.com/news/tradingview:122265aa1094b:0-amd-automates-track-inspection-with-ai/",
    "text": "AMD has announced a partnership with JR Kyushu Railway Company, a Japanese bullet train operator, to automate track inspection using the AMD Kria™ K26 System-on-Module (SOM). This AI-based solution is replacing traditional methods of inspecting miles of track on foot, leading to significant improvements in inspection speed, cost, and accuracy. This aligns with Japan's stringent railway safety requirements. The track inspection solution involves a vision computing box attached to a cart that inspects tracks at speeds of 12 mph. The box features a high-speed camera that uses the FPGA-based Kria K26 SOM for AI-enhanced pre-and-post data and image processing. The Kria K26 SOM is a compact, all-in-one embedded platform that integrates a custom-built AMD Zynq™ UltraScale+™ MPSoC with DDR memory, nonvolatile storage devices, a security module, and an aluminum thermal heat spreader. The use of AI in this case has led to a reduction in cost and a dramatic improvement in operational efficiency. The programmability, durability, and embedded intelligence of the AMD Kria SOM-powered solution make it adaptable to the unique and changing conditions, geographies, and needs of JR Kyushu’s territory and ridership. The solution from TAI and AMD has already improved the efficiency of conventional track inspection, and further improvements in inspection efficiency are anticipated through future functional enhancements. The AMD Kria SOMs are accelerating innovation at the edge and simplifying solution development through deployment, automating processes and dramatically enhancing operational efficiency across a variety of applications, from machine vision to industrial robotics and AI/ML computing. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @dehandreh @yo44ge4real @stvmcg @Arcanebear.eth @retirewithforex @sethsickness @aliams_david_trading_gram @mytradingsetup @fx_bitcoin_expert11 @tradingfrance @mytradingsetup @jordan_fx_ @nav.fx @itzi71 @laptopmoneygang @heinrich_j96 @johndollery @aggressivecalculator Whatever the trade "
}