{
    "title": "HDMI Forum says no to open-source AMD HDMI 2.1 driver support",
    "date": "2/29/2024",
    "url": "https://www.pcguide.com/news/hdmi-forum-says-no-to-open-source-amd-hdmi-2-1-driver-support/",
    "text": "PC Guide is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Read More Last Updated on February 29, 2024 The AMD HDMI 2.1 has faced a big challenge that, unfortunately, will remain unsolvable for the time being. AMD has been unable to implement support for the open-source Linux kernel driver HDMI 2.1+ without breaking the legal requirements. And while they’ve been searching for a solution to the problem, their proposal was recently denied by the HDMI Forum. For years now, a bug where 4k@120hz and 5K@240Hz are unavailable via HDMI 2.1 has plagued the driver. And, since being discovered, AMD has long since been working on a way to solve the problem. However, those plans have come to a halt, as confirmed by AMD Linux Engineer Alex Deucher in a forum post. The HDMI Forum rejected their proposal, and at this time, an open-source HDMI 2.1 implementation is not possible. This means the bug will remain with no fix on its way. HDMI Forum restricted open-source access to its specifications back in 2021, causing issues with those in favor of open-source drivers. AMD Linux engineers have been working with their legal team to devise a solution and request open-source driver support for HMDI 2.1. But, after months of coding for the HDMI 2.1+ features within the open-source AMDGPU codebase, it’s been halted after their proposal was rejected. Unfortunately, months of work were likely wasted in this pursuit. As an alternative, open-source users are encouraged to use DisplayPort instead. While this isn’t the news supporters wanted to hear, AMD will have to work to find other solutions to run modern HDMI features on their open-source drivers, whether that be a DisplayPort adapter or something similar. HDMI 2.1 remains a staple on systems for the best graphics, whether running on impressive gaming monitors or top-quality TVs. Whatever side you stand on regarding HDMI 2.1 support for open-source drivers, there’s no denying its quality, allowing for higher resolutions, higher frame rates, and an overall smoother experience.  Annie is a journalist focusing on the latest technology news and deals. At PC Guide, Annie covers the latest bundle deals and news from the world of tech, with a particular focus on GPU and CPU news. PCguide.com is part of the BGFG family of websites. Our mission is to provide you with great editorial and essential information to make your PC an integral part of your life. You can also follow PCguide.com on our social channels and interact with the team there. © 2024 PC Guide. All rights reserved. Part of "
}