{
    "title": "Nvidia finally catches up to AMD and drops a new app that promises better \ngaming and creator experiences",
    "date": "2/23/2024",
    "url": "https://www.techradar.com/computing/software/nvidia-finally-catches-up-to-amd-and-drops-a-new-app-that-promises-better-gaming-and-creator-experiences",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. One interface, many more possibilities: Nvidia's unified app beta unveiled Nvidia has announced plans to bring together the features of the Nvidia Control Panel, GeForce Experience, and RTX Experience apps all in a single piece of software. On February 22, Nvidia explained on its website that this new unified app is being made available as a public beta. This means that the app could still be changed in the hopes of improving it, but you can download it now and try it for yourself. The app is made specifically to improve the experience of gamers and creators currently using machines equipped with Nvidia GPUs by making it easier to find and use functions that formerly lived in separate programs. Users with suitable Nvidia GPUs can expect a number of significant improvements that come with this new centralized app. Settings to optimize gaming experiences (by tweaking graphical settings based on your hardware)  and downloading and installing new drivers can now be found in one easy interface. It’ll be easier to understand and keep track of driver updates, such as new features and fixes for bugs, with clear descriptions. While in-game, users should see a redesigned overlay that makes it easier to access features and tools like filters, recording tools, monitoring tools, and more. Speaking of filters, Nvidia is introducing new AI Freestyle Filters which can enhance users’ visuals and allow them to customize the aesthetics of their games. As well as all of these upgrades, users can easily view and navigate bundles, redeem rewards, get new game content, view current GeForce NOW offers, and more.  It certainly seems like Nvidia has worked hard to create a more streamlined app that makes it easier to use your RTX-equipped PC. It’s specifically intended to make it easier to do things like make sure your PC is updated with the latest Nvidia drivers, and quickly discover and install other Nvidia apps including Nvidia Broadcast, GeForce NOW, and more. The Nvidia team also claims in its announcement that this new centralized app will perform better on RTX-GPU-equipped PCs than its separate predecessors. That’s thanks to reduced installation times through the app, better responsiveness from the user interface (UI), and because it should take up less disk space than its predecessors (I assume combined). This isn’t the end of the new Nvidia app’s development, and it seems some legacy features didn’t make the cut, including 360/Stereo photo modes and streaming directly to YouTube and Twitch, because they see less use. Clearly, Nvidia felt it wasn't worth including these more niche features in the new app, and anyone who wants to continue to use them can still use the older apps (for now, at least). The new app is focused on improving performance, and making it easier to install and integrate new features into users’ systems.  By combining its apps into one, easy-to-use piece of software, Nvidia is finally catching up to AMD in one aspect where Team Red has the advantage: software. AMD's Radeon Adrenalin app already offers a lot of these features, as well as others, like a built-in browser and HDMI link assurance and monitoring that can automatically detect any issues with the HDMI’s connectivity - all in one single interface. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. Finally, AMD doesn’t require users to make an account to be able to use its app. We don’t expect that Nvidia will fully catch up to AMD’s app just yet (though it would be nice not to have to sign in), but this is definitely a push in the right direction and hopefully users will see a lot of use out of the new app. Kristina is a UK-based Computing Writer, and is interested in all things computing, software, tech, mathematics and science. Previously, she has written articles about popular culture, economics, and miscellaneous other topics.  She has a personal interest in the history of mathematics, science, and technology; in particular, she closely follows AI and philosophically-motivated discussions. OpenAI's new voice synthesizer can copy your voice from just 15 seconds of audio Chrome's new Declutter tool may soon help manage your 100 plus open tabs Quordle today – hints and answers for Sunday, March 31 (game #797) By Cesar CadenasMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Al GriffinMarch 29, 2024 By Cesar CadenasMarch 29, 2024 By Alex WhitelockMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}