{
    "title": "AMD Radeon RX 7900 XTX vs NVIDIA GeForce RTX 4080 Gaming Benchmarks",
    "date": "3/8/2024",
    "url": "https://www.hardwaretimes.com/amd-radeon-rx-7900-xtx-vs-nvidia-geforce-rtx-4080/",
    "text": "The Radeon RX 7900 XTX is AMD’s fastest RDNA 3 graphics card. Priced at $949, it competes with the GeForce RTX 4080 (and the 4080 Super). Despite being cheaper, it often delivers similar performance as its NVIDIA rival, even surpassing it sometimes. We compared the two high-end GPUs across a few dozen gaming benchmarks at 1080p and 1440p, with ray tracing cranked to ultra. Table of Contents On paper, the Radeon RX 7900 XTX has the RTX 4080 beat in most scenarios. It features 50% more memory than the RTX 4080 (24GB vs. 16GB), 50% more cache (96MB vs. 64MB), and a 50% wider bus (384-bit vs. 256-bit). Ergo, the RX 7900 XTX has a significantly better memory subsystem. The GeForce RTX 4080 features more cores than the 7900 XTX (9728 vs. 6144), faster GDDR6X memory (22.4 Gbps vs. 20 Gbps), and lower power consumption (320W vs. 355W). The Radeon RX 7900 XTX has a clock speed rating of 2498 MHz, while the RTX 4080 is marketed at 2550 MHz. In reality, both GPUs run between 2.7 GHz and 2.8 GHz, depending on the power consumption and thermal conditions. A Plague Tale: Requiem runs slightly faster on the RTX 4080, which holds a 7% lead over the Radeon RX 7900 XTX. A similar deficit can be observed in the lows. Assassins Creed: Valhalla runs a smidge faster on the RX 7900 XTX, but the GeForce RTX 4080 produces superior lows, 6% higher than on the Radeon. Cyberpunk 2077 is 11% faster on the Radeon RX 7900 XTX, with superior lows and smoother frame pacing than the RTX 4080. Dying Light 2 performs slightly better on the RTX 4080, but the 7900 XTX delivers markedly higher lows than its pricier rival. F1 2022 tends to favor AMD hardware, and it shows. The RX 7900 XTX is ~7% faster than the RTX 4080 with similar lows. Ghostwire: Tokyo is another game that runs better on the Radeon RX 7900 XTX, with a 4% lead over the RTX 4080. The difference in lows is more palpable, conferring the former with a 24% advantage. Hitman 3 produces nearly matching results on the two GPUs. The Radeon has a slightly higher average, while the 4080 yields superior lows. Hogwarts Legacy is notably faster on the RX 7900 XTX, holding an average lead of 16% over the GeForce RTX 4080 in this NVIDIA partner title. Shadow of the Tomb Raider is a tad faster on NVIDIA’s RTX 4080, with comparable lows in this well-optimized open-world game. The Callisto Protocol is an AMD partner title that favors the GeForce RTX 4080 over the Radeon RX 7900 XTX. While the averages stay well over 100 FPS, the lows drop below 45 FPS on the latter. Tiny Tina’s Wonderlands is 9.5% faster on the RX 7900 XTX with a 16% deficit in 1% lows compared to the RTX 4080. At 1440p, the RX 7900 XTX is about as fast as the RTX 4080. Its average frame rate across our 11-title benchmark suite is 173.34 FPS, just 1 FPS higher than the 4080. A tie. 4K benchmarks on the next page… "
}