{
    "title": "Intel's Lunar Lake CPUs could deliver 50% faster multi-threaded performance \nthan Meteor...",
    "date": "3/11/2024",
    "url": "https://www.techspot.com/community/topics/intels-lunar-lake-cpus-could-deliver-50-faster-multi-threaded-performance-than-meteor.284799/",
    "text": " The latest report comes from tipster extraordinaire @SquashBionic, who claims that the 17W Lunar Lake U-series chips will offer a 50 percent improvement in multi-threaded performance over the current-gen 15W Meteor Lake processors. The next-gen chips were earlier rumored to offer higher performance per watt and faster AI NPU performance, and the latest report now suggests that those claims were fairly accurate. MTL-U (15w)-> LNL(17w)\nAlmost 1.5x MT perf increase (CB23, GB 5.4.5) In another tweet, the tipster wrote that the 17W TDP was the original PL1 spec for single-fan configurations, but Intel has decided to extend the cTDP to 30W due to popular demand from OEMs. There's no word on specific SKUs, so we don't know how many of them will still ship with the original 17W TDP and how many will get the enhanced 30W spec for improved performance. However, if the 17W SKUs can offer a 50 percent higher performance than Meteor Lake, it is anybody's guess as to how much faster the 30W chips will be. 17w was the original PL1 for single fan config. They have extended cTDP to 30w pretty recently due to popular demand from OEM's According to prior rumors, the Lunar Lake processors will feature Lion Cove Performance Cores, Skymont Efficient Cores, and a fast Neural Processing Engine (NPU) that is said to offer thrice the performance of the NPU found in the Meteor Lake chips. The next-gen processors are also expected to get a brand new iGPU based on the Battlemage Xe2-LPG architecture. For all its improved specs, Lunar Lake will reportedly ditch hyper-threading support on its P-cores, which could theoretically affect their multi-threaded performance. If the rumors hold up, the 17W Lunar Lake CPUs will ship with up to 4 P-Cores and 4 E-Cores, totaling up to 8 cores and 8 threads, while the 15W Meteor Lake chips cited in the post offer 2 P-cores, 8 E-Cores, and 2 LP-E cores for a total of 12 cores and 14 threads. Permalink to story. https://www.techspot.com/news/102213-intel-lunar-lake-cpus-could-deliver-50-faster.html TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}