{
    "title": "AMD Ryzen 5 8600G review — the new value iGPU gaming champion",
    "date": "3/3/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/amd-ryzen-5-8600g-cpu-review/4",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Why you can trust Tom's Hardware \n\n\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test. This class of chip isn't meant to be paired with a discrete GPU, but these benchmarks are useful info if you plan to upgrade to a more powerful GPU in the future. We include these results for the sake of being complete, but the iGPU benchmarks on the preceding page are far more relevant for the Ryzen 8000G APUs.\n\nBelow, you can see the geometric mean of our gaming tests at 1080p and 1440p, with each resolution split into its own separate chart. Per our standard policy, we tested with an Nvidia GeForce RTX 4090 to reduce GPU-imposed bottlenecks as much as possible. Still, differences between test subjects will shrink with less powerful cards or higher resolutions.\n\nThese are cumulative metrics of our dGPU test suite, so individual wins vary on a per-title basis, which you can see further below. Some of these same benchmarks appeared in our integrated GPU testing on the prior page, but we used much higher quality settings for the tests below. We have a somewhat different test grouping for this series of benchmarks. We added a few AMD Ryzen 7000 models to the mix, and they clearly have much higher overall performance with a discrete GPU than the Ryzen 8000G models.\n\nFor instance, the price-comparable six-core $249 Ryzen 5 7600X is 15% faster than the Ryzen 5 8600G. An overclock does help the latter improve its standing, but the 7600X is also overclockable, which would provide it a further lead. Notably, the 7600X also comes as a 'non-X' model, the Ryzen 5 7600, which is ~$30 less than the X-equipped counterpart yet provides nearly the same performance. The performance is so close that we use the 'X' models as proxies, but you can find an even better deal and similar performance from the Zen 4 camp for less than shown here.\n\nThe 8600G is 22% faster than the Core i3-13100 but also carries a premium. The Intel Core i5-13400 lands between the Ryzen 5 8600G and the Ryzen 7 8700G, with slim margins separating the chips on either side. In contrast, the Core i5-14600K is on another level, delivering 30% more performance than the Ryzen 5 8600G.\n\nThe Ryzen 5 8600G is 20% faster than the previous-gen Ryzen 5 5600G. Overclocking can also squeeze out an extra 8% performance, but you'll have to balance that with the cost it will add to your build.\n\nThe Ryzen 5 8600G isn't the best option if you use a discrete graphics card. Both AMD and Intel have much better chips for systems focused on discrete GPUs.\n\nWe've included the full gaming benchmarks below, but given that this isn't the targeted use case for this chip, we'll skip the commentary.   Current page:\n\nAMD Ryzen 5 8600G Discrete GPU Gaming Performance Paul Alcorn is the Managing Editor: News and Emerging Tech for Tom's Hardware US. He also writes news and reviews on CPUs, storage, and enterprise hardware. Seven-year-old AMD gaming GPU continues to stick around — low-profile RX 550 arrives for SFF PCs PlayStation 5 Pro Enhanced requirements allegedly leaked — upscaled 4K at constant 60 FPS with ray tracing is the new target HP ends ties with Russia, shutting down its Russian website — website redirects to Kazakhstan with no support By Shane DowningMarch 22, 2024 By Christian EberleMarch 21, 2024 By Albert ThomasMarch 20, 2024 By Sarah Jacobsson PurewalMarch 20, 2024 By Albert ThomasMarch 19, 2024 By Zhiye LiuMarch 19, 2024 By Charles JefferiesMarch 18, 2024 By Christian EberleMarch 17, 2024 By Denise BertacchiMarch 16, 2024 By Brandon HillMarch 15, 2024 By Denise BertacchiMarch 14, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}