{
    "title": "AMD has plans to support a little known chip for at least another 16 years \n— and no, it is neither a Ryzen, nor a ...",
    "date": "3/10/2024",
    "url": "https://www.techradar.com/pro/amd-has-plans-to-support-a-little-known-chip-for-at-least-another-16-years-and-no-it-is-neither-a-ryzen-nor-a-threadripper-or-an-epyc-cpu",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The new Spartan UltraScale+ will be supported well into the 2040s Spartan UltraScale+ is the latest addition to AMD's extensive portfolio of cost-optimized Field Programmable Gate Arrays (FPGAs) and adaptive SoCs. It has been introduced to replace the Xilinx Spartan 6 and Spartan 7 lines. The new Spartan UltraScale+ devices are designed for a wide range of I/O-intensive applications at the edge. AMD says its latest FPGAs can deliver up to 30 percent lower total power consumption compared to the previous generation - energy efficiency is a hot topic right now - while boasting the most robust set of security features in the AMD's cost-optimized portfolio. “For over 25 years the Spartan FPGA family has helped power some of humanity’s finest achievements, from lifesaving automated defibrillators to the CERN particle accelerator advancing the boundaries of human knowledge,” said Kirk Saban, corporate vice president, Adaptive and Embedded Computing Group, AMD. “Building on proven 16nm technology, the Spartan UltraScale+ family’s enhanced security and features, common design tools, and long product lifecycles further strengthen our market-leading FPGA portfolio and underscore our commitment to delivering cost-optimized products for customers.” The Spartan UltraScale+ FPGAs offer a number of state-of-the-art security features, including support for Post-Quantum Cryptography with NIST-approved algorithms to provide robust IP protection against ever-evolving threats. They also include a physical unclonable function, providing each device with a unique fingerprint for added security. The Spartan UltraScale+ FPGA family sampling and evaluation kits are expected to be available in the first half of 2025, with tools support- starting with the AMD Vivado Design Suite - in the fourth quarter of 2024. What about that super-long lifecycle being promised? AMD says the Spartan UltraScale+ FPGA will be supported into the 2040s, and this is just the standard lifecycle. AMD will likely offer an extended lifecycle on top of that (as it has with past FPGAs), which will take the chip’s support well into the future. That might seem like some serious generosity on AMD’s behalf, but as Serve The Home explains, \"Spartan FPGAs are often in products that take years to design and then are sold and used for decades in the future.\" Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. Samsung archrival plans construction of world's largest chip factory — at more than $90 billion, it will take more than 20 years to finish, so one wonders what other exciting tech will it produce This is what a single 256GB DDR5 memory module looks like — but you won't be able to fit this Micron RAM in your desktop or laptop and it will almost certainly cost more than $10,000 if you can buy it Microsoft's repair-friendly Surface puts other laptop makers on notice – and it's about time By Sead FadilpašićMarch 29, 2024 By Al GriffinMarch 29, 2024 By Cesar CadenasMarch 29, 2024 By Alex WhitelockMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}