{
    "title": "China bars Intel and AMD chips in government computers",
    "date": "3/26/2024",
    "url": "https://www.globaldata.com/newsletter/details/china-bars-intel-and-amd-chips-in-government-computers_350939/?newsletterdate=2024-03-27&hubspotcategory=gd-technology-verdict-daily&utm_source=website&utm_medium=top_navigation&utm_content=other_daily_news_articles&utm_campaign=type2_technology",
    "text": "Previous edition: 27 Mar 2024\nShare article Get the full version straight to your inbox.\r\n                                Exclusive access to our best-in-class data & intelligence Subscribe now Beijing plans to phase out US made microprocessors in government PCs and servers, as well as foreign-made software by 2027. China has introduced guidelines aimed at removing US microprocessing chips in government PCs and servers, as well as sidelining Microsoft's Windows operating system and foreign-made database software in favour of domestic alternatives. The procurement guidelines mandate government agencies above the township level to prioritise \"safe and reliable\" processors and operating systems from Chinese companies, the FT first reported.China's industry ministry issued lists of chips, operating systems, and centralised databases deemed \"safe and reliable\" for three years, all sourced from Chinese companies.The move aligns with China's broader strategy of technological self-reliance, termed xinchuang or \"IT application innovation,\" particularly in the military, government, and state sectors.State-owned enterprises are directed to transition to domestic technology providers by 2027, with quarterly reporting on progress. Some foreign technology may be permitted, but the emphasis is on domestic solutions.The procurement guidelines pose a challenge to US companies like Intel, AMD, and Microsoft, potentially impacting their market presence in China.Compliance with the new guidelines is being enforced at provincial and city levels, with some flexibility for purchasing computers with foreign processors and Microsoft Windows, albeit with additional registration and explanation requirements.Substitution to domestic hardware and software is expected to progress faster in server processors compared to PCs due to a more limited software ecosystem.Analysts estimate a substantial investment requirement for replacing IT infrastructure in various sectors, highlighting the significant financial implications of China's domestic technology drive.In 2022, China consumed around 40% of all chips made globally while being only 12% self-sufficient, according to research firm GlobalData.The Semiconductor Industry Association and Boston Consulting Group predicted the semiconductor industry will double in size to more than $1trn by 2030, and China will account for approximately 60% of that growth. China has introduced guidelines aimed at removing US microprocessing chips in government PCs and servers, as well as sidelining Microsoft's Windows operating system and foreign-made database software in favour of domestic alternatives. The procurement guidelines mandate government agencies above the township level to prioritise \"safe and reliable\" processors and operating systems from Chinese companies, the FT first reported. China's industry ministry issued lists of chips, operating systems, and centralised databases deemed \"safe and reliable\" for three years, all sourced from Chinese companies. The move aligns with China's broader strategy of technological self-reliance, termed xinchuang or \"IT application innovation,\" particularly in the military, government, and state sectors. State-owned enterprises are directed to transition to domestic technology providers by 2027, with quarterly reporting on progress. Some foreign technology may be permitted, but the emphasis is on domestic solutions. The procurement guidelines pose a challenge to US companies like Intel, AMD, and Microsoft, potentially impacting their market presence in China. Compliance with the new guidelines is being enforced at provincial and city levels, with some flexibility for purchasing computers with foreign processors and Microsoft Windows, albeit with additional registration and explanation requirements. Substitution to domestic hardware and software is expected to progress faster in server processors compared to PCs due to a more limited software ecosystem. Analysts estimate a substantial investment requirement for replacing IT infrastructure in various sectors, highlighting the significant financial implications of China's domestic technology drive. In 2022, China consumed around 40% of all chips made globally while being only 12% self-sufficient, according to research firm GlobalData. The Semiconductor Industry Association and Boston Consulting Group predicted the semiconductor industry will double in size to more than $1trn by 2030, and China will account for approximately 60% of that growth. The EU announced on Monday (25 March) that it has opened an investigation into Apple, Alphabet and Meta in the first significant probe under its new Digital Markets Act (DMA) legislation. Dell has cut its workforce as part of a broader plan to reduce costs across the company, it confirmed in a filing on Monday (25 March). Qualcomm's proposed acquisition of Israeli firm Autotalks has been terminated on anti-competitive grounds in the market for vehicle-to-everything (V2X) chipsets and related products used in automotive safety systems. FundGuard, a US startup that provides asset managers with a cloud-based and AI-powered account management platform, has raised $100m in funding. Approximately 1,200 Ericsson staff in Sweden will be laid off, with negotiations initiated with unions, the company announced today (25 March). On average, 90 AI apps were built per day in 2023, indicating a significant surge in AI development, a new report from data cloud company Snowflake has found.  Python emerged as the primary programming language for AI development due to its ease of use, active developer community, and ecosystem of libraries and frameworks. In this episode, Amelia and Grace discuss how technology has exacerbated the problem of disinformation, how it is impacting business, and how companies can address the issue. Streamline your sector analysis procedures with market-leading intelligence on companies, trends, innovations, and more, all in one platform. Technology Decoded 26 Mar 2024 Technology Decoded 25 Mar 2024 Technology Decoded 22 Mar 2024 Give your business an edge with access to the latest insights for your sector. Aerospace, Defence & Security Apparel Automotive Construction Consumer Foodservice Healthcare Insurance Medical Devices Mining Oil & Gas Packaging Pharma Power Retail Sport Technology Travel and Tourism Search companies, themes, reports, as well as actionable data & insights spanning 22 global industries Access more premium companies when you subscribe to Explorer Contact the team or request a demo to find out how our data can drive your business forward "
}