{
    "title": "Hurry and get AMD Radeon RX 7900 XT for the same price as 7800 XT",
    "date": "3/15/2024",
    "url": "https://www.club386.com/hurry-and-get-amd-radeon-rx-7900-xt-for-the-same-price-as-7800-xt/",
    "text": "Savings abound! Sapphire Radeon RX 7900 XT “Doing most things right, Sapphire builds yet another impressive card with 20GB of VRAM and a respectable 2,550MHz boost clock.” We earn a commission if you make a purchase, at no additional cost to you. Remember the days of classic graphics card price cuts? I know, it was a long time ago now, before the great global chip shortage of 2020-23. Well, they’re finally back, as AMD Radeon RX 7900 XT is not only the cheapest it’s ever been, but it sits in the same price bracket as its lower-tier counterpart. Sporting a 32% discount, Sapphire Radeon RX 7900 XT Pulse is down to just $566 on Amazon US. We’ve never seen it lower and this is in the same ballpark as RX 7800 XT. Since this is all thanks to third-party store SN Cshop, the deal is sadly exclusive to North America. Funnily enough, though, Amazon US sells directly to the UK. While the £684.93 price tag remains untouched by deals, it’s also the best price we’ve spotted in the region. We gave the graphics card four stars in our Sapphire Radeon RX 7900 XT Pulse review, recommending it due to its cool and quiet approach. Our tests show it makes barely a peep over the sound of whispering, and a full load only takes it to 61°C. AMD’s Radeon software makes it easy to overclock if you want a bit more performance. It handles the extra oomph like a champ, too. I’d hedge my bets that you won’t even need to give it a helping hand, but there’s no harm in tinkering with the 2,450MHz boost clock speed. After all, it maintains 2,550MHz just fine in our lab. With 20GB GDDR6 RAM under its belt, the GPU can handle most of what you chuck at it. Rasterised performance hits triple-digit frame rates at 4K without breaking a sweat. Final Fantasy XIV: Endwalker reaches as high as 118fps, Forza Horizon 5 sits at 104fps, and Rainbow Six Extraction skyrockets all the way to 246fps. This is more impressive knowing these stats are all with ultra settings enabled and no help from upscalers. Consuming a modest 458W isn’t a nightmare for your energy bill, either. Simply plug and play without breaking the bank. This deal likely won’t last forever, even more so because it’s from a third-party storefront. I recommend you act quickly if you’re interested. Fortunately, Amazon Prime subscriptions still work here. You could play with your new GPU as soon as tomorrow with next-day delivery. We’re hopeful we’ll see more graphics card discounts in the future, but they’re still few and far between. We should know; we search for deals every week. You can keep up to date with our findings by following us on Twitter or Facebook or subscribing to our free weekly newsletter. AIO\nAlder Lake\nAMD\nAOC\nApple\nArc\nASRock\nAsus\nBusiness\nCES\nchassis\nCooler\ncooling\nCorsair\nCPU\nDDR5\ndeals\nDrivers\ngaming\nGeForce\nGigabyte\nGPU\nhandheld\nIntel\nKeyboard\nLaptop\nM.2\nmemory\nMicrosoft\nmods\nmonitor\nMotherboard\nMSI\nNvidia\nPlayStation\nPSU\nRadeon\nRTX\nRTX 40-series\nRyzen\nSamsung\nSony\nSSD\nWindows 11\nXbox About | Contact | Editorial Policies | News Tip Advertise | Privacy | Newsletter | Donate "
}