{
    "title": "Dell's stock gets an Nvidia bump, but AMD shares among chip names under \npressure",
    "date": "3/19/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240319122/dells-stock-gets-an-nvidia-bump-but-amd-shares-among-chip-names-under-pressure",
    "text": "By Emily Bary Here's which stocks are rising after being in Nvidia's halo - and which are making Wall Street worried in the wake of latest chip announcements It might not be much in the grand scheme of Nvidia Corp.-fueled stock bumps - but given the selloff today in artificial-intelligence stock plays, Dell Technologies Inc.'s move higher stands out. Shares of Dell (DELL) are up 1.5% in afternoon trading, while shares of other AI-linked companies like Advanced Micro Devices Inc. (AMD), Arm Holdings PLC (ARM), Marvell Technology Inc. (MRVL) and Intel Corp. (INTC) are all falling. Nvidia Chief Executive Jensen Huang mentioned plenty of partners during his GTC keynote late Monday, but Dell received a special shoutout: Huang pointed to Dell CEO Michael Dell in the crowd and highlighted their friendship and partnership. Read: Nvidia's stock shrugs off its 'Taylor Swift' moment. Here's why bulls are still cheering. Dell was the \"only big hardware/server company specifically called out by [Nvidia's] CEO as a key partner,\" Mizuho Securities desk-based analyst Jordan Klein wrote in a note to clients. He wondered if that meant Dell would end up getting better supply than its peers of Nvidia's graphics processing units. Other stocks seemed to be getting Nvidia bumps, as well. Shares of Cadence Design Systems Inc. (CDNS) were up 3.6% in afternoon trading, after Nvidia mentioned its partnership with the electronic-design-automation company. Nvidia also called out design company Ansys Inc. (ANSS), whose shares were seeing a boost alongside those of Synopsys Inc. (SNPS), which plans to acquire Ansys. While Nvidia shares had erased their losses and were trading up fractionally Tuesday, shares of many rivals were seeing drops. Case in point: AMD, one of the S&P 500's SPX worst daily performers with a roughly 5% drop as of midday. AMD's selloff reflects competitive fears that the company's MI300 chip \"now looks a lot more pedestrian\" after Nvidia talked up the potential of its B100 for inference purposes, according to Mizuho's Klein. Inference is \"where MI300 [is] best positioned,\" he said. Shares of Marvell and Coherent Corp. (COHR) were each off about 2%. Nvidia's NVLink announcements could be sparking fears that Nvidia technology eventually \"displaces some of the content from optical leaders,\" Klein said. -Emily Bary This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 03-19-24 1352ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}