{
    "title": null,
    "date": "3/6/2024",
    "url": "https://finbold.com/we-asked-chatgpt-4-what-will-amd-stock-price-be-at-end-of-2024/",
    "text": "While when it comes to the technology sector, all eyes have arguably been on Nvidia (NASDAQ: NVDA) and Super Micro Computer (NASDAQ: SMCI), the other major semiconductor stock – Advanced Micro Devices (NASDAQ: AMD) – should certainly not be shunned by investors. AMD shares had a massive one-day surge at the very start of March, following a prolonged preparatory phase and spurred on by a string of positive developments and new technology announcements from the company. Advanced Micro Devices’ prospects were, however, subsequently dampened as the U.S. government took exception to the chipmaker’s new China-bound microchips, leading to a significant slowdown to the uptrend and fears that a correction might be inbound. With the positive and negative developments for AMD in mind, FInbold decided to consult the most advanced model of OpenAI’s flagship artificial intelligence (AI) platform – ChatGPT – on what the rest of 2024 might have in store for Advanced Micro Devices. When asked about AMD, ChatGPT appeared immediately rather positive on the company and its stock. The AI quickly pointed toward the recent developments and new microchip models and, once combined with recent market trends, concluded that the firm is likely to see growth in the coming months. ChatGPT’s price forecast, however, wasn’t as bullish as the initial assessment might have suggested, and the AI opted for a range between $215 and $230 for AMD. After being pressed to settle on a specific price for Advanced Micro Devices at the end of the year, ChatGPT-4 decided that $222.50 feels the most likely. A prompt demanding the AI make a strong bullish case – and an accompanying forecast – saw the advanced model focus on the possibility AMD’s newest units will see widespread adoption and the chance that AMD might come out with some groundbreaking new technology. A scenario such as this could see Advanced Micro Devices shares, according to ChatGPT-4, find themselves priced at $250 in the stock market on December 31, 2024. After also focusing on the dangers of a wider economic downturn or supply chain issues – which are not unlikely given the ongoing situation in the Red Sea – and reflecting on competitive pressure from the blue-chip chipmaker Nvidia, ChatGPT concluded that a bear scenario could see AMD drop as low $180 by the end of the year. No matter the future forecasts, the present state of AMD shares speaks volumes about the company’s recent successes. In the last 52 weeks, Advanced Micro Devices stock surged 152.75%, and it continued skyrocketing in 2024 as it is 48.02% in the green year-to-date (YTD). The more recent trend is also broadly positive, with AMD stock rising 22.19% in the last 30 days. The latest full trading day, however, saw a slight decline of 0.11%, with Advanced Micro Devices shares closing at $205.13. Buy stocks now with eToro – trusted and advanced investment platform Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}