{
    "title": "TechCrunch Minute: Why the AI world is gathering at Nvidia's GTC 2024 event \nthis week",
    "date": "3/18/2024",
    "url": "https://sg.news.yahoo.com/techcrunch-minute-why-ai-world-160059115.html",
    "text": "Chip giant Nvidia is hosting a massive AI conference as part of its GTC event this week, which kicks off Monday. With a keynote planned from Jensen Huang, CEO and co-founder, of the company best known in year's past for its gaming hardware and today for its massive market share in the burgeoning AI hardware market, expect Nvidia to make some news. But there's a host of other AI companies planning on making an appearance. Given how many AI startups and giants alike use Nvidia gear, TechCrunch is expecting quite a lot to shake loose over the next few days. To presage the confab, and detail just why we're paying such close attention to a single company's industry event, hit play below. Stick close to TechCrunch for coverage throughout the week. [youtube https://www.youtube.com/watch?v=aimuUpHvWII?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent&w=640&h=360] A new rumor suggests Apple will use a glossy titanium finish instead of a brushed one on its next iPhone. I want Apple to focus on the core iPhone experience, not lean into generative AI.  Revenue at Chinese telecom rose 10% as net profit more than doubles Phone companies are experiencing a rise in sales of “dumbphones” as parents become more wary of the dangers of social media for children. Apple's new Reasons to Upgrade page is one tool to use when considering whether you need a new iPhone. But here's what our managing editor for mobile looks at when weighing whether it's time for a new phone.  Telecom company AT&T said on Saturday that it is investigating a data set released on the \"dark web\" about two weeks ago, and said that its preliminary analysis shows it has impacted approximately 7.6 million current account holders and 65.4 million former account holders.  The company said the data set appears to be from 2019 or earlier.  AT&T said it does not have evidence of unauthorized access to its systems resulting from the incident. Fifteen years after it was created, the messaging app runs the world. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" New agile US Marine formations are learning how to battle adversaries like China on remote islands, according to The Washington Post.  In this week’s travel roundup we bring you transport trivia, Roman engineering marvels and the world’s tastiest dumpling. When Sam* married her husband, she never imagined that 20 years on, she'd have not one, but two affairs... Dini von Mueffling is a PR professional in New York City's who's worked with Monica Lewinsky and Virginia Giuffre. If given HK$8 million to spend, Yat says he would invest in digital assets such as non-fungible tokens Tim Cook's days start before 5 a.m., and his mornings are filled with emails, strength training, and coffee. I tried out the Apple CEO's schedule. The post Bites by Ann Chin: Michelin popiah, loaded waffles & local bites in hole-in-wall eatery appeared first on SETHLUI.com. The visibly upset MSNBC anchor was responding to the Trump's attack on Judge Juan Merchan's daughter despite gag orders The post Nicole Wallace Gets Fed Up, Tosses Script While Covering Latest Trump Attack: ‘What Are We Going to Do Different?’ | Video appeared first on TheWrap. Play this game for 1 minute and see why everyone is addicted. City Developments Limited ( SGX:C09 ), is not the largest company out there, but it received a lot of attention from a... A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. The post Chi Huo 吃货: Super value rice bowls with braised pork, fried ebi & teriyaki chicken from $4.50 appeared first on SETHLUI.com. "
}