{
    "title": "'There is a battle looming in 2024': Qualcomm wants to become 'the Nvidia \nof AI' on your smartphone and computer",
    "date": "3/9/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240309353/there-is-a-battle-looming-in-2024-qualcomm-wants-to-become-the-nvidia-of-ai-on-your-smartphone-and-computer",
    "text": "By Ryan Shrout All the major players are trying to surf this next wave of AI, including Intel, Nvidia, AMD and Arm Holdings In the world of artificial intelligence and the computing infrastructure that powers AI, there is only one king: Nvidia (NVDA). The company has skyrocketed to one of the largest in the world on the back of its success leading the transition to an AI computing ecosystem. It has a dominant hold on the chips that power the data centers and servers that enable companies such as Microsoft (MSFT), Amazon.com (AMZN), and Alphabet (GOOGL) to deliver AI services. But Nvidia's position of strength is limited to servers and data centers. There is an emerging battle for the AI market at the edges, defined as a combination of laptops, smartphones, and individual consumer and commercial devices. It is on these devices where this AI content will be consumed. This segment is still in play, with combatants ranging from Intel (INTC) to AMD (AMD) to Qualcomm (QCOM), and yes even Nvidia with its gaming and mobile graphics chips. Everyone is fighting to control what most believe is the next growth frontier for AI and for chips to power it. Who will become the NVIDIA of edge AI? AI computing on local devices will drive the need for more data and bandwidth consumption. Having the best wireless technology is critical. Qualcomm is in a unique position of opportunity with AI at the edge, thanks to a combination of its communication background, strong investment in new computing architectures, and an initiative to create a software springboard to rival what Nvidia did with CUDA all those years ago. Though Qualcomm and CEO Cristiano Amon consistently refer to the company's transition from a communications to a computing company, its heritage and leadership in communications is often undervalued. AI computing on local devices will drive the need for more data and bandwidth consumption. Qualcomm's lead in modems and wireless technology is an advantage that is often overlooked. Having the best wireless technology is critical. Qualcomm recently unveiled its newest cellular modem called the Snapdragon X80 5G, as well as a new FastConnect 7900 chip that combines the latest Wi-Fi, Bluetooth, and wideband technologies. These will get integrated into the highest-performance smartphones next year, as well as high-end laptops. Qualcomm's lead in modems and wireless technology is an advantage that is often overlooked. If Qualcomm wants to do in the consumer and device AI space what Nvidia has done for the data center, it will take a significant effort in the form of software. Nvidia's CUDA is a combination of software development tools, drivers, pre-configured and updated models that make writing software for its GPUs as simple as possible. Software that is developed using CUDA is more likely to be deployed at scale on those same architectures in the cloud. Another move that Qualcomm recently made is the introduction of its AI Hub, a toolset of its own for deploying and optimizing AI for its processors. This takes Qualcomm beyond just enabling on-stage demos and promotional content for social media. It's a developer engagement platform that provides a simple way to integrate tools and instructions to make sure the most important AI models run on Snapdragon hardware and run in an optimized, maximum-performance state. The Qualcomm AI Hub currently offers more than 75 unique AI models that are ready for software teams to integrate and it supports the Snapdragon chips for smartphones, laptops and even automobiles. The company hopes that by making integration and support of its chips as easy as possible, it can entice developers to target its hardware with emerging applications that will be a part of the AI revolution at the edge and create the same inherent advantage that Nvidia has with CUDA. The third piece to this is about the hardware itself. In the smartphone market, Snapdragon is the clear leader in market share and performance, powering most of the highest-end devices like the Samsung Galaxy S24 Ultra. This leadership position means that Android-application developers will  need to target Qualcomm chips for any AI computing. The company has also teased that its latest CPU core architecture, called Oryon and stemming from its Nuvia acquisition a few years back, will be coming soon to its smartphone chips as well, keeping Qualcomm in the driver's seat in this market. For the upcoming AI PC boom that most are projecting to happen in the second half of this year and into 2025, even though Qualcomm has minimal market share today, the Snapdragon X Elite platform announced in October 2023 offers more than four times the AI performance of the currently shipping chips from Intel or AMD. The first laptops featuring this chip won't be available until June, but all indications are that Qualcomm has some incredibly influential design wins and system partners that will raise eyebrows and drive some impressive volume in the market. Intel, AMD and Nvidia won't go down without a fight of course, and Qualcomm has a steep hill to climb in the PC space. It's clear to me that there is a battle looming in 2024 for the mind share and wallets of consumers looking to bring AI to their phones, laptops, and almost everything else at the edge. Every consumer technology company is trying to surf this next wave of AI, including Intel, Nvidia, AMD, Arm Holdings (ARM), Qualcomm and smaller startups like MemryX or Rabbit. With its strength in the smartphone market, a growing portfolio of products for PCs, and a new software initiative that will drive developer adoption, Qualcomm has a solid foothold here. Ryan Shrout is president of Signal65 and founder at Shrout Research. Follow him on X @ryanshrout. Shrout has provided consulting services for AMD, Qualcomm, Intel, Arm Holdings, Micron Technology, Nvidia and others. Shrout holds shares of Intel. More: It's not just Nvidia: These companies are finally making real money from AI Also read: The AI smartphone is here. 3 things you need to know. -Ryan Shrout This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 03-09-24 1255ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}