{
    "title": "AMD Ryzen 9 7940HS vs Intel Core i7-12650H vs AMD Ryzen 7 7840S",
    "date": "3/27/2024",
    "url": "https://www.notebookcheck.net/R9-7940HS-vs-i7-12650H-vs-R7-7840S_14946_14051_15098.247596.0.html",
    "text": "The Ryzen 9 7940HS is a powerful Phoenix family APU that saw the light of day in H1 2023. Its 8 cores are powered by the Zen 4 architecture and are SMT-enabled for a total of 16 processing threads. 4.0 GHz is the base clock speed and the highest Boost clock speed achievable is 5.2 GHz. \nThe 7940HS introduces Ryzen AI which is AMD's answer to Intel's DL Boost and GNA technologies. The Radeon 780M serves as the integrated graphics adapter. \nArchitecture & Features \nPhoenix family chips are powered by the Zen 4 architecture, much like Dragon Range family chips are. The latter however lacks hardware AI workload acceleration capabilities that Phoenix has. Ryzen AI is set to give applications such as DaVinci Resolve and Photoshop quite a bit of generative AI magic. \nMore importantly, Zen 4 introduces AVX512 support (which Zen 3 chips did not have) and, thanks to a plethora of other improvements including larger caches/registers/buffers across the board, is slated to bring a double-digit IPC improvement. \nThe 7940HS has 16 MB of L3 cache and support for super-fast RAM (up to LPDDR5x-7500 or DDR5-5600, including ECC-enabled memory). The processor is compatible with USB 4 and thus with Thunderbolt; PCIe support is limited to the 4.0 spec for a throughput of 1.97 GB/s per lane. \nOS support is limited to 64-bit editions of Windows 11 and Windows 10 and of course to Linux. Note that the chip isn't overclockable and neither is it user-replaceable as it gets soldered down for good (FP7, FP7r2, FP8 socket interfaces). \nPerformance \nThe average 7940HS in our database is in the same league as the Core i9-12900HK and also, somewhat disappointingly, the Ryzen 7 7840HS, as far as multi-thread benchmark scores are concerned. \nThanks to its decent cooling solution and a long-term CPU power limit of 80 W, the ROG Zephyrus G14 GA402XY is among the fastest laptops built around the 7940HS that we know of. It can be about 15% faster in CPU-bound workloads than the slowest system featuring the same chip in our database, as of August 2023. \nGraphics \nThe Radeon 780M has 12 CUs (768 shaders) running at up to 2,800 MHz. This is a very fast iGPU, as of late 2023. It will let you use up to 4 monitors with resolutions as high as SUHD 4320p, and it is also capable of HW-encoding and HW-decoding most video codecs including AVC, HEVC and AV1, but more importantly it is fast enough for proper 1080p gaming as long as one is fine with low to medium detail settings. \nYour mileage may vary depending on how high the CPU power limits are, how competent the cooling solution of the system is, how fast the RAM of the system is (there is no dedicated VRAM). \nPower consumption \nThis Ryzen 9 series chip has a long-term power limit (default TDP) of 35 W to 54 W, giving laptop makers a choice between longer battery life and higher performance. Either way, an active cooling solution is a must for a system powered by this chip. \nThe 7940HS is built with TSMC's 4 nm process for high, as of late 2023, energy efficiency. The Ryzen 9 7940HS is a powerful Phoenix family APU that saw the light of day in H1 2023. Its 8 cores are powered by the Zen 4 architecture and are SMT-enabled for a total of 16 processing threads. 4.0 GHz is the base clock speed and the highest Boost clock speed achievable is 5.2 GHz. The 7940HS introduces Ryzen AI which is AMD's answer to Intel's DL Boost and GNA technologies. The Radeon 780M serves as the integrated graphics adapter. Architecture & Features Phoenix family chips are powered by the Zen 4 architecture, much like Dragon Range family chips are. The latter however lacks hardware AI workload acceleration capabilities that Phoenix has. Ryzen AI is set to give applications such as DaVinci Resolve and Photoshop quite a bit of generative AI magic. More importantly, Zen 4 introduces AVX512 support (which Zen 3 chips did not have) and, thanks to a plethora of other improvements including larger caches/registers/buffers across the board, is slated to bring a double-digit IPC improvement. The 7940HS has 16 MB of L3 cache and support for super-fast RAM (up to LPDDR5x-7500 or DDR5-5600, including ECC-enabled memory). The processor is compatible with USB 4 and thus with Thunderbolt; PCIe support is limited to the 4.0 spec for a throughput of 1.97 GB/s per lane. OS support is limited to 64-bit editions of Windows 11 and Windows 10 and of course to Linux. Note that the chip isn't overclockable and neither is it user-replaceable as it gets soldered down for good (FP7, FP7r2, FP8 socket interfaces). Performance The average 7940HS in our database is in the same league as the Core i9-12900HK and also, somewhat disappointingly, the Ryzen 7 7840HS, as far as multi-thread benchmark scores are concerned. Thanks to its decent cooling solution and a long-term CPU power limit of 80 W, the ROG Zephyrus G14 GA402XY is among the fastest laptops built around the 7940HS that we know of. It can be about 15% faster in CPU-bound workloads than the slowest system featuring the same chip in our database, as of August 2023. Graphics The Radeon 780M has 12 CUs (768 shaders) running at up to 2,800 MHz. This is a very fast iGPU, as of late 2023. It will let you use up to 4 monitors with resolutions as high as SUHD 4320p, and it is also capable of HW-encoding and HW-decoding most video codecs including AVC, HEVC and AV1, but more importantly it is fast enough for proper 1080p gaming as long as one is fine with low to medium detail settings. Your mileage may vary depending on how high the CPU power limits are, how competent the cooling solution of the system is, how fast the RAM of the system is (there is no dedicated VRAM). Power consumption This Ryzen 9 series chip has a long-term power limit (default TDP) of 35 W to 54 W, giving laptop makers a choice between longer battery life and higher performance. Either way, an active cooling solution is a must for a system powered by this chip. The 7940HS is built with TSMC's 4 nm process for high, as of late 2023, energy efficiency. The Intel Core i7-12650H is a high-end mobile CPU for laptops based on the Alder Lake architecture. It was announced in early 2022 and offers 6 performance cores (P-cores, Golden Cove architecture) and 4 of the 8 efficient cores (E-cores, Gracemont architecture). The P-cores support Hyper-Threading leading to 16 supported threads when combined with the E-cores. The clock rate ranges from 2.3 to 4.7 GHz on the performance cluster and 1.7 to 3.5 GHz on the efficient cluster. The performance of the E-cores should be similar to old Skylake cores (compare to the Core i7-6700HQ). All cores can use up to 24 MB L3 cache. Compared to the 12700H, the 12650H offers only 4 instead of 8 E-cores, a slower iGPU and no vPro features (for remote management). \nPerformance \nThe average 12650H in our database is in the same league as the Core i9-11950H, Ryzen 5 7640HS, Ryzen 9 5900HS, as far as multi-thread benchmark scores are concerned. This is a very good result, as of early 2023. \nThanks to its decent cooling solution and a long-term CPU power limit of 80 W, the TUF Dash F15 FX517ZR is among the fastest laptops built around the 12650H that we know of. It can be more than 25% faster in CPU-bound workloads than the slowest system featuring the same chip in our database, as of August 2023. \nFeatures \nThe integrated memory controller supports various memory types up to DDR5-4800, DDR4-3200, LPDDR5-5200, and LPDDR4x-4267. The Thread Director (in hardware) can support the operating system to decide which thread to use on the performance or efficient cores for the best performance. For AI tasks, the CPU also integrates GNA 3.0 and DL Boost (via AVX2). Quick Sync in version 8 is the same as in the Rocket Lake CPUs and supports MPEG-2, AVC, VC-1 decode, JPEG, VP8 decode, VP9, HEVC, and AV1 decode in hardware. The CPU only supports PCIe 4.0 (x8 for a GPU and two x4 for SSDs). \nThe integrated graphics card is based on the Xe-architecture and offers 64 of the 96 EUs (Execution Units) operating at up to 1.4 GHz. \nPower consumption \nThis Core i7 has a \"minimum assured\" power consumption of 35 W, with 45 W being its Base power consumption. The processor's maximum Intel-recommended Turbo power consumption sits at 115 W. It would take at least two fans to cool such a beast. \nLast but not the least, Intel Core i7-12650H is built with Intel's fourth-generation 10 nm process marketed as Intel 7 for OK, as of early 2023, energy efficiency. The Intel Core i7-12650H is a high-end mobile CPU for laptops based on the Alder Lake architecture. It was announced in early 2022 and offers 6 performance cores (P-cores, Golden Cove architecture) and 4 of the 8 efficient cores (E-cores, Gracemont architecture). The P-cores support Hyper-Threading leading to 16 supported threads when combined with the E-cores. The clock rate ranges from 2.3 to 4.7 GHz on the performance cluster and 1.7 to 3.5 GHz on the efficient cluster. The performance of the E-cores should be similar to old Skylake cores (compare to the Core i7-6700HQ). All cores can use up to 24 MB L3 cache. Compared to the 12700H, the 12650H offers only 4 instead of 8 E-cores, a slower iGPU and no vPro features (for remote management). Performance The average 12650H in our database is in the same league as the Core i9-11950H, Ryzen 5 7640HS, Ryzen 9 5900HS, as far as multi-thread benchmark scores are concerned. This is a very good result, as of early 2023. Thanks to its decent cooling solution and a long-term CPU power limit of 80 W, the TUF Dash F15 FX517ZR is among the fastest laptops built around the 12650H that we know of. It can be more than 25% faster in CPU-bound workloads than the slowest system featuring the same chip in our database, as of August 2023. Features The integrated memory controller supports various memory types up to DDR5-4800, DDR4-3200, LPDDR5-5200, and LPDDR4x-4267. The Thread Director (in hardware) can support the operating system to decide which thread to use on the performance or efficient cores for the best performance. For AI tasks, the CPU also integrates GNA 3.0 and DL Boost (via AVX2). Quick Sync in version 8 is the same as in the Rocket Lake CPUs and supports MPEG-2, AVC, VC-1 decode, JPEG, VP8 decode, VP9, HEVC, and AV1 decode in hardware. The CPU only supports PCIe 4.0 (x8 for a GPU and two x4 for SSDs). The integrated graphics card is based on the Xe-architecture and offers 64 of the 96 EUs (Execution Units) operating at up to 1.4 GHz. Power consumption This Core i7 has a \"minimum assured\" power consumption of 35 W, with 45 W being its Base power consumption. The processor's maximum Intel-recommended Turbo power consumption sits at 115 W. It would take at least two fans to cool such a beast. Last but not the least, Intel Core i7-12650H is built with Intel's fourth-generation 10 nm process marketed as Intel 7 for OK, as of early 2023, energy efficiency. The AMD Ryzen 7 7840S is a fast high-end laptop processor of the Phoenix series. It offers 8 cores (octa core) based on the Zen 4 architecture that supports hyperthreading (16 threads). The cores clock from 3.8 (base) up to 5.1 GHz (single core boost). The processor includes 8 MB L2 cache and 16 MB L3 cache. The processor is exclusively available in Lenovo laptops but the specs are similar to the regular Ryzen 7 7840HS. \nThe performance of the R7 7840S is only slightly below the fastest model, the R9 7940HS, as the clock speed difference is only minimal (e.g. -100 MHz / 2% slower single core boost). Therefore, the CPU should also perform slightly higher than the old top model Ryzen 9 6980HX (8 Zen 3 cores with up to 4.9 GHz) at 54W TDP and Ryzen 9 6980HS at 35W TDP. Compared to the higher end Dragon Range series, the 7840HS should be similar to the Ryzen 7 7745HX (also 8 Zen 4 cores, max 5.1 GHz, 55W TDP, 32 MB L3). \nThe chip integrates a modern and fasts RDNA 3 graphics card (iGPU) called Radeon 780M with 12 CUs and up to 2.7 GHz clock speed. Furthermore, the Phoenix series include a video engine with AV1 de- and encoding, a new Xilinx FPGA based XDNA AI accelerator (Ryzen AI) that should be faster than the AI engine in the Apple M2 SOC and a dual-channel DDR5-5600 / LPDDR5x-7500 memory controller (with ECC support). The connectivity features includes 2 possible USB 4 (40 Gbps) ports and 20 PCIe 4.0 lanes for a GPU and SSDs. \nThe Phoenix series uses a single monolithic design (unlike the chiplet design of the 7045HX series) and is manufactured in the modern 4nm process at TSMC. The TDP can be configured between 35 and 45 Watt. The AMD Ryzen 7 7840S is a fast high-end laptop processor of the Phoenix series. It offers 8 cores (octa core) based on the Zen 4 architecture that supports hyperthreading (16 threads). The cores clock from 3.8 (base) up to 5.1 GHz (single core boost). The processor includes 8 MB L2 cache and 16 MB L3 cache. The processor is exclusively available in Lenovo laptops but the specs are similar to the regular Ryzen 7 7840HS. The performance of the R7 7840S is only slightly below the fastest model, the R9 7940HS, as the clock speed difference is only minimal (e.g. -100 MHz / 2% slower single core boost). Therefore, the CPU should also perform slightly higher than the old top model Ryzen 9 6980HX (8 Zen 3 cores with up to 4.9 GHz) at 54W TDP and Ryzen 9 6980HS at 35W TDP. Compared to the higher end Dragon Range series, the 7840HS should be similar to the Ryzen 7 7745HX (also 8 Zen 4 cores, max 5.1 GHz, 55W TDP, 32 MB L3). The chip integrates a modern and fasts RDNA 3 graphics card (iGPU) called Radeon 780M with 12 CUs and up to 2.7 GHz clock speed. Furthermore, the Phoenix series include a video engine with AV1 de- and encoding, a new Xilinx FPGA based XDNA AI accelerator (Ryzen AI) that should be faster than the AI engine in the Apple M2 SOC and a dual-channel DDR5-5600 / LPDDR5x-7500 memory controller (with ECC support). The connectivity features includes 2 possible USB 4 (40 Gbps) ports and 20 PCIe 4.0 lanes for a GPU and SSDs. The Phoenix series uses a single monolithic design (unlike the chiplet design of the 7045HX series) and is manufactured in the modern 4nm process at TSMC. The TDP can be configured between 35 and 45 Watt. #0 checking url part for id 14946 +0s ... 0s #1 checking url part for id 14051 +0s ... 0s #2 checking url part for id 15098 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.04s ... 0.041s #6 did output specs +0s ... 0.041s #7 getting avg benchmarks for device 14946 +0.017s ... 0.058s #8 got single benchmarks 14946 +0.047s ... 0.105s #9 getting avg benchmarks for device 14051 +0.016s ... 0.121s #10 got single benchmarks 14051 +0.063s ... 0.184s #11 getting avg benchmarks for device 15098 +0.013s ... 0.197s #12 got single benchmarks 15098 +0.008s ... 0.204s #13 got avg benchmarks for devices +0s ... 0.204s #14 min, max, avg, median took s +0.495s ... 0.7s #15 return log +0s ... 0.7s "
}