{
    "title": "Chinese brand VASTARMOR launches Radeon RX 7900 XTX Super Alloy, highest \n7900 XTX boost clock",
    "date": "3/28/2024",
    "url": "https://www.tweaktown.com/news/97201/chinese-brand-vastarmor-launches-radeon-rx-7900-xtx-super-alloy-highest-boost-clock/index.html",
    "text": "VASTARMOR has just launched their new Radeon RX 7900 XTX Super Alloy graphics card, around 4 months after the Chinese company first unveiled the new RX 7900 XTX design. Check it out: VASTARMOR's new RX 7900 XTX Super Alloy graphics card (source: VASTARMOR) The new VASTARMOR Radeon RX 7900 XTX Super Alloy features the highest GPU boost clock of any RX 7900 XTX on the market, with 2680MHz out of the box. This means VASTARMOR's new RX 7900 XTX Super Alloy graphics card has a higher boost clock than Navi 31 is capable of. This is the same 2680MHz that we find on the ASRock Taichi and Aqua cards, PowerColor's Liquid Devil, and SAPPHIRE's NITRO+ variants. VASTARMOR's new card is a chunky boi, measuring in at a large 33cm long and 6.9cm thick, which makes it one of the biggest graphics cards on the market. The company includes a triple-fan cooler, with ARGB lighting, too. Pricing kicks off at 6799 RMB (around $940 USD), which means it's considerably cheaper than the MSRP of the AMD Radeon RX 7900 XTX, which was priced at 7999 RMB. VASTARMOR's new RX 7900 XTX Super Alloy graphics card (source: VASTARMOR) VASTARMOR offers a slightly cheaper model at 200 RMB less, but you'll have lower GPU clocks, and it'll drop the RGB lighting for the \"Starry Sky\" model. Starry Sky... without RGB lighting, feels like a weird name, but that's just me. VASTARMOR's new RX 7900 XTX Super Alloy graphics card (source: VASTARMOR) The backplate on the VASTARMOR Radeon RX 7900 XTX Super Alloy graphics card doesn't look too bad at all, but that huge cooler will be a concern for gamers that don't have the room inside of their chassis to fit in this thick, and long graphics card. Anthony Garreffa Anthony joined the TweakTown team in 2010 and has since reviewed 100s of graphics cards. Anthony is a long time PC enthusiast with a passion of hate for games built around consoles. FPS gaming since the pre-Quake days, where you were insulted if you used a mouse to aim, he has been addicted to gaming and hardware ever since. Working in IT retail for 10 years gave him great experience with custom-built PCs. His addiction to GPU tech is unwavering and has recently taken a keen interest in artificial intelligence (AI) hardware. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}