{
    "title": "AMD Radeon RX 8800 XT “RDNA 4” Specs, Release Date and Pricing Rumors",
    "date": "3/14/2024",
    "url": "https://www.hardwaretimes.com/amd-radeon-rx-8800-xt-rdna-4-specs-release-date/",
    "text": "AMD is expected to unveil its next-gen Ryzen 9000 (Zen 5) CPUs and Radeon RX 8000 (RDNA 4) GPUs at Computex in June. The Radeon RX 8800 XT will allegedly lead Team Red’s gaming GPU family. There have been several leaks and rumors about this budget RDNA 4 GPU. Here’s everything we know about the Radeon RX 8800 XT, from specifications to release date and pricing. Table of Contents According to the YouTuber Moore’s Law is Dead, the Radeon RX 8800 XT will be nearly as fast as the GeForce RTX 4080/RX 7900 XTX. Based on the 4nm Navi 48 (N4P) GPU, it will have a die area of 350mm2 and a 256-bit wide memory bus. If AMD opts for GDDR7 memory chips, then you can expect a lofty boost in bandwidth. Otherwise, much of the generation uplift will come from IPC and clock upgrades. Speaking of clocks, the Radeon RX 8800 XT is expected to attain boost clocks of nearly 3.4 to 3.5GHz. Tom from MLID recently shared that RDNA 4 engineering samples are already boosting between 3GHz and 3.3GHz. For reference, The RX 7900 XTX peaks at 2499MHz, while the 7900 XT has a ceiling of 2394 MHz. The RDNA 4 SIMD will allegedly include a Tensor core equivalent (matrix unit) and FP8 units for accelerating AI workloads. While RDNA 3 also features AI cores, they’re actually repurposed SIMDs used for WMMA instructions. There’s no info on the core counts or the memory bus. Simple guesswork points to a shader count of 3840 to 4608, and a 16GB memory buffer, backed by 64MB of L3 cache. Being a mid-range graphics card, the Radeon RX 8800 XT will likely be priced at $500, with the capabilities of the RX 7900 XT/XTX (~$900-$999). There’s no concrete info on the RDNA 4 release date. The AMD CEO is set to deliver the Computex 2024 keynote, and there’s a chance that we’ll get a teaser, but that’s about it. The actual launch likely won’t happen before Q3, or maybe even Q4. Some rumors claim an early 2025 release window for the RDNA 4 GPUs. Further reading: "
}