{
    "title": "Mysterious Huawei CPU test results emerge online and you're in for a shock \n— if true, the improvements mean that ...",
    "date": "3/2/2024",
    "url": "https://www.techradar.com/pro/mysterious-huawei-cpu-test-results-emerge-online-and-youre-in-for-a-shock-if-true-the-improvements-mean-that-huawei-is-not-far-behind-amd-epyc-or-intel-xeon",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Geekbench 6 results make for interesting reading Benchmark results for Huawei's HiSilicon Taishan V120 server CPU have unexpectedly surfaced online, revealing a performance surprisingly on par with AMD's Zen 3 cores from four years ago. The results, found on Geekbench here and here, suggest that Huawei's chip technology may not be far behind leading CPU manufacturers, AMD and Intel. As Tom’s Hardware reports, the Taishan V120 core, from Huawei's HiSilicon subsidiary, was first spotted in Huawei's Kirin 9000s smartphone chip. The new Geekbench 6 results, which were uploaded a few days ago, indicate that the Taishan V120 core is likely manufactured on the second-generation 7nm node, as is the case with the Kirin 9000s chips. The exact CPU model tested remains a mystery however, with the only clue being \"Huawei Cloud OpenStack Nova\" on the benchmark pages. This suggests it could be a Kunpeng server CPU, possibly the Kunpeng 930, given its high single-core performance. The Kunpeng 930 has been relatively elusive since its announcement in 2019. A 2021 report speculated a launch that year on TSMC's 5nm, with the Kunpeng 950 following in 2023 on TSMC's 3nm node. However, these plans were likely abandoned due to Huawei's ban from manufacturing at TSMC. The benchmarks were run on a single core, implying that the chip may have been tested on a virtual machine or a similar configuration. Therefore, the multi-core score may not accurately reflect the chip's overall performance. In the single-core score benchmark, the Taishan V120 CPU scored 1,527, slightly behind AMD’s Epyc 7413 at 1,538 and Intel’s Xeon E-2136 at 1,553. It was significantly outperformed by the Epyc 9554, which scored 1,957, and the Xeon w9-3495X, which led the pack with a score of 2,087. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! As Tom’s Hardware points out, without data on multi-threaded performance, power consumption, and efficiency, it's hard to gauge the competitiveness of Taishan V120 cores. Regardless of speed, high power consumption could deter potential users due to the cost of electricity. Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. Samsung archrival plans construction of world's largest chip factory — at more than $90 billion, it will take more than 20 years to finish, so one wonders what other exciting tech will it produce This is what a single 256GB DDR5 memory module looks like — but you won't be able to fit this Micron RAM in your desktop or laptop and it will almost certainly cost more than $10,000 if you can buy it Microsoft's repair-friendly Surface puts other laptop makers on notice – and it's about time By Sead FadilpašićMarch 29, 2024 By Al GriffinMarch 29, 2024 By Cesar CadenasMarch 29, 2024 By Alex WhitelockMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}