{
    "title": "Bitume Québec takes note of the Girard 2024-2025 budget, which does not \nguarantee the current capacity to make up ...",
    "date": "3/13/2024",
    "url": "https://finance.yahoo.com/news/bitume-qu-bec-takes-note-110000141.html",
    "text": "MONTREAL, March 13, 2024 /CNW/ - Referring to the recent conclusions of the Auditor General of Québec (AGQ) report on road investments and the asset maintenance deficit of the superior road network (AMD), Bitume Québec said today that it is simply taking note of the Quebec government's 2024-2025 budget, which it hopes will help consolidate the ability to make up for the road network's asset maintenance deficit (AMD), despite the absence of a significant increase in road investments. At the current rate of progress, this deficit is likely to exceed $17.5 billion by 2027. Recognizing that the Minister of Finance, Éric Girard, has inherited, at the start of 2024, a financial reality quite different from that which drove his first budget assumptions, which had not realistically taken into account the impacts of an economic slowdown that is now evident, Bitume Québec believes that, more than ever, the road maintenance industry has a duty to proclaim the relevance of sustained, recurring and, above all, greater road investments, in accordance with the wishes expressed by the Auditor General of Quebec (AGQ). Bitume Québec also hopes that the announcement of additional investments of $3 billion over 10 years in the $153 billion Quebec Infrastructure Plan 2024-2034 (PQI) will not be enough, in principle, to begin to make up for the shortfall in asset maintenance on the upper road network, which has a decisive impact on Quebec's economic health, and of which barely 50% is still in good condition. \"A majority of economists agree that in times of economic slowdown, or even recession, it is important for governments, whoever they may be, to be aware of the need to counterbalance this weakening of the economy and gross domestic product (GDP), with much greater investment in infrastructure,\" asserted Bitume Québec's executive board. Bitume Québec insists that the road maintenance industry is the ideal vector for stemming periods of recession or economic depression, by maximizing investment in local and other road infrastructures, while stimulating local economies and maintaining jobs. Noting that the road network remains the backbone of our national economy, Bitume Québec's directors nevertheless dared to hope for substantially increased road investment in the near future. While maintaining a certain duty of reserve, Bitume Québec will be in a position to make more detailed comments when the Minister of Transport and Sustainable Mobility makes a global announcement of road investments, region by region, in the near future. SOURCE Bitume Québec View original content to download multimedia: http://www.newswire.ca/en/releases/archive/March2024/13/c5379.html "
}