{
    "title": null,
    "date": "3/1/2024",
    "url": "https://www.benzinga.com/24/03/37418670/amd-stock-set-to-build-on-gains-outperforms-nvidia-in-premarket-whats-going-on",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Shares of Advanced Micro Devices, Inc. AMD, which closed at a record high on Thursday, are climbing yet again in premarket trading as they aim at cracking the $200 level. AMD rose over 9% before settling Thursday’s session at $192.53, off the day’s high of $193, with the catalyst being positive commentary from Citigroup. The firm said it models global semiconductor sales growth of more than 11%, which is attributable to AI-related demand. It also named AMD, Nvidia Corp. NVDA, and Broadcom, Inc. AVGO as its preferred names. Thursday’s rally pushed AMD’s market valuation past the $300 billion level. With Nvidia’s valuation stretched, some investors will likely look past the stock and into affordable names. In a mid-January note, Barclays analyst Tom O'Malley mentioned AMD among names that will likely benefit from the second wave of AI. He sees AMD exiting 2024 with an AI revenue run-rate of $4 billion, which will likely increase to more than $7 billion in 2025 as customers scout for a second source for AI accelerators. Citing channel checks, the analyst said AMD’s MI300 AI accelerator has received stronger feedback.’ MI300 AI accelerator has received stronger feedback. AMD shares are trading at a forward price-earnings multiple of 57.47 compared to Nvidia’s 33.33. Going by the average analysts’ price target, Nvidia has over 11% upside potential compared to a more modest 2%+ for AMD. In premarket, AMD gained 2.80% to $197.93 and Nvidia rose 1.06% to $799.50, according to Benzinga Pro data. Photo via Shutterstock See Also: Best Artificial Intelligence Stocks © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}