{
    "title": "AMD Ryzen 8000G: processors for gaming without a video card?",
    "date": "1/13/2024",
    "url": "https://mezha.media/en/2024/01/13/amd-ryzen-8000g-processors-for-gaming-without-a-video-card/",
    "text": "AMD Ryzen 8000G processors became one of the technological highlights of this year’s CES in the desktop PC components segment. The new hybrid chips for the Socket AM5 platform combine the developer’s most advanced technological solutions – Zen 4 processor architecture, RDNA 3 graphics, and XDNA-based Ryzen AI hardware AI accelerator.  Given that the new Phoenix chips have a single-crystal design, are manufactured by TSMC using 4 nm FinFET technology, and have a relatively modest TDP of 65 W, we get quite interesting processors with a potentially wide range of applications. The Ryzen 8000G lineup includes four models at launch. The maximum interest is focused on the flagship of the series – Ryzen 7 8700G. The new 8-core, 16-thread processor has operating frequencies of 4.2/5.1 GHz, 8 MB of L2 (1 MB per core) and 16 MB of third-level cache. However, the biggest advantage of this chip is the powerful integrated Radeon 780M graphics with 12 compute modules based on RDNA 3, operating at frequencies up to 2900 MHz. Ryzen 7 8700G is also equipped with an NPU unit to accelerate AI computing. The Ryzen 5 8600G model has a 6-core configuration. The chip typically supports SMT technology, allowing up to 12 data streams to be processed simultaneously. The computers have a frequency formula of 4.3/5.0 GHz, L2 capacity is 6 MB, and L3 capacity is 16 MB, respectively. The processor has integrated Ryzen 760M graphics with 8 active compute clusters running at 2800 MHz. The Ryzen 5 8600G also features the Ryzen AI hardware unit, which will accelerate the local computation of tasks with AI algorithms. The Ryzen 5 8500G processor also belongs to the cohort of 6-core 12-threaded chips, however, unlike the older model, where all CPU cores have Zen 4 architecture, it uses a configuration with two Zen 4 cores and four Zen 4c (2×Zen4 + 4×Zen4c). The general idea behind this combination is that the more compact Zen4c cores allow for an overall reduction in the physical size of the processor chip.  Zen4c cores are also somewhat more efficient when running a processor with relatively low power consumption (10-20 W), but such properties are more relevant for mobile chips. In the case of the Ryzen 5 8500G, two Zen 4 cores operate at 3.5/5.0 GHz, while the Zen4c units have a frequency configuration of 3.2/3.7 GHz. Unlike Intel processors, which have heterogeneous performance and energy-efficient cores (P-Cores and E-Cores) with different architectures, Zen4/Zen4c cores are identical in functionality. Therefore, it is the difference in clock speeds that will determine the impact on performance. As for the graphics capabilities, they are already somewhat more modest, Ryzen 5 8500G is equipped with integrated Radeon 740M graphics with 4 clusters at 2800 MHz. Unfortunately for potential buyers, the Ryzen 5 8500G is not equipped with the Ryzen AI NPU unit. This option is available only to older models based on Zen 4 cores. The youngest model in the series is the Ryzen 3 8300G. This is already a 4-core 8-thread processor that uses an atypical asymmetric configuration with one Zen4 core and three Zen4c cores (1×Zen4 + 3×Zen4c). The Zen 4 processor operates at 3.4/4.9 GHz, with more compact cores running at 3.2/3.6 GHz. The chip is equipped with 4 MB of L2 and has 8 MB of third-level cache. The graphics capabilities of the Ryzen 3 8300G are also determined by the Radeon 740M (2600 MHz) graphics. Like the younger Ryzen 5 model, the quad-core does not have a Ryzen AI unit. Among the features of the Ryzen 3 8300G, it should also be noted that this model will initially be available only to OEMs. Perhaps later it will also be available at retail.  As for the older models of the Ryzen 8000G line, they will go on sale on January 31. The flagship Ryzen 7 8700G is priced by AMD at $329, the Ryzen 5 8600G has a price tag of $229, and the junior 6-core Ryzen 5 8500G will be offered for $179. The addition of models with powerful integrated graphics to the range of desktop chips is a long-awaited event. AMD certainly has the right to use a term like “PC processor with the fastest iGPU”. At least, this applies to the Ryzen 7 8700G with the Radeon 780M video core.  The developers claim that this model is capable of delivering 60+ fps performance in 1080p mode without using a video card, even in fairly “heavy” games. The presentation slide shows the performance of Ryzen 7 8700G in Full HD at low quality settings. An average of 63 fps for Cyberpunk 2077 looks quite impressive, as well as almost 100 fps in Metro Exodus and 100+ fps in competitive projects. So, if you want, you can really feel quite comfortable even in demanding games, especially with moderate picture quality requirements. In the latter case, a video card will definitely come in handy.  AMD provides the gaming results of the Ryzen 7 8700G + Radeon RX 7900 XTX combination. Of course, such a combination provides fundamentally different performance even when using the graphics mode with high quality. So if gaming becomes a priority over time, the Ryzen 7 8700G should be able to unleash the potential of even the top graphics cards.  Returning to the capabilities of integrated graphics, the developers emphasized the Radeon 700M’s support for Hyper-RX technology with Fluide Motion Frames. And this option can be very helpful in cases where even a powerful iGPU is not enough to get comfortable fps in the most demanding projects. Of course, 60+ frames per second in Starfield or Alan Wake 2 without a video card is quite impressive, but here you need to evaluate the real picture quality, taking into account the use of 1080p Low mode with additional scaling and frame generation.  AMD also compared the gaming performance of the Ryzen 7 8700G and Ryzen 5 8600G with that of the Core i7-14700K, which is equipped with Intel UHD 770 graphics. No comments are necessary here. In most cases, the difference is multiple. However, we note that in Far Cry 6 the performance of integrated graphics is very similar, and it is possible that this is not an isolated case. Independent testing will provide more information for an objective assessment. Intel has significantly increased the performance of integrated graphics in its Meteor Lake processors, but these are chips for mobile systems. Similar shifts in the desktop segment can be expected with the release of Arrow Lake for the upcoming LGA1851 platform, which is due to be introduced by the end of this year. Analyzing the available indicators, we also note a relatively small difference in the gaming performance of Ryzen 7 8700G and Ryzen 5 8600G. In certain games, it’s only 5-10%. This is somewhat surprising, given that the junior model is equipped with Radeon 760M graphics with one and a half times fewer processors. Even when using DDR5 in dual-channel mode, RAM bandwidth remains a weak link and reduces the overall potential of powerful integrated graphics. However, there is still room for experimentation. Officially, Ryzen 8000G supports DDR5-5200 modules, but the use of faster kits should add the desired fps. In his recent additions, AMD Technical Marketing Specialist Donny Woligroski emphasizes the importance of using dual-channel RAM mode in a Ryzen 8000G system, as well as the possibility of additional bonuses when using DDR5-6000 kits. It is worth reminding that Socket AM5 motherboards, even with the basic AMD A620 chipset, allow you to experiment with the operating frequencies of RAM without being limited to standard values.  AMD is so confident in the capabilities of the new processors that it has resorted to an unexpected comparison – Ryzen 7 8700G vs Core i5-13400F + GeForce GTX 1650. In such a confrontation, in certain gaming projects, the flagship of the new line with integrated graphics for $329 may show better performance than a set with a 6-core Intel processor without an iGPU with an entry-level discrete GeForce GTX 1650 graphics card, which is estimated at about $410. Of course, a lot will depend on specific games, modes, and settings (AMD uses 1080p, Low), but even if there is parity in some cases, not to mention the advantage of a solution with integrated graphics, this is a claim to success.  In the wake of the amazing gaming performance, AMD assures that the overall system performance of a PC with Ryzen 7 8700G will be higher than that of a platform with Core i5-13400F and GeForce GTX 1650 graphics card. There are still more questions, but we will soon be able to get detailed and unbiased coverage of the situation. Loading comments … "
}