{
    "title": "AMD's fastest RDNA 4 GPU could offer RX 7900 XTX performance at $400 (if \nwe're lucky)",
    "date": "1/23/2024",
    "url": "https://www.tweaktown.com/news/95755/amds-fastest-rdna-4-gpu-could-offer-rx-7900-xtx-performance-at-400-if-were-lucky/index.html",
    "text": "We've been hearing more from the rumor mill about AMD's next-gen GPUs courtesy of Moore's Law is Dead (MLID). The YouTube leaker outlined some further thoughts and theories regarding AMD's incoming RDNA 4 graphics cards in his latest video (see above). Apparently what we're going to get is the top RDNA 4 GPU targeting around RTX 4080 or 7900 XTX performance, but making this far more attractive by upping the value proposition considerably. MLID theorizes as low as a $400 price point in the US for this AMD graphics card, or $600 at the higher-end, so probably around the $500 mark if we go for the middle ground. In other words, the RDNA 4 top dog - which would be a mid-range graphics card in the next-gen GPU landscape - will be the equivalent of what Team Red has as its flagship now, but for around half the price (given the 7900 XTX's MSRP of $999). With RDNA 4 potentially launching in Q3, that could mean that in six or so months you might get a powerful graphics card by today's standards for a lot less money. As Team Red is rumored not to be going for a high-end model with RDNA 4, this is the alternative approach - an attack with value proposition. (Ultimately good news for consumers, of course). What about NVIDIA's next-gen pricing plans, then? MLID also touches on this and the leaker believes that Team Green will more or less stick to its guns in many respects, but that the flagship RTX 5090 could get a meaningful price bump - though that will be reflected in its performance, as we discuss in-depth here. The RTX 5090 will likely lead the Blackwell charge, but may not be out until November, so AMD could get the drop on NVIDIA if the rumored RDNA 4 release timeframe pans out as expected. That's not certain by any means, mind, but if we had to put money on which firm will be first to market, we'd bet on Team Red. Blackwell will, of course, change the GPU arena considerably. MLID discusses NVIDIA's possible next-gen launches in this video and their relative performance levels, and the RTX 5070 is marked as pitching up at around the same level as the imminent RTX 4080 Super (or its rumored performance, we should clarify). Given the beefiest RDNA 4 graphics card is targeting RTX 4080 performance, then, it might fall just a touch short of an RTX 5070 if the guessing from the grapevine pans out. Still, the price/performance ratio could still be where AMD wins, particularly if Team Red goes for the lower-end of MLID's pricing as rumored here (fingers crossed for that). Darren Allan Darren has written for numerous magazines and websites in the technology world for almost 30 years, including TechRadar, PC Gamer, Eurogamer, Computeractive, and many more. He worked on his first magazine (PC Home) long before Google and most of the rest of the web existed. In his spare time, he can be found gaming, going to the gym, and writing books (his debut novel – ‘I Know What You Did Last Supper’ – was published by Hachette UK in 2013). Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}