{
    "title": "AMD's Laptop CPU Naming Scheme Explained",
    "date": "1/2/2024",
    "url": "https://www.howtogeek.com/amds-cpu-naming-scheme-in-laptops-explained/",
    "text": "AMD went against every convention—the first number no longer indicates a generational performance leap. AMD has completely changed its naming scheme for laptop CPUs with the release of the 7000 Series. Their laptop CPU names are now quite different from their desktop counterparts. Let's break down their naming scheme and explain what each number means for you. This handy chart with the example number \"7640U\" gives you some information on how to read model numbers. If you care about performance, pay close attention to the second and third digits. Still, it's hard to comprehend these perplexing model numbers without any context. Let's go through them one by one. Traditionally, the first number in CPUs has been the CPU generation. The series model number used to be tied in with the architecture, so a newer processor would typically be more powerful than its predecessor. But that's no longer the case. The first number now only represents the release year and has little to do with performance. Enthusiasts on Reddit called out AMD because of this, claiming that branding an older architecture under a newer portfolio model year is an anti-consumer move. This is because AMD can now sell a processor with an older architecture as a brand-new model to uninformed buyers. Whatever the case might be, the fact is that the first number no longer tells us anything meaningful about performance. The second number is mostly tied to the \"primary\" model name; it tells you whether it's an Athlon Silver/Gold (for budget laptops) or a Ryzen 3/5/7/9 CPU. Here's a quick visual representation of the market segment and architecture in relation to the processor's intended use. It's one of the most important factors for performance; a CPU in a higher market segment typically has more cores or is faster than the one below it. Confusingly, the market segment digit doesn't strictly correspond to the primary model name. For example, both three and four can indicate a Ryzen 3 CPU. Pay especially close attention to the number 8, as it can indicate both a Ryzen 7 or a Ryzen 9 CPU. The microarchitecture of a processor is the design and organization that dictates how a CPU operates. Usually, a newer architecture is more powerful and efficient, and it often has a smaller transistor size as well. A newer architecture brings a significant performance increase compared to its predecessor. A newer architecture also typically requires less power, resulting in increased battery life. The third number tells us the CPU architecture, which matches the AMD \"Zen\" core architecture—one indicates the Zen 1 architecture, two is for Zen 2, etc. When you're buying a new laptop, this is one of the most important numbers to pay attention to. As I mentioned earlier, architectures were traditionally tied in with the CPU series. Now you have to be vigilant by carefully examining the architecture digit to get an idea of the CPU's power and efficiency. Feature isolation helps you further differentiate between two different architectures that aren't indicated in the architecture number. It's always a zero or a five, with the five indicating a better model. For example, you can use it to differentiate between a Zen 3 and Zen 3+ CPU, as the plus model will have a 5. It may also indicate that the CPU has smaller, more efficient \"C\" cores, which AMD claims perform at the same level as their non-C counterparts. The last part of the model name is actually a letter suffix, somewhat similar to those found in Intel CPUs. It tells you the CPU's intended use, and it's tied in with Thermal Design Power (TDP). Essentially, a CPU with a higher TDP consumes more electricity to operate. The HX designation indicates the most powerful CPUs, but these chips also have the highest TDP of 55W or more. A CPU with a higher TDP gets hotter and can have a shorter battery life. Still, the suffix won't mean much to you, as it's primarily tied in with the rest of the CPU model name. Unfortunately, you can no longer rely on the first number alone when comparing old versus new AMD CPUs; you have to check the architecture instead. We now need to keep a close eye when shopping for a new AMD-powered laptop to avoid being misled by the portfolio model year. I believe that the discrepancy is a calculated move, as it allows AMD to rebadge last year's CPUs as a new model.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Ismar is a writer at How-To Geek and a true hardware enthusiast. Ismar has been around Windows PCs since the age of three, which is why his family chose him as the resident tech support. His favorite projects usually involve a soldering iron, such as upgrading bad mechanical keyboard and mouse switches to squeeze more life out of his beloved peripherals.\n\nIn addition to tinkering with gadgets, Ismar loves playing video games. While he has thousands of in-game hours, many of them have been spent on optimizing his AMD-powered PC to squeeze more performance out of it.\n\nWhen he's not sitting at his desk, he's probably messing around with other people's phones to find their quirks and features. Additionally, he follows cutting-edge tech and is especially interested in the development of advanced AI and how it's changing our lives.\n\nHe started his writing career in 2021, immediately after completing his B.A. degree in English Language and Literature. To keep up with all this writing work, he relies on three cups of coffee a day. He loves the beverage so much that he created a blog about collecting coffee mugs to showcase his favorite vessels.\n\nHe shares his blogging skills with colleagues at Authority Hacker. He also likes to work on intermittent SEO projects to enhance his clients' search engine visibility. Prior to this, Ismar helped people find work in the gig economy at Gigworker. Ismar is a freelance pro who did various odd online jobs during his studies before settling on writing.\n\nIn his free time, Ismar enjoys hitting the gym, playing guitar and bass, cooking gourmet meals, and traveling. He's also a proud cat owner. What's an i3 processor? Is it good? With the Free Pro 3, EarFun continues to prove that you don't need to spend much for a great, fun-sounding set of earbuds with impressive features. If it ain't broke, don't fix it. A basic Bluetooth speaker for easy carrying that undercuts the price of similar products. Does Google's second attempt at a smartwatch make enough improvements? For once, you can sweat the small stuff. "
}