{
    "title": "AMD Ryzen 5 8500G 6-Core “Hawk Point” APU Benchmarks Leak: Up To 36% Single \n& 11% Multi-Thread Performance Uplift Versus 5600G",
    "date": "1/6/2024",
    "url": "https://wccftech.com/amd-ryzen-5-8500g-6-core-hawk-point-apu-benchmarks-leak-36-percent-faster-vs-5600g/",
    "text": "AMD Ryzen 5 8500G is the latest Hawk Point APU which has leaked out in Geekbench & features a nice gain in performance versus the 5600G. Just like the Ryzen 7 8700G chip which leaked out a few days ago, the AMD Ryzen 5 8500G is an upcoming Hawk Point APU that will be released on the AM5 desktop platform. The chip features the Zen 4 core architecture and the RDNA 3 graphics architecture. Unlike the top two SKUs (8700G/8600G), the Ryzen 5 8500G and the Ryzen 3 8300G will feature the A2 die which comprises Zen 4 & Zen 4C cores. Coming to the specifications, the AMD Ryzen 5 8500G features 6 cores and 12 threads. The chip has a base clock of 3.55 GHz and a boost clock of 5.0 GHz which match up perfectly with previous leaks. There's also 16 MB of L3 cache and 6 MB of L2 cache. The 8500G features a Radeon 740M GPU with 4 compute units clocked at 2800 MHz. The chip was tested on a Maxsun B650M motherboard with 32 GB of DDR5 memory. The memory speeds are not listed. In terms of CPU performance, the AMD Ryzen 5 8500G \"Hawk Point\" APU scores 1965 points in the single-core and 8,768 points in the multi-core tests. Comparing the Geekbench 5 scores of the AMD Ryzen 5 5600G, the 8500G ends up 11% faster in multi-threaded and 36% faster in single-threaded tests. The Radeon 740M iGPU has double the compute units of the Radeon 710M and should be able to handle eSports titles and a few AAA games with upscaling technologies but for users who want to  get better graphics performance on an iGPU, the Radeon 760M/780M on Ryzen 8600G/8700G APUs are a much better choice. With AMD's CES 2024 event closing in, we are likely to see more information on these APUs in a few days. As per previous reports, the AMD Ryzen 8000G \"Hawk Point\" APUs are expected to hit retail by the 31st of January. News Source: @Olrak29_ Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}