{
    "title": "Time to Get in On Nvidia's Latest Rally to almost $600 a share?",
    "date": "1/19/2024",
    "url": "https://finance.yahoo.com/news/time-nvidias-latest-rally-almost-025500935.html",
    "text": "One of the top performers at the start of 2024 has been Nvidia NVDA with the chipmaker largely outperforming the broader market and now soaring over +200% in the last year. Nvidia’s blazing trail has led to higher highs as investors flock to consume positions in the artificial intelligence leader. Let’s see if it’s still time to buy Nvidia’s stock which is already up +20% year to date. Image Source: Zacks Investment Research Recent Momentum Remarkably, Nvidia’s stock blew past the $500 a share mark last week continuing a very bullish trend after eclipsing its 50-day moving average and has blown away its 200-day moving average. Nvidia’s stock is currently on the cusp of trading at $600 a share closing today’s trading session up +4% and hitting new 52-week highs of $595. The pile-in comes as Nvidia’s superior AI chip the HGX H200 is slated to come out during the second quarter of this year and is expected to keep the company ahead of competitors like AMD (AMD) and Intel (INTC). Image Source: Zacks Investment Research When Does Nvidia Report Earnings? Nvidia will be reporting its Q4 resutls on February 28 and is expected to post another quarter of exponential growth. Fourth quarter earnings are expected to skyrocket 410% to $4.49 a share versus $0.88 per share a year ago. Quarterly sales are projected to soar 232% to $20.1 billion. This would also mark Nvidia’s fifth consecutive quarter of stellar sequential growth on both its top and bottom lines with Q4 EPS and sales anticipated to rise 11% from the third quarter respectively. Nvidia has now surpassed earnings expectations for four straight quarters posting an average earnings surprise of 18.99%. Image Source: Zacks Investment Research Bottom Line Nvidia’s stock currently sports a Zacks Rank #1 (Strong Buy) and the Average Zacks Price Target of $649.11 a share still suggests 13% upside. Stellar growth and more importantly its position as a leader in powering artificial intelligence could propel Nvidia’s stock even higher leading up to its Q4 report in February. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Intel Corporation (INTC) : Free Stock Analysis Report Advanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}