{
    "title": "MSI Bravo with AMD Ryzen 7 7840HS, Radeon RX 6550M and 32 GB RAM slips \nunder $1000",
    "date": "1/26/2024",
    "url": "https://www.notebookcheck.net/MSI-Bravo-with-AMD-Ryzen-7-7840HS-Radeon-RX-6550M-and-32-GB-RAM-slips-under-1-000.797502.0.html",
    "text": "Gaming laptops powered by AMD’s Ryzen 7040 Phoenix APUs have proven quite popular in the past 6 months, but such models usually come with Nvidia dGPUs or no dGPU at all since the RDNA3 iGPU is decent for 1080p gaming. AMD’s Radeon RX 7000M dGPU series is barely used by laptop OEMs these days, and the previous gen RX 6000M might as well be EOL at this point. MSI, however, is probably the only OEM to pair Phoenix processors with RDNA 2 dGPUs like the elusive Radeon RX 6650M that is mostly matching Nvidia’s RTX 3050, yet it offers only 4 GB VRAM instead of 6 GB. This rare configuration is now on sale at Newegg with an MSI Bravo 15 gaming laptop for $999. While the Radeon RX 6650M is clearly targeted at budget buyers, most of the other specs, with the exception of the display and maybe the build quality, are above average for this price point. Speaking of the display, this model features a 1080p IPS screen with ~60% sRGB color gamut, 300 nit brightness and 144 Hz refresh rate. The webcam is limited to 720p. The Ryzen 7 7840HS is an excellent APU for its class and offers eight Zen 4 cores, 16 threads, the Radeon 780M iGPU and even a decent XDNA NPU for AI workloads. It is coupled with 32 DDR5-5200 RAM upgradable to 64 GB and 1 TB PCIe 4.0 NVMe SSD storage. Port selection is just average, with 1x USB-C 3.2 Gen 1, 2x USB-A 3.2 Gen1, 1x USB 2.0, HDMI 2.1 video out plus GbE and audio jacks. Surprisingly enough, MSI is offering the faster Wi-Fi 6E + BT 5.2 card on this model. Including the 53.3 Wh battery, this MSI Bravo model weighs 4.96 lbs (2.24 kg) and has a profile of 0.98 inches (2.48 cm). Disclaimer: Notebookcheck is not responsible for price changes carried out by retailers. The discounted price or deal mentioned in this item was available at the time of writing and may be subject to time restrictions and/or limited unit availability. Newegg "
}