{
    "title": null,
    "date": "1/1/2024",
    "url": "https://wccftech.com/amd-navi-3x-rdna-3-gpus-surface-cuarzo-codename-hints-possible-navi-32-mobile-skus/",
    "text": "AMD might be preparing new products based on its Radeon RX 7000 \"RDNA 3\" GPUs under its Navi 3X lineup as suggested by a shipping manifesto with several \"Cuarzo\" products. AMD might be switching from fish codenames to crystalline rocks, as a shipping label, disclosed by popular hardware leaker Harukaze5179, reveals. The shipping manifesto suggests that AMD uses a new \"Cuarzo\" codename for its existing Navi 3X GPUs. This label was reportedly obtained from the company's Canadian HQ when the mentioned SKUs were shipped to the firm's labs globally. Now the naming convention used by AMD is \"Cuarzo\", a Spanish word, that refers to the element \"Quartz\" in English. The new naming is divided into three categories: Cuarzo Rojo, Cuarzo Verde, and Cuarzo Azul, translating to Red Quartz, Green Quartz, and Blue Quartz respectively. We have no idea why AMD decided to choose such names for its Navi SKUs, but given the company's previous track records, it isn't a surprising one, in fact, far better than \"Pink Sardine\" or \"Hotpink Bonefish\". Unfortunately, the SKUs mentioned within the shipping label don't indicate any new release in development. Still, an assumption made by Videocardz states that Team Red might decide to integrate the Navi 32 GPU package into mobile variants, as hinted by the \"board D716\" and \"XEM\" variants listings, but that is just a rumor for now. We don't have any solid evidence in the form of leaks to back this but it will fill up the huge gap between the Navi 33 and Navi 31 mobile SKUs. News Sources: Videocardz, Harukaze5179 Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}