{
    "title": "AMD Fluid Motion Frames will officially launch on January 24th",
    "date": "1/12/2024",
    "url": "https://www.kitguru.net/gaming/joao-silva/amd-fluid-motion-frames-will-officially-launch-on-january-24th/",
    "text": "João Silva \nJanuary 12, 2024\nSoftware & Gaming  On January 24th, AMD will not only release the Radeon RX 7600 XT with 16GB RAM but also make Fluid Motion Frames available to the public. This technology will be included in HYPR-RX and provided as a standalone driver setting. What's interesting about this technology is that it doesn't require game developer integration. This means AMD Fluid Motion Frames can operate without any implementation, making it easier to use than Nvidia's frame generation technology. However, this feature is only available for Radeon GPUs, and not all cards will support it.  AMD has been providing preview drivers with AFMF support for some time, and the most recent version allowed Frame Generation for the Radeon 700M RDNA 3 iGPUs. Previously, AMD enabled support for the Radeon RX 6000 series. However, there is currently no support for the Radeon 600M (RDNA 2-based iGPU). According to Aaron Steinman, senior manager of Radeon product management at AMD (via PCGamer), the red team's method has an advantage over Nvidia's tech. While DLSS3 with Frame Generation requires to be previously integrated into the game, AMD's AFMF technology works in all games. Furthermore, Nvidia's frame generation only works with RTX 40 GPUs. So, to even the field, he believes that either Nvidia will profit from AMD's solution, as it is open-source and cross-vendor, or the green team will create something similar. KitGuru says: Do you think Nvidia is preparing a competitor to AFMF, or will it stick to its proprietary solution for Frame Gen? Become a Patron! Tags AFMF AMD Driver frame generation news official launch After eight major releases, HWiNFO is finally getting a built-in OSD, allowing users to see …   DDR5 speed on your next PC: How fast?  View Results "
}