{
    "title": "AMD's Ryzen 8700G APU features an 8-core Zen 4 CPU with integrated Radeon \n780M graphics",
    "date": "1/8/2024",
    "url": "https://www.techspot.com/news/101433-amd-ryzen-8700g-apu-features-8-core-zen.html",
    "text": "What just happened? AMD has announced a range of new CPUs, including Zen 4 APUs for the AM5 platform, and new processors for AM4. Starting with the Zen 4 APUs, these are labeled the Ryzen 8000G series. Ideally, they should be the 7000G series as they belong to the same CPU architecture generation as other Zen 4 parts, which are Ryzen 7000. However, this isn't the first time AMD has increased the product name for APUs, as seen with the 2000G and 3000G series. The top APU models are straightforward: the Ryzen 7 8700G features an 8-core Zen 4 design with Radeon 780M graphics, a 12 compute unit RDNA3 design. It offers up to a 5.1 GHz boost clock, 16MB of L3 cache plus 8MB of L2 for a total of 24MB cache. All these APUs have a 65W TDP. The Ryzen 5 8600G reduces this to six Zen 4 CPU cores and Radeon 760M graphics, which includes 8 compute units. All new APUs are based on AMD's monolithic Hawk Point die, also used for Ryzen 8040 series mobile APUs, a refresh of the Phoenix die used for 7040 series mobile APUs.  The Ryzen 5 8500G is slightly different, utilizing a mix of Zen 4 and Zen 4c cores. It's a six-core model, split into two Zen 4 cores and four Zen 4c cores. Zen 4c is a smaller, more efficient core, retaining the same architecture features as full Zen 4. Alongside this, there's Radeon 740M graphics, offering four compute units of RDNA3. The Ryzen 3 8300G, a further reduced model, will only be available in pre-built systems. The new APUs will be available on January 31st, priced at $330 for the 8700G, $230 for the 8600G, and $180 for the 8500G. The 8500G will match the price of the Ryzen 5 7500F, the 8600G that of the 7600, and the Ryzen 7 8700G that of the Ryzen 7 7700. These prices are MSRPs, though current retail pricing closely aligns with these figures.  We expect these new chips to become niche products. With half the L3 cache of regular Zen 4 desktop CPUs in the Raphael series and lower boost frequencies, the 8000G APUs will probably be slower for gaming when paired with discrete graphics. Thus, those intending to build a system with discrete graphics might be better off with other Zen 4 parts, like the Ryzen 5 7600 at the same price as the 8600G, or the 7800X3D, which is currently $70 more expensive than the 8700G. The integrated RDNA3 GPU in these products will be significantly faster than the 2 compute units offered with Raphael CPUs, but still only suitable for low-quality setting gaming at low resolutions.  For example, AMD claims only 60 FPS in modern titles using 1080p low settings with AFMF frame generation. The experience in games like Alan Wake 2, with a native frame rate of 26 FPS boosted to 62 FPS through driver-based frame generation, is unlikely to be satisfactory. These products are more suited for games like Dota 2, League of Legends, and older titles like Grand Theft Auto V. A major question with these APUs is whether they are a better option than a regular CPU paired with a low-end discrete GPU. Historically, we've found the CPU + discrete GPU pairing to be preferable, but the 8000G series' performance and value remain to be seen.  However, it's positive that AMD is launching new APUs at the same price as equivalent CPU models, a more favorable strategy than in the past. The previous APU line, the 500G series, had the 5700G at $360 and the 5600G at $260, a $60 premium over the 5700X and 5600, respectively. Price parity makes more sense, letting buyers choose between the likely faster CPU performance of non-APU models or the integrated graphics capabilities of the APU models, without the added factor of a price premium for iGPU functionality.  AMD is also launching four new AM4 processors. The Ryzen 7 5700X3D is a 5800X3D with a 400 MHz lower clock speed, maintaining the same eight-core Zen 3 design, 96MB L3 cache, and 105W TDP, but with a 9% lower boost frequency at 4.1 GHz. Priced at $250, it could be a compelling option for AM4 owners, given the 5800X3D's typical price range of $320 to $350, making the 5700X3D over 20 percent cheaper.  The Ryzen 5 5700 is a 5700G APU with the integrated graphics part disabled, previously released as an OEM-only part but now available as a boxed processor. It retains the same 8-core Zen 3 CPU design with 16MB of L3 cache and PCIe 3.0 capabilities, the same 4.6 GHz boost clock, and 65W TDP, but without an iGPU. Priced at $175, it's $25 less than the Ryzen 7 5700X or 5700G. It will be interesting to evaluate its gaming performance given its reduced L3 cache capacity compared to the 5700X and Ryzen 5 5600, which is currently $150. Whether the extra two cores are worth an additional $25 over the 5600, especially with reduced L3 cache, is debatable and may not be the best choice for gaming, depending on the workload.   Two new APUs are also being released. The Ryzen 5 5600GT is a 5600G with a 200 MHz higher boost clock and 300 MHz lower base clock, and the 5500GT is a 5600G with the same boost clock but a 300 MHz lower base clock. Both have integrated graphics enabled and are designed for entry-level systems, priced at $140 for the 5600GT and $125 for the 5500GT. All these processors, the 8000G series, and the new AM4 processors will be available on January 31st, making February a busy month for reviews. This is especially true as Intel is expected to launch more 14th-gen CPUs as well.  These Zen parts are likely being released to utilize remaining Zen 3 silicon, as they are essentially different bins of already released products. The 5700X3D seems like a reasonably compelling processor for those seeking a drop-in upgrade on AM4, while the other models appear quite niche. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}