{
    "title": null,
    "date": "1/25/2024",
    "url": "https://videocardz.com/newz/amd-kraken-point-apu-reportedly-features-four-zen5-and-four-zen5c-cores",
    "text": "Please note that this post is tagged as a rumor. According to Everest (Olrak29_), AMD’s next-gen APU is to feature a heterogeneous design with classic and dense Zen5 cores.  Next year, AMD is gearing up to launch the Kraken Point APU series, succeeding the Hawk Point, as per leaked roadmaps. Alongside, the mobile series is introducing APUs codenamed Strix Point and Strix Halo, offering even greater performance. The Strix Point and Kraken Point appear to have a lot in common. Both will leverage Zen5 and Zen5c cores, coupled with the RDNA3.5 GPU architecture. Additionally, they are set to incorporate faster XDNA2 AI processor. The Strix series is expected to stand out with twice the number of Zen5c cores compared to Kraken. Everest corroborates and expands earlier speculations, suggesting that Kraken Point will house four Zen5 and four Zen5c cores, totaling 8 cores. In comparison to Strix Point, that’s 4 Zen5c cores fewer. 4 WGP https://t.co/bCXt9hTzh9 — Everest (@Olrak29_) January 26, 2024  Update: Everest confirmed that the Kraken Point will ship with 4 WGP (Workgroup Processors), which should result in 8 Compute Units. That’s the same graphics configuration as Rembrandt (Zen3+/RDNA2) or Steam Deck (Zen2/RDNA2), but in this case this newer RDNA3.5 architecture. The new information lacks one important detail: what’s the default TDP. The latter may be assumed to be similar to Hawk Point, which is up to 45W, but thus far there was no mention of the GPU config.   AMD Zen5 roadmap, Source: Moore’s Law is Dead  AMD is currently planning at least five different consumer products with Zen5. The Kraken Point may be the least capable APU in the AMD product lineup, but only in terms of CPU power. Fire Range, which should have twice as many cores, is expected to have limited graphics capability, just like Dragon Range with Zen4 cores. This product is not focusing on integrated graphics, but to offer powerful CPU for discrete GPUs. Meanwhile, Kraken and Strix Point are designed to provide users (or OEMs) with the flexibility for APU’s standalone operation or an option to be paired with discrete graphics. With 8 Compute Units, the AMD APU should stay competitive against budget and low-power APU designs such as the upcoming Intel Lunar Lake. Assuming that the leaked roadmaps are accurate, Kraken Point should not be expected this year. Perhaps it will arrive a year after Hawk Point, so one should expect more details around CES 2025. Source: Everest We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}