{
    "title": "AMD Next-Gen Ryzen Zen 5 “Granite Ridge” CPUs Reportedly Enter Mass \nProduction, Coming To AM5 Later This Year",
    "date": "1/15/2024",
    "url": "https://wccftech.com/amd-next-gen-zen-5-granite-ridge-cpus-enter-mass-production-coming-to-am5-2024/",
    "text": "AMD's next-generation Ryzen CPUs codenamed Granite Ridge and powered by the Zen 5 core architecture have reportedly entered mass production. The next-gen AMD Ryzen CPU family will be a big one as it moves to a brand new Zen architecture. Codenamed \"Granite Ridge\", the next-gen CPUs will be powered by the Zen 5 core architecture and feature a range of new technologies including the brand-new architecture itself. These CPUs will be compatible with the AM5 desktop platform including the existing 600-series motherboards. AMD's official roadmap has already slated the next-gen Ryzen CPUs as a 2024 launch so we will expect to see the first lineup in the second half of 2024. Not a whole lot about AMD's Zen 5 core architecture is known at the moment but from what the company has officially stated, it will offer: These new Ryzen CPUs will be launching around the same time Intel will be bringing its Arrow Lake-S Desktop CPUs to the market on the new LGA 1851 socket. Like AMD's Zen 5 architecture, Intel will also be adding AI-specific accelerators within its new Core lineup which will be in addition to its new NPU design which is said to be a slightly updated version of what we saw on Meteor Lake CPUs. For now, AMD has the edge for bringing the first desktop CPUs with an NPU to the market with its soon to launch Ryzen 8000G Desktop APU family which launches later this month. Yeah — Kepler (@Kepler_L2) January 15, 2024  Now, as per hardware insider @Kepler_L2, we know that the AMD Ryzen \"Granite Ridge\" family is in mass production and it's up to AMD to decide if they want to rush in and unveil these chips by the next Computex following a launch in Q3 or move it a bit later to Q4. We have already seen lots of updates and optimizations happening in the background around the Zen 5 core architecture in various new patches and we have also seen alleged samples leak out earlier too. PC builders buying an AM5 platform now are assured drop-in-compatibility with the next-gen AMD Ryzen CPUs. The company has committed to a 2025+ plan for its AM5 socket and as we have seen on the AM4 platform, AMD supports its desktop platforms more than Intel with a very strong 7-year+ dedication to its previous platform. The Zen 5 core architecture will also be coming to the next-gen Ryzen laptop family codenamed Strix Point which is also scheduled for a later 2025 CPU release plan. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}