{
    "title": "Winners And Losers Of Q3: AMD (NASDAQ:AMD) Vs The Rest Of The Processors \nand Graphics Chips Stocks",
    "date": "1/11/2024",
    "url": "https://finance.yahoo.com/news/winners-losers-q3-amd-nasdaq-090538320.html",
    "text": "Let's dig into the relative performance of AMD (NASDAQ:AMD) and its peers as we unravel the now-completed Q3 processors and graphics chips earnings season. The biggest demand drivers for processors (CPUs) and graphics chips at the moment are secular trends related to 5G and Internet of Things, autonomous driving, and high performance computing in the data center space, specifically around AI and machine learning. Like all semiconductor companies, digital chip makers exhibit a degree of cyclicality, driven by supply and demand imbalances and exposure to PC and Smartphone product cycles. The 9 processors and graphics chips stocks we track reported a solid Q3; on average, revenues beat analyst consensus estimates by 3.4% while next quarter's revenue guidance was in line with consensus. Investors abandoned cash-burning companies to buy stocks with higher margins of safety, but processors and graphics chips stocks held their ground better than others, with the share prices up 20.5% on average since the previous earnings results. Founded in 1969 by a group of former Fairchild semiconductor executives led by Jerry Sanders, Advanced Micro Devices or AMD (NASDAQ:AMD) is one of the leading designers of computer processors and graphics chips used in PCs and data centers. AMD reported revenues of $5.8 billion, up 4.2% year on year, topping analyst expectations by 1.9%. It was a mixed quarter for the company, with a significant improvement in its inventory levels but underwhelming revenue guidance for the next quarter. “We delivered strong revenue and earnings growth driven by demand for our Ryzen 7000 series PC processors and record server processor sales,” said AMD Chair and CEO Dr. Lisa Su. The stock is up 51.9% since the results and currently trades at $149.6. Is now the time to buy AMD? Access our full analysis of the earnings results here, it's free. Founded in 1993 by Jensen Huang and two former Sun Microsystems engineers, Nvidia (NASDAQ:NVDA) is a leading fabless designer of chips used in gaming, PCs, data centers, automotive, and a variety of end markets. Nvidia reported revenues of $18.12 billion, up 206% year on year, outperforming analyst expectations by 12.5%. It was a stunning quarter for the company, with a significant improvement in its gross margin and an impressive beat of analysts' EPS estimates. Nvidia delivered the biggest analyst estimates beat and fastest revenue growth among its peers. The stock is up 9.9% since the results and currently trades at $549.16. Is now the time to buy Nvidia? Access our full analysis of the earnings results here, it's free. Based in the US, SMART Global Holdings (NASDAQ:SGH) is a diversified semiconductor company offering memory, digital, and LED products. SMART reported revenues of $274.2 million, down 41.1% year on year, falling short of analyst expectations by 0.3%. It was a weak quarter for the company, with underwhelming revenue guidance for the next quarter and a miss of analysts' revenue estimates. SMART had the weakest performance against analyst estimates and slowest revenue growth in the group. The stock is up 10% since the results and currently trades at $20.33. Read our full analysis of SMART's results here. The result of a spinoff from Sanken in Japan, Allegro MicroSystems (NASDAQ:ALGM) is a designer of power management chips and distance sensors used in electric vehicles and data centers. Allegro MicroSystems reported revenues of $275.5 million, up 15.9% year on year, in line with analyst expectations. It was a decent quarter for the company, with an impressive beat of analysts' EPS estimates but underwhelming revenue guidance for the next quarter. The stock is up 4.8% since the results and currently trades at $27. Read our full, actionable report on Allegro MicroSystems here, it's free. A global leader in its category, Lattice Semiconductor (NASDAQ:LSCC) is a semiconductor designer specializing in customer-programmable chips that enhance CPU performance for intensive tasks such as machine learning. Lattice Semiconductor reported revenues of $192.2 million, up 11.4% year on year, in line with analyst expectations. It was a mixed quarter for the company, with underwhelming revenue guidance for the next quarter. The stock is down 3.2% since the results and currently trades at $65.1. Read our full, actionable report on Lattice Semiconductor here, it's free. Join Paid Stock Investor Research Help us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here. The author has no position in any of the stocks mentioned Related Quotes "
}