{
    "title": "AMD's 22-year-old GPUs are still getting driver updates — ATI's R300 - R500 \nfrom the early 2000s live on in Linux ...",
    "date": "1/5/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/amd-22-year-old-gpus-are-still-getting-driver-updates-atis-r300-r500-from-the-early-2000s-live-on-in-linux-driver-patches-thanks-to-the-open-source-community",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. If you still have a GPU like the ATI Radeon 9700 PRO, you can still use it on modern Linux operating systems. Phoronix reports that driver updates for ATI's ancient R300 through R500 series Radeon GPUs are being implemented into Linux this year. Despite their old age, the open-source community is keeping these GPUs alive with open-source drivers, enabling them to continue to run on modern Linux operating systems. The Linux driver update makes a change to NIR lowering, which is related to the vertex shaders. The driver update will be available this quarter in Mesa 24.0, meaning anyone still using an R300-R500 series Radeon GPU will have it later this year. \"This MR moves the most of the remaining backend lowering into NIR. Specifically, ftrunc, fcsel (when suitable) and flrp. The backend lowering paths are removed. This is a prerequisite for more backend cleanups, for example I have a MR ready to get rid of backend DCE for vertex shaders.\" -- Pavel Ondračka The ATI R300 debuted in 2002 as part of the ATI Radeon 9700 PRO. The GPU featured an AGP interface (an ancient competitor to PCIe), 150nm process, 110 million transistors, 325MHz core clock, 256MB of memory, and 19.8GB/s of memory bandwidth.\n\nWhen it launched, the Radeon 9700 Pro was the fastest GPU of its time, beating Nvidia's counterpart, the GeForce 4 Ti 4600, in almost every workload. It was also the most technologically advanced GPU at the time, being the first GPU to support DirectX 9 in its entirety. The R400 and R500 series GPUs that would follow afterward were mostly optimizations of the R300's GPU architecture, sporting far more pixel pipelines, vertex shader engines, and faster, more capable memory configurations. It is amazing that anyone is still running one of these cards, let alone supporting them in modern Linux operating systems, as the open-source community has done. Obviously, these GPUs can't do much on modern operating systems, other than display windows and text. But it is cool, nevertheless, that a GPU from 2002 can run a modern operating system at all. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Aaron Klotz is a freelance writer for Tom’s Hardware US, covering news topics related to computer hardware such as CPUs, and graphics cards. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 OpenAI and Microsoft reportedly planning  $100 billion datacenter project for an AI supercomputer By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}