{
    "title": "Intel wants to be inside Microsoft's next-gen Xbox console, would be built \nin the USA",
    "date": "2/4/2024",
    "url": "https://www.tweaktown.com/news/95974/intel-wants-to-be-inside-microsofts-next-gen-xbox-console-would-built-in-the-usa/index.html",
    "text": "Intel is reportedly gunning hard to win the contract to both build Microsoft a semi-custom APU for its next-gen Xbox console and fabricate the chip at its own foundry. This is compared to both console SoCs being made by AMD and fabbed at TSMC in Taiwan. Intel had a custom Pentium III \"Coppermine-based\" CPU at 733MHz inside of the original Xbox back in 1999, but AMD has been securing contract after contract from both Microsoft and its Xbox consoles and Sony with its PlayStation consoles. Intel powering the next-gen Xbox would be an exciting thing to see, as AMD has reportedly already signed a contract with Sony to build a next-gen PlayStation 6 console. Intel has been hard at work with its Tile-based APU approach, with its latest Meteor Lake CPUs featuring CPU, GPU, AI tiles, and more on a single chip. Intel's own Arc GPU division is reportedly not going to continue on with discrete GPUs past Battlemage, where rumor has it the company will shift to using GPU Tiles only on future-gen APUs. This move makes even more sense if Intel is able to build a monster new APU for Microsoft's next-gen Xbox, where it could precisely tune the CPU and GPU clocks, have an NPU built-in for AI workloads on the new Xbox console, and intelligently control power across the board. We could have a situation where Microsoft's next-gen Xbox launches with Intel Inside and is much more powerful than the next-gen AMD-powered PlayStation 6 console. It's funny because I wrote an article back in 2019, reporting that John Sell, the chief architect behind Xbox One, Xbox One X, and the current flagship Xbox Series X console, moved to work at Intel. In that article, I wrote: \"Sell could be put to work onto a new SoC that could be used in future devices... which could get very interesting, very quickly. Can you imagine an Intel-powered console in the future?\" Moore's Law is Dead covered this in a new video, where Intel is reportedly binning for the next-gen Xbox console, where he said that at this point, Sony has two contracts and Microsoft has none. Sony has its next-gen portable PlayStation console with AMD, as well as its next-gen PlayStation 6 console with AMD. Microsoft doesn't have any contracts with AMD for its next-gen Xbox and has been dragging its feet, it seems. Microsoft has been shopping its next-gen Xbox contract with both Intel and NVIDIA, where according to MLID, up until a month ago, no next-gen Xbox contract had been signed by Microsoft and AMD. Meanwhile, AMD has signed multiple contracts with Sony for next-gen PlayStation products. Microsoft would be shopping around its contract for a next-gen Xbox in the hopes that AMD would reduce its prices... to make AMD think it could lose the contract to another company, allowing Intel to step in and try to scoop up the contract. According to MLID, first, Intel CEO Pat Gelsinger saw this as a Hail Mary pass for saving Arc... could be the thing that keeps developers working on higher-end Arc GPUs. Intel is desperate to get outside wins for its fabs... Nova Lake, Granite Rapids, etc... but Gelsinger is constantly talking about how Intel has to become a fab-first company that competes directly against TSMC. Intel wants anyone to buy capacity for their fabs, with scoring a next-gen Xbox contract from Microsoft being one of the biggest marketing pushes the company needs. The company could use this kind of marketing to push its fabrication plants, in a way saying \"yeah, we're making Microsoft's next-gen Xbox chip, you should make your chip with us\". TSMC has had multiple huge partners with the likes of AMD, Apple, Intel, NVIDIA, Qualcomm, and many others... companies know they can trust them to make the very best silicon on the planet. Intel having this win allows them to start marketing the next-gen Xbox console, a \"Built in America\" product, which would be a champion move. Imagine booting up your next-gen Xbox and seeing an Intel logo appear... that would be kinda cool, right? Anthony Garreffa Anthony joined the TweakTown team in 2010 and has since reviewed 100s of graphics cards. Anthony is a long time PC enthusiast with a passion of hate for games built around consoles. FPS gaming since the pre-Quake days, where you were insulted if you used a mouse to aim, he has been addicted to gaming and hardware ever since. Working in IT retail for 10 years gave him great experience with custom-built PCs. His addiction to GPU tech is unwavering and has recently taken a keen interest in artificial intelligence (AI) hardware. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}