{
    "title": "AMD FSR 3 and Intel XeSS Are Now Officially in Starfield",
    "date": "2/21/2024",
    "url": "https://wccftech.com/amd-fsr-3-and-intel-xess-are-now-officially-in-starfield/",
    "text": "Bethesda Game Studios announced the release of a new Starfield patch that introduces support for AMD FSR 3 and Intel XeSS. The availability of AMD FSR 3 will be especially useful for all those gamers without an NVIDIA GeForce RTX 40 graphics card. Starfield already supports NVIDIA DLSS 3, but that feature is only available to RTX 40 GPUs, whereas AMD FSR 3 works on all graphics cards. Truth to be told, a mod already injected FSR 3 into the game, but an official implementation is of course always preferable. Either way, the performance gains are pretty significant. The developer recommends keeping VSYNC On with FSR 3. Starfield update 1.9.67 also adds the following fixes in addition to AMD FSR 3 and Intel XeSS: This is the second major Starfield patch released this year, following the previous one that improved lighting, character faces, and more. That's just the beginning of a busy 2024, as Bethesda already promised additions such as city maps, new ways of traveling, and of course modding tools. While there are already plenty of mods available for Starfield, having access to the official mod tools will enable modders to create far more detailed and interesting mods. Moreover, the first expansion, called Shattered Space, is slated to launch later this year. In other AMD FSR 3 news, the upscale was removed from Nightingale just ahead of the game's early access launch due to its contribution to crashes. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}