{
    "title": "Is It Too Late to Buy AMD Stock?",
    "date": "2/7/2024",
    "url": "https://www.fool.com/investing/2024/02/07/is-it-too-late-to-buy-amd-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Advanced Micro Devices (AMD 0.50%) is one of the many tech firms that shifted their focus to the booming artificial intelligence (AI) market in the last year. Excitement over the company's prospects in the industry has seen its shares soar 101% since last January, rallying investors with a new AI chip and partnerships with tech leaders such as Microsoft and Meta Platforms. AMD made headlines last week when it released earnings for its fourth quarter of 2023. The chipmaker beat Wall Street estimates on revenue and met forecasts for earnings per share. However, weaker-than-expected guidance for 2024's first quarter saw its stock temporarily dip 6% in extended trading on Jan. 30. Yet AMD remains an attractive long-term investment. The company is in transition as it works to catch its rivals, prioritizing development of graphics processing units (GPUs) and AI. So here's why it's not too late to buy AMD stock. The AI market exploded last year, causing demand for high-powered chips like GPUs to skyrocket. Nvidia's dominance in GPUs saw it snap up an estimated 80% to 95% market share in AI chips alongside soaring earnings. But AMD plans to challenge Nvidia's industry supremacy in 2024 with its newly launched MI300X AI GPU. The company unveiled the new chip last December, and the hardware has already caught the attention of some of tech's most prominent players. In November 2023, Microsoft announced Azure would become the first cloud platform to use AMD's MI300X to optimize AI capabilities. Microsoft has a close partnership with ChatGPT developer OpenAI, making the company a powerful ally for AMD. An agreement with Meta -- which will see it use the new chips as well -- also helps make AMD's future in AI looks bright. However, AMD isn't banking solely on stealing market share from Nvidia in GPUs. AMD seeks to lead its own space within AI by doubling down on AI-powered PCs. According to research firm IDC, PC shipments are projected to see a major boost this year, with AI integration serving as a key catalyst. And a Canalys report predicts that 60% of all PCs shipped in 2027 will be AI-enabled. Meanwhile, AMD president Victor Peng told CNBC on Feb. 1 that the company has a good lead in AI-enabled PCs and is \"extremely well positioned\" in the industry. The company supplies chips to PC and notebook manufacturers across tech, with a 23% market share in laptop central processing units (CPUs). Consequently, AMD could significantly profit from increased demand for AI-equipped PCs, carving out its own niche in the burgeoning AI market. In its fourth quarter, AMD's revenue rose 10% year over year to $6 billion, beating analysts' expectations by about $60 million. The company's AI-focused data center segment posted revenue growth of 38%. Meanwhile, improvements in the PC market boosted AMD's client segment by 65% year over year. Earnings were positive. However, it wasn't enough to quell investors' concern over weaker-than-expected guidance. AMD expects to reach $5.4 billion in sales in the first quarter, plus or minus $300 million, while Wall Street estimates $5.7 billion. Sales of CPUs are slowing as GPU demand rises. AMD is experiencing a transition as it shifts its focus along with market trends. Over the long term, GPU sales have the potential to outpace CPU losses. AMD's outlook remains promising, and earnings-per-share (EPS) estimates seem to support this.  Data by YCharts. This chart shows AMD's earnings could hit just above $7 per share over the next two fiscal years. Multiplying this figure by the company's forward price-to-earnings ratio of 49 yields a stock price of $351. If projections are correct, AMD's stock would rise 97% by its fiscal 2026. Though ambitious, the growth is based on reasonable financial forecasts. With a recently launched AI GPU and prospects in the AI PC market, it's not too late to invest in AMD's stock and still benefit from major gains. Its shares are a screaming buy in the early stages of its AI expansion. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}