{
    "title": "AMD could soon spring a new GPU on the US - the RX 7900 from China no one's \nthat bothered about",
    "date": "2/23/2024",
    "url": "https://www.tweaktown.com/news/96418/amd-could-soon-spring-new-gpu-on-the-us-rx-7900-from-china-no-ones-that-bothered-about/index.html",
    "text": "AMD is just about to unleash a new GPU in the US, rumor has it, namely the RX 7900 GRE which was initially for the Chinese market only (but has since come to Europe). This isn't the first time we've heard chatter about the RX 7900 GRE ('Golden Rabbit Edition') being launched in the US - VideoCardz has floated this idea before - but now Moore's Law is Dead (MLID) on YouTube is claiming the release of this graphics card is imminent. MLID has sources who reckon the RX 7900 GRE will be on shelves in the US as soon as February 27, the start of next week. It's pretty much being rushed out of the door by AMD, and it'll be priced at $549. However, we're told to expect low stock levels at least initially - and it sounds like AMD is testing the waters more than anything. MLID has heard that if the RX 7900 GRE shifts well enough, then Team Red will be beefing up stock levels (which makes sense - as much as available silicon will allow, anyway). Apparently, we can expect RX 7900 GRE graphics cards from ASRock, PowerColor and XFX. (And oddly, not GIGABYTE, which was the board maker that VideoCardz has mentioned as having an inbound version of the 7900 GRE - although maybe that'll come soon after, or MLID's source has it wrong). MLID also touches on why AMD might bring the RX 7900 GRE to the US market, because if you've been following the graphics card - and chatter around it - gamers aren't exactly enthusiastic about the GPU. What MLID has heard is that more than anything else, the 7900 GRE represents a dumping ground for getting rid of wonky Navi 31 yields below the $600 mark, if the 7900 XT (Navi 31-powered) GPU starts to flag in sales compared to NVIDIA's new Super launches (4070 Super and 4070 Ti Super). So, this is essentially an easy way to get a bit more volume of RX 7900 cards out there if needed - even if the RX 7900 GRE isn't exact the ideal graphics card for many, as mentioned. It's not without some positive aspects, mind - it does relatively well for power efficiency compared to the 7800 XT. Also, MLID notes the GRE will probably age better than the latter, and perhaps be slightly faster than the 7800 XT to the tune of 5% or so eventually (it's more or less a dead heat currently). It will be interesting to see how the RX 7900 GRE sells if the GPU does come out next week, but of course as ever with rumors, we need to add a whole lot of seasoning when considering that prospect. Darren Allan Darren has written for numerous magazines and websites in the technology world for almost 30 years, including TechRadar, PC Gamer, Eurogamer, Computeractive, and many more. He worked on his first magazine (PC Home) long before Google and most of the rest of the web existed. In his spare time, he can be found gaming, going to the gym, and writing books (his debut novel – ‘I Know What You Did Last Supper’ – was published by Hachette UK in 2013). Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}