{
    "title": "Acer Drops New Swift Laptops With Ryzen AI",
    "date": "2/20/2024",
    "url": "https://www.lifewire.com/acer-new-swift-laptops-ryzen-ai-8594126",
    "text": "EVs have been around a long time but are quickly gaining speed in the automotive industry. Learn how the long-coming and inevitable shift to electric impacts you. Whether you want to build your own home theater or just learn more about TVs, displays, projectors, and more, we've got you covered. Get tech's top stories in 30 seconds: Powered by AMD Ryzen 8040 series processors Now you can use Acer Swift laptops for all your AI needs, too. Acer revealed new Swift laptops on Tuesday, both powered by Ryzen 8040 series processors and AMD Radeon 780M graphics cards. The Swift Edge and Swift Go models are set up for AI, too, with Ryzen AI capabilities, including voice clarification and photo editing features. AI workloads are optimized to work efficiently across the CPU, GPU, and the neural processing unit (NPU), thanks to AMD's Zen 4 eight-core processor architecture. The company claims this new system adds battery life above and beyond its older Swift ultrathin laptops. Acer The Acer Swift Edge 16's magnesium-aluminum alloy chassis comes in at 1.23 kilograms and measures 12.95 millimeters in height. The Ryzen 8840U octa-core processor, AMD Radeon 780M GPU, and Ryzen AI are joined by up to 32 GB of LPDDR5 RAM and up to a 2 TB SSD. This model includes a 16-inch 3.2K OLED display panel with a 120 Hz refresh rate, one HDMI 2.1 port, two USB 4 Type-C ports (which double as display and charging ports), two USB Type-A ports, and a MicroSD Card slot. Acer The Swift Go 14 includes an AMD Ryzen 9 8945HS octa-core processor, an AMD Radeon 780M GPU, and Ryzen AI. It supports up to 32 GB of LPDDR5X memory and up to a 2 TB SSD. The 14-inch display comes as either a 2.8K OLED with a 90 Hz refresh or an IPS LCD touchscreen at 1920X1200 pixel resolution. It also includes a 440p webcam, a 100W battery with quick-charge ability, Wi-Fi 6e, dual USB Type-C ports that support USB4, display and charging, an HDMI port, Bluetooth 5.3, and a Micro SD card. The Swift Edge 16 will be available in March, starting at $1,299.99, and in Europe in April, starting at €1,249. The Acer Swift Go 14 will arrive in North America and Europe in April, starting at $699.00 and €949, respectively. Get the Latest Tech News Delivered Every Day Hit Refresh on Your Tech News "
}