{
    "title": "Microsoft plans to streamline game upscaling across different graphics cards",
    "date": "2/29/2024",
    "url": "https://www.engadget.com/microsoft-plans-to-streamline-game-upscaling-across-different-graphics-cards-183052450.html",
    "text": "Microsoft has developed a new API to simplify super-resolution coding in PC gaming. The company’s DirectSR, developed with hardware partners Nvidia, AMD and Intel, will provide a more streamlined tunnel for developers to tap into the companies’ three distinct approaches to graphical upscaling in Windows games. The company describes DirectSR as enabling “seamless integration of Super Resolution (SR)” for Windows games. “DirectSR is the missing link developers have been waiting for when approaching SR integration, providing a smoother, more efficient experience that scales across hardware,” Microsoft program manager Joshua Tucker wrote in a company blog post. Super-resolution is a technology that enhances games’ visual quality without pushing the graphics card too hard. It runs games internally in a lower resolution but uses machine learning (and other tricks) to upscale the resolution of what you see on the screen. The result is sharper graphics with only a minimal extra demand on the GPU. Microsoft says the DirectSR API opens the door to “multi-vendor” super-resolution via “a common set of inputs and outputs.” Tucker wrote that a single code path would enable “a variety of solutions” through the companies’ three (otherwise distinct) answers to super-resolution: Nvidia’s DLSS, AMD’s FidelityFX Super Resolution (FSR) and Intel’s XeSS. The three GPU vendors’ SR solutions differ. Nvidia’s AI-powered DLSS appears to perform the best but requires an Nvidia graphics card. AMD’s FidelityFX is more versatile, supporting competitors’ hardware in addition to its own, while Intel’s XeSS offers AI upscaling for Intel hardware while still providing limited support for non-Intel GPUs. Version 24H2 will have an AI \"Super Resolution\" feature, as previous reports mentioned. Here are some settings for it in Graphics settings - a default toggle and per-app options. (26052) pic.twitter.com/fI9t4ksTWH — PhantomOcean3 ☃️ (@PhantomOfEarth) February 10, 2024 Earlier this month, X (Twitter) user @PhantomofEarth noticed an AI-powered “Automatic super resolution” setting in a Windows Insider preview build (24H2). Although it isn’t confirmed that it’s the same thing, it sounds like it. The setting would allow you to “Use Al to make supported games play more smoothly with enhanced details.” The preview version offers the choice of using a universal / automatic upscaling approach or a per-game one. Initially speculated to be a rival super-resolution feature from Microsoft, it now appears “Automatic super resolution” may end up as the consumer-facing version of the DirectSR API. Microsoft says DirectSR will arrive for developers “soon” in a public preview build of the Agility SDK (a component of DirectX 12). If you’re a PC gaming developer, the company plans to go into more detail about the new API in its DirectX State of the Union on March 21 at GDC. "
}