{
    "title": "AMD Ryzen 7 7800X3D vs Intel i7-14700K: Which is the Better Gaming CPU?",
    "date": "2/18/2024",
    "url": "https://www.hardwaretimes.com/amd-ryzen-7-7800x3d-vs-intel-i7-14700k-20-gaming-tests/",
    "text": "Intel’s 14th Gen processors are (mostly) identical to their 13th Gen counterparts, offering nominal clock boosts to avoid reprinting the same specs sheet. Meanwhile, the Ryzen 7000X3D family features the 2nd Gen 3D V-Cache technology to stack a 7nm cache die atop the 5nm Zen 4 CCDs. While overclocking is still missing, the operating clocks have gotten lofty upgrades across the board. In this comparison, we’ll test the 14th Gen Core i7-14700K against AMD’s Ryzen 7 7800X3D to try and decide the better gaming CPU. Table of Contents The Ryzen 7 7800X3D features eight Zen 4 cores, capable of a 5GHz boost clock. It is backed by 96MB of L3 cache (32MB + 64MB) and has a TDP of 120W. The Core i7-14700K consists of 8 P-cores and 12 E-cores, with a boost clock of 5.6GHz and 4.3GHz, respectively. It packs 33MB of shared L3 cache and a base TDP of 125W. When reporting, the 7800X3D was priced at $369, while the 14700K sat just under $400. We tested the two CPUs across ten titles at 720p (ultra-quality preset) to minimize GPU bottlenecks. The CPU workload generally remains unchanged with resolution, unlike its GPU counterpart. The average frame rate and the 1% lows identify the average and weak points in the CPU performance. The AMD Ryzen 7 7800X3D comfortably beats the Core i7-14700K in 7 out of 10 games. On average, the 7800X3D is 17% faster than the 14700K, drawing less than a third of the power as its rival. The AMD chip delivers markedly better performance per watt and performance per dollar. Most games are under 10% faster on the Ryzen 7 7800X3D, with AMD favored titles like F1 and Shadow of the Tomb Raider running 20-25% better than on the Core i7-14700K. However, Hogwarts Legacy and Hitman 3 average over 70% higher on the 7800X3D, shifting the balance. The Ryzen 7 7800X3D easily wins this segment, beating the Core i7-14700K in seven out of ten titles. Cyberpunk 2077 and “The Callisto Protocol” are the latter’s only two wins with double-digit advantages. Ray tracing benchmarks on the next page… "
}