{
    "title": "Fujifilm X100VI pre-orders skyrocket as shortage concerns mount — $4000+ \neBay scalpers bank on hype",
    "date": "2/22/2024",
    "url": "https://www.notebookcheck.net/Fujifilm-X100VI-pre-orders-skyrocket-as-shortage-concerns-mount-4-000-eBay-scalpers-bank-on-hype.806100.0.html",
    "text": "Fujifilm announced the Fujifilm X100VI earlier this week, introducing a number of welcome updates to the X100V formula that rocketed the brand to social media fame in recent years. Naturally, the numerous internal updates brought by the X100VI have caused quite a stir among photography fans, with Amateur Photographer reporting that the X100VI is breaking all of Fujifilm's previous sales records during its pre-order period. Speaking to a number of Fujifilm retailers, the publication confirmed that the X100VI is outselling the X100V across the board. One particular retailer had some interesting input, though, speculating that, Fujifilm is going to bump into another shortage with the X100VI, despite doubling the manufacturing capacity. The Fujifilm X100VI is selling extremely well, by far outselling the X100V. With the resolution bump, IBIS and other features introduced, it’s understandably been an incredible success. It’s great that they have doubled manufacturing capacity, however, this is not going to be enough and I hope they can increase supply, for this globally successful camera. – Roscoe Atkins, Managing Director at Park Cameras in the UK (via Amateur Photographer). Of course, a constrained supply chain and a massively-popular product makes the X100VI ripe for the picking to scalpers and resellers. Despite the X100VI still being in the pre-order phase, these sorts have already started their machinations. A quick search turns up dozens of listings on eBay, with many sellers adding more than double the camera's MSRP onto the price as a markup. Considering some Fujifilm X100V owners never had their orders fulfilled, the news of a hyper-popular successor in the X100VI is somewhat bitter-sweet, since many may end up paying well over the $1,599 MSRP for the rangefinder-style camera. That's not to say, however, that buyers need to pay these exorbitant markups. As long as Fujifilm can keep up with the demand for the X100VI, many of these scalper listing are likely to be taken down or see drastic price reductions. If you're after the retro looks but don't want to risk paying the X100VI tax, check out the Fujifilm X-S20 (curr. $1,399 with a 15–45 mm kit lens on Amazon) or the Nikon Zf full-frame camera (curr. $1,996.95 on Amazon). Amateur Photographer, eBay "
}