{
    "title": "AMD X3D CPU Versus: 5800X3D vs 5700X3D vs 5600X3D",
    "date": "2/24/2024",
    "url": "https://www.techspot.com/review/2808-amd-ryzen-x3d-versus/",
    "text": "Today, we're comparing the three X3D chips available on the AM4 platform: the Ryzen 5 5600X3D, Ryzen 7 5700X3D, and Ryzen 7 5800X3D. Technically, most of you will only have access to the Ryzen 7 models, as the 5600X3D is a Micro Center exclusive that can currently be acquired for $200, although it has been included in some incredibly attractive combo deals in the past. Then we have the Ryzen 7 5700X3D, available at the $250 MSRP and accessible worldwide, along with the 5800X3D at $300. A number of readers have requested that we compare them to see which model offers the best value, specifically for gaming, so that's what we'll be doing in this feature. For those of you not interested in gaming, it's likely you don't need a 3D V-Cache processor and would be better off considering the base models  As a side note, for those of you not interested in gaming, it's likely you don't need a 3D V-Cache processor and would be better off considering the base models. However, for gaming, especially in scenarios where the CPU is the limiting factor, the X3D parts are exceptional. Models such as the newly released 5700X3D offer AM4 owners a quick and easy upgrade path that can significantly increase frame rates. In our testing, we will focus on CPU-limited gaming as we aim to evaluate CPU performance, not overall system or GPU performance. This approach is not intended to persuade you to upgrade, but rather to help you determine whether your current CPU is hindering your gaming experience. There are several methods to determine this, for example, by monitoring GPU load and observing whether frame rates improve as you lower the resolution.  The idea of CPU-limited testing is to show you the true performance differences between two products. There's no benefit in GPU-limiting the Ryzen 5 3600 and Ryzen 7 5700X with a GeForce RTX 3060; if the load is 100% on the GPU, then obviously both CPUs will deliver identical performance. This approach completely hides the fact that, when CPU-limited, the 5700X3D is 50% faster than the Ryzen 5 3600. This doesn't necessarily mean the 5700X3D offers better value than the 3600, but it allows you to accurately assess the value each product provides, knowing the real performance differences. We wrote a detailed article on this topic if you're interested in learning more.  For now, let's dive into the benchmarks to see how these CPUs compare… First up, we have Baldur's Gate 3, where all three AM4 X3D processors delivered similar performance at around 130 fps. Despite having two fewer cores, the 5600X3D matched the performance of the 8-core models, with its higher core clocks helping it keep pace with the 5700X3D.  Compared to the non-3D V-Cache models, we observed a 25-30% performance uplift, with the 5600X3D offering the most significant gain over its standard variant. Additionally, for those using a processor like the Ryzen 5 3600, the 3D V-Cache models on the AM4 platform provide over a 60% performance uplift in this title.  Next, we examined Cyberpunk 2077: Phantom Liberty, a title that is somewhat more CPU intensive. While it doesn't fully utilize the 6-core 5600X3D, the 8-core models showed some performance benefits. For instance, the 5700X3D was 3% faster than the 5600X3D, while the 5800X3D was 7% faster. This time, the X3D models showed a 22-26% performance improvement over the standard variants. The 5600X3D also was 56% faster than the Ryzen 5 3600, highlighting a significant upgrade opportunity for those still using the older 3rd generation Ryzen 5 model.  Hogwarts Legacy is highly CPU limited, primarily due to poor optimization, which means the X3D models and the 8-core processors are not utilized as effectively as possible. The 5600X3D, for example, was slightly faster than the 5700X3D because it operates at a higher clock speed, indicating that even though performance is significantly CPU limited when using the 5700X3D, the extra cores aren't being leveraged.  In Star Wars Jedi: Survivor, the trend continues with the 5600X3D matching the performance of the 5700X3D and 5800X3D, so all three models delivered comparable performance. However, the 5600X3D lagged behind the 5700X3D in terms of 1% lows, illustrating how increasing processing efficiency with a larger L3 cache can compensate for a lack of cores. When compared to the standard models, the X3D chips are offering between 23-29% greater performance.  ACC is another game often limited by CPU performance, but not because it utilizes high core count CPUs. Like many modern games, it depends more on the 'primary thread'. As a result, the 5600X3D performs very well and matches the 5800X3D, making it 6% faster than the 5700X3D, simply because it operates at a higher clock speed. The game is also sensitive to cache size, resulting in the 3D V-Cache models being about 40% faster. Furthermore, there's an almost 80% performance uplift when upgrading from the Ryzen 5 3600 to the 5600X3D.  In Spider-Man Remastered, the title can benefit from extra cores, depending on the base CPU performance. With Zen 3, we see a modest 4% uplift for the 5800X compared to the 5600X, and then a 7% increase from the 5600X3D to the 5800X3D. The most significant gains come from an increased L3 cache capacity, with the X3D chips offering up to 23% more performance.  The results in A Plague Tale: Requiem are noteworthy as the 5700X3D struggles to outperform the standard 5700X, suggesting that clock speed is a primary limitation here. However, the 5600X3D is 15% faster than its non-3D variant, while the 5800X3D is 12% faster than the 5800X. This also means that, due to its higher operating frequency, the 5600X3D was slightly faster than the 5700X3D in this title.  In Assassin's Creed Mirage, the title favors the 5800X3D over the 5600X3D, giving the 8-core model a 12% performance advantage, though 1% lows were comparable. The 5700X3D also managed to outperform the higher-clocked 5600X3D, but only by a 4% margin. When compared to the base models, the X3D variants were generally about 30% faster, marking a significant improvement. The 5600X3D was also 56% faster than the Ryzen 5 3600.  Performance in Watch Dogs: Legion is consistently high across the Zen 3 parts, with an average of around 155 fps for an X3D model compared to 116 fps for a standard model. This represents just over a 30% performance boost with the 3D V-Cache parts. The 5600X3D was also 68% faster than the Ryzen 5 3600 and slightly outpaced the newer Ryzen 5 7600X.  Lastly, we examined Hitman 3 and, as observed previously, core count does not seem to significantly impact fps performance for these Zen 3 processors; cache size and clock speed play more critical roles. For instance, the 5600X3D matched the performance of the 5800X3D almost exactly, making it 17% faster than the standard 5800X and 30% faster when comparing 1% lows. Here's the average performance across 12 games, and as expected based on our observations, the 5600X3D matches the performance of both the 5700X3D and 5800X3D. Technically, it's 2% faster on average than the 5700X3D and 3% slower than the 5800X3D, indicating a comparable level of performance.  For those still using a processor like the Ryzen 5 3600, the newly released 5700X3D will offer around 50% more gaming performance when CPU limited, which is quite remarkable for $250. It's also worth noting that the 5700X3D, alongside the 5600X3D and 5800X3D, performed on par with the Ryzen 5 7600X. Although the newer AM5 processor might be slightly less expensive, the associated memory and motherboard costs will be higher. Therefore, if you're looking for a significant upgrade from the AM4 X3D chips to AM5, you would need to consider the much more expensive 7800X3D, which was, on average, 31% faster than the 5800X3D. The Ryzen 5 5600X3D is pretty hard to beat at $200 in terms of value – it basically matches or edges out the 5700X3D in all of our gaming tests. The 5700X3D costs ~25% more and it came nowhere near delivering that kind of performance gain. The problem is that as a Micro Center exclusive, most of you won't have access to this part, so the fact that it's pretty great value is just annoying.  You do get 33% more cores with the 5700X3D for just $50 more though, with a 25% price increase in the process, and while that doesn't prove useful in the games we tested, this model will surely age better. In any case, it's the cheapest X3D processor most of you will have access to and at $250 it's pretty great. You're also getting Ryzen 5 7600X-like performance, without having to spend big money on an AM5 motherboard and DDR5 memory. The 5800X3D is essentially the same CPU but with a clock speed advantage. It costs 20% more and offers just 5% more performance on average, so naturally most of you are better off buying the 5700X3D. These X3D CPUs are an excellent option for those running a Zen 3 or older CPU as we saw on average a 52% increase over the Ryzen 5 3600, and that's a significant performance increase (in CPU limited scenarios) that's well worth the $250 investment for AM4 owners. You're also getting Ryzen 5 7600X-like performance, without having to spend big money on an AM5 motherboard and DDR5 memory. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}