{
    "title": "AMD Fluid Motion Frames revisited: Not the \"performance improvement\" you \nwere expecting",
    "date": "2/10/2024",
    "url": "https://www.xda-developers.com/amd-fluid-motion-frames-revisited/",
    "text": "AMD's driver-based frame generation tech is finally out of technical preview. When I tested AMD's Fluid Motion Frames (AFMF) feature back in November last year, I was left pleasantly surprised by how well it worked for a technology that was implemented at a driver-level. While I was impressed with the results it delivered and thought it was a step in the right direction to allow more players to experience modern games, I reserved my judgments for when it was officially out of the \"Technical Preview,\" to compare and see how much it improves — if at all — by being in the oven for more time. Well, it's time to revisit AFMF as it's officially out as a part of a public release driver, meaning anybody with a Radeon 6000 or a 7000 series graphics card can download the latest full release driver and use it on pretty much any DirectX 11 or DirectX 12 game. About this feature: AMD provided me with an ASRock Challenger Radeon RX 7700 XT GPU to test FSR 3.0 and AFMF. AMD did not see the contents of this feature before publishing. AMD's Fluid Motion Frames at its core is a technology that can make your gameplay look smoother in motion on a high refresh rate gaming monitor with the help of frame-generation. Just like Nvidia's DLSS 3 and AMD's FSR 3-based frame-generation, the AFMF technology also interpolates generated frames — or fake frames, as people call it — and places it between two standard frames to improve frame times, resulting in a smoother gameplay experience. Keep in mind that AFMF won't make your game more responsive as the system still produces the same number of frames per second, if not fewer due to frame interpolation load. The game, however, will feel smoother overall as you see more frames on your monitor than the one that are naturally produced. Unlike DLSS and FSR 3-based frame generation, AFMF works on a driver-level, and it interpolates the new frame without any interaction with the game itself. The fact that AFMF doesn't rely on things like motion vectors from the game engine to determine the next frame, allows it to work with pretty much any DirectX 11 or 12 games. That immediately makes it more accessible compared to FSR 3.0, which is still laughably limited to only a few games out there. In fact, even Nvdia's DLSS 3 frame generation isn't available on many titles that AFMF can be used with. That being said, there are a few requirements that you must fulfill in order to use AMD's Fluid Motion Frames to experience smoother gameplay, and those requirements extend beyond the system hardware. As far as the hardware requirements are concerned, AMD's Fluid Motion Frames requires your system to have at least an RDNA 2 architecture-based product. That means you'll need Radeon RX 6000 GPUs or newer, or at least 700M-based APUs. On the operating system and the software side, AMD says you can only use it on a system running either Windows 10 or Windows 11, and it recommends using the latest AMD Software: Adrenalin Edition 24.1.1 release with updated drivers. AFMF, as previously mentioned, only works with DirectX 11 and 12 titles, and you can't use it with games using any other APIs, at least at the moment. But in addition to the aforementioned minimum requirements for AFMF, you also need to ensure that your game is running in fullscreen mode with V-Sync disabled. I tried bypassing the fullscreen mode and V-Sync requirements, but AFMF simply refused to generate additional frames and threw an error saying it was inactive. AMD also recommends a base performance of 60FPS in games before enabling AFMF. While this particular requirement doesn't gatekeep the feature from running, it does cause some performance issues that we'll discuss in one of the following sections. I tried bypassing the fullscreen mode and V-Sync requirements, but AFMF simply refused to generate additional frames and threw an error saying it was inactive. Since AMD's Fluid Motion Frame doesn't interact with any games, you have to manually enable it by flipping the AMD Fluid Motion Toggle in AMD Software. To do it: This worked for the most part, except a couple of times when AFMF simply refused to generate frames and kept throwing an error, asking me to switch to fullscreen and disable V-Sync even though I was using all the correct settings. I had to restart my PC to fix this issue every time it happened, and it was quite annoying having to deal with it on a full release driver. Having tested AMD's Fluid Motion Frames technology once before, I knew exactly what to expect in terms of the performance. I wasn't expecting a radical improvement since the last time I tested it in a bunch of games, because it was already quite good. We're talking double the frame rates in games like Forspoken and Hogwarts Legacy, which is exactly the kind of results I was able to produce this time around with the full release version. I ended up testing a lot more games this time around, though, and it worked as advertised with pretty much all those games to deliver double the frame rates on board. I tested the following games on my personal rig, which included an AMD Ryzen 7 7800X3D, 32GB RAM, and 1TB SSD. I swapped out the MSI GeForce RTX 4070 Ti Super Ventus 3X GPU that was sitting inside the rig with an ASRock Challenger RX 7700 XT GPU for the purpose of this testing. Using a Radeon RX 6000 or a 7000 series desktop GPU is a non-negotiable for this feature, as I previously mentioned. I tested these games at 1080p resolution on AMD's software version 24.1.1 (latest release). Games FPS without Fluid Motion Frames FPS with Fluid Motion Frames Avatar: Frontier of Pandora (Max preset) 131 254 Cyberpunk 2077: The Phantom Liberty DLC (Ultra preset/RT: Partially enabled for reflections) 66 134 Hogwarts Legacy (Ultra preset) 87 149 Assassin's Creed Mirage (Ultra High preset) 102 210 Forza Motorsport 7 (Ultra preset/ RT: Partially enabled for car reflections) 62 128 Metro Exodus (Ultra preset) 107 209 A Plague Tale: Requiem (Max preset) 82 160 AMD claimed up to a 97% increase in performance at 1080p resolution when using AFMF, and I'd say I was sitting pretty close to those numbers on the fps counter throughout my testing. I wouldn't necessarily call it a \"performance improvement,\" though, and there are a few reasons for that. The first — and also the most obvious reason — is that you're not necessarily seeing any improvement in a game's performance whatsoever. If anything, you're going to notice a slight dip in performance as the GPU has to handle the additional load of frame interpolation as well. And that's pretty evident when you look at Cyberpunk 2077's benchmark numbers that I have highlighted below. The screenshot on the left shows the results (66fps) recorded with AFMF disabled, while the one on the right (63fps) was recorded after enabling it. While not a huge difference or a dip in performance, it's still worth making a note of as you theoretically leave some performance on the table while using this feature. You don't necessarily notice this dip in performance as your game looks and feels smoother, as it should with AFMF. I noticed this marginal dip even in other titles both this time and previously on the preview software, so there hasn't been an improvement on that front, really. You may not see a huge dip in performance while using a more powerful AMD GPU like an RX 7900 XT, although I am unable to test that with my current hardware. Another reason why I wouldn't call it a significant improvement is because AFMF still has plenty of performance and reliability issues that are hard to ignore. Below are a few of them: Because the Fluid Motion Frames require you to disable V-Sync for it to work properly, you'll notice a lot of frame pacing and screen tearing issues. I'd say the frame pacing issues have been addressed quite a bit since its original preview release because I couldn't really spot too many artifacts and blurred visuals, at least from the screenshots and the footage that I was able to capture. But what is still very apparent is the screen tearing issue, which is an unfortunate by-product of disabling V-Sync, and letting your game's fps go above your monitor's refresh rate. This is something you'll have to actively monitor and address, which is a bit tedious and disappointing. A workaround for this is using a third-party utility to limit your in-game fps. I ended up using RivaTuner Statistics Server (RTSS) to cap the frame rates of my games at 70fps, so they don't exceed my monitor's 144Hz with AFMF frame generation enabled. It's definitely not the end of the world, but I truly wish we could bypass the no V-Sync requirement for AFMF to work. Another issue that I noticed while using AFMF is that it frequently disable automatically, introducing stutters in-game. The fact that Fluid Motion Frame automatically disables isn't entirely surprising as it is just a post-processing technique, which is only as good as the information it can reproduce from the previous frames. But I noticed that it frequently disables because of this if/when you make a lot of sudden movements in the game, or, say, during a camera cut. It is just a post-processing technique, and it's only as good as the information it can reproduce from the previous frames. I was able to log the data using the AMD software while testing some games, and you can see how many micro stutters are introduced in the gameplay with AFMF enabled versus when it's disabled. The data you see below was captured during the game's short 10-minute gameplay of Cyberpunk 2077 both with and without AFMF, but I noticed similar results while trying other games like Forza Motorsport 7 and even the new Avatar game. In fact, I even noticed a lot of heavy stutters simply while driving around and panning the camera to capture the view of Night City in Cyberpunk. Even things like a lot of muzzle flash on the screen while shooting guns in a first-person title can cause a lot of micro and heavy stutters, and there appears to be no workaround for what's causing it to disable at the moment. I am also not a huge fan of how the frames generated by AFMF can still be read by the AMD software's overlay. This is once again not a huge deal, but the fact that even advanced utilities out there can't accurately tell you the fps of the generated frames, makes it all the more difficult to keep track of \"added frames.\" I believe this is also a good time to call out how unnecessarily complicated it is to enable fps overlay in AMD software and adjust the items that show up on both the overlay and the data log. Thankfully, it shows all the relevant information you need to track, but it still sticks out as a weird limitation. One of the limitations I highlighted during my first AFMF was that it had trouble handling some in-game UI elements such as crosshairs and quest markers. AMD still hasn't managed to fix that particular issue in the final release software, and I noticed plenty of those issues during my playthrough over the last few days. It's still one of those issues that's hard to showcase, but below is a screenshot showing a garbled cursor in Hogwarts Legacy. As far as the image quality is concerned while gaming, I'd say AFMF retains the overall quality of the image per frame very well. I didn't notice any decrease in image quality whatsoever when I enabled AFMF, at least not from what I could tell simply while gaming. The way you perceive the visuals on your monitor may differ also based on the graphics settings and other factors, but the quality is generally quite good, and I doubt you'll see the frame and cringe at any point unless you are really nit-picking the footage frame-by-frame. Just to put things into perspective, here's an image showing a side-by-side comparison of a shot from Cyberpunk 2077 that was captured separately with DLSS frame generation with Quality preset upscaling and AFMF enabled. I even played Ubisoft's new Avatar game to see how AFMF stacks up with the FSR 3 frame generation's image quality, and the results were pretty unsurprising. There was no noticeable difference in the way both instances of the game played, with the FSR 3's quality only dropping when I switched to a lower resolution scale. This isn't necessarily a surprise considering how frame generation — regardless of whether it's implemented in a game or a driver-level — doesn't mess with the resolution scale and only recreates the frame as closely as possible. You are bound to see some artifacts and noise on the generated frames if you monitor certain elements, like foliage, closely, but I guess that's a small price to pay in exhange for a \"higher frame count\" on the fps counter for a smoother experience. Nvidia's frame generation, I'd say, is the best at getting rid of a lot of them, but it's far from a perfect implementation either. You are bound to see some artifacts and noise on the generated frames if you monitor certain elements, like foliage, closely, but I guess that's a small price to pay in exhange for a \"higher frame count\" on the fps counter. Before I wrap this up, I quickly wanted to touch on the topic of latency. It's no secret that frame generation introduces latency in games, regardless of how it is implemented. That's exactly why both Nvidia and AMD use their own technologies like Nvidia Reflex and AMD Anti-Lag to reduce its effect on the end-user. I touched on this topic briefly the last time I tested AFMF, and my experience has largely been unchanged since then. I can safely say that AMD's Anti-Lag features take care of the latency issues, at least to a point that you won't really notice it while playing casual games. I'll have a more measured take on the latency issues introduced by frame generation tech once I get my hands on dedicated hardware to test it, but I don't think this is something that should keep you from using AFMF. Of course, this doesn't apply to fast-paced, competitive titles, but I believe you shouldn't be using AFMF while playing competive games, to begin with. AMD's uphill battle to close the performance gap with Nvidia GPUs has resulted in the release of many interesting technologies, and I believe Fluid Motion Frames is truly one of the best we've seen from the red team yet. The fact that you can enable frame generation in pretty much any DirectX 11 or 12 game with just a simple toggle that sits inside the AMD software is simply awesome. It may not give you the \"free performance boost\" that you are expecting from it, but it can definitely make your game feel smoother than it actually is, especially if you are willing to take some time to tweak and adjust the settings to let it shine. I highly recommend adjusting your settings in a way that the max fps you get with frame generation enabled doesn't exceed your monitor's refresh rate to avoid having frame pacing and screen tearing issues. I believe AFMF truly shines as useful tool for those rocking a budget GPU like the RX 7600 or something older. I am a bit disappointed that it still has plenty of glaring issues that keep me easily recommending it. Frequent stutters and its inability to play nicely with UI elements in game are a few crucial issues that need to be addressed before it becomes a no-brainer feature. But even then, I doubt Fluid Motion Frames is something I recommend to those with a decently powerful GPU like the RX 7700 XT that I used here. Sure, it's good to have a frame generation solution for games that don't natively support DLSS 3 or FSR 3-based frame generation, but you are better off tweaking the settings to get more playable frames instead of introducing these unnecessary issues. I believe AFMF truly shines as useful tool for those rocking a budget GPU like the RX 7600 or something older than can only handle casual 1080p gaming. There are only so many settings you can tweak to improve the gaming performance, and that's when a clever solution like this comes in handy to make your game feel better.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. A senior evergreen writer at XDA Developers serving up reviews, buying guides, deals, and more on laptops, PC hardware, and smartphones that you care about. He's been covering the computing and smartphone industry for over seven years now and has worked with various brands to establish an authority in the technology space. Before joining XDA Developers, Karthik was a senior reviewer at Digit, a popular tech magazine in India. You will likely find him yelling at his monitors while playing an online shooter in his free time. AMD made significant improvements to its APU lineup with the Ryzen 5 8600G. But is it good enough to beat the Ryzen 5 7600? If you're looking to add one of AMD's Ryzen 7000 to your system without spending a ton, check out our collection of the best budget AM5 motherboards. The Nvidia GeForce RTX 4070 Super brings even more value to the best of the 40-series. Samsung's latest flagship laptops and 2-in-1s feature Intel Core Ultra CPUs and updated displays. Looking to upgrade? This Keychron mechanical keyboard is going to be a great option and now comes in at just $30. Thermal paste is a vital component of any CPU cooling solution, but here's how long you can expect it to last "
}