{
    "title": "Where Will AMD Stock Be in 1 Year?",
    "date": "2/3/2024",
    "url": "https://finance.yahoo.com/news/where-amd-stock-1-144100653.html",
    "text": "AMD's (NASDAQ: AMD) stock sank nearly 3% on Jan. 31 after the chipmaker posted its fourth-quarter earnings report. Revenue rose 10% year over year to $6.17 billion and exceeded analysts' estimates by $60 million. Adjusted earnings grew 12% to $0.77 per share and matched the consensus forecast. AMD's growth rates looked healthy, but a lot of optimism had already been baked into its shares ahead of that report. Even after its latest post-earnings dip, its stock has still rallied more than 130% over the past 12 months. So will AMD's stock keep charging higher over the next year, or will it underperform most of its industry peers? AMD's revenue growth accelerated for the second consecutive quarter, its adjusted gross and operating margins held steady from a year ago, and its adjusted EPS grew by double digits again. Metric Q4 2022 Q1 2023 Q2 2023 Q3 2023 Q4 2023 Revenue Growth (YOY) 16% (9%) (18%) 4% 10% Adjusted Gross Margin 51% 50% 50% 51% 51% Adjusted Operating Margin 23% 21% 20% 22% 23% Adjusted EPS Growth (YOY) (25%) (47%) (45%) 21% 12% Data source: AMD. YOY = Year-over-year. AMD suffered a slowdown in the first half of 2023 as the PC market cooled off following the pandemic and curbed its sales of x86 CPUs. It also sold fewer discrete GPUs for PC gaming and custom APUs for gaming consoles. It partly offset that deceleration with the growth of its data center business -- which benefited from the expansion of the artificial intelligence (AI) market -- as well as the expansion of its embedded chip unit through its acquisition of the programmable chipmaker Xilinx. For the full year, AMD's revenue and adjusted EPS fell 4% and 24%, respectively. That slowdown was disappointing, but AMD fared better than Intel (NASDAQ: INTC), which posted a 4% revenue decline and a 37% drop in its adjusted EPS. During the fourth quarter, AMD generated 37% of its revenue from its data center division, which sells its Epyc CPUs for servers and Instinct GPUs for accelerating AI tasks. The segment's revenue rose 38% year over year as it gradually carved out a niche against Intel's CPUs and Nvidia's (NASDAQ: NVDA) GPUs in the crowded data center market. For the full year, its data center revenue rose 7%, and AMD expects to sell $3.5 billion of its new MI300-series AI GPUs (compared to its previous estimate of $2 billion) in 2024. That would be equivalent to more than half of its total data center revenue in 2023. It could also spell trouble for Nvidia, which has reportedly been asking some of its customers to wait up to a year for its latest data center GPUs amid the AI market's feverish growth. Another 24% of AMD's fourth-quarter revenue came from its client segment, which sells its Ryzen CPUs for PCs. The segment's revenue grew 62% year over year for the quarter but still fell 25% for the full year as the PC market cooled off. AMD's gaming segment, which accounted for 23% of its revenue, remained a weak link with a 17% decline in the fourth quarter and a 9% drop for the full year. Its sluggish sales of gaming console APUs offset its stronger sales of Radeon GPUs for PCs. The embedded segment, which brought in 18% of AMD's revenue, also posted a 24% year-over-year decline as its customers reduced their inventories of programmable chips. It still grew 17% for the year, but that growth was mostly inorganic and fueled by its purchase of Xilinx in Feb. 2022. Simply put, the accelerating sales of AMD's data center chips and the stabilization of its PC chips are still offsetting its softer sales of gaming console and programmable chips. AMD also doesn't manufacture its own chips like Intel, so it consistently generates higher gross and operating margins despite selling most of its chips at lower prices. Hardware manufacturing is an expensive business to run. AMD's fourth-quarter results looked solid, but it expects its revenue to stay nearly flat year over year in the first quarter of 2024. Analysts were expecting 7% growth. It attributed that slowdown to the weakness of its client, gaming, and embedded segments. Just like Intel -- which also recently disappointed investors with its grim first-quarter outlook -- AMD expects the PC market to remain wobbly in the first half of 2024 before stabilizing in the second half of the year as companies launch new AI-optimized PCs. That guidance casts doubts on AMD's ability to meet analysts' expectations for 18% revenue growth and 47% adjusted EPS growth in 2024. Therefore, AMD's stock might be too expensive at 44 times forward earnings -- especially when Intel already seems overvalued at 31 times forward earnings. AMD's long-term future still looks bright, but I suspect its uneven growth and high valuations will cap its gains and cause it to underperform many of its cheaper industry peers over the next 12 months. Should you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Advanced Micro Devices wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 29, 2024  Leo Sun has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Where Will AMD Stock Be in 1 Year? was originally published by The Motley Fool Related Quotes "
}