{
    "title": "Microsoft Copilot for Sales and Copilot for Service now generally available",
    "date": "2/2/2024",
    "url": "https://www.notebookcheck.net/Microsoft-Copilot-for-Sales-and-Copilot-for-Service-now-generally-available.799461.0.html",
    "text": "Microsoft continues the expansion of its portfolio of AI-related products with two new releases that belong to the Copilot family, namely Copilot for Sales and Copilot for Service. Announced yesterday, their general availability provides improved capabilities to enterprise customers looking to complement (and even replace, in some cases) their human workers with AI-powered solutions. According to a study by Gartner, 79% of sellers are now handling more customers and accounts. In the blog post announcing these two Copilot products (the link can be found in the article source section, after the last paragraph), Microsoft's Emily He, Corporate Vice President, Business Applications Marketing quotes the study above, which highlights the need to \"relinquish some control over customer interactions and give AI-powered technology—generative AI, emotion AI and digital humans—more responsibility to execute core selling activities\" while allowing employees to focus on \"engaging buyers on a human level to understand their needs, motivations and objections\" and finally validate their choices. Copilot for Sales enhances Copilot for Microsoft 365 with connectivity to various CRM platforms such as Salesforce Sales Cloud and Microsoft Dynamics 365, so sales-focused content can be provided to Word, Outlook, or Microsoft Teams. The list of tasks that can be handled via this approach includes generating meeting briefs in Word, summarizing and writing emails in Outlook, as well as viewing meeting notes and insights during Teams calls. Copilot for Service \"unlocks an organization’s trusted knowledge to accelerate onboarding and case resolution, improve efficiency, and automate tasks for agents in their flow of work.\" In addition to other capabilities, it can also enable generative AI-driven conversations across data such as public websites, SharePoint, knowledge base articles, and even offline files, take advantage of pre-built integrations for ZenDesk, ServiceNow, and Salesforce. For both Copilot flavors mentioned above, Copilot for Microsoft 365 is included. Their monthly subscription fees are also the same: $50 per user, including the Copilot for Microsoft 365 license. Organizations that already acquired it can get Copilot for Sales or Copilot for Service for an additional $20 instead. Copilot users, on the other hand, might find handy a book like Heather Matalski's Microsoft Copilot for Newbies: A Comprehensive Beginners Guide, which was published less than a month ago. Microsoft Dynamics 365 Blog "
}