{
    "title": "GKMtec K8 Mini-PC features AMD Hawk Point APU, up to 32GB RAM, 1TB storage \nwith AR glasses",
    "date": "2/6/2024",
    "url": "https://www.tweaktown.com/news/96040/gkmtec-k8-mini-pc-features-amd-hawk-point-apu-up-to-32gb-ram-1tb-storage-with-ar-glasses/index.html",
    "text": "GMKtec has just launched its first Ryzen 8000 series \"Hawk Point\" APU-powered Mini-PC system, with its new K8 Mini-PC system a successor to the GMKtec NuvBox K6 Mini-PC. The new GMKtec NuvBox K8 Mini-PC has a drop-in replacement APU over the K6 system, with AMD's new Ryzen 7 8845HS APU an upgrade over the Ryzen 7 7840HS inside of the K6. The new Ryzen 7 8845HS APU has the same 8-core, 16-threads of CPU power, but now it features a built-in NPU for AI workloads. AMD has boosted the XDNA AI processor from 10 TOPS to 16 TOPS of AI performance, with the same 8 cores and 16 threads of Zen 4 processing power clocking at up to 5.1GHz, with 12 RDNA 3-based Compute Units that have a boost clock of 2.7GHz. GMKtec promises its new K8 Mini-PC will support up to dual-channel DDR5-5600 memory, with two PCIe 4.0x4 2280 slots for M.2 SSD storage. The integrated Radeon 780M GPU inside the Ryzen 7 8845HS \"Hawk Point\" APU will offer \"close\" to NVIDIA's GeForce GTX 1650 Ti's mobile GPU form performance. The company is cranking up the TDP of the Ryzen 7 8845HS APU to 65W through an unlocked BIOS setting, enabling up to 65W TDP on the APU. GMKtec offers great I/O connectivity on its K8 Mini-PC system through dual 2.5GbE enthusiast-grade network connections, DisplayPort, HDMI, and USB4 Type-C that support up to 40Gbps of bandwidth. Now, let's get down to the price: GMKtec is offering the K7 system with a Ryzen 7 7840HS for around $579, while the new K8 system with the upgraded Ryzen 7 8845HS \"Hawk Point\" APU is listed in China for 2499 RMB, which works out to around $350. GMKtec is offering its new K8 Mini-PC system with a very time-limited promotion in China, where the first 50 customers will get a game controller worth around $22, the barebone K8 system for around $350, while the 32GB RAM + 1TB SSD option is going to cost around $490. The barebone K8 Mini-PC system with AR glasses will cost around $570, while the beefed-up 32GB RAM + 1TB SSD storage option of the system with the AR glasses, will cost around $710. AMD's new Ryzen 8040 series \"Hawk Point\" APUs have been found in multiple Mini-PC systems so far, and they've only been on the market for less than a month. The APUs aren't available just yet, which is why we're seeing the designs and products early, with the Hawk Point APUs expected sometime in Q1 2024, meaning we don't have much more time before these Hawk Point APU-based systems hit the market. Anthony Garreffa Anthony joined the TweakTown team in 2010 and has since reviewed 100s of graphics cards. Anthony is a long time PC enthusiast with a passion of hate for games built around consoles. FPS gaming since the pre-Quake days, where you were insulted if you used a mouse to aim, he has been addicted to gaming and hardware ever since. Working in IT retail for 10 years gave him great experience with custom-built PCs. His addiction to GPU tech is unwavering and has recently taken a keen interest in artificial intelligence (AI) hardware. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}