{
    "title": "AMD Radeon RX 7700 XT price tumbles to $419",
    "date": "2/27/2024",
    "url": "https://www.pcgamesn.com/amd/radeon-rx-7700-xt-price-drop",
    "text": "GPU prices keep dropping, and AMD's 12GB mid-range graphics card is now much more competitive with the Nvidia GeForce RTX 4060 Ti 8GB. Ben Hardwidge Published: Feb 27, 2024 GPU prices are falling all over the place right now, and we’re absolutely here for it. The latest graphics card to get a price cut is the AMD Radeon RX 7700 XT, which has now dropped all the way from $449 to $419, saving you $30 on the price of this mid-range GPU. That means it is now a fair bit cheaper than Nvidia’s competing RTX 4060 Ti 16GB and, despite not having as much VRAM, the RX 7700 XT is generally a quicker GPU. This latest AMD GPU price drop accompanies the international launch of the Radeon RX 7900 GRE, which costs $549. The RX 7700 XT needed a price drop too, as it was previously priced too close to the RX 7800 XT, meaning it missed out on a place on our best graphics card guide. With its new price of $419 (£409), the RX 7700 XT is much more competitive. The only competition Nvidia has in this bracket is the GeForce RTX 4060 Ti 8GB and 16GB models. Both GPUs are slower than the RX 7700 XT when it comes to standard game performance without ray tracing, but they’re quicker when it comes to ray tracing. The difference when it comes to the latter isn’t huge, though, and the RX 7700 XT can handle some ray tracing. For example, in our tests, at 2,560 x 1,440, the RX 7700 XT averages 57fps in Marvel’s Guardians of the Galaxy with ray tracing enabled at ultra settings, while the RTX 4060 Ti 8GB averages 65fps. The latter is quicker, but both results are comfortably playable. Importantly, the RX 7700 XT has the right amount of memory at this price, with its 12GB of VRAM giving it enough headroom to cope with ray tracing and detailed textures, especially in future games. Comparatively, the RTX 4060 Ti 8GB is on the edge of falling off a cliff in some of our tests, while the RTX 4060 Ti 16GB is too expensive for the GPU performance on offer, leaving you better off with the 7800 XT. It’s a shame AMD hasn’t taken this opportunity to drop the RX 7700 XT price a little further, as $399 would be the sweet spot for this GPU. Even so, it’s great to see GPU prices continuing their downward trend. If you’re looking to build a gaming PC with one of the latest GPUs, make sure you also check out our recent RTX 4070 Super review, where we look at Nvidia’s latest mid-range contender. Ben Hardwidge                 A tech journalist since 1999, and a PC hardware enthusiast since 1989, Ben has seen it all, from the horrors of CGA graphics to the amazing ray-tracing GPUs of today. Ben is mainly interested in the latest CPU and graphics tech. "
}