{
    "title": "AMD Radeon RX 7900 GRE Linux Performance Review",
    "date": "2/26/2024",
    "url": "https://www.phoronix.com/review/amd-radeon-rx7900-gre/7",
    "text": "While the GPU temperature is heavily dependent upon the particular graphics card AIB model chosen, above is a look at the thermals for all of the graphics cards I tested for this article. The ASRock Challenger Radeon RX 7900 GRE had an average temperature of around 65 degrees with a recorded peak of 69 degrees. The core temperature average was similar to the Radeon RX 7800 XT tested but with a lower peak. Across all of the benchmarks conducted, the Radeon RX 7900 GRE had an average power consumption of 200 Watts with a recorded peak of 240 Watts, or just about 5% higher than the Radeon RX 7800 XT. When taking the geometric mean of all the benchmarks carried out for this Radeon RX 7900 GRE embargo lift, this graphics card was matching the performance of the prior gen GeForce RTX 3080 while being 94% the speed of the RTX 4070 SUPER overall. That puts the $549 USD Radeon RX 7900 GRE graphics card slightly ahead of the RTX 4070 SUPER at $599 USD. The Radeon RX 7900 GRE was 15% faster than the Radeon RX 7800 XT and 82% the speed of the Radeon RX 7900 XT. See all of this RX 7900 GRE Linux testing via this OB result page.  The Radeon RX 7900 GRE will be available worldwide beginning tomorrow, 27 February, starting at $549 USD. Going along with today's embargo lift is also word from AMD that the Radeon RX 7700 XT suggested retail pricing is dropping from $449 to $419 USD. Thanks to AMD for providing the Radeon RX 7900 GRE for this Linux testing ahead of the US and worldwide launch. The Radeon RX 7900 GRE is running well on AMD's fully upstream and open-source graphics driver stack for Linux gamers and enthusiasts alike. If you enjoyed this article consider joining Phoronix Premium to view this site ad-free, multi-page articles on a single page, and other benefits. PayPal or Stripe tips are also graciously accepted. Thanks for your support. Michael Larabel is the principal author of Phoronix.com and founded the site in 2004 with a focus on enriching the Linux hardware experience. Michael has written more than 20,000 articles covering the state of Linux hardware support, Linux performance, graphics drivers, and other topics. Michael is also the lead developer of the Phoronix Test Suite, Phoromatic, and OpenBenchmarking.org automated benchmarking software. He can be followed via Twitter, LinkedIn, or contacted via MichaelLarabel.com. Phoronix Premium allows ad-free access to the site, multi-page articles on a single page, and other features while supporting this site's continued operations. The mission at Phoronix since 2004 has centered around enriching the Linux hardware experience. In addition to supporting our site through advertisements, you can help by subscribing to Phoronix Premium. You can also contribute to Phoronix through a PayPal tip or tip via Stripe.  Legal Disclaimer, Privacy Policy, Cookies | Privacy Manager | Contact Copyright © 2004 - 2024 by Phoronix Media. All trademarks used are properties of their respective owners. All rights reserved. "
}