{
    "title": "Steam Deck vs Asus ROG Ally: Which should you buy?",
    "date": "2/12/2024",
    "url": "https://www.dexerto.com/tech/steam-deck-vs-asus-rog-ally-2211531/",
    "text": " Stuck between the Steam Deck and the Asus ROG Ally? Well, we’ve had our hands on both, and are ready to break down which one you should buy. PC handhelds have taken over the world, with the Steam Deck’s release turning the drip of releases into a full-on flood. It’s a wild time to be in the space. Ayaneo released and then announced several new handhelds, and there’s an MSI handheld on its way too. It’s just a wonderful smorgasbord of hardware, and Asus throwing their mighty big hat into the ring was a huge surprise. We’ve reviewed both the ROG Ally and Steam Deck. While our opinion on the Steam Deck has shifted in recent months compared to the original review, we’re still reeling from our time with the Asus ROG Ally. On paper, the ROG Ally trounces the Steam Deck’s specs. There’s one big difference between the ROG Ally and the Steam Deck: the APU. The accelerated processing unit is a combination of a GPU and CPU. Both the ROG Ally and the Steam Deck offer solutions from AMD, but inside, they are radically different. The ROG Ally’s Z1 Extreme and regular Z1 are considerably better than the Steam Deck’s Van Gogh chip in terms of raw power. They feature RDNA 3 graphics – a step above the Steam Deck – and can generally do a lot more. However, there are some key factors as to why outside of raw performance, this doesn’t particularly matter for a vast majority of players. Outside of this, both feature similar hardware inside. The major difference is the PCIe 4.0 drive on the ROG Ally versus the slower 3.0 slot on the Steam Deck. You will get faster load times on the ROG Ally, but neither flood the PCIe lanes with data, giving enough headroom on the Steam Deck for it to be pushed further. Upgrades are not something Valve wanted – nor Asus. Getting into each device isn’t hard, but there are caveats with upgrading these systems. The need for 2230 NVMe drives has led to a new industry trend of providing these niche drives far more easily. That’s about it for upgrading both handhelds, but the Steam Deck has a booming accessory and customization business going on. JSAUX even provides back and front panels, while replacing the sticks with Hall-effect joysticks to kill drift are all easily accessible. One thing we haven’t been able to test yet is the external GPU you can connect to the ROG Ally, bringing a significant power boost to the system when docking it. The Steam Deck is way more comfortable to use than the ROG Ally. The smooth ergonomics, along with the addition of trackpads and comfortable back buttons make it feel like the complete device. While its button placement might seem odd at first, it easily becomes second nature after just an hour or so with it. Since the release of the Steam Deck OLED, the Steam Deck has seen some design changes. Most notably, the power button on the OLED model is now orange, rather than black. While only a minimal difference, it adds some variation against the all-black design of handheld, making it stand out more in comparison to its ROG Ally rival. The ROG Ally is a little more standard in its design. It’s comfortable but lacks a certain elegance with its sharp edges. It’s entirely down to personal preference really. However, the back paddles on the ROG Ally feel weird. They have a raised lip, rather than embedded into the case. It gives them this limp feeling when pressing them, or your fingers could potentially get caught underneath. The design of the ROG Ally has also been the center of certain controversies. Its SD card slot and hardware are compromised by the heat it drums up during intense sessions, causing hardware failures. AMD is everywhere. They’re in laptops, PCs, and yes, nearly every handheld available. This is because their laptop chips are incredibly powerful. A combination of both the latest RDNA graphical architectures and the sheer power of the CPU makes the various APUs a delight to play games on. AMD developed Van Gogh with Valve, and it’s partially why the device is as cheap as it is. The lower-powered APU runs off of RNDA 2 graphics but still packs a powerful punch. It just lags behind the Z1 Extreme in some huge ways. The main thing to take note of is that both chips have a hard ceiling and rely on supersampling for major titles. In our testing of Resident Evil 4 Remake on both devices, we found it was essential to run the game on Performance modes with AMD’s FSR. However, the main difference was that the Steam Deck ran better at 720p, while the ROG Ally could easily handle the game at 1080p. The Z1 Extreme is far more powerful than Van Gogh on paper, but in the real world, you’ll find that the screen limits (800p on the Steam Deck and 1080p on ROG Ally) help with performance and with the games crushed to small screen sizes, it ultimately doesn’t really matter how they look graphically. Although the upgraded 7.4-inch display of the Steam Deck OLED has helped in that case. In fact, with the ROG Ally’s screen resolution options baked into Armory Crate, we found that lowering the resolution to something akin to the Steam Deck often resulted in better performance anyway. This isn’t to say that the Steam Deck is more problematic than not, as Valve’s badge system for letting you know if something is playable is often pretty accurate. Where it isn’t is for titles that might load up an external menu before booting you into the game. Meanwhile, the ROG Ally’s worst aspect is that it has to deal with the downright terrible Xbox Game Pass app if you’re that way inclined. We’re not a fan of Windows on handheld devices like this. Its awkward, cumbersome interface for touch screens and controllers is frustrating, to say the least. Valve’s custom-built SteamOS, which also shares a UI with the new Big Picture Mode, is fantastic – even with its ongoing issues. Microsoft ditched the Metro UI look after the failure of Windows 8. The company naturally replaced the UI in Windows 8.1 and further stripped out the touchscreen-focused design in 10 and 11. This has left the handhelds like the ROG Ally in a weird lurch. Its custom interface, Armory Crate, never felt natural to use and we consistently felt held back from using it while out of Steam’s Big Picture Mode. The major drawback to the Asus ROG Ally isn’t just Windows, but a missing key piece of hardware. There are no touchpads for easier navigation. Valve didn’t just include them to ensure the Steam Deck was effectively a swiss-army knife for a handheld. They allow you to easily navigate around the desktop interface. Modding games, or adding apps to the ROG Ally isn’t a chore, it’s just not as fluid as it is on the Steam Deck. The onscreen keyboard sometimes won’t appear when needed, because Windows is weird like that. File navigation is a delicate balance if you have fat fingers, as you carefully move the analog stick to hit the right file to explore. But, then we have to talk about Linux. With the Steam Deck, what is a simple download and fidget on the ROG Ally could be an extensive afternoon if you’re unfamiliar with the ins and outs of Linux. Not every app launches natively, with a huge emphasis on needing to use Proton or Wine, translation layers that allow non-Linux apps to work on the Steam Deck. Why are we focusing on something like this? Well, it’s because putting the ROG Ally to sleep routinely ruined suspended games. Windows has never played well with features like ALT-TAB (where you can swap programs with a button press), and putting the ROG Ally to sleep to a glitched-out game is more frequent than it isn’t. SteamOS being built from the ground up means Valve was able to take this into consideration. Suspending a game – even an online-only game like Path of Exile – will load up properly after resuming your session. For a handheld system, it lives and dies by how easy it is to put a game down to go do something else. Windows consistently getting in the ROG Ally’s way is its biggest downfall. This includes games. While Proton has come on leaps and bounds, there are still some hard limits as to what it can do. You won’t find people playing Destiny 2 natively on the Steam Deck, nor any game with a developer who doesn’t want to flip the anti-cheat switch. Some games, especially older titles, might not work even with Proton and require significant tinkering to get going. While on the ROG Ally, you actually can play almost anything you set your heart on. There might be some severe caveats with the specs, but whatever we thought of loaded natively. However, going back to those trackpads, the lack of them on the ROG Ally made certain titles a lot harder to play. Mapping mouse controls to a stick is iffy as it is, but being forced into it with not even the compromise of a touchpad ruined a lot of plans we had for the handheld. Setting hardware differences aside, it ultimately comes down to the types of games you want to play. If you think you’ll enjoy playing Destiny 2 on the go, over a mobile hotspot or public Wi-Fi, then ROG Ally is for you. While Windows is a hindrance, the total support for any game might outweigh some of the negatives. However, the best overall package is the Steam Deck. While there are compromises to make around certain titles and you will find yourself tinkering if you ever decide to go outside of the Playable list, it’s hard to beat a custom-built bit of kit. Whether you stick with the LCD model or the upgraded Steam Deck OLED, the handheld is designed from the top down to be an all-in-one games system, and it shows in just how easy it is to use. If you click on a product link on this page we may earn a small affiliate commission. E-Commerce Editor. You can get in touch with him over email: joel.loynds@dexerto.com. He's written extensively about video games and tech for over a decade for various sites. Previously seen on Scan, WePC, PCGuide, Eurogamer, Digital Foundry and Metro.co.uk. A deep love for old tech, bad games and even jankier MTG decks. "
}