{
    "title": null,
    "date": "3/1/2024",
    "url": "https://wccftech.com/amd-ryzen-8000-7000-5000-cpus-discounts-12-core-am5-16-core-am4-chips-350-usd/",
    "text": "A wide range of AMD Ryzen 8000, 7000 & 5000 CPUs for AM5/AM4 platforms have received some great discounts over at Newegg. AMD's Ryzen CPUs occasionally get some impressive deals and the latest round comes from US retailer, Newegg, who are hosting a special deals promotion across a variety of hardware which includes CPUs too. The deals cover all three major Ryzen CPU families including the AM5 Ryzen 8000G, Ryzen 7000, and the AM4 Ryzen 5000 chips. Starting with the AMD Ryzen 7000 CPU family, the top Ryzen 9 7950X and 7950X3D chips are now available for around $550 US which is a big drop versus their introductory prices of $699 US at the time of release. But the most impressive discounts are on the 12-core parts which are now down to $401 US for the X3D and as low as $354 US for the Non-X variant. One can also find the AMD Ryzen 7 7800X3D, one of the best gaming CPUs on the market right now, for $350 US but if you want the extra cores for your content creation or rendering workloads, then the Ryzen 9 7900 at $5 US more is a great option. Moving down the lineup, we have the 8-core parts for around $300 US while the 6-core parts can be found for $200 US. Meanwhile, the AMD Ryzen 8000G chips such as the Ryzen 7 8700G and Ryzen 5 8600G also get slight discounts of $5-$7 US. These are the first discounts on these chips since their release. For those who want to get more life out of their AM4 platforms running and older Ryzen 2000/3000 CPU, well there's always the upgrade path to the Ryzen 5000 family which has loads of options and at really good prices. You can get a 16-core Ryzen 9 5950X for as low as $372 US while the 12-core chips are priced at $284 US. The 5700X3D has also received a price cut down to $241 US and with 8 cores, you can expect a great gaming experience. The majority of the 6-core chips now fall below the $200 US price point and some even below $130 US which is a fantastic piece of hardware for budget builders. If you are looking for even better value, then the ever-friendly Microcenter has even lower prices for the Ryzen 9 7900X3D, starting at just $389.99 US which is phenomenal while the 8-core CPUs are priced at around $250 US. The Ryzen 9 7950X at $519 is also a great deal for those looking to gain monster multi-threaded performance with those 16 Zen 4 cores while being super efficient. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}