{
    "title": "Lisa Su: A Decade at AMD's Helm, Transforming Tech, Films, and Future with \nAI",
    "date": "3/13/2024",
    "url": "https://www.siliconhillsnews.com/2024/03/13/lisa-su-a-decade-at-amds-helm-transforming-tech-films-and-future-with-ai/",
    "text": "Lisa Su has led Advanced Micro Devices as its Chief Executive Officer for a decade to much success. AMD’s revenues were $5.5 billion in 2014 and $22 billion last year. Among its other accomplishments, today, an AMD CPU powers the world’s fastest supercomputer, Frontier, at Oak Ridge National Labs. Although the company’s headquarters are based in California, Su lives in Austin and runs AMD from its sprawling campus on the Southside. On Monday, she joined Ryan Patel on stage as the keynote speaker at South by Southwest. She talked about AMD’s role in technology innovation, its commitment to partnerships and open collaboration, and its vision for the future of Artificial Intelligence and computing. To start, Su recounted her time as a student at MIT and her love of semiconductors from the beginning of college. “Yes, that’s true; I was a nerd at heart,” Su said. In one of her first jobs in college, she worked in a semiconductor lab, making tiny chips the size of a dime or quarter. “I was just amazed at everything you could do with them,” she said. “I was in semiconductors when it wasn’t sexy, and I would say I don’t know that it’s sexy now, but it’s sexier.” AMD’s chips and technology are used in Hollywood to make films. In a surprise appearance, director David Conley appeared on stage to discuss AMD’s technology in filmmaking. The night before, he was at the Academy Awards, where his film War Is Over! Inspired by the Music of John & Yoko, won best animated short film. “It’s so great to be working with the best in the industry, and that’s what we enjoy,” Su said. She said making feature films requires special effects that require tremendous computing power, and AMD chips are used in the process. Films like Avatar 2 used AMD chips. Conley said he wanted to highlight the work that AMD is doing to help filmmakers create images that are more fantastic than they could have even thought about 30 years ago. “These images are possible because we have a partnership with a company like AMD that gives us the leverage and the insights. They work with our teams, and we work with their teams to help optimize everything,” Conley said. Conley said using AI in the entertainment industry is still a sensitive subject. Many people misunderstand it. “I also want to make sure that artists understand that AI is a tool and that this is not about replacing artists,” Conley said. He said the future of films is more active entertainment with the intersection of games because gaming visual effects and movie-making are all the same. “I want to jump from video games to movies,” he said. “I want to go from active entertainment to passive entertainment, and I want to go into real-time entertainment, and that is where films are going to be in three to five years, and we’re not going to be able to do that with the help of companies like AMD where we get real-time processing and real-time rendering and a lot of AI.” AMD also partners with Adobe to optimize hardware and software for content creators. Generative AI can bring the whole content creation process to the next level, Su said. It gives creators more products so they can do more at a higher quality in less time. Su said AI is the most critical technology that has come on the scene over at least the last 50 years. AI, and generative AI, has become the most important thing, and there’s a good reason for that, frankly, she said. ChatGPT came on board 14 months ago, and it just captured everyone’s imagination, she said. “AI has always existed, but the ability to make AI so simple that you can just say, hey, you know, I want to know what I should do in Austin, TX, this weekend, for example, having that possibility only comes with a tremendous amount of computing power,” Su said. Su showed one of AMD’s latest generation processors, a generative AI chip called MI 300, which has 153 billion transistors. AI PCs aim to ensure that everyone has their own AI capability and doesn’t have to go to the cloud. But they can operate off their data. You can ask it questions, and it’ll answer for you faster in a private manner because maybe you don’t want your data going everywhere, Su said. “It’s just the beginning of what I think is the ability to make us much more productive,” Su said. AMD also partners with Microsoft, leading the way with Copilot, which runs Azure in the cloud. AMD is also partners with HP and Lenovo. “Our goal is to make this super easy for all of you guys to use, and that’s the promise of AI PCs,” Su said. “One of the things about AI that I’d like to say is that people are worried that AI is going to replace people’s jobs and stuff like that,” Su said. That’s not the way I think about it. Companies that learn how to leverage AI will win over companies that are not leveraging AI.” Su said AMD wants to be at the forefront of using AI in every aspect of its business. “We’re using it to design chips,” she said. Su said AMD is using AI to design faster chips and make them more reliable. It is also using AI to build better software. Su told AMD’s engineering team to increase the number of products the company can produce annually using AI. AMD also uses AI in HR, finance, and customer service. This is a way of moving up the food chain because we’re allowing our team to have AI do some of the less fun things so that we can add higher value for our employees. Su said everyone needs an AI strategy. It’s OK if it’s not perfect because everyone is learning. “I’m learning new things about what technology can do and how we need to shape our entire ecosystem, our work, and our next-generation products as well, so that’s what makes it fun,” Su said. Su uses Microsoft Copilot to summarize meetings and track action items, but she doesn’t use it to write her emails. She said she’s still experimenting with the software. Su said AI is moving incredibly fast, and AMD’s approach is to have an open ecosystem and support open source. “We believe that no company has the answer to everything,” she said. Austin © 2024 SiliconHills Theme by Anders Noren — Up ↑ "
}