{
    "title": "AMD A6-4455M vs Intel Pentium Gold 4425Y vs Intel Core i7-7660U",
    "date": "3/27/2024",
    "url": "https://www.notebookcheck.net/A6-4455M-vs-Pentium-4425Y-vs-i7-7660U_3320_11316_8419.247596.0.html",
    "text": "The AMD A6-4455M is a mobile ultra-low-voltage (ULV) dual-core processor based on the Trinity architecture. Officially introduced in Q2 2012, it is the direct successor to the Llano A-series of APUs (Accelerated Processing Unit). The processing unit is manufactured in 32nm SOI and integrates a 2.1 GHz CPU (up to 2.6 GHz w/ Turbo Core) with a Radeon HD 7500G GPU alongside a dual-channel memory controller, video de- and encoders and a northbridge.The CPU cores are based on a reworked Bulldozer architecture, called Piledriver. Although marketed as a dual-core processor, the A6-4455M includes only one module with two integer-cores and and floating-point core. As a result, the CPU is not a true dual-core processor.When compared to previous Bulldozer cores, AMD has managed to improve upon the IPC (instructions per clock) performance of Trinity cores while allowing for higher clock frequencies. However, when compared to its Llano predecessor, the multithreaded performance of Trinity has only been slightly improved. The enhanced Turbo Core 3.0 feature functions well in speeding up single threaded performance, although it is still not on the same level as Intel’s Turbo Boost equivalent. Regardless, AMD has managed to include other features as well, such as the AVX extension (including FMA) and support for AES encryption.In terms of raw general performance, the A6-4455M performs significantly faster than the E-Series (e.g. E2-1800), but cannot compete with Intels ULV processors. Nonetheless, CPU performance from the AMD processor should be sufficient for all daily workloads like Office and Internet browsing, but will reach its limits in more demanding applications and multitasking.The integrated DirectX 11-compatible Radeon HD 7500G offers only 256 shader cores of the Trinity chip (7660G: 384) and, thanks to Turbo Core, will operate anywhere between 360 to 497 MHz depending on the current application demand. On average, the performance of the HD 7500G GPU should be somewhere between the Llano-based Radeon HD 6620G and the HD Graphics 4000 as found in Intel’s Ivy Bridge.The power consumption of the A6-4455M APU is rated at 17 Watt TDP and is therefore comparable to Intels ULV-processors. Consequently, the A6-4455M is best suited for thin-and-light notebooks. The AMD A6-4455M is a mobile ultra-low-voltage (ULV) dual-core processor based on the Trinity architecture. Officially introduced in Q2 2012, it is the direct successor to the Llano A-series of APUs (Accelerated Processing Unit). The processing unit is manufactured in 32nm SOI and integrates a 2.1 GHz CPU (up to 2.6 GHz w/ Turbo Core) with a Radeon HD 7500G GPU alongside a dual-channel memory controller, video de- and encoders and a northbridge.The CPU cores are based on a reworked Bulldozer architecture, called Piledriver. Although marketed as a dual-core processor, the A6-4455M includes only one module with two integer-cores and and floating-point core. As a result, the CPU is not a true dual-core processor.When compared to previous Bulldozer cores, AMD has managed to improve upon the IPC (instructions per clock) performance of Trinity cores while allowing for higher clock frequencies. However, when compared to its Llano predecessor, the multithreaded performance of Trinity has only been slightly improved. The enhanced Turbo Core 3.0 feature functions well in speeding up single threaded performance, although it is still not on the same level as Intel’s Turbo Boost equivalent. Regardless, AMD has managed to include other features as well, such as the AVX extension (including FMA) and support for AES encryption.In terms of raw general performance, the A6-4455M performs significantly faster than the E-Series (e.g. E2-1800), but cannot compete with Intels ULV processors. Nonetheless, CPU performance from the AMD processor should be sufficient for all daily workloads like Office and Internet browsing, but will reach its limits in more demanding applications and multitasking.The integrated DirectX 11-compatible Radeon HD 7500G offers only 256 shader cores of the Trinity chip (7660G: 384) and, thanks to Turbo Core, will operate anywhere between 360 to 497 MHz depending on the current application demand. On average, the performance of the HD 7500G GPU should be somewhere between the Llano-based Radeon HD 6620G and the HD Graphics 4000 as found in Intel’s Ivy Bridge.The power consumption of the A6-4455M APU is rated at 17 Watt TDP and is therefore comparable to Intels ULV-processors. Consequently, the A6-4455M is best suited for thin-and-light notebooks. The Intel Pentium Gold 4425Y is a low power entry level processor for small laptops or tablets and based on the Kaby Lake architecture. It was announced in Q1 2019 and offers two processor cores clocked at 1.7 GHz (no Turbo Boost). Thanks to Hyper Threading, the processor can execute up to four threads simultaneously. The chips also includes the Intel HD Graphics 615 GPU, a dual-channel memory controller (DDR3L/LPDDR3) as well as VP9 and H.265 video de- and encoder. It is still produced in a 14 nm process with FinFET transistors. Compared to the much faster Core m3-7Y30, the Pentium 4425 offers no Turbo Boost, different CPU and GPU clock speeds, a smaller L3 cache and a higher TDP of 6 Watt. Compared to the predecessor Pentium Gold 4415Y from 2017, the Pentium Gold 4425Y is clocked 100 MHz higher (the CPU cores). \nArchitecture \nIntel basically used the familiar micro architecture from the Skylake generation, so the per-MHz performance is identical. Only the Speed-Shift technology for faster dynamic adjustments of the voltages and clocks was improved, and the matured 14 nm process now also enables much higher frequencies and better efficiency than before.  \nPerformance \nDue to the missing Turbo Boost, the Pentium 4425Y offers a significantly worse single thread performance than the more expensive Core m3-7Y30. This should be noticeable in daily tasks. Compared to older CPUs, the Pentium Gold should match a Core i3-4100U (100 MHz higher clock speed but older architecture). \nGraphics \nThe integrated Intel HD Graphics 615 GPU has 24 Execution Units (EUs) like the old HD Graphics 515 and runs with clocks between 300 and 850 MHz in combination with this processor. The performance heavily depends on the TDP limit as well as the memory configuration; with fast LPDDR3-1866 RAM in dual-channel mode, the GPU should sometimes be able to compete with the HD Graphics 520, but can also be much slower in other scenarios. Modern games from 2016 will, if at all, only run smoothly in the lowest settings. \nContrary to Skylake, Kaby Lake now also supports hardware decoding for H.265/HEVC Main10 with a 10-bit color depth as well as Google's VP9 codec. \nPower Consumption \nThe chip is manufactured in an improved 14 nm process with FinFET transistors, so the power efficiency was once again improved significantly. The TDP is rated at 6 Watt and can be reduced to 4,5 Watt (cTDP down). The Intel Pentium Gold 4425Y is a low power entry level processor for small laptops or tablets and based on the Kaby Lake architecture. It was announced in Q1 2019 and offers two processor cores clocked at 1.7 GHz (no Turbo Boost). Thanks to Hyper Threading, the processor can execute up to four threads simultaneously. The chips also includes the Intel HD Graphics 615 GPU, a dual-channel memory controller (DDR3L/LPDDR3) as well as VP9 and H.265 video de- and encoder. It is still produced in a 14 nm process with FinFET transistors. Compared to the much faster Core m3-7Y30, the Pentium 4425 offers no Turbo Boost, different CPU and GPU clock speeds, a smaller L3 cache and a higher TDP of 6 Watt. Compared to the predecessor Pentium Gold 4415Y from 2017, the Pentium Gold 4425Y is clocked 100 MHz higher (the CPU cores). Architecture Intel basically used the familiar micro architecture from the Skylake generation, so the per-MHz performance is identical. Only the Speed-Shift technology for faster dynamic adjustments of the voltages and clocks was improved, and the matured 14 nm process now also enables much higher frequencies and better efficiency than before. Performance Due to the missing Turbo Boost, the Pentium 4425Y offers a significantly worse single thread performance than the more expensive Core m3-7Y30. This should be noticeable in daily tasks. Compared to older CPUs, the Pentium Gold should match a Core i3-4100U (100 MHz higher clock speed but older architecture). Graphics The integrated Intel HD Graphics 615 GPU has 24 Execution Units (EUs) like the old HD Graphics 515 and runs with clocks between 300 and 850 MHz in combination with this processor. The performance heavily depends on the TDP limit as well as the memory configuration; with fast LPDDR3-1866 RAM in dual-channel mode, the GPU should sometimes be able to compete with the HD Graphics 520, but can also be much slower in other scenarios. Modern games from 2016 will, if at all, only run smoothly in the lowest settings. Contrary to Skylake, Kaby Lake now also supports hardware decoding for H.265/HEVC Main10 with a 10-bit color depth as well as Google's VP9 codec. Power Consumption The chip is manufactured in an improved 14 nm process with FinFET transistors, so the power efficiency was once again improved significantly. The TDP is rated at 6 Watt and can be reduced to 4,5 Watt (cTDP down). The Intel Core i7-7660U is a fast dual-core SoC for notebooks and Ultrabooks based on the Kaby Lake architecture and was announced in January 2017. The CPU has two processor cores clocked at 2.5-4 GHz (two cores up to 3.8 GHz). The processor can execute up to four threads simultaneously thanks to Hyper Threading. It is also equipped with an Intel Iris Plus Graphics 640 GPU with 64 MB eDRAm, a dual-channel memory controller (DDR4) as well as VP9 and H.265 video decoding as well as encoding. The chip is still manufactured in a 14nm process with FinFET transistors.\nCompared to the Core i7-7600U, the 7660 does have a higher single-core Turbo of 4 GHz (+100 MHz), but a lower dual-core Turbo (-100 MHz) and a lower base frequency (-300 MHz). However, the CPU part can also use the 64 MB eDRAM as L5 cache.\nArchitecture\nIntel basically uses the same micro architecture compared to Skylake, so the per-MHz performance does not differ. The manufacturer only reworked the Speed Shift technology for faster dynamic adjustments of voltages and clocks, and the improved 14nm process allows much higher frequencies combined with better efficiency than before.\nPerformance\nAt 2.5-4 GHz, the Core i7-7660U has a slightly lower frequency (except for the single-core Turbo) compared to the Core i7-7600U, but the CPU part can also use the 64 MB eDRAM, so the performance should be similar.\nGraphics\nThe integrated Intel Iris Plus 640 Graphics is the GT3e model of the Kaby Lake GPU (Intel Gen. 9.5). It has 48 Execution Units running at 300-1050 MHz and the performance is comparable to a GeForce 920MX thanks to fast eDRAM cache. However, there aren't any significant improvements compared to the old Iris Pro 540, so modern games can often not be played smoothly or only at the lowest or medium settings, respectively.\nContrary to Skylake, Kaby lake now also supports H.265/HEVC Main 10 with a 10-bit color depth as well as Google's VP9 codec. The dual-core Kaby Lake processors announced in January should also support HDCP 2.2.\nPower Consumption\nThe chip is manufactured in an improved 14nm process with FinFET transistors, which improves the efficiency even further. Intel still specifies the TDP with 15 Watts, which is typical for ULV chips. Depending on the usage scenario, the TDP can vary between 7.5 (cTDP Down) and 25 Watts. The Intel Core i7-7660U is a fast dual-core SoC for notebooks and Ultrabooks based on the Kaby Lake architecture and was announced in January 2017. The CPU has two processor cores clocked at 2.5-4 GHz (two cores up to 3.8 GHz). The processor can execute up to four threads simultaneously thanks to Hyper Threading. It is also equipped with an Intel Iris Plus Graphics 640 GPU with 64 MB eDRAm, a dual-channel memory controller (DDR4) as well as VP9 and H.265 video decoding as well as encoding. The chip is still manufactured in a 14nm process with FinFET transistors. Compared to the Core i7-7600U, the 7660 does have a higher single-core Turbo of 4 GHz (+100 MHz), but a lower dual-core Turbo (-100 MHz) and a lower base frequency (-300 MHz). However, the CPU part can also use the 64 MB eDRAM as L5 cache. Architecture Intel basically uses the same micro architecture compared to Skylake, so the per-MHz performance does not differ. The manufacturer only reworked the Speed Shift technology for faster dynamic adjustments of voltages and clocks, and the improved 14nm process allows much higher frequencies combined with better efficiency than before. Performance At 2.5-4 GHz, the Core i7-7660U has a slightly lower frequency (except for the single-core Turbo) compared to the Core i7-7600U, but the CPU part can also use the 64 MB eDRAM, so the performance should be similar. Graphics The integrated Intel Iris Plus 640 Graphics is the GT3e model of the Kaby Lake GPU (Intel Gen. 9.5). It has 48 Execution Units running at 300-1050 MHz and the performance is comparable to a GeForce 920MX thanks to fast eDRAM cache. However, there aren't any significant improvements compared to the old Iris Pro 540, so modern games can often not be played smoothly or only at the lowest or medium settings, respectively. Contrary to Skylake, Kaby lake now also supports H.265/HEVC Main 10 with a 10-bit color depth as well as Google's VP9 codec. The dual-core Kaby Lake processors announced in January should also support HDCP 2.2. Power Consumption The chip is manufactured in an improved 14nm process with FinFET transistors, which improves the efficiency even further. Intel still specifies the TDP with 15 Watts, which is typical for ULV chips. Depending on the usage scenario, the TDP can vary between 7.5 (cTDP Down) and 25 Watts. #0 checking url part for id 3320 +0s ... 0s #1 checking url part for id 11316 +0s ... 0s #2 checking url part for id 8419 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.05s ... 0.051s #6 did output specs +0s ... 0.051s #7 getting avg benchmarks for device 3320 +0.002s ... 0.053s #8 got single benchmarks 3320 +0.021s ... 0.075s #9 getting avg benchmarks for device 11316 +0.002s ... 0.077s #10 got single benchmarks 11316 +0.008s ... 0.085s #11 getting avg benchmarks for device 8419 +0.003s ... 0.087s #12 got single benchmarks 8419 +0.009s ... 0.096s #13 got avg benchmarks for devices +0s ... 0.096s #14 min, max, avg, median took s +0.269s ... 0.365s #15 return log +0s ... 0.366s "
}