{
    "title": "Brace Yourself. The Next Stop for AMD Stock Is $250, Not $150!",
    "date": "3/12/2024",
    "url": "https://investorplace.com/market360/2024/03/brace-yourself-the-next-stop-for-amd-stock-is-250-not-150/",
    "text": " Don't assume this AI chip rising star is about to fall back to earth Advertisement Source: JHVEPhoto / Shutterstock.com Investors have profited from Advanced Micro Devices (NASDAQ:AMD) stock, which has rallied by 34.6% year-to-date and doubled since September. However, this rising star has faced resistance at $200 per share. Some believe AMD has reached its peak and interest in AI-related stocks is declining, indicating an impending reversal. But while this chip designer’s shares may not kick it back into high gear immediately, don’t assume that the next big move for shares is a big move lower. In fact, the next big move could be yet another surge, fueled by an upcoming event. Advanced Micro Devices crossed the $200 per share mark at the start of March, but has so far been facing challenges moving beyond this price level. While investor psychology could play a role, I would assume that this is taking shape at a nice, even number is just coincidental. Other top AI stocks, like Nvidia (NASDAQ:NVDA) have experienced similar price trends lately. Following the AI hype in late February, the market is now adopting a cautious approach. However, irrespective of why shares have screeched to a halt, the concern is whether this slowdown in enthusiasm is the prelude to a big sell-off. Check out recent commentary online about Advanced Micro Devices, and you’ll see increasing numbers of bearish takes on the stock. By-and-large, these skeptical observers argue AMD is “priced for perfection,” and if sales of its MI300 processors, and soon, its sales of chips for the AI-PC market, fail to beat or even meet expectations, richly-priced AMD (at 54.4 times forward earnings) is set to take a big dive. If you’ve read our past coverage of AMD stock, you know full well we do not subscribe the above-mentioned downbeat view many are starting to have about Advanced Micro Devices shares. Previously, we argued why AMD, even at $200 per share, may not even fully price-in the potential MI300-related upside. Sales of the company’s initial AI chip product could vastly exceed even management’s recently raised forecasts. A recent analyst upgrade may give more credence to this view. Last week, Melius Research’s Ben Reitzes raised his price target on AMD, from $192 to $265 per share. In large part, due to adoption of AMD’s AI chips by a leader in the cloud computing space. This suggests better-than-expected results from the company, with regards to its artificial intelligence chip sales. Speaking of earnings, $265 per share may be Reitzes’ twelve month price target, but this stock could potentially climb to near this price target (say, $250 per share) far sooner than you think. The market for now may continue to digest various uncertainties, yet the next big shot in the arm for Advanced Micro Devices could arrive in the weeks leading up to May. Why May? That’s when AMD next releases quarterly results. Before AMD’s Q1 2024 earnings release (scheduled for May 1), investors could dive back into the stock with full-force, wagering that the bull case made by Reitzes proves correct (MI300 results beat expectations). Sure, much like what happened with AMD’s earnings last month, investors could “buy the rumor, sell the news.” The company could beat expectations, but shares tread water/move lower immediately after the release. However, the earnings release could also entail other positive surprises, such as a raising of MI300 sales forecasts. Management may also provide positive updates regarding its AI-PC chip and other generative AI-related endeavors. All of this could keep shares surging post-earnings. Perhaps, even toward the $250 per share price level. With more out there signaling another big rip, and another big dip, as it stays an AI winner, stay long on AMD stock. AMD stock earns an A rating in Portfolio Grader. On the date of publication, Louis Navellier had a long position in NVDA. Louis Navellier did not have (either directly or indirectly) any other positions in the securities mentioned in this article. The InvestorPlace Research Staff member primarily responsible for this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article. Technology, Artificial Intelligence, Semiconductor   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/03/brace-yourself-the-next-stop-for-amd-stock-is-250-not-150/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Stocks to Buy Market Analysis Stocks to Sell Stocks to Buy Stocks to Sell Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}