{
    "title": null,
    "date": "3/6/2024",
    "url": "https://digistatement.com/pacific-drive-mod-hdr-ultrawide-219-super-ultrawide-329-amd-fsr-3-dlss-support-details/",
    "text": "Pacific Drive Mod, HDR, Ultrawide (21:9), Super Ultrawide (32:9), AMD FSR 3 & DLSS Support Details Developer Ironwood Studios just recently released their debut title – Pacific Drive, on February 22, 2024. The game happens to be a first-person driving survival title where you will be facing supernatural dangers and peculiar challenges, all the while scavenging for resources and upgrading your trusty station wagon. But before drivers can start their strange and adventurous journey, many want to know if the game supports modding, HDR, ultrawide, super ultrawide, AMD FSR 3, and DLSS. Before its release, Ironwood Studios released a demo for the game during the Steam Next Fest held in February 2024. This demo was pretty well received by players, but a lot of them didn’t know whether the game had modding, HDR, ultrawide, super ultrawide, AMD FSR 3, and DLSS support at that time. However, now that the game is finally here, players want to know all about it, including whether Pacific Drive supports these features. So, let’s go ahead and find out. Let’s start with mod support. At the time of publishing this, Pacific Drive doesn’t have official mod support. Many were hoping that they would be able to play the game with mods, but unfortunately, players will have to wait for a while for that. Ironwood Studios has clarified that modding isn’t entirely out of the question, but rather it’s just not what they are focusing on right now. “Will Pacific Drive support mods on PC? At launch, the game will not support mods. We understand the importance of mods and several of our team members started their gamedev journey in the modding scene. It’s a subject we’re evaluating thoroughly – but we have nothing to announce at this time.” Now, just like modding, the game also doesn’t have native HDR support. However, the Windows Auto-HDR feature is indeed compatible with the game, so you can use it as an alternative of sorts until Ironwood adds in native HDR. Now, if you don’t happen to have Auto-HDR, then we suggest using Special K. Now, the game doesn’t have native support for both ultrawide (21:9) and super ultrawide (32:9) monitors but you can still enjoy Pacific Drive in these aspect ratios. You will just have to deal with some annoying FOV issues. Luckily, the community has a fix for that. All you need to do is head to this location on your PC: C:\\Users(your user name)\\AppData\\Local\\PenDriverProIntro\\Saved\\Config\\WindowsNoEditor\\Engine.ini, and open the Engine.ini file using Notepad. Next, type in or paste this at the end: After this, save the changes. You can now launch the game and enjoy Pacific Drive in ultrawide and super ultrawide. So, what about AMD FSR 3 and DLSS support? Well, currently, the game only happens to have DLSS 2.3 with no native FSR support. However, Ironwood is aware of the FSR support demand, so it will be only a while before Pacific Drive gets it. Although we aren’t sure if it’s going to be FSR 3 or previous versions. Well, that’s all the information we have on this matter. You can also take a quick look here if you are curious to know whether Rust features the same. And for more such content, keep following DigiStatement. Also read: How to install mods for Nier Automata Steam Deck version? © 2021 DigiStatement - All Rights Reserved © 2021 DigiStatement - All Rights Reserved "
}