{
    "title": "Overview of the Newest Therapies for AMD and DME: Faricimab and Aflibercept \n8mg",
    "date": "3/15/2024",
    "url": "https://www.modernretina.com/view/overview-of-the-newest-therapies-for-amd-and-dme-faricimab-and-aflibercept-8mg",
    "text": "   SPOTLIGHT - Experts discuss the efficacy and durability of newer therapies, focusing on faricimab and the high dose of aflibercept, highlighting the promising clinical trial results, maintaining comparable visual acuity efficacy while achieving longer durability Summary In the discussion on the efficacy and durability of newer therapies for neovascular age-related macular degeneration (nAMD) and diabetic macular edema (DME), Judy Kim, MD and Peter Kaiser, MD focus on two recently approved drugs, faricimab and high dose aflibercept. Faricimab, a bi-specific molecule blocking both VEGF-A and angiapointin-2, is highlighted for its potential increased durability. Kaiser points out that clinical studies specifically examined this aspect, revealing extended intervals, with around 80% of patients achieving 12 weeks or more, and approximately 45% reaching 16 weeks. He emphasizes that achieving a 16-week interval requires a gradual approach, akin to a treat-and-extend protocol. The discussion transitions to the high dose of aflibercept, with an increased dosage of 8 milligrams, aiming for a 16-week therapy. Similar to faricimab, the high dose of aflibercept demonstrated promising extending intervals in clinical studies, with a small percentage reaching a six-month interval. Both physicians express excitement about the potential for these newer agents to push treatment intervals to 12, 16, or even 24 weeks while maintaining vision results comparable to the traditional eight-week interval with aflibercept. They stress that patients should be guided towards these intervals gradually and underscore the importance of not compromising efficacy in the pursuit of extended durability. This summary was AI-generated and edited for clarity. Phase Ib/IIa trial of EXN407 eye drops from Exonate demonstrates safety and tolerability Outlook Therapeutics receives positive CHMP opinion for bevacizumab for wet age-related macular degeneration Korean study shows increased risk of AMD among air force pilots Key takeaways from the DAVIO 2 study with Rishi Singh, MD Why wait? The data show administering steroids to DME patients with good vision leads to long-term success ISS National Lab-sponsored study to test a novel gene therapy for AMD Phase Ib/IIa trial of EXN407 eye drops from Exonate demonstrates safety and tolerability Outlook Therapeutics receives positive CHMP opinion for bevacizumab for wet age-related macular degeneration Korean study shows increased risk of AMD among air force pilots Key takeaways from the DAVIO 2 study with Rishi Singh, MD Why wait? The data show administering steroids to DME patients with good vision leads to long-term success ISS National Lab-sponsored study to test a novel gene therapy for AMD 2 Commerce Drive Cranbury, NJ 08512 609-716-7777 "
}