{
    "title": "China's CPU rival to Intel and AMD is rapidly catching up on a key metric — \nbut don't expect it to be competitive with ...",
    "date": "3/28/2024",
    "url": "https://sg.news.yahoo.com/chinas-cpu-rival-intel-amd-190953055.html",
    "text": "You might not be too familiar with Loongson, but it has been developing computer processors since 2000, and in China the company is widely viewed as the grandfather of domestic CPUs. The launch of Loongson 1 in 2002 was China's first independently developed general-purpose CPU, using the MIPS III instruction set. in 2020 Loongson transitioned from the MIPS instruction set to its independent instruction set, LoongArch (which is widely viewed as being a clone of MIPS). The first LoongArch-supported processor, the 3A5000, debuted in 2021, marking the beginning of the Loongson ecosystem's Dragon architecture era. The 3A6000, a follow-up product of the 3A5000, is the second-generation processor using the LoongArch instruction set. Fabricated on a 12nm process it has four cores and eight threads capable of boosting to 2.5GHz under a 50 watt TDP. It has an L2 cache of 256KB and an L3 cache of 16MB, and is compatible with DDR4-3200 RAM. In a recent video review by Geekerwan (Geek Bay), Loongson's 3A6000 demonstrated substantial progress in its Instructions Per Cycle (IPC), nearly on par with the latest architectures from Intel and AMD. While it still lags behind the latest x86 and Arm CPUs in raw performance, the high IPC suggests a promising future, provided Loongson can attain higher frequencies. In SPEC 2017's integer and floating point performance test with all CPUs locked to 2.5GHz, Loongson's chip impressed. It surpassed the Zen 3-based Ryzen 9 5950X and was just slightly behind the Zen 4-powered Ryzen 9 7950X and Raptor Lake Core i9-14900K. Tom’s Hardware has more on the test results. However, the 3A6000 can't truly harness its impressive IPC due to its low clock speed and its limitations in core count and cache size. The company's next-generation 3A7000, rumored to use a 7nm process, may improve on these points, potentially boosting clock speeds and allowing for more cores and more cache. While the 3A6000 demonstrates considerable progress, it still falls behind Intel and AMD's performance when operating at silent frequencies above 5GHz. However, the rapid improvement in Loongson's architecture design, coupled with its high IPC, suggests a promising future for China's homespun CPU. Exclusive: Nvidia's fastest AI chip ever is finally available for preorder These are the fastest CPUs AMD unleashes 128-core Epyc ‘Bergamo’, trounces Intel’s most expensive CPU Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order. 經渣打投保安聯旅遊保障可享6折。18歲以下更可享半價保費優惠！ My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. IBKR EventTrader - A new, straightforward way to trade CME futures markets New agile US Marine formations are learning how to battle adversaries like China on remote islands, according to The Washington Post. In this week’s travel roundup we bring you transport trivia, Roman engineering marvels and the world’s tastiest dumpling. When Sam* married her husband, she never imagined that 20 years on, she'd have not one, but two affairs...  Dini von Mueffling is a PR professional in New York City's who's worked with Monica Lewinsky and Virginia Giuffre. Surveillance footage captures the harrowing moment a wild boar viciously attacks a 70-year-old man in his front yard in Guangyuan, China, on March 24. The man sustains severe spinal injuries while defending himself against the enraged animal's assault. The post Bites by Ann Chin: Michelin popiah, loaded waffles & local bites in hole-in-wall eatery appeared first on SETHLUI.com.  Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp. The visibly upset MSNBC anchor was responding to the Trump's attack on Judge Juan Merchan's daughter despite gag orders The post Nicole Wallace Gets Fed Up, Tosses Script While Covering Latest Trump Attack: ‘What Are We Going to Do Different?’ | Video appeared first on TheWrap. City Developments Limited ( SGX:C09 ), is not the largest company out there, but it received a lot of attention from a...  Israel assassinated a Syrian colonel in Damascus and a senior Hezbollah commander in Lebanon in a series of pinpointed strikes amid the largest attacks on neighbouring countries since the start of the war in Gaza. Full-back has become invaluable at Anfield and would surely thrive under Klopp’s possible replacement Roberto De Zerbi Watch as King Charles III attends church on Easter Sunday in his most significant public appearance since he was diagnosed with cancer.  The Princess of Wales and her family will not be at the service.  Charles, 75, will join the Queen and other members of the royal family at the annual Easter Mattins Service at St George’s Chapel at Windsor Castle on Sunday 31 March. 滿滿花青素，美容養顏，明目養髮，泡水/泡茶/泡酒/即食 多種食用方式 The post Fiie’s Cafe — ‘Mr Grumpy’ fried chicken officially lands in Toa Payoh appeared first on SETHLUI.com. Health officials are alerting doctors to be on the lookout for certain types of rare but serious meningococcal infections that are on the rise in the United States. Princess Eugenie and Princess Beatrice reportedly want to become working royals and are upset about King Charles snubbing them. "
}