{
    "title": "HP updates its notebook lineup with Intel and AMD \"AI\" processors and \nNVIDIA GPUs",
    "date": "3/8/2024",
    "url": "https://www.hardwarezone.com.sg/tech-news-hp-updates-notebook-intel-amd-processors-nvidia-gpus",
    "text": " Announced at HP Amplify in Las Vegas are HP Elite and Pro PC solutions equipped with AI capabilities powered either by Intel Core Ultra 5 and 7 processors or AMD Ryzen PRO processors with dedicated NPUs for tackling AI tasks and Copilot for Windows and Windows 11 Pro. Handily, the announcements met some of the wishes I’d hoped to see being released from HP Amplify this week. These were the increasing integration of AI, a copilot button, and the increased use of recycled materials. The lineup launched includes:    But that’s not all that was announced by HP. The AI-enabled HP ZBook devices come powered by a broad range of CPUs including Intel Core Ultra 5, 7 and 9 gen-processors or next-generation AMD Ryzen PRO processors with dedicated NPUs, to handle mobile work demands while still executing large, complex projects. The new HP ZBook’s devices include:       The HP Elite x360 1040 G11 and HP EliteBook 1040 G11 Notebooks are expected to be available in April with pricing available closer to date. The HP Elite x360 830 G11, HP EliteBook 830 G11, HP EliteBook 840 G11, and HP EliteBook 860 G11 Notebooks will be available this month starting at US$1,599. The HP EliteBook 835 G11, HP EliteBook 845 G11, and HP EliteBook 865 G11 Notebooks are expected to be available in April starting at US$1,469. The HP EliteBook 630 G11, HP EliteBook 640 G11, and HP EliteBook 660 G11 Notebooks are expected to be available in April starting at US$1,289. The HP EliteBook 645 G11 and HP EliteBook 665 G11 Notebooks are expected to be available in April starting at US$1,199. The HP ProBook 440 G11 and HP ProBook 460 G11 Notebooks are expected to be available in April starting at US$949. HP Elite Small Form Factor 805 G9 Desktop PC is expected to be available in August. Pricing will be available closer to availability. The ZBook Power G11, ZBook Firefly G11, and ZBook Fury G11 are expected to be available in April. Pricing will be available closer to date. HP’s ZBook Studio G11 is expected to be available in May with pricing available closer to date.  HP launches a host of accessories for different work situations and conditions New HP Color LaserJet Pro 3000 series brings vivid and fast colour printing to SMBs. HP updates its notebook lineup with Intel and AMD \"AI\" processors and NVIDIA GPUs Trending Topics Our Sections  AWARDS & ACCOLADES We thank all our supporters who have helped us garner these prestigious media awards in the industry! "
}