{
    "title": "AMD Radeon 760M vs NVIDIA GeForce GTX 1650 Mobile vs NVIDIA GeForce GTX \n1650 (Desktop)",
    "date": "3/25/2024",
    "url": "https://www.notebookcheck.net/Radeon-760M-vs-GeForce-GTX-1650-Mobile-vs-GeForce-GTX-1650-Desktop_11566_9828_9850.247598.0.html",
    "text": "The AMD Radeon 760M is an integrated GPU in the Ryzen 7040 series for laptops (Phoenix, e.g. Ryzen 5 7640HS). The iGPU is based on the new RDNA3 architecture and has 8 of the 12 CUs (= 512 shaders) clocked at up to 2.8 GHz (depending on the CPU model). As the predecessor Radeon 660M, the 760M supports hardware raytracing, although the performance is too slow to use it in current games. \nThanks to the new architecture and higher clock speeds, the Radeon 760M should be clearly faster then the old Radeon 660M. \nThanks to the modern 4nm process and clever power-saving features, the power consumption is comparatively low (according to AMD). The whole chip of the first two models can be configured between 15 - 54 Watt TDP. The AMD Radeon 760M is an integrated GPU in the Ryzen 7040 series for laptops (Phoenix, e.g. Ryzen 5 7640HS). The iGPU is based on the new RDNA3 architecture and has 8 of the 12 CUs (= 512 shaders) clocked at up to 2.8 GHz (depending on the CPU model). As the predecessor Radeon 660M, the 760M supports hardware raytracing, although the performance is too slow to use it in current games. Thanks to the new architecture and higher clock speeds, the Radeon 760M should be clearly faster then the old Radeon 660M. Thanks to the modern 4nm process and clever power-saving features, the power consumption is comparatively low (according to AMD). The whole chip of the first two models can be configured between 15 - 54 Watt TDP. The Nvidia GeForce GTX 1650 for laptops is a mobile graphics card that is based on the Turing architecture (TU117 chip). Compared to the faster RTX 2000 GPUs (e.g. RTX 2060), the 1650 integrates no Raytracing or Tensor cores. The performance should be slightly faster than the old GeForce GTX 1050 Ti. Compared to the desktop version, the mobile GTX1650 can use all 1024 shaders of the TU117 chip, but there are also versions with 896 shaders. \nStarting March 2020, the GTX 1650 Mobile is also available with fast 12 Gbits GDDR6 graphics memory (N18P-G61, 896 shaders) as a refresh.The Turing generation did not only introduce raytracing for the RTX cards, but also optimized the architecture of the cores and caches. According to Nvidia the CUDA cores offer now a concurrent execution of floating point and integer operations for increased performance in compute-heavy workloads of modern games. Furthermore, the caches were reworked (new unified memory architecture with twice the cache compared to Pascal). This leads to 50% more instructions per clock and a 40% more power efficient usage compared to Pascal. \nCompared to the bigger Turing chips (like the TU116 of the GTX 1660 Ti and the RTX lineup), the TU117 does not include the new NVENC encoder but an older one similar to the one used in Pascal and Volta. \nThe power consumption of the 1650 for laptops is specified at 50 Watt TGP (Total Graphics Power) by Nvidia and therefore 15 Watt higher than the efficient (and slower) Max-Q variant of the 1650. The TU117 chip is manufactured in 12nm FFN at TSMC. The Nvidia GeForce GTX 1650 for laptops is a mobile graphics card that is based on the Turing architecture (TU117 chip). Compared to the faster RTX 2000 GPUs (e.g. RTX 2060), the 1650 integrates no Raytracing or Tensor cores. The performance should be slightly faster than the old GeForce GTX 1050 Ti. Compared to the desktop version, the mobile GTX1650 can use all 1024 shaders of the TU117 chip, but there are also versions with 896 shaders. Starting March 2020, the GTX 1650 Mobile is also available with fast 12 Gbits GDDR6 graphics memory (N18P-G61, 896 shaders) as a refresh. The Turing generation did not only introduce raytracing for the RTX cards, but also optimized the architecture of the cores and caches. According to Nvidia the CUDA cores offer now a concurrent execution of floating point and integer operations for increased performance in compute-heavy workloads of modern games. Furthermore, the caches were reworked (new unified memory architecture with twice the cache compared to Pascal). This leads to 50% more instructions per clock and a 40% more power efficient usage compared to Pascal. Compared to the bigger Turing chips (like the TU116 of the GTX 1660 Ti and the RTX lineup), the TU117 does not include the new NVENC encoder but an older one similar to the one used in Pascal and Volta. The power consumption of the 1650 for laptops is specified at 50 Watt TGP (Total Graphics Power) by Nvidia and therefore 15 Watt higher than the efficient (and slower) Max-Q variant of the 1650. The TU117 chip is manufactured in 12nm FFN at TSMC. The Nvidia GeForce GTX 1650 for desktop PCs is a graphics card that is based on the Turing architecture (TU117 chip). Compared to the faster RTX 2000 GPUs (e.g. RTX 2060), the 1650 integrates no Raytracing or Tensor cores. The performance should be slightly faster than the old GeForce GTX 1050 Ti. Although, the mobile variant of the GTX1650 uses the same name, it is a bit slower due to lower clock rates.The Turing generation did not only introduce raytracing for the RTX cards, but also optimized the architecture of the cores and caches. According to Nvidia the CUDA cores offer now a concurrent execution of floating point and integer operations for increased performance in compute-heavy workloads of modern games. Furthermore, the caches were reworked (new unified memory architecture with twice the cache compared to Pascal). This leads to 50% more instructions per clock and a 40% more power efficient usage compared to Pascal. \nCompared to the bigger Turing chips (like the TU116 of the GTX 1660 Ti and the RTX lineup), the TU117 does not include the new NVENC encoder but an older one similar to the one used in Pascal and Volta. \nThe power consumption of the 1650 is specified at 75 Watt TGP (Total Graphics Power) by Nvidia. The TU117 chip is manufactured in 12nm FFN at TSMC. The Nvidia GeForce GTX 1650 for desktop PCs is a graphics card that is based on the Turing architecture (TU117 chip). Compared to the faster RTX 2000 GPUs (e.g. RTX 2060), the 1650 integrates no Raytracing or Tensor cores. The performance should be slightly faster than the old GeForce GTX 1050 Ti. Although, the mobile variant of the GTX1650 uses the same name, it is a bit slower due to lower clock rates. The Turing generation did not only introduce raytracing for the RTX cards, but also optimized the architecture of the cores and caches. According to Nvidia the CUDA cores offer now a concurrent execution of floating point and integer operations for increased performance in compute-heavy workloads of modern games. Furthermore, the caches were reworked (new unified memory architecture with twice the cache compared to Pascal). This leads to 50% more instructions per clock and a 40% more power efficient usage compared to Pascal. Compared to the bigger Turing chips (like the TU116 of the GTX 1660 Ti and the RTX lineup), the TU117 does not include the new NVENC encoder but an older one similar to the one used in Pascal and Volta. The power consumption of the 1650 is specified at 75 Watt TGP (Total Graphics Power) by Nvidia. The TU117 chip is manufactured in 12nm FFN at TSMC. The following benchmarks stem from our benchmarks of review laptops. The performance depends on the used graphics memory, clock rate, processor, system settings, drivers, and operating systems. So the results don't have to be representative for all laptops with this GPU. For detailed information on the benchmark results, click on the fps number. Average Gaming 30-70 fps → 100% Average Gaming 30-70 fps → 178% Average Gaming 30-70 fps → 193% For more games that might be playable and a list of all games and graphics cards visit our Gaming List #0 checking url part for id 11566 +0s ... 0s #1 checking url part for id 9828 +0s ... 0s #2 checking url part for id 9850 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:39:02 +0200 +0.001s ... 0.001s #5 composed specs +0.111s ... 0.112s #6 did output specs +0s ... 0.112s #7 start showIntegratedCPUs +0s ... 0.112s #8 getting avg benchmarks for device 11566 +0.05s ... 0.162s #9 got single benchmarks 11566 +0.01s ... 0.172s #10 getting avg benchmarks for device 9828 +0.016s ... 0.188s #11 got single benchmarks 9828 +0.208s ... 0.396s #12 getting avg benchmarks for device 9850 +0.012s ... 0.408s #13 got single benchmarks 9850 +0.014s ... 0.422s #14 got avg benchmarks for devices +0s ... 0.422s #15 min, max, avg, median took s +0.554s ... 0.977s #16 before gaming benchmark output +0s ... 0.977s #17 Got 2285 rows for game benchmarks. +0.196s ... 1.173s #18 composed SQL query for gamebenchmarks +0s ... 1.173s #19 got data and put it in $dataArray +0.138s ... 1.311s #20 benchmarks composed for output. +0.401s ... 1.712s #21 calculated avg scores. +0s ... 1.713s #22 return log +0.006s ... 1.719s "
}