{
    "title": "Best RAM for AM5 in 2024",
    "date": "3/23/2024",
    "url": "https://www.xda-developers.com/best-ram-for-am5/",
    "text": "The AMD AM5 platform is powerful, but which RAM is best for pairing with it? When AMD first released the Ryzen 7000-series CPUs, the bar to entry was fairly high as it required a new motherboard and new RAM. Since then, prices have steadily come down, so the total cost of ownership is more affordable. The release of the B650 chipset brought mid-range and budget motherboard options to the market. And DDR5 RAM prices have dropped drastically, down to around the prices for comparable DDR4 capacities. DDR5 runs at faster speeds than DDR4 out of the gate, starting at 4,800MHz as a baseline, but with higher timings. AMD has also brought a new overclocking specification to rival Intel’s XMP, called EXPO. This should mean that DDR5 kits rated for AMD EXPO will be easier to use and hit the rated faster speeds. The sweet spot for AM5 is 6,000MHz, which some manufacturers sell in AMD-tweaked kits. You might have seen faster RAM, but it’s not guaranteed to run at those speeds, so we think it’s a waste of money. Here are my recommendations for the best and most dependable DDR5 to use with the AM5 platform. Spare no expense DDR5 G.Skill Trident Z5 Neo RGB (AMD EXPO) is the enthusiast's choice for DDR5 memory for the AM5 platform, with a stylish design and fast speeds. G.Skill has consistently performed with Ryzen builds, and the Trident Z5 Neo RGB DDR5 line continues that tradition. It is one of the few RAM kits built for AMD use that offers up to 48GB of memory per module. These sticks also come with AMD’s new EXPO overclocking standard for one-click performance tuning in your BIOS. AM5 can have unwanted effects when using memory speeds over 6,000MHz, so G.Skill has opted to offer kits in 5,600MHz and 6,000MHz. To get more performance, they tuned the timings to some of the lowest CAS latency we’ve seen on DDR5, ranging from CL 28 to 40. The RAM then gets clad in asymmetric heat spreaders and a fetching RGB light bar. It’s one of the best RAM kits on the market, although it does fetch a premium price. Stylish RGB DDR5 The XPG Lancer Blade is a range of DDR5 modules with high speeds and low latency, making them an ideal pick for gaming rigs and systems for creative apps. The XPG Lancer Blade RGB DDR5 kit is available at speeds of up to 8,000 MT/s, although I'd recommend going for the 6,000 MT/s kit for AMD systems for the best value. In this 32 GB kit, the two modules come with 16 GB of memory capacity. At the EXPO-enabled speed, the modules have a CAS latency of 30, which promises decent performance when installed on your PC. The modules have customizable RGB lighting and come with either white or black heat spreaders to match your build. It’s one of the few DDR5 kits to come in white so far, and I know that’s important if you’re theming your PC to a specific color. They also have on-die ECC (Error Checking Code) to provide stability and performance. This basic DDR5 is all you need to get your system running. Crucial RAM DDR5 is a barebone, no-frills way to get your AM5 system up and running with the minimum cost. Most DDR5 memory modules come with aluminum heat spreaders on them for both looks and cooling. Crucial’s DDR5 modules don’t include these, so you only get a naked black-colored PCB with the components on. No heavy heat spreader, no RGB, just capable RAM. That's ideal for filling all your RAM slots for workstation use, or video editing, or other RAM-intensive use cases. That makes it the most cost-effective way to get your AM5 build running, as you’re not paying for things you don’t need. Crucial doesn’t skimp on performance, with speeds on offer between 4,800MHz and 5,600MHz, and capacities of 8GB, 16GB, or 32GB per module. With CAS latencies of between 40 and 46, they will perform slower than the performance DDR5, but your wallet won’t be as light. Trusted performance for a great price The Corsair Vengeance line has long been a mainstay of the midrange RAM market, and the DDR5 versions carry on that trend. This 4800MHz kit isn't the fastest around, but it comes with 64GB of capacity, has low latency, and the lower speed means easier compatibility with your AM5 system. This Corsair Vengeance DDR5-4800 kit isn't the fastest on the market, but it trades speed for capacity and a lower price. That's why it's my midrange price champ, with relatively tight CL40 timings and a low heatspreader design that will fit under pretty much any CPU cooler. It can be overclocked slightly by increasing the voltage, or it can be plugged in and forgotten, content to run at 1.1V for the lifespan of your AM5 build. That makes it a perfect pairing for a B650 motherboard for a low-cost AM5 build with minimal fuss. It's also a good option for small form factor builds, as the low-profile heat spreaders can slip under most CPU air coolers, and won't cause issues with clearance in smaller cases. In the past, buying faster RAM has brought tangible benefits to the overall speed of your build. For AM5, DDR5 already runs faster than DDR4, so by picking up this kit, you can spend slightly more on the CPU or GPU and see immediate benefits instead of only those constrained by RAM speed. Dominator by name and by nature, these RAM sticks will perform. Corsair Dominator Platinum RGB DDR5 carries the company’s design language into the DDR5 era with high speeds and low timings. Corsair’s Dominator Platinum RGB DDR5 could almost be mistaken for its DDR4 line, as the design hasn’t changed much. That’s okay, as the imposing features of this line are in keeping with its name, and it’s why it consistently features in high-end water-cooling builds. Corsair offers EXPO-enabled modules with speeds of up to 6,000MHz and memory capacities of 16GB or 32GB per module. All the AMD-optimized modules have a CAS latency of 40. To avoid compatibility issues, Corsair made a new color scheme, Cool Gray, to differentiate the AMD kit from the black and white versions for Intel support. It still has the stylish iCUE-controlled RGB light bar along the top edge that can sync with all of your other Corsair products. Beware, though — the high-profile design can cause issues with larger CPU coolers. Optimized for Ryzen 7000 G.Skill Flare X5 DDR5 was designed to work with Ryzen CPUs and optimized for the new EXPO overclocking specifications. G.Skill has always had AMD-optimized RAM kits in the form of the Flare series. These modules are specifically designed for the limitations of the Ryzen platform, aiming for stability without introducing performance issues from higher speeds. G.Skill’s Flare X5 series comes in speeds of up to 6,000MHz, the best speed for AM5 motherboards. These modules come in sizes of 16GB, 24GB, 32GB, and 48GB, for a potential 192GB of RAM on the AM5 platform. As with the more expensive Trident Z5 Neo range, the Flare X5 series optimizes the timings to gain more performance. These kits can go down to CL32, one of the lowest latency kits you can get for any DDR5 platform. They’re also low-profile for wide CPU cooler compatibility and come in a two-tone dark gray and black design. Largest capacity consumer DIMMs For content creators or data scientists, more memory is the key to productivity. These Crucial Pro modules pack 48 GB of DDR5 5,600MHz memory into each stick, so you can get up to 192GB into your AM5 build. Content creators and data scientists have one thing in common. That's the need for high capacity memory modules in their computers, to handle the high levels of data their respective fields work with. DDR5 is great for this, as the theoretical maximum per module is 128GB for a dual-rank configuration. DIMMs with that capacity haven't hit the market yet, as manufacturing is catching up to the theoretical. We're not that far off though, as this Crucial Pro DDR5 kit gives you 96GB of memory capacity spread across two 48GB modules. That's a lot of memory capacity per module, and usually you'd be looking at slower speeds as the tradeoff. The Crucial Pro 48GB modules run at up to 5,600MHz, with downclocks to 5,200MHz and 4,800MHz if your system can't handle the speeds. The Crucial Pro modules also come with timings tuned for AMD's EXPO specification and a CAS latency of 46. Low-profile DDR5 with gorgeous RGB Kingston Fury Beast RGB DDR5 memory comes in a variety of speeds and sizes and has some of the smoothest RGB effects around. Kingston’s Fury Beast RGB DDR5 is the flashier version of the company’s Fury Beast line. It features the same range of speeds between 4,800MHz and 6,000MHz, and CAS latencies of 36, 38, or 40, though the versions optimized for AMD Expo are the CL36 models. The modules have memory capacities of 8GB, 16GB, or 32GB. You can also get the non-RGB version if you prefer. Kingston’s Infrared Sync RGB light bar adorns these modules, which is one of the best RGB implementations I’ve used. It glows smoothly without the annoying hot spots that some RGB RAM suffers from. Kingston also offers these modules in white or black heat spreaders for theming to match your build. They’re more low-profile than most RGB DDR5, with a 34.9mm height. Throughout every generation of Ryzen processors, G.Skill’s Trident range has been consistently outperforming the competition. That’s why the Tridetn Z5 Neo RGB is my pick for the best RAM for the AM5 platform. It has style, power, all of the performance you could want, and lower latency timings compared to most DDR5 kits. You might only want to look elsewhere if you use a larger air cooler on your CPU, as the heat spreaders are tall and will interfere with the cooler. For price considerations or workstation use, the basic, unclad Crucial RAM DDR5 kits are worth checking out, as they have the same performance while costing less as they don’t have heat spreaders. So long as you're buying a kit with speeds beyond 5,000 MT/s, the AMD processor will run well. I'd recommend hitting 6,000 - 6,400 MT/s for the best price to performance. Moving above 6,400 MT/s will run the risk of system instability, but be sure to check your motherboard for RAM support. G.Skill Trident Z5 Neo RGB (AMD EXPO) is the enthusiast's choice for DDR5 memory for the AM5 platform, with a stylish design and fast speeds. While you're researching your AM5 build, check out some of our other guides on the best AM5 coolers, best M.2 SSDs, and more to complete your PC build. You could also head on over to our XDA Computing Forums to discuss your plans and get help from the knowledgeable community.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Maker, meme-r, and unabashed geek with over half a decade of blogging experience. He's covered everything from Apple to crypto and crowdfunding, and loves getting to the bottom of why someone should spend their money on a product. If it runs on electricity (or even if it doesn't), Joe probably has one around his office somewhere. His hobbies include photography, animation, and hoarding Reddit gold. What decides how fast your RAM is? Frequency or latency? Discover how these ergonomic office chairs can transform your workday comfort and well-being. Microsoft has granted Windows 11 22H2 users another year of non-security updates. Crucial's 2TB Gen4 M.2 SSD is now down to its lowest price, making it the perfect upgrade your computer or laptop. A new 2-in-1 Latitude business laptop leads the way with plenty of other refreshes for 2024. Seven new Precision devices, including mobile workstations and desktop PCs, are headed our way March 2024. "
}