{
    "title": "Acer reveals Predator and Nitro Radeon RX 7000 GPUs as it steps more \nconfidently into third-party graphics at CES 2024",
    "date": "1/10/2024",
    "url": "https://www.techradar.com/computing/gpu/acer-reveals-predator-and-nitro-radeon-rx-7000-gpus-as-it-steps-more-confidently-into-third-party-graphics-at-ces-2024",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Acer's growing lineup of third-party cards is encouraging At CES 2024, Acer has announced an expansion of its graphics card portfolio, introducing new models including the Predator BiFrost AMD Radeon RX 7800 XT OC and a selection of Nitro graphics cards powered by the latest AMD Radeon RX 7000 series GPUs, including AMD's newest card, the Radeon RX 7600 XT. Announced at the beginning of the CES this year, the Radeon RX 7600 XT, as well as the other three graphics cards expands Acer's graphics card partnership with AMD after a successful partnering with Intel last year. These new products are designed to provide users with enhanced gaming experiences, featuring up to 16GB memory and incorporating next-generation technologies like ray tracing and AI accelerator chips for AI workloads like Stable Diffusion. The Predator BiFrost AMD Radeon RX 7800 XT OC is set to launch in North America starting in February, with a starting price of $549.99, with the UK and Australia getting the card within Q1. The Nitro series, including the AMD Radeon RX 7800 XT OC, RX 7700 XT OC, and RX 7600 XT OC, will also be available in these regions around the same time, with prices starting from $509.99 in the US. The Predator BiFrost model features 60 unified AMD RDNA 3 compute units, paired with Predator FrostBlade 3.0 fans, promising high performance in 1440p and 4K gameplay. The Nitro series, on the other hand, offers options ranging from 12 GB to 16 GB of GDDR6 memory, along with various bandwidth capabilities to cater to different gaming needs. All models emphasize advanced cooling systems, incorporating features like Nitro FrostBlade ringed fans and reinforced copper bases for efficient heat absorption. The release of these graphics cards marks Acer's commitment to catering to the needs of gamers and creative professionals alike. Leveraging AMD's RDNA 3 architecture, these cards aim to deliver fluid resolution and high-refresh-rate gaming, even in the most demanding titles. Additionally, they support DirectX 12 Ultimate API for enhanced visuals and include AMD's new encode/decode media engine for a dynamic range of colors and improvements in playing or streaming. Check out our CES 2024 hub for all the latest news from the show as it happens. We'll be covering everything from 8K TVs and foldable displays to new phones, laptops, smart home gadgets, and the latest in AI, so stick with us for the big stories. And don’t forget to follow us on TikTok for the latest from the CES show floor! Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. John (He/Him) is the Components Editor here at TechRadar and he is also a programmer, gamer, activist, and Brooklyn College alum currently living in Brooklyn, NY.  Named by the CTA as a CES 2020 Media Trailblazer for his science and technology reporting, John specializes in all areas of computer science, including industry news, hardware reviews, PC gaming, as well as general science writing and the social impact of the tech industry.  You can find him online on Threads @johnloeffler.  Currently playing: Baldur's Gate 3 (just like everyone else). Intel Battlemage leak gives us hope that maybe there’ll be a more powerful 2nd-gen Arc GPU after all Samsung officially reveals GDDR7 memory for GPUs, which is great news for gamers Quordle today – hints and answers for Sunday, March 31 (game #797) By Cesar CadenasMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Al GriffinMarch 29, 2024 By Cesar CadenasMarch 29, 2024 By Alex WhitelockMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}