{
    "title": "AMD Radeon RX 7600 XT 16GB graphics card round-up — all AIB partner \nversions of the new GPU",
    "date": "1/24/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/amd-radeon-rx-7600-xt-16gb-graphics-card-round-up-all-aib-partner-versions-of-the-new-gpu",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Sapphire, XFX, Asus, Gigabyte, and ASRock It's RX 7600 XT review day — in preparation for the RX 7600 XT's launch, we've put together a list of all AIB partner card variants that we could find today. The RX 7600 XT is AMD's latest GPU in the RX 7000 series lineup, with double the memory capacity of the RX 7600 and a slightly higher TBP. For more details on the GPU itself, be sure to check out our full review of the RX 7600 XT.  We'll start with Sapphire, one of AMD's most beloved AIB partners, which has just one RX 7600 XT listed at the moment: the RX 7600 XT Pulse. This new card is an entry-level unit, sporting a compact, dual-slot, dual-fan cooling system with composite heatpipes and a minimalistic matte-black color scheme with red accents. Next up: XFX has unveiled two RX 7600 XT variants, including the dual-fan Speedster Swift 210 and the triple-fan Qick 309. Both models are virtually identical, save for the third fan on the Qick 309. Both models feature 4-piece 6mm nickel-plated copper heatpipes and a nickel-plated copper base plate that cools the GPU and GDDR memory chips. Both cards come with an aluminum backplate with a cutout at the rear end for air to pass through. Aesthetically, both cards feature a fully blacked-out stealthy finish — the white Radeon and XFX names are the only things that stand out from the card's otherwise all-black color scheme. Asus has unveiled two new RX 7600 XT SKUs, including factory-overclocked Dual and TUF Gaming variants. The TUF Gaming model is the more potent offering, featuring the brand's famous triple-fan cooler design and a 2.96 slot thickness. Power is filtered through \"military-grade 20K capacitors\" and supplementary power is provided through two PCIe 8-pin power connectors. Similar to the XFX designs, the TUF Gaming sports a pass-through airflow design at the end of the graphics card allowing air to pass through the heatsink and a cutout in the rear backplate to expel hot air quickly. Aesthetically, the card features a military-themed gray finish with RGB accent lighting on the card's side. The Dual model, as the name suggests, is Asus' entry-level/compact offering with a dual-fan cooler design. The card is much smaller than its TUF Gaming counterpart, coming in at 2.5 slots in thickness and 227mm in length. The Dual sadly does not come with military grade 20K capacitors, however, supplementary power is provided with a single 8-pin connector (instead of two, improving compatibility with lower-end systems that lack dual 8-pin connectors). Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. One interesting tidbit of this card is that its heatsink fins run horizontally across the card, rather than vertically. This design enables hot exhaust air to accelerate from the heatsink through the front and back of the cooler instead of the side. This can be optimal in some chassis where side clearance is highly restrictive, encouraging heatsink designs that only eject air out the front and rear — similar to blower-style coolers. Aesthetically, the Dual features a stealthy black design with glossy and matte elements paired with white Radeon text on the side.  For now, Gigabyte has just one SKU for the RX 7600 XT — the factory-overclocked RX 7600 XT Gaming OC. This model comes with a beefy triple-fan cooling solution sporting a rear cut-out on the backplate (just like all the other triple-fan cards), and five copper heatpipes that make direct contact with the GPU. The card comes with Gigabyte's Windforce cooler design, which has a central fan that spins in the opposite direction of the adjacent two outer fans and an unrestrictive shroud for improved airflow efficiency. Aesthetically the card has a matte-black shroud with gray accents and a gray backplate. There is some RGB lighting on the small Gigabyte logo installed on the right side of the GPU. ASRock has two new RX 7600 XT SKUs — the white Steel Legend OC and the black Challenger OC. The Steel Legend OC is the more potent model of the two, with a skinny, dual-slot, triple-fan cooler design, and a full white color theme with RGB-illuminated fans. The GPU and VRAM area is cooled via a nickel-plated copper base plate and ASRock's \"Ultra-fit\" heat pipes, which are square-shaped to maximize contact with each other and the copper base plate. There's also a massive cut-out at the end of the card's backplate to improve cooling effectiveness. The Challenger OC is ASRock's entry-level card, featuring a compact, dual-slot, dual-fan cooling configuration and a matte-black color scheme. Unlike the Asus Dual, however, this card has two PCIe-8 pin connectors and a cut-out at the end of the backplate for extra airflow just like all the other triple-fan options. The Challenger OC also comes with the same ultra-fit heat pipes as the Steel Legend OC to improve heat dissipation. Aaron Klotz is a freelance writer for Tom’s Hardware US, covering news topics related to computer hardware such as CPUs, and graphics cards. Seven-year-old AMD gaming GPU continues to stick around — low-profile RX 550 arrives for SFF PCs Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels Best Resin 3D Printers 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}