{
    "title": "AMD Ryzen 7 8700G CPU Review",
    "date": "1/29/2024",
    "url": "https://www.cgmagonline.com/review/hardware/amd-ryzen-7-8700g-cpu-review/",
    "text": "Home > Reviews > Hardware AMD Ryzen 7 8700G CPU AMD is starting 2024 strong, bringing its latest offering, the Ryzen 8000G processor family, giving us a solid look at what the next generation of integrated graphics can look like. But with any CPU launch, the flagship in the range gives a good taste of what is possible with the platform, and that is true for the AMD Ryzen 7 8700G CPU. This 8-core, 16-thread chip promises exceptional performance thanks to major IPC improvements, higher clock speeds, and upgraded Radeon integrated graphics. Even though it brings with it a fair share of expectations, the Ryzen 7 8700G does not disappoint. While the full range of the Ryzen AM5 chips come with some level of GPU built onto the CPU, the 8000G tries to step things up, offering up an option that looks to hold its own against some low-end graphics cards people still buy even in 2024. But let’s start with the basics: the 8700G is built on TSMC’s cutting-edge 4nm manufacturing process, allowing AMD to cram 25.4 billion transistors onto a compact 178mm2 die. It has a 65W TDP, so in theory, we’re looking at a very efficient chip that runs surprisingly cool, even under load. As mentioned above, in terms of architecture, the 8700G utilizes the latest Zen 4 design, which brings a hefty 13% IPC uplift over previous Zen 3 chips. That’s a big deal, as instructions per clock determine how much work the CPU can perform at a given frequency. Combine that IPC jump with clock speeds reaching an astonishing 5.1GHz boost, and you’ve got one speedy processor, at least on paper. What really sets the 8000G range apart from the rest of the Zen 4 family is the integrated graphics, namely AMD’s new Radeon 700M series. The 8700G comes packed with 12 RDNA 3 compute units clocked at up to 2.9GHz. That’s a huge upgrade over the older Vega graphics in previous Ryzen G chips. Looking at the raw numbers, it brings 2x the performance, potentially allowing the 8700G to play modern AAA games at 1080p low to medium settings. When first shown to the press, AMD showed off some impressive numbers, with the 8700G averaging over 60fps in popular titles such as Dota 2, GTA V, Hitman 3 and F1 2022. The Radeon graphics also enable useful features such as Radeon Super Resolution for intelligent upscaling and AMD Fluid Motion Frames for smooth gameplay using frame generation. Combined with the new Hyper-RX performance profile in AMD’s Adrenalin software, you can get a surprisingly solid gaming experience without a dedicated graphics card. With this being the age of AI—dominating the conversation in everything from laptop launches to the news cycle—it was only expected they would be making their way to the desktop. The 8000G family is the world’s first desktop processor featuring dedicated AI acceleration hardware. Dubbed AMD Ryzen AI, this onboard neural processing unit is designed specifically for AI workloads using incredibly efficient architecture. This brings dedicated AI features, all running on the AI engine with minimal power draw without bogging down the PC. This allows you to do things like real-time background blur and gaze correction in video calls while freeing up your CPU and GPU for other tasks. The AI hardware also accelerates creative apps, providing intelligent upscaling, object selection, scene detection, and more in programs like Topaz Labs, DaVinci Resolve, and Cyberlink, allowing for more creative workflows that stretch what is possible on the desktop, but more on this later. But with the promise of this new CPU out of the way, it is actually time to see how it fairs in our test bench. We are using a slightly new build compared to the previous Zen 4 bench, with us using an ASUS ROG Strix b8650-A Gaming WiFi motherboard and 32 GB DDR5-6400 EXPO memory supplied by AMD, a Lexar PCI-E Gen4 2TB m.2 SSD, with a 1000Watt Gigabyte PSU, in an NZXT H5 Flow case, paired with an AMD Radeon 7900 XTX GPU. The system has all the latest drivers and software supplied by AMD, with Windows 11 updated to the latest version to ensure nothing could skew testing. In Cinebench R23, the AMD Ryzen 7 8700G CPU scored an impressive 1,500 points in the single-core test and 12,000 points in the multi-core test. These scores put the 8700G ahead of competing processors in its class, making it an excellent choice for demanding applications like video editing, 3D rendering, and programming. In Cinebench R24, we saw 109 single-core, along with a solid 949 multicore score. Jumping over to CPU-Z, we saw the Ryzen 7 8700G delivering a score of 7312 and single core scores of 675. Putting this in perspective, this places this new CPU as a very capable mid-range offering, comparing well against some more powerful AMD Zen 4 offerings like the Ryzen 7 7700X and well ahead of the Zen 3-based Ryzen 7 5700G. With synthetic benchmarks now out of the way, it was time to jump into some gaming tests. We wanted to get the best perspective of how the CPU faired in modern games and tested the games with HYPER-RX enabled to see what is possible with the GPU, all without pushing the workload over to the dedicated GPU, and I was honestly impressed with what I saw. We switched up our normal suite of games to get a good picture of how the CPU fairs in low-end games and AAA titles to give prospective buyers a clear picture of what the Ryzen 7 8700G offers. Normally, onboard graphics are anemic, to say the least, with older games barely able to run at +30 FPS, but the Ryzen 7 8700G managed to excel, especially in eSports and multiplayer titles. Dota 2 and League of Legends are both games that work well with integrated graphics and are solid benchmarks for seeing how well the Radeon 700M performs against standard integrated graphics. Both titles saw double-digit improvements over the latest Intel Core i9 14900K, with 33% and 11% performance increases respectively. The same story holds true when we move on to more demanding titles such as Cyberpunk 2077, Assassin’s Creed Valhalla and our benchmark staple, Hitman 3 at 1080P. These are all titles that could theoretically be played on the integrated offering found in an Intel Core i9 14900K, but they are far from enjoyable experiences. The AMD Ryzen 7 8700G CPU managed to deliver experiences well above 30 fps in all titles, with Assassin’s Creed Valhalla delivering a solid 64.5 fps, something I did not expect. A CPU delivering solid numbers all while not touching the GPU is a great thing to see. Granted, these are not results that will let enthusiasts avoid picking up a dedicated GPU, but they do give low-end or casual gamers a chance to experience a wider variety of games, all while enjoying them at much more playable and enjoyable framerates. Even AAA games like Assassin’s Creed Valhalla and Cyberpunk 2077 suddenly become playable, which was simply not a thing you could hope for previously without some sort of GPU slotted into your rig. Turning to creative workflows, the AMD Ryzen 7 8700G brings some solid specs to the table—not as powerful as the Ryzen 7 7700X, but close enough that the trade-off for extra graphics and AI features starts to make sense. Rendering and working with 1080P and 4K clips in DaVinci Resolve was a surprisingly smooth, fast and responsive experience. The features of the onboard GPU allow for smoother rendering and also ensure that AV1 and other advanced features of the RDNA 3 range are carried over to this APU offering. Much like DaVinci Resolve, the Adobe suite was a great experience that faired well against some of the more expensive chips on the market. All applications delivered some fantastic performance, and that is before we even touch on what the AI features of the CPU bring to the table. Now, this is an area where it is hard to put your finger on just how useful it will be to the end user. Applications like Stable Diffusion can now be run locally without the need for a dedicated GPU to carry the workload, and the AI engine can help ease the burden of AI workloads, giving you more resources to try more exciting applications or just push the system you have a little further. While I tested some AI demos in my benchmarking of the AMD Ryzen 7 8700G, these demos are still a bit hacky and don’t give a full picture of what’s possible. However, the concept is there, and with it in place and ready for new applications, I could see this feature being a major selling point for the AMD Ryzen 7 8700G. While everything sounds fantastic, especially when you consider how much CPU and GPU this little chip offers, the limitations of an all-in-one solution still come up with the Ryzen 7 8700G. The age-old problem that integrated graphics still rely on system memory rather than dedicated VRAM is still present here. Although AMD is using some clever optimizations to boost bandwidth, you’ll always get better gaming experiences with a discrete GPU sporting its own high-speed memory. In testing, it was not a major issue, but for more complex workflows, I would suggest investing in more memory just not to hit a bottleneck that holds everything bad, especially if you want to dive into AI applications or content creation at any reasonable scale. With AMD Ryzen AI, the Ryzen 7 8700G can seamlessly handle AI workloads while minimizing the impact on overall system performance. This makes it an excellent choice for users who want to leverage AI technologies for various tasks, including gaming, content creation, and productivity. It is also used in a range of applications from Topaz Labs, Dasvinchi Resolve, Blender and Audacity, among others, all of which bring varying degrees of AI functionality to the table, which could be very exciting for anyone looking to get into AI on the desktop. With this all out of the way, it’s hard to beat the AMD Ryzen 7 8700G CPU’s $329 asking price. You’d have to spend over $650 to build a comparable rig with Intel’s Core i5-14600K and a budget NVIDIA GTX 1650. So AMD is delivering better gaming frame rates AND application performance at half the cost. Granted, this is not a flagship-level CPU, but it does bring a lot to the table for the price, and combined with the new AI Engine, that could be a great solution for people wanting to get the most out of every part of their new rig. The AMD Ryzen 7 8700G CPU sets a new standard for integrated graphics and AI acceleration in desktop processors. It offers a remarkable balance of high performance, efficiency, and advanced features, all at a very competitive price. The processor’s ability to handle modern games at decent framerates and its proficiency in creative and AI-driven applications make it a standout choice for budget-conscious gamers and content creators. While it does have limitations, for budget-focused gamers and creators who want excellent future-proofed performance without breaking the bank, this newest Ryzen 8700G processor is a winner in my book. Brendan Frye has over a decade of experience in the gaming and media industry. From an early age, he loved gaming, and that life-long passion has found its way to his work. He now works as the EIC of CGMagazine, along with acting as a Judge for numerous gaming conventions. He contributes to shows such as The List and other radio and TV programs. When he is not working, he can be found enjoying the latest Souls experience or finding a good horror movie that is in need of watching. This post may contain affiliate links. If you use these links to buy something, CGMagazine may earn a commission. However, please know this does not impact our reviews or opinions in any way. See our ethics statement. CGMagazine may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of CGMagazine. By using this website, you signify your acceptance of these Terms of Use. © 2021 CGMagazine Publishing Inc. All Rights Reserved. "
}