{
    "title": "AMD's next-gen Zen 5 CPUs could already be in production – so get ready for \na launch in around six months",
    "date": "1/15/2024",
    "url": "https://www.techradar.com/computing/cpu/amds-next-gen-zen-5-cpus-could-already-be-in-production-so-get-ready-for-a-launch-in-around-six-months",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Desperate for Zen 5 processors? AMD is already making them, apparently AMD’s next-gen Zen 5 processors are already in mass production, or so we’re told by the rumor mill. This nugget of information was revealed by a well-known leaker on X (formerly Twitter), Kepler, after they were asked a question about whether these ‘Granite Ridge’ desktop chips were already in production. YeahJanuary 15, 2024 As you can see, Kepler replied to say yes, they are (via Wccftech). Take that, of course, with a wheelbarrow full of seasoning, especially seeing as there’s no elaboration beyond the one-word answer. Zen 5 processors could be Ryzen 8000, or AMD may skip that and go straight to Ryzen 9000 (leaving the Ryzen 8000 series as just the APUs – all-in-one chips with peppy integrated graphics – that were revealed at CES 2024 last week). Whatever the name ends up being, we know that these processors will be supported by current AM5 chipset motherboards, and indeed that support should run for quite some time yet. Zen 5 processors being in mass production doesn’t mean they are just around the corner. If we look back at Ryzen 7000 CPUs, rumors about mass production were floating around in March 2022, before the desktop chips were released in September – so the first rumblings came some six months ahead of time. That means Zen 5 (Ryzen 8000 or 9000) CPUs might just turn up in July, or just after, and this aligns with what we’ve heard more recently on the rumor mill about a likely Q3 launch timeframe (July to September). Historically, it’s more likely to be later in the quarter, than midyear (July), and the other factor to bear in mind is that AMD isn’t exactly going to feel rushed by Intel’s (theoretical) progress with its next-gen processors. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. Rumor has it that Intel’s Arrow Lake won’t turn up until late in 2024, so AMD has plenty of breathing room in that respect. In short, Team Red has that maneuvering space to wait until it has plenty of production running and stock built up before launching Zen 5, so folks aren’t disappointed by inventory shortages and the like. All of this is very much in theory, but suffice it to say that mass production kicking off is in line with everything else we’ve been hearing (including early mentions of the Ryzen 900 series, a tiny clue – again add skepticism – that this may be the name for Zen 5 desktop CPUs). Roll on the battle of the next-gen chips as they attempt to dominate our selection of the best processors. Darren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013). AMD could release faster versions of last-gen Ryzen CPUs that are perfect for budget builds and upgrades An excellent AMD budget gaming CPU is now on sale for less than $200 at Walmart US Treasury says that AI has made financial fraud easier than ever By Alex BlakeMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By Rob DwiarMarch 28, 2024 By James RogersonMarch 28, 2024 By Kristina TerechMarch 28, 2024 By Lewis MaddisonMarch 28, 2024 By Becky ScarrottMarch 28, 2024 By David NieldMarch 28, 2024 By Craig HaleMarch 28, 2024 By James RogersonMarch 28, 2024 By Dashiell WoodMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}