{
    "title": "Advanced Micro (AMD) Surges 8.3%: Is This an Indication of Further Gains?",
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/news/advanced-micro-amd-surges-8-145100507.html",
    "text": "Advanced Micro Devices AMD shares ended the last trading session 8.3% higher at $158.74. The jump came on an impressive volume with a higher-than-average number of shares changing hands in the session. This compares to the stock's 5.5% gain over the past four weeks. AMD is benefiting from portfolio strength and an expanding partner base. Strong demand for EPYC processors has been a growth driver. This chipmaker is expected to post quarterly earnings of $0.77 per share in its upcoming report, which represents a year-over-year change of +11.6%. Revenues are expected to be $6.11 billion, up 9.2% from the year-ago quarter. While earnings and revenue growth expectations are important in evaluating the potential strength in a stock, empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements. For Advanced Micro, the consensus EPS estimate for the quarter has been revised marginally higher over the last 30 days to the current level. And a positive trend in earnings estimate revision usually translates into price appreciation. So, make sure to keep an eye on AMD going forward to see if this recent jump can turn into more strength down the road. The stock currently carries a Zacks Rank #2 (Buy). You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>> Advanced Micro is a member of the Zacks Electronics - Semiconductors industry. One other stock in the same industry, Nova Ltd. NVMI, finished the last trading session 0.2% lower at $133.60. NVMI has returned 0.5% over the past month. Nova Ltd.'s consensus EPS estimate for the upcoming report has remained unchanged over the past month at $1.24. Compared to the company's year-ago EPS, this represents a change of -3.1%. Nova Ltd. currently boasts a Zacks Rank of #3 (Hold). Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Advanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report Nova Ltd. (NVMI) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}