{
    "title": "Another game gets AMD's FSR 3 frame generation - but (probably) not the one \nyou were hoping for",
    "date": "1/19/2024",
    "url": "https://www.tweaktown.com/news/95696/another-game-gets-amds-fsr-3-frame-generation-but-probably-not-the-one-you-were-hoping-for/index.html",
    "text": "Farming Simulator 22 is the latest game to get AMD's FSR 3 frame generation tech to help with smoother frame rates. Farming Simulator 22 gets farm generation - erm, frame generation, we mean (Image Credit: Giants Software) It's a niche title, obviously, albeit one that's popular with its fans (online competitions, leagues and so on are built around this game, we should add). The addition of FSR 3 will go a long way towards smoother harvesting and hay bale stacking. The feature comes with Farming Simulator 22 update version 1.13.1.1, and naturally requires an AMD (or NVIDIA) graphics card that supports FSR 3. RX 5000 GPUs are included, but it's recommended to have an RX 6000 or 7000 model. (For NVIDIA, RTX 2000 works, although RTX 3000 and 4000 GPUs are recommended). The caveat is that FSR 3 works best to improve an already decently smooth frame rate (60 fps or better), in order to mitigate any potential latency side-effects. This brings the number of games with FSR 3 support up to a total of 7 (with Call of Duty just added, too), which is still a pretty low number compared to DLSS 3 (on something like 80, from the latest count we saw). However, with AMD's move to make the code open source (at the end of last year), FSR 3 can now be unofficially modded into games, with some pretty nippy results from what we've seen. We're talking Cyberpunk 2077 doubling frame rates, for example, and becoming much smoother. While an unofficial modding of the tech into a game will never be as good as full support from the developer, it's certainly way better than nothing, and this is another advantage of AMD's frame generation compared to NVIDIA's (as well as support for rival graphics cards - DLSS 3, well, it's v3.5 now, is NVIDIA only and proprietary). Darren Allan Darren has written for numerous magazines and websites in the technology world for almost 30 years, including TechRadar, PC Gamer, Eurogamer, Computeractive, and many more. He worked on his first magazine (PC Home) long before Google and most of the rest of the web existed. In his spare time, he can be found gaming, going to the gym, and writing books (his debut novel – ‘I Know What You Did Last Supper’ – was published by Hachette UK in 2013). Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}