{
    "title": null,
    "date": "1/31/2024",
    "url": "https://www.wionews.com/business-economy/amds-ai-chip-ambitions-face-wall-street-skepticism-despite-15-bn-boost-in-forecast-685467",
    "text": "According to Reuters, AMD's stock, which has surged approximately 140 per cent in the past year, saw a decline of about 6 per cent in extended trading as the company also provided first-quarter revenue estimates below Wall Street's predictions. Chipmaker AMD on Tuesday announced a $1.5 billion boost to its 2024 forecast for artificial intelligence (AI) processors, aiming for a total of $3.5 billion. However, this optimistic projection fell short of meeting the high expectations set by Wall Street, leaving investors wanting more. According to Reuters, AMD's stock, which has surged approximately 140 per cent in the past year, saw a decline of about 6 per cent in extended trading as the company also provided first-quarter revenue estimates below Wall Street's predictions. Investing.com analyst Jesse Cohn expressed disappointment with AMD's performance, highlighting a \"notable miss on operating income and operating margins.\" Cohn emphasised the challenge the company faced amid elevated expectations, stating, \"The company had little margin for error amid lofty expectations, and investors were disappointed with the forward guidance provided for the current quarter.\" AMD's CEO Lisa Su acknowledged the company's potential to surpass the projected $3.5 billion worth of AI chip sales once additional capacity comes online in the second half of the year. However, analysts, who had previously projected figures ranging from $4 billion to $8 billion for the AI segment, found the update fell short of their expectations, impacting the stock valuation. During a conference call, Lisa Su commented on the soft demand from cloud computing companies within AMD's data centre segment, which includes both traditional server chips and AI processors. Su noted that as companies strive to develop their own generative AI applications, enterprise budgets are directed towards processors used in AI servers. With Nvidia holding a dominant 80 per cent market share, AMD's position as a viable alternative in the market is crucial. Despite the overall growth of AMD's data centre segment by 38 per cent to $2.3 billion, the company faces challenges in the evolving landscape of AI and cloud computing. AMD's struggles extend beyond the AI segment, with weaknesses evident in the programmable chip market, which has seen a downturn due to a chip supply glut impacting industries like automotive and industrial. The fourth-quarter embedded segment revenue for AMD fell roughly 24 per cent to $1.1 billion. Additionally, the gaming segment experienced a 17 per cent contraction to $1.4 billion, influenced by reaching peak revenue from chip designs for gaming consoles like Microsoft's Xbox and Sony's PlayStation 5. While AMD anticipates growth in the PC market with built-in AI capabilities, scepticism remains among investors and analysts regarding the company's ability to meet the expectations set by its competitors. (With inputs from Reuters) "
}