{
    "title": "The Biggest CES 2024 PC News From Intel, Dell, AMD, HP, Nvidia, Lenovo And \nMicron",
    "date": "1/13/2024",
    "url": "https://www.crn.com/news/components-peripherals/2024/the-biggest-ces-2024-pc-news-from-intel-dell-amd-hp-lenovo-and-nvidia",
    "text": "At CES 2024, the emerging AI PC category was a big topic for some of the channel’s largest vendors such as HP Inc., Lenovo, Dell Technologies, Intel, AMD and Nvidia. CRN rounds up the most important PC news coming out of the annual trade show that partners need to know.  If you weren’t listening before, some of the channel’s largest vendors wanted to make sure you got the message at this week’s CES 2024 event: the AI PC is here. What started as a steadily growing drumbeat last year of pronouncements about the AI PC’s debut from major chip companies and OEMs turned into a harmony of industry forces saying we are now in a new era of computers with advanced AI capabilities. [Related: Analysis: 5 Takeaways On The State Of AI PCs And Why Big Channel Vendors Are Excited] This was apparent not only from the announcements about new AI-enabled PCs from Dell Technologies, HP Inc. and Lenovo but also the keynotes from Nvidia, AMD and Intel, who revealed new processors for AI PCs. As CRN reported for AI PC Week in December, these vendors believe AI PCs will reinvigorate the computer industry and lead to new opportunities for solution providers. However, while some “killer apps” already exist, vendors are still on the hunt for many more that will make AI-enabled PCs indispensable. What follows are the biggest PC news developments to come out of CES 2024 from HP Inc., Lenovo, Dell, Intel, AMD, Nvidia and Micron Technology. These developments cover everything from new AI-enabled laptops and desktops to new CPUs and GPUs for AI PCs as well as a game-changing modular memory form factor that could give the category a big boost.  While Nvidia used CES 2024 to launch a new batch of GeForce RTX GPUs for desktop PCs, the AI chip giant came to the convention with a bigger message about how its graphics chips are powering more than 100 million high-performance AI PCs. “Generative AI is the single most significant platform transition in computing history and will transform every industry, including gaming,” said Jensen Huang, founder and CEO of Nvidia. “With over 100 million RTX AI PCs and workstations, Nvidia is a massive install base for developers and gamers to enjoy the magic of generative AI.” The company said its new GeForce RTX 40 Super Series GPUs not only raise the bar for gaming performance compared to previous models. The GPUs are also “the ultimate way to experience AI on PCs,” thanks to their specialized Tensor Cores delivering up to 836 AI tera operations per second to boost gaming, creativity and productivity, according to Nvidia. To enable new generative AI experiences and highlight the capabilities of its GPUs, Nvidia released several new applications and services for PCs, including a version of the popular Stable Diffusion XL text-to-image model that is designed to run faster on Nvidia GPUs through the company’s TensorRT software library. The chip designer also announced that it plans to release later this month Chat with RTX, a tech demo that uses Nvidia’s open-source TensorRT-LLM software library to connect large language models with a user’s data through a technique known as retrieval-augmented generation. Nvidia said the tech demo, which can help users “quickly interact with their notes, documents and other content,” will also be made available as an open-source reference project for developers. The other AI applications and services coming to PCs include Nvidia RTX Remix, which provides generative AI tools to “transform basic textures from class games into modern, 4K-resolution, physically based rendering materials.” There is also Nvidia ACE microservices, which lets developers use generative AI to “add intelligent, dynamic digital avatars to games.” Nvidia also highlighted that it plans to release Nvidia AI Workbench, a free platform for creating, testing and customizing pretrained generative AI models, in beta later this month. Developers can then scale those projects to any data center or cloud infrastructure.  Last month, Intel launched its much-hyped Core Ultra “Meteor Lake” to enable the first wave of laptops with advanced AI capabilities, so the company used CES 2024 to share news about OEMs backing the new chips, successor chips set to arrive later this year and a new family of processors for heavy-duty laptops running demanding applications. The chipmaker also revealed 18 new processors in its Core 14th Gen desktop lineup and a trio of chips for mainstream ultrathin laptops in the Core U Series 1 lineup. “This year, you can expect more than 750 designs across both Intel Core and Intel Core Ultra families from our top global OEM partners like Acer, Asus, Dell, HP, LG, MSI, Microsoft Surface Samsung, and so many more,” said Michelle Johnston Holthaus, the general manager of Intel’s Client Computing Group, at a CES keynote on Monday. At the keynote, Holthaus revealed that Intel plans to launch or at least start shipping to OEMs two successors to Core Ultra, Arrow Lake for desktop PCs and Lunar Lake for laptops. Holthaus said Arrow Lake is Intel’s “first desktop gaming CPU with an AI accelerator,” which refers to the neural processing unit (NPU) that debuted in the Core Ultra chips to handle low-power AI workloads in laptop. She added that Arrow Lake will represent an extension of the Meteor Lake architecture used for the first Core Ultra chips. Lunar Lake, on the other hand, is a “radically new low-power architecture” that will bring “significant [instructions per clock] improvements in the CPU core and more than three times more AI performance on both the GPU and the NPU” compared to Meteor Lake, Holthaus said. “Our execution on this product has been excellent. And I'm pleased to say that we're already shipping systems to partners. It's up and running. It's doing very well. And Lunar Lake is truly [delivering] the next-level AI performance for thin-and-light PCs,” she said. Designed for gamers, content creators and professionals who want super-fast performance, the Intel Core 14th Gen HX-series is one of the last CPU families to use the company’s old branding scheme for client processors (the new branding is represented by the new Core Ultra and Core chips, which lack a generation designator in their names). The company said the new HX-series processors will be made available this year in more than 60 laptop designs from HP Inc., Lenovo, Asus, Dell, Acer and other OEMs. The Intel Core 14th Gen HX-series processors feature up to a 5.8GHz turbo frequency and as many as 24 cores and 32 threads. They also support up to 192GB in DDR5 memory capacity with 5600 megatransfers per second in addition, Thunderbolt 5 connectivity with 80 Gbps of bi-directional bandwidth, Intel Wi-Fi 6E and Wi-Fi 7 as well as Bluetooth 5.4 and 5.3. All five chips in the lineup, which range from the Core i9-14900HX to the Core i5-14450HX, have a base power of 55W and a max turbo power of 157W. When it comes to benchmarks measuring overall performance, productivity performance and content creation performance, Intel said the Core i9-14900HX is faster in varying degrees than AMD’s Ryzen 9 7945HX.  Micron Technology revealed at CES 2024 a new standard for modular memory in laptops that it said will enable “higher performance, energy-efficiency, space savings and modularity.” The technology is called low-power compression attached memory module, or LPCAMM2 for short, and it’s meant to replace the industry’s practice of soldering memory DIMMs directly onto the motherboard for ultrathin laptops and devices with innovative form factors like foldable PCs. The introduction of Micron’s modular memory solution for PCs represents one of the first attempts to commercialize the LPCAMM2 specification, which was, with Micron’s sponsorship, defined by JEDEC, a microelectronics trade group that is behind many memory standards. The LPCAMM concept was first introduced by Dell Technologies in 2022. Now there’s a movement to commercialize the technology as a new standard, which started with Samsung Electronics last fall and continues with Micron’s new announcement. According to Micron, the LPCAMM2 form factor will support LPDDR5X memory capacities from 16GB to 64GB, and it will provide several benefits, both for end-users and OEMs. When compared to SODIMM offerings, LPCAMM2 can provide 71 percent better performance and 61 percent lower power for common workloads such as web browsing and video conferencing as well as 64 percent space savings. The modular nature of LPCAMM2 also means users will once again have the option to upgrade or replace a laptop’s memory, which isn’t possible with soldered-on RAM. Jake Whatcott, director of marketing for Micron’s compute and networking business unit, told CRN that the timing of LPCAMM2’s arrival is fortuitous, addressing major pain points in laptops like performance, battery life and portability that have become increasingly important in the post-COVID-19 hybrid work era. It will also help laptops better handle the AI workloads that chip companies and OEMs are starting to promote for new devices. “LPCAMM2 is not just, ‘Hey, here's another way to build memory,’ It's really the next generation of memory that addresses everything that's changed in the past three to four years and everything that's going to change in the next three to four years,” he said.  Like Intel, AMD launched a new lineup of CPUs for laptops with advanced AI capabilities in December. Except for AMD, it was the company’s second generation of AI chips for laptops to come out in 2023: the Ryzen 8040 series. So the chip designer used CES 2024 to reveal its first desktop CPU with a dedicated AI engine, the Ryzen 8000G series. Like the Ryzen 7040 and 8040 series for laptops, the Ryzen 8000G desktop processors come with a neural processing unit (NPU) in addition to a CPU and GPU. And the company said the lineup’s integrated GPU is the “world’s most powerful built-in graphics.” The inclusion of a dedicated AI engine and powerful integrated graphics, combined with up to eight cores and a 5.1GHz boost frequency, is why the chip designer is calling the Ryzen 8000G series the “ultimate all-in-one desktop processor.” The CPU in the Ryzen 8000G series is based on AMD’s Zen 4 architecture while the GPU is based on its RDNA 3 architecture and the NPU is based on the XDNA architecture. Combined, they provide a total of up 39 teraflops of processing power for AI workloads, AMD said. AMD said the Ryzen 8000G series will be available to consumers and system integration partners starting Jan. 31. The CPUs will start appearing in OEM systems in the second quarter. In addition to revealing the Ryzen 8000G series for desktops, AMD used CES 2024 to provide new competitive performance data comparing its recently released Ryzen 8040 laptop processors with Intel’s Core Ultra notebook chips that came out around the same time. In the realm of computer vision models that benefit from the NPU, AMD said its Ryzen 7 8840U processor is 4 percent faster on the MobileNetv3 model, 17 percent faster on the ESRGAN model, 43 percent faster on the Yolov8 model and 79 percent faster on the Deeplabv3 in comparison to Intel’s Core Ultra 7 155H. As for AI-powered content creation workloads that benefit from the GPU, AMD said the same chip is 6 percent faster on the Stable Diffusion 1.5 model, 44 percent faster on the Procyon AI Bench test using the Float32 numerical format, 61 percent faster on Procyon AI Bench using Float16 and 85 percent faster on DaVinci Resolve HD to UHD video upscaling feature.  Lenovo came to CES 2024 with a wide array of AI-enabled PCs, from consumer-focused laptops to ultra-small form factor desktops loaded with neural processing units (NPUs). The Chinese tech giant said its flagship AI PC offerings consist of the new Lenovo ThinkPad X1 Carbon, ThinkPad X1 2-in-1 and IdeaPad Pro 5i, which take advantage of the Intel Core Ultra processors’ dedicated AI acceleration combined with Copilot in Windows 11 to “help users embrace new experiences and enhance efficiency in work and play.” “Whether for business or leisure, these Lenovo laptops are amongst the first that are driving an AI PC revolution that will fundamentally change how people create, collaborate, and interact with PCs,” the company said in an announcement. “Designed to offer users the most comprehensive PC experiences yet, the new ThinkPad X1 and IdeaPad Pro 5i will help users embrace a new generation of AI computing,” it added. The other AI-enabled PCs revealed by Lenovo consisted of consumer and business devices. The consumer-focused devices include the new Lenovo Yoga Pro 9i 16-inch laptop and 14-inch 2-1, which not only come with Intel Core Ultra processors—each containing an NPU in addition to a CPU and GPU—but also a Lenovo AI Core Chip that “powers robust AI functionality.” All new Yoga laptops come loaded with generative AI software called Lenovo Yoga Creator Zone, which generates images from text-based prompts or sketches. On the business side, Lenovo introduced a few other PCs advertised with AI capabilities, including the Lenovo ThinkBook 14 I Gen 6+5, which comes with a Graphics Extension port that supports Lenovo’s new ThinkBook Graphics Extension dock to boost AI computing power. Another laptop with AI capabilities is the Lenovo ThinkBook 16p Gen 5, which comes with a Intel Core 14th Gen CPU and a Nvidia GeForce RTX 40 series GPU, the latter of which can be used for AI use cases such as the text-to-image model Stable Diffusion. The ThinkBook 16p Gen 5 also comes with the Lenovo LA3 AI chip, which is used in conjunction with the company’s Smart Power 3.0 and Intelligent Adaptive Dimming technologies to “optimize system performance, energy efficiency and battery charging.” Lenovo also revealed the ThinkCentre neo Ultra, an ultra-small form factor desktop that comes with an Intel CPU, Nvidia GeForce RTX 40 series GPU and an “easy-to-upgrade independent NPU card” developed by chip design startup MemryX. Other CES highlights from Lenovo include the Lenovo Yoga Book 9i, the Intel Core Ultra-powered successor to its original full size dual-screen OLED laptop; the Lenovo ThinkBook Plus Gen 5 Hybrid, which is made up of a laptop base system and a tablet that can work independently of each other and switch between Windows- and Android-based systems.  A few days before CES 2024, Dell Technologies revealed that its next wave of XPS laptops are getting new 14-inch and 16-inch options along with “built-in AI” capabilities thanks to the Intel Core Ultra chips going inside the systems. The Round Rock, Texas-based IT giant revealed the new XPS 13, XPS 14 and XPS 16 laptops, saying the trio of flagship consumer notebooks adopt the fresh minimalistic design of last year’s game-changing XPS 13 Plus model. The three new XPS designs are powered by Intel’s new Core Ultra processors, which launched last month. Previously known under the code name Meteor Lake, each chip comes with a CPU, GPU and, for the first time in an Intel chip, a neural processing unit (NPU). Intel has said in recent months that the Core Ultra processors will “usher in the age of the AI PC” because of how AI applications with different performance and power requirements will take advantage of each chip’s CPU, GPU and NPU—rather than relying on the cloud. Dell said the new XPS 13, XPS 14 and XPS 16 come with “AI-enabled features” thanks to Intel Core Ultra processors and experiences enabled by Microsoft’s Copilot AI assistant for Windows 11. The new designs even come with a key to instantly access Copilot as part of Microsoft’s push for OEMs to include a Copilot key for new laptops. With Core Ultra’s NPU, Dell said the PC “no longer needs to rely solely on the CPU or GPU for processing and performance.” This, in turn, will enable faster performance and longer battery life for applications that can take advantage of the low-power AI engine.  At CES 2024, HP Inc. revealed a pair of new Spectre x360 2-in-1 laptops that adapt to the user in a variety of ways and enable a variety of AI workloads thanks to their Intel Core Ultra processors and optional Nvidia GeForce RTX 4050 GPUs. The new laptops consist of a 14-inch model and a 16-inch model, both of which will take advantage of the Core Ultra’s CPU, GPU and neural processing unit (NPU)—in addition to the GeForce RTX GPU for models configured with the part—to handle a variety of AI workloads depending on their performance and power requirements. These AI workloads include several features to make the laptops more responsive to a user’s unique situation and surroundings. For instance, the laptops use the NPU, combined with their 9-megapixel webcam, to alert the user when someone is watching the screen from over their shoulder, lock the computer when the user walks away and wake up the computer when the user returns. The laptops also come with adaptive screen technology that dims the display when the user looks away. As for other ways the laptops can adapt to a user’s presence, the 9-megapixel camera features “hardware-enabled low-light adjustment” for video calls where there isn’t adequate lighting. HP has also loaded the Spectre x360 laptops with a temperature sensor, gravity sensor and acceleration sensor. Using these sensors, an AI model can adjust the laptop’s thermal profile based on whether it’s on a desk or the user’s lap. As for other AI features, HP said the laptops can use Superpower, a new application from an ISV called Rewind that can use the Core Ultra’s NPU for tasks such as tracking down action items from a meeting, summarizing a topic or helping draft an email. The Spectre x360 devices seize on the NPU’s AI acceleration capabilities in other ways, such as automatic framing, background blur and maintaining eye contact, features that are enabled by Microsoft’s Windows Studio effects. For display, the laptops feature a 2.8K OLED screen and IMAX Enhanced Certification for watching movies and TV shows in the 16:10 aspect ratio. For the first time in HP consumer devices, the 2-in-1s feature audio tuning by the company’s Poly video collaboration business to provide better voice clarity and sound. Additional reporting by Steven Burke. "
}