{
    "title": "Revenant Esports teams up with AMD as title sponsor for 2024",
    "date": "1/11/2024",
    "url": "https://esportsinsider.com/2024/01/revenant-esports-amd-title-sponsor",
    "text": "Indian esports organisation Revenant Esports has announced hardware brand AMD as its title sponsor for its 2024 esports season. As part of the deal, AMD will provide the organisation’s PC gaming rosters with processors. Moreover, AMD will be featured prominently on Revenant Esports’ 2024 jerseys. AMD is a global semiconductor manufacturer founded in 1969. The brand has been a key partner of esports teams and events for many years, having previously worked with the likes of SK Gaming and PSG Talon. Last year, AMD sponsored the Skyesports Masters, India’s first franchised esports league. Established in 2021, Indian esports organisation Revenant Esports harbours eight rosters in PC Gaming titles, such as Counter-Strike 2 and VALORANT, as well as mobile games. Throughout 2023, the company secured several partnerships with brands such as ViewSonic, KREO, and GIGABYTE. Moreover, Bollywood actor Tiger Shroff invested in Revenant Esports last year, which helped boost the organisation’s notoriety within the Indian market. With new partnerships heading into the 2024 esports season, Indian esports continues to grow. 2023 saw numerous significant developments within the country’s esports landscape. Two major esports titles, Battlegrounds Mobile India and Free Fire, returned after being previously banned in India. New tournaments were also held in the country, including an international VALORANT competition called Convergence. Rohit Jagasia, Founder and CEO of Revenant Esports, commented on the partnership with AMD: “We are thrilled to be partnering with AMD once again as our title sponsors. At Revenant Esports, our ethos revolves around aligning with the absolute best. It’s not just about enhancing the brands we collaborate with but also about propelling the gaming industry to greater heights. “Therefore, a title partnership with AMD, who is a veteran in the Indian esports industry, represents a mutually beneficial deal that will take steps toward mutual growth and industry advancement.“ Riverbank House 1 Putney Bridge Approach London SW6 3JD Keep updated with the latest esports industry news Sign up to our newsletters here Esports Insider is a registered trademark of Esports Insider Limited Copyright 2024 "
}