{
    "title": null,
    "date": "1/25/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/amd-is-ending-support-for-its-link-game-streaming-application-here-are-some-alternatives",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. AMD Link was AMD's answer to Nvidia's GameStream, but there are still great options available without it Seven years after AMD Link's initial release in 2017, AMD has decided to discontinue the game streaming software, citing \"many options available for users to stream their PC content to other devices\" in the official announcement post regarding the end of the service. Support will end in a future Q1 2024 AMD Software: Adrenalin Edition update. Over time, though, it seems like AMD has decided that game streaming from an AMD-powered PC is best done with third-party software solutions that are capable of leveraging AMD GPU hardware encoding, rather than dedicating resources to it itself. Here are three solid options to replace AMD Link within your PC Remote Play setup. The AMD Link alternatives listed above are listed roughly in order of difficulty to use and performance. Moonlight + Sunshine can get the best results, but is the most difficult to setup, while Steam Link/Remote Play is dead-simple but restricted mostly to Steam games and not quite as performant as Parsec or Moonlight + Sunshine. All listed solutions should work perfectly fine on Linux or Steam Deck, as well, especially with an attached keyboard. It's a little sad to see AMD drop its official Nvidia GameStream competitor, but there is fortunately no shortage of alternatives for people who want to keep game streaming from their AMD PCs. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. New open source GPU is free to all - FuryGPU runs Quake at 60fps, supports modern Windows software Nvidia Hopper H200 breaks MLPerf benchmark record with TensorRT — no Blackwell submissions yet, sorry Half of Russian-made chips are defective: Baikal struggles to meet Russia's demand By Aaron KlotzMarch 27, 2024 By Anton ShilovMarch 27, 2024 By Paul AlcornMarch 27, 2024 By Paul AlcornMarch 26, 2024 By Aaron KlotzMarch 26, 2024 By Avram PiltchMarch 26, 2024 By Anton ShilovMarch 26, 2024 By Christopher HarperMarch 26, 2024 By Anton ShilovMarch 26, 2024 By Aaron KlotzMarch 26, 2024 By Christopher HarperMarch 26, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}