{
    "title": "How to Invest in Advanced Micro Devices",
    "date": "1/12/2024",
    "url": "https://www.fool.com/investing/how-to-invest/stocks/how-to-invest-in-advanced-micro-devices-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Advanced Micro Devices (AMD  0.5%) has come a long way over the years. The semiconductor company had been in the shadow of Intel (INTC  0.91%) for much of its more than five decades of operations, first as a supplier and then as a competitor. However, it has finally passed its rival in recent years by developing better chips and expanding into new areas, like artificial intelligence (AI), setting the stage for more growth in the years ahead. Today, AMD has leading products across several customer segments: AMD's leadership in semiconductors and GPUs, along with its artificial intelligence product portfolio, positions it for growth. That growth potential might have you interested in investing in its stock. Here's a step-by-step guide on how to buy the technology stock and some factors to consider before adding it to your portfolio. Potential Advanced Micro Device investors will need to take a few steps before buying shares. Here's a step-by-step guide to adding the semiconductor company to your portfolio. You'll need to open and fund a brokerage account before buying shares of any company. If you need to open one, here are some of the best-rated brokers and trading platforms. Take your time to research the brokers to find the best one for you. Before making your first trade, you'll need to determine a budget for how much money you want to invest. You'll then want to figure out how to allocate that money. The Motley Fool's investing philosophy recommends building a diversified portfolio of 25 or more stocks you plan to hold for at least five years. You don't have to get there on the first day. For example, if you have $1,000 available to start investing, you might want to begin by allocating that money equally across at least 10 stocks and then grow from there. It's essential to thoroughly research a company before buying its shares. You should learn about how it makes money, its competitors, its balance sheet, and other factors to make sure you have a solid grasp on whether the company can grow value for its shareholders over the long term. Continue reading to learn more about some crucial factors to consider before investing in Advanced Micro Devices stock. Once you've opened and funded a brokerage account, set your investing budget, and researched the stock, it's time to buy shares. The process is relatively straightforward. Go to your brokerage account's order page and fill out all the relevant information, including: Once you complete the order page, click to submit your trade and become an AMD shareholder. It's imperative to do lots of research before buying any stock. The process might increase your conviction that it's a good investment. However, you could uncover something about the company that leads you to opt against buying shares. With that research in mind, here are some factors that might drive your decision to buy shares of AMD: On the other hand, here are some reasons why you might decide against buying shares of AMD: Evaluating a company's profitability is one of the most important aspects of investment research. That's because rising profitability tends to power a stock's growth over the longer term. Consistent profitability has been a problem for AMD over the years. The company barely made a profit in the second quarter of 2023. Its net income was $27 million, or $0.02 per share, on $5.4 billion of revenue. Although that's an improvement from the loss the company posted in the first quarter, its profits have fallen sharply from 2021: The company has battled falling revenue and rising costs, which have weighed on profitability. However, it's worth noting that AMD is much more profitable on a non-GAAP (adjusted) basis. In the second quarter of 2023, its adjusted net income was $948 million, or $0.58 per share. AMD has been investing heavily to jumpstart growth by launching new products. It has developed a comprehensive portfolio geared towards artificial intelligence (AI), which could help drive accelerated revenue and earnings growth in the future. Advanced Micro Devices had not initiated a dividend as of mid-2023. The semiconductor company had no plans to start making dividend payments at the time. Instead, the company retains most of its earnings to fund its operations and continued expansion. Meanwhile, it returns capital to investors through its share repurchase program. An alternative strategy to buying shares directly and actively investing in AMD is to go the passive route by buying a fund that holds its stock. One of the most common passive investment vehicles is an exchange-traded fund (ETF). AMD is a fairly widely held stock. According to ETF.com, 339 ETFs held about 170.6 million shares of the semiconductor company as of mid-2023. The biggest holder was the Invesco QQQ Trust (NYSEMKT:QQQ) at about 27.3 million shares. It was the fund's 16th-largest holding at 1.5% of its total value. Investors seeking a fund with a larger allocation to AMD could consider the iShares Semiconductor ETF (NYSEMKT:SOXX). AMD was the fund's third-largest holding at almost 7% of its total value. The ETF is a good way to gain decent exposure to AMD and other top semiconductor stocks. Advanced Micro Devices didn't have an upcoming stock split as of mid-2023. However, the company has completed several stock splits throughout its history: Every share investors bought at AMD's IPO in 1972 would have grown into 27 split-adjusted shares over the years. Advanced Micro Devices' last stock split was more than two decades ago. Shares have gained in value since its last split, especially in more recent years: The stock has more than tripled since its last split and traded at a triple-digit price in mid-2023, so AMD could split its stock again in the future to make it even more accessible to investors.  Get step-by-step guidance on investing in Apple stock and learn the ins-and-outs of this technology company. C3.ai is one of the hottest stocks in artificial intelligence today. Learn more about the SaaS and whether it's a good investment. Want to learn how to invest in the world's second-largest company? Get pro tips on picking the right method for your portfolio. Twilio is a cloud communications platform-as-a-service company with impressive growth potential. Here's how to invest.  AMD has grown into a global semiconductor leader over the years. It sees much more growth ahead, especially as it begins to capitalize on the emerging AI opportunity, which could reinvigorate its revenue growth and boost its bottom line. However, AMD faces competition from Nvidia, Intel, and others. So its stock could continue to deliver sluggish returns (as has been the case over the last two decades). Investors need to do their due diligence before buying shares of the semiconductor giant to ensure they understand the risks. AMD has a huge growth opportunity. It sees a roughly $300 billion total addressable market opportunity across its strategic markets. On top of that, there's a potentially massive opportunity emerging with AI, which gives the company a long growth runway. It could deliver strong revenue, earnings, and free cash flow growth for years to come. However, AMD faces much competition from rivals like Intel and Nvidia. It trades at a rather lofty valuation at almost 8 times price to sales and almost 40 times forward earnings as of mid-2023. There's no guarantee AMD will grow as fast as it hopes or deliver strong returns for shareholders, especially given its higher valuation, so it might not be the most compelling stock to buy right now. It cost slightly more than $100 to buy one share of AMD stock in mid-2023. However, you can potentially buy shares for less than that at a broker offering fractional shares. Anyone with a brokerage account can buy shares in AMD. It has been a publicly traded company since completing its initial public offering (IPO) on Sept. 27, 1972. It trades on the Nasdaq Exchange under the stock ticker AMD. You can buy shares of AMD at any brokerage or stock trading platform. Here's a list of brokerage account reviews if you're searching for one to open to buy shares of AMD. Why do we invest this way?\nLearn More Market-beating stocks from our award-winning analyst team. Calculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of 03/31/2024. Discounted offers are only available to new members. Stock Advisor list price is $199 per year. Calculated by Time-Weighted Return since 2002. Volatility profiles based on trailing-three-year calculations of the standard deviation of service investment returns. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}