{
    "title": "AMD Hires Ex-AWS AI Product Head To Lead Commercial Sales",
    "date": "1/18/2024",
    "url": "https://www.crn.com/news/components-peripherals/2024/amd-hires-ex-aws-ai-product-head-to-lead-commercial-sales",
    "text": "The chip designer says the hiring of Archana Vemulapalli as corporate vice president of global commercial sales highlights the ‘importance of AMD’s focus on commercial and enterprise engagements’ as it seeks to challenge Nvidia in the AI computing space.  AMD has hired a former Amazon Web Services analytics and AI product head to lead the chip designer’s global commercial sales efforts in a newly created role. The Santa Clara, Calif.-based company confirmed to CRN that Archana Vemulapalli recently started her role as corporate vice president of global commercial sales and will report to Phil Guido, an IBM veteran who leads AMD’s worldwide sales organization as chief commercial officer. She started in December, according to her LinkedIn profile. [Related: AMD’s David McAfee On Why AI PCs Are ‘Here To Stay’ And Why ISVs Will Flock To The NPU] A spokesperson said the hiring of Vemulapalli highlights the “importance of AMD’s focus on commercial and enterprise engagements,” which encompass the company’s EPYC server CPUs, Instinct accelerator chips and Ryzen client processors, among other product lines. The hire was made as AMD seeks to continue its momentum in taking server CPU market share away from Intel and challenge Nvidia in the AI computing space with its most powerful Instinct accelerators yet—the MI300 series—which the company launched in December. Vemulapalli was most recently head of product and global strategy for database, analytics, AI and machine learning, according to her LinkedIn profile. She got her start at AWS in 2021 as general manager and head of solutions architecture for the Americas. In the past year, Vemulapalli has been a spokesperson for AWS’ generative AI efforts with enterprises, including the cloud giant’s Bedrock managed service for foundation models. Prior to AWS, she was at IBM for nearly four years, most recently serving as general manager and global CTO of the company’s $22 billion infrastructure services business. She started at IBM in 2017 as general manager of the company’s global network services. Vemulapalli was previously the CTO for the government of Washington, D.C. A top executive at a major North American solution provider told CRN that she believes Vemulapalli will be “integral” to her company’s engagement with AMD and ISV partners on “strong” generative AI use case for “different industries or different client situations.” “That’s just showing a strong investment from AMD to hire somebody of that caliber to [oversee] those go-to-market [efforts],” said Megan Amdahl, senior vice president of client experience and North America COO for Chandler, Ariz.-based Insight Enterprises, No. 16 on CRN’s 2023 Solution Provider 500 list. Over the past few years, Insight has significantly ramped up its partnership with AMD, which not only resulted with the chip designer’s CEO, Lisa Su, speaking at its annual Mastery conference last year but has also led to “substantial growth” with the Intel rival’s client and server processors, according to Amdahl. “They picked up several significant clients that are mutual enterprise clients,” she said. To Amdahl, one important benefit Insight has received through its partnership with AMD are staff positions funded by the chip designer to focus on growing its business with the semiconductor company. These kinds of positions are often referred to as “funded heads.” “When you’re working with a company as complex as Insight, you really need somebody or multiple people working within Insight funded by AMD to focus on their brand and their expansion. And they’ve doubled down on their investment there with us. And what we see is when partners do that, then we become accretive to their growth,” she said. AMD has made inroads with commercial channel partners over the past few years, which Su said in a December 2020 CRN magazine cover story has become an “incredibly important” part of the chip designer’s strategy. Last year, AMD hired former Arrow Electronics leader Mark Taylor as its global channel chief after its previous partner leader, Terry Richardson, departed the company along with another top channel executive earlier in 2023. "
}