{
    "title": "ASRock announces DeskMeet & DeskMini X600 with support for \"AMD AM5 65W \nAPUs\"",
    "date": "1/6/2024",
    "url": "https://videocardz.com/newz/asrock-announces-deskmeet-deskmini-x600-with-support-for-amd-am5-65w-apus",
    "text": "The company’s press release details an upcoming CES 2024 products.  ASRock is gearing up to introduce an overdue improvement to its Mini-PC ecosystem with its upcoming X600 series of DeskMeet and DeskMini systems. These systems will be equipped with AMD’s latest AM5 socket. The official release of these new Mini-PCs is scheduled for CES 2024, set to take place next week. Although ASRock had initially revealed these systems several months ago, around the time of Computex, their release was delayed until 2024. ASRock might have been waiting for the Ryzen 8000G series, which are the first proper APUs for AMD’s new socket. The X600 series is poised to replace the AM4-based X300 models. This transition means a shift from DDR4 to modern DDR5 memory, the integration of PCIe Gen5 interface, and the adoption of a fresh Mini-STX (not ITX) motherboard featuring the AM5 socket. Unlike its predecessor, which supported Ryzen 2000, 3000, 4000G, 5000, and 5000G series, the X600 series is designed to offer compatibility with Ryzen 7000 and 8000G series right from its initial launch.   DeskMeet X600, Source: ASRock/Wccftech  The STX form factor of the Mini-PC provides the flexibility to accommodate up to four full-sized DDR5 modules. As previously revealed, this form factor is expected to support DDR5-6000 memory and higher speeds through overclocking. During Computex, it was disclosed that the Mini-PC could handle a capacity of 128GB. The recent introduction of larger and non-binary memory modules such as 24GB, 48GB, and even 64GB suggests that future support for larger capacities may expand. ASRock PR has specifically highlighted support for “AMD AM5 65W APU,” indicating compatibility with the Ryzen 8000G series featuring Zen4/RDNA4 architecture. Notably, this serves as the first confirmation that the default TDP for the 8000G series is 65W. The main difference between the DeskMeet and DeskMini is their size. The DeskMeet supports discrete graphics through its full-sized PCIe Gen5 x16 slot. This allows for the integration of smaller GPUs, including ASRock’s Arc A3 series in the Mini-ITX form factor, offering users more flexibility in their choice of graphics solutions. Source: ASRock PR We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}