{
    "title": "AMD Ryzen 5 8600G vs Ryzen 5 8500G: Which CPU should you buy?",
    "date": "2/25/2024",
    "url": "https://www.xda-developers.com/amd-ryzen-5-8600g-vs-ryzen-5-8500g/",
    "text": "AMD’s all-new 8000G series APUs are here, but which one of the budget offerings is the better choice? Despite its affordable pricing, the Ryzen 5 8600G is a budget APU that delivers impressive gaming performance. It’s the perfect APU if you’re looking to build a budget gaming PC that can deliver playable frame rates without breaking the bank. It’s the best value APU out of the Ryzen 8000G series, and a viable choice for entry-level gaming. The Ryzen 5 8500G definitely cuts some corners, but it delivers acceptable gaming performance with excellent thermal efficiency at a low price. If your only focus is on playing online competitive games at low settings, then this cheap APU is surprisingly capable of handling that with ease. AMD’s 8000G desktop APUs are very promising. These new processors easily triumph over AMD’s previous Ryzen 5000G series of APUs, as they deliver great performance at a reasonable price. The lineup consists of the Ryzen 5 8500G, the 8600G, and the Ryzen 7 8700G. While the 8700G is quite expensive for an APU with its price of $330, the 8600G and the 8500G are much more reasonable. Both of these CPUs are relatively close in terms of pricing. So, which one should you buy? To answer that question, we’ll be comparing specs, performance, value, and efficiency to find the best Zen 4 APU for your next PC build. The Ryzen 5 8500G and the 8600G were unveiled as a part of the new APU lineup at CES. Both of these APUs use the AM5 socket seen on the Ryzen 7000 series, meaning you get a decent upgrade path to any Ryzen CPUs in the next few years. They both come with the Wraith Stealth stock cooler out of the box. In terms of specs, the major difference is in the base clock speeds and the integrated graphics. The 8600G has a base clock speed of 4.3GHz and Radeon 760M graphics. Meanwhile, The 8500G has a base clock speed of 3.5GHz and Radeon 740M graphics. Finally, the 8500G is priced at $180 while the 8600G is priced at $230. At MSRP, the Ryzen 5 8600G is a bit more expensive than the Ryzen 5 8500G. As such, it should be no surprise that the 8600G delivers better performance. While reviewing the 8600G, we were pleasantly surprised with its overall performance in games. When compared to the Ryzen 5 7600X we noted a 5-10% reduction in core performance. This means that the 8600G is still capable of handling productivity-related workloads relatively well. It’s also much more impressive than its predecessor, the Ryzen 5 5600G. The 8600G has higher clock speeds and more cache. While the 5600G could only boost to 4.4GHz and had a total cache of 19MB, the 8600G bumps these numbers up to a 5GHz boost clock and a total cache of 2 MB. This translates to an incredible performance uplift in games. At 1080p, our tests show that the 8600G could handle games like Shadow of the Tomb Raider, Elden Ring, and GTA V at or above 60FPS. Granted, these tests were conducted with visual settings turned to medium or low, but that’s a sacrifice you’ll have to make without a dedicated GPU. In games that support FSR, you can also expect playable framerates at 1440p. Some E-Sport titles such as Rocket League, Counter-Strike, and League of Legends can easily be played at 1440p with low to medium settings. Not bad at all for a mid-range APU. As for the Ryzen 5 8500G, well it finds itself in a bit of a weird spot. AMD has priced this CPU to be $50 less than the 8600G, but we feel that’s still too close. The 8500G is still capable of handling games at 1080p with low settings, but you’ll have to pick your titles carefully. For example, Cyberpunk 2077 might be playable on this APU, but you’ll have to turn on FSR 2.1 for the best results. The major difference between these two is in the integrated graphics. The Radeon 740M graphics on the 8500G aren’t as good as the Radeon 760M graphics present on the 8600G. If your only focus is playing E-sport titles at low settings, then the 8500G will do you fine. For anything else, we’d recommend the 8600G. Before we get to talking about value, there is one more difference you should be aware of if you’re about to buy either APU. The Ryzen 5 8500G has fewer PCIe lanes than the 8600G. With the 8500G, you’re limited to four PCIe 4.0 lanes for add-in GPUs, while the 8600G has eight PCIe 4.0 lanes. Later down the line, if you ever add a graphics card to a Ryzen 5 8500G build, it will run in PCIe 4.0 x4 mode instead of x8 mode. To sum it up, this means that the 8500G build will perform considerably worse with a graphics card compared to an 8600G build. The futureproofing really isn’t there with the Ryzen 5 8500G, and that’s something you need to be aware of if you plan to upgrade down the line. Still, it’s not all bad for the 8500G. If your only goal is to build a budget compact build without a graphics card, this is the cheapest Zen 4 APU you can buy. It still delivers playable framerates in most games, and is more power and thermal efficient than the 8600G. Just know that it’s not exactly the best value out there. The 8600G is the much better choice, mostly because of more PCIe lanes and better performance. It’s priced very reasonably, and can achieve even better performance with a bit of overclocking. If you can’t afford a graphics card right now because of the ridiculous pricing situation, the 8600G is a fine choice. Normally, these CPU comparisons tend to be a bit more nuanced, but we have a clear winner this time around. The 8600G is the better APU, as it delivers better gaming performance and has more PCie 4.0 lanes. It punches well above its weight considering the price, and is an overall great option for budget gamers who don’t want to splurge on a GPU. The AMD Ryzen 5 8600G is an affordable APU with integrated graphics processing. This allows you to play games without a dedicated GPU with good results at 1080p. The Ryzen 5 8500G isn’t as impressive, but it can still find its place in some builds. If you’re looking a cheap APU that allows you to play your favorite E-sport titles at low settings, then it’s a decent choice. For small form factor builds that don’t draw a lot of power, the 8500G is a modest processor that will chug along fine on most days. Just remember that it’s not exactly futureproof because of the fewer PCIe 4.0 lanes. The Ryzen 5 8500G is a decent processor for entry-level gaming. It’s great for building compact PC builds on a budget and without a graphics card.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. With over seven years of experience covering PC hardware content and reviews, Hassam intricately explores the world of technology, from PCBs and VRMs to CPU/GPU overclocking, bringing expert insights to every article he writes. When he's not writing, you'll find him tinkering with tech gadgets, attending racing events, or collecting niche fragrances. If you're looking to add one of AMD's Ryzen 7000 to your system without spending a ton, check out our collection of the best budget AM5 motherboards. AMD made significant improvements to its APU lineup with the Ryzen 5 8600G. But is it good enough to beat the Ryzen 5 7600? Thermal paste is a vital component of any CPU cooling solution, but here's how long you can expect it to last Nvidia, in collaboration with HuggingFace and ServiceNow, has released StarCoder2, and it will help you generate code. If you use two PCs as part of the same desk setup, a KVM switch could be the way to simplify your workstation. The update also fixes some annoying bugs. "
}