{
    "title": "The 8-core AMD Ryzen 7 8700GE Consumes Half As Much As The Ryzen 7 8700G, \nBut Is Only 20% Behind In ...",
    "date": "2/24/2024",
    "url": "https://gadgettendency.com/the-8-core-amd-ryzen-7-8700ge-consumes-half-as-much-as-the-ryzen-7-8700g-but-is-only-20-behind-in-performance-first-test-of-the-new-cpu/",
    "text": "Published on By The first test of the 35-watt AMD Ryzen 7 8700GE processor has appeared on the Internet.  It has not yet been officially presented, but this is probably a matter of the near future.  In the first tests, it was compared with the 65-watt Ryzen 7 8700G, and it turned out that with actually half the consumption, the performance of the Ryzen 7 8700GE is only about 20% lower. Image: VideocardzIn Cinebench R23, the Ryzen 7 8700GE scores 1,713 points in the single-thread test and 17,430 points in the multi-thread test, versus 1,879 and 22,121 points for the Ryzen 7 8700G.  The difference, respectively, is 9% and 21% in favor of the 65-watt model.  In CPU-Z the difference is even smaller – 1% and 13%, respectively.\nTesters also tested the built-in graphics core – there is approximately the same difference in performance.  For example, the lag of iGPU Ryzen 7 8700GE in 3DMark TimeSpy is only 18%, in Unigine Heaven Extreme it is already more significant 28%.  But overall, when it comes to graphics, the Ryzen 7 8700GE is 23% slower.\nAt the same time, the Ryzen 7 8700GE will be more affordable than the Ryzen 7 8700G (by about $50), and the difference in maximum consumption reaches 52%: 42 W for the Ryzen 7 8700GE versus 88 W for the Ryzen 7 8700G.\nAs for the characteristics, they are almost the same for the Ryzen 7 8700GE and Ryzen 7 8700G (the Ryzen 7 8700GE only has a slightly lower frequency).  There is an opinion that the Ryzen 7 8700GE is still the same Ryzen 7 8700G, but only limited by TDP. In Cinebench R23, the Ryzen 7 8700GE scores 1,713 points in the single-thread test and 17,430 points in the multi-thread test, versus 1,879 and 22,121 points for the Ryzen 7 8700G.  The difference, respectively, is 9% and 21% in favor of the 65-watt model.  In CPU-Z the difference is even smaller – 1% and 13%, respectively. Testers also tested the built-in graphics core – there is approximately the same difference in performance.  For example, the lag of iGPU Ryzen 7 8700GE in 3DMark TimeSpy is only 18%, in Unigine Heaven Extreme it is already more significant 28%.  But overall, when it comes to graphics, the Ryzen 7 8700GE is 23% slower.\nAt the same time, the Ryzen 7 8700GE will be more affordable than the Ryzen 7 8700G (by about $50), and the difference in maximum consumption reaches 52%: 42 W for the Ryzen 7 8700GE versus 88 W for the Ryzen 7 8700G.\nAs for the characteristics, they are almost the same for the Ryzen 7 8700GE and Ryzen 7 8700G (the Ryzen 7 8700GE only has a slightly lower frequency).  There is an opinion that the Ryzen 7 8700GE is still the same Ryzen 7 8700G, but only limited by TDP. Testers also tested the built-in graphics core – there is approximately the same difference in performance.  For example, the lag of iGPU Ryzen 7 8700GE in 3DMark TimeSpy is only 18%, in Unigine Heaven Extreme it is already more significant 28%.  But overall, when it comes to graphics, the Ryzen 7 8700GE is 23% slower. At the same time, the Ryzen 7 8700GE will be more affordable than the Ryzen 7 8700G (by about $50), and the difference in maximum consumption reaches 52%: 42 W for the Ryzen 7 8700GE versus 88 W for the Ryzen 7 8700G.\nAs for the characteristics, they are almost the same for the Ryzen 7 8700GE and Ryzen 7 8700G (the Ryzen 7 8700GE only has a slightly lower frequency).  There is an opinion that the Ryzen 7 8700GE is still the same Ryzen 7 8700G, but only limited by TDP. At the same time, the Ryzen 7 8700GE will be more affordable than the Ryzen 7 8700G (by about $50), and the difference in maximum consumption reaches 52%: 42 W for the Ryzen 7 8700GE versus 88 W for the Ryzen 7 8700G. As for the characteristics, they are almost the same for the Ryzen 7 8700GE and Ryzen 7 8700G (the Ryzen 7 8700GE only has a slightly lower frequency).  There is an opinion that the Ryzen 7 8700GE is still the same Ryzen 7 8700G, but only limited by TDP. As for the characteristics, they are almost the same for the Ryzen 7 8700GE and Ryzen 7 8700G (the Ryzen 7 8700GE only has a slightly lower frequency).  There is an opinion that the Ryzen 7 8700GE is still the same Ryzen 7 8700G, but only limited by TDP. First AMD and Qualcomm, then Intel, and Apple will be the last.  A roadmap has appeared describing the release schedule of new processors from all companies China has completely banned PCs with AMD and Intel processors from government agencies Samsung will be allowed to produce only cheap chips.  AMD will use the Korean giant’s 4nm process technology to produce budget APUs Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  Published on By AMD has solved the problem with overclocking the memory of the Radeon RX 7900 GRE video card, and recent tests have shown that the adapter now looks much more attractive.  Of course, for those who want to resort to overclocking.  The authors of Hardware Unboxed took the Sapphire adapter and overclocked it to 2.7 GHz for the core and 21.2 GHz for the memory.  As you can see, the performance increase turned out to be quite good.  At 1440p, the overclocked card became 12% faster relative to the reference one, and at 4K the increase was almost 17%, which is very good by modern standards. As a result, after overclocking, the RX 7900 GRE competes with the RTX 4070 Ti at 1440p, and reaches the RTX 4070 Ti Super at 4K.  At the same time, the RX 7900 GRE in Europe costs from 570 euros, the RTX 4070 Ti – from 700 euros, and the RTX 4070 Ti Super – from 840 euros.  Of course, Nvidia cards can also be overclocked, but the price difference will still remain. Published on By Not only new Intel video cards, but also a new processor appeared in the SiSoftware Sandra database today.  The Lunar Lake model included in the Samsung Galaxy Book5 Pro is registered in the software database, revealing some of its parameters.  The unnamed CPU contains only eight cores (four large and four small), but for Lunar Lake this is the maximum.  The presence of only eight threads confirms leaks that future Intel CPUs do not support Hyper-Threading. The processor operated at frequencies of 1.6-2.8 GHz.  These are clearly far from the final frequencies, but Lunar Lake is created with an eye to maximum energy efficiency, so perhaps they will not have very high frequencies.  The CPU also has 12 MB of L3 cache and a Xe2-LPG (Battlemage) generation GPU with 4 Xe cores and a frequency of 1.85 GHz. According to the latest roadmap, Lunar Lake is expected at the end of this year. Published on By Intel Meteor Lake processors only exist in mobile versions.  Or not?  The IBASE MI1002 industrial motherboard indicates that Intel is either planning or has already released Core Ultra as a desktop CPU.  The board with the LGA 1851 socket is designed for Meteor Lake-PS, which Intel has not officially presented.  There were rumors and leaks about such desktop CPUs, but then it became known that Intel abandoned the idea.  True, there was also evidence that such processors would still be released, but not in retail, but would be available to mini-PC manufacturers.  Whether such mini-PCs will appear in retail is still anyone’s guess, but in the industrial sector, as we see, yes. As for the parameters of such CPUs, they are not yet available.  Most likely, these are just mobile models in a different socket – Intel has already done this. Microsoft has made a major update to the Windows 11 operating system, also known as Moment 5, available to all... Space meteorologists have issued a forecast for this week warning of a possible geomagnetic storm caused by the release of... BYD is going to beat Toyota and Volkswagen by offering modern cars at very low prices. According to Bloomberg, the... Samsung promised to release the latest One UI 6.1 firmware for Galaxy S23 series smartphones at the end of March,... Toyota Corolla lost the title of best-selling car in the world for the first time in 20 years.  Tesla Model Y is the new king While Intel is abandoning Hyper-Threading, AMD is creating mobile monsters.  The company has confirmed the main parameters of the new Ryzen Strix Point APUs Scientists have created a quantum tornado in superfluid helium: a new step towards understanding the physics of black hole accretion At the intersection of avant-garde and futurism.  Kia surprised with the design of the new generation Kia K4 (Cerato) sedan © 2024 Gadget Tendency. All Rights Reserved "
}