{
    "title": "AMD's fastest CPUs put new price pressure on Intel — Ryzen 9 7900X3D drops \nto a new low of $410 and 7800X3D is ...",
    "date": "2/15/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/ryzen-9-7900x3d-drops-to-a-new-low-of-dollar410-and-7800x3d-is-nearly-dollar100-less-than-msrp-amds-fastest-cpus-put-new-price-pressure-on-intel",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. It's a good time to buy AMD's latest Ryzen 7000X3D CPUs If you've been chomping at the bit to purchase one of AMD's best CPUs for gaming, there are some very good deals right now that you don't want to miss. AMD's 12-core Ryzen 9 7900X3D is on its biggest discount ever, and you can find AMD's Ryzen 7 7800X3D and Ryzen 9 7950X3D for around $100 below MSRP right now. Based on PCPartPicker's pricing history at the time of writing, AMD's Ryzen 9 7900X3D can be had for nearly $200 below MSRP. Amazon and B&H Photo are selling the chip for just $409.99. You can find the 7900X3D at other retailers, but it is priced at $450 elsewhere. This is the best deal we've seen on a 7900X3D to date, and according to PCPP surpasses any deals we saw during Black Friday last year. AMD Ryzen 9 7900X3D: now $409.99 at Amazon (was $599.99) The new price fixes the 7900X3D's biggest weakness. In our review, we found AMD's 12-core X3D part to offer super strong gaming performance and incredible power efficiency (outperforming its 7900X counterpart in the efficiency department), but its strong attributes were offset by its very steep $599 price. Discounted to $400, the 7900X3D turns into a much more compelling offering, being just $50 more expensive than the Ryzen 7 7800X3D right now. Speaking of the 7800X3D, AMD's 8-core counterpart is also on a very noteworthy discount right now priced at just $369.99 at Newegg, Best Buy, and B&H Photo (at the time of writing). At this price, the 7800X3D is almost $100 below MSRP. The 7800X3D has seen better deals in the past, but $369 is still a very good deal regardless. If you find you don't need the extra cores the 7900X3D offers, the 7800X3D is a great purchase. AMD Ryzen 9 7800X3D: now $369.99 at Amazon (was $449.99) The Ryzen 7 7800X3D is the fastest gaming CPU we've ever tested. Thanks to its pure 8-core configuration, the chip was on average a few percent faster than the 7950X3D and nearly 5% quicker than the 7900X3D in our 1080p gaming tests. The 7800X3D also handily beats anything Intel has on offer right now, including its monstrous i9-14900K Raptor Lake Refresh chip. If you need loads of cores, AMD's flagship Ryzen 9 7950X3D is also on sale. Currently, you can find it for as low as $599.99 at Newegg and Best Buy, which is a $100 discount off of its original MSRP. That said, it's not its best discount to date. Late last year, you could find the 7950X3D as low as $560. Regardless, it's the best gaming CPU you can buy that offers 16 cores, perfect for those who use their PC for both work and play. AMD Ryzen 9 7950X3D: now $599.99 at Amazon (was $699.99) Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Aaron Klotz is a freelance writer for Tom’s Hardware US, covering news topics related to computer hardware such as CPUs, and graphics cards. AMD says the UCIe universal chiplet interface will create a whole ecosystem — custom multi-chiplet designs are the future Granite Rapids shows up on CPU-Z boasting 80 cores and 672MB of L3 cache AMD 170W Granite Ridge Zen 5 CPUs and 128W Strix Point APUs revealed in shipping manifest — 16-core 'Fire Range' mobile CPUs also coming By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Ash HillMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}