{
    "title": "Page 3 | AMD Radeon RX 7900 GRE review: the most compelling RDNA 3 graphics \ncard yet",
    "date": "2/26/2024",
    "url": "https://www.eurogamer.net/digitalfoundry-2024-amd-radeon-rx-7900-gre-review?page=3",
    "text": "Long read: The beauty and drama of video games and their clouds \"It's a little bit hard to work out without knowing the altitude of that dragon...\" RT benchmarks: Metro Exodus Enhanced Edition, F1 22, Marvel's Spider-Man; Miles Morales. A trio of excellent ray tracing titles are put through their paces in this second battery of RT testing. Metro Exodus Enhanced Edition remains the first - and only - triple-A gaming experience to be released requiring a GPU capable of hardware-accelerated ray tracing, while F1 22 is an interesting example of a fully-featured RT game that perhaps doesn't benefit from all of those effects, especially when it's so brutally fast from a rasterisation perspective. Marvel's Spider-Man: Miles Morales? It's Nixxes, let's do it! To reiterate if you're jumping straight to this page without looking at prior results, our benchmarking system offers a number of ways to get to the data you want, the presentation varying according to the device you're using. You'll get a basic overview of our findings on mobile, with metadata from the video capture of each GPU being translated into simple bar charts with average frame-rate and lowest one per cent measurements for easy comparisons. On a desktop-class browser, you'll get the full-fat DF experience with embedded YouTube videos of each test scene and live performance metrics. Play the video, and you'll see exactly how each card handled the scene as it progresses. Below the real-time metrics is an interactive bar chart, which you can mouse over to see different measurements and click to switch between actual frame-rates and percentage differences. All the data here is derived from video captured directly from each GPU, ensuring an accurate replay of real performance. 4A Games' revised version of its excellent action adventure shooter remains the only triple-A title that demands the use of a graphics card that supports hardware RT - though of course, the non-enhanced edition is there if you need it. The RTX 4070 is essentially on par with the RX 7900 GRE here at 1440p resolution, though again, there is no FSR 2 support. In terms of under-cutting the 4070 Super, the new Nvidia offering does offer relatively more performance for its price-point - nine percent more money gets almost 20 percent more performance. Again, the performance advantage over the 7800 XT does make AMD's prior value champ look a little over-priced. Please enable JavaScript to use our comparison tools. Yes, we'll inevitably move onto a newer iteration of the Codemasters racer at some point but for now, we're sticking with the tried and tested rendition of the game. It's a good showing for AMD here at 1440p, as the RX 7900 GRE is faster than the RTX 4070 (and indeed the 3080). What's interesting here is that there are certain games where AMD ray tracing over-performs compared to the norm - and F1 22 is one such title. The RTX 4070 Super clearly has more performant RT, yet here it can only muster a meagre four point lead. Please enable JavaScript to use our comparison tools. It's a warm welcome back to Miles Morales, rejoining our benchmark suite with both RT reflections and RT shadows maxed for your enjoyment. And maybe because the game was originally designed for the RT capabilities of the AMD hardware within the PlayStation 5, Radeon parts perform very well indeed. Here, at 1440p resolution, our results indicate that the RX 7900 GRE beats the old RTX 3080, but the similarly-priced 4070 has a ten point lead, which rises to 20 percent with the 4070 Super. Please enable JavaScript to use our comparison tools. Find out how we conduct our reviews by reading our review policy. From Assassin's Creed to Zoo Tycoon, we welcome all gamers Eurogamer welcomes videogamers of all types, so sign in and join our community! Digital Foundry |\n\n\nDell Alienware AW3225QF review: the best 32-inch QD-OLED for UK buyers Review |\n\n\nOpen Roads review - a pleasant road trip that doesn't go anywhere particularly memorable Review |\n\n\nBulwark: Falconeer Chronicles review - meditative city building on a stormy archipelago Review |\n\n\nTimemelters review - weird, cold-blooded tactical brilliance Review |\n\n\nPrincess Peach: Showtime! review - the damsel in distress becomes an RPG queen Review |\n\n\nRise of the Ronin review - samurai action that's as grounded as it is approachable Review |\n\n\nDragon's Dogma 2 review - endless discoveries paired with limitless potential Review |\n\n\nAlone in the Dark review – a perfunctory romp that doesn't quite live up to the hype Bad puns and video games since 1999. Eurogamer.net is owned by Gamer Network Limited, a ReedPop company and subsidiary of Reed Exhibitions Limited. © 2024 Gamer Network Limited, Gateway House, 28 The Quadrant, Richmond, Surrey, TW9 1DN, United Kingdom, registered under company number 03882481. All rights reserved. No part of this website or its content may be reproduced without the copyright owner's permission. "
}