{
    "title": "Tested: the DLSS 3/FSR 3 mod that brings frame generation to older Nvidia \ncards",
    "date": "2/2/2024",
    "url": "https://www.eurogamer.net/digitalfoundry-2024-tested-the-dlss-3fsr-3-mod-that-brings-frame-generation-to-older-nvidia-cards",
    "text": "Long read: The beauty and drama of video games and their clouds \"It's a little bit hard to work out without knowing the altitude of that dragon...\" There are some issues - but fundamentally, it works. Frame generation went open source recently, as AMD added FSR 3 frame generation to its GPUOpen initiative, bringing competition to DLSS 3, locked exclusively to RTX 40-series GPUs. We've seen official FSR 3 support in a small amount of games so far, but the open source release has brought us DLSSG to FSR3 - a mod that works with any DLSS 3 frame generation title, swapping out Nvidia's solution for FSR 3. The upshot of this is that owners of Nvidia RTX 20 and 30 series cards now have their own frame generation solution. It's not perfect, there are issues, but fundamentally it works. On Nvidia cards, at least. At least one other DLSS 3 to FSR 3 mod is coming which does work on AMD hardware, but right now, the first solution by 'Nukem', is exclusively for Nvidia users. That's down to the nature of the mod, which comes in two parts. First of all, you simply copy two DLL files into the game directory, then run a registry entry that fools your PC into thinking that your GPU is DLSS 3 compliant, even if it is not. Load up a game and the DLSS 3 frame generation option is no longer greyed out. However, toggling the option on activates the FSR 3 mod, not the original DLSS 3. There are interesting side effects to this. Officially, FSR 3 only works with FSR 2 inputs. However, this mod allows you to use FSR 3 with any input you choose - so for a game like Marvel's Spider-Man: Miles Morales, you can add frame gen to FSR 2, XeSS, DLSS, Insomniac's ITGI or native resolution imagery. This is appropriate for owners of RTX cards, who stand to benefit from using DLSS spatial upscaling instead of FSR 2. By and large, frame generation works fine too. I think most people will be astonished at the immediate increase in output frame-rate when turning on this injected version of FSR3, and as long as the frame-rate is high enough, any increases to input latency will be a negligible price to pay for added fluidity. Beyond the installation, from a user perspective, I would say it is about 90 percent of the way there to a native FSR 3 frame generation implementation. The remaining ten percent includes issues such as how HUD elements are handled by the frame generation algorithm. Native FSR 3 frame generation implementations have multiple options for developers to choose from in order to reduce artefacts. An easy solution is simply to run UI elements only on non-interpolated frames, effectively halving their update rate. This mod includes those elements in frame generation, just as DLSS 3 does, which can cause some problems. Beyond that, it's very much like a standard FSR 3 implementation, as seen in the likes of Avatar: Frontiers of Pandora, while the option to use any input at all is a step beyond FSR 3's current set-up. The frame-rate uplift delivered by the mod is real. Looking at the Cyberpunk 2077 benchmark using RT Overdrive at 1440p DLSS performance mode with ray reconstruction active delivers a circa 67 percent uplift in frame-rate, so we're moving from the 50s and low 60s to something in the region of 100fps, a good match for a high refresh rate VRR-capable display. Interestingly, because DLSS frame-gen is hijacked here, Nvidia's Reflex works for latency mitigation purposes. This also works to keep frame-rates within your display within its VRR window for latency savings. This doesn't just work for path tracing showcases - just like DLSS 3, you can use frame generation anywhere. I tried Marvel's Spider-Man: Miles Morales with no RT at all and with the game set to DLAA anti-aliasing at 1440p with RT maxed out, I saw a 65 percent improvement to frame-rate. And if a game is actually CPU-limited, there's GPU overhead left over to effectively double the input frame-rate. Input frame-rates rise and the increase in fluidity is obvious, but how smooth is it? This is going to be subjective but I think there is some objective data here to talk about. When I covered Avatar: Frontiers of Pandora, I had a mini section of my review, discussing frame-time irregularities with FSR 3 frame-gen active. Basically, traversing the denser areas of terrain more rapidly or engaging in combat could see erratic frame-times, so even though FSR3 was supporting variable refresh rate monitors correctly, it still did not look smooth in such moments. That is a completely subjective appraisal of course, and in the aftermath of that video I have seen a lot of comments about people who did not subjectively see this or objectively measure what I showed then. I wanted to note a couple of things here. First of all, people may perceive frame-time variations very differently and that's fine. Secondly, not every area of the game shows this behaviour. I wanted to dig into this more as I saw the same things occurring with this mod - but ultimately, results were inconclusive. One of the theories is that the use of overlays such as Riva Tuner Statistics Server causes this issue and AMD says they shouldn't be used. We use RTSS for its FCAT border support, included to verify actual frame-times delivered to your screen. We ruled this out a while back when AMD first raised the issue with us - we ran the same scenes through both FCAT and our console screen-tear detection algorithms (the latter requiring no overlay) and observed the same behaviour. Another question was whether the erratic frame-times were limited to Nvidia cards only, working fine on AMD. Our testing on an RX 7900 XTX revealed the same behaviour. So, with the issue tested only on a Ryzen 7 7800X3D set-up, Rich Leadbetter repeated the tests on his 13900K set-up, where the erratic frame-time issue was not present. Returning to the 7800X3D set-up, the issue did not present again, even though the game itself and the AMD driver had not been updated. Put simply, right now we can't fully reproduce the issue - but the prior data (and indeed our eyeballing of the game running in VRR) showed that the issue was real. I observed the same behaviour in FSR 3-modded DLSS 3 titles on my system, but once again, Rich didn't see the same issues on his 13900K system. Reading up on user reports, some people report issues with smoothness and others do not. In light of that and the inability to consistently reproduce issues my general tip is to give a game a restart if you are seeing issues, as my Avatar experience shows. Still - I would say FSR3 can be very smooth with VRR - and the reasons why it suddenly cannot at times are currently unknown. Moving on to DLSS 3 comparisons and general quality, it is good enough to be convincing for most camera movement, but there are some obvious problem areas. One particular problem is shadow reprojection, where shadows exhibit a flashing double image that presents almost like stutter. This is due to shadows with FSR 3 not being properly reprojected - this does not happen with native DLSS 3. Another issue is silhouette and hair artefacting (as seen in Alan Wake 2) where moving the camera from left to right delivers a kind of fizzling and haloing around the character's head with the FSR 3 mod. The last issue you may notice is a kind of stippled noise effect showing up sometimes in areas of great contrast that are moving quickly. The reason for this is due to FSR 3 resolve, which seems dithered, so screen elements can look noisier depending upon how much fullscreen change is occurring rapidly. There are other small issues, but let's remember that this is a completely unofficial mod - focusing on quality misses the point as we aren't looking at fully implemented, 'official' FSR 3 implementations. The big takeaway is that camera motion and translation in general looks better. The game looks like it is running at a higher frame-rate, opening the door to smoother-looking gameplay and for older RTX users to more effectively run high-end experiences, such as Cyberpunk 2077 RT Overdrive. We expect to see more FSR 3 integrations soon and it'll be fascinating to see if elements from this mod make their way across - such as the ability to use any input imagery, not just FSR 2. It's also just a matter of time until these DLSS 3 mods extend to AMD hardware too. Hopefully, at that point, we'll be able to do a much closer head-to-head between DLSS 3 and FSR 3, but in the meantime, DLSSG to FSR 3 is well worth checking out as a taste of what could be. From Assassin's Creed to Zoo Tycoon, we welcome all gamers Eurogamer welcomes videogamers of all types, so sign in and join our community! Feature |\n\n\nWhen the martial arts met Bond: The story of Saboteur Feature |\n\n\nMeet the 57-year-old who just released his first video game Supporters |\n\n\nGame of the week: Sometimes the best thing is when you give the game away Feature |\n\n\nWhat we've been playing - pools, crates, and tombs Digital Foundry |\n\n\nHorizon Forbidden West: the best PC settings look a lot like Guerrilla's choices for PlayStation 5 Long read |\n\n\nThe beauty and drama of video games and their clouds Supporters |\n\n\nFive of the Best: Time manipulations Feature |\n\n\nExploring the new world of Chinese FMV games Bad puns and video games since 1999. Eurogamer.net is owned by Gamer Network Limited, a ReedPop company and subsidiary of Reed Exhibitions Limited. © 2024 Gamer Network Limited, Gateway House, 28 The Quadrant, Richmond, Surrey, TW9 1DN, United Kingdom, registered under company number 03882481. All rights reserved. No part of this website or its content may be reproduced without the copyright owner's permission. "
}