{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.pcgamesn.com/amd/rdna-4-clock-speed",
    "text": "With current RDNA 3 graphics cards topping out at around 2.5GHz boost clock, the new 3.3GHz boost clock claim for RDNA 4 would be a huge leap. Edward Chester Published: Feb 14, 2024 There’s a new AMD RDNA 4 clock speed rumor in town, with a new claim appearing suggesting the company’s upcoming GPU architecture could have a significantly higher boost clock speed than its current generation of GPUs as well as Nvidia’s latest offerings. The new AMD RDNA 4 speculation comes via regularly rumor-monger Moore’s Law is dead (MLID), who claims that the latest RDNA 4 specs rumors show engineering samples of the chips clocking all the way up to 3.30GHz. That compares to just 2.50GHz for the likes of the AMD Radeon RX 7900 XTX and is a huge 48% higher than the 2.24GHz clock speed of the Nvidia GeForce RTX 4090 – both cards that make it onto our best graphics card guide. However, get your salt shakers at the ready because a big ol’ pinch is required when it comes to the validity of this story. Previously, AMD itself claimed that its RDNA 3 architecture was “architected to exceed 3GHz” but no RDNA 3 GPU has yet pushed beyond 2.5GHz, at least in terms of stock clock speeds. However, RDNA 4 is a brand new architecture and it will be built on a newer process than the 5nm process used to produce the likes of the RX 7800 XT and RX 7600. Instead, the RX 8800 XTX and RX 8600 XT, or whatever they end up being called, will be built on TSMC’s 4NP (4nm) process, which should bring opportunities for increased clock speeds. Dampening this possible route for enthusiasm, though, is that AMD has already released a product using this new process, in the shape of the 8700G APU. That chip’s graphics run a 2.90GHz, with overclockers having pushed this to 3.10GHz, but that’s still a long way off 3.30GHz. Moreover, that’s a much smaller chip than is likely to be required for powerful next-gen GPUs, and it gets ever more tricky to crank up clock speed as chip size increases. Still, with AMD also rumored to be targeting only the mid-range graphics card sector with its RDNA 4 chips, it’s possible that it’s managed to find a way to optimize its smaller mid-range chip design to run at far higher speeds than we might otherwise expect. Regardless, we can expect to learn more about RDNA 4 as this year progresses, with the new GPUs expected to launch in late 2024, according to the latest RDNA 4 release date expectations. In the mean time, AMD’s RX 7800 XT and RX 7600 are our top picks from the company’s current-gen graphics card roster, which is why they’re listed on our best graphics card guide, alongside the best from Nvidia. Edward Chester                 Edward Chester writes hardware reviews and news for PCGamesN. He has reviewed every bit of PC gaming hardware you can think of, and many you probably can't, during his 16 years in the industry. He has been a PC gamer since the mid-90s and still just about manages to find time to indulge in his decades-long passion. Away from playing Apex Legends, Counter-Strike, or Quake, he's an avid cook, musician, gardener, and woodworker. "
}