{
    "title": "Upgraded to AM5 or Intel 14th Gen? Why not put that old hardware to use and \nbuild a NAS",
    "date": "2/3/2024",
    "url": "https://www.notebookcheck.net/Upgraded-to-AM5-or-Intel-14th-Gen-Why-not-put-that-old-hardware-to-use-and-build-a-NAS.799967.0.html",
    "text": "If you have just upgraded to AM5 or Intel 14th Gen, there’s a good chance that you’ve got a motherboard, CPU and RAM left over from your upgrade. Even if you haven’t, older PC hardware can be bought relatively cheaply and NAS software will run happily on Intel Haswell or Ryzen 1000 series. All you need to do is buy some drives, a cheap case and power supply. Where a NAS really shines is the ability to add functionality to your home network. They aren’t just a place to store files, but will allow you to host your own Plex or Wordpress server, Wireguard to access your home network from anywhere, Pihole or Adguard, torrent box or VPN and backup your entire NAS to a cloud hosting provider. They can even be used to host virtual machines and connect cameras for surveillance. The options are almost limitless. Assuming you aren’t going to be virtualising a gaming machine, the lack of a GPU means you will have much more flexibility in power supply choices. Anything over 350 watts will be enough to power a mid range CPU and a good number of drives. But do keep in mind, a power hungry Intel i9 or Ryzen 9, might be overkill for this build and require a beefier power supply. While pretty much any PC case will do, for a NAS build you are going to want to get one with plenty of 3.5 inch drive bays. The Fractal Define series carry a good number of bays and are compatible with ATX boards. If you have an ITX board the Fractal Node 304 makes an excellent NAS case if you can find one, or a purpose built NAS case (available from Amazon*) could also be a good choice. Speaking of disks, you’ll want to go with NAS specific disks such as the Seagate Ironwolf or Western Digital Red. These are designed to last longer under 24/7 operation compared with standard disks. Size is up to you, but keep in mind you’ll need more than one to ensure your disks have redundancy, so if one fails it can be replaced without data loss. These 4 TB drives from Seagate (available on Amazon*) offer a good compromise between space and price, particularly when purchasing multiple drives. While you could throw Windows or Linux onto your machine, these operating systems aren’t really designed for a NAS. TrueNAS is an evolution of FreeNas and can be downloaded from iXSystems. There are a number of variations including Core and Scale. Both are free but Scale is better for virtualisation with GPU passthrough, and the community and support around Core is generally better. With Truenas, you get all the usual file sharing options, plugins and dockers for virtually any application you can think of. However one limitation with TrueNAS (as with many NAS applications) is that you have to use disks of the same size, you cannot mix and match sizes in your array. Another alternative is Unraid. While not free, the price of entry is worth every penny. Unraid Basic is $59 and gives you support for up to 6 drives. Unraid offers similar features to TrueNAS, but allows you to use disks of any size, as long as your parity (or redundant disk) is the largest in the array. Both platforms can be accessed through a web browser from any machine on your network and can be set up to operate completely headless (without a display attached) allowing you to stuff them in a cupboard out of sight. The rabbit hole of NAS building is far too long and deep to cover in any detail in a single article, but the rewards are many. For someone who likes tinkering, a home built NAS project can be really rewarding and offers features that once running are very difficult to live without. Unraid, Truenas, WireGuard, PiHole, Adguard, Plex "
}