{
    "title": null,
    "date": "2/11/2024",
    "url": "https://www.tech-critter.com/rog-asus-tuf-gaming-laptops-ces-2024-malaysia-price/",
    "text": "ASUS Malaysia has officially launched a couple of new AMD machines to join the earlier Intel batches to complete the early 2024 batches.  The models are the ROG Zephyrus G14 and TUF Gaming A15 with each of them offering 2 different SKUs at different price points. So let’s just skip the formalities and hop straight into the specs table (and the prices, of course). CPU AMD Ryzen 9 8945HS GPU NVIDIA GeForce RTX 4050 Laptop GPU / 4060 Laptop GPU Display 14-inch ROG Nebula Display OLED (2880×1800, 120Hz, 0.2ms, 100% DCI-P3, G-SYNC, VESA DisplayHDR True Black 500, PANTONE Validated, Dolby Vision) RAM 16GB / 32GB LPDDR5X Storage 1TB PCIe 4.0 I/O Ports 1x USB 4 (DP, PD) 1x USB-C 3.2 Gen 2 (DP) 2x USB-A 3.2 Gen 2 1x HDMI 2.1 1x microSD Reader 1x Audio Jack Connections WiFi 6E, Bluetooth 5.3 Battery 73WHr Price RM7,999 (RTX 4050, 16GB RAM) RM8,999 (RTX 4060, 32GB RAM) CPU AMD Ryzen 9 8945H GPU NVIDIA GeForce RTX 4060 Laptop GPU / 4070 Laptop GPU Display 15-inch IPS LCD (165Hz, 3ms, 100% sRGB) in QHD / FHD RAM 16GB DDR5-5600 Storage 1TB PCIe 4.0 I/O Ports 1x USB 4 (DP, PD) 1x USB-C 3.2 Gen 2 (DP 1.4, PD, dGPU) 2x USB-A 3.2 Gen 2 1x HDMI 2.1 FRL 1x microSD Reader 1x Audio Jack 1x Ethernet Connections WiFi 6, Bluetooth 5.3 Battery 90WHr Price RM6,499 (RTX 4060, FHD 144Hz) RM6,799 (RTX 4070, FHD 144Hz) RM6,999 (RTX 4070, QHD 165Hz) The ROG Zephyrus G14 is available right now across Malaysia while the TUF Gaming A15 will be arriving in a couple of weeks. The ROG Slash Hard Case Luggage is a premium hard-shell suitcase designed for gamers and travelers. It is made from... ROG's Strix series of products has been expanded once again with 2 new monitors - the XG27UCS and XG27ACS. Enter your email address to subscribe to Tech-Critter and receive notifications of new posts by email. Email Address Subscribe Tech-Critter ©Wavelength.Network PLT(LLP0013243-LGN)wavelength.network "
}