{
    "title": "Acer: The new Acer Swift Edge 16 and Swift Go 14 will feature the AMD Ryzen \n8040 Series Processors with Ryzen AI",
    "date": "2/21/2024",
    "url": "https://technave.com/gadget/Acer-The-new-Acer-Swift-Edge-16-and-Swift-Go-14-will-feature-the-AMD-Ryzen-8040-Series-Processors-with-Ryzen-AI-37596.html",
    "text": " Acer fans are in for a treat. Recently, Acer released the revamped Acer Swift Edge 16 and Acer Swift Go 14. That said, what should you know about it? For your information, both laptops will feature the AMD Ryzen 8040 Series processors with Ryzen AI. Both devices will also sport up to AMD Radeon 780M Graphic. As you can expect, these laptops support Acer’s AI-powered capabilities such as Acer PurifiedVoice™, Acer PurfiedView,and the new Acer LiveArt photo-editing feature. The Acer Swift Edge 16 features the AMD Ryzen 7 8840U octa-core processor with AMD Radeon 780M graphics and AMD Ryzen AI. It also runs up to 32 GB of LPDDR5 RAM and 2 TB PCIe 4.0 SSD storage. This device is also travel-friendly, at 1.23 kg and 12.95 mm in height. In addition, this laptop sports a 16-inch 3.2K OLED panel with a 120 Hz refresh rate and 100% support for the DCI-P3 colour gamut. It also features narrow bezels, less than 0.2 ms response time, and VESA DisplayHD True Black 500 certification for a more immersive user experience. As you can expect, it is compatible with Wi-Fi 7 and comes with an HDMI 2.1 port, two USB Type-C ports (supporting USB4 with speeds of 40Gbps, DisplayPort, and USB charging), two USB Type-A ports, and a MicroSD Card slot.  Acer Swift Edge 16 Meanwhile, the Acer Swift Go 14 features up to an AMD Ryzen 9 8945HS octa-core processor, AMD Radeon 780M graphics, and Ryzen AI. Interestingly, this variant delivers 60% improved AI performance compared to its predecessors. It also runs up to 32 GB LPDDR5X memory and 2 TB PCIe Gen 4 SSD. Moreover, the Swift Go 14 14-inch sports up to a 2.8K OLED display and a 90 Hz refresh rate. You can also opt for the touchscreen variant. For your information, the touchscreen variant runs an IPS LCD (1920x1200) panel for your convenience. This device houses a fully extendable 180 degree hinge and OceanGlass touchpad with 44% larger space. That makes it easier to work and scroll within any settings.  Acer Swift Go 14 But it does not end there, the laptop offers a 1440p QHD webcam, a 100W battery with quick-charging capabilities, and Wi-Fi 6E compatibility. Plus, it features dual USB Type-C ports that also support USB4, DisplayPort, and USB charging capabilities, an HDMI 2.1 port, Bluetooth 5.3, and a MicroSD card. We have yet to confirm the Malaysia release date for both laptops. As of now, both variants will arrive in Europe from April onwards. The Swift Edge 16 should cost you USD1299.99 (~RM6231.50) while the Swift Go 14 starts from USD699.99 (~RM3355.40)  What are your thoughts about this news? Stay tuned for more news and updates like this at TechNave! Rate & Review now via the TechNave APP and win yourself a branded new smartphone weekly. Download the TechNave App Now: http://onelink.to/technave\n\n Follow the latest Tech News and Gadget Reviews\n Compare Gadget Specs\n Get the best Prices from Nearby Retail stores\n Win FREE smartphones from the weekly Giveaway.\n\nDonwload now from: Donwload now from:  Xiaomi recently launched the Xiaomi 14 series in Malaysia, including the latest flagship model - the Xiaomi 14 Ultra. It has a set of four rear cameras, delivering a diverse toolkit to capture every moment with precision and clarity. Here's a quick look at what you can expect! Anyone who has used Samsung Notes before would say that it's just fine for shopping lists, doing lecture notes or keeping track of a meeting but traditionally, it's not often used for serious document creation. Recently, Samsung introduced their new Galaxy AI with the Samsung Galaxy S24 series of devices and AI-driven functions like Note assist are taking Samsung Notes to another level. How exactly is it doing this? Read on to find out how you can not only create professional content with Samsung Notes, but also do it quickly and easily with the new Galaxy AI Note assist. Home\n| Mobile Phone\n| iPad & Tablets\n| Cameras & Camcorders\n| News\n| Reviews\ncopyright © 2023 TechNave.com.   |   About Us  |   Contact Us  |   Advertise Here  |   Privacy Policy  |  Mobile Site "
}