{
    "title": "AMD confirms bug with recent Radeon gaming GPU — RX 7900 GRE overclocking \nlimit will be removed in a future driver",
    "date": "2/28/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/amd-confirms-bug-with-recent-radeon-gaming-gpu-rx-7900-gre-overclocking-limit-will-be-removed-in-a-future-driver",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The RX 7900 GRE should overclock higher once the fix arrives. AMD's Radeon RX 7900 GRE (Golden Rabbit Edition) may make our list of best graphics cards when we update it next month. In the meantime, AMD has reportedly confirmed to Hardware Unboxed a bug with the Radeon RX 7900 GRE that limits the Navi 31-based graphics card's overclocking potential, but a fix is on the way.\n\n\"AMD's has told me that extremely limited overclocking of the GRE cards is a bug and it will be addressed shortly,\" stated Steve Walton in the latest YouTube video.\n\nTechPowerUp noted in its review that the Radeon RX 7900 GRE appears to have an artificial overclocking limit imposed by AMD. The graphics card's memory clock would not surpass 2,316 MHz, while its maximum boost clock can't break the 2,803 MHz barrier. According to AMD's statement to Walton, the limit is a bug, and the chipmaker is already working on a solution.\n\nThe Radeon RX 7900 GRE isn't a new graphics card. Initially exclusive to China, the Navi 31 graphics card has been on the market since July 2023. It wasn't until recently that AMD decided to release the graphics card worldwide — it officially launched in the U.S. on February 27, 2024. Having been on the market for so many months, it's curious that we've heard nothing about the bug until now. The good news is that AMD has committed to rolling out a fix to remediate the issue. The chipmaker didn't specify if the fix will come in a driver or firmware update. The Radeon RX 7900 XT has a 2,000 MHz game clock and a 2,400 MHz boost clock. In contrast, the Radeon RX 7900 GRE has a 1,880 MHz game clock and a 2,245 MHz boost clock. We tested the Sapphire Radeon RX 7900 GRE Pulse with a 1,927 MHz game clock and a 2,293 MHz boost clock. Our results above illustrate how the Radeon RX 7900 XT dramatically exceeds the state boost clock, while the Radeon RX 7900 GRE is much closer, on average, to the rated boost clock.\n\nThat suggests that there ought to be quite a bit of overclocking headroom on the Radeon RX 7900 GRE. AMD apparently put a limit on its drivers — why, we couldn't say — which went undiscovered until the worldwide launch this past week. Or perhaps the limit wasn't always in the drivers and is a recent introduction? Either way, manual overclocking could give a sizeable bump to the Radeon RX 7900 GRE's performance.\n\nThere's a sizeable gap between the Radeon RX 7900 GRE and Radeon RX 7900 XT right now — up to 15%, depending on the resolution. Removing the artificial overclocking limit on the Radeon RX 7900 GRE won't magically make it perform like a Radeon RX 7900 XT. Still, it should allow end users who want to manually overclock away to narrow the gap. The Radeon RX 7900 XT still has a wider 320-bit memory interface and 20GB of memory, plus higher default clocks, but it should be possible to reduce the margin between a stock XT and an overclocked GRE to perhaps 5~10 percent.\n\nThe issue only affects manual overclocking so that it won't benefit the Radeon RX 7900 GRE's out-of-box experience. Factory overclocks are still in place and working correctly. You can't properly redline the 7900 GRE right now, which saddens some enthusiasts. AMD doesn't like sad enthusiasts, so it will now remove the limiter. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Zhiye Liu is a Freelance News Writer at Tom’s Hardware US. Although he loves everything that’s hardware, he has a soft spot for CPUs, GPUs, and RAM. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 World Backup Day is this weekend — here are the best hard drive and SSD deals we can find By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}