{
    "title": "Controversial benchmarking website goes behind partial paywall — \nUserbenchmark now requires a $10 monthly ...",
    "date": "2/17/2024",
    "url": "https://www.tomshardware.com/software/controversial-benchmarking-website-goes-behind-paywall-userbenchmark-now-requires-a-pound10-monthly-subscription",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. That's a shame. Update, 2/18/24 8:40am PT: Userbenchmark’s testing software still has a free version but with a catch: According to user reports, only a limited unspecified number of users can test for free at any one time, and if no slots are open, then only subscribers to the $10-per-year Pro plan can test — users will get the notification that they will have to sign into a paid Pro account to use the app. \n\nWhen there are free slots, users will have to complete a 3D captcha minigame where the goal is to shoot down 13 ships. The minigame isn’t particularly difficult on the surface, but it can get very tedious as there are very few opportunities for users to actually shoot down any ships. We attempted to complete the captcha ourselves but gave up after a few minutes.\n\nOriginal article: Userbenchmark is notorious for denouncing AMD CPUs and GPUs and being the source of many leaks for upcoming chips. However, the website’s history of leaking seems to be over, thanks to Userbenchmark imposing a $10-per-year fee to use its benchmark (via @ghost_motley). For the uninitiated, Userbenchmark is ostensibly a website where users can download a benchmarking tool, run it on their PC, and then upload the results back to Userbenchmark for comparison. It’s a very similar concept to 3DMark, and the website has six sections: CPUs, GPUs, SSDs, HDDs, RAM, and USB sticks. As far as we can tell, the benchmark itself isn’t particularly remarkable. It uses basic libraries from Windows and open-source software; if Userbenchmark is skewing performance results, as many critics claim, it’s probably done on the website rather than the testing software. The value proposition for a $10 fee doesn’t seem to make much sense, and it’s unlikely there will be many customers. This probably means the end of hardware leaks cropping up on Userbenchmark, which has been the source for many early leaks for chips like Ryzen 3000 and Intel’s Tiger Lake. After all, the fact that Userbenchmark was accessible and straightforward was probably why engineers working with early silicon used it. However, the benchmark’s CPU-memory latency test is pretty unique and notable. The other side of Userbenchmark is its infamous criticism toward AMD CPUs and GPUs. Entries for mainstream CPUs and GPUs have a mini-review attached to them, and nearly all of them mention phrases like “AMD’s army of Advanced Marketing scammers” and “AMD’s Neanderthal marketing techniques.” The reviews often charge AMD with making it “difficult for consumers to make rational choices” because it has allegedly taken over all levels of social media. Userbenchmark wasn’t always like this, though. Founded in 2011 as whoratesit, it was a social media platform for rating all sorts of things, from movies to books to computer software and hardware. Eventually, the website rebranded itself to Userbenchmark in 2013 and had even-handed opinions toward AMD for years. Things only changed in mid-2019, when the website reacted against the high performance of AMD’s Ryzen 3000 CPUs by making changes that favored lower core count CPUs, which would benefit Intel’s 9th-gen chips. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Although Userbenchmark somewhat tempered its rhetoric in that specific instance, the website has been increasingly critical of AMD products. Today, Userbenchmark practically accuses the company of masterminding all discourse about CPUs and GPUs any time AMD comes out with a new CPU or GPU. The new paywall will likely be another controversy to put on the pile. Matthew Connatser is a freelancing writer for Tom's Hardware US. He writes articles about CPUs, GPUs, SSDs, and computers in general. New Windows Insider build gets rid of annoying watermark, adds Copilot support for local accounts Google keeps trying to force feed me its hideous new Chrome design. Here's how to revert to the classic one. OpenAI and Microsoft reportedly planning  $100 billion datacenter project for an AI supercomputer By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}