{
    "title": "Huawei Taishan V120 CPU enters Geekbench, matches AMD Zen 3 in single-core \nperformance",
    "date": "2/27/2024",
    "url": "https://www.huaweicentral.com/huawei-taishan-v120-cpu-enters-geekbench-matches-amd-zen-3-in-single-core-performance/",
    "text": "Huawei releases March 2024 software for P60 Pro (Global) Huawei Nova Y61 gets new software update with security fixes Huawei Mate 50 Pro global units getting March 2024 update Huawei MatePad Pro 13.2 global users grab February 2024 security patch Huawei FreeClip claims spatial audio feature via March 2024 update Huawei Children’s Watch 5X/5X Pro picks March 2024 optimizations update Huawei could unveil new Watch 4 Pro Space Exploration Edition next month Huawei introduces Watch GT 4 Spring Edition in five elegant colors Huawei Watch Fit 3 passes SDPPI certification, moving toward launch Standard Huawei Watch GT 3 global units fetch HarmonyOS 4 software update Published on By A new Huawei Kunpeng server CPU based on Taishan V120 cores appeared on Geekbench 6 with proficient single-core performance. Looking at the results, the performance efficiency seems equivalent to the AMD Zen 3 cores, launched in 2020. The detail reveals that the spotted CPU relies on Taishan V120 cores architecture, found in Kirin 9000s. It adopts four main cores and two Arm Cortex A510 efficiency cores. Just like the Kirin 9000s, this CPU might also use the 7nm process tech. The new CPU (Taishan V120) showed up on the Geekbench with the name – Huawei Cloud OpenStack Nova. Although the testing doesn’t reveal much about the CPU, its results hint that Huawei is ready to develop cutting-edge western-designed chips. Accordingly, the Huawei Kunpeng CPU server on the Geekbench scored 1527 points in a single-core test with a frequency of 2.9GHz, matching the AMD EPYC 7413 (Zen 3 architecture). Notably, the AMD Zen 3 had secured 1538 single-core points with a frequency ranging from 2.65 – 3.6GHz. Huawei Taishan V120 Geekbench results [Image: Geekbench] During the Geekbench 5 test of Kunpeng 920, the Huawei CPU saw a significant decline in performance when compared to AMD’s first-gen EPYC Naples. But this time, the results are quite impressive and show ‘better than before’ improvements. Apart from the AMD Zen 3, the new Kunpeng server CPU is slightly equivalent to Intel’s Xeon E-2136. Everything combined, the new CPU performed quite well. The results further clues that the CPU could be either Kunpeng 916, 920, or 930. It is worth mentioning that the benchmark only runs on one core and the multi-core results are not that good (2806). Hence, it’s unclear how far the CPU based on Taishan V120 cores is performance efficient, or useful in power consumption. Yet, it’s a good start from Huawei’s side and reflects that the company will soon enter in the advanced chip-making era with better cores and processing technologies. Taishan V120 performance in Geekbench [Image: Geekbench](Source) Taishan V120 performance in Geekbench [Image: Geekbench] Huawei unveils world’s first 5.5G Intelligent Core Network at MWC 2024 Number of global 5G users exceeded 1.5 billion in five years: Huawei I like to listen to music, sing, dance, and play outdoor games. I have a huge interest in reading novels and cooking. I'm good enough as a speaker. Besides, I have the willingness to learn new things and increase my knowledge in different aspects with full dedication and determination. Here are all of the Huawei EMUI 14 features Huawei releases March 2024 software for P60 Pro (Global) Huawei Books is getting 9.1.33.300 version with March 2024 update Copyright © 2022 Huaweicentral.com "
}