{
    "title": "Future AMD CPUs and Nvidia GPUs could be made by Intel",
    "date": "2/23/2024",
    "url": "https://www.pcgamesn.com/intel/foundry-nvidia-amd",
    "text": "CEO Pat Gelsinger says he wants the Intel foundry business to be open to the world, including competitors such as Lisa Su and Jensen Huang. Ben Hardwidge Published: Feb 23, 2024 In what’s set to be a ground-breaking move, Intel CEO Pat Gelsinger has revealed that he wants Intel’s chip making “crown jewels” to be open to everyone. That not only means Intel foundries would be available to key allies of Intel, such as Microsoft, but also competitive rivals such as Nvidia and AMD. Although quite a few of the latest Intel CPUs can be found on our best gaming CPU guide, the company is now largely on its own when it comes to making most of its own silicon, and it looks as though Gelsinger has realized that there’s a business opportunity here. Both AMD and Nvidia use TSMC to produce the cutting-edge dies used in most of their latest CPUs and GPUs, with the former spinning out its former chip fabrication business to form Global Foundries back in 2009. Specifically, Gelsinger namechecked people that he hopes will be future customers of Intel’s foundry facilities, including Jensen Huang, CEO of Nvidia, and Lisa Su, CEO of AMD, as well as the heads of Google, Qualcomm, and Microsoft. A deal with the latter is already underway, with Intel contracted to make a Microsoft CPU range. Gelsinger’s comments were given in response to a question from Tom’s Hardware in a Q&A session at Intel’s IFS Direct Connect 2024 event. At the event, Gelsinger described a situation where Intel has two separate legal entities – one for Intel products, such as its own CPUs, and one for its chip fabrication facilities (fabs) that makes the silicon used in them. “The foundry team’s objective is simple,” says Gelsinger. “Fill. The. Fabs. Deliver to the broadest set of customers on the planet.” He likened the opportunity to an “a la carte menu”, with Intel being “the foundry of the world.” He’ll have to hope that Intel can really deliver on its promises here, as the company hasn’t excelled in recent times when it comes to silicon fabrication. The 11th gen CPU launch famously had to use the company’s old 14nm node, as there were so many delays with the move to 10nm, and the recent delay to Meteor Lake on the desktop has been a frustration to the company too, with its latest 14th gen chips, such as the Core i9-14900K, still produced on the company’s 10nm process. This wouldn’t be the first time Intel and AMD have used each other’s fabrication facilities to make their own-band chips either. During the 1970s and 1980s Intel outsourced a big chunk of the production of 8086, 286, 386, and 486 CPUs to AMD, which is why the company has a license to produce x86 CPUs, unlike Nvidia. In the meantime, if you’re looking to put together a new rig with one of Intel’s latest CPUs, such as the Core i5-14600K, check out our guide on how to build a gaming PC, where we guide you through every part of the process. Ben Hardwidge                 A tech journalist since 1999, and a PC hardware enthusiast since 1989, Ben has seen it all, from the horrors of CGA graphics to the amazing ray-tracing GPUs of today. Ben is mainly interested in the latest CPU and graphics tech. "
}