{
    "title": "How to get higher frame rate in Starfield: FSR 3 explained",
    "date": "2/4/2024",
    "url": "https://dotesports.com/starfield/news/how-to-get-higher-frame-rate-in-starfield-fsr-3-explained",
    "text": "Starfield is getting a performance-enhancing update that will add FSR 3 support to the game. This new feature is supposed to increase your framerate, but as is often the case, things aren’t that simple. Don’t worry, we’ll explain everything you need to know about FSR 3 in Starfield. Starfield and FSR 3 both launched in September 2023, but it took the pair nearly half a year to finally meet each other. Bethesda released an official announcement confirming AMD’s frame-generation feature will be implemented into the Starfield Steam beta in early February, with a full implementation scheduled for later that same month. As with many other 2023 AAA releases, performance in Starfield isn’t exactly smooth, even to this day. An update adding what is supposed to be a clear enhancement is, therefore, a welcome addition to the game, and yet, players are still asking questions. We’ll try to answer them here, explaining how and if you can boost your framerate in Starfield using FSR 3. FSR 3 stands for Fidelity FX Super Resolution, with this being the third version of this technology. FSR 3 is software that enhances the performance of your hardware by reducing the render resolution behind the scenes, a process called upscaling. For the user, the final result is a slightly compromised visual fidelity in exchange for a massive framerate boost. FSR 3’s main draw over its predecessors is the addition of frame generation, called Fluid Motion Frames by AMD, though you can use base FSR 3 without enabling frame generation. FSR 3 is a direct competitor to Nvidia’s DLSS 3 technology, though that comparison doesn’t bode too well for AMD—more on that a bit later down the article. FSR 3 will first be added to the Starfield Steam beta in the week of Feb. 5-11 and to the full PC version of the game by the end of February. The full implementation of FSR 3 will be accompanied by a new scheduled Starfield update that could add even more content. FSR 3 will not be implemented in the Xbox Series X|S version of Starfield at this point. The feature will be added to the PC version only. We can only speculate on the matter, but it isn’t too likely that FSR 3 will ever be added to Starfield on the Xbox. Bethesda opted to lock the game to 30 frames per second on the console, citing its desire to not compromise fidelity. The thing with upscaling, and especially frame generation, is that it requires a certain base level of performance to maximize its efficiency. With Starfield supposedly bringing the Xbox Series X|S to its knees, the gains from FSR 3 would be minimal. If it is to ever appear in the Xbox version of Starfield, a lot of additional optimization will likely have to take place first. The simple answer is yes, FSR 3 will improve your fps in Starfield. How much you’ll gain and the quality of your experience will vary depending on your hardware, though. Upscaling quality is relative to the quality of your PC, so a user with a Radeon 7900 XTX will have a much better overall experience than someone rocking a Radeon 7600. The more your hardware can do on its own, the less FSR 3 needs to sacrifice to boost your frame rate. This is where the comparison with DLSS 3 kicks in. Nvidia’s upscaling has always been a tad bit better than AMD’s, and this generation of upscaling is no different. This applies to frame generation as well, where FSR 3 tends to struggle with keeping the image as fluid as DLSS 3, particularly at 1080p. That being said, you should not dismiss the technology. FSR 3 can still improve your performance significantly, even on weaker hardware and despite its unfavorable comparison with DLSS 3. The downside is that you may have to endure worse visuals in exchange, especially if you’re gaming on a lower-resolution monitor. Ultimately, enabling FSR 3 in Starfield will be decided by whether the undisputed fps gains outweigh the loss of visual fidelity for you. "
}