{
    "title": "Popular Chip Stock Stock Lifted on Nvidia Results",
    "date": "2/22/2024",
    "url": "https://www.schaeffersresearch.com/content/options/2024/02/22/popular-chip-stock-stock-lifted-on-nvidia-results",
    "text": "The shares of Advanced Micro Devices Inc (NASDAQ:AMD) are surging today, as the chip sector gets a halo lift from Nvidia's (NVDA) post-earnings climb to record highs. Up 10.7% at $181.83 at last glance, and earlier hitting $183.77, AMD is nearing its own Jan. 25 all-time peak at $184.92. Before today's pop, Advanced Micro Devices stock found support for its recent pullback at its 40-day moving average, while the $162 region appears to be emerging as a floor as well. Since last February, the equity is up 137.5%.  Also like NVDA, Advanced Micro Devices stock is a regular on Schaeffer's Senior Quantitative Analyst Rocky White's list of stocks that have attracted the highest options volume during the last 10 days, and the past two weeks are no different. During this time, AMD has seen 4,288,673 calls and 2,273,887 puts exchanged, with the most activity at the February 180 call.   This penchant for bullish bets is nothing new. According to data at the International Securities Exchange (ISE), Cboe Options Exchange (CBOE), and NASDAQ OMX PHLX (PHLX), the security's 50-day call/put volume ratio of 1.88 stands higher than 80% of readings from the past year.  Target Effortless Triple-Digit Gains Every Sunday Evening For Life! 101.0% GAIN on Apollo Global Management calls\n103.6% GAIN on JP Morgan  Chase calls\n105.3% GAIN on DraftKings calls\n101.3% GAIN on Airbnb calls\n203.0% GAIN on Shopify calls\n102.0% GAIN on Cboe Global Markets calls\n100.9% GAIN on Boeing calls\n102.1% GAIN on Microsoft puts\n102.3% GAIN on First Solar calls\n101.5% GAIN on PulteGroup calls\n101.0% GAIN on Apple calls\n209.4% GAIN on NXP Semiconductors calls\n100.8% GAIN on Uber Technologies calls\n100.4% GAIN on Academy Sports and Outdoors puts\n102.2% GAIN on Trade Desk calls\n100.8% GAIN on DoorDash calls\n100.0% GAIN on Camping World Holdings puts\n100.0% GAIN on Cboe Global Markets calls\n100.2% GAIN on C3.ai calls\n238.5% GAIN on Oracle calls     "
}