{
    "title": "Rumor: Microsoft Still Making New Game Hardware, Might Even Switch To Intel \nFrom AMD",
    "date": "2/6/2024",
    "url": "https://gameranx.com/updates/id/489343/article/rumor-microsoft-still-making-new-game-hardware-might-even-switch-to-intel-from-amd/",
    "text": "Gameranx Video Game News, Lists & Guides Looks like Team AMD could finally become a one console island. The past few weeks have been rife with rumors about Xbox changing the way they do business, but some new rumors one key element is still on schedule. Jez Corden revealed in the latest episode of the Xbox Two podcast that Microsoft is working on new hardware at the moment. As transcribed by Idle Sloth, here is what Jez said: “Xbox has green-lit multiple new hardware projects in the last couple of weeks. Xbox hardware is here to stay, and there’s more stuff coming and even exclusives here to stay; there’s still going to be exclusives too.” The note about multiple hardware projects is certainly interesting. Jez also shared the recent rumor that Microsoft is working on a gaming portable. There are past rumors of Microsoft working on a cloud gaming platform, that could be the size of a thumb drive. So those multiple projects could be more than just new SKUs and controllers. But we have other rumors to cover that share an interesting picture of what’s going on in Microsoft behind the scenes. This comes from Moore’s Law is Dead, who seems to have sources connected to the chip industry, as opposed to the game industry directly. Rumors that come from this community have not always come true, but that perhaps reflects the hazard of their sharing these stories – they come in the early stages these companies make hardware, so plans change by the time rumors are confirmed or debunked. We’ll share our summary of what Moore’s Law is Dead stated below: Microsoft was apparently not really sure if they were even going to have another console generation. They have a habit of delaying talks with their chip manufacturer AMD, who also has a client in PlayStation. Microsoft regularly shops around other manufacturers, like Intel and Nvidia, but this time, something different happened: Intel pitched to them. On the Intel side of things, the company is looking for an opportunity to prove that their next generation of chips are competitive and superior to AMD’s. And so, they pitched unusually good terms for Microsoft to get their Xbox CPU/APU contract. Intel offered to sell the chips to them at the cost of manufacturing, or even below that. Even more importantly, Intel offered their full manufacturing capacity, so that Microsoft could have as many of those Intel Xbox chips made as they needed. This is important, because Sony’s ability to sell PlayStation 5 consoles now is actually hampered, because their manufacturing partner, TSMC, is at their limit. All things being equal, Microsoft could outpace Sony next generation. However, Moore’s Law is Dead also shared another rumor that directly conflicts this one. He claims that he doesn’t know which one is true, so we’ll just have to take them and consider for ourselves. This other rumor is that Microsoft did sign up with AMD after all. Because they took so long, the next Xbox generation is starting off later than PlayStation did, with Sony demonstrating their loyalty to AMD. If all of these did happen in sequence, Microsoft may have passed on a really huge opportunity, to once again be a few steps behind of Sony. But then, Microsoft may have reason not to entirely believe Intel’s promises, and that’s the reason they balked. In any case, for all we know, that Xbox handheld coming in 2026 will have a Meteor Lake APU, or whatever generation is coming after that. Some testers have found that Intel’s Meteor Lake can and does outperform AMD’s Z1 Extreme and 7840U, on some tests, though not all of them. While Intel’s Arc GPUs still need work on greater game compatibility, if Intel gained the Xbox contract, that would immediately propel them there. It’s all very interesting hypotheticals, but given the source, we have to consider this a snapshot of how things are right now, or a few months ago, and the final picture of Xbox’s hardware could end up very differently. Connect with Us Articles You’ll Enjoy Newsletter Subscribe to our newsletter to receive email notifications of new posts and updates. Copyright © 2024 · Gameranx · All Rights Reserved · Powered by BizBudding "
}