{
    "title": "AMD's Radeon RX 7900 XT falls to a 2024 pricing low in the UK",
    "date": "2/8/2024",
    "url": "https://overclock3d.net/news/gpu-displays/amds-radeon-rx-7900-xt-falls-to-a-2024-pricing-low-in-the-uk/",
    "text": " In response to the launch of Nvidia’s RTX 40 SUPER series of graphics cards, AMD appears to be pricing their Radeon RX 7900 series graphics cards more aggressively. Now, XFX’s Radeon RX 7900 XT Speedster MERC 310 is now available for Â£707.99 at Scan UK. For context, the cheapest RTX 4070 Ti SUPER at the same retailer is Â£769. At this pricing level, AMD’s second fastest RDNA 3 graphics card presents a strong value proposition to gamers. This is especially true for those who value having a large amount of VRAM. With 20GB of GDDR6 memory, this graphics card has more VRAM than even Nvidia’s RTX 4080 SUPER, a Â£969.99 graphics card. What’s worth noting about XFX’s Speedster MERC version of AMD’s Radeon 7900 XT is that it features higher clock speeds. With a game clock speed of 2175 MHz, and a boost clock speed of 2535 MHz, XFX are offering gamers 175 MHz/135 MHz respective clock speeds boosts over AMD’s reference design.  Last month, AMD issued promotional pricing for their RX 7900 series graphics cards. Today. AMD’s Radeon 7900 XT is available for a even lower price. It remains to be seen if AMD’s GPU prices will drop further in the coming weeks or months, or if GPU prices will stay around today’s levels. You can join the discussion on AMD’s 2024 Radeon RX 7900 XT pricing low on the OC3D Forums. A Northern Irish father, husband, and techie that works to turn tea and coffee into articles when he isn’t painting his extensive minis collection or using things to make other things. No crappy Google banners here, only PC related advertising you may actually find interesting. Please disable Ad Blockers in order for us to keep producing the same level of quality, informational reviews and news. Worst case they actually look pretty and fill the empty gaps <3 "
}