{
    "title": "Banishers Ghosts of New Eden system requirements",
    "date": "2/13/2024",
    "url": "https://www.pcgamesn.com/banishers-ghosts-of-new-eden/system-requirements",
    "text": "This brand-new action RPG from Don't Nod sets a low bar with its minimum and recommended specs, but the fantasy visuals look impeccable. Niall Walsh Published: Feb 13, 2024 What are the Banishers: Ghosts of New Eden system requirements? Every so often, a game comes along that catches everyone by surprise. Don’t Nod is well-known for its Life is Strange series, but its RPG escapades such as Vampyr have often gone under the radar. However, that looks set to end with Banishers: Ghosts of New Eden. Better still, it’s quite an easy game to get running on PC. Like most new games, Banishers: Ghosts of New Eden doesn’t ask for the best graphics card in its minimum specs, but across the board, you can get away with hardware that’s at least five years old. The Banishers: Ghost of New Eden minimum requirements make pleasant reading for anyone hoping to get the game running on slightly outdated hardware at 1080p and 30fps on the low graphical preset. You’ll need an Intel Core i3 8300 or AMD Ryzen 3 2200G CPU alongside an Nvidia GeForce GTX 1050 Ti or AMD Radeon RX 580 and 8GB of RAM. These graphics cards are popping up very frequently as the expected minimum specs, but that could change over the next 12 months. Here are the Banishers: Ghosts of New Eden system requirements: The Banishers: Ghosts of New Eden recommended specs take quite a substantial leap up, but there’s a good reason for this. Don’t Nod has clarified that the recommended specs are what is needed for playing at 1080p with 60fps on the highest graphical preset. This is a great way to benchmark your gaming laptop or PC against the most demanding settings, although you might need a little more power to push to 1440p or 4K and higher frames. You’ll need an Intel Core i5 10600K or AMD Ryzen 5 5600X paired with an Nvidia GeForce RTX 2060 or AMD Radeon RX 6700XT while you’ll also need 16GB of RAM. Anything you have in your gaming rig that is over these specs will contribute towards improving performance above the 60fps mark. For an action RPG, the Banishers: Ghosts of New Eden download size sits at a fair 52GB, with an SSD being noted in the recommended specs only, however, we always advise upgrading to one of the best SSDs for gaming regardless of what specs you’re aiming for. If you’re looking forward to playing Don’t Nod’s latest RPG, you can check out all the bosses in order and how long it takes to beat Banishers: Ghosts of New Eden thanks to our guides. Find yourself asking ‘Can I run Banishers: Ghosts of New Eden?‘… Take the system requirements test over on PCGameBenchmark to find out once and for all. Niall Walsh                 As one of PCGN’s Hardware Editors, Niall is an expert in all things peripherals, meaning if you need to know what the best PC gaming headsets, controllers, keyboards, mice, or monitors are, he has you covered. Even if you just want to know which peripheral brand is better, Razer, Corsair, Logitech, or any other he can help there too. You will also find his words on sites such as; The Loadout, Wargamer, USA Today, MTG Rocks, GGRecon, and RealSport101. "
}