{
    "title": "GraniteShares adds Amazon, AMD, and Microsoft to its 2X leveraged \nSingle-Stock ETFs Lineup",
    "date": "3/18/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024-03-18:newsml_GNX1Ct8Dq:0-graniteshares-adds-amazon-amd-and-microsoft-to-its-2x-leveraged-single-stock-etfs-lineup/",
    "text": "NEW YORK, March  18, 2024  (GLOBE NEWSWIRE) — Today, GraniteShares, an ETF issuer specializing in high conviction ETFs, announced that it has added three new leveraged single-stock ETFs to its existing lineup. The new ETFs will bring the total number of short and leveraged ETFs that GraniteShares offers to 13.These additions will aim to replicate two times (+2X) the daily variations of their underlying stocks: Advanced Micro Devices (AMD), Amazon (AMZN), and Microsoft (MSFT). The additions come as GraniteShares has surpassed the $2.5B in AUM in its short and leveraged Single Stock suite of ETFs and after a very successful 2023 that saw the best performing ETF of 2023 in GraniteShares suite (CONL) return an impressive 641%1 as investors reignited their interest in cryptocurrencies. In early 2024, GraniteShares NVDL became the largest leveraged single stock ETF in the world. GraniteShares first introduced leveraged ETFs on single stocks in the UK in 2019 and was one of the first ETF issuers to launch single-stock ETFs in the U.S. in August 2023. As a pioneer in leveraged single-stock ETFs, GraniteShares is committed to continually enhancing its product line to meet evolving customer needs. \"Over the last year, we’ve witnessed significant demand for leveraged single-stock ETFs in the U.S. market,” says Will Rhind, Founder and CEO of GraniteShares. GraniteShares Live ETF Offering In Table Below For more information, please visit: www.graniteshares.com. Media contact: Gregory FCA for GraniteShares Te’a Gray, 203-815-4514 graniteshares@gregoryfca.com About GraniteShares: GraniteShares is an award-winning global investment firm dedicated to creating and managing ETFs. Headquartered in New York City, GraniteShares provides products on U.S., U.K, German, French & Italian stock exchanges. The firm is a market leader in leveraged single-stock ETFs and provides innovative, cutting-edge investment solutions for the high conviction investor. Graniteshares believes the future of investing lies at the nexus of alternative thinking, low fees, and disruptive product structures—the core of its high conviction investment philosophy. The firm launched its first product in 2017 and is a fast-growing ETF issuer with approximately $2.52 Billion in assets under management spanning a full array of investment strategies. Important Information Investors should consider the investment objectives, risks, charges and expenses carefully before investing. For a prospectus or summary prospectus with this and other information about the Funds, please call (844) 476 8747 or visit www.graniteshares.com. Read the prospectus or summary prospectus carefully before investing. The investment program of the funds is speculative, entails substantial risks and include asset classes and investment techniques not employed by more traditional mutual funds. PRINCIPAL FUND RISKS (see the Prospectus for more information) The Fund is not suitable for all investors. The investment program of the funds is speculative, entails substantial risks and includes asset classes and investment techniques not employed by most other ETFs and mutual funds. Investments in the ETFs are not bank deposits and are not insured or guaranteed by the Federal Deposit Insurance Corporation or any other government agency. The Fund is designed to be utilized only by knowledgeable investors who understand the potential consequences of seeking daily leveraged (2X) investment results, understand the risks associated with the use of leveraged exposure and are willing to monitor their portfolios frequently. For periods longer than a single day, the Fund will lose money if the Underlying Stock’s performance is flat, and it is possible that the Fund will lose money even if the Underlying Stock’s performance leveraged over a period longer than a single day. An investor could lose the full principal value of his/her investment within a single day. The Fund seeks daily leveraged investment results and are intended to be used as short-term trading vehicles. This Fund attempts to provide daily investment results that correspond to the respective leveraged of the performance of its underlying stock (a leveraged Fund). Investors should note that the fund pursues daily leveraged investment objectives, which means that the fund is riskier than alternatives that do not use leverage because the fund magnifies the performance of their underlying security. The volatility of the underlying security may affect a Fund’s return as much as, or more than, the return of the underlying security. Because of daily rebalancing and the compounding of each day’s return over time, the return of the Fund for periods longer than a single day will be the result of each day’s returns compounded over the period, which will very likely differ from 200% of the return of the Underlying Stock over the same period. The Fund will lose money if the Underlying Stock’s performance is flat over time, and as a result of daily rebalancing, the Underlying Stock volatility and the effects of compounding, it is even possible that the Fund will lose money over time while the Underlying Stock's performance increases over a period longer than a single day. An investment in the Fund involves risk, including the possible loss of principal. The Fund is non-diversified and includes risks associated with the Fund concentrating its investments in a particular industry, sector, or geographic region which can result in increased volatility. The use of derivatives such as futures contracts and swaps are subject to market risks that may cause their price to fluctuate over time. Risks of the Fund include effects of Compounding and Market Volatility Risk, Inverse Risk, Market Risk, Counterparty Risk, Rebalancing Risk, Intra-Day Investment Risk, Daily Index Correlation Risk, Other Investment Companies (including ETFs) Risk, and risks specific to the securities of the Underlying Stock and the sector in which it operates. These and other risks can be found in the prospectus. This information is not an offer to sell or a solicitation of an offer to buy shares of any Funds to any person in any jurisdiction in which an offer, solicitation, purchase or sale would be unlawful under the securities laws of such jurisdiction. THE FUNDS AREDISTRIBUTED BY ALPS DISTRIBIUTORS, INC. GRANITESHRES IS NOT AFFILIATED WITH ALPS DISTRIBUTORS, INC Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @dehandreh @yo44ge4real @stvmcg @Arcanebear.eth @retirewithforex @sethsickness @aliams_david_trading_gram @mytradingsetup @fx_bitcoin_expert11 @tradingfrance @mytradingsetup @jordan_fx_ @nav.fx @itzi71 @laptopmoneygang @heinrich_j96 @johndollery @aggressivecalculator Whatever the trade "
}