{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.gizchina.com/2024/03/06/gpd-win-4-2024-gaming-handheld-launches-with-the-latest-amd-hawk-point-apus/",
    "text": "The gaming handheld PC market is getting very competitive, and it all started with Steam Deck. Yes, there were gaming handhelds before Valve released the Deck, but it’s the one that has made a big push in this segment. After that, we saw a ton of releases, including Asus Rog Ally, Lenovo Legion Go, and the GPD Win 4. On the note of the GPD Win 4, the company has updated the 2024 variant of the device. Like the predecessor, it comes with AMD APUs. But as it’s a 2024 model, we see the use of the latest Hawk Point processors, which offer a massive boost in AI performance. The other aspects of the gaming handheld are more or less the same as the predecessors. As mentioned earlier, the craze for handheld gaming started with the launch of the Steam Deck. So, for most of the new releases, that gaming device from Valve is still the baseline. As for the GPD Win 4, it’s more than the Steam Deck in most aspects. Here’s a quick rundown of all of its highlights to give you a better idea of the device: While the 2042 GPD Win 4 has a small and portable form factor, its processing power is the same as your gaming laptop. After all, it comes with the same AMD Hawk Point processors that the 2024 laptops are coming with. To be more specific, the gaming handheld is available with the AMD Ryzen 7 8840U and Ryzen 5 8640U.  Among the two, the Ryzen 7 packs 8 cores and 16 threads, while the Ryzen 5 brings 6 cores and 12 threads. The first can offer 38 TOPS of total processor performance, while the latter can deliver 31 TOPS. What’s more is that you can configure Win 4 with up to 64 GB of LPDDR5x RAM and 4 TB of Gen 4 SSD storage.  That basically means that the gaming handheld can let you do any productivity work on the go. It has the processing power to run almost anything you throw at it without any hiccups. If you’re looking for benchmark scores, the 2024 GPD Win 4 scores 7609.4 in multicore and 880 in the single-core on CPU-Z v19.01.64. While the GPD Win 4 is great at handheld day-to-day apps, it also excels in gaming. Thanks to the AMD Radeon 780M integrated GPU, you can expect to run almost all the modern games with playable FPS. To be specific, the gaming handheld can offer a much better performance than the Nvidia GTX 1660 Ti, which is a discrete GPU.  Of course, you may feel the need for more GPU power. To meet such demands, the GPU Win 4 comes with an exclusive Oculink port that supports a direct PCIe connection. This brings 63 Gbps of bandwidth, which is higher than Thunderbolt and USB ports. Thanks to that, you can get desktop-grade gaming performance with the GPD Win 4.  Yes, you can say that it’s not easy to get a proper eGPU setup. Well, GPD has thought of that. The company is also offering a GPD G1 Graphics Dock with the gaming handheld. This dock comes with the AMD RX 7600M XT mobile GPU. Like the Win 4, the G1 dock prioritizes portability. So, you can basically carry a fully-fledged gaming setup with you anywhere and everywhere. Powerful hardware is one thing, and getting proper performance is another. One thing that can make a gaming handheld perform poorly, even with high-grade components, is the cooling setup. The good news is that GPD Win 4 doesn’t skimp on it.  As the company says, the gaming handheld comes with a PC-grade cooling fan. It spots thick heat pipes, an efficient fan, and proper ventilation. All that adds up to a cooling performance that’s 35% better than the GPD Win 3. Besides the hardware and the cooling setup, a gaming handheld needs to excel in terms of display. Well, the GPD Win 4 does not back down in this regard either. It comes with a 6-inch Eye-care display that can deliver a native 1080p resolution.  While it does great in terms of displaying the games you’re playing, there’s a drawback. Most of the recent gaming handhelds come with high refresh rate displays. But the GPD Win 4 maxes out at 60 Hz, which is okay considering it’s a mobile gaming device, but a higher refresh rate would’ve made the gaming experience much better. The 2024 GPD Win 4 gaming handheld comes with a handsome number of connectivity ports. For meeting video, data transfer, and charing demands, it brings one USB4, 2x USB 3.2 Type-C, one HDMI 2.0, and one USB 3.2 Type-A. Other highlights of the gaming handheld include a full QWERTY keyboard, a tuned Joystick, a D-Pad, and a 45.62 Wh battery. You can learn more about the gaming handheld from the video attached below.  Abid is an audio and PC/mobile accessories expert who loves to explore the latest and greatest tech in the market. He has a keen ear for sound quality and deep knowledge of audio equipment. Abid is always eager to test new gadgets and accessories that take things to the next level. He also finds other aspects of the tech industry fascinating, and he enjoys learning and sharing his insights with others.     GizChina Follow @gizchina  Accredited technology blog dedicated to providing breaking news, expert reviews and original content related to mobile tech and EV industry, smartphones, gadgets and IoT. Keep up to date with the latest Android phone news and reviews on our social media channels: "
}