{
    "title": "AMD Ryzen 8000, 7000 and 5000 series processors drop to seriously low \nprices at Newegg",
    "date": "3/3/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/amd-ryzen-8000-7000-and-5000-series-processors-drop-to-seriously-low-prices-at-newegg",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Now is a great time to indulge in a processor upgrade. Right now at Newegg, you can find quite a few AMD processors for some notably low prices. This includes a wide range of stock starting with AM4 Ryzen 5000 series processors all the way up to some of the latest AM5 Ryzen 8000G series. Discounts vary across the board but we'll highlight a few notable deals that you won't want to miss out on. Your best budget option right now is the 6-core AMD Ryzen 5 5500, an AM4 processor that can reach up to 4.2 GHz. When using promo code GUDDQA69, you can snag this CPU for $92. A step up from the Ryzen 5 5500 is the AMD Ryzen 7 5700X3D, an 8-core processor that can reach 4.1 GHz, which is $241 when you use promo code GUDDQA77. For those looking for something strong on the performance end, the AMD Ryzen 9 5950X is listed for just $372 with promo code GUDDQA65. AMD Ryzen 5 5500: now $92 at Newegg (was $159)\nThe AMD Ryzen 5 5500 has 6 cores and is unlocked for overclocking. The base clock speed is 3.6 GHz but it can reach 4.2 GHz with Max Boost enabled. This processor on its own isn't half bad, getting 3.5 out of 5 stars from us when we reviewed it but this discount makes it even more worthy of a closer look. The AMD Ryzen 7000 series is also part of the site-wide price drop. The 5.0 GHz AMD Ryzen 7 7800X3D with 3D V-Cache is listed for just $399. For a little bit less, you can find the AMD Ryzen 9 7900, a 12-core AM5 processor, priced at $354 when you use promo code GUDDQA74 at checkout. AMD Ryzen 9 7900: now $354 at Newegg (was $399)\nThe Ryzen 9 7900 comes with 12 cores and can reach up to 5.4 GHz with Max Boost enabled. This edition is unlocked for overclocking and comes with a Wraith Prism cooler. The 8000 series has the smallest discounts available, but they are discounts, nonetheless. The Ryzen 5 8600G is a 6-core CPU capable of reaching 5.0 GHz with Max Turbo enabled. Promo code GUDDQA78 will save you an extra $5 off its asking price, putting it at $224. The Ryzen 7 8700G runs a little higher at $324 when using promo code GUDDQA76 but it also comes with beefier specs to justify the price tag like 8 cores and the ability to reach speeds as high as 5.1 GHz. AMD Ryzen 7 8700G: now $324 at Newegg (was $329)\nThe AMD Ryzen 7 8700G comes with 8 cores for a total of 16 threads. It has a base clock speed of 4.2 GHz and can reach speeds as high as 5.1 GHz. This series uses AM5 sockets. There are more AMD Ryzen discounts than these across the Newegg website but hopefully, this cherry-picked list will jumpstart your research. Many of these discounts are scheduled to end by March 3rd and we aren't sure when we'll see them again. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Ash Hill is a Freelance News and Features Writer at Tom's Hardware US. She manages the Pi projects of the month and much of our daily Raspberry Pi reporting. AMD 170W Granite Ridge Zen 5 CPUs and 128W Strix Point APUs revealed in shipping manifest — 16-core 'Fire Range' mobile CPUs also coming AMD says the UCIe universal chiplet interface will create a whole ecosystem — custom multi-chiplet designs are the future PlayStation 5 Pro Enhanced requirements allegedly leaked — upscaled 4K at constant 60 FPS with ray tracing is the new target By Ash HillMarch 20, 2024 By Ash HillMarch 17, 2024 By Ash HillMarch 16, 2024 By Stewart BendleMarch 13, 2024 By Stewart BendleMarch 12, 2024 By Stewart BendleMarch 11, 2024 By Ash HillMarch 10, 2024 By Ash HillMarch 09, 2024 By Stewart BendleMarch 08, 2024 By Stewart BendleMarch 07, 2024 By Stewart BendleMarch 06, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}