{
    "title": null,
    "date": "3/22/2024",
    "url": "https://www.computerbase.de/2024-03/horizon-forbidden-west-benchmark-test/2/",
    "text": "Alle Benchmarks wurden auf einem AMD Ryzen 9 7950X3D (Test) durchgeführt, der mit den Standardeinstellungen betrieben wurde. Als Mainboard war das Asus ROG Crosshair X670E Hero (BIOS 1415) verbaut. Die CPU wurde von einem Noctua NH-D15S mit zentral installiertem 140-mm-Lüfter gekühlt. 48 GB Speicher (G.Skill TridentZ Neo, 2 × 24 GB, DDR5-6000, CL36-36-36-72) standen dem Prozessor zur Verfügung. Windows 11 23H2 mit sämtlichen Updates und aktiviertem HVCI war auf einer NVMe-M.2-SSD mit PCIe 4.0 installiert. Dasselbe galt für das Spiel. Resizable BAR wurde auf unterstützten Grafikkarten sowohl bei AMD als auch bei Nvidia sowie Intel genutzt. Die 20 Sekunden lange Testsequenz findet nach etwas über drei Stunden Spielzeit in der Open World statt. In der Nähe der Stadt Fahllicht marschiert Aloy an einem Fluss entlang. Entsprechend gibt es viele Screenspace-Reflexionen in der Testsequenz zu sehen, darüber hinaus sind auch die Sichtweite hoch und die Vegetation stark aufgeprägt. Bei der Testsequenz handelt es sich nicht um ein Worst-Case-Szenario, aber durchaus um eine überdurchschnittlich anspruchsvolle Szene. Die alte Einsteiger-Grafikkarte GeForce RTX 3060 mit 12 GB ist bei maximaler Grafikqualität in 1.920× 1.080 zwar nicht dazu in der Lage, 60 FPS in der Testsequenz zu erreichen und dasselbe gilt für Intels Arc A770, die meisten Modelle im Parcours haben damit aber kein Problem. Die GeForce RTX 3060 Ti erreicht den Wert in Full HD und auch die Radeon RX 6650 XT sowie die Radeon RX 7600 überschreiten die Marke knapp. Die Radeon RX 6700 XT liegt bereits deutlich darüber. In 2.560 × 1.440 sind unter anderem die GeForce RTX 4070 und die Radeon RX 7700 XT schnell genug dafür, in 3.840 × 2.160 gilt das in Verbindung mit DLSS Quality oder FSR Quality ab einer GeForce RTX 4070 oder Radeon RX 7800 XT. Wer auch in Ultra HD unbedingt mit nativer Auflösung spielen möchte, benötigt dann doch eine sehr schnelle Grafikkarte. Erst ab einer Radeon RX 7900 XT beziehungsweise einer GeForce RTX 4080 werden 60 Bilder pro Sekunde erreicht. AMDs Radeon-Grafikkarten kommen mit Horizon Forbidden West aktuell besser zurecht als die Konkurrenzmodelle von Nvidia. So ist die Radeon RX 7900 XTX in Ultra HD 9 Prozent schneller als die GeForce RTX 4080 Super, im AAA-Schnitt sind es sonst 2 Prozent. In WQHD steigt die Differenz auf bis zu 15 Prozent an. Auch die Radeon RX 6800 XT ist der GeForce RTX 3080 voraus. Für gewöhnlich liefern die Modelle in WQHD gleich viele FPS, in dem Open-World-Spiel ist die Radeon jedoch 14 Prozent schneller. Intels Arc-Grafikkarten laufen zwar fehlerfrei, haben aber größere Leistungsschwierigkeiten in Horizon Forbidden West. Die Arc A770 liefert 7 Prozent weniger FPS als die GeForce RTX 3060, sonst ist Intels Flaggschiff im Durchschnitt immerhin 9 Prozent schneller. Gegenüber der Radeon RX 6650 XT fällt das Ergebnis sogar sehr schlecht aus, doch liegt das viel mehr an den sehr gut laufenden Radeons anstatt der langsamen Arc. Nvidias aktuelle Lovelace-Architektur läuft in Forbidden West im Vergleich zu Ampere etwas besser als sonst. So ist die GeForce RTX 4070 in Horizon Forbidden West 2 Prozent schneller als die GeForce RTX 3080, in AAA-Spielen liegt sonst die RTX 3080 3 Prozent vorne. Anders herum sieht es bei AMD aus. So ist die Radeon RX 7800 XT mit RDNA 3 in dem neuen Spiel 1 Prozent langsamer als die Radeon RX 6800 XT mit RDNA 2, für gewöhnlich ist das neue Produkt 4 Prozent im Schnitt schneller. Maximale Grafikdetails benötigen meistens eine schnelle Grafikkarte. Wer allerdings ein eher günstiges Modell hat, muss auch mit Upsampling oft die Grafikdetails reduzieren, um ein flüssiges Bild zu erhalten. Folgende Testreihe zeigt daher Benchmarks in Full HD mit einer verringerten Detailstufe und vergleichsweise langsamen Grafikkarten. Vom maximalen Sehr-Hoch-Preset auf Hoch herunter zu schalten, ist leistungstechnisch nicht lohnenswert, mehr als wenige Prozentpunkte mehr FPS bringt dies nicht. Die mittlere Stufe erhöht die Performance deutlich mehr, hat aber auch optisch gut sichtbare Nachteile. So schön wie mit maximaler Grafik ist das Spiel dann bei weitem nicht mehr. Wenn man es genau nimmt, erreicht einzig die Intel Arc A750 nicht ganz die 60-FPS-Marke, ist mit 59,6 FPS aber so nahe an dieser dran wie nur möglich und Horizon Forbidden West lässt sich auch so ordentlich, allerdings nicht optimal, spielen. Die GeForce RTX 3060 überschreitet den Wert spielend, während die Radeon RX 6650 XT, Radeon RX 7600 und die GeForce RTX 4060 großen Schrittes Richtung der 100 FPS rendern, die Radeon RX 7600 mit knapp über 90 FPS kommt diesen am nächsten. Das zeigt, dass Horizon Forbidden West 60 FPS und mehr auch problemlos auf langsamen Grafikkarten erreicht, wenn man bereit dazu ist, auf Grafikqualität zu verzichten. Die Einschränkungen sind aber, wie bereits erwähnt, recht groß – das muss einem bewusst sein. Je nach Grafikkarte steigt die Framerate um 40 Prozent (RX 6650 XT, Arc A770) bis 45 Prozent (RTX 3060) an, wenn das Grafik-Preset um 2 Stufen reduziert wird. Horizon Forbidden West kompiliert eine Menge Shader beim ersten Starten des Spiels. Anders als die meisten anderen Titel passiert dies aber nicht mit einem Hinweis, sondern im Verborgenen. Man bekommt nicht mit, wann der Vorgang nach dem Laden ins Hauptmenü beginnt und wann dieser endet. Und das ist durchaus ein Problem. So benötigt Horizon Forbidden West auch auf einem schnellen Rechner 5 bis 10 Minuten, bis die Arbeit völlig erledigt ist. Wer vorher einen Spielstand lädt, der erhält nur die Shader für die geladene Welt fertiggestellt, alle anderen werden dann während des Spielens im Hintergrund berechnet. Das endet auch bei einer High-End-CPU in einer andauernden Stotterei. Dass Nixxes nicht per Status-Anzeige mitteilt, dass noch Shader kompiliert werden, kann eigentlich nur nach hinten los gehen, weil der erste Performance-Eindruck schnell auf einer Ruckelorgie basiert. Das sollte schnellstmöglich geändert werden. Bis dahin ist es beispielsweise möglich, mit Hilfe der CPU-Temperatur zu überwachen, ob die Arbeit bereits abgeschlossen ist oder nicht – denn die CPU hat beim Compiling jede Menge zu tun. Aber immerhin, die Wartezeit lohnt sich: Spätere Shader-Kompilierungsruckler sind der Redaktion nicht aufgefallen. Und auch Traversal-Haker (On-the-Fly-Szenenwechsel) gibt es keine, zumindest keine nennenswerten. Manchmal zeigt der Frametime-Verlaufsdiagramm an verdächtigen Stellen reproduzierbar ein unrundes Frame-Pacing, jedoch betrifft dies wirklich nur wenige Frames und diese dann auch nicht zu extrem. Den meisten Spielern wird das Nachladen der Levelabschnitte kaum bis gar nicht auffallen. Horizon Forbidden West zeigt beim Spielen sowohl auf einer AMD- als auch auf einer Nvidia-Grafikkarte ein gutes Frame Pacing. Mittelgroße oder gar große Ausreißer gibt es bei der Bildausgabe nicht, entsprechend lassen sich auch keine Haker beim Spielen spüren. Was es jedoch sowohl auf der Radeon RX 7900 XTX als auch der GeForce RTX 4080 Super gibt, sind andauernde, kleine Fluktuationen beim Frame Pacing. Bei einer ausreichend hohen Framerate sind diese keine Problem, wenn die FPS unter die 60-FPS-Marke fällt, könnten sie aber potenziell einen negativen Einfluss auf das Spielgefühl haben. Horizon Forbidden West zeigt stellenweise sehr detaillierte Texturen, dennoch ist der VRAM-Bedarf gering. Ab 12 GB gibt es auch in Ultra HD bei maximaler Grafikqualität bei einer längeren Spielzeit keinerlei Probleme mehr. Auch mit 10 GB ist Ultra HD möglich, hier können Einschränkungen bei einer längeren Spielzeit aber nicht ausgeschlossen werden. In Full HD sind potenziell auch Grafikkarten mit 8 GB schon genug. Zumindest bei einer kurzen Spielzeit zeigen sich keinerlei Einschränkungen, die jedoch bei einer längeren auftreten können. Falls es auf einer entsprechend ausgestatteten Grafikkarte hakt oder eine Textur einmal nicht nachgeladen wird, sollte zuerst die Detailstufe reduziert werden. Auch in WQHD ist man mit 10 GB auf der sicheren Seite, 8 GB ist auch hier wieder das potenzielle Problem. Besuche ComputerBase wie gewohnt mit Werbung und Tracking. Die Zustimmung ist jederzeit widerrufbar. Details im Privacy Center und in der Liste unserer Partner. Ein Widerruf ist möglich in der Datenschutzerklärung. Dieser Dialog konnte nicht vollständig geladen werden, eine Zustimmung gilt daher nur vorläufig. Blockiert ein Browser-Add-on Third-Party-Scripte? Nutze ComputerBase ohne Werbebanner, Video-Ads und Werbetracking schon für 4 €/Monat oder 36 €/Jahr. Bereits Pro-Nutzer? Hier anmelden. Tracking: Wir und unsere 165 Partner verarbeiten personenbezogene Daten, indem wir mit auf Ihrem Gerät gespeicherten Informationen (z. B. eindeutige Kennungen in Cookies) ein Nutzungsprofil erstellen, um z. B. Anzeigen zu personalisieren. Verarbeitungszwecke: Genaue Standortdaten und Abfrage von Geräteeigenschaften zur Identifikation, Informationen auf einem Gerät speichern und/oder abrufen, Personalisierte Anzeigen und Inhalte, Anzeigen- und Inhaltsmessungen, Erkenntnisse über Zielgruppen und Produktentwicklungen. "
}