{
    "title": "ZenHammer attacks can alter memory on AMD Zen 2 and 3 processors",
    "date": "3/26/2024",
    "url": "https://www.xda-developers.com/zenhammer-alter-memory-amd-zen-processors/",
    "text": "The return of a decade-old method. With computers permeating every area of our daily lives, people are keen to find new methods of attacking PC hardware. At all times, there is an arms race between cybersecurity researchers and malicious hackers who both want to find the latest exploits. The former wants to find them first so they can report it to the hardware company and get them fixed, while the latter wants to find flaws that nobody knows about for a free pass onto people's PCs. Fortunately, the researchers have won this round, as they have discovered a new flaw called ZenHammer that affects AMD CPUs and proceeded to report it to AMD. You can read all the details in the \"ZENHAMMER: Rowhammer Attacks on AMD Zen-based Platforms\" report PDF document. It's a similar style to the Rowhammer attack that was discovered 10 years ago, but this one works on DDR5 memory running alongside Zen 2 and 3 processors. Both Rowhammer and ZenHammer got their names because they \"hammer\" at the PC's memory. By attacking specific rows in the system's DRAM, it can cause neighboring rows to flip from a 1 to a 0, or vice versa. It sounds like a small change, but when done correctly, a hacker can elevate an app's permissions, or even break out of a virtual machine and spread into its host computer. Fortunately, because the researchers found this first, they were able to deliver their findings to AMD so it could prepare a fix. On top of this, the company made a statement on the AMD website: AMD microprocessor products include memory controllers designed to meet industry-standard DDR specifications. Susceptibility to Rowhammer attacks varies based on the DRAM device, vendor, technology, and system settings. AMD recommends contacting your DRAM or system manufacturer to determine any susceptibility to this new variant of Rowhammer. While an attack against your AMD-powered PCs isn't impossible, it's quite unlikely that it will happen. Right now, ZenHammer is a local attack; that means it can't be done over an internet connection. It requires the hacker to be in the same room as your PC, with the knowledge of what processor your PC uses, and reverse-engineering the RAM so they know where to strike. If this actually happened, you'll have far worse things to worry about than someone running malware on your PC.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Simon is a Computer Science BSc graduate who has been writing about technology since 2014, and using Windows machines since 3.1. After working for an indie game studio and acting as the family's go-to technician for all computer issues, he found his passion for writing and decided to use his skill set to write about all things tech. AMD made significant improvements to its APU lineup with the Ryzen 5 8600G. But is it good enough to beat the Ryzen 5 7600? If you're looking to add one of AMD's Ryzen 7000 to your system without spending a ton, check out our collection of the best budget AM5 motherboards. If you're looking for tons of storage space, this deal's going to be right up your alley. If you use two PCs as part of the same desk setup, a KVM switch could be the way to simplify your workstation. The Nvidia app beta adds cool new features, but it's still quite barebones. I recently reviewed the Ayaneo AM02 mini PC, and I turned it into a home gaming console. "
}