{
    "title": "V-Color's new RDIMM RAM for AMD Threadripper 7000 series CPUs: 768GB kits \nSTART at $4840",
    "date": "3/7/2024",
    "url": "https://www.tweaktown.com/news/96720/colors-new-rdimm-ram-for-amd-threadripper-7000-series-cpus-768gb-kits-start-at-4840/index.html",
    "text": "V-color has just unveiled its latest DDR5 OC R-DIMM series memory, which is optimized for AMD's new WRX90 workstation motherboards and CPUs. The new v-color DDR5 OC R-DIMM has been engineered from the ground up to meet the demand of new AI developers, heavy render modeling, simulation tasks, and high-end performance users. The new series comes with a new technology that targets a known issue with overclocking R-DIMM memory: high temperatures. To deal with the high temperatures, the new v-color OC R-DIMM for WRX90 features a new micro-heatsink that protects the RCD and PMIC from high temperatures without compromising room for air flow. V-color's new DDR5 OC R-DIMM has been tested with \"amazing results\" on the ASRock WRX90 WS EVO, ASUS PRO WRX90E-SAGE SE, and Super Micro motherboards. The new v-color OC R-DIMM for WRX90 memory comes in 128GB (8 x 16GB sticks) right up to a DIMM-busting 768GB (8 x 96GB sticks) with speeds ranging between 5600MHz and a higher-end 7200MHz. Overclocking the new RAM is easy, with AMD EXPO Ready support for the new v-color DDR5 OC R-DIMM for WRX90 series RAM. As for when it'll be available, the new v-color OC R-DIMM for WRX90 series is available for pre-order on v-color's official website starting March 5, while the full release happens in the next week, while availability through global distribution partners happens in the weeks after. \"The v-color DDR5 OC R-DIMM for the WRX90 series offers performance and capacity, ranging from 128GB (16GBx8) to an astounding 768GB (96GBx8). With its extensive capacity options and speeds ranging from 5600MHz up to 7200MHz, it will surely empower users to tackle the most demanding tasks with ease. Featuring new exclusively developed Micro-heatsink cooling technology directly on the RCD & PMIC Enhancing cooling efficiency, ensuring optimal thermal management under heavy workloads.\" Anthony Garreffa Anthony joined the TweakTown team in 2010 and has since reviewed 100s of graphics cards. Anthony is a long time PC enthusiast with a passion of hate for games built around consoles. FPS gaming since the pre-Quake days, where you were insulted if you used a mouse to aim, he has been addicted to gaming and hardware ever since. Working in IT retail for 10 years gave him great experience with custom-built PCs. His addiction to GPU tech is unwavering and has recently taken a keen interest in artificial intelligence (AI) hardware. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}