{
    "title": "AMD Ryzen 5 4500U vs Apple M3 Pro 12-Core vs Apple M3 Max 14-Core",
    "date": "3/27/2024",
    "url": "https://www.notebookcheck.net/R5-4500U-vs-Apple-M3-Pro-12-Core-vs-Apple-M3-Max-14-Core_11687_15115_16356.247596.0.html",
    "text": "The AMD Ryzen 5 4500U is an upper mid-range, hexa-core processor of the Renoir product family. The APU was unveiled in H1 2020; it is designed for use in thinner, lighter laptops. Its six Zen 2 CPU cores run at 2.3 GHz (base clock speed) to 4.0 GHz (highest Boost frequency possible). Ryzen 5 4500U features the Vega 6 iGPU.\nThe sole advantage of Ryzen 5 4600U over Ryzen 5 4500U is the thread-doubling SMT technology support. The former has SMT while the latter does not.\nArchitecture \nZen 2 is a resounding success, delivering massive improvements over outgoing Zen Plus-based processors. Ryzen 5 4500U is manufactured on the cutting-edge 7 nm TSMC process; it is compatible with dual-channel DDR4-3200 or quad-channel LPDDR4-4266 memory. This processor has 8 MB of Level 3 cache.\nWhile the APU uses Zen 2 cores just like the desktop-grade Ryzen 3000-series processors do, Ryzen 7 3800XT included, it does does not have PCI-Express 4.0 support. It does feature several PCI-Express 3.0 lanes for connecting discrete graphics cards, SSDs and other devices. Four PCI-Express 3.0 lanes allow for read/write rates of up to 3.9 GB/s provided a suitably fast NVMe SSD is used.\nRyzen 5 4500U gets soldered permanently on to the motherboard (FP6 socket interface) and is anything but user-replaceable.\nPerformance \nThe average Ryzen 5 4500U in our database nearly matches the Core i5-11300H, the Core i5-11320H and also the AMD Ryzen 3 5300U as far as multi-thread benchmark scores are concerned - thus delivering an undeniably impressive performance jump over the outgoing Ryzen 5 3500U.\nThanks to its decent cooling solution and a long-term power limit of 38 W, the Xiaomi RedmiBook 16 R5 is among the fastest systems powered by the R5 4500U that we know of. It can be about 20% faster in CPU-bound workloads than the slowest system built around the same chip in our database, as of August 2023.\nGraphics \nJust like its name suggests, the Radeon RX Vega 6 graphics adapter has 6 Compute Units (6 x 64 = 384 unified shaders). In the case of Ryzen 5 4500U, this graphics adapter runs at up to 1,500 MHz. The iGPU definitely supports UHD 2160p monitors at 60 Hz; it will have no trouble HW-decoding HEVC, AVC, VP9, MPEG-2 and other widespread video codecs. AV1 is not supported though; such a video will have to be software-decoded for much lower energy efficiency.\nVega 6 will let you play many titles of 2020 and 2021 as long as you stick to low settings and low resolutions. F1 2021 (720p, Low) runs at 32 fps; Outriders (720p, Low) runs at 27 fps, to give you an example or two. As the iGPU has no VRAM of its own, it is paramount that fast system RAM is used.\nPower consumption \nThis Ryzen chip is very energy efficient, as of mid 2022, thanks to the cutting-edge 7 nm TSMC manufacturing process and the mature Zen 2 architecture.\nThe Ryzen 5 4500U has a default TDP (also known as the long-term Power Limit) of 15 W that can be changed to anything between 10 W and 25 W by laptop makers if required, a right they use more often than not. Clock speeds and performance will change accordingly as a result. By going for the lowest value, it will be possible to use the APU as the heart of a passively cooled tablet, laptop, mini-PC. The AMD Ryzen 5 4500U is an upper mid-range, hexa-core processor of the Renoir product family. The APU was unveiled in H1 2020; it is designed for use in thinner, lighter laptops. Its six Zen 2 CPU cores run at 2.3 GHz (base clock speed) to 4.0 GHz (highest Boost frequency possible). Ryzen 5 4500U features the Vega 6 iGPU. The sole advantage of Ryzen 5 4600U over Ryzen 5 4500U is the thread-doubling SMT technology support. The former has SMT while the latter does not. Architecture Zen 2 is a resounding success, delivering massive improvements over outgoing Zen Plus-based processors. Ryzen 5 4500U is manufactured on the cutting-edge 7 nm TSMC process; it is compatible with dual-channel DDR4-3200 or quad-channel LPDDR4-4266 memory. This processor has 8 MB of Level 3 cache. While the APU uses Zen 2 cores just like the desktop-grade Ryzen 3000-series processors do, Ryzen 7 3800XT included, it does does not have PCI-Express 4.0 support. It does feature several PCI-Express 3.0 lanes for connecting discrete graphics cards, SSDs and other devices. Four PCI-Express 3.0 lanes allow for read/write rates of up to 3.9 GB/s provided a suitably fast NVMe SSD is used. Ryzen 5 4500U gets soldered permanently on to the motherboard (FP6 socket interface) and is anything but user-replaceable. Performance The average Ryzen 5 4500U in our database nearly matches the Core i5-11300H, the Core i5-11320H and also the AMD Ryzen 3 5300U as far as multi-thread benchmark scores are concerned - thus delivering an undeniably impressive performance jump over the outgoing Ryzen 5 3500U. Thanks to its decent cooling solution and a long-term power limit of 38 W, the Xiaomi RedmiBook 16 R5 is among the fastest systems powered by the R5 4500U that we know of. It can be about 20% faster in CPU-bound workloads than the slowest system built around the same chip in our database, as of August 2023. Graphics Just like its name suggests, the Radeon RX Vega 6 graphics adapter has 6 Compute Units (6 x 64 = 384 unified shaders). In the case of Ryzen 5 4500U, this graphics adapter runs at up to 1,500 MHz. The iGPU definitely supports UHD 2160p monitors at 60 Hz; it will have no trouble HW-decoding HEVC, AVC, VP9, MPEG-2 and other widespread video codecs. AV1 is not supported though; such a video will have to be software-decoded for much lower energy efficiency. Vega 6 will let you play many titles of 2020 and 2021 as long as you stick to low settings and low resolutions. F1 2021 (720p, Low) runs at 32 fps; Outriders (720p, Low) runs at 27 fps, to give you an example or two. As the iGPU has no VRAM of its own, it is paramount that fast system RAM is used. Power consumption This Ryzen chip is very energy efficient, as of mid 2022, thanks to the cutting-edge 7 nm TSMC manufacturing process and the mature Zen 2 architecture. The Ryzen 5 4500U has a default TDP (also known as the long-term Power Limit) of 15 W that can be changed to anything between 10 W and 25 W by laptop makers if required, a right they use more often than not. Clock speeds and performance will change accordingly as a result. By going for the lowest value, it will be possible to use the APU as the heart of a passively cooled tablet, laptop, mini-PC. The Apple M3 Pro (12 Core) is a system on a chip (SoC) from Apple for notebooks that was launched in late 2023. It integrates a new 12-core CPU with 6 performance cores with up to 4.06 GHz and 6 efficiency cores with 2.8 GHz. There is also a slimmed-down 11-core variant with a 14-core GPU. \nCompared to the M2 Pro the M3 Pro has been slimmed down somewhat and swaps two performance cores for efficiency cores. This is due to the changed core configuration, as 6 cores are now used per cluster (the M2 Pro and M3 still have 4 cores per cluster). Furthermore, the memory bus has been reduced from 256 bits to 192 bits (150 GB/s vs. 200 GB/s). However, thanks to the new architecture and higher clock rates, the new M3 Pro is still slightly faster.\nThe M3 Pro also integrates a new graphics card with dynamic caching, mesh shading and ray tracing acceleration via hardware. In the top model, all 18 cores of the chip are used and support up to 3 displays simultaneously (internal and 2 external).\nGPU and CPU can jointly access the shared memory on the package (unified memory). This is available in 18 or 36 GB variants and offers 150 GB/s maximum bandwidth (192 bit bus). \nThe integrated 16-core Neural Engine has also been revised and now offers 18 TOPS peak performance (compared to 15.8 TOPS in the M2 but 35 TOPS in the new A17 Pro). The video engine now also supports AV1 decoding in hardware. H.264, HEVC and ProRes (RAW) can still be decoded and encoded. \nUnfortunately, the integrated WLAN only continues to support WiFi 6E (no WiFi 7), unlike the small M3 SoC thunderbolt 4 is also supported (max 40 Gbit/s).\nThe chip is manufactured in the current 3nm process (N3B) at TSMC and contains 37 billion transistors (-7.5% vs. Apple M2 Pro). The Apple M3 Pro (12 Core) is a system on a chip (SoC) from Apple for notebooks that was launched in late 2023. It integrates a new 12-core CPU with 6 performance cores with up to 4.06 GHz and 6 efficiency cores with 2.8 GHz. There is also a slimmed-down 11-core variant with a 14-core GPU. Compared to the M2 Pro the M3 Pro has been slimmed down somewhat and swaps two performance cores for efficiency cores. This is due to the changed core configuration, as 6 cores are now used per cluster (the M2 Pro and M3 still have 4 cores per cluster). Furthermore, the memory bus has been reduced from 256 bits to 192 bits (150 GB/s vs. 200 GB/s). However, thanks to the new architecture and higher clock rates, the new M3 Pro is still slightly faster. The M3 Pro also integrates a new graphics card with dynamic caching, mesh shading and ray tracing acceleration via hardware. In the top model, all 18 cores of the chip are used and support up to 3 displays simultaneously (internal and 2 external). GPU and CPU can jointly access the shared memory on the package (unified memory). This is available in 18 or 36 GB variants and offers 150 GB/s maximum bandwidth (192 bit bus). The integrated 16-core Neural Engine has also been revised and now offers 18 TOPS peak performance (compared to 15.8 TOPS in the M2 but 35 TOPS in the new A17 Pro). The video engine now also supports AV1 decoding in hardware. H.264, HEVC and ProRes (RAW) can still be decoded and encoded. Unfortunately, the integrated WLAN only continues to support WiFi 6E (no WiFi 7), unlike the small M3 SoC thunderbolt 4 is also supported (max 40 Gbit/s). The chip is manufactured in the current 3nm process (N3B) at TSMC and contains 37 billion transistors (-7.5% vs. Apple M2 Pro). The Apple M3 Max 14 core CPU is a system on a chip (SoC) from Apple for notebooks that was introduced towards the end of 2023. It integrates a new 14-core CPU with 10 performance cores with up to 4.06 GHz and 4 efficiency cores with 2.8 GHz. There is also a more powerful 16-core variant with 40 GPU cores.\nThanks to the higher clock rates and architectural improvements, the processor performance is also significantly better than the M2 Max in benchmarks and can keep up with the fastest mobile CPUs.\nThe M3 also integrates a new graphics card with dynamic caching, mesh shading and ray tracing acceleration via hardware. In the cheaper model, 30 of the chip's 40 cores are used and support up to 5 displays simultaneously (internal and 4 external).\nGPU and CPU can jointly access the shared memory on the package (unified memory). This is available in 36 and 96 GB variants and offers 400 GB/s maximum bandwidth (512 bit bus). \nThe integrated 16-core Neural Engine has also been revised and now offers 18 TOPS peak performance (compared to 15.8 TOPS in the M2 but 35 TOPS in the new A17 Pro). The video engine now also supports AV1 decoding in hardware. H.264, HEVC and ProRes (RAW) can still be decoded and encoded. Like its predecessor, the Max chip offers two video engines and can therefore encode and decode two streams simultaneously.\nUnfortunately, the integrated WLAN only continues to support WiFi 6E (no WiFi 7), unlike the small M3 SoC thunderbolt 4 is also supported (max 40 Gbit/s).\nThe chip is manufactured in the current 3nm process (N3B) at TSMC and contains 92 billion transistors (+37% vs. Apple M2 Max). The Apple M3 Max 14 core CPU is a system on a chip (SoC) from Apple for notebooks that was introduced towards the end of 2023. It integrates a new 14-core CPU with 10 performance cores with up to 4.06 GHz and 4 efficiency cores with 2.8 GHz. There is also a more powerful 16-core variant with 40 GPU cores. Thanks to the higher clock rates and architectural improvements, the processor performance is also significantly better than the M2 Max in benchmarks and can keep up with the fastest mobile CPUs. The M3 also integrates a new graphics card with dynamic caching, mesh shading and ray tracing acceleration via hardware. In the cheaper model, 30 of the chip's 40 cores are used and support up to 5 displays simultaneously (internal and 4 external). GPU and CPU can jointly access the shared memory on the package (unified memory). This is available in 36 and 96 GB variants and offers 400 GB/s maximum bandwidth (512 bit bus). The integrated 16-core Neural Engine has also been revised and now offers 18 TOPS peak performance (compared to 15.8 TOPS in the M2 but 35 TOPS in the new A17 Pro). The video engine now also supports AV1 decoding in hardware. H.264, HEVC and ProRes (RAW) can still be decoded and encoded. Like its predecessor, the Max chip offers two video engines and can therefore encode and decode two streams simultaneously. Unfortunately, the integrated WLAN only continues to support WiFi 6E (no WiFi 7), unlike the small M3 SoC thunderbolt 4 is also supported (max 40 Gbit/s). The chip is manufactured in the current 3nm process (N3B) at TSMC and contains 92 billion transistors (+37% vs. Apple M2 Max). #0 checking url part for id 11687 +0s ... 0s #1 checking url part for id 15115 +0s ... 0s #2 checking url part for id 16356 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.06s ... 0.061s #6 did output specs +0s ... 0.061s #7 getting avg benchmarks for device 11687 +0.016s ... 0.077s #8 got single benchmarks 11687 +0.06s ... 0.137s #9 getting avg benchmarks for device 15115 +0.003s ... 0.14s #10 got single benchmarks 15115 +0.007s ... 0.147s #11 getting avg benchmarks for device 16356 +0.002s ... 0.149s #12 got single benchmarks 16356 +0s ... 0.149s #13 got avg benchmarks for devices +0s ... 0.149s #14 min, max, avg, median took s +0.226s ... 0.375s #15 return log +0s ... 0.375s "
}