{
    "title": "Windows 11 Update (KB5035853) Causes Performance Issues with AMD Graphics",
    "date": "3/20/2024",
    "url": "https://www.dealntech.com/windows-11-kb5035853-causes-performance-issues-amd-graphics/",
    "text": "Zaid \nMarch 20, 2024 11:32 AM\nNews Microsoft has a practice of regularly rolling out updates to Windows machines. While that is a good practice, there are times when the updates do more harm than good. A few weeks ago, for instance, an update messed up the taskbar and lock screen behavior for many people with devices running Windows 11. And now, another recent update has started to frustrate users. Microsoft rolled out the Windows 11 KB5035853 update just over a week ago. This update is part of an update cycle that Microsoft routinely maintains for fixing bugs and issues from previous updates. This update, in particular, also aimed to address some security issues on Windows. But, as it turns out, it has become a disaster for users, especially those with machines running on AMD processors. According to several reports, the update is breaking the drivers of the integrated graphics cards. As a result, users face performance issues while gaming or doing other graphic-intensive tasks. Performance bottlenecks were also observed. Handheld gaming devices and laptops seem to be the ones affected the most.  The issues do not seem to end there. Some users have even reported getting the dreaded BSOD (Blue Screen Of Death) after installing the update. All in all, this update has been a headache for many users globally. As of now, Microsoft has not acknowledged the issue. The support page with the release notes for the Windows 11 KB5035853 update says that they are unaware of any problems with this update. However, a user on Reddit has found out how to solve the issues, or at least the ones related to performance.  First of all, you need to open Windows Settings. Then, go to the Apps section. Following that, head to AMD Software. Once there, choose “Repair” and then “Reset.” Once you are done, restart the device. While the user claims it worked with their ROG Ally, you can try it with your laptop if it has an AMD chip. This method seems to be working effectively for the most part, judging by the comments on the original post. We hope Microsoft addresses this issue with the next update, likely in April. March 12, 2024 1:35 AM February 27, 2024 10:21 AM February 15, 2024 4:09 AM Your email address will not be published. Required fields are marked * Comment * Name * Email * Notify me of follow-up comments by email. Notify me of new posts by email.  Email Your Email Address Subscribe "
}