{
    "title": "China starts banning AMD, Intel, and Windows",
    "date": "3/25/2024",
    "url": "https://www.gadgetmatch.com/china-starts-banning-amd-intel-and-windows/",
    "text": "Apple M3 MacBook Air Review Nothing Phone (2a) Review Apple Vision Pro Review: Part 2 Apple Vision Pro Review: Part 1 eufy X10 Pro Omni: Ultimate Hands-Free Cleaning Under $1,000 Xiaomi Watch S3 review: There’s nothing wrong with the familiar Rise of the Ronin has a blade that cuts deep X-Men 97 is astonishing Brothers: A Tale of Two Sons Remake review: A worthy upgrade The HONOR Magic6 Pro is a bonafide speedster eufy X10 Pro Omni: Ultimate Hands-Free Cleaning Under $1,000 The HONOR Magic V2 RSR will make your heart race Apple Vision Pro: Complete Unboxing & Set Up! OnePlus 12 Unboxing Samsung Galaxy S24 Ultra Unboxing and First 24 Hours Found: Cute smartphone to match your coquette aesthetic NissanConnect makes walk around checks easier Painting a slice of life with the OPPO Reno11 Pro 5G Apple Vision Pro: Complete Unboxing & Set Up! realme C67 hands-on: A budget phone revelation Stellar Blade First Impressions Horizon Forbidden West: PC requirements revealed ROG Ally bundle: Discount, Steam credits, free earbuds Rise of the Ronin kimono jackets released Eiyuden Chronicle: Hundred Heroes First Impressions Dyson Airstrait: Hair straightening with air, not heat Filipina who created Window Garden joins Google Play program Dyson unveils ‘most intelligent hair dryer’ yet Found: Cute smartphone to match your coquette aesthetic Supersonic r: Dyson’s lightest, smallest hair dryer yet Nissan launches Note e-Power in Singapore MediaTek unleashes AI-driven chipsets for smart cars The Nissan Almera is giving ~slay~ HONOR starts car engine using AI eye-tracking on phone NissanConnect makes walk around checks easier India imposes a ban on imported laptops, tablets, and PCs Samsung overtakes Xiaomi as top phone brand in India Apple is preparing to open its first stores in India India to enforce USB-C on all phones by 2024 India might force Apple to adopt USB-C soon HONOR Pad 9 Philippine pricing, availability ROG Ally bundle: Discount, Steam credits, free earbuds These Lenovo Legion, LOQ laptops come with free monitors Globe brings roaming data packages to GCash Smart Infinity treats members to exclusive golf tournament OPPO Reno11 F 5G Singapore pricing, availability Nissan launches Note e-Power in Singapore vivo V30 now in Singapore: Pricing, availability OPPO Watch X in Singapore: Price, availability Sharp unveils new FL1X TV series in Singapore Only from government devices for now Published on By The ongoing trade war between the United States and China is putting a lot of companies out of business in one country. While all eyes are currently on America’s crusade against TikTok, China has launched a salvo of its own. The country has started banning AMD and Intel, starting with government devices. Recently, as reported by the Financial Times, China has introduced a new rule that bans American chipsets and servers from government agencies. The new ban includes AMD, Intel, and Microsoft Windows. In lieu of the now-banned brands, Chinese government agencies must use approved brands from a list of 18 Chinese manufacturers. Unsurprisingly, the list includes Huawei, another brand involved in the ongoing trade war. (Huawei is still banned on American soil.) As with bans from America, China’s latest rules stem from a desire to implement national security. Both countries allege that using brands from the opposing side will open a potential avenue for transferring classified information. Currently, the ban against the American chipsets are only affecting government devices. However, if it follows the same trajectory as Huawei and TikTok in the United States, a government-only ban might soon lead to an all-out ban on consumer devices. As TikTok is currently hanging in the balance, it’s unlikely that the trade wars will cool down anytime soon. SEE ALSO: TikTok ban bill moves closer to becoming a law New AMD chips are smaller but pack just as much power AMD bundles free ‘Starfield’ with Ryzen processors AMD announces Ryzen Z1 chips for handheld PC gaming For creating an illegal monopoly on smartphones Published on By So far, Apple’s greatest enemy has been the European Union. Months and months of claiming that the company engages in anti-competitive practices, the region has successfully caused Apple to drastically change a lot of things about the iPhone including the Lightning cable. Now, a new challenger wants Apple to answer for its supposed grip on the industry: the United States government. Today, the Department of Justice is officially suing Apple for supposedly monopolizing the smartphone industry and stifling competition. The lawsuit alleges that Apple’s lineup of products prevent users from trying out other brands. For example, Apple limits how well a third-party smartwatch works on an iPhone, pushing users to go for an Apple Watch instead. The lawsuit also includes an important pain point in Apple’s fight in Europe. It says that the company makes it difficult for iPhone users to communicate with Android users (and vice versa). Late last year, the company already committed to supporting RCS as a messaging standard, finally easing communication between the two systems. Their adoption has yet to arrive, though. Though not as stringent as Europe, the American government is no slouch when it comes to questioning its own companies for pursuing anti-competitive practices. In the past, it went through Google and Spotify to protect the interests of its citizens. The lawsuit against Apple is no different, gathering signatures from sixteen states. For Apple’s part, the company aims to get the case dismissed, alleging the lawsuit’s unfair scope of just the American people when it targets the entire world. SEE ALSO: Apple opens first Developer Center in Southeast Asia Less than two months since Gemini 1.0 Published on By With how technology is these days, it’s no surprise that the next big thing is always just over the horizon. However, these developments often happen year after year. Today, artificial intelligence is strapping a rocket to this already fast trend. Only a few months since the launch of Gemini, Google has already launched its successor, Gemini 1.5. Launched only recently, Gemini is a marvel in itself. Prior to the model, Google was already a force in the AI world with Bard. Gemini takes the former model and improves an already impressive service. Currently, users — both in business and for personal use — can subscribe to the service. Today, Google has confirmed that Gemini 1.5 is official. The company is touting how much more impressive the new version is, compared to its predecessor. For one, Gemini 1.5 Pro is just as powerful as the current Gemini Ultra, beating the latter on 87 percent of tests. The new version is reportedly more efficient in allocating only the necessary resources for queries, rather than the entire model. Despite allocating resources, Gemini 1.5 can handle a million tokens at a time. For reference, Gemini Pro can only handle 32,000 tokens at a time. Basically, the new version can parse through a humungous chunk of data all at once without batting a digital eye. (Google is claiming that capabilities for 10 million tokens is nearing, too.) If you want to see what a million tokens in the palm of your hand feels like, Gemini 1.5 is already available for developers and business users. However, a wider rollout is still coming soon. SEE ALSO: Google introduces a new AI model called Gemini As part of a massive layoff Published on By Layoffs are an unfortunate reality today. Companies are now downsizing their workforce and expenses. Now, Microsoft is the newest company to cut down its workforce. Yesterday, the company laid off 1,900 jobs from its gaming division. Given how big of a gaming juggernaut that the company is, a massive layoff consisting of almost 2,000 people is surprising. Via IGN, Microsoft CEO Phil Spencer states that it was a “painful decision.” Now, the decision doesn’t exactly detail where the company is cutting corners from. However, some internal sources have reported that the layoffs include those in customer support and physical release departments. Given how AI has disrupted human interaction, laying off a customer support department is, unfortunately, par for the course. The other unfortunate reality is the loss of a physical release department. If Microsoft did get rid of its department responsible for bringing games to brick-and-mortar stores, the company is predictably shifting to a more digital release scheme. Besides digital releases, the company also wants to rely on its Game Pass, a subscription-based service that allows users to play a mountain of games every month. Gone, sadly, will be the days when we can go to a game store and shop for physical discs on a shelf. Though digital stores offer a more convenient way to shop for games, it’s not as satisfying as buying an actual product you can feel in your hands. SEE ALSO: Microsoft accidentally reveals the next Xbox Series X For a budget-friendly price But falls short of dealing a fatal blow. We saw the first 3 episodes OPPO names BSS (Seventeen) as latest ambassadors Porsche Design Magic6 RSR is HONOR’s best flagship smartphone yet Nissan launches Note e-Power in Singapore Brothers: A Tale of Two Sons Remake review: A worthy upgrade PlayStation 5 Pro reportedly coming out later this year FFVII: Ever Crisis released for Southeast Asia, more Dyson unveils ‘most intelligent hair dryer’ yet MediaTek unleashes AI-driven chipsets for smart cars Copyright © 2020 GadgetMatch Pte. Ltd. "
}