{
    "title": "Blinded by the Light? Outdoor Illumination Tied to AMD",
    "date": "1/16/2024",
    "url": "https://www.medpagetoday.com/ophthalmology/generalophthalmology/108262",
    "text": "by\n             John Gever, Contributing Writer, MedPage Today                                \n                  January 16, 2024 Exposure to artificial outdoor lighting at night was associated with increased risk for age-related macular degeneration (AMD), Korean researchers found in a case-control study, with a pronounced dose-response relationship. When examined by degree of exposure, each jump from one quartile to the next was associated with a 67% increase in risk for new-onset exudative (\"wet\") AMD (95% CI 56-78), according to Ahnul Ha, MD, of Jeju National University in Korea, and colleagues. The risk was apparent primarily in urban areas, where individuals in the highest quartile faced a nearly 3.5-fold higher AMD incidence than those in the lowest (HR 3.42, 95% CI 2.67-4.39), the researchers reported in JAMA Network Open. \"These findings align with the increasing body of evidence that emphasizes the negative impact of OALAN [outdoor artificial light at night] on health, further implicating OALAN as a potential risk factor for [exudative] AMD,\" Ha and colleagues wrote. \"Further studies incorporating comprehensive information on exposure, individual adaptive behaviors, and potential mediators are recommended to deepen our understanding in this area.\" Also called light pollution, humans' eagerness for nighttime illumination has previously been linked to a host of adverse health effects: not merely inhibiting sleep but also contributing to obesity, cancer, cardiovascular disease, and psychiatric disorders, Ha's group noted. It made sense to take a look at AMD because light obviously affects the ocular system and, they suggested, unnatural daily rhythms in exposure may be damaging in previously unappreciated ways. Using Korea's comprehensive national insurance data, the researchers identified 4,078 who were diagnosed with wet AMD during 2010-2011; each was matched by age and sex with 30 people with no record of AMD through 2020 who served as controls. Outdoor nighttime light exposure for each case and control was estimated from satellite data for 2008-2009 with a resolution of about 1 square kilometer. Medians for light exposure within each quartile ranged from 8.1 nW/cm2/sr in the lowest to 92.7 nW/cm2/sr in the highest. The same quartile definitions were used when examining urban and rural residents separately. As one might expect, more than half of rural residents were in the lowest quartile for nighttime light exposure, whereas 41% of urban dwellers were in the highest, and another 29% were in quartile 3. There were also small but statistically significant differences between urban and rural residents for other potential factors such as traffic noise and air pollution. There was virtually no relationship between degrees of light exposure and wet AMD rates in the rural population: Ha and colleagues calculated a risk increase of just 1% per increment in exposure quartile, after adjustment for numerous covariates. Among the 10,395 rural participants in quartile 3 for exposure, wet AMD was diagnosed at a rate just 4% greater than for quartile 1 (there were only five rural residents in quartile 4, with no AMD diagnoses). For specific mechanisms by which light exposure might trigger wet AMD, Ha and colleagues suggested that retinal pigment epithelial (RPE) cells, which help maintain healthy ocular function, are a likely target. The researchers cited previous lab studies showing that ultraviolet light is lethal to these cells. Moreover, they added, \"[e]xcessive light exposure, particularly long-term blue light exposure, has been shown to disrupt mitochondrial dynamics, promote fragmentation, and cause oxidative stress, ultimately decreasing the viability of RPE cells by nearly 40%.\" Finally, Ha's team suggested that disruption in circadian rhythms may also contribute to AMD, insofar as important housekeeping functions for photoreceptors are tied to these diurnal variations. As well, animal studies have indicated that altered circadian rhythms can promote angiogenesis, the pathology underlying wet AMD. Ha and colleagues acknowledged several limitations to the study, such as the relative coarse resolution for light exposure data; the satellite data did not necessarily capture fluctuations in lighting patterns over time in a given area. Perhaps more importantly, the analysis did not address contributions from nighttime indoor light. John Gever was Managing Editor from 2014 to 2021; he is now a regular contributor. Disclosures The Korean government funded the study. Authors declared they had no relevant financial interests. Primary Source JAMA Network Open Source Reference: Kim SH, et al \"Nighttime outdoor artificial light and risk of age-related macular degeneration\" JAMA Netw Open 2024; DOI: 10.1001/jamanetworkopen.2023.51650. The material on this site is for informational purposes only, and is not a substitute for medical advice, diagnosis or treatment provided by a qualified health care provider.\n      © 2005–2024\n      MedPage Today, LLC, a Ziff Davis company. All rights reserved.\n      Medpage Today is among the federally registered trademarks of MedPage Today, LLC and may not be used by third parties without explicit permission. "
}