{
    "title": "AMD announces Radeon FSR upscaling for video playback in YouTube and VLC",
    "date": "1/8/2024",
    "url": "https://www.tweaktown.com/news/95373/amd-announces-radeon-fsr-upscaling-for-video-playback-in-youtube-and-vlc/index.html",
    "text": "NVIDIA's RTX Video Super Resolution has been out for a while, which brought a DLSS-style AI upscaling to video playback for all GeForce RTX graphics card owners. After a few months out in the wild, it received a notable version 1.5 update in October 2023 that improved image quality while adding a de-artifact feature to native resolution playback. AMD's new FSR video upscaling. As part of its CES 2024 presentation, where the company announced the new Radeon RX 7600 XT 16GB GPU, AMD also revealed that the latest Radeon Adrenaline Software update is bringing driver-based upscaling for video playback using FSR technology. In addition to this, the popular VLC video playback software is getting a Radeon-specific update in Q1 2024, adding FSR upscaling and hardware-based noise reduction. FSR-powered video upscaling arrives alongside AVC, HEVC, and AV1 video encoding improvements with RDNA 3 graphics cards - so these are two very welcome updates. With VLC already featuring RTX Video Super Resolution for upscaling, it will be interesting to see the difference in quality between the two methods - and whether or not the result will be similar to what we see when DLSS and FSR go head-to-head in games. DLSS delivers better image quality than FSR due to its reliance on AI hardware, but with FSR 2 and FSR 3 - AMD's tech continues to advance. In its pre-CES presentation, AMD showcased a single image of its FSR video upscaling, with a 720p YouTube video upscaled to 1440p - with clear improvements. However, a single image and example doesn't tell the full story. So stay tuned on that front. Kosta Andreadis Kosta is a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}