{
    "title": "AMD's \"Cheap\" Threadripper HEDT CPU: 7960X 24-Core CPU Review & Benchmarks \n| GamersNexus",
    "date": "1/2/2024",
    "url": "http://gamersnexus.net/cpus/amds-cheap-threadripper-hedt-cpu-7960x-24-core-cpu-review-benchmarks",
    "text": "AMD's \"Cheap\" Threadripper HEDT CPU: 7960X 24-Core CPU Review & Benchmarks   January 2, 2024 Last Updated: 2024-01-02 The Highlights AMD didn’t send its Ryzen Threadripper 7960X out to reviewers. We’ve already reviewed the 7980X and 7970X and bought this “cheaper” CPU for $1,500 for today’s review, and it’s a 24-core, 48-thread part that sockets into the new HEDT motherboards in socket sTR5. The CPU claims a boost clock up to 5.3GHz single-core, which would make it fast for a Threadripper CPU. By HEDT standards today, where the 7970X is $2,500, the 7960X is a “cheap” CPU. It’s still about $1,000 more expensive than a 7950X though, which itself has 16 cores. That’s a big jump in price for an extra 8 full cores, and the boards are also a huge jump in price. Although they’re not all launched yet, it looks like several of the HEDT Threadripper motherboards will be in the $1,000+ price class. But more so than the core count increase, the more significant increase with the 7960X is in I/O capabilities. It’s an interesting balance of higher frequency, still high core count, and fuller I/O options as compared to desktop parts like the 7950X or 14900K. Editor's Note: This was originally published as a video on December 11, 2023. We are now publishing it as an article with no changes. Steve Burke Mike Gaglione Patrick Lathan Vitalii Makhnovets This 24-core HEDT Threadripper part almost seems like the boring option and maybe that's why it wasn't sent out for review because in comparison to a 64-core or 32-core part, 24 just seems almost too close to normal but it's still a really potentially useful part because there are some cost reductions. Whether or not that amounts to savings for you depends on if you're actually going to leverage the CPU. But for people like us, we've taken advantage of 24-core parts. For example, we had one in one of our old editing machines instead of the 32-core processor because for Premiere, it just worked almost exactly as well and gave us all the I/O options we wanted, and it was still a little bit cheaper. We imagine a lot of people might fall into a similar situation. It is still more expensive than we’re used to. Compared to older HEDT parts, the prices have all climbed. The AMD Threadripper 7960X CPU is a 24C/48T part with 1.5MB of L1 Cache, 24MB of L2, and 128MB of L3 cache. The PPT max is still 350W, alongside TDP, and it’s fully unlocked. The CPU has four memory channels. For I/O options, the TRX50 HEDT platform offers a total of 92 PCIe lanes, or 88 usable. Maximally 48 of those can be PCIe Gen5. The platform also has options for ECC memory. If you haven't been following the Threadripper news, basically these are targeted at sort of professional users; maybe not quite in the area of pro. They've got the WRX90 platform for that, but for HEDT, you're still in that sort of enthusiast class entering workstation territory and that's what we're going to be looking at today. You can learn more about the platform and PCIe support in our writeup here. For now though, let's get into the benchmarking. Since efficiency was such a big part of the 7980X review, we’ll start with power consumption. In an all-core workload with Blender, the 7960X pulled 337W at the EPS12V rails, which had it lower than the 7980X’s 352W and 7970X’s 360W. As an aside, we measured the 7960X at 360W in Cinebench R23, so it can still stretch up to a 350W PPT, +/- a bit depending on load. For reference, the 7950X (review here) mainstream CPU pulls 251W in the same work, with the 14900K at 287W in this workload. Even though the power consumption is high in an absolute sense, what the CPU does with that power is another important aspect. Now we’ll look at efficiency in an all-core, fully-threaded workload that hits the CPU at 100%. The 7980X really impressed us here: It did phenomenally, with the best result on the chart other than prior 7950X Eco Mode results. The 12.9 Watt-hour result was so impressive that we spent a few minutes explaining the per-core power consumption in our original review, which you can watch here. The 7970X was still good, but not as impressive. It runs at a less efficient part of the volt-frequency curve, and that extends to the 7960X as well. The 7960X also did fine at 25.9 Watt-hours, ranking it ahead of most mainstream CPUs (but not all -- the 5950X and 7800X3D remain extremely efficient chips). Intel has a lot of ground to gain here. Now we’re going to move into SpecWS benchmarking. These are excellent benchmarking tools that help represent biomedical, financial industries/services, and life sciences (things like heart and medical imaging). While we’re not doctors and medical researchers and aren’t super close to the data as a result, our viewers have commented that these benchmarks are very helpful, so we’re including them here. First up for Spec is the Product Development category of testing, which includes computational fluid dynamics benchmarks. In this one, the 7960X performed impressively in some tests even in spite of the heavily reduced core count. WPC_CFD is based on OpenFOAM’s combustion CFD solver. The 7960X scored 13.65 points here, putting it close in performance to the 7970X and 7980X, relatively speaking. The scaling isn’t that favorable for the higher core count Threadripper parts, but is favorable enough to establish a large gulf between the 7960X and the mainstream desktop parts. The Rodinia CFD solver tests scale more cleanly, with the 7980X leading the 7970X by 62%, which itself leads the 7960X by 33%, but the 7960X (and 7970X) were outperformed by the 14900K in this test, with the 7960X also outperformed by AMD’s 7950X. The CalculiX testing had the 7960X at 5.12, leading the mainstream Intel part by 34%. Next up are the Spec Life Sciences & Biomedical tests. These tests look at LAMMPS, which Spec.org says “is a molecular dynamics simulator that consists of five tests simulating a variety of molecular properties,” NAMD, which also runs molecular interactivity tests, and RodiniaLifeScience, which does heart wall medical imaging, among other tests. In this suite, the 7980X leads the 7970X by 30%, which itself leads the 7960X by 16%. The 7960X holds a significant advantage over the mainstream desktop parts and prior Threadripper CPUs alike for LAMMPS, at 71% improved over the 14900K. For NAMD, we observed limited scaling against the 7970X, but still a significant gain against the 14900K. The 3970X did particularly well in this test previously. NAMD also posted significant scaling favoring the 7980X as compared to the LAMMPS and Rodinia tests here. Now for the financial services & probability tests, where Spec Workstation runs Monte Carlo simulations, Black-Scholes pricing, and binomial options pricing tests. While we don’t necessarily understand any of the real-world applications for these financial workloads beyond running the test, many people seemed to appreciate this particular test in our last review. The scaling is excitingly clean overall. The 7980X gaps everything, holding a 60% lead over the 7970X. The 7970X’s lead over the 7960X is 27%, which itself rests closer to the 3970X in some of the prior tests. The 14900K is at the bottom of this particular chart. In the Spec Energy test, the application tests for seismic data processing with SRMP algorithms, a convolution filter with a 100x100 random filter on a 20K x 20K pixel image, and more. Here, the 7960X ranked third by convolution again, although its convolution result is only barely ahead of the 3970X. It’s interesting to see them at about parity despite the core difference -- architecture and frequency definitely count for something. The FFTW results had the 7980X massively ahead, so core scaling is strong there. The 7960X was relatively close to the 7970X, but far ahead of the 3970X. The Poisson result had it behind the 3970X and 3960X. This next section will use our standardized suite of production benchmarks. These benchmarks include Adobe Premiere, Adobe Photoshop, Blender Cycles rendering on the CPU, code compile, compression & decompression via 7-Zip, and more. Now we’re moving to our standard suite of production tests. Starting with Blender, we have some fun stats to add: The 7995WX came through our lab for an extreme overclocking live stream, which you should absolutely check out on our YouTube channel because it was hugely educational. The 7995WX with liquid nitrogen and an extreme overclock set the mark for the best performance we’ve ever seen in this test, at 1.2 minutes. The stock result was about 2.1 to 2.2 minutes, but wasn’t 100% comparable due to some differences in test setup as it was AMD’s engineering team on-site helping run it. Back down on earth though, the 7960X required 4.6 minutes to run Blender, so it allows the 7970X an improvement in the way of 1 minute -- or 22% time reduced. We always do our chart calculations in the direction of improvement, so in this instance, improvement is a % time reduction. We don’t flip the axis and invert it to a rate (or renders per unit of time), but instead use the base metric of time. The 7980X required 2.2 minutes to complete the render, an improvement of 52% time reduced from the 7960X. That’s a big jump. Even for those using EVEE with CUDA, it’s impressive to see how much can be done with CPU cores. The relevant desktop parts would be the 7950X, marked at 6.4 minutes, and the 14900K at 7.3 minutes. Respectively, these allow the 7960X an advantage of 28% and 37% time reduced. The 7960X manages to offer benefits over the mainstream desktop parts beyond IO in several of these tests for those who can make use of its capabilities. Chromium code compile is next. This is like Blender: Smaller bars are better and we don’t invert the axis to a rate, but use the base metric of time without abstractions away. The 7980X’s 31.4-minute result has it running at 27% time reduced against the 7970X, which itself reduces the time requirement to complete the compile by 16% over the 7960X. The 14900K required 71 minutes to complete this compile, with the 7950X basically the same. The result of the HEDT 7960X against these parts, assuming a 71-minute average, is 28% time reduction. The 3970X is still hanging in there at about 60 minutes, sticking close to the 7960X and still establishing a gap against the 7950X and 14900K. 7-Zip is up now. These tests are measured in millions of instructions per second, or MIPS. For decompression, the 7960X ran 388K MIPS, allowing the 7970X a lead of about 29%, with the 7980X in a similar spot. We’re limited in headroom this high up. The 7960X performed similarly to the 3970X, but had a more drastic lead of 41% over the desktop 7950X part, or 66% over the 14900K. In compression, the 7980X sets the ceiling at 393K MIPS, followed closely by the 7970X at 352K MIPS, and then the 7960X at 288K MIPS. The 7970X leads the 7960X by about 22%, with the 7960X leading the 7950X non-3D by 50% (which is near the 14900K). That’s a big gap between this lower-end HEDT part and the best desktop parts. In Adobe Premiere and looking first at aggregate score with the Puget bench, the 7960X scored 913 points -- just behind the 7970X and functionally tied. That has it ahead of the 7950X, 14900K, and everything else. IGPs can help Intel in some aspects of Premiere, but there’s still value in brute-force CPUs (just to a limit). Looking at the RAW sub-score for RAW footage processing, the 7960X retains its second-place rank. The lead over the 14900K, the next CPU, is about 9%. Threadripper does pretty well with RAW footage processing, but the cost efficiency still rests with the desktop parts. Looking at the Intraframe video score, the 7960X does exceptionally well here and ties the 7970X. Both CPUs establish a clear lead over the next CPUs, which themselves are led by the 7950X. Unfortunately, as we saw last time, Threadripper doesn’t do particularly well in the comparative for Photoshop. It’s not bad, but purely against alternatives, it’s an expensive and under-utilized CPU. Photoshop just isn’t threaded this way. The 7960X is ahead of the 7980X and behind the 7970X, with this chart being led by more mainstream CPUs like the 7700X or 13900K. Before we dive into the gaming benchmarks, it’s worth noting that these HEDT CPUs aren’t intended for gaming as their main use-case. What we will be looking for is whether or not there are any massive problems here that cause games to be unplayable. In Cyberpunk: Phantom Liberty at 1080p, the 7960X ran at 135FPS AVG. That has it just between the 7980X and 7970X. The lows are timed almost exactly with the other new Threadripper CPUs. If you’re planning to use a 7960X CPU for work, at least so far, it wouldn’t be a buggy mess in gaming. At 1440p in Phantom Liberty, the 7960X’s 135FPS AVG keeps it again about tied with the other new Threadripper CPUs, and more than capable of at least running the game well, despite not being a top performer. In Stellaris for CPU simulation time, the 7960X required 44 seconds to complete the simulation. That had it about tied with a 5600X. The 7980X and 7970X did better on a technicality, but ultimately, these CPUs aren’t able to leverage their cores in a meaningful way here. They’re still acceptable performers if gaming is a secondary use case. In Baldur’s Gate 3 at 1080p, the 7960X ran at 90FPS AVG and again had good frametime pacing. The CPU was just behind the 7970X and 7980X, but realistically, all 3 of these are roughly tied. And from a practical standpoint, you’d never notice a difference. Rainbow Six Siege was buggy and couldn’t launch with our 7980X previously. We’re not sure if that’s been fixed, but we ran the 7960X through it successfully. The framerate is overall impressive, still managing 547FPS AVG. The 1% lows are worse than a 13600K, but not in a way that anyone would realistically care about. At least, not any of the target audience for the 7960X. Now we’ll briefly look at frequency. AMD advertises a maximum single-core frequency of 5.3GHz. With a single-threaded Cinebench run, we measured this frequency for the 7960X. The CPU held about 5340MHz for the entire test. It’s technically slightly above spec. We had no issues maintaining this single-core frequency in our testing. Our previous review had the 7980X at about 4800MHz single-core, so this is a lot higher for lower threaded applications. For all-core frequency, the 7960X ran in the 4600-4700 MHz range. We were between 0-5% away from PPT max, so this was a fully loaded test. Frequency dropping from the single-core high is expected. The 7980X was closer to 3.9-4GHz all-core in our previous review, again marking the 7960X much higher in trade for its position on the volt-frequency curve for efficiency. The 24-core AMD Ryzen Threadripper 7960X can make sense as a “cheap” or “economical” workstation that gets you access to more PCIe lanes/storage compared to a mainstream CPU. With it, you’ll get most of the performance of the 7970X, the 32-core part, for a bit less money. Now, in applications that scale more linearly with cores, then obviously that jump widens. But for, say, an Adobe Premiere user, it can make sense. Piggybacking off our past, subjective experience configuring a Premiere workstation, we found our old Threadripper rig to be one of the most reliable systems we’ve used for that purpose. It did have a limit.  At the time, we found it worked best with the 3960X in balancing out frequency and core count. Anyone who uses Adobe Premiere knows how much of a nightmare it can be; your experience can change almost on a day-to-day basis. There doesn’t seem to be a good way to measure how this feels as a user, unfortunately. If you can get more core scaling in the applications you use, like the SpecWS stuff we highlighted above, then the 32-core 7970X or the 64-core 7980X  might be worth considering carefully. Some instances in which we saw notable uplift were in SpecWS’ financial services benchmarks, where cores scale well. If you’re looking to primarily use the 7960X for gaming, then you should buy a different CPU. While we didn’t encounter any major problems running it through our suite of gaming benchmarks, we didn’t test every game and it would only make sense to get the 7960X here if you’re planning to run heavily multi-threaded applications on the side. Copyright © 2023 GamersNexus, LLC. All rights reserved.GamersNexus.net is Owned, Operated, & Maintained by GamersNexus, LLC. Copyright © 2023 GamersNexus, LLC. All rights reserved.GamersNexus.net is Owned, Operated, & Maintained by GamersNexus, LLC. "
}