{
    "title": "AMD Stock Price Prediction in 2030: Bull, Base & Bear Forcasts",
    "date": "1/11/2024",
    "url": "https://247wallst.com/investing/2024/01/11/amd-stock-price-prediction-in-2030-bull-base-bear-forcasts/",
    "text": "Before its NYSE IPO in September 1979, Advanced Micro Devices Inc. (NASDAQ: AMD) traded over the counter for 7 years. AMD stock was traded publicly on the New York Stock Exchange until January 2015, when they were moved to the Nasdaq. The company got its start in 1969 by becoming a second source of chips for Fairchild Semiconductor, the company that had spawned Intel Corp. (NASDAQ: INTC) in 1968. The company reverse-engineered Intel’s 8080 CPU in 1975 and licensed Intel’s microcode for the chip in 1976. In 1982, AMD and Intel signed a 10-year deal giving AMD the right to be a second source for the new x86 line of microprocessors. After weathering two downturns in the chip markets, AMD acquired graphics card maker ATI in 2006. The company now operates in four segments: data center, client, gaming, and embedded. In early December, AMD launched the next generation of its MI300 accelerator chips, the MI300X GPU and the MI300A APU. The company has forecast $2 billion in revenue this year from these new chips, adding about 8.8% to its sales total. CEO and chair Lisa Su took over in 2014 and registered its first profit under her leadership in 2018. AMD almost doubled its R&D spending in fiscal 2022, reducing its profit by more than half for the year. While the share price is up more than 125% over the past 12 months, the big jump came after the AI announcement in December.       Fiscal years 2020 and 2021 benefited from stay-at-home orders related to the COVID-19 pandemic. The data center, client, and gaming had a tough first half of 2023. Sales are forecast to improve year-over-year in the fourth quarter, but annual revenue is expected to fall short of 2022’s level. Our predicted prices for AMD stock in 2030 are $300 ‌(base), $880 (bull), and $150 (bear). We’ll break down each of these scenarios in more detail below. AMD is counting on a boost from its latest challenger to Nvidia Corp.’s (NASDAQ: NVDA) domination of demand for AI training models. The Instinct MI300X and MI300A processors, introduced in December, are only part of the story. The next part is the Ryzen 8040 Series of AI-enabled processors for desktop machines. Those were launched in early January at CES 2024. Nvidia also announced upgraded performance for its desktop AI chips at CES 2024. Nvidia’s top-of-the-line GeForce RTX 4080 Super goes on sale in late January for $999. AMD’s fastest chip, the Ryzen 7 8700G, sells for $329. Intel’s Core Ultra family, introduced in the fall, is already shipping in some laptops. A Core Ultra 9 equipped with a GeForce RTX4070 sells for around $2,300 at Best Buy. Investors are rewarded by AMD only if the share price rises because it does not pay a dividend. Current estimates for sales growth are right around 17% through 2027. The company’s forward price-to-earnings (P/E) multiple is nearly 160x compared to an industry average of about 20x. For comparison, Nvidia currently trades at a P/E multiple of about 240x. Street estimates project revenue of around $67.6 billion in 2030. Using a discounted cash flow model, AMD’s stock should cost about $31.00, indicating shares are currently overvalued by around 80%. Following that calculation through 2030, the stock price should be around $61.00 seven years from now. The stock currently trades at around $147.00. While this is what the numbers say, it may not be the whole story. The era of desktop AI is even newer than the large language AI models introduced just over a year ago. Our guess: AMD’s stock price could double between now and 2030. That suggests a share price of around $300 as the base case. AMD’s current valuation does not take into account what may be called “animal spirits,” or more in keeping with current usage, FOMO, or fear of missing out. Over the past 7 years, AMD stock is up by nearly 1,100%, and trades near its peak, reached in November 2021. Nvidia’s stock gained 850% over that same period, and Intel gained about 27%. Will AMD add another 1,100% over the next 7 years? Who knows? The stock could gain about half that if it can maintain its current price-to-sales (P/S) ratio of around 6x. That pencils out to a share price of around $880, and that’s our wildly bullish case for AMD stock. The bear case for AMD is unlikely to reach the fair value of around $61 calculated for 2030. That’s a drop of 2.5x. For that to occur, everything that could go wrong does go wrong. That includes AI turning from a boom to a bust, AMD missing the next big thing, and some unknowable exogenous event that sends markets into an unrelenting tailspin. Barring such a confluence of bad performance, the stock should do no worse than hold its own. Thus, our bear case for AMD stock will settle on a forecast of around $150. No Commission Fees, No Minimums, No Velvet Ropes. (Sponsored) Robinhood revolutionized commission free investing, and it continues to do so today. With a few simple taps you can trade stocks like Nvidia and Amazon, market beating mutual funds, and trade options with Robinhood Financial. FDIC insurance coverage is just another benefit. And, you can buy and sell cryptocurrencies like Bitcoin (BTC), Ethereum (ETH), and Dogecoin (DOGE) with Robinhood Crypto. Sign up today — click here to start your journey. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}