{
    "title": "AMD's Record High Shows AI-Fueled Chip Rally Has Another Gear",
    "date": "1/19/2024",
    "url": "https://finance.yahoo.com/news/amd-record-high-shows-ai-154023189.html",
    "text": "(Bloomberg) -- Advanced Micro Devices Inc. is on track for its best week since November, outpacing even AI-darling Nvidia Corp., as optimism builds anew around the semiconductor industry’s growth prospects. Most Read from Bloomberg Russia Says Ukraine Downed Plane Carrying Prisoners for Swap Trump Races Toward 2024 Biden Rematch After New Hampshire Win Apple Dials Back Car’s Self-Driving Features and Delays Launch to 2028 Billionaire Joe Lewis Pleads Guilty in Insider Trading Case Ackman Ramps Up Israel Support With Stake in Tel Aviv Bourse AMD shares closed at a record high on Thursday and rose again in early trading Friday. They’re up roughly 65% since October, handily beating both Nvidia and the Philadelphia Semiconductor Index in that period. AMD has surged roughly 12% this week, outpacing a nearly 6% leap for Nvidia, which is also climbing Friday and set an all-time high Thursday. Investors see huge growth potential for chips and expect that Nvidia “won’t be the sole winner,” said David Wagner, a portfolio manager at Aptus Capital Advisors. “Investors are looking for a catch-up trade” after Nvidia’s stellar performance in the past year, he said. Semiconductor shares got a boost overall on Thursday from better-than-expected fourth quarter results from Taiwan Semiconductor Manufacturing Co. The main chipmaker for Apple Inc. and Nvidia said it expects revenue growth of at least 20% for the year, after a slump in 2023. Read more: TSMC’s Outlook Backs Hopes for Global Tech Recovery in 2024 AMD shares got a lift early this week when analysts at firms including Barclays Plc, Susquehanna Financial and TD Cowen boosted their price targets. Of those three, Barclays now has the highest target at $200 per share, raising it from $120 on the potential for artificial intelligence as a driver. The stock traded as high as $167 on Friday. More than 70% of analysts covering AMD have a buy-equivalent rating, data compiled by Bloomberg show. Read more: AMD CEO Debuts Nvidia Chip Rival, Gives Eye-Popping Forecast Risks Ahead In a sign of how the Street has struggled to keep up with the stock’s ascent, the average 12-month price target of around $150 implies a drop of about 9%. Some of that gap is due to AMD’s recent rally - the stock price only overtook the average analyst price target in December after months below the level. Analysts can also be slow to update target prices and ratings, especially in the weeks before an earnings release. Both AMD and Nvidia have upcoming earnings reports that will give investors a sense of their growth outlook for the year ahead. AMD releases results on Jan. 30, and Nvidia in late February. The reason Nvidia has surged so much and continues to be a favorite is its booming revenue growth, which gives it a cheaper valuation than many peers. Nvidia trades at about 28 times forward earnings, a premium to the semiconductor share benchmark at about 23. AMD trades at a multiple of more than 40. “Those stocks are more than fully valued at this point, especially AMD,” said Alec Young, chief investment strategist at MAPsignals, adding that AMD has more to prove because earnings haven’t come through yet. “It’s not a good setup for the bulls right now.” If the rally in chipmakers fades, it could present an opportunity to those who are bullish on AI’s long-term prospects, Young said. “These are definitely stocks you want to buy on any weakness, but just tactically you probably don’t want to chase them here today,” he said. Still, the sector’s strength to start the year shows that the enthusiasm around AI that propelled chipmaker shares and the tech sector in 2023 hasn’t faded, even as a rally in the S&P 500 Index appears to have stalled. “If you believe in AI then you believe in the broadening of the opportunity — it’s not just one or two companies that are going to take that share,” said Will Rhind, chief executive officer of GraniteShares. “This is just reinforcing the narrative that AI has a lot more room to run.” Tech Chart of the Day Another dismal week for Chinese equities saw grim milestones pile up. Hong Kong’s Hang Seng Tech Index, which hosts the likes of Tencent Holdings Ltd., Alibaba Group Holding Ltd. and Xiaomi Corp., is already down 17% in 2024 after three straight years of losses. The index has seen about $1.8 trillion wiped out since a February 2021 peak. Top Tech News Apple Inc.’s long-awaited Vision Pro mixed-reality headset will finally be available for preorders on Friday, giving the company its first real taste of consumer demand for the $3,499 device. Apple vowed to open up its coveted tap-to-pay technology on iPhones to rivals in a bid to sidestep potentially massive European Union antitrust fines. Amazon.com Inc.’s proposed $1.4 billion acquisition of Roomba maker iRobot Corp. is expected to be blocked by the European Union’s antitrust regulator over concerns that the deal will harm other robot vacuum makers. When fast fashion giant Shein firmed up plans for a US initial public offering late last year, the online retailer hoped that it wouldn’t be subjected to regulatory review in China. Paytm trimmed losses in the latest quarter after the Indian fintech company cut costs and scaled up services to small merchants. Most Read from Bloomberg Businessweek Goldman, Lazard Look to Ex-Spies to Gain an Edge in Volatile World Stuck in a Downturn, Startups Ghost Investors It’s the Tesla Earnings Call—Time for Elon Musk Bingo Hong Kong’s High Rents Create a New Type of Cross-Border Commuter Can America’s New Union Hero Take on Elon Musk’s Tesla? ©2024 Bloomberg L.P. Related Quotes "
}