{
    "title": "AMD RX 7600 XT promises '1080p and beyond' for under $350",
    "date": "1/9/2024",
    "url": "https://www.windowscentral.com/hardware/cpu-gpu-components/amds-radeon-rx-6700-xt-sets-its-sights-on-60-of-steam-gamers",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Almost 60% of Steam gamers have a primary display with a resolution of 1080p. AMD unveiled the Radeon RX 7600 XT at CES 2024 this week. The graphics card provides an affordable way to get the latest from AMD in the midrange. The RX 7600 XT is aimed at \"1080p and beyond\" for a starting price under $350. AMD lists an SEP of $329, but since there isn't a reference card of the RX 7600 XT, pricing will vary a bit. CES isn't just about wacky products and devices that max out spec sheets, though we've seen plenty of those this week. There are midrange components announced at the event as well. That's the case with the RX 7600 XT, which is better than its predecessor in several key ways but is not going to play the best PC games at max settings. AMD is making a value play with the RX 7600 XT. It should easily handle the best PC games at 1080p, but it can take things further, thanks to some of its features. AMD FidelityFX Super Resolution 3, and AMD HYPR-RX with AMD Fluid Motion Rates should let you play many titles at 1440p. AMD promises up to 1.9x faster gaming and ray tracing performance from the RX 7600XT when compared to the NVIDIA GeForce RTX 2060. Compute units: 32\nAI Accelerators: 64GB\nGDDR6: 16GB\nGame clock: 2.47GHz\nBoost clock: 2.76GHz\nInfinity cache: 32MB\nTDP: Starting at 190W While there are gaming rigs that can power 4K, or even 8K, gaming. Those aren't very common. It's fun to cover the biggest and most powerful components that come out, but the reality is that most gamers have more reasonably priced PCs. \"Discerning gamers around the world are looking for a simple goal of smooth lag-free gameplay at affordable prices to enjoy the most of their gaming experience. Today, the Radeon RX 7600 XT graphics card delivers on that goal,\" said Senior Vice President and GM of the Computing and Graphics Group at AMD, Jack Huynh. Almost 60% of Steam gamers have 1920 x 1080 as their primary display resolution, according to the latest Steam hardware survey. That same survey shows that 10.26% of gamers have systems with an NVIDIA GeForce RTX 3060, but the second and third spots are older GPUs. The NVIDIA GeForce GTX 1650 is used by 9.08% of Steam gamers and 7.52% of Steam gamers use an NVIDIA GeForce GTX 1060. All the latest news, reviews, and guides for Windows and Xbox diehards. The NVIDIA GeForce 2060 that AMD referenced in its announcement of the RX 7600 XT accounts for 7.18% of Steam gamers. The comparison was made using select titles, of course, but the latest Steam hardware survey shows the value in comparing a GPU to the RTX 2060.  If you stick to 1080p gaming, the RX 7600 XT should run like a champ. It has 16GB of VRAM, a TGP of 190W, a game clock speed of 2.47GHz, and a boost clock speed of 2.76GHz. Features like AMD FidelityFX Super Resolution 3, AMD HYPR-RX with AMD Fluid Motion Rates let you push settings up to 1440p on selected titles. \"The AMD Radeon RX 7600 XT graphics card also has the ability to hit 1440p resolutions as well with advanced features like FSR 3 AMD Fluid Motion Frames,\" said Dave Altavilla from HotTech Vision and Analysis to AMD. The RX 7600 XT will be available from Acer, ASRock, ASUS, Gigabyte, PowerColor, Sapphire and XFX starting on January 24, 2024, so we won't have to wait long to see real-world performance tests and benchmarks from various users. Sean Endicott brings nearly a decade of experience covering Microsoft and Windows news to Windows Central. He joined our team in 2017 as an app reviewer and now heads up our day-to-day news coverage. If you have a news tip or an app to review, hit him up at sean.endicott@futurenet.com. Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}