{
    "title": "Up More Than 2x In 2023, Is AMD A Better Pick Over Union Pacific Stock?",
    "date": "1/23/2024",
    "url": "https://www.forbes.com/sites/greatspeculations/2024/01/23/up-over-2x-in-2023-is-amd-a-better-pick-over-union-pacific-stock/",
    "text": "ROUND ROCK, TEXAS - APRIL 21: A Union Pacific freight train is seen traveling on April 21, 2023 in ... [+] Round Rock, Texas.  (Photo by Brandon Bell/Getty Images) Given its better prospects, we believe AMD stock (NYSE: AMD) is a better pick than Union Pacific stock (NYSE: UNP). Although these companies are from different sectors, we compare them because they have a similar revenue base of around $22 billion to $24 billion. The decision to invest often comes down to finding the best stocks within the parameters of certain characteristics that suit an investment style. The size of profits can matter, as larger profits can imply greater market power. Since these stocks are from different sectors, comparing P/S against one another may not be helpful. We compare their current multiples with the historical ones in the sections below to better gauge their valuations. In the sections below, we discuss why we believe that AMD will offer better returns over UNP in the next three years. We compare a slew of factors, such as historical revenue growth, returns, and valuation, in an interactive dashboard analysis of Union Pacific vs. AMD: Which Stock Is A Better Bet? Parts of the analysis are summarized below. UNP stock has witnessed gains of 15% from levels of $210 in early January 2021 to around $240 now, while AMD stock has seen extremely strong gains of 95% from levels of $90 to around $175 over the same period. This compares with an increase of about 30% for the S&P 500 over this roughly three-year period. However, the increase in UNP and AMD has been far from consistent. Returns for UNP were 21% in 2021, -18% in 2022, and 19% in 2023, while the returns for AMD were 57% in 2021, -55% in 2022, and 128% in 2023. In comparison, returns for the S&P 500 have been 27% in 2021, -19% in 2022, and 24% in 2023 - indicating that UNP underperformed the S&P in 2021 and 2023 and AMD underperformed the S&P in 2022. In fact, consistently beating the S&P 500 - in good times and bad - has been difficult over recent years for individual stocks; for other heavyweights in the Industrials sector including CAT, GE, and UPS, and even for the megacap stars GOOG, TSLA, and MSFT. In contrast, the Trefis High Quality Portfolio, with a collection of 30 stocks, has outperformed the S&P 500 each year over the same period. Why is that? As a group, HQ Portfolio stocks provided better returns with less risk versus the benchmark index, less of a roller-coaster ride, as evident in HQ Portfolio performance metrics. Given the current uncertain macroeconomic environment with high oil prices and elevated interest rates, could UNP face a similar situation as it did in 2021 and 2023 and underperform the S&P over the next 12 months - or will it see a strong jump? While we expect both stocks to trend higher, AMD will likely outperform UNP. 1. AMD’s Revenue Growth Is Better   2. Union Pacific Is More Profitable   3. The Net of It All   Stock Return Forecastt - UNP vs. AMD While AMD may outperform UNP in the next three years, it is helpful to see how Union Pacific’s Peers fare on metrics that matter. You will find other valuable comparisons for companies across industries at Peer Comparisons. UNP & AMD Return Compared With Trefis Reinforced Portfolio Invest with Trefis Market Beating Portfolios See all Trefis Price Estimates  "
}