{
    "title": "Why AMD Stock Remains a Strong Buy Amid AI Mania",
    "date": "1/17/2024",
    "url": "https://investorplace.com/market360/2024/01/why-amd-stock-remains-a-strong-buy-amid-ai-mania/",
    "text": " There's plenty of substance backing the latest wave of enthusiasm for AMD stock Advertisement Source: JHVEPhoto / Shutterstock.com As seen with other popular AI plays, excitement for Advanced Micro Devices (NASDAQ:AMD) stock has accelerated to price levels not seen since 2021 thanks to growing excitement about the generative AI growth trend. That’s exciting news, for those already holding this stock. If the rising shares make you hesitant, I understand. Although there are investors who like stocks with strong positive momentum, for others such moves could appear to be unsustainable. Thus, too risky to consider buying. Yet while it’s clear that there’s a resurgence in “mania” for this stock at present, don’t assume it’s just hype backing this run-up. There’s plenty of substance too, as I’ll explain below. After ending 2023 on a high note, Advanced Micro Devices shares have stayed on an upward trajectory. It doesn’t hurt that the market’s enthusiasm for AI stocks overall has kept climbing, but investors are also becoming excited in particular about AMD’s growth potential in the AI chips market. Expectations are rising that AI chip sales in 2024 will come in considerably higher than management’s own forecasts. As I’ve pointed out in past coverage of AMD stock, CEO Lisa Su has forecasted $2 billion in sales this year for the company’s Instinct MI300 AI-compatible accelerators. However, several analysts have forecasted sales substantially higher than this figure. Just recently, one analyst (KeyBanc’s John Vinh) argued that demand for the MI300 could be as much as $8 billion. For reference, estimates call for AMD’s entire revenue for 2023 to come in at around $22.7 billion. With this, you can imagine how much just coming close to this latest sales forecast could have on the company’s results this year. Better yet, it’s not as if Advanced Micro Devices is poised to experience a big growth surge this year, with growth tapering off in the years that follow. Far from it, in fact. During 2023, AMD stock gained around 127.6%. As this big jump in price outpaced increases in profitability, last year’s rally also resulted in pushing Advanced Micro Devices to what some may consider a pricey valuation (59.8 times earnings). Value-conscious investors may be worried about AMD being “priced for perfection,” even when considering the potential for MI300 sales coming in leaps-and-bounds above the $2 billion guidance from Dr. Su. Again though, while AMD could really knock it out of the park with this product, that’s only the start. AMD’s upcoming Ryzen 8040 “Hawk Point” processors for laptops is another high-potential AI chip product in AMD’s pipeline. AMD CFO Jean Hu has conceded that consumer AI chip sales won’t be a big factor in the company’s 2024 results. Still, consumer growth could be key in helping the company sustain growth in 2025 and beyond. Add to this the strong likelihood that Advanced Micro Devices has other promising AI chip-related news to unveil throughout the year, don’t discount the potential for this stock to not only sustain last year’s gains, but add to them, although maybe not to the extent seen last year. Only time will tell whether AMD doubles in price this year, but another year of strong returns remains well within the realm of possibility. Right now, analysts on average anticipate the company to report earnings of just over $4 per share this year. However, these forecasts range widely. Some analysts estimate earnings call for earnings of $5 or even $6 per share. Hitting such levels would undoubtedly support a further move higher, even if the stock experienced a moderate de-rating in its forward valuation. After big earnings growth in 2024, the emergence of a consumer AI chip market in 2025 could keep the company in high-growth mode. Considering these factors, it’s clear that you don’t need to fear the “mania” if you’ve mulling entering an AMD stock position. Feel free to buy in at current prices. AMD stock earns an A rating in Portfolio Grader. On the date of publication, neither Louis Navellier nor the InvestorPlace Research Staff member primarily responsible for this article held (either directly or indirectly) any positions in the securities mentioned in this article. Artificial Intelligence, Semiconductor, Technology   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/01/why-amd-stock-remains-a-strong-buy-amid-ai-mania/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Stocks to Buy Market Analysis Stocks to Sell Stocks to Buy Stocks to Sell Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}