{
    "title": "AMD's FPGA Plans, Linux And Cars",
    "date": "1/5/2024",
    "url": "https://pcper.com/2024/01/amds-fpga-plans-linux-and-cars/",
    "text": "Posted by Jeremy Hellstrom | Jan 5, 2024 | General Tech | 0 AMD has some plans for 2024 which include APUs and FPGAs for automotive usage, as well as improving the Linux kernel’s FPGA manager subsystem.  The V2000A is based on Zen 2 with six cores, along with a Vega 7 iGPU.  Those parts are certainly not new, but are inexpensive and reliable not to mention significantly more powerful that the chips currently being used in most cars.  AMD is hoping this will attract auto makers looking to power the next generation of onboard infotainment displays. Along with the Zen chip are new FPGAs specifically designed to handle the cameras which are now standard on many cars, as well as LIDAR, automatic parallel parking and other features which cards now feature.  They won’t be up to competing with NVIDIA’s AI chips, but that is not the market segment they are looking for.  Instead they are looking to increase their share of the inexpensive components which power your car, by offering more powerful silicon than the competition. That is not the only trick AMD plans with their FPGA products, the AMD-Xilinx engineering team is also looking to make FPGAs work better on Linux.  They want to add a user space interface to the kernel.   This would allow for driver probe/remove, bridges, and even Device Tree Overlay file support for re-programming FPGAs while the system is running.  If adopted, it would certainly give far more effective control over FPGAs on Linux systems.  You can see their proposal here. Share: Call it K7M.com, AMDMB.com, or PC Perspective, Jeremy has been hanging out and then working with the gang here for years. Apart from the front page you might find him on the BOINC Forums or possibly the Fraggin' Frogs if he has the time. March 31, 2011 October 27, 2006 October 4, 2013 April 22, 2004 Your email address will not be published. Required fields are marked * COMMENT Name * Email *    Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Copyright © PC Perspective 2000-2024 "
}