{
    "title": "AMD says dual-channel DDR5-6000 is the sweet spot for Ryzen 8000G APUs",
    "date": "1/12/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/amd-says-dual-channel-ddr5-6000-is-the-sweet-spot-for-ryzen-8000g-apus",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Just like other Zen 4-based CPUs and APUs. AMD is gearing up to release its Ryzen 8000G-series accelerated processing units for desktops with built-in RDNA 3-based GPU, and the latter tend to be hungry for memory bandwidth. PCWorld decided to ask AMD whether users buying advanced versions of AMD's next-generation desktop APUs should also buy expensive memory kits for their new rigs to avoid any performance bottlenecks for built-in Radeon GPUs. The company explained that its Ryzen 8000G will be fine with a dual-channel DDR5-6000 memory subsystem. \"So, first thing is dual-channel RAM, absolute must, that is a huge bandwidth advantage,\" Donny Woligroski, Technical Marketing Manager at AMD, told PCWorld. \"Do not skimp, you gotta have dual-channel. DDR5-6000 is pretty cheap nowadays. If you can do dual-channel DDR5-6000, you are gonna hit those great frame rates and really playable performance and that is definitely that we will steer people.\" A dual-channel DDR5-6000 memory subsystem offers a peak memory bandwidth of 96 GB/s, which is shared between Zen 4 CPU cores, Radeon 7000-series iGPU, and an NPU. AMD previously said that DDR5-6000 memory is the sweet spot for AMD's Ryzen 7000-series CPUs featuring from eight to 16 Zen 4 cores, so it looks like the company is just re-iterating its claims. Meanwhile, 96 GB/s does not seem to be a lot for a decent iGPU. AMD's Ryzen 7 8700G is expected to feature the company's range-topping RDNA 3-based Radeon 780M integrated GPU with 768 stream processors. The mobile version of the Radeon 780M can operate at clocks between 800 MHz and 2700 MHz, thus offering FP32 performance of up to 8.29 TFLOPS, making it a powerful graphics processor. To add some context, AMD's Radeon RX 6600 XT features a peak FP32 performance of 8.928 TFLOPS and boasts a 256 GB/s peak memory bandwidth and 32 MB of Infinity Cache. Meanwhile, we should remember that the performance of virtually all high-performance integrated GPUs is constrained by memory bandwidth, so AMD and Intel are in the same boat here. Therefore, AMD's Ryzen 8000G promises to be very competitive regarding graphics performance. A Ryzen 7 8700G-based rig should also not be too expensive as one can grab a 32 GB DDR5-6000 dual-channel kit for less than $100. Another advantage of AMD's Ryzen 8000G APUs is that they are part of the AM5 platform, which the company promised to support for the next few years. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Anton Shilov is a Freelance News Writer at Tom’s Hardware US. Over the past couple of decades, he has covered everything from CPUs and GPUs to supercomputers and from modern process technologies and latest fab tools to high-tech industry trends. AMD 170W Granite Ridge Zen 5 CPUs and 128W Strix Point APUs revealed in shipping manifest — 16-core 'Fire Range' mobile CPUs also coming AMD says the UCIe universal chiplet interface will create a whole ecosystem — custom multi-chiplet designs are the future World Backup Day is this weekend — here are the best hard drive and SSD deals we can find By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}