{
    "title": "AMD nearing new record, but gamers might not like the news",
    "date": "1/18/2024",
    "url": "https://www.pcgamesn.com/amd/record-stock-price-ai",
    "text": "The AMD share price has been on an upward trend since the company revealed it's AI plans at CES, and the market response has been positive. Niall Walsh Published: Jan 18, 2024 What a whirlwind week it has been for AMD. Not only has it had to compete with the release of the Nvidia RTX 40-series Super cards and the competitive pricing, but it also revealed a brand new GPU and a new range of gaming CPUs. Now, AMD is set to break its 52-week stock value record, but it has nothing to do with gaming. While AMD might be known for releasing some of the best graphics cards, alongside some of the best gaming CPUs, neither played a role in the recent spike in stock value. Instead, we have another situation like the one Nvidia found itself in last year, where this newfound momentum is all down to AI. The current 52-week stock price record for AMD is $164.46, but early on Thursday, January 18, it sits at $163.22, meaning a new record is on the horizon. It appears to be a matter of when rather than if, especially when the price recently grew as high as $167.72. More record-breaking numbers could be on the way, given the new attention that AMD is getting, and unsurprisingly, it has a lot to do with Nvidia.  Coming off the back of a strong 2023, Nvidia started to feel more like an AI business than a graphics company once its earnings were reported. While the same can’t be said for AMD just yet, the current growth trend is based on Barclays calling out AMD’s growth potential to investors. One analyst recently upped their initial $170 price target to $190 for AMD, citing AI developments as the driving factor. While the everyday consumer might not feel the benefit of AMD’s AI developments, it’s clear that the market is keen to see what happens in the coming weeks and months. Nvidia is also growing alongside AMD, but its 3% gains are overshadowed by AMD’s current 8% march. Gamers need not despair, because while AI may be the reason cited for growth, this means very little for AMD’s general semiconductor business. Just like with the panic that surrounded Nvidia’s earnings, there is no risk of either business leaving behind graphics for AI, but they will instead look to maximize both markets, with AI being the one with the higher financial ceiling in 2024. If you missed the big CES news, we’ve got plenty of coverage on-site for you to catch up on, including previews and hands-on impressions live from Las Vegas. Niall Walsh                 As one of PCGN’s Hardware Editors, Niall is an expert in all things peripherals, meaning if you need to know what the best PC gaming headsets, controllers, keyboards, mice, or monitors are, he has you covered. Even if you just want to know which peripheral brand is better, Razer, Corsair, Logitech, or any other he can help there too. You will also find his words on sites such as; The Loadout, Wargamer, USA Today, MTG Rocks, GGRecon, and RealSport101. "
}