{
    "title": "Galaxy F55 in the works, will it feature the Exynos 1480 chip with AMD GPU?",
    "date": "1/10/2024",
    "url": "https://www.sammobile.com/news/samsung-galaxy-f55-in-development/",
    "text": "© 2024 SamMobile SamMobile has affiliate and sponsored partnerships. If you buy something through one of these links, we may earn a commission. Last updated: January 10th, 2024 at 18:02 UTC+01:00 For the last few years, Samsung has been rebranding its premier Galaxy A-series phones and selling them at a cheaper price as part of the Galaxy M and Galaxy F lineup of handsets. In a few months, Samsung will launch the Galaxy A55, a premium mid-range phone that will be powered by the company's first mid-range Exynos chip with a GPU based on AMD's graphics architecture. A Galaxy M spin-off, the Galaxy M55, has been known to exist for some time, and we have now learned that a Galaxy F55 is in the works as well. We don't have any information about the Galaxy F55 at this time, but we can expect it to share many of its specs with the Galaxy A55. Will that include the Exynos 1480 chip? We can't say at this time. An early benchmark for the Galaxy M55 on Geekbench listed the phone with a Snapdragon 7 Gen 1 chip, and the same chip may find its way into the F55. However, that particular Galaxy M55 benchmark was from an outdated version of Geekbench, so it's not dependable as far as confirming specs such as the chipset and we will have to wait for more concrete evidence to put the pieces of the puzzle together. It also remains to be seen how good the Exynos 1480 will be. The Exynos 1380 powering the Galaxy A54, F54, and M54 has excellent specs but was a bit underwhelming in real-world performance, and there's no guarantee the Exynos 1480 won't suffer the same fate just because it has a GPU with an AMD graphics architecture. You might also like The Galaxy A55 is Samsung's latest mid-range phone to promise a flagship-like experience without a flagship-like price, and in some ways, it really is the most premium mid-ranger from the Korean giant yet. From a design that includes Gorilla Glass Victus+ and a metal frame to a new Exynos chip that has a GPU based […] For whatever reason, Samsung has been avoiding Android's seamless update feature for the past eight years now. Not anymore! The Galaxy A55 is the first Samsung phone to use Google's seamless update feature, and it will likely come to more Galaxy phones soon. Seamless updates work by installing an update to a secondary system partition […] The number of 5G phones in Samsung India's product mix has increased significantly over the past couple of years. The vast majority of all Galaxy phones that it releases in the country are now equipped with 5G capabilities. With the launch of its new mid-range 5G devices, the Galaxy A35 and Galaxy A55, Samsung is […] Samsung's new Galaxy A55 is now getting its first firmware update. The phone ships with the February 2024 security patch, but now, Samsung is already releasing the March update for the new mid-range hero phone. The update is rolling out in India, at the very least, and carries firmware version A556EXXS1AXC1. It weighs a little […] Samsung's new Galaxy A55 brings several improvements over the Galaxy A54, but looking at the official spec sheets, you would think the display isn't one of them. Granted, the A55 has a slightly larger 6.6-inch panel instead of a 6.4-inch one, but that results in a lower pixel density. Otherwise, the two phones share the […] Samsung is developing a new M-series device, the Galaxy M55, which will be a rebranded variant of the Galaxy A55, a smartphone that the company launched last week. So far, there have been multiple leaks about the upcoming M-series smartphone, revealing its specifications. Today, we have a real-life image of the Galaxy M55, courtesy of […] Reviews Best picks Devices Samsung Galaxy A55 SM-A556E Samsung Galaxy S24 SM-S921B Samsung Galaxy S24 Plus SM-S926U Samsung Galaxy S24 Ultra SM-S928B Samsung Galaxy A14 5G SM-A146B Samsung Galaxy A15 5G SM-A156E Samsung Galaxy A25 SM-A256E Samsung Galaxy S23 FE SM-S711U Opinions Notebook TV Social media © 2024 SamMobile "
}