{
    "title": null,
    "date": "1/4/2024",
    "url": "https://www.computerweekly.com/news/366565195/AMD-aims-to-reshape-automotive-industry-with-AI-engines-in-vehicle-experiences",
    "text": "k_yu - stock.adobe.com AMD has announced it is to expand its portfolio of chips for automotive applications with the introduction of two new devices, the Versal AI Edge XA adaptive system-on-chip (SoC) and Ryzen Embedded V2000A Series processor. The devices are designed to serve key automotive focus segments including infotainment, advanced driver safety and autonomous driving. Working alongside a growing automotive partner ecosystem at the forthcoming CES 2024 – including BlackBerry, Cognata, ECARX, Hesai, Luxoft, QNX, QT, Robosense, SEYOND, Tanway and Visteon – AMD said it will demonstrate the broad range of capabilities and applications for the devices in automotive services available today and in the future. Looking at the marketplace in which the new devices will be deployed, James Hodgson, research director at ABI Research, said: “In the future, automakers will leverage autonomous vehicle applications to shape their brand identities. With these applications relying heavily on artificial intelligence [AI], automakers need compute platforms that deliver powerful and efficient AI compute. The number of highly automated vehicles shipping each year is set to grow at a CAGR of 41% between 2024 and 2030, signalling a healthy growth opportunity for suppliers of heterogenous SoCs with powerful and efficient AI compute.” Looking at specific features, the Versal AI Edge XA adaptive SoCs will now add an advanced AI Engine, enabling the devices to be further optimised for next-generation advanced automotive systems and applications including forward cameras, in-cabin monitoring, LiDAR, 4D radar, surround-view, automated parking and autonomous driving. AMD noted that Versal AI Edge XA adaptive SoCs are also the first AMD 7nm device to be auto-qualified, bringing hardened IP and added security to automotive applications where safety is paramount. AMD said Versal AI Edge XA adaptive SoCs, equipped with AI Engines, can offer many benefits for AI compute, vision and signal processing. The SoCs has the ability to perform AI inference on large ingests of data, and can also be used in edge sensors, such as LiDARs, radars and cameras or in a centralised domain controller. The AI Engines are capable of handling AI models such as classification and feature tracking. This device portfolio ranges from 20k LUTs to 521k LUTs, and from 5 TOPs to 171 TOPs. Scalable across this product portfolio, designers can port their designs with the same tools and ecosystem band safety certifications. The first devices based on the range are being released early this year, with further releases planned later in 2024. Explaining the reasons for the launch of the Ryzen Embedded V2000A Series processor, AMD observed that advances in consumer electronics have raised expectations for in-vehicle experiences (IVX), and entertainment, connectivity, workplace on wheels and safety were becoming important factors that influence consumer decisions. The Ryzen Embedded V2000A Series processors are designed to power the next-generation automotive digital cockpit, from the infotainment console to the digital cluster and passenger displays. The expansion of the range is also said to bring the first x86 auto-qualified processor family to offer the same PC-like experience consumers have come to expect from home entertainment, which they can now enjoy in-vehicle. Built on 7nm process technology, Zen 2 cores and high-performance Radeon Vega 7 graphics, the AMD Ryzen Embedded V2000A Series processor is said to deliver high-definition graphics, with enhanced security features and automotive software enablement through hypervisors in addition to support for automotive grade Linux and Android Automotive. Commenting on the launches, Salil Raje, AMD senior vice-president and general manager for adaptive and embedded computing, said: “Our expanding and highly diversified AMD automotive portfolio presents a significant opportunity to serve this high-growth market while also underscoring the tremendous synergy of our combined automotive teams since the acquisition of Xilinx almost two years ago. As we look ahead to 2024’s Consumer Electronics Show, we are excited to showcase our achievements working in collaboration with our ecosystem partners that will advance the future of the automotive industry.” The OMB's new policy calls for federal agencies to be transparent about AI use and designate chief AI officers to coordinate ... Use cases for the still-developing metaverse are growing as the technologies that enable this next iteration of the internet ... Cybersecurity and cloud top the list of 2024's tech investment drivers, according to an Enterprise Strategy Group survey. But ... Threat actors used automated typosquatting attacks to lead victims to malicious python packages in yet another campaign targeting... As a company's cyber-risks evolve, so must its culture. Here are five tips for creating a cybersecurity culture that protects the... To meet the challenges of managing cyber-risk, organizations need to have a cyber-risk management plan in place. Look at five ... Green networking is achievable if network managers ensure devices and supporting systems are energy-efficient and comply with ... The cloud's effect on application management and licensing is expected to shift from end-user applications to SDN concepts. Say ... Black holes in the network disrupt connectivity and compromise data integrity. Network monitoring, team collaboration and routing... Nvidia and its partners are providing the tools and infrastructure to build and deploy AI applications that companies say could ... Data center advancements are rapidly occurring with storage demand. Some advancements, like an increase in temperatures, are ... The lift-and-shift approach moves an app and its data from one environment to another. Understanding the pros and cons can help a... The various types of database software come with advantages, limitations and optimal uses that prospective buyers should be aware... Fragmented data protection laws, technology disruptions, AI adoption, data governance and consumer trust are among the complex ... Any organization that wants to drive decision-making with data or use generative AI won't succeed without understanding how to ... All Rights Reserved, \nCopyright 2000 - 2024, TechTarget\n\n\nPrivacy Policy\n\n\n\nCookie Preferences \n\n\n\nCookie Preferences \n\n\n\nDo Not Sell or Share My Personal Information "
}