{
    "title": "AMD's new CPUs will halve your SSD speed and slash GPU performance",
    "date": "1/15/2024",
    "url": "https://www.pcgamesn.com/amd/ryzen-8000-pcie-lanes",
    "text": "New Ryzen 5 8500G and Ryzen 3 8300G only give you two PCIe 4.0 lanes for your SSD, and just four for your graphics card, slowing down performance. Ben Hardwidge Published: Jan 15, 2024 It’s not looking good for the gaming performance of AMD’s new low-end Ryzen 8000 CPUs with integrated graphics. According to the latest information, new APUs based on the AMD Phoenix 1 core will only be able to run PCIe 4.0 SSDs at half their potential top speed. Not only that, but gaming performance when using a separate graphics card will also be slower than usual. AMD launched the Ryzen 7 8700G at CES, and this new Phoenix 2 chip looks like a contender for our best gaming CPU guide. However, AMD also launched two other lower-end Phoenix 1 CPUs with integrated Radeon graphics (which AMD calls APUs) at the same time, and it looks as though these APUs only offer a severely limited number of PCIe lanes. The CPUs in question are the six-core Ryzen 5 8500G and quad-core Ryzen 3 8300G. This information comes via motherboard maker Gigabyte, which has listed some of the limitations for AMD’s new Ryzen 8000 APUs in the specs list for its B650E Aorus Elite X AX Ice motherboard. In the “Storage Interface” section it says that Phoenix 1 processors “support PCIe 4.0 x4/x2 SSDs,” while Phoenix 2 processors only support support “PCIe 4.0 x2 SSDs.” This data, which was spotted by wccftech, gives some insight into the impact of the CPU specs, which have already been revealed by AMD. For example, the Ryzen 5 8500G only has ten usable PCIe 4.0 lanes, compared with 16 on the Ryzen 7 8700G, and it looks as though this will have a serious impact on the speed of components you install in your motherboard. This means AMD’s lower-end APUs will only be able to run a PCIe 4.0 SSD with two lanes, rather than four, halving the amount of bandwidth available. This will effectively give your SSD a top-speed ceiling of 4GB/s (less in practice), which is a problem when PCIe 4.0 SSDs such as the Samsung 990 Pro can read at up to 7,450MB/s. Not only that, but it looks as though both the Ryzen 5 8500G and Ryzen 3 8300G will only be able to run a graphics card with four PCIe 4.0 lanes, which will give you only a quarter of the bandwidth of a usual 16x PCIe 4.0 slot. This won’t be much of a problem if you’re using a low-end GPU that only has a 4x interface anyway, but it will definitely impact the performance of high-end GPUs, such as the GeForce RTX 4090. The Ryzen 5 8500G and Ryzen 3 8300G both have a different core setup to the Ryzen 5 8600G and Ryzen 7 8700G. While the latter two use the straightforward Zen 4 architecture, the Ryzen 5 8500G only has two Zen four cores, along with four Zen 4c cores, and the Ryzen 3 8300G cuts this down further, with just a single full Zen 4 core and three Zen 4c cores. These Zen 4c cores are already used in AMD’s EPYC server CPUs, and they have lower clock speeds and less cache than standard Zen 4 cores. It looks as though this use of Zen 4c cores also results in a dramatic reduction in the number of PCIe lanes available. In the meantime, check out our full buying guides if you’re looking to buy the best SSD for gaming, or get the best graphics card for your PC. Ben Hardwidge                 A tech journalist since 1999, and a PC hardware enthusiast since 1989, Ben has seen it all, from the horrors of CGA graphics to the amazing ray-tracing GPUs of today. Ben is mainly interested in the latest CPU and graphics tech. "
}