{
    "title": "Best Graphics Cards 2024",
    "date": "2/19/2024",
    "url": "https://www.ign.com/articles/best-graphics-card",
    "text": "Blending an appealing price and impressive 1440p performance, the Nvidia Geforce RTX 4070 Super is our favorite graphics card. But whether you’re looking for a budget option ready to run games at decent frame rates in 1080p or want raw performance in 4K with ray tracing, we’ve found a GPU for your needs. Click to jump to a detailed look at the best graphics cards, or check the shopping list below: Nvidia and AMD Radeon cards sit at the top of the GPU world, offering features like ray tracing and AI technology with DLSS or FSR. Some mid-generation refreshes of the RTX 40 series have arrived, boosting performance and replacing their non-Super counterparts, while AMD’s Radeon RX 7000 series continues to deliver. So, to help you decide the best GPU for you, be it from Team Green or Team Red, we’ve done comprehensive testing and reviewing of a range of cards, bringing you eight of our favorites ready to run the best PC games. CUDA Cores/Stream Processors: 7,168 | Base Clock: 1.98GHz | Boost Clock: 2.48GHz | Video Memory: 12GB GDDR6X | Memory Bandwidth: 504.2 GB/s | Memory Bus: 192-bit | Power Connectors: 1 x 16-pin | Outputs: 1 x HDMI 2.1, 3 x DisplayPort 1.4 | Size: 10.5\" x 4.4\" x 2-slot We loved Nvidia’s GeForce RTX 4070, and its mid-generation refresh, the Geforce RTX 4070 Super, is just as impressive as its name suggests. With it, you get ​​the same appealing price tag and Ada Lovelace architecture as the original. Only there are ten more Streaming Multiprocessors for a total of 7,168 CUDA cores with the same 2,475 MHz boost clock, ensuring superior performance at higher resolutions. Extra VRAM also helps to future-proof this card. You’ll find the RTX 4070 Super delivers high frame rates in 1440p with ray tracing enabled, and in games that support DLSS, the refresh rates get even better. Depending on the game, this GPU may even be able to take on some 4K gaming. However, that boosted performance requires slightly more power than the original, so the Super model has a 220W TDP versus 200W; nothing too crazy. CUDA Cores/Stream Processors: 3,072 | Base Clock: 1.8GHz | Boost Clock: 2.5GHz | Video Memory: 8GB GDDR6 | Memory Bandwidth: 17GB/s | Memory Bus: 128-bit | Power Connectors: 1 x 8-pin | Outputs: 1 x HDMI 2.1, 3 x DisplayPort 1.4 | Size: 8.9\" x 4.9\" x 2.5-slot Nvidia has finally delivered a more budget-friendly card in the GeForce RTX 40 series lineup with the RTX 4060. Costing around $300, depending on the model you buy, it delivers a decent performance upgrade from previous generations and includes DLSS 3.0. That technology helps increase frame rates using AI and 96 fourth-gen tensor cores for better game rendering, which is especially helpful in open-world games like Eldin Ring. Given the Nvidia GeForce RTX 4060 is an affordable option for your gaming PC, you’ll want to stick to 1080p gaming on this card. It still manages 60+ fps at that resolution in most cases, but with only 8GB of GDDR6 VRAM, there’s some stuttering at certain moments. However, 24MB of cache and lower power consumption help make up for the limited memory. CUDA Cores/Stream Processors: 7,680 | Base Clock: 2.31GHz | Boost Clock: 2.61GHz | Video Memory: 12GB GDDR6X | Memory Bandwidth: 504.2 GB/s | Memory Bus: 192-bit | Power Connectors: 1 x 16-pin | Outputs: 1 x HDMI 2.1, 3 x DisplayPort 1.4 | Size: 11.2\" x 4.4\" x 2-slot The best graphics cards are more expensive than ever, with both Nvidia and AMD raising prices over last-generation GPUs. So if you want a powerful RTX 4000 or Radeon 7000 GPU, you’ll have to fork over more cash than ever. The Nvidia GeForce RTX 4070 Ti offers decent bang for your buck, delivering powerful performance for hundreds less than other higher-tier RTX 4000 series GPUs. But even it clocks in at over $800. This graphics card cruises through PC games with ray tracing on. It’ll have no problem hitting decently high frame rates at high resolutions. Heck, the RTX 4070 Ti regularly trades blows with the more-expensive AMD Radeon RX 7900 XTX, even beating it outright in games like Cyberpunk 2077. CUDA Cores/Stream Processors: 5,376 | Base Clock: 1.5GHz | Boost Clock: 2.02GHz | Video Memory: 20GB GDDR6 | Memory Bandwidth: 800 GB/s | Memory Bus: 320-bit | Power Connectors: 2 x 8-pin | Outputs: 1 x HDMI 2.1, 2 x DisplayPort 2.1, 1 x USB-C  | Size: 10.9\" x 4.3\" x 2-slot The AMD Radeon RX 7900 XT has a confusing name – the next higher tier Radeon card is the 7900 XTX – but while the latter is an expensive high-end graphics card that’s supposed to take the RTX 4080 head on, the AMD Radeon RX 7900 XT strikes a much better balance between price and performance. This $899 graphics card can easily power any PC game at 4K 60 fps. There are plenty of games where the AMD Radeon RX 7900 XT manages to match the performance of the much-more expensive RTX 4080 at a much-lower price. And while the Radeon RX 7900 XTX is a bit more powerful than this card, it’s not by much. The extra $100 you’ll spend on the AMD Radeon RX 7900 XTX is simply not worth it with the performance the Radeon RX 7900 XT offers. CUDA Cores/Stream Processors: 2,048 | Base Clock: 2.3GHz | Boost Clock: 2.7GHz | Video Memory: 8GB GDDR6 | Memory Bandwidth: 288.0 GB/s | Memory Bus: 128-bit | Power Connectors: 1 x 8-pin | Outputs: 1 x HDMI 2.1, 3 x DisplayPort 1.4 | Size: 9.3\" x 4.9\" x 2-slot Not all graphics cards require you to spend a small fortune. Just look at the Radeon RX 7600, which sets you back under $300 and delivers solid gaming performance. In this day and age, that’s an impressive price, especially for those building a budget PC. It’s also more compact than many graphics cards and needs just one 8-pin connector, so it’s bound to fit in almost any build. Is the Radeon RX 7600 a good 4K option? No, but the graphics card still proves highly capable when 1080p gaming. Now, it isn’t going to shine in Full HD all the time, especially if you’re playing games that use a lot of ray tracing effects, like Cyberpunk 2077 or Hitman 3. However, ray tracing is technically supported thanks to the card’s RDNA 3 architecture, even if it’s probably best to keep it off. CUDA Cores/Stream Processors: 16,384 | Base Clock: 2.23GHz | Boost Clock: 2.52GHz | Video Memory: 24GB GDDR6X | Memory Bandwidth: 1,008 GB/s | Memory Bus: 384-bit | Power Connectors: 1 x 16-pin | Outputs: 1 x HDMI 2.1, 3 x DisplayPort 1.4 | Size: 12\" x 5.4\" x 3-slot The Nvidia GeForce RTX 4090 is the graphics card you get when you’ll accept no compromises. There is absolutely no contest when it comes to raw GPU performance, especially at 4K with ray tracing. The RTX 4090 is packed with a mind-blowing 16,384 CUDA cores and 24GB of VRAM, which will not only play all the best PC games now, but those  for years to come. The huge amount of VRAM is also a huge boon to creative professionals. If you have to do a lot of work in Adobe Premiere or Blender, this is the graphics card to beat – at least unless you want to drop thousands of dollars on a pro GPU. One thing to be aware of with the Nvidia RTX 4090, though, is the power requirements. This baby is rated for 450W, so you’re going to want to pair it with one of the best power supplies. CUDA Cores/Stream Processors: 1,0240 | Base Clock: 2.29GHz | Boost Clock: 2.55GHz | Video Memory: 16GB GDDR6X | Memory Bandwidth: 716.8 GB/s | Memory Bus: 256-bit | Power Connectors: 3x PCIe 8-pin | Outputs: 1 x HDMI 2.1, 3 x DisplayPort 1.4 | Size: 11.9\" x 5.3\" x 3-slot While the RTX 4080 Super doesn’t impact performance greatly over the RTX 4080, it is considerably better value for money. It’s more affordable while delivering that all-important performance boost, despite it being small. If you want a 4K graphics card under $1,000, the RTX 4080 Super is a great choice. But if you want the best of the best, you’ll have to splurge on the 4090. Still, sticking with the 4080 Super, you’re going to be pleasantly surprised by its performance. Running AAA titles in 4K achieves consistently low FPS and maintains cool temperatures. There’s also little margin for error when it comes to power draw if this is a concern for you. Ultimately, if you want a reliable 4K gpu that is incredibly powerful but doesn’t peak over $1,000, the RTX 4080 Super is going to be your best bet. CUDA Cores/Stream Processors: 5,888 | Base Clock: 1.92GHz | Boost Clock: 2.48GHz | Video Memory: 12GB GDDR6X | Memory Bandwidth: 504.2 GB/s | Memory Bus: 192-bit | Power Connectors: 1 x 16-pin | Outputs: 1 x HDMI 2.1, 3 x DisplayPort 1.4 | Size: 9.6\" x 4.4\" x 2-slot Nvidia has finally released a mid-range option in their RTX 4000 series of graphics cards. For around $600, you can snag the GeForce RTX 4070, and with it comes the same Ada Lovelace architecture as the insanely expensive, GeForce RTX 4090. Of course, it can’t compete with that top-tier card, but you’ll still enjoy excellent performance thanks to ​​5,888 CUDA cores, 46 RT cores, and 184 Tensor cores. The RTX 4070 has no problem hitting high frame rates in 1440p, even with ray tracing enabled. DLSS 3.0 support even makes it a contender for some 4K gaming. The card itself is also relatively compact and extremely efficient, making it a great match for almost any PC build There aren't too many differences when it comes to the graphics cards you can pick up in the UK, but the main takeaway is where you can purchase them. All of the following links have been updated with UK vendors, saving you some time and money if you're interested in picking up any of the graphics cards we've mentioned. Don't see the graphic cards below? Click here. Just like anything in your gaming PC, there’s no one right graphics card for everyone. When you’re going out shopping for one of the best graphics cards, know what you’re going to be using it for; which games you want to play and what resolution you’re going to play them at. Someone who just wants to play League of Legends at 1080p, for instance, is going to need a completely different graphics card than someone that wants to play games like Returnal and Atomic Heart at 4K. You also have to consider your budget. Graphics cards can cost as little or as much as your budget allows, so you want to make sure you get the best bang for your buck. When it comes to which brand of graphics card you should get, it ultimately comes down to your personal preference – even if each brand has its own unique advantages. Intel graphics cards are the most affordable option on the market right now, but its graphics cards aren’t exactly the fastest in the land. On the other hand, Nvidia makes the most powerful GPUs around, but you’re going to have to pay out the nose for that performance. AMD graphics cards strike a pretty good balance between the two, but while the company loves to use open-source graphics APIs, it means you don’t get access to some of the exclusive features that Nvidia owners enjoy – features like DLSS. AMD has alternatives for literally every Nvidia software feature, but some of them simply aren’t as good. See our guide to AMD vs. Nvidia GPUs for more info. Graphics cards, especially high-end ones, are sucking up more electricity with every passing year. If you’re looking to build a new gaming PC, or even upgrade from an older graphics card, you should really consider upgrading to one of the best power supplies. Some of the graphics cards out there right now can take upwards of 450W of power by themselves, so you may want to consider a 1,000W power supply – especially if you’re going for the Nvidia GeForce RTX 4090. Nvidia has both an RTX, or Ray Tracing Texel eXtreme, and GTX, Giga Texel Shader eXtreme graphics cards series, with the RTX offerings being newer, more powerful, and more expensive. That boosted performance is thanks to the architecture of RTX cards, which offer both Tensor and RT cores alongside CUDA cores for better graphics and rendering. Tensor cores enable AI and high-performance computing tasks bringing support for DLSS tech to help with upscaling and sharpening. RT cores are dedicated to ray tracing, allowing for more realistic lighting and shadows in scenes. Nvidia’s GTX graphics cards have a much simpler architecture and don’t offer Tensor or RT cores. Though they still work for budget builds, GTX cards will soon be obsolete. Jackie Thomas is the freelance computing queen. You can find her work at Gizmodo, Reviewed, TechRadar and you can follow her @Jackiecobra "
}