{
    "title": "Nvidia, Eli Lilly, AMD Enjoy High Equity Valuations: Do Higher Rates Put \nThem In Peril? - Advanced Micro",
    "date": "2/27/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/37346557/are-nvidia-eli-lilly-amds-high-equity-valuations-in-peril-from-higher-rates",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Higher long-term rates typically matter a lot to equity valuations. However, according to DataTrek, today’s mega-cap stocks are likely to weather the current higher rate environment. See the chart below. DataTrek puts the current average Shiller p/e of 34.1 into some context. The Fed’s aggressive rate cycle in 2022 and 2023 did not fundamentally spook equities anywhere near as much as what happened in the 1970s, the data firm noted. “The yield volatility of the 1970s, driven first by rampant inflation and then the Fed’s response, cast a long shadow. It took stocks decades to get past those events,” it added. During the 1970s and 1980s, Treasury yield volatility increased. Ten-year rates hit 16% in 1981, before falling back to 9% in 1990 as inflation skyrocketed during two oil crises. In response, Shiller p/e average fell to just 11x in the 1980s. “Uncertainty surrounding long-term interest rates has had a profound effect on equity valuations over the last 50 years,” DataTrek analysts said. Also Read: What If The Fed Does Not Cut Rates This Year? Inflation’s Stickiest Mile To 2% Target While there’s some argument now about whether the Fed funds rate should be at 4%, 5% or 6%, that is nothing compared to the 5%, 10% or even 15% rates hit during the past four decades. “There is increasing chatter that the Fed may need to put off rate cuts year or even tweak policy rates higher to fully bring inflation to heel, but historical records suggest this may not hit equity valuations as much as one might think. “However, if the Fed were to raise to 8%, 9% or 10%, and 10-year yields reset to those levels, that would be a 1970s-style problem,” the DataTrek analysts concluded. Now Read: Private Equity Bounces Back: EQT Raises $24B For Deals, Signals Listings Revival Image: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}