{
    "title": "AMD launches the China-exclusive Radeon RX 7900 GRE worldwide",
    "date": "2/26/2024",
    "url": "https://www.xda-developers.com/amd-launches-china-exclusive-radeon-rx-7900-gre-worldwide/",
    "text": "Golden Rabbit Edition AMD launched the Radeon RX 7900 Golden Rabbit Edition (GRE) as an exclusive graphics card for the Chinese market, but the company has today rolled out the GPU to the rest of the world. The Radeon RX 7900 GRE offers strong 1440p performance, positioned between a Radeon RX 7800 XT and RX 7900 XT. With 16GB of GDDR6 VRAM, a price tag of $549, and performance between the two Radeon GPUs, the 7900 GRE offers a value pick for those who don't have $900 for a single component. Being based on the same RDNA 3 architecture as the RX 7900 series, the Radeon RX 7900 GRE comes with full AV1 encoding support, DisplayPort 2.1, and full integrated with AMD's latest software for HYPR-RX, Fluid Motion Frames, and FidelityFX Super Resolution. There are 5,120 shaders to work with for running games and other GPU-intensive tasks, 80 ray tracing cores, 160 AI accelerators, and 16 GB of GDDR6 VRAM. On a 256-bit memory bus, this GPU is capable of utilizing up to 576 GB/s of bandwidth.  A base clock speed of 1,287 MHz can hit speeds of 2,245 MHz, which should work well for playing games at 1440p, but interestingly, this falls short of what the RX 7800 XT can provide. The RX 7900 GRE shares the same GPU as the 7900 XT but it has been effectively reduced in physical size. The memory has also been switched from a 380-bit to a 256-bit bus, resulting in a graphics card that better resembles a slightly improved 7800 XT. It's not all bad news as AMD has managed to bring to market a new GPU for less than $600, offering more choice in the segment. All this combined creates a GPU that's good at both work and play. OBS Studio can make use of the AV-1 encoders for improved performance and visual quality when streaming. 16 GB of VRAM is ample for 1440p and even some 4K gaming, though the performance throughput of this card will limit just how far you can push the GPU. AMD's advanced software support through its FSR and AFMF suites allows the latest 7900 series graphics cards, including the RX 7900 GRE to punch above their weight. Priced at $549, AMD is using the 7900 GRE to take on Nvidia's GeForce RTX 4070 and it's available now at participating retailers.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Richard is a Senior Editor at Valnet and has been covering the technology industry for almost two decades. He's been building PCs since young and when not creating content, you can often find him inside a chassis somewhere. 64-bit processors may be mainstream, but what made the industry ditch 32-bit CPUs in the first place? Windows 11 is getting new capabilities for Copilot, Snap Layouts, and more with the Moment 5 update, rolling out today. For when you can't resist checking out all the new Windows features I recently reviewed the Ayaneo AM02 mini PC, and I turned it into a home gaming console. Get tinkering for cheap. Thermal paste is a vital component of any CPU cooling solution, but here's how long you can expect it to last "
}