{
    "title": "AMD CEO to Present the Computex Keynote: Ryzen 9000 (Zen 5) + Radeon RX \n8800 XT (RDNA 4)?",
    "date": "2/22/2024",
    "url": "https://www.hardwaretimes.com/amd-ceo-computex-ryzen-9000-zen-5/",
    "text": "AMD CEO Dr. Lisa Su is set to present the opening keynote at Computex 2024 on June 3rd, kicking off the largest PC-centric tech exhibition. The expo will go from June 4th to 7th at the Taipei Nangang Exhibition Center Halls 1 and 2. The show will attract 1,500 international and local exhibitors with 4,500 booths. We’re more interested in the next-gen Ryzen 9000 (Zen 5) announcement that is certain to come during the event. COMPUTEX 2024, a global leading technology exhibition, featuring AIoT applications, generative AI & and startup ecosystems, will take place from June 4th to 7th at the Taipei Nangang Exhibition Center Halls 1 and 2. Themed ” Connecting AI,” this year’s exhibition focuses on the latest global AI technologies and industry trends. The show will attract 1,500 international and local exhibitors using 4,500 booths. The Opening Keynote will be delivered by Dr. Lisa Su, Chair and CEO of AMD, on the morning of June 3rd to set the stage for the event. The keynote sessions at COMPUTEX feature top industry leaders. This year, Dr. Lisa Su, Chair and CEO of AMD is invited to deliver the Opening Keynote. She was recognized by the IEEE with its highest semiconductor honor, the Robert N. Noyce Medal, and led the transformation of AMD into the high-performance and adaptive computing leader. Dr.Su will highlight the next generation of AMD products enabling new experiences and breakthrough AI capabilities from the cloud to the edge, PCs, and intelligent end devices. In addition, more keynote speakers from Qualcomm, Intel, MediaTek, NXP, Supermicro, and Delta, will also take the stage to share their visions for the future of the AI ecosystem collectively. Stay tuned for further announcements. Computex Taipei (Taitra) AMD has officially confirmed that its Zen 5 chips and the corresponding Ryzen 9000 processors will launch in the second half of 2024. This falls in line with what was reported earlier this year. The chipmaker’s official roadmap says the same. Looking back at AMD’s previous launches, the Ryzen 5000 CPUs were launched in October 2020, while the Ryzen 7000 series landed in September 2022. Both lineups were announced at the preceding Computex events, followed by a retail launch in the fall. There’s also the matter of the Radeon RX 8000 series GPUs. Although the RX 8900 XTX has (allegedly) been canceled, the RX 8800 XT is expected to land in the second half of this year. Rumors claim that the 8800 XT will offer comparable performance to the RX 7900 XT/XTX while costing nearly half as much. More recent claims suggest that engineering samples of the RDNA 4 GPUs are already being tested, and it won’t be long before benchmarks start leaking out. Existing samples are supposedly boosting between 3GHz and 3.3GHz, and it’s only a matter of time before they are tested on popular benchmarking platforms. "
}