{
    "title": "ASUS ROG Zephyrus G16 GU603 - what to expect",
    "date": "2/20/2024",
    "url": "https://www.ultrabookreview.com/60645-asus-rog-zephyrus-g16/",
    "text": "The latest analysis, news, findings and scoops on ultrabooks and ultra-portable laptops. The latest analysis, news, findings and scoops on ultrabooks and ultra-portable laptops. In this article we’re discussing the 2023 Asus ROG Zephyrus G16 GU603 lineup of portable performance laptops. The naming of this series is so confusing. The first time I saw this, I was thinking a G16 is finally that much-awaited follow-up of the Zephyrus G15 series, bringing the newer 16-inch 16:10 displays onto a modern AMD+Nvidia platform. But then I noticed this is a G16 GU603 series, and GU603 is the series name of the 2022 Zephyrus M16 generation. What does this mean? Well, the 2023 ROG Zephyrus G16 is actually built on the 2022 Zephyrus M16 chassis, hence the reason they both share the GU603 series naming, and is a mid-specced hardware lineup with an Intel 13th-gen processor and mid-tier Nvidia RTX 4000 graphics. That means it’s the first G-series Zephyrus that’s no longer running on an AMD platform. To make things even more confusing, Asus are also offering a 2023 Zephyrus M16 GU604 series now, with higher-tier specs, an updated internal design, and a tri-fan cooling module similar to the one implemented on the ROG Flow X16. And BTW, the 2023 Flow X16 is an Intel platform for the 2023 generation as well. Oh my… We’ll go through the notable features and particularities of the 2023 Asus ROG Zephyrus G16 series down below, comparing it to the previous M16 and G15 generations, and then we’ll follow up with our in-depth reviews somewhere in the next few weeks. Here’s the complete specs sheet of the 2023 Asus ROG Zephyrus G16 GU603, next to the 2022 Zephyrus M16 and G15. Update: Here’s our detailed review of the Asus ROG Zephyrus G16 series. Update: In the meantime, I’ve reviewed two different versions of the latest ROG Zephyrus G16 series: the Zephyrus G16 GU605MI (Core Ultra 7 + RTX 4070) and the top-specced Zephyrus G16 GU605MY (Core Ultra 9 + RTX 4090). While I’m still filling in the blanks on certain aspects, the 2023 ROG Zephyrus G16 seems to be built on the chassis that was previously offered with the 2022 Zephyrus M16 lineup. That means it’s a compact and portable laptop with a 16-inch 16:10 display, 180-degree Ergolift hinges, a beautiful and well-made metal body, a punchy audio system with 6x speakers, and fair ergonomics all around. I’ve reviewed the M16 in this article, so head on over there for my in-depth thoughts on the design. Unlike the M16, though, Asus will offer the Zephyrus G16 in both black/gray and white variants. I’ve experienced the all-white Asus design in the previous G14 and G15 models, and is truly beautiful. The darker option is more sober looking, but also shows off smudges easily. Both get the Prismatic film layer on the lid.  My only major complaints with this design are the fact that bright status LEDs are positioned under the display and reflect into the screen when using the laptop at night, and the fact that most ports are cramped out together on the left edge, towards the front of the laptop. Speaking of ports, compared to the 2022 M16, the G16 does get an HDMI 2.1 port alongside everything else. And since it’s an Intel platform, it also offers Thunderbolt 4 support, unlike any of the AMD-based Zephyrus G models of the past. I’ll also add that you’ll have to make do with a single-zone RGB keyboard on this series, as there’s no per-key RGB control. Both the keyboard and the clickpad are otherwise among the better you will find in this sort of product.  As far as the screen goes, the G16 is a 16:10 matte display with a choice of either a Nebula QHD+ panel on the higher-tier configurations, or a dimmer and more washed-out FHD+ option on the entry-level specs. If possible, I’d go with the Nebula panel, which is a slight update of the 16-inch panel reviewed in the 2022 M16, and a solid display for daily use, media consumption, creative work, and gaming. As a side note, it seems like there are no Nebula HDR panels on this series, as the miniLED panels are reserved for the higher-tier ROG Zephyrus M16 and ROG Flow X16 2023 models. You’re also getting higher-tier specs with those notebooks, with up to Core i9 processors and RTX 4090 graphics.  This G16, on the other hand, tops out at a similar Intel Raptor Lake Core i9-13900H processor, but only up to mid-tier RTX 4070 8GB graphics. The rest of the specs include up to 48 GB of memory (partially soldered, with one DIMM for upgrades), gen4 storage with two M.2 2280 slots, and a 90Wh battery. Update: Here are the configurations available for the Asus ROG Zephyrus G16 (2023) generation: There are also some variants built on 12th-gen processors and RTX 4000 graphics: For reference, down below I’ve included a picture of the internal design of the 2022 Zephyrus M16, and the 2023 Zephyrus G16 should be pretty much identical.  There is a smart MUX implemented on this G16 lineup, though, with Advanced Optimus and GSync support on the main display. However, it’s still unclear to me if this series will only be available with DDR4 memory, as per some of the sources available at this point, or will support DDR5 RAM as well. The slower DDR4 memory could affect its capabilities in certain activities and workloads, and it’s a limitation I wasn’t quite expecting on a Zephyrus series in 2023. That aside, Asus mentions that the GPU can run at up to 120W of power with Dynamic Boost here, and given the similarity in design and charger capacity with the previous M16 generation, we can assume that the G16 is going to perform very similarly to that 2022-model M16. That means it’s going to handle daily use and heavier workloads well, without overheating or throttling, but it will also run loud on the Turbo profile, and cause the bottom of the display to heat up around the exhausts. In comparison, the 2023 Zephyrus M16 and Flow X16 are both the newer tri-fan cooling design with the Pulsar full-length heatsink at the back, and that sort of cooling allows them to run quieter and at lower temperatures. Nonetheless, this Asus ROG Zephyrus G16 is still a competitive design in its niche of thin-and-light performance laptops, as long as you understand and accept the quirks of this chassis. I still find it weird that this G is no longer an AMD platform and loses the efficiency of the past G15 generations, which allowed for excellent runtimes on battery. Hopefully, at least Raptor Lake proves to be more efficient than the previous Intel specs were in the 2022 Zephyrus units.  I also expect this series to be the most competitively priced option on the 2023 Asus Zephyrus lineup, especially in the lower and mid-tier specs with i7 processors and RTX 4050/4060 graphics. I would stay away from the FHD display configurations as much as possible, though. I don’t know much about pricing at this point, but I’d reckon this should start well under 2000 USD/EUR for the basic models, while the i9 + 4070 configuration will probably go for around 2.2 to 2.5K at launch. We’ll know more soon, as the G16 is expected in stores around the end of Q1 2023. For now, look for our review in the weeks to come, and in the meantime, let me know in the comments section down below what you think about this Asus ROG Zephyrus G16 GU603 series. Is it something you’d consider, or would you have preferred if this Zephyrus G would have still been an AMD platform, as in the past? Disclaimer: Our content is reader-supported. If you buy through some of the links on our site, we may earn a commission. Terms.\n\t\tNavigation: Ultrabookreview.com » Asus Navigation: Ultrabookreview.com » Asus Cameron Bosch February 3, 2023          at          1:14 am Asus seems to be giving the middle finger to AMD this year, like most OEMs. I cannot find any Asus ROG AMD Ryzen laptops released this year, apart from the Flow x13, the Zephyrus G14, and the Zephyrus Duo 16, none of which are the \"traditional\" 16/18 inch laptop I wanted. So I shall wait longer. Gerrit Visser July 20, 2023          at          1:14 am I will wait for 16\"G16 with the Nebula Display. It will bankrupt me though.. 😁 Tia February 10, 2023          at          4:13 pm They should have stuck with AMD for the G16 series… or even gone AMD Advantage on this year's G16 anyway. I guess if you want AMD then this year only the Zephyrus G14 has the AMD CPU and the Nvidia GPU with up to 4090 max 120W though so base like 95W with 25W boost sigh… I also hate how they got rid of the ethernet port like surely the top end model of your product lineup should have everything I would have been fine if this year's G16 was the M16 2022 chassis but minus the ethernet port not having to use dongles is a big plus… I really want the HDR and 1100 nits display so I guess I will have to just save up a lot of money and hope it goes on sale in November  that is if they do Black Friday sales on it or get a M16 2022… sigh… for discounted prices. Erfan February 19, 2023          at          7:10 am Hi\nI have recently purchased a Zephyrus m16 2022 with a lower FHD+ screen and Intel i7 12700H processor for light gaming and programming. I'm wondering if I should return it and get this new G16. I have to pay 600CAD more basically for better screen, newer GPU and CPU. I'm not sure if it is the right choice since the G16 has the older DDR4 memory and higher price.\nHow do you think the memory affects the performance and do you think it is worth the money for the upgrades? My current m16 has i7 12700h, rtx3060, FHD+, DDR5\nI can switch to G16 Intel core i9 13900H, rtx4060, QHD+, DDR4 Andrei Girbea February 19, 2023          at          10:27 am the only things worth the upgrade are the GPU and the screen. Up to you if these are worth that sort of premium – IMO they're not. If you're not happy with what you have and want to upgrade, you can just get an m16 2022 with the qhd screen and the 3070, and you'll still end up paying less. But for your needs, that configuration is fine Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Notify me of followup comments via e-mail. You can also subscribe without commenting.   Δ Table of ContentsSpecs as reviewed – 2024 Alienware m1 R2 generationDesign and ergonomics – much smaller than beforeKeyboard and touchpadScreen – an adequate IPS displayHardware and performance – Intel Core... Asus ROG Zephyrus G16 GU605MY review (Core Ultra 9 185H, RTX 4090) Asus ROG Zephyrus G16 review (2024 GU605MI- Core Ultra 7 155H, RTX 4070) Asus Zenbook 14 OLED UX3405 review (2024 UX3405MA, Intel Meteor Lake) Asus ROG Flow X13 review (GV302 2-in-1 gaming laptop, 2024 gen) Table of ContentsThe Best Premium fanless laptops and ChromebooksFull-size fanless laptopsFanless ultrabooks and Windows ultra-portablesFanless Windows-running Mini laptops In this article, we’re discussing fanless laptops and silent Windows ultrabooks... Best Chromebook in 2024 – reviews, comparisons, buying guide The best Thunderbolt 4/USB Type-C docks for your laptop in 2022 The best tech, laptops and tablets to get your kids (in 2023) AMD Ryzen 9 6900HX vs Intel Core i9-12900H benchmarks comparison Copyright © 2011-2023 Ultrabookreview.com "
}