{
    "title": "Best CPU for Overwatch 2 - our top AMD and Intel picks",
    "date": "2/13/2024",
    "url": "https://www.videogamer.com/tech/best-cpu-for-overwatch-2/",
    "text": "Posted in Tech Video Gamer is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more The best CPU for Overwatch 2 will help you keep frame rates steady, an increasingly important performance factor in reaction-based shooters nowadays. Overwatch 2 isn’t the most graphically intensive game out there, and you’re going to be able to play the game on pretty standard hardware with the best graphics settings set up. If you’re still struggling to get a decent FPS, you might also want to consider upgrading to a the best GPU for Overwatch 2, one which will thankfully carry over to other games like Apex Legends and The Finals. We’d recommend a few different CPUs that cover budget options, those with integrated graphics, and also top-tier CPUs that will net you extraordinary frame rate gains over the competition. Shop on Amazon Shop on Amazon Shop on Amazon Cores 8 Threads 16 Base speed 4.2GHz Boost speed 5.9GHz Cache 104MB TDP 120W BestBuy The first CPU we’re going to be recommending for Overwatch 2 is going to be the AMD Ryzen 7 7800X3D, a CPU that we consistently recommend as one of the best CPUs for gaming. Released last year, the 7800X3D quickly became a household name (within gaming) thanks to the powerful cache management provided by the 3D V-Caching technology. The efficient organisation of memory has allowed for a drastic increase in frame-rates, and it also doubles up as a powerhouse for productivity too. Alongside that, there’s also significant gains in power-efficiency over Intel’s counterpart processors. There’s one eight core processor laced with 16 threads, and while it’s only going to reach 5GHz, you won’t find this an issue in Overwatch 2. If you pair with with capable DDR5 RAM, and the AM4 motherboard it deserves, expect to see really solid performance in game capable of churning out way more than 60FPS in Overwatch 2 at the highest resolutions. Cores 14 Threads 20 Base speed P-cores 3.5 GHz / E-cores 2.6 GHz Boost speed P-cores 5.1 GHz / E-cores 3.9 GHz Cache 20MB TDP 125 W / 181 W boost. Intel’s 13th Gen CPUs are extremely versatile having compatibility with previous and current generation sockets, and DDR4 and DDR5 RAM. This means it’s even easier to upgrade your gaming PC without having to strip everything from the bones up. The Intel i5-13600K is exactly one of those components bridging the gap between old and new, but sits firmly on the side of current quality. Having 14 cores and 20 threads, it’s clockable between 3.9GHz and 5.1GHz. On top of that, there’s 20MB cache that’s going to help you increase your frame rate gains in Overwatch 2. It’s not too expensive either, with an MSRP of $329 that’s consistently discounted now that it’s two years into its lifespan. Compared to its AMD competitors though, it’s going to run at a TDP of up to 181W, which is a significant increase over the generally accepted 120W threshold. Cores 8 Threads 16 Base Clock 4.2GHz Boost Clock 5.1GHz Graphics Component AMD Radeon 780M TDP 65W I’m gonna suggest something pretty unconventional, maybe controversial, as an option for Overwatch 2: Consider using a CPU with an integrated graphics chip. I’d recently been using the AyaNeo AM01, a mini PC with a Ryzen 7 5700U inside, and though modern gaming was nowhere near as smooth as what you’d expect from a full size gaming PC, it was still a budget friendly experience worth writing about. The AMD Ryzen 7 8700G only released earlier on in 2024 and features clock speeds up to 5.1Ghz. alongside that, there’s eight cores and 16 threads as you’d expect from Zen 4 architecture CPUs. It’s a really solid option, especially if you’re not happy spending anywhere between $300 – $1,000 on a graphics card you might not even need. The AMD Radeon 780M is baked into the Ryzen 7 8700G, powered by RDNA 3 architecture and sporting performance levels you’d expect from a GTX 1650, or an equivalent graphics card. The 8700G is capable of running AAA games like Cyberpunk 2077 and Baldur’s Gate 3 at minimum graphics settings, so you’re going to be able to comfortably say that Overwatch 2 is going to run just fine with one of the best APUs for gaming. What frame rate should you aim for in Overwatch 2? When playing any competitive shooter, 60FPS is the bare minimum you’re going to want, though striving for anything over 120FPS is really where you’re hoping to sit. Amaar loves retro hardware and boring games with more words than action. So, he writes about them daily. "
}