{
    "title": "New Cyberpunk 2077 Mod Fixes the AMD FSR 3.0 Frame Generation Ghosting \nIssues",
    "date": "2/16/2024",
    "url": "https://www.dsogaming.com/mods/new-cyberpunk-2077-mod-fixes-the-amd-fsr-3-0-frame-generation-ghosting-issues/",
    "text": "Modder ‘gramern’ has released a new mod that aims to fix the annoying ghosting issues that PC gamers were getting when using the AMD FSR 3.0 Frame Generation Mod. Going into more details, the mod eliminates the most irritating frame-gen ghosting behind cars and motorcycles while driving in a 3rd person view. It also manages to slightly reduce ghosting when driving bikes in first-person view. What this mod basically does is disable Frame Interpolation in the area behind the vehicles. However, the rest of the scene is still being interpolated. As such, you can get higher framerates without the ghosting issues. It’s a clever trick that the modder discovered. And, from the looks of it, it works pretty great. According to gramern, this fix is compatible with both LukeFZ’s and Nukem’s AMD FSR 3.0 Mods. So, if you’ve been using them, you can download this fix from this link. From what we know, CDPR does plan to add native support for AMD FSR 3.0. After all, AMD has included CP2077 in the list of its upcoming games that will support it. However, there is no ETA on when this will happen. So, until then, you’ll have to rely on these mods. If you’re into Cyberpunk 2077, there are some other cool mods you should check out. For instance, you can download the Enhanced Photo Mode Unlocker. There’s also a mod that allows cars to fly, a mod that can significantly improve the game’s draw distance, and other mods that can open up new areas to explore. Oh, and don’t forget these mods that allow you to play as Ciri from The Witcher 3. Additionally, there’s a mod that adds realistic ragdoll physics to finishing moves. Plus, Law Enforcement Overhaul is a mod that enhances the game’s Police System. And there’s even a mod that integrates the OpenAI API which enables ChatGPT support. Let’s also not forget Cyberpunk 2077 HD Reworked. There is also this mod that fixes the game’s broken Ray Tracing Reflections. And finally, this mod restores 100 NPCs that were cut from the game. Have fun! John is the founder and Editor in Chief at DSOGaming. He is a PC gaming fan and highly supports the modding and indie communities. Before creating DSOGaming, John worked on numerous gaming websites. While he is a die-hard PC gamer, his gaming roots can be found on consoles. John loved – and still does – the 16-bit consoles, and considers SNES to be one of the best consoles. Still, the PC platform won him over consoles. That was mainly due to 3DFX and its iconic dedicated 3D accelerator graphics card, Voodoo 2. John has also written a higher degree thesis on the “The Evolution of PC graphics cards.”\nContact: Email "
}