{
    "title": "Best graphics card 2024",
    "date": "2/8/2024",
    "url": "https://www.pcgamesn.com/best-graphics-card",
    "text": "Find the top graphics card for your budget, with tests of all the new GPUs from AMD, Intel, and Nvidia to improve your frames rates and resolution. Samuel Willetts Published: Feb 8, 2024 What is the best graphics card? It’s hard to remember a time when the gaming GPU scene was filled to the brim with so many options, as AMD, Nvidia, and now even Intel all offer compelling graphics card models for frugal and big spenders alike. As such, it can be difficult to identify the perfect pixel pusher for your system, but our hands-on experience with the latest GeForce, Radeon, and Arc cards will make it much easier. When it comes to maximizing your gaming performance, a great graphics card should be your top priority – it’s even more important than having the best gaming mouse or the best PC controller. A GPU is the primary driving force behind your frame rate, but it also determines what resolution and graphics settings you’ll be able to use, including the likes of ray tracing. Each manufacturer also has its own set of strengths, including exclusive features, such as DLSS Frame Generation, which also need to be considered when weighing up your options. While it’s easy to feel like you need to buy one of the latest GPUs, you’d be doing yourself a disservice by not giving previous generations a look too. You can often find what were recently flagship levels of performance at a sizeable discount, but you’ll need to act fast before stock dries up. Why you can trust our advice ✔ At PCGamesN, our experts spend hours testing hardware and reviewing games and VPNs. We share honest, unbiased opinions to help you buy the best. Find out how we test. The GeForce RTX 4070 Super is a remarkable midrange graphics card. It gives you unparalleled ray tracing performance for its price and isn’t bad at rasterization either. Naturally, frame rates for both types of rendering get significantly boosted thanks to Nvidia DLSS 3, to say nothing of its unbeaten image quality via upscaling. The non-super GeForce RTX 4070 is still available to buy for less, but going for the GeForce RTX 4070 Super will ultimately provide more bang for your buck. You’re getting GeForce RTX 4070 Ti-like performance, which is hard to argue with. The main pitfall of the GeForce RTX 4070 Super is its VRAM capacity, topping out at just 12GB. This is more often than not enough for both 1080p and 1440p, but it can sadly present problems at higher resolutions, such as 4K. Read our GeForce RTX 4070 Super review. The AMD Radeon RX 7800 XT may have been a long time coming, but it was certainly worth the wait. For those who aren’t too fussed about ray tracing, this is the graphics card to get. With 16GB of VRAM attached to a 256-bit memory interface, you get a decent memory configuration for the money. This uniquely positions the 7800 XT as the only card at the $500 mark that’s capable of 1080p, 1440p, and even some 4K gaming. It’s the more sensible buy vs the AMD Radeon RX 7700 XT, given that there’s only $50 separating the two. In our testing, the RX 7800 XT actually beat the more expensive RTX 4070 at every resolution up to 4K with ray tracing disabled, sometimes by as much as 17% on average. However, as soon as ray tracing effects enter the frame, it falls behind and has no answer for DLSS 3 either. Read our AMD Radeon RX 7800 XT review. The Nvidia GeForce RTX 4090 is an absolute monstrosity of a graphics card, in every sense of the word. There is no other GPU out there that can compete with its price, performance, or size. If you’re the kind of person who wants to play the best PC games at the highest settings, at the biggest resolution, and with minimal fuss, the RTX 4090 is for you. That is, of course, if you can stomach its staggeringly high $1,599 MSRP and have room enough in your case to house it. Ray tracing or rasterization, the RTX 4090 cannot be beaten, especially when combined with the frame rate boosting powers of DLSS 3. It isn’t the best value option in the RTX 40 series, but that’s nothing new when it comes to flagships. Read our Nvidia GeForce RTX 4090 review. The RTX 4080 Super replaces the original RTX 4080, providing a slightly higher level of performance but, more importantly, a significantly more affordable price tag. With an MSRP of $999, there is simply no better GPU out there for less than a grand. The only graphics card capable of outperforming the RTX 4080 Super in ray tracing is the much more expensive RTX 4090, making it the best choice for RT effects if you’re hoping to spend around $1,000. This does still make it much more expensive than the RTX 3080, but its value remains high. The RTX 4080 Super is slower than the RX 7900 XTX in standard rasterization, but this gap isn’t nearly as wide as when ray tracing enters the picture for these two cards. Combined with DLSS 3, though, we’re talking a whole new level of performance. Read our GeForce RTX 4080 Super review. If your budget can’t stretch to a midrange graphics card, the AMD Radeon RX 7600 is the way to go. There isn’t a perfect GPU in the budget space right now, but the Radeon RX 7600 is the least compromised option for the money. Both the RX 7600 and Nvidia GeForce RTX 4060 come with just 8GB of VRAM. This capacity is fine for esports titles at 1080p but can create problems when higher-resolution textures are enabled. Naturally, 1440p and 4K are off the table for this GPU. Given its low price, we’re surprised how perky this pixel pusher is in the right circumstances. Frame rates are impressive at 1080p with ray tracing disabled, largely beating the GeForce RTX 4060, although we don’t recommend turning on ray tracing effects in demanding games with this graphics card. Read our AMD Radeon RX 7600 review. The first step to figuring out which graphics card is right for you is the same as every other component: budget. The RTX 4090 is only the fastest option for your system if you can afford it, and knowing how much you can spend on a pixel pusher will help greatly narrow down your options. From there, your target resolution, frame rates, and rendering priorities should guide you. While Nvidia GeForce graphics cards will offer superior ray tracing performance, AMD Radeon GPUs may provide greater value in standard rasterization. You can get a general sense for what frame rates you can expect from each graphics card performs at different resolutions by reading our reviews. Here are some guiding principles though, to get you started: Any further questions? Check out the FAQs below: Graphics cards are an essential component of any PC, especially gaming PCs. It’s your graphics card that enables your PC to render and display images. They play a huge role in a PC’s ability to play any specific game. The more powerful graphics cards make use of ray tracing technology and AI to process information as quickly as possible and make your games visually stunning. VRAM is an acronym for ‘video random access memory’ and refers to the built-in memory used by graphics cards. Its purpose is to provide your GPU with a separate, high-speed pool of memory that it can use to store data. More VRAM at your disposal is always a positive as it makes your system less reliant on standard RAM to plug any gaps should your graphics card’s capacity become saturated, thereby reducing the chance of stutters. However, capacity is only part of the story, with the speed of your GPU’s memory and its bus width also influencing memory bandwidth. Most modern graphics cards now come with at least 8GB of VRAM which is usually enough for 1080p gaming, with some exceptions. Higher-quality effects and textures demand higher pools of video memory, though, so we’d suggest opting for a 12GB option if you can afford it. For those of you gaming at 1440p, 16GB is ideal but 12GB will suit you for the most part. Likewise, 20GB is recommended for 4K, but 16GB will serve. Ray tracing refers to the real-time tracing of light to produce more realistic and higher-quality lighting effects than typical rasterized techniques. It has several use cases, including improved shadows, ambient occlusion, reflections, and global illumination. The first ray-tracing-capable graphics cards arrived on the scene in 2018, with the Nvidia GeForce RTX 20 series. AMD joined in on the fun with its Radeon RX 6000 series in 2020, with Intel following with its Arc discrete GPUs in 2022. Toggling on ray tracing options greatly increases GPU load, however, and can have a dramatic impact on frame rates. As such, it’s typically wise to use them in conjunction with performance-enhancing tools such as Nvidia DLSS, AMD FSR, or Intel XeSS. Rasterization is the process through which 3D models are converted into the pixels you see on the screens of the best gaming monitors. The better a graphics card is at doing this, the smoother your experience of playing your favorite games – when done well, games will look fantastic, when done poorly, games can look blurry and washed out. GeForce RTX graphics cards offer a more feature rich experience than those sporting a GTX badge and provide superior levels of performance too. Comparing GPUs of the same class (e.g. a GTX 1080 against an RTX 2080) will always favor the newer RTX model. The main distinctions between GTX and RTX graphics cards are ray tracing and DLSS support. Every RTX GPU is capable of using DLSS Super Resolution to boost frame rates via upscaling, in addition to improving visuals through ray-traced effects. Meanwhile, GTX pixel pushers don’t have access to either. As such, we don’t recommend picking up a GTX graphics card if it can be helped as RTX options simply provide better value. Real-time ray tracing has only been a part of games since 2018, meaning that every game released before then won’t feature the technology unless it’s been patched in since then. However, it’s not a given that every game release after that time will feature ray-traced effects. Many big games, such as Fortnite and Cyberpunk 2077 offer ray tracing options, and the number of examples continues to grow all the time. Now, with the advent of RTX Remix, it won’t be long before many classics join newer releases in basking in the light of ray tracing. Samuel Willetts                 Sam has spent the past two decades tinkering with computers, a tradition he proudly continues as a Hardware Editor for PCGamesN. For all things systems and components, he's your man. You'll regularly find his hands inside a PC, swapping out components from the likes of AMD, Intel, and Nvidia as fast as you can say Windows. Otherwise, you'll find him on the showfloor of CES and Computex, talking the night away about the latest pieces of shiny silicon. You may also know him from outlets such as Custom PC, PC Gamer, Pocket Tactics, T3, and TopTenReviews. "
}