{
    "title": "Ken Fisher Portfolio: 12 Biggest Positions",
    "date": "2/25/2024",
    "url": "https://finance.yahoo.com/news/ken-fisher-portfolio-12-biggest-121327656.html",
    "text": "In this piece, we will take a look at Ken Fisher's latest investment portfolio and the 12 biggest positions. If you want to skip our overview of Fisher, his investment firm, and the broader U.S. stock market and macroeconomic environment, then you can take a look at Ken Fisher Portfolio: 5 Biggest Positions. Ken Fisher is one of the richest people in the world courtesy of his hedge fund Fisher Asset Management. The fund had $203 billion in investments spread across its portfolio according to filings with the SEC. Fisher set up his hedge fund nearly five decades ago in 1979 and served as its CEO until 2016 before relinquishing the role. Right now, he's the Executive Chairman of Fisher Investments and holds the title of co-chief investment officer along with Jeff Silk. A $203 billion investment portfolio is no small achievement, even if the highly risky nature of the hedge fund industry sees the biggest players such as Ken Griffin's Citadel and Seth Klarman's Baupost often take leverage to fund their bets and double their returns. Investment portfolios of this size mean that not only do Fisher Investment's clients have to trust the firm, but also that the hedge fund has to demonstrate that it is able to outperform either the market or the economy or at least serve as a buffer against sharp capital depreciation during times of economic turmoil. The start of the year is the tone setting mood for stock markets, and for Fisher Investments, the year did not miss out on a beat after the firm had to jump in to release an unusual press release. This press release countered a report by the Wall Street Journal that had stated that Ken Fisher's firm, over which he holds 100% control through a trust that he shares with his wife, was being sold to the Boston, Massachusetts based private equity firm Advent International. The WSJ was not the only publication that cited anonymous sources for its report, as Bloomberg also published a similar piece which outlined that Advent had had talks to  \"acquire billionaire Ken Fisher's eponymous Fisher Investments, according to a person with knowledge of the matter\" but also went on to quote Fisher Investment's response that bluntly denied any such speculation. In fact Fisher's firm, which is quite widely covered in the press and is known for its founder's ability to generate buzz, was quite hard hitting its response. Its press release bluntly stated: Fisher Investments is not being bought by Advent International, or anyone else—plain and simple. The story also had numerous other inaccuracies. Had The Wall Street Journal's reporters bothered to verify the facts, we would have corrected their reporting. Instead, The Wall Street Journal printed the rumors first and followed up with us last. The WSJ's coverage had speculated that not only was Advent having 'talks' to acquire Fisher Investments, but that the hedge fund might see other partners emerge for a deal. Reading Fisher's press release, while it did deny that a transaction was not officially underway, the text nevertheless missed out on sharing any details of potential 'talks' - leading to the assumption that since there were no talks for a potential sale, there was no need to deny them in the press release. Moving forward to other news in 2024, the year has started off by providing investors with the latest data set to read the tea leaves and see where the Federal Reserve's current interest rate hiking cycle will be at the year's close. This data set is the retail sales for January which showed an 0.8% annual drop that came as part of a release that saw the Commerce Department also revise down the data for December. On the surface, this data paints a softer picture of the economy that shows that as consumers face the pinch of high interest rates, they are starting to cut down their spending. However, economists also preached caution after the release, as they speculated that while it is possible that a spending, and by extension economic, slump had led to the sales falling, the contribution of cold temperatures across the U.S. could not be completely ignored in the aftermath of the release. However, and as has been the case for more than a year now, the optimistic data set was followed by the exact opposite just a day later. On Friday, data from the Labor Department revealed that import prices jumped by 0.8% in January, which was the high reading since the first quarter of 2022. In short, nearly a two year old record of an inflationary indicator was broken, and perhaps unsurprisingly, when paired by the producer price index (PPI)'s 0.3% jump in January, futures linked to the S&P 500 and other indexes dropped. With the fourth quarter hedge fund filing season well on its way, we decided to see which stocks Fisher Investments is piling into as the year gets off to a roaring start. Some notable names are Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and Amazon.com, Inc. (NASDAQ:AMZN). Ken Fisher of Fisher Asset Management Our Methodology To make our list of the biggest stakes in Ken Fisher's investment portfolio, we ranked Fisher Investments' fourth quarter of 2024 investment portfolio by the dollar value of the stakes and picked out the biggest positions. Fisher Investments' Q4 2023 Stake: 2.6 billion Eli Lilly and Company (NYSE:LLY) is an American pharmaceutical and healthcare giant headquartered in Indianapolis, Indiana. Amidst the fire injected into its stock by weight loss drugs such as Mounjaro, Eli Lilly and Company (NYSE:LLY) scored a big win in February 2024 when Morgan Stanley increased its share price to $950 for a whopping $145 increase. This makes the share price target the highest on Wall Street, and the average Eli Lilly and Company (NYSE:LLY) share price target is $757 - below the current share price. As of Q4 2023 end, 102 out of the 933 hedge funds part of Insider Monkey's database had held a stake in Eli Lilly and Company (NYSE:LLY). Ken Fisher's Fisher Asset Management was the firm's largest hedge fund shareholder in Q4 due to its $2.6 billion stake. Along with Apple Inc. (NASDAQ:AAPL), Microsoft Corporation (NASDAQ:MSFT), and Amazon.com, Inc. (NASDAQ:AMZN), Eli Lilly and Company (NYSE:LLY) is one of Fisher Investment's top stock picks. Fisher Investments' Q4 2023 Stake: $2.7 billion Adobe Inc. (NASDAQ:ADBE) is an American software company headquartered in San Jose, California. It is one of the biggest companies in the world when it comes to productivity software and products. The shares are rated Strong Buy on average, and the average analyst share price target is $452.57. By the end of last year's fourth quarter, 105 out of the 933 hedge funds tracked by Insider Monkey were the firm's shareholders. Adobe Inc. (NASDAQ:ADBE)'s biggest investor among these is Ken Fisher's Fisher Asset Management as it owns $2.7 billion worth of shares. Fisher Investments' Q4 2023 Stake: $3 billion The Home Depot, Inc. (NYSE:HD) is one of the biggest pureplay home improvement product retailers in the world. Ahead of a key earnings report that will help investors form expectations for the key retail market's future in 2024, the firm is heading to its report after having beaten analyst EPS estimates in all four of the latest quarters. After digging through 933 hedge fund portfolios for 2023's fourth quarter, Insider Monkey found that 70 had bought and owned The Home Depot, Inc. (NYSE:HD)'s shares. Peter Rathjens, Bruce Clarke, and John Campbell's Arrowstreet Capital was the firm's second largest stakeholder since it owned 1.5 million shares that were worth $528 million. Fisher Investments' Q4 2023 Stake: $3.2 billion Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is the Taiwanese contract chip manufacturer whose production facilities form the backbone of global high end semiconductor fabrication. 2024 has seen the firm enter the A.I. era on a strong note, with management sharing during the latest earnings report that Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is in a strong position to capture any A.I. semiconductor demand. Insider Monkey's December quarter of 2023 survey covering 933 hedge funds revealed that 105 were the firm's shareholders. Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM)'s biggest hedge fund investor was Fisher Investment since it held a $3.2 billion stake. Fisher Investments' Q4 2023 Stake: $3.8 billion The presence of ASML Holding N.V. (NASDAQ:ASML) after TSMC on our list of Ken Fisher's biggest investment positions is apt since without its machines, TSMC would be unable to make most of its high-end products. ASML is virtually a monopoly when it comes to making scanners that can produce advanced chips with feature sizes 5-nanometer and below, which also positions it favorably should an investor seek to capitalize on growing global spending on artificial intelligence processors and graphics processing units. As 2024's final quarter ended, 62 out of the 933 hedge funds profiled by Insider Monkey had bought ASML Holding N.V. (NASDAQ:ASML) 's shares. After Fisher's firm, the company's largest stakeholder was Rajiv Jain's GQG Partners due to its $1 billion investment. Fisher Investments' Q4 2023 Stake: $3.9 billion Salesforce, Inc. (NYSE:CRM) is a software company that enables businesses to manage their customer relationships and the associated data. Like most other technology companies, the firm also expanded its AI offerings in February 2024 as it introduced a new bot to help users sort through their work chats. During December 2023, 131 out of the 933 hedge funds covered by Insider Monkey's research were the firm's stakeholders. The biggest Salesforce, Inc. (NYSE:CRM) shareholder out of these is Ken Fisher's Fisher Asset Management due to its $3.9 billion stake. Fisher Investments' Q4 2023 Stake: $4.1 billion Advanced Micro Devices, Inc. (NASDAQ:AMD) is the American semiconductor designer that makes and sells processors and graphics processing units. Its one of the few companies in the world allowed to make and sell x86 computing chips, which alongside other chips such as GPUs and neural processors, can play a pivotal role in any global up-scaling of semiconductors capable of supporting AI tasks. As of Q4 2023 end, 120 out of the 933 hedge funds part of Insider Monkey's database had bought Advanced Micro Devices, Inc. (NASDAQ:AMD)'s shares. Philippe Laffont's Coatue Management was the second largest investor since it held $1.8 billion worth of shares. Microsoft Corporation (NASDAQ:MSFT), Advanced Micro Devices, Inc. (NASDAQ:AMD), Apple Inc. (NASDAQ:AAPL), and Amazon.com, Inc. (NASDAQ:AMZN) are some notable Ken Fisher stocks.  Click here to continue reading and check out Ken Fisher Portfolio: 5 Biggest Positions.  Suggested articles: 25 Most Valuable Medical Device Companies in the US 18 High Growth Low PE Stocks 15 Best Stocks For Long Term Growth Disclosure: None. Ken Fisher Portfolio: 12 Biggest Positions is originally published on Insider Monkey. Related Quotes "
}