{
    "title": "I swapped out my GPU for an AMD APU and I'm not looking back",
    "date": "2/17/2024",
    "url": "https://www.xda-developers.com/i-swapped-out-my-gpu-for-an-amd-apu-and-im-not-looking-back/",
    "text": "I was able to create a more compact gaming PC that matched my needs The AMD Ryzen 7 8700G is a powerful 8-core processor with excellent graphics support. Instead of having just two cores like other Ryzen CPUs, the 8700G is a specialized APU with more advanced integrated Radeon graphics. Where AMD Ryzen X3D processors such as the AMD Ryzen 9 7950X3D are better for gaming with discrete GPUs, thanks to their impressive cache numbers, a G-class chip such as this 8700G makes it possible to enjoy numerous PC games without a dedicated GPU. I positively reviewed the AMD Ryzen 7 8700G after being surprised by just how capable the processor is, and that's before AMD was able to roll out a patch to improve performance by stopping the APU from cutting back power to maintain lower temperatures. With its handicapped performance, the 8700G was still able to run the latest games at 1440p without any noticeable sluggish gameplay. Combining the GPU and CPU into a single package not only lowers power usage but also temperatures inside the PC case. If you wish to create a gaming PC with a compact chassis to resemble a games console, an APU is the way to go. Using one such as the 8700G would allow you to use a smaller case, fewer fans to keep everything cool, and this would make for a quieter gaming environment. Eight cores are present on the 8700G with the ability to boost up to 5.1 GHz. The AMD Radeon 780M has 12 cores at 2.9 GHz. All of this is on a package with a TDP of just 65W. In my testing, 1440p gaming was possible but my main rig is connected to a 49-inch ultrawide 5K2K (5120 x 1440p) panel. Powering this resolution is a challenge for even the Nvidia GeForce RTX 4070 that was previously installed inside my PC. Moving to the AMD Ryzen 7 8700G is a downgrade compared to the dedicated GPU, but this process allowed me to swap the case, RAM (moving from an Intel Core i5-13600K), and CPU cooler. I was able to use a small form factor (SFF) chassis with fewer fans, resuting in less noise emanating from the vents. I kept the same screen and simply turned down the resolution in games to 16:9 and already understand not every game supports a 32:9 aspect ratio. My primary games also don't demand much graphical processing. Factorio and X4: Foundations are more CPU intensive, which the eight CPU cores are able to handle. Then there's Terraria, which will run on just about anything. Games where I had to be more conservative with in-game settings included Mount & Blade: Bannerlord and Elden Ring. I don't play PC games as often as I used to and using an APU better matches what I primarily use the main system for. The price of graphics cards is now almost akin to the start of a bad joke. The most affordable Nvidia GeForce 40 series GPU is the GeForce RTX 4060 at $300. It's a graphics card designed for 1080p gaming and while it is technically faster than the RTX 3060 Ti from the previous generation of cards, I wouldn't recommend moving up to 1440p with this GPU. That means you're spending $300 for a GPU that can only handle games at Full HD, the lowest recommended screen resolution for PC gaming. Nvidia's GeForce GTX 1060 cost just $200 and it wasn't the most affordable GPU of that generation. You could spend less than $100 on a graphics card, something that's not remotely possible today without scouring the used market for older GPUs. The most capable 4K GPU is the RTX 4090, a GPU with an MSRP of $1,600 and a listed price of $2,000 if not more. It's simply not feasible for most gamers, but even the RTX 4080 is $1,000 ... for a single PC component. That's where an APU such as the AMD Ryzen 7 8700G comes into play. This is a processor that combines the CPU and GPU together into a single package. It's also about the same price as the RTX 4060, yet manages to include eight physical processing cores for handling non-GPU tasks. An APU will never be as fast as its CPU counterpart, in this case the Ryzen 7 8700X, nor will it be able to outmatch similarly priced GPUs. This is due to the integrated GPU sharing system memory instead of having a dedicated VRAM. Bearing this in mind, I have been able to play a variety of games at 1080p and even 1440p with the AMD APU with stable frame rates and decent visual settings. Creating your dream gaming PC with affordable hardware and a 1080p or 1440p screen is where the Ryzen 7 8700G makes the most sense. You can get away with larger screens, like mine, if you don't play too many more demanding PC games. I've compiled a list of parts that would work well with this APU, allowing you to create a compact PC with excellent performance for work and play. Because the AMD Ryzen 8000 series of processors require DDR5 RAM and an AM5 motherboard, that's precisely what I will be recommending, alongside budget-friendly storage. For software, you could install and use Ubuntu over Windows 11 and save even more money. Using Valve's Proton on Linux will allow you to play most of your favorite games.       The total price of this PC build, including the AMD Ryzen 7 8700G, comes to about $900 at the time of writing. This is a complete PC build with a motherboard, RAM, power supply, CPU, case, and storage. The case I've chosen comes with three 120 mm fans that are more than enough to keep the internals cool with the included AMD CPU cooler.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Richard is a Senior Editor at Valnet and has been covering the technology industry for almost two decades. He's been building PCs since young and when not creating content, you can often find him inside a chassis somewhere. If you're looking for tons of storage space, this deal's going to be right up your alley. Get tinkering for cheap. Nvidia, in collaboration with HuggingFace and ServiceNow, has released StarCoder2, and it will help you generate code. If you use two PCs as part of the same desk setup, a KVM switch could be the way to simplify your workstation. Keep on top of cleaning the insides of your PC to maximize performance. Microsoft introduced a handful of features to Excel last month, including the general availability of the new Office theme for Mac and Windows users. "
}