{
    "title": "MSI announces all AMD 600 and most Intel 600/700 motherboards now support \nDDR5 64GB modules, up to 256GB ...",
    "date": "2/24/2024",
    "url": "https://videocardz.com/newz/msi-announces-all-amd-600-and-most-intel-600-700-motherboards-now-support-ddr5-64gb-modules-up-to-256gb-capacity",
    "text": "The DDR5 memory support for 16GB to 64GB modules.  We’re still in the early phases of DDR5 memory technology, which kicked off just two years ago with the introduction of Intel 600 series motherboards and initial support for DDR5-4800 memory. Some companies swiftly announced faster overclocked modules with Intel XMP support, but progress was sluggish, and it took over a year for DDR5 pricing to start making sense for the average consumer. Recognizing that DDR5 support would take time, Intel made a decision to maintain compatibility with DDR4 memory on their motherboards, and many such boards are still available in the market, supporting the older standard. However, both Intel and AMD are now shifting away from older memory, and their upcoming platforms will be exclusively DDR5 compliant. AMD 600-series motherboards exclusively support DDR5 memory, and just a few months after launch, pricing for DDR5 memory has settled at a reasonable level. Furthermore, the introduction of Ryzen 7000X3D series processors that do not require fast memory modules has increased interest in upgrading to newer platforms.   MSI PRO X670P WIFI motherboard supports DDR5 256GB memory,Source: MSI  In the beginning, DDR5 was offered in 8GB, 16GB, and 32GB modules. Later, memory manufacturers introduced 24GB and 48GB modules, providing gamers with more options and upgrade paths. This is particularly beneficial for those who don’t need a hefty 32GB capacity but find 16GB insufficient. A recent addition to the lineup is the availability of 64GB modules, catering to the needs of high-end systems and servers. With this capacity, dual-slot motherboards can fully support 128GB, while those with four slots can accommodate a whopping 256GB. In practical terms, gamers might find it wise to stick to dual-slot configurations, ensuring their systems operate with the fastest XMP and AMD EXPO OC profiles, regardless of the number of memory interfaces available. Now turning to AMD support, all the AM5 models now support the enhanced memory capacity, including X670, B650, and A620 motherboards. The dedicated BIOS for these motherboards were released in January 2024, meaning all the MSI AM5 motherboards are ready to handle up to 256GB of memory capacity. — MSI MSI has officially stated that they have completed the implementation of DDR5 64GB memory support across all AMD AM5-based motherboards (the 600-series). In contrast, updates for Intel 600 and 700 series motherboards are slated to continue rolling out through February and March. Source: MSI We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}