{
    "title": "AMD FSR 3 Is Out Now in Starship Troopers: Extermination, Will Also Be \nAvailable Soon in The Thaumaturge",
    "date": "2/10/2024",
    "url": "https://wccftech.com/amd-fsr-3-is-out-now-in-starship-troopers-extermination-will-also-be-available-soon-in-the-thaumaturge/",
    "text": "AMD FSR 3 has been added to the cooperative first-person shooter game Starship Troopers: Extermination with Update 0.6.2. The game developed by Offworld Industries (the team behind Squad) debuted on Steam Early Access last May, finding a small but faithful community as shown by the 89% average user review score. Starship Troopers: Extermination only supported Intel XeSS at the early access launch, but this week's patch adds AMD FSR 3 as well as NVIDIA DLSS 2 (Super Resolution), giving more options to AMD and NVIDIA users. Right now, though, the game will automatically select the recommended render scale option for your setup whenever you pick the upscaler; this will be fixed in a future update when the game will introduce a menu option to pick between Performance, Quality, and Balanced presets. Offworld Industries also implemented support for Unreal Engine 5's Lumen Global Illumination. Players can now select software-based Lumen RT (which is a compute shader) or hardware-based Lumen RT, based on their hardware. Moreover, the following server and client performance improvements were added to the game as shown in the changelog: This brings the total number of AMD FSR 3 compatible games to 13: Soon, the number will go up to 14, thanks to The Thaumaturge, whose AMD FSR 3 support has been confirmed by AMD itself via email. The Unreal Engine 5 powered isometric RPG by Fool's Theory (Seven: The Days Long Gone, The Witcher remake) launches on February 20. The following day, Inflexion Games will release Nightingale in early access. The game supports both NVIDIA DLSS 3 and AMD FSR 3, bringing the latter's list to a grand total of 15 games. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}