{
    "title": "AMD Mulls Upgrading Its MI300 AI Accelerators to HBM3e Memory",
    "date": "2/28/2024",
    "url": "https://www.extremetech.com/computing/amd-mulls-upgrading-its-mi300-ai-accelerators-to-hbm3e-memory",
    "text": "AMD officially launched its MI300 family of accelerators in November 2023, and in a nod to the breakneck pace of the AI industry, is already talking about upgrading it for 2024. The MI300 accelerators come equipped with HBM3 memory. Still, in a recent investor call, the company's CTO said it's considering moving to HBM3e, the fastest memory type currently available for data center products. AMD's CTO Mark Papermaster recently delivered a \"fireside chat\" and discussed AMD's incursion into the AI market with its MI300 family of accelerators. The company hopes to take a chunk of the market away from Nvidia, and its work is cut out for it as Nvidia is alleged to control up to 98% of the market. On the call (via Wccftech), Papermaster discussed the company's plans for the MI300 family, including significantly boosting the memory configuration. The existing products use HBM3 memory with eight layers, but Papermaster says AMD has already \"architected\" for both 12 layers and HBM3e. Ironically, Samsung just announced 12-layer HBM3e today, and both companies have been partners in the past, so we'll see if these proclamations are more than just a coincidence shortly. HBM3 has been the de facto memory type for server chips through 2023, as both AMD and Nvidia opted for it on their most advanced GPUs and CPUs. However, to stay on the cutting edge, both companies are trying to upgrade their offerings as soon as possible to maintain an advantage. Nvidia already announced a move from HBM3 to HBM3e for its GH200 Grace \"Superchip,\" which combines the company's fastest Arm-based CPU with its H100 GPU. It's also upgrading the H100 to HBM3e and renaming it H200 as well, and that's expected to launch shortly. If AMD follows through on the same upgrade for MI300, it will improve its chances of competing with Nvidia on equal footing, at least regarding memory bandwidth and capacities. Its MI300A competes directly with the GH200 by offering CPU and GPU on the same package, whereas its MI300X is GPU only. One of the reasons for the memory upgrade could be AMD's somewhat late entry to the market, as Nvidia launched the H100 in 2022 and GH200 in August of last year. As AMD is just now beginning to ramp production of MI300, it will have to contend not only with upgraded H200 and GH200 products but also with Nvidia's next-generation architecture, codenamed Blackwell. Nvidia is expected to reveal it this year, possibly as soon as next month, at its GTC conference for developers. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}