{
    "title": "AMD's Medusa might turn Nvidia to stone",
    "date": "2/23/2024",
    "url": "https://www.fudzilla.com/news/58512-amd-s-medusa-might-turn-nvidia-to-stone",
    "text": "Dark satanic rumour mill suggests it might be worth the wait The dark satanic rumour mill has manufactured a hell on earth yarn suggesting that AMD’s Medusa chip might be really good. The upcoming chip design, leaked on X (formerly Twitter) by Olrak29, shows the chip with Zen 6 CPU cores and RDNA 5 GPU cores, skipping over RDNA 4 for the more advanced part. The earliest we could see Medusa would be late 2025, early 2026 and we know very little about AMD's Zen 6.  In fact, we are not sure what AMD Zen 5, which will power the Ryzen 8000-series chips expected to come out in the middle of 2024, will offer once those chips come out, and that launch is only months away. We can guess based on AMD's promise to stick with its AM5 platform until \"2025+\", among other things. AMD Medusa will probably be the last desktop chip for the AM5 platform, for one, and it is expected to have 2.5D chip link to reduce CPU slowing, something that Intel has already done with its chips. We don't know yet what process node Zen 6's 'Morpheus' CPU cores will be made with, but they may go as low as 2nm for the CPU core design, which would make it one of the most advanced desktop chips on the market when it finally lands sometime in 2025 or 2026. With the addition of RDNA 5 GPU cores AMD seems to want to cram as much power into Medusa as it can. AMD's RDNA 4 graphics design are unlikely to go for the top end, leaving that area to whatever Nvidia makes, and will instead go for more mainstream and gaming parts for that generation. But with RDNA 5 reportedly putting AMD back in the game across the whole range, its possible use in a mainstream Ryzen chip would save a lot of people from having to buy one of the best graphics cards to play their favourite PC games, especially at lower levels like 1080p and 1440p. Given the amazing power of AMD's recent 8000G-series chips, these next-gen Zen 6 chips might be just what we need to help kickstart the cheap PC gaming scene again.   "
}