{
    "title": "Angiogenesis 2024: Findings from the DAVIO 2 trial, assessing EYP-1901 vs \naflibercept for wet AMD",
    "date": "2/3/2024",
    "url": "https://europe.ophthalmologytimes.com/view/angiogenesis-2024-findings-from-the-davio-2-trial-assessing-eyp-1901-vs-aflibercept-for-wet-amd",
    "text": "      SPOTLIGHT - Dr Carl Regillo provided an overview of topline results – and a deep dive into subgroup analyses – of DAVIO 2 trial data At the virtual Angiogenesis, Exudation, and Degeneration 2024 conference on 3 February, retina specialists from around the globe explored their recent research. Carl D. Regillo, MD, FACS, FASRS, focused on recent data from the DAVIO 2 trial in his presentation. Watch this video to learn more about the subgroup analyses and what's coming up next for the phase three clinical trial.  Note: This transcript has been lightly edited for clarity. Hattie Hayes: Hello, I'm Hattie Hayes, editor of Ophthalmology Times Europe. Joining me today is Dr Carl Regillo, a speaker at this year's Angiogenesis Symposium. His presentation, a subgroup analysis of the DAVIO 2 results, is our topic of discussion. Dr Regillo, thank you so much for joining me. Would you mind giving us a brief overview of your presentation from earlier today? Carl D. Regillo, MD, FACS, FASRS: Sure, I'm happy to and thank you for having me. What I presented at angiogenesis was the second part of a two-part presentation. My colleague, Charlie Wykoff [Charles C. Wykoff, M.D., PhD], presented ahead of me the topline data to the DAVIO phase 2 clinical trial. And that's for EYP-1901 versus aflibercept in this head to head, randomised clinical trial. What I did is I presented part 2, which was the subgroup analysis. So basically, we're taking a deeper dive into the data, looking at potential factors that may have influenced the outcomes, such as the number of treatments ahead of time that a patient may have received before they were enrolled in the study, the severity of their AMD, and so forth. I can go into greater detail there. But a little bit of an overview: what this clinical trial was, again, phase 2, double mass randomised clinical trial that compared EYP-1901. That's vorolanib injected individually as a biodegradable insert. It was injected in one of two doses in patients with previously treated neovascular AMD, and patients had to have at least two prior anti-VEGF injections to be eligible for this trial. So they had to have at least two over a six-month timeframe. So it actually selected for patients that were relatively frequently treated. We compared the two doses, these were randomised, to two doses of EYP versus standard-of-care aflibercept injections dosed every 8 weeks. All arms got three aflibercept injections as a loading phase, even though these were previously treated patients, and the primary endpoint was mean change in BCVA, from baseline, averaged over weeks 20 to 32, which was 6 months after the EYP injection and the two treatment arms. So we're comparing EYP in two doses versus aflibercept in previously treated neovascular AMD. And I should say, at the start, as Charlie Wykoff presented, the trial was successful in meeting its primary endpoint. Both doses of EYP were non-inferiority aflibercept, 6 months after the last treatment, or at average weeks 28 - 32. So that's very important. We know that the three arms of the study were well balanced at baseline, we saw essentially equivalent BCVA, essentially no change, minimal change from baseline, again previously treated. And that goes for both BCVA and OCT central subfield thickness. So did it work as well as aflibercept injections every 8 weeks? Yes, it sure did. And that's the good news. And what about a deeper dive, as I mentioned? So what we did is we analysed specific subgroups, and probably the most important subgroup is we needed to know whether eyes that got supplemented – EYP-treated arms could get supplemented with aflibercept. And in the clinical trial, it was pretty impressive that 64% of patients in the EYP arms did not require a supplemental injection up to that primary endpoint, that's week 32. So two-thirds of patients do not require any supplements. But the question remains, did any supplementation somehow drive the data, somehow influence the BCVA or OCT outcomes. In the first subanalysis we did, it did not show any difference between the entire patient population and those patients in EYP, both EYP arms that did not require any supplemental injections, they did just as well. That was about two-thirds of the patient population. And then we again did a whole series of subgroup analyses based on on baseline features of these patients. And that included baseline BCVA being very good or not so good. It included OCT at different levels. And it also included number of treatments that the patient may have had before enrollment. Did they have less than five or greater than six treatments in the previous 12 months? Did any of this influence the outcomes? And the answer was no. So regardless of any of the subtypes we looked at, the outcomes were essentially the same. So that's the, the essence of the subgroup analysis that I presented. Hattie Hayes: Do you think that there's anything in these data that others might find surprising? Dr Regillo: No, in fact, the good news is that there wasn't, there wasn't any surprise. If we saw a particular AMD, neovascular AMD subtype, that influenced the outcome, that would be useful to know, especially when you want to fine-tune the inclusion criteria for the next step. And then next step is going to be a phase three pivotal registration study. And in fact, my presentation at the end went into some detail on the study design, because study designs are evolving. And this is unique. This is sustained delivery of a tyrosine kinase inhibitor molecule rolling in. And it's intended to give a durable anti-VEGF-like effect for at least for 6 or more months. And so the clinical trial designs are going to be a little different than what we're accustomed to with biologic versus biologic injections individually. So near the end of the presentation, I went into some detail. What we've decided upon for the phase three trial design is actually going to be very, very similar to DAVIO 2, it's also going to be a three-arm study, randomised, double masked, controlled clinical trial with the control arm, the third arm, being the same aflibercept on-label every 8 week injections. And it is going to enroll patients that are previously treated with all the same eligibility criteria, inclusion/exclusion criteria, allarms are going to be loaded. And we're also going to have a low and high dose for EYP, probably very similar to what we used in phase two. So what's the difference between phase two and phase three? Well, it's going to be a much larger study, the endpoint is going to be the traditional change in BCV at 12 months. So 1 year primary visual acuity endpoint. It's going to be a 2 year clinical trial because it needs to assess ongoing efficacy and safety over 2 years. And here, we're going to be injecting EYP at 6 month intervals. So patients enrolled in a clinical trial over a 2 year timeframe will have four injections of EYP. So we'll see how this performs with multiple dosing. Keep in mind, DAVIO phase two is only one injection of EYP, at the beginning of the trial, and then we looked 6 months later. So we're going to see some key differences that will make this global large scale study, potentially allow for approval in the United States and potentially elsewhere. And we're excited that this study is going to start sometime later this year. Hattie Hayes: That's exciting. Thank you for giving me those insights into the future plans. What are the key points you hope your audience will take away from this research? Dr Regillo: Well, first and foremost, DAVIO 2, the phase two clinical trial comparing EYP at two doses versus aflibercept, met its primary endpoint. That's very key. What I didn't mention, and Charlie went into detail on this, was a very good safety profile, which was key. So we saw the noninferior primary endpoint being made with an excellent safety profile, and strong evidence here in the phase two level, that we could achieve good anatomical control, and good visual acuity maintenance, with the majority of patients not needing a supplement, not needing anything more than EYP over the course of 6 months. So that tells us that it gives us a durable effect over 6 months in most patients. And regardless of the subgroup that we looked at, at baseline, the subgroup analysis that we performed, the outcomes were the same. And so that meant the EYP worked well, for wide spectrum of neovascular AMD previously treated patients. We're starting the phase three study this year. And actually, this product has also been tested at Phase Two for both NPDR and DME, and later this year. We'll have a readout for the NPDR study. So that's also exciting. Hattie Hayes: That's wonderful. Thank you so much for sharing your research and the work of your colleagues. I really appreciate it. Dr Regillo: You're very welcome, my pleasure. Thank you.  Increase in the incidence rate of conjunctival melanoma in Australia Investigators analysed the incidence and mortality rates from conjunctival melanoma cases over a 32-year period Global partnership targets ROP in premature infants An AI-supported telemedicine effort from Siloam Vision and Orbis International Exonate shares results from Phase Ib/IIa trial of EXN407 eye drops for DR and DME In addition to the primary safety and tolerability endpoints, the study also saw signals of biological response from EXN407 Genetic editing untangles one strand of the AMD web The opportunities and challenges presented by CRISPR manipulation Outlook Therapeutics receives positive CHMP opinion for bevacizumab for wet age-related macular degeneration The European Commission is expected to make a decision about the application before the end of June An alternative approach to spectacle independence Laser blended vision is a proven modality for presbyopia treatment, but its principles can be reproduced with EDOF IOLs Increase in the incidence rate of conjunctival melanoma in Australia Investigators analysed the incidence and mortality rates from conjunctival melanoma cases over a 32-year period Global partnership targets ROP in premature infants An AI-supported telemedicine effort from Siloam Vision and Orbis International Exonate shares results from Phase Ib/IIa trial of EXN407 eye drops for DR and DME In addition to the primary safety and tolerability endpoints, the study also saw signals of biological response from EXN407 Genetic editing untangles one strand of the AMD web The opportunities and challenges presented by CRISPR manipulation Outlook Therapeutics receives positive CHMP opinion for bevacizumab for wet age-related macular degeneration The European Commission is expected to make a decision about the application before the end of June An alternative approach to spectacle independence Laser blended vision is a proven modality for presbyopia treatment, but its principles can be reproduced with EDOF IOLs 2 Commerce Drive Cranbury, NJ 08512 609-716-7777 "
}