{
    "title": "As AI Continues To Dominate Headlines, Copper's Critical Role Comes Into \nFocus - Advanced Micro Devices (",
    "date": "3/15/2024",
    "url": "https://www.benzinga.com/trading-ideas/long-ideas/24/03/37757502/as-ai-continues-to-dominate-headlines-coppers-critical-role-comes-into-focus",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Artificial intelligence has the potential to be one of the most impactful technologies in human history – and one of the most lucrative. Analysts at Bank of America BA believe the technology will add up to $15.7 trillion to the global economy by 2030. Much has been made about the technology itself and the value it creates downstream – it certainly has the potential to revolutionize people's daily lives – but upstream, the technology is already having a big impact. The most obvious example is Nvidia NVDA. The company creates some of the most powerful and advanced chips on earth that are necessary to power AI servers and has positioned itself as the hottest AI stock, up over 260% since this time last year. Nvidia, its primary manufacturing partner, Taiwan Semiconductor TSM; its competition, Advanced Micro Devices AMD; and others involved at the same level of the AI value chain all stand to create a staggering amount of wealth as the technology continues to mature. They are, as the old metaphor goes, selling picks and shovels to the gold miners. Further upstream still, are the precious metals and critical minerals that enable AI and tech as a whole to function. Although silicon is perhaps the most well-known component of computer chips, copper too plays a crucial role. The highly conductive metal is used to connect the semiconducting components within an integrated circuit, like axons in a brain. And equally important, it is used to transmit power to the circuit. And beyond chips, the electrical grid at large relies heavily on copper. It is used in the turbines that convert mechanical energy into electrical energy, it is used in the batteries that store that power, and it is used in the wires and transformers that carry that power throughout the entire grid. In short, our modern world would not function as it does without it. AI, EVs, decarbonization, and other macro trends are increasing the need for copper. Global demand is expected to reach 36.6 million metric tons by 2031, according to research by McKinsey & Company. That is up from the current demand of 25 million metric tonnes. What's more, the researchers expect global supply in 2031 to fall short by 6.5 million metric tonnes. Global ability to mine and recycle copper is increasingly falling short. Recently, an agreement was reached by leading Chinese copper smelters to cut production in the country due to shortages in the supply of raw materials. This confluence of a steadily increasing demand for copper and a growing supply crunch leads many to see copper – and those who mine and process it – as ripe for investment. Ivana Delevska, and the team at Spear Invest, believe these trends to be very real. Her flagship fund, Spear Alpha ETF SPRX, is invested in the AI value chain, up and downstream. The fund has holdings in companies that utilize AI directly, like ZScaler ZS; to companies that produce the hardware, like Nvidia; all the way upstream to companies that mine and process the copper, like Freeport-McMoRan FCX or Teck Resources TECK. These industrial holdings that are very far upstream from the tech itself belie a deep understanding of the big picture and thus far, it seems to be working. SPRX is up roughly 70% since this time last year. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}