{
    "title": "Seven-year-old AMD gaming GPU continues to stick around — low-profile RX \n550 arrives for SFF PCs",
    "date": "3/30/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/seven-year-old-amd-gaming-gpu-continues-to-stick-around",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Polaris won't fade away. The Radeon RX 550 may have lost its touch but the seven-year-old graphics is still very present in the market. Although the Radeon RX 550 cannot compete against the best graphics card, ASRock has released a new custom model that caters to compact and small-form-factor systems. The ASRock Radeon RX 550 Low Profile 4GB (RX550 LP 4G) is a dual-slot graphics card with a 6.69 x 2.71 inches (170 x 69 mm) footprint. It will fit inside most, if not all, compact cases. Nonetheless, it doesn't stick to a low-profile, passive design. Instead, ASRock implemented a dual-fan cooler on the Radeon RX 550 Low Profile 4GB. Fortunately, the two tiny cooling fans only spin up when the GPU temperature hits a certain threshold, so the graphics card is dead silent unless you're pushing it heavily or your case lacks good airflow. Specification-wise, the Radeon RX 550 belongs to AMD's Polaris generation of Radeon graphics cards. Polaris came out in 2017 and was the predecessor to Vega. The Radeon RX 550, in particular, employs the Lexa silicon, a product of AMD's Graphics Core Next (GCN) 4.0 architecture and GlobalFoundries' 14nm manufacturing process. Polaris has reached the EOL (end-of-life) status, but vendors typically have leftover silicon that they still need to offload. The Radeon RX 550 Low Profile 4GB features 512 Stream Processors (SPs) that can clock up to 1,100 MHz. The graphics card also wields the 4GB configuration. There are models with just 2GB. The GDDR5 memory on ASRock's model runs at 6 Gbps across a 128-bit interface. The configuration works out to a maximum memory bandwidth of 96 GB/s. The Radeon RX 550 Low Profile 4GB is superior to many integrated graphics solutions on the market and may perform well in casual gaming. Don't expect to run everything at maximum settings or 4K resolution with the graphics card. The Radeon RX 550 is a 50W graphics card that will merrily sip all the power it needs from the expansion slot. It's designed for PCIe 3.0 x8, so anything faster is just overkill. Being a product that focuses on compactness, the Radeon RX 550 Low Profile 4GB only provides one HDMI 2.0 port and one DisplayPort 1.4 output. The DVI port, usually on the bigger models, isn't on this low-profile model. It's not a significant loss since the maximum supported resolution is 5,120 x 2,880 at 60 Hz. ASRock also includes a full-height bracket for the graphics card if you want to use it on a standard case. ASRock recently listed the Radeon RX 550 Low Profile 4GB on the graphics card's availability and pricing are unknown. For reference, though, custom Radeon RX 550 graphics cards start at $75. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Zhiye Liu is a Freelance News Writer at Tom’s Hardware US. Although he loves everything that’s hardware, he has a soft spot for CPUs, GPUs, and RAM. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 Intel CEO's compensation still trails AMD CEO's by half — despite a significant boost in 2023 By Zhiye LiuMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}