{
    "title": null,
    "date": "3/22/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/AMD/pressreleases/24982399/did-nvidia-just-put-a-nail-in-amds-artificial-intelligence-ai-coffin/",
    "text": "Nvidia(NASDAQ: NVDA) made a big splash at the company's annual GPU Technology Conference (GTC), called the \"Woodstock of artificial intelligence\" (AI). During CEO Jensen Huang's keynote address on Monday, he introduced the long-awaited Blackwell architecture. He called the new flagship processor, the GB200 Grace Blackwell Superchip, the \"world's most powerful chip\" for AI. Beyond the industry-leading technical specifications, a revelation on Tuesday is being viewed as a blow to rival Advanced Micro Devices(NASDAQ: AMD) and could significantly hamper the company's AI aspirations. The GB200 Grace Blackwell Superchip. Image source: Nvidia. There were great expectations regarding Nvidia's Blackwell architecture, and the company did not disappoint. The Blackwell graphics processing unit (GPU) boasts 208 billion transistors -- up from 80 billion for its predecessor. The GB200 combines a Grace Hopper CPU (central processing unit) with two B200 Tensor Core GPUs and a lightning-fast chip-to-chip link to form a \"single, unified GPU.\" Nvidia also introduced the GB200 NVL72, a \"multi-node, liquid-cooled, rack-scale system ... which combines 36 Grace Blackwell Superchips, which include 72 Blackwell GPUs and 36 Grace CPUs interconnected by fifth-generation NVLink.\" The company notes that its rack-scale system provides up to 30 times the performance while reducing energy consumption by 25 times. The technical capabilities of the Blackwell processors alone will make life more difficult for AMD, but Nvidia is going even further to outpace its competitor. There's a long-standing rivalry between Nvidia and AMD, as the companies have historically jockeyed for position to dominate the GPU space. For example, at an event to introduce its Instinct MI300X AI chip in early December, AMD went to great lengths to show that its flagship processor outperformed its nearest competitor, Nvidia's year-old H100, using a wide variety of benchmarks. Soon after, Nvidia dropped a blog post that took issue with the claims, noting that AMD purposefully didn't use Nvidia's optimized software, which skewed the results in AMD's favor. Nvidia noted that if it was benchmarked properly, the H100 was \"2x faster.\" One area in which the rivals haven't historically competed is price. Despite AMD's protestations to the contrary, Nvidia has long been acknowledged as the industry leader, though AMD's comparable chips are much less expensive. A report released last month suggests that while AMD's top-of-the-line MI300X chips cost between $10,000 and $15,000 each, Nvidia's H100 sold for as much as $40,000, demonstrating the company's pricing power. In an interview on CNBC, Huang revealed that the Blackwell GPUs, expected to ship later this year, would be priced between $30,000 and $40,000, suggesting the next-generation processors will be priced similarly or at a modest premium to its current processor -- the H100. Nvidia's aggressive pricing strategy was a surprise to analysts who cover the stock. Morgan Stanley analyst Joseph Moore noted that Nvidia is pricing its new Blackwell chips \"at more competitive price points than our earlier assumptions ... [which will] likely dent the enthusiasm for alternatives to Nvidia, both merchant and custom silicon.\" Mizuho Securities analyst Jordan Klein notes, \"The more modest pricing (for Nvidia's Blackwell GPUs) was perceived as positive for (Nvidia) stock ... It opens the door for more customers to buy vs. only the highly concentrated massive capex spenders in cloud hyperscalers and wealthy sovereign nations.\" The pricing will give new and existing customers another reason to choose Nvidia over AMD, as the price differential is shrinking. To be clear, AMD has established itself as a worthy, though somewhat distant, competitor. Nvidia's newest processor will certainly up the ante, as will its aggressive pricing policy. There's the possibility that Nvidia could increase its already dominant market share in the AI space or keep its rivals at bay for a while longer. While these moves will certainly put AMD at a disadvantage, it's unlikely that AMD will be going anywhere anytime soon. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 21, 2024  Danny Vena has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Adv Micro Devices stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}