{
    "title": null,
    "date": "3/1/2024",
    "url": "https://www.dsogaming.com/news/robocop-rogue-city-and-remnant-2-now-support-amd-fsr-3-0-frame-generation/",
    "text": "Gunfire Games and Teyon have released new patches for Robocop: Rogue City and Remnant 2 that add official support for AMD FSR 3.0 Frame Generation. Thanks to these updates, players can enjoy higher framerates in these two UE5 games. When they came out, both Robocop: Rogue City and Remnant 2 were quite demanding, especially on Ultra settings. So, for using their highest settings, it was almost necessary to use an upscaler. Of course, you could also lower the settings to High, but there are plenty of PC gamers who prefer keeping things at Ultra. I’m not a fan of this attitude as you can get a huge performance boost by simply lowering a few settings. But hey, it is what it is. Robocop: Rogue City and Remnant 2 supported DLSS 3 Frame Generation at launch. From these two, the only acceptable implementation was the one used in Robocop. In Remnant 2, DLSS 3 had some visual issues. Thankfully, though, Gunfire Games has fixed the issues we reported. Let’s now hope that the AMD FSR 3.0 implementation will be as good as the one we saw in Like a Dragon: Infinite Wealth, The Talos Principle 2 and Starfield. It’s also worth noting that the latest update for Remnant 2 adds crossplay support. As such, PC gamers can now play with their console friends. However, frame generation currently blocks the Epic Online Services Overlay which is required for Crossplay functionality. You can still accept invites using the Epic launcher prior to starting the game and join that way if you wish to use frame generation in the game. Finally, AMD has revealed that The Last of Us Part I will soon support AMD FSR 3.0. As such, you won’t have to use its AMD FSR 3.0 Mod any longer. Stay tuned for more! John is the founder and Editor in Chief at DSOGaming. He is a PC gaming fan and highly supports the modding and indie communities. Before creating DSOGaming, John worked on numerous gaming websites. While he is a die-hard PC gamer, his gaming roots can be found on consoles. John loved – and still does – the 16-bit consoles, and considers SNES to be one of the best consoles. Still, the PC platform won him over consoles. That was mainly due to 3DFX and its iconic dedicated 3D accelerator graphics card, Voodoo 2. John has also written a higher degree thesis on the “The Evolution of PC graphics cards.”\nContact: Email "
}