{
    "title": "AMD Vs. Nvidia Stock: Which Is The Better Buy? (NASDAQ:AMD)",
    "date": "3/12/2024",
    "url": "https://seekingalpha.com/article/4677731-amd-vs-nvidia-stock-which-is-the-better-buy",
    "text": "HRAUN/E+ via Getty Images HRAUN/E+ via Getty Images Advanced Micro Devices, Inc. (NASDAQ:AMD) has been NVIDIA Corporation's (NVDA) main competitor for many years. However, it seems to have fallen behind in the artificial intelligence (\"AI\") mania of the last 12 months. Not that the stock hasn't done well, but it's definitely not done as well as Nvidia. But does that create an opportunity? Is AMD fairly priced? And, most importantly, can it catch up to Nvidia? In this article, I compare AMD to Nvidia stock to determine, to the best of my ability, which is the better investment. First, we have to understand the key differences that separate Nvidia and AMD if we want to assess whether AMD can close the gap. Nvidia has been wildly successful in the last year in selling its \"AI data center chips.\" The most powerful of these is the H100, which has become the gold standard for developing AI applications. However, a key element to Nvidia's success also relies on the power behind CUDA, which is essentially a software platform that serves to optimize the performance of its GPUs. It is this connection between software and hardware which gives Nvidia its moat. While AMD also makes GPUs, they have not been adopted in AI applications, but its new chips will be specifically designed for this. AMD is bringing out the Instinct™ MI300 series accelerators, which should be able to compete with Nvidia's products. This, in fact, led the CEO to raise the targets for its AI chips revenue from $2 to $3.5 billion. This will come together with further developments in AMD's ROCm, which is the equivalent of Nvidia's CUDA. While ROCm has some catching up to do, since it was launched years later, it does benefit from the fact that it is open-source, and anyone can develop applications on it. The additional functionality and optimizations of ROCm 6 and the growing volume of contributions from the Open Source AI Software community are enabling multiple large hyperscale and enterprise customers to rapidly bring up their most advanced large language models on AMD Instinct accelerators. Source: AMD Earnings Call. Clearly, AMD has some catching up to do, but here is the thing. Everyone's rooting for them. Nvidia's clients are not happy with being stuck with its chips and its closed software. Nvidia's clients will be more than happy to diversify their investments and give AMD's chips a chance. Now, let's go ahead and compare AMD and Nvidia profitability. AMD profit margins (Macrotrends) NVDA profit margins (Macrotrends) AMD profit margins (Macrotrends) NVDA profit margins (Macrotrends) The first is AMD's profit margins, and then we have NVDA. Now, as we can see, even though one could say these companies are both in the same business, NVDA has always commanded higher margins, and this difference has only gotten bigger in the latest year. AMD NVDA Gross Profit Margin 50,27% 72,72% EBIT Margin 1,77% 54,12% Levered FCF Margin 9,72% 32,61% Return on Equity 1,54% 91,46% Return on Total Capital 0,43% 46,75% Data Source: Seeking Alpha. As we can see, NVDA also has a much higher ROA and ROE. There are a couple of reasons for this. Some have pointed out that Nvidia has a higher market share, giving it more economies of scale. More recently, the high demand has also allowed Nvidia to push up its prices. AMD might be able to take some market share, and in doing so, increase its margins, while also forcing NVDA to reduce its own. Now, let's assess the potential growth for each company. AMD EPS estimates (SA) AMD revenue estimates (SA) AMD EPS estimates (SA) AMD revenue estimates (SA) Starting with AMD we can see that EPS is projected to almost triple in the next three years. From $2.65 in 2023 to $7.23 in 2026. It seems like analysts believe AMD might begin to take back some market share starting in 2024-25 since at that point revenues would grow almost 26%. NVDA EPS estimates (SA) NVDA revenue estimates (SA) NVDA EPS estimates (SA) NVDA revenue estimates (SA) Meanwhile, Nvidia has already shown incredible growth in revenues and EPS, and this should continue in 2025. EPS will grow 90%, and revenues will grow 81%. However, after that, revenue growth would likely moderate to below 20%. Based on these analyst estimates it seems like Nvidia will continue to enjoy market dominance, but AMD might start catching up late in the year and in 2025. NVDA has more growth priced now, while AMD has more growth priced in the long term. Lastly, we will look at the valuations of each of these companies. AMD NVDA P/E Non-GAAP (TTM) 74,86 66,13 P/E GAAP (FWD) 98,98 37,33 PEG Non-GAAP (FWD) 1,13 1,00 Price/Sales (TTM) 14,12 34,76 Price to Book (TTM) 5,74 49,18 Price/Cash Flow (TTM) 192,30 75,15 Data source: Seeking Alpha. Now, as we can see, despite Nvidia's superior price appreciation, this seems to be quite justified given the valuation. On TTM PE, Nvidia is cheaper than AMD, and this becomes even more pronounced when we look at forward P/E. With that said, both companies are similarly priced in terms of forward PEG. NVDA has a much higher P/S given its higher margins. The biggest difference in valuation is perhaps in the Price/Book, where Nvidia's ratio is 9x that of AMD. Lastly, NVDA does have a more attractive Price/cash flow Taking all this into account, which one seems to be the better buy? Even after its huge run-up, I'd have to give the edge to Nvidia. The company has managed to build a huge lead in GPUs, and that won't go away overnight. Even if AMD manages to catch up to Nvidia's current products, it's not like Nvidia will be sitting around with their arms crossed. Furthermore, from a purely investing perspective, Nvidia has better profitability and still seems overall more attractively valued, especially if we take into account future growth. Yes, it's possible that AMD could surprise us, but that seems more unlikely at this point. Nvidia actually provides a better-priced investment in a higher-quality company. Macro moves markets, and this is what I do at The Pragmatic Investor Join today and enjoy: - Weekly Macro Newsletter - Access to our Portfolio - Deep dive reports on stocks. - Regular news updates Start your free trial right now! This article was written by James Foord is an economist by trade and has been analyzing global markets for the past decade. He leads the investing group The Pragmatic Investor where the focus is on building robust and truly diversified portfolios that will continually preserve and increase wealth. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}