{
    "title": null,
    "date": "3/16/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/acer-launches-two-new-amd-radeon-gpus",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. AMD's Radeon RX 7900 GRE gets Bitfrost treatment. Acer has introduced two custom Radeon RX 7900 GRE graphics cards with factory-overclocked graphics processors and enhanced power supply circuitry for additional overclocking potential. While the Predator Bifrost Radeon RX 7900 GRE OC and the Nitro Radeon RX 7900 GRE OC feature similar clocks, they are positioned slightly differently and compete with the best graphics cards. Both the Predator Bifrost Radeon RX 7900 GRE OC and the Nitro Radeon RX 7900 GRE OC are clocked at 2,050 MHz game and 2,395 MHz boost, up from up to 2,245 MHz recommended by AMD. The graphics cards also have triple-slot cooling systems with large aluminum heatsinks and heat pipes. This design ensures efficient heat dissipation and optimal performance during intensive gaming sessions or heavy workloads. Meanwhile, the cooler of the Predator Bifrost Radeon RX 7900 GRE OC board is significantly more sophisticated and features a vapor chamber (typically used for higher-end graphics cards) and three FrostBlade 3.0 fans. Therefore, we would assume that the Bitfrost Radeon RX 7900 GRE will be a slightly better overclocker than the Nitro Radeon RX 7900 GRE. Since AMD Radeon RX 7900 Golden Rabbit Edition (GRE) is based on the compact version of the Navi 31 graphics processing unit (which features 5,120 stream processors, 64 MB of Infinity Cache, and a 256-bit GDDR6 memory interface), Acer decided to reuse printed circuit board of its Predator Bifrost Radeon RX 7800 XT for its Predator Bifrost Radeon RX 7900 GRE OC. This PCB is a good fit for the purpose as it comes with an enhanced voltage regulating module and two eight-pin auxiliary PCIe power connectors that can deliver up to 300W of power (plus, up to 75W can be consumed from the slot itself); more than enough for AMD's Radeon RX 7900 GRE, which the GPU developer rated for up to 260W. Both Acer Radeon RX 7900 GRE graphics cards feature three DisplayPort 2.1 and one HDMI 2.1 display connector, which is in line with what we see on Radeon RX 7900 GRE add-in boards from other suppliers. Acer has not disclosed the recommended pricing of either of its Radeon RX 7900 GRE graphics cards, though we would presume that the Predator Bifrost Radeon RX 7900 GRE OC will be slightly more expensive than the Nitro Radeon RX 7900 GRE OC. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Anton Shilov is a Freelance News Writer at Tom’s Hardware US. Over the past couple of decades, he has covered everything from CPUs and GPUs to supercomputers and from modern process technologies and latest fab tools to high-tech industry trends. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 Seven-year-old AMD gaming GPU continues to stick around — low-profile RX 550 arrives for SFF PCs By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}