{
    "title": "AMD Ryzen 9 5900X review - still worth it in 2024?",
    "date": "3/8/2024",
    "url": "https://www.pcguide.com/cpu/amd-ryzen-9-5900x-review/",
    "text": "The Ryzen 9 5900X holds up PC Guide is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Read More Last Updated on March 8, 2024 The AMD Ryzen 9 5900X may be a handful of years old but it still deserves to be considered among the best CPUs for gaming even in 2024. Armed with some impressive specs, a competitive price tag, and good overclocking potential, those looking for an AM4 upgrade, or to leap to the red corner over from Intel, could be satisfied with what this hardware can do. The AMD Ryzen 9 5900X has been on the shelves for some time, originally released back in November 2020, coinciding with the launch of Team Red’s RX 6000 GPU series. At release, it carried an MSRP of $549, however, you can now pick it up as cheap as $300 (or less) given the fact that it runs on the AM4 socket, which has since been replaced by the Ryzen 9 7900X from 2022. That positions this once-flagship processor as a serious value-for-money proposition. The AMD Ryzen 9 5900X may be a couple of years old now but it’s still got all the horsepower you need for modern gaming, just as long as you don’t need DDR5 RAM. The AMD Ryzen 9 5900X is a socket AM4 CPU as the last of the PGA chipsets made by Team Red before adopting LGA with AM5. It’s built on the Zen 3 architecture and boasts 12 cores and 24 threads with a base clock speed of 3.7 GHz and a boost clock up to 4.8 GHz. It’s especially power efficient compared to its successors with a respective 105W TDP, too. There’s also a total of 64MB L3 cache onboard, too. Team Red was smart to keep this chipset generation utilizing the AM4 socket which has been out since early 2017, meaning that many motherboards should support the chip swap. However, this will depend on the age of your mobo and whether you can update the bios or not, so do read into the compatibility if you’re running a 3000 series or older. Luckily, existing coolers should fit so you’re all good if you’re considering one of the best CPU coolers. In terms of design, the AMD Ryzen 9 5900X is in keeping with the rest of the AM4 socket processors. Specifically, it’s a PGA 1331 chipset, containing a total of 1,331 pins on the underside of the processor which must be carefully inserted into the socket. It would be best if you were especially careful not to bend any pins when installing. There’s support for DDR RAM but no DDR5 RAM, meaning you’ll need to upgrade again if you want the faster memory type, too. there’s no real bottlenecking to speak of in modern games thanks to the 12 cores and 24 threads which are well-utilized in terms of both single-core and multi-core performance The 5900X is built on a 7nm process by TSMC with support or 3200 MHz memory. While it’s unlikely to be a problem for anyone with one of the best GPUs, this chipset does not feature any kind of integrated graphics (iGPU) onboard. That means you’ll need to hook it up to a dedicated video card from the jump, such as the RX 7600 XT or better. The AMD Ryzen 9 5900X may have been released well over three years ago but it’s still not some power where it counts. In the testing conducted by WePC’s Jack Howarth, this processor had no trouble in achieving high frame rates with gaming performance and some respectable figures when benched with our industry-standard tools. Check out the gaming benchmarks for the full story. As you can see from the figures above, there’s no real bottlenecking to speak of in modern games thanks to the 12 cores and 24 threads which are well-utilized in terms of both single-core and multi-core performance. However, it is outperformed by the 5800X3D thanks to its V-cache. Now we can move on to the synthetic benchmarks to see how the chipset holds its own when put under stress. While these figures have been bettered by some Zen 4 chips that have come after, there’s no disputing that these are some strong figures even over three years after its initial introduction. Thanks to the chipset’s low 105W TDP, you should be able to get a fairly reserved AIO or a high-quality air cooler. In terms of bottlenecks, there aren’t any that are necessarily CPU-bound right now but this could change in the years to come. The one thing that may stump you is the lack of support for DDR5 RAM or PCIe 5.0 Gen 5 SSDs, so you’re lagging behind the current leading options. The Ryzen 5000 series may not be as high-end a platform as it once was in your PC but there’s little it will struggle against even in 2024. The 12-core and 24-thread setup still shows gains over Intel Core previous versions at a similar price point for gamers. At the end of the day, it all comes down to which graphics card you are running to pair with the workloads. Despite being limited in headroom on PCIe 4.0, unlike the new Zen 4 chipsets, a bios update should mean a substantial upgrade if coming from an older CPU. Enthusiasts are likely going to want the newest series processors thanks to the added bandwidth of higher clock speeds, but for most people, the 5000 series flagship should still be enough for content creators and gamers as our test setup shows. It’s no longer the best gaming CPU you can buy, but with its discounted price, it offers a ton of power for the money. Yes, the AMD Ryzen 9 5900X is still an excellent CPU for gaming and productivity even in 2024 thanks to its 12 cores and 24 threads. While it may not have support for pricier DDR5 RAM or PCIe 5.0 NVMe SSDs, you should have no problem keeping up with the latest titles for several years to come. Copy by Aleksha McLoughlin ; Testing by Jack Howarth  Aleksha McLoughlin is Hardware and News Editor for PC Guide and she oversees buying guides, reviews, news, and features on site. She was previously Hardware and Affiliates Editor at VideoGamer. PCguide.com is part of the BGFG family of websites. Our mission is to provide you with great editorial and essential information to make your PC an integral part of your life. You can also follow PCguide.com on our social channels and interact with the team there. © 2024 PC Guide. All rights reserved. Part of "
}