{
    "title": "Windows 11 KB5035942 fixes performance (direct download links)",
    "date": "3/28/2024",
    "url": "https://www.windowslatest.com/2024/03/29/windows-11-kb5035942-fixes-performance-direct-download-links/",
    "text": "Windows 11 KB5035942 is now available as an optional cumulative update. It includes much-needed performance fixes, particularly for AMD PCs. As always, you can grab this patch from Windows Update. Microsoft also posted direct download links for Windows 11 KB5035942 offline installers (.msu) on its Update Catalog. KB5035942 (Build 22631.3374) is a big release, and it may take longer than usual to download, install, and reboot to apply the changes. Multiple users told Windows Latest that this update fixes the performance issues caused by Windows 11 March 2024 Update on AMD systems, including Asus Rog Ally. As Windows Latest reported recently, Windows 11’s March 2024 Update caused several problems for some people, including performance issues and Blue Screen of Death (BSOD) errors. This month’s optional update appears to have fixed the performance issues, stuttering and slow boot times on AMD hardware. You’ll also notice better performance on Asus Rog Ally. Users told us KB5035942 fixes an issue that causes FPS to drop suddenly on Rog Ally and other AMD PCs. It’d be nice to hear from Microsoft about why the security update caused problems for some AMD systems, but the company hasn’t acknowledged the reports. Again, remember that this is an optional update, so it may cause other problems. It’s probably better to wait for Windows 11’s April 2024 Patch Tuesday. Windows 11 KB5035942 Direct Download Links: 64-bit | 23H2, 22H2. You’ll find this update on Windows Update as an optional release. However, if you run into problems deploying the patch via Windows Update, you can head to the Microsoft Update Catalog from the above link. On the update catalog, click “Download” and double-click the .msu file. On Windows Update, this patch shows up as: 2024-03 Cumulative Update for Windows 11 Version 23H2 for x64-based Systems (KB5035942) Installing March 26’s optional update brings version 23H2 systems to Build 22631.3374, enabling Windows 11 Moment 5 features by default. This means you’ll notice tons of changes if you never installed the Moment 5 update, including the ability to uninstall Microsoft Edge in Europe. In addition to everything in Moment 5, Windows 11 Build 22631.3374 introduces more controls for Windows Hello for Business. After the update, IT administrators can now more effectively control user sign-in prompts on devices joined to Entra. This is achieved by enabling the “DisablePostLogonProvisioning” policy, which turns off provisioning following a user’s sign-in on both Windows 10 and 11 devices. For those using the Remote Desktop Session Host, the update is a welcome change. You can now configure the “clipboard redirection” policy more flexibly, allowing for unidirectional clipboard sharing from the local computer to the remote one or the other way around. If you’re based out of Europe, you will also get the search highlights in the taskbar search box, a feature that will be rolled out gradually to everyone. Here’s a list of all the improvements rolling out in this update: About The Author Mayank Parmar Mayank Parmar is an entrepreneur who founded Windows Latest. He is the Editor-in-Chief and has written on various topics in his seven years of career, but he is mostly known for his well-researched work on Microsoft's Windows. His articles and research works have been referred to by CNN, Business Insiders, Forbes, Fortune, CBS Interactive, Microsoft and many others over the years. Featured in "
}