{
    "title": null,
    "date": "3/6/2024",
    "url": "https://windowsreport.com/leak-exposes-amd-4800s-bios/",
    "text": "Follow us Share this article Latest news This information can affect Xbox Series X and even PS5 2 min. read Published on March 6, 2024 published on \n\nMarch 6, 2024 Share this article Read the affiliate disclosure page to find out how can you help Windows Report effortlessly and without spending any money. Read more It seems that AMD has been in hot water recently since info regarding its graphics card was leaked online. While this is bad news for AMD, this info can be beneficial for reverse engineers. To learn how this affects AMD and the gaming community as a whole, keep on reading. It seems that an anonymous security researcher has released the AMD 4800S Main BIOS, Backup BIOS, ROM, and fuses according to the Wololo. As you may know, AMD 4800S is an APU with a deactivated GPU, and it is used in the Xbox Series X. PlayStation uses a similar hardware, but in the form of AMD 4700S. With this data released to the public, enthusiasts can learn more about firmware, explore hardware glitches, and learn more about CPU and by extension Xbox Series X. If any vulnerabilities are found, they might be replicated on Xbox, if the CPU on the console is using similar firmware, and this can be a serious problem for Microsoft. There’s also a chance that these vulnerabilities can be replicated on PS5 and its 4700S CPU. At the time of writing, these dump files are still available, and we hope that the online community won’t abuse this data for malicious purposes. This isn’t the only bad news for AMD, and we already wrote about how Microsoft added only Intel chips to the Windows 11 CPU compatibility list while leaving AMD out. More about the topics: amd Milan Stanojevic Windows Toubleshooting Expert Milan has been enthusiastic about technology ever since his childhood days, and this led him to take interest in all PC-related technologies. He's a PC enthusiast and he spends most of his time learning about computers and technology.\nBefore joining WindowsReport, he worked as a front-end web developer. Now, he's one of the Troubleshooting experts in our worldwide team, specializing in Windows errors & software issues. Milan Stanojevic Windows Toubleshooting Expert Before joining WindowsReport, he worked as a front-end web developer. Now, he's specialized in Windows errors & software issues. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}