{
    "title": "Popular publication GSMArena faces massive DDoS attack allegedly \noriginating from Indian networks",
    "date": "3/9/2024",
    "url": "https://www.notebookcheck.net/Popular-publication-GSMArena-faces-massive-DDoS-attack-allegedly-originating-from-Indian-networks.811707.0.html",
    "text": "Popular mobile technology publication GSMArena, is currently going through a tough time because of a Distributed Denial of Service (DDoS) attack. As stated by the publication, the attack is allegedly emanating from IP addresses in India associated with telecom operators Reliance Jio and Airtel. GSMArena states that their servers are being hit by an additional 100,000 IP addresses every hour. In response to this ongoing assault, the publisher claims to have contacted both Reliance Jio and Airtel for help with countering the attack. Nevertheless, they complain that their appeals have been ignored, forcing them to take steps towards protecting their servers against excessive traffic. Consequently, GSMArena has blocked a significant portion of 35 million IP addresses traced back to India. This move is aimed at securing their servers so that people around the globe can continue accessing their website. However, it may also create difficulties for their Indian-based readership. GSMArena, in light of the situation, has advised Indian users who are facing difficulties accessing their website to try using a virtual private network (VPN) as an alternative. Moreover, the publication has promised its readers that steps are being taken and things will soon be back to normal. A DDoS attack is a deliberate attempt to interrupt the usual performance of a specific server, service, or network by blocking it with a massive amount of Internet traffic. Such attacks involve tens of thousands of compromised computers or devices grouped together, which might overwhelm the target through requests or data, making it inaccessible to legitimate users. Purchase the 27\" LG UltraGear 27GL83A on Amazon GSMArena "
}