{
    "title": "Samsung Galaxy A55 hands-on performance test: Exynos 1480 CPU is 22% higher \n& GPU is 31% higher",
    "date": "3/3/2024",
    "url": "https://www.gizchina.com/2024/03/03/samsung-galaxy-a55-hands-on-performance-test-exynos-1480-cpu-is-22-higher-gpu-is-31-higher/",
    "text": "The Samsung Galaxy A55 is set to be a significant upgrade in Samsung’s mid-range smartphone lineup, boasting the new Exynos 1480 chipset with an AMD GPU. A recent review of the Samsung Galaxy A55 5G mobile phone reveals the performance of this device. In fact, the review focuses on the performance of Samsung’s own Exynos 1480 processor. According to the review result, the overall performance is equivalent to the Snapdragon 778G processor. The Snapdragon 778G processor was released by Qualcomm three years ago. Exynos 1480 is manufactured using Samsung’s 4-nanometer (4LPP) process node and has an eight-core configuration. It includes 4 Cortex-A78 cores clocked at 2.75GHz and 4 Cortex-A55 cores clocked at 2.05GHz.  On Geekbench 6, the single-core score of this phone reached 1161 points, 18.5% higher than the previous generation. The multi-core score hit 3398 points, 22.7% higher than the previous generation. The overall performance is very good. In the AnTuTu benchmark, the Exynos 1480 scored 713,993 points, an increase of 20.4% compared to the previous generation. After a 15-minute CPU speed limit test on the Exynos 1480, it was found that the temperature was relatively stable and there was no sudden drop. In terms of graphics processor, the A55 uses the Samsung Xclipse 530 graphics processor based on the RDNA 2 architecture. The performance of this GPU unit is significantly better than the A54’s Mali-G68. In the Geekbench 6 GPU computing score, the Xclipse 530 significantly improved by 31.4% compared to the Mali-G68. The Exynos 1480 chipset is a notable addition to the Galaxy A55, featuring the Xclipse 530 GPU based on AMD RDNA2 graphics architecture, similar to the previous Exynos 2200. This chipset marks Samsung’s venture into mid-range processors with AMD GPUs, promising enhanced graphics performance compared to its predecessor, the Exynos 1380. Early benchmarks reveal that the Exynos 1480 offers a 22% higher CPU performance compared to its predecessor. While initial scores may not show significant gains over the Exynos 1380, further optimizations during development could lead to improved performance.  The GPU performance of the Exynos 1480 is a standout feature, showcasing a remarkable 31% increase in graphics processing power. Although not as cutting-edge as the RDNA3-based AMD GPU in the upcoming Galaxy S24’s Exynos 2400, the Xclipse 530 GPU is expected to deliver substantial improvements over the Exynos 1380, potentially positioning the Galaxy A55 as a gaming powerhouse. Apart from its powerful chipset, the Galaxy A55 is expected to come equipped with 8GB of RAM, with possible variants offering 4GB or 6GB options. The device will run on Android 14 and One UI 6.1 out of the box, likely incorporating advanced AI features from the Galaxy S24 lineup. The phone’s release date is anticipated to be after March, following the launch of the Galaxy S24 series. Regarding the Galaxy A55 5G, the device will retain the 5G network and Wi-Fi 6 connections. However, the device uses a better Exynos 1480 (4nm) processor, with a 167% increase in NPU, a 32% increase in GPU, and a 15% increase in CPU.  The Galaxy A55 5G will no longer have 6GB of RAM. Instead, it comes with a new 12GB RAM option. In addition, the device also supports an expandable storage slot of up to 1TB. The Galaxy A55 5G device will also retain a 5,000mAh battery that supports 25W fast charging. The thickness of the fuselage is still 8.2 mm, but the height has increased to 161.1 mm and the width has increased to 77.4 mm. In terms of weight, it also slightly increased to 213 grams. In terms of display, the upcoming Galaxy A55 5G will use a larger 6.6-inch Super AMOLED display, the resolution is still FHD+, the refresh rate is still 120Hz, the HBM display brightness is still 1000 nits, and the Infinity-O design ( hole punch) also remains unchanged. Peak brightness of 1,650 nits is the only display upgrade. By leveraging cutting-edge technology like the Exynos 1480 chipset and AMD GPU, Samsung continues to push boundaries in delivering high-performance devices across its product range.  In conclusion, the Samsung Galaxy A55 marks a significant leap forward in Samsung’s mid-range smartphone offerings, boasting impressive hardware enhancements and notable performance improvements. With the introduction of the Exynos 1480 chipset featuring an AMD GPU based on RDNA2 architecture, the Galaxy A55 promises enhanced graphics capabilities and overall system performance. Early benchmarks indicate substantial gains in both CPU and GPU performance compared to its predecessor, the Exynos 1380. The Exynos 1480 showcases a 22% increase in CPU performance and a remarkable 31% boost in GPU processing power, setting the stage for a compelling user experience, especially in gaming and multimedia applications. The Galaxy A55 is poised to offer a seamless and immersive experience with its decent features. It has a 6.6-inch Super AMOLED display, 120Hz refresh rate, and high brightness levels. Moreover, the device’s 5,000mAh battery with 25W fast charging support ensures extended usage without compromising on convenience. This device also has advanced features such as Wi-Fi 6 connectivity, expandable storage up to 1TB, and a robust camera setup. This includes a 50MP primary sensor. Samsung aims to deliver a comprehensive and future-proof smartphone experience. Efe Udin, a government tech policy expert is a seasoned tech writer with over seven years of tech writing experience. Efe's true passion lies in exploring the intersection of technology, politics, and brand feuds.\n\r\nWith an astute understanding of the power dynamics and competitive landscape within the tech world, Efe delves into the intricacies of how technology influences political discourse and how brand rivalries shape the industry.     GizChina Follow @gizchina  Accredited technology blog dedicated to providing breaking news, expert reviews and original content related to mobile tech and EV industry, smartphones, gadgets and IoT. Keep up to date with the latest Android phone news and reviews on our social media channels: "
}