{
    "title": "NIH Trial: No Benefit from Inflammation Drug for Dry AMD",
    "date": "3/20/2024",
    "url": "https://www.miragenews.com/nih-trial-no-benefit-from-inflammation-drug-for-1199279/",
    "text": "The drug minocycline, an antibiotic that also decreases inflammation, failed to slow vision loss or expansion of geographic atrophy in people with dry age-related macular degeneration (AMD), according to a phase II clinical study at the National Eye Institute (NEI), part of the National Institutes of Health. Dry AMD affects the macula, the part of the eye's retina that allows for clear central vision. In people with dry AMD, patches of light-sensing photoreceptors and their nearby support cells begin to die off, leaving regions known as geographic atrophy. Over time, these regions expand, causing people to lose more and more of their central vision. Microglia, immune cells that help maintain tissue and clear up debris, are present at higher levels around damaged retinal regions in people with dry AMD than in people without AMD. Scientists have suggested that inflammation - and particularly microglia - may be driving the expansion of geographic atrophy regions. This study, led by Tiarnan Keenan, M.D., Ph.D., a Stadtman Tenure-Track Investigator at the NEI's Division of Epidemiology and Clinical Applications, tested whether inhibiting microglia with minocycline might help slow geographic atrophy expansion and its corresponding vision loss. The trial enrolled 37 participants at the NIH Clinical Center in Bethesda, Maryland, and at the Bristol Eye Hospital, United Kingdom. After a nine-month period where the researchers tracked each participant's rate of geographic atrophy expansion, the participants took twice-daily doses of minocycline for two years. The researchers compared each participant's rate of geographic atrophy expansion while taking minocycline to their baseline rate, and found there was no difference in geographic atrophy expansion rate or vision loss with minocycline. Previous studies have shown that minocycline can help reduce inflammation and microglial activity in the eye, including the retina. The drug has shown beneficial effects for conditions such as diabetic retinopathy, but has not previously been tested for dry AMD. The clinical study was funded by the NEI Intramural Program, and took place in part at the NIH Clinical Center. Clinical trial number NCT02564978. "
}