{
    "title": null,
    "date": "1/25/2024",
    "url": "https://www.techspot.com/review/2794-amd-radeon-7600-xt/",
    "text": "Today, we're taking our first look at AMD's new Radeon RX 7600 XT, which is basically an RX 7600 with a 16 GB VRAM buffer. It probably could have, and perhaps should have, been named the 7600 16GB. Fortunately, it's not an inferior product sharing the same name. The bar is low, we know, but over the years, we've witnessed some dubious practices. For now, we're eager to discover what the 16GB 7600 has to offer. As before, the 7600 XT is essentially a 7600 with double the VRAM, with the only other alteration being a minor 4% increase in the core clocks, from 2,655 MHz to 2,755 MHz. This adjustment is something that could be manually applied to any 7600, so it's hardly a unique feature of the 7600 XT.  So, like the 7600, the XT model includes 2,048 cores, 128 texture mapping units, and 64 ROPs. It also boasts 32 TR cores, 2 MB of L2 cache, and 32 MB of L3 cache. The memory subsystem remains unchanged, apart from the memory capacity, meaning the 7600 XT uses a 128-bit wide memory bus with 18 Gbps memory for a bandwidth of 288 GB/s. To double the VRAM capacity, AMD adopted a clamshell design, similar to Nvidia's approach with the 16GB RTX 4060 Ti. However, while Nvidia charged a $100 premium for the extra memory, AMD is charging $60, raising the MSRP from $270 for the RX 7600 to $330 for the 7600 XT.  Potential buyers are likely wondering whether the 7600 XT is worth the extra $60 over the standard model. Addressing this question is challenging, as measuring the benefits of 16 GB of VRAM can be complex for several reasons. First, even when a game exceeds 8 GB of VRAM usage, and there are many examples, it's not always apparent in the frame rate counter. To avoid performance issues, most games simply don't load textures that exceed the graphics memory capacity, leading to a visual downgrade with blurry textures, missing details, or noticeable pop-ins.  For game developers, this is preferable to alternatives such as crashing or severely impaired performance, which will frustrate gamers. Interestingly, most gamers don't attribute these issues to insufficient VRAM. Still, we have witnessed instances where game performance dramatically decreases, and even crash due to VRAM shortages, but this is less common. It's important to note that benchmarking an 8 GB and 16 GB graphics card and solely looking at the FPS counter doesn't tell the whole story, so be aware of that as we go over the numbers.  For a visual comparison of how 8 GB and 16 GB memory buffers perform in modern games, we recommend checking out our 16 GB RTX 4060 Ti review. The findings there are applicable to all 8 GB and 16 GB graphics cards, so it's unnecessary to repeat all that testing. For our tests, we're using a Ryzen 7 7800X3D test system with 32 GB of DDR5-6000 memory, and the latest display drivers. All data has been validated and updated for this review. We've tested 12 games, some with and without ray tracing, focusing on 1080p and 1440p resolutions. Let's take a look… First up, we have Resident Evil 4 and at 1080p, we're looking at a surprisingly large 16% uplift for the 7600 XT over the standard 7600, making it just 6% slower than the RTX 4060. This is a significant improvement, and it appears that the extra VRAM is beneficial here.   Oddly, the margin is reduced to 9% at 1440p, suggesting that there are other limitations impacting the Navi 33 GPU more than VRAM capacity. In any case, the 7600 XT now matches the RTX 4060 with an average of 71 fps.  Moving on to A Plague Tale: Requiem, at 1080p the 7600 XT is just 3% faster than the 7600, with the difference here being purely the factory overclock. However, this means that the 7600 XT is now 11% faster than the RTX 4060.  Then, at 1440p, the 7600 XT is just 2% faster than the standard model, and 6% faster than the RTX 4060, showing similar performance across the board. An important comparison to note is with the 6700 XT, which currently costs around $330, the same as the 7600 XT. Here, the newer Radeon GPU is 24% slower, which is quite disappointing.  Next, we have Cyberpunk 2077: Phantom Liberty, where we observe a modest 8% uplift for the 7600 XT over the 7600, making the XT 6% faster than the RTX 4060.  At 1440p, there's a 6% increase for the 7600 XT, making it 8% faster than the RTX 4060, though it is also 7% slower than the 6700 XT.  Performance in Dying Light 2 is similar. Here, we find a mere 2% uplift when moving from the 7600 to the new XT model. With an average of 96 fps, it matches the RTX 4060 exactly.  The story is similar at 1440p, where the 7600 XT averages 63 fps, one frame more than the 7600, but one less than the RTX 4060, and significantly less than the 6700 XT, being 17% slower than the previous generation GPU.  The performance uplift in Watch Dogs: Legion at 1080p is slightly better, but not extraordinary, with a 6% increase. This makes the 7600 XT 9% faster than the RTX 4060.  At 1440p, the margins remain the same; the 7600 XT is still just 6% faster than the standard 7600. It's also 11% slower than the 6700 XT, which is quite underwhelming.  In Forza Horizon 5 at 1080p, the 7600 XT provided an additional 10% performance, averaging 114 fps. This also meant it was 13% faster than the RTX 4060, and just 3% slower than the 6700 XT.  The additional VRAM becomes even more advantageous at 1440p, with the 7600 XT now 13% faster than the standard 7600 and a considerable 22% faster than the RTX 4060.  Warhammer III isn't a very demanding title in terms of VRAM, at least not by modern standards, so 8 GB of VRAM is more than sufficient. Therefore, the 7600 XT's only advantage is its core overclock, providing a mere 3% increase compared to the 7600.  At 1440p, it's just 2% faster, averaging 55 fps, basically matching the performance of the RTX 4060.  Moving on to Spider-Man Remastered, we're seeing more of the same. The 7600 XT shows just a 5% increase over the standard model, making it 13% slower than the RTX 4060.  Increasing the resolution to 1440p further narrows the already small margin, with the XT offering only a 3% improvement, though now it's just 6% slower than the RTX 4060.  In Hogwarts Legacy, again at 1080p, the 7600 XT is 5% faster than both the 7600 and the RTX 4060.  Stepping up to 1440p reveals a mere 4% performance increase, but that was enough to surpass the RTX 4060 by double digits, offering 13% greater performance.  Halo Infinite is an interesting title to include in this review because it's a great example of the difficulty in testing VRAM capacity. For instance, using the ultra quality preset requires more than 8 GB of VRAM. However, the 7600 XT is just 2% faster than the 7600. In this game, insufficient memory doesn't impact performance, but results in missing textures, a difference we've demonstrated between 8 GB and 16 GB GPUs in the past.  The missing texture issue is even more noticeable at 1440p, but again, the frame counter shows almost no difference between the 7600 XT and 7600.  The Last of Us Part I, on the other hand, does suffer a performance hit when running out of VRAM. At 1080p, the 7600 XT is 20% faster than the 7600 and a massive 58% faster when comparing 1% lows. Therefore, the increased VRAM capacity is of significant benefit here, even at 1080p.  Then, at 1440p, the 8 GB cards are a stuttery mess in the game area we use for testing. The 7600 XT resolves this issue, and while the frame rates aren't outstanding (sub-optimal, we'd say), the game is certainly still playable at 47 fps.  Finally, we have Hitman 3, where the 7600 XT offers a decent 10% performance uplift, achieving 142 fps compared to 129 fps with the standard 7600. That also made it a massive 30% faster than the RTX 4060.  At 1440p, we're still looking at a 10% improvement for the XT over the standard model, which meant it was 28% faster than the RTX 4060.  One downside to adding more VRAM is increased power usage, and we see this in Hitman 3, where total system usage increased by 16%. Compared to the RTX 4060, total system usage is 33% greater for the 7600 XT. However, as the 7600 XT was 28% faster in this test, performance per watt ends up being very similar.  However, efficiency is much worse in a game like Spider-Man Remastered. Here, the 7600 XT pushed total system usage 33% higher than that of the RTX 4060, while delivering 6% less performance. This is not an ideal result. Now, it's time to review the 12-game average data, starting with the 1080p results. Here, the Radeon 7600 XT was, on average, 8% faster than the standard RX 7600 and 6% faster than the RTX 4060. This is roughly what we would expect to see across a range of games.   At 1440p, the 7600 XT was just 5% faster than the 7600 when comparing average frame rates, but a much more substantial 19% margin can be seen when comparing 1% lows. This is an impressive set of results for the 7600 XT, though it was also 12% slower than the 6700 XT.  Although we didn't focus on the 4K data as this GPU isn't designed for 4K gaming, we do have that data. Let's quickly review the 12-game average at 4K. Here, the 7600 XT was 9% faster on average and 25% faster when comparing 1% lows. It also significantly outperformed the RTX 4060, increasing the average frame rate by 23%. Next, we're examining ray tracing performance, starting with Resident Evil 4. Using the ray tracing quality preset at 1080p, the 7600 XT was really no faster than the 7600, making it 18% slower than the RTX 4060. This is a disappointing result.  A Plague Tale: Requiem severely challenges 8 GB GPUs when using the ultra quality preset with ray tracing enabled. The 7600 is completely unusable, and the RTX 4060 isn't much better. The 4060 Ti 8 GB seems okay based on the 41 fps average frame rate, but the 1% lows reveal a poor experience. The fact that the 1% lows of the 7600 XT are 56% greater is significant, but it's the discrepancy between the 1% lows and the average frame rate that truly illustrates the issue.  For instance, there's a 43% margin between the 1% lows and the average frame rate of the 7600 XT, but a 128% difference for the 8 GB 4060 Ti. Still, the 7600 XT is quite slow here, so you would have to use upscaling, which significantly degrades visual quality at 1080p, or just disable ray tracing altogether. In that case, the 8 GB models perform adequately.  Now, Cyberpunk 2077: Phantom Liberty has been tested using the 'ray tracing medium' preset at 1080p. Despite this, frame rates are very low on these more entry-level GPUs. Even the RTX 4060 was good for just 38 fps on average, and again, using DLSS to boost performance isn't an optimal solution given the poor upscaling quality at 1080p. The 7600 XT was 17% faster than the 7600 but also 26% slower than the RTX 4060. While ray tracing support on the GeForce GPU is questionable here, it's practically ineffective on the Radeon GPUs.  Spider-Man Remastered has been tested using the high-quality preset with high-quality ray tracing, and at 1080p, the performance is excellent. The 7600 XT delivered 104 fps on average, which is outstanding. However, it's really no better than the standard 7600. This also meant that it was 17% slower than the RTX 4060.  The 7600 XT fell just short of 60 fps in Star Wars Jedi: Survivor using ray tracing with the Epic preset, making it just 5% slower than the RTX 4060. It was 10% faster than the standard 7600 but also 11% slower than the 6700 XT.  Finally, we have Fortnite, and the Epic quality settings with hardware ray tracing enabled are a bit too much for the 7600 XT, as it managed just 35 fps on average. This is a 9% increase from the 7600, but 20% slower than the RTX 4060. Across the six games we tested using ray tracing, the Radeon 7600 XT was on average 30% faster than the standard 7600 or a massive 64% faster when comparing 1% lows. That's a serious performance uplift by simply doubling the VRAM, but of course, as we saw in \"A Plague Tale: Requiem\" that was the difference between playable and completely unplayable performance.  Still, despite having just 8GB of VRAM, the GeForce RTX 4060 was faster overall, delivering 13% greater performance on average, though the 1% lows were much the same. Worth noting also is that the Intel Arc A770 was as fast or typically faster than the 7600 XT across these ray tracing titles, making it not just cheaper, but also better for ray tracing. Now, it's time to check out the cost per frame data, starting with an MSRP comparison. Sadly, with an extra $60 tacked onto the price, the Radeon 7600 XT is much worse value than the original 7600, increasing the cost per frame based on our 1440p data by 17%.  That said, the added benefit of doubling the VRAM isn't always realized in these benchmarks, as noted in Halo Infinite, for example. So, the fact that the 7600 XT and RTX 4060 represent similar value in terms of cost per frame is noteworthy. In games like Halo, the 7600 XT can enable a much higher visual experience as it can load all required textures. Moreover, if you want 16 GB from the current Nvidia lineup, you have to buy the RTX 4060 Ti 16 GB, which is only 20% faster than the 7600 XT, despite costing 36% more at the new $450 MSRP. Anyway, MSRPs don't always reflect real-world pricing, so let's take a look at current retail prices. In the current market, the Radeon 7600 XT doesn't look great, and that's because for roughly the same money, you can buy the Radeon 6700 XT, which still packs 12 GB of VRAM but was on average 13% faster.  Perhaps even better is the Radeon RX 6800, a 16 GB graphics card which currently costs 27% more but is also 42% faster, and much more viable in situations where you want to enable ray tracing, for example. There's also Intel's Arc A770, packing 16 GB of VRAM for just $300, making it better value than the 7600 XT. Sapphire Pulse 7600 XT Next, let's take a look at some custom board partner designs, noting that there isn't a reference model version of the 7600 XT. The model we used for testing is Sapphire's Pulse, a reasonably compact dual-fan model powered by dual 8-pin PCIe power connectors. Sadly, it doesn't support dual BIOS functionality.   For testing, it was installed inside an ATX case with a room temperature of 21°C and was placed under gaming load for an hour. After an hour, the junction temperature peaked at 69°C with a GPU hotspot temperature of 87°C. This was achieved with a fan speed of just 1,300 RPM, so a very impressive result. The memory also peaked at 86°C, which is acceptable, and clocked at 2,238 MHz with the cores typically operating at 2,595 MHz. XFX Speedster Qick 309 7600 XT Also on hand is the XFX Speedster Qick 309 7600 XT, a much larger, higher-end-looking model. The Qick 308 RX 7600 is an MSRP model, available for $270, so it's possible the Qick 309 RX 7600 XT will also be an MSRP model, selling for $330. If so, it's an impressive model for that price, packing dual BIOS support, a triple fan cooler, a massive heatsink, and a full-size aluminum backplate.   Performance-wise, it's very good. The junction temperature peaked at just 62°C, and the hotspot hit 83°C, both slightly lower than the Sapphire Pulse, though the fan speed was slightly higher at 1,600 RPM. We also observed a similar memory temperature at 85°C, but the significant difference was the operating clock speed, as the cores typically clocked at 2,750 MHz, 6% higher than the Sapphire model, yielding a good result for XFX. Gigabyte Gaming OC 7600 XT Finally, we have the Gigabyte Gaming OC 7600 XT, and these Gaming OC models have been somewhat inconsistent in performance. This 7600 XT version looks quite promising; it's a relatively large model equipped with a triple fan cooler, has a very large heatsink, and includes a full-size aluminum backplate.   Unfortunately, it was quite loud with a fan speed of 2,000 RPM, and despite this, the operating temperatures weren't exceptional. The junction temperature of 56°C was commendable, but the GPU hotspot still reached 84°C, a degree higher than that of the XFX model. The memory temperature, however, was satisfactory, peaking at just 78°C, which is a 7°C improvement over the Speedster Qick 309. Overall, it's a decent product, but lacking dual BIOS support for a feature like a silent BIOS, it doesn't offer the most optimal out-of-the-box experience. The temperature will likely be affected if the fan speed is reduced to 1,600 or 1,300 RPM. There you have it: AMD's new Radeon RX 7600 XT. We've just examined a multitude of benchmarks, so what do we make of it? Evaluating this product is challenging because the cost per frame data doesn't tell the full story, and that's because the frame rate data isn't always apples to apples, and we hate that. Unfortunately, due to how most games handle insufficient VRAM, careful analysis of image quality is necessary. However, this can be difficult, as many games require extended periods of play to fill the VRAM buffer. For example, Halo can take 15-30 minutes before 8 GB cards encounter issues. When they do, the FPS counter doesn't reflect this; instead, you'll notice blurry textures and missing details.  Without question, having 16 GB of VRAM at your disposal is better than 8 GB. However, the Navi 33 GPU isn't super powerful, so you're less likely to run at resolutions and quality settings that will saturate an 8 GB buffer. Although it certainly can and does happen, the frequency will depend on the games you play. There's also the future-proofing aspect. How well will the 8 GB Radeon 7600 age over the next few years compared to the 7600 XT? Probably not very well, even though these are lower-end GPUs. For instance, the 8 GB version of the RX 580 performs significantly better than the 4 GB model using medium to low quality settings in modern games, and you can turn texture quality up for a much improved visual experience.  So, naturally, we can expect the same trend with 8 GB vs. 16 GB graphics cards, and we'll probably see that come to light over the next few years. We're already seeing signs of it, but we expect it to become more common soon. We think a $60 premium for an extra 8 GB of VRAM is reasonable, but the starting price is problematic. When we reviewed the Radeon RX 7600 about 8 months ago, we stated it should cost no more than $230, and we stand by that assessment.  Our hope was that the 16 GB version would price match the RTX 4060, effectively eliminating the GeForce competition at that price point. However, at $330, it's a rather expensive entry-level GPU, and one could argue that the previous-gen Radeon 6700 XT, priced around $340, is a better deal. It doesn't significantly challenge the RTX 4060 either, which remains a viable option, offering similar performance and value, with generally better ray tracing performance – though the utility of RT support at this performance level is debatable. The Arc A770 16 GB at $300 is an excellent deal, too, though it may come with some issues, as we've yet to test an Arc GPU in a wide range of games without encountering at least one problem. But things are improving on that front. Ultimately, the Radeon RX 7600 XT is another frustrating release from AMD as they narrowly miss the mark again. Had they priced this GPU at $300, it would have matched the value of the 6700 XT, coming in a bit slower, but also a bit cheaper, and with more VRAM. It would have eliminated the RTX 4060 from contention – and while potentially doing the same to a $270 RX 7600 – AMD could have discounted or discontinued that product. Ideally, AMD should have released the Radeon RX 7600 at $300 eight months ago, but with 16 GB of memory. It would have been a much clearer and better choice for everyone, everyone but Nvidia. While it's good to have more options, and we do prefer the 16 GB 7600 XT over the 8 GB 7600, it's not a product we can highly recommend, and it's a close call between this and the RTX 4060. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}