{
    "title": "New Lenovo LOQ 15 lineup is a curious mix of Ryzen 7 8845HS, Core \ni7-14700HX, and Core i5-12450HX processors ...",
    "date": "1/9/2024",
    "url": "https://www.notebookcheck.net/New-Lenovo-LOQ-15-lineup-is-a-curious-mix-of-Ryzen-7-8845HS-Core-i7-14700HX-and-Core-i5-12450HX-processors-AMD-variant-not-coming-to-North-America.791256.0.html",
    "text": "The LOQ lineup is aimed at bringing Legion goodness at more affordable price points. Last year, we reviewed several LOQ models including the LOQ 15 Intel, LOQ 15 AMD, and LOQ 16 Intel. Today, at CES 2024, Lenovo is launching a slew of LOQ 15 laptops powered by Intel 14th gen Raptor Lake-HX and AMD Zen 4 processors. Lenovo is introducing a total of four LOQ variants this year. Common features among all include a 15.6-inch QHD+ 165 HZ G-Sync display, up to 1 TB PCIe Gen4 SSDs, 60 WHr battery, 140 W USB Type-C power delivery, Intel Wi-Fi 6, dedicated LA1 AI chip, and a common set of ports as outlined in the specifications below. What differentiates the four LOQ variants is the choice of CPUs, GPUs, and RAM. The LOQ 15IRX9 can be configured with up to an Intel 14th gen Core i7-14700HX paired with a 115 W Nvidia GeForce RTX 4060 and up to 16 GB DDR5-5600 RAM. The LOQ 15AHP9, on the other hand, offers the same spec but with up to an AMD Ryzen 7 8845HS. The interesting aspect is the inclusion of 12th gen Alder Lake Core i5-12450-HX CPUs in the entry-level LOQ 15IAX9I and the LOQ 15IAX9. Both laptops can be configured with up to 16 GB DDR5-4800 memory, but the LOQ 15AX9I comes with Intel Arc A530M graphics while the LOQ 15AX9 features the 105 W RTX 4050 Laptop GPU. We are not sure why Lenovo didn't opt for 13th gen Raptor Lake-HX, but the new entry-level LOQ 15s seem to be the first Core i5-12450HX laptops in the wild. The Intel-based Lenovo LOQ 15IRX9, LOQ 15IAX9I, and LOQ 15IAX9 will be available in April 2024 starting from US$749. Interestingly, the AMD Zen 4-powered LOQ 15AHP9 will not be available in North America but will launch in EMEA in March 2024 starting from €1,049 (incl. VAT). Buy the Lenovo LOQ 15 with Ryzen 7 7840HS and RTX 4060 on Amazon Lenovo Press Release "
}