{
    "title": "AMD Ryzen 7 8700G and Ryzen 5 8600G Review: Zen 4 APUs with RDNA3 Graphics",
    "date": "1/29/2024",
    "url": "https://www.anandtech.com/show/21242/amd-ryzen-7-8700g-and-ryzen-5-8600g-review/9",
    "text": "The reason we test games in CPU reviews at lower resolutions such as 720p and below is simple; titles are more likely to be CPU bound than they are GPU bound at lower resolutions. This means there are more frames for the processor to process as opposed to the graphics card doing the majority of the heavy lifting. There are some variances where some games will still use graphical power, but not as much CPU grunt at these smaller resolutions, and this is where we can show where CPU limitations lie in terms of gaming. We are using DDR5-5200 memory as per the JEDEC specifications on the Ryzen 7 8700G and Ryzen 5 8600G, as well as DDR4-3200 on the Ryzen 7 5700G and Ryzen 5 5600G. The same methodology is also used for the AMD Ryzen 7000 series and Intel's 14th, 13th, and 12th Gen processors. Below are the settings we have used for each platform:  The bread and butter of AMD's Ryzen 8000G is in integrated graphics performance, with upgraded RDNA3-based mobile graphics used over AMD's aging Vegas graphics found within the Ryzen 5000G series. Depending on the title at 720p, we can see the combination of Zen 4, and RDNA3 proves much more effective at 720p than Zen 3 and Vega. In Strange Brigade, we saw a massive 53% uplift in performance when comparing the Ryzen 7 8700G to the Ryzen 5 5700G, with the Ryzen 5 8600G also proving much more suited to gaming at 720p than any other processor with integrated graphics we've tested. Regarding our retest with the latest firmware, we can see that both the Ryzen 7 8700G and Ryzen 5 8600G performance is marginally better at 720p. The issue with gaming benchmarks is that they typically don't represent sustained loads, and we expect these performance figures to be sustained over longer periods of time with STAPM limitations removed. "
}