{
    "title": "Russia buys chips from Intel, AMD, and others to fuel war efforts — the \ncountry bought $1.7 billion worth of chips in 2023",
    "date": "1/26/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/russia-buys-chips-from-intel-amd-and-others-to-fuel-war-efforts-the-country-bought-dollar17-billion-in-2023",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Russia re-exports billions worth of chips, including dual-use chips, from third countries. Despite restrictions imposed on exports to Russia to prevent technology from fueling its war with Ukraine, Russia has imported over $1.7 billion worth of chips from American and European companies in the first nine months of 2023, reports Bloomberg citing classified customs data. Some chips were intended for client PCs; others could be used by Russia's secret services, and the remaining were dual-use chips that could be used for weapons in its war. Over half of the chips originated from U.S. and European tech giants, the report says. Classified Russian customs service data seen by Bloomberg indicates that in the first nine months of 2023, over $1.7 billion worth of chips were imported to Russia. Of this amount, $1.2 billion worth of chips were made by a total of 20 companies, including producers from Europe and the U.S., leaving an estimated $500 million worth of chips likely accounted for by other, smaller manufacturers. While imports of chips to Russia reportedly declined in the fourth quarter, it is highly likely that the country still procured over $2 billion worth of various chips in 2023. Notable brands involved included AMD (including Xilinx), Analog Devices, Intel (Altera), Infineon Technologies, Macom, Marvell, Microchip Semiconductor, NXP Semiconductors, STMicroelectronics, Realtek, and Texas Instruments. This significant influx of high-tech components came despite restrictions meant to limit Russia's military capabilities, raising questions about the efficiency of the sanctions and the complexities of global supply chains. A large portion of these restricted chips reached Russia through re-exports from third countries, including China, Turkey, and the United Arab Emirates. The U.S. and EU have been actively trying to block these alternative supply routes, but so far, they have not been very successful. They are particularly focused on stopping the flow of dual-use and advanced goods that have been identified in Russian weapons used in Ukraine or are crucial for their production. Major companies like AMD, Analog Devices, Intel, Infineon, Marvell, Microchip NXP, STM, and Texas Instruments told Bloomberg that they adhere to the sanctions. They indicated that they had ceased business operations in Russia following the outbreak of war and had implemented rigorous processes to ensure compliance. Additionally, they emphasized their commitment to preventing the illicit diversion of their products (i.e., they specifically prohibit their re-exports to Russia and Belarus), and said they were working closely with relevant authorities to monitor and control the distribution of their chips. It should be noted that a significant portion of chip sales in the industry are handled by distributors who, in turn, have multiple resellers. The nature of this distribution chain means that manufacturers are not always able to track where their products end up after being sold to these companies, although certain specific military-use chips are subject to stricter tracking requirements. The situation highlights the challenges faced by the U.S. and the European Union in trying to cut off the supply of advanced technology to Russia’s military. The sanctions were designed to hinder Russia's ability to produce military equipment, such as tanks and missiles. However, the continued import of these chips suggests that Russia has been able to sustain its production of military hardware, which undermines the intended impact of the sanctions. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Meanwhile, the European Union is working on developing a new sanctions package. Several member states are advocating for more stringent measures, especially targeting companies in third countries involved in the trade of these chips, as well as those originating within the EU itself. Anton Shilov is a Freelance News Writer at Tom’s Hardware US. Over the past couple of decades, he has covered everything from CPUs and GPUs to supercomputers and from modern process technologies and latest fab tools to high-tech industry trends. Granite Rapids shows up on CPU-Z boasting 80 cores and 672MB of L3 cache Half of Russian-made chips are defective: Baikal struggles to meet Russia's demand Chinese flash memory maker claims breakthrough - QLC NAND matches endurance of TLC NAND By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Roshan Ashraf ShaikhMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Anton ShilovMarch 27, 2024 By Aaron KlotzMarch 27, 2024 By Anton ShilovMarch 27, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}