{
    "title": "Nvidia and AMD Rule The Charts - Here Are Other Semiconductor Plays That \nAnalysts Root For - NVIDIA (NASD",
    "date": "1/23/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36747355/nvidia-and-amd-rule-the-charts-here-are-other-semiconductor-plays-that-analysts-roo",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Analysts discussed their favorite semiconductor plays on Monday. Citi analyst Christopher Danely expressed his positive stance on semiconductors given the stabilization in the PC, wireless, and server end markets (combined 56% of the semiconductor Total Addressable Market). With semiconductor units down 20% year-on-year in 2023, he noted that the worst unit correction in 22 years is almost through the inventory correction. While Danely expects more estimate cuts to the analog companies due to the auto and industrial correction (combined 30% of semi-TAM), the analyst noted these cuts are getting smaller, and should trough in the first half of fiscal 2024. Danely is most positive on DRAM and reiterated Micron Technology, Inc MU as his top pick, given his expected 50% year-on-year increase in DRAM pricing in 2024. Danely’s other Buy-rated names include Advanced Micro Devices, Inc AMD, Microchip Technology Inc MCHP, AVGO, Analog Devices, Inc ADI, ON Semiconductor Corp ON, Qualcomm Inc QCOM, and GlobalFoundries Inc GFS. Micron’s price target of $95 reflects DRAM upturn. AMD’s price target of $136 builds on PC recovery, server share gains and AI success. Broadcom’s price target of $1,100 took into account the company being an AI beneficiary, EPS accretion from VMWare. Microchip’s $100 price target builds upon bottoming of consensus EPS estimates. Qualcomm’s $160 price target attracted attention courtesy of wireless inventory replenishment and share gains at Samsung. Analog Devices’ price target of $210 gained attention as one of the most defensive name with bottoming consensus EPS estimates. On Semiconductor’s $85 price target reflected silicon carbide offsetting some of the downturn. GlobalFoundries’ $70 price target got a callout for restructuring initiatives offsetting semiconductor downturn. Mizuho analyst Vijay Rakesh hosted an expert in the data center and AI supply chain for updates on the ramps of new AI products and the outlook on server computing into 2024E as he noted units recovering up ~0-7% year-on-year. The analyst flagged Intel Corp INTC Sierra Forest and Granite Rapids ramping during the second half of fiscal 2024 and the first quarter of fiscal 2025 to close the gap with AMD. He also stressed that Nvidia Corp NVDA dominates AI moat with integration and software, though AMD is potentially catching up. The analyst also highlighted AMD MI300X, noting strong demand with performance and pricing similar to H100 with potential wins at TensorWave, Microsoft Corp MSFT, Meta Platforms Inc META, and ramping with Coreweave and Super Micro Computer, Inc SMCI, among others. The analyst noted that the AI GPU bottleneck remains at the foundry with substrates. Rakesh flagged NVDA’s leading AI GPU with a strong software moat, and AVGO positioned well with a strong portfolio and solid execution. The analyst also favored AMD courtesy of improving AI competition, which is a positive for the industry overall and is positive on INTC as he noted a return to roadmap execution. The analyst said that the current 2024E AI server demand primarily remains at hyper scalers, with non-hyper scaler demand potentially ramping into 2025 and 2026 as ROI potentially improves. Rakesh mentioned potential for HDD pricing up ~20% positive for STX-WDC during the first half of 2024, but also a tailwind specifically for HBM with pricing ~5x DDR5, positioning MU well with its HBM3E qualifying at NVDA and expanding capacity. Rakesh had a Buy rating on AMD with a price target of $162, citing server share target wins and upcoming game console launches. He had a Buy rating on Broadcom with a price target of $1,250, which is well positioned with 2024 opportunities with Networking and AI ramps and a strong position in Wireless. Its software segment could provide further operating leverage and drive even more robust FCF per the analyst. Rakesh has a Buy rating on Intel with a price target of $58, being a PC market leader but also setting up for a strong 2024 with improving PC/DC markets along with multiple other tailwinds, including AI opportunities, IFS expansion, margin improvements, and value unlock with FPGA spin. The analyst added that INTC is also on track for its five nodes in 4 years, closing the technology gap versus peers. He has a Buy rating on Micron with a price target of $100, with 2023 headwinds mostly behind with inventories normalizing, pricing stabilizing, and demand recovery. Rakesh has a Buy rating on Nvidia with a price target of $625, citing improving PCs, AI deep learning, and inferencing markets now with generative AI tailwinds, gaming trends, automotive, and data center positioning it for upside to estimates. The analyst added that NVDA is also well set for the growing machine learning, deep learning, and AI markets driving 10-11x performance versus CPUs. The analyst’s Buy rating on Seagate Technology Holdings Plc STX with a price target of $100 builds on HDD inventories normalizing post-first quarter of fiscal 2023 with potential for a return growth earlier than as inventories are flushed out at crucial enterprise customers, setting up Seagate for a solid second half. Western Digital Corp’s WDC Buy rating and $62 price target reflects an improving HDD/NAND market as suppliers focus on lowering capex and supply growth to help normalize inventories, setting up for a better 2024 recovery. Nvidia stock gained 209% last year thanks to the AI frenzy. AMD gained 116%, and Broadcom 108%. Intel gained 58% and Micron 42%. Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}