{
    "title": null,
    "date": "1/31/2024",
    "url": "https://www.howtogeek.com/amd-zen-5-processors-coming-2024/",
    "text": "Ryzen 9000, perhaps? AMD has switched from releasing new CPUs and architectures once per year to once every two years. The Ryzen 7000-series CPUs, based on the Zen 4 architecture, were released in late 2022, with AMD sticking with Zen 4 throughout 2023 and the beginning of 2024. AMD will need to release its latest, greatest processor eventually, though. The company has been quiet about it, but now, it has confirmed that Zen 5 is coming very, very soon. AMD recently unveiled its 2023 financial results and discussed future plans in an investor call. Among the announcements it made, the company confirmed that Zen 5 CPUs will be landing on store shelves later this year in 2024, maintaining that once-every-two-year cadence we've mentioned for its Zen architecture. The company confirmed the release of Epyc CPUs featuring the Zen 5 architecture later this year. It didn't really make any reference to Zen 5 Ryzen CPUs during the actual call, as it went into detail talking about the Epyc server chips, but Tom's Hardware confirmed with AMD that, indeed, Ryzen consumer CPUs are included here, and that they will also be released later this year. The company hasn't revealed a complete list of its future products, and we don't really know which chips will launch by the end of this year, but we can still speculate. We'll likely see a batch of Ryzen 9, Ryzen 7, and Ryzen 5 CPUs using Zen 5 cores, and given the company already released Ryzen 8000 CPUs (which are just Zen 4 chips with a dedicated NPU), we may see these branded as Ryzen 9000-series chips. If the Ryzen 7000-series launch is anything to go by, we'll also see non-3D chips (with regular level 3 cache and no 3D V-Cache) launching by the end of this year, while 3D chips will launch during CES 2025. Then again, 3D V-Cache wasn't mentioned once during the earnings call, so this could also finally be the year where AMD decides to just include it on all its desktop chips by default. Some uncertainties also linger about Zen 5, particularly regarding the TSMC node and whether it will be 4nm or 3nm. The former seems likely due to maturity and pricing advantages, but both nodes are on AMD's roadmap, so we won't really know until the actual chips launch. Zen 5 is expected to maintain overall architecture, clock speeds, and core counts. The emphasis on AI performance throughout the call suggests it will play a significant role in AMD's upcoming launch, so expect an NPU on these as well. Source: Seeking Alpha, Tom's Hardware via ExtremeTech   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Arol is a tech journalist and news/feature writer at How-To Geek. He also writes at sister sites MakeUseOf and Android Police. Currently a Pharmacy student at the Central University of Venezuela, Arol has had a soft spot for everything tech-related since he was a child. When not writing, you'll either find him nose-deep into his textbooks or playing video games. Does Google's second attempt at a smartwatch make enough improvements? A basic Bluetooth speaker for easy carrying that undercuts the price of similar products. If it ain't broke, don't fix it. With the Free Pro 3, EarFun continues to prove that you don't need to spend much for a great, fun-sounding set of earbuds with impressive features. I’ve become a handheld PC gamer, and I'm never going back. Intel says a dedicated keyboard key is one of Microsoft's requirements for an \"AI PC.\" "
}