{
    "title": "Intel bets on a secret weapon to beat AMD in some AI workloads — AVX-512 \ninstructions will help Xeon beat Epyc in ...",
    "date": "1/12/2024",
    "url": "https://www.techradar.com/pro/intel-bets-on-a-secret-weapon-to-beat-amd-in-some-ai-workloads-avx-512-instructions-will-help-xeon-beat-epyc-in-specific-scenarios-but-intel-will-have-to-work-much-much-harder-to-worry-amd",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Enabling AVX-512 more than triples performance on various AI-related workloads, according to benchmarking Intel’s 5th-Gen Xeon Scalable processors, built on the Emerald Rapids architecture, can benefit from a huge raw performance boost when running AVX-512 workloads. An Intel Xeon Platinum 8592+ CPU can almost double its average performance while also increasing power efficiency when running AVX-512 instructions in a handful of specific workloads, according to benchmarking site Phoronix. AVX-512 is an instruction set that increases the performance of a CPU by running the same instructions across different data points – known as single instruction multiple data (SIMD). Its main goal is to speed up data compression, cryptographic calculations and image processing tasks. It was criticized in the past due to poor power efficiency, however, and excessive heat generation. But recent generations of Intel Xeon CPUs don’t tend to display these side effects, rendering it a viable way to harness the full potential of the server-oriented processors. Phoronix ran two 64-core Intel Xeon Platinum 8592+ CPUs on Ubuntu 23.10 with the Linux 6.5 kernel in the Intel Eagle Stream reference server. This system was fitted with 1TB DDR5 RAM as wel as a 3TB SSD. In various benchmarks – including Embree, OpenVKL and Y-Cruncher – turning AVX-512 doubled the performance of the CPU. On the OpenVINO benchmark, in particular, enabling AVX-512 saw performance shoot up by up to more-than three times. OpenVINO is a toolkit Intel devised around neural networks; in particular, OpenVINO allows developers to quickly create applications for a variety of AI-centric tasks including emulating vision, speech recognition, and natural language processing. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! The CPU also experienced no major power usage or heat generation concerns, according to Phoronix, which highlighted the benefits of AVX-512 in today’s day and age, despite concerns when the tech first burst onto the scene. Although Intel’s latest 5th-gen Xeon CPU may be one of the best processors for servers, based on raw performance it hasn’t hit the dizzying heights set by AMD’s 96-core counterpart – the Ryzen Threadripper Pro 7995WX. This CPU holds the world record in a number of categories, comfortably pipping anything Intel has to offer at the time of writing. Keumars Afifi-Sabet is the Technology Editor for Live Science. He has written for a variety of publications including ITPro, The Week Digital and ComputerActive. He has worked as a technology journalist for more than five years, having previously held the role of features editor with ITPro. In his previous role, he oversaw the commissioning and publishing of long form in areas including AI, cyber security, cloud computing and digital transformation. Canonical announces Snap Store crackdown after crypto scam apps overload DNA storage is coming, it's just a matter of when not if — SNIA quietly unveils first specifications for storing bytes in DNA medium, an important first step towards almost ultra-cheap, limitless storage Quordle today – hints and answers for Saturday, March 30 (game #796) By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Tom PowerMarch 29, 2024 By Mike MooreMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Lance UlanoffMarch 29, 2024 By Craig HaleMarch 29, 2024 By Craig HaleMarch 29, 2024 By Rowan DaviesMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}