{
    "title": "AMD Radeon RX 7900 GRE now available for €540 in Europe, new custom model \nspotted",
    "date": "1/19/2024",
    "url": "https://videocardz.com/newz/amd-radeon-rx-7900-gre-now-available-for-e540-in-europe-new-custom-model-spotted",
    "text": "Following the official price change for Radeon 7900 XT, AMD is also promoting its GRE model with lower price.¬†  Earlier this week, AMD implemented a price reduction for the Radeon RX 7900 GRE, which is officially intended for system integrators. This SKU has quickly found its way into the DIY market and is now available at a reduced price. As a reminder, the RX 7900 GRE features Navi 31 XL GPU with a package size of Navi 32 but with a higher core count. With 5120 Stream Processors onboard and a 16GB GDDR6 memory setup across a 256-bit bus, this card, at least on paper, appears similar yet superior to the RX 7800 XT, which shares a similar memory configuration but has significantly fewer cores (3840). However, in the real-world performance tests, the RX 7900 GRE doesn‚Äôt see a substantial boost, mainly due to a constrained power limit of 260W, which is even lower than the RX 7800 XT‚Äôs 263W. In Italy, the XFX reference design of the RX 7900 GRE is currently priced at ‚Ç¨541, reflecting a ‚Ç¨60 reduction from its cost two months ago. This stands as the lowest price observed for this card in Europe. Meanwhile, in Germany and Spain, the card‚Äôs price has been adjusted to ‚Ç¨579, seemingly adopting the new MSRP for the model.   Sapphire RX 7900 GRE in Spain & Italy    Sapphire RX 7900 GRE in Germany, Source: MindFactory  Additionally, it‚Äôs worth noting that Mindfactory has introduced a new model, the ASRock RX 7900 GRE Challenger, to its listings. This SKU is not yet listed by the manufacturer, hence, there are no photos or specs. Despite this, this German retailer already has these cards in stock and ready to ship. AMD has not officially announced the RX 7900 GRE as a DIY design, but the card is clearly being distributed to retailers across Europe. It‚Äôs interesting that these cards are not available in North America yet, but this might change if AMD wants to have more options available for the upcoming RTX 4070 Ti SUPER. Source: PSKMegaStore, MindFactory, CoolMod Many thanks to pollane & benny for the tips! We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright ¬© 2024 ¬∑ VideoCardz.com "
}