{
    "title": "US Stocks Drift Lower As Dollar, Treasury Yields Rise, AMD Defies Gravity: \nWhat's Driving Markets Tuesday",
    "date": "1/16/2024",
    "url": "https://www.benzinga.com/markets/equities/24/01/36647944/us-stocks-drift-lower-as-dollar-treasury-yields-rise-amd-defies-gravity-whats-driving-markets-tu",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW The U.S. stock market resumed its decline on Tuesday following a one-day closure for Martin Luther King Jr. Day. The major indices were all in the red around midday trading in New York as investors continue to monitor corporate earnings season and prospects for future interest rates. The S&P 500 slipped by 0.5%, while the tech-heavy Nasdaq 100 limited its losses to 0.4%, buoyed by the semiconductor sector, with Advanced Micro Devices Inc. AMD shining with a 7% gain. Both the Dow Jones and the Russell 2000 underperformed, as both large and small-cap stocks bore the brunt of a strengthening U.S. dollar and rising Treasury yields. The U.S. Dollar Index (DXY), tracked through the Invesco DB US Dollar Bullish Fund UUP, reached levels last seen more than a month ago, as Fed Governor Christopher J. Waller pushed back against market expectations of a Fed rate cut in March. “With economic activity and labor markets in good shape and inflation gradually coming down to 2%, I see no reason to move as quickly or cut as rapidly as in the past,” Waller said in his prepared remarks. He indicated that his view aligns with the Fed policymaker projections for three 25-basis-point rate cuts in 2024. Treasury yields soared across all key maturities. The 30-year yield surged to 4.32%, the highest in a month, with the iShares 20+ Year Treasury Bond ETF TLT tumbling 2%, its worst session in more than two months. Gold also fell 1.4% to $2,026/oz hit by stronger dollar and yields, while Bitcoin BTC/USD was 1.4% higher to $43,100. The SPDR S&P 500 ETF Trust SPY fell 0.5% to $474.15, the SPDR Dow Jones Industrial Average DIA inched 0.7% down to $373.17 and the tech-heavy Invesco QQQ Trust QQQ was 0.3% lower to $408.12, according to Benzinga Pro data. Sector-wise, all 11 S&P 500 sectors recorded losses, with the Energy Select Sector SPDR Fund XLE underperforming, down 1.9%, as oil and natural gas prices moved lower. The Consumer Discretionary Select Sector Fund XLY and the Technology Select Sector Fund XLK trimmed losses, both down 0.3%. On an industry level, the VanEck Semiconductors ETF SMH rose 1.2%. Gold miners, as tracked by the VanEck Gold Mining ETF GDX, tumbled 4.7% Read now: ‘Dogecoin Killer’ Shiba Inu Sees 1600% Rise In Burn Rate — 88M Tokens Sent To Dead Wallet In A Single Day Photo via Shutterstock. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}