{
    "title": "AMD believes it has the upper hand over Nvidia in upscaling thanks to \ndriver-based frame gen: 'they're probably going ...",
    "date": "1/10/2024",
    "url": "https://www.pcgamer.com/amd-believes-it-has-the-upper-hand-over-nvidia-in-upscaling-thanks-to-driver-based-frame-gen-theyre-probably-going-to-need-to-do-something-similar/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. As Nvidia and AMD continue to trade blows, AMD's Aaron Steinman thinks Nvidia may need to change tack. AMD and Nvidia are in a cat and mouse game. When one launches a new upscaling technology, the other follows. DLSS, then FSR. Frame Generation, then Frame Generation (AMD style). You get the idea. Traditionally we've come to expect Nvidia to lead and AMD to follow, but that's not how AMD's Aaron Steinman sees it. \"I would be curious to know if Nvidia feels now they have to match what we've done in making some of these solutions driver-based,\" says Steinman. The driver-based technologies that Steinman is referencing are AMD Fluid Motion Frames (AFMF), launching out of preview later this month, and Radeon Super Resolution (RSR), which is already available. These two technologies differ from AMD's FidelityFX Super Resolution (FSR) in that they don't require developers to support them in their games. They'll work, to some extent, on most games. \"I think what we're gonna start seeing, DLSS is only available on certain solutions, so either Nvidia is going to have to benefit from our solution because we did make it open-source and cross-vendor, or they're probably going to need to do something similar.\" Take Avatar: Frontiers of Pandora, for example. This game offers AMD Frame Generation and FSR 3. There's no DLSS support, which means Nvidia GPU owners must use AMD's upscaling tech instead. That's easy enough to do, of course, as AMD's upscaling tech isn't proprietary and will work on most cards of a reasonable enough age, but I wonder how that sits with Nvidia. To be fair to Nvidia, the company does offer a driver-based upscaling option called Nvidia Image Scaling. It's a much more simple upscaling technology than the AI-infused DLSS, and relies instead on a sharpening filter to help improve final image clarity. Nvidia has no driver-based version of its Frame Generation technology, however, which is exclusively paired with DLSS 3. Ultimately, we'll have to see how well AFMF works in any old game before deciding to camp outside Nvidia HQ to demand a green team version. Sign up to get the best content of the week, and great gaming deals, as picked by the editors. We've taken the latest preview for a spin on the Framework 13 running the Ryzen 7 7840U and it's pushed Baldur's Gate 3, running on FSR 2 Balanced, from around 30 fps on High up to a pretty solid 60 fps. And it looks really good doing it. So, it's definitely looking promising. \"I mean, the competition will never end, right? We'll have new technologies, they'll have new technologies,\" Steinman says.  Best CPU for gaming: The top chips from Intel and AMD.\nBest gaming motherboard: The right boards.\nBest graphics card: Your perfect pixel-pusher awaits.\nBest SSD for gaming: Get into the game ahead of the rest. I have to agree, it feels like we're still at the beginning of an upscaling arms race that neither company will back down from, at least not without going bankrupt. And looking at their financials after the AI boom, I don't think that's going to happen anytime soon. Over at CES, AI is all most companies are talking about, and I asked Steinman if he thinks we'll see a lot more AI acceleration in our gaming GPUs with time. \"I think so. That's a trend that we will undoubtedly see.\" AI accelerated features feels like the inevitable next step for AMD's Radeon division, and that would see the company matching Nvidia's product stack pretty much powered by AI already, including new additions from CES 2024, such as RTX Video HDR. _____________________________________\nPC Gamer's CES 2024 coverage is being published in association with Asus Republic of Gamers. Jacob earned his first byline writing for his own tech blog. From there, he graduated to professionally breaking things as hardware writer at PCGamesN, and would go on to run the team as hardware editor. Since then he's joined PC Gamer's top staff as senior hardware editor, where he spends his days reporting on the latest developments in the technology and gaming industries and testing the newest PC components. This home-brew GPU built by a lone enthusiast is a slightly labour-intensive way to avoid painful graphics card prices I wonder how future historians will judge this image of Zuckerberg's 'jersey swap' with Jen-Hsun and his signature leather jacket A demo for Final Fantasy 16 is reportedly coming to PC soon, as producer Yoshi-P says work on the port is 'going smoother than we thought it would' By Joshua Wolens28 March 2024 By Dave James28 March 2024 By Wes Fenlon28 March 2024 By Wes Fenlon28 March 2024 By Harvey Randall28 March 2024 By Andy Chalk28 March 2024 By Phil Savage28 March 2024 By Joshua Wolens28 March 2024 By Harvey Randall28 March 2024 By Lauren Morton28 March 2024 By Harvey Randall28 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}