{
    "title": "Sony Playstation chipmaker AMD hires Lam Research CLO to head legal team",
    "date": "1/24/2024",
    "url": "https://www.globallegalpost.com/news/sony-playstation-chipmaker-amd-hires-lam-research-clo-to-head-legal-team-249022287",
    "text": "January, 24 2024 Ava Hahn\n                                                                Photo courtesy of AMD By Ben Edwards The Global Legal Post US semiconductor giant AMD (Advanced Micro Devices) has hired Ava Hahn as its general counsel, succeeding Harry Wolin who is retiring from the company after almost a quarter of a century. Hahn joins from US semiconductor peer Lam Research, where she was chief legal officer overseeing global legal and government affairs. At AMD, she will take on a similar remit, as well as serving as company secretary. Santa Clara, California-based AMD develops processors for computers, laptops and games consoles, such as the Sony Playstation and Microsoft’s Xbox. Lisa Su, AMD’s chair and CEO, said: “I am excited to welcome Ava to AMD. Her extensive experience leading legal functions for multiple technology companies will be an invaluable asset as we enter our next phase of growth.” Hahn has headed up a number of in-house teams at tech companies and venture capital firms since leaving Wilson Sonsini Goodrich & Rosati in 2000, where she spent three years as an associate. Those experiences include five years as GC at legacy circuit-maker Genesis Microchip (acquired by ST Microelectronics in 2007) and almost six years as GC and vice president for corporate development at legacy telecoms vendor ShoreTel (acquired by Mitel in 2017). She has also been GC at Aruba Networks (now part of Hewlett Packard Enterprises), Felicis Ventures, Kleiner Perkins Caufield & Byers and CA Technologies (now part of Broadcom). She joined Lam Research at the start of 2020. Hahn is a member of the State Bar of California and holds a juris doctor degree from Columbia Law School. Wolin, meantime, leaves AMD after 24 years, having become GC in 2003. He originally joined the company in 2000 as vice president for intellectual property from telecoms giant Motorola, where he was director of legal affairs for its semiconductor products sector. Su said: “I want to thank Harry for the role he has played leading our legal, government relations and public affairs teams during a period of significant growth and transformation.” AMD saw revenue hit $22bn in the 12 months to the end of September, a 3% decline on the same period a year earlier. It will announce full year results for 2023 on 30 January. Email your news and story ideas to:\n        news@globallegalpost.com 2mos 2mos 2mos 2mos 3mos 1 5d 2 5d 3 5d 4 4d 5 4d 6 3d 2d 2d 2d 2d 3d Copyright 2024 © The Global Legal Post. All Rights Reserved "
}