{
    "title": "Samsung Exynos 2400 Detailed: 10-Cores, 3.2 GHz Clock Speed, and AMD RDNA 3 \nGPU",
    "date": "1/17/2024",
    "url": "https://www.gizchina.com/2024/01/17/samsung-exynos-2400-detailed-10-cores-3-2-ghz-clock-speed-and-amd-rdna-3-gpu/",
    "text": "Samsung put its Exynos division to rest last year and the Samsung Galaxy S23 series arrived only in Snapdragon flavors. This year will be different with the launch of the new Exynos 2400 chipset. The new SoC arrives with a Deca-Core arrangement, something that we haven’t seen since the days of MediaTek’s Helio X-series. The Exynos 2400 will be present in some of the vanilla Galaxy S24 and the Galaxy S24+ units in certain markets including Europe. Technically, the Exynos 2400 was unveiled in October. However, Samsung didn’t reveal the details until today. The folks at GSMArena, inspectioned one Samsung Galaxy S24+ unit with this chipset inside. Thanks to it, we now know what Samsung has in tow for the market with the return of its Exynos CPU. The chipset will try its luck against the Snapdragon 8 Gen 3 which will be present in other flagships and inside of the Samsung Galaxy S24 Ultra, which will ship only in the Snapdragon flavor.  Going for the details, Samsung will differentiate itself from competitors with a 10-core CPU. While most of the competitors stick with the usual Octa-Core arrangement, the company brings 10 cores to the game. The Exynos 2400 CPU has one powerful ARM Cortex-X4 core clocked at 3.2 GHz. It has two ARM Cortex-A720 cores running at 2,9 GHz, and three ARM Cortex-A720 cores at 2.6 GHz. There are also four ARM Cortex-A520 cores at 2 GHz. We will have to wait for comparisons to determine if these extra two cores will make a difference against other flagship SoCs. However, I feel Samsung missed the opportunity to make a dual Cortex-X4 core cluster for performance tasks. It could give the Exynos 2400 more power for heavier tasks like gaming. For comparison, the Snapdragon 8 Gen 3 sticks with 1x ARM Cortex-X4, and the Dimensity 9300 has four. Below You can see how the numbers compare between the Exynos 2400 and the Exynos 2200. Moving on, the Exynos 2400 brings a 1.7x increase in CPU performance. It also gets a 14.7x boost in AI Processing compared to the Exynos 2200. When it comes to the GPU, we have another edition of the Xclipse series which comes from the partnership between Samsung and AMD. The new SoC has the Xclipse 940 GPU which is built on the AMD RDNA 3 architecture. It improves support for mobile ray tracing, and rendering and will result in more realistic reflections on gaming. Not all games are taking advantage of these technologies, but that will change in the future. The Exynos 2400 is built on the 4nm LPP+ process by Samsung Semiconductor. All cores are based on the ARMv9 architecture, it also comes with a new ISP and support for LPDDR5X RAM and UFS 4.0 storage.  We have to wait for real-world tests to compare the performance of the Exynos 2400 chip against the Snapdragon 8 Gen 3 and the Dimensity 9300. More users will be able to see the difference between the first vanilla and units of the S24 series and reach consumers. The Samsung Galaxy S24 and S24+ are available for pre-order from today January 17th and the shipments will begin on January 31st for most of the countries. The new Samsung Galaxy S24 and S24+ will reach some regions in Europe with the Exynos 2400. Besides the new chipset, the new flagships also bring Dynamic AMOLED displays with up to QHD+ resolution, 1-120Hz Adaptive Refresh Rate, Wi-Fi 7, 50 MP cameras, and a set of AI features. They will receive up to seven major OS updates and you can find all details about them here. Marco is the HARDWARE & OS EXPERT of Gizchina for the past 4 years. He is Fascinated for technology. He is constantly diving into the Software Development Field and is an expert in all kind of Hardware. He is passioned for the Chinese world of Smart Devices and an addict for technology in general.     GizChina Follow @gizchina  Accredited technology blog dedicated to providing breaking news, expert reviews and original content related to mobile tech and EV industry, smartphones, gadgets and IoT. Keep up to date with the latest Android phone news and reviews on our social media channels: "
}