{
    "title": null,
    "date": "2/9/2024",
    "url": "https://www.theregister.com/2024/02/09/amd_grew_market_share_in/",
    "text": "AMD is steadily accumulating CPU market share, according to new figures from Mercury Research, and Arm-based systems now account for more than 10 percent of PC client sales. Mercury Research, which tracks PC-related semiconductor and component shipments, reported that in Q4 of 2023, total x86 processor shipments grew year-on-year for the first time in two years. AMD gained market share over Intel in server, desktop, and mobile CPUs when compared with the same period a year earlier, according to Mercury's figures. Intel still accounts for the lion's share in all those markets, it should be noted. In fact, for total unit shares for 2023, AMD's share was up half a point to 31.1 percent, which is a new record high for the company, with Intel's share down a half point to \"just\" 68.9 percent. In servers, AMD accounted for 23.1 percent of market sales in Q4, up from 17.6 percent a year earlier, although server CPU shipments were up across the board. Both Intel and AMD saw significant growth in standard datacenter CPU products, with Intel's \"Sapphire Rapids\" Xeon Scalable processors and AMD's 4th generation EPYC \"Genoa\" and \"Bergamo\" increasing. But server CPUs also showed growth outside the datacenter, with products like Xeon D and Atom in networking and storage applications growing in the quarter. For desktop CPUs, AMD outgrew Intel, accounting for 19.8 percent of the market in Q4 against 18.6 percent a year earlier. Mercury attributed this to growth in both the \"Raphael\" Ryzen chips and a surprise uptick in \"Vermeer\", the previous performance desktop generation based on Zen 3 cores. In mobile chips, the market share growth was even greater, with AMD hitting 20.3 percent in Q4, up from 16.4 percent for the same period a year earlier. This was due to AMD's \"Phoenix Point\" Ryzen 7040 and lower-end \"Mendocino\" processors, with the growth for Intel coming in the \"Raptor Lake\" Core chips, although the \"Meteor Lake\" Core Ultra chips shipped during in the quarter. However, Mercury notes that if you look at the all-inclusive market share, which includes client and servers plus IoT and semi-custom products used in items like gaming consoles, Intel actually expanded its share. On this metric, the Santa Clara chipmaker reached 71.4 percent during Q4, up from 68.7 percent a year earlier. While Mercury's figures only include x86 processors, the company estimates that Arm PC CPUs also grew well in Q4, although outpaced by the inventory recovery of x86 chips. It gauges that Arm PC client CPU share (including Chromebooks and Apple's M-series based Macs) in the fourth quarter stood at 10.2 percent, down from a revised third quarter estimate of 10.7 percent, because of that x86 growth. ® Send us news The Register   Biting the hand that feeds IT Copyright. All rights reserved © 1998–2024 "
}