{
    "title": "Microsoft is adding support for AMD's neural processors in Windows – here's \nwhy it matters",
    "date": "2/19/2024",
    "url": "https://www.techradar.com/computing/laptops/microsoft-is-adding-support-for-amds-neural-processors-in-windows-heres-why-it-matters",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Another new AI-related feature for Windows – but I actually like this one Microsoft is getting in gear for the impending rise of hardware-accelerated local AI tools, and while the first steps might seem boring, they’re important nonetheless. Yes, I’m going to talk about Task Manager – wait, don’t leave! I know, it’s hardly the most glamorous topic out there, but this an important development. AMD has announced that it's working with Microsoft to add support for the former’s latest neural processing units (NPUs) in Windows; specifically, enabling the Microsoft Compute Driver Model (MCDM) for the AMD chips, which will enable Task Manager to monitor NPU resource usage the same way it does for the CPU, GPU, and your other components. It’s probably a relief for AMD, because its biggest rival, Intel, already has MCDM support for its own on-chip NPUs, despite Team Red being first to the NPU market. AMD praised Microsoft for acknowledging the importance of neural processing hardware, noting that AI use – which can be accelerated by a local NPU – is likely to burgeon in the coming years and commending Microsoft’s efforts to \"keep pace with the added complexity of PCs\". Every major chipmaker, including AMD, is currently on board the AI bandwagon, and that means dedicated hardware in your device for powering AI workloads. ‘Local’ AI has many advantages over currently-available cloud-based AI tools such as ChatGPT, such as faster processing times, no need for a constant internet connection, and superior user security; so it’s not hard to see why NPUs have become the new gold rush target. In practice, that means we’re going to see more and more laptops and desktop PCs (and also phones and tablets!) featuring these dedicated AI chips as standard. Microsoft’s upcoming integration for AMD’s NPUs is specifically for the new Ryzen 8040 series of chips, which are laptop-only processors. While the initial functionality will be limited to monitoring the NPU within Task Manager, it paves the way for full hardware-accelerated AI within Windows.  But even just Task Manager integration is good and important – and if you don’t use Task Manager, you should. It’s an invaluable tool for keeping track of how efficiently your computer is running, letting you see if your system is bottlenecking on a single component or chewing up power when running specific programs; it's an especially useful tool especially for laptop users, who can use it to fine-tune their power settings for better battery life. I was pleased to see that AMD agrees with my assessment, with a spokesperson saying the resource allocation tracking is “particularly important in notebooks where end users may choose to maximize battery life by controlling where certain workloads run or adjusting global power settings”. Even if your laptop doesn’t have an NPU (most don’t at present), Task Manager can help you squeeze the most out of its battery life. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. In any case, we’re probably only a year or two away from seeing all the best laptops featuring their own onboard NPUs, so Microsoft probably couldn’t afford to drag its heels any longer. It’s not quite clear from AMD’s blog post whether this is a Windows 11-exclusive update or will apply to older versions of the OS too, but it wouldn’t surprise me if it’s the former – as we know, Microsoft really wants you to update! Christian is TechRadar’s UK-based Computing Editor. He came to us from Maximum PC magazine, where he fell in love with computer hardware and building PCs. He was a regular fixture amongst our freelance review team before making the jump to TechRadar, and can usually be found drooling over the latest high-end graphics card or gaming laptop before looking at his bank account balance and crying.  Christian is a keen campaigner for LGBTQ+ rights and the owner of a charming rescue dog named Lucy, having adopted her after he beat cancer in 2021. She keeps him fit and healthy through a combination of face-licking and long walks, and only occasionally barks at him to demand treats when he’s trying to work from home. Microsoft Surface Pro 9 gets huge $540 discount at Best Buy ahead of Pro 10 launch GHD Chronos vs GHD Platinum Plus OpenAI's new voice synthesizer can copy your voice from just 15 seconds of audio By Cesar CadenasMarch 29, 2024 By Alex WhitelockMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Tom PowerMarch 29, 2024 By Mike MooreMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}