{
    "title": null,
    "date": "2/5/2024",
    "url": "https://edgeup.asus.com/2024/how-to-build-a-budget-gaming-pc-in-2024-with-asus-prime-and-tuf-gaming/",
    "text": "When a friend comes to me asking for recommendations on what parts to use for a new gaming PC, it’s awfully tempting to talk about the latest cutting-edge components. But that’s not always what they’re looking for – and it may not be what you’re looking for, either. Plenty of folks out there are looking to build a budget gaming PC that takes care of their everyday computing needs while also letting them join their friends in a few rounds of Fortnite, League of Legends, or Palworld without breaking the bank. If that sounds like the PC that you want, then you came to the right place. Here’s how to build a gaming PC on a budget in 2024. Most reviewers out there will tell you that for a gaming rig, you should reserve as much of your budget as possible for the graphics card. That’s generally excellent advice – but for the most cost saving possible, you could go for a CPU with integrated graphics powerful enough to get you in the game. AMD just launched two CPUs that fit that bill nicely: the AMD Ryzen 7 8700G and AMD Ryzen 5 8600G. The 8600G is the cheaper of the two, but don’t discount the performance that it can bring to the table – PC Gamer found that this chip averaged 77 FPS in F1 22 at Full HD with FSR enabled. That’s nothing to sneeze at. The AMD Ryzen 7 8700G offers more performance, but it might be better suited for small form factor builds that simply don’t have the physical space for a discrete GPU.  As socket AM5 chips, the Ryzen 5 8600G and Ryzen 7 8700G require an X670, B650, or A620 motherboard. Our most affordable options come from our A620 lineup, like the ASUS Prime A620-Plus WiFi. At just $139.99, this motherboard won’t break your budget, yet it provides a PCIe 4.0 M.2 slot, WiFi 5 support, and a classic black-and-white design that fits in well with a wide range of hardware. For longer-term value, we might encourage you to look at the TUF Gaming B650-Plus WiFi. Going for a B650 motherboard gives you access to overclocking and more and faster USB ports. Additionally, you’ll get WiFi 6 over WiFi 5. With the combination of a WiFi 6 router and compatible WiFi 6 devices, you’ll have a better experience on a busy network with many connected devices.  Down the road, you might decide to augment this machine’s gaming prowess with a graphics card. The ASUS Prime 750W Gold and TUF Gaming 750W Gold will more than take care of your needs right now while offering the headroom you’ll need to add in a graphics card later. For complementary style, match your Prime or TUF Gaming hardware with the ASUS A21 or TUF Gaming GT301 chassis, respectively. Some notes on completing your build: with DDR5 RAM, we recommend at least a 16GB kit of DDR5-5200, but let yourself be tempted by a 32GB kit of DDR5-6000. You’ll pay more, but you’ll get more. A 500GB SSD is sufficient for a small gaming library, but if you have a habit of installing every title that the Epic Games Store gives you for free, you’ll run out of space fairly quickly. While the AMD Ryzen 7 8700G and Ryzen 5 8600G offer a tempting entry point to Full HD gaming, it’s worth considering a build that includes a discrete GPU instead. You’ll get substantially more FPS in your favorite games with this approach, and the total cost of your build might end up being lower than you expect. The trick to building such a budget gaming PC is to use last-gen hardware. Don’t discount the performance on tap from these components, especially for entry-level gaming on a Full HD display. Let’s explore two options that focus primarily on last-gen hardware. First up, let’s look at an Intel-based build. Team Blue’s 12th Gen Intel Core CPUs were quite well received, and their value-oriented models continue to offer gobs of performance per dollar. You’ll still find the Intel Core i3-1200F recommended for budget gaming PCs, and the Intel Core i5-12400 provides a nice step up in performance without costing a lot more.  For these chips, we recommend one of our latest B760 motherboards – you won’t save much scratch by looking at previous-gen motherboards like you do with CPUs, so you’re better off going with current offerings that offer the full suite of modern amenities. The Prime B760-Plus is a great starting point and it sells at a fantastic price, while the TUF Gaming B760-Plus WiFi D4 upgrades your experience while still staying underneath $200 (USD).  For graphics cards, we’ll present two options. For solid Full HD gaming performance, we think that the ASUS Dual Radeon RX 6600 is a very reasonable pick for gamers on a budget who’d prefer not to venture into the used graphics card market. To buy something cheaper, you’ll typically have to forgo many modern features, and to get something that’s clearly better, you’ll have to spend closer to $300.   For AMD fans, we have two alternative builds. The first uses the ROG Strix B550-F Gaming WiFi II motherboard as its foundation. There’s a reason why this board sits in the top five of Amazon’s list of best-selling motherboards.** That’s because you can still get excellent gaming performance out of a Ryzen 5000 Series CPU and a AM4 motherboard. Pair this beauty with a recently launched AMD Ryzen 5 5700X3D processor, and you have a potent pairing poised to power your budget gaming PC.  That makes for an affordable build – but let’s go even more affordable. The ASUS Prime B450M-A II sells for less than $100 these days, and it’s a perfect partner for a Ryzen 5 CPU.  Since it’s a smaller Micro-ATX motherboard, we’re pairing it here with the ASUS Prime AP201 Tempered Glass Micro-ATX case. This chassis delivers great airflow, wide compatibility with large graphics cards and power supplies, and a spacious tempered glass side panel, all for $89.99 (USD). *Actual retail prices may vary; total costs presented here are estimates based on market prices at the time of writing. Visit the sites of individual retailers for the most up-to-date information on product pricing. **As of 2/5/24 Choose categories* Edge Up is a resource for ASUS aficionados who want the inside scoop on new products and technologies. We go hands-on with the latest gear to see how it works in the real world and in-depth with the latest tech to explain what’s happening under the hood. We also offer guides and tips to help you get the most out of everything from individual components to complete systems to the hottest games.\n\nTerms of Use & Privacy Policy © ASUSTek Computer Inc. All rights reserved "
}