{
    "title": "Microsoft to detail DirectSR (Super Resolution) at GDC 2024 on March 21",
    "date": "2/25/2024",
    "url": "https://www.tweaktown.com/news/96440/microsoft-to-detail-directsr-super-resolution-at-gdc-2024-on-march-21/index.html",
    "text": "Microsoft has something new to show off at the upcoming Game Developer Conference (GDC 2024), which starts on March 21, with the introduction of DirectSR (or Direct Super Resolution) technology. Microsoft's upcoming DirectSR technology (source: GDC) We don't know what DirectSR will be doing exactly, but we can expect Microsoft's new super resolution technology to be something you simply enable in Windows and would support Intel, AMD, and NVIDIA graphics cards. This means standardizing super resolution technology at a software level, helped by GPU-accelerated cores. Microsoft hasn't been clear on the GPU cores or architectures, but I'm sure we'll see details at GDC 2024 next month. This is important to game developers, which need to add each upscaling technology individually -- Intel with XeSS, AMD with FSR, and NVIDIA with DLSS -- DirectSR could solve a lot of this, offering some kind of super resolution support by default. The post on the GDC website explains: \"The DirectX team will showcase the latest updates, demos, and best practices for game development with key partners from AMD and NVIDIA. Work graphs are the newest way to take full advantage of GPU hardware and parallelize workloads. Microsoft will provide a preview into DirectSR, making it easier than ever for game devs to scale super resolution support across Windows devices. Finally, dive into the latest tooling updates for PIX\". Windows \"automatic super resolution feature (source: PhantomOcean3) Another thing to note, is that an \"Automatic super resolution\" feature inside of Windows was recently discovered. If enabled, it will \"use AI to make supported games play more smoothly with enhanced details\" but we're unsure if this is the same, or related, to DirectSR. We've only got a few more weeks until we find out. Anthony Garreffa Anthony joined the TweakTown team in 2010 and has since reviewed 100s of graphics cards. Anthony is a long time PC enthusiast with a passion of hate for games built around consoles. FPS gaming since the pre-Quake days, where you were insulted if you used a mouse to aim, he has been addicted to gaming and hardware ever since. Working in IT retail for 10 years gave him great experience with custom-built PCs. His addiction to GPU tech is unwavering and has recently taken a keen interest in artificial intelligence (AI) hardware. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}