{
    "title": "CORSAIR A115 CPU Air Cooler Review - A Massive New Contender",
    "date": "2/20/2024",
    "url": "https://pcper.com/2024/02/corsair-a115-cpu-air-cooler-review-a-massive-new-contender/",
    "text": "Posted by Sebastian Peak | Feb 20, 2024 | Cases and Cooling | 1 Corsair is a big name in liquid cooling, of course, but they aren’t strangers to the CPU air cooler market, either. Remember the A500? Ok, so that one wasn’t especially popular (possibly due to some of the highest noise output you’ll find in a dual-fan air cooler). The A500’s fans had the best mounting system in the business, at least. If you don’t remember, they slide up and down easily, and hold their position. Don’t worry, Corsair kept the clever fan mounts with the new A115 air cooler, but otherwise has gone back to the drawing board in designing this large, dual-tower option. It offers six, 6mm heat pipes and a pair of the company’s 140 mm AF140 ELITE fans. Like the A500 the A115 has an asking price of $99.99 USD, which places it in the same company as quite a few large tower coolers on the premium side of the market. $99.99 USD list “High-Performance Air Cooler with six 6mm heat pipes and a copper cold plate for high-efficiency thermal transfer, paired with a variable slide-and-lock fan mount system and concentrated high airflow fans.” Corsair does a nice job with packaging, and though the box is devoid of any foam inserts the cardboard layout keeps things separated properly and my sample survived the perils of ground shipping. The mounting hardware is in individual, labeled bags that appear to be made of wax paper (the larger bags had each type of standoff and screw in additional labeled bags inside). I haven’t seen bags like this before, and they are easy to tear open which is a plus. This is a very large cooler. With official measurements including a height of 164.8 mm, width of 153 mm, and length of 155 mm, it is similar in size to a Noctua D15. The A115 features a dual-tower design with two 140 mm fans, one of which is installed from the factory. The heatsink towers have good fin density, there are six of the 6mm heatpipes in total. The nickel plated base has been milled flat – or, rather, convex to account for modern CPU warpage. (The fact that I exclusively use a contact frame for Intel processors may actually have been a negative with Corsair’s convex design, but more on that later.) The installation hardware is well designed and easy to use. There were problems, however, as the chunky VRM heatsinks on the ROG Strix Z690-E Gaming WiFi board I was using prevented the cooler from being installed in the correct direction. Sure, I could have installed it with the fans pointing up, but I decided to simply remove the VRM heatsinks from the board and live dangerously (if you trust der8auer there is no harm in this, as pro overclockers apparently know). In the gallery below you might notice where I circled the area being blocked by the VRM heatsink. The spread of the six heatpipes is very wide, so this motherboard is probably not the only one that will pose an installation problem – but I didn’t test any further boards. The fans, on the other hand, are a highlight of this design. The mounting system (Corsair calls it the “variable slide-and-lock fan mount system”) is so much better than the typical clips, allowing easy removal of either fan, as well as easy height adjustment at any time. The plastic tracks on the heatsink have depressions at intervals, and there are metal bands on the fan mounts that provide the friction to hold the fan in place. It’s a clever system, and it reminds me of how little I like dealing with metal fan clips. There are many ways to approach cooler testing, but I prefer to leave things at stock settings and run standard benchmarks, using a software tool like HWINFO64 to measure temperatures. This way the reader could achieve the same results if running identical hardware. That’s the theory, anyhow. These days, where out-of-the-box settings for Intel motherboards include 4095W power “limits” and the Core i9 processors pull 320+ watts, that doesn’t work – unless the point of cooler testing is to measure clock speeds over time, measuring the seconds (or milliseconds) until a CPU begins to throttle. AMD processors present their own challenges to the cooler reviewer. Should a popular X3D part be used, there just won’t be any thermal challenges as those are the best-behaved desktop CPUs in the industry. Their TDPs actually mean something. The non-X3D parts, such as the Ryzen 9 7950X that I began testing with, have imaginary TDPs (like Intel, but less outrageous) that must be stretched to fit a bigger Turbo (PPT) limit. AMD issued a public clarification of their power numbers a couple of years ago, though the advertised power specs are still misleading for both AMD and Intel. That Ryzen 9 7950X carries a 170W specification, but it is really a 230W (PPT) part under load unless you manually place a hard limit on the chip. Our Ryzen 9 7950X sample happily exceeds 230 watts at all times under an all-core load, with clock speeds adjusting to fit within the 95 C thermal window (a.k.a. throttling). The Core i9-14900K goes beyond 320W and hits 100 C right away, throttling to manage temps as it attempts to keep clocks as high as possible. It’s a mess for thermal testing, as throttling is not going to be the same for every chip (not every Core i9-14900K will hit 1.6 volts, but our sample likes to live close to the sun). In the end, there is no way (that I know of) to review CPU thermal loads in a way that will make everyone happy, unless a reviewer just throws the kitchen sink at it and spends weeks (or months) on a single cooler review. Prepare to be disappointed! No kitchen sinks were harmed in the making of this review. The various thermal loads shown on the chart were created by simply changing the PL1/PL2 limit of the same Core i9-14900K processor. 125W was chosen as the alleged TDP of the CPU, 170W was chosen as the alleged TDP of a Ryzen 9 7950X, 230W was chosen as it is the actual TDP of the Ryzen 9 7950X, and 253W was chosen as it is the official Maximum Turbo Power of the Core i9-14900K (if you manually enforce limits on the motherboard). No insane 4095W testing (default power limit) was performed. Temps are presented in degrees (C) above ambient, measured using HWINFO64 highest recorded package temps during each test. Note: As mentioned above, a contact frame was used to install the Core i9-14900K processor. In my experience this provides the best-case scenario for cooling these CPUs, as they tend to buckle a bit under the stress of the standard retention mechanism. In this case, however, Corsair has specifically designed the base of the A115 to have a slightly convex surface to account for CPU deformation, so my testing could certainly be called into question. If only I had noticed that feature before completing this review… (Perhaps we will revisit this cooler if thermals improve significantly with the stock retention mechanism.)  Thermals were controlled in all testing, with the Corsair A115 preventing the Core i9-14900K from reaching the throttling point all the way up to the official Maximum Turbo spec of 253 watts. Without factoring in the 21.4 C ambient during the Cinebench 2024 10-minute stress test, the hottest package temperature was 93 C. What about running without limits – as in, the default state for all motherboards like our ROG Strix Z690 GAMING-E WiFi? Well, as effective as the A115 was at Intel spec wattage, the insane “limit” of 4095W caused instant throttling even with the fans at 100%. And the fans are not quiet at that speed, either. In testing noise levels I made use of my trusty Nady DSM-1X sound pressure meter, which has a rated accuracy of +/- 1.4 dBA, positioned exactly 18 inches from the cooler on the open testbed. This is not a realistic scenario, of course, unless you run an open system on the desk next to your monitor like I was. At idle, noise levels were undetectable by the meter, which can only measure as low as 30 dBA. I was treated to the “BELOW 30dB” warning on the screen at low fan speeds. With a thermal load in the 125W – 170W range, fan speeds were controlled and the SPL meter registered just 32.8 dBA during the Cinebench stress test. Pushing things into the 230W – 253W range did finally force the fan profile to hit up to 100% speeds, and the highest reading from the meter was 41.8 dBA. Ideally, other large air coolers would be included in our testing, but as I literally just spun up (pun intended) a cooler testbed after an extended period away from thermal testing, that was not to be in this particular evaluation. In our testing of Corsair’s A115 air cooler, thermals were controlled when CPU power draw was controlled, but noise levels at the highest wattages can be quite noticeable. Without manual intervention to limit the PL1/PL2 to a maximum of 253W, the cooler was not ideally suited not to the Intel Core i9-14900K used for testing, but nothing short of a custom loop (or delidding) really is. On the other hand, a cooler like this would be ideally suited for AMD’s processors this generation. With their controlled wattage, the X3D parts in particular should allow for near-silent operation, even under load (the Ryzen 7 7800X3D is just 120W). The cooler is large enough that care should be taken in ensuring proper clearance around the CPU socket, as modern motherboards (particularly for Intel’s power-hungry CPUs) can have some pretty massive VRM heatsinks to contend with. I encountered clearance problems with the ROG Strix model used for testing, but things are very tight around the socket with that motherboard. RAM clearance, on the contrary, was never in question thanks to the easy fan height adjustment. As a contact frame was used to install the tested Core i9-14900K, it turns out that we didn’t take full advantage of the A115’s convex base, which is designed to help alleviate contact issues with Intel processors that buckle under the pressure of standard mounting. Hopefully the thermal paste application helped to smooth out whatever difference there may have been in mating the cooler to our test CPU. If this product should not be used with contact frames, then thermals would be even more impressive than what we saw above. Overall I was impressed by Corsair’s A115, which provides near-silent operation with reasonable thermal loads, and the product seems ideal for the controlled power consumption of current-gen AMD processors. It is also very easy to install, provided you do not encounter the VRM heatsink clearance issues that I did. This is what we consider the responsible disclosure of our review policies and procedures. The product was provided by Corsair for the purpose of this review. Corsair had no control over the content of the review and was not consulted prior to publication. Neither PC Perspective nor any of its staff were paid or compensated in any way by Corsair for this review. Corsair has not purchased advertising at PC Perspective during the past twelve months. If this article contains affiliate links to online retailers, PC Perspective may receive compensation for purchases through those links. Share: Editor-in-Chief at PC Perspective. Writer of computer stuff, vintage PC nerd, and full-time dad. Still in search of the perfect smartphone.\r\nIn his nonexistent spare time Sebastian's hobbies include hi-fi audio, guitars, and road bikes. Currently investigating time travel. January 7, 2020 December 2, 2020 February 10, 2006 February 12, 2020 These high end air coolers seem to sit in a weird no-mans land. Not effective enough for the high end CPUs, but expensive to pair with mid rage CPUs. Mid range just chuck on a Peerless Assassin for £30, high end deserves a Arctic Liquid Freezer III. Your email address will not be published. Required fields are marked * COMMENT Name * Email *    Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Copyright © PC Perspective 2000-2024 "
}