{
    "title": "Minisforum V3 with AMD's new Ryzen 7 8840U 'Hawk Point' APU launches by end \nof March",
    "date": "2/7/2024",
    "url": "https://www.tweaktown.com/news/96076/minisforum-v3-with-amds-new-ryzen-7-8840u-hawk-point-apu-launches-by-end-of-march/index.html",
    "text": "Minisforum has just formally launched its new V3 high-performance AMD AI 3-in-1 tablet, powered by AMD's latest Ryzen 7 8840U \"Hawk Point\" APU. The new Minisforum V3 3-in-1 \"Hawk Point\" AI tablet (source: Minisforum) Minisforum will be the first in the world with an AMD AI-powered 3-in-1 tablet, packing the latest Ryzen 7 8840U \"Hawk Point\" APU that sees 8 cores and 16 threads of Zen 4-based CPU power built on the 4nm process node and featuring a base clock of 3.30GHz and a max boost clock of 5.1GHz. The Minisforum V3 tablet is equipped with a 14-inch screen, offering a 2.5K resolution and a high refresh rate of 165Hz, complemented by 32GB of RAM and a substantial 2TB of storage. It's powered by the \"Ryzen 7 flagship chip,\" specifically the Ryzen 7 8840U, which brings 8 cores and 16 threads of Zen 4 processing capability, along with 16MB of L3 cache, 8MB of L2 cache, and clock speeds ranging from a 3.3GHz base to a 5.1GHz boost. This tablet incorporates the latest Ryzen 8040 \"Hawk Point\" APU, featuring an advanced XDNA \"Ryzen AI\" NPU, highlighting the device's focus on AI capabilities as we move forward. Additionally, it includes an integrated Radeon 780M GPU with 12 Compute Units operating at 2700MHz. The NPU delivers 16 TOPs of AI performance, and the device has a configurable TDP of 28W, adjustable between 15W and 30W to suit various needs. This new Minisforum V3, with its new AMD Ryzen AI, creates an AI Windows 3-in-1 tablet PC with the highest security level from Microsoft, supporting Microsoft Real-time Communication and hardware design supporting Microsoft Copilot, which can be called upon with a single click, providing real-time intelligent suggestions and assistance, helping users easily complete tasks in various scenarios for efficient office work. The new Minisforum V3 3-in-1 \"Hawk Point\" AI tablet (source: Minisforum) The new Minisforum M3 boasts 32GB of LPDDR5-6500 RAM and offers up to 2TB of NVMe M.2 PCIe SSD for storage. Connectivity options include two USB 4 ports, a USB Type-C VLink (DisplayPort-In) port, an SD card slot, alongside Wi-Fi 6E and Bluetooth 5.3 capabilities. The new Minisforum V3 3-in-1 \"Hawk Point\" AI tablet (source: Minisforum) The Minisforum V3 tablet is powered by a 50.82Wh battery, which utilizes a 65W PD (Type-C) port for charging, it also features the exclusive intelligent Control Center VSPACE, which can intelligently adjust power consumption, freely switch between power-saving mode (15 W), balance mode (18-22 W), and performance mode (28 W), meeting the different usage scenarios of users. The tablet employs a cooling system featuring two fans and four copper heat pipes for thermal management to ensure optimal temperature control. Audio quality is enhanced by four internal speakers delivering a stereo sound experience. The tablet's weight stands at 946g. It comes with Windows 11 preloaded, incorporating the latest in security and AI enhancements. The new Minisforum V3 3-in-1 \"Hawk Point\" AI tablet (source: Minisforum) Minisforum is expected to host and launch its new V3 tablet during its Spring New Product Launch Event towards the end of March, where we'll get more information about V3 pricing and availability. Anthony Garreffa Anthony joined the TweakTown team in 2010 and has since reviewed 100s of graphics cards. Anthony is a long time PC enthusiast with a passion of hate for games built around consoles. FPS gaming since the pre-Quake days, where you were insulted if you used a mouse to aim, he has been addicted to gaming and hardware ever since. Working in IT retail for 10 years gave him great experience with custom-built PCs. His addiction to GPU tech is unwavering and has recently taken a keen interest in artificial intelligence (AI) hardware. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}