{
    "title": "Arch Linux CachyOS Benchmarks Of x86-64-v3 & x86-64-v4 Repositories",
    "date": "2/29/2024",
    "url": "https://www.phoronix.com/review/cachyos-x86-64-v3-v4",
    "text": "Show Your Support:  Have you heard of Phoronix Premium? It's what complements advertisements on this site for our premium ad-free service. For less than $4 USD per month, you can help support our site while the funds generated allow us to keep doing Linux hardware reviews, performance benchmarking, maintain our community forums, and much more. The Arch Linux based CachyOS Linux distribution aims to be a \"blazingly fast and customizable Linux distribution\" that is aggressive with its performance optimizations. CachyOS takes to leveraging compiler optimizations like Link-Time Optimizations (LTO), the BORE scheduler, and also offering package archives compiled for x86-64-v3 and x86-64-v4 in allowing the distribution's packages to be catered toward newer Intel and AMD processors. In this article is a comparison of CachyOS packages from their main archive, the x86-64-v3 optimized packages, and then the x86-64-v4 wares that can be beneficial for modern Intel Xeon and AMD EPYC / AMD Ryzen systems.  The x86-64-v3 micro-architecture feature level as a reminder is for Intel Haswell or AMD Excavator and newer processors. The x86-64-v3 level mandates AVX/AVX2 support, BMI1/BMI2, FMA, MOVBE, and various other newer instructions. Being able to assume Advanced Vector Extensions (AVX) support in particular can be a big win for the performance in sensitive applications.  It's x86-64-v4 that is currently the highest micro-architecture feature level and basically adds in AVX-512 requirements atop x86-64-v3. So with x86-64-v4 it's only compatible with Intel Skylake and newer server processors, Intel Core Rocket Lake CPUs with AVX-512 or Ice Lake / Tigerlake, and then all AMD Zen 4 processors.  Most Linux distributions are eyeing x86-64-v3 as a baseline for their future Linux distribution releases or at least going for x86-64-v2 and then augmenting their package selection with a x86-64-v3 package archive for those running on AVX-supported hardware. In the case of CachyOS they already offer x86-64-v3 and x86-64-v4repositories. Via /etc/pacman.conf you can configure your system for using a particular repository and there are also various CachyOS helper scripts available too. For those curious about the performance impact, I recently ran some benchmarks on CachyOS using the HP Z6 G5 A workstation with AMD Ryzen Threadripper 7995WX processor. Being Zen 4, AVX-512 is supported and in turn works for testing both x86-64-v3 and x86-64-v4 repositories. Phoronix Premium allows ad-free access to the site, multi-page articles on a single page, and other features while supporting this site's continued operations. The mission at Phoronix since 2004 has centered around enriching the Linux hardware experience. In addition to supporting our site through advertisements, you can help by subscribing to Phoronix Premium. You can also contribute to Phoronix through a PayPal tip or tip via Stripe.  Legal Disclaimer, Privacy Policy, Cookies | Privacy Manager | Contact Copyright © 2004 - 2024 by Phoronix Media. All trademarks used are properties of their respective owners. All rights reserved. "
}