{
    "title": "AMD Could Soon Have Its 'Nvidia Moment' (Rating Upgrade) (NASDAQ:AMD)",
    "date": "2/28/2024",
    "url": "https://seekingalpha.com/article/4674334-amd-could-soon-have-its-nvidia-moment-rating-upgrade",
    "text": "Vertigo3d  Vertigo3d Advanced Micro Devices, Inc. (NASDAQ:AMD) has seen a sharp share price upward revaluation over the last year as Data Center growth trends played out that I unfortunately underestimated in 2023. AMD is seeing considerable top line revenue momentum in its Data Center segment and reported two consecutive quarters of revenue growth acceleration in Q3 '23 and Q4 '24. With major artificial intelligence (\"AI\") themes playing out in the market right now and with AMD's revenue share in Data Center growing rapidly, I have decided to upgrade shares of AMD to hold. Nvidia Corporation's (NVDA) earnings release and blowout guidance for FQ1 '25 was a major catalyst for my rating change here as well! Data by YCharts I rated AMD shares a sell in May 2023 due to what I believed was a stretched valuation and excessive enthusiasm about AMD’s strength in the server processor market (a.k.a. as its Data Center operations) at the time (shares are up 41% since). However, given Nvidia's recent blowout earnings report, which I discussed in my work recent \"Nvidia: Lessons Learned From My Worst Call Ever,\" I believe AMD is set to see its third quarter of revenue acceleration in Q1 '24. While the earnings date is still some time away, AMD is likely seeing the same tipping point in AI adoption as Nvidia. While I have previously been more focused on AMD’s potential in the GPU market -- in part due to a massive GPU shortage that in FY 2022 supported pricing gains for graphics processing units used by gamers, cryptocurrency miners, professionals and content creators -- the big game is now clearly being played in the artificial intelligence market. Based on projections made by Precedence Research, a data analytics and research firm, the market for artificial intelligence products is set to see, driven by the mainstreaming of AI applications, strong secular growth tailwinds that are expected to last into the next decade. The size of the artificial intelligence market is expected to hit $2.6T in FY 2032, which implies a 5.7X factor increase relative to the FY 2022 base year. The implicit growth projection calculates to a compound annual growth rate of approximately 20%. Precedence Research Precedence Research Since AMD is investing aggressively into its AI capabilities and is launching its own dedicated chips that are specifically suited for artificial intelligence applications, I believe I previously underestimated AMD’s AI potential. The investments, from a product perspective, chiefly relate to AI-dedicated GPUs that have the potential to train AI models used by large companies. Last December, AMD announced the launch of the AMD Instinct MI300X GPU which has been developed specifically to support large-language model training. Companies like Meta Platforms, Microsoft and Oracle have announced that they will use MI300X GPUs for their cloud services. Over the last five years both AMD and Nvidia have ramped up their capital expenditures significantly. Since AMD and Nvidia made it a priority to improve the line-ups of their high-performance AI chips, I expect this trend to continue in FY 2024. Data by YCharts AMD grew its Data Center revenues 38% year-over-year in Q4 2023 (the quarter ending December) while Nvidia’s core segment revenues increased 409% from the year-earlier period (Nvidia's quarter ended January 28, 2024). This growth differential matters greatly because Nvidia’s Data Center operations are much bigger than AMD’s, as measured by their corresponding revenue shares. AMD AMD Nvidia's significantly stronger top line growth is a key advantage the firm has over AMD, and it relates to Nvidia having a revenue mix that is optimized for the AI/Data Center revolution. Nvidia’s Data Center-related revenues are 3.6X larger than AMD's and the revenue share is 2.2X larger: Nvidia's total consolidated revenues consisted to 83% of Data Center-related revenues while AMD's Data Center business (as reported) represented a relatively small 37% top line share. This means that for every dollar in revenue generated AMD's Data Center segment contributes 37 cents compared to a revenue contribution of 83 cents for Nvidia. Since the new growth frontier for these chip maker seems to be in artificial intelligence, I believe that Nvidia is set to benefit more profoundly from AI-driven growth in the market. However, AMD is catching up. AMD announced the launch of its own dedicated AI graphics processing unit, the Instinct MI300X data center chip, in December which supports the training of AI models. This AI GPU product roll-out could gain serious momentum for AMD in FY 2024 as demand for these products is growing rapidly. While Nvidia has seen two consecutive quarters of revenue deceleration, AMD's top line has seen accelerating growth in the last two quarters. In fact, AMD's Q4'23 Data Center revenue growth rate Q/Q surpassed Nvidia's segment growth by 16 PP. AMD's Data Center revenue share also increased from 25% in Q2'23 to 37% in Q4'23, so AMD is seeing a trend of growing AI-related revenue importance while the new product launches could add to the developing momentum in Q1'24. (Source: Author.) Nvidia already got a head start in the AI market by launching the H100 chip in 2022. This chip has been specifically designed for supporting artificial intelligence applications in the Data Center market. AMD has been lagging behind Nvidia in the AI GPU market, but the company in December announced the introduction of the Instinct MI300X accelerator and the Instinct M1300A accelerated processing unit. Intel (INTC) announced the Gaudi3 chip for generative AI software in December, to be launched in FY 2024. While AMD and Intel are getting ready to launch their first AI GPUs, Nvidia is already moving towards the next-gen H200 which is expected to be available in Q2'24. Given Nvidia's early launch of the H100, the company owns the majority of the Data Center GPU market. IoT Analytics IoT Analytics Nvidia's outlook for FQ1 '25 has strong implications for AMD -- Nvidia called for $24B in revenues, implying a Y/Y growth rate of 334% -- which is that AI product and chip adoption is accelerating in the market as artificial intelligence applications are mainstreamed. With companies investing serious money into building their own AI-supported large language models ((LLMs)), AMD is set for stronger revenue tailwinds that I initially expected. Given these trends I expect for AMD a continual expansion of the Data-Center revenue share in FY 2024. Given that AMD's Data Center-related revenue share is relatively small at 37% (relative to Nvidia), AMD may be able to grow its segment revenue share much faster than Nvidia this year as well. AMD is making moves to catch up to Nvidia as well which could lead to further sentiment improvements and EPS estimate upside revisions. The company recently announced the launch of the Instinct MI300X accelerator and the Instinct M1300A accelerated processing unit which are used to train LLMs. The MI300X chip is set to compete against Nvidia’s H100 chip, the firm's high-end AI GPU. As these products roll out and AMD sees accelerating shipments, the company's Data Center growth could surprise to the upside in FY 2024. Nvidia not only has a growth and Data Center concentration advantage relative to AMD, but Nvidia's shares are also cheaper. Nvidia is trading at a P/E ratio of 27X compared to AMD's 32X P/E ratio. Estimates for Nvidia have also rapidly reset to the upside in the last couple of months which reflects the market's confidence that Nvidia's growth can be sustained. Interestingly, both AMD and Nvidia have traded at about 30X P/E in the last three years, on average. With shares of AMD -- despite slower projected revenue growth -- being more expensive than Nvidia (and trading above the 3-year average P/E ratio), I believe AMD is currently slightly overvalued at a price of $176. Based off of a \"fair value\" P/E ratio range of 30-31X (the 3-year average), shares of AMD could have a fair value of $164-169. Data by YCharts AMD had FY 2023 free cash flow of $1.12B and a FCF margin of 5%. Given that AMD is seeing the rollout of its AI GPU this year, I expect strong upside in the FCF margin. Calculating with a FCF margin of 5% (to remain conservative) and a consensus FY 2024 top line estimate of $25.8B results in a P/FCF ratio of 220X. A 10% FCF margin (which would still be below the FY 2023 FCF margin level of 13%) implies a forward P/FCF ratio of 110X. AMD, since it is not yet benefiting from the sale of expensive, high-performance AI chips, is much more expensive than Nvidia. AMD's main rival had $26.9B in free cash flow in FY 2024 which calculates to a 44% free cash flow margin. Assuming a stable FCF margin for the current fiscal year and using a $109.7B revenue consensus estimate, Nvidia is valued at 40X projected FCF. Nvidia currently has the higher free cash flow value, but AMD should see a significant expansion in its FCF margin as it scales its AI GPU and could therefore also soon have its own \"Nvidia moment\" of explosive free cash flow growth. Data by YCharts AMD is set to benefit from these powerful AI trends and the company has seen two consecutive quarters of revenue acceleration already. Nvidia's earnings report and outlook for FQ1'25 strongly implies that this revenue momentum, for both AMD and Nvidia, is here to stay. What would change my mind about AMD is if the company failed to translate top line growth, especially in its core Data Center business, into real earnings growth. A falling share of Data Center revenues would also be a concern to me. Nvidia’s recent blowout earnings release and strong outlook for AI-specific Data Center growth implies that Advanced Micro Devices, Inc. is seeing the same tailwinds in its Data Center business. Nvidia got a head-start in the business by making an early and aggressive bet on the AI market, and its Nvidia AI platform for enterprise customers is seeing accelerating corporate adoption. AMD, however, makes good moves here as well and recently caught up to Nvidia in terms of Data Center revenue growth. This implies that AMD could soon face its own Nvidia moment: the launch of an AI GPU that catalyzes an immense free cash flow upswing. Following Nvidia's blowout report and improving outlook for AI-related Data Center growth, I am therefore also upgrading my stock rating on AMD to hold! This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}