{
    "title": "Skull and Bones PC performance and best settings",
    "date": "2/16/2024",
    "url": "https://www.rockpapershotgun.com/skull-and-bones-pc-performance-is-mostly-smooth-sailing-but-do-stow-it-on-an-ssd",
    "text": "C: shanty Because it’s somehow my job to worry about the technical fidelity of electronic toys, I’ve been eyeing the long-overdue arrival of Skull and Bones with some nervousness. After nearly a decade of delays, you’d probably just want to get it out the door, right? Skip straight to the open-world pirate adventuring, none of that 'making it work on a range of graphics cards' nonsense. But nope. For all its other shortcomings, Skull and Bones performs alright on PC, very often more smoothly than its system requirements suggest. Though I’d still recommend abiding by its SSD storage requirement – following the rules might not be very piratey, but installing on a hard drive will curse you to some pretty tedious load screen waits. Geoffrey Rush would hate it, honestly. While Edwin sequesters himself in the starting area, let’s head below deck for a closer look at Skull and Bones’ PC particulars. That includes a full rundown of its graphics options – which include ray tracing and DLSS – and a quick guide to the best settings for an ideal prettiness-to-performance ratio. Ubisoft’s official specs don’t scream \"quadruple-A\" nearly as much as their executives do. These PC requirements are thoroughly middling, asking for some semblance of gaming power but not to the extent of other recent open-worlders, such as stablemate Avatar: Frontiers of Pandora. Granted, Skull and Bones is nowhere near as visually sumptuous as Avatar, but it’s no bad looker either. Strictly speaking, an SSD is not so much required as it is strongly suggested, as there’s nothing stopping you from installing and running Skull and Bones off a mechanical HDD. This isn’t Starfield, where a lack of solid state speediness renders the entire thing unplayable – there are no megastutters or dysynced audio issues, as far as I can see. However, even if Skull and Bones isn’t outright broken on hard drives, it can get a whole lot more boring. Besides the significantly stretched-out launch times, most kinds of loading transitions – even the ones that kick in when you speak to a merchant or questgiver – had me staring at black screen for several seconds, when those same transitions were near enough instantaneous on an SSD. This gets truly tiresome when you’re trying to do business around a bustling port, as you’ll be tripping over several these load screens in quick (figuratively speaking) succession. If you have or can make room on an SSD, seriously, drop anchor there instead. Otherwise, Skull and Bones runs... fine? There’s a bit of a framerate drop in those hub ports, compared to out on the seas, but since most of your time will be spent on the latter that’s no terrible thing. Using the built-in benchmark tool and the Low preset, I also clocked the entry-level 6GB GTX 1060’s 1080p performance at 76fps – leagues ahead of the 30fps suggested by the minimum specs. Low, like all the presets, does give itself something of an artificial advantage by including temporal upscaling by default. In this case it employs the mildly blurry Performance mode, while Medium and High both use Balanced, and Very High and Ultra High share the Quality setting. I’ve complained before about games leaning too heavily on upscalers to keep framerates up, though it’s more forgivable here as the TAA Quality setting genuinely looks like native 1080p – and when I manually switched the Low preset’s Performance mode to Quality, the humble GTX 1060 still produced a smooth 60fps. Newer, faster GPUs will scale pretty well too. The RTX 3070 averaged 82fps at 1080p with the Ultra High preset, only dropping to 70fps at 1440p, and replacing TAA upscaling with DLSS on Quality mode pushed that up to 78fps. The RTX 4060, Nvidia’s cheapest current-gen card, could also handle Ultra High with 70fps at 1080p and 60fps at 1440p. Keeping the more demanding resolution, it could reach up to 125fps on Low, though that involves making Skull and Bones look worse than it really needs to. I suspect most modern PCs will get by with at least a mix of Medium and High settings. There are only two further disappointments. The first is that while DLSS is as useful as ever, and the AnvilNext engine’s TAA upscaler is surprisingly excellent, AMD FSR 2 has a relatively weak showing. It’s faster than TAA, as we’ll see in the settings guide tests below, but also looks noticeably grainer, with duller detailing. The second is that Skull and Bones doesn’t want to play ball with the Steam Deck. Installing the Ubisoft Connect launcher is easy enough, thanks to Lutris, but the game itself invariably crashes withing seconds of starting up. A shame, considering it was just recently that Ubisoft's own Assassin’s Creed Mirage played perfectly well on the SteamOS handheld. Let’s go with, oh I don’t know, say the RTX 4060 as our settings performance guinea pig for this one. Using that 60fps at 1440p result, via the Ultra High preset, we can lower individual quality settings to see which are worth toning down and which you can afford to keep up. I’ll say right now that ideally, we want to keep upscaling quality as high as possible – it’s not so bad at 1440p but you’ll easily see the difference between Quality and Performance at 1080p, and it ain’t pretty. Instead, then, let’s mine the rest of Skull and Bones’ graphics settings for potential FPS gains. Adaptive quality: Leave this off. Besides the jarringly sudden dips in visual quality that occur whenever you fall below the target framerate, I actually averaged slightly less than the Ultra High preset’s 60fps while the adaptive target was 60fps, ending up with 58fps instead. Ignore. Shadows: There’s a teeny framerate increase up for grabs here, the RTX 4060 averaging 62fps on Medium shadows and 63fps on Low. The quality drop is noticeable, mind, so I’d suggest making other, more fruitful changes before resorting to these. Upscaling type/mode: As per usual, Nvidia DLSS is the best of the bunch here, with its Quality mode blasting average performance up to 77fps. Quality-mode FSR 2 is also faster than the default TAA, producing 70fps, but it’s not nearly as sharp in the details. If your GPU lacks DLSS support, TAA Balanced may be a better option than FSR – this scored 70fps as well. You can set the mode to Native, if you don’t want any upscaling at all, but DLSS and TAA can adequately recreate native resolution, so you might as well use one of them. Even if native TAA is only slightly slower than Quality, averaging 56fps. Environment details: Here’s one you can drop. Switching from Ultra High to Medium got my RTX 4060 up to 66fps, a 10% bump all by itself, and without knackering the visuals. There’s a Low option as well, though it’s no faster than Medium. Clutter: This doesn’t seem to affect performance one way or the other, both Medium and Low averaging 60fps. Stick to High. Water: Considering it's such an ocean-going game, cutting water quality in Skull and Bones can be a shrewd move. Both Low and Medium improved performance from 60fps to 67fps, so obviously, go with Medium. Screen space reflections: This is one of those rare occasions where you might want to leave extra frames on the table. While disabling SSR got my RTX 4060 up to 67fps, it – unlike Medium water quality – amounts to a major drop in visual quality, filling the screen with a weirdly blank, flat-looking sea. Keep reflections on if you can afford it. Volumetric clouds: These, on the other hand, can be turned down freely. I only got an extra 3fps dropping from High to Medium, but the quality difference is even smaller. Ambient occlusion: Switching this off didn’t affect performance at all, still averaging 60fps. Leave this on. Depth of field: Likewise, still 60fps from turning this off, so by all means keep it enabled. Motion blur: Just the tiniest 1fps increase came from disabling motion blur. Still, it doesn’t serve much of a purpose, so you may as well ditch it. Ray-traced global illumination: The one and only ray tracing effect in Skull and Bones, and an unnecessary indulgence. The quality difference between this and ‘standard’ lighting is negligible, and disabling it pushed the RTX 4060 up to 68fps. Even with a relatively short list of PC graphics options, there are still a few tweaks that can seriously put the wind into your framerates. Here’s what I’d consider the best settings for Skull and Bones: This mishmash still looks nice – definitely more like the High/Very High than Medium – but lets Skull and Bones run far quicker than if you used the former presets as they come. The RTX 4060, for instance, averaged 109fps with them (including DLSS), almost doubling Ultra High performance and dramatically smoothing out visits to those hardware-intensive hub towns. Older rigs will benefit, too. Using these settings, the GTX 1060 could average a slick 57fps at 1080p, which is about as fast as the Low preset with TAA on Quality. Only, y’know, far better looking. Rock Paper Shotgun is the home of PC gaming Sign in and join us on our journey to discover strange and compelling PC games. Skull and Bones PS5, \n            Xbox Series X/S, \n            PC James Archer Hardware Editor James had previously hung around beneath the RPS treehouse as a freelancer, before being told to drop the pine cones and climb up to become hardware editor. He has over a decade’s experience in testing/writing about tech and games, something you can probably tell from his hairline. Please enable JavaScript to see comments. Supporters only: \n\n\nTo survive Skull And Bones, pair it with Catfish Review: \n\n\nSkull And Bones review: an exceptionally boring live service shipping sim The Electronic Wireless Show podcast S3 episode 6: Skull & Bones is finally about to come out I'm not sure I'll ever leave the prologue area in Skull And Bones Skull And Bones will set sail on February 16th, 2024 - or so they say this time Ubisoft delay Skull and Bones yet again, together with a mystery \"large game\" Ubisoft might be remaking their swashbuckling pirateventure Assassin's Creed IV: Black Flag Skull and Bones still doesn't have a release date, but it will have a closed beta in August The Sunday Papers Supporters only: \n\n\nI hate that I sorta hate twin-stick shooter Windowkill Reality Bytes: Underdogs is the undisputed champion of the VR arena fighter Supporters only: \n\n\nFinal Fantasy 7 Rebirth’s minigames are each a new sensory organ for its many novelties Dragon’s Dogma 2 proves that fetch quests are good as long as the space in between is interesting What are we all playing this Easter weekend? The Rally Point: Command & Conquer Generals would be the best game in the series if it didn't have boring racist stereotypes I'm enjoying the unique challenge of playing Darktide with rubbish weapons and no talents Rock Paper Shotgun is owned by Gamer Network Limited, a ReedPop company and subsidiary of Reed Exhibitions Limited. © 2024 Gamer Network Limited, Gateway House, 28 The Quadrant, Richmond, Surrey, TW9 1DN, United Kingdom, registered under company number 03882481. All rights reserved. No part of this website or its content may be reproduced without the copyright owner's permission. "
}