{
    "title": "AMD Update Should Fix Ryzen 8000G Series Issue",
    "date": "2/10/2024",
    "url": "https://gamerant.com/amd-ryzen-8000g-throttling-update-bios-fix/",
    "text": "Tech giant AMD releases a crucial update that solves a notable performance issue that users of the Ryzen 8000G CPUs have been experiencing. Following the release of the Ryzen 8000G series of processors, both AMD and various motherboard manufacturers released a BIOS update to consumers that should fix a performance issue specific to those APUs. AMD users with an APU such as Ryzen 5 8600G or Ryzen 7 8700G should update their motherboard BIOS to ensure better performance. The AMD Ryzen 5 8600G and Ryzen 7 8700G are the latest in a line of AMD processors that combine the functions of a CPU and a graphics card into a single chip. AMD has dubbed these processors as accelerated processing units (APU). The Ryzen 8000G series in particular has integrated Radeon 700M graphics as part of its kit. With a starting price of $229, these budget-friendly AMD processors were designed for both laptop users and desktop builders who want to play games without immediately needing a dedicated GPU to do so. However, one feature intended to help with temperature management, called Skin Temperature-Aware Power Management (STAPM), has provided the opposite effect and caused unintentional performance issues for desktop users. Thankfully, AMD found a fix for this throttling problem. Working with motherboard manufacturers, AMD released a BIOS update that fixes performance issues caused by unintended STAPM behaviors on desktop PCs. Users who want to download and install this BIOS update should refer to their motherboard manufacturer's website for details, and follow the instructions on how to update the BIOS for their specific device. If the update requires BIOS Flashback to work, users will have to supply a viable USB flash drive as well. At the time of writing, the update is available to users with a compatible AMD motherboard from brands such as Asus, Asrock, Gigabyte, and MSI. However, users who do not have a Ryzen 8000G processor are not affected by this particular issue. While the integrated Radeon 700M graphics of the Ryzen 8000G APUs do not compare to a dedicated AMD Radeon RX GPU outright, recent driver updates have made them a viable alternative for PC gamers looking to play titles such as Fortnite and Palworld. Recent updates have allowed the Radeon 700M to use features from the RX 7000 series such as AMD Fluid Motion Frames, and the integrated graphics have drawn comparisons to Nvidia's GTX 1650 and 1650 Ti GPUs. Between the Ryzen 8000G APUs and the upcoming Kraken Point lineup, AMD is banking heavily on these processors in 2024. Only time will tell how effective the BIOS update for the Ryzen 8000G series will be. The AMD Ryzen 5 8600G 6-Core, 12-Thread CPU is a powerful entry-level gaming APU that combines AMD's efficient and performant mobile Zen 4 cores with a capable iGPU in the shape of the AMD Radeon 760M.It packs in acceptable gaming performance at a price point that decimates most of its comparable discrete GPU and CPU combinations even as it is one of the first CPUs or APUs that pack AMD's Ryzen AI tech to support on-chip AI acceleration. The AMD Ryzen 7 8700G 8-Core, 16-Thread CPU is a powerful APU that delivers modest gaming performance for PCs that do not currently utilize a discrete GPU by using the fastest iGPU solution currently available to end users.It comes bundled with a stock cooler, an octa-core CPU config, and a rated TDP of 65W, making it a great well-priced alternative to many budget CPU and GPU combos on the market currently.The AMD Ryzen 7 8700G also happens to be one of AMD's first desktop CPUs that offers the AMD Ryzen AI engine built into the chip. We hope you like the items we recommend and discuss! Game Rant has affiliate and sponsored partnerships, so we receive a share of the revenue from some of your purchases. This won’t affect the price you pay and helps us offer the best product recommendations.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. James Ratcliff joined Game Rant in 2022 as a Gaming News Writer. In 2023, James was offered a chance to become an occasional feature writer. James hails from Texas and has been writing professionally for over a decade. Years after it didn't take off as a revolutionary gaming peripheral, a gamer spots an Xbox Kinect serving a different and useful purpose. Skyrim is filled with fantastic weapons and spells to use, but there are some spells which are effectively useless for one reason or another. Chrono Trigger director Yoshinori Kitase asks fans what would be the best way to remake the classic JRPG for modern gaming audiences. Some new gameplay details about Assassin's Creed Red leak online, suggesting the game will overhaul many of the series' core systems. The trailer for the upcoming Pokemon Legends Z-A offered plenty of clues, but many casual viewers may have missed them. Test Drive Unlimited: Solar Crown looks very impressive, but it comes with a major setback that may turn away some prospective players. "
}