{
    "title": "AMD just made the awesome 5800X3D almost redundant with new $249 5700X3D",
    "date": "2/2/2024",
    "url": "https://www.neowin.net/news/amd-just-made-the-awesome-5800x3d-almost-redundant-with-new-249-5700x3d/",
    "text": "3 hours ago 3 hours ago 6 hours ago 6 hours ago 3 hours ago 13 hours ago 13 hours ago 19 hours ago Mar 28, 2024 Mar 27, 2024 Mar 26, 2024 Mar 26, 2024 Mar 28, 2024 Mar 28, 2024 Mar 26, 2024 Mar 26, 2024 6 hours ago Mar 30, 2024 Mar 30, 2024 Mar 30, 2024 Mar 25, 2024 Mar 23, 2024 Mar 20, 2024 Mar 17, 2024 Dec 31, 2023 Oct 14, 2023 Apr 11, 2023 Mar 27, 2024 Mar 25, 2024 Mar 10, 2024 Mar 3, 2024 Mar 24, 2024 Mar 21, 2024 Sep 23, 2023 Sep 21, 2023 19 hours ago Mar 29, 2024 Mar 28, 2024 Jun 14, 2003 Feb 23, 2024 Jan 20, 2024 Dec 6, 2023 Jun 6, 2023 Sayan Sen\n\nNeowin\n                ·\n    \n\n    Feb 2, 2024 05:04 EST\n    \n\nwith 7 comments Back when AMD released the Ryzen 7 5800X3D, its first ever processor with 3D V-cache, the company impressed almost everyone with how capable a gaming chip this CPU was. And it was mostly due to the 3D stacked vertical L3 or Last level cache (LLC) that AMD managed to add on its 8-cored Zen 3 part. All this extra cache meant that successful cache hits were greatly improved while cache misses were significantly reduced. Hence, the reliance on fast, low-latency system memory was consequently not as necessary. While from the performance point of view, the improvement, which was typically found to be around 15% compared to non-X3D part, was great, it also came at a premium. The 5800X3D launched at $499, though over time, it has come down in price and has even hit sub-$300 price points. Currently, Newegg is running a promotion on it such that users can get a free 16GB memory kit alongside a 5800X3D for $315. The deal was even better previously where you could get a B450 motherboard worth around $90. In case you don't have so much to shell out but still want the taste of X3D gaming, AMD has now announced the Ryzen 7 5700X3D, a slightly lower-clocked variant of the popular 5800X3D, and the pricing is very attractive too as the processor is now available on Amazon US and Newegg US for $249. AMD Ryzen 7 5700X3D 8-Core, 16-Thread Desktop Processor 105W: $249 (Amazon US) AMD Ryzen 7 5700X3D 8-Core, 16-Thread Desktop Processor 105W: $249 (Newegg US) While the new 5700X3D does make the 5800X3D kind of redundant (unless the latter is on a discount like the one we linked above), there is still one aspect where a user may be better off choosing the more expensive part. AMD's 5000 series X3D parts are not unlocked and hence users can not overclock them using simply the clock multiplier, and base clock (BCLK) overclocking is a bit too difficult for most folks anyway. Therefore it can be argued that for someone looking for the best X3D gaming CPU on socket AM4, the 5800X3D is probably going to be the better choice while the 5700X3D will provide almost as good a performance. As an Amazon Associate I earn from qualifying purchases. Sayan Sen\n                                                ·\n                    \nJun 30, 2023\n\nwith\n6\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nApr 12, 2022\n\nwith\n27\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nApr 7, 2022\n\nwith\n17\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nApr 5, 2022\n\nwith\n25\n                            comment\n                                s Login or Sign Up to read and post a comment. Please enter your reason for reporting this comment. blackview bl8000 horizon forbidden west windows 11 insider preview promo microsoft weekly twirl 158 windows 11 insider preview promo windows 11 moment 5 dragons dogma 2 task manager notepad © Since 2000 Neowin®\n                                    All trademarks mentioned are the property of their respective owners. "
}