{
    "title": "KDE Slimbook V Is the World’s First Linux Laptop to Ship with KDE Plasma 6",
    "date": "2/22/2024",
    "url": "https://9to5linux.com/kde-slimbook-v-is-the-worlds-first-linux-laptop-to-ship-with-kde-plasma-6",
    "text": "9to5Linux Linux news, reviews, tutorials, and more Home > News > Hardware > KDE Slimbook V Is the World’s First Linux Laptop to Ship with KDE Plasma 6 Linux hardware vendor Slimbook and the KDE Project announced today the KDE Slimbook V as the world’s first Linux-powered laptop to ship with the soon-to-be-released KDE Plasma 6 desktop environment. Powered by a top-of-the-line AMD 7840HS processor with 8 cores, 16 threads, 24MB cache, and up to 5.1GHz clock speed, as well as the powerful AMD 780M graphics with 12 cores and RDNA 3, the KDE SLimbook V laptop features a full aluminum chassis and a 16-inch IPS anti-glare display with 16:10 aspect ratio, 165 Hz refresh rate, and 2560x1600px (2K) resolution. The AMD-only laptop also features a 720p webcam with a physical switch to protect your privacy, a high cooling solution with dual fans to improve thermal capability, USB-C with DisplayPort and Power Delivery, Wi-Fi 6, Bluetooth 5.2, up to 64 GB 5600 MHz memory, up to 8 TB NVMe PCIE 4.0 SSD storage, as well as a 68‑watt‑hour battery. The KDE Slimbook V  comes with the KDE neon rolling release distribution featuring the awesome KDE Plasma 6 desktop environment on Wayland, which will be released on February 28th, 2024. The operating system gives you access to hundreds of applications for productivity and creativity, a complete office suite, and every tool you need to fully customize your Linux desktop experience. The KDE Slimbook V laptop is available for pre-order right now from Slimbook’s online store for a launch price of €999 (~$1084 USD) for the basic configuration featuring 16GB RAM and 250GB SSD storage. Slimbook expects the laptop to arrive in stock around April 2024. Image credits: Slimbook Last updated 1 month ago LibreOffice 24.2.2 Is Now Available for Download with More Than 70 Bug Fixes · \n\t\t\t\t\t\t\t8 hours ago Meet Marknote, KDE’s WYSIWYG Note-Taking Application for Linux · \n\t\t\t\t\t\t\t8 hours ago Red Hat Warns Fedora Linux 40/41 and Rawhide Users About Critical Security Flaw · \n\t\t\t\t\t\t\t9 hours ago Red Hat Warns Fedora Linux 40/41 and Rawhide Users About Critical Security Flaw · \n\t\t\t\t\t\t\t21 hours ago Red Hat Warns Fedora Linux 40/41 and Rawhide Users About Critical Security Flaw · \n\t\t\t\t\t\t\t21 hours ago "
}