{
    "title": "Diagnosed with macular degeneration? Here's what you need to know",
    "date": "2/6/2024",
    "url": "https://medicalxpress.com/news/2024-02-macular-degeneration.html",
    "text": "Click here to sign in with\n                  \n\n\n                  or Forget Password? Learn more share this! Share Twit Share Email February 6, 2024 This article has been reviewed according to Science X's \n                                                    editorial process\n                                                    and policies.\n                                                    Editors have highlighted\n                                                    the following attributes while ensuring the content's credibility: fact-checked reputable news agency proofread by Dennis Thompson Age-related macular degeneration can lead to vision loss in seniors, but new therapies have offered fresh hope for preserving eyesight later in life, eye experts say. These cutting-edge therapies benefit both the dry and wet types of age-related macular degeneration (AMD), says the American Society of Retina Specialists (ASRS). Eleven million people in the United States have AMD, with dry AMD affecting about 85% and wet AMD striking 15%. \"Patients often tell me they are sure they will lose their vision because they have a family member who experienced vision loss from AMD, but with early diagnosis and treatment, we now have much more than hope to offer patients with wet or dry AMD,\" ASRS Foundation President Dr. Judy Kim said in a news release. The macula is a round area at the center of the retina, which is the layer of light-sensitive cells at the back of the eyeball that capture images. People with AMD slowly begin to lose their central vision, according to the American Academy of Ophthalmology. They can't see fine details either up close or far away, but their peripheral vision remains normal. The AAO gives the example of looking at a clock with hands. People with AMD might see the clock's numbers, but not the hands. Most patients have early or intermediate dry AMD, which can remain stable for a lifetime or can slowly degrade a person's vision, experts say. Dry AMD occurs when parts of the macula get thinner with age, the AAO says. Early dry AMD might involve no symptoms at all, while people with intermediate dry AMD might have difficulty reading in dim light or transitioning from light to dark, the ASRS says. Intermediate patients also might notice a decrease in the intensity or brightness of colors, or find that straight lines are becoming wavy and distorted. The advanced stage of dry AMD is called Geographic Atrophy (GA). It causes marked distortion of straight lines, gradual loss of central vision, or dark and blurry areas in the center of vision, the ASRS says. No current treatment can prevent vision loss of patients with GA, but two drugs recently approved by the FDA can help slow its progression, the ASRS says. Both drugs are eye injections that patients receive every one to two months. There also are nutritional supplements that can help patients with intermediate dry AMD. These over-the-counter supplements include vitamin C, vitamin E, lutein, zeaxanthin, zinc and copper, the AAO says. Wet AMD occurs when abnormal and leaking blood vessels develop beneath the macula, the ASRS says. The condition can cause rapid and severe vision loss in one or both eyes. Treatment of wet AMD has been revolutionized by the discovery of vascular endothelial growth factor (VEGF), a signaling protein that stimulates the growth of new blood vessels, the ASRS says. Wet AMD can't be cured, but its progression can be halted with anti-VEGF eye injections that block the action of the signaling protein, the ASRS says. Newer versions of anti-VEGF drugs now are extending the time between treatments, meaning that patients need fewer office visits and receive fewer injections each year, the ASRS says. The ASRS recommends that people with vision loss contact a retina specialist. These eye doctors have completed up to a decade of advanced training specializing in the retina. The primary risk factor for macular degeneration is old age, and genetics also play a powerful role in the disease, the ASRS says. Other risk factors include: More information:\n                                                    The American Academy of Ophthalmology has more about age-related macular degeneration. Copyright © 2024 HealthDay. All rights reserved. Explore further Facebook Twitter Email Feedback to editors Mar 29, 2024 0 Mar 28, 2024 0 Mar 28, 2024 0 Mar 28, 2024 0 Mar 27, 2024 0 Mar 30, 2024 Mar 29, 2024 Mar 29, 2024 Mar 29, 2024 Mar 29, 2024 Mar 29, 2024 Mar 29, 2024 Mar 29, 2024 Mar 29, 2024 Mar 29, 2024 Feb 7, 2022 Nov 2, 2020 Nov 3, 2021 Feb 8, 2023 Feb 14, 2019 Aug 29, 2023 Mar 29, 2024 Mar 29, 2024 Mar 29, 2024 Mar 29, 2024 Mar 28, 2024 Mar 28, 2024 Use this form if you have come across a typo, inaccuracy or would like to send an edit request for the content on this page.\n\t\t\t\t\t\t\t\t\t\t\tFor general inquiries, please use our  contact form.\n\t\t\t\t\t\t\t\t\t\t\tFor general feedback, use the public comments section below (please adhere to guidelines). Please select the most appropriate category to facilitate processing of your request Thank you for taking time to provide your feedback to the editors. Your feedback is important to us. However, we do not guarantee individual replies due to the high volume of messages. Your email address is used only to let the recipient know who sent the email. Neither your address nor the recipient's address will be used for any other purpose.\n\t\t\t\t\t\t\t\t\t\t\tThe information you enter will appear in your e-mail message and is not retained by Medical Xpress in any form.  Get weekly and/or daily updates delivered to your inbox.\n\t\t\t\t\tYou can unsubscribe at any time and we'll never share your details to third parties. More information\nPrivacy policy We keep our content available to everyone.\n                    Consider supporting Science X's mission by getting a premium account. Daily science news on research developments and the latest scientific innovations The latest engineering, electronics and technology advances The most comprehensive sci-tech news coverage on the web "
}