{
    "title": "AMD drops the price of its Radeon RX 7700 XT—and puts the final nail in the \nRTX 4060 Ti's coffin",
    "date": "2/26/2024",
    "url": "https://www.techradar.com/computing/gpu/amd-drops-the-price-of-its-radeon-rx-7700-xtand-puts-the-final-nail-in-the-rtx-4060-tis-coffin",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Between the new price of the RX 7700 XT and the RX 7900 GRE, AMD is crushing the midrange The AMD Radeon RX 7700 XT just got a healthy price cut, and all but kills any reason to buy the Nvidia RTX 4060 Ti. The new price drop announced on Monday, bringing its US MSRP down by about 7% to $419, only applies to AMD's suggested price - and since AMD didn't release a reference card of its own, third-party sellers like ASRock, PowerColor, Gigabyte, and others are free to ignore it. However, they have every reason to bring their prices in line with the new MSRP and to do so quickly. The biggest issue in my RX 7700 XT review (which I will now have to revise) was the fact that its price was too close to the RX 7800 XT's, even though the RX 7700 XT is one of the best graphics cards on the market, especially for 1440p gaming. In my RX 7800 XT review, I found that it was just simply better, and with such a small relative price difference, it makes a lot more sense to stretch your budget a bit and get the RX 7800 XT. But now, the RX 7700 XT's MSRP is a full $80 less than the RX 7800 XT's in the US, likely because the RX 7800 XT would just be too tempting for midrange gamers to pass up at its original MSRP and so RX 7700 XT's were left sitting on the shelves. Even before AMD's announcement, some retailers have been finding ways to bring the RX 7700 XT's price down with sales and other promotions. With the card's official price set at $419, you should see this card drop below $400 fairly regularly. Not only will it help the sales of this card, which have likely been sluggish since its September 2023 release, but this price drop also obliterates any reason to buy the RTX 4060 Ti.  With the release of the RX 7600 XT last month, which has an MSRP of $329.99 in the US, the price cut to the RX 7700 XT, and the launch this week of the RX 7900 GRE for $549.99, AMD now has pretty much the entire midrange market to itself, at least if what you're looking for is performance and not the brand of card you're running. The two Nvidia RTX 4060 Ti graphics cards are the most mainstream of Nvidia midrange offerings, and while the RTX 4060 Ti 8GB variant is an OK card for what it offers, namely 1080p gaming that can dabble in 1440p thanks to DLSS 3, the RTX 4060 Ti 16GB variant simply doesn't offer any real performance advantage. That extra 8GB VRAM isn't worth the extra $100 you're spending on it. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. The problem is that with this price drop to $419—and with sales and discount codes and whatnot bringing that price down below $400—you can now spend at most $20 more for the RX 7700 XT over the RTX 4060 Ti and get, on average, 50% faster framerates at 1080p and 1440p without ray tracing turn on. With ray tracing turned on, you get about 20% faster framerates on average at 1080p and nearly 47% faster framerates at 1440p. With DLSS 3, the RTX 4060 Ti will get you about 83 fps on average versus the RX 7700 XT's 80 fps. As a final nail in the coffin for the RTX 4060 Ti, the 8GB variant simply does not have enough VRAM to go anywhere near 4K settings unless making extreme compromises on texture quality. For the RX 7700 XT, on the other hand, its 192-bit memory bus and 12GB VRAM have enough texture capacity and throughput to hit 51 fps on average at 4K with a minimum fps of 39. Set FSR to balanced and you're getting 72 fps on average with a minimum of 48. Add maximum ray tracing and you're still getting 39 fps on average with a minimum of 28, so turn the graphics down a notch and set ray tracing to medium and you can easily get back into the high 50s on average with a reasonably smooth minimum in the 30s. In short, the RX 7700 XT was always a fantastic card, but now its price makes it an absolute gem, and what should have been two of Nvidia's biggest sellers are effectively shut out. Add all this to the global release of the RX 7900 GRE on February 27, 2024, and now Nvidia's RTX 4070 and RTX 4070 Super not only have to contend with the RX 7800 XT, but also a slightly nerfed RX 7900 XT. And since the RX 7900 GRE has been available in China for several months, we know the kind of performance that the 7900 GRE has to offer, and it should make Nvidia very anxious about the success of the RTX 4070 Super, given that its performance is on par with the RTX 4070 Super while costing almost 10% less.  I don't believe for a second that Nvidia intended to underdeliver for gamers who weren't willing to drop over $600 for a new graphics card, but that is unfortunately what's happened, and AMD has taken downright ruthless advantage of it. With the global release of the RX 7900 GRE and the price cut to the RX 7700 XT, there are far fewer reasons to splurge on an RTX card over a Radeon card at these prices. Nvidia might have DLSS 3 all over the place, but AMD has made enormous strides in getting FSR to the point where it is genuinely competitive. And even if AMD has a ways to go before it achieves parity with Nvidia in ray tracing, AMD's second-generation ray accelerators are already pretty great, at least for 95% of gamers who would use ray tracing if given the option. But the fact that AMD also smartly targeted the midrange and budget segments with aggressively priced products that either held their ground against competing Nvidia cards or beat them is something that gamers aren't going to overlook forever out of brand loyalty to Nvidia. This is especially true when Nvidia continues to price its best midrange graphics cards out of reach for a lot of people, something that has caused a lot of grumbling among builders, gamers, and the like. While Nvidia may hold a pretty commanding market position right now, there's no guarantee that it will continue to do so, and with a hungry AMD waiting in the wings with cards as good as its recent releases, Nvidia's once insurmountable position looks like it's starting to shake just a little, but it only has itself to blame. John (He/Him) is the Components Editor here at TechRadar and he is also a programmer, gamer, activist, and Brooklyn College alum currently living in Brooklyn, NY.  Named by the CTA as a CES 2020 Media Trailblazer for his science and technology reporting, John specializes in all areas of computer science, including industry news, hardware reviews, PC gaming, as well as general science writing and the social impact of the tech industry.  You can find him online on Threads @johnloeffler.  Currently playing: Baldur's Gate 3 (just like everyone else). Intel Battlemage leak gives us hope that maybe there’ll be a more powerful 2nd-gen Arc GPU after all Samsung officially reveals GDDR7 memory for GPUs, which is great news for gamers Microsoft's repair-friendly Surface puts other laptop makers on notice – and it's about time By Sead FadilpašićMarch 29, 2024 By Al GriffinMarch 29, 2024 By Cesar CadenasMarch 29, 2024 By Alex WhitelockMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}