{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.tradingview.com/news/investorplace:0c44f9cdc094b:0-it-s-time-to-take-some-chips-off-the-table-with-amd-stock/",
    "text": "Advanced Micro Devices AMD shares have skyrocketed in price over the past twelve months. AMD stock has surged by 106.8% during this timeframe. Riding the AI wave has been profitable, but now may not be the right time to enter. Nor is it a good reason to “let it ride,” on the view that the runaway rally for the chip designer’s shares will carry on in the months ahead. Although there’s been just as much, if not more, substance, not hype driving the stock’s convincing performance, after moving too far, too soon, shares could start to top off and risk a price correction. AMD Stock: In Bubble Territory, Despite Substance to AI Bull Case With some AI stocks, investor hype is clearly well over substance. A good example is C3.ai AI. C3.ai has ginned out a lot of excitement about its potential to capitalize on the generative AI mega-trend, but has yet to really do so (based on its latest earnings results) Again though, with AMD stock, one can say that there is a substantive AI bull case to be made. With December’s unveiling of AMD’s Instinct MI300 series of accelerators, the company is cashing in on the AI chip boom. Based on management’s upwardly revised forecasts, AI chip sales could total $3.5 billion this year. Better yet, this forecast may be conservative. Per analysts at Citi, AI chip sales during 2024 could come in at $5 billion. In 2025, sales could hit $8 billion. Yet while this could have a dramatic impact on AMD’s top and bottom lines, the issue is that investors have arguably priced-in these aggressive forecasts. Perhaps, too aggressively. It’s the same situation with other AI stocks, including high-quality ones. Now “priced for perfection,” and possibly in bubble territory right now, it may not take much to spark a price correction. The Next Wave of Turbulence As I argued last month, the AI stocks bubble, just like the dotcom and EV stock bubbles before it, will come to an end. This is poised to happen, even as the underlying trend that caused the bubble in the first place (the rise of generative AI) continues. Many things could lead to the bubble screeching to a halt. For instance, further sign from the Federal Reserve that it will be cautious in its lowering of interest rates. This could throw the market (anticipating a more rapid move to lower) in for a loop. Even if the current bubble continues for another year or so, ahead of the final few waves of investor exuberance, could come a few waves of turbulence. Over the next few months, AMD stock could hold steady. Shares may even keep inching higher. Come May 1, however, shares could once again make a big move, and not in a good way. That’s when Advanced Micro Devices has its next quarterly earnings release. If AMD’s initial AI chip sales fall short of “perfection,” it may elicit a negative reaction, in contrast to the mixed reaction to last month’s earnings release. Bottom Line: Sell if You Own, ‘Watch and Wait’ if You’ve Yet to Buy Don’t get me wrong. In the coming years, the growth of the AI chip market, coupled with a comeback in demand for CPUs and GPUs for non-AI end user markets (like PCs and gaming), will likely result in steady earnings growth over the next few years. However, with the risk of Advanced Micro Devices shares, after their hot run in 2023 and in early 2024, delivering less-stellar (or even negative) returns in the near-term, a change in your approach is warranted. If you currently hold AMD in your portfolio, it’s time to take some chips off the table. If you’ve yet to add this top-performing AI chips play, resist the “FOMO,” and sit on the sidelines. Whether because of a deflating/bursting of the AI stocks bubble, or from this stock experiencing some post-earnings turbulence, a better AMD stock entry point may be just around the corner. On the date of publication, Thomas Niel did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Thomas Niel, contributor for InvestorPlace.com, has been writing single-stock analysis for web-based publications since 2016. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @dehandreh @yo44ge4real @stvmcg @Arcanebear.eth @retirewithforex @sethsickness @aliams_david_trading_gram @mytradingsetup @fx_bitcoin_expert11 @tradingfrance @mytradingsetup @jordan_fx_ @nav.fx @itzi71 @laptopmoneygang @heinrich_j96 @johndollery @aggressivecalculator Whatever the trade "
}