{
    "title": "Revamped AMD-powered gaming handheld will launch by the end of the month — \nGPD Win 4 upgraded to a Ryzen 7 ...",
    "date": "2/17/2024",
    "url": "https://www.tomshardware.com/video-games/handheld-gaming/revamped-amd-powered-gaming-handheld-will-launch-by-the-end-of-the-month-gpd-win-4-upgraded-to-a-ryzen-7-8840u-cpu",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. New GPD devices are set to launch toward \"the end of this month.\" According to a blog post from GPD, some revisions are headed our way later this month for two devices: the GPD Win 4 and the GPD G1. The GPD Win 4 will mainly receive a higher-specced Ryzen 7 8840U processor versus its current 7840U, but besides adding some AI hardware, the CPUs should perform nearly identically. The move to update the GPD Win 4 with the Ryzen 7 8840U also aligns with GPD's stated plans to do so back in December. The original blog post from GPD primarily focuses on the changes coming up for the GPD G1, which is GPD's lightweight external GPU. The new GPD G1 revision will support higher refresh rates over HDMI and 65 Watt charging through USB4, and it will include a physical power switch for toggling between a \"Silent\" 60 Watt TGP mode and a \"Balanced\" 100 Watt TGP mode. According to GPD, the five-watt bump to the USB4 / Thunderbolt 4 charging port on the GPD G1 was so that the device could appropriately charge specific devices with higher power demands, like certain Microsoft Surface and Lenovo laptop models. The Watt bump to the USB4/Thunderbolt 4 charging port on the GPD G1 allowed the device to charge specific devices with higher power demands appropriately, like certain Microsoft Surface and Lenovo laptop models. In any case, these changes should make the GPD G1 much better for gaming on the go, particularly with the addition of a Silent mode for slightly less demanding titles or battery power consumption. Meanwhile, the news of a GPD Win 4 revision bumping the Ryzen 7 7840U to a Ryzen 7 8840U is...mostly expected. Both CPUs use the same Radeon 780M iGPU that powers the ASUS ROG Ally, Ayaneo Flip DS, and other high-end PC handhelds that outstrip Steam Deck in raw power (and price). Barring the additional onboard AI hardware somehow being leveraged by FSR upscaling updates, the Ryzen 7 8840U is unlikely to impact gaming performance versus the 7840U. Compared to the more conventional gaming-focused PC handhelds from other vendors, the GPD Win 4 is unique because it also leverages a full pull-out keyboard alongside its gamepad controls. The GPD Win 4 also offers an optical finger-mouse on the right-hand side of the device, which is functionally similar to the Steam Deck trackpads but much more compact. These aspects make it appropriate for some on-the-go computing and could even be used for in-game communication or hotkeys for those who like putting extra buttons to work. There are some extra programmable back buttons, too. In other words, this month's Win 4 Ryzen 7 8840U revision should be a welcome change to the 6-inch GPD Win 4— just not a significant bump to the spec if you already have a 7840U Win 4. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. The Asus ROG Ally is back down to just $399 Steam Deck modder builds custom 'Nintendo 3DS console' by adding second screen OpenAI and Microsoft reportedly planning  $100 billion datacenter project for an AI supercomputer By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}