{
    "title": "China's CPU rival to Intel and AMD is rapidly catching up on a key metric — \nbut don't expect it to be competitive with ...",
    "date": "2/24/2024",
    "url": "https://www.techradar.com/pro/chinas-cpu-rival-to-intel-and-amd-is-rapidly-catching-up-on-a-key-metric-but-dont-expect-it-to-be-competitive-with-ryzens-and-cores-anytime-soon",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Loongson's 3A6000 is promising in some areas, but not others You might not be too familiar with Loongson, but it has been developing computer processors since 2000, and in China the company is widely viewed as the grandfather of domestic CPUs. The launch of Loongson 1 in 2002 was China's first independently developed general-purpose CPU, using the MIPS III instruction set. in 2020 Loongson transitioned from the MIPS instruction set to its independent instruction set, LoongArch (which is widely viewed as being a clone of MIPS). The first LoongArch-supported processor, the 3A5000, debuted in 2021, marking the beginning of the Loongson ecosystem's Dragon architecture era. The 3A6000, a follow-up product of the 3A5000, is the second-generation processor using the LoongArch instruction set. Fabricated on a 12nm process it has four cores and eight threads capable of boosting to 2.5GHz under a 50 watt TDP. It has an L2 cache of 256KB and an L3 cache of 16MB, and is compatible with DDR4-3200 RAM. In a recent video review by Geekerwan (Geek Bay), Loongson's 3A6000 demonstrated substantial progress in its Instructions Per Cycle (IPC), nearly on par with the latest architectures from Intel and AMD. While it still lags behind the latest x86 and Arm CPUs in raw performance, the high IPC suggests a promising future, provided Loongson can attain higher frequencies. In SPEC 2017's integer and floating point performance test with all CPUs locked to 2.5GHz, Loongson's chip impressed. It surpassed the Zen 3-based Ryzen 9 5950X and was just slightly behind the Zen 4-powered Ryzen 9 7950X and Raptor Lake Core i9-14900K. Tom’s Hardware has more on the test results. However, the 3A6000 can't truly harness its impressive IPC due to its low clock speed and its limitations in core count and cache size. The company's next-generation 3A7000, rumored to use a 7nm process, may improve on these points, potentially boosting clock speeds and allowing for more cores and more cache. While the 3A6000 demonstrates considerable progress, it still falls behind Intel and AMD's performance when operating at silent frequencies above 5GHz. However, the rapid improvement in Loongson's architecture design, coupled with its high IPC, suggests a promising future for China's homespun CPU. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. This startup wants to take on Nvidia with a server-on-a-chip to eliminate what it calls an already flawed system — faster GPU, CPU, LPU, TPU or NIC will not deliver the leap that many firms are aiming for This new phishing attack targets iPhone and Android alike via RCS Integrating continuous testing for digital success By James IdeMarch 28, 2024 By Rhys WoodMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By Marc McLarenMarch 28, 2024 By Alex BlakeMarch 28, 2024 By Rhys WoodMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By James IdeMarch 28, 2024 By Mackenzie FrazierMarch 28, 2024 By Kristina TerechMarch 28, 2024 By Craig HaleMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}