{
    "title": null,
    "date": "3/17/2024",
    "url": "https://www.digit.in/top-products/best-amd-ryzen-5-laptops-4027.html",
    "text": "There are a lot of PCs claiming to be the best AMD Ryzen 5 laptop. However, we’ve filtered through all the noise to bring you the best AMD powered laptops that feature Ryzen 5 APU. Almost all the laptops featured on this list have an iGPU as well so light gaming is not out of the picture. Think Valorant, Counter Strike 2, and GTA V on low settings but truth be told that’s enough, especially if you’re talking about an office laptop powered by AMD Ryzen 5 APU. Ofcourse, discrete graphics will allow you to play newer games but having a strong iGPU is an advantage nonetheless. Do remember that the following list is in ascending order in terms of price. The HP 15s is a not-so-basic work/office laptop powered by AMD Ryzen 5 5500U. To be precise, this AMD APU is a hexa-core unit with support for up to 12-threads. It also has a pretty powerful AMD Radeon Graphics iGPU featuring 7-cores and a clock speed of 1800MHz. Simply put, it can easily run games from early 2010’s era including Batman Arkham Asylum, GTA V (at low settings), Max Payne 3 among others. The “U” in the “5500U” also signifies that it is a power efficient chip with a default TDP of just 15W. The rest of the laptop’s specs also compliment the workload it will ultimately handle, video streaming, browsing, document editing and probably some light gaming or retro gaming. As a result, the laptop has 8GB DDR4 memory, 512GB SSD, an FHD display, a solid keyboard and trackpad and also a 720p webcam. The AMD Ryzen 5 is a versatile chip, if nothing else. The Ryzen 5 5600H APU reinforces that fact. With a higher TDP of 45W, compared to the 5500U, and faster clock speeds, the 5600H easily becomes a mid-range laptop gaming CPU. What’s interesting is the fact that the AMD Radeon graphics iGPU is still the same 7-core unit running at 1800MHz because it too is that capable. Expect the 5600H to perform a bit better than the 5500U on account of all these advancements but without a dedicated GPU, the difference in gaming performance will not be astronomical. Although the ASUS Vivobook 16X is a pretty solid laptop despite a dGPU. With 8GB DDR4 RAM, 512GB SSD, and a 16:10 FHD display with 300 nits, it easily becomes one of those “value-for-money” laptops. The fact that you can get a gaming laptop for Rs 50,000 in 2024 is baffling to me. With inflation skyrocketing, wages stagnating and going outside a single time costing 10% of your monthly income, a cheap gaming laptop is something we can all be thankful for. Even better if its powered by an AMD Ryzen 5 5600H. As established, the 5600H is a capable APU. Now it is working alongside the dedicated Radeon RX 6500M GPU, making it even better. You can easily expect the HP Victus 15 powered by the AMD Radeon GPU and Ryzen 5 CPU to outperform most other gaming laptops in its class. The Radeon RX 6500M easily beats the Nvidia GeForce RTX 2050 and GTX 1650 in Shadow of the Tomb Raider, Metro Exodus, and Gears 5. Moreover, the HP Victus 15 improves upon the loose hinge of the previous-gen Victus, making the new design better. Go for the HP Victus 15, I promise you, its performance will surprise you. The reason why you mainly would want this laptop is the OLED display. But it also comes with an AMD Ryzen 5 7520U APU, which is also pretty nice. It is a quad-core chip with support for up to 8-threads. It features a Radeon 610 iGPU which has two cores and 1900MHz clock speed. It is not as powerful of an iGPU as the one in the first three laptops. But what the 7520U does have is DDR5/LPDDR5 memory support. The laptop takes advantage of the same by using 16GB LPDDR5 running at 5500MHz, which is very high. But one dis-advantage of LPDDR5 memory is that it’s non-upgradable. Next, the FHD OLED display has a peak brightness of up to 500 nits, which is most likely for HDR content. In normal use cases, it’ll be somewhere around 300-350 nits, which is still better than most laptops in this segment. We have another HP Victus on our list and it is identical to the model we talked about above with some key differences. It comes with 16GB DDR4 memory, instead of 8GB DDR4, and features a more powerful Nvidia GeForce RTX 3050 in place of the Radeon RX 6500M. Both GPUs have the same 4GB GDDR6 VRAM by the way. In terms of CPU, storage space, display specs, build quality, I/O and cooling, the laptop is exactly the same as the cheaper HP Victus 16. As a result, it is mainly for those who want a little more graphics power but on a reasonable budget. Improving upon the shortcomings of the ASUS Vivobook Go 15 OLED, the Vivobook Pro 15 OLED steps into the ring with improved specs and features. Featuring upgradable, but slower, 16GB DDR4 memory, Nvidia GeForce RTX 2050 GPU for dedicated graphics workload and a brighter 1080p OLED display with 600 nits peak brightness. The laptop features an AMD Ryzen 5 5600HS APU with 6-cores and 8-threads. Overall, it is a machine mainly for creators, graphic designers and video editors, if they’re on a budget, and all the above features in addition to the 100% DCI-p3 colour space coverage of the display proves the same.  Yetnesh works as a reviewer with Digit and likes to write about stuff related to hardware. He is also an auto nut and in an alternate reality works as a trucker delivering large boiling equipment across Europe. View Full Profile Mobile Laptop Digit.in is one of the most trusted and popular technology media portals in India. At Digit it is our goal to help Indian technology users decide what tech products they should buy. We do this by testing thousands of products in our two test labs in Noida and Mumbai, to arrive at indepth and unbiased buying advice for millions of Indians. We are about leadership – the 9.9 kind Building a leading media company out of India. And, grooming new leaders for this promising industry. "
}