{
    "title": "Rise in SA defence exports ‘miraculous’ - AMD",
    "date": "3/15/2024",
    "url": "https://www.defenceweb.co.za/industry/industry-industry/rise-in-sa-defence-exports-miraculous-amd/",
    "text": "South African defence exports for 2023 are set to greatly exceed those of the previous year – something the Aerospace, Maritime and Defence Industries Association (AMD) describes as ‘nothing short of miraculous’. Following the Russian invasion of Ukraine and a consequent rise in global defence spending, South African defence exports have been steadily rising, according to National Conventional Arms Control Committee (NCACC) figures, and are up from R4.6 billion in 2022 and R3.3 billion in 2021. For the first three quarters of last year, they reached R4.9 billion (full calendar year figures are still to be released). Sandile Ndlovu, AMD CEO, told defenceWeb the rise in exports can be attributed to three things. “Firstly, the work we have been doing through the AMD Export Council has been very effective. Industry has invested quite a lot in opening up markets that have not been considered our traditional markets. So this has helped. “Secondly, as a sector, we are well regarded globally. We still have products that people want and are prepared to buy. This is a strong testament to the high standards that our sector prescribes to. “Thirdly, the non-aligned (and principled) stance that our government has taken has ensure that countries feel very comfortable in dealing with South Africa. In the world where global dynamics are constantly changing, it is important for countries to trade with dependable and reliable countries, especially in the area of security.” Ndlovu added that it’s important to put this rise in exports in its proper context. “Our exports have risen despite the challenges we have with our control regime. So the rise has been nothing short of miraculous.” The South African defence industry has been hampered by slow NCACC export approvals, as well as decisions that are put on hold indefinitely as opposed to blocked or approved, and difficulty in the NCACC switching over to a digital system. “While there may be challenges with our regulatory environment, it is important to note that we have made some significant progress in bringing stability and predictability to the regime,” Ndlovu told defenceWeb. “Of course, we still have a long way to go, but I am convinced that because the regulator and ourselves are agreed on a need to modernise our regime, we will definitely get it right.” He explained that at a practical level, “we need to forge ahead with the digitisation of our permit application system and we also need to commence with the process of amending the NCAC Act, that was last amended in 2012. AMD is working with the regulator on both these issues and we are very optimistic about achieving both of them in the coming months.” Global defence spending on the rise Following conflict in Ukraine and now in the Middle East, global defence spending has been increasing, and this has trickled down to South Africa. The Stockholm International Peace Research Institute (SIPRI) reported that global military expenditure continued to increase in 2022, remaining well over the $2 trillion mark, to reach a new high of $2 240 billion. “The continuous rise in global military expenditure in recent years is a sign that we are living in an increasingly insecure world,” said Dr Nan Tian, Senior Researcher with SIPRI’s Military Expenditure and Arms Production Programme. “States are bolstering military strength in response to a deteriorating security environment, which they do not foresee improving in the near future.” “The increased defence spending is as a result of this realisation, by many nations, that the responsibility to defend and protect yourself cannot be delegated or outsourced. The same should hold true for South Africa as well, seeing that right next door in Mozambique there is conflict,” Ndlovu said. He emphasised that, when considering which countries to export to, “governments have a moral and, mostly, constitutional responsibility to provide security for their citizens. The South African Defence Industry does not capitalise or profit from instability but works with legitimate governments in ensuring that those governments are capable of protecting their borders and their citizens. So at no stage do we trade with non-state actors no matter how profitable it may seem or be.” “It is important to stress that in both regions we only deal with countries, upon express approval from our government. And as everyone is aware, the South African government does not approve the proliferation of weapons in areas where these will exacerbate rather than end conflicts,” Ndlovu concluded. defenceWeb is Africa's largest and most trusted online source of news, information, research and insight on aerospace, defence and security matters. Editorial Enquiries: [email protected] Sales Enquiries: [email protected] First Name Last Name Email address: Country  "
}