{
    "title": "Want an AMD RX 7000 GPU? Asus is offering cashback on RDNA 3 graphics cards \nin some countries",
    "date": "3/3/2024",
    "url": "https://www.techradar.com/computing/gpu/want-an-amd-rx-7000-gpu-asus-is-offering-cashback-on-rdna-3-graphics-cards-in-some-countries",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The UK, Austria, France and Germany are getting money off Asus TUF and Dual models – maybe the US will too? Asus has a new cashback offer on its AMD RX 7000 series graphics cards in Europe, giving buyers some decent discounts. Tom’s Hardware reported that this is for those in the UK, and also Austria, France, and Germany, and the offer applies to certain Asus TUF Gaming (such as the excellent RX 7900 XTX) and Dual graphics cards from the RDNA 3 family. The biggest chunk of cash is predictably knocked off the most expensive GPU, so with the 7900 XTX buyers are getting £85 cashback in the UK or €100 in Europe (that’d be around $110 in the US, or AU$170). The cashback amount is dropped proportionally the lower you go down the RX 7000 GPU hierarchy, of course, but buyers of an RX 7600 (Dual) still get a worthwhile £35 back on their purchase, or €40 (around $45 in the US, AU$70). There’s an extra twist that in Germany, you also get a Gamesplanet voucher to the same value as the cashback, as a bonus, and in the UK, you get an Asus RateMyGear reward (to the value of £25, so not quite as generous as Germany). Unfortunately for French buyers, they just get the cashback, with no extra bonus thrown in. Buyers must ensure they purchase from one of the selected retailers running the promotion in these countries, and the offer runs out at the end of the month, March 31. Note that you can redeem your cashback up until April 5, 2024, though, so don’t forget. In the UK, these are the participating retailers: Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. While cashback is obviously a welcome money-saving initiative, we’d still prefer a straight discount – though we’re quibbling here, naturally. It’s good to see a reduction in price, especially as there’s a decent chunk off the RX 7800 XT – the cashback works out at 12.5% off (plus the RateMyGear reward on top) in the UK for example, making the leader of the pack in our roundup of the best GPUs an even more tempting option. This being a European-only deal seems a little odd, and we wonder if a similar scheme will come into play for other regions. It seems a little odd to be missing out the US here, so maybe that’s in the pipeline? We’ll keep an eye out for developments. Naturally, though, before pulling the trigger on an Asus RDNA 3 graphics card, it’s clearly worth considering rival products which might be, at any given time, cheaper than the TUF or Dual you’re looking at even after the cashback. As ever, shop around, and don’t forget to check out our highlights of the best graphics card deals. Darren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013). Intel Battlemage leak gives us hope that maybe there’ll be a more powerful 2nd-gen Arc GPU after all Samsung officially reveals GDDR7 memory for GPUs, which is great news for gamers I lived with Samsung’s S95D QD-OLED TV for a week, and it’s a game changer By Darren AllanMarch 29, 2024 By Maxime VermeirMarch 29, 2024 By Lee McClendonMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Marc McLarenMarch 29, 2024 By Cesar CadenasMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By Roland Moore-ColyerMarch 28, 2024 By Cesar CadenasMarch 28, 2024 By Wayne WilliamsMarch 28, 2024 By Craig HaleMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}