{
    "title": "Best gaming motherboards in 2024",
    "date": "3/12/2024",
    "url": "https://www.pcgamer.com/best-gaming-motherboards/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The best gaming motherboards from the top Intel and AMD chipsets.  🎧 The list in brief\n1. Best Intel Z790\n2. Best Intel Z690\n3. Best Intel B760\n4. Best AMD X670\n5. Best AMD B650\n6. Best AMD X570\n7. Best AMD B550\n8. Also tested\n9. Where to buy\n10. FAQ\n11. Jargon buster Think of the best gaming motherboard as the foundation for your future PC. Your motherboard dictates what your gaming PC can and can not do. It also tells what components you should buy since not all PC parts fit into all motherboards. A good motherboard should ideally provide you with worry-free gaming lasting multiple CPU and GPU generations. Before committing to a motherboard, you must ask yourself: How big is your PC case? Do you want to be able to overclock your CPU? Do you need high-performance RAM support? Do you need a block of USB ports? Bluetooth? Wi-fi? If your wish list increases, expect to spend extra. This isn't always bad, especially if you don't plan on getting a new motherboard for several years. If you're in it for the long haul, you'll need to consider whether you board's socket or chipset can support future processors. When it comes to AMD, the enduring AM4 socket and X570 chipset are finally phasing out, making X670 or B650 boards like the Gigabyte X670 Aorus Elite AX or Asus TUF Gaming B650-Plus WiFi wiser choices for a new AMD system. On the Intel side, our current Z790 pick; the MSI MAG Z790 Tomahawk WiFi—like all 700-series motherboards—will accept not only Intel's 14th Gen CPUs, but 13th and 12th Gen ones too. Thankfully, older LGA 1700 boards are forward compatible too, and will accept 13th and 14th Gen processors after a BIOS update. Ever since building my first gaming PC as a teen I've been fascinated by their guts and have turned poking, prodding, and testing systems into a profession. Over the last 20 years or so I've been testing gaming PCs and have always been more interested in how a manufacturer squeezes the best parts and the best performance out of their budget. But I can't lie, I do love an over-the-top big rig, too. Best Intel Z790  The best Intel Z790 Considering the huge number of slots for SSDs and ports for USB devices, you'd expect this premium Z790 board to be really expensive. But it's not and it's far cheaper than other models which offer little more. It's not the best for serious overclocking features, though. Read more below Best Intel Z690  The best Intel Z690 The Z690 Aorus Pro is surprisingly well priced, considering the amount of features and overall spec level. It offers masses of M.2 slots and USB ports for storage and peripherals, and it's great choice if you performance but don't want to the Z790 price tag. Read more below Best Intel B760  The best Intel B760 The delightfully retro ASRock B760M PG Sonic WiFi is an excellent choice for a user after value for money board without losing too much in the way of features. It'll happily power an i9 CPU and it's generally cheaper now than it was at the time we reviewed it a year or so back. Read more below Best AMD X670  The best AMD X670 There are way more expensive motherboards for AMD Zen 4 CPUs, but they're not worth it when this Gigabyte Aorus Elite AX offers you just about everything you could possibly need. Only the lack of PCIe 5.0 SSD support might put you off. Read more below Best AMD B650  The best AMD B650 While it's a little on the pricey side for a B650 motherboard, you won't feel short changed with this Asus TUF Gaming model. Three M.2 slots for SSDs, lots of USB ports, and excellent support for high power Ryzen 7000-series processors makes this a really solid buy. Read more below Best AMD X570  The best AMD X570 AM4 socket CPUs are still worth buying, especially the Ryzen 5000 range, so do yourself a favour and pair it with this outrageously good motherboard. Yes, it's expensive, but the feature set and overclocking potential are second to none. Read more below Best AMD B550  The best AMD B550 This is the very best AMD B550 motherboard you can buy. Period. It's not even super expensive, despite its comprehensive feature set. The only thing going against it is the fact the X570 boards aren't that much more in price. Read more below Updated March 12, 2024 to modernize the buying guide format, to make it even easier to find the product you want.  Our expert review: ✅ You want a powerful motherboard without unnecessary frills: The Z790 Tomahawk WiFi offers great value for money, allowing you to allocate more of your budget towards a better GPU or CPU, which will have a much greater impact on your rigs' overall performance.\n\n✅You want to run a high-end CPU: The Z790 Tomahawk WiFi features a very good power delivery system, meaning it will happily run any CPU you care to throw at it, up to and including a 14900K (after a BIOS update). ❌You want to buy a PCIe Gen 5 SSD: The Z790 Tomahawk WiFi lacks PCIe Gen 5 SSD support. Though the tangible performance benefits over a Gen 4 SSD are minimal, it is something to be aware of if you want to get the absolute best out of the fastest SSDs. MSI's Tomahawk motherboards usually rate highly. They tend to focus on a core feature set rather than the premium tier features common to much more expensive boards. If the bells and whistles don’t matter to you, but you still want something capable of driving a demanding Core i9 13900K CPU, then Tomahawk models will probably be on your radar. The MSI MAG Z790 Tomahawk WiFi—as the name suggests—is a part of MSI's MAG range, its second tier sub brand. It sits above the Pro range and below the MPG and high-end MEG range. At $319 / £337 / AU$569 it's not cheap, though compared to what some premium tier boards are selling for, it's not badly priced at all. There's tough competition from the other vendors in its price range though. Here for review I have the DDR5 version. There's also a DDR4 version should you have a good set of DDR4 memory on hand, though if you need to buy memory too, the DDR5 version is definitely the way to go. DDR4 is very much at the end of its life and the 13th Gen platform is almost certainly its last hurrah. The Tomahawk includes support for four M.2 drives, though PCIe 5.0 SSD support is missing. Would it be nice to have? Yes, but along with a total lack of PCIe 5.0 drives, the Z790 platform requires an 8x/8x split between the 16x primary slot and the M.2 slot, meaning it's not something that's vital to have at this point in time. A good quality PCIe 4.0 drive will be more than sufficient for years to come, much like a good PCIe 3.0 drive still remains relevant today. Unlike some PCIe 5.0 SSD supporting boards, such as the more expensive Gigabyte Aorus Z790 Master with its massive M.2 heatsink, the Tomahawk doesn’t need one, sticking with a low profile design that doesn’t require lots of surface area. The Z790 Tomahawk comes with seven SATA ports. For bulk storage, SATA still has a place and those seven ports alone may be a deal maker for some users. Some boards costing a lot more come with only four SATA. The VRM is a real highlight compared to competing offerings in its price range. If you make up a checklist of what you want from a motherboard, the MSI Z790 Tomahawk should have most of what you need. Things like USB4 or 10G LAN are what board makers use to justify the price of motherboards costing double the money of the Z790 Tomahawk. The checklist is complete for most users. Wi-Fi 6E, 2.5G LAN, a strong VRM capable of handling 13900K, lots of USB ports including 3.2 Gen 2x2, a solid BIOS, and a discrete design ready to blend in with just about any build theme. Ask yourself if you need more? If you do, be prepared to take a step up in price. Perhaps its lack of PCIe 5.0 M.2 support counts against and it requires good airflow if you subject it to heavy loads, but the MSI MAG Z790 Tomahawk is still a solid, feature-rich board that delivers a core feature set that will suit 95% or more of users. Do you need to spend more? I'd say you probably don't.  Our expert review: ✅ You want to save a bit of money over an equivalent Z790 board: A good Z690 motherboard remains a good board today. Though getting harder to find, the Gigabyte Z690 Aorus Pro is an affordable and feature rich option that will happily run a 13th or 14th Gen CPU after a BIOS update.\n\n✅You want a lot of USB ports: The Z690 Aorus Pro features no less than 13 rear USB ports including a Type-C 20Gbps port (with up to seven more ports available via headers). Those USB Christmas trees or plasma balls will be right at home. ❌You need WiFi 6E or WiFi 7: The Z690 Aorus Pro comes equipped with WiFi 6 only. Though WiFi 6E routers are still not prevalent (even after the release of WiFi 7), you may need to purchase a separate adapter if your network supports WiFi 6E or WiFi 7. It was almost inevitable that the top-end chipset for Intel's next-gen Alder Lake CPUs would end up being super-expensive. That is compounded by the premium attached to anything which mentions DDR5. Even so, the Gigabyte Z690 Aorus Pro almost bucks that trend by offering a rounded feature set along with DDR5 support for around $330. Sure, in the last CPU generation $300+ was seen as high-end, but for the 12th Gen platform that's positively mid-range. There are cheaper DDR4 boards around—Gigabyte also makes an Aorus Pro in DDR4 flavor, too, though that's not sold in the US or EU—but if you want to get the absolute most out of the new Intel platform you want DDR5. Gigabyte has been smart about the way it's specced out the Aorus Pro. By limiting it to 'just' Wi-Fi 6 wireless (as opposed to Wi-Fi 6E) and 2.5G Intel wired networking connections, and eschewing such unnecessary luxuries as Thunderbolt 4 or another M.2 slot, it has managed to keep the price at least relatively sensible. And it's a great performer, too, delivering system and gaming performance easily on par with the far more expensive boards we've also tested. The BIOS is maturing regularly as well, which makes us completely confident in recommending the Gigabyte board as our pick of the Z690 bunch. About the only downside with this option is the high contrast design, with lots of grey heatsinks. Though a lot of the grey chipset and M.2 cooling will be hidden beneath a GPU, it might not be the easiest board to blend in with your build. There's also minimal RGB lighting with just a tiny Aorus logo atop the rear I/O heatsink. That's rare for a gaming motherboard in 2022. There are four RGB headers, though, with two of them being addressable, so you can still add plenty of flashy illumination if you really want. Gigabyte's Z690 Aorus Pro sits in a genuine Alder Lake sweet spot, where it offers good value for money and a nice, rounded feature set. Features such as Thunderbolt 4, a fifth M.2 slot, or 10G LAN would add considerable extra cost which is hard to justify. With plain Wi-Fi 6, 4x M.2 slots, a strong VRM, and loads of USB ports, most gamers will be happy. And at $330 you'll have a few dollars that you can put towards the scarcer things, like DDR5 memory or a faster GPU. Read the full Gigabyte Z690 Aorus Pro review.  Our expert review: ✅ You care nothing for manual CPU overclocking: Like all B760 motherboards, the ASRock B760M PG Sonic WiFi lacks the ability to manually overclock your CPU. Not that it matters as much these days thanks to the aggressive and well-tuned turbo modes on offer from 12th, 13th and 14th Gen CPUs.\n\n✅You love Sonic the Hedgehog: Aesthetics are usually secondary to features, value for money or BIOS maturity, but who cares about that. This is a delightfully retro looking motherboard. ❌You need more expansion potential: The B760M PG Sonic WiFi is a micro-ATX motherboard, so it doesn't come with the expansion slot complement of most full ATX B760 boards. When evaluating a budget motherboard, aesthetics are usually not at the top of the criteria list. The ASRock B760M Sonic WiFi is different. It's definitely a looker! It's still a motherboard, but it's a Sonic the Hedgehog motherboard! Not that that means much if the rest of the board is not up to the job. Looks aside, this little Asrock is an excellent option with a quality feature set that's perfect for an affordable Intel gaming system. The Sonic branding is everywhere. There's a large blue Sonic stencil on the rear of the board and even the BIOS has a Sonic blue theme. The heatsinks have a brushed metal look and you get a line of RGBs underneath the bottom M.2 heatsink. The B760M Sonic has a good list of features for a Micro-ATX board. It's got a PCIe 5.0 x16 slot and a PCIe 4.0 x1 slot. There are three PCIe 4.0 M.2 slots, all of which are cooled by simple heatsinks. They're joined by four SATA ports. The four memory slots support 192GB of memory, though with the latest BIOS, you even have the option of running 256GB! Not that many will require that much. The VRM is a decent 12+1+1 phase design with dual 8-pin power connectors. It happily ran a i9 13900K in our review, and it will accept 14th Gen processors with the newer BIOSes. If it can run an i9, it will have exactly zero issues handling any LGA 1700 processor, with an i5 or i7 chip being a more typical pairing with this class of motherboard. The B760M Sonic's rear I/O connectivity isn't bad at all. You get four USB 2.0 ports and four 10GB/s Gen 2 ports, one of which is Type-C. A 20GB/s port would be nice, but we can’t have everything that boards at twice the price have. Intel WiFi 6E and Realtek 2.5G LAN controllers take care of networking duties, while Realtek ALC897 provides audio. It will do a job, but you wouldn't use it to deliver a flawless signal to a $10,000 pre/power amp combo. It's got HDMI 2.1 and DP 1.4a ports. These add a bit of flexibility for non-gaming purposes. One of the more unusual features you'll see is an eDP header. It can be used with ASRock's case-mounted LCD panel. Intel's B-series motherboards have come a long way in recent years and the ASRock B760M Sonic WIFI is a good example of that. It can run a power-demanding CPU, lots of fast DDR5 memory and its connectivity options match those of high end boards from just a few years ago. Users looking for an affordable motherboard won't have any buyers remorse. There's a lot of competition in this price range, with all major vendors having decent options. There aren't any that offer the capabilities of the ASRock though, and none of the competing options come with the lovely Sonic theme that sets this one apart from a rather bland crowd. Read our full Asrock B760M PG Sonic WiFi review.  Our expert review: ✅ You want a board that will last you for many years: AMD's Zen 4 generation is just the first of likely another two that will remain compatible with the AM5 socket. A good quality board like the Gigabyte X670 Aorus Elite AX is sure to accept future Zen 5 and likely Zen 6 CPUs, giving it a long lifespan.\n\n✅You want a lot of USB ports: Gigabyte typically equips its premium boards with an excellent USB complement. Whatever devices you care to name, including keyboards, mice, DACs, headsets, thumb drives, printers or multiple cables for charging, you can run them all at the same time. ❌You must have a PCIe Gen 5 x16 slot: Though it means nothing now, future graphics cards will support PCIe Gen 5. Who knows if a distant RTX 6090 or similar will benefit or not? If you absolutely must have it, you'll need to step up to a X670E or consider a B650E alternative. If you're in the market for a good quality X670E motherboard, the chances are that you've recoiled at the prices of many of them. High-end motherboards are more likely to be X670E models, but the Gigabyte X670 Aorus Elite AX comes in with just enough great features at such a reasonable pricepoint, that I've been tempted away from the -E model boards. Part of the reason X670E boards cost a lot is because of the high-quality signalling required for both PCIe 5.0 expansion and M.2 slots. But since PCIe 5.0 x16 for graphics cards means nothing right now, an X670 board is a perfectly viable option. And at $289 / £349 / AU$599, the Gigabyte X670 Aorus Elite AX is a heck of a lot better value than X670E boards. But does the Elite AX have to sacrifice a little or a lot to come in at that price? No it does not. Here you get effective heatsinks, particularly the VRM one, though sadly Gigabyte opted not to include its excellent finned heatsink design on this model. In total there are four M.2 slots made up of the aforementioned primary PCIe 5.0 x4 one, plus a further three PCIe 4.0 x4 slots that are cooled by a single large heatsink. There are four SATA ports to round out the storage complement. Other highlights include a USB 3.2 Gen 2x2 type-C header, power, reset, and CMOS clear buttons, and a Thunderbolt 4 header. The board comes with a 16+2+2 phase VRM with 70A power stages. More than enough for the average user. Throw a Ryzen 9 7950X with PBO enabled into the Elite AX and you won’t have a problem. Your cooling will hit that 95°C operating temperature of a 7950X long before the VRM gets stressed. Even if Zen 5 or Zen 6 CPUs take a step up in TDP, it’s hard to imagine the Aorus Elite AX struggling to power them. The cooling, storage, and VRM is more than enough to suit most users. Is the I/O lacking then? Hardly. The Aorus Elite AX includes AMD's RZ616 Wi-Fi 6E and Realtek 2.5G LAN. You'd expect to miss out on USB 4 at this price, but the rest of the USB count is stellar. You get a 3.2 Gen 2x2 type-C port, two Gen 2 ports, six Gen 1 ports, and four 2.0 ports. That's 13 rear USB ports!  There's a HDMI 2.1 port for use with Ryzen 7000's newly included integrated graphics along with a BIOS flashback button. The audio is nothing special, with an aging Realtek ALC897 codec taking care of things. An S/PDIF output would be nice too, but apart from that, there's not much to complain about with regards to connectivity. If nothing else, the Elite AX shows that manufacturers are getting a bit greedy at the high-end of the market. If you absolutely must have USB4, 10G LAN or Thunderbolt, you'll have to pay a LOT more for it. For the mainstream market, a board like the Aorus Elite AX is where it's at. Read our full Gigabyte X670 Aorus Elite AX review. Best gaming laptops | Best gaming keyboards | Best gaming mouse\nBest gaming motherboards | Best graphics cards | Best gaming monitors  Our expert review: ✅ You want an affordable B650 board that can handle future high end CPUs: The Asus TUF Gaming B650 Plus WiFi features big and chunky heatsinks and a VRM that has no problem handling the demands of a Ryzen 9 7950X. Barring AMD springing a surprise with some future power-guzzling 32-core monster chip, expect this board to handle all future AM5 CPUs without a hitch.\n\n✅You want a stable and mature AM5 board: At the time of the launch of the AM5 platform, some boards were a little rough around the edges. Not so the Asus TUF Gaming B650 Plus. Its refined BIOS will hold it in good stead for years to come. ❌You're on a tight budget: The TUF Gaming B650 Plus WiFi is a solid board, but it's a step up in price from cheaper B650 boards, especially if plan to pair it with a more affordable Zen 4 chip that won't tax the VRM and cooling of the board. The primary M.2 slot supports up to PCIe 5.0, while the other two support PCIe 4.0. The primary slot's cooling is relatively small compared to some of the chunky M.2 heatsinks I've seen, including those shipping with the Asrock X670E Pro RS and Gigabyte Z790 Aorus Master. The board supports a single 5Gbps Type-C front connector and up to two Type-A and four USB 2.0 ports. Not bad, but a 10Gbps Type-C port would have been nice. The VRM is decent, if not spectacular, but it's all relative. Expecting a gazillion 105A stages is something that's restricted to boards at well over double the price. The 12+2 phase design with 60A stages was enough to power my Ryzen 9 7950X without issue. The board includes 4+8-pin CPU power connectors. Asus has done a wonderful job with the TUF B650 Plus' cooling design. The big and chunky heatsinks provide lots of surface area while allowing lots of air to circulate freely. Some mid-tier boards can skimp a little on VRM cooling. Here, Asus did not. The TUF B650 Plus comes with a good set of rear I/O ports which are perfectly adequate for things like keyboards, mice and printers, which don’t need high speed (and expense adding) ports. You also get 2.5G LAN and WiFi 6, though notably, not 6E. That might be a problem in the future, especially if you live in a crowded household or apartment building with lots of Wi-Fi signals. The Asus BIOS is a little more difficult to navigate for a novice user compared to those of some other manufacturers, but once in the PBO modes are particularly worth looking at if you're planning to drop a non X Ryzen 9 7900 or Ryzen 7 7700 in. The big VRM heatsinks are a highlight. My test 7950X ran without a hitch, and at no time did the heatsink get uncomfortably warm to the touch. As long as you have at least some case airflow, the VRM will be fine, even with PBO enabled. Take care to stick to reasonable expectations, and don't go shoving 1.5V+ through a high core count CPU under a full load for hour after hour. The typical Asus BIOS refinement is here. I was able to run my test DDR5-6000 C30 kit by simply enabling the EXPO profile. That’s something I have encountered issues with recently due to improperly applied memory controller voltage. The Asus TUF Gaming B650-Plus WiFi is primarily a motherboard for a budget-conscious gamer. While you can't expect all the bells and whistles at this price point, as long as you don't expect too much of it, it's a fine motherboard. You'll need to ask yourself if you value PCIe 5.0 GPU support. If so, do consider a B650E option if you're going to stick with AM5 for a while (as most of us are). Either way, the TUF B650 Plus is a solid entry into the market. It feels refined, it's got a good core feature set with excellent cooling, subtle good looks, and apart from the missing out on a PCIe 5.0 slot, it's destined to have a long life ahead of it. It may not tick every feature check box, but as a board for a 2023 system, it's got most of what you need, happily delivering up to 7950X and RTX 4090 class performance. Do remember the competition is very tough, but if you're an Asus fan, you won't be disappointed. Read our full Asus TUF Gaming B650 Plus Wi-Fi review.  Our expert review: ✅ You want arguably the best AM4 motherboard you can buy: Asus hit it out of the park with the Crosshair VIII Dark Hero. It's the culmination of years of refinement and design tweaks and it'll be very hard to find a better AM4 motherboard. \n\n✅You love overclocking and tweaking: The Crosshair VIII Dark Hero comes with a BIOS packed with overclocking options. It's particularly adept at running fast DDR4 memory. ❌You've got an eye towards the future: As an AM4 board, the Crosshair VIII Dark Hero is well into the twilight of its career. The AM5 platform has been out an about for well over a year, and it has a promising upgrade path ahead of it. An AM5 board makes a lot more sense for new systems built for the long haul. Asus' ROG Crosshair VIII Dark Hero wants to be the last AM4 motherboard you'll ever need. But what is it that makes a great motherboard? Features are important, as is a stable and refined BIOS, value for money, a good design, but sometimes it's something intangible. Sometimes it's that the damn thing works. Motherboard testing is often one of the most painful things a tech journalist has to do. With some boards, you have to fight it to get it to do what you want, or expect it to, or have to crank up some voltage setting to a level you don’t really want to, but the Dark Hero just boots the first time, even as we played with the memory clocks and timings and the Infinity Fabric. The Dark Hero features a rather subtle design. Some might even say it’s a little bland. Perhaps we have reached ‘Peak RGB’ with recent motherboards being a little more discrete with their RGB implementations. It’s also unusual that there’s not a Crosshair VIII Apex or Extreme, especially when Gigabyte and MSI have boards priced well above the Dark Hero. A $400 USD motherboard can never be described as cheap, but compared to the exorbitant prices of the MSI Godlike and Gigabyte Aorus Extreme, it certainly feels more affordable. The layout of modern ATX boards tends not to vary too much these days. The primary M.2 slot is sensibly located above the PCIe slot. The second slot at the bottom also features a heatsink. The sockets are easy to access without having to remove the entire heatsink assembly. Plus, there's no chipset cooling fan, which is a boon in our book. The VRM has been upgraded over that of the regular Hero. The power stages are now rated for 90a, up from 60a which brings it in line with some of the other premium X570 boards. Even if you’re into smashing out benchmarks on LN2 (and this board will see plenty of that in the hands of overclockers), it will handle the punishment with ease. The heatsinks are big and chunky affairs. The rear IO is packed out. If you need extra USB ports for that head massager or plasma ball, there are few better-equipped boards. There are no less than eight USB 3.2 Gen 2 ports, one of which is Type-C. These are joined by four USB 3.2 Gen 1 ports. There are also BIOS clear and flashback buttons, the LAN and WiFi antenna ports, and the usual set of audio ports including S/PDIF. The IO shield is preinstalled, which is blessedly now becoming standard practice on decent motherboards. The Crosshair VIII Dark Hero might not be the best AM4 motherboard ever made, we’d have to review a few hundred others to make that claim, but it’s an easy claim to make that the Dark Hero is certainly one of the best AM4 motherboards we've ever used. Time and months of user feedback will determine if the Dark Hero assumes a position as one of the truly legendary ROG motherboards, but we wouldn’t bet against that happening. Read the full Asus ROG Crosshair VIII Dark Hero review.  Our expert review: ✅ You want a ROG board at a relatively reasonable price: Asus very rarely missteps with any of its ROG motherboards and the ROG Strix B550-E Gaming is no exception. It's a board with all the trimmings and its perfect for pairing with a high core count or X3D Ryzen 5000-series CPU.\n\n✅You love overclocking and tweaking: The Asus ROG Strix B550-E Gaming BIOS is packed with overclocking options. This is no B550 cheapie. Pair it with high end accompanying components and you can clock them like you stole them. ❌You're on a budget: While the Asus ROG Strix B550-E Gaming is an excellent motherboard, it's an expensive proposition, making it hard to justify against cheaper B550 options, to say nothing about X570 boards at similar prices. Sure, the Asus ROG Strix B550-E is the same price as plenty of X570 motherboards, but it's a premium motherboard, with all the trappings you'd expect from Asus' Republic of Gamers stables. I'm talking 14+2 power stage, M.2 heatsinks, and pre-installed backplates. You also get Wi-Fi 6 wireless networking as well as Intel 2.5Gb ethernet too. And RGB LEDs, of course. What you’ll no doubt be wondering about is performance: Is it actually all that much better than a more prosaic—and cheaper—B550 alternative? At stock clocks and default board settings, the inevitable answer is... no. In fact, the Asus ROG Strix B550-E Gaming is a solid 50% pricier than the likes of the MSI MAG B550M Mortar and tangibly slower in most of our benchmarks, including games. Where the Strix looks stronger, inevitably, involves overclocking. AMD’s laissez-faire approach to clocking the twangers off pretty much any CPU that comes its way, by enabling access to super-simple core ratio tweaks, means you’d almost be mad not to give it a go. The Strix B550-E gets Asus’ slick and familiar BIOS interface that allows access to not only the core ratio but pretty much every setting a keen overclocker could wish for. So you have the choice of bumping the core ratios up and letting the board work out the details, or getting down and dirty with voltages and timings. Allowing the board to do the detailed brain work results in an overclock of our AMD Ryzen 3 3100 quad-core test chip of 4.2GHz on all cores. The Ryzen 3100 is good for a 3.9GHz boost clock as standard, so that’s a 300MHz overclock. Which is significant, if not exactly stellar. That said, of the B550 boards we've tested, it's the far more affordable MSI board that actually comes out top in our straight performance testing. But the Asus can overclock far better, even if it does chew up more raw power from the plug on the whole. The Asus ROG Strix B550-E Gaming is the whole package then, and right now is our all-around pick for the best B550 motherboard. Though that still feels like a tough recommendation when X570 boards are the same price… Read our full Asus ROG Strix B550-E Gaming review. ASRock Z690 Taichi\nPacked with features and serious overclocking potential, ASRock's motherboard is as good as they come. But like all high-end Intel boards, it's not in the least bit cheap. Read our full ASRock Z690 Taichi review. Gigabyte X570S Aorus Master\nWith a strong feature set, including four M.2 slots, Wi-Fi 6E and loads of USB ports, the X570S Master justifies its price tag. Read our full Gigabyte X570S Aorus Master review. ASRock A520M ITX/ac\nThe ASRock A520M ITX/ac is a strong budget ITX offering. It offers a smart feature set and then there's the genuine bonus of Ryzen 5000 series support. Read our full ASRock A520M ITX/ac review. In the US: In the UK: You need to know which processor you want to build your new rig around. Are you firmly tying yourself to the mast of the good ship Intel, with its impressive Alder Lake CPUs? Or are you going to continue flying the AMD flag proudly? Once you've picked your chip, it's down to features, overclocking intentions, and your budget. Other than knowing which processor you're going to be fitting, size matters when picking up a motherboard. If you're building out a standard ATX scale gaming PC, then pretty much any motherboard is open to your whims, but if you want to go for a smaller chassis, either Micro ATX or Mini ITX, then you'll need a corresponding mobo. That doesn't necessarily mean sacrificing performance or key features anymore. A single PCIe slot is more than enough for today's SLI/CrossFire-less GPU world, and even some Mini ITX boards will come with multiple M.2 SSD slots. The scale will impact pricing, however. Interestingly Micro ATX boards are often the most affordable, while Mini ITX options can be the most expensive. We've picked our top two favorite gaming motherboards for each of the main Intel and AMD chipsets to give you the best options around. No. There are absolutely restrictions in place to stop that, especially on the Intel side. It has opened up memory overclocking across its 500-series chipsets (as well as the higher tier ones), but the Z690/790 are your only chance of overclocking the latest 13th and 14th Gen K-series CPUs. But don't worry, they don't overclock very well. AMD is more generous, allowing all its CPUs and most of its motherboard chipsets. Basically, if you make sure not to go for the cheapest Ryzen board, one with an 'A' at the front of its nomenclature, then you're good to tweak. Though again, there really are limited returns. ATX, Micro-ATX, Mini-ITX The most common form factors/sizes of a motherboard from largest to smallest, which beyond physical dimensions determines which cases it'll fit into and (broadly) how many expansion slots are available. There are other, less common form factors (XL-ATX, HPTX, etc.), but these three are the most ubiquitous consumer form factors. USB Header A connector on the motherboard that allows you to run a cable to the case to add additional USB ports, typically on the front panel (though some cases provide top or rear panel slots as well). BIOS/UEFI Basic Input/Output System and Unified Extensible Firmware Interface connect the hardware and software that lives on the board (the firmware) to the operating system (OS, such as Windows or Linux). They allow you to adjust system-level settings, such as fan speed or RAM frequency. UEFI has largely replaced the older BIOS standard. Expansion Slots (PCIe Slots) Peripheral Component Interconnect Express slots on the motherboard are designed to accommodate add-in cards like graphics cards, SSD cards, dedicated sound cards, etc. PCIe slots are measured in both length (x16, x8, x4, x1) as well as by the number of data transmission lanes they provide (x16, x8, x4, x1). It's possible for an x16 slot to only provide 8 lanes of data, for instance, which means the maximum possible data transfer rate is halved (though in many cases, because PCIe provides such a high ceiling for transfer speeds, a lower number of lanes doesn't make a tremendous difference). DIMM Slots Dual In-Line Memory Module slots, the slots on a motherboard where your RAM lives. The number of total slots contributes to the maximum amount of RAM your system can handle, paired with the chipset and OS. Chipset The logic allows the various parts of a motherboard to talk to each other. The chipset determines which processor generations a motherboard is compatible with and what add-in cards can be used. SATA Ports Serial Advanced Technology Attachment ports, an interface for connecting storage devices/drives to a motherboard (HDDs, SSDs, optical drives, etc.). The number of physical ports on your board, combined with ports for NVMe storage, will determine the total number of storage drives you can have connected to your PC at any time. Sign up to get the best content of the week, and great gaming deals, as picked by the editors. Dave has been gaming since the days of Zaxxon and Lady Bug on the Colecovision, and code books for the Commodore Vic 20 (Death Race 2000!). He built his first gaming PC at the tender age of 16, and finally finished bug-fixing the Cyrix-based system around a year later. When he dropped it out of the window. He first started writing for Official PlayStation Magazine and Xbox World many decades ago, then moved onto PC Format full-time, then PC Gamer, TechRadar, and T3 among others. Now he's back, writing about the nightmarish graphics card market, CPUs with more cores than sense, gaming laptops hotter than the sun, and SSDs more capacious than a Cybertruck. Sponge made from a cheesy waste product can help recover the gold from your dumped circuit boards AMD's top Zen 5 motherboards will reportedly come in a triple-chip configuration for guaranteed USB4 40Gbps support I never liked bullet hell shooters, until Xenotilt put one inside my new favourite pinball table By Andy Edser28 March 2024 By Timothy Monbleau28 March 2024 By Morgan Park27 March 2024 By Shaun Prescott27 March 2024 By Christopher Livingston27 March 2024 By Kara Phillips27 March 2024 By Kerry Brunskill27 March 2024 By Wes Fenlon26 March 2024 By PC Gamer26 March 2024 By Harvey Randall26 March 2024 By Tyler Colp26 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}