{
    "title": "Cryptominers target AMD Ryzen 9 7950X CPU, up to $3 per day profit",
    "date": "3/13/2024",
    "url": "https://videocardz.com/newz/cryptominers-target-amd-ryzen-9-7950x-cpu-up-to-3-per-day-profit",
    "text": "Cryptocurrency mining is again experiencing a spike in popularity, with Bitcoin recently surpassing its all-time peak value of $70,000.  While GPU mining remains unaffected, CPU mining is proving to be profitable once again. Particularly, the Ryzen 9 7950X, equipped with 16 cores, is gaining attention for its efficient operation at sub-100W power consumption. Unlike high-end GPUs, this CPU is more accessible in terms of cost and can quickly turn a profit. One cryptocurrency driving CPU mining profitability is Qbic, offering a daily profit of $3 on 7950X, which is more than twice the earnings from GPU-based mining. This disparity in profits is drawing miners towards CPU-based setups, particularly those with support for AVX2/AVX512 instructions, such as Zen4.   Ryzen 9 7950X in QBIC mining, Source: Profit-Mine  The 16-core Ryzen 9 7950X seems to be doing exceptionally well in mining, offering $3 per day profit. That’s also 2 times as much as Ryzen 9 5950X which does not support AVX512. Demand for this Zen4 CPU is rising, leading to its disappearance from store shelves: Now I understand, 7950X is the king in Qubic mining. https://t.co/r8Uo79B6C6 — MEGAsizeGPU (@Zed__Wang) March 12, 2024  At approximately $600, the 7950X CPU presents a more cost-efficient option compared to high-end GPUs. Its return on investment (ROI) is notably faster, taking around 183 days at present (not including platform cost). Additionally, the CPU consumes less power than the GPU and can still be sold easily later if needed. If there is something that we learned over the last decade is that the cryptocurrency mining trend can stop just as quickly as it started. However, consumers should be aware of a new problem and also look forward to how AMD wants to tackle this issue with the Zen5 architecture, expected to support AVX512 instructions as well. Intel CPUs should not be affected, as the company has abandoned AVX512 support with Alder Lake. Source: MEGAsizeGPU, Wccftech We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}