{
    "title": "Asus Rog Ally is hit by Windows & AMD driver updates",
    "date": "3/18/2024",
    "url": "https://windowsreport.com/asus-rog-ally-is-hit-by-windows-updates-and-amd-driver/",
    "text": "Follow us Share this article Latest news This time, the KB5035853 update is crippling the Asus Rog Ally game console 2 min. read Published on March 18, 2024 published on \n\nMarch 18, 2024 Share this article Read the affiliate disclosure page to find out how can you help Windows Report effortlessly and without spending any money. Read more If you have an Asus Rog Ally portable game console and run into problems running apps and games, that is caused by the latest Windows updates, coupled with the AMD .8001 graphics driver update. As reported by Windows Latest, users also had to confront nasty BSoD errors, FPS drops, stuttering and more. Apparently, the major culprit is the already infamous Windows 11 KB5035853, which is creating havoc among PC and laptop owners as well. According to a Reddit thread, many users complain about the same issues on Asus Rog Ally with BIOS versions 336 and 337. Although the issue is affecting your console pretty seriously, you can still fix the problem pretty fast. There are three tested solutions to get rid of this problem right now. First, disable the in-game overlay feature from the AMD Adrenaline app. You will find this setting in Settings > Preferences. Another solution is to uninstall the March 2024 Windows Update. To do that, search for Uninstall Updates in the Start menu and press Enter, then find the KB5035853 update and hit the Uninstall button. Ultimately, you can try resetting the AMD Adrenaline app from its Advanced Settings menu. The problem with this solution is that you will need to create a new profile after resetting the app. In conclusion, people are very mad about the problems caused by the KB5035853 update. It seems that for now, the safest thing to do is not to install it in the first place or uninstall it until further notice. Have you had problems with the latest Windows update on Asus Rog Ally? Tell us all about that in the comments section below. More about the topics: gaming console, rog ally Claudiu Andone Windows Toubleshooting Expert Oldtimer in the tech and science press, Claudiu is focused on whatever comes new from Microsoft.\nHis abrupt interest in computers started when he saw the first Home Computer as a kid. However, his passion for Windows and everything related became obvious when he became a sys admin in a computer science high school.\nWith 14 years of experience in writing about everything there is to know about science and technology, Claudiu also likes rock music, chilling in the garden, and Star Wars. May the force be with you, always! Claudiu Andone Windows Toubleshooting Expert Oldtimer in the tech and science press, with 14 years of experience in writing on everything there is to know about science, technology, and Microsoft Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}