{
    "title": "Nvidia is the 'GPU cartel,' says former AMD Radeon manager",
    "date": "3/28/2024",
    "url": "https://ca.news.yahoo.com/nvidia-gpu-cartel-says-former-154842795.html",
    "text": "AMD’s former senior vice president and general manager of Radeon has come out with some strong words against Nvidia. Scott Herkelman called Nvidia “the GPU cartel” in response to a story from the Wall Street Journal in which Nvidia’s customers claim that it delays GPU shipments in retaliation for those customers shopping with other suppliers. The accusation in question comes from Jonathan Ross, CEO of AI chip startup Groq, who said, “a lot of people that we meet with say that if Nvidia were to hear that we were meeting, they would disavow it. The problem is you have to pay Nvidia a year in advance, and you may get your hardware in a year, or it may take longer, and it’s, ‘Aw shucks, you’re buying from someone else, and I guess it’s going to take a little longer.'” Herkelman responded to Tom’s Hardware’s coverage of the story on X (formerly Twitter), saying, “this happens more than you expect, Nvidia does this with DC customers, [manufacturers], [add-in board partners], press, and resellers.” This happens more than you expect, NVIDIA does this with DC customers, OEMs, AIBs, press, and resellers. They learned from GPP to not put it into writing. They just don&#39;t ship after a customer has ordered. They are the GPU cartel and they control all supply. &mdash; Scott Herkelman (@sherkelman) February 27, 2024 This behavior calls back to the GeForce Partner Program (GPP), as pointed out by Herkelman. Nvidia has canceled the GPP following backlash over it allegedly requiring Nvidia’s partners to remove its gaming branding from all non-Nvidia GPUs. This isn’t the first time Herkelman has come out against the GPP. He released a statement in 2018 shortly after the U.S. Federal Trade Commission (FTC) and European Union Commission began responding to complaints about the program. “They learned from GPP to not put it into writing,” Herkelman continued. “They just don’t ship after a customer has ordered. They are the GPU cartel and they control all supply.” Herkelman’s claim about restricting units from press is particularly interesting, as we know about a clear example of that happening in the past. In late 2020, Hardware Unboxed, a YouTube channel dedicated to PC hardware reviews and analysis, received an email that it would no longer receive review units from Nvidia. It stated: “Our Founders Edition boards and other Nvidia products are being allocated to media outlets that recognize the changing landscape of gaming and the features that are important to gamers and anyone buying a GPU today.” Following pushback from larger YouTube channels like Linus Tech Tips and JayzTwoCents, Nvidia walked back its statement and issued an apology to Hardware Unboxed. In Nvidia’s latest earnings called, CEO Jensen Huang said, “We allocate fairly. We do the best we can to allocate fairly, and to avoid allocating unnecessarily,” as reported by Fortune. We’ve reached out to Nvidia, and it declined to comment on the story. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era.  \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. Rebel Wilson is calling Sacha Baron Cohen’s decision to release behind-the-scenes footage of their sex scene “an a–hole move,” after never-before-seen video from the set of the 2016 film “The Brothers Grimsby” was published Friday by the Daily Mail. “Releasing unauthorized and misleading behind-the-scenes video without my approval is SBC’s latest way of bullying and gaslighting me,” the ... The visibly upset MSNBC anchor was responding to the Trump's attack on Judge Juan Merchan's daughter despite gag orders The post Nicole Wallace Gets Fed Up, Tosses Script While Covering Latest Trump Attack: ‘What Are We Going to Do Different?’ | Video appeared first on TheWrap.  Saturday Night Live went with Donald Trump’s hawking of Bibles for its cold open, with James Austin Johnson returning as the former president to make the pitch. It was another case of the show trying to satirize something that hardly needs rewriting. “That’s right, it’s Easter. The time of year when I compare myself to … Nordegren has moved on and built a life that focuses on her six kids Seven reportedly cost $20 million Improve grammar, word choice, and sentence structure everywhere you work. Write better with Grammarly. Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… When Sam* married her husband, she never imagined that 20 years on, she'd have not one, but two affairs... The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap.  Russian Armed Forces downed their own Sukhoi Su-27 fighter jet over Crimea, according to Ukrainian officials. A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. Prince George appears to have inherited a very impressive skill from the likes of King Charles, Kate Middleton and Prince Philip. Discover more... If given HK$8 million to spend, Yat says he would invest in digital assets such as non-fungible tokens The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup. Buying a car can feel like walking through a minefield of shady sales tactics. Some deceitful dealerships have long employed a bag of tricks to nickel-and-dime consumers out of their hard-earned cash.... They soft-launched their relationship at the supermodel's cookbook event in Miami.  The former national security adviser rejected a comparison between the ex-president and Julius Caesar. Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o Ordering at Subway allows for major customization, but it can also go awry. Employees cite these 12 ordering mistakes as some of the worst a customer can make. "
}