{
    "title": null,
    "date": "3/16/2024",
    "url": "https://overclock3d.net/news/software/intels-application-optimization-software-now-supports-older-intel-cpus/",
    "text": " Intel has now updated their Application Optimization (APO) to support 12 new games and older Intel processors. Now, under advanced mode, APO now supports Intel 12th gen and newer processors. Previously, only high-end Intel 14th gen CPUs were supported. Using Intel’s APO software, Intel can deliver game-specific CPU optimisations to boost game performance. In Metro Exodus, Intel has been able to delver performance gains of up to 18%. Not bad for a mere software change. Intel’s APO software has been updated to support the following games. Before the software’s latest update, Metro Exodus and Rainbow Six Siege were already supported. Intel’s APO software is now available to download through the Windows Store.  In a sense, Intel’s APO technology works in a similar way to GPU drivers. Graphics card manufacturers like AMD, Intel, and Nvidia all release GPU drivers that feature game-specific optimisations. With APO, Intel are giving their CPUs game-specific optimisations that can boost the framerates of supported games. Intel has showcased that their APO technology can deliver significant performance gains. As Intel updates this software to support more games and CPUs, it could become a major advantage for Intel’s CPU lineup. If APO proves to be successful, it may only be a matter of time before AMD implements a similar features. Perhaps this will be within their Ryzen Master software. You can join the discussion on Intel APO coming to older Intel processors on the OC3D Forums.  A Northern Irish father, husband, and techie that works to turn tea and coffee into articles when he isn’t painting his extensive minis collection or using things to make other things. No crappy Google banners here, only PC related advertising you may actually find interesting. Please disable Ad Blockers in order for us to keep producing the same level of quality, informational reviews and news. Worst case they actually look pretty and fill the empty gaps <3 "
}