{
    "title": "Not Just Nvidia Or AMD But This Lesser-Known Chip Stock Is Riding The AI \nBoom, Says Fund Manager - KLA (N",
    "date": "3/10/2024",
    "url": "https://www.benzinga.com/markets/equities/24/03/37578348/not-just-nvidia-or-amd-but-this-lesser-known-chip-stock-is-riding-the-ai-boom-says-fund-manager",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Stephanie Niven, a fund manager, has identified a lesser-known semiconductor equipment company, KLA Corp KLAC, as a key player in the AI boom. What Happened: Niven, the global sustainable equity portfolio manager at Ninety One, pointed out that KLA, a supplier to chip giant Taiwan Semiconductor TSM, is reaping the benefits of the AI boom, reported CNBC on Sunday. KLA is known for its semiconductor manufacturing equipment that enhances the efficiency of chip production. TSMC, which exclusively manufactures high-end AI chips for NVIDIA Corp NVDA, is KLA’s largest customer. \"This is a business that decarbonizes the AI transition because it reduces errors and increases yields,\" Niven told CNBC's \"Squawk Box Europe\" Friday. See Also: Bitcoin Vs. Ethereum Vs. Shiba Inu Vs. Doge: How Much You Would Have Now If You Had $1,000 Invested In Each Of The Crypto At Start Of Current Bull Run Despite not being a headline AI stock, Niven believes KLA plays a crucial role in enabling AI capabilities. She also noted that KLA’s focus on reducing wastage in the manufacturing process aligns with sustainability goals. KLA is the eighth largest holding in Niven’s fund, with a 4.7% allocation. The fund has outperformed its benchmark in 2022. Shares of KLA have surged 25% in 2024 and 89% over the past year. The stock now trades at 27 times forward earnings, compared to its five-year average of 18 times earnings. While some analysts caution that the stock’s significant price increase may lead to a near-term drop, a majority of analysts are bullish on the company’s fundamentals. Why It Matters: The AI boom has been a hot topic in the tech and finance sectors. Industry leaders like Jamie Dimon have emphasized the real potential of AI, dismissing it as mere hype. This sentiment is reflected in the market, with analysts predicting a strong future for companies like Nvidia, AMD, and Broadcom. However, some experts, like Harvard’s Ken Rogoff, have warned that the AI stock boom could lead to a bubble. Meanwhile, Intel-backed companies like Astera Labs are also looking to capitalize on the AI boom, with plans to raise significant funds through an IPO. Read Next: Shiba Inu Pumps 13%, Dethroning Rival Dogecoin In One Important Trading Metric With ‘Burns Incoming’ Image Via Shutterstock Engineered by Benzinga Neuro, Edited by \nKaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}