{
    "title": "AMD A6-9220C vs AMD Athlon 300U vs AMD A9-9410",
    "date": "3/27/2024",
    "url": "https://www.notebookcheck.net/A6-9220C-vs-Athlon-300U-vs-A9-9410_11221_11201_8181.247596.0.html",
    "text": "The AMD A6-9220C is an entry-level chip from the Stoney-Ridge APU series for Chromebooks (7th APU generation from 2016), which was announced early 2019. Compared to the A6-9220, the 9220C is rated at a reduced TDP of 6 versus 15 Watt and also reduced clock speeds. It integrates two CPU cores (one Excavator module with 2 integer and on FP unit) clocked between 1.8 - 2.7 GHz (versus 2.5 - 2.9 GHz on the A6-9220). \nArchitecture \nStoney Ridge is the successor of the Carrizo architecture and the design is almost identical. Thanks to optimized manufacturing processes and more aggressive Boost behavior, however, the clocks are a bit higher at the same power consumption. The memory controller now also supports DDR4-RAM, in this case up to 2133 MHz. Stoney Ridge is the designation for the smaller dual-core and single-core chip, while Bristol Ridge is the bigger quad-core chip with dual-channel memory controller. More technical details are available in the following articles:AMD's Bristol Ridge and Stoney Ridge ArchitectureAMD: Bristol Ridge APUs announcedPerformance \nBecause of the significantly lower clock speed, the A6-9220C should be noticeably slower than the old A6-9220. AMD compares the performance against the Pentium N4200 in ChromeOS and sees the A6-9220C clearly ahead. The efficiency should be worse however, due to the old manufacturing process. \nGraphics Card \nThe integrated Radeon R4 (Stoney Ridge) GPU is a bit controversal, as AMD states 3 compute cores which should translate to 192 shaders. \nPower Consumption \nAMD specifies the TDP of the A6-9220C with 6 Watts which should enable thin and light (even fanless) Chromebooks. The AMD A6-9220C is an entry-level chip from the Stoney-Ridge APU series for Chromebooks (7th APU generation from 2016), which was announced early 2019. Compared to the A6-9220, the 9220C is rated at a reduced TDP of 6 versus 15 Watt and also reduced clock speeds. It integrates two CPU cores (one Excavator module with 2 integer and on FP unit) clocked between 1.8 - 2.7 GHz (versus 2.5 - 2.9 GHz on the A6-9220). Architecture Stoney Ridge is the successor of the Carrizo architecture and the design is almost identical. Thanks to optimized manufacturing processes and more aggressive Boost behavior, however, the clocks are a bit higher at the same power consumption. The memory controller now also supports DDR4-RAM, in this case up to 2133 MHz. Stoney Ridge is the designation for the smaller dual-core and single-core chip, while Bristol Ridge is the bigger quad-core chip with dual-channel memory controller. More technical details are available in the following articles: Performance Because of the significantly lower clock speed, the A6-9220C should be noticeably slower than the old A6-9220. AMD compares the performance against the Pentium N4200 in ChromeOS and sees the A6-9220C clearly ahead. The efficiency should be worse however, due to the old manufacturing process. Graphics Card The integrated Radeon R4 (Stoney Ridge) GPU is a bit controversal, as AMD states 3 compute cores which should translate to 192 shaders. Power Consumption AMD specifies the TDP of the A6-9220C with 6 Watts which should enable thin and light (even fanless) Chromebooks. The AMD Athlon 300U is a mobile entry level dual core SoC that was announced in January 2019. It combines two Zen cores (with SMT / Hyperthreading so running 4 threads) clocked at 2.4 - 3.3 GHz with a Radeon RX Vega 3 graphics card with 3 CUs (192 Shaders) clocked at up to 1000 MHz. Specified at 15 Watt TDP, the SoC is intended for thin mid-range laptops. It is quite similar to the AMD Ryzen 3 3200U (2.6 - 3.5 GHz). \nCompared to the Picasso APUs of the Ryzen 3000 series, the Athlon 300U is still based on the first generation of the 2000 series. Only the PRO variant is based on the new Zen+ microarchitecture that should lead to a 3% IPS (performance per clock) improvement. \nThe integrated dual-channel memory controller supports up to DDR4-2400 memory. As the features of the Picasso APUs are the same compared to the Raven Ridge predecessors, we point to our Raven Ridge launch article. \nIn contrast to the faster quad-core Picasso APUs, the Athlon 300U only supports 3 instead of 4 displays in total. \nPerformance wise, the Athlon 300 should be slightly slower than the Ryzen 3 2200U (2.5 - 3.4 GHz Dual Core with SMT). The AMD Athlon 300U is a mobile entry level dual core SoC that was announced in January 2019. It combines two Zen cores (with SMT / Hyperthreading so running 4 threads) clocked at 2.4 - 3.3 GHz with a Radeon RX Vega 3 graphics card with 3 CUs (192 Shaders) clocked at up to 1000 MHz. Specified at 15 Watt TDP, the SoC is intended for thin mid-range laptops. It is quite similar to the AMD Ryzen 3 3200U (2.6 - 3.5 GHz). Compared to the Picasso APUs of the Ryzen 3000 series, the Athlon 300U is still based on the first generation of the 2000 series. Only the PRO variant is based on the new Zen+ microarchitecture that should lead to a 3% IPS (performance per clock) improvement. The integrated dual-channel memory controller supports up to DDR4-2400 memory. As the features of the Picasso APUs are the same compared to the Raven Ridge predecessors, we point to our Raven Ridge launch article. In contrast to the faster quad-core Picasso APUs, the Athlon 300U only supports 3 instead of 4 displays in total. Performance wise, the Athlon 300 should be slightly slower than the Ryzen 3 2200U (2.5 - 3.4 GHz Dual Core with SMT). The AMD A9-9410 is an entry-level chip from the Stoney-Ridge APU series for notebooks (7th APU generation), which was announced mid 2016. At its launch, the A9-9410 is the fastest Stoney Ridge processor (dual-core version of Bristol Ridge) and integrates two CPU cores (one Excavator module with 2 integer and on FP unit) clocked between 2.9-3.5 GHz. It also includes a Radeon R5 GPU with 192 shaders at 800 MHz as well as a single-channel DDR4-2133 memory controller, H.265 video engine and chipset with all I/O ports. \nArchitecture \nStoney Ridge is the successor of the Carrizo architecture and the design is almost identical. Thanks to optimized manufacturing processes and more aggressive Boost behavior, however, the clocks are a bit higher at the same power consumption. The memory controller now also supports DDR4-RAM, in this case up to 2133 MHz. Stoney Ridge is the designation for the smaller dual-core and single-core chip, while Bristol Ridge is the bigger quad-core chip with dual-channel memory controller. More technical details are available in the following articles:AMD's Bristol Ridge and Stoney Ridge ArchitectureAMD: Bristol Ridge APUs announcedPerformance \nThanks to the high maximum clock of up to 3.5 GHz, the single-core performance should be pretty good. The multi-core performance on the other hand is much lower compared to the Bristol Ridge models. Compared to older Carrizo-L/Beema quad-cores, the APU should still perform pretty well. The level of performance should be similar to a Core-m3 and therefore also be sufficient for more demanding applications. \nThe TDP can be configured between 10-25 Watts, so there can be big performance differences under sustained workloads. \nGraphics Card \nThe integrated Radeon R5 (Stoney Ridge) GPU has 192 active shader units (3 compute cores) clocked at up to 800 MHz. More details about the GPU are available in the linked articles above.  \nPower Consumption \nAMD specifies the TDP of the A9-9410 with 15 Watts, but it can be configured between 10-25 Watts. This means the CPU is a good choice for thin and light notebooks, but also 15-inch devices with better cooling capabilities. The AMD A9-9410 is an entry-level chip from the Stoney-Ridge APU series for notebooks (7th APU generation), which was announced mid 2016. At its launch, the A9-9410 is the fastest Stoney Ridge processor (dual-core version of Bristol Ridge) and integrates two CPU cores (one Excavator module with 2 integer and on FP unit) clocked between 2.9-3.5 GHz. It also includes a Radeon R5 GPU with 192 shaders at 800 MHz as well as a single-channel DDR4-2133 memory controller, H.265 video engine and chipset with all I/O ports. Architecture Stoney Ridge is the successor of the Carrizo architecture and the design is almost identical. Thanks to optimized manufacturing processes and more aggressive Boost behavior, however, the clocks are a bit higher at the same power consumption. The memory controller now also supports DDR4-RAM, in this case up to 2133 MHz. Stoney Ridge is the designation for the smaller dual-core and single-core chip, while Bristol Ridge is the bigger quad-core chip with dual-channel memory controller. More technical details are available in the following articles: Performance Thanks to the high maximum clock of up to 3.5 GHz, the single-core performance should be pretty good. The multi-core performance on the other hand is much lower compared to the Bristol Ridge models. Compared to older Carrizo-L/Beema quad-cores, the APU should still perform pretty well. The level of performance should be similar to a Core-m3 and therefore also be sufficient for more demanding applications. The TDP can be configured between 10-25 Watts, so there can be big performance differences under sustained workloads. Graphics Card The integrated Radeon R5 (Stoney Ridge) GPU has 192 active shader units (3 compute cores) clocked at up to 800 MHz. More details about the GPU are available in the linked articles above. Power Consumption AMD specifies the TDP of the A9-9410 with 15 Watts, but it can be configured between 10-25 Watts. This means the CPU is a good choice for thin and light notebooks, but also 15-inch devices with better cooling capabilities. #0 checking url part for id 11221 +0s ... 0s #1 checking url part for id 11201 +0s ... 0s #2 checking url part for id 8181 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.038s ... 0.039s #6 did output specs +0s ... 0.039s #7 getting avg benchmarks for device 11221 +0.002s ... 0.041s #8 got single benchmarks 11221 +0.006s ... 0.047s #9 getting avg benchmarks for device 11201 +0.002s ... 0.05s #10 got single benchmarks 11201 +0.009s ... 0.059s #11 getting avg benchmarks for device 8181 +0.002s ... 0.061s #12 got single benchmarks 8181 +0.009s ... 0.07s #13 got avg benchmarks for devices +0s ... 0.07s #14 min, max, avg, median took s +0.214s ... 0.284s #15 return log +0s ... 0.284s "
}