{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.ept.ca/2024/03/keysight-amd-break-barriers-to-redefine-benchmarking-for-cloud-and-edge-infrastructure-performance/",
    "text": "EP&T Magazine \t\t\t\t\t   March 6, 2024 Solution tests mobile and 5G private network performance with millions of concurrent devices establishing simultaneous voice, video, and web sessions in real-world scenarios Keysight Technologies, Inc. leveraged 4th generation AMD EPYC CPUs from Advanced Micro Devices, Inc. to develop an industry first benchmarking methodology that redefines the landscape of system performance evaluation for high-speed digital designers, network equipment manufacturers and data centre operators. The deployment of mobile and 5G private networks is expected to grow rapidly across many industries as part of their automation and digital transformation strategy. This diverse set of industry use cases requires a versatile compute architecture that can simultaneously support millions of low-latency, high-bandwidth devices, and a multifaceted workload profile. Given this transformation, comprehensive infrastructure benchmarking is critical to ensure optimal performance across a spectrum of industry use cases. 4th generation AMD EPYC CPUs from Advanced Micro Devices Inc. “5G mobile network operators worldwide are facing an unprecedented demand for bandwidth. This consistent growth of data traffic volume requires scalable and effective benchmarking solutions to accurately measure user experience,” said Raghu Nambiar, corporate vice-president, data center ecosystems and solutions, AMD. “Our collaboration with Keysight demonstrates the ability of AMD EPYC CPUs to deliver impressive parallel processing performance to handle these high volumes of data traffic.” To provide more realistic performance benchmarks, Keysight in collaboration with AMD developed an integrated test case methodology that takes into account the processing power of central processing units (CPUs). Using realistic traffic emulation, this novel approach enables data center operators to extract more performance from a chosen CPU and to characterize the performance across multiple vectors while adhering to bandwidth requirements. The methodology was developed by deploying Keysight’s software tools onto AMD EPYC™ processors to conduct staged test cases with realistic traffic at scale. “Single dimension benchmarking methodologies like throughput are insufficient for data center operators to properly design and deploy their compute infrastructure. New performance benchmarking is needed in the modern mobile and 5G private networks. When used, it highlights the prowess of the AMD ‘Zen 4’ chiplet architecture to meet complex demands in those networks,” said Ram Periakaruppan, vice president and general manager, network test & security solutions, Keysight.  Intel launches standalone FPGA company – Altera\nU of Waterloo researchers create powerful, miniaturized antenna\nTech leaders say ‘BlackBerry’ movie doesn’t ring true\nDuke researchers are engineering carbon-based semiconductors\nElectric vehicles enter ‘next phase’: Gartner "
}