{
    "title": "AMD stock is down 15% from its 52-week high, and here's why you should buy \nit - THE BHARAT EXPRESS NEWS",
    "date": "3/29/2024",
    "url": "https://thebharatexpressnews.com/amd-stock-is-down-15-from-its-52-week-high-and-heres-why-you-should-buy-it/",
    "text": " Advanced micro devices (NASDAQ: AMD) The share price hit a 52-week high on March 8, but the chipmaker’s shares have fallen more than 15% since then, even though there has been no significant company-specific development in the meantime. Naturally reports that China is reportedly planning to replace chips from AMD and AMD Intel of Chinese government servers and personal computers (PCs) did briefly weigh on the stock price, but even that shouldn’t be a major problem for AMD in the long run.  This is why. Table of Contents AMD reportedly gets 15% of its total revenue from selling its chips to China.  Any sanctions on the sale of its chips in that country could therefore have consequences for AMD’s financial situation.  However, the dynamics of the semiconductor market are such that even if AMD cannot sell its chips in China, the company will have other options to sell them. For example, sales of both servers and PCs are expected to grow significantly worldwide thanks to the adoption of artificial intelligence (AI).  PC sales fell just 2.7% year over year in the fourth quarter of 2023, compared to the 14% decline for the full year.  The market will witness a sea change in 2024, driven by a new cycle of innovation in the enterprise and education markets, as well as the advent of AI-enabled PCs. Market research firm Canalys estimates that 48 million AI PCs could be shipped this year, accounting for 18% of the total market.  Furthermore, the supply of AI PCs could grow 44% annually through 2028 and account for 70% of the total market.  Canalys also points out that AI PCs will likely command a 10% to 15% premium compared to traditional machines. AMD therefore has the opportunity to increase both volumes and average selling price (ASP) of central processing units (CPUs).  It’s also worth noting that AMD has taken market share from Intel in the PC market.  According to Mercury Research, the company held 20.2% of the client CPU market in the fourth quarter of 2023, compared to 17.1% in the same period a year ago. The story continues Mercury Research attributed the market share gains to AMD’s early move into the AI ​​PC market with its Ryzen 7040 processor.  Meanwhile, AMD claims its CPUs power more than 90% of AI PCs on the market today.  So, stronger demand for AI PCs will give AMD’s client processor business a nice boost. Something similar will likely unfold in the server CPU and GPU (graphics processing unit) markets.  AMD ended 2023 with control of 23% of the server CPU market, compared to 17.6% in the same period a year ago.  AMD CEO Lisa Su noted during the latest conference call that the company is witnessing “robust demand for EPYC server CPUs among cloud, enterprise and AI customers.” AMD also added that “a growing number of customers are adopting EPYC CPUs for workload offloading.”  The good part is that the momentum of AMD’s server CPUs will continue as the AI ​​server market is predicted to see 26% annual growth through 2029.  On the other hand, AMD also saw stronger-than-expected demand for its AI GPUs.  . AMD raised its full-year revenue forecast from data center GPUs to $3.5 billion from its previous estimate of $2 billion.  However, management made it clear on the earnings call that the company could very well surpass this milestone thanks to an improving supply chain that will help meet the additional demand.  All of this suggests that AMD is well-positioned to beat analyst expectations in the coming quarters. When AMD announced its fourth quarter 2023 results on January 30, 2024, the company midway through expected revenues of $5.4 billion for the first quarter of 2024. That would be nearly equal to revenues of $5.35 billion in the same period last year.  Additionally, AMD’s non-GAAP (generally accepted accounting principles) gross margin guidance of 52% for the current quarter would be a slight improvement over last year’s 50%. AMD’s revenue and profit could therefore rise slightly in the first quarter.  However, analysts expect AMD to post quarterly revenue of $5 billion, which is lower than the company expected.  Additionally, consensus estimates predict a decline in AMD’s earnings to $0.55 per share, compared to $0.60 per share a year ago. However, there is a good chance that AMD can exceed market expectations by a large margin due to the multiple AI-related tailwinds discussed above.  The good thing is that AMD’s decline has made the stock cheaper than before.  This is evident from the graph: AMD PE ratio (forward) chart AMD now trades at 49 times forward earnings and has a price-to-sales ratio of less than 13. Earlier this month, the company traded at more than 57 times forward earnings and 15 times revenue.  Smart investors might consider using this decline to accumulate AMD stock, as the aforementioned growth drivers could help the company regain its mojo, and the turnaround could start as early as next month when it reports its first-quarter 2024 results announces. Should you invest €1,000 in advanced micro-devices now? Consider the following before buying shares in Advanced Micro Devices: The Motley Fool stock advisor The analyst team has just identified what they think is the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them.  The ten stocks that survived the cut could deliver monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including portfolio building guidance, regular analyst updates and two new stock picks per month.  The Stock Advisor service has more than tripled the return of the S&P 500 since 2002*. View the 10 stocks *Stock Advisor returns March 25, 2024 Harsh Chauhan has no position in any of the stocks mentioned.  The Motley Fool holds positions in and recommends Advanced Micro Devices.  The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short May 2024 $47 calls on Intel.  The Motley Fool has a disclosure policy. AMD stock is down 15% from its 52-week high, and here’s why you should buy it.  originally published by The Motley Fool Save my name, email, and website in this browser for the next time I comment.   Δ "
}