{
    "title": "AMD Says Its Driver-Based Frame Generation Will Apply Pressure to Nvidia",
    "date": "1/12/2024",
    "url": "https://www.extremetech.com/gaming/amd-says-its-driver-based-frame-generation-will-apply-pressure-to-nvidia",
    "text": "The never-ending battle between AMD and Nvidia has become a two-front war, encompassing hardware and software. While the quality of drivers has always played a factor in customers' purchasing decisions, upscaling and frame generation are also beginning to play a significant role in the GPU market. Nvidia has been in the lead on that front, with AMD playing catch-up. However, now that AMD is on the cusp of releasing its driver-based frame generation technology, it says its move could also force Nvidia to open up its software. At CES this year, an AMD rep spoke to PCGamer about the upcoming launch of its frame generation software. The company is officially taking its \"fluid motion frames\" technology out of preview on January 24th, allowing it to be used by any Radeon GPU—including on CPUs with integrated graphics. This is a starkly different approach than Nvidia has taken, as it has stated its frame generation technology is only possible on its newest 40-series GPUs due to their hardware features. Game developers must code its upscaling solution and frame generation into the game itself, whereas AMD's version will work on almost any game. According to AMD's Aaron Steinman, a Radeon product manager, its move could force Nvidia to reconsider its strategy thus far. \"I would be curious to know if Nvidia feels now they have to match what we've done in making some of these solutions driver-based,\" Steinman said. He continued, \"I think what we're gonna start seeing, DLSS is only available on certain solutions, so either Nvidia is going to have to benefit from our solution because we did make it open-source and cross-vendor, or they're probably going to need to do something similar.\" One recent example of how this has been playing out is several high-profile AAA games have launched recently without support for DLSS (and therefore, frame generation). Those titles include heavy hitters like Bethesda's Starfield and the new Avatar game. Nvidia gamers were forced to use AMD's FSR upscaling instead of DLSS, but that wouldn't be an issue if Nvidia supported the technologies in the GPU drivers as AMD does. The way it works now is Nvidia only supports certain versions of its upscaling technology on specific GPU generations, with its best version—DLSS 3—only supported by 40-series GPUs, which are also the only cards that can do frame generation. The big caveat with Nvidia's approach is the game developer has to implement it into the game, which limits which titles can provide those benefits to Nvidia GPU owners. AMD's approach is certainly more consumer-friendly, but Nvidia would argue its implementation is superior since it's coded into the game instead of being a catch-all solution with varying success across many titles. Interestingly, modders have already begun toying with AMD's frame generation on older Ampere GPUs with mods, and the results have been promising. We seriously doubt any of this will cause Nvidia to deviate from its course, but this week's Super GPU launch seems to indicate it heard its customers and changed its pricing strategy, so you never know what the future may hold. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}