{
    "title": null,
    "date": "1/25/2024",
    "url": "https://www.guru3d.com/story/amd-ryzen-9000-series-new-rumors-on-technical-specifications-and-release-window/",
    "text": "Published 2024-01-25 09:13 by Hilbert Hagedoorn Analyst and tech YouTuber High Yield has provided a comprehensive breakdown of the Ryzen 9000 series, enhancing the understanding of its specifications and narrowing down its anticipated release period to between April and June 2024. This places the Ryzen 9000 in a competitive position against Intel's forthcoming Core Ultra 200 series, challenging the previously speculated release timeline. Key specifications of the Ryzen 9000 series include: Notably, the Ryzen 9000 series will continue the use of an \"on-package chiplet design,\" similar to its predecessors, which allows for a scalable core count while enhancing performance metrics such as IPC. The series is also anticipated to support DDR5-6400 RAM, in line with the internal memory controller specifications. AMD's roadmap may include the introduction of the Ryzen 9000X3D variant, featuring the Zen 5 architecture with an added 3D V cache, targeting enhanced gaming performance. Although confirmation is pending, this move could strengthen AMD's position against Intel. Potential future developments within the Zen 5 architecture lifecycle include a transition to more advanced manufacturing processes such as N3, N3E, or N3P, starting with the N4 process. Both TSMC and Samsung are being considered for the production of future Ryzen CPUs. Regarding the integrated graphics processing unit (iGPU), it is suggested that the Ryzen 9000 desktop processors might continue with the RDNA 2 architecture without transitioning to RDNA 3.5. This decision is unlikely to significantly impact desktop processor performance and will maintain the provision of 28 PCIe 5th generation lanes. Further details are anticipated as the series nears its launch window.  Share this content\n\n\n Twitter\n                                \n\n\n Facebook\n                                \n\n\n Reddit\n                                \n\n\n WhatsApp\n                                \n\n\n Email\n                                \n\n\n Print ASUS Launches Updated ROG MAXIMUS Z790 HERO EVA-02 Evangelion Edition Motherboard NVIDIA RTX Video HDR: Enhancing SDR Content with AI-Powered HDR Conversion Copyright ©1997-2024 guru3dPowered by Contentteller® CMS System "
}