{
    "title": "AMD drops Radeon RX 7900 XT price to $749, ASRock and other models already \n$709.99 on Newegg",
    "date": "1/17/2024",
    "url": "https://www.tweaktown.com/news/95640/amd-drops-radeon-rx-7900-xt-price-to-749-asrock-and-other-models-already-709-99-on-newegg/index.html",
    "text": "As part of a \"special promotional pricing program\" for select retail outlets this quarter, AMD is dropping the Radeon RX 7900 XT price to $749 USD or lower - over $100 less than the current retail price. Compared to the 7900 XT's launch price of $899, the massive discount makes it a tasty option for gamers and creators looking for high-end 4K-ready performance. ASRock Phantom Gaming Radeon RX 7900 XT 20GB GDDR6 and other models down to under $710 USD. Even though AMD advised us that the program is being rolled out now with promotional prices to be reflected in the coming days, these big discounts are already up on Newegg. The ASRock Phantom Gaming Radeon RX 7900 XT 20GB GDDR6 looks to be the cheapest at $709.99, with additional models from XFX, SAPPHIRE, and PowerColor all currently available for $709.99 or $719.99 with a $20 off promo code. Check out the full list later in this article. It's not hard to see why AMD has slashed prices on at least one high-end Radeon RX 7000 Series GPU - NVIDIA is launching three brand-new cards this month, with the first out this week. Per our review of the new GeForce RTX 4070 SUPER Founders Edition, NVIDIA's RTX 40 Series refresh is shaping up to be impressive by increasing performance without increasing prices. And the GeForce RTX 4070 Ti SUPER is right around the corner, launching on January 24. In the press release for the Radeon RX 7900 XT price cut, the company notes that for 4K gaming, when it comes to pure performance (no upscaling or ray-tracing), the 7900 XT is faster than the current RTX 4070 Ti in titles like Call of Duty: Modern Warfare III, GTA V, Starfield, Hogwarts Legacy, Cyberpunk 2077, and Resident Evil 4. Of course, the GeForce RTX 4070 Ti is about to be replaced by the new RTX 4070 Ti SUPER - so it remains to be seen how NVIDIA's latest stacks up against the Radeon RX 7900 XT. The Radeon RX 7900 XT is a 4K gaming card with a generous 20GB of GDDR6 memory. Here are the deals that we've found so far on Newegg. AMD also confirms that the AMD Radeon RX 7900 GRE for system integrators is dropping in price to $549 USD and lower, a card closer to the Radeon RX 7800 XT in performance. If you pick up either before January 30, 2024, you can still get that free copy of Avatar: Frontiers of Pandora. Price cuts aren't the only Radeon thing on the menu. On January 24 the company is set to launch the new mainstream Radeon RX 7600 XT with 16GB of VRAM and launch AMD Fluid Motion Frames, AMD Radeon Super Resolution (RSR), and AMD Radeon Boost as part of the driver-based AMD HYPR-RX suite - opening the door to frame generation in all DirectX 11 and 12 games for RDNA 2 (Radeon RX 6000 Series) and RDNA 3 (Radeon RX 7000 Series) owners. Kosta Andreadis Kosta is a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}