{
    "title": "More games add AMD FSR 3 support, with the list more than doubling since \n2024 began",
    "date": "1/24/2024",
    "url": "https://www.tweaktown.com/news/95718/more-games-add-amd-fsr-3-support-with-the-list-than-doubling-since-2024-began/index.html",
    "text": "AMD launched FSR 3 alongside the debut of the Radeon RX 7700 XT and Radeon RX 7800 XT last year, with support for the company's Frame Generation update available in two games at the time: Forspoken and Immortals of Aveum. That was back in September 2023, and with the next games to get FSR 3 support arriving in December 2023, it's no secret that FSR 3 adoption heading into 2024 was non-existent. FSR 3 support has arrived in Call of Duty, image credit: Activision Now, it's worth noting that December 2023 saw FSR 3 arrive in Ubisoft's Avatar Frontiers of Pandora, a visually stunning title that also debuted an updated and improved version of FSR 3 technology, showcasing noticeably better results than what was seen in Forpsoken and Immortals of Aveum. So much so that its platform-agnostic approach to Frame Generation, much like its approach to Super Resolution upscaling, was embraced by Avatar players using Radeon RX and GeForce RTX cards alike. And now, as 2024 kicks off (with AMD launching a brand-new GPU in the form of the Radeon RX 7600 XT), FSR 3 support in games is heating up. As of writing, FSR 3 with Frame Generation is available in 9 games. Sure, it's not a massive list, but 5 out of 9 added FSR 3 support in January 2024. FSR 3 is still on the cards for big titles like Cyberpunk 2077, Starfield, Space Marine 2, Frostpunk 2, Black Myth: Wukong, Crimson Desert, Like a Dragon: Infinite Wealth, and more. With Avatar showcasing real progress and promise for AMD's non-AI approach to Frame Generation, support seems to be added to many more titles this year. FSR 3 still has a long way to go to catch up to DLSS 3, but seeing the momentum is great. Kosta Andreadis Kosta is a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}