{
    "title": "AMD releases even more Ryzen 5000 CPUs, keeps its last-gen AM4 platform \nalive",
    "date": "1/8/2024",
    "url": "https://arstechnica.com/gadgets/2024/01/amd-releases-even-more-ryzen-5000-cpus-keeps-its-last-gen-am4-platform-alive/",
    "text": "Front page layout Site theme Andrew Cunningham\n    -    Jan 8, 2024 3:30 pm UTC AMD announced the first Ryzen 8000 desktop processors today: a new lineup of socket AM5 CPUs that bring RDNA 3 integrated GPUs and an AI-accelerating NPU to its desktop platform for the first time. But the company also spent some time on new budget chips for its last-generation AM4 platform. The four new Ryzen 5000 processors cover everything from budget office desktops with integrated GPUs to cost-conscious gaming systems. At the top of the range is the Ryzen 7 5700X3D, an 8-core CPU with an extra 64MB slab of L3 cache stacked on top of the main CPU die. At $249, it will be a little over $100 cheaper than the 5800X3D, but with the same core count, cache size, and a slightly lower maximum clock speed (4.1 GHz, down from 4.5 GHz). AMD compared it favorably to the Core i5-13600K in gaming workloads, a chip that currently retails for a bit over $280. The Ryzen 7 5700 is a $175 8-core processor without 3D V-Cache that should still perform reasonably well in most workloads, though AMD's spec sheet says that it has less cache than the 5700X and only supports PCI Express 3.0 instead of PCIe 4.0. This indicates that the 5700 is actually a 5700G with the integrated graphics disabled; it will be a bit slower than the Ryzen 5700X, despite their similar names, core counts, and clock speeds. The Ryzen 5 5600GT and 5500GT are 6-core chips with Vega-based integrated graphics, both intended for lower-end systems. At $140 and $125, they're both potential alternatives to the existing Ryzen 5 5600G. The new chips are the latest in a surprisingly long line of last hurrahs. Early 2022 brought us some new budget processors and the Ryzen 5800X3D, just a few months before the AM5 platform launched. And in mid-2023, AMD released a limited-edition Ryzen 5600X3D for people who could get to a local Micro Center store and buy one (as of this writing, a quick spot-check of several east coast Micro Centers showed that 5600X3D chips were still broadly available at that price). It's hard to recommend that anyone building a new PC go with the socket AM4 platform at this point—even these \"new\" chips are still using the old Zen 3 architecture and are broadly similar to older products that have been available since late 2020. But they're still decent cost-efficient upgrade options for people who already have an AM4 motherboard that they use with a Ryzen 1000, 2000, or 3000 processor; if you upgrade from a Ryzen 1000-series chip, it will also help your PC meet Windows 11's official system requirements, if that's something you care about. \"AM4 continues to be a key part of our product portfolio,\" AMD PR Manager Matthew Hurwitz told Ars when asked why AMD was still releasing new Ryzen 5000 CPUs. \"New SKUs give users more options to fit their budget or use case.\" Hurwitz also told us that, unlike the 5600X3D, there would be no availability limitations for any of these new Ryzen 5000 chips. The company also doesn't immediately plan to discontinue any other Ryzen 5000 CPUs that are still being sold, though \"there is always a natural shift from older to newer SKUs as time passes.\" These new-old chips will all be available to purchase starting on January 31. We can at least be thankful that, unlike AMD's laptop CPUs, the model numbers of these processors aren't changing just because of the year they were released. Update 1/9/2024: AMD initially said that the Ryzen 5 5500GT was a 4-core CPU; it's actually a 6-core CPU. We've updated the article accordingly. Listing image by AMD Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox. Sign me up → CNMN Collection\n  WIRED Media Group\n  © 2024 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 1/1/20) and Privacy Policy and Cookie Statement (updated 1/1/20) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights |  Do Not Sell My Personal Information\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices "
}