{
    "title": "AMD’s stock riding ‘AI-winner trade’ toward first new record close in 25 \nmonths",
    "date": "1/18/2024",
    "url": "https://www.marketwatch.com/story/amds-stock-riding-ai-winner-trade-toward-first-new-record-close-in-25-months-30f4c085",
    "text": "Advanced Micro Devices Inc. shares were on pace to close at an all-time high Thursday, which would mark the name’s first new record finish in more than 25 months. Shares of AMD \n        AMD,\n        +0.50%\n       were up 3.1% $165.20 shortly after Thursday’s open, amid a broader rally in semiconductor names on the heels of Taiwan Semiconductor Manufacturing Co.’s \n        TSM,\n        -0.47%\n       upbeat outlook. The stock’s current record close of $161.91 came Nov. 29, 2021. TSMC’s revenue forecast for the current quarter was better than the midpoint of the range of expectations, and executives offered some upbeat long-term commentary about artificial-intelligence chips. See more: TSMC earnings offer optimism for chip sector amid upbeat forecast TSMC, which manufactures chips for AMD and many others, expects that AI chips could make up a high-teens percentage of its revenue in 2027, according to Bernstein analyst Mark Li, who noted that this is ahead of the company’s prior expectation for a low-teens contribution. “Across semis, expect a further wave of buying in AMD, NVDA, MRVL on AI-winner trade,” Mizuho desk-based analyst Jordan Klein wrote in a Thursday morning note to clients. Nvidia Corp. shares \n        NVDA,\n        +0.12%\n       were up 1.9% toward a record close shortly after Thursday’s open, while Marvell Technology Inc.’s stock \n        MRVL,\n        -1.98%\n       was ahead 4.2% at a 21-month high. The PHLX Semiconductor Index \n        SOX\n       was up 2.8%, and was approaching the Dec. 27 record close of 4,214.59. Even before TSMC’s report, AMD’s stock was feeling some love, as Cowen & Co. analyst Matthew Ramsay turned more bullish overnight, upping his price target to $185 from $130. The company’s MI300 chip, focused on AI applications, is “poised for material growth/upside,” according to Ramsay. “We came away from the company’s official MI300 launch in December with more conviction that the MI300 portfolio should position the company for long-term growth in AI computing,” he wrote. The MI300 is emerging as an “increasingly capable” alternative in the generative AI market, Ramsay noted. Nvidia is overwhelmingly the market leader here. See also: If Nvidia looked more like Salesforce, it might unlock billions more in cash, analyst says Copper is an essential component for power infrastructure upgrades. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}