{
    "title": "AMD Ryzen 7 8700G desktop APU leak confirms 2.9 GHz Radeon 780M RDNA3 \ngraphics",
    "date": "1/3/2024",
    "url": "https://videocardz.com/newz/amd-ryzen-7-8700g-desktop-apu-leak-confirms-2-9-ghz-radeon-780m-rdna3-graphics",
    "text": "AMD is expected to launch a brand new AM5 series soon.   AMD Ryzen AM5 8000G desktop CPU (mockup), Credit: Expreview  Just a day after discussing the leak regarding the Ryzen 5 8600G, a midrange APU from the upcoming desktop series, we are now shown the performance of a faster Ryzen 7 8700G SKU. In contrast to the 8600G’s configuration of 6 cores and 12 threads, the 8700G steps up with a full spec of 8 Zen4 cores and 16 threads. Tests conducted on ASUS TUF X670E-PLUS motherboards with the AM5 socket reveal the APU’s capabilities when paired with 32GB of DDR5-4800 desktop memory. The Geekbench entry discloses a 4.2 GHz base clock and a 5.1 GHz boost clock for the APU. In other words, this means a boost of 400 to 500 MHz over the current fastest desktop APU still available in the market, the Ryzen 7 5700G, which features 8 Zen3 cores.   AMD Ryzen 7 8700G specs, Source: Geekbench  The Ryzen 8000G series brings more than just a CPU microarchitecture upgrade. In addition to the updates to CPU processing power, the integrated graphics subsystem is receiving a boost as well, transitioning from the dated Vega graphics to the latest RDNA3. This change, which skips two generations of RDNA, will make AMD desktop APUs much faster. Leaked details reveal that the Ryzen 7 8700G APU will feature Radeon 780M graphics with 12 Compute Units, boasting a boost clock of 2.9 GHz. The lower thermal and power constraints in the desktop form factor should make it easy to increase the frequency above 3.0 GHz, though. Benchmark results, conducted using Geekbench OpenCL and Vulkan APIs, show 29244 and 35427 points, respectively. In comparison to Phoenix-based mobile APUs using the same specs, performance is within the margin of error. It should also easily be twice as fast as Ryzen 7 5700G “RX Vega 8” integrated graphics, but it is worth keeping in mind that synthetic benchmarks may not reflect gaming performance. For those, it’s best to wait for independent reviews to appear, which should hopefully happen soon. Source: Geekbench (Vulkan), (OpenCL) We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}