{
    "title": null,
    "date": "1/31/2024",
    "url": "https://wccftech.com/amd-ryzen-8000g-hawk-point-apus-now-available-for-am5-platform-8700g-329-8600g-229-8500g-179/",
    "text": "AMD has officially launched its Ryzen 8000G APU family for AM5 platforms which come in Ryzen 7 8700G, Ryzen 5 8600G & Ryzen 5 8500G flavors. AMD has officially launched four APUs for the AM5 Desktop PC platform which utilize a monolithic Zen 4 processor and RDNA 3 graphics core package and are compatible with any AM5 socketed motherboard on the market. Three of the four APUs will be offered to DIY consumers in the start. You can find the retail links below (includes affiliates): Newegg (US): B&H Photo (US): Starting with the specifications, the AMD Ryzen 8000G \"Hawk Point\" APU lineup includes a total of four SKUs which include the Ryzen 7 8700G, Ryzen 5 8600G, Ryzen 5 8500G, and Ryzen 3 8300G. At a bird's eye view, these APUs are technically the same on an architectural level but the 8500G and the 8300G are a hybrid combination of Zen 4 and Zen 4C cores for entry-level desktop PCs with an aggressive control over power. The AMD Ryzen 7 8700G is the top Hawk Point APU, featuring 8 cores, 16 threads, 16 MB of L3, and 8 MB of L2 cache. This chip has a base clock of 4.2 GHz and a boost clock of 5.1 GHz and has a TDP of 65W. The chip features the Radeon 780M iGPU with 12 compute units clocked at 2900 MHz, the fastest clock yet on an RDNA 3 integrated graphics chip. The APU will be priced at $329 US. Moving on, we have the AMD Ryzen 5 8600G which is a 6-core and 12-thread APU with 16 MB of L3 and 6 MB of L2 cache. This chip has a base clock of 4.3 GHz and a boost clock of 5.0 GHz with the same 65W TDP. The GPU is a Radeon 760M iGPU with 8 compute units clocked at 2800 MHz. The APU will be priced at $229 US. Next up, we have the AMD Ryzen 5 8500G which is another 6-core and 12-thread chip that makes use of that aforementioned hybrid configuration with 2 Zen 4 and 4 Zen 4C cores with a base clock of 3.5 GHz and a boost clock of 5.0 GHz. The chip also carries a total of 22 MB cache but the Radeon GPU is reduced to the Radeon 740M with 4 Compute Units clocked at 2700 MHz. Lastly, we have the Ryzen 3 8300G which is a 4-core and 8-thread chip with 1 Zen 4 and 3 Zen 4C cores. The chip features 12 MB of total cache, has a base clock speed of 3.4 GHz, and a boost clock speed of 4.9 GHz. It comes with a 65W TDP and the same Radeon 740M iGPU. The Ryzen 5 8500G will retail for $179 US while the Ryzen 3 8300G will be OEM only. Another feature of the top two AMD Ryzen 8000G \"Hawk Point\" APUs (8700G / 8600G) is that they are equipped with the same XDNA \"Ryzen AI\" NPU as the Ryzen 8040 series. This NPU is clocked at 1.6 GHz and offers a combined 39 TOPS of AI processing power with 16 TOPs coming directly from the NPU. Once again, this is a 60% increase over the Ryzen 7040's NPU which offered 10 TOPs. It's mentioned that the Ryzen AI enables over 100 AI experiences within Windows OS. The AMD Ryzen 8000G \"Hawk Point\" APUs including the Ryzen 7 8700G, Ryzen 5 8600G, and Ryzen 5 8500G are now available. Systems equipped with the Ryzen 3 8300G are also going to start appearing soon. As for users upgrading to the new chips, motherboard makers have already released new BIOS which come with full support for these chips. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}