{
    "title": "AMD to display advanced AI engines, elevated in-vehicle experiences at CES \n2024",
    "date": "1/5/2024",
    "url": "https://www.autocarpro.in/news-international/amd-to-display-advanced-ai-engines-elevated-in-vehicle-experiences-at-ces-2024-118527",
    "text": "The new Versal AI Edge XA adaptive SoC and Ryzen Embedded V2000A Series processor are designed to serve key automotive focus segments including infotainment, advanced driver safety and autonomous driving. Working alongside a growing automotive partner ecosystem. AMD has announced it will showcase automotive innovation at CES 2024, to be held in Las Vegas from January 9-11, and expand its portfolio with the introduction of two new devices, the Versal AI Edge XA adaptive SoC and Ryzen Embedded V2000A Series processor. Both are designed to serve key automotive focus segments including infotainment, advanced driver safety and autonomous driving. The AMD booth is located at LVCC West Hall #W319 at CES 2024. Versal AI Edge XA adaptive SoCs add an advanced AI Engine, enabling the devices to be further optimized for numerous next-generation advanced automotive systems and applications including: forward cameras, in-cabin monitoring, LiDAR, 4D radar, surround-view, automated parking and autonomous driving. Versal AI Edge XA adaptive SoCs are also the first AMD 7nm device to be auto-qualified, bringing hardened IP and added security to automotive applications where safety is paramount. Ryzen Embedded V2000A Series processors power the next-generation automotive digital cockpit, from the infotainment console to the digital cluster and passenger displays. The expansion of the AMD Ryzen Embedded V2000A Series brings the first x86 auto-qualified processor family to offer the same PC-like experience consumers have come to expect from home entertainment which they can now enjoy in-vehicle, on the go. “Our expanding and highly diversified AMD automotive portfolio presents a significant opportunity to serve this high-growth market while also underscoring the tremendous synergy of our combined automotive teams since the acquisition of Xilinx almost two years ago,” said Salil Raje, senior vice- president and general manager, Adaptive and Embedded Computing Group, AMD. “As we look ahead to 2024’s Consumer Electronics Show, we are excited to showcase our achievements working in collaboration with our ecosystem partners that will advance the future of the automotive industry.” Elevating AI engines with Versal AI Edge XA Versal AI Edge XA adaptive SoCs, equipped with AI engines offer many benefits for AI compute, vision and signal processing. Versal AI Edge XA adaptive SoCs can perform AI inference on large ingests of data, and can also be used in edge sensors, such as LiDARs, radars and cameras, or in a centralized domain controller. The AI Engines are capable of handling different types of AI models such as classification and feature tracking. This device portfolio ranges from 20k LUTs to 521k LUTs, and from 5 TOPs to 171 TOPs. Scalable across this product portfolio, designers can easily port their designs with the same tools, ecosystem and safety certifications. Versal AI Edge XA adaptive SoCs can accelerate high-performing AI compute applications, while providing safety and security features and advance automotive designs. The first devices will be released early 2024, with further releases planned later in the year. Enhancing users’ in-vehicle experiences with Ryzen Embedded V2000A Advances in consumer electronics have raised expectations for in-vehicle experiences (IVX). Entertainment, connectivity, workplace on wheels and safety are becoming important factors that influence consumer decisions, which is what led AMD to launch the new AMD Ryzen Embedded V2000A Series processor. This auto-grade device enables carmakers to deliver impressive performance and multitasking for infotainment and IVX systems so passengers can stay connected on the go. Built on innovative 7nm process technology, ‘Zen 2’ cores and high-performance AMD Radeon Vega 7 graphics, the AMD Ryzen Embedded V2000A Series processor provides a new class of performance. It delivers high-definition graphics, with enhanced security features and automotive software enablement through hypervisors in addition to support for Automotive Grade Linux and Android Automotive. AMD will be showcasing its broad range of automotive solutions in conjunction with ecosystem partners. Demonstrations include In-Vehicle Experience, AI Optimized Real-time Multi-sensor Object Detection, Automated Parking, Display Expansion, LiDAR, 3D Surround View, Driver Monitoring, and more. Participating automotive ecosystem partners include BlackBerry, Cognata, ECARX, Hesai, Luxoft, QNX, QT, Robosense, SEYOND, Tanway, Visteon and XYLON.  Autocar Pro News Desk \r\n                                                    \n\n29 Mar 2024 This evolution is part of the broad transformation process denoted Direzione Cor Tauri, the strategy that embodies Lambo... Autocar Pro News Desk \r\n                                                    \n\n28 Mar 2024 Open S32 CoreRide platform combines processing, vehicle networking and system power management with integrated software ... Autocar Pro News Desk \r\n                                                    \n\n28 Mar 2024 Japanese automaker aims to acquire cutting-edge electric technology in the premier EV race series. This multi-year partn... This specially curated 56-pager issue offers a review of the key events in the a... Will the recently announced electric vehicle EV policy provide the necessary impetus for the Indian market? Will the recently announced electric vehicle EV policy provide the necessary impetus for the Indian market? Yes 64.06% No 35.94% Latest Auto Industry updates and News Articles Get all the latest updates from the automobile universe "
}