{
    "title": "AMD's New Ryzen 7 5700X3D & More AM4 CPUs, APU 8700G, 8600G, 8500G, & 8300G \nSpecs | GamersNexus",
    "date": "1/22/2024",
    "url": "http://gamersnexus.net/cpus-news/amds-new-ryzen-7-5700x3d-more-am4-cpus-apu-8700g-8600g-8500g-8300g-specs",
    "text": "AMD's New Ryzen 7 5700X3D & More AM4 CPUs, APU 8700G, 8600G, 8500G, & 8300G Specs   January 18, 2024 Last Updated: 2024-01-22 The Highlights AMD has a ton of CPU news coming out of CES. There are multiple new AM4 processors, including the R7 5700X3D, new 8000G desktop APUs for AM5, and 8040 mobile parts. Let’s get into it. We’ll start with the new AM4 CPUs. AMD announced the Ryzen 7 5700X3D and noted the 5700 non-X, non-3D will launch to DIY (it’s already been out in OEM systems), and it also announced the 5600GT and 5500GT. Editor's note: This news item was originally published on January 8, 2024 as a video. It has been adapted into a full article without changes. Steve Burke Vitalii Makhnovets Jimmy Thang These were expected only because there were leaks a few months ago about them, but generally speaking, we all kind of assumed that the 5600X3D would be the final AM4 entry considering the age of the platform. AM4 technically launched in 2016 and received its first Ryzen CPUs in 2017, meaning that the platform is still getting new processors now 8 years later, or 7 if you just start at Ryzen. That is actually completely insane and is the longest-lived socket we have ever seen in GN's testing tenure. The 5700X3D is an 8C/16T part that runs at 4.1GHz boost and 3.0GHz base, with 100MB of cache and a 105W TDP. Jumping over to the 5800X3D specs, they’re overall similar: The 5800X3D is an 8C/16T part with a 105W TDP and likewise 100MB of combined L2 and L3 Cache, at 4MB and 96MB. The difference is clock speed, where the 5800X3D ran at 3.4GHz base and 4.5GHz boost. That means it’s about 400MHz faster than the 5700X3D. It’s basically a 5800X3D but slower. MSRP is $250. How much that clock reduction will impact performance will depend on the application: Something that doesn’t utilize the extra cache at all and is also largely single-threaded will benefit disproportionately from the 400MHz boost. Something fully engaging all threads at the boost frequencies might also post a departure, like Blender, but it depends on the all-core boost frequency. We noticed recently that the 5800X3D was starting to jump in price in a few places as third-party sellers overtook listings that were running dry. Depending on if that’s permanent and if AMD will continue making 5800X3Ds, it might be the case that the 5700X3D will replenish that segment to hold prices down a little longer. At time of the pre-briefing, AMD did not provide any first-party gaming comparisons against the 5800X3D. The comparisons were against the 13600K, but they looked to align roughly with a 5800X3D. The AMD Ryzen 7 5700 CPU isn’t new and has been available in OEM systems, but AMD is now selling it as a boxed processor with an included Wraith Spire cooler. As a refresher, the 5700 is an 8C/16T part with 20MB of cache (no 3D cache), a 65W TDP, and a base and boost of 3.7GHz and 4.6GHz, respectively. For reference, the 5700X runs at 3.4GHz base and 4.6GHz boost, but has 32MB of L3 and 4MB of L2. It also has Gen4 PCIe support, whereas the R7 5700 stops at PCIe Gen3. It is more comparable to a 5700G, just without the integrated graphics. AMD noted that the price will be $175 MSRP for the 5700. Finally in the AM4 lineup, AMD announced the 5600GT and 5500GT. These are 6C/12T parts with 19MB of cache and a 65W TDP, per AMD’s definition of TDP. They also include IGPs. Boost is 4.6GHz for the 5600GT and 4.4GHz for the 5500GT. We’ll show AMD’s first-party charts for these: Compared to the existing 5600G, AMD presents the 5500GT as equal or marginally better, depending on application. Another slide shows the 5600GT vs. the 5600G. It’s similar here, just with a higher ceiling for the relative comparison. The biggest gaming improvement was in PUBG. These CPUs will ship for $140 for the 5600GT and $125 for the 5500GT. We’re excited to see that this platform is being kept alive. Remember that the world outside of major markets like North America and Europe often ends up on slightly older platforms as a matter of cost. Keeping parts coming into the market will help other areas of the world with cost control and keep up with modern components which, from a market-share standpoint, will help AMD grow in regions where Intel has long been the primary option. Let’s move to AMD’s new 8000G APUs. AMD announced four new desktop APUs for AM5 today: These are the 8700G, 8600G, 8500G, and 8300G. The 8700G is an 8C/16T part that boosts up to 5.1GHz and has 24MB of cache. Its TDP is 65W. The AMD 780M integrated graphics processor is included, which is an RDNA3 part with 12 CUs. The 8000G series supports up to PCIe Gen 4. The 8600G drops to 6C/12T and 5GHz boost, with a predictable cache reduction aligned with core reduction. The 760M replaces the 780M here, dropping to 8 CUs from 12. That’ll be the more notable impact, as it’ll be uncommon for anyone using the IGP instead of a dGPU to be CPU-bound in games with this solution. The 8500G is a 6C/12T part also boosting to 5GHz, hosting 22MB of cache, and dropping to a 740M part. The 740M has only 4 CUs. Finally, the 8300G will be an OEM part for now and is a 4C/8T APU boosting to 4.9GHz and hosting 12MB of cache. It also uses a 740M. As an important note, the core configuration isn’t consistent across these. AMD’s names are confusing, but it was at least forthcoming with the difference. The 8700G and 8600G APUs use Zen 4 architecture, whereas the 8500G uses a mix of Zen 4 and Zen 4c, with 4 cores on Zen 4c. The 8300G has 3 cores on Zen 4c and 1 on Zen 4. Zen 4c cores have a smaller areal footprint than Zen 4 cores and sacrifice clock frequency and L3 cache per core. The APUs will support AMD’s Fluid Motion Frames, so frame generation will help boost framerate in borderline scenarios. We’ll briefly show some first-party claims. Remember that benchmarks will evaluate all of this soon enough. AMD’s 780M and 8700G benchmarks at 1080p/low ran at 63FPS in Cyberpunk 2077, 68 in Valhalla, and 165 in Dota 2. These APUs are generally best paired with games like Dota, League, Rocket League, or similar titles that are commonly called “eSports games.” AMD also showed its 8700G and 8600G solutions against the 14700K, all running their IGPs. AMD is claiming significant advantages in most cases, with parity in the case of Far Cry. We’ll validate this in our review. The most interesting tests for APUs are normally the cheapest possible dGPU + CPU solution. We’ll probably look into a few combinations, like a 12100F at $100 plus the best GPU that fits in the same comparison budget at time of launch. Let’s move to AMD’s last CPU announcement of the show. AMD is also launching its 8040 mobile solutions. We won’t spend much time here as our coverage of mobile is currently limited to handheld systems, and some of these are nearly the same as the 7000 predecessors aside from the Neural Processing Unit (NPU). AMD’s big change here is its addition of more local AI processing power with a dedicated NPU for handling AI workloads. We don’t cover these benchmarks right now and aren’t familiar enough with them to provide meaningful rebuttal or support of claims, so we’ll leave that topic to more AI-centric outlets. On the gaming side, the big one is the R7 8840U with a 780M graphics solution. The 7840U also had a 780M, and actually, these parts are basically the same other than the AI processing capabilities. If you’re choosing between the two, unless you have some sort of local AI workload that you want to run on a mobile part, you can basically consider them the same. Copyright © 2023 GamersNexus, LLC. All rights reserved.GamersNexus.net is Owned, Operated, & Maintained by GamersNexus, LLC. Copyright © 2023 GamersNexus, LLC. All rights reserved.GamersNexus.net is Owned, Operated, & Maintained by GamersNexus, LLC. "
}