{
    "title": "AMD’s New Ryzen 8000 APUs Are Faster Than Many Graphics Cards In Games",
    "date": "1/10/2024",
    "url": "https://www.forbes.com/sites/antonyleather/2024/01/10/amds-new-ryzen-8000-apus-are-faster-than-many-graphics-cards-in-games/",
    "text": "AMD's new APUs have powerful onboard graphics that rivals some of the most popular graphics cards AMD has announced four new Ryzen 8000 APUs at the CES event in Las Vegas this week, which are desktop processors with powerful onboard Radeon RDNA 3 graphics and they' re so powerful there's faster than many popular discrete graphics cards in Steam's Hardware Survey such as the Nvidia GeForce GTX 1650. The new Ryzen 7 8700G, Ryzen 5 8600G, Ryzen 5 8500G and Ryzen 3 8300G feature new AMD Radeon 700-series graphics and according to AMD's own figures, the flagship Ryzen 7 8700G will be faster at 1080p gaming in many titles than an Nvidia GeForce GTX 1650, which currently sits as the second most popular discrete graphics card in Steam's Hardware Survey. AMD has announced three new Ryzen 8000 desktop APUs that include powerful RDNA 3 graphics The new APUs have a TDP of 65W so will be easier to cool than AMD's more powerful Ryzen 7000 CPUs. Available from January 31, they include four, six and eight-core models with the flagship eight-core, 16-thread Ryzen 7 8700G boasting the most powerful graphics. The quartet of new APUs also use the same Zen 4 architecture as its Ryzen 7000 processors, so will be particularly quick in and out of games. It's worth noting they also need DDR5 memory and a motherboard that supports Socket AM5 CPUs if you're thinking of upgrading - they're not compatible with AMD's older Socket AM4. Still, the asking price of $329 for the Ryzen 7 8700G is around $50 less than the GTX 1650 and Coire i5-13400F that it paired with it in the benchmarks, while the AMD chip's eight cores and 16 threads saw it perform much better than the Intel CPU outside of games too. The Steam Hardware Survey currently puts the GTX 1650 as the second most popular graphics card in ... [+] users' systems Above we can see the Nvidia RTX 3060 is the most popular graphics card according to the December 2023 Steam Hardware Survey followed closely by the GTX 1650. It might be several generations old, but its popularity and the fact it, plus a good processor will set you back more than the cost of a single Ryzen 8700G means that AMD's new APUs could be good options for budget gaming systems, especially as you can house them in a small case with modest cooling and power requirements. AMD's APUs are faster than some of the most popular graphics cards Above we can see that the AMD Ryzen 7 8700G closely matches the Core i5-13400F and GTX 1650 in games and is significantly faster in three of the titles show too. There's nothing stopping you upgrading in future with a separate graphics card either, so as well as a good budget gaming option, the new APUs allow for a gentler upgrade path if need a frame rate boost in games down the line. The new APUs follow in the footsteps of the Ryzen 7000 series including the recent Ryzen 7000 X3D models with 3D V-Cache such as the popular Ryzen 7 7800X3D. AMD is also expected to release its new Zen 5-based CPUs later this year, which will be compatible with its current processor socket.  "
}