{
    "title": "New top management at AMD",
    "date": "1/29/2024",
    "url": "https://www.defenceweb.co.za/industry/industry-industry/new-top-management-at-amd/",
    "text": "The South African Aerospace, Maritime and Defence Industries Association (AMD) has new top management, with a new acting chairperson in place until mid-year. Nombasa Ndhlovu, the Chairperson of AMD since June 2022, resigned late last year, after two years in the post. Before that, she had since 2020 served as Chairperson of the AMD National Conventional Arms Control Committee (NCACC) Task Team. Sandile Ndlovu, AMD CEO, thanked Ndhlovu for her dedication and the work she did while with AMD, especially facilitating NCACC export permits. Michelle Nxumalo has been appointed as AMD Deputy Chairperson, and will be acting Chairperson until AMD’s annual general meeting mid-year. Nxumalo is no stranger to the sector and has been instrumental to the South African defence industry, having previously served AMD for ten years. She was Marketing Manager and Exhibition Director for Africa Aerospace and Defence 2022. New leadership will be voted in at the AGM in June and an eminent Chairperson will be appointed. This will be someone not directly employed in the defence industry, in order to ensure an independent voice able to interact across political divides. Other management changes at the end of 2023 include the departure of Damian de Lange (Twiga) as Honorary Secretary, being replaced by Ratilal Rowji (Global Command and Control Technologies). Deon Olivier (Hensoldt) has left for the United Arab Emirates and been replaced as Deputy Chairperson and National Defence Industry Council (NDIC) representative. Isaac Motale (Tesame) has taken over from Olivier as NDIC representative. Big plans going forward AMD has big plans for 2024, and hopes to unlock the local defence and security budget as one of its priorities. 2024 is also an Africa Aerospace and Defence (AAD) year and AMD and its members will be actively supporting this and other events. Ndlovu said that as this is an election year, and the South African defence industry is a regulated sector, “our main priority for this year is to ensure that we mitigate against the instability that elections normally bring to our sector.” “Secondly, we intend to intensify our efforts of unlocking the local market for our sector. Aerospace and Defence is an Apex Sector, and this is according to the Aerospace and Defence Masterplan, and as such our products and solutions give life to most sectors of our economy. Because of this, we therefore have a responsibility to ensure that we unlock opportunities for our companies. “Lastly, we need to unify the entire sector. Currently we are fragmented and speak in multiple voices, so there is merit in us forging unity. AMD needs to champion the cause of unity so we can achieve greater impact,” Ndlovu said. AMD is putting its full weight behind AAD, supporting South African participation in DSA 2024 in Kuala Lumpur, Malaysia, and IDEX 2025 in Abu Dhabi, UAE, and hosting the Maritime related conference, Sovereign Security and Public Private Partnerships for Defence events locally. A new event (Defence and Security Townhall) aimed at political party input into defence and security is planned for before South Africa’s national elections. AMD is also pushing for the long-delayed Defence Industry Lekgotla to take place this year. Other priorities are supporting the South African defence industry through the promotion of exports and facilitation of National Conventional Arms Control Committee export processes. Ndlovu also emphasised AMD remains fully committed to supporting the SA defence industry’s main client, the South African National Defence Force (SANDF). “Our local clients remain our main reasons for existence, so it is imperative that we work with the SANDF to ensure that despite their budgetary constraints they are properly equipped and supported,” he said. “To this end, we will continue to engage with the SANDF to explore concepts such as ‘contracting for capability and contracting for availability’. If we can find each other within these two concepts we can get to a place where the private sector assumes the responsibility of raising the financial resources needed to maintain and replace SANDF prime mission equipment. “We acknowledge that traditional procurement methods are not going to assist us during these challenging times, and we also acknowledge that support, through budget increases, from National Treasury may not be forthcoming anytime soon. So within this context of our objective reality, we strongly believe that we need to think outside of the box to come up with creative solutions to the challenge that we face.” defenceWeb is Africa's largest and most trusted online source of news, information, research and insight on aerospace, defence and security matters. Editorial Enquiries: [email protected] Sales Enquiries: [email protected] First Name Last Name Email address: Country  "
}