{
    "title": "AMD Ryzen 5 8600G 'Hawk Point' APU Appears in Geekbench",
    "date": "1/2/2024",
    "url": "https://www.extremetech.com/gaming/amd-ryzen-5-8600g-hawk-point-apu-appears-in-geekbench",
    "text": "AMD notably didn't release any desktop APUs as part of its Zen 4 CPU platform in 2023. The only APUs it launched were for mobile, but it will rectify that situation in 2024. The company is prepping multiple budget-oriented 8000-series APUs, featuring Zen 4 CPUs and RDNA 3 graphics. The first benchmarks for these upcoming chips have appeared online, suggesting their launch could come as soon as next week's CES trade show in Las Vegas. The upcoming APUs will be badged as 8000G series chips, indicating they're 2024 models as opposed to the existing 7000-series, which are \"2023\" chips and mobile-only. AMD has adopted a somewhat controversial naming scheme for its CPUs, whereby the first number indicates the year, not the architecture. Regardless, the previous desktop versions of this series were 5000G models, which used Zen 3. The new Zen 4 version has now appeared in Geekbench, giving us the first confirmed specs on these upcoming APUs. They are designed for folks who need an affordable CPU with modest gaming power via integrated graphics. The chip that has appeared in the Geekbench database is the Ryzen 5 8600G, which features six CPU cores and 12 threads, along with Radeon 760M graphics. The CPU's benchmark shows a base clock of 4.35GHz and a boost clock of 5GHz, which is 450MHz and 600Mhz higher, respectively, than its Zen 3 predecessor, the 5600G. There are also significant changes on the GPU side of the equation as well, as the 760M has been rebranded as \"Radeon 5\" now, and surprisingly it has a 2.8GHz boost clock, or 900MHz higher than the previous chip's graphics. Videocardz notes the updated GPU features six RDNA 3 compute units (CU) even though the Geekbench listing says it has four compute units, so we're not sure why there is a discrepancy. This compares with the previous version's 7 Vega CUs, though, so it should be on a whole new level in performance because it uses the company's latest architecture. Another interesting tidbit of info from the online listing is that this midrange APU was tested on a high-end X670E motherboard from MSI, an unusual pairing. This indicates it was likely tested by a reviewer or MSI instead of being something internal to AMD, meaning it could be ready for launch soon. With CES right around the corner, it is not hard to do the math on this one. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}