{
    "title": null,
    "date": "1/4/2024",
    "url": "https://www.pcgamesn.com/amd/ces-2024-ai-presentation",
    "text": "AI is a looming cloud of inevitability, and following Nvidia's successful 2023, it's looking like Team Red wants to have its say on the matter. Niall Walsh Published: Jan 4, 2024 No, AI isn’t going anywhere. Following the Nvidia earnings report that effectively showed that it is no longer a gaming company, AMD is ready to follow suit with its CES presentation, heavily focused on AI in personal computers. CES 2024 is shaping up to be another important event for the tech industry. It brings together all branches of technology under one roof and sets the scene for what the future looks like with gaming brands like AMD, Nvidia, and Razer all attending this year. AMD has been absent from the CES schedule for some time, with eyebrows raised at how forward many other brands have been about their respective presentation plans. We now know that AMD’s presentation will take place on Monday, January 8 at 7 am PST. While I’m sure the topic of AMD’s presentation – “together we advance_AI” –  has nothing to do with the late reveal, it’s going to take place right before we expect Nvidia to reveal its latest RTX Super graphics card lineup. This could be quite jarring for anyone who was hoping for a gaming-focused approach to CES from Team Red, although gaming is expected to feature in a cameo appearance. Ultimately, the wonder of CES is often driven by the fact that it isn’t a show that shines a spotlight on just gaming, AI, or futuristic prototypes. It’s a show that celebrates every corner of the tech world, and AI is fast becoming a large part of the industry. As for the content of the AMD presentation, we have the following description to work with; “AMD is powering the end-to-end infrastructure that will define the AI era, from cloud installations to enterprise clusters, AI-enabled intelligent embedded devices and PCs. Join Dr. Lisa Su, AMD Chair and CEO, and Jack Huynh, Senior Vice President and DM of computing and graphics, as they talk about the future of AI in personal computers.” Looking at how AI can improve and integrate with personal computing is a very intriguing topic, and it’s refreshing to see AMD take a more personable approach to this presentation, rather than speaking at a much deeper level of computer architecture. While AI will dominate the conversation, there is still an expectation that we will learn more about the AMD Radeon 7600 XT, which is a nice tease to bring in the gaming audience. For all the latest CES news, we’ll have you covered including hands-on previews live from the show floor in Las Vegas. Niall Walsh                 As one of PCGN’s Hardware Editors, Niall is an expert in all things peripherals, meaning if you need to know what the best PC gaming headsets, controllers, keyboards, mice, or monitors are, he has you covered. Even if you just want to know which peripheral brand is better, Razer, Corsair, Logitech, or any other he can help there too. You will also find his words on sites such as; The Loadout, Wargamer, USA Today, MTG Rocks, GGRecon, and RealSport101. "
}