{
    "title": "AMD Stock Might Have Climbed Too Fast Again: Valuation Update",
    "date": "2/12/2024",
    "url": "https://seekingalpha.com/article/4669516-amd-stock-might-have-climbed-too-fast-again-valuation-update",
    "text": "Bloomberg/Bloomberg via Getty Images  Bloomberg/Bloomberg via Getty Images Having followed Advanced Micro Devices, Inc. (NASDAQ:AMD) closely since 2017, I've observed recurring cycles in the stock's trajectory. These cycles often follow a predictable pattern: initial skepticism from investors despite significant business advancements, followed by periods of exuberant growth where the stock surges rapidly, and then a subsequent correction to more sustainable levels. For instance, my previous analysis on AMD back in September 2023 claimed that the stock was in the first stage of accumulation and we were about to witness overdue growth in the stock price. Since then, AMD has surged 70% from $100 at the time of the analysis to $170 now. Data by YCharts Currently, it appears that we are in the midst of the second phase, where AMD's stock has soared to heights that may not be entirely justified by its recent progress in AI and data center offerings. As a result, cautious investors may want to exercise patience and await a potential pullback, allowing for a more prudent entry point and a greater margin of safety. Let's recap the main points from AMD's Q4 results and what was said during AMD's Q4 2023 earnings call to understand the nature of the stock's surge. Financially, AMD generated $6.2 billion in revenue in the fourth quarter, a 10% year-over-year growth. The growth was primarily driven by the Data Center and the Client segments, with AMD seeing a 38% and 62% year-over-year revenue increase, respectively. Here is some perspective on how AMD's two best-performing revenue segments have developed over time: Seeking Alpha Seeking Alpha Unsurprisingly, the focal point of Lisa Su's commentary was AMD's Data Center initiatives, particularly its AI portfolio. One of the positive points was that the Data Center GPU business had an especially strong performance that exceeded expectations, and the company saw a faster ramp for its MI300X AI accelerators. The robust adoption of this specific product signals a significant opportunity for AMD to capture market share, potentially tapping into Nvidia's (NVDA) remarkable growth driven by the rising adoption of generative AI. Now, AMD forecasts over $3.5 billion in revenue for the Data Center GPU segment in 2024, a notably high figure for the company given its historical emphasis on Data Center CPUs. Even in the first quarter of 2024, the company expects the Data Center GPU ramp to offset the seasonal decline in server sales, underscoring the significance of this projection for AMD's future financial performance. Hence, it appears that this news alone could have acted as a catalyst for the recent surge in the stock. Other important points mentioned during the earnings call: So overall, AMD continues to make significant progress in the AI and datacenter chip segments, gaining more partners, which should help the company grow its revenue consistently over the coming years. This is consistent with my Strong Buy thesis from September last year and adds to the market's excitement about the company. Despite these significant advancements and promising future, there is still a limit to how fast the stock can appreciate based on the company's underlying fundamentals. To delve into this, I updated my discounted cash flow, or DCF, model for AMD, incorporating the most recent data. To remind, my previous valuation exercise from the September article returned a fair price of approximately $130, which was 30% higher than the stock price at the time. Now, I've revisited the model based on the latest results and the company's comments. Here are the updated assumptions: 1. The average annual revenue growth over the horizon period of five years is now estimated to be around 22%, with a 14% increase in 2024, 30% increase in 2025, and 20-25% growth between 2026 and 2028, based on analysts' earnings estimates, AMD's guidance, and the expected growth of AI addressable market. 2. EBITDA margin is expected to remain within the range of 20-30% throughout 2028. This projection relies on a somewhat optimistic assumption that the company will attain stronger margins in the coming years, reaching levels comparable to 2021 when AMD boasted an EBITDA margin of approximately 25%. 3. Then goes the WACC. The after-tax cost of debt is 2.6% (using 13% tax rate), based on the latest earnings call commentary by AMD's CFO Jean Hu. The cost of equity capital (18.5%) is calculated using CAPM, with 1.6 beta, 4.1% risk-free rate, which is the current U.S. 10-year bond yield, and 9% market premium. The WACC is, therefore, estimated to be around 18.4%, down from the 20.3% estimated in my previous model, thanks to lower treasury yields and a reduced beta. Here is the operating and balance sheet data used in the modeling: The author's DCF model The author's DCF model As a result of these calculations, AMD's fair price range is now approximately $149-154, which is about 11% lower than the current stock price. Additionally, this yields a price target of approximately $180 by the end of 2024. Additionally, we can also compare AMD's valuation with its key competitor, Nvidia. Even in this comparison, when examining the 1-year forward P/E ratio for both companies (Nvidia's next fiscal year ends in January 2025 vs. December 2024 for AMD), AMD appears to be priced at a premium to Nvidia. Currently, Nvidia's 1-year P/E stands at around 35, while AMD trades at a 47 P/E for 2024. Furthermore, Nvidia has experienced EPS growth rates of 100-200% in the last two quarters, whereas AMD's growth has ranged within 4-10%. This indicates that Nvidia is more attractively priced relative to its growth, even after its substantial stock increase in the last year. As always, this analysis does not mean that AMD will necessarily drop to its fair valuation in the short term, particularly as the market seems to be overly enthusiastic about companies with AI exposure. Nonetheless, I would refrain from adding to my position at $170 due to an imbalanced risk/reward ratio at this level. Should AMD manage to achieve growth rates closer to 20% in 2024 (compared to the current estimate of 14%) and between 25-35% in subsequent years, the current stock price would be justified, potentially leading to a year-end target of approximately $205. A significant portion of this growth hinges on the performance of AMD's Data Center and Embedded segments, which together account for approximately half of the company's revenue. With the impending release of the Turin family of EPYC Processors, AMD aims to bolster its server CPU offerings, potentially catalyzing growth within these key segments. Furthermore, AMD's endeavors to integrate AI capabilities into client PCs could serve as a critical driver for higher-than-expected growth. As Ryzen CPUs already power over 90% of AI-enabled PCs on the market, according to the earnings call commentary by Lisa Su, the company's strong Ryzen AI CPU roadmap for the latter half of 2024 holds promise. By expanding its foothold in the AI-driven PC market and enhancing the capabilities of its Ryzen processors, AMD could capture a larger share of this burgeoning segment, potentially fueling accelerated revenue growth in the years ahead. As mentioned above, there is a general enthusiasm in the market for AI companies, particularly chipmakers like Nvidia, Arm Holdings (ARM), or even Intel (INTC), whose stocks have seen significant increases over the last year. Data by YCharts The earnings of the competitors have been mixed so far. Intel's Q4 results were higher than expected, but the outlook given by the company did not appear especially promising, with guidance falling short of expectations. Importantly for AMD, Intel reported a significant decrease of 10% in Data Center and AI revenue, which initially sparked pessimism among investors about whether AMD could be affected as well. However, since AMD continues to gain market share from Intel, the latter's setback seems to be the former's gain here. In contrast, Arm Holdings had a solid quarter and provided a generous full-year outlook. However, since the company's Arm chip architecture is different from the products developed by AMD, especially AMD's chips used for AI inference and training, the two companies do not compete directly against each other quite yet. So AMD's main competitor in the key AI areas remains to be Nvidia. The company reports its Q4 earnings on February 21, and it is estimated Nvidia will grow its revenue and EPS massively again, with revenue growth estimated to be a whopping 235%, continuing the winning streak. I do not expect significant surprises there, but we can try reading between the lines when the earnings are out to understand if we get any important insights that would be relevant for AMD. For instance, we could gain some signals about the general strength or weakness in the data center and AI market, which would define whether AMD can achieve its ambitious targets mentioned above. In general, I believe there is still room for several companies in the AI market given the enormous potential of the AI addressable market, which means if Nvidia raises its outlook, this could be a positive sign for AMD as well. Statista Statista Following AMD's consistent cycles of investor sentiment since 2017, where initial skepticism transitions into periods of rapid growth and subsequent corrections, the stock has surged significantly, propelled by recent advancements in AI and datacenter offerings. Particularly noteworthy is the impressive performance of the Data Center GPU business, signaling potential market share gains in the burgeoning AI landscape, akin to Nvidia's growth trajectory. Although AMD has made some positive progress, it's essential to be cautious about the stock valuation. My updated DCF model indicates a fair price range of $149-154, which is where I would add to my AMD position. However, the current excitement in the market about AI could still push stock prices higher than their actual worth. Investors should carefully weigh the risks and rewards for AMD stock, especially considering the recent jump to $170. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of AMD, NVDA, MSFT either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}