{
    "title": "Treatment with acetylcholinesterase inhibitors for Alzheimer's may reduce \nrisk for AMD",
    "date": "2/20/2024",
    "url": "https://www.healio.com/news/optometry/20240220/treatment-with-acetylcholinesterase-inhibitors-for-alzheimers-may-reduce-risk-for-amd",
    "text": "Acetylcholinesterase inhibitors used to treat Alzheimer’s disease may also reduce the risk for developing age-related macular degeneration, according to a cohort study of older veterans published in JAMA Ophthalmology. “Given the possibility that AD medications could limit pathological inflammatory processes and protect against both oxidative stress and microvascular damage in the eye, we hypothesized that patients with AD treated with AChEIs may have a lower risk of incident AMD,” S. Scott Sutton, PharmD, from the Columbia VA Health Care System, and colleagues wrote. Researchers conducted a retrospective cohort study of 21,823 veterans with Alzheimer’s disease (AD), aged 55 to 80 years, who were treated at Veterans Affairs health care facilities between January 2000 and September 2023. Participants had no preexisting diagnosis of AMD. The cohort included 12,847 participants treated for AD with the acetylcholinesterase inhibitors (AChEIs) donepezil, rivastigmine or galantamine, and 4,898 treated with memantine. The remaining participants were not treated. Both treated and untreated groups predominantly comprised white men. The treated group had lower average Charlson comorbidity burden and lower proportion of smokers and hypertension, but a higher rate of pure hypercholesterolemia. The untreated group had a higher median number of eye exams per year. According to a time-dependent Cox model, each additional year of AChEI treatment was associated with a 4% lower HR of AMD. After propensity-score matching, researchers reported that each additional year of treatment was associated with a 6% lower hazard of AMD. Variables associated with a higher HR of AMD included age, white race and other or unknown race. “This study adds to the growing body of literature examining non-AD outcomes of AChEIs,” Sutton and colleagues wrote. “AChEIs have been associated with several non-AD benefits, including reduced mortality, myocardial infarction and stroke risk, as well as slower progression of [chronic kidney disease]. While improving cognitive outcomes is the primary goal of therapy with AChEIs, these secondary benefits can play a significant role in the decision to treat or continue treatment.” Collapse Sutton SS, et al. JAMA Ophthalmol. 2024;doi:10.1001/jamaophthalmol.2023.6014. Read more about Play on Healio Follow Healio About Account Information Contact Us Legal Sign Up for Email Get the latest news and education delivered to your inbox The email address associated with your Healio account is:  If you would like to edit or change the email address that your subscriptions and alerts are sent to, use the \"Update email address\" link. "
}