{
    "title": "XFX Radeon RX 7900 GRE Review - Great GPU, Confusing Name",
    "date": "2/26/2024",
    "url": "https://www.tweaktown.com/reviews/10679/xfx-radeon-rx-7900-gre-great-gpu-confusing-name/index.html",
    "text": "The mid-range and enthusiast GPU market for PC gamers and users has been given a big shake-up in 2024, thanks to the arrival of NVIDIA's new GeForce RTX 40 SUPER Series and AMD launching (or re-launching) the Radeon RX 7900 GRE as a dedicated card starting from $549 USD. This puts its price $50 higher than the Radeon RX 7800 XT, on par with the GeForce RTX 4070, and $50 less than the new GeForce RTX 4070 SUPER. It's a surprising, welcome move from AMD - and a little strange. The confusion comes down to the naming and origins of the Radeon RX 7900 GRE, which launched in China and select global markets (for new builds only) in 2023 - months before the Radeon RX 7700 XT and Radeon RX 7800 XT hit the scene. The Radeon RX 7900 GRE, or Golden Rabbit Edition, represents a cut-down and more efficient version of the hardware in the flagship Radeon RX 7900 XT and RX 7900 XTX combo - a model that was never meant to sit on a shelf next to the Radeon RX 7900 XT and Radeon RX 7900 XTX. As a GPU that has been available for several months, it's something that has already been put through its paces - albeit not in an environment where the Radeon RX 7800 XT and GeForce RTX 4070 SUPER are seen as the main mid-range and enthusiast offerings from Team Red and Team Green. Based on what we saw in 2023, the Radeon RX 7900 GRE is considerably less powerful than the Radeon RX 7900 XT. However, it is drawing 260W compared to the 7900 XTX's 315W, and with its new $549 price point - it's considerably cheaper. This is where the surprising and exciting part comes in: the Radeon RX 7900 GRE represents excellent value - and for the most part, you get a noticeable performance increase compared to the Radeon RX 7800 XT. In fact, on average, the performance sits closer to the more expensive GeForce RTX 4070 SUPER - with the result being a card that is 4K-ready. The two have notable differences regarding ray tracing, efficiency, add-on upscaling, and frame generation features - more on this later. AMD released the Radeon RX 7900 GRE as a standalone product in 2024, which makes sense, especially with the recent SUPER refresh from NVIDIA, but you can't help but feel like it probably should have been renamed. It would have made more sense to rename it to the new Radeon RX 7800 XTX to better fit within the RDNA 3 line-up. Naming confusion aside, the Radeon RX 7900 GRE is available globally (from February 27, 2024), with this review covering a reference model from AMD partner XFX. Let's dig in. \"The world's first chiplet gaming GPU\" is how AMD described its new RDNA 3-based GPUs when it lifted the lid on the new Radeon RX 7000 Series. In layperson's terms, the GPU chip isn't just one big square or die anymore, with billions of transistors all arranged in a single layout. Like with its Ryzen CPU range, which embraced chiplet design to significant effect (look at how Ryzen has grown in popularity over the years), bringing this design philosophy into the GPU space felt like the natural evolution for AMD's Radeon brand. For RDNA 3, what was once a single Graphics Compute Die (GCD) has now split into a GCD plus a Memory Cache Die (MCD). The GCD still makes up most of the hardware grunt and uses the newer 5nm process technology - a step up from RDNA 2's 7nm process. Interestingly, the MCD uses 6nm process technology, which allows AMD to keep costs down as the complexity and cost of manufacturing high-end tech continue to rise. And to mitigate any performance impact that could arise from going the chiplet route, AMD has also managed to include the \"fastest chiplet interconnect in the world,\" with speeds of 5.3 TB/s. That said, the Radeon RX 7600 entry-level models using the 'Navi 33' GPU follow a more traditional single-chip setup using 6nm process technology to help keep costs down. But with the same RDNA 3 architecture. AMD's groundbreaking chiplet design can be found in the 'Navi 32' and 'Navi 31' GPUs - Radeon RX 7700 XT, 7800 XT, 7900 GRE, 7900 XT, and 7900 XTX. AMD's RDNA 3 architecture also features second-generation AMD Infinity Cache, another CPU-like feature designed to boost performance in 1440p and 4K gaming - a \"bandwidth amplifier\" that sits alongside the GDDR6 memory interface. It helps alleviate the need for more expensive and power-hungry memory buses and is one of those forward-thinking designs we love seeing. RDNA 3 also represents a leap forward for AMD regarding ray-tracing and AI accelerators. RDNA 3 GPUs feature the second generation of dedicated RT hardware and new hardware-based AI acceleration. Real-time ray tracing is hardware intensive; this is one area many were looking for AMD to improve compared to RDNA 2. Which, admittedly, was the company's first attempt at hardware-based ray tracing. RDNA 3 GPUs are the first graphics cards supporting the new DisplayPort 2.1 spec. The latest DisplayPort interface supports up to 4K 480Hz and even 8K 165Hz, which makes it more of a future-proofing measure than something applicable today. But the real benefit comes with 12-bit HDR support and full Rec2020 coverage for improved color accuracy and detail. RDNA 3 also introduces hardware-based AV1 encoding to step up its video game for content creators, which means better quality video using the same bitrate. Very cool. For gamers, the introduction of AMD FSR 2 and FSR 3 (with frame generation) is fully supported here and helps improve performance in intensive games. FSR 2 and FSR 3 support might not be as widespread as NVIDIA DLSS, but its addition to more games in 2024, like Starfield, is an excellent sign. In-game FSR support should grow as time passes. AMD's frame generation technology extends beyond FSR 3 to the driver-based AMD Fluid Motion Frames, which can be enabled in thousands of games via AMD's Adrenaline Software control panel - as part of the new HYPR-RX suite. Although image quality and overall stability aren't quite up to the level of FSR 3 or DLSS 3 (which, as integrated solutions, benefit from raw game data), by opening the door to frame generation in all titles - it's an exciting and notable inclusion to the Radeon line-up. And one that will continue to grow and evolve. Ultimately, RDNA 3 is an impressive leap forward for AMD, bringing massive changes to the underlying hardware while delivering a sizable performance leap over the previous RDNA 2 generation. Here, we can see how the specs and hardware stack up for the AMD Radeon RX 7900 GRE compared to the AMD Radeon RX 7800 XT and 7900 XT. Overall performance for the Radeon RX 7900 GRE sits somewhere in between the Radeon RX 7800 XT and the 7900 XT; however, the Radeon RX 7900 GRE shares the same 'Navi 31' silicon as the flagship Radeon RX 7900 XT and Radeon RX 7900 XTX combo. There are notable differences, with the big one being a cut to the overall power draw to 260W - similar to the Radeon RX 7800 XT but 17.5% lower than the Radeon RX 7900 XT's 315W power draw. The other notable difference comes with the memory configuration: 16GB of GDDR6 on a 256-bit bus compared to 20GB of GDDR6 on a 320-bit bus, which is 20% less VRAM but enough for high-end 1440p and 4K gaming in 2024. Throw in a 6.5% decrease to boost clock speeds and around 5% fewer Stream Processors, Compute Units, and Ray Accelerators, and the overall performance (as mentioned) sits in between the Radeon RX 7800 XT and Radeon RX 7900 XT. That said, the price point makes the Radeon RX 7900 GRE as attractive of an enthusiast offering as the Radeon RX 7800 XT - while outperforming the similarly priced GeForce RTX 4070 in raw performance. The Radeon RX 7900 GRE becomes a strange release in the 2024 RDNA 3 line-up from AMD because it's more efficient than the Radeon RX 7800 XT regarding price to performance or performance to watt. To the extent where setting aside that it's using a heavy cutdown flagship Navi 31 GPU, it feels like a 'better' version of the Radeon RX 7800 XT. However, there are some oddities to the design - the memory bandwidth is a little slower than the Radeon RX 7800 XT and with lower clock speeds and lower power usage compared to the Radeon RX 7900 XT. So there's not a lot of OC potential here, at least from what we can see. But in terms of how it fits into the RDNA 3 line-up, although the price matches the GeForce RTX 4070, the performance sits closer to NVIDIA's impressive GeForce RTX 4070 SUPER. Weirdly, the XFX Radeon RX 7900 GRE review unit we received doesn't have any branding in line with the company's MERC or QICK models - it's called the XFX Radeon RX 7900 GRE. Based on the look, we can tell that the overall physical design and make-up align with XFX's QICK models. Personally, this is the first XFX GPU I've reviewed, and it's been great going hands-on with one with a brand that I've only seen from afar until now. The XFX Radeon RX 7900 GRE is, in essence, a reference design with the company's 'Speedster series' minimal and modern aesthetic that includes three large fans, a dual BIOS switch, and a vented aluminum backplate. There's no fancy ARGB action or a lot of branding outside of 'Radeon' and 'XFX.' It's a minimal look-through and through. Compared to most triple-fan enthusiast-grade GPUs, the XFX Radeon RX 7900 GRE is compact with a 2.5 or so slot thickness and an overall lightweight build that should sit comfortably in most PC cases. The cooling here is more than sufficient, and when in use, the XFX Radeon RX 7900 GRE is a quiet performer - however, with lower clock speeds and slower memory than the more expensive Radeon RX 7900 XT, there's probably no real need to go all out with chunky cooling. Overall, it's a clean and minimal design that blends into a build versus something that stands out. The aluminum backplate and quality of the materials are impressive for a reference or baseline model priced according to the MSRP set by AMD. In 2023, PC gaming is a complicated and varied space, from indie games to major blockbuster releases and titles that push hardware and technology to their limit with the adoption of effects like real-time ray-tracing. This is all a way of saying that the 15 in-game benchmarks we've chosen (run at 1080p, 1440p, and 4K) represent a wide range of styles, not only in terms of genres, like first-person shooters and racing games, but also in the API technology (DirectX 11, 12) and cutting-edge features like ray tracing and upscaling technology. Results include DLSS and FSR 2, where possible, as both technologies are the sorts of things, especially in 1440p and 4K, which you'd turn on. Six of the 15 game benchmarks also feature ray tracing. Also, each title is set to ultra-equivalent quality settings to push GPU hardware and minimize CPU bottlenecks at higher resolutions. Also, it's just fun to max out a game's visual settings and see the results. Here's the breakdown of games, graphics settings, and what's being tested. The XFX Radeon RX 7900 GRE is a powerful enthusiast-grade GPU designed for high refresh-rate 1440p and 4K gaming - so it's not exactly something you'd consider for 1080p. Naturally, it has no issue at this resolution, with the outcome being the sort of performance that sets the tone for a high-end PC gaming product. The 174 FPS average is on par with the GeForce RTX 4070 SUPER (however, individual results vary from title to title) while being 10.8% faster than the similarly priced GeForce RTX 4070. Across our 15-game benchmark suite, the XFX Radeon RX 7900 GRE is also 11.5% faster than the Radeon RX 7800 XT, on average, while being 8.4% slower than the Radeon RX 7900 XT. For those wondering, yes, ray-tracing is still an area where RDNA 3 falls behind, and for the Radeon RX 7900 GRE, even though non-RT Cyberpunk 2077 1080p performance is impressively 15.8% faster than the GeForce RTX 4070 SUPER, it's 22.1% slower when you turn on ray-tracing using the Ultra setting. Radeon GPUs fare better when ray-tracing effects are kept to a minimum, like in Forza Horizon 5 or F1 22 - but struggle to keep up in titles like Cyberpunk 2077 and Alan Wake II. Okay, with the Radeon RX 7800 XT being an excellent option for 1440p gaming, the XFX Radeon RX 7900 GRE is even better - delivering an average 13.9% faster performance at this resolution. With its $549 price on par with the GeForce RTX 4070, 1440p performance is 14.9% faster than NVIDIA's offering, with the 131 FPS average being on par with the more expensive GeForce RTX 4070 SUPER. There are titles where the XFX Radeon RX 7900 GRE crushes at this resolution, even outperforming the GeForce RTX 4080 SUPER when it comes to Call of Duty: Modern Warfare II. For the most part, raw 1440p gaming performance across our 15-game benchmark suite (without DLSS or FSR upscaling) is on par with the GeForce RTX 4070 SUPER. It's slightly faster in many cases - which might be one of the reasons why AMD has decided to release the Radeon RX 7900 GRE globally with a $549 price tag. When it comes to 1440p gaming, the double-digit improvement over the Radeon RX 7800 XT is in line with the price difference between these two cards - and if an extra $50 is something you could manage, there's an argument to make for picking this up over the Radeon RX 7800 XT. Compared to the GeForce RTX 4070 or the GeForce RTX 4070 SUPER, it's a slightly different story as you'd need to weigh up NVIDIA's lead when it comes to ray-tracing and DLSS popping up in most game releases in 2024. In my review of the GeForce RTX 4070 SUPER, it was clear that the performance uplift over the GeForce RTX 4070 and the Radeon RX 7800 - two cards that are somewhat evenly matched - made it a decent option for 4K gaming. It is not at the level of a Radeon RX 7900 XT or a GeForce RTX 4070 Ti SUPER, but it is enough to offer 60 FPS in many games with detailed settings cranked. The 71 FPS 4K gaming average for the XFX Radeon RX 7900 GRE makes it 10.9% faster than the Radeon RX 7800 XT and 12.7% faster than the GeForce RTX 4070 - with the overall result being slightly slower than the GeForce RTX 4070 SUPER. Here, there are only a handful of titles where there's a big difference between the XFX Radeon RX 7900 GRE and the GeForce RTX 4070 SUPER - with the card once again outclassing the competition in Call of Duty and non-RT Cyberpunk 2077 but falling behind in RT titles like DOOM Eternal, Hitman, and RT Ultra Cyberpunk 2077. 4K is a resolution where upscaling makes the most impact, with FSR 2 delivering decent image quality and offering free performance in titles where available. The list of FSR 2 and FSR 3 supported titles continues to grow - which is great to see - however, there are many more titles out in the wild with DLSS. That said, having 16GB of VRAM versus the 12GB of the GeForce RTX 4070 and GeForce RTX 4070 SUPER is a plus and something that might help future-proof the Radeon RX 7900 GRE better in the long run. Synthetic benchmark time, and the first test on the menu, is the tried and true 3DMark FireStrike, a benchmark that has been around for years that runs on the again but still relevant DirectX 11 API. Highlighted above are the scores for the 1440p 3DMark FireStrike Extreme test, where the XFX Radeon RX 7900 GRE scores 8.2% higher than the Radeon RX 7800 XT and 10% higher than the GeForce RTX 4070 SUPER. For the current generation of AMD and NVIDIA GPUs, 3DMark FireStrike favors the former, so you're not looking at an accurate representation of in-game Radeon versus GeForce performance. There are titles and workloads where this result represents what to expect, but taken as an overall view of performance, these benchmarks are only a good indicator of what to expect across the RDNA 3 line-up. 3DMark TimeSpy is the next synthetic benchmark on the menu, with this test covering DirectX 12 performance. The baseline 3Dmark TimeSpy test covers the 1440p resolution, with the results more in line with what we saw across our 15-game benchmark average. The XFX Radeon RX 7900 GRE score is on par with the GeForce RTX 4070 SUPER while being 5.8% higher than the Radeon RX 7800 XT. That's a little lower than the double-digit average we found when gaming but indicative of the bigger picture - the Radeon RX 7900 GRE is faster than the Radeon RX 7800 XT but also notably slower than the Radeon RX 7900 XT. The final synthetic benchmark we will look at is 3Dmark Port Royal, which tests ray-tracing performance. Ray-tracing is an area where AMD and Radeon are a step behind the competition, and here we see the GeForce RTX 4070 SUPER pull ahead. Interestingly, the XFX Radeon RX 7900 GRE scores 6% higher than the similarly priced GeForce RTX 4070 - and it's a result that you can see in titles with minimal ray-tracing effects enabled, like Forza Horizon 5 and F1 22. Ray-tracing is also the realm of upscaling, frame generation, and new image enhancement technology - so even though performance might be a bit faster, the image quality might not be at the same level. The XFX Radeon RX 7900 GRE is an excellent 1440p performer and delivers when it comes to 4K gaming in many titles. Raw performance aside, AMD's Radeon RX 7900 GRE also benefits from FSR 2 upscaling in many titles. When enabling the technology at 1440p and 4K using the Quality setting, image quality is - for the most part - excellent, offering that free performance uplift you love to see. Interestingly, as FSR 2 and other upscaling technologies deliver better image quality at higher resolutions - they become invaluable when gaming on enthusiast GPUs like the Radeon RX 7900 GRE. Although AMD debuted FSR 3 and its version of frame generation with the Radeon RX 7700 XT and Radeon RX 7800 XT late last year, it's taken a while for developers to put it in games - with only a handful of FSR 3 supported titles available as we headed into 2024. The good news is that it looks to be changing, with the number of FSR 3 games doubling in January and February 2024, with more on the way. FSR 3 frame generation might not be as impressive or ubiquitous as NVIDIA's AI-powered DLSS 3, but like FSR 2, it's platform agnostic. The results are immediate and worth trying in titles like Ubisoft's Avatar and Bethesda's Starfield. Frame Generation is not the same as raw performance; additional latency and latency reduction must ensure a game still feels great to play - which is thankfully the case for two of the three titles highlighted here. Starfield at 4K with FSR 3 upscaling and frame generation delivers a 2.3X increase to perceived performance, and Avatar Frontiers of Pandora sees a massive 3.2X increase, while Forspoken sees a 2.6X increase. Forspoken is the older title to add FSR 3, and maybe using an older version of the tech is why the result doesn't look or feel as impressive as Starfield or Avatar. AMD has another slice of frame generation called AMD Fluid Motion Frames, which is driver-based and works with essentially every game you think of - and it's very promising. It offers a performance uplift similar to FSR 3. The trade-off for being available in every title is that performance and image stability aren't at the same level as FSR 3. Still, with AMD committed to improving the tech in the months and years to come, AFMF could become a killer feature for the Radeon GPU line-up. With similar power usage as the Radeon RX 7800 XT, the Radeon RX 7900 GRE delivers more performance in 1440p and 4K gaming, so it's a more efficient GPU overall. It's still not at the same level as NVIDIA's GeForce RTX 40 Series, where cards like the GeForce RTX 4070 and GeForce RTX 4070 SUPER use consume considerably less energy on average when gaming compared to their Radeon RX 7000 Series equivalents. Power efficiency isn't on the top list for many gamers when purchasing a new GPU, but it's still great to see that AMD's Radeon RX 7900 GRE and cutdown Navi 31 scales well. As for the XFX Radeon RX 7900 GRE, although it outperforms the Radeon RX 7800 XT with a similar power profile, it does run warmer. There's nothing to be alarmed about, but with an average temperature of 68 Degrees Celsius and a hot spot of 80 degrees, you're looking at fans running at a slightly higher speed than their Radeon RX 7800 XT counterparts. Still, the XFX Radeon RX 7900 GRE is relatively quiet with adequate cooling. The Radeon RX 7900 GRE is a strange release. It originally debuted before the Radeon RX 7800 XT hit the scene and has mostly been relegated to the Chinese market and sold to system builders in other regions. The naming is confusing; GRE or Golden Rabbit Edition doesn't mean all that much, and if AMD is launching this with a competitive price point to compete with NVIDIA's GeForce RTX 4070 and GeForce RTX 4070 SUPER, then something a little more formal would have made sense. Re-launching it as the Radeon RX 7800 XTX sends a more straightforward message to consumers about what it is and where it fits in the RDNA 3 product line-up. Also, being more efficient than the Radeon RX 7800 XT isn't a good look - and makes the flagship Navi 31 GPU hardware - even in cutdown and stripped-back form - more impressive. Still, what you've got here is a GPU that, although priced to match the GeForce RTX 4070, trades blows with the GeForce RTX 4070 SUPER - and that's great. NVIDIA's GeForce RTX 4070 SUPER is one of the best enthusiast options for the GeForce RTX 40 Series, considering price, performance, features, and overall efficiency. And you can say the same about the new/old Radeon RX 7900 GRE, where at $549, it delivers on price, performance, features, and overall efficiency. Performance 92% Quality 90% Features 90% Value 92% Overall 91% It has a confusing name, but the XFX Radeon RX 7900 GRE is a great enthusiast gaming GPU from AMD and XFX, delivering impressive 1440p and 4K results. The cutdown Navi 31 GPU is efficient and able to trade blows with the more expensive GeForce RTX 4070 SUPER. Kosta Andreadis Kosta is a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit. Similar Content Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}