{
    "title": "Bugged firmware makes AMD Ryzen 7 8700G and Ryzen 5 8600G APUs suffer from \nperformance loss; fix is coming soon",
    "date": "2/2/2024",
    "url": "https://www.notebookcheck.net/Bugged-firmware-makes-AMD-Ryzen-7-8700G-and-Ryzen-5-8600G-APUs-suffer-from-performance-loss-fix-is-coming-soon.799440.0.html",
    "text": "The AMD Ryzen 8000G APU series brings many notable improvements over the last APUs available for desktops. For example, the previous generation processors came with Vega-based GPUs, while the new ones come with RDNA graphics. But at the current stage, the new desktop APUs, especially the Ryzen 7 8700G (available on Amazon) and Ryzen 5 8600G (get it from Amazon), have a bugged firmware that can greatly limit their performance. According to benchmarks performed by Gamers Nexus, the new Ryzen 7 and Ryzen 5 APUs can only perform at their fullest for a limited time. After that, they start to thermally throttle, leading to a sudden performance drop. As it turns out, this is happening for the current firmware on the processors. The firmware is bugged and applies STAPM limit to the power draw shortly after the Ryzen 7 8700G and Ryzen 5 8600G go to full performance mode. For those wondering, STAPM stands for Skin Temperature Aware Power Management. It is a feature by AMD that's designed for the processors of notebooks and laptops. At the core, AMD STAPM analyzes the thermal headroom for mobile devices and makes the processors thermally throttle when it finds the power draw and temperature aren't favorable. It isn't supposed to be in the new Ryzen 8000G APUs, and it's the reason why the higher-end options are suddenly dropping to nearly 50 watts from 80 watts in the benchmarks. You can learn more from the detailed benchmark video and images attached below. Fortunately, AMD has confirmed that such STAPM limits will be removed through a \"future BIOS update.\" When that happens, the Ryzen 7 8700G and Ryzen 5 8600G should perform as they should. Gamers Nexus (video embedded above) via: Neowin "
}