{
    "title": "Sony Has A New PlayStation Handheld Console In Development, Report Claims",
    "date": "2/1/2024",
    "url": "https://insider-gaming.com/sony-new-playstation-handheld-console-development/",
    "text": "Sony may finally be set to rejoin the traditional handheld gaming market with a new PlayStation handheld console. According to known hardware leaker Moore’s Law Is Dead (MLID), a non-streaming console is in the works at Sony that would natively support and play games. In his report, MLID says the device will  have a custom AMD APU that is “currently in the high level design phase” and is “at least two years out, and technically not greenlit for launch yet”. It’s also mentioned that, based on talking with developers, the new handheld could maintain native backward compatibility with PlayStation 4 games while receiving a “pro-like patch” for PlayStation 5 titles. The report does state that the device is still early in development, so things are likely to change. It’s also unclear about when this could possibly be revealed and/or released by Sony. Lastly, MLID says that while he can confirm that the handheld is in development and AMD has the contract for the APU, the “exact specs” of the device are speculation on his part. As of writing, Insider Gaming hasn’t been able to independently verify the legitimacy of the report. Until then, please, as with all rumors, take this with a grain of salt. What do you think of a potential new handheld console from PlayStation? For more Insider Gaming, read about the new action espionage game from Kojima Productions that was announced on Wednesday. Why? Steam Deck and other handheld PC’s exist also mobile cloud gaming will become a thing not far away. Just another bad decision by Sony. I mean their games are on Steam so you could play them that way already on devices you already own. The biggest problem the Vita had was they didn’t support it they barely promoted it maybe like 1 commercial where it was a mirror for PS3 but they never pushed the games. They barely made any first party titles and they never promoted the Vita games. They may be too overconfident from their holiday Playstation Portable sales. I can’t imagine Sony developing a dedicated handheld that won’t alienate its audience in a market flush with a plethora of Linux, Windows, and Android based computer/gaming handhelds. This would be amazing, i am hyped for it to play Gran Turismo on the go or even GTA 🙂 Get a steam deck or a ROG I was a big fan of the psp. It will be interesting to see what develops. Comments are closed. "
}