{
    "title": "Slimbook's new AMD Ryzen laptop runs KDE Neon Linux, has a 16-inch screen",
    "date": "2/22/2024",
    "url": "https://www.tomshardware.com/laptops/slimbooks-new-kde-linux-laptop-has-a-16-inch-screen-amd-ryzen-7-7840hs",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The KDE Neon laptop is set to ship in April according to the store page, and enjoys an ultra-slim aluminum build form factor Looking for the rare Linux laptop? Slimbook debuted its KDE Slimbook V, which is a slim laptop PC using the KDE Neon Linux distribution and the latest, ultra-sleek KDE Plasma 6 desktop environment. According to Slimbook's store page for KDE Slimbook V, these laptops are expected to arrive in stock in April, and will ship within the EU starting at €999 Euros. There's an additional €50 fee for shipping internationally, such as to the United States. The KDE Slimbook V is powered by AMD. Slimbook has opted for a Ryzen 7 7840HS with a Radeon 780M integrated GPU. The screen measures at 16 inches and boasts an IPS panel with a 165 Hz refresh rate at a resolution of 2560 x 1600. The color gamut coverage is given as 100% sRGB, which is roughly comparable to 75% NTSC. This should make the display suitable for both gaming and professional work with calibration for color accuracy, though at 400 nits and being limited to sRGB it won't be ideal for workloads like HDR video editing. The laptop can be outfitted with up to 4 TB of NVMe storage (thought it starts with up to 250 GB) or up to 64 GB of DDR5 RAM (starting at 16 GB) running at 5600 MT/s when in dual-channel. These should provide adequate flex for the rest of the hardware. In particular, larger quantities of DDR5 can be allocated as VRAM for the Radeon 780M iGPU, which could be useful for 3D renders or gaming. The higher TDP limit of up to 50 Watts on the Ryzen 7 7840HS vs 30 Watts on Ryzen 7 7840U should net significantly increased performance compared to the low-power chip— particularly in multi-threaded workloads, where the higher TDP can actually put those cores to work. Single core performance mostly falls off around the same TDP as the handhelds. The laptop has a slim, aluminum build with a body thickness of 20.3 millimeters and an overall weight of 1.86 kilograms, or roughly 4.1 pounds. The current Apple MacBook Pro 16-inch, for instance, weighs 4.8 pounds and is only slightly thinner at 16.8 millimeters. The I/O includes 3 USB 3.1 Type-A ports, 2 USB 3.1 Type-C ports, a headphone back, and HDMI output. Finally, the built-in 720p webcam (it's a shame we haven't moved on to 1080p) also has a hardware switch that allows you to disable it fully when not in use, which is always a nice-to-have. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Former UPS employee stole $1.3 million in Apple merchandise — used proceeds to buy a home, pay off his Audi Microsoft's Surface Pro 10 and Surface Laptop 6 for Business are all in on office Copilots OpenAI and Microsoft reportedly planning  $100 billion datacenter project for an AI supercomputer By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}