{
    "title": "AMD: AI Propels Growth, For A High Price",
    "date": "2/8/2024",
    "url": "https://seekingalpha.com/article/4668630-amd-ai-propels-growth-for-a-high-price",
    "text": "da-kuk  da-kuk Advanced Micro Devices, Inc. (NASDAQ:AMD) has rallied significantly based on the expected ramp of its MI300 GPU, bringing competition to Nvidia (NVDA) in the data center AI market. While AMD is indeed forecasting such a ramp with a quickly improved guidance (overtaking Intel (INTC) as main competitor for now), this has been more than priced in by now, possibly requiring years of additional growth to see any stock gains. Previous coverage from half a year ago argued AMD was stalling, as it delivered little to no growth, despite increasing competition on the CPU side from Intel. As AMD is still not yet returning to any significant growth, this thesis has to some extent been vindicated, although the stock has rallied due to the AI opportunity going forward. Referring to Seeking Alpha’s coverage: Breaking down the quarterly performance of AMD's (AMD) segments, data center business revenue was $2.3B (+38% Y/Y), client unit revenue was $1.5B (+62% Y/Y), gaming revenue was $1.4B (-17% Y/Y) and embedded revenue was $1.1B (-24% Y/Y). Overall, Q4 revenue of $6.2B was up 10%. Looking at the results, PC revenue is still down from around $2B from before the downturn, although the PC total addressable market (\"TAM\") is also down. For comparison, Intel's revenue was up 33% from a much larger base, but it also hadn’t declined as much in Q4 ’22 (down 36%). Embedded revenue is similarly seeing a correction as Intel’s FPGA business. The gaming decline was driven by semi-custom. Lastly, the data center segment, obviously the business investors are looking the most to for growth, did deliver with strong YoY and even slightly stronger QoQ growth. This compares to Intel’s segment, which has been flat for quite a few quarters. For the full year, the company reported revenue of $22.7B vs $23.6B in 2022. As widely known, AMD has stated its MI300 is its fasting ramping product ever. AMD also updated its 2024 outlook from $2B to $3.5B, with capacity to ramp further. Although the net addition to its full-year revenue will likely be bit lower, as there will be some decrease in revenue from the ramp-down of the previous generation. On the other hand, if AMD could increase its 2024 outlook by $1.5B (75%) in a quarter, then actual revenue might end up even higher. For comparison, despite being a year later to market than Intel’s Ponte Vecchio GPU, it seems much more successful, as Intel has not provided any details whatsoever regarding its Ponte Vecchio sales performance, except for a few notable supercomputer wins. Instead, Intel is mainly touting its Gaudi roadmap for the AI market, which is already in the market for two years, with Gaudi3 launching this year. However, this product too is not seeing a ramp like AMD with its MI300: Intel said in its January earnings call that its pipeline grew double digits QoQ to over $2B, and only expects some sales ramp in H2’24. The pipeline had already reached $1B in Q2 by growing 6x QoQ (from the July earnings call), indicating that pipeline momentum has since slowed down, compared to AMD's acceleration. As this pipeline likely spans beyond 2024, Intel will most likely achieve less than 50% the AI sales of AMD. In addition, Intel is also undergoing a product transition as it merges the Ponte Vecchio and Gaudi product lines to a single Falcon Shores product in 2025. So, despite being much later to market, AMD has leapfrogged Intel as strongest competitor to Nvidia. In the near term, the ramp in data center AI revenue is overshadowed by sequential decreases, with AMD forecasting $5.4B revenue, a miss of over $300M and roughly flat YoY. In its data center segment, the only flat QoQ segment, AMD expects the ongoing GPU ramp (as just discussed) to only make up for an expected seasonal drop in Epyc CPU sales. This indicates quite stable market share on the CPU side, as both companies have guided for a similar QoQ decline. As part of 2023 coverage on the company, one part of the thesis was that Intel's competitiveness in the data center CPU market is strongly increasing, in particular with its 2024 portfolio with Sierra Forest and Granite Rapids. Hence, with Intel claiming that it saw stable market share from Q3 to Q4 already, it appears AMD's market share gains in this segment might be slowing down. This means most of the data center growth might have to come from the GPU side of the business going forward. Looking at the estimates, 2023 net growth of $3B is currently expected, which is less than MI300 sales (although as mentioned the $3.5B figure likely excludes some decline in previous-gen sales as this new generation ramps. Nevertheless, this hence seems to be the main product currently responsible for growth. AMD does have some major CPU product launches in the PC and data center planned based on Zen 5, but those will likely contribute more significantly to 2025 revenue. The forward valuation stands at 46x P/E, based on 37% expected earnings growth ($3.65), although the estimate isn’t much higher than 2022 EPS ($3.5). For comparison, this valuation is similar to ASML Holding N.V. (ASML), which is the only company producing \"EUV\" manufacturing tools, and as an equipment supplier benefits from growth across the industry. Instead, AMD seems mainly reliant on its data center and AI business for growth, although looking at Nvidia, this is a quickly growing market, with data center surging by nearly 300% to $14.5B in the latest reported quarter, with further growth expected in 2024. Hence, the main question which investors have to bet on is how much further growth this market will see, and how market share trends will evolve. For example, if AMD could grab a sizeable portion (up to 25%) of this market, then it could perhaps generate $10-20B in revenue. However, if the increase in AMD’s share price (which has doubled over the last several months) has been based solely on its AI business, then investors are paying a steep price for a currently small business, indicating that much growth has already been priced in. This compares to Nvidia, where its share price has actually mostly followed its actual performance and guidance, whereas, as discussed, AMD isn't expected to see a similar surge in revenue as Nvidia in 2023. Of course, the assumption that the increase in share price has been solely due to the anticipated growth in its AI business might be incorrect, but there seem little other catalysts on the horizon in any of its other segments that would warrant such a high valuation. For example, as mentioned in the CPU part of its data center segment, market share gains seem to slowing down. Nevertheless, AMD is expected to see larger leverage (than ASML) from its expected revenue increases, with EPS estimates firmly in the double digits for the next several years. About high-teens annual revenue growth is expected in the next several years, which might roughly double revenue and triple EPS over time. Of course, these are just estimates, and quite bullish ones, leaving downside if demand trails these expectations. Taking these estimates as one possible scenario, then it would take several years for P/E to decline below a 20x multiple, at which point AMD would have roughly doubled revenue, and would still have to be growing to justify a higher multiple, for the share price to increase further. As discussed, the main risk is the quite uncertain evolution of the demand for AI hardware and market share. While Nvidia’s 2023 results show this has quickly become a large and lucrative market, the current stock price already prices in quite a large business, much beyond the 2024 guidance for $3.5B revenue. With several years of growth priced in, the risk-reward has become substantially less favorable. Another risk is that, as discussed for Nvidia’s case, the AI market size might be somewhat artificially inflated due to Nvidia’s very high pricing, which should or could come down (by quite a lot) as competition ramps. For example, while Nvidia has overtaken Intel in revenue in the data center, this has been despite selling just a fraction of the volume, as Nvidia has been able to charge much higher prices (although for some large part due to mainly selling one high-end GPU, compared to a full range of products). AMD’s stock has rallied quite significantly on what seems to be mainly the ramp of its AI business to drive growth going forward, making it \"AI Micro Devices.\" While AMD expects a relatively major ramp, with a rapidly increased outlook for $3.5B revenue in 2024, this still pales compared to Nvidia (although shareholders likely see this as the opportunity). On the other hand, the execution nevertheless seems much stronger than Intel, which currently even has two product lines, but whose \"over $2B\" total pipeline is markedly below AMD's 2024 outlook. The main issue is that AMD stock has already seen a strong rally, pricing in a significant AI business before any actual results (and vastly beyond the 2024 outlook as well). There is no expectation for a similar revenue surge as Nvidia, with current estimates calling for more steady growth over time. Although Advanced Micro Devices, Inc. EPS is expected to grow markedly faster than revenue, there are still multiple years of growth already priced in. This means shareholders who had bet early on AMD becoming a significant competitor to Nvidia have already been rewarded, while for current prospective shareholders AMD would need years of strong execution going forward, which provides an unfavorable risk-reward. This makes AMD stock a hold at best. Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of INTC either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}