{
    "title": "AMD Radeon RX 7900 GRE shows up in UK on DIY market, reportedly coming to \nthe U.S. as well",
    "date": "2/18/2024",
    "url": "https://videocardz.com/newz/amd-radeon-rx-7900-gre-shows-up-in-uk-reportedly-coming-to-the-u-s-as-well",
    "text": "The company might have understood the potential of their high-end SKU.  AMD and its partners are expanding the availability of the RX 7900 GRE, also known as the Golden Rabbit Edition. Initially designed as an exclusive GPU for the Chinese market, AMD also confirmed its plans to make the RX 7900 GRE available through system integrators in other regions as well. But the card also became available through the DIY market in Europe very quickly. AMD RX 7900 GRE positions itself between the RX 7900 XT (Navi 31) and RX 7800 XT (Navi 32), featuring more cores than its Navi 32-based counterpart, but featuring the same memory spec. However, its performance is constrained by a maximum TGP (Total Graphics Power) of only 260W. Following a relatively quiet launch in countries like Italy and Germany, the RX 7900 GRE has now made its way to the United Kingdom. The first model to hit the UK market is the XFX version, based on AMD’s reference design. The card was priced at £659.99 (~$832), which might not be considered a great deal, especially when the RX 7900 XT is already available at a slightly higher price of £699.   Radeon RX 7900 GRE in UK,Source: AWD-IT  The retailer removed the product listing just as the sale of these graphic cards ended. This may have been a premature listing or that the stock was very limited. We have recently learned that large U.S. retailers are also working on selling the Radeon RX 7900 GRE. The information we’ve gathered so far suggests that the Gigabyte RX 7900 GRE model is expected to hit the U.S. market later this month. Worth adding that along with the price update for Radeon RX 7900 XT, AMD announced that RX 7900 GRE will also be available at a lower price of $549 (effectively a $100 price cut). Source: TechPowerUP We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}