{
    "title": "Seeing Wavy Lines or Missing Parts of Your Vision? It Could be Age-Related \nMacular Degeneration",
    "date": "2/21/2024",
    "url": "https://www.dvidshub.net/news/464364/seeing-wavy-lines-missing-parts-your-vision-could-age-related-macular-degeneration",
    "text": "(e.g. yourname@email.com) Remember me Forgot Password? Photo By Deidre Smith | \r\n                        KINGS BAY, Ga (March 10, 2023) - Lt. Joseph Jeskie, an optometrist at Naval Branch......\nread more\nread more Photo By Deidre Smith | KINGS BAY, Ga (March 10, 2023) - Lt. Joseph Jeskie, an optometrist at Naval Branch Health Clinic Kings Bay, performs an eye exam on a patient. Jeskie, a native of Bowling Green, Kentucky, holds a doctor of optometry degree from University of Houston College of Optometry. He says, “As part of our overall health, everyone requires a comprehensive eye exam from an optometrist or ophthalmologist on a regular basis. In the early stages, many eye diseases like glaucoma, macular degeneration, and diabetic retinopathy have virtually no symptoms.\" World Optometry Day is March 23. Optometrists provide primary vision care, ranging from sight testing and correction to the diagnosis, treatment and management of vision changes. (U.S. Navy photo by Deidre Smith, Naval Hospital Jacksonville/Released). #FacesofNHJax \r\n                         see less\r\n                         | View Image Page Age-related macular degeneration may cause a gradual reduction in your central vision over time, so you might not recognize AMD at first.\r\nAccording to U.S. Air Force Col. (Dr.) Kristine Pierce, with the 96th Medical Group at Eglin AFB, “The change can also be immediate. You can go to sleep one night and wake up with blurry vision or loss of vision.”\r\nAnother symptom of AMD is that “the perfectly straight edges of a doorframe may appear distorted and wavy, and you have missing areas of vision such as a blind spot or spots. These signs can happen equally,” she said.\r\nPierce, a vitreoretinal surgeon, sees a number of retirees and beneficiaries at Eglin Air Force Base Hospital, Florida. Roughly 50% of her patients have AMD, she said, adding, “I’m a retina specialist, so I see it every day.”\r\nAccording to the National Eye Institute, damage from aging to the macula—“the part of the eye that controls sharp, straight-ahead vision”—is the cause of AMD. “The macula is part of the retina (the light-sensitive tissue at the back of the eye),” NEI stated.\r\nIt’s the leading cause of permanent impairment of reading or close-up vision. AMD doesn’t usually cause complete blindness, but losing your central vision can make it harder to see faces, read, drive, or do close-up work like cooking, needlework, or fixing things around the house.\r\nThe Defense Health Agency’s Vision Center of Excellence recommends watching out for these signs of AMD:\r\n•\tBlurry or fuzzy vision\r\n•\tDifficulty recognizing familiar faces\r\n•\tBumping into walls, steps, or other obstacles\r\n•\tStraight lines appear wavy or missing areas\r\n•\tA grayed out, dark, or missing area in your central vision\r\n•\tDefinitive areas (blind spots) of missing vision\r\n•\tDecrease or loss of central vision\n\r\nMonitor Your Eyesight Regularly and Amsler Grids\n\r\nBecause of the differences in when AMD shows up, it’s important to get your eyesight checked on a regular basis by an optometrist to see if you have or are developing the disease.\r\n“If concerned, talk to your health care provider and have a routine eye exam with an optometrist. TRICARE covers optometry/routine eye exams every two years. No referral is required to see a local optometrist who takes TRICARE,” Pierce said. You can also see an ophthalmologist for diagnosis or treatment if they are covered by TRICARE.\r\nIf you’re already concerned about changes in your eyesight, your doctor most likely will give you an Amsler grid to test your vision loss every day at home. You look at the grid—heavy paper stock with black-and-white, equally spaced, horizontal and vertical lines printed on it—to see if the lines are becoming wavy, distorted, or have spaces missing.\r\nDiagnosing AMD is a combination of examining the retina and optical coherence tomography imaging, Pierce said.\r\nTo examine the retina for AMD, the eye specialist will dilate the pupils with eye drops, which may take 15-20 minutes to work fully. Dilation allows the eye doctor to obtain a wider and more detailed view of the retina and the internal eye structures. Also, necessary diagnostic testing is easier to accomplish.\r\nTesting the back of the retina takes a few minutes per eye. The eye specialist will also perform a test called optical coherence tomography, or OCT, to observe the layers of the retina a direct examination cannot see. \r\nIt’s non-invasive and uses light waves to take cross-sectional maps of the retina’s thickness and layers. It’s like putting a dye in your eye (fluorescein angiography) but without the dye and, it’s quicker. OCT can identify the earliest changes in AMD and can help to diagnose and monitor for small progressive changes.\n\r\nLifestyle and Other Risk Factors for AMD\n\r\nAge-related macular degeneration can develop at any time, even as early as your 50s, Pierce said. \r\nDr. David Eliason, an ophthalmologist and deputy chief for the VCE, cautioned about these lifestyle and other risk factors for AMD:\r\n•\tOlder age\r\n•\tPresence of AMD in the other eye\r\n•\tFamily history of AMD\r\n•\tSmoking\r\n•\tUV light exposure\r\n•\tHigh blood pressure\r\n•\tBody mass index of 30 kg/m2 or higher (overweight or obese)\r\n•\tDiet low in omega 3 and 6, vitamins, carotenoid, and minerals\r\n•\tDiet high in fat\r\n•\tLack of exercise\r\n“Smoking and UV light exposure definitely play a role” in the development of AMD, Pierce said. “There is a much higher risk for the wet form of macular degeneration versus the dry form if you are or have been a smoker.”\r\nShe added, “Genetics is still debatable. There are lots of factors to include in possible genetic” relationships to the development of the disease.\n\r\nThree Stages of AMD and Possible Treatments that May Slow Progression\n\r\nThere are three stages of AMD:\r\n•\tEarly (dry)\r\n•\tIntermediate (dry)\r\n•\tAdvanced/late (wet)\r\nDry AMD happens when the macula thins out and breaks down over several years and occurs in early, intermediate, and late stages, according to the NEI. There’s currently no treatment for early AMD, so your doctor will keep track of how your eyes are doing with regular eye exams. While there’s no treatment for early dry AMD, there are ways to make the most of your remaining vision by using low-vision techniques and training.\r\nThe Age-Related Eye Disease Study 2, a large research study sponsored by the NEI, found taking certain nutritional supplements every day is an intervention to slow progression of AMD once the disease is diagnosed at the intermediate dry stage. Specific formulas contain:\r\n•\tVitamin C (ascorbic acid) 500 mg\r\n•\tVitamin E 400 international units\r\n•\tLutein 10 mg\r\n•\tZeaxanthin 2 mg\r\n•\tZinc (as zinc oxide) 80 mg\r\n•\tCopper (as cupric oxide) 2 mg\r\nMedications injected into the eye, known as anti-vascular endothelial growth factors, or anti-VEGF drugs, have proven helpful for AMD.\r\nPhotodynamic therapy, which combines eye injections and laser treatment, has also helped slow or halt progression of the disease, VCE stated.\n\r\nLow-vision Aids\n\r\nLow-vision devices such as magnifying glasses, telescopes, closed-circuit televisions or monitors, large-print text, glasses-mounted cameras, increased illumination sources, smartphones, and smart watches are some of the low-vision techniques that can help you maintain vision and improve your quality of life with AMD.\r\nThese devices in combination with low vision care or blind rehabilitation by a low-vision optometrist or a vision rehabilitation specialist at a Military Health System hospital or clinic or the Department of Veterans Affairs also can help those with AMD enjoy a better quality of life. This work, Seeing Wavy Lines or Missing Parts of Your Vision? It Could be Age-Related Macular Degeneration, by Janet A. Aker, identified by DVIDS, must comply with the restrictions shown on https://www.dvidshub.net/about/copyright. No keywords found. "
}