{
    "title": "AMD Expected To Release Next-Gen MI400 AI GPUs By 2025, MI300 Refresh \nPlanned As Well",
    "date": "2/24/2024",
    "url": "https://wccftech.com/amd-release-next-gen-mi400-ai-gpus-2025-mi300-refresh-planned-2024/",
    "text": "AMD is expected to launch a refreshed MI300 AI accelerator with HBM3E memory this year followed by the Instinct MI400 in 2025. It seems like AMD is starting to gear up for new AI-focused launches in the upcoming period, as the firm is rumored to introduce a \"refresh\" model of their original Instinct MI300 AI GPU, upgrading the onboard memory to the latest HBM3e standard. This means that the \"revamped\" MI300 will mark AMD's transition to the newer standard, as the firm's previous releases were based on the relatively older HBM3. This news comes from @Kepler_L2, and from what it is disclosed, the upcoming AI GPU could prove to be an excellent price-to-performance product. MI400 is 2025. — Kepler (@Kepler_L2) February 22, 2024  While we are unaware of specific details of the upcoming SKU, the inclusion of HBM3e seems like a great addition since the industry competitors are transitioning to the standard. NVIDIA has already released the Hopper GH200, which features HBM3e, & it is the only AI GPU in the market to come with the memory type. For a quick rundown, the HBM3e memory standard offers a 50% faster speed up over the existing HBM3 standard, delivering up to 10 TB/s bandwidth per system and 5 TB/s bandwidth per chip with memory capacities of up to 141 GB. There will an MI300 refresh with HBM3e. Also B100 is expensive af, so MI300 still has an advantage in cost. — Kepler (@Kepler_L2) February 22, 2024  Kepler does note the fact that AMD's refreshed Instinct MI300 GPU will be designed to tackle NVIDIA's upcoming Blackwell B100, and despite being a generational upgrade, it is said that the new MI300 will be the superior option as it will provide a better value to its clients. The B100 will also employ an HBM3e memory solution, but it would be a more pricer model, which is why AMD could potentially gain traction in this mid-to-high segment in the AI industry. Apart from the new MI300, AMD is also rumored to release their next-gen Instinct MI400 AI accelerator somewhere in 2025, which was previously verified to be in development by AMD's CEO Lisa Su herself. However, we are entirely unaware of what the accelerator could bring on board regarding performance. Still, it is rumored to debut with a \"range of specifications,\" meaning we could see multiple SKUs within the lineup, the same as the predecessor. AMD has yet to see success in the AI markets, similar to its arch-rival NVIDIA, but the future is indeed bright for the firm. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}