{
    "title": null,
    "date": "2/11/2024",
    "url": "https://seekingalpha.com/article/4669351-amd-progress-over-perfection",
    "text": "SOPA Images/LightRocket via Getty Images SOPA Images/LightRocket via Getty Images The chip sector has had a phenomenal last couple of months, with Advanced Micro Devices (NASDAQ:AMD) being no exception. The chip stock has seen the rally stall recently while the market digests disappointing guidance for Q1'24. My investment thesis remains ultra Bullish on AMD, with the AI chip boom still not fully reflected in the consensus estimates. Source: Finviz Source: Finviz AMD reported Q4'23 results about 2 weeks ago now and the stock has traded flat while Nvidia (NVDA) has soared to new highs above $700. In fact, Nvidia is up ~$100 since the disappointing numbers from AMD, adding $250 billion in market cap during the period while AMD only has a market cap of $279 billion. The company reported solid Q4 numbers with a slight revenue beat of $60 million on $6.2 billion in revenues. The bad part is that AMD guided to Q1 revenues of only $5.4 billion, versus consensus estimates up at $5.57 billion. The results were difficult to dissect due to the typical seasonal weakness, highlighted by chip giant Intel (INTC) guiding to very weak Q1 numbers. The problem is connecting the dots between the forecasts for MI300 AI chip sales to the rather weak Q1 guidance for AMD. AMD has a long list of MI300 customers with Microsoft (MSFT), Meta Platforms (META) and Oracle (ORCL) listed as volume customers. Even Google (GOOG) was speculated as a customer and OpenAI has been listed as a MI300X customer alongside partner Microsoft. Source: AMD Q4'23 presentation Source: AMD Q4'23 presentation The consensus view appears AMD will ship at least 400K AI chips, with a target of up to 600K chips. The rumored unit price is in the $15,000 range suggesting annual AI GPU sales in the range of $6 to $9 billion based on the shipment level in 2024. On the Q4'23 earnings call, CEO Lisa Su updated the AI GPU chip guidance for 2024 as follows: Looking ahead, our prior guidance was for Data Center GPU revenue to be flattish from Q4 to Q1 and exceed $2 billion for 2024. Based on the strong customer pool and expanded engagements, we now expect Data Center GPU revenue to grow sequentially in the first quarter and exceed $3.5 billion in 2024. We have also made significant progress with our supply chain partners and have secured additional capacity to support upside demand. The CEO went further to discuss this revenue guidance for 2024 as the firm commitments for Data Center GPU chips with additional capacity to supply far more chips. The big remaining question is how quickly AMD ramps up GPU sales, considering Q4'23 sales were over $400 million and a sequential increase in Q1 doesn't leave much growth throughout the year. As an example, if AMD reached $600 million in Q1'24 Data Center GPU sales, the company will have already reached $2.4 billion in annualized sales. The company would only need to add $200 million in additional AI GPU sales each additional quarter to reach the $3.5 billion target. Nvidia added $4.6 billion in additional sales in the last quarter an a combined $11.0 billion in the last 2 quarters, so a few hundred million by AMD would be highly disappointing. Our previous research highlighted how 2024 revenues were targeted at $26.5 billion, and analyst consensus estimates have now cut numbers down to only $25.8 billion. AMD has actually maintained a premium valuation despite revenue target cuts. Source: Seeking Alpha Source: Seeking Alpha Now, analysts are forecasting 2025 revenues jump to $32.5 billion, up from the $30.7 billion target from approximately 3 months ago. The numbers just appear far too conservative. A lot of analysts have the same view as Citi, forecasting AMD generates in the $4 to $5 billion range in AI GPU chip sales in 2024. The more logical prediction comes from UBS with a 2024 forecast for AI GPU chip sales of $5 billion as baseline with an exit rate of $10 billion in annualized sales with the potential for substantial upside. The reality is that current estimates are only forecasting 2024 revenues grow by $3.1 billion. Though AMD did produce a small amount of GPU revenues during Q4, the consensus prediction for this year doesn't even appear to factor in the real AI chip growth rates. AMD faced a tough market during 2023 with all other segments struggling outside of the Data Center. Both the Embedded and Gaming segments peaked around Q1'23 and saw substantial sales declines at the end of the year. Source: The Next Platform Source: The Next Platform A big part of the story is whether the Client revenues can recapture the $1.7+ billion levels from 2021 due to AI PC demand. AMD continues to take market share from Intel in the PC sector, but the chip company only ended the last quarter with 18.4% of the PC market with Intel still controlling 71.8%. PC demand has been weak since the Covid pull forward period, but the market could open up again in 2024 with AI edge demand with technology placed inside devices in order to personalize the AI experience and reduce reliance on servers. AMD has focused on the Data Center market with server CPUs and now AI GPUs, but the company remains poised to capture more market share in existing segments. Depending on how one calculates the unit share versus the revenue share, AMD only controls a minor portion of the CPU market for both Servers and Client. Toms's Hardware calculates the Server revenue share at 31.1% of the market now as AMD takes more of the premium chip sales, but the company only has a minimal 15.4% of the Clients market based on revenue. Source: Mercury Research Source: Mercury Research Even the Embedded segment should eventually see a big sales boost. On the Q4'23 earnings call, the company discussed a big boost in design wins as follows: Longer term, we're very confident in the growth trajectory of our Embedded business as our expanded product portfolio drove more than $10 billion of design wins in 2023, an increase of more than 25% compared to 2022. While all of the focus is on the AI chips and the competition with Nvidia, Intel is still forecast to produce $57 billion worth of revenues in 2024. AMD definitely has sights on the surging Nvidia GPU revenues, but Intel has a large revenue base still to disrupt. The big question is when exactly the MI300 revenues really launch higher in 2024. Nvidia has already reported an ~$11 billion quarterly increase in GPU sales amounting to the company heading towards a $50 billion boost. The 2024 numbers for AMD currently aren't impressive, and the market is very clear that sales will ramp up over the next year. With just a slight bump to 2025 targets, AMD would generate the following financial model as follows: The key to the $35.0 billion revenue target for 2025 is that growth is only $12.3 billion over the $22.7 billion reported in 2023. AMD isn't coming anywhere close to the growth from Nvidia to produce this revenue level, and our estimates are only up $3 billion from the prior estimate of $32 billion. The EPS target comes out to $6.54 while UBS has forecast an $8 EPS potential starting in the 2H'25. AMD only trades at 26x the above updated 2025 EPS target. Based on the UBS target for an $8 EPS, AMD only trades at 21.5x earnings while Nvidia now trades at 35x the FY25 EPS targets, requiring 68% growth in the current fiscal year. The key investor takeaway is that AMD is far too cheap still. The current base business is deflated due to weak sales in PCs and Embedded categories, with potential for growth ahead as 2024 progresses. Even with the ongoing weakness in these legacy segments, AMD should see a huge boost in Data Center GPU sales, and the consensus analyst estimates for the next couple of years are far too low. Investors should continue a Bullish view on AMD, even after the stock trades at all-time higher above $170. The Q1 guidance was disappointing, but the chip company is making huge progress towards substantial growth in the years ahead. The If you'd like to learn more about how to best position yourself in under valued stocks mispriced by the market to start 2024, consider joining Out Fox The Street. The service offers a model portfolio, daily updates, trade alerts and real-time chat. Sign up now for a risk-free 2-week trial. This article was written by Stone Fox Capital (aka Mark Holder) is a CPA with degrees in Accounting and Finance. He is also Series 65 licensed and has 30 years of investing experience, including 10 years as a portfolio manager. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. The information contained herein is for informational purposes only. Nothing in this article should be taken as a solicitation to purchase or sell securities. Before buying or selling any stock, you should do your own research and reach your own conclusion or consult a financial advisor. Investing includes risks, including loss of principal. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}