{
    "title": "The next big stock set to skyrocket – and it's not what you think",
    "date": "2/16/2024",
    "url": "https://finbold.com/the-next-big-stock-set-to-skyrocket/",
    "text": "Meta Platforms‘ (NASDAQ: META) recent incredible stock surge became the largest gain in a single day in Wall Street history. This sudden and steep curve came after the company reported better financials than expected and announced its first dividend. Many have a question: what is the next big stock set to skyrocket? We have come up with a potential answer – and it’s not what you think. The short answer: it might be AMD. Why? We’ll explain. Advanced Micro Devices (NASDAQ: AMD) is trailing closely behind Intel and Nvidia, reassuring the market amid the recent chip industry uncertainties. In fact, the company races past its humble Q1 predictions, leading many to believe that there’s longer-term growth for AMD behind the bullish market. Additionally, the company aims to earn $3.5 billion in revenue for 2024, which is at the core of the argument for its stock value projections. The AI chip market is firmly ruled by Nvidia, with AMD facing some hurdles in the race, particularly in the software segment. Still, AMD is poised to become a worthwhile rival, especially for cloud computing companies. In fact, the company has managed to win over Nvidia’s customers with its Instinct GPUs, including Microsoft, Oracle, and the surging stock protagonist, Meta. Lisa Su, the CEO of AMD, projected that the AI chip market could rise to $400 billion by 2027 as AMD launched its newest generation of artificial intelligence processors at the tail of 2023. If the company manages to secure at least 5% of that growth, it could earn an additional $20 billion in revenue in three years: enough to offset any potential loss elsewhere in its diverse portfolio. During the final quarter of 2023, the company’s performance surpassed its expectations by earning over $400 million in revenue from the MI300 AI GPU model. Hitting internal growth targets is a green flag to potential investors and reassures the market of solid executive leadership. And let’s not forget AMD’s gains over Intel in the domain of X86 server, as it shows the company’s merit in the face of its larger rivals. The current situation suggests that AMD is coming for Nvidia’s piece of the pie next, as it sells its flagship AI GPUs at a massive discount to Microsoft. It might still not be enough to win over a significant market share in the race for AI supremacy, but it’s getting there. On February 6, 2024, AMD announced its Embedded+ Architecture, which couples AMD Ryzen Embedded processors with Versal adaptive SoCs to accelerate the time-to-market for Edge AI applications without adding any hardware bulk. This advance should enhance qualification and build processes and enable common software platforms for various applications, with an emphasis on real-time sensor data in automation. While it is true that NVDA remains the favorite AI chip stock, we might all be surprised by AMD’s performance this year. It is poised for success, with aggressively high goals, but also the fiscal performance and executive capabilities to consistently reach their marks. AMD stock rose about 140% in 2023, beating the benchmark PHLX Semiconductor Index by almost 90%. The company aims to hit the 15% to 25% market share of the AI semiconductor market this year. As an answer to its previous chip supply shortages, the company announced it has “$2 billion in supply” for this year, with a demand for even more. If the company delivers on its goals, the gap between Nvidia could become tight. In the last quarter, the company made $6.2 billion in revenue, and the whole year’s revenue amounted to $22.7 billion. While this year’s revenue forecast might seem a bit too optimistic for some investors, the current demand for AI chips is on the rise, and AMD should earn immense gains and obtain a huge part of the market share if it meets them. On top of that, there’s the recent success of Nvidia to account for. After all, AMD stock is likely to witness some carryover. In spite of fearmongering about the AI market’s bubble-ish nature, the market continues to grow, and demand keeps rising. Meta has reaped the benefits. Nvidia has likewise had a bountiful harvest. With good numbers and a responsible performance, AMD might be next in line. The high demand, solid financials, and recent collaboration agreements with some of the Big Tech companies paint a lucrative picture for the semiconductor company. If everything works out, AMD could make the headlines as the next in line to skyrocket. Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}