{
    "title": "AMD RDNA 4 flagship GPU rumor sounds disappointing - and it has us \nscratching our heads",
    "date": "2/29/2024",
    "url": "https://www.tweaktown.com/news/96552/amd-rdna-4-flagship-gpu-rumor-sounds-disappointing-and-it-has-us-scratching-our-heads/index.html",
    "text": "It's time to put your skeptical hat on - and your coat of caution as well, for good measure - as we dive into the latest rumor drop for AMD's next-gen graphics cards. This is from RedGamingTech (RGT) on YouTube who has new details about RDNA 4 GPUs, namely Navi 48 and 44, which will be aimed at the mid-range market. (AMD isn't doing high-end products this time around, as you're likely aware). RGT has an update from sources which changes the predicted specs for these GPUs, with both of them now said to run with GDDR6 RAM (rather than GDDR7 as previously stated by the YouTuber). Furthermore, Navi 48 will purportedly have a 256-bit memory bus and Navi 44 a 128-bit bus, which is wider than RGT's last claim (of 192-bit and 96-bit respectively). We're told the die size of Navi 48 will probably be around 220mm2 or slightly larger, and RGT isn't sure of the size for Navi 44. For Navi 48, AMD is apparently targeting a clock speed of 3GHz or just over, perhaps more towards 3.5GHz (but that needs to be taken with a large grain of salt, RGT says, which you should do with all this info, really). TDP will be around 260W, perhaps a bit lower at 250W. With the caveat that this isn't final silicon yet, RGT believes that for overall performance, Navi 48 will a touch slower than the RX 7900 XT. Meaning it'll pitch between the performance of the 7900 GRE and 7900 XT (though ray tracing will be better with the next-gen, mind you - this is rasterization we're talking about). AMD's RDNA 4 GPUs might be here in Q3 - if we're lucky (Image Credit: AMD) We're then told by RGT that Navi 48 should be cheaper than the RX 7900 GRE, which of course retails at $550 in the US. So, yes, we'd very much hope that'd be the case... The leaker tells us not to get too excited about Navi 48, as RGT says he'll be happy to see it at $500. Which is where this becomes a real head-scratcher. If Navi 48 offers performance just shy of a 7900 XT, and it's not all that much faster than the 7900 GRE, plus it's only 10% cheaper than the GRE, well, to say that'd be disappointing is an understatement. So, while some of the speculation here may - or may not - be correct, this particular assertion seems a bit ridiculous, frankly. Even if Navi 48 does up the stakes in a more meaningful way with ray tracing (which is expected). That said, RGT does admit pricing will depend on the state of the market come Q3, which is when the leaker now believes RDNA 4 graphics cards could emerge - or it might even be Q4. (The next-gen models aren't coming in the middle of the year, RGT clarifies, which is what the leaker previously believed). And naturally, no decisions will have been made on pricing yet at AMD, anyway, so this is all likely guesswork on the cost front. Just rather odd guesswork. The rumored performance falling short of the 7900 XT also contradicts what another YouTuber's sources have told us. Moore's Law is Dead (MLID) recently contended that Navi 48 will be faster than the 7900 XT, and between that card and the 7900 XTX, which sounds a bit more likely to us. Or it could even match the 7900 XTX, or come very close, and that'd make more sense if AMD wants to charge $500 for it. Much of the spec rumors between RGT and MLID do align, mind you, although the latter believes Navi 48 will have a larger die size of more like 300mm2 or possibly even bigger. The better news, price-wise, from RGT is that he believes Navi 44 could even be pitched as low as $199, but more likely it'll be something like $250. But again, go heavy with the seasoning here. Read more: AMD Zen 5 CPUs may not debut until late in 2024 - could Intel's Arrow Lake even arrive first? Darren Allan Darren has written for numerous magazines and websites in the technology world for almost 30 years, including TechRadar, PC Gamer, Eurogamer, Computeractive, and many more. He worked on his first magazine (PC Home) long before Google and most of the rest of the web existed. In his spare time, he can be found gaming, going to the gym, and writing books (his debut novel – ‘I Know What You Did Last Supper’ – was published by Hachette UK in 2013). Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}