{
    "title": "Workaround helps improve gaming performance on outdated Intel CPUs — \nResizable Bar UEFI mod works with CPUs ...",
    "date": "2/3/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/workaround-helps-improve-gaming-performance-on-outdated-intel-cpus",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Resizable Bar can be accessed by systems dating back to 2011, but it requires a mod. Resizable Bar, or Smart Access Memory (as AMD likes to call it), has been widely accessible since AMD made it famous with the introduction of its Ryzen 5000 series CPUs and RX 6000 series GPUs back in 2020. However, motherboard manufacturers have neglected to bring the performance-enhancing feature to older systems before 2020, leaving many capable gaming platforms hanging out to dry. This issue has been rectified by modder xCuri0 on GitHub, who has published a Resizabe Bar mod that gives older systems access to Resizable Bar. The mod modifies the UEFI firmware on older motherboards to add Resizable Bar compatibility. It does this by replacing the PreprocessController of the PciHostBridgeResourceAllocationProtocol function in the UEFI with a new function that checks for Resizable Bar compatibility and then activates it if it is compatible. The ReBar size is set by adding a particular module to the DXE driver within the UEFI firmware. The mod has been reported to work on systems as old as the Sandy Bridge era, which arrived in 2011. Resizable Bar has technically existed since PCIe Gen 2.0 first came out. Still, it never caught the attention of Intel, AMD, or any of their motherboard partners until AMD realized its potential years later and released it in the form of Smart Access Memory in 2020.  Resizable Bar changes the 'aperture' of the PCIe bus to allow more significant data transfers of over 256MB. In layperson's terms, you can think of Resizable Bar as boxes on a conveyor belt. Without ReBar, the boxes are limited in size to specific dimensions, but with it enabled, the box size can be increased substantially, boosting throughput. Modern GPUs benefit heavily from Resizable Bar in the right scenarios. It's not uncommon for some Radeon GPUs to gain anywhere between 5% - 24% more performance in Resizable Bar in specific titles. But on the flip side, it can also degrade performance. This is why AMD and Nvidia have Resizable Bar profiles for each game and only enable them when appropriate. Both GPU manufacturers can also set the specific size of the Resizable Bar to squeeze out as much performance as possible. With this mod, older systems can have an opportunity to get this extra performance that can only be attained with Resizable Bar. This is particularly useful for users who want to upgrade their old machines with a brand-new GPU that supports Resizable Bar. Some GPUs, like Intel's Arc A-series GPUs, are so sensitive to Resizable Bar that Intel requires it to be enabled to get good performance. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Aaron Klotz is a freelance writer for Tom’s Hardware US, covering news topics related to computer hardware such as CPUs, and graphics cards. AMD 170W Granite Ridge Zen 5 CPUs and 128W Strix Point APUs revealed in shipping manifest — 16-core 'Fire Range' mobile CPUs also coming AMD says the UCIe universal chiplet interface will create a whole ecosystem — custom multi-chiplet designs are the future OpenAI and Microsoft reportedly planning  $100 billion datacenter project for an AI supercomputer By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}