{
    "title": "Snapdragon X Elite 12-Core CPU Benchmarks Leak Out: On Par With Current-Gen \nAMD & Intel Chips",
    "date": "2/25/2024",
    "url": "https://wccftech.com/snapdragon-x-elite-12-core-cpu-benchmarks-leak-on-par-current-gen-amd-intel-chips/",
    "text": "Latest benchmarks of Qualcomm's upcoming Snapdragon X Elite CPU have leaked out in its 12-core variation which is on par with modern AMD & Intel chips. The top Qualcomm Snapdragon X Elite CPU will come in 12-core configurations with a total of 8 high-performance and 4 efficiency-optimized cores based on TSMC's 4nm process node. The clock speeds for the chip will be set at 4.3 GHz across 1-2 cores and 3.8 GHz for all-core while adopting a large 42 MB cache. The chip was leaked out earlier in Geekbench 6 where it showed competitive performance but the latest results give us a look at what we can expect from the final silicon that is heading out around the mid of 2024. The Snapdragon X Elite 12 Core CPU was running at a listed base frequency of 4.01 GHz which is its average clock speed. The CPU is identified as the \"ARMv8 (64-bit) Family 8 Model 1 Revision 201\" with the \"X1E80100\" model number and was running on a Qualcomm ZH-WXX platform with 32 GB of LPDDR5x memory. In terms of performance, the CPU scored 2574 points in the single-core and 12,562 points in the multi-core tests. Based on the performance results, we can see that the chip sits in a good position against the other competing chips from AMD and Intel. The Intel Core Ultra 9 185H takes a lead in the multi-threaded benchmarks while the Ryzen 9 7940HS which is essentially the same spec as the 8840HS is slightly behind but that's to be expected since it's an 8-core chip versus the 12-core Snapdragon & 16 core Intel offering. In its official benchmarks, Qualcomm has put out some big claims against the latest chips from Apple such as M3, and also highlighted some impressive efficiency results. Whether those turn out to be true is something that we have to wait and see but with launch closing in on us, we'll have our answer soon. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}