{
    "title": "AMD Ryzen 5 7640HS vs AMD Ryzen 7 4700U vs AMD Ryzen 7 PRO 7840HS",
    "date": "3/27/2024",
    "url": "https://www.notebookcheck.net/R5-7640HS-vs-R7-4700U-vs-R7-PRO-7840HS_14950_11683_15054.247596.0.html",
    "text": "The Ryzen 5 7640HS is an upper mid-range processor (APU) of the Phoenix product family. It was brought to life in H1 2023 and it has 6 SMT-enabled Zen 4 cores (12 threads) running at 4.3 GHz to 5.0 GHz. The laptop chip is one of the first to feature Ryzen AI, AMD's answer to Intel's DL Boost and GNA technologies. The Radeon 760M iGPU is responsible for carrying out 3D calculations and similar duties. \nArchitecture & Features \nPhoenix family chips are powered by the Zen 4 architecture, much like Dragon Range family chips are. The latter however lacks hardware AI workload acceleration capabilities that Phoenix has. \nMore importantly, Zen 4 introduces AVX512 support (Zen 3-powered chips did not have that) and, thanks to a plethora of other improvements including larger caches/registers/buffers across the board, is set to bring a double-digit IPC improvement. \nElsewhere, the 7640HS has 16 MB of L3 cache and a super-fast DDR5-5600 / LPDDR5x-7500 RAM controller. USB 4 (and thus Thunderbolt) is supported natively and so is PCIe 4. In fact, 20 PCIe 4 lanes are on offer; data transfer speeds of up to 7.8 GB/s will be possible provided a sufficiently fast NVMe SSD is used. \nSystems powered by this Ryzen 5 series chip are expected to run 64-bit Windows 11, 64-bit Windows 10, or Linux. Please note that the APU is not overclockable and neither will you be able to replace it with a faster one as it gets soldered down permanently (FP7, FP7r2, FP8 socket interfaces). \nPerformance \nThe average 7640HS in our database is about as fast as the Ryzen 9 5900HX, Ryzen 7 6800H, Ryzen 7 7736U and also the Core i5-12500H, as far as multi-thread benchmark scores are concerned. This is a good if not record-breaking result as of mid 2023. Such a CPU will handle pretty much any task you can throw at it, gaming included. \nYour mileage may vary depending on how high the CPU power limits are and how competent the cooling solution of your system is. \nGraphics \nThe Radeon 760M has 8 CUs (512 shaders) running at up to 2,600 MHz. While this is not the best graphics adapter for gaming as it's only just fast enough for low quality settings and resolutions such as 1600 x 900, it will let you connect up to four SUHD 4320p monitors and it also HW-encodes and HW-decodes the most widely used video codecs such as AV1, HEVC and AVC. \nPower consumption \nThe 7640HS has a long-term power limit (default TDP) of 35 W to 54 W, giving laptop makers a choice between improving battery life and giving the system they are working on more oomph. Either way, an active cooling solution is a must for any system powered by this chip. \nThe APU is built with TSMC's 4 nm process for high, as of late 2023, energy efficiency. The Ryzen 5 7640HS is an upper mid-range processor (APU) of the Phoenix product family. It was brought to life in H1 2023 and it has 6 SMT-enabled Zen 4 cores (12 threads) running at 4.3 GHz to 5.0 GHz. The laptop chip is one of the first to feature Ryzen AI, AMD's answer to Intel's DL Boost and GNA technologies. The Radeon 760M iGPU is responsible for carrying out 3D calculations and similar duties. Architecture & Features Phoenix family chips are powered by the Zen 4 architecture, much like Dragon Range family chips are. The latter however lacks hardware AI workload acceleration capabilities that Phoenix has. More importantly, Zen 4 introduces AVX512 support (Zen 3-powered chips did not have that) and, thanks to a plethora of other improvements including larger caches/registers/buffers across the board, is set to bring a double-digit IPC improvement. Elsewhere, the 7640HS has 16 MB of L3 cache and a super-fast DDR5-5600 / LPDDR5x-7500 RAM controller. USB 4 (and thus Thunderbolt) is supported natively and so is PCIe 4. In fact, 20 PCIe 4 lanes are on offer; data transfer speeds of up to 7.8 GB/s will be possible provided a sufficiently fast NVMe SSD is used. Systems powered by this Ryzen 5 series chip are expected to run 64-bit Windows 11, 64-bit Windows 10, or Linux. Please note that the APU is not overclockable and neither will you be able to replace it with a faster one as it gets soldered down permanently (FP7, FP7r2, FP8 socket interfaces). Performance The average 7640HS in our database is about as fast as the Ryzen 9 5900HX, Ryzen 7 6800H, Ryzen 7 7736U and also the Core i5-12500H, as far as multi-thread benchmark scores are concerned. This is a good if not record-breaking result as of mid 2023. Such a CPU will handle pretty much any task you can throw at it, gaming included. Your mileage may vary depending on how high the CPU power limits are and how competent the cooling solution of your system is. Graphics The Radeon 760M has 8 CUs (512 shaders) running at up to 2,600 MHz. While this is not the best graphics adapter for gaming as it's only just fast enough for low quality settings and resolutions such as 1600 x 900, it will let you connect up to four SUHD 4320p monitors and it also HW-encodes and HW-decodes the most widely used video codecs such as AV1, HEVC and AVC. Power consumption The 7640HS has a long-term power limit (default TDP) of 35 W to 54 W, giving laptop makers a choice between improving battery life and giving the system they are working on more oomph. Either way, an active cooling solution is a must for any system powered by this chip. The APU is built with TSMC's 4 nm process for high, as of late 2023, energy efficiency. The AMD Ryzen 7 4700U is a processor for thin and light laptops based on the Renoir architecture. The 4700U integrates all eight cores based on the Zen 2 microarchitecture. They are clocked at 2 (guaranteed base clock) to 4.1 GHz (Turbo). There is no support for the thread-doubling SMT tech. The chip is manufactured on the modern 7 nm TSMC process and partly thanks to it AMD advertises a 2x improved performance per Watt for the Renoir chips. Compared to the faster R7 4800U, the 4700U offers slightly lower clock speeds and no support for SMT / Hyperthreading. \nIn addition to the eight CPU cores, the APU also integrates a Radeon RX Vega 7 integrated graphics card with 7 CUs and up to 1600 MHz. The dual channel memory controller supports DDR4-3200 and energy efficient LPDDR4-4266 RAM. Furthermore, 8 MB level 3 cache can be found on the chip. See our hub page on the Renoir Processors for more information. \nPerformance \nThe average 4700U in our database proves to be a rather competent little processor. It trades blows with the much more power-hungry Intel Core i7-10750H, as far as multi-thread benchmark scores are concerned. While it fails to get far enough away from the more affordable Ryzen 5 4600U, this Ryzen 7 is still a good CPU for most tasks. \nYour mileage may vary depending on how competent the cooling solution of your laptop is and how high the CPU power limits are. \nPower consumption \nThe Ryzen 7 4700U is a 15 W chip. However, laptop makers are allowed to change that value to anything between 10 W and 25 W, with clock speeds and long-term performance changing accordingly as a result. By going for the lowest value, it is possible to build a passively cooled system around the APU. \nThe fairly modern 7 nm TSMC process this Ryzen is manufactured on makes for above average, as of mid 2022, energy efficiency. The AMD Ryzen 7 4700U is a processor for thin and light laptops based on the Renoir architecture. The 4700U integrates all eight cores based on the Zen 2 microarchitecture. They are clocked at 2 (guaranteed base clock) to 4.1 GHz (Turbo). There is no support for the thread-doubling SMT tech. The chip is manufactured on the modern 7 nm TSMC process and partly thanks to it AMD advertises a 2x improved performance per Watt for the Renoir chips. Compared to the faster R7 4800U, the 4700U offers slightly lower clock speeds and no support for SMT / Hyperthreading. In addition to the eight CPU cores, the APU also integrates a Radeon RX Vega 7 integrated graphics card with 7 CUs and up to 1600 MHz. The dual channel memory controller supports DDR4-3200 and energy efficient LPDDR4-4266 RAM. Furthermore, 8 MB level 3 cache can be found on the chip. See our hub page on the Renoir Processors for more information. Performance The average 4700U in our database proves to be a rather competent little processor. It trades blows with the much more power-hungry Intel Core i7-10750H, as far as multi-thread benchmark scores are concerned. While it fails to get far enough away from the more affordable Ryzen 5 4600U, this Ryzen 7 is still a good CPU for most tasks. Your mileage may vary depending on how competent the cooling solution of your laptop is and how high the CPU power limits are. Power consumption The Ryzen 7 4700U is a 15 W chip. However, laptop makers are allowed to change that value to anything between 10 W and 25 W, with clock speeds and long-term performance changing accordingly as a result. By going for the lowest value, it is possible to build a passively cooled system around the APU. The fairly modern 7 nm TSMC process this Ryzen is manufactured on makes for above average, as of mid 2022, energy efficiency. The AMD Ryzen 7 PRO 7840HS is a fast high-end laptop processor of the Phoenix series. It offers 8 cores (octa core) based on the Zen 4 architecture that supports hyperthreading (16 threads). The cores clock from 3.8 (base) up to 5.1 GHz (single core boost). The processor includes 8 MB L2 cache and 16 MB L3 cache. \nCompared to the consumer Ryzen 7 7840HS, the PRO models offer additional security, manageability, and reliability features designed for professional users and workstation environments. \nThe performance of the R7 PRO 7840HS is only slightly below the fastest model, the R9 PRO 7940HS, as the clock speed difference is only minimal (e.g. -100 MHz / 2% slower single core boost). Therefore, the CPU should also perform slightly higher than the old top model Ryzen 9 6980HX (8 Zen 3 cores with up to 4.9 GHz) at 54W TDP and Ryzen 9 6980HS at 35W TDP. Compared to the higher end Dragon Range series, the 7840HS should be similar to the Ryzen 7 7745HX (also 8 Zen 4 cores, max 5.1 GHz, 55W TDP, 32 MB L3). \nThe chip integrates a modern and fasts RDNA 3 graphics card (iGPU) called Radeon 780M with 12 CUs and up to 2.7 GHz clock speed. Furthermore, the Phoenix series include a video engine with AV1 de- and encoding, a new Xilinx FPGA based XDNA AI accelerator (Ryzen AI) that should be faster than the AI engine in the Apple M2 SOC and a dual-channel DDR5-5600 / LPDDR5x-7500 memory controller (with ECC support). The connectivity features includes 2 possible USB 4 (40 Gbps) ports and 20 PCIe 4.0 lanes for a GPU and SSDs. \nThe Phoenix series uses a single monolithic design (unlike the chiplet design of the 7045HX series) and is manufactured in the modern 4nm process at TSMC. The TDP can be configured between 35 and 45 Watt. The AMD Ryzen 7 PRO 7840HS is a fast high-end laptop processor of the Phoenix series. It offers 8 cores (octa core) based on the Zen 4 architecture that supports hyperthreading (16 threads). The cores clock from 3.8 (base) up to 5.1 GHz (single core boost). The processor includes 8 MB L2 cache and 16 MB L3 cache. Compared to the consumer Ryzen 7 7840HS, the PRO models offer additional security, manageability, and reliability features designed for professional users and workstation environments. The performance of the R7 PRO 7840HS is only slightly below the fastest model, the R9 PRO 7940HS, as the clock speed difference is only minimal (e.g. -100 MHz / 2% slower single core boost). Therefore, the CPU should also perform slightly higher than the old top model Ryzen 9 6980HX (8 Zen 3 cores with up to 4.9 GHz) at 54W TDP and Ryzen 9 6980HS at 35W TDP. Compared to the higher end Dragon Range series, the 7840HS should be similar to the Ryzen 7 7745HX (also 8 Zen 4 cores, max 5.1 GHz, 55W TDP, 32 MB L3). The chip integrates a modern and fasts RDNA 3 graphics card (iGPU) called Radeon 780M with 12 CUs and up to 2.7 GHz clock speed. Furthermore, the Phoenix series include a video engine with AV1 de- and encoding, a new Xilinx FPGA based XDNA AI accelerator (Ryzen AI) that should be faster than the AI engine in the Apple M2 SOC and a dual-channel DDR5-5600 / LPDDR5x-7500 memory controller (with ECC support). The connectivity features includes 2 possible USB 4 (40 Gbps) ports and 20 PCIe 4.0 lanes for a GPU and SSDs. The Phoenix series uses a single monolithic design (unlike the chiplet design of the 7045HX series) and is manufactured in the modern 4nm process at TSMC. The TDP can be configured between 35 and 45 Watt. #0 checking url part for id 14950 +0s ... 0s #1 checking url part for id 11683 +0s ... 0s #2 checking url part for id 15054 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.049s ... 0.05s #6 did output specs +0s ... 0.051s #7 getting avg benchmarks for device 14950 +0.017s ... 0.067s #8 got single benchmarks 14950 +0.011s ... 0.079s #9 getting avg benchmarks for device 11683 +0.017s ... 0.096s #10 got single benchmarks 11683 +0.058s ... 0.154s #11 getting avg benchmarks for device 15054 +0.013s ... 0.167s #12 got single benchmarks 15054 +0.011s ... 0.178s #13 got avg benchmarks for devices +0s ... 0.178s #14 min, max, avg, median took s +0.342s ... 0.52s #15 return log +0s ... 0.52s "
}