{
    "title": null,
    "date": "3/17/2024",
    "url": "https://www.defenseworld.net/2024/03/17/insider-selling-advanced-micro-devices-inc-nasdaqamd-ceo-sells-125000-shares-of-stock.html",
    "text": "Posted by Defense World Staff on Mar 17th, 2024 Advanced Micro Devices, Inc. (NASDAQ:AMD – Get Free Report) CEO Lisa T. Su sold 125,000 shares of the business’s stock in a transaction that occurred on Wednesday, March 13th. The shares were sold at an average price of $195.13, for a total value of $24,391,250.00. Following the sale, the chief executive officer now owns 3,222,230 shares of the company’s stock, valued at approximately $628,753,739.90. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this link. NASDAQ AMD opened at $191.06 on Friday. The company has a quick ratio of 1.86, a current ratio of 2.51 and a debt-to-equity ratio of 0.03. Advanced Micro Devices, Inc. has a twelve month low of $81.02 and a twelve month high of $227.30. The firm has a market capitalization of $305.70 billion, a PE ratio of 367.42, a P/E/G ratio of 2.93 and a beta of 1.66. The stock’s 50 day moving average is $176.17 and its 200 day moving average is $136.89. Advanced Micro Devices (NASDAQ:AMD – Get Free Report) last announced its quarterly earnings data on Tuesday, January 30th. The semiconductor manufacturer reported $0.77 earnings per share (EPS) for the quarter, meeting analysts’ consensus estimates of $0.77. The business had revenue of $6.17 billion during the quarter, compared to analysts’ expectations of $6.13 billion. Advanced Micro Devices had a return on equity of 5.73% and a net margin of 3.77%. The firm’s quarterly revenue was up 10.2% compared to the same quarter last year. During the same quarter in the previous year, the business earned $0.54 earnings per share.  Research analysts forecast that  Advanced Micro Devices, Inc. will post 2.67 earnings per share for the current fiscal year. Several equities research analysts have recently commented on AMD shares. Morgan Stanley boosted their price objective on Advanced Micro Devices from $128.00 to $193.00 and gave the company an “overweight” rating in a report on Monday, January 29th. Melius raised Advanced Micro Devices from a “hold” rating to a “buy” rating in a research report on Monday, January 8th. Melius Research raised Advanced Micro Devices from a “hold” rating to a “buy” rating and set a $188.00 price objective on the stock in a research report on Monday, January 8th. Northland Securities raised Advanced Micro Devices from a “market perform” rating to an “outperform” rating and set a $195.00 price target on the stock in a research report on Wednesday, January 31st. Finally, Truist Financial upped their price target on Advanced Micro Devices from $154.00 to $174.00 and gave the company a “hold” rating in a research report on Wednesday, January 31st. Four research analysts have rated the stock with a hold rating and twenty-five have assigned  a buy rating to the stock. Based on data from MarketBeat, the company  has a consensus rating of “Moderate Buy” and a consensus price target of $181.82. View Our Latest Stock Analysis on AMD Several hedge funds have recently modified their holdings of the business. O Dell Group LLC purchased a new stake in  Advanced Micro Devices during the fourth quarter valued at $27,000.  Northwest Bank & Trust Co purchased a new stake in  Advanced Micro Devices during the fourth quarter valued at $28,000.  Bare Financial Services Inc purchased a new stake in  Advanced Micro Devices during the fourth quarter valued at $29,000.  MeadowBrook Investment Advisors LLC purchased a new stake in  Advanced Micro Devices during the fourth quarter valued at $29,000.  Finally, Gables Capital Management Inc. purchased a new stake in  Advanced Micro Devices during the fourth quarter valued at $29,000. Hedge funds and other institutional investors own  68.43% of the company’s stock. (Get Free Report) Advanced Micro Devices, Inc operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products.    Receive News & Ratings for Advanced Micro Devices Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Advanced Micro Devices and related companies with MarketBeat.com's FREE daily email newsletter. Klondike Gold (CVE:KG) Trading 11.1% Higher Boyd Gaming Co. (NYSE:BYD) Major Shareholder William S. Boyd Sells 63,464 Shares "
}