{
    "title": "Razer Blade 14 gaming laptop with AMD Ryzen 9 and Nvidia RTX 4070 sees a \ngenerous discount on Best Buy",
    "date": "3/3/2024",
    "url": "https://www.notebookcheck.net/Razer-Blade-14-gaming-laptop-with-AMD-Ryzen-9-and-Nvidia-RTX-4070-sees-a-generous-discount-on-Best-Buy.809469.0.html",
    "text": "The 2023 Razer Blade is currently enjoying a $300 discount on Best Buy, bringing it from the listed price of $2,699.99 to $2,399.99. While it's still a pretty hefty price tag, the gaming laptop has many premium aspects, which, combined with the high-performance specs, do make it live up to its expensive nature to a good degree. Speaking of the specs, the 2023 Razer Blade packs a top-end Zen 4 AMD CPU. More specifically, it has the AMD Ryzen 9 7940HS, which boasts eight cores and 16 threads. Paired with the Nvidia RTX 4070, the gaming laptop can offer more than playable FPS in most games with all visual settings maxed out. In our tests, it got a respectable gaming performance rating of 68.9 points. Razer didn't skimp on storage and memory either. This configuration of the 2023 Blade comes with a 1 TB SSD and 16 GB of RAM, which we found to be easy to upgrade. As for the display, the gaming laptop enjoys an upgrade over its predecessor. While the previous model had a 16:9 panel, this one has a spacious 16:10 screen. The display also features a 240 Hz refresh rate, FreeSync Premium, and 100% DCI-P3 coverage. Regarding the design, like the other Razer Blade models, the 2023 version has a high-quality CNC build. But, yes, it does come with a bit more squarer and thicker body than the predecessor. However, the gaming laptop weighs the same as its predecessor, which is 1.8 KG. Other highlights include a large-sized click pad, a capable cooling setup that ensures no significant throttling, and a decent keyboard. You can learn more about the laptop from our in-depth review found in this link and our review video that's attached below. Disclaimer: Notebookcheck is not responsible for price changes carried out by retailers. The discounted price or deal mentioned in this item was available at the time of writing and may be subject to time restrictions and/or limited unit availability. Best Buy (linked above) "
}