{
    "title": "Canonical extends LTS support lifecycle from 10 to 12 years",
    "date": "3/26/2024",
    "url": "https://www.notebookcheck.net/Canonical-extends-LTS-support-lifecycle-from-10-to-12-years.818855.0.html",
    "text": "On October 20, 2004, Canonical uncovered the first Ubuntu Linux release, labeled 4.10 \"Warty Warthog\" and its successor, 5.04 \"Hoary Hedgehog,\" arrived in early April 2005. The first LTS (long term support) release landed on the first day of June 2006, carrying the 6.06 \"Dapper Drake\" banner. Since it was supposed to arrive as 6.04, this first long-term support version is often referred to jokingly as a \"Late To Ship\" release. The list of currently supported releases starts with the April 17, 2014-dated Ubuntu 14.04 \"Trusty Tahr\" and stops (for now) at 24.04 LTS \"Noble Numbat,\" which is scheduled to arrive at the end of next month. Yesterday, Canonical announced the expansion of both security and support coverage for all LTS releases still receiving any kind of support to no less than 12 years via the Legacy Support Ubuntu Pro add-on. By default, LTS releases receive half a decade of standard security patches on the main repository. The commitment increases to a decade on the main and universe repos for Ubuntu Pro users, who also get a phone and ticket support tier. The new Legacy Support add-on, available for a fee, extends the period mentioned above to no less than 12 years. Those still using Ubuntu 14.04 LTS, which is scheduled to get support until next month, can add two years of security maintenance with Legacy Support. Obviously, this Ubuntu Pro add-on will increase the support period for the LTS releases to come as well. More details can be found on the Ubuntu Pro and Ubuntu Legacy Support pages. Individuals and businesses looking for a mini PC-shaped Linux server can grab the AMD Ryzen 7 5700U-powered CyberGeek machine with 4/128 GB off Amazon for just $229, thanks to a $30 coupon applicable at checkout. Canonical "
}