{
    "title": "Entry-level 2023 Asus ROG Zephyrus G14 with AMD Ryzen 7 and Nvidia RTX 4050 \nnears all-time low",
    "date": "3/14/2024",
    "url": "https://www.notebookcheck.net/Entry-level-2023-Asus-ROG-Zephyrus-G14-with-AMD-Ryzen-7-and-Nvidia-RTX-4050-nears-all-time-low.813204.0.html",
    "text": "We were pretty impressed at what Asus did with its 2023 ROG Zephyrus G14. In our review, the maxed-out config got an impressive score of 90%. But yes, the topped-out config is definitely on the expensive end. Well, the good news is that the base configuration of the same gaming laptop is currently going for a lot less than what it usually does. More specifically, the entry-level 2023 Asus ROG Zephyrus G14 has dropped from $1,429.99 to $899.99 on Best Buy. While the record-low price for the laptop happens to be $849.99, the current sale price is very close. That means you're still getting a good value out of this deal. While we didn't test out the same configuration of the Zephyrus G14, we did have a look at other gaming laptops with similar internals. One of them happens to be from Asus, which is the TUF Gaming A15. It comes with the same AMD Ryzen 7 7735HS and Nvidia RTX 4050. That gaming laptop secured a score of 86% in our review. So, even though the one that's currently discounted is not a maxed-out model, the gaming performance is still good, especially for the price. Of course, the TUF Gaming A15 and this Zephyrus G14 aren't exactly the same, as the Asus ROG series is a bit more premium. Two big differences are that the ROG laptops sport a sleeker build and a better cooling setup. Moving on, the entry-level 2023 Zephyrus G14 features a 14-inch IPS screen with a 165 Hz refresh rate, 100% DCI-P3 coverage, G-Sync, and a 3 ms response time. It also supports Dolby Vision HDR, making the display good for both gaming and entertainment. Other highlights of the gaming laptop include a rich set of I/O that consists of a USB4 port, Dolby Atmos support, WiFi 6E, 76 Wh battery, and a good chiclet keyboard. You can get a better idea of the 2023 Asus ROG Zephyrus G14 from our review video attached below. Disclaimer: Notebookcheck is not responsible for price changes carried out by retailers. The discounted price or deal mentioned in this item was available at the time of writing and may be subject to time restrictions and/or limited unit availability. Best Buy (linked above) "
}