{
    "title": "Sony PS5 Pro reportedly beats AMD to AI upscaling on its own GPU",
    "date": "3/15/2024",
    "url": "https://www.pcgamesn.com/amd/sony-playstation-5-pro-pssr-beats-fsr2",
    "text": "The PlayStation 5 Pro apparently has a new resolution upscaler, called PSSR, which looks better than FSR 2 and runs on AMD GPU AI hardware. Ben Hardwidge Published: Mar 15, 2024 While the AI hardware in AMD’s latest RDNA 3 GPUs is still sadly going to waste in PC games, Sony has reportedly engineered its own resolution upscaler that uses the AI hardware in the AMD GPU found in the PlayStation 5 Pro. Apparently called PlayStation Spectral Super Resolution (PSSR), the results from Sony’s custom upscaler also reportedly look better than those from AMD’s FSR 2 tech. While Nvidia has had its own Tensor AI hardware in its gaming GPUs since the first RTX 2000-series graphics cards were launched, AMD only introduced its equivalent matrix AI cores with its current gen RDNA 4 architecture, as seen in the company’s GPUs on our best graphics card guide. Nvidia’s use of its Tensor cores for both frame generation and upscaling has given it a very clear competitive edge over AMD when it comes to both frame rates and visual fidelity, and even now AMD’s FSR 2 resolution upscaler doesn’t use the company’s AI hardware. This latest rumor comes from Moore’s Law is Dead, who appears to be on a roll of tech leaks right now, but none of this is officially confirmed, so it needs to be taken with an appropriately sized pinch of salt. In the tech gossiper’s latest video, which you can see below, Moore’s Law is Dead claims to have received a leak about the GPU found in the forthcoming PlayStation 5 Pro, which has some interesting implications for AMD’s PC gaming GPUs. For a start, the fact that another company can apparently engineer a resolution upscaler that works on AMD’s AI hardware shows the potential for these currently wasted units in AMD’s PC GPUs. The leaked document describes Sony’s PSSR tech as having inputs that are “quite similar to DLSS or FSR,” and importantly also says that there’s “no per title training needed” to get PSSR running in games. Moore’s Law is Dead also shows a comparison screenshot, showing PSSR vs FSR and temporal anti-aliasing upscaling (TUAA), but the YouTuber claims that he had to do a fair bit of manipulation on the image in order to protect his source, presumably to remove watermarks. Nevertheless, he states that the unedited picture “did pretty obviously look better than FSR 2 in that circumstance.” This rumor holds some weight as well, as previous leaks have also pointed to Sony working on a DLSS competitor.  There are some other goodies in the leak too, including claims that the AMD GPU in the PlayStation 5 Pro has 2-3x the ray tracing performance of the original PlayStation, and in some cases even up to 4x the speed. If these figures are true, they suggest that the PlayStation 5 Pro has a GPU based on a future GPU architecture, such as RDNA 4 or RDNA 5, as the increase in ray tracing performance between RDNA 2 and RDNA 3 GPUs was much smaller. Moore’s Law is Dead predicts that the GPU in the PlayStation 5 Pro will have “at least 56 compute units,” with a clock speed of at least 2.2GHz. What does this leak mean for PC gamers? Firstly, it shows the potential for AMD’s AI hardware to be used to create a decent upscaler, and secondly, it shows that we may well have some better ray tracing hardware on the way from AMD in its future graphics cards. In the meantime, if you’re looking to build a gaming PC with one of the current generation of graphics cards, check out our full GeForce RTX 4070 Super review, where we put Nvidia’s latest mid-range gaming chip through its paces. Ben Hardwidge                 A tech journalist since 1999, and a PC hardware enthusiast since 1989, Ben has seen it all, from the horrors of CGA graphics to the amazing ray-tracing GPUs of today. Ben is mainly interested in the latest CPU and graphics tech. "
}