{
    "title": "Intel has a new driver for Wi-Fi 7 adapters but they may still not work on \nAMD systems — Intel BE200/BE202 ...",
    "date": "3/2/2024",
    "url": "https://www.tomshardware.com/networking/intel-has-a-new-driver-for-wi-fi-7-adapters-but-they-may-still-not-work-on-amd-systems",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Intel claims it has fixed BE200/ BE202 compatibility issues with 'some PCs'. Intel released its new 23.30.0 Wi-Fi 7 driver for 64-bit Windows 10 and 11 and 22.160.0 driver for 32-bit Windows 10 a few days ago, fixing some known issues and extending wireless bandwidths. This also includes Windows 11 updates for the new Wi-Fi 7 adapters, the BE202 and the BE200, made readily available before January 2024. The new drivers can be downloaded from Intel's website. The main updates are provided for its latest Wi-Fi 7 adapters- the BE200 and the BE202. With this update, these adapters now support all 6 GHz bandwidth on Windows 11 while having limited functionality on Windows 10. It mentions that some Wi-Fi 7 features are not enabled as Windows 11 does not support it yet. But it does function with Wi-Fi 6E as it includes 320 MHz/ 4K QAM. One notable bug that Intel hasn't addressed renders it unusable when paired with an AMD-based system. Intel stated that it was able to fix the following issues and provided updates: When the adapter was available, Users with BE200 and BE202 Wi-Fi 7 adapters noticed incompatibility with AMD-based systems, something Intel hasn't mentioned on its specifications page. The latest driver's release notes didn't specifically say if it fixed the issue on AMD PCs, rather vaguely mentioning 'some PCs,' which could also mean it enabled compatibility with Intel CPUs older than 12th gen. At the time of release, users with Intel CPUs from the 12 gen were the ones who could use these Wi-Fi 7 adapters on Windows 11. These adapters were made available for purchase and bundled with some motherboards before January 2024, when the Wi-Fi 7 standard was finalized. At the time, Ghostmotley confirmed he tested the BE200 and the BE202 Wi-Fi 7 adapters on AMD systems with no success. They are compatible with Intel 12-gen-based PCs and above. Fast forward to today, he is still uncertain if Intel intentionally locked away this compatibility or if the AMD AGESA bug prevents these chipsets from working. Intel has been silent regarding the compatibility issue to date. AMD did not issue a disclaimer about this incompatibility for its users and motherboard vendors, putting users in a situation where they need to find out after the purchase. Despite having four variations of the BE200 adapter, there's no official clarification if any of these are compatible with AMD systems. Even with the new driver updates, being vague about its fix doesn't help its users. This is where Intel needs to step in and inform its users if they are working on a solution- or if its BE200/ BE202 works only with Intel-based PCs with Windows 11. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. So, if you're on an AMD-based system and looking to upgrade to Wi-Fi 7, it is best to stick with Qualcomm Wi-Fi 7 QCNCM865 or MediaTek Wi-Fi 7 MT7927/ RZ738 Wi-Fi 7 adapters. Banana Pi launches $30 OpenWRT Wi-Fi 6 Router with WPA3 protection, optional PoE SolidRun unveils AMD Zen 3-based Ryzen V3000 computer-on-module for networking and edge computing Best Resin 3D Printers 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}