{
    "title": "Tech Moves: Former AMD named Kymeta CEO; GitHub exec joins Twilio; DocuSign \nsecurity vet joins Proof; Fred Hutch ...",
    "date": "3/11/2024",
    "url": "https://www.geekwire.com/2024/tech-moves-former-amd-exec-takes-ceo-reins-at-kymeta-docusign-security-vet-joins-proof-fred-hutch-hires-vp/",
    "text": "by Taylor Soper on March 11, 2024 at 8:42 amMarch 11, 2024 at 10:52 am GeekWire’s in-depth startup coverage tells the stories of the Pacific Northwest entrepreneurial scene. Rick Bergman, former executive vice president at semiconductor giant AMD, joined Seattle-area mobile connectivity company Kymeta as its new CEO, effective April 1. Bergman left AMD in September after four years at the Santa Clara, Calif.-based company. He was previously CEO of Synaptics, a hardware and software giant also based in Silicon Valley. Kymeta’s current co-CEOs Doug Hutcheson and Walter Berger are retiring effective March 31. Kymeta, which was founded in 2012 with backing from Microsoft co-founder Bill Gates, makes use of an innovative type of technology called metamaterials to build antennas that can be steered by software, without moving parts. Its hybrid cellular-satellite terminals can facilitate communications in hard-to-reach areas — an application that’s been of particular interest to defense customers. The company raised $84 million in 2022; total funding to date is nearly $400 million. Kymeta also announced that former Boeing exec Nicole Piasecki will be its chair of the board, a role Hutcheson previously held. Other key personnel changes across Pacific Northwest tech: Track all of GeekWire’s in-depth startup coverage: Sign up for the weekly startup email newsletter; check out the GeekWire funding tracker and venture capital directory; and follow our startup news headlines. Keep your start-up on course. In today’s unpredictable markets, innovation companies are turning to banking partners that understand the innovation economy. CIBC Innovation Banking combines the historical stability of one of North America’s leading banks with deep expertise at every stage of the start-up lifecycle. Learn how they’re helping founders stay on course. Learn more about underwritten and sponsored content on GeekWire. Seattle’s Soundry AI creates text-to-sample generator to help prompt enhanced music creation Vote for Workplace of the Year: Startups employ various methods in their commitment to culture From timber to tech: Spokane’s startup scene is ready for its big breakthrough Subscribe to GeekWire's free newsletters to catch every headline Have a scoop that you'd like GeekWire to cover? Let us know. Tech Moves: Microsoft’s new Surface and Windows chief; ex-Zillow CEO joins Match Group board; Oleria adds execs Satellite plans move ahead for Kymeta and OneWeb — and for SpaceX and T-Mobile Tech Moves: Tegria adds execs; JPMorgan leader retiring; Angi hires former Expedia exec; and more Tech Moves: AWS vet lands at health startup; Lumen hires longtime Microsoft GM; ex-Qualtrics exec joins Typeform board Catch every headline in your inbox "
}