{
    "title": "Minisforum UM773 Lite mini PC with AMD Ryzen 7 drops by 41% on Amazon",
    "date": "3/8/2024",
    "url": "https://www.notebookcheck.net/Minisforum-UM773-Lite-mini-PC-with-AMD-Ryzen-7-drops-by-41-on-Amazon.811102.0.html",
    "text": "Minisforum rolled out the UM773 Lite in the international markets a year ago. Coming with the same core features as the regular UM773, the barebone Lite variant just received a massive 41% discount on Amazon. With this deal in place, the mini PC is available for purchase at $311.92, which translates to a generous $217.98 cut from the listed price. Under the hood, the Minisforum UM773 Lite comes with the AMD Ryzen 7 7735HS. It’s the same APU that you will find in the non-Lite version of the mini PC, which means that the processing performance of the two systems is basically the same. Speaking of performance, we gave the Ryzen processor 41.1 points after running multiple benchmarks on it. Thanks to the AMD Radeon 680M iGPU, the APU of the mini PC can also handle light gaming and even run a good number of modern games at low presets. Moreover, Minisforum has integrated an effective cooling system inside the UM773 Lite. With two heat pipes, liquid metal thermal paste, and dual air outlets, the mini PC aims to offer stable performance in heavy loads. As the Minisforum UM773 Lite that’s on sale is barebone, the mini PC doesn’t come with any RAM or storage. But the good news is that it’s easy to populate the slots inside. The system can hold a 2.5-inch SATA drive, one PCIe 4.0 SSD (1 TB SAMSUNG 990 EVO curr. $89.98 on Amazon), and two DRR5 RAM sticks running at dual-channel (32 GB Crucial RAM Kit curr. $98.80 on Amazon). Besides, there are a good number of connectivity ports on the mini PC, including two USB 3.2 Gen 2 Type-A, one USB Type-C, one 40 Gbps USB4, two HDMI, and two USB 2.0 Type-A. Other highlights of the Minisforum UM773 Lite include a 0.7-liter small and compact chassis and support for triple 4K displays at 60 Hz. You can learn more from the video attached below. Disclaimer: Notebookcheck is not responsible for price changes carried out by retailers. The discounted price or deal mentioned in this item was available at the time of writing and may be subject to time restrictions and/or limited unit availability. Amazon (linked above) "
}