{
    "title": null,
    "date": "3/1/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-nasdaq-hits-record-close-as-ai-chip-giant-amd-breaks-out-dell-soars-late/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     Dow Jones futures were little changed Friday morning, along with S&P 500 futures and Nasdaq futures. The stock market rally advanced Wednesday following a PCE inflation report that wasn't worse than feared. The S&P 500 and Nasdaq set all-time closing highs. The small-cap Russell 2000 briefly hit a 52-week high, extending solid weekly gains. Nvidia (NVDA) rival Advanced Micro Devices (AMD) broke out of a short consolidation. Airbnb (ABNB) and Lennar (LEN) reclaimed buy points. After Thursday's close, Dell Technologies (DELL), NetApp (NTAP), Elastic (ESTC), Zscaler (ZS), Veeva Systems (VEEV), Autodesk (ADSK) and SoundHound AI (SOUN) reported. Dell stock and NetApp were huge overnight earnings winners, with the latter set to break out. Autodesk also rose late. But ESTC stock and SoundHound sold off while Zscaler and Veeva retreated. New York Community Bancorp (NYCB) late Thursday warned of \"internal controls\" issues and reported a Q4 loss that was far worse than first disclosed. Chairman Alessandro DiNello is taking over as CEO immediately, replacing Thomas Cangemi. NYCB stock plunged early Friday. In late January, NYCB crashed after reporting a surprise loss and some credit concerns. That hit regional bank stocks, though they quickly stabilized. Nvidia and Zscaler stock are on IBD Leaderboard and the IBD 50. Nvidia stock is on the IBD Big Cap 20. AMD was Wednesday's IBD Stock Of The Day. Dow Jones futures edged lower vs. fair value. S&P 500 futures were flat. Nasdaq 100 futures rose 0.1%. Crude oil futures rose more than 1%, above $79 a barrel. The 10-year Treasury yield edged up to 4.26%. Overnight, the official China manufacturing index edged down 0.1 point in February to 49.1, in line with views and still below the neutral 50 level. Caixin's China manufacturing index edged up 0.1 point to 50.9. Remember that overnight action in Dow futures and elsewhere doesn't necessarily translate into actual trading in the next regular stock market session. Join IBD experts as they analyze leading stocks and the market on IBD Live Dell earnings beat, with the tech giant citing strong demand for AI servers. Shares of the PC and server maker spiked higher in overnight trade. Dell stock is extended from last week's 10-week line rebound. Zscaler earnings beat and the cybersecurity firm guided up. ZS stock fell sharply in extended action, signaling a 50-day/10-week line test. Zscaler rose 1.9% to 241.87 in Thursday's regular session. Elastic earnings topped while guidance was in line. ESTC stock tumbled overnight, signaling a move to or below the 50-day line and a prior buy point. Shares rose 3.2% on Thursday to 133.81, just clearing a three-weeks-tight entry of 133.59, modestly above a prior zone and following a 10-week line rebound. That offered an entry into Elastic stock, but the earnings report raised the risks. Veeva earnings topped, but VEEV stock fell modestly in extended trade. The life sciences software maker edged up 14 cents to 255.51 on Thursday, right around the top of a five-month consolidation. However, Veeva stock is at the top of the buy zone from a 214.54 handle entry cleared earlier this month. Autodesk beat Q4 views, but guided slightly lower on Q1 and fiscal 2025 EPS. Still, ADSK stock jumped in overnight action. Shares climbed 1.1% to 258.17 on Thursday, finding support at the 21-day line. Autodesk stock is still in range of last week's 10-week line test, the second such test since a late 2023 breakout. NetApp earnings were better than expected. NTAP stock surged in premarket trade, signaling a gap out of a flat base, base-on-base formation. The storage giant follows strong results from Pure Storage (PSTG) and Nutanix (NTNX) on Wednesday night. SoundHound AI reported a wider-than-expected Q4 loss with revenue falling short. SOUN stock dived before Friday's open. But SoundHound stock skyrocketed 347% in February, with much of that following Nvidia's disclosure of a SOUN stake. The stock market rally got off to a solid start Thursday as investors initially cheered the PCE inflation report. The major indexes soon slashed gains, but then rebounded again. The Dow Jones Industrial Average edged up 0.1% in Thursday's stock market trading. The S&P 500 index rose 0.5%, an all-time closing high. The Nasdaq composite gained 0.8%, its first record close since 2021 and back above 16,000. The small-cap Russell 2000 climbed 0.7%, pulling back after briefly topping its late December peak and set a new 22-month best. For the major indexes, a longer pause would be healthy, letting the major indexes catch up and more stocks forge bases, handles or bullish pullbacks. The Nasdaq's sideways action over the past week, and more broadly since Feb. 12, has helped in this regard. But it would good to see small caps break out from their current range. Ideally, the market pauses for a few days or couple of weeks, then moves higher, with small caps in the lead. But the market is going to do what it's going to do. The Nasdaq is 4.8% above the 50-day line, not quite extended but very close to being so once again While AI and tech stocks are still leading the rally, with AMD a standout Thursday, a variety of stocks and groups are taking part. U.S. crude oil prices dipped 0.4% to $78.26 a barrel, climbing 3.2% for the month. The 10-year Treasury yield dipped 2 basis points to 4.25%, but leapt 29 basis points in February. Among growth ETFs, the iShares Expanded Tech-Software Sector ETF (IGV) climbed 0.8%. Elastic stock, Zscaler and Autodesk are IGV members. The VanEck Vectors Semiconductor ETF (SMH) jumped 2.2%. AMD is a major SMH holding, with Nvidia No. 1. Reflecting more-speculative story stocks, ARK Innovation ETF (ARKK) edged up 0.2% and ARK Genomics ETF (ARKG) slumped 2.4%. SPDR S&P Metals & Mining ETF (XME) increased 1.8% and the Global X U.S. Infrastructure Development ETF (PAVE) added 0.8%. U.S. Global Jets ETF (JETS) edged up 0.25%. SPDR S&P Homebuilders ETF (XHB) stepped up 0.8%, with Lennar stock in XHB. The Energy Select SPDR ETF (XLE) climbed 0.5% and the Health Care Select Sector SPDR Fund (XLV) fell 0.8%. The Industrial Select Sector SPDR Fund (XLI) rose 0.3%. The Financial Select SPDR ETF (XLF) lost a fraction. Time The Market With IBD's ETF Market Strategy AMD stock shot up 9% to 192.50 in above-average volume to a new high. The AI chip play cleared a short consolidation that wasn't quite long enough to be a flat base. But investors could have used 184.92 as a legitimate buy point. The buy zone runs to 194.17. The relative strength line hit a new high, bullish confirmation of the breakout. The RS line, the blue line in the charts provided, tracks a stock's performance vs. the S&P 500. AMD stock rose slightly overnight, perhaps on Dell's bullish comments about AI servers, implying strong demand for AI chips. For its part, Nvidia stock climbed 1.9% to 791.12 on Thursday, still hitting resistance at the 800 level. Airbnb stock rose 2.6% to 157.43, moving back above a 154.95 buy point, according to MarketSmith analysis. The room booking site has some wild action on a daily chart, but shows a little less turbulence on a weekly chart. There's an argument that investors should use the 10-week or 21-day line to initiate a position, giving Airbnb's up-and-down action. Lennar stock gained 3% to 158.35, back above a 156.01 flat-base buy point. The homebuilder broke out on Feb. 12, but fell back as hot inflation reports pushed Treasury yields and mortgage rates higher. But LEN stock found support at its 50-day line and soon set up again. The market rally continues to act well. The Nasdaq is not extended while small caps are testing major resistance. Investors could choose to make some incremental buys, but holding steady with current exposure is a solid play. Make sure you have your watchlists ready. With the Nasdaq little changed since Feb. 12 and the Russell 2000 right at late 2023 highs, a number of quality stocks have been setting up, and not just in tech. The work you put in outside of market hours — running screens, analyzing charts, reviewing past trades and more — is crucial to successful trading. Having your targets ready and being engaged means you can make quick but informed decisions as stocks flash buy signals, rather than rely on impulsive or delayed trades. Read The Big Picture every day to stay in sync with the market direction and leading stocks and sectors. Please follow Ed Carson on Threads at @edcarson1971 and X/Twitter at @IBD_ECarson for stock market updates and more. YOU MAY ALSO LIKE: Want To Get Quick Profits And Avoid Big Losses? Try SwingTrader Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today The Fed Just Leashed The S&P 500 And Raised The Bar For Rate Cuts Market Rally Hits New Milestone, But This Risk Returns 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}