{
    "title": "China Plans to Ban AMD and Intel Chips from Government Devices",
    "date": "3/25/2024",
    "url": "https://techreport.com/news/china-ban-amd-and-intel-chips-government-devices/",
    "text": " China has rolled out a new directive that will slowly phase out US-made processors like Intel and AMD from government devices and servers, according to a report released by The Financial Times on Sunday. This includes all government agencies in the country above the township level. Referred to as the new PC, laptop, and server guidelines, the idea was first proposed on December 26 2023 by the Finance Ministry and the Ministry of Industry and Information Technology (MIIT). Speaking about the guidelines, a local government official managing IT system substitution said it is the “first nationwide, detailed and clear instructions for the promotion of Xin Chuang (innovation)”. The authorities want the government agencies to purchase “safe and reliable” processors. A list of 18 safe processors has already been released which includes many popular Chinese manufacturers such as Huawei and Phytium. For other companies, they’ll have to submit their product’s complete R&D documentation.  The regulators will decide whether it’s fit for China based on its design, development, and production. Given the issues between the two nations right now, US companies are not likely to make the cut. Both Microsoft and Intel have declined to comment while AMD is yet to respond to the comment request. Read more: Baidu turns to Huawei for AI chips as an alternative to Nvidia One of the reasons cited behind this sudden switch to domestic alternatives is that China is trying to reduce dependency on other countries, especially the US. Previously, China relied heavily on the US for most of its technical resources. However, the US took a series of steps that limited their access and forced them to boost their own tech industry. As per reports, US sanctions directly boosted China’s chip-making industry. Its top 10 equipment manufacturers reported a 39% boost in revenue in the first half of 2023 compared to the previous year. Now that China has decided to punch back, it will be interesting to see how this move impacts the businesses of Intel, AMD, and others. This might also be just a start of completely phasing out US chips from the Chinese markets. Experts believe that this ban can be extended to the entire Chinese market in the coming years. Read more: China cites national security fears & ousts micron chips Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Krishi is an eager Tech Journalist and content writer for both B2B and B2C, with a focus on making the process of purchasing software easier for businesses and enhancing their online presence and SEO. Krishi has a special skill set in writing about technology news, creating educational content on customer relationship management (CRM) software, and recommending project management tools that can help small businesses increase their revenue. Alongside his writing and blogging work, Krishi's other hobbies include studying the financial markets and cricket. As social media consumption habits have increased today, internet advertisements on extensively watched social media platforms have become a significant online revenue source. Similarly, to secure the ad deals with... Andre Outbertg, the owner of the 150k+ Telegram channel Crypto Whale Pump, shared four presales he’s invested in. Among them, Bitcoin Minetrix (BTCMTX) stands out with the highest funding raised... REGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website. Crypto promotions on this site do not comply with the UK Financial Promotions Regime and is not intended for UK consumers. © Copyright 2024 Techreport. All Rights Reserved. "
}