{
    "title": null,
    "date": "3/16/2024",
    "url": "https://www.notebookcheck.net/Asus-ROG-Ally-gaming-handheld-sees-up-to-200-discount-makes-MSI-Claw-an-even-tougher-sell.813646.0.html",
    "text": "Asus has dropped the prices of its ROG Ally gaming handheld at Best Buy. While this is great for all, it’s bad news for the MSI Claw, which recently got released. With the variant featuring the AMD Ryzen Z1 Extreme at $599.99 and Ryzen Z1 at $399.99, Asus’s offering is currently delivering a much better value than the Intel handheld. To compare, the MSI Claw A1M with Intel Core Ultra 5 135H is priced at $699, and Intel Core Ultra 7 155H is at $749. Of course, if you were to compare these Intel handhelds, the ROG Ally with the regular AMD Ryzen Z1 wouldn’t fare well. After all, it’s a scaled-down Zen 4 processor with fewer CPU cores, threads, and GPU cores. So, the ROG Ally with the Z1 Extreme is the right pick if you want to play the latest games with decent visual settings. That said, as the MSI Claw has recently launched, we have yet to see a proper head-to-head comparison against the topped-out gaming handheld from Asus. However, we did get a benchmark comparison prior to the official launch of the MSI Claw. In that, the Intel handheld with Core Ultra 7 155H struggled against the AMD Z1 Extreme of Asus ROG Ally. While that was a pre-launch comparison, the AMD Radeon 780M still stands as a more capable GPU than the Intel Arc iGPU found inside the new Meteor Lake chips. But again, the Radeon 780M is only present in the Asus ROG Ally with the Ryzen Z1 Extreme processor. The cheaper one with the Ryzen Z1 has the Radeon 740M, which is more suitable for older games and emulations. You can get a much better idea about the gaming handheld from our review video attached below. Disclaimer: Notebookcheck is not responsible for price changes carried out by retailers. The discounted price or deal mentioned in this item was available at the time of writing and may be subject to time restrictions and/or limited unit availability. Best Buy (linked above) "
}