{
    "title": "AMD's frame generation (AFMF) debuts on January 24, but will NVIDIA respond \nwith its own take?",
    "date": "1/11/2024",
    "url": "https://www.tweaktown.com/news/95533/amds-frame-generation-afmf-debuts-on-january-24-but-will-nvidia-respond-with-its-own-take/index.html",
    "text": "Here's some good news for PC gamers with a graphics card from Team Red - AMD's Fluid Motion Frames tech is officially debuting on January 24. Initially, AFMF only worked with RX 7000 graphics cards, but that was soon expanded to include last-gen RX 6000 series GPUs (Image Credit: ASRock) AFMF for short, also known as frame generation (as first seen with NVIDIA DLSS 3), the technology has been in preview for quite some time - since September 2023 in fact - but it's about to graduate to full release. AFMF is frame generation at the driver level, so it can work across all games as a result, with caveats. Firstly, it's not going to give you the same results as FSR 3 (which incorporates frame generation, too, but does a lot more than just this - though games have to be coded to support it, of course). Still, AFMF is certainly well worth having, though the other catch is it only works with more modern AMD graphics cards, RX 7000 and RX 6000 models (and 700M series graphics, too). It makes for an interesting move because while AMD has been consistently lagging behind DLSS with its FSR tech, when it comes to an all-encompassing driver-based effort, namely AFMF, NVIDIA doesn't have an equivalent - and may feel pressured to play catch-up here and implement one eventually. As AMD's Aaron Steinman (Senior Manager, Radeon Product Management) told PC Gamer: \"I think what we're gonna start seeing, DLSS is only available on certain solutions, so either NVIDIA is going to have to benefit from our solution because we did make it open-source and cross-vendor, or they're probably going to need to do something similar.\" NVIDIA will also have to deal with the launch of the RX 7600 XT on January 24, so this is a double whammy. That new take on the lower-end RDNA 3 graphics card, revealed at CES 2024, doubles up the VRAM to 16GB and could be a popular wallet-friendly choice for PC gamers. Especially when backed up with the prospect of AFMF helping to boost frame rates. Darren Allan Darren has written for numerous magazines and websites in the technology world for almost 30 years, including TechRadar, PC Gamer, Eurogamer, Computeractive, and many more. He worked on his first magazine (PC Home) long before Google and most of the rest of the web existed. In his spare time, he can be found gaming, going to the gym, and writing books (his debut novel – ‘I Know What You Did Last Supper’ – was published by Hachette UK in 2013). Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}