{
    "title": "Best GPU for Destiny 2 - graphics cards from AMD and Nvidia",
    "date": "1/9/2024",
    "url": "https://www.videogamer.com/tech/gpu/best-for-destiny-2/",
    "text": "Posted in Tech Video Gamer is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more Shop on Amazon Shop on Amazon Shop on Amazon If you’re looking for the best GPU for Destiny 2, we’ve got you covered right here with our top picks. Destiny 2: Lightfall is out for all to play. Even though there has been some backlash to the Destiny 2 Lightfall campaign, many are enjoying the game. If you are in the process of building or upgrading your gaming PC, it makes a lot of sense to base your choice around the games you want to play. Or at the very least make sure any GPU you get can support them. With that in mind, we’ve brought you our picks for the best GPUs for Destiny 2: Lightfall. With all of these, you can be confident you will get a good performance out of the game. Just like the best GPUs for Warzone 2, these cards are powerful and especially perform well at 1080p, giving you access to the higher frame rates that can, in turn, give you a competitive advantage. This means they will need to be powerful as the game itself can be very demanding. We’ve given you a detailed description of each of our three picks. This should give you a complete overview of each GPU, allowing you to decide for yourself which one best suits you. Let’s get into our picks. Base Clock 1626 MHz Boost Clock 2491 MHz VRAM 8GB Dimensions 243 x 134 x 49mm Recommended PSU 300 W Base Clock 1792 MHz Boost Clock 1875 MHz VRAM 12GB Dimensions 172 x 125 x 43mm Recommended PSU 450W Base Clock 1900MHz Boost Clock 2310MHz VRAM 16GB Dimensions 320 x 140 x 58mm Recommended PSU 700W Finding the appropriate graphics card to meet your requirements, can take some thought. What we’ve done to make things easier is separate the top GPUs into different categories. For those who are prioritising affordability, we’ve included a budget-free option. If you are seeking a cheaper option then we’d recommend checking out the best budget GPUs or best GPU under $200. Base Clock 1626 MHz Boost Clock 2491 MHz VRAM 8GB Dimensions 243 x 134 x 49mm Recommended PSU 300 W Between its tech specs, form factor, and price point, the ASUS Dual RX 6600 is, without a doubt, the number one card we’d recommend for playing Destiny 2. The game, of course, consists mainly of frenzied multi-player encounters where latency can’t be tolerated. The good news is that the RX 6600 has you covered in this regard, with a base clock of 1,626 MHz and a boost clock speed of 2,491 MHz (far above the recommended R9 390’s static 1000MHz frequency). It also has 8GB of GDDR6 memory, which allows for rapidly loading in new assets, and it has a pretty generous bandwidth limit of 224 GB/s, meaning that – even with most of the settings on high, save maybe Depth of Field and Motion Blur – you’ll be able to hit a fairly steady 90 FPS at 1080P. Read More: Best GPU for Atomic Heart In terms of its other properties, the RX 6600 is a PCIe 4.0 card but will work fine with a motherboard equipped with a PCIe 5.0 slot (although you’d be subject to slightly slower data transfer rates). It also has full DirectX 12 compatibility. Physically, the card has a nice dual-slot form factor with two fans. The compactness of it will make it much easier to ventilate than larger cards, although the fact that it only requires a 300W PSU should mean it doesn’t generate too much excess heat. We really have to recommend the RX 6600 for anyone wanting to put together a new gaming rig for Destiny 2. It has the horsepower and compatibility to blow the game right out of the water, meaning that you can focus on fighting off the ever-growing threat of the Darkness! Base Clock 1792 MHz Boost Clock 1875 MHz VRAM 12GB Dimensions 172 x 125 x 43mm Recommended PSU 450W Being a PC enthusiast on a tight budget can be challenging, but it can also present opportunities to discover some of the hidden surprises in the hardware market. As far as we’re concerned, the rather tiny MSI RTX 3060 Aero ITX OC is nothing if not a complete gem of a GPU. With 12GB of GDDR6 memory and a bandwidth ceiling of 360 GBPS, we were actually quite surprised by what this card could do. Even at the highest settings and 1440P, we still saw frame rates of over 100 FPS, which we weren’t expecting for a GPU with this price tag. Read More: Best PC case for RTX 3060 and 3060 Ti The card’s frequencies are also quite impressive, with a base clock speed of 1,792 MHz (which can be ramped up to 1,875 MHz), along with 3,584 shading units and even 28 ray-tracing cores! In terms of compatibility, it’s a PCIe 4.0 card with OpenGL 4.6 support, so you’ll be able to make use of some of the newer features coming into gaming like DLSS and Fidelity FX. And with the enhanced ray tracing cores, you can expect stunning visuals. If ray tracing is a priority for you then we’d recommend taking a look at the best GPU for ray tracing. It’s important to note the Destiny 2 doesn’t support ray tracing but if you are investing in a GPU that can be used for other AAA titles then ray tracing is a brilliant feature. Size-wise, it has to be the smallest RTX 3000 card ever, with just one fan! It’s still a dual-slot card, but this would be an absolutely fantastic option for anyone wishing to turn a repurposed office PC into a gaming powerhouse (do bear in mind, though, that a 450W PSU is recommended). So, for all of you who can’t yet invest in the latest and greatest triple-slot GPUs on the market, please do be kind to yourself and consider buying this one, especially if you’re a Destiny 2 player as it will make playing the game a very enjoyable experience indeed. Base Clock 1900MHz Boost Clock 2310MHz VRAM 16GB Dimensions 320 x 140 x 58mm Recommended PSU 700W We sat down and looked at a bunch of GPU options to try to decide which one had the best price-to-performance ratio. And, despite its rather hefty appearance, the RX 6900 XT OC from ASUS is our selection. This graphics card combines 16GB of GDDR6 memory with a bandwidth limit of 512 GBPS and has a base clock speed of 1900 MHz. Under pressure, that scales up to a fairly mighty 2310 MHz. All in all, you can expect to play Destiny 2 at 4K with all settings maxed out, and still see over 100 FPS. Read More: Is RX 6900 XT still good for gaming? In other areas, the card continues to excel: it has 5,120 shading units, which will be useful for newer titles and emulators like RPCS3 which cache shaders. Plus, there are 80 ray-tracing cores, as well as full DirectX 12 compatibility, so you’ll be able to make the most of newer AAA titles hitting the market. As mentioned, this is a pretty beefy card. The dimensions are no joke, and it has three fans, so we’d really recommend that you only throw this into the best full-tower case. In fact, as the manufacturers recommend at least a 700W PSU, you probably wouldn’t want to squeeze this into anything smaller anyway! For the money that’s being asked, we really think this is a great card with some serious juice. The fact that a 6900 XT will continue playing upcoming, demanding titles at high settings for some years to come makes it a seriously good investment, too. No, unfortunately, Destiny 2 does not support ray tracing. Destiny 2 is a fairly demanding game, especially when you turn the settings up. However, overall, it is more intensive on your graphics card. Rory Greig works as a tech writer for Videogamer. He is a writer with a strong knowledge of gaming technology and an eye for detail. He is especially interested in graphics cards and generative AI. "
}