{
    "title": "AMD discloses Zen4c core frequencies for Ryzen 8000G series",
    "date": "1/22/2024",
    "url": "https://videocardz.com/newz/amd-discloses-zen4c-core-frequencies-for-ryzen-8000g-series",
    "text": "The company fulfills its promise to disclose clocks for smaller Zen4 cores.  AMD is set to launch its Phoenix-based chips for desktops next week, marking the first update to the AMD APU series since the Ryzen 5000G series. This new series, almost four years after the Zen3 CPU architecture and three years since 5000G, introduces the Zen4-based APUs and a new platform based on the AM5 socket, supporting DDR5 memory. AMD promised to give complete clock speed information for its Ryzen processors, including Zen4 and Zen4c cores. However, the company opted not to include this information in official marketing slides at the product announcement. The Ryzen 8000G series is to feature two types of cores: the smaller Zen4c cores and the larger Zen4 cores. While both CPU cores share the same instruction support, the smaller core has less cache and is not optimized for high frequencies. The Ryzen 8000G series will feature two products with the smaller cores: the Ryzen 5 8500G and Ryzen 3 8300G. It is worth adding that the Ryzen 3 8300G will not be available in the DIY market at launch. Customers who might be considering buying the 8500G should know that these chips have both types of cores. AMD has revealed that the smaller Zen4c cores will come with a base clock of 3.2 GHz and can boost up to 3.7 GHz. In the case of the 8500G SKU, these clock speeds are much lower when compared to the Zen4 cores, which features a 4.1 GHz base clock and a boost clock of 5.0 GHz.   Ryzen 5 8500G specs, Source: AMD  This month, AMD said that the best memory configuration for the Ryzen 8000G series is DDR5-6000 MT/s, even though the official specs list it supports 5200 MT/s. This information on the memory ‘sweet spot’ comes directly from Don Waligroski, AMD’s Technical Marketing Manager, from PCWorld interview. Interestingly, AMD used even faster memory (6400 MT/s) for the official tests, notes Computerbase. This indicates that the new desktop APU series will have good memory support right away. The main purpose of desktop APUs is to provide optimal CPU and GPU performance without discrete graphics. In the case of the Ryzen 8000G series, the integrated RDNA3 graphics should offer enough power for some light gaming. The Ryzen Z1/Ryzen 7040 series, as found in many gaming handhelds, may serve as an example of what integrated RDNA3 GPUs are capable of. What potential owners of AMD APUs should pay attention to are the specs of Ryzen 8600G and 8500G SKUs. The 8500G is equipped with two Zen4 cores and four Zen4c cores, resulting in a different core layout compared to the 8600G, which exclusively uses six Zen4 cores. Moreover, the 8500G comes with a less capable iGPU, featuring only 4 RDNA3 Compute Units. This is half the cores of the integrated GPU in the 8600G. AMD has confirmed the Ryzen 8000G series pricing, with the Ryzen 7 8700G set at $329, the Ryzen 5 8600G priced at $229, and the Ryzen 5 8500G will be available for $179. The 8300G, however, will not be launched through the DIY market, and its official pricing is undisclosed. All SKUs, except for the 8300G, are scheduled to be available on January 31. Source: AMD We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}