{
    "title": null,
    "date": "1/31/2024",
    "url": "https://www.investopedia.com/5-things-to-know-before-the-stock-market-opens-january-31-2024-8553524",
    "text": "News of the day for January 31, 2024 REUTERS/Jim Young  It’s Fed decision day, with the central bank set to keep interest rates steady though Fed Chairman Jerome Powell may provide clues on when rates will be cut. Shares of Microsoft (MSFT) and Google parent Alphabet (GOOGL) fell despite earnings beats as AI buzz swirls around the tech giants, chip maker Advanced Micro Devices (AMD) disappointed with a weaker-than-expected forecast and Walmart (WMT) announced a stock split. Here’s what investors need to know today. Fed policy makers conclude their two-day meeting today, and while market participants expect the U.S. central bank to keep interest rates where they are, investor focus will be on what Fed Chairman Jerome Powell and others say on when interest rates will be cut. The Fed ratcheted interest rates up from the pandemic-era level of near zero starting in March 2022 to quash alarmingly high inflation but price pressures have cooled in recent months. After last month's policy committee meeting, Powell said that committee members had started discussing when to cut rates. Walmart (WMT) shares rose about 1% in pre-market trading following the retail giant’s announcement that stockholders will see their number of shares increase next month when the company executes a three-to-one stock split. It said the split will make it easier for employees to purchase shares in the company. At the close of business on Thursday, Feb. 23, Walmart shareholders will receive two additional shares for each one they own. Walmart stock closed Tuesday's session at $165.59, only about $4 off its all-time high. Shares of Google parent Alphabet (GOOGL) were down nearly 6% in pre-market trading as the company’s 11% increase in fourth-quarter ad revenue wasn't strong enough for investors, even as earnings beat forecasts. During its earnings conference call late Tuesday,  CEO Sundar Pichai said its new AI model, Gemini, released in December 2023, was already reducing search latency by 40% and that a Gemini Ultra version is launching soon. Microsoft's (MSFT) shares also lost ground this morning after the company reported forecast-beating results for its fiscal second quarter. Chief Executive Officer (CEO) Satya Nadella said cloud earnings were strong and that Microsoft is now “applying AI at scale.” The tech giant was early to stake its claim in the AI race through its ongoing partnership with ChatGPT-maker OpenAI as well as its own AI tools and hardware. Microsoft shares were down 0.9% in pre-market trading though are up more than 10% this year. Chipmaker Advanced Micro Devices (AMD) was down more than 5% in pre-market trading, after it forecast lower-than-expected sales in the current quarter at around $5.4 billion. The company, which has an AI server chip similar to Nvidia’s (NVDA), blamed weak demand in videogaming chips and personal computers for its downbeat outlook. AMD. “AMD Reports Fourth Quarter and Full Year 2023 Financial Results.” "
}