{
    "title": null,
    "date": "1/25/2024",
    "url": "https://finance.yahoo.com/news/whats-going-amd-stock-thursday-210135160.html",
    "text": "Advanced Micro Devices, Inc (NASDAQ:AMD) stock is trading higher Thursday as the artificial intelligence frenzy continues. UBS analyst Timothy Arcuri raised his estimates and price target on the stock. The tactical setup around earnings is complicated somewhat by the recent rally, the analyst writes. Nonetheless, the analyst is more confident in AMD’s data center GPU revenue opportunity and is significantly raising his calendar years 2024 and 2025 estimates and price target to $220. Recent channel and customer checks confirmed Arcuri’s view that AMD has a firm demand commitment for ~400k+ MI300A/X units for 2024. The analyst finds the figure fairly consistent with where we have seen demand since last summer but have been wary of double ordering and unsure of supply. After having gone back to several customers and suppliers, Arcuri is more confident that these units are real and AMD now has sufficient CoWoS capacity to do 10%+ the volumes of Nvidia Corp (NASDAQ:NVDA). Also Read: Analysts Eye AMD and Nvidia’s AI Rivalry: Who Leads the Tech Race? Even assuming a very conservative ASP (which could be as high as $20k+ for some customers), this suggests that $5 billion for data center GPU is a pedestrian target for this year, and even this implies that AMD exits the year at a run rate close to $10 billion annually, with AMD still likely to grow GPU units sequentially through much of 2025, the analyst noted. Arcuri now sees AMD annualizing $6+ in EPS exiting this year and pushing $8 annualized once he gets to the second half of 2025. The analyst still thinks the stock can keep marching higher through this year. The stock gained 143% last year, beating the broader indexes. Price Actions: AMD shares traded higher by 0.26% at $178.75 on the last check Thursday. Also Read: AMD To Surpass $2B GPU Revenue Target in 2024 – Analyst Photo via Shutterstock Date Firm Action From To Feb 2022 Bernstein Upgrades Market Perform Outperform Feb 2022 Daiwa Capital Upgrades Outperform Buy Feb 2022 Mizuho Maintains Buy View More Analyst Ratings for AMD View the Latest Analyst Ratings \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? ADVANCED MICRO DEVICES (AMD): Free Stock Analysis Report This article What's Going On With AMD Stock Thursday? originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}