{
    "title": "AMD Ryzen 7 8700G and Ryzen 5 8600G Review: Zen 4 APUs with RDNA3 Graphics",
    "date": "1/29/2024",
    "url": "https://www.anandtech.com/show/21242/amd-ryzen-7-8700g-and-ryzen-5-8600g-review/15",
    "text": "Update 02/23/24 Due to a highlighted issue with the Skin Temperature-Aware Power Management (STAPM), we retested the Ryzen 7 8700G and Ryzen 5 8600G with the latest firmware, which reflects the removal of the STAPM limitations. In the interest of full disclosure, we have kept the results from our initial review and opted to add the latest results to show any performance gains and/or regressions. We also plan to add more chips to the data in the coming days, including the Ryzen 7 7700, and more results in our integrated graphics testing with some Intel chips, including the Core i5-14600K and i5-12600K. As we've touched on over the years, the desktop processor landscape is vast, with many options ranging from entry-level chips to mid-range and flagships such as the AMD Ryzen 9 7950X3D. Many of these options require a discrete graphics card, such as an NVIDIA GeForce RTX 4070, to provide enough grunt for gaming, as they come with very basic levels of integrated graphics. AMD's Accelerated Processing Units, or APUs as they are more commonly known, bridge that gap between the entry-level and mid-range desktop market with good compute performance and offer gamers on a budget access to gaming capabilities without breaking the bank. In 2011, AMD unveiled their 'Llano' based on AMD's K10 microarchitecture, the first time AMD had packaged a CPU and GPU onto a single die in a desktop processor. This became the APU, which, compared to today's technologies and advancements in AMD's CPU architecture, is much more potent than it once was. Through the days of Trinity, Richland, and Kaveri all leaving their mark, AMD's Ryzen-based APUs through the Zen architecture and various denominations of it such as Zen 2 and Zen 3, have ultimately paved the way for Zen 4 APUs, namely the Ryzen 8000G series. AMD Ryzen 7 8700G installed into the ASUS B650-A Gaming WIFI AM5 motherboard Based on their mobile Phoenix-based architecture, the AMD Ryzen 7 8700G and Ryzen 5 8600G aim to conquer the entry-level desktop market, much like their Zen 3-based counterparts, the Ryzen 5000G series, did so back in 2021. Even today, both the Ryzen 7 5700G (9th) and Ryzen 5 5600G (3rd) feature in the top 10 best-selling CPUs at Amazon and have been a mainstay in this list for well over a year based on their low-cost and high capability in such a small package. While the Ryzen 5 8600G (and the Ryzen 3 8300G) are based on the Phoenix 2 silicon with their amalgamation of full-fat Zen 4 cores and smaller Zen 4c cores, today we're focusing on what is Phoenix mobile repackaged and repurposed for desktop APUs. So, as we've seen with AMD's mobile ported APUs on desktops over the years, they offer solid levels of gaming performance for a price, especially when combined with the fastest cores AMD offers. Both the Ryzen 7 8700G ($329) and Ryzen 5 8600G feature Zen 4 cores, which are built on the TSMC 4nm FinFET node, precisely the same as their latest Ryzen mobile counterparts; both are Phoenix silicon, except these APUs have been packaged and designed to fit within the AM5 desktop socket. As part of our analysis of both the Ryzen 7 8700G (8C/16T) and the Ryzen 5 8600G (6C/12), we're going to split things into two main areas: gaming performance, both on the RNDA3 integrated graphics compared to the previous Zen 3 based Ryzen 5000G series APUs, as well as with a discrete graphics card against other desktop chips. The other element we will analyze is the compute performance, as these are effectively lighter and more power-efficient Phoenix Zen 4 (4nm) cores designed for mobile. First, we will analyze the latest Zen 4 APUs (Ryzen 8000G) compared directly to the Zen 3 APUs (Ryzen 5000G) in gaming performance at 1080p using integrated graphics.  When comparing the Ryzen 8000G APUs to the previous Ryzen 5000G series, we saw a significant uplift in integrated graphics performance, as expected from the jump in graphics architectures (RDNA3 vs Vega). In Cyberpunk 2077 at 1080p medium, we saw an uplift of around 37% going from the Ryzen 7 5700G to the newer Ryzen 7 8700G in an apples-to-apples comparison. This shows impressive performance gains in both core and iGPU performance compared to the previous generation. When applying AMD's FidelityFX Super-Resolution (FSR 2.1) on the quality setting in Cyberpunk 2077, we achieved over 50% of the performance compared to the Ryzen 7 5700G, which is impressive. AMD FSR 2.1 is a temporal resolution upscale, allowing the game to render at a lower resolution with the aim of boosting framerates. While there are many iterations of upscale out there, both NVIDIA and AMD feature their own open source implementation of the technology.  Looking at performance in Far Cry 5 at 720p with low settings on the Radeon 700M series integrated graphics, we can see that both the Ryzen 7 8700G (780M) and Ryzen 5 8600G (760M) are around 18% quicker than the previous Ryzen 7 5700G which uses Zen 3 cores and Radeon Vega graphics cores.  We see a similar jump in performance in Grand Theft Auto V at 720p low settings, with gains of around 16% between the Ryzen 7 8700G and Ryzen 7 5700G. This shows a marked improvement in integrated graphics performance going from Vega to RDNA3, at least in a mobile-based SoC design such as this. Even though the Ryzen 6 8600G has two fewer Zen 4 cores and 4 RDNA3 CUs less than the 8700G, it still performs remarkably well at 720p, where things are more CPU limited than graphics limited, allowing the Zen 4 cores more headroom, albeit they are mobile Zen 4 cores.  Touching on the mobile Zen 4 cores on the Ryzen 7 8700G and Ryzen 5 8600G, we can see a slight variance between these chips and the desktop Raphael-based cores (TSMC 5nm). One major thing that must be highlighted is that the Ryzen 8000G series (Phoenix) is limited to a PCIe 4.0 x8 link to the graphics card slot, whereas other chips tested outside the APUs aren't bandwidth-limited. In the last CPU review with our trusty AMD Radeon RX 7950 XT graphics cards, which are being retired for newer MSI GeForce RTX 4080's (Thanks MSI), we can see in Red Dead Redemption 2 at 1080p maximum settings the Phoenix cores on the 8700G and 8600G have a slight discrepancy in performance.  While this is expected given the nature of the design between both cores (Phoenix is designed for laptops), there are some variances once things become more GPU-dependent at 1440p and 4K resolutions. However, this depends on whether or not the game is optimized well for CPU cores. As we can see in Borderlands 3 at 4K low settings, the Phoenix-based Zen 4 mobile cores don't do as well as the Raphael desktop cores. Where the GPU is king to performance at higher resolutions, the Ryzen 7 8700G and Ryzen 5 8600G are fine, but we suggest pairing a good discrete graphics card with a fully-fledged processor for the best results. After all, APUs are not designed for use with discrete graphics cards, although they can still do so. We can see that the Ryzen 7 8700G has a distinct advantage over the previous Ryzen 7 5700G and other chips we've tested in our suite when using the integrated graphics. Adding RDNA3-based graphics from the mobile side proves fruitful for gamers on a budget, and they aren't entirely fussy about having to play a game at a lower resolution. The only issue is that even the latest Ryzen 8000G APUs in relatively new titles still don't allow gamers to use more aggressive and detail-rich settings unless they are willing to suffer below 60 fps frame rates. It's not such an issue at 720p, and in titles with lower graphical demands, such as MOBAs, including League of Legends, 60 fps and above is more than achievable. As we've highlighted numerous times, while both the Ryzen 7000 series for desktops, such as the Ryzen 9 7950X and the Ryzen 8000G series, including the Ryzen 7 8700G, use Zen 4 cores, they aren't quite the same. The Ryzen 8000G series uses the same monolithic die found in AMD's Ryzen 7040 Mobile series and, as such, doesn't have the advantage of a chiplet-based design as seen in the Ryzen 7000 for desktops. One advantage of a monolithic design and one Ryzen 7040 mobile utilizes is a smaller die through the more refined TSMC 4nm node, which typically draws less power and has better power efficiency as a result. Ultimately, the chiplet-based design for Zen on desktops introduced in Zen 2 offered faster access to the L3 cache, with the I/O wholly separated from the CCX. At the same time, Zen 3 took things further with a unified Core Complex Die (CCD), which boosted gaming performance, among other things.  Taking the chiplet on desktop (Raphael Zen 4) versus the monolithic on mobile (Phoenix Zen 4) comparison into the equation, even with a higher 65 W TDP compared to what the Ryzen 7040 mobile series has on offer, we saw a consistent drop in compute performance between the two chip types. As we can see in Blender 3.6 using the Pabellon Barcelona test, the Ryzen 7 8700G with 8C/16T has a drop of around 20% in performance compared to the fully desktop Raphael-based Ryzen 7 7800X3D. While not too much of an issue when you consider the architectural differences between the chips themselves, it's worth pointing out that Raphael is a better core for tasks such as rendering than Phoenix. Update: 02/23/24 - We have included our results testing the latest firmware without STAPM implemented, so here is some extended analysis. As we can see in the Blender 3.6 Pabellon Barcelona test, we saw an increase of around 7.5% on the Ryzen 7 8700G compared to the previous firmware. This is a nice increase in performance, but the key areas where we saw most of the performance gains without STAPM are the benchmarks that took the longest to run. This is because AMD forgot to remove STAPM limitations, which is a Ryzen Mobile feature designed to throttle and constrict power based on specific thermal parameters from sensors integrated into the chassis and behind the keyboard, etc. With it removed, we do see gains of between 5 and 7.5% in our rendering benchmarks, but in tasks such as encoding and office-based applications, we actually saw some regression in some cases.  Although there isn't a 'de facto' AI benchmark currently available, iterations are using LLMs and specific models based on AI. One benchmark that uses this is UL Procyon, which includes a Windows AI inferencing benchmark. Given the AMD Ryzen 7 8700G and Ryzen 5 8600G include the Xilinx Ryzen AI Neural Processing Unit (NPU), which is an additional chip designed to tackle and bolster on-chip AI capabilities such as generative AI for better power efficiency, we can see that Ryzen AI in itself is basic, with AMD highlighting within the documentation that it only supports INT8. In the UL Windows AI Inference benchmark using the MobileNet V3 neural network, we see the Ryzen 5 8600G (6C/12T) still outperforms the Ryzen 9 7900 (12C/24T), which is quite impressive. However, none of the benchmarks we've tested highlights the performance or AI capabilities or even touches the NPU. It doesn't quite reach the highs of the Ryzen 7 7800X3D with 96 MB of 3D packaged L3 cache. However, given the nuances of a monolithic mobile-focused design offering desktop performance levels, it is decent nevertheless. It's worth noting that without STAPM applied, the Ryzen 7 8700G performed much better in this test than we saw previously. While there are a lot of cool generative AI features through Windows and other software vendors such as Abode, among others, that Ryzen AI can be used for, we would argue why anyone would specifically buy an APU specifically for the Ryzen AI NPU, not that having it will be a detriment to the chip in any way. Given the advancements in combined core and graphics performance in APUs from AMD over the years, we always end up at the same crossroads. Do APUs provide enough gaming performance for the typical user to ditch a discrete graphics card? The short answer is that we're not quite there entirely if the benchmark metric is 60 fps at medium settings at 1080p; we're still a short way away from that, but it's certainly closer than ever. Of course, this entirely depends on the title, as a game such as League of Legends or DOTA 2 has much fewer graphical requirements than an AAA title such as Cyberpunk 2077. The biggest takeaway from the Ryzen 7 8700G and Ryzen 5 8600G is that they are a considerable upgrade in integrated graphics performance compared to the previous Ryzen 5000G series, including the Ryzen 7 5700G. The jump from the now-aging Vega graphics architecture to the latest RDNA 3 proves a fruitful upgrade for users on a strict budget is a very viable one. While opting for a mobile-based platform and architecture such as Phoneix and implementing it into the desktop, much like AMD has done before with previous iterations of their APUs, does have limitations.  These limitations primarily come in highly intensive multi-threaded workloads such as rendering or encoding, where the performance of processors such as the Ryzen 7000 desktop series, but the key point is that these APUs aren't inherently designed for these tasks in mind, and users looking for more CPU grunt are almost certainly likely to opt for a higher grade processor with faster cores, more cores, and more threads. This is also prevalent in certain games when paired with a discrete graphics card, which shows the native desktop chips in a better light. Still, the Ryzen 7 8700G and Ryzen 5 8600G are more than capable of doing these things, with lesser performance. The other point to consider in the equation is the price; the Ryzen 7 8700G has an MSRP of $329, and the Ryzen 5 8600G has a price tag of $229. For the price, there is undoubtedly a lot of potential and performance to be had from both these processors, and they offer a jack of all trades but a master of but one thing: integrated graphics performance at lower settings. That is the bread and butter of the Ryzen 8000G series, offering solid performance for users on a budget who want to game but can't quite stretch to the price of a dedicated discrete graphics card. At the price point, the Ryzen 7 8700G and Ryzen 5 8600G certainly hit a sweet spot between compute and integrated graphics performance, more so than we've seen before with any generation of AMD Zen-based APUs. It's been a long time coming as we've anticipated AMD to release a Zen 4 APU to the market. For users waiting for this day (today), there's certainly a lot to be had for the price when opting for either the Ryzen 7 8700G or the Ryzen 5 8600G. It does, however, prove fruitful to point out that there's still value to be had from the Ryzen 5000G series, even more so since the turn of the year. The Ryzen 7 5700G can be purchased from Amazon for just $170, which represents impeccable value for money, given how cheap the AMD AM4 motherboards can be purchased, as well as the DDR4 memory. Even cheaper still, the Ryzen 5 5600G is only $124 at Amazon (at the time of writing), and all things aside, it still proves an excellent proposition for users on a stringent budget but who want to do basic tasks and light gaming at 720p while avoiding the cost of a discrete graphics card. Overall, the Ryzen 7 8700G and Ryzen 5 8600G offer solid performance for the price, but the next step in the evolution of the APU may yet still be to come, as AMD is preparing Zen 5 for launch, which, according to their roadmap, is scheduled for this year. It'll be a while after that until we see Zen 5-based APUs (if at all), but we appreciate the concept of the APU and what it offers to users on a budget in an increasingly inflated hardware market. As we've re-tested our data without AMD's STAPM limitations applied, our opinion on the cost-effectiveness and performance hasn't changed. We still recommend both the Ryzen 7 8700G and Ryzen 5 8600G to gamers on a budget or for users looking to build a lower-cost system without needing a discrete graphics card. "
}