{
    "title": "CES 2024: AMD Unveils Vision for AI-Powered PCs",
    "date": "1/5/2024",
    "url": "https://www.analyticsinsight.net/ces-2024-amd-unveils-vision-for-ai-powered-pcs/",
    "text": "Analytics Insight Solana’s Role in the Interoperable Blockchain Landscape Fantom Price Analysis: Reasons for Upward Trend Scaling Solutions for Ethereum: Layer 2 and Beyond BlockDAG Presale Hits $10.5M, Creates New Dawn In Crypto Mining Amid Bitcoin Halving & TON Price Surge The 10 Most Influential Tech Leaders to Follow in 2024 Empowering Change: A Journey in Tech Leadership with Boitumelo Makgoba David Ellison: Pioneering the Future of AI The Top 10 Data Science Leaders  AMD’s CES 2024 presentation, titled ‘Together We Advance AI,’ is expected to take place on 8 January at 7 a.m. PST, with AMD Chair and CEO Dr Lisa Su and AMD Senior Vice President of Computing and Graphics Jack Huynh taking the stage. The event materials expressly mention ‘AI in personal computers,’ thus we should expect CPU and GPU announcements. “AMD is powering the end-to-end infrastructure that will define the AI era,” according to the event description. “From cloud installation to enterprise cluster, AI-enabled intelligent embedded devices and PCs.” The event will take place before NVIDIA‘s big GeForce RTX 40 Series SUPER announcement, so it will be fascinating to see whether AMD has something Radeon to offer. There are serious rumors that a new AMD Radeon RX 7600 XT with 16GB of VRAM will be released in late January and that RDNA 3 will include AI hardware – the new GPU might be introduced during this presentation. However, because the presentation is centered on AI hardware, the emphasis will most likely be on AMD’s newest Ryzen 8000 “Hawk Point” CPUs powering the next era of AI-powered PCs rather than anything solely PC gaming. The Ryzen 8000 series incorporates dedicated AI hardware, such as a Neural Processing Unit (NPU), which improves AI performance and workloads dramatically. With AI becoming incorporated into operating systems, search engines, and productivity applications, we anticipate AMD’s CES presentation to emphasize this aspect of its new Ryzen series. It might be a PC-focused answer to Intel’s recent release of AI-powered ‘Meteor Lake’ Core Ultra CPUs. AMD will also be exhibiting AMD Ryzen Z1 Series Processors for Handheld PC Gaming, as well as AMD Ryzen and Radeon gaming desktops and laptops, at CES 2023. Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here. Analytics Insight® is an influential platform dedicated to insights, trends, and opinion from the world of data-driven technologies. It monitors developments, recognition, and achievements made by Artificial Intelligence, Big Data and Analytics companies across the globe. Disclaimer: Any financial and crypto market information given on Analytics Insight is written for informational purpose only and is not an investment advice. Conduct your own research by contacting financial experts before making any investment decisions, more information here. "
}