{
    "title": "Missed the boat on AMD’s stock surge? Why this analyst says you’re not too \nlate.",
    "date": "1/24/2024",
    "url": "https://www.marketwatch.com/story/missed-the-boat-on-amds-stock-surge-why-this-analyst-says-youre-not-too-late-a934dbaa",
    "text": "Better late than never? Advanced Micro Devices Inc. shares \n        AMD,\n        +0.50%\n       have shot up 140% over the past year, but an analyst at New Street Research says there’s still time to jump on the bull train. New Street’s Pierre Ferragu upgraded AMD’s stock to buy late Tuesday, while setting a $215 target price for late 2024. That implied more than 25% upside from Tuesday’s close, though the shares were roaring more than 5% higher late in Wednesday’s session. Don’t miss: Why Marvell just dethroned Nvidia as Citi’s top chip-stock pick “[O]ur work on AI architectures & ecosystems suggests [graphics processing units] will remain dominant,” Ferragu wrote. “Second, structural scarcity is likely to last for several years, making it easy for AMD to carve out a defensible challenger position.” His upgrade comes amid an analysis of what the chip sector would look like if the overall data-center chip market attracted $400 billion in annual spending come 2027. “AMD not only comes out of this analytical work as the most attractively valued,” Ferragu wrote, but also it looks poised to show “some upside with a minimal share gains & slow adoption.” In other words, “even if market shares against Intel slow or stabilize in [central processing units] …and Gaming and Embedded growth remain slow on the back of the current correction, AMD could still grow revenues by more than 20%” per year over the next four years, he added. Opinion: How Nvidia and AI changed the landscape of the chip industry, as rivals must now play catch-up The stock represents his preferred way to play a situation where data-center AI chips get adopted very quickly. Meanwhile, Ferragu said that Taiwan Semiconductor Manufacturing Co. Ltd. shares \n        TSM,\n        -0.47%\n       look like the “most de-risked” option, holding “limited market-share uncertainty, upside to expectations, and attractive valuation in both a fast and a slow adoption scenario.” Trading in General Electric’s power-generation spinoff began this week. The spinoff itself takes place on April 2. So far, trading has hewed pretty close to Wall Street estimates. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}