{
    "title": "Minisforum Combines AMD Ryzen 7 7840HS APU With RX 6650M Discrete GPU In \nHX100G Mini PC",
    "date": "1/26/2024",
    "url": "https://wccftech.com/minisforum-combines-amd-ryzen-7-7840hs-apu-rx-6650m-discrete-gpu-hx100g-mini-pc/",
    "text": "Minisforum has launched its brand new EliteMini HX100G Mini PC which combines the AMD Ryzen 7 7840HS APU with a RX 6650M discrete GPU. Press Release: MINISFORUM has recently unveiled a new high-performance Mini PC, the HX100G, now available in their official store. This compact system boasts the powerful combination of the AMD Ryzen7 7840HS flagship processor and Radeon RX 6650M graphics card, making it an ideal choice for gamers, designers, and creative professionals. The sale price for the barebone version is set at $719, the 32GB RAM+1TB SSD version is set at $905, and the 64GB RAM+1TB SSD version is priced at $995. As an iterative upgrade to the HX99G, the HX100G features an enhanced CPU in the form of the AMD Ryzen7 7840HS. Manufactured using a 4nm process, this processor boasts 8 cores, 16 threads, a base frequency of 3.8GHz, and a maximum boost clock of 5.1GHz. With a TDP ranging from 35W to 54W and a generous 16MB of L3 cache, it also integrates the Radeon 780M integrated GPU, utilizing the FP8 slot. Compared to the 6900HX, the HX100G demonstrates an 8% improvement in single-core performance and a 16% improvement in multi-core performance. The HX100G is equipped with the AMD Radeon RX 6650M dedicated graphics card (GDDR6 8GB), supporting AMD Smart Access Memory technology. With a TDP of up to 100 watts, it meets the demands of 1080P high-quality AAA gaming and excels in professional photo editing, 4K video editing, and complex 3D rendering tasks. One of the notable advantages of the HX100G is its robust expandability. Featuring two DDR5 memory slots, it supports a maximum of 64GB dual-channel memory, with DDR5 clocked at 5600MHz—an impressive 47% increase over the HX99G's 4800MHz. In addition to the default M.2 2280 PCIe 4.0 SSD slot (supporting up to 2TB), an extra M.2 2280 SSD slot is provided, supporting NGFF SATA or NVMe PCIe 4.0 SSDs for further expansion. The HX100G employs a luxurious cooling solution, incorporating liquid metal cooling and dual exhaust vents. With built-in dual fans and a 7-heat pipe system (3 for the CPU, 4 for the GPU), along with dedicated heatsinks for DDR and SSD, the outstanding thermal design ensures that the HX100G, featuring the Ryzen7 7840HS and RX 6650M graphics, maintains relatively low noise levels even under full load. In terms of connectivity, the front panel of the HX100G includes audio ports and two USB 3.2 interfaces (1 Type-A and 1 Type-C), both supporting the data transfer rate of 5Gbps. The rear panel features 2 USB-A 3.2 Gen1, 1 USB-A 3.2 Gen2, 2 USB4, 2 HDMI ports, RJ45 2.5G Ethernet, and power input, enabling simultaneous connection to two 8K@60Hz (via USB4) and two 4K@60Hz (via HDMI) displays. Constructed from carbon fiber material, the HX100G balances weight and strength within its compact 2.9L volume, accommodating a high-end RX 6600M dedicated graphics card. The system excels in performance, expandability, external interfaces, and aesthetic appeal when compared to traditional desktops and gaming laptops. With equivalent performance in a more compact, energy-efficient, and quieter form factor, the HX100G rightfully earns its status as a performance powerhouse and a high-performance productivity Mini PC. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}