{
    "title": "AMD Strix Point Halo APU spotted – this could be the most powerful chip for \nthin-and-light laptops that beats out Apple",
    "date": "1/23/2024",
    "url": "https://www.techradar.com/computing/cpu/amd-strix-point-halo-apu-spotted-this-could-be-the-most-powerful-chip-for-thin-and-light-laptops-that-beats-out-apple",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The catch is that Halo APUs might not arrive until next year AMD’s incoming Strix Point Halo APUs – all-in-one chips with processors and integrated graphics that are expected to be seriously powerful – have just been spotted. The rumor mill holds that Strix Point APUs will likely arrive later this year, and will be followed by top-end Strix Point Halo chips. Excitingly, we’ve just had a sighting of Strix Point Halo for the first time, with the APUs mentioned in patches for ROCm, AMD’s open source software platform for GPU computation, as VideoCardz noticed that Kepler pointed out on X (formerly Twitter). https://t.co/cMSHiN0quL 👀 pic.twitter.com/ktlKTqUilvJanuary 23, 2024 Strix Point Halo will use AMD’s next-gen Zen 5 processor cores, which are expected to be a solid step on from current Zen 4 chips, and the integrated graphics will be RDNA 3+ (also referred to as RDNA 3.5). AMD uses the RDNA 3 architecture for its current-gen GPUs, so RDNA 3.5 is a refresh of this. It’ll also have an XDNA 2-powered NPU for accelerating AI workloads, to boot. The most powerful Strix Point Halo APU is rumored to have 16-cores and an RDNA 3.5 GPU with 40 Compute Units (CUs). To give you some idea of how powerful we’re talking about here for a CPU plus GPU solution, this complements 16 full Zen 5 cores on the processor side with the equivalent of integrated graphics which are more powerful than AMD’s next-in-line GPU, the RX 7600 XT (which goes on sale tomorrow, in fact). That model has 32 CUs compared to 40 CUs for the flagship Strix Point Halo, and don’t forget the latter is on an improved refresh of the current graphics architecture, so it could be more than a little ahead of the 7600 XT. If the rumors around the spec are right, Strix Point Halo really will be a mammoth step forward for AMD’s APUs, bringing in a chip to rival what Apple is doing with its M series of processors (and Apple is going great guns with them, of course). Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. One slight catch with Strix Point Halo is that while earlier rumors pegged it as having a 2024 launch, the latest chatter is that this has slipped to 2025. So in theory, we’ll get Strix Point this year, but not the Halo silicon until next year (hopefully early in 2025, mind). This is certainly a chip that could worry Apple, then. Perhaps the main concern when throwing around all these juicy specs and forecasts of a storming high-performance AMD APU is the price tag that might be attached. A thin and premium gaming laptop powered by the flagship Strix Point Halo chip is likely to cost a pretty penny (or three hundred thousand of them). Mind you, it’s not like MacBooks are cheap either (unless you spot a great deal). Strix Point Halo is certainly one to watch, though, in terms of the most powerful performers for APUs, even though Strix Point will be the more prevalent proposition with more mainstream pricing. Strix Point Halo won’t just be about thin-and-light laptops, either – there are also small form-factor PCs to consider here, where dispensing with a separate GPU is obviously a major boon. The Halo silicon is another sign that the days of discrete GPUs might be numbered, at least at the lower-end of the market. Darren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013). AMD could release faster versions of last-gen Ryzen CPUs that are perfect for budget builds and upgrades An excellent AMD budget gaming CPU is now on sale for less than $200 at Walmart Quordle today – hints and answers for Friday, March 29 (game #795) By Sead FadilpašićMarch 28, 2024 By Marc McLarenMarch 28, 2024 By Alex BlakeMarch 28, 2024 By Rhys WoodMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By James IdeMarch 28, 2024 By Mackenzie FrazierMarch 28, 2024 By Kristina TerechMarch 28, 2024 By Craig HaleMarch 28, 2024 By Darren AllanMarch 28, 2024 By Nigel PowellMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}