{
    "title": "AMD Ryzen 7 8700G, Ryzen 5 8600G, Ryzen 5 8500G and Ryzen 3 8300G APUs \nofficially announced for budget ...",
    "date": "1/8/2024",
    "url": "https://www.notebookcheck.net/AMD-Ryzen-7-8700G-Ryzen-5-8600G-Ryzen-5-8500G-and-Ryzen-3-8300G-APUs-officially-announced-for-budget-gaming-rigs.790194.0.html",
    "text": "Almost every one of AMD's Ryzen 8000 series Hawk Point desktop APUs showed up on Geeekbench in the past few weeks. The lineup includes four SKUs: the Ryzen 7 8700G, Ryzen 5 8600G, Ryzen 5 8500G and Ryzen 3 8300G. Despite sharing the same name, two of the SKUs are radically different from the others. It is pertinent to note that the Ryzen 5 8500G and Ryzen 3 8300G will not include AMD's XDNA AI accelerator. The Ryzen 7 8700G is an 8-core/16-thread APU with all Zen 4 cores clocked at 4.2 GHz (5.1 GHz boost). It has a rated TDP of 65 Watts and 24 MB of cache. As discovered earlier, it comes with a full-fat Radeon 780M iGPU. AMD claims it can outperform a Core i5-13400F + GeForce GTX 1650 setup in 1080p gaming (with low details). All of the aforementioned (and subsequent) tests were performed on a high-end rig with DDR5 6,400 RAM. Your mileage may vary if you use lower-end modules, as the iGPU performance heavily depends on memory bandwidth. Similarly, it is supposedly up to 4x faster than the Core i7-14700K's integrated GPU. One can squeeze extra frames out of the Radeon 780M thanks to AMD Hypr-Rx and Fluid Motion Frames, both of which are supported out of the box. AMD is advertising the Ryzen 7 8700G as a 1080p gaming machine. We've seen it work wonders in consoles like the ROG Ally (curr. $699 on Amazon), and it'll be interesting to see what the Radeon 780M can do with extra thermal headroom and beefier cooling solutions. Next up, there's the Ryzen 5 8600G with 6 cores, 12 threads, 5.0 GHz boost clock, 22 MB cache and 65 Watts TDP. It comes with a scaled-down Radeon 760M iGPU (6 CUs). The following two SKUs are interesting because they use a mix of Zen 4 and Zen 4c cores, which will be denoted as \"C\" and \"c\", respectively. First off, the Ryzen 5 8500G is also a 6-core (2C + 4c) CPU with 12 threads. It uses an even lower-end Radeon 740M iGPU. Everything else, including its cache, TDP, and boost clocks, are identical to the Ryzen 5 8600G. Lastly, there's the Ryzen 3 8300G, a 4-core (1C + 3c), 8-thread CPU with a 4.9 GHz boost clock, 12 MB cache, 65 W TDP, and a Radeon 740M iGPU. The Ryzen 7 8700G, Ryzen 5 8600G and Ryzen 5 8500G will be available for purchase on January 31 for a $329, $229 and $179, respectively. On the other hand, the Ryzen 3 8300G will launch as an OEM-only SKU, with availability starting sometime in Q1, 2024. AMD "
}