{
    "title": "AMD's Ryzen 8000G CPUs don't need a GPU to play games",
    "date": "1/15/2024",
    "url": "https://www.gadgetguy.com.au/amd-ryzen-8000g-cpu-ces-2024/",
    "text": "A fresh new graphics card wasn’t the only thing AMD had in store at CES 2024. Alongside the Radeon RX 7600 XT GPU, the chip maker also launched its Ryzen 8000G Series desktop CPUs. Like the dedicated neural processing units (NPU) adopted by the Intel Core Ultra processors, the new AMD chips have built-in AI capabilities, intended to bring some of the predominantly cloud-based workloads offline. Looking past the AI hype train, AMD claims that its Ryzen 8000G processors wield the most powerful built-in graphics of any platform. Built on the Zen 4 architecture and led by the Ryzen 7 8700G, AMD’s latest desktop chips house up to eight cores, 16 threads, and 24MB of cache. AMD’s graphical power claims come off the back of its built-in Radeon 700M graphics. The most powerful on offer is the Radeon 780M, which is said to be the most powerful integrated graphics hardware on the market. Other than being suited to general productivity tasks, gamers are set to benefit from the Ryzen 8000G CPUs. They’re apparently capable of smooth 1080p gaming out of the box, with AMD suggesting that you can upgrade to a discrete GPU later on for higher resolutions. Although real-world tests will be the ultimate benchmark, AMD’s data looks impressive. Running Cyberpunk 2077 at 60 frames-per-second, even on low settings, is no easy feat without a discrete graphics card. With AMD Fluid Motion Frames enabled, recent games like Baldur’s Gate 3 and Alan Wake 2 see a substantial performance boost. A relatively new feature, Fluid Motion Frames is a driver-based setting, meaning it doesn’t require individual game support to process additional frames. At the cheaper end of the scale, AMD also launched several new Ryzen 5000 Series desktop CPUs. Also aimed at gamers, these chips don’t include the built-in NPUs seen on some of the Ryzen 8000G processors. The most powerful of these CPUs is the Ryzen 7 5700X3D. At a glance, its slightly slower clock speeds don’t jump out, but the 100MB of on-chip memory far surpasses other models. A higher memory cache helps execute instructions to PC components more efficiently. Which, in turn, improves performance across complex tasks like gaming and 3D rendering. Both the Ryzen 8000G and 5000 series of processors will start shipping by the end of January. Meanwhile, AMD’s AI-capable Ryzen 8040 laptop CPUs have started appearing in new laptops like the latest ROG Zephyrus model and Lenovo devices. Read more computer news on GadgetGuy Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ   "
}