{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.kitguru.net/components/graphic-cards/matthew-wilson/amds-anti-lag-feature-to-return-after-months-of-hiatus/",
    "text": "Matthew Wilson \nFebruary 14, 2024\nFeatured Tech News, Graphics  Back in October, AMD was forced to remove its Anti-Lag+ feature from Radeon graphics drivers. Due to the way the feature functioned, it could trip up false positives in the anti-cheat systems of multiplayer games like Counter-Strike 2. The feature has been missing in action ever since, but it should be returning soon. After months of additional work, it looks like Anti-Lag+ will soon return. According to AMD's gaming marketing lead, Frank Azor, who confirmed that the feature will be returning in response to questions on Twitter.  In its original form, Anti-Lag+ could be activated at the driver level, without requiring any work from game developers to implement. However, as the feature would make configuration file changes in games, this would raise red flags for anti-cheat systems in online games. AMD may need to revise this approach and adopt an SDK model, requiring developers to implement the feature themselves to avoid future issues. This would reduce the number of compatible titles, but would ensure that players don't accidentally get themselves banned from their favourite multiplayer game. Nowadays, we see many games supporting both Nvidia's DLSS upscaling method, as well as AMD's FSR. If Anti-Lag+ needs to return as a game-dev implemented feature, then we may see many of the same games that support Nvidia Reflex also adopting Anti-Lag+ for AMD users. Discuss on our Facebook page, HERE. KitGuru Says: We should get a more substantial update on the Anti-Lag situation soon. Exact dates have not been confirmed but hopefully the next Radeon driver release will bring about the return of AMD's latency-reducing tech. Become a Patron! Tags AMD Anti-Lag gpu Graphics news radeon After eight major releases, HWiNFO is finally getting a built-in OSD, allowing users to see …   DDR5 speed on your next PC: How fast?  View Results "
}