{
    "title": "TT Show Episode 22 - $50K AI Desktop PCs, AMD's RDNA 4 Specs, AI War Games, \nand more!",
    "date": "2/16/2024",
    "url": "https://www.tweaktown.com/news/96257/tt-show-episode-22-50k-ai-desktop-pcs-amds-rdna-4-specs-war-games-and-more/index.html",
    "text": "Another big for The TT Show, with Jak and Kosta going through a wide range of tech and science topics this week, kicking off with a look at the world's first AI desktop workstations with NIVIDA's Grace Hopper CPU and GPU Superchips. What does close to $50,000 get you? Basically, a supercomputer that can fit on a desk. The duo also looked at fresh RDNA 4 specs and what to expect with the next-generation flagship Radeon GPU. It is a card that won't match the current Radeon RX 7900 XTX in performance but gets close enough on a more efficient and cost-effective node. There's also a deep dive into Apple's plans to release foldable devices, what's inside an ancient intact chicken egg discovered by scientists, Windows 11's new DLSS-like AI features, and a recent experiment that put AI in war game scenarios. Yes, a few LLMs - including GPT - went nuclear. Plus, fresh and exciting Nintendo Switch 2 rumors, original PlayStation games remastered to perfection by indie developers and more! And be sure to listen or watch all the way through to see Jak go full Tolkien nerd. Kosta Andreadis Kosta is a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}