{
    "title": "Best budget AM5 motherboards for 2024",
    "date": "2/28/2024",
    "url": "https://www.xda-developers.com/best-budget-am5-motherboards/",
    "text": "If you're looking to add one of AMD's Ryzen 7000 to your system without spending a ton, check out our collection of the best budget AM5 motherboards. When AMD released the Ryzen 7000-series desktop CPUs, the only AM5 motherboards around were high-end or mid-range models using the X670 chipset. Thanks to the arrival of the budget B650 mobos, gaining entry into the newest AM5 ecosystem has become more affordable than ever. These inexpensive AM5 motherboards still come with the latest technology, like DDR5 RAM, USB4, and in some cases, PCIe 5.0. Some models even have PCIe 5.0 M.2 slots for the fastest NVMe SSDs to be installed on the motherboard without requiring a PCIe expansion card. Luckily, prices on the 7000-series CPUs and DDR5 memory have dropped since 2023, and with AMD Ryzen 8000 APUs making the rounds, there's no better time to upgrade to an AM5 system. In this list, we've rounded up what I feel are the best options for different users and price points, so you can build the AM5 system tailored to your needs. The best among the best The Gigabyte X670 Gaming X AX V2 is an affordable motherboard for AM5 processors that packs many of the high-end features commonly observed in its X670 brethren. Gigabyte is one of the biggest manufacturers of motherboards, so it's not a huge surprise to see a motherboard from the company at our top spot. But what's really astonishing is the fact that the Gigabyte X670 Gaming X AX V2 is the only X670 mobo that's affordable enough to qualify for this list. But don't let its cheap price fool you; the second version of the X670 Gaming X AX packs a host of features under the hood. For starters, it includes a 14+2+2 stage design for the VRM, which is more than enough for most AMD processors except, perhaps, the Ryzen 9 7950X3D. Memory-wise, you'll get four DDR5 slots, and you can push the RAM frequencies all the way up to 8000MHz. The port count on the mobo is also decent, with eight USB 3.2 connections, four USB 2 ports, an Ethernet jack, a USB Type-C port, an HDMI 2.1 socket and the usual audio connectors making up the rear IO ports. Troubleshooting is pretty easy thanks to the addition of four debug LEDs and the Q-Flash Plus button lets you flash new BIOS without plugging in a CPU or other components first. As for the drawbacks, although it does support the superior bandwidth of the PCIe 5.0 standard for an M.2 slot, the remaining M.2 connections and x16 expansion slots on the Gigabyte X670 Gaming X AX V2 still use the older PCIe 4.0 interface. Its LAN port being capped at 2.5Gb bandwidth is also a potential downside. Otherwise, the Gigabyte X670 Gaming X AX V2 is our favorite X670 motherboard for those on a budget. The price to performance champ for AM5 The Asus TUF Gaming B650-Plus WiFi is a mid-range Asus motherboard that supports one PCIe 5.0 SSD and is perfect to pair with mid-range Ryzen 7000 CPUs with its 12+2 stage power delivery. The TUF line was my preferred motherboard series for the AM4 chipset, and this trend continues in the AM5 series. The TUF Gaming B650-Plus WiFi brings gaming and productivity features that will give enough performance for most use-cases, with the motherboard opting to add PCIe 5.0 M.2 support for fast storage options. You also get two PCIe 4.0 M.2 sockets, with all having heatsinks. It supports DDR5 with four slots, with speeds of up to 6400MHz. The 12+2 VRM power solution can support high-end Ryzen 7000 CPUs, thanks to 8-pin and 4-pin plugs for CPU power (while many B650 boards are limited to 65W). That’s the core of the TUF Gaming B650-Plus WiFi, but the rest of the features on this board are also impressive. It has eight USB ports on the back I/O panel, with three running at 3.2 Gen 1 speed and one at the faster 3.2 Gen 2x2 spec. Asus added both HDMI 2.1 and DP 1.4 ports for onboard graphics use, as Ryzen 7000 has an RDNA 2 iGPU on all chips. And while most B650 boards have 2.5Gb Ethernet, Asus also includes 2x2 WiFi 6 and Bluetooth 5.2. There are dedicated 3.5mm audio jacks for line out/headphones, line-in, mic, c/sub, and rear, although no S/PDIF for optical audio. The six PWM fan headers should be enough to cool a midrange PC, and one is a slightly higher amperage for use with an AIO CPU cooler. Premium B650 chipset with PCIe 5.0 graphics support The Asus ROG Strix B650E-F Gaming WiFi is a premium B650 chipset motherboard for the AM5 platform with support for PCIe 5.0 graphics, capable of overclocking thanks to a supplemental 4-pin EPS socket. Asus’s ROG Strix B650E-F Gaming WiFi is a worthy choice for a more premium AM5 motherboard while still keeping within a limited budget. It has a 12+2 VRM power delivery solution and 8+4 pin power sockets similar to the more-affordable TUF, this time rated for 80A. The additional ‘E’ on the chipset brings new features. The top x16 slot is also PCIe 5.0, to go along with the primary M.2 slot. That gives some measure of future-proofing, as PCIe 5.0 graphics cards are still a ways off. Asus also stuffs the back I/O panel even further, with one USB-C 3.2 Gen 2x2 port and ten additional USB ports — two USB-A 3.2 Gen 2, four USB-A 3.2 Gen 1, and four USB-A 2.0. Asus added both HDMI 2.1 and DP 1.4 for onboard graphics output. There are dedicated 3.5mm audio jacks for line out/headphones, line-in, mic, c/sub, and rear, although no S/PDIF for optical audio. There is a S/PDIF header on the motherboard, but you'll need to purchase the adapter separately as it is not included. It also has Wi-Fi 6E and ROG Strix RGB accents glowing from a darker aesthetic. The only thing that’s not to like is the price, which at nearly $300, is much higher than we’ve been used to paying for midrange motherboards. The cheapest way to get an AM5 rig together MSI Pro A620M-E is the most cost-effective way to get an AM5 build running without unnecessary frills, supporting PCIe 4.0 graphics and SSDs. The latest chipset to come out with support for the AM5 socket is the A620 platform. It’s aimed at entry-level builds running the 65W Ryzen 7000 CPUs. That’s the non-X or non-X3D versions, which is fine because the lower-power CPUs are also aimed at entry-level PCs. The MSI Pro A620M-E is currently one of the very few sub-$100 AM5 motherboards on the market. Some major compromises had to be made to get to that low price point. The x16 slot is limited to PCIe 4.0, as is the M.2 slot. Given the type of PC builds this motherboard will be used for and the lack of any worthwhile PCIe 5.0 hardware, that’s fine for most basic computing. It has one HDMI 2.1 output and one VGA, a rarity on modern motherboards and possibly indicative of the basic workstation builds this is aimed at. It also has three 3.5mm audio jacks for line out/speakers, line-in, and microphone. MSI also dropped two RAM slots, leaving the Pro A620M-E with two, which can use overclocking profiles rated up to 6400MHz. Given that DDR5 modules are dual-channel anyway, that still means effectively quad-channel if both are used. The other compromise is on the I/O panel, with only two USB-A 3.2 Gen 1 ports and four USB-A 2.0 ports, though it also includes RJ45 Ethernet (at 1Gbps), two PS/2 ports, and three audio ports for line in, mic in, and line out. Plenty of power in a compact package ASRock B650M PG Riptide WiFi is one of the best mid-range motherboards in the mATX form factor with support for PCIe 4.0 graphics and SSDs and midrange Ryzen 7000 CPUs. AM5 hasn’t been around for long, and mATX is becoming a form factor that isn’t produced in great numbers. That’s why it’s awesome to see ASRock release the B650M PG Riptide, an mATX motherboard with a budget price and mid-range features. The 12+2+1 VRM solution is powerful enough for any Ryzen 7000 CPU, although TechSpot says you’ll need to disable the 75C thermal limit in BIOS to remove the unnecessary power restriction. Moving on to the rest of the board, you’ll be glad to know that one of the two M.2 slots uses PCIe 5.0 speeds, with the remaining one at PCIe 4.0. It also features four SATA ports, two PCIe 4.0 x16 slots, and two PCIe 3.0 x1 slots. It has both HDMI 2.1 and DP 1.4 outputs and 3.5mm audio jacks for speakers, line-in, and mic. You also get WiFi 6E and 2.5Gb LAN. That’s a ton of connectivity for any mATX motherboard, rounded out by a USB-C 3.2 Gen 2 port, two USB-A 3.2 Gen 1 ports, four USB-A 2.0 ports. Small in size, big in features The ASRock B650i Lightning Wi-Fi is a mini-ITX motherboard that, despite being compact enough for small builds, possesses enough horsepower to drive high-end gaming components. When contrasted against ATX and mATX form factors, the small size of mini-ITX motherboards restricts a lot of their functionality. However, the ASRock B650i Lightning Wi-Fi still packs some decent features, despite costing barely $200. Starting with the VRMs, you're looking at 8+2+1 power stages. On a normal-sized motherboard, a VRM of such limited caliber would have been a no-go. But for a mini-ITX motherboard, where you cannot proceed past a 65W Ryzen chip due to thermal limitations, the ASRock B650i Lightning Wi-Fi's VRM stage gets the job done. On the RAM front, you only get two DIMM slots that can drive up to 7200MHz DDR5 memory. The graphics card slot is PCIe 4.0 x16, though one of the two M.2 slots does support the PCIe Gen 5 standard. The ASRock B650i Lightning Wi-Fi definitely pulls ahead of the competition when it comes to connectivity. A total of three USB-A 3.2 ports, six USB-A 2.0 sockets, one USB Type-C connection, an Ethernet port, and three audio jacks make up the rear IO ports. The inclusion of a BIOS Flashback button makes updating BIOS and recovering from corrupted BIOS much easier. Creator-focused feature set The Gigabyte B650 Aero G is a creator-focused mid-tier motherboard for the AM5 platform geared for stability, with a one-cable solution for display output, charging, and data. While most budget AM5 motherboards have one or two standout features, few can claim a unique selling point. The Gigabyte B650 Aero G is a creator-focused midrange motherboard for AM5 chips designed for a one-cable connection to a graphics pen display. Gigabyte calls this system VisionLINK, which sends a DP 1.4 video output over a USB-C port in alt mode, along with 60W power delivery and data transfer. It’s compatible with a handful of Wacom and Huion pen displays that use USB-C, removing the usual cable mess. While this motherboard doesn’t carry the B650E chipset, Gigabyte has included support for PCIe 5.0 SSDs, which is usually exclusive to those higher-end chipsets. That joins two PCIe 4.0 M.2 slots and four SATA connectors. The back I/O panel has the USB-C 3.2 Gen 2 port, also used for VisionLINK, three USB-A 3.2 Gen 2 ports, four USB-A 3.2 Gen 1 ports, and two USB-A 2.0 ports. You get HDMI 2.1 for onboard graphics, 3.5mm audio jacks for speakers and mic, and S/PDIF output. It also has a DisplayPort input, which loops one output from your dedicated graphics card and pipes it into the VisionLINK port for use with an attached pen display. A blank canvas for your creativity The NZXT N7 B650E is the antidote to the overdone gamer aesthetic with monotone minimalism, tons of USB ports, and inbuilt NZXT CAM RGB control to light up your PC. Most midrange AM5 motherboards choose either gamer styling with edgy lines and RGB lighting or basic designs that are better if your case doesn’t have a window. NZXT says you should proudly show off your motherboard, and its N7 B650E is the result. It uses minimalist metal panels to cover everything but the ports and slots of the motherboard, with white and black versions to suit your theme. The best part — it’s not style over substance. Hiding away behind those panels is a solid 16+2+1 power phase design rated to 90A. That means it can handle the largest CPUs in the Ryzen 7000 range, putting it ahead of most of its class. It supports DDR5-6000, Ryzen’s sweet spot, and has PCIe 5.0 support on the top x16 slot for graphics and one of the three M.2 ports. The rear I/O panel is well-provisioned, with one USB-C 3.2 Gen 2 port, two USB-A Gen 2 ports, four USB-A 3.2 Gen 1 ports, and two USB-A 2.0 ports. NZXT adds WiFi 6E to the 2.5Gb LAN for connectivity. You also get HDMI 2.1 for onboard graphics use, S/PDIF optical output, and five 3.5mm audio jacks for surround sound use. The only thing that’s not to like is the price, which is often over its $317 MSRP. Still, it comes with premium features for that price tag and a style that is hard to beat. If you've been rocking the ol' reliable AM4 chipset, upgrading to an AM5 system is an exciting but expensive prospect. The new technology stuffed into Ryzen AM5 chips is powerful, but upgrading also means new memory modules. For the new platform, I recommend the Gigabyte X670 Gaming X AX V2 if you want to get the perfect balance between price and functionality. It has everything from a capable 16+2+2 VRM solution to three M.2 drives and easy BIOS flashback. The only feature that is really missing is PCIe 5.0 graphics support, which is a bummer if you wish to make full use of the extended bandwidth on AMD Radeon RX 7900 GPUs. The Gigabyte X670 Gaming X AX V2 is an affordable motherboard for AM5 processors that packs many of the high-end features commonly observed in its X670 brethren. If cost is the primary factor, I recommend the MSI Pro A620M-E, which will get a new AM5 PC build humming along for less than $100. It gives you DDR5 but lacks PCIe 5.0, and the 88W maximum that the VRM solution can supply means you'll be limited to low-power Ryzen processors. But if you can stretch your budget a bit, feel free to check out our collection of the best AM5 motherboards to see what jumping up to the high-tier chipset brings. You should also check out our recommended CPU coolers for AM5 so that you have everything needed to build that new PC.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Maker, meme-r, and unabashed geek with over half a decade of blogging experience. He's covered everything from Apple to crypto and crowdfunding, and loves getting to the bottom of why someone should spend their money on a product. If it runs on electricity (or even if it doesn't), Joe probably has one around his office somewhere. His hobbies include photography, animation, and hoarding Reddit gold. Ayush Pande is a hardware, gaming, and crypto writer based in India. When he's not writing articles, you can find him tinkering with computers, playing long RPGs, or strumming a guitar. AMD made significant improvements to its APU lineup with the Ryzen 5 8600G. But is it good enough to beat the Ryzen 5 7600? Looking to upgrade? This Keychron mechanical keyboard is going to be a great option and now comes in at just $30. Google is making it easier to collaborate on Google Docs with the addition of markups, which allow you to leave notes for your colleagues. If you own one of these older GPUs, an RTX 40 series card is a worthwhile upgrade Lenovo's new concept has a screen that you can see through For when you can't resist checking out all the new Windows features "
}