{
    "title": "Best DDR5 RAM for gaming in 2024: I've been down the memory mines so you \ndon't have to",
    "date": "2/13/2024",
    "url": "https://www.pcgamer.com/best-ddr5-ram-for-gaming-in-2022/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. I've put the top gaming memory through its paces to find out what the best DDR5 RAM to pair with your new gaming PC is.  🐏 The list in brief\n1. Best overall\n2. Best budget\n3. Best mid-range\n4. Best RGB\n5. Best high-capacity\n6. FAQ\n7. Where to buy\n8. Jargon buster The best DDR5 kit is getting tougher to pick out, as we've seen a serious uptick in the number of kits available for the modern memory standard. Nevertheless, we're determined to find you the best around. We've put a bunch of DDR5 memory kits through their paces in the PC Gamer labs and handpicked the ones we think you should spend your hard-earned money on. Although DDR5 is still a bit pricey compared to DDR4, we've noticed that prices have started to come down lately. Our top pick for the best DDR5 RAM for gaming at the moment is the G.Skill Trident Z5 RGB, which delivers excellent performance for memory-hungry apps and games and is surprisingly affordable. If you're trying to save some cash for your next build, take a look at our suggestions for the best DDR4 RAM kits that offer solid performance without breaking the bank. While you can grab yourself a 2x8GB kit, we reckon 2x16GB is a better fit for a gaming setup. With 32GB, you'll be pretty much set for a while, especially if you're planning to play games like Diablo 4 that need a lot of memory to run smoothly. Now, we don't think it's a good idea to drop a ton of cash on RAM unless you've got a high-spec rig that can handle it. That being said, as prices start to drop, you might want to consider spending a few extra bucks to go for DDR5-5600 instead of DDR5-4800. Some games and apps will benefit from the extra speed, while others won't see much of a difference, if any at all. Just make sure you're motherboard can support DDR5 RAM. Chris has tested more memory sticks than he'd like to admit. In fact, I think he secretly does it in his spare time, too. He's our resident memory expert, and has gone through the RAM gamut, testing speeds against latency, and capacity, and DDR4 vs. DDR5. The lot. That makes him perfectly placed to advise us all on what the best RAM is for our gaming rigs. Best DDR5 RAM  The best overall This G.Skill 7200MHz kit is ridiculously fast, but its only relevant if you have an equally top spec system to match with it. But if you want the best around then G.Skill's combination of high frequency and low latency is it. Read more below Best budget  The best budget kit The DDR5-5200 Vulcan kit from Teamgroup isn't the fastest around, but it's a great option for those on a smaller budget. For the sake a a couple of bucks more than a base 4800MHz kit, it's well worth it. It's a hassle free option that will work in any DDR5 system. Read more below Best mid-range  The best mid-range kit Kingston isn't messing around with RGB lighting, or fancy heat spreaders, it's just delivering high-frequency DDR5 memory modules for a decent price. When it's jammed inside your PC, who needs all that flashy stuff? Read more below Best RGB  The best RGB kit Let's be honest, Corsair is the kings of high-performance, good-looking gaming RAM. And the Dominator sub-brand has been at the top for years, for good reason. This kit looks incredible and performs just as well, too. Read more below Best high-capacity  Best high-capacity kit 2x32GB of memory isn't relevant for gaming at this point in time, but for those that use apps that love lots of RAM, this G.Skill kit is for you. Even if you don't make use of all that capacity, this is the kind of kit you'll be able to use for many years to come. Read more below This article was updated on February 13 to add in a new best budget and best high-capacity kit, and to ensure all of the top products we recommend are still valid choices in 2024. Our expert review: ✅ You want high-speed and low-latency: The double whammy of a 7200MHz speed and the CL34 rating means this is an affordable DDR5 kit that packs a real punch. ❌ You just want to install and forget: Relying on XMP settings above the 7000MHz mark can be tricky, with motherboards not managing, and sometimes adding high voltages, which you'll need to tweak yourself. DDR5 has come a long way since it was launched. It's now widely available, prices have dropped, and early BIOS niggles have been overcome. And then there’s the speed. When Intel's Alder Lake CPUs first launched, DDR5-6400 was about the maximum speed you could get, but forget that: DDR5-8000 kits are now on the market. Not a bad improvement!\n\nYou'd expect memory at this speed to cost a bundle, and at $299 / £319 / AU$519, it certainly carries a price premium, but it's not that bad. In fact, it's a downright bargain compared to the cost of premium DDR5 a year back, where prices of $500 / £500 / AU$1,000 or higher were commonplace.\n\nThe G.Skill Trident Z5 DDR5-7200 kit has 34-45-45-115 timings. It's nice to see CAS latencies staying relatively low as speeds increase, though secondary timings are certainly much higher than those you'll find on slower kits. The best DDR4 kits are still perfectly viable, but the early complaints around the high latency of DDR5 compared to DDR4 are quickly becoming moot. This is a kit for those with high-end systems. However, at this price, it's actually quite good value for money when compared to the cost of the other components of a high-end gaming system. In that case, it's a no-brainer. But if your system is a little more worldly and you're just looking for something with a simple set and forget XMP setup, something in the DDR5-6000 range is much more appropriate in terms of price and performance. Sadly, trusting XMP settings for speeds above 7000MHz can be tricksy. Some motherboards will struggle to deal with automated settings, and can add in rather ludicrous voltage settings which you'll need to wrestle back into normal realms manually. But the hell with it; I love fast memory kits. It's actually available to buy, it will deliver some performance gains in more than a few gaming situations, it's a great tweakers' kit, it looks good, and it doesn't carry an exorbitant premium. If you buy this kit, you'll get several years of use out of it too.\n\nRead our G.Skill Trident Z5 RGB 2x16 GB DDR5-7200 CL34 review Our expert review: ✅ You want a reliable DDR5 kit that won't break the bank: At 5200MHz it's not the fastest, but this kit is also a decent step on from the original 4800MHz budget modules.\n\n✅ You fancy dabbling in OC: Look, it's not an outright overclocking kit, but you ought to be able to get up to 5600MHz, and you could even squeeze 6000MHz out of it. ❌ You want the absolute cheapest DDR5: You can get cheaper 4800MHz kits, but for the extra $10 (possibly less) you're getting a kit that can deliver beyond a good DDR4 setup. These days, there's little reason to fall back to a DDR5-4800 kit unless you absolutely must save every single dollar. For the sake of an extra 10 bucks or so (if that), it's well worth jumping up a speed tier to DDR5-5200. The Teamgroup T-Force Vulcan 2x16GB kit certainly isn't the fastest you'll come across but at $100 or less it's one of the best options for a budget DDR5 system right now. It's the kind of kit that will match well with entry level or mid-range systems. If you're using it with something like an i5 processor and an older or mid range GPU, you'd be lucky to notice any difference outside of memory sensitive benchmarks. It's not that much of an overclocking kit but at this level, you should be able to bump it up a speed tier. You might even hit 6000MHz if you win at the silicon lottery. Any DDR5 supporting platform will run this kit with ease. at 1.25v it's not quite a plug and play kit, but enabling XMP won't result in any issue. 1.25V is on the low voltage side compared to faster kits which can require 1.45v or more. It's a great pairing with a B-series Intel or AMD motherboard. It's a little taller than the most basic of kits at 32.7mm but it shouldn't present you with any issues unless you are using the largest dual tower air coolers. Performance wise, you'll hardly notice a difference compared to faster kits at twice the price, and even less so in gaming unless you're running a very fast card, in which case you probably wouldn't be using this kit anyway. These days, with DDR5 prices dropping so much compared to a couple of years ago, it can be worth jumping up to 6000MHz if your budget allows. But, at the affordable end of the market, allocating a few extra dollars to a better CPU or GPU will deliver more tangible benefits than you'll see by moving up to faster RAM. Our expert review: ✅ You're building a stealth machine: Without flashy RGB, this speedy kit will support an understated PC build.\n\n✅ You want to hit the DDR5 sweet spot: A 6000MHz kit really is the sweet spot when it comes to the latest memory tech. It will happily operate on XMP settings so you can install and forget about it. ❌ You were hoping to overclock: There isn't a lot of OC headroom in this kit, and while that might be down to my 12th Gen Intel test rig, it does hint that the ICs in the modules aren't particularly easy to run at higher speeds. Kingston's Fury Beast kit eschews flashy RGB and huge heat sinks in favour of a design that's subtle and discrete. If your PC is sitting under a desk, out of sight and mind, do you really need a lot of bling? DDR5-6000 is right in the sweet spot for DDR5 kits. It offers a blend of value for money, performance and importantly, compatibility. The latter is particularly important when it comes to AMD AM5 systems, where running higher speeds can come down the silicon lottery, or force you to switch to a slower memory controller speed, which adds latency. This kit's specifications are a good match for all but the most powerful gaming systems. Spending more will get you a few FPS extra here and there with a high end graphics card, but for mainstream systems, spending more on a faster kit will be essentially wasted. Even with a faster kit, diminishing returns well and truly set in, with steeper cost delivering fewer performance benefits. The Fury Beast DDR5 memory modules have a black PCB with a low height aluminium heat spreader. It comes with SK Hynix ICs which means there should be some OC headroom on tap, however, our sample wasn't all that capable, with a stable 6400MHz being a struggle when we were testing it. That likely comes down to our 12th Gen test system though. Assuming Kingston sticks with the same ICs, you'll getter better OC potential with 13th and 14th Gen processors. Don't expect to go hitting DDR5-8000 or anything like that with this kit, but Hynix chips generally have a bit of headroom if you're the adventurous OC type. The real strength of the Kingston Fury Beast kit is its value for money. At the time of writing it was one of the cheapest 2x16GB 6000MHz kits on the market, and its costs just a few dollars more than the cheapest kits. Remember, you would traditionally be looking at 3,600MHz DDR4 kits as relatively high-end just a couple of years ago If you care about performance and less about bling, this is a DDR5 kit that's well worth a look. Our expert review: ✅ You're all about the lightshow: Featuring a host of RGB LEDs across the top of each module—all controllable via Corsair's iCUE software—the Dominator modules bring the bling. Even the black aluminium build looks great without the RGB LEDs turned on. ❌ You feel the need for speed: This 5200MHz kit is an easy shout for a mid-range setup, offering higher performance than most DDR4 kits, but trails the more advanced modules on the market. Corsair's Dominator kits have always had premium good looks, and I think its DDR5 kits still look great. The black aluminum heat spreaders feel very solid and heavy. Even the fonts on the sides add a touch of class, even if you'll never see them built inside your rig. If DDR5 needed any significant cooling, these heat spreaders would do a sterling job. It must be said that these modules are very tall, so you'll need to make sure your cooler won't be impeded. The tops of the heatsinks feature something of a blocky Tetris-y RGB look. They can be controlled by Corsair's popular and easy-to-use if somewhat resource-intensive, iCue software. If you have other Corsair components lighting up your PC, you'll be right at home. A Corsair case, memory, cooler, and keyboard/mouse combo can look great when it's all synced up. Though I have to say I am not personally a fan of RGB, I will admit to a little bit of guilty pleasure in having a play with a full set of synchronized RGB components. Regardless, the Corsair kit performs at a decent level across our benchmark suite. The jump from the entry-level 4800MHz kits to 5200MHz is just enough to make a difference in apps that thrive on higher bandwidth. Of course, it trails the faster kits you would expect. We consider 5200MHz to be a good sweet spot DDR5 kit for a mainstream 12th Gen system. At 4800MHz, it doesn't add enough over a 3200MHz or 3600MHz DDR4 kit. And, as is the case with all DDR5 right now, the Corsair kit is too expensive to make any sort of value case. Though relative to other 5200MHz kits, at $360 (£350, $599 AUD). We know this pricing won’t remain that high long term as supply stabilizes. I mean, we’re not talking about GPUs here. Fans of Corsair products and the iCue RGB system won't need to be convinced to buy this kit. It looks fantastic, and though it won't set speed records, this kit should have many years of life ahead of it. You'll want to go with something faster if you must have every last drop of performance for a high-end rig, but for mainstream DDR5 buyers, Corsair won't let you down. For me, it's (mostly) worth the extra money over a 4800MHz kit, but you'll need to measure its value against what other brands and speeds are available when you buy... the market is just so volatile right now. Notably, Corsair DDR5 carries a premium that can vary significantly from market to market. If you don't mind paying a bit extra over a bland kit, the Corsair Dominator Platinum RGB kit will do the job, but it must be shown off in a windowed case.\n\nRead our Corsair Dominator Platinum RGB DDR5-5200 memory review Our expert review: ✅ You want to future-proof your PC: DDR6 is a long way off, and maybe even gaming PCs that need a ton of RAM, too, but if you want to buy a kit that will last a PC's lifetime, this 64GB set is certainly that.\n\n✅ You run memory-hungry applications: If you're running productivity apps that devour RAM like so much candy, this affordable GSkill kit is a real boon. ❌ You're expecting 64GB to improve your frame rates: Gaming doesn't need 64GB of DDR5 memory, at least not yet. You won't get higher performance, but at 6400MHz you will at least ensure you don't need to upgrade your memory for a looooong time. It's really stunning to see just how far DDR5 memory prices have fallen in the years since it was launched. Nowadays you can get a 2x32GB 6000MHz+ kit for less than an entry level 2x16GB kit cost back then. Here's a specific example: I reviewed a G.Skill Trident Z5 2x 16GB DDR5-6400 C32 kit in March 2022. At the time it was priced at $569! Fast forward two years and this lovely looking G.Skill 2x32GB kit will set you back around $210 to $220. To put it another way, the cost per gigabyte of this particular 2x32GB kit is less than that of an equivalent 2x16GB kit. This G.Skill 2x32GB DDR5-6400 kit is a good step up in speed over first generation kits, with lower timings as well. It's well worth spending the few bucks over a 5200MHz kit. It'll stand you in good stead in the future, with DDR5-6400 becoming JEDEC compliant, meaning it should become plug and play with future CPUs and platforms. When it comes to gaming, there won't be a need for a 2x32GB DDR5 kit anytime soon, but if you use apps that thrive with capacious amounts of fast RAM, this G.Skill kit offers great value for money, good looks and high performance to go with its high capacity. The white Trident Z RGB version just begs to be shown off as part of a clean white-themed build! Other than its usefulness in memory gobbling creative and professional apps, lots of memory is beneficial for heavy multitasking. If you're the kind of user the runs a browser with 100 tabs open, you stream, edit photos or videos and like to game, then you can do all at the same time, and alt-tab between apps with little lag. It's the kind of kit that will certainly last you for many years. With DDR6 a long way off, you'll be able to use it in several future builds. Think of it as an investment. It's not like 16GB is really hitting the wall right now, and 32GB won't be a problem anytime soon. But 64GB? You'll be set for at least a decade. All things considered, weighing up whether to buy such a kit isn't so much a case of asking yourself if you need it, it's more a case of why not? Many years from now, you'll surely appreciate that extra capacity for a relatively small outlay over a lesser kit. As long as the rest of your system is up to par that is. It remains the case that gamers will almost always benefit more from a GPU upgrade over a memory capacity upgrade. Read our full G.Skill Trident Z5 DDR5-6400 CL32 review. Best CPU for gaming | Best graphics card | Best gaming motherboards\nBest SSD for gaming | Best PC cases | Best gaming monitors The answer depends on what speeds and latencies we're talking about. Games tend to be sensitive to latency, where lower is better. A good low-latency DDR4 kit is still a viable gaming option. However, the real-world performance differences are small and non-existent in GPU-limited scenarios, which is usually the case unless you're chasing very high frames per second. If you have a good DDR4 kit, let's say a 2x16GB DDR4-3200 C14 kit or better, there's little reason to spend the money to upgrade to DDR5 for gaming. The higher bandwidth of DDR5 is beneficial in other areas though, particularly in creative-type applications. DDR5 uses less power, 32GB is generally the baseline, and a DDR5 system is better for future-proofing. As time goes on, we can expect faster and lower latency kits. When it all kicked off, DDR5 was entirely restricted to the Intel 12th Gen Alder Lake platform, but now we've had both the Intel 13th Gen Raptor Lake and AMD Zen 4 processor platforms released, which both support DDR5. AMD's Zen 4-based AM5 motherboards only support DDR5, while Intel's platforms do still offer DDR4 versions of their motherboards. No, it won't. Even though both types have 288 pins, DDR4 and DDR5 memory is electrically incompatible. The two types have a different notch positions, to prevent anyone from inserting a DDR5 module into a DDR4 motherboard, or vice versa. We recommend a minimum of 16GB for most serious gaming PCs (it's what we use in our high-end PC build), but as 32GB DDR5 kits are so widely available, 32GB has become the new baseline for a DDR5 system. With 32GB, you'll have more than enough for pretty much every task you can throw at your system. You'll easily be able to enjoy gaming, multitasking, creative or intensive apps, and frequent alt-tabbing. And you'll be all set for a few years to come, too. Firstly, you should use a dual-channel kit wherever possible. That goes for both DDR4 and DDR5 systems. That will ensure you're getting the most out of the best CPUs for gaming. For an Intel DDR5 system, a good kit around the 5200MHz range will be fine, while for a high-end system, you'll want something a little faster at 6000MHz or even 6400MHz if you really want to get every last drop of performance. No. Absolutely not. But RGB can make your machine look slightly cooler, and we all know PCs need to run cool. In the US: In the UK: DIMMs - Dual In-Line Memory Module, the physical circuit board that holds the RAM chips that plug into the slots on your motherboard. ECC Memory - Error-correcting Code Memory, RAM capable of automatically detecting and correcting errors on the fly, generally used in highly sensitive applications, like scientific data collection or banking. Typically only used and supported on servers and workstations, most desktop boards can run it as non-ECC. Frequency - The effective speed at which the memory operates, measured in MHz. CL/CAS Latency - Column Access Strobe Latency is the delay between the memory controller requesting data from the RAM and the available data; the first number listed in a kit's timings. SO-DIMM - More compact DIMM slots are typically deployed in laptops, although these can also turn up on tiny machines. Timings - The measure in several memory clock cycles an operation the memory controller requests will take for the RAM to complete. Lower is generally better. XMP - eXtreme Memory Profile, instructions for the BIOS that tell it what frequency, timings, and voltage to access RAM at, a shortcut for overclocking without tinkering with each set individually. Officially for Intel platforms, many AMD boards readily support reading XMP data (though it may go by another name like A-XMP or DOHC). The answer depends on what speeds and latencies we're talking about. Games tend to be sensitive to latency, where lower is better. A good low-latency DDR4 kit is still a viable gaming option. However, the real-world performance differences are small and non-existent in GPU-limited scenarios, which is usually the case unless you're chasing very high frames per second. If you have a good DDR4 kit, let's say a 2x16GB DDR4-3200 C14 kit or better, there's little reason to spend the money to upgrade to DDR5 for gaming. The higher bandwidth of DDR5 is beneficial in other areas though, particularly in creative-type applications. DDR5 uses less power, 32GB is generally the baseline, and a DDR5 system is better for future-proofing. As time goes on, we can expect faster and lower latency kits. When it all kicked off, DDR5 was entirely restricted to the Intel 12th Gen Alder Lake platform, but now we've had both the Intel 13th Gen Raptor Lake and AMD Zen 4 processor platforms released, which both support DDR5. AMD's Zen 4-based AM5 motherboards only support DDR5, while Intel's platforms do still offer DDR4 versions of their motherboards. No, it won't. Even though both types have 288 pins, DDR4 and DDR5 memory is electrically incompatible. The two types have a different notch positions, to prevent anyone from inserting a DDR5 module into a DDR4 motherboard, or vice versa. We recommend a minimum of 16GB for most serious gaming PCs (it's what we use in our high-end PC build), but as 32GB DDR5 kits are so widely available, 32GB has become the new baseline for a DDR5 system. With 32GB, you'll have more than enough for pretty much every task you can throw at your system. You'll easily be able to enjoy gaming, multitasking, creative or intensive apps, and frequent alt-tabbing. And you'll be all set for a few years to come, too. Firstly, you should use a dual-channel kit wherever possible. That goes for both DDR4 and DDR5 systems. That will ensure you're getting the most out of the best CPUs for gaming. For an Intel DDR5 system, a good kit around the 5200MHz range will be fine, while for a high-end system, you'll want something a little faster at 6000MHz or even 6400MHz if you really want to get every last drop of performance. No. Absolutely not. But RGB can make your machine look slightly cooler, and we all know PCs need to run cool. The answer depends on what speeds and latencies we're talking about. Games tend to be sensitive to latency, where lower is better. A good low-latency DDR4 kit is still a viable gaming option. However, the real-world performance differences are small and non-existent in GPU-limited scenarios, which is usually the case unless you're chasing very high frames per second. If you have a good DDR4 kit, let's say a 2x16GB DDR4-3200 C14 kit or better, there's little reason to spend the money to upgrade to DDR5 for gaming. The higher bandwidth of DDR5 is beneficial in other areas though, particularly in creative-type applications. DDR5 uses less power, 32GB is generally the baseline, and a DDR5 system is better for future-proofing. As time goes on, we can expect faster and lower latency kits. When it all kicked off, DDR5 was entirely restricted to the Intel 12th Gen Alder Lake platform, but now we've had both the Intel 13th Gen Raptor Lake and AMD Zen 4 processor platforms released, which both support DDR5. AMD's Zen 4-based AM5 motherboards only support DDR5, while Intel's platforms do still offer DDR4 versions of their motherboards. No, it won't. Even though both types have 288 pins, DDR4 and DDR5 memory is electrically incompatible. The two types have a different notch positions, to prevent anyone from inserting a DDR5 module into a DDR4 motherboard, or vice versa. We recommend a minimum of 16GB for most serious gaming PCs (it's what we use in our high-end PC build), but as 32GB DDR5 kits are so widely available, 32GB has become the new baseline for a DDR5 system. With 32GB, you'll have more than enough for pretty much every task you can throw at your system. You'll easily be able to enjoy gaming, multitasking, creative or intensive apps, and frequent alt-tabbing. And you'll be all set for a few years to come, too. Firstly, you should use a dual-channel kit wherever possible. That goes for both DDR4 and DDR5 systems. That will ensure you're getting the most out of the best CPUs for gaming. For an Intel DDR5 system, a good kit around the 5200MHz range will be fine, while for a high-end system, you'll want something a little faster at 6000MHz or even 6400MHz if you really want to get every last drop of performance. No. Absolutely not. But RGB can make your machine look slightly cooler, and we all know PCs need to run cool. Sign up to get the best content of the week, and great gaming deals, as picked by the editors. Chris' gaming experiences go back to the mid-nineties when he conned his parents into buying an 'educational PC' that was conveniently overpowered to play Doom and Tie Fighter. He developed a love of extreme overclocking that destroyed his savings despite the cheaper hardware on offer via his job at a PC store. To afford more LN2 he began moonlighting as a reviewer for VR-Zone before jumping the fence to work for MSI Australia. Since then, he's gone back to journalism, enthusiastically reviewing the latest and greatest components for PC & Tech Authority, PC Powerplay and currently Australian Personal Computer magazine and PC Gamer. Chris still puts far too many hours into Borderlands 3, always striving to become a more efficient killer. MSI releases Intel BIOS with support for 256GB of RAM, just in case 192GB isn't enough The quality of USB drives is getting worse thanks to re-used and often defective NAND chips including some from known brands Cyberpunk's quest director says CD Projekt Red has experimented with generative AI, but there's still a 'gigantic, really long way to go' before AI NPCs are as good as scripted characters By Kara Phillips27 March 2024 By Kerry Brunskill27 March 2024 By Wes Fenlon26 March 2024 By PC Gamer26 March 2024 By Harvey Randall26 March 2024 By Tyler Colp26 March 2024 By Andy Edser26 March 2024 By Dave James25 March 2024 By Fraser Brown25 March 2024 By Andy Edser25 March 2024 By Jody Macgregor25 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}