{
    "title": "AMD Launches the Radeon RX 7900 GRE Globally at $549",
    "date": "2/26/2024",
    "url": "https://www.extremetech.com/gaming/amd-launches-the-radeon-rx-7900-gre-globally-at-549",
    "text": "In August 2023, AMD launched the Radeon RX 7800 XT and 7700 XT and then proclaimed its RDNA 3 family of GPUs was complete. That's apparently not the case, as today, the company is officially launching the Radeon RX 7900 GRE, which was previously only available in China. The card is priced at $549, just $50 more than the 7800 XT, and is designed for high-refresh 1440p gaming. The new GPU is a cut-down version of Navi31 used in the other 7900 GPUs, placing it below the 7900 XT but slightly above the Navi 32-based 7800 XT on the spec and performance charts. It offers 80 compute units and ray accelerators, compared with 84 on the 7900 XT and just 60 on the 7800 XT. It is also the second GPU in AMD's stable to offer 16GB of GDDR6 memory, directly competing with the 7800 XT at $499. The two GPUs also offer a 256-bit memory bus, and both also feature 64MB of Infinity Cache to help boost memory bandwidth. It sure seems this new GPU will cannibalize the 7800 XT to us. AMD is launching this GPU to compete directly with Nvidia's RTX 4070, which just had its price lowered to $549. That GPU only offers 12GB of memory, so AMD has a clear advantage. AMD's benchmarks show the 7900 GRE outpacing Nvidia's card by anywhere from 1% to 32%, depending on the game at 1440p, with the average advantage being 14%, according to AMD. The company says the 7900 GRE is also better than the RTX 4070 at 4K gaming, thanks to its bigger memory buffer. When comparing games using Nvidia DLSS 3 frame generation and AMD's fluid-motion frames technology, AMD says the new card is still much faster. Still, we'll need to examine image quality before hopping on board that marketing hype train. The Radeon RX 7900 GRE will be available globally from AMD's partners starting tomorrow, Feb. 27. That means there will be no reference design, so you'll have to look to Gigabyte, Asus, Sapphire, and others for their custom solutions. Benchmarks should be arriving soon, so we'll see where it lands in relation to the RTX 4070 and the company's existing Radeon RX 7800 XT. We have to imagine the two Radeon GPUs will be quite close—making us wonder why AMD keeps releasing GPUs with pricing so close to one another, as the 7800 and 7700 XT were also within $50 at launch. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}