{
    "title": "GPU Market Sees 6% Increase In Shipments With Notebook Segment Taking The \nCharge, NVIDIA & AMD Flat But Intel Gains",
    "date": "2/27/2024",
    "url": "https://wccftech.com/gpu-market-6-percent-shipment-increase-notebooks-nvidia-amd-flat-intel-gains/",
    "text": "The PC GPU market has witnessed another positive quarter with shipments increasing by 6% in Q4 2023 to 76.2 million units, reports Jon Peddie Research. The stats shared by the research firm show the total units reaching 76.2 million units during the previous quarter (Q4 2023) which is a 24% increase year over year, the largest gain over the past two and a half decades. Given the annual growth rate of 3.6% (2024-2026), it is expected that the total installed base of GPUs will reach 5 Billion units by the end of 2026 with discrete GPUs making up a total of 30% share in the market. While the year-over-year growth of total GPU shipments increased by 20%, desktop graphics cards which include AIBs decreased by -1% while notebook GPUs saw a 32% increase. In terms of market share, AMD and NVIDIA lost share slightly by -1.4% and -1.36%, respectively. Intel saw an increase of +2.8% which made it gain the ground it had lost to the two competitors a few quarters back. The overall GPU shipments increased by 5.9% (rounded to 6%) with Intel's shipments increasing by +10.5% while AMD and NVIDIA fell by --2.9 % and --1.5 %, respectively. Although the discrete GPU numbers aren't mentioned specifically, we can expect them in the coming update from JPR. The other more interesting detail is the total CPU shipments which show that Notebook CPUs remain the popular choice, taking up a 69% shipment share versus 31% desktop CPUs. All of this marks a great quarter for the PC GPU and CPU segment which was up by 5.9% compared to the 10-year average of -0.6%. The following are the main highlights: The laptop segment saw a wide range of new and refreshed products from both AMD & Intel where as NVIDIA focused mainly on discrete GPU options aiming at the high-performance AI GPU segment. The company also recently introduced more entry-level offerings within its Ada lineup which can shake things up in the long run. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}