{
    "title": "AMD CEO Lisa Su Hits $1 Billion Net Worth Amid AI Boom",
    "date": "2/12/2024",
    "url": "https://technosports.co.in/amd-ceo-lisa-su-hits-1-billion-net-worth/",
    "text": "Following AMD’s stock surging past the $170 threshold, Lisa Su, the company’s CEO, has ascended to a net worth surpassing $1 billion, as per Forbes. Su is currently ranked as a self-made billionaire in the United States, largely thanks to her significant ownership of AMD shares. However, Su’s net worth falls behind that of her competitor, Jensen Huang, the CEO of Nvidia. Approximately $1.1 billion is estimated to be Sus worth, with around three-quarters of it tied up in four million AMD shares valued at roughly $700 million. The impressive performance of AMD stock has played a role in boosting Sus’s wealth. Despite selling $400 million worth of AMD stock since 2016 her net worth remains at least $1.1 billion. It is noteworthy that a substantial portion of Sus’s fortune relies on the value increase of AMD stock. As CEO since 2014, Su received compensation in both cash and stock—an arrangement for executives. Her significant holdings in AMD stock go back to when its value was considerably lower. Sus’s compensation package was heavily based on stocks aligning her interests with the company’s performance. Under her leadership and with initiatives, like the Zen CPU architecture AMD experienced a turnaround that led to record-breaking CPU revenue and market share. The purchase of Xilinx has added value to AMD’s market position, which is crucial, for their efforts in the field of AI.  Apart from her ownership in AMD Su probably has assets and investments given her involvement with companies like Cisco while she was at AMD. While it’s not clear exactly when Su became a billionaire it’s undeniable that her holdings in AMD play a role, in her billionaire status. In contrast, Nvidia CEO Jensen Huang boasts a much higher net worth, surpassing $60 billion, likely owing to his long-standing tenure at Nvidia, the company’s prosperous position in 2014, and the meteoric rise of its stock price, particularly since 2023. Save my name, email, and website in this browser for the next time I comment.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Made by Enthusiasts, Read by geeks and passionates. We serve the best Tech & Sports news for our global readers every day. Catch all the latest news at TechnoSports, join our family now!\nContact us: [email protected] © 2024 TechnoSports Media Group, Made in India "
}