{
    "title": "AMD's 20GB VRAM RX 7900 XT is just $670 but probably not for very long",
    "date": "2/7/2024",
    "url": "https://www.neowin.net/deals/amds-20gb-vram-rx-7900-xt-is-just-700-but-probably-not-for-very-long/",
    "text": "3 hours ago 3 hours ago 6 hours ago 6 hours ago 3 hours ago 13 hours ago 13 hours ago 19 hours ago Mar 28, 2024 Mar 27, 2024 Mar 26, 2024 Mar 26, 2024 Mar 28, 2024 Mar 28, 2024 Mar 26, 2024 Mar 26, 2024 7 hours ago Mar 30, 2024 Mar 30, 2024 Mar 30, 2024 Mar 25, 2024 Mar 23, 2024 Mar 20, 2024 Mar 17, 2024 Dec 31, 2023 Oct 14, 2023 Apr 11, 2023 Mar 27, 2024 Mar 25, 2024 Mar 10, 2024 Mar 3, 2024 Mar 24, 2024 Mar 21, 2024 Sep 23, 2023 Sep 21, 2023 19 hours ago Mar 29, 2024 Mar 28, 2024 Jun 14, 2003 Feb 23, 2024 Jan 20, 2024 Dec 6, 2023 Jun 6, 2023 Sayan Sen\n\nNeowin\n                ·\n    \n\n    Feb 7, 2024 09:18 EST\n    \n\nwith 8 comments Last month, AMD officially announced price cuts on two of its RX 7900 series GPUs informing Neowin about the change that was made effective immediately. The 7900 XT was dropped to $749, down $150 from its original MSRP or SEP of $899. Meanwhile, the slightly less capable RX 7900 GRE pricing was also slashed by $100 to $549. The prices were slashed in anticipation for Nvidia's RTX 4070 Ti Super which was landing at $799. The Nvidia card does perform well though there are some variants, particularly from MSI which appear to be crippled somewhere due to vBIOS limitations. While most of the 7900 XT models are now hovering around the $750 range, a Sapphire model, the Pulse, is currently on sale for just $699.99 with a digital coupon at Amazon which makes it a very attractive deal (buying link towards the end of the article). The deal may not last for very long. So if you are after a card that performs well at 1440p and 4K (2160p) this is a good GPU to consider. The 7900 XT has 20 Gigs of VRAM which means it has more than ample memory for even the most demanding titles, and you can even run high-resolution texture packs and mods. If you are wondering how the 7900 XT compares against the 4070 Ti and Super GPUs, the XT is a bit faster than both in rasterization performance. If, however, ray tracing is your jam, then you are better off considering Nvidia as even the more expensive 7900 XTX can only keep up with a 4070 Ti at best. Still, for the price of $669.99, the 7900 XT is fairly attractive deal: SAPPHIRE PULSE Radeon RX 7900 XT 20GB GDDR6 PCI Express 4.0 x16 ATX Video Card 11323-02-20G: $669.99 (Amazon US with digital coupon) SAPPHIRE PULSE Radeon RX 7900 XT 20GB GDDR6 PCI Express 4.0 x16 ATX Video Card 11323-02-20G: $699.99 (Newegg US) ASRock Phantom Gaming Radeon RX 7900 XT 20GB GDDR6 PCI Express 4.0 ATX Video Card RX7900XT PG 20GO: $699.99 (Newegg US) If this doesn't interest you, you can also browse through Amazon US, Amazon UK, or Newegg US, to see if you find some great deals that we missed. You can also go visit the Deals section of our articles to see if there's something you fancy. As an Amazon Associate I earn from qualifying purchases. Update - Alongside the deal at Newegg, we have also added the Amazon link that's cheaper with a digital coupon Update 2: The Pulse on Amazon is again back out of stock. Update 3: One of the ASRock variants is now down to $700 as well. Sayan Sen\n                                                ·\n                    \nNov 19, 2023\n\nwith\n5\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nJul 7, 2023\n\nwith\n0\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nJul 6, 2023\n\nwith\n15\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nApr 25, 2023\n\nwith\n12\n                            comment\n                                s Login or Sign Up to read and post a comment. Please enter your reason for reporting this comment. blackview bl8000 horizon forbidden west windows 11 insider preview promo microsoft weekly twirl 158 windows 11 insider preview promo windows 11 moment 5 dragons dogma 2 task manager notepad © Since 2000 Neowin®\n                                    All trademarks mentioned are the property of their respective owners. "
}