{
    "title": "Old Nvidia gaming GPUs enjoy huge performance uplifts from new mod — DLSS 3 \nto FSR 3 mod enables frame ...",
    "date": "2/3/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/new-mod-brings-huge-performance-uplifts-on-old-nvidia-gaming-gpus-dlss-3-to-fsr-3-mod-enables-frame-generation-to-deliver-up-to-75-better-performance-on-previous-geforce-rtx-gpus",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. AMD Radeon GPU owners are out of luck for the current time being. Don't fret if you don't own one of the best graphics cards. Since AMD released its FSR 3 source code a few months ago, modders have been busy creating new mods that inject FSR 3 frame generation into DLSS 3-supported titles. These new mods enable users to run FSR 3 in some games where FSR 3 is not implemented. Digital Foundry reviewed one of these FSR 3 mods and found it can breathe new life into older RTX 20-series and RTX 30-series GPUs, boosting performance up to 75%. The only major downside with these new FSR 3 mods is that they only support GeForce RTX series GPUs, not any AMD GPUs. Digital Foundry used a global FSR 3 to DLSS 3 conversion mod that works with any game that supports DLSS 3 natively. Like FSR 2 mods of the past, the FSR 3 mod requires users to inject two new .dll files into a game's directory that features the FSR 3 source code. For RTX 20 and 30 series users, the mod Digital Foundry also has a registry edit to trick Windows into thinking these GPUs support DLSS 3. This is necessary so that DLSS 3 can be activated inside the game, which in and of itself will activate FSR 3 due to the modded .dll files. Digital Foundry discovered fantastic performance uplifts with the FSR 3 mod in action. The review outlet tested several modern AAA titles, including Cyberpunk 2077 and Spider-Man: Miles Morales on an RTX 3080. In Cyberpunk, the RTX 3080 saw an impressive 67% uplift 1440P with DLSS performance upscaling and RT overdrive enabled. Without FSR 3, the RTX 3080 covered around the 60-70 FPS mark, but with FSR 3 enabled, the GPU could achieve over 100 FPS consistently, with frame rates going up as high as 120 FPS. Miles Morales saw a similar performance uplift as Cyberpunk 2077, hovering around 65-75% better performance with FSR 3 enabled. The game was run at 1440P with DLAA enabled and max quality graphics with RT enabled. With FSR 3 turned off, the game hovered around 50-60 FPS, but with FSR 3 enabled, the game ran at about 100 FPS. However, Digital Foundry discovered that the FSR 3 mod suffers from additional artifact issues not present in most games with proper FSR 3 implementations, including artifacts such as HUD elements, sizzling hair, and shadow flicker. The FSR 3 mod isn't perfect, but it demonstrates how advantageous FSR 3's open compatibility is compared to Nvidia's DLSS 3 implementation, which is strictly limited to RTX 40 series GPUs. With FSR 3, older GPUs can benefit from frame generation technology, significantly boosting their lifespan. Having 65-75% more performance is equivalent to the same performance improvement you'd get from upgrading your GPU to one two generations newer. The only caveat is that you'll need to get used to FSR 3's additional latency penalty to enjoy that additional performance truly. The icing is that FSR 3 can now be modded into games that already support DLSS 3. This is very advantageous since relatively few titles still natively support AMD's new FSR 3 frame generation tech. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Aaron Klotz is a freelance writer for Tom’s Hardware US, covering news topics related to computer hardware such as CPUs, and graphics cards. Seven-year-old AMD gaming GPU continues to stick around — low-profile RX 550 arrives for SFF PCs Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels Best Resin 3D Printers 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}