{
    "title": null,
    "date": "2/11/2024",
    "url": "https://www.techradar.com/computing/gpu/rtx-4080-super-vs-rx-7900-xtx",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Which to buy, the RTX 4080 Super or RX 7900 XTX?   Compute Units: 80\nShaders: 10,240\nRay processors: 80\nAI/Tensor processors: 320\nBase clock: 2,295 MHz\nBoost clock: 2,550 MHz\nMemory clock: 1,438 MHz\nMemory type: GDDR6X\nMemory pool: 16 GB\nMemory speed (effective): 23 Gbps\nMemory bandwidth: 736.3 GB/s\nBus interface: 256-bit\nTGP: 320W\nPower connector: 1 x 16-pin\nSlot width: Triple Nvidia's latest is easily the best premium graphics card on the market, second only to the Nvidia RTX 4090 in terms of performance.   Compute Units: 96\nShaders: 6,144\nRay processors: 96\nAI/Tensor processors: 192\nBase clock: 1,900 MHz\nBoost clock: 2,500 MHz\nMemory clock: 2,500 MHz\nMemory type: GDDR6\nMemory pool: 24 GB\nMemory speed (effective): 20 Gbps\nMemory bandwidth: 960 GB/s\nBus interface: 384-bit\nTGP: 355W\nPower connector: 2 x 8-pin\nSlot width: Dual AMD's flagship graphics card, the RX 7900 XTX is an absolute beast of a GPU with 24GB VRAM, DisplayPort 2.1 output for 8K@165Hz, and more. If you’re thinking of building a top-end rig then you’ll need to weigh up the Nvidia RTX 4080 Super vs AMD RX 7900 XTX. The two enthusiast-class graphics cards are built for the power user wanting to push the best PC games to their limits in 4K, further bolstered by sophisticated AI upscaling technologies. We’re comparing both cards based on their price, design, and performance. Without question, both the RTX 4080 Super and RX 7900 XTX do enough to be considered not only some of the best 4K graphics cards, but some of the best graphics cards ever made, too. However, they come at a steep price point. It’s a toss up of seemingly unlimited power at the bleeding edge as these two options are an ideal fit to build one of the best gaming PCs around. We go into more detail in our dedicated RTX 4080 Super review and RX 7900 XTX review for the full lowdown and extended thoughts. We recommend further reading given just how big of an investment a high-end GPU is in 2024, and we’re here to help by pitting the RTX 4080 Super vs RX 7900 XTX to see which card comes out on top.  One of the most interesting factors regarding the RTX 4080 Super vs RX 7900 XTX is the pricing of the two high-end video cards. That’s because the recently-released RTX 4080 Super is priced identically to the MSRP of the RX 7900 XTX. Both GPUs start at $999.99 (about £899 / AU$1,800). This is interesting because Team Green is firing back at Team Red by dropping the original RTX 4080’s obscene $1,199 (about £1,080, AU$1,740) MSRP. It’s a blow to the aggressive pricing of AMD’s flagship graphics card for sure, but not quite the death knell it could have been. That’s because you can frequently find the RX 7900 XTX below MSRP from partners such as Sapphire, PowerColor, and XFX, with sales frequent in 2024. Still, if we take the two manufacturer’s prices into account, there’s no clear winner, and for that reason, we have to tie.  Taking the respective Founders Edition and Reference cards into account, we can see that Nvidia and AMD had very different design philosophies when developing their top end cards. Little has changed with the RTX 4080 Super compared to its predecessor from its physical presence, it’s a 3-slot GPU that measures in at 11.9 x 5.3 inches, and the partner cards can be bigger. In contrast, Team Red went with a sleeker approach as its flagship is a 2.5 slot graphics card with a smaller 11.2 x 4.3 inches. Nvidia is once again relying on a proprietary power connector, a 16-pin adapter, while AMD has kept things straightforward as the XTX only uses 2x 8-pin PCIe connectors. That means that the Reference Card is considerably sleeker and more convenient than Nvidia’s Founders Edition model, but your mileage may vary when factoring in partner variants. On the technical front, the RTX 4080 Super features a total of 10,240 CUDA cores (a slight bump up from the base RTX 4080’s 9,728 CUDA cores) and is built upon the AD103 die with 16GB GDDR6X memory on a 256-bit memory bus. In contrast, the RX 7900 XTX consists of 6,144 stream processors and is forged on Navi 31 silicon. It features 24GB GDDR6 VRAM on a 384-bit memory bus. The trade-off here is a lower core count with a higher amount of slower memory, and a wider memory bus. This extends to the bandwidth with the former clocking in at 736 GB/s and the latter leading with 960 MB/s.  In our industry standard synthetic benchmarks, the recently released RTX 4080 Super holds up valiantly against the RX 7900 XTX but doesn’t quite pull ahead across the board. There are exceptions, of course, with the Team Green GPU taking the lead in 3DMark’s Night Raid, Port Royal, and Wildlife Extreme. The most impressive lead was with the PassMark 3D graphics overall score. However, Team Red’s flagship wins out in Sky Diver, Fire Strike Extreme, and GeekBench 6 Compute (Vulkan). When it comes to creative performance, the RTX 4080 Super comes out way ahead, with the RX 7900 XTX not even being able to properly run the Blender Benchmark 4.0.0 workloads. This might be something fixed in a later update, but it's emblematic of the RX 7900 XTX uneven creative performance, though it does pull ahead in Adobe Photoshop's rasterization workloads. The 4K gaming performance is the real test of the two cards’ metal. Starting off with the RTX 4080 Super’s impressive average framerates in demanding software. The card achieves a 57fps average in Cyberpunk 2077 without ray tracing and 28fps with RT Psycho active with upscaling. Enabling DLSS 3 Frame Generation sees a mighty boost to 85fps and 63fps with the technology activated, which is impressive given how demanding this title continues to be. The GPU didn’t break a sweat with Returnal either, with the game’s native performance averaging 91fps and Epic RT at 68fps. DLSS bolstered these figures to 138fps and 118fps respectively. The extra VRAM, larger bandwidth, and bigger memory bus gives the RX 7900 XTX a slight advantage in terms of raw graphical prowess. This is evidenced in the native performance of Cyberpunk 2077 in 4K which averaged 60fps without ray tracing and 29fps with RT Psycho on. That’s before switching on FSR upscaling which saw figures jump to 94fps without ray tracing but just 41fps with the tech dialed up all the way. Returnal at Epic settings achieved an average of 94fps without RT and 56fps with Epic ray tracing enabled. FSR saw a boost to 159fps and 102fps, too. From our testing, it’s clear that despite the slower GDDR6 VRAM used, the AMD RX 7900 XTX pulls ahead slightly when it comes to raw processing power but trips the landing where ray tracing is concerned. Nvidia’s ray tracing prowess hasn’t quite been dethroned by RDNA 3, but Team Red’s flagship with its second-generation RT hardware does a respectable job for its pricing, though.  Considering the fact that the RTX 4080 Super and RX 7900 XTX start at the exact same price, the choice between them is ultimately going to come down to how crucial ray tracing prowess is to your gaming setup. If you’re someone who wants to game in 4K without compromise in the latest games then the 24GB VRAM of Team Red’s card should give you a decent amount of overhead. However, if you want to try out ray and path tracing in 4K then you should consider the RTX 4080 Super instead. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. Aleksha McLoughlin is the Hardware Editor for TechRadar Gaming and oversees all hardware coverage for the site. She looks after buying guides, writes hardware reviews, news, and features as well as manages the hardware team. Before joining TRG she was the Hardware Editor for sister publication GamesRadar+ and she has also been PC Guide's Hardware Specialist. She has also contributed hardware content to the likes of Trusted Reviews, The Metro, Expert Reviews, and Android Central. When she isn't working, you'll often find her in mosh pits at metal gigs and festivals or listening to whatever new black and death metal has debuted that week. Intel Battlemage leak gives us hope that maybe there’ll be a more powerful 2nd-gen Arc GPU after all Samsung officially reveals GDDR7 memory for GPUs, which is great news for gamers A new iPhone 16 case leak hints at this year's rear camera redesign By Allisa JamesMarch 04, 2024 By James RogersonMarch 01, 2024 By Paul HattonFebruary 29, 2024 By Dashiell WoodFebruary 23, 2024 By Rob DwiarFebruary 23, 2024 By Ruth JonesFebruary 22, 2024 By Jon MundyFebruary 20, 2024 By Ruth HamiltonFebruary 19, 2024 By Jon MundyFebruary 19, 2024 By Becca CaddyFebruary 18, 2024 By Jon MundyFebruary 16, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}