{
    "title": null,
    "date": "2/5/2024",
    "url": "https://www.neowin.net/deals/intel-slashes-the-overpriced-i5-14th-gen-following-amds-epic-5950x--5800x3d-deals/",
    "text": "3 hours ago 3 hours ago 6 hours ago 6 hours ago 3 hours ago 13 hours ago 13 hours ago 19 hours ago Mar 28, 2024 Mar 27, 2024 Mar 26, 2024 Mar 26, 2024 Mar 28, 2024 Mar 28, 2024 Mar 26, 2024 Mar 26, 2024 7 hours ago Mar 30, 2024 Mar 30, 2024 Mar 30, 2024 Mar 25, 2024 Mar 23, 2024 Mar 20, 2024 Mar 17, 2024 Dec 31, 2023 Oct 14, 2023 Apr 11, 2023 Mar 27, 2024 Mar 25, 2024 Mar 10, 2024 Mar 3, 2024 Mar 24, 2024 Mar 21, 2024 Sep 23, 2023 Sep 21, 2023 19 hours ago Mar 29, 2024 Mar 28, 2024 Jun 14, 2003 Feb 23, 2024 Jan 20, 2024 Dec 6, 2023 Jun 6, 2023 Sayan Sen\n\nNeowin\n                ·\n    \n\n    Feb 5, 2024 12:24 EST\n    \n         · Hot! \nwith 0 comments Recently, AMD had one of those rare yet great flash sales where it priced its 16-core Ryzen 9 5950X, the best overall socket AM4 CPU, at just $365 on Amazon US. Following that, the \"Red team,\" courtesy of Newegg US, also made the 8-core 5800X3D a great option by bundling it with a free $90 B450 motherboard, all for just $315. While those discounts and promo offers are no longer available, and if you don't have an affinity for AMD processors only, you can consider going the Intel route as the Core i5-14600K, which is based on Intel's latest (14th Gen) Raptor Lake refresh design is up for sale for its lowest ever price of just $300 (buying links towards the end of the article). We reviewed the i5-14600K alongside the flagship i9-14900K, and although the latter was faster, we found ourselves admiring the 14600K just as much since the Core i5 was not gobbling down power like the i9, and hence offered a bit more balance in terms of performance-per-watt. You'd still need to pair up the i5 with a decent Socket LGA1700 (600 or 700 series chipset) motherboard that costs around $150 or more to get the best performance out of it. In doing so, expect to extract excellent gaming performance out of it as long as you pair it up with a capable GPU like an AMD 7800 XT/ 7900 XT or XTX, or an Nvidia RTX 4070 or higher. The 14600K also does not come with a stock cooler and hence a 240mm AIO is recommended at the minimum. Get the Core i5-14600K for its cheapest price ever at the links below, The deal on Newegg US is even better considering you get t free game code for Ghostrunner 2: Intel Core i5-14600K - Core i5 14th Gen 14-Core (6P+8E) LGA 1700 125W Intel UHD Graphics 770 Processor - Boxed - BX8071514600K: $299.99 (Amazon US) (Price varies between $319 to $349) Intel Core i5-14600K - Core i5 14th Gen 14-Core (6P+8E) LGA 1700 125W Intel UHD Graphics 770 Processor - Boxed - BX8071514600K+\n\tIntel Gift Game Code - Ghostrunner 2 worth $39.99: $299.99 (Newegg US) (Price varies between $319 to $349) If this doesn't interest you, you can also browse through Amazon US, or Amazon UK to see if you find some great deals that we missed. You can also go visit the Deals section of our articles to see if there's something you fancy. As an Amazon Associate I earn from qualifying purchases. Sayan Sen\n                                                ·\n                    \nMar 20, 2024\n\nwith\n6\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nMar 12, 2024\n\nwith\n0\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nNov 22, 2023\n\nwith\n7\n                            comment\n                                s John Callaham\n                                                ·\n                    \nMar 24, 2023\n\nwith\n0\n                            comment\n                                s Login or Sign Up to read and post a comment. Please enter your reason for reporting this comment. blackview bl8000 horizon forbidden west windows 11 insider preview promo microsoft weekly twirl 158 windows 11 insider preview promo windows 11 moment 5 dragons dogma 2 task manager notepad © Since 2000 Neowin®\n                                    All trademarks mentioned are the property of their respective owners. "
}