{
    "title": "Arctic Liquid Freezer III 360 ARGB CPU Cooler Review",
    "date": "2/20/2024",
    "url": "https://www.kitguru.net/components/cooling/james-dawson/arctic-liquid-freezer-iii-360-argb-white-aio-cpu-cooler-review/all/1/",
    "text": "James Dawson \nFebruary 20, 2024\nCooling, Featured Tech Reviews, Reviews 1. Arctic Liquid Freezer III 360 ARGB White2. Test Results3. Closing Thoughts4. View All Pages The product we have for review today is possibly the most important new liquid CPU cooler to launch this year. The Arctic Liquid Freezer II was and still is a very popular choice with enthusiasts due to its solid thermal performance, low noise and affordable price. But Arctic has now launched its successor, the Liquid Freezer III. In this review, we take a look at the new Liquid Freezer III 360 ARGB White and put it to the test on both our AMD and Intel CPU cooler test benches to see what improvements Arctic has made with this new model. Timestamps: 00:00 Start\n00:45 Version 3 and changes\n03:34 A closer look\n07:17 Mounting / support – accessories\n09:26 Thermal Performance on Intel / AMD\n12:52 Noise output\n13:18 So is it any good?\n15:08 Closing Thoughts Arctic Liquid Freezer III 360 ARGB Features: Specifications:   Test System Specifications: AMD Test Bench Intel Test Bench Testing Methodology: We are primarily focussing on the performance of each cooler at 100% fan speed and also when locked to 40dBA noise output. We will focus on cooling performance using a manual overclock with all-core frequency and VCORE locked to 5.2GHz/1.3v and Precision Boost Overdrive performance. Thermal Performance AMD Ryzen 9 7950X: In the first of three tests on the AMD Ryzen 9 7950X test bench we look at the thermal performance with the CPU frequency/voltages fixed and the radiator fans, pump speed and VRM fan speed all fixed at maximum RPM to measure the cooler's raw performance.  The Liquid Freezer III 360 performance in this test is superb, producing an average CPU delta temperature of 63°C and almost topping the chart. Only the more expensive EK-Nucleus can outperform the Liquid Freezer III and it uses a much higher maximum fan speed and is significantly more expensive.  The noise output of the Liquid Freezer III at maximum fan speed is very quiet so it has an advantage over the competition when we reduce fan speed to normalise noise output. In the noise normalised test, the Liquid Freezer III again shows it has excellent performance on the AM5 platform, with an average CPU Delta of 66°C which means it tops the noise normalised chart.  In the 7950X PBO test, again the Liquid Freezer III shows its solid performance by cooling 201W package power to an average delta of 68°C, while holding an average clock multiplier of 51.4X which is again right at the top of the charts and equalling the performance of more expensive 360mm AIO coolers. So performance in all scenarios on AMD Ryzen 9 7950X is great. Intel Core i9-13900K: We are still adding coolers to our Intel 13900K test bench so right now we don’t have the extensive list as we do on our AMD test system however, we can compare the performance of the Liquid Freezer III against some other 360mm AIOs including the Liquid Freezer II 360. The Intel Core i9-13900K pulls over 100W more package power compared to the AMD Ryzen 9 7950X in our manual OC test, so it’s an even tougher test on coolers.  Compared with other 360mm coolers that we’ve tested on this platform previously, the Liquid Freezer III performance isn’t as impressive as it is on the AMD 7950X. The Liquid Freezer III 360 is over 10°C hotter than the top coolers in this chart and it only offers a minor improvement in thermals over the Liquid Freezer II which is quite disappointing.  Normalising the noise output of the fans to 40dBA gives us an improvement with the Liquid Freezer III but it still lags behind the top coolers on the 13900K test system and again there's no significant improvement in thermals compared with the Liquid Freezer II.  In our final test on the 13900K we fixed the fan speed to 1400 RPM on all coolers, but again the Liquid Freezer III performance isn’t as good as we hoped and there's no improvement in thermal performance versus the Liquid Freezer II 360. So either the Liquid Freezer III is more optimised for AMD CPUs or its simply overwhelmed by the 300W plus package power produced by the i9-13900K. Acoustics  In terms of noise output the Liquid Freezer III is virtually identical at maximum fan speed as the Liquid Freezer II as it uses the same P Series fans. So the Liquid Freezer II is extremely quiet at maximum fan speed compared with most high-performance coolers, so if noise is important to you then this is a great choice. And it explains why there isn’t much of a drop in thermal performance when we normalise noise to 40dBA Due to the inconsistent thermal performance between AMD and Intel platforms that we saw from testing the Arctic Liquid Freezer III, it's not so easy to conclude whether this one is worth buying or not. If you already have a Liquid Freezer II and you are looking for more performance on AM5 then it’s certainly a good upgrade, not only in thermal performance but it’s also a definite visual upgrade, the white model will look particularly impressive in a white-themed system. However, if you have an Intel 13th Gen or newer CPU, particularly the i9 series, then the Liquid Freezer III might be a good choice in terms of value but other coolers perform significantly better on our Intel LGA1700 test system at least. If you are thinking of upgrading from a Liquid Freezer II to a Liquid Freezer III for better performance, it's not worth the upgrade on LGA1700 unless you really prefer the looks of the Liquid Freezer III. CPU platforms and thermal performance aside, it’s a very good-looking AIO cooler, a big improvement over the Liquid Freezer II for me in terms of the aesthetics. It’s a very well-built and quality-looking AIO too, I always felt that the plastic pump housing of the Liquid Freezer II looked a little cheap, the Liquid Freezer III is a big improvement in that sense for sure. Plus it comes with a 6-year warranty for peace of mind so if things do go wrong, Arctic has got your back there.  It's certainly a great cooler for AMD AM5, it produces superb thermal performance on our AM5 test system and produces low noise output, even at high fan RPM. If you combine these things with the exceptionally reasonable price tag it is an absolute no-brainer for AMD AM5 platform owners. However, on high-end Intel CPUs, it's not the AIO that I would recommend based on thermal performance alone. This cooler is proof that you should never base your CPU cooler purchase on a single review alone as it may not have been tested on the same CPU platform that you plan to use it on, and as we have seen from the Arctic Liquid Freezer III 360 ARGB, just because a cooler performs well on AMD it doesn’t necessarily mean it will give the same performance on an Intel CPU. If I were to award this a score based on AMD testing alone it would be a solid 9/10 but since Intel's performance isn’t as good it has to be marked down a little, but it’s a great cooler for AMD users that’s for sure. The Arctic Liquid Freezer III 360 ARGB White is available at Amazon UK and other UK retailers with an MSRP Price of £99.99. Discuss on our Facebook page HERE. Pros: Cons: KitGuru says: If you are looking for a new AIO with great thermal performance for your AMD Ryzen 7000 CPU then look no further as the Arctic Liquid Freezer III is hands down the best value CPU cooler for AMD.  Become a Patron! Be sure to check out our sponsors store EKWB here Tags AIO CPU cooler AMD Ryzen 9 7950X Arctic Liquid Freezer III ARGB Best AIO cooler for AMD best cpu cooler CPU AIO CPU water cooler Custom loop Intel Core i9-13900K Liquid Freezer III review Review X670 Aorus Elite Z790 Aorus Master Can the EK-Nucleus AIO CR360 Direct Die cooler tame the Intel Core i9-14900KS?   DDR5 speed on your next PC: How fast?  View Results "
}