{
    "title": "Lenovo ThinkPad laptops: 2024 T14 and T16 are easy to repair",
    "date": "2/25/2024",
    "url": "https://bgr.com/tech/lenovo-teamed-up-with-ifixit-to-take-thinkpad-laptop-repairability-to-the-next-level/",
    "text": "Sign up for our daily newsletter If you buy through a BGR link, we may earn an affiliate commission, helping support our expert product labs. Lenovo’s concept ThinkBook laptop with a transparent display is easily one of the most exciting things from MWC 2024. But that’s a product that’s several years away from launching… if it ever even matures past the concept stage. Lenovo introduced several new ThinkPad laptops in Barcelona that are actually ready to be released and will soon be available to purchase. The list includes the ThinkPad T14 Gen 5, ThinkPad T14s Gen 5, ThinkPad T16 Gen 3, ThinkPad X12 Detachable Gen 2, and ThinkBook 14 2-in-1 Gen 4. The naming scheme might be complicated, but fans of the ThinkPad and ThinkBook lines should be more than familiar with them. Two of those models stand out from Lenovo’s MWC announcements thanks to something that you wouldn’t expect from a modern laptop. The ThinkPad T14 Gen 5 and T16 Gen 3 have been redesigned internally, making them remarkably easier to repair. Lenovo worked with iFixit to optimize the repairability of these two laptops. After seeing them in action in Spain, I was impressed. These ThinkPads are practically modular; you can swap out and upgrade almost all their internal components. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. When it comes to specs, the two ThinkPads are very well-equipped to handle the current needs of enterprise users. They feature the latest Intel Core Ultra chips with Intel vPro, with the T14 model also available with an AMD Ryzen 8040 series. The laptops can pack up to 64GB of DDR5 RAM and up to 2TB SSDs. Other specs include up to Intel Arc graphics or integrated AMD Radeon, 2.8K OLED (T15) or 4K OLED (T16) panels, dual speakers, dual microphones, 5-megapixel cameras, USB-C, USB-A, HDMI, Ethernet, nano-SIM (up to 5G), up to Wi-Fi 7 connectivity, Bluetooth 5.3, and a fingerprint reader. The laptops run Windows 11 Pro with Microsoft Copilot AI, and they feature the new Copilot key. Finally, they come with new tactile markings that Lenovo introduced with the ThinkPad X1 Carbon Gen 12 and ThinkPad X1 2-in-1 Gen 9 to improve accessibility for visually impaired users. The point is that the new ThinkPads will be versatile, dependable computers, and the ease of repairing and upgrading them is the cherry on top. Lenovo’s focus is on repairability. That’s why it partnered with iFixit for help. The folks at iFixit showed me how easy it is to replace the new ThinkPad T15 Gen 5 components compared to its predecessor. Whether it’s the battery, keyboard, RAM, SSD, or Ethernet port, everything is replaceable. It’s very easy to take off that rear cover and then figure out what to do next. You wouldn’t be guessing. It’s not just the more accessible screws or the cable-free battery connector. Everything that can be repaired or replaced has a QR code that will load up the proper information. That means guides that Lenovo made in collaboration with iFixit and links to official parts for the laptop. However, you will be able to buy compatible RAM and SSDs from elsewhere. All of this made me realize we’re almost looking at modular Lenovo laptops. The only things you can’t replace easily are the motherboard with its chips, and most of the ports. That’s why iFixit gave the laptops a 9 out of 10 repairability score. All things considered, however, I’m not sure we should expect any laptop to have better repairability. Also, considering how easy it is to upgrade the RAM and SSD, you have the luxury of ordering a base ThinkPad T14 Gen 5 or T16 Gen 3 and upgrading these components only if you need to. Later upgrades could add extra years of life to your laptop and save you money in the long run. The ThinkPad T14 Gen 5 will be available in April starting at $949 (AMD) and $1,199 (Intel). The larger T16 Gen 3 also launches in April, starting at $1,219. Lenovo’s other laptop models announced in Barcelona will also be available soon. They’ll be ready to offer some of the same performance upgrades as the ThinkPad T14 and T16, though they won’t feature the same easy-to-repair design. Here are Lenovo’s other new laptops announced at MWC: On top of that, Lenovo announced a few new accessories, like the ThinkVision M14t Gen 2 Mobile Monitor ($399) that features a touchscreen display, a USB-C Slim Travel Dock ($89.99), and a ThinkPad Executive 16-inch Backpack ($179.99). Hopefully, more of Lenovo’s ThinkPad designs will feature similarly easy to repair internal designs in the future. And that others in the industry will follow Lenovo’s lead. Meanwhile, Lenovo addressed sustainability beyond improved repairability. The company said it aims to recycle 800 million pounds of end-of-life products by 2025-2026. Also, the company wants to use 300 million pounds of post-consumer recycled plastics in its products. Chris Smith has been covering consumer electronics ever since the iPhone revolutionized the industry in 2008. When he’s not writing about the most recent tech news for BGR, he brings his entertainment expertise to Marvel’s Cinematic Universe and other blockbuster franchises. Outside of work, you’ll catch him streaming almost every new movie and TV show release as soon as it's available. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. BGR’s audience craves our industry-leading insights on the latest in tech and entertainment, as well as our authoritative and expansive reviews. We guide our loyal readers to some of the best products, latest trends, and most engaging stories with non-stop coverage, available across all major news platforms. Founded in 2006 Over 2 billion visitors 100K+ articles published Millions of readers helped Honest news coverage, reviews, and opinions since 2006. -\n\t\t\t\t\t\tJonathan S. Geller, Founder BGR is a part of Penske Media Corporation.\n© 2024 BGR Media, LLC. All Rights Reserved. "
}