{
    "title": "AMD Ryzen 5 7520U vs Intel Pentium 8500 vs Intel Core i5-1235U",
    "date": "3/27/2024",
    "url": "https://www.notebookcheck.net/R5-7520U-vs-Pentium-8500-vs-i5-1235U_14609_14114_14078.247596.0.html",
    "text": "The AMD Ryzen 5 7520U is a mobile processor for cheap laptops of the Mendocino series. It integrates four older Zen 2 cores (similar to the Ryzen 4000 series like the Ryzen 3 4300U). The CPU cores clock from 2.8 GHz (base) to 4.3 GHz (single core Turbo) and can use 4 MB L3 cache. Thanks to SMT/Hyperthreading, the CPU can work on 8 threads simultaneously. The integrated memory controller only supports fast LPDDR5 memory (5500 MHz max.). \nThe integrated graphics adapter (Radeon 610M iGPU) uses the modern RDNA 2 architecture, but only 2 CUs (128 shaders) and clocks with up to 1.9 GHz. \nPerformance \nThe average 7520U in our extensive database is in the same league as the Core i7-1185G7, as far as multi-thread benchmark scores are concerned. This is a so-so result and indicative of a lower mid-range chip, as of Q3 2023. \nYour mileage may vary depending on how high the CPU power limits are and how competent the cooling solution of your system is. \nMendocino series chips are produced on a relatively modern 6nm FinFET process at TSMC and should offer a good power efficiency. The R5 7520U is rated at 8-15 W TDP and therefore well suited for thin and light laptops. The AMD Ryzen 5 7520U is a mobile processor for cheap laptops of the Mendocino series. It integrates four older Zen 2 cores (similar to the Ryzen 4000 series like the Ryzen 3 4300U). The CPU cores clock from 2.8 GHz (base) to 4.3 GHz (single core Turbo) and can use 4 MB L3 cache. Thanks to SMT/Hyperthreading, the CPU can work on 8 threads simultaneously. The integrated memory controller only supports fast LPDDR5 memory (5500 MHz max.). The integrated graphics adapter (Radeon 610M iGPU) uses the modern RDNA 2 architecture, but only 2 CUs (128 shaders) and clocks with up to 1.9 GHz. Performance The average 7520U in our extensive database is in the same league as the Core i7-1185G7, as far as multi-thread benchmark scores are concerned. This is a so-so result and indicative of a lower mid-range chip, as of Q3 2023. Your mileage may vary depending on how high the CPU power limits are and how competent the cooling solution of your system is. Mendocino series chips are produced on a relatively modern 6nm FinFET process at TSMC and should offer a good power efficiency. The R5 7520U is rated at 8-15 W TDP and therefore well suited for thin and light laptops. The Intel Pentium 8500 is an entry-level low-power mobile CPU for thin and light laptops based on the Alder Lake architecture. It was announced in early 2022 and offers one performance core (P-cores, Golden Cove architecture) and 4 efficient cores (E-cores, Gracemont architecture). The P-cores support Hyper-Threading leading to 6 supported threads when combined with the E-cores. The clock rate ranges from 1 to 4.4 GHz on the performance cluster and 0.7 to 3.3 GHz on the efficient cluster. The performance of the E-cores should be similar to old Skylake cores (compare to the Core i7-6700HQ). All cores can use up to 8 MB L3-cache. Compared to the faster Core i3-1210U, the Pentium offers one less P-core. \nPerformance \nWhile we have not tested a single system built around the 8500 as of August 2023, it's safe to expect the chip to be about 20% slower than the i3-1215U, as far as multi-thread performance is concerned. Which is pretty terrible as of Q3 2023. \nYour mileage may vary depending on how high the CPU power limits are and how competent the cooling solution of your system is. \nFeatures \nThe integrated memory controller supports various memory types up to DDR5-4800, DDR4-3200, LPDDR5-5200, and LPDDR4x-4267. The Thread Director (in hardware) can support the operating system to decide which thread to use on the performance or efficient cores for the best performance. For AI tasks, the CPU also integrates GNA 3.0 and DL Boost (via AVX2). Quick Sync in version 8 is the same as in the Rocket Lake CPUs and supports MPEG-2, AVC, VC-1 decode, JPEG, VP8 decode, VP9, HEVC, and AV1 decode in hardware. The CPU only supports PCIe 4.0 (x8 for a GPU and two x4 for SSDs). \nThe integrated graphics adapter is based on the Xe-architecture and offers 48 of the 96 EUs (Execution Units) operating at up to 0.8 GHz. \nPower consumption \nThis Pentium has a Base power consumption of 9 W, with 29 W being its maximum Intel-recommended Turbo power consumption. TDP values this low allow for passively cooled laptops, tablets, mini-PCs as long as performance is not a priority. \nThe CPU is made with Intel's 3rd generation 10 nm process marketed as Intel 7 for decent, as of early 2023, energy efficiency. The Intel Pentium 8500 is an entry-level low-power mobile CPU for thin and light laptops based on the Alder Lake architecture. It was announced in early 2022 and offers one performance core (P-cores, Golden Cove architecture) and 4 efficient cores (E-cores, Gracemont architecture). The P-cores support Hyper-Threading leading to 6 supported threads when combined with the E-cores. The clock rate ranges from 1 to 4.4 GHz on the performance cluster and 0.7 to 3.3 GHz on the efficient cluster. The performance of the E-cores should be similar to old Skylake cores (compare to the Core i7-6700HQ). All cores can use up to 8 MB L3-cache. Compared to the faster Core i3-1210U, the Pentium offers one less P-core. Performance While we have not tested a single system built around the 8500 as of August 2023, it's safe to expect the chip to be about 20% slower than the i3-1215U, as far as multi-thread performance is concerned. Which is pretty terrible as of Q3 2023. Your mileage may vary depending on how high the CPU power limits are and how competent the cooling solution of your system is. Features The integrated memory controller supports various memory types up to DDR5-4800, DDR4-3200, LPDDR5-5200, and LPDDR4x-4267. The Thread Director (in hardware) can support the operating system to decide which thread to use on the performance or efficient cores for the best performance. For AI tasks, the CPU also integrates GNA 3.0 and DL Boost (via AVX2). Quick Sync in version 8 is the same as in the Rocket Lake CPUs and supports MPEG-2, AVC, VC-1 decode, JPEG, VP8 decode, VP9, HEVC, and AV1 decode in hardware. The CPU only supports PCIe 4.0 (x8 for a GPU and two x4 for SSDs). The integrated graphics adapter is based on the Xe-architecture and offers 48 of the 96 EUs (Execution Units) operating at up to 0.8 GHz. Power consumption This Pentium has a Base power consumption of 9 W, with 29 W being its maximum Intel-recommended Turbo power consumption. TDP values this low allow for passively cooled laptops, tablets, mini-PCs as long as performance is not a priority. The CPU is made with Intel's 3rd generation 10 nm process marketed as Intel 7 for decent, as of early 2023, energy efficiency. The Intel Core i5-1235U is a mid-range mobile CPU for thin and light laptops based on the Alder Lake architecture. It was announced in early 2022 and offers 2 performance cores (P-cores, Golden Cove architecture) and 8 efficient cores (E-cores, Gracemont architecture). The P-cores support Hyper-Threading leading to 12 supported threads when combined with the E-cores. The clock rate ranges from 1.3 to 4.4 GHz on the performance cluster and 0.9 to 3.3 GHz on the efficient cluster. The performance of the E-cores should be similar to old Skylake cores (compare to the Core i7-6700HQ). All cores can use up to 12 MB L3 cache. Compared to the i5-1245U, the 1235U offers lower base clock speeds and only \"Essentials\" vPro management features. Compared to the P-series (28W) or H-series (45W), the 15W TDP may limit the sustained performance. \nPerformance \nThe average 1235U in our database is in the same league as the Ryzen 5 PRO 5650U and also, surprisingly enough, the i7-1250U and the i7-1260U, as far as multi-thread benchmark scores are concerned. This is a very respectable result, as of mid 2023. \nThanks to its decent cooling solution and a long-term CPU power limit of 27 W, the Beelink SEi12 is among the fastest systems built around the 1235U that we know of. It can be twice as fast in CPU-bound workloads as the slowest system featuring the same chip in our database, as of August 2023. \nArchitecture \nThe integrated memory controller supports various memory types up to DDR5-4800, DDR4-3200, LPDDR5-5200, and LPDDR4x-4267. The Thread Director (in hardware) can support the operating system to decide which thread to use on the performance or efficient cores for the best performance. For AI tasks, the CPU also integrates GNA 3.0 and DL Boost (via AVX2). Quick Sync in version 8 is the same as in the Rocket Lake CPUs and supports MPEG-2, AVC, VC-1 decode, JPEG, VP8 decode, VP9, HEVC, and AV1 decode in hardware. The CPU only supports PCIe 4.0 (x8 for a GPU and two x4 for SSDs). \nThe integrated graphics card is based on the Xe-architecture and offers 80 of the 96 EUs (Execution Units) operating at up to 1.2 GHz. \nPower consumption \nThis ULV processor has a Base power consumption of 15 W (also known as the long-term power limit), with 55 W being its maximum Intel-recommended Turbo power consumption. Both values are too high to allow for passively cooled designs. \nCore i5-1235U is manufactured on Intel's fourth-gen 10 nm process marketed as Intel 7 for decent, as of mid-2022, energy efficiency. The Intel Core i5-1235U is a mid-range mobile CPU for thin and light laptops based on the Alder Lake architecture. It was announced in early 2022 and offers 2 performance cores (P-cores, Golden Cove architecture) and 8 efficient cores (E-cores, Gracemont architecture). The P-cores support Hyper-Threading leading to 12 supported threads when combined with the E-cores. The clock rate ranges from 1.3 to 4.4 GHz on the performance cluster and 0.9 to 3.3 GHz on the efficient cluster. The performance of the E-cores should be similar to old Skylake cores (compare to the Core i7-6700HQ). All cores can use up to 12 MB L3 cache. Compared to the i5-1245U, the 1235U offers lower base clock speeds and only \"Essentials\" vPro management features. Compared to the P-series (28W) or H-series (45W), the 15W TDP may limit the sustained performance. Performance The average 1235U in our database is in the same league as the Ryzen 5 PRO 5650U and also, surprisingly enough, the i7-1250U and the i7-1260U, as far as multi-thread benchmark scores are concerned. This is a very respectable result, as of mid 2023. Thanks to its decent cooling solution and a long-term CPU power limit of 27 W, the Beelink SEi12 is among the fastest systems built around the 1235U that we know of. It can be twice as fast in CPU-bound workloads as the slowest system featuring the same chip in our database, as of August 2023. Architecture The integrated memory controller supports various memory types up to DDR5-4800, DDR4-3200, LPDDR5-5200, and LPDDR4x-4267. The Thread Director (in hardware) can support the operating system to decide which thread to use on the performance or efficient cores for the best performance. For AI tasks, the CPU also integrates GNA 3.0 and DL Boost (via AVX2). Quick Sync in version 8 is the same as in the Rocket Lake CPUs and supports MPEG-2, AVC, VC-1 decode, JPEG, VP8 decode, VP9, HEVC, and AV1 decode in hardware. The CPU only supports PCIe 4.0 (x8 for a GPU and two x4 for SSDs). The integrated graphics card is based on the Xe-architecture and offers 80 of the 96 EUs (Execution Units) operating at up to 1.2 GHz. Power consumption This ULV processor has a Base power consumption of 15 W (also known as the long-term power limit), with 55 W being its maximum Intel-recommended Turbo power consumption. Both values are too high to allow for passively cooled designs. Core i5-1235U is manufactured on Intel's fourth-gen 10 nm process marketed as Intel 7 for decent, as of mid-2022, energy efficiency. #0 checking url part for id 14609 +0s ... 0s #1 checking url part for id 14114 +0s ... 0s #2 checking url part for id 14078 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.042s ... 0.043s #6 did output specs +0s ... 0.044s #7 getting avg benchmarks for device 14609 +0.017s ... 0.06s #8 got single benchmarks 14609 +0.013s ... 0.073s #9 getting avg benchmarks for device 14114 +0.002s ... 0.076s #10 got single benchmarks 14114 +0s ... 0.076s #11 getting avg benchmarks for device 14078 +0.016s ... 0.092s #12 got single benchmarks 14078 +0.078s ... 0.171s #13 got avg benchmarks for devices +0s ... 0.171s #14 min, max, avg, median took s +0.182s ... 0.353s #15 return log +0s ... 0.353s "
}