{
    "title": "One of the biggest CS2 tournaments in the world has completely switched \nover to AMD Ryzen 7 7800X3D chips 'to ...",
    "date": "3/15/2024",
    "url": "https://www.pcgamer.com/hardware/processors/one-of-the-biggest-cs2-tournaments-in-the-world-has-completely-switched-over-to-amd-ryzen-7-7800x3d-chips-to-ensure-a-smooth-esports-experience/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The first Counter-Strike 2 Major is getting big system upgrade ahead of its kick-off this month. It has been announced that ahead of the start of the first Counter-Strike 2 Major PGL has upgraded the setups for the PGL CS2 Major Copenhagen 2024, swapping in AMD's Ryzen 7 7800X3D as the CPU of choice for gaming pros. It just so happens we agree, having stuck the red-team's finest in as our choice for the best CPU for gaming, too. Great minds, and all that. The announcement of the change of PC setup (via HXL on X) is a change from the Ryzen 9 5950X that was previously used at the tournament, and given the power of the latest AMD chip, with its innovative 3D V-Cache design, it's a good shout for a fast-paced game such as CS2. The Ryzen 7 7800X3D delivers the absolute highest frame rates of any chip you put it up against across pretty much all of our testing. And when you're running at the sort of low resolutions that most esports players will run their rigs at—with most opting for a 1280 by 960 output—it's going to outstrip everything else by some margin thanks to that extra cache boost. \"PGL is committed to providing the best possible competitive environment for the players,\" says PGL CEO, Silviu Stroie. \"By choosing the AMD Ryzen 7 7800X3D for our gaming setups, we're ensuring that the PGL CS2 Major Copenhagen 2024 will be remembered not only for its intense competition but also for its flawless technical execution.\" Alongside that AMD chip, and playing a pretty sizeable part in getting the sort of frame rates to compliment the 25-inch 1080p 360Hz Zowie monitor attached to it, is an Nvidia RTX 4080. So, yeah, the PCs in Copenhagen are going to be serving CS2 at some speed.  Best CPU for gaming: The top chips from Intel and AMD.\nBest gaming motherboard: The right boards.\nBest graphics card: Your perfect pixel-pusher awaits.\nBest SSD for gaming: Get into the game ahead of the rest. I will say I am endlessly stunned that anyone would be using a TN screen like the Zowie XL2566K in 2024, but it's all about refresh, response, and latency in esports, so I'll let them off. It's not like an expensive 360Hz 1440p OLED makes a whole heap of sense for a company to kit out their tournament rigs just for that 0.03ms response right now. Sign up to get the best content of the week, and great gaming deals, as picked by the editors. The PGL CS Major Copenhagen 2024 kicks off this weekend, March 17, and goes on right through to March 31, where the 24 competing teams are going to battle it out for a total prize pool of $1.25 million. Dave has been gaming since the days of Zaxxon and Lady Bug on the Colecovision, and code books for the Commodore Vic 20 (Death Race 2000!). He built his first gaming PC at the tender age of 16, and finally finished bug-fixing the Cyrix-based system around a year later. When he dropped it out of the window. He first started writing for Official PlayStation Magazine and Xbox World many decades ago, then moved onto PC Format full-time, then PC Gamer, TechRadar, and T3 among others. Now he's back, writing about the nightmarish graphics card market, CPUs with more cores than sense, gaming laptops hotter than the sun, and SSDs more capacious than a Cybertruck. Intel's future multi billion dollar mega-fab is set smack-bang on top of multiple neolithic burial sites Elon Musk claims Tesla could build a silicon foundry and make its own chips, but says 'I sure hope we don’t have to' Dragon's Dogma 2's first proper patch adds a much-needed new game option and makes it easier to get a house By Andy Chalk28 March 2024 By Rich Stanton28 March 2024 By Joshua Wolens28 March 2024 By Dave James28 March 2024 By Wes Fenlon28 March 2024 By Wes Fenlon28 March 2024 By Harvey Randall28 March 2024 By Andy Chalk28 March 2024 By Phil Savage28 March 2024 By Joshua Wolens28 March 2024 By Harvey Randall28 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}