{
    "title": "AMD Zen 5 CPU Core Architecture Allegedly More Than 40% Faster Than Zen 4 \nCores",
    "date": "3/29/2024",
    "url": "https://wccftech.com/amd-zen-5-cpu-core-architecture-over-40-percent-faster-than-zen-4/",
    "text": "AMD's Zen 5 CPU core architecture might be shaping up to be a huge upgrade over the existing Zen 4 core as per a new rumor. The new information comes from hardware insider, @Kepler_L2, who has a good track record when it comes to CPU architectures. According to his recent post at the Anandtech tech forum, spotted by 3DCenter, it looks like we are in for a major treat with the upcoming AMD Zen 5 core architecture which is expected to launch in the second half of 2024 in various CPU families for desktops, laptops and servers. Kepler states that core-for-core, AMD's Zen 5 core is more than 40% faster than Zen 4. He states that this performance is achieved in the SPEC benchmark but doesn't explicitly state if the figures are based on integer or floating-point metrics. Considering that Integer-based performance helps more since more applications use it, it will be great for both single and multi-threaded workloads. Core for core Zen5 is >40% faster than Zen4 in SPEC. Kepler_L2 via Anandtech Forums If true, then this will be a major leap for AMD in a single generation. It will also be reminiscent of AMD's original goal for the first-generation Zen (1) core architecture which was set to offer 40% higher IPC than Excavator but ended up achieving far more than that when it launched with an amazing >52% IPC improvement. Not a whole lot about AMD's Zen 5 core architecture is known at the moment but from what the company has officially stated, it will offer: As for the products, AMD is expected to introduce its Zen 5 core architecture in at least three CPU families. First up, we are looking at the desktop \"Granite Ridge\" family which will target the current AM5 platforms with upgraded specs. We recently got to see two new SKUs, a 6 and 8 core, within a leak. Next up, we are expecting AMD's Strix Point APUs for mobility platforms which will incorporate the Zen 5 CPU, RDNA 3+ GPU, and an upgraded NPU (3x AI TOPs). AMD will also super-charge its EPYC lineup with the new Zen 5 and Zen 5C cores, offering up to 128 and 192 cores, respectively. It's a full-fledged Zen 5 lineup that users should anticipate in 2H 2024 and this is just the beginning of the Zen 5 journey. As the architecture matures, we are going to see improved offerings in 3D V-Cache, Threadripper, and even faster variants so stay tuned for more information in the coming months. AMD's CEO, Lisa Su, will be delivering the opening keynote of Computex 24 so we can expect loads of Zen 5, AI PC and Ryzen talk during the event. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}