{
    "title": null,
    "date": "3/5/2024",
    "url": "https://www.trendingtopics.eu/amd-us-konzern-darf-ai-chip-nicht-an-china-verkaufen/",
    "text": "Der US-Halbleiterkonzern Advanced Micro Devices (AMD) darf einen speziell für den chinesischen Markt entwickelten AI-Prozessor laut Standard nicht in die Volksrepublik exportieren. AMD habe versucht, vom US-Handelsministerium grünes Licht für den Verkauf des AI-Chips nach China zu bekommen. Doch laut den Behörden ist der Chip zu leistungsstark. Nvidia: AI-Chip-Boom verdoppelte 2023 den Umsatz  Eigentlich hat der Chip laut AMD eine geringere Leistung als jene, die der Konzern außerhalb Chinas verkauft. Man habe ihn speziell für die Einhaltung von US-Exportbeschränkungen entwickelt, heißt es unter Berufung auf mit der Angelegenheit vertraute Personen. Das habe für die politischen Entscheidungstragenden jedoch immer noch nicht gereicht. Im Oktober hatten die USA angekündigt, die Lieferung hoch entwickelter KI-Prozessoren an China zu stoppen. Dies ist Teil einer Reihe von Maßnahmen, mit denen die Regierung in Washington verhindern will, dass Peking US-Spitzentechnologie zur Stärkung seines Militärs erhält. AMD wollte, ähnlich wie Branchengigant Nvidia, einen Chip für den AI-Markt in China entwickeln, der nicht sanktioniert werden sollte. Nvidia bietet angepasste Beschleunigerkarten für den Markt in China, die knapp unterhalb der Grenzwerte in den US-Restriktionen rangieren. Diese erhalten regelmäßig Genehmigungen und der Konzern darf sie verkaufen. Die maßgeschneiderte Lösung von AMD erhielt dennoch keine Genehmigung. Wie das in Anbetracht der klaren Zielsetzung passieren konnte, bleibt unklar. Nvidia ist jetzt mehr wert als Amazon und Google  Laut ComputerBase braucht AMD nun eine separate Ausfuhrgenehmigung, deren Erteilung aktuell als sehr unwahrscheinlich gilt. In Frage für eine solche Anpassungen kommt vor allem ein Produkt aus der Instinct-Familie. In der Regel ist es erforderlich, bei den angepassten Produkten für China die Interconnect-Bandbreite stark einzuschränken, während die groben technischen Eckdaten auf den ersten Blick sehr ähnlich zu den westlichen Varianten aussehen. AMD hatte die neue Instinct-Familie im Dezember 2023 offiziell enthüllt. Es gibt eine große APU-Variante (MI300A) sowie einen reinen GPU-Beschleuniger (MI300X). Auf dem Papier ist die Instinct MI300X je nach Einsatzgebiet durchaus ein Herausforderer für Nvidias H100. Zuletzt hatte der Konzern die Absatz- und Umsatzprognosen für diese Lösungen deutlich nach oben geschraubt, nachdem sie zu Beginn sehr konservativ angesetzt waren. Aus Datenschutz-Gründen ist dieser Inhalt ausgeblendet. Die Einbettung von externen Inhalten kann in den Datenschutz-Einstellungen aktiviert werden: Datenschutz-Einstellungen "
}