{
    "title": null,
    "date": "3/17/2024",
    "url": "https://www.windowscentral.com/hardware/laptops/asus/asus-rog-zephyrus-g14-2024-review",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. ASUS has redesigned its Zephyrus G14 with a beautiful, slim, light aluminum chassis. It's ridiculously portable and doesn't skimp on the power, so it can play any modern game without breaking a sweat. There's an absurd level of quality and polish here for an ASUS ROG machine, but such a thin chassis leads to more heat, meaning the Zephyrus G14 can't push its hardware to the max. Absolutely spectacular aluminum design that's slim, light, and beautifully refined Gorgeous 120Hz OLED display with fantastic color reproduction and responsiveness Impressively quick AMD Ryzen CPU paired with capable NVIDIA GPUs Keyboard, touchpad, and especially the speakers are all well above average Gets hot to the touch and experiences some thermal throttling under load Display hinge feels a little too flimsy Doesn't have the battery life of other ultrabooks in this weight class Why you can trust Windows Central \n\n\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test. • Pricing & specs\n• Design & build quality\n• Display\n• Performance & gaming\n• Battery\n• Keyboard & other features\n• Competition\n• Score card & final thoughts 14-inch gaming laptops are a bit of a niche category. You don't get the power or thermal management of larger gaming laptops, but you lose the endurance and portability of proper ultrabooks. It's a very hard category to nail, but ASUS has been consistently near the top of the pack with its ROG Zephyrus G14. Redesigned for 2024, this laptop is more refined than ever before, and it's a truly spectacular 14-inch Windows laptop with few flaws. The compromises are still here, but ASUS has done everything possible to ensure the best balance between power, portability, and price. The ASUS ROG Zephyrus G14 (2024) is hands-down one of the best gaming laptops you can buy right now, surprising at every turn with the general quality of its hardware. ASUS is still a step or two away from achieving a perfect product, however, as I've discovered after several weeks of using this laptop as my daily driver. This review was made possible with a review unit provided by ASUS. The company did not see the contents of the review before publishing.  • Price: $1,599.99 at Best Buy\n• Display: 14-inch, 16:10, 2.8K (2880 x 1800), 120Hz, 0.2ms, Dolby Vision & VESA DisplayHDR True Black 500, NVIDIA G-Sync\n• CPU: AMD Ryzen 9 8945HS w/ 8 cores, 16 threads\n• GPU: NVIDIA GeForce RTX 4060 w/ 8GB VRAM\n• RAM: 16GB LPDDR5X @ 6,400MHz\n• Storage: 1TB M.2 NVMe PCIe Gen 4.0 SSD\n• Battery: 73Whr w/ 180W charging adapter\n• Dimensions: 311 x 220 x 15.9-16.3mm (12.24 x 8.66 x 0.63-0.64in)\n• Weight: 1.5kg (3.31lbs) The ASUS ROG Zephyrus G14 (2024) starts at the same price as its predecessor (with an NVIDIA GeForce RTX 4060 under the hood), but brings a redesigned chassis that's thinner and lighter, a much higher quality OLED display, a new 8th-gen AMD Ryzen 9 CPU, and generally more refinement all around. It's not a stronger performer in games, however, so those with the 2023 model likely don't need to consider an upgrade. Right now, the newest Zephyrus G14 starts at $1,599.99 at Best Buy. At the moment, there are only two configurations, with an upgraded model donning twice as much RAM (32GB vs. 16GB) and a more powerful GPU (RTX 4070 vs. RTX 4060) for $1,999.99 at Best Buy. There are no configurations with an RTX 4080 or 4090 like the 2023 model, and I'm not sure we'll ever see that. There's a good chance that a more affordable RTX 4050 configuration will appear at some point, however. In the box, you get the ASUS ROG Zephyrus G14 (2024), the 180W proprietary charger, and one month of Xbox Game Pass Ultimate (that offer may depend on your region or retailer). This isn't an affordable laptop, but ASUS has properly upped the ante on quality to justify the cost, and I believe it's a fair price. Ryzen 9 8945HS | RTX 4060 | 16GB RAM | 1TB SSD — $1,599.99 at Best Buy The configuration that ASUS sent me to review is the model I'd recommend for most people. It's powerful enough to play any modern games, and its endurance is much better than your average gaming laptop. This is a balanced, high-quality 14-inch gaming laptop. Also see: ASUS ROG Zephyrus G14 (2024) w/ RTX 4070 | 32GB RAM for $1,999.99 at Best Buy  • Design features: CNC milled aluminum chassis, seven-zone \"Slash Lighting,\" per-key RGB lighting, \"Stealth Hinge\"\n• Dimensions: 311 x 220 x 15.9-16.3mm (12.24 x 8.66 x 0.63-0.64in)\n• Weight: 1.5kg (3.31lbs)\n• Ports: 1x USB Type-C 4.0 w/ DisplayPort 1.4 & 100W Power Delivery, 1x USB Type-C 3.2 Gen 2 w/ DisplayPort 1.4, 2x USB Type-A 3.2 Gen 2, 1x HDMI 2.1, 1x microSD (UHS-II), 1x 3.5mm audio jack Last year's ROG Zephyrus G14 wasn't a bad-looking laptop by any means, and showed ASUS' continued commitment to improving the design and build quality of its premium gaming laptops. One year later, though, the differences are astounding. The 2024 model of this 14-inch gaming laptop introduced a complete redesign, moving from magnesium alloy to a CNC-milled aluminum chassis, approaching the build quality of even Razer's laptops. This laptop is thinner by 2.6-3.2mm, lighter by a third of a pound, and considerably more refined at every angle. It's a beautiful device, and the build quality is the best I've seen from ASUS ROG. The company touts major improvements to rigidity and durability with the Zephyrus G14 (2024), and I believe it. Looks and build quality is here, but so is intelligent design. From the keyboard deck to the port layout, nothing is out of place. Even the brand-new hinge is designed to divert hot exhaust away from the OLED display to protect it from heat. Speaking of that hinge, it's actually the one place the Zephyrus G14 stumbles. I love its design, from the subtle \"Zephyrus\" logo to the way it subtly tucks inside the laptop as it opens, but the hinge itself feels a little too weak, leading to more display wobble than I'd like. I also observed some subtle creaking from the hinge, too. Matters return to greatness with the ports, however, which are numerous and smartly placed. You get a total of four USB ports, including a USB Type-C 4.0 port! One of the weaknesses with AMD-powered laptops is the lack of Thunderbolt 4, but USB4 is almost as good — it's at least much better than what you usually see on these laptops, and you get 100W Power Delivery, too (which is enough to charge the laptop as long as you're not gaming). There's also HDMI 2.1 and microSD ports here, too; the only thing you're really missing is Ethernet, but I never expected that on a thin and light 14-inch laptop.  • Display type: 14-inch, 16:10 aspect ratio, OLED, ROG Nebula Display, non-touch\n• Display specs: 2.8K (2880 x 1800) resolution, 120Hz refresh rate, 0.2ms response time, 500nits mx brightness w/ HDR, 100% DCI-P3 color gamut\n• Display features: VESA DisplayHDR True Black 500, Dolby Vision, NVIDIA G-Sync adaptive sync, Pantone Validated The ASUS ROG Zephyrus G14 (2024) uses a display we've already seen in quite a few other 14-inch laptops, including from ASUS. It's a 2.8K panel with a 120Hz refresh rate, and this particular iteration boasts the same excellent color accuracy and responsiveness I've come to expect from it. ASUS tends to go above and beyond with its OLED displays, however, and this is no different. Apart from the usual bevy of protective features to ensure the longevity of the panel, the Zephyrus G14 is one of the first to actually support adaptive sync for improved gaming performance. ASUS apparently worked with Samsung directly to bring NVIDIA G-Sync support to this panel, which will help make the display more responsive and prevent screen tearing when gaming. Elsewhere, it's bright (over 400 nits with standard dynamic range content) and expectantly vivid. It's a great-looking display, and it's a joy to use, from media consumption to gaming. This is a non-touch panel, of course, but ASUS still covered the display with a clear, high-quality sheet of glass. For when you need it, Dolby Vision support is also here alongside DisplayHDR True Black 500, but it's not the best display for high dynamic range content thanks to the limited max brightness of 500 nits.  You can see from the information above that this is an impressive display on paper. Apart from its sharp resolution and smooth refresh rate, it also delivers the promised 100% of the DCI-P3 color gamut (certified by Pantone), boasts the customary perfect contrast, gets pretty bright and has a lovely white balance... With one exception. I noticed this oddity on the ASUS Zenbook 14X OLED (UX3404), where the display white balance becomes extremely warm at 0% brightness. No, not 5%, 2%, or even 1% — only the absolute minimum display brightness. At all other brightness levels, this display looks even and accurate.  • CPU: AMD Ryzen 9 8945HS (8 cores, 16 threads, 5.2GHz boost clock speed, 80W max TDP)\n• GPU: NVIDIA GeForce RTX 4060 (8GB GDDR6 VRAM, 90W max TDP) / NVIDIA GeForce RTX 4070 (8GB GDDR6 VRAM, 90W max TDP)\n• RAM: Up to 32GB LPDDR5X @ 6,400MHz\n• Storage: Up to 1TB M.2 NVMe PCIe Gen 4.0 SSD\n• Other features: MUX Switch w/ NVIDIA Advanced Optimus support, ROG Intelligent Cooling w/ liquid metal, triple Arc Fan 2.0, 7 copper heat pipes The ASUS ROG Zephyrus G14 (2024) does not represent a significant leap in performance over its predecessor. The available GPUs are the same, and the leap from 7th to 8th Gen AMD Ryzen CPUs offers a minimal boost in performance. Additionally, the move to such a compact chassis means that, in some games and tasks, the 2024 model is actually a little slower than its predecessor. ASUS lowered the thermal design power (TDP) of both the CPU and GPU versus last year's version (from 125W to 80W and 90W, respectively), but NVIDIA's own voltage limitations and advancements in AMD's CPUs mean that any performance deficits are barely noticeable, while also helping the laptop run longer even on a smaller battery cell. 14-inch laptops have never been about raw power, and the Zephyrus G14 still compares favorably to its competition, like the considerably more expensive Razer Blade 14 (2024). I believe these trade-offs are more than worthwhile in getting this stunning design and much-improved portability, and the Zephyrus G14 (2024) still flew through every task I gave it, including games. If I have one complaint, it's that this laptop isn't quite as quick to boot or wake from sleep as an Intel Evo-certified laptop. You can check out the graphs above for an overview of the Zephyrus G14's performance. In summary, this laptop consistently outperformed the last two generations of Razer Blade 14 and often came close to larger and more powerful laptops. Windows Central had only two benchmarks for the Zephyrus G14 (2023), and the Zephyrus G14 won one (Geekbench 6) and lost the other (Cinebench 2024), but in general, you should expect minor gains in CPU-heavy tasks and minor losses in GPU-heavy tasks with the latest version. Thermally, this laptop is consistent and quiet, with subtle and low fans. It's quick to get hot to the touch, however, and mild thermal throttling happens after a while when pushing this laptop. My stress tests saw a 4.2% decline in average framerates over 25 loops in 3DMark Time Spy versus the 2-3% I expect from other laptops. I never observed the Zephyrus G14 throttling anymore past this point, however, and performance never noticeably degraded no matter how long I used it.  The ASUS ROG Zephyrus G14 (2024) isn't quite as strong graphically as its predecessor, but it's certainly no slouch. At its full 1800p resolution, it's able to play practically any modern game at high-to-max settings without issue. Lower the resolution to 1080p (which is honestly just as good at 14 inches), and you can squeeze a lot more frames out of this laptop and take better advantage of that 120Hz display. You can see some of the games I played below and the settings I was using. As I stated in the above section, this laptop does get hot and does experience some thermal throttling, but it hits that ceiling quickly and refuses to go lower. Playing multiple consecutive Counter-Strike 2 matches saw absolutely no discernible dips in framerates, and gaming, in general, felt smooth and stable on this laptop. This display is absolutely spectacular for gaming, and the combination of quiet fans and loud speakers means your audio experience is great, too.  Gaming laptops aren't known for great battery life, especially when compared to 14-inch ultrabooks. The ASUS ROG Zephyrus G14 doesn't buck that trend, but it does straddle the gap with endurance that surpasses the average gaming laptop but falls short of a solid ultrabook. Unfortunately, I wasn't able to get PCMark 10's Modern Office battery test to run on this laptop (it would report as finished after 1-5 minutes every attempt), but I can tell you about my personal experience. In general usage with default settings (that means a comfortable ~200 nits brightness, per-key RGB lighting on the keyboard enabled, the lid \"Slash Lighting\" enabled, and the performance profile set to \"Balanced\"), I could expect a reliable 4-6 hours of solid usage. With heavy usage (like gaming), I could easily cut that down to 2-3 hours. Running a Windows battery report showed lifetimes of between 3-8 hours of usage (averaging out to ~4 hours). It's not an all-day machine, but you also don't have to stress if you take this laptop away from the charger, which is a far cry from most gaming machines. If you cut down on features and performance, you can squeeze even more life out of it. When you need to charge, you can either use the proprietary 180W charger, which is more than enough no matter what you're doing. For general usage, though, I tended to use the USB4 port and its 100W Power Delivery, which reliably and quickly kept the Zephyrus G14 topped off while using the same cable as all my other devices. Performance while on battery power was always exemplary for me.  ASUS has been impressing me with its keyboards lately, and the ROG Zephyrus G14 is no exception. The company updated this keyboard versus last year's model to be more rigid, responsive, and comfortable, with larger keys and the same 1.7mm travel distance. It's great for gaming and typing, and I also like the layout a lot. Four additional macro keys sit above the function (Fn) row, too, oddly splitting the volume controls but otherwise adding a little more functionality. Sadly, there's absolutely no way to lock the Fn key. That means you have to press the Fn key every time you want to use one of the macros to change your screen brightness, mute your mic, change performance modes, or anything else. That's a super basic feature, and it's baffling that it's missing here. ASUS also doesn't borrow from other manufacturers by highlighting shortcuts when holding down the Fn key, which would've been nice. As for the touchpad, it's large, matches the aspect ratio of the display, is covered in smooth glass, and uses Microsoft Precision drivers for smooth and reliable tracking. The buttons feel great, too; it's overall a high-quality touchpad with no weaknesses. Of course, I've been spoiled by the haptic touchpad on laptops like the HP Spectre x360 14 (2024), and I would've loved to have seen it appear on the Zephyrus G14.  • Camera & mic: FHD (1080p) front-facing webcam (IR sensor, Windows Hello facial recognition biometric authentication), dual-array 3D mics w/ AI noise cancellation\n• Audio: Six-speaker system w/ Dolby Atmos (4x 2W woofers, 2x 1W tweeters)\n• Wireless: Wi-Fi 6E 2x2, Bluetooth 5.3\n• Other features: Armoury Crate software, per-key RGB lighting, lid Slash Lighting Time to go over all the stragglers. Let's start with software! The Zephyrus G14 (2024) runs Windows 11 (usually the Home variant) with a handful of preinstalled apps from ASUS, NVIDIA, Dolby, and others. Windows runs flawlessly on this device, updates are frequent and reliable, and the preinstalled apps are few in number and mostly very reasonable. Armoury Crate is a useful app for managing your laptop, but the design is massively outdated and clunky, so ASUS can definitely improve matters here. Hardware-wise, this laptop boasts a standard FHD webcam with solid detail, color reproduction, white balance, and dynamic range. It's not exceptional and lacks a dedicated privacy shutter, but you do get an IR sensor for Windows Hello facial recognition (which works quickly and consistently). That webcam is supported by ASUS' \"3D Mics,\" which basically means stereo microphones with AI noise cancellation. They're also solid. Honestly, you can go ahead and assume anything I haven't mentioned is at least above average. The ASUS ROG Zephyrus G14 (2024) is shockingly refined throughout, but it properly stands out in one area: the speakers. ASUS added two more woofers over the 2023 version and increased their size by 25%, resulting in a six-speaker system that genuinely sounds incredible. No, I don't mean \"good for a Windows laptop,\" these speakers are just awesome. They're responsive, clear, detailed, and loud, and they actually boast bass that you can feel. It's not quite to the level of Apple's Macbooks, but this may be one of the very best speaker setups in any Windows laptop right now, even without using Dolby Atmos.  Making a worthwhile 14-inch gaming laptop is actually a monumental endeavor, and only a few companies have really pulled it off. One of the biggest alternatives to the ASUS ROG Zephyrus G14 (2024) is the Razer Blade 14 (2024); that laptop is even more premium in its design and construction than the Zephyrus G14 and boasts a more impressive display to boot. It's simply not as capable even with the same internals, though you'll be paying a whole lot more, and you'll be accepting a downgrade in the keyboard and speakers departments. The Alienware x14 R2 is a more reasonable competitor, coming closer in price to the Zephyrus G14 with an attractive design, solid performance, and respectable endurance. The Zephyrus G14 is more up-to-date, however, and is overall a more refined and premium laptop. If you don't need a ton of graphical power, the Dell XPS 14 (9440) is a properly powerful ultrabook with a futuristic, hyper-premium design. It's not as competent when gaming, and it's awfully expensive, but it's still one of the best Windows laptops on the market. Honestly, though, one of the most compelling options in this space is actually the ASUS ROG Zephyrus G14 (2023). It's bigger, heavier, less refined, and premium, and it doesn't last as long away from the charger. It's also just as powerful (if not more so when gaming) than the newer version, and you should be able to pick it up with an enticing discount now that the 2024 model is available. That laptop is still a fantastic machine.  ✅You want a portable ultrabook with a ton of power The Zephyrus G14 is absolutely catered toward gamers, but its slim and light design, premium build quality, and refined features make it a great option for anyone looking for a portable ultrabook boasting a surprising amount of power. ✅You want a premium laptop that's great in every category Gaming laptops often compromise in several areas to prioritize performance, but ASUS went the opposite direction with the Zephyrus G14 (2024). It's not more powerful than its predecessor, but it's thinner, lighter, more durable, and more refined and premium in practically every category. ❌You're looking for the most powerful laptop possible If you need power above all else, you're probably not looking at 14-inch gaming laptops. If you are, you might be better served by the last-generation Zephyrus G14, which is a little more powerful when gaming, thanks to its thicker, heavier chassis and higher TDP. • ROG Zephyrus G16\n• Logitech MX Brio\n• Dell UltraSharp 34\n• Alienware Pro keyboard ASUS set out to perfect its 14-inch gaming laptop and kissed the feet of sublimity with the latest version. It's a very different laptop from its predecessor with different focuses, but the result is one of the most refined and premium devices in this category. It's more than powerful enough to play all the latest and greatest PC games but trades top-end performance for a stunning, impeccably constructed aluminum chassis. From the keyboard to the speakers, the ROG Zephyrus G14 is the most refined ASUS laptop I've ever used. It's still not quite perfect, but ASUS has a brilliant foundation here that I hope continues for years with updates. Right now, though, this is my top pick for a compact gaming laptop (or an ultrabook with a lot of GPU power, depending on your priorities). 2024 has already been a landmark year for excellent Windows hardware, and the ASUS ROG Zephyrus G14 (2024) still manages to stand apart. If you'd rather have a larger laptop, you can also check out our review of the ASUS ROG Zephyrus G16 (2024), which is the 16-inch variant of this laptop.   It's amazing how far ASUS has come in the last few years, with the ROG Zephyrus G14 (2024) not just retaining its place as the best 14-inch gaming laptop, but also taking the battle straight to the most premium Windows ultrabooks with a gorgeous, portable design and highly refined features. Zachary Boddy (They / Them) is a Staff Writer for Windows Central, primarily focused on covering the latest news in tech and gaming, the best Xbox and PC games, and the most interesting Windows and Xbox hardware. They have been gaming and writing for most of their life starting with the original Xbox, and started out as a freelancer for Windows Central and its sister sites in 2019. Now a full-fledged Staff Writer, Zachary has expanded from only writing about all things Minecraft to covering practically everything on which Windows Central is an expert, especially when it comes to Microsoft. You can find Zachary on Twitter @BoddyZachary. Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}