{
    "title": "Innovative funding key to saving SANDF - AMD",
    "date": "3/7/2024",
    "url": "https://www.defenceweb.co.za/sa-defence/sa-defence-sa-defence/innovative-funding-key-to-saving-sandf-amd/",
    "text": "The South African National Defence Force (SANDF) is so overstretched that it cannot meet its commitments, meaning that a new funding model for the procurement and maintenance of military equipment is needed, otherwise the SANDF will continue to be embarrassed on the international stage. This is according to Sandile Ndlovu, Chief Executive of the South Aerospace Maritime and Defence Industries Association (AMD), who maintains that it’s time for government to explore a private-public funding model. He mentions recent incidents involving the SANDF in the Democratic Republic of the Congo (DRC) that paint a negative, and inaccurate, picture of South Africa’s defence industry, which rivals the top industries globally. “While stability in the region has long been a priority, and the SANDF plays a crucial role in achieving and maintaining it, episodes like our soldiers pushing broken-down trucks while on peacekeeping missions have become more than just an operational hiccup – they are fast becoming a stain on our national image and the reliability of our military equipment,” he wrote in reference to a viral video of SANDF soldiers in the DRC pushing a Mamba armoured personnel carrier. The reality, Ndlovu affirms, is that Treasury simply does not have the funds needed to bolster South Africa’s military and purchase the necessary armament and other equipment needed for peacekeeping missions and state security. The 2024/25 defence budget is set at R51.8 billion, compared with R51.1 billion appropriated for 2023/24 but subsequently adjusted to R52.4 billion. For 2025/26, the defence budget rises to R53.7 billion and for 2026/27 it increases to R56.2 billion. “Defence analysts agree that the SANDF is so severely underfunded that it cannot meet the commitments required of it in terms of its mandate and defence policy. Faced with increasing costs, demands for missions on the continent, and smaller budgets the SANDF is slowly being hamstrung,” Ndlovu believes. “Couple this with the fact that we have major socio-economic challenges which take priority when it comes to the fiscus, and it is clear that South Africa needs to develop a new funding model for the procurement and maintenance of military equipment to spare itself ongoing embarrassment on the international stage. “As an industry we believe that it’s time for government to explore a private-public funding model. This approach, successfully employed by leading global defence forces, offers a pragmatic and immediate solution to our fiscal constraints,” the AMD Chief Executive maintains. By allowing private companies to assume financial responsibility for developing and delivering military systems, the government can commit to paying for these systems over an extended period. This model aligns with the global trend of engaging private sectors in defence funding, allowing for innovation, efficiency, and sustainable military capabilities. “We cannot afford to let bureaucratic constraints hinder our ability to address immediate operational challenges,” Ndlovu wrote. “The perception of unreliable equipment affects not only our soldiers but also our global standing as a provider of quality military hardware. Potential clients abroad may question the industry’s capability to deliver dependable products, impacting our export potential.” According to AMD, approximately 95% of the arms and equipment produced by the South African arms industry is shipped to 25 countries in Africa, Europe, the Middle East, and Southeast Asia. A number of military vehicles manufactured in South Africa have also been sold to the American armed forces for use in Afghanistan and Iraq, and South African manufactured vehicles, are currently being used in United Nations missions in Somalia and in Mali. “Yet, our successes on the global stage are overshadowed when our military faces operational failures, questioning the reliability of our equipment. The root causes of these failures are multifaceted, ranging from long-term defunding of the SANDF to limitations in the procurement system, resulting fiscal constraints, making it difficult to allocate sufficient resources for equipment maintenance and replacements,” Ndlovu wrote. The ANC’s recent decision not to list defence or national security as priorities in its 2024 Election Manifesto highlights just how low it has sunk on the totem pole, he believes. “They are not alone however, as most political parties in South Africa have glossed over both key points of discussion in recent times. As Friedrich List said: ‘National wealth is increased and secured by national power, as National power is increased and secured by national wealth.’ For that reason, the sector will be hosting a series of dialogues with various key stakeholders, including political parties, to discuss the urgency of national security, especially as it pertains to socio-economic change. “The need for a comprehensive approach to protecting our people, environment, infrastructure, economy, and borders in order to foster a conducive environment for sustainable development and economic progress cannot be underestimated. “The recurring challenges faced by our soldiers, coupled with the negative impact on the reputation of our defence industry, demand a bold and innovative solution. “South Africa stands at a crossroads, and our response to these challenges will shape the future of our military capabilities and the reputation of our defence industry. Embracing a private-public funding model is not merely a financial necessity; it is a strategic imperative,” Ndlovu concluded. defenceWeb is Africa's largest and most trusted online source of news, information, research and insight on aerospace, defence and security matters. Editorial Enquiries: [email protected] Sales Enquiries: [email protected] First Name Last Name Email address: Country  "
}