{
    "title": "Advanced Micro Devices (NASDAQ:AMD) Trading Down 0.1%",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-amd-percent-decline-2024-03-21/",
    "text": "Advanced Micro Devices, Inc. (NASDAQ:AMD - Get Free Report) fell 0.1% during mid-day trading on Thursday . The stock traded as low as $177.66 and last traded at $179.57. 28,637,390 shares traded hands during mid-day trading, a decline of 64% from the average session volume of 78,506,508 shares. The stock had previously closed at $179.73. AMD has been the topic of several analyst reports. Morgan Stanley raised their target price on Advanced Micro Devices from $128.00 to $193.00 and gave the company an \"overweight\" rating in a research report on Monday, January 29th. Northland Securities upgraded Advanced Micro Devices from a \"market perform\" rating to an \"outperform\" rating and set a $195.00 target price on the stock in a research report on Wednesday, January 31st. KeyCorp raised their target price on Advanced Micro Devices from $195.00 to $270.00 and gave the company an \"overweight\" rating in a research report on Wednesday, January 31st. The Goldman Sachs Group raised their target price on Advanced Micro Devices from $157.00 to $180.00 and gave the company a \"buy\" rating in a research report on Wednesday, January 31st. Finally, Cantor Fitzgerald restated an \"overweight\" rating and issued a $190.00 target price on shares of Advanced Micro Devices in a research report on Monday, March 4th. Four analysts have rated the stock with a hold rating and twenty-five have issued a buy rating to the company's stock. According to MarketBeat.com, Advanced Micro Devices presently has an average rating of \"Moderate Buy\" and a consensus price target of $181.82. Read Our Latest Research Report on AMD The firm has a market cap of $285.89 billion, a price-to-earnings ratio of 343.62, a PEG ratio of 2.73 and a beta of 1.66. The company has a 50-day moving average price of $178.33 and a 200 day moving average price of $138.50. The company has a quick ratio of 1.86, a current ratio of 2.51 and a debt-to-equity ratio of 0.03. Advanced Micro Devices (NASDAQ:AMD - Get Free Report) last issued its earnings results on Tuesday, January 30th. The semiconductor manufacturer reported $0.77 EPS for the quarter, hitting the consensus estimate of $0.77. The business had revenue of $6.17 billion during the quarter, compared to analysts' expectations of $6.13 billion. Advanced Micro Devices had a return on equity of 5.73% and a net margin of 3.77%. Advanced Micro Devices's revenue was up 10.2% compared to the same quarter last year. During the same quarter last year, the firm posted $0.54 earnings per share. As a group, research analysts anticipate that Advanced Micro Devices, Inc. will post 2.67 earnings per share for the current fiscal year. In related news, EVP Forrest Eugene Norrod sold 59,293 shares of Advanced Micro Devices stock in a transaction on Friday, February 2nd. The stock was sold at an average price of $175.94, for a total transaction of $10,432,010.42. Following the completion of the sale, the executive vice president now owns 258,690 shares of the company's stock, valued at $45,513,918.60. The transaction was disclosed in a legal filing with the SEC, which is available through the SEC website. In related news, EVP Forrest Eugene Norrod sold 59,293 shares of Advanced Micro Devices stock in a transaction on Friday, February 2nd. The stock was sold at an average price of $175.94, for a total transaction of $10,432,010.42. Following the completion of the sale, the executive vice president now owns 258,690 shares of the company's stock, valued at $45,513,918.60. The transaction was disclosed in a legal filing with the SEC, which is available through the SEC website. Also, insider Victor Peng sold 100,000 shares of Advanced Micro Devices stock in a transaction on Friday, February 2nd. The shares were sold at an average price of $175.11, for a total value of $17,511,000.00. Following the sale, the insider now directly owns 241,266 shares of the company's stock, valued at approximately $42,248,089.26. The disclosure for this sale can be found here. Insiders sold a total of 324,943 shares of company stock valued at $59,919,994 over the last quarter. Company insiders own 0.73% of the company's stock. Institutional investors have recently bought and sold shares of the stock. Meridian Wealth Management LLC raised its holdings in Advanced Micro Devices by 135.6% during the third quarter. Meridian Wealth Management LLC now owns 205,154 shares of the semiconductor manufacturer's stock valued at $21,135,000 after buying an additional 118,090 shares in the last quarter. Gendell Jeffrey L bought a new position in shares of Advanced Micro Devices in the third quarter worth about $3,085,000. Victory Capital Management Inc. increased its stake in shares of Advanced Micro Devices by 6.3% in the third quarter. Victory Capital Management Inc. now owns 1,460,506 shares of the semiconductor manufacturer's stock worth $150,169,000 after purchasing an additional 86,571 shares during the period. UG Investment Advisers Ltd. bought a new position in shares of Advanced Micro Devices in the third quarter worth about $13,217,000. Finally, Banque Pictet & Cie SA increased its stake in shares of Advanced Micro Devices by 31.3% in the third quarter. Banque Pictet & Cie SA now owns 481,451 shares of the semiconductor manufacturer's stock worth $49,503,000 after purchasing an additional 114,840 shares during the period. 68.43% of the stock is currently owned by institutional investors. Advanced Micro Devices, Inc operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products.Featured StoriesFive stocks we like better than Advanced Micro DevicesLow PE Growth Stocks: Unlocking Investment OpportunitiesGoogle and Meta Circling the Market on a TikTok Ban RallyWhat Investors Need to Know to Beat the MarketIntuitive Machines: Charting a Course Among the StarsWhat Does Downgrade Mean in Investing?KB Home’s Stock Price Can Move Higher, Here’s Why Before you consider Advanced Micro Devices, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Advanced Micro Devices wasn't on the list. While Advanced Micro Devices currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat just released its list of 10 cheap stocks that have been overlooked by the market and may be seriously undervalued. Click the link below to see which companies made the list. MarketBeat gives you seven stocks that you should be looking at to create your own Magnificent Seven in 2024. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}