{
    "title": "AMD Exec Says 2024 Is a 'Huge Year' for AI Upscaling as It Tries to Make Up \nGround on Nvidia",
    "date": "3/4/2024",
    "url": "https://www.ign.com/articles/amd-exec-says-2024-is-a-huge-year-for-ai-upscaling-as-it-tries-to-make-up-ground-on-nvidia",
    "text": "AMD might finally be leaning towards AI in its gaming devices, as one company executive touts that 2024 will be a \"huge year\" for the GPU and CPU maker.  In an interview with the No Priors podcast, AMD CTO Mark Papermaster said that over the last several years, the company has been working on developing its hardware and software capabilities for artificial intelligence, with its gaming hardware finally set to implement AI. \"Well, this is a huge year for us because we have spent so many years developing our hardware and software capabilities for AI,\" Papermaster explained. \"We've just completed AI enabling our entire portfolio: Cloud, edge, PCs, embedded devices, our gaming devices. We're enabling our gaming devices to upscale using AI, and 2024 is really a huge deployment year for us.\" While Papermaster did not specify how AMD would incorporate AI, he is most likely referring to FidelityFX Super Resolution (FSR), AMD's supersampling tech. Unlike Nvidia's Deep Learning Super Sampling (DLSS) and Intel's Xe Super Sampling (XeSS), FSR is the only supersampling tech that does not use AI. However, Papermaster's use of \"gaming devices\" imply that RDNA 4 may include AI upscaling. In either case, AMD is late to the party as its key rivals, Nvidia and Intel, already use AI in their gaming products. Nvidia has been leading the pack since 2019 with DLSS, which has become one of the most popular upscaling methods. It has made Nvidia a front-runner in the AI race, which continues to heat up as various major tech companies try to incorporate the technology into their own products. For now, Nvidia's adoption of AI in DLSS and other areas is paying off off, as the company recently became a 2 trillion dollar company last month. Taylor is a Reporter at IGN. You can follow her on Twitter @TayNixster. "
}