{
    "title": "Evolving GA landscape prompts RANZCO AMD referral pathway update",
    "date": "3/26/2024",
    "url": "https://www.insightnews.com.au/evolving-ga-landscape-prompts-ranzco-amd-referral-pathway-update/",
    "text": "Professor Robyn Guymer AM, head of macula research at the Centre for Eye Research Australia (CERA). Image: Anna Carlile/CERA RANZCO’s Referral Pathway for Age-Related Macular Degeneration (AMD) Management has been updated as Australia gears up for the first approved treatments for geographic atrophy (GA). “With the era of treatment for GA upon us, it is imperative that we review our current management of the disease and update it accordingly so that it is fit for purpose. As such we specifically updated the section in the guidelines for GA,” said Australian macular disease expert Professor Robyn Guymer AM who has been instrumental in developing the guidelines since they were released eight years ago. Two GA therapies are now approved in the US, but no therapy has yet been cleared for Australia. Apellis’ pegcetacoplan injection created history as the first approved GA therapy in the US in February 2023 under the name SYFOVRE. Guymer said regulatory evaluation is under way for this therapy with a TGA-targeted decision date in 2024. Meanwhile, avacincaptad pegol (ACP) intravitreal solution received FDA clearance in August 2023 under the brand name Izervay, and according to Guymer, Astellas Pharma Australia is planning on submitting the treatment to the TGA for regulatory assessment. The initial AMD referral guidelines, led by Guymer, head of macula research at the Centre for Eye Research Australia (CERA), were devised in 2016 by the RANZCO AMD guideline working group. The panel has since reconvened to update the guidelines which now reflect the appropriate counselling of a patient with GA and potential treatment options. “GA is one of two late forms of AMD, which until now has remained untreatable. With the approval of these new treatments – and several more in advanced stages of clinical trials – this has prompted a change to the AMD referral guidelines,” Guymer said. Along with stakeholders such as Optometry Australia and the Macular Diseases Foundation Australia (MDFA), the new guidelines have been developed and approved by RANZCO. “Not everyone with GA will be interested to learn about these new advances, but everyone should be given the opportunity to consider them,” Guymer said. In the original guidelines regarding GA, they recommended optometrists explain the disease to patients, identify and improve risk factors, recommend use of an Amsler grid, optimise spectacles, refer to low vision support services as appropriate, and review them in six to 12 months, depending on individual needs. Now, the guidelines advise patients be non-urgently referred to an ophthalmologist if they are interested in a potential GA treatment or to learn more about the treatments to enable them to make an informed decision. “It may not be currently possible for public patients to be referred to see an ophthalmologist, as outpatient clinics in public hospitals have limited ability to see GA patients,” Guymer said. “However, when treatments become available on the pharmaceutical benefits scheme (PBS), this is likely to change with more access to treatment becoming available.” The updated AMD referral pathway can be found here. More reading RANZCO updates AMD referral pathway for optometrists IZERVAY Phase 3 clinical study achieves positive 24-month results The Lancet publishes 24-month data for Apellis SYFOVRE GA therapy Cataract surgery product manufacturer Rayner has introduced its latest packaging updated to reduce its carbon footprint, fulfil its environmental goals,... Independent ophthalmic lens supplier CR Labs has launched Australis Easy, a multifocal lens the company says represents a breakthrough in... Optometry Australia (OA) has commissioned a sustainability roadmap to target waste, carbon, and eco-awareness challenges within the optometry sector, and... Insight has been the leading industry publication in Australia for more than 40 years. This longevity is largely due to our ability to consistently deliver accurate and independent news relevant to all ophthalmic professionals and their supporting industry. © 2024 All Rights Reserved. All content published on this site is the property of Prime Creative Media. Unauthorised reproduction is prohibited © 2024 All Rights Reserved. All content published on this site is the property of Prime Creative Media. Unauthorised reproduction is prohibited "
}