{
    "title": "Lenovo ThinkPad X1 Carbon Gen 12 with 2.8K OLED, Core Ultra 7 and 32GB RAM \nalready discounted by 51%",
    "date": "3/18/2024",
    "url": "https://www.notebookcheck.net/Lenovo-ThinkPad-X1-Carbon-Gen-12-with-2-8K-OLED-Core-Ultra-7-and-32GB-RAM-already-discounted-by-51.814700.0.html",
    "text": "Lenovo has just launched the new generation of its prestigious ThinkPad X1 Carbon, which received a few welcome upgrades and is now powered by Intel's latest and greatest Core Ultra processors from the Meteor Lake series. Unfortunately, the Chinese laptop maker is charging ludicrous prices for the sought-after OLED configuration of the ThinkPad X1 Carbon Gen 12. However, early adopters who are looking for a great deal can now head over to Lenovo's official online store and take advantage of a massive 51% discount on the ThinkPad X1 Carbon version with the Intel Core Ultra 7 155H and 32GB of soldered LPDDR5X RAM. To be more exact, the two coupon codes \"SAVECARBON12\" and \"BUYMORELENOVO\" shave $1,729 off the official MSRP of this enticing OLED business laptop, which results in a reasonable sale price of $1,649 including free shipping. As already mentioned, this particular SKU of the Lenovo ThinkPad X1 Carbon Gen 12 also sports the top-end OLED display with a 2.8K resolution and a refresh rate of 120Hz. This panel is also well-suited for multimedia users as it covers the entire DCI-P3 color space. Moreover, Lenovo's high-end notebook is equipped with a 1TB PCIe 4.0 SSD. For more info on this specific OLED configuration, prospective buyers should take a few minutes to read through our in-depth review of the Lenovo ThinkPad X1 Carbon Gen 12. In addition to the improved chassis, we praised the laptop's smooth OLED screen and improved battery life. On the other hand, the ThinkPad X1 Carbon still comes with a rather blurry webcam and its black surfaces still show fingerprints very easily. Nonetheless, this discount is a great opportunity for Lenovo fans and early adopters to get a hold of the latest flagship. Snag the ThinkPad X1 Carbon Gen 12 (Core Ultra 7 155H, 32GB/1TB, 120Hz OLED) on sale for $1,649 at Lenovo Disclaimer: Notebookcheck is not responsible for price changes carried out by retailers. The discounted price or deal mentioned in this item was available at the time of writing and may be subject to time restrictions and/or limited unit availability. Lenovo, Images: Allen Ngo (Notebookcheck) "
}