{
    "title": "AMD lifts memory overclocking limitations on RX 7900 GRE — new Adrenalin \ndriver increases limit to 3000 MHz",
    "date": "3/23/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/amd-lifts-memory-overclocking-limitations-on-rx-7900-gre",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The RX 7900 GRE now has a 3,000 MHz memory overclocking limit rather than 2,316 MHz. TechPowerUp has discovered that AMD has lifted the memory overclocking limits of its RX 7900 GRE graphics card, enabling gamers and overclockers to push the card's 16GB of GDDR6 to 3,000 MHz if they are so inclined. The new changes are part of AMD's new 24.3.1 Radeon Adrenalin GPU drivers, so you will need this new driver (or newer) to take advantage of the RX 7900 GRE's expanded overclocking range. The RX 7900 GRE is a \"newish\" RX 7000 series graphics card from AMD. It first arrived as a Chinese-exclusive product but has since been made available worldwide as an independent product for DIY builders to purchase. The GPU sits between the RX 7800 XT and RX 7900 XT, featuring 80 CUs, 5,120 cores, and 16GB of GDDR6 operating on a 256-bit bus. The graphics card sits slightly closer to the RX 7800 XT (at least in 1440P gaming) and performs marginally better than an RTX 4070 Super in rasterized performance. For some reason, AMD decided to limit the RX 7900 GRE's memory overclocking potential through a driver-based limiter when the card first came out. We suspect AMD did this to ensure the RX 7900 GRE's performance was properly segmented in its RX 7000 lineup, preventing serious overclocking from pushing the GPU's performance close to the RX 7900 XT.  Regardless, we're glad the limiter was made through the driver, not the vBIOS. TechPowerUp explains that this method allowed AMD to quickly revert the memory overclocking limits previously applied with a single driver update. If the limit were placed in the graphics card's vBIOS (or GPU firmware), all of AMD's AIB partners would be forced to publish new BIOS updates for all RX 7900 GRE models on the market to revert the changes. The memory overclocking slider now peaks at 3,000 MHz, yielding 22.8% more headroom than the GPU's previous overclocking limit of 2,316 MHz. TechPowerUp reports that it was able to overclock the RX 7900 GRE to 2,604 MHz (or 20 Gbps) with the new Adrenalin driver, which is faster than what the RX 7800 XT's memory runs at out-of-the-box — 19.5 Gbps. As a result, performance reportedly increased from 72.6 FPS to 77.1 FPS in 3DMark Time Spy GT1, yielding a 15% performance gain over stock speeds on the RX 7900 GRE. Your mileage will vary; you might be able to exceed TechPowerUp's results, or you might not. Regardless, TechPowerUp could not get close to AMD's 3,000 MHz limit, which is good and means that most (if not all) overclockers will hit silicon limitations before AMD's artificial limiter becomes a real problem. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Aaron Klotz is a freelance writer for Tom’s Hardware US, covering news topics related to computer hardware such as CPUs, and graphics cards. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 Seven-year-old AMD gaming GPU continues to stick around — low-profile RX 550 arrives for SFF PCs By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}