{
    "title": "AMD's new $329 Radeon RX 7600 XT is “ready to take on 1440p”",
    "date": "1/8/2024",
    "url": "https://www.theverge.com/2024/1/8/24029653/amd-radeon-rx-7600-xt-specs-release-date-price",
    "text": "By  Tom Warren, a senior editor covering Microsoft, PC gaming, console, and tech. He founded WinRumors, a site dedicated to Microsoft news, before joining The Verge in 2012. AMD is launching a new 1080p GPU that can also stretch to handle up to 1440p. The $329 Radeon RX 7600 XT will be available on January 24th, offering a performance bump over the existing Radeon RX 7600 that was firmly designed for 1080p gaming. I’ve been waiting for sub-$400 cards to really push the bar on 1440p gaming, but AMD’s original Radeon RX 7600 failed to do so. While that $269 card shipped with just 8GB of memory, AMD is doubling this to 16GB on the RX 7600 XT and promising the card is “ready to take on 1440p.” It’s a surprise choice, particularly as the RX 7700 XT ships with 12GB of memory. Unfortunately, the new RX 7600 XT remains at 32 compute units, 2048 stream processors, and a 128-bit memory bus, just like the RX 7600. AMD has improved the base and boost clock speeds. Total board power has also been increased to 190 watts, up from the 165 watts found on the RX 7600. AMD claims these changes should mean 60fps and above at 1440p in games like Starfield, Shadow of the Tomb Raider, Watch Dogs: Legion, Assassin’s Creed Mirage, and Forza Horizon 5. It looks like this will be more of a 1080p card still judging by AMD’s own data, even if it can stretch to 1440p in certain games. Other data shared by AMD compares the RX 6700 XT to Nvidia’s $299 RTX 4060. AMD shows the RX 6700 XT trading blows with the RTX 4060 at both 1080p and 1440p in a handful of games, but we’ll have to wait on full reviews to see exactly how it compares. The Radeon RX 6700 XT will start shipping on January 24th, priced at $329. It will be available from board partners like Acer, ASRock, Asus, Gigabyte, PowerColor, Sapphire, and XFX. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}