{
    "title": "Sapphire Pulse AMD Radeon RX 7700XT Review: A Capable GPU for 1440p Gaming",
    "date": "1/15/2024",
    "url": "https://www.mysmartprice.com/gear/sapphire-pulse-amd-radeon-rx-7700xt-review/",
    "text": "AMD’s push towards 1440p gaming is further strengthened with the launch of the Radeon RX 7700XT. This card is essentially a mid-range offering from the company and a successor to the RX 6700XT. At its current price, the RX 7700XT sits right between the base and highest variant of the RTX 4060 Ti, which is its direct competition. The RX 7700XT will lure people seeking better performance than the RX 7600 and those reluctant to invest in the more expensive RX 7900XT. But, when you bring the RX 7800XT into the equation, it creates a dilemma for the younger sibling. Both the GPUs are built on the same  Navi 32 chiplet, but with some tweaks that favour the RX 7800XT. The pricing difference between these cards is minimal. So, is it worth investing in the RX 7700XT? Let’s find out in this review. The Radeon RX 7700XT, sadly, lacks any reference design, which leaves you with the option to go with other manufacturers. You can go with Sapphire, AsRock, and Asus TUF cards. As of writing this review, the exact pricing can be seen in the table below. The listings are from PrimeABGB, which is where we found most of the cards. Amazon and MDComputers also have a bunch of options, but you’ll mostly find OC versions of these cards, some of which are on the costlier side. Keep in mind that all these prices keep fluctuating. The packaging of the card looks colourful, with the usual suspects inside the box. You get an installation guide and the RX 7700XT. The card is placed safely in a styrofoam mold and wrapped in anti-static bubble wrap to avoid any oopsie moments during transit. On initial look, the card does not go for an aggressive gamer look but instead sticks to a more subdued and subtle approach.  The outer shell is painted black with a bunch of red accents, that add some sparkle. It lacks any sort of RGB lighting, which is either good or bad depending on your preference. I think a subtle lighting on the logo would have been a good addition to the the entire system. The build quality also feels sturdy, with a metal backplate supporting the card. Since it’s a dual-fan card, it can fit into any typical mid-tower cabinet. The Sapphire Pure variant of this card comes with a triple fan option. The card uses angular velocity fan blades which are said to provide quieter and cooler operations.  This was true during our tests, as the fans were hardly audible. The Sapphire Pulse RX 7700XT also has implemented fuse protection, which is built into the circuit of the PCIe power connector. Considering the RX 7700XT is a powerful card by all means, it needs two 8-pin power connectors to run it. As for the ports, you’ll find two HDMI and two DisplayPort. The RX 7700XT is built on the Navi 32 configuration, similar to that of the RX 7800XT — but with some tweaks that favour the elder sibling. The RX 7700XT has a total of 54 compute units, which is only six fewer than the RX 7800XT. But, if you put the RX 6700XT into the picture, it has 14 fewer units.  The RDNA 3 architecture’s chiplet design helps split the GPU into two parts: logic and cache. The graphics compute die (GCD) is where the GPU logic sits, which is based on a 5nm process node. As for the cache, or the memory cache die (MCD), it now resides on TSMC’s 6nm process node. Each memory die adds 64 bits to the memory interface. You can find four on the 7700XT, taking it to 192 bits, while the RX 7800XT has a total of six, pushing it to 256 bits. This division helps AMD build smaller dies while also optimising performance overall.  While the RX7700XT is a considerable upgrade from the RX 6700XT, it lacks a bit in front of the RX 7800XT. The RX 7700XT might have a faster boost frequency, but the RX 7800XT makes up for it by equipping itself with 16GB of GDDR6 memory running on a 256-bit memory bus — and with a bigger infinity cache as well. Now, when you introduce the RTX 4060Ti into the picture, you can see that while it offers up to 16GB of memory, it will be run off of a 128-bit memory bus.  The Sapphire Pulse variant of the RX 7700XT is comparatively more power efficient, consuming about 230W, instead of the 245W rated by AMD, which is good. The RX 7800XT, on the other hand, consumes about 263W. As for the 4060Ti, it consumes a maximum of 165W, which is a bit more power efficient than the AMD counterparts. Now that FidelityFX Super Resolution 3 or FSR 3 is officially released, the RX 7700XT also takes proper advantage of that. The main highlight of FS3 is frame generation. This is something similar to what Nvidia is doing with DLSS 3. However, the red team does not require any sort of special hardware help. We tested FSR 3 and frame generation on the recently launched Avatar: Frontiers of Pandora, and the performance boosts are commendable. For this review, we tested all the above-mentioned cards on the same rig, so the comparison can be head-to-head. For the motherboard, we went with the Asus ProArt Z690-Creator WiFi, which is packed to the brim with a bunch of handy features. This board targets creative professionals, and the design language pretty much screams that. It has an integrated I/O shield and a good array of back panel ports, including a 10 Gb & 2.5 Gb ethernet, a USB 3.2 Gen 2×2 front panel connector, Thunderbolt 4 USB Type-C ports, and a healthy set of USB 3.2 Gen 2 Type-A ports. The motherboard also has support for WiFi 6E and Bluetooth 5.3.  The Intel Core i5-14600K sat at the heart of the rig. Out of the four RAM slots, we filled up two with a total of 32GB of Kingston’s Fury Renegade 7200MT/s sticks — it has RGB, so extra frames are assured. For cooling, we went with the Antec Vortex 360 AIO cooler. The Antec NeoEco 850W PSU powers the entire thing. We used the WD Blue SN580 NVMe SSD for storage, couched up under a heatsink. All this was packed inside of an Antec AX90 cabinet. The tests were run using a fresh installation of Windows 11, with all available patches installed and all drivers updated. With all that out of the way, let’s dig into the performance section. While the RX 7700XT is positioned as a 1440p card, we were sadly limited to a 1080p monitor. At this resolution, the card handles games such as Cyberpunk 2077, Avatar: Frontiers of Pandora, Dying Light 2, and more with ease. Making this card an excellent and easy choice for gamers looking for a balanced card. Enabling FSR gives a better performance output, but honestly, in some of the cases, it’s not even needed. In this review, we will be comparing it with the RX 6700XT, RX 7600, and the RX 7900XT. Sadly, we couldn’t get hold of a RX 7800XT for direct comparison. Let’s get into the benchmarks, but before that, it’s worth noting that the RX 7700XT and the RX 6700XT cards have 12GB VRAM, while the RX 7600 only comes with 8GB. The 7900XT sits on the throne in this equation with 20GB. In the TimeSpy test, the RX 7700XT easily surpasses the RX 6700XT and the RX 7600, which is expected from the card. The RX 7900XT, on the other hand, gets a 36 per cent score difference compared to the RX 7700XT. The same pattern can be seen in the rest of the tests. In the Cinebench 2024 GPU benchmark, it scores impressive numbers, while the previous-gen RX 6700XT comes up with an abnormal figure. The RX 7700XT and the rest of the cards handle first-person shooters such as CS2 with absolute ease, providing a smooth gaming experience. In Horizon Zero Dawn, it’s very evident the generational leap that the RX 7700XT has had from the RX 6700XT. However, in games such as Shadow of the Tomb Raider and Far Cry 5, the differences are minimal. While these numbers were achieved without FSR, it’s worth noting the upscaling technology can help achieve slightly better numbers. With the help of FSR, we have some decent numbers in ray-tracing performance as well. Dying Light 2 managed an 8 per cent performance boost from the RX 6700XT. As for Cyberpunk 2077, at ultra settings, the game managed a maximum of 63 fps. With the ray tracing preset set to low, the card easily gives us 114 fps. These numbers should be enough to give 1080p gamers a smooth experience. However, if 1440p comes into this picture, you might see a slight dip in the frames. Enabling frame generation in Avatar: Frontiers of Pandora resulted in a significant 43 per cent boost in performance compared to when it was disabled. With FSR 3, AMD wants to take the fight straight to Nvidia — and it’s going to be fun.  When it comes to power consumption, the RX 7700XT, ever so slightly, exceeds its rated board power when running the TimeSpy benchmark. The card also runs extremely quiet even in heavy performance situations. The RX 7700XT, despite its confused value proposition, is a strong and reliable performer. It’s a concrete choice for 1440p gaming, and an even better choice for 1080p gaming. The RX 7700XT also fares well against the RTX 4060Ti, at least on paper. While the 4060 Ti has an option for a slightly bigger memory at 16GB, the 128-bit memory interface remains a disadvantage in the future. But, it’s not all perfect for the RX 7700XT. The pricing and positioning of the card give it an identity crisis. The slightly powerful and elder sibling, the RX 7800XT can be bought with a Rs 4,000 – 5,000 price difference. And, with this price difference, you get better memory cavalry, more infinity cache, compute units, etc. Ideally, the RX 7700XT should have been priced under Rs 40,000 for it to stand out in the market and be an instant buy. Regardless, the RX 7700XT is still a safe choice for people eyeing a capable card which runs efficiently while providing good performance. OnePlus 11R vs OnePlus 12R vivo V30 vs vivo V30 Pro OnePlus 12R vs OnePlus 12 realme Narzo 70 Pro vs realme 12 Plus Motorola Edge 40 vs Motorola Edge 40 Neo OnePlus Nord CE 3 5G vs OnePlus Nord CE 3 Lite 5G iQOO Z9 vs Nothing Phone 2a OnePlus 12R vs iQOO Neo 9 Pro Moto G54 vs Moto G34 OnePlus 12R vs vivo V30 Pro "
}