{
    "title": "AMD's any-game frame generation tech is officially launching out of beta \nwith the RX 7600 XT release on January 24",
    "date": "1/10/2024",
    "url": "https://www.pcgamer.com/amds-any-game-frame-generation-tech-is-officially-launching-out-of-beta-with-the-rx-7600-xt-release-on-january-24/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Hidden in the CES 2024 press deck are details of the imminent release of AMD Fluid Motion Frames (AFMF) into the official Radeon driver stack. AMD's Fluid Motion Frames (AFMF) technology has been part of a regularly updated preview driver since late September, and the red team has been adding support for a host of different RDNA 2 and RDNA 3 GPUs since then. And buried in the unveiling of the Radeon RX 7600 XT at CES 2024 this week is the announcement that AFMF is going to be part of the release driver for the new mid-range graphics card. AMD Fluid Motion Frames is part of the red team's answer to Nvidia's DLSS 3 and Frame Generation, but doesn't require GeForce hardware or even game integration to make it happen. AMD does have a game-specific frame generation feature, currently only available in Forspoken and Immortals of Aveum, and coming to a suite of future games, but AFMF is driver-based and should work on any DirectX 11 or 12 game. But it's been sat in the preview stage for the last few months with no details about when it would hit the main driver stack. But with the note at the bottom of the AMD CES 2024 presentation stating that \"AMD HYPR-RX with AMD Fluid Motion Frames (AFMF) available with AMD Radeon RX 7600 XT launch driver\" we now know that it will be released on January 24. That's great news for gamers on lower spec hardware as it gives players the opportunity to smooth out their gaming experience on a huge number of titles, far more than the green competition. Which is why AMD believes that Nvidia is potentially going to have to follow suit with it for once. AMD's Aaron Steinman told Jacob that he believes Nvidia is \"going to have to do something similar\" if it wants to keep pace in the upscaling arms race.  Steam Deck OLED review: Our verdict on Valve's handheld.\nBest Steam Deck accessories: Get decked out.\nSteam Deck battery life: What's the real battery life?\nBest handheld gaming PC: What's the best travel buddy? But frame generation—in either driver- based or game-specific trim—is no frame rate panacea, however, as you still need a certain level of gaming performance for it to be a benefit more than a latency hinderance. That said, with the recent update to the preview driver delivering support for the 700M-series iGPU, I've had Baldur's Gate 3 running on my Framework 13 laptop to great success. Sign up to get the best content of the week, and great gaming deals, as picked by the editors. That's the same 780M graphics silicon as in most gaming handhelds and the next-gen Ryzen 8000G desktop APUs, and I've seen FSR 2 Balanced performance go from around 30 fps on High settings to a pretty steady ~60 fps with AFMF enabled. And it looks and feels really good, too. _____________________________________\nPC Gamer's CES 2024 coverage is being published in association with Asus Republic of Gamers. Dave has been gaming since the days of Zaxxon and Lady Bug on the Colecovision, and code books for the Commodore Vic 20 (Death Race 2000!). He built his first gaming PC at the tender age of 16, and finally finished bug-fixing the Cyrix-based system around a year later. When he dropped it out of the window. He first started writing for Official PlayStation Magazine and Xbox World many decades ago, then moved onto PC Format full-time, then PC Gamer, TechRadar, and T3 among others. Now he's back, writing about the nightmarish graphics card market, CPUs with more cores than sense, gaming laptops hotter than the sun, and SSDs more capacious than a Cybertruck. This home-brew GPU built by a lone enthusiast is a slightly labour-intensive way to avoid painful graphics card prices Diablo 4's new ray tracing update tested: It halves your frame rate for little visual gain, but I am definitely here for some Frame Generation Dragon's Dogma 2's first proper patch adds a much-needed new game option and makes it easier to get a house By Andy Chalk28 March 2024 By Rich Stanton28 March 2024 By Joshua Wolens28 March 2024 By Dave James28 March 2024 By Wes Fenlon28 March 2024 By Wes Fenlon28 March 2024 By Harvey Randall28 March 2024 By Andy Chalk28 March 2024 By Phil Savage28 March 2024 By Joshua Wolens28 March 2024 By Harvey Randall28 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}