{
    "title": "Could Advanced Micro Devices (AMD) Stock Help You Become a Millionaire?",
    "date": "1/22/2024",
    "url": "https://www.fool.com/investing/2024/01/22/could-advanced-micro-devices-amd-stock-millionaire/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Advanced Micro Devices (AMD 0.50%) has made a lot of investors millionaires since Lisa Su took the helm as the chipmaker's CEO on Oct. 8, 2014. AMD's stock has risen 4,780% since that fateful day -- and a $25,000 investment would have grown into $1.25 million today. That same investment in AMD's larger rival Intel (INTC 0.91%) would only be worth $33,500 today. Let's see why AMD outperformed Intel by such a wide margin -- and if it might turn a fresh $25,000 investment into more than $1 million again over the next few decades. Image source: AMD. When Su became AMD's CEO, the chipmaker was losing the CPU market to Intel and ceding the GPU market to Nvidia (NVDA 0.12%). Su reversed those losses with three main strategies. First, AMD developed more custom APUs -- which merged together CPUs and GPUs -- for Sony's PlayStation consoles and Microsoft's Xbox consoles. The growth of that business generated fresh cash for the development of new PC chips. Second, AMD rebooted its x86 CPUs with brand new designs that addressed the single-thread shortcomings of its previous Bulldozer chips. That massive reset led to its launches of its Ryzen CPUs for PCs and Epyc CPUs for servers in 2017. Lastly, AMD outsourced the production of those chips to Taiwan Semiconductor Manufacturing, the world's most advanced contract chipmaker, as Intel struggled with persistent shortages and delays at its own first-party foundries. According to PassMark Software, AMD's share of the PC CPU market soared from 17.5% in the third quarter of 2016 to 39.1% in first quarter of 2021. Intel's share shrank from 82.5% to 60.4% during the same period. From 2016 to 2022, AMD's revenue rose at a compound annual growth rate (CAGR) of 33%, its adjusted gross margin expanded from 31% to 52%, and its adjusted operating margin rose from 1% to 27%. That incredible turnaround turned AMD into one of the market's hottest growth stocks. Over the past year, AMD struggled with slower growth as sales of new PCs cooled off in a post-pandemic market. Its revenue rose 44% in 2022, but that growth included its acquisition of the programmable chipmaker Xilinx. Analysts expect its revenue to decline 4% in 2023 as it laps that acquisition and grapples with slower PC sales. The next few years could also be challenging for AMD as Intel ramps up its spending to catch up to TSMC in the \"process race\" to manufacture smaller and denser chips. If Intel's first-party foundries overtake TSMC in that race, it could produce more advanced chips than AMD again. Intel's newest generation of Meteor Lake chips, which launched last month, could gradually narrow that gap and further expand its market share against AMD. To make matters worse, AMD could struggle to keep pace with Nvidia's latest GPUs -- which JPR estimates account for almost 90% of the discrete GPU market. Nvidia remains the clear leader in both gaming and artificial intelligence (AI) GPUs for data centers -- but AMD hasn't proven that it can carve out a meaningful niche in the AI market with its new AI-oriented Instinct GPUs yet. These challenges could make it difficult for AMD to replicate its millionaire-making gains from the past nine years. Assuming its valuations hold steady, it would need to grow its earnings per share (EPS) at a CAGR of 45% over the next 10 years to turn a $25,000 investment into $1 million. Analysts expect its EPS to grow at a CAGR of 56% from 2022 to 2025, but its growth beyond 2025 is unpredictable and will rely heavily on its ability to stay ahead of Intel and Nvidia. It could be a close race. Intel plans to start producing its 18A (1.8-nanometer) chips in the second half of 2024, which could be roughly comparable to TSMC's 3nm chips. AMD's upcoming Ryzen 8000 chips, which will also arrive in late 2024, will be built on TSMC's 4nm and 3nm nodes. On the GPU front, AMD and Nvidia both outsource the production of most of their chips to TSMC -- but Nvidia's recent production of lower-end GPUs could undermine AMD's strategy of selling cheaper GPUs. All of these challenges, along with AMD's high forward price-to-earnings ratio of 43, suggest it could be difficult for the chipmaker to generate millionaire-making gains over the next 10 years. But if patient investors take a longer-term view and give AMD 20 to 30 years to grow, I believe this stock could still turn them into millionaires -- as long as the company sticks with Su's shrewd strategies and doesn't fall too far behind Intel and Nvidia. Leo Sun has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}