{
    "title": "[News] AMD Eyes CoWoS-like Supply for AI Chips with TSMC Full Capacity",
    "date": "1/3/2024",
    "url": "https://www.trendforce.com/news/2024/01/03/news-amd-eyes-cowos-like-supply-for-ai-chips-with-tsmc-full-capacity/",
    "text": " TSMC operates at full capacity, AMD aims for AI chips reportedly seeks CoWoS-like supply chain. In 2023, NVIDIA led the global AI chip development, and in 2024, the global demand for AI chips is expected to continue to surge due to the expansion of end-user applications such as PCs and mobile phones. Meanwhile, AMD has not stopped in AI chip development either, with the expected MI300 products poised to heat up the global AI business opportunities. However, the key to supply lies in advanced packaging, and AMD will seek outsourced semiconductor assembly and test (OSAT) service providers to offer support similar to CoWoS. According to Taiwan’s Commercial Times, TSMC’s CoWoS capacity has long been fully loaded, and even if it expands production this year, it will mainly be reserved for NVIDIA. Market sources pointed out that TSMC will continue to increase CoWoS capacity to support AMD’s demand, but it takes six to nine months to establish a new production line. Therefore, it is expected that AMD will seek cooperation with other companies with CoWoS-like packaging capabilities. ASE, Amkor, Powertech, and KYEC are the first batch of potential partners. TSMC has been outsourcing part of its CoWoS operations for some time, mainly targeting small-volume, high-performance chips. TSMC maintains in-house production of the CoW, while the back-end WoS is handed over to test and assembly houses to improve production efficiency and flexibility. This model will continue in the future 3D IC generation. ASE and Amkor both received WoS orders last year. ASE has strengthened the development of advanced packaging technology and has a complete solution for the entire CoWoS process. ASE previously stated that it sees the strong potential of AI and expects related revenue to double in 2024. According to reports citing market sources, the monthly production capacity of the ASE Group’s 2.5D packaging is about 2,000 to 2,500 pieces. Some experts believe that test and assembly houses will maintain the business model of TSMC or UMC providing the interposer. Therefore, in 2024, a significant increase in CoWoS production capacity is expected. KYEC is responsible for testing Nvidia AI chips and is expected to benefit from AMD’s search for CoWoS-like capacity. Nvidia is currently KYEC’s second-largest customer. KYEC’s testing of Nvidia A100 and H100 chips is mainly in the final test (FT), with a market share of up to 70%. KYEC provides comprehensive IC burn-in testing, has self-developed burn-in equipment, and has been in the industry for more than a decade, accumulating many patents and technologies. AMD stated at the end of 2023 that AI chip revenue could reach US$2 billion in 2024, excluding other HPC chips. AMD pointed out that the annual compound growth rate of the AI chip market in the next four years will reach 70%, and it is estimated that it will reach US$400 billion in 2027. (Image: AMD)  "
}