{
    "title": "Why AMD (AMD) Shares Are Sliding Today",
    "date": "1/2/2024",
    "url": "https://finance.yahoo.com/news/why-amd-amd-shares-sliding-182235595.html",
    "text": "Shares of computer processor maker AMD (NASDAQ:AMD) fell 5.8% in the morning session after the Nasdaq and S&P 500 continued to retreat while the Dow rose slightly. Interest rates rebounded a bit, and investors may be continuing to take profits after a strong calendar 2023. Other than that, we found nothing more specific for the broad move downward. As a reminder, 2023 was a stellar year for the markets, with the S&P 500 surging by almost 25% and the NASDAQ Composite up over 40%. The final month of 2023 was notably strong, marked by a rally in equities and bonds. The prevailing theme for 2024 revolves around the narrative of slowing inflation. The Federal Reserve is attempting to orchestrate a soft landing scenario, where inflation comes under control without damaging the economy (in the form of higher unemployment and lower GDP growth, for example). This could hurt overall consumer demand and the markets. As it stands, the market expects a 75 basis points cut in rates throughout the year. Any change in this expectation or narrative could move markets. As a reminder, the driver of a stock's value is the sum of its future cash flows discounted back to today. With lower interest rates, investors can apply higher valuations to their stocks. No wonder so many in the investment community are optimistic about 2024. We at StockStory remain cautious, as following the crowd can lead to adverse outcomes. During times like this, it's best to own high-quality, cash-flowing companies that can weather the ups and downs of the market. The stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks. Is now the time to buy AMD? Access our full analysis report here, it's free. AMD's shares are very volatile and over the last year have had 21 moves greater than 5%. In context of that, today's move is indicating the market considers this news meaningful but not something that would fundamentally change its perception of the business. The previous big move we wrote about was 26 days ago, when the stock gained 5.1% on the news that the company unveiled its latest AI accelerator Instinct MI300X, at its Advancing AI event. As a reminder, AMD is a key player in the AI ecosystem, providing hardware solutions that enable the efficient processing of AI tasks. The Instinct MI300X is designed to meet the demands of generative AI tasks, from creating realistic images and videos to developing personalized medicine and powering chatbots. AMD's CEO emphasized the transformative impact of AI on computing, highlighting the exponential growth in demand. As a result, it raised the expected market opportunity in the AI market, which is projected to grow 70% annually over the next four years to over 400 billion in 2027, nearly triple the previous estimate of $150 billion. But it's not all about the hardware. During the event, AMD highlighted the focus on building a strong software platform and fostering partnerships to make AI easier to use for everyone. Overall, the event highlights AMD's growing capabilities in the rapidly expanding AI market, which has the potential to drive new growth opportunities in the coming years. Following the event, Wall Street analysts were generally constructive on the announcements and developments. For example, KeyBanc analyst John Vinh seemed incrementally more bullish. \"We're encouraged that AMD has released a competitive AI GPU within a massively fast-growing TAM, with endorsements by many high-profile customers. We reiterate our Overweight rating.\" AMD is down 5.6% since the beginning of the year, and at $139.01 per share it is trading close to its 52-week high of $148.76 from December 2023. Investors who bought $1,000 worth of AMD's shares 5 years ago would now be looking at an investment worth $7,384. Do you want to know what moves the stocks you care about? Add them to your StockStory watchlist and every time a stock we cover moves more than 5%, we provide you with a timely explanation straight to your inbox. It's free and will only take you a second. Related Quotes "
}