{
    "title": "AMD - Every silicon provider is now going to be \"tied to the hip\" with AI",
    "date": "1/12/2024",
    "url": "https://www.pcguide.com/news/amd-silicon-providers-tied-to-hip-ai/",
    "text": "Bringing you all the latest AI industry talk from inside CES 2024 Reviewed By: Kevin Pocock PC Guide is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Read More Last Updated on January 12, 2024 Silicon providers are now going to be “tied to the hip” when it comes to AI in future chips – that’s the message from AMD and seems to signal a new normal for the industry as artificial intelligence becomes evermore embedded in consumer computing and hardware. Continuing with our coverage from CES 2024, we’re keen to investigate the impact of AI on all things tech – and what it means for the future of computing. In attendance at CES, and in light of the company’s new 8000 series APUs, our By Gamers For Gamers colleagues asked AMD’s Senior Processor Technical Marketing Manager, Donny Woligroski, for his view on AI-enabled chips at the heart of computing. The response we got was telling. Certainly, AMD’s latest 8000 series chips, like those of Intel, will be felt on a wider industry scale. Woligroski’s response that “every silicon provider is now going to be tied to the hip” with AI, clearly suggests there’s no going back from a hardware perspective, as there likely isn’t in terms of AI software or apps (think ChatGPT or Google Bard) and its wider impact on humanity. In terms of computing, Woligroski went on to point out he did not believe that the process of AI capabilities in all consumer chips would be happening “tomorrow”. Instead, things would morph over time gradually as AI becomes more influential and unavoidable in everyday life. Coming off the back of AMD’s announcement of its 8000 chips, which include the AI-enabled Ryzen AI NPU, and generally, AI has been a hot topic at this year’s CES 2024 panels. Unlike other industries, the processor and gaming community appears to have a united front when it comes to AI moving forward – something Woligroski described as “encouraging”. Of course, graphics cards are already courting AI technology with the likes of DLSS 3.5 and Huang’s law is firmly coming into play to move things forward away from hardware. However, in terms of how quickly AI’s influence and impact will be, it is important to acknowledge that AI is currently still in its early stages of development – it actually hasn’t been around in the public sphere for long at all. So it may take time for the benefits of this new software and the hardware that supports it to become widely noticeable. However, with AMD and other manufacturers embracing AI capabilities and technology, these changes could be fast-tracked in home computing when compared to other major tech industries. The reason is that AI provides processors with extra capabilities that cannot be replicated in hardware alone. Wolrigroski also speculated that the rumored 2024 Windows releases could be the first time users begin to see fundamental differences in their PC or laptop in terms of AI’s influence. With a lot of exciting developments potentially on the horizon, who knows what component developments we’ll see next? Here at PC Guide, we’ll be sure to keep you updated on all upcoming releases and announcements including, for example, the arrival of AI into gaming accessories. PCguide.com is part of the BGFG family of websites. Our mission is to provide you with great editorial and essential information to make your PC an integral part of your life. You can also follow PCguide.com on our social channels and interact with the team there. © 2024 PC Guide. All rights reserved. Part of "
}