{
    "title": "MW3 and Warzone receive frame rate boost thanks to AMD",
    "date": "1/18/2024",
    "url": "https://www.pcgamesn.com/amd/fsr-3-coming-to-warzone-mw3",
    "text": "It's a long time coming, but AMD is finally rolling out improved performance with FSR 3 for Call of Duty: Warzone and Modern Warfare 3. Niall Walsh Published: Jan 18, 2024 AMD is adding FSR 3 support for both Call of Duty: Warzone and Modern Warfare 3.  The upscaling and frame generation tech is long overdue in Activision’s leading shooters which was released in November last year. It’s a welcome addition for those who struggle to get the performance they desire on their current setups, provided they have a compatible GPU. As some of the most competitive FPS games around, Call of Duty’s Warzone and Modern Warfare 3 rely heavily on PC performance to have the best experience. You don’t need the best graphics card to get either game running, but with FSR 3, you can now enjoy a boost to performance with no legwork needed. AMD FSR 3 upscaling is possible on AMD Radeon RX 590 cards or above but is recommended for the RX 5000 series or above. For Nvidia cards, upscaling is supported on the GTX 10 series and above but is recommended for the RTX 20 series and above. It’s always been notable that AMD FSR 3 isn’t bound to its own graphics cards like Nvidia DLSS, but DLSS takes advantage of Tensor cores which are only found in Nvidia RTX cards. Full AMD FSR 3 support of both upscaling and frame generation is supported on the Radeon RX 5000 series cards and above but recommended for the RX 6000 series and above. On Team Green’s cards, it’s supported on the RTX 20 series and above but is recommended for the RTX 30 series and above. The addition of Warzone and Modern Warfare 3 brings the total number of FSR 3 games to seven. Other supported games include; Avatar: Frontiers of Pandora, Forspoken, Immortals of Aveum, Like a Dragon Gaiden: The Man Who Erased His Name, and MotorCubs RC. The list is quite short at the moment primarily because FSR 3 needs developers to integrate it into their games. With the arrival of Fluid Motion Frames later this month, AMD will be able to bring performance improvements without developer input, but this tech will be exclusive to AMD components. If you’re dropping into Urzikstan, check out our best Warzone guns guide to make sure you’re carrying the right gear for the job. Niall Walsh                 As one of PCGN’s Hardware Editors, Niall is an expert in all things peripherals, meaning if you need to know what the best PC gaming headsets, controllers, keyboards, mice, or monitors are, he has you covered. Even if you just want to know which peripheral brand is better, Razer, Corsair, Logitech, or any other he can help there too. You will also find his words on sites such as; The Loadout, Wargamer, USA Today, MTG Rocks, GGRecon, and RealSport101. "
}