{
    "title": "ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC Review",
    "date": "1/26/2024",
    "url": "https://www.tweaktown.com/reviews/10648/asrock-amd-radeon-rx-7600-xt-steel-legend-16gb-oc/index.html",
    "text": "Outside of featuring 16GB of VRAM, double that of the baseline Radeon RX 7600, the Radeon RX 7600 XT also boosts the clock speeds to ensure a boost to performance in most games. Outside of this, though, the hardware specs for the Radeon RX 7600 XT are identical to the Radeon RX 7600, which is a little disappointing when you consider that there's a pretty big performance gap to fill between it and the next card in AMD's RDNA 3 line-up - the Radeon RX 7700 XT. Our third review of the new Radeon RX 7600 XT takes a closer look at ASRock's premium Steel Legend edition, which takes the already overclocked Radeon RX 7600 XT and overclocks it more. A triple fan design for a mainstream GPU is always strange, but the benefit is improved cooling versus more compact models, with the bonus of being able to overclock and squeeze some more performance out of the hardware. If you have been watching the Radeon RX 7600 XT, you're probably aware that doubling the VRAM capacity to 16GB doesn't automatically translate to more performance. Without fundamental changes to the underlying architecture, as we saw with the Radeon RX 6600 XT versus the Radeon RX 6600, performance in many titles remains mostly the same or is limited to a small single-digit percentage bump. This makes the price increase to $329 USD (a $60 or 22% increase) harder to swallow. At $269, the Radeon RX 7600 presents decent mainstream value for those looking for impressive 1080p performance across a wide range of games. That said, the increase in memory to 16GB is still exciting, and with more demanding titles hitting the market, the Radeon RX 7600 XT should age better than its competition. At least that's the expectation. But enough speculation, let's dig into the ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC and see if it has the performance to match its good looks. \"The world's first chiplet gaming GPU\" is how AMD described its new RDNA 3-based GPUs when it lifted the lid on the new Radeon RX 7000 Series. In layperson's terms, the GPU chip isn't just one big square or die anymore, with billions of transistors all arranged in a single layout. Like with its Ryzen CPU range, which embraced chiplet design to great effect (look at how Ryzen has grown in popularity over the years), bringing this design philosophy into the GPU space felt like the natural evolution for AMD's Radeon brand. For RDNA 3, what was once a single Graphics Compute Die (GCD) has now split into a GCD plus a Memory Cache Die (MCD). The GCD still makes up most of the hardware grunt and uses the newer 5nm process technology - a step up from RDNA 2's 7nm process. Interestingly, the MCD uses 6nm process technology, which allows AMD to keep costs down as the complexity and cost of manufacturing high-end tech continue to rise. And to mitigate any performance impact that could arise from going the chiplet route, AMD has also managed to include the \"fastest chiplet interconnect in the world,\" with speeds of 5.3 TB/s. That said, the Radeon RX 7600 and entry-level models using the 'Navi 33' GPU follow a more traditional single-chip setup using 6nm process technology to help keep costs down. But with the same RDNA 3 architecture as the Radeon RX 7700 XT, 7800 XT, and 7900 XT. AMD's RDNA 3 architecture features second-generation AMD Infinity Cache, another CPU-like feature designed to boost performance in 1440p and 4K gaming - a \"bandwidth amplifier\" that sits alongside the GDDR6 memory interface. It helps alleviate the need for more expensive and power-hungry memory buses and is one of those forward-thinking designs we love seeing. RDNA 3 also represents a significant leap forward for AMD regarding ray-tracing and AI accelerators. RDNA 3 GPUs feature the second generation of dedicated RT hardware and new hardware-based AI acceleration. Real-time ray tracing is hardware intensive; this is one area many were looking for AMD to improve compared to RDNA 2. Which, admittedly, was the company's first attempt at hardware-based ray tracing. RDNA 3 GPUs are the first graphics cards supporting the new DisplayPort 2.1 spec. The latest DisplayPort interface supports up to 4K 480Hz and even 8K 165Hz, which makes it more of a future-proofing measure than something applicable today. But the real benefit comes with 12-bit HDR support and full Rec2020 coverage for improved color accuracy and detail. RDNA 3 also introduces hardware-based AV1 encoding to step up its video game for content creators, which means better quality video using the same bitrate. Very cool. For gamers, the introduction of AMD FSR 2 and FSR 3 rendering is fully supported and helps improve performance in intensive games. FSR 2 support might not be as widespread as NVIDIA DLSS, but its addition to games like Cyberpunk 2077 and Star Wars Jedi: Survivor is a great sign. Plus, as the tech is supported on Xbox Series X|S and PlayStation 5 (with both consoles using AMD graphics hardware), in-game FSR support should grow as time passes. In late 2023, AMD introduced its DLSS 3-like FSR 3 frame generation technology, which uses generated frames and low-latency tech to boost perceived performance. With FSR 3 in its infancy, it's a technology set to mature in the coming months and years. Ultimately, RDNA 3 is an impressive leap forward for AMD, bringing massive changes to the underlying hardware while delivering a sizable performance leap over the previous RDNA 2 generation. Here, we can see how the specs and hardware stack up for the AMD Radeon RX 7600 XT compared to the AMD Radeon RX 7600 and AMD Radeon RX 7700 XT. As seen in the table above, the Radeon RX 7600 and Radeon RX 7600 XT features the same underlying hardware, with the 'XT' version doubling the VRAM capacity to 16GB on the same 128-bit interface. The slower interface means the 16GB here differs from the 16GB you find on the Radeon RX 7800 XT. However, with second-generation AMD Infinity Cache, effective memory bandwidth increases substantially - which is great. There hasn't been a bump to specs like Compute Units and Ray Accelerators due to AMD choosing to launch the Radeon RX 7600 with a fully unlocked Navi 33 6nm chip. The Radeon RX 7700 XT uses the more expensive chiplet design for the mid-range and high-end Radeon RX 7000 Series graphics cards, so it looks like there was no other mainstream 6nm RDNA 3 option. And with that, we've also got boosted clock speeds to help push performance. The downside to pushing clock speeds and adding more memory is that the power rating increases by 15% to 190W - and when you factor in that the Radeon RX 7600 wasn't all that impressive efficiency-wise compared to the GeForce RTX 4060 and the Radeon RX 6600, it's always disappointing when a mainstream GPU requires two 8-pin power connectors. The ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC does overclock the already overclocked specs, with a Boost Clock speed of Up to 2810 MHz - which does make it slightly faster than other models we've tested. This can be pushed even further with the ASRock Tweak software. The ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC arrives in white, with three transparent fans that light up and a full metal backplate with some generous vent action that also sports a very cool camo pattern and the Steel Legend logo that takes its inspiration from The Man of Steel himself, Superman. It's stylish and cool in ways most GPUs aren't, so if you're eyeing the new Radeon RX 7600 XT GPU and want something that stands out or would look great in a new build - the Steel Legend is an excellent choice. Fair warning, though, when you power the Stele Legend up, the lights are default set to 'Rainbow,' so you'll probably want to fire up ASRock Polychrome SYNC immediately. For me, choosing a cool white light to match the white with the camo build was the way to go. Of course, looks aren't everything, and even though you've got three fans and extra heatsink action to improve cooling performance, the good news is that it's still lightweight and well under 3-slots in thickness - so with the metal backplate, it doesn't require additional bracing or support. As a premium model, you've got three of ASRock's custom Striped Axial Fans for improved airflow and lower overall noise - which also turn off when temperatures drop during light workloads. In addition, the fins are cut and shaped to assist in pushing airflow through the GPU. With a premium copper base that maximizes contact area, the result is impressive thermal performance. In our stress test, the ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC's cooling is unmatched by the other Radeon RX 7600 XT cards we've tested, and that comes down to the physical design, premium components, and ASRock's focus on delivering a premium GPU. PC gaming is a complicated and varied space, from indie games to major blockbuster releases and titles that push hardware and technology to their limit with the adoption of effects like real-time ray-tracing. This is all a way of saying that the 15 in-game benchmarks we've chosen (and run at 1080p and 1440p) represent a wide range of styles, not only in terms of genres, like first-person shooters and racing games but also in the API technology (DirectX 11, 12) and cutting-edge features like ray tracing and upscaling technology. Results include DLSS and FSR 2, where possible, as both technologies are the sorts of things, especially in 1440p and 4K, which you'd turn on. Six of the 15 game benchmarks also feature ray tracing. Also, each title is set to ultra-equivalent quality settings to push GPU hardware and minimize CPU bottlenecks at higher resolutions. Also, it's just fun to max out a game's visual settings and see the results. Here's the breakdown of games, graphics settings, and what's being tested. Across our 15-game benchmark suite, the ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC's overall average of 102 FPS makes it 8.5% faster than the baseline Radeon RX 7600 - a decent, if not overly exciting result. This result also puts overall performance on par with the GeForce RTX 4060 while being 18.6% faster than the GeForce RTX 3060 and 12.1% faster than the Intel Arc A770 - the only other card in this price range with 16GB of memory. The biggest gains over the Radeon RX 7600 come with titles where the 16GB makes a notable difference in performance. Call of Duty: Modern Warfare II is 14.2% faster at 1080p compared to the Radeon RX 7600, while DOOM Eternal is 13% faster. Mostly, there are single-digit gains thanks to the overclock action and increased power. So for 1080p gaming, the 16GB, at least in the 15 games we've benchmarked, doesn't make a huge impact. However, there are titles like The Last of Us and Hogwarts Legacy, two big PC games from 2023, where the 16GB does impact performance and what visual settings you can select. With that, you can say that having 16GB of VRAM does make the long-term value and relevance of the Radeon RX 7600 XT a little more future-proof than competing cards. But, even with 16GB, the Radeon RX 7600 XT's ray-tracing performance is still a letdown and one of the reasons why the overall average is in line with the GeForce RTX 4060. At 1440p, we see the biggest gains for the Radeon RX 7600 XT, specifically for the premium ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC model reviewed here. Compared to the Radeon RX 7600 XT, the performance uplift increases to 11.1% - double digits! It's enough to make the card an entry-level 1440p performer in select titles, and once again, we see overall performance and averages that match the GeForce RTX 4060. Individual game results tell a more nuanced story as there are titles where the Radeon RX 7600 XT's performance sits closer to the GeForce RTX 4060 Ti and ray-tracing titles where its performance falls way below where it should be at this price point. The 16GB makes an impact here, too. It is limited per the 1080p results, but some impressive gains can be found. Call of Duty: Modern Warfare II sees a 17.6% uplift, Forza Horizon 5 sees a 17.8% uplift, DOOM Eternal sees a sizeable 38.2% uplift, and Cyberpunk 2077 with RT set to Ultra sees a massive 60% increase in performance. 1440p Cyberpunk 2077 with ray-tracing is still unplayable, but it's a clear example of the additional VRAM being put to work. As seen with 1080p gaming, performance gains are still limited, and there are examples where the Radeon RX 7600 and Radeon RX 7600 XT end up looking the same. Still, there's a definite benefit to having 16GB for gaming. 3DMark FireStrike is a synthetic DirectX 11 benchmark that has been around for years, and in 2024, it's still surprisingly relevant, thanks to games still using the aging API. The three tests cover three resolutions - 1080p, 1440p, and 4K. Looking at the 1080p and 1440p tests, the ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC's results are the same as the Radeon RX 7600. This tells us that the 3DMark FireStrike benchmarks don't factor in or use the additional 8GB VRAM. 3DMark TimeSpy is a synthetic DirectX 12 benchmark and is more relevant for modern gaming, with the two benchmarks covering 1440p and 4K gaming performance. As seen in the 3DMark FireStrike results above, this is another benchmark and test where the additional memory doesn't impact the score, with the ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC once again being on par with the baseline Radeon RX 7600. The final synthetic benchmark is 3DMark Port Royal, and the result here also matches what we found in other 3DMark tests. This is a little surprising as we assumed that the additional 8GB might have pushed ray-tracing performance a little higher. This is an area where the mainstream Radeon RX 7600 and Radeon RX 7600 XT fall behind the competition big time - with RT performance from NVIDIA and Intel being a step ahead of AMD when it comes to the 'mainstream' bracket of graphics cards and performance. The $179 Intel Arc A580 (an ASRock model) scores higher! Raw performance isn't everything, and even though having 16GB of VRAM is welcome and helps future-proof the Radeon RX 7600 XT - its launch also arrives alongside AMD stepping up its software game. FSR 3, which includes upscaling and frame generation, might have launched last year. Still, in 2024, it's picking steam thanks to an improved and promising version of the tech making its debut in Ubisoft's Avatar Frontiers of Pandora. At 1080p and 1440p, you sacrifice visual fidelity to boost performance, but the results are impressive. Using the FSR 'Quality' upscale setting (which you have to at 1080p and 1440p) and Frame Generation, you're looking at a sizeable 2.6X increase in perceived performance. It looks pretty good and feels fine in Avatar, and it is something worth considering for the Radeon RX 7600 XT and other cards in the Radeon RX 7000 Series. OF course, AMD's answer to DLSS 3 Frame Generation doesn't look as good or feel as smooth as NVIDIA's tech - but on the plus side, it works on all current GeForce RTX and Radeon RX cards. The other big software update to arrive is HYPR-RX with AMD Fluid Motion Frames (AFMF) technology, which is driver-based frame generation that you can enable in every DirectX 11 or DirectX 12 title. This is AMD doing something new and exciting, and even though the results are mixed and not at the quality level of FSR 3's per-game integration (it lacks detailed game data to work from, like motion vectors) - it works in every game. HYPR-RX with AMD Fluid Motion Frames (AFMF) technology, Radeon Boost upscaling, and AMD Anti-Lag latency reduction is still new - and the company plans to update and improve image quality and performance in the coming months. Having all of this as a one-click solution with AMD's software is great to see, and we'll be keeping an eye on it going forward - much like we will with tech like FSR and DLSS. In our stress test and under full load, the ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC's GPU temperature hovered at around 57 Degrees Celsius with a hotspot of 74 Degrees. This excellent result makes it the coolest Radeon RX 7600 XT we've reviewed. Memory temperature was also low, and with fan speed capacity at 20% or 1194 RPM - you're looking at a quiet performer. This is cool because it matches the stealthy camo design on the metal backplate. The Radeon RX 7600 XT is an interesting launch that is exciting on the one hand and underwhelming on the other. Having 16GB of VRAM in a mainstream Radeon GPU is exciting. When looking at the ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC's benchmark results, you'll see some serious performance gains in a few select titles. However, with the rest of the specs being the same as the baseline Radeon RX 7600 - the additional boost to clock speeds means only a slight improvement in performance in many tests, which makes the $60 price increase (in addition to the small premium for the ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC) disappointing. Still, 1080p performance is competitive, and there's enough of an overall improvement to put it on par with the GeForce RTX 4060 or slightly ahead, as seen with the ASRock AMD Radeon RX 7600 XT Steel Legend 16GB OC. Outside of gaming, the 16GB of VRAM does make this an affordable and attractive option for content creation and workloads where memory capacity is the difference between being able to do something versus not (editing 4K video, for example), and with 2024 being the year of AI PCs having an extra 8GB is nothing to sneeze at. Performance 76% Quality 87% Features 87% Value 84% Overall 84% With 16GB of VRAM making a difference in select titles, the ASRock AMD Radeon RX 7600 XT Steel Legend OC also overclocks the already overclocked Radeon RX 7600 XT to squeeze a tiny bit more performance out of the GPU while running cool and quiet. Kosta Andreadis Kosta is a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit. Similar Content Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}