{
    "title": "Advantech launches first AMD AM5 RYZEN™ embedded 7000 supported \nhigh-performance industrial ATX motherboard",
    "date": "1/16/2024",
    "url": "https://www.pandct.com/news/advantech-launches-first-amd-am5-ryzen-embedded-7000-supported-high-performance-industrial-atx-motherboard/",
    "text": "Stratus webinar - watch now 27/03/2024  Delta Electronics Inc. 27/03/2024  FLIR Systems UK (*Teledyne FLIR) 27/03/2024  Sick (UK) Ltd 16/01/2024  Advantech Europe BV Advantech, a global leader in Industrial IoT, is excited to release its latest high-performance AIMB-723 industrial ATX motherboards with AMD RYZEN™ Embedded 7000 Processors. This is the first industrial-grade motherboard integrated with the AMD B650 chipset, delivering high computing performance with a remarkable 7-year lifespan. It stands out as the first AIMB motherboard to embrace DDR5 UDIMM, as well as provides the scalability to support up to a three-slot discrete GPU card and three additional frame grabber cards for machine vision applications. Support a High-end GPU Card to Realizing AI AOI Powered by Ryzen™ 7000 Series processors, AIMB-723 delivers exceptional performance and minimal power consumption. Through the optimal placement, it accommodates up to a three-slot discrete GPU card and three PCIe add-on cards, unlocking the potential for supporting high-performance demanded industrial tasks, such as AI-based Machine Vision and AOI applications. Its versatility satisfies the requirements of lightning-fast memory, and streamlines data transfer and processing to perfection. “AMD is proud of the collaboration with Advantech to power its new industrial-grade AIMB-723 ATX motherboard with Ryzen Embedded 7000 processors,” said Amey Deosthali, senior director of product marketing, Embedded Processors Group at AMD. “AMD Ryzen Embedded 7000 processors, powered by Zen 4 and RNDA 2 graphics, enable Advantech AIMB-723 to be the ideal platform for a wide range of data-intensive applications in the growing industrial market.” Elevating Industrial Applications at the Edge with abundant I/O and OS supports The AIMB-723 supports a variety of high-speed I/Os incorporation, such as USB 3.2 (Gen 2) 10 Gbps, dual 2.5 Gigabit Ethernet, M.2, and SATA, enhancing the capabilities of industrial applications at the edge. Also, it caters to legacy requirements for PCI expansion and common I/O interfaces, including up to six serial ports (5 x RS-232, 1 x RS-232/422/485) for industrial device control, In addition, AIMB-723 provides compatibility with various operating systems, including Windows® 10 version 21H2 LTSC, Windows® 11 version 22H2 GAC, Windows® Server 2022, and Ubuntu 22.04. Setting up your preferred OS is a breeze, thanks to the comprehensive OS image provided by Advantech, complete with all the essential drivers. AIMB-723 Key Features   ·      AMD Ryzen™ Embedded 7000 Processors with B650 chipset        ·      Four DIMM sockets up to 128 GB DDR5 5200        ·      Triple display DP/HDMI/VGA and dual 2.5 GbE LAN        ·      M.2, SATA RAID 0, 1, 10, and USB 3.2 Gen 2        ·      Optimized PCIe placement for GPU and frame grabber cards installation. AIMB-723 is now available at Advantech. For those seeking an AMD AM5 industrial ATX motherboard solution, this is the definitive choice. Trust the AIMB-723 for a dependable and stable platform, with the added assurance of product longevity support to maintain consistent application specifications. For more information, please contact your local sales support team or visit the Advantech website at www.advantech.com/en-eu. Print this article For more information, please contact:Advantech Europe BVEkkersrijt 5708 Son 5692 ER The NetherlandsTel: 0031 40 2677084Email: andrea.nemeth@advantech.nl Web: https://www.advantech.eu Visit company profile page Login or Register Process and Control Today are not responsible for the content of submitted or externally produced articles and images. Click here to email us about any errors or omissions contained within this article. eNewsletter sign-up View our eNewsletter Archive Sign-up for our weekly eNewsletter Connect with us: Advertise with us | Media pack © Copyright 1999-2024 Process and Control Today LtdRegistered in England No. 3733110 - studio44 "
}