{
    "title": null,
    "date": "2/9/2024",
    "url": "https://digistatement.com/helldivers-2-crashing-on-amd-gpus-is-there-any-fix-yet/",
    "text": "HELLDIVERS 2 crashing on AMD GPUs: Is there any fix yet Arrowhead Game Studio’s latest release, Helldivers 2, has turned out to be the biggest PlayStation release on PC, something no one really expected before. But all’s not well with the game. Helldivers 2’s launch was marred with a plethora of technical issues that continue to be a major source of frustration for many players. While the developers have acknowledged this, there are a ton of issues for which players have been trying to find a fix. And a major one happens to be the Helldivers 2 crashing on AMD GPUs issue. For whatever reason, AMD GPU users are constantly facing crashes with the game. The issue is quite prevalent with players using AMD Radeon 7000 series cards, with many even struggling to get past the tutorial. We can’t really say what’s the main cause behind this. Some think it’s due to runaway frames, while others are of the opinion that the crashing issue is due to high graphics presets. Whatever the cause may be, an issue like this can’t be left unresolved. So, without much further ado, let’s go ahead and find out all the workarounds for this. The developers have acknowledged Helldivers 2 having major problems with AMD Radeon 7000 GPUs. It’s only a matter of time before the issue gets resolved. Until then, you can try the following workarounds. One of the major fixes for this particular issue is to simply turn off Screen-Space Global Illumination and Anti-Aliasing. Just open the in-game Settings menu, switch to Graphics, and scroll down to find these two options. Once you have disabled both options, save your settings and start your play session to see if the issue persists. If it does, switch to another workaround. Some players have suggested turning on V-Sync as a way to deal with this issue. And it’s pretty easy to do that. Just open the in-game settings, switch to Display, scroll down, and right under the Display Mode option, you will find V-Sync. Turn it on, and then save your settings. Players believe the crashes are due to runaway frames, so enabling V-Sync helps mitigate that. This particular workaround, too, is suggested by the players. For this one, basically, all you need to do is open AMD software and disable Anti-Lag along with Radeon Super Resolution. Once you have disabled these two options, launch the game and check if the crash still occurs. When it comes to this workaround, you just need to open the game’s settings, switch to Display, and then scroll down. Right under Resolution, you will find Render Scale. Set it to Balanced, and you are good to go. Players can also try setting their GPU’s Max Frequency to 2500 MHz in order to resolve this issue. For that, you will need to open your AMD Adrenaline, switch to the Performance tab, and then select Tuning from the sub-menu. You will see an EULA just below it. Click on Accept and set the Max Frequency to 2500MHz. Don’t forget to save your changes before exiting. Many players have complained about the past two AMD drivers not being good. Because of that, the 23.11.1 driver is generally referred to as the most stable release. So, what we recommend you do is switch to this particular AMD driver and see if it helps in bypassing this issue. For u/Brichard0625 the only fix for this issue was to simply change the in-game Graphics Preset to either Low or Medium. Make sure that Terrain Quality is set to Low, since that happens to be a major cause of the crashing issues. u/ajjanu2188 fixed this issue by setting the frame limit or FPS limit to 60 FPS in AMD Adrenaline software. Besides that, the players also suggested disabling anti-aliasing. So, if you haven’t tried this, do so. Well, that’s all the workarounds we have for this issue right now. Additionally, if you want to know about the game’s crossplay details, check this out. And for more such content, keep following DigiStatement. Also read: HELLDIVERS 2 GameGuard Error code 1013: How to fix it © 2021 DigiStatement - All Rights Reserved © 2021 DigiStatement - All Rights Reserved "
}