{
    "title": "Don't recycle your old CPU, put it on display instead",
    "date": "2/20/2024",
    "url": "https://www.pcgamesn.com/gaming-hardware/cpu-display-stand",
    "text": "Whether you're sporting an AMD or Intel processor, in addition to their value as performant hardware, don't forget they look good too. Samuel Willetts Published: Feb 20, 2024 It’s often advisable to reuse your old hardware in a new system, be it your CPU or another piece of kit, but sometimes this simply isn’t possible. Whether you’ve broken a mounting pin or there’s some other fault, some processors seem almost destined for the recycling bin. Not all chips need suffer this fate, however, as some might serve you well as a display piece instead. While performance and price are understandably the most important factors when it comes to discussions on the best gaming CPU, seldom a thought is given to their aesthetics – other than the beautiful shots you can get of the silicon dies themselves. While not consequential to a purchasing decision, it’s hard to imagine any member of the Ryzen 7000 series without its trademark jigsaw-like IHS, for istance. Enter these purpose-built display stands designed specifically to show off your spare CPUs, be they from AMD or Intel. They’re made by Japanese manufacturer NBROS, and available from the Yodobashi webstore (thanks, Tom’s Hardware), though clearly you could probably make your own or have something similar 3D printed too. If you’re packing some of the best SSDs and aren’t using them in your PC for some reason, NBROS have another set of stands for solid state drives too. These ones even feature screws for you to mount your storage to save it from any unfortunate knocks. While these stands are somewhat silly, I’d be lying if I said I didn’t want one. Just a few weeks ago, my Intel Core i7 4790K gave up the ghost after almost a decade of service and I would’ve loved to have put it on display instead of throwing it into the electronics recycling bin. The only criticism I have of the whole setup is that I wish they came with a plastic housing to keep away the dust. However, given that Yodobashi is a Japanese retailer… I likely won’t be ordering one anytime soon anyway. Likely. Check out our best gaming CPU guide if you’re after a processor upgrade and give our Ryzen 7 7800X3D review a glance while you’re at it too. Samuel Willetts                 Sam has spent the past two decades tinkering with computers, a tradition he proudly continues as a Hardware Editor for PCGamesN. For all things systems and components, he's your man. You'll regularly find his hands inside a PC, swapping out components from the likes of AMD, Intel, and Nvidia as fast as you can say Windows. Otherwise, you'll find him on the showfloor of CES and Computex, talking the night away about the latest pieces of shiny silicon. You may also know him from outlets such as Custom PC, PC Gamer, Pocket Tactics, T3, and TopTenReviews. "
}