{
    "title": "AMD's Ryzen 9 7950X just scored a new world record for performance",
    "date": "2/8/2024",
    "url": "https://www.wepc.com/news/amds-ryzen-9-7950x-just-scored-a-new-world-record-for-performance/",
    "text": "Home » PC Tech & Gaming News » AMD’s Ryzen 9 7950X just scored a new world record for performance An overclocking world record gets set by an unlikely contender WePC is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more Striving for a world record in hardware overclocking may not be everyone’s hobby of choice, but that’s exactly what one enthusiast has done, with a budget-friendly motherboard no less. Using the former flagship (or non-3D flagship) Ryzen 9 7950X CPU and a B650 motherboard that’s worth just $110. You’d probably expect that all sorts of high-end hardware is required to set an overclocking world record, but it looks like even a cheap motherboard can get the job done. HWBot, a site that is all about overclocking, even hosting competitions, has a new world record in performance for a 16-core CPU and indeed the best score ever recorded for the 7950X. User SaltyCroissant on HWBot is the proud owner of this new world record, for however long it stands. They have recorded a score of 306,686 MIPS (millions of instructions per second) on the high-end AMD CPU, and it’s not like they have other premium hardware to back it up. With the help of some liquid nitrogen cooling for a max core temperature of -49°C, they boosted the 16-core CPU higher than ever before to achieve this world record. Reaching a clock speed of 6.8GHz against the usual boost clock speed of 5.7GHz. The interesting part for us that they did it with a $110 B650 motherboard, specifically the B650M-HDV/M.2. Plenty of comments came through to congratulate their efforts, even one wondering if this is the best ever performance per dollar extracted from a motherboard. As this new world record shows, this processor is definitely a suitable choice if you want excellent overclocking performance. Unlike the flagship 7950X3D, you aren’t limited in terms of overclock. Due the stacked V-Cache design of the 3D model, you can not manually overclock it like you can with the 7950X. It does offer some performance boosts via the included PBO and Curve Optimizer with constitutes as automatic overclocking, but not to the same level as you can push other CPUs. If you want to learn all about overclocking your CPU, then be sure to check our how to overclock your CPU guide for the ins and outs of the process. Maybe you can even set a new world record in future, with the right equipment and technique – you don’t even need a high-end mobo! Cores 16 Threads 32 Base Speed 4.5GHz Boost Speed 5.7GHz Cache 64MB Socket AM5 As a Junior Staff Writer, Jack is involved in writing and maintaining a bunch of hardware guides & reviews. With an interest in PC gaming, he now focuses on writing about monitors, headsets, and more. Trusted Source WePC’s mission is to be the most trusted site in tech. Our editorial content is 100% independent and we put every product we review through a rigorous testing process before telling you exactly what we think. We won’t recommend anything we wouldn’t use ourselves. Read more Best CPU cooler for AMD Ryzen 9 7950X in 2024 – our top AIO picks for 7950X This LG ultrawide monitor deal may be the best price drop we’ve seen all month Cheapest MSI Claw can perform even better than the high-spec Ultra 7 model Where to buy MSI Claw – US, Canada, UK & pre order details The Warehouse, Use Space, Paddock St, Manchester M12 6PN WePC is the essential site for serious PC gamers. We offer everything from high end PC custom builds and advice to the latest hardware and component reviews, as well as the latest breaking gaming news. You take your gaming PC seriously. So do we. WePC. ©2024 WePC. All rights reserved. Part of "
}