{
    "title": "AMD Zen 5: The next generation of processors arrives in 2024",
    "date": "2/1/2024",
    "url": "https://www.igorslab.de/en/amd-zen-5-the-next-generation-of-processors-arrives-in-2024/",
    "text": "AMD’s Zen 5 architecture will serve as the foundation for the red team’s next generation of CPU families, ranging from client PCs to high-performance data centers. During AMD’s quarterly earnings call in Q4 2023, CEO Dr. Lisa Su confirmed that Zen 5 will launch in the second half of 2024, again representing a significant step forward. On the client side, AMD has reiterated that its AI PC segment will introduce new products such as Strix Point, the successor to its Ryzen 8040 “Hawk Point” APUs, in the second half of 2024. The company also announced that the first notebooks with these next-generation APUs will be launched later this year, using the Zen 5 core architecture and an optimized GPU architecture called RDNA 3.5. These chips are said to offer a threefold improvement in AI-NPU performance with the improved Ryzen AI “XDNA 2” engine. In addition to the launch of Zen 5 for notebooks, AMD is also planning the launch of Zen 5 for desktops. This will take the form of the next generation of Granite Ridge CPUs, which will replace the Zen 4-based Raphael chips. The new CPUs are expected to offer a significant performance boost on existing and newer AM5 platforms. Strix combines our next-gen, Zen 5 core with enhanced RDNA graphics and an updated Ryzen AI engine to significantly increase the performance, energy efficiency and AI capabilities of PCs. Customer momentum for Strix is strong with the first notebooks on track to launch later this year. Looking at 2024, we are planning for the PC TAM to grow modestly year-on-year, weighted towards the second half as AI PCs ramp. We continue to see strong growth opportunities for our client business as we ramp our current products, extend our AIPC leadership and launch our next wave of Zen 5 CPUs. Lisa Su – AMD CEO (Q4 2023 Earnings Call) It was also confirmed that Turin, the successor to Genoa, will be introduced as a plug-and-play replacement for 4th Gen EPYC platforms. The Turin CPUs will offer a higher number of cores and radical memory expansion capabilities. The Zen 5 core will deliver leading performance per watt across a wide range of workloads. The 5th generation Turin CPUs from EPYC are expected to offer up to 128 cores in the standard Zen 5 version and up to 192 cores in the Zen 5C variants. These CPUs will represent a significant upgrade and will compete directly with the Intel Xeon Granite Rapids P-Core and Sierra Forest E-Core families, which are also due to be launched in the second half of 2024. Looking ahead, customer excitement for our upcoming Turin family of EPYC Processors is very strong. Turin is a drop-in replacement for existing 4th Gen EPYC platforms that extends our performance, efficiency and TCO leadership with the addition of our next-gen Zen 5 core, new memory expansion capabilities and higher core counts. Internal and end customer validation work is progressing to plan with Turin on track to deliver overall performance leadership, as well as leadership on a per core or per watt basis across a wide range of workloads when it launches later this year. And then, we also see Turin, our Zen 5 product coming in the second half of the year. So, even in a mixed demand environment, I think we’re bullish on what traditional server CPUs can do in 2024. And as we go into Turin, we’re deep in the design in-cycle for Zen 5 and Turin and we feel very good about how we’re positioned. Lisa Su – AMD CEO (Q4 2023 Earnings Call) AMD plans to introduce more products based on its Zen 5 “Nirvana” and Zen 5C “Prometheus” cores in 2025. These three families are just the tip of the iceberg. Source: SeekingAlpha Zeige alle Kommentare an Kommentar Lade neue Kommentare Danke für die Info!\nDie Fragen : Diesmal Bios( Agesa) gleich auf mit der Zen-5. Auslieferungstag. first is first?\nKaufpreis normal. oder koschten dann Boards ab 899,- ( MSI GUUDLAIK = 600 Euro druff.\nda kannst dir nen guten 3d Drucker kaufen und die Blenden\nselber entwerfen und dein MSI SCHÖN-LICH bauen. muss man ja net verstehn.)\nEig kannst nach Malta fliegen baden gehn und der Vor ort experte macht das und du hast Urlaub und die Teile..lol\nWIRD ES 24 CORE CPUS geben? ( Nain.. solche ketzerischen syndigen Gedanken)\nHeizen die dann amtlich ab 220 Watt ( weil enger und am LImit)??\n( AMD: ähh. nain. rendern ist out wir kaben hippe ki intern die kann alles .. lol) Und wenn es passt, dann sind ja die 65 Watt CPUS die Renner. Ein unverbastelter 8 Core wh bei 24.000 cb 2023.. \nund wenn der ab 249,90,- kostet und gutes Board drunter 145-190, dann geht wieder was. Aber. Wie mein TV-gerät schon meldet : \nALLES ORANGE call your technical man.. technical shut down \n( ein komischer Typ mit komischer Frisur hat das Gerät erledigt..lol) Peace :) Ps: 13900k bis 282 watt geboltz. dann hat er sich verbogen. der Rest is klar. lol ( mikro Steak Platte) Antwort\n Gefällt mir Alle Kommentare lesen unter igor´sLAB Community → Wir verwenden Technologien wie Cookies, um Geräteinformationen zu speichern und/oder darauf zuzugreifen. Wir tun dies, um das Surferlebnis zu verbessern und um personalisierte Werbung anzuzeigen. Wenn Sie diesen Technologien zustimmen, können wir Daten wie das Surfverhalten oder eindeutige IDs auf dieser Website verarbeiten. Wenn Sie Ihre Zustimmung nicht erteilen oder zurückziehen, können bestimmte Funktionen beeinträchtigt werden. "
}