{
    "title": "Ryzen 7 8700 GE Can Rival The Ryzen 7 8700G At 50% of The Power",
    "date": "2/24/2024",
    "url": "https://tech4gamers.com/ryzen-8700-ge-35w-tdp/",
    "text": "Only 23% Difference In GPU Performance Despite The Large Power Gap! German YouTuber GucksTV has tested an engineering sample of the Ryzen 7 8700GE that was leaked. Tests show that even with the 50% drop in maximum TDP, the unannounced chip only shows a 23% decrease in GPU performance. The AMD Ryzen 7 8700G is itself no slouch, performing well in light modern titles like Fortnite. However, it can run at 65 watts, while the Ryzen 7 8700GE is designed for lower-power devices and has a maximum TDP of only 35 watts. With its 8 Zen 4 cores and 12 RDNA 3 cores, the Ryzen 7 8700GE performed exceptionally well in several tests, making it a great option for small builds. In terms of performance, the 65-watt processor scored 17,430 on the Cinebench R23 test, compared to 14,600 on the more power-efficient chip. To achieve this score, the Ryzen 7 8700GE pulled only 40 watts. Meanwhile, the more power-hungry counterpart peaked at over 88 watts. This is an incredible accomplishment since it equates to 84% of the performance at less than half the power consumption. When it comes to GPU performance, the RDNA 3-based 780M in the Ryzen 7 8700GE produces good outcomes as expected. It uses less than half the power and achieves 2,694 points in the 3DMark Time Spy test, which is around 18% lower than the Ryzen 7 8700G’s 3,303 score. A number of GPU benchmarks conducted by GucksTV show that the Ryzen 7 8700GE and the Ryzen Z1 Extreme have a lot of similarities, including the utilization of the same 35-watt TDP and 12 RDNA 3 Compute Unit iGPU design. This implies that an entry-level Ryzen 8700GE-only PC system should still prove to be very feasible for desktop use and light-to-moderate gaming. [News Reporter] Malik Usman is student of Computer Science focused on using his knowledge to produce detailed and informative articles covering the latest findings from the tech industry. His expertise allows him to cover subjects like processors, graphics cards, and more. In addition to the latest hardware, Malik can be found writing about the gaming industry from time to time. He is fond of games like God of War, and his work has been mentioned on websites like Whatculture, VG247, IGN, and Eurogamer. Subscribe to our newsletter Check your inbox or spam folder to confirm your subscription.  Subscribe to our newsletter Check your inbox or spam folder to confirm your subscription.  "
}