{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.notebookcheck.net/Chinese-Loongson-3A6000-CPU-delivers-integer-IPC-close-to-AMD-Zen-4-and-Intel-Raptor-Lake.802776.0.html",
    "text": "Even though the Chinese Loongson 3A6000 CPU lacks the raw performance to compete with the high-end processors from Intel and AMD, it's showing promising IPC benchmark performance. According to a test run by a Chinese tech reviewer named Geekerwan, the China-made processor can match the integer IPC (instructions per cycle) performance of Zen 4 and Raptor Lake architectures. For a fair comparison of benchmark results with Intel and AMD processors, the reviewer clocked all the CPUs to 2.5 GHz as the Chinese processor maxes out at this clock speed. With this configuration, the Loongson 3A6000 CPU had an integer IPC measurement of 4.8, while the Raptor Lake and Zen 4 had 4.9 and 5.0, respectively. As for the floating point (FP) performance, the Chinese-made Loongson 3A6000 processor needs a lot of catching up to do. It got an FP IPC measurement of 6.0 on the SPEC 2017 CPU benchmarking tool. To compare, the Zen 4 Ryzen 9 7950X (curr. $514.50 on Amazon) got 7.1, and the Intel Raptor Lake Core i9-14900K (curr. $546.02 on Amazon) got 7.8. One thing that became a bit obvious in the later benchmarks is that the Chinese Loongson 3A6000 CPU is being held back for lower cores and slower clock speeds. But it's pretty evident that the processor is a much-improved successor of the 3A5000. The newer chip offers a 46% jump in integer IPC and a 64% boost in floating point IPC. It's worth noting that IPC primarily evaluates the architecture's performance, and it's notoriously difficult to improve. But the boost seen in the Loongson 3A6000 is promising, and the next-gen 3A7000 could be even better with more cores and higher clock speed. Check out the video attached below if you want to learn more about the new China-made CPU and see how it performs in other benchmark tools. Geekerwan (video embedded above) via: Tom's Hardware, TechPowerUp "
}