{
    "title": "AMD FSR 3 is now officially in Starfield, so let that frame rate fly",
    "date": "2/21/2024",
    "url": "https://www.pcgamesn.com/starfield/amd-fsr-3-live",
    "text": "It's been a long time coming, especially as an AMD partner game, but FSR 3 and XeSS have both become widely available in the lastest Starfield update. Niall Walsh Published: Feb 21, 2024 The AMD FSR 3 Starfield update is finally live in-game, and it also brings Intel’s XeSS as an added bonus. Despite being an AMD partner game, its most advanced frame generation and upscaling tech had been absent from the Bethesda space opera until it was added to the most recent Steam beta. While Starfield has struggled to gain a reputation as one of the best RPGs on PC, it has plenty of time to change opinions with strong post-launch support, and the addition of AMD FSR 3 will go a long way to wooing some PC players. Even with the best Starfield settings, some gaming laptops and PCs just aren’t capable of getting desirable returns. AMD’s upscaling and frame generation technology can start to turn this around, though, as DLSS has done for Nvidia RTX owners. Frame generation is locked to Radeon RX 5000 series or later graphics cards, while AMD recommends it is best used on Radeon RX 6000 series cards and above. FSR 3 is also brand agnostic, meaning you can also use it if you have an Nvidia RTX 20 series, although it is recommended for RTX 30 series and above. The upscaling aspect of FSR 3 is compatible with far more graphics cards, including the Radeon RX 590 and GeForce GTX 10 series, and anything more recent. We’ll likely see fresh benchmarks and comparisons trickle out so that there is a definitive line on which tech is the best to use. AMD did suffer a slight setback recently with the newly released early access title Nightingale removing FSR 3 right before launch due to crash reports in stress tests. The best PC games ever made are often remembered for how easy they were to get running on gaming laptops and PCs. Upscaling tech has become a big part of game performance but if you still need tech like DLSS explained in simple terms, we’ve got you covered. Niall Walsh                 As one of PCGN’s Hardware Editors, Niall is an expert in all things peripherals, meaning if you need to know what the best PC gaming headsets, controllers, keyboards, mice, or monitors are, he has you covered. Even if you just want to know which peripheral brand is better, Razer, Corsair, Logitech, or any other he can help there too. You will also find his words on sites such as; The Loadout, Wargamer, USA Today, MTG Rocks, GGRecon, and RealSport101. "
}