{
    "title": "Microsoft is working on its own DLSS-like upscaler for Windows 11",
    "date": "2/12/2024",
    "url": "https://www.theverge.com/2024/2/12/24070426/microsoft-windows-11-dlss-ai-super-resolution-feature",
    "text": "By  Tom Warren, a senior editor covering Microsoft, PC gaming, console, and tech. He founded WinRumors, a site dedicated to Microsoft news, before joining The Verge in 2012. Microsoft appears to be readying its own DLSS-like AI upscaling feature for PC games. X user PhantomOcean3 discovered the feature inside the latest test versions of Windows 11 over the weekend, with Microsoft describing its automatic super resolution as a way to “use AI to make supported games play more smoothly with enhanced details.” That sounds a lot like Nvidia’s Deep Learning Super Sampling (DLSS) technology, which uses AI to upscale games and improve frame rates and image quality. AMD and Intel also offer their own variants, with FSR and XeSS both growing in popularity in recent PC game releases. Microsoft has not yet officially announced this new super resolution feature, so it’s not clear exactly how it will work, nor if it will require any specific hardware. Nvidia’s DLSS leverages the tensor cores that ship on its RTX range of graphics cards, whereas AMD’s FSR and Intel’s XeSS both run on rival GPUs, too. Microsoft is also working on an improved color management feature for Windows 11, which will be particularly useful for the latest round of OLED monitors that make use of HDR. Windows has lacked a good OS-level color management system for years, leaving PC gamers having to add custom color profiles in a dialog box that looks like it shipped in Windows 95. With the upcoming changes, color management will be integrated into the main display settings area of Windows 11, allowing PC users to set color profiles for sRGB and DCI-P3. There’s also a new feature that will automatically control these various color profiles. “Auto color management makes sure your apps and other content have accurate colors on this display,” says Microsoft about this color management feature. It’s not clear if this will let Windows 11 users easily change gamma curves, though. Hopefully this means Microsoft is investing more in HDR support on Windows, which can lead to a washed out desktop experience if enabled system wide. Update, February 12th 7:45AM ET: Article updated to clarify FSR and XeSS availability. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}