{
    "title": "Nvidia shares skyrocket as they take on Huawei in China",
    "date": "2/3/2024",
    "url": "https://www.notebookcheck.net/Nvidia-shares-skyrocket-as-they-take-on-Huawei-in-China.799873.0.html",
    "text": "Nvidia Corp experienced an unprecedented surge in market value in January, adding a record $296.52 billion to reach a total market value of around $1.52tn. The achievement surpasses the company's earlier record surge of $248.23bn, attained in May 2023. The graphics processing unit (GPU) pioneer attributed the climb to its new desktop graphics processors, artificial intelligence (AI)-related items, and elevated optimism. Microsoft, the world's current leader in market capitalization, also experienced significant gains of $159.36 billion, primarily attributed to the increasing demand for its Azure cloud computing service. Conversely, Tesla Inc. emerged as the weakest performer among the top 20 global companies by market cap, losing approximately 24.5% of its value due to concerns about slowing growth. Meanwhile, sources within the industry indicate that newly adapted chips destined for China from Nvidia would go head to head with a processor developed by China's Huawei Technologies. According to insiders, the HA20 is another powerful graphics processing unit (GPU) that will go to artificial intelligence (AI) training customers based in China. Nvidia took pre-orders for the product, with the price for a single card ranging between $12,000 and $15,000, according to industry sources that preferred anonymity due to the issue's sensitivity. In comparison, the computing capacities of the Huawei Ascend 910B AI chip that marks direct competition with Nvidia's HA20 are said to be similar. The two chips are also believed to have a comparable price. The Lenovo Legion Pro 5i 16\" Gaming Laptop, powered by the powerful GeForce RTX 4070 graphics processor, offers a glimpse into the world of high-performance Nvidia chips at a discounted price of $1806.9 on Amazon, marking a 20% savings. Reuters, South China Morning Post "
}