{
    "title": "AMD's Ryzen 7 8840U \"Hawk Point\" APU outperforms Steam Deck's \"Van Gogh\" \nAPU at 10 watts, acccording to early ...",
    "date": "2/19/2024",
    "url": "https://www.notebookcheck.net/AMD-s-Ryzen-7-8840U-Hawk-Point-APU-outperforms-Steam-Deck-s-Van-Gogh-APU-at-10-watts-acccording-to-early-benchmarks.804894.0.html",
    "text": "In the realm of mobile computing, AMD has introduced its latest Ryzen 8000 series codenamed \"Hawk Point\", marking a significant advancement in the field. These 'HawkPoint\" APUs, despite having similar core and clock configurations as their predecessor \"Phoenix Point\", promise notable improvements, particularly in AI performance, thanks to the upgraded XDNA processor. Initial evaluations by tech reviewer Cary Golomb suggest promising performance from the Ryzen 8000 series, with the Ryzen 7 8840U performing better than its predecessors and even outperforming the Van Gogh series at 10 watts. In Batman Arkham Knight, the \"Hawk Point\" APU handily outperforms the 7840U (codenamed \"Phoenix Point\") and even dethroned Steam Deck's \"Van Gogh\" APU at 10 Watts. Such findings hint at potentially significant improvements in low-power operations compared to previous generations. The Ryzen 8000 series has already begun shipping to reviewers, with several companies already announcing upgrades to their product lines. Noteworthy players like GPD and Minisforum are planning to integrate the Ryzen 7 8840U SKU into their offerings, with Minisofrum working on an AMD-based tablet and GPD upgrading Win Max 2 to the 8840U from the 7840U.In addition to the Ryzen 8000 series, AMD also offers the Ryzen Z1 series, tailored specifically for gaming handhelds. The Ryzen Z1 Extreme variant, similar to the previous Ryzen 7 7840U but with adjusted TDP settings and sans the XDNA processor, aims to optimize the gaming experience with a focus on low-power operation. Purchase the AYANEO AIR Pro on Amazon Cary Golomb via Twitter "
}