{
    "title": null,
    "date": "2/11/2024",
    "url": "https://www.digitaltrends.com/computing/fsr-3-compromise-isnt-working/",
    "text": "AMD made a compromise with FSR 3. The frame-generation tech was announced in November 2022, and it took nearly a year for it to show up in a game. Even now, months after release, FSR 3 is only available in 12 games, the lion’s share of which are legacy titles and single-player games that are past their prime. Adoption wasn’t working, hence the need for a compromise. The compromise is AMD Fluid Motion Frames, or AFMF — one of the least catchy acronyms, but I digress. This is driver-based frame generation. FSR 3 isn’t available in a ton of games, but AFMF sidesteps that hurdle, so long as you have an AMD graphics card. You can use frame generation through the driver in basically any DirectX 11 or DirectX 12 game. Sounds pretty sweet. The problem is that AFMF isn’t very good. The experience ranges from slightly better than playing the game natively to downright worse. As the only way forward for AMD’s frame-generation tech, it’s a troubling sign. AMD is adamant that AFMF is not FSR 3. That’s a statement I agree with, but it’s easy to see why AFMF and FSR 3 always come up in the same conversation. Both provide frame generation, or more accurately, frame interpolation. They work in the same way; your graphics card renders two frames and compares them, and then it calculates a frame in between based on the difference between them. The critical difference is that FSR 3 does this in the game engine as part of the rendering pipeline while AFMF does it after the rendering is already done. That difference is why AFMF can be installed as a driver after the fact. The game engine advantage is a big deal for image quality. As part of the rendering pipeline, FSR 3 can access details like motion vectors from the game, allowing it to more accurately generate a frame. It can also carve out elements like the UI and menus, which are particular pain points for frame-generation tech. AFMF can’t do that. It takes the final frame you see, UI and all. AFMF has shockingly good quality considering how it works, but you can still spot some artifacts that aren’t present with FSR 3. AMD recognizes that AFMF isn’t perfect, so instead of just letting it run, AFMF automatically turns off whenever there’s too big of a difference between two frames, particularly in fast motion. There are some artifacts on menus and the like, but the real killer for AFMF is the dynamic way in which it works. AFMF had a somewhat jittery response during most gameplay. I tested four games, and out of that batch, AFMF provided a worse experience in three of them. The only exception is Like a Dragon: Infinite Wealth, and that’s mainly due to the fact that it’s a turn-based game. For the other three, I would rather play these games natively with lower smoothness than turn AFMF on. The reason why is simple: The peaks and valleys of AFMF are too noticeable. In most of the games I tested, I was hovering between 70 frames per second (fps) and 90 fps with upscaling turned on at 4K. The pacing between each frame was relatively consistent, and when it rose and fell, there was a smooth ride down or up. That’s wasn’t the case with AFMF. Any time there was too much of a difference between two frames, AFMF turned off, leading to a jarring experience where it never felt like the game is smooth. If you walk in a straight line slowly, it looks smooth. But during any sort of real gameplay, you’re oscillating between a high frame rate and a low one. A consistent, relatively low frame rate will feel smoother than one that’s jumping from high to low constantly. That was certainly my experience, with a somewhat jittery response during most gameplay. Even with the frame rate counter showing a higher number, the game didn’t feel as smooth. The best way to demonstrate that is a frame time graph, which you can see above in Like a Dragon: Infinite Wealth. These tests were run with a Ryzen 9 7950X and an RX 7800 XT. I have a handful of these charts, so it’s worth explaining what they show. This is the time between each frame, with a sample taken every quarter of a second over the course of a few minutes. Higher frame time means lower frame rate, but that’s not what’s important with these charts. We’re looking at consistency. Ideally, you want your frame time to be as close to a flat line as possible. That leads to a smoother experience, as the time between each frame is similar. That’s not what you see in Like a Dragon: Infinite Wealth. With AFMF off, there was some variation as I ran around the streets of Hawaii and tussled with a few baddies, but everything is in close proximity. AFMF, on the other hand, spiked every time I moved the camera. Finally, FSR 3 managed to lower the frame time (and improve the frame rate), showing a similar level of consistency as the results with AFMF turned off. There’s your proof — AFMF is certainly not FSR 3. I didn’t do anything special for these tests. I played three to five minutes of the game, loading the same save file and running around the same area. It’s worth noting that this is specifically not a benchmark run. It’s supposed to mimic real gameplay, so you can forgive some level of variation. For example, you can see a couple of spikes in both the AFMF off and FSR 3 results where the frame rate briefly dipped in Like a Dragon: Infinite Wealth. We’re looking at the overall trend, not any individual spike. I need to establish that before showing you the Starfield chart you can see above. There are a lot of squiggly lines here, so let’s take them one by one. With both FSR 3 and AFMF turned off, you can see some variation. Those brief spikes you see — where the frame time shoots straight up — is caused by a stutter. There are also some rounder peaks and valleys, as this chart represents a portion of combat where the frame rate wasn’t completely stable. With AFMF on, you see similar problems. There are large spikes indicating a stutter, as well as peaks and valleys in frame time, but it’s the overall trend that’s a problem here. The frame time is all over the place in a dynamic combat scene, jerking back and forth between a high and low frame time relentlessly. As mentioned, these aren’t 100% identical benchmark runs, so you see some areas where AFMF on has a higher frame time than AFMF off. That’s not an issue with the tech, but rather some variance in each of these runs. The point isn’t to single out a portion of this chart and compare the three results — the goal here is show the overall trend of frame time. Starfield and Like a Dragon: Infinite Wealth both support FSR 3, so you can (and should) just use that feature rather than AFMF. The driver-based frame generation is there for everything else, but unfortunately, other games show the same problems that we can see in FSR 3 games. Star Wars Jedi: Survivor is a good example of how that hurts the experience. In stark contrast to Starfield, I didn’t get into any combat in this run, but chose a short, linear platforming section through the Shattered Moon. With AFMF off, the frame time is fairly stable, but with it on, you can see some clear spikes throughout the two-minute run. It’s a lot better than Starfield, but the majority of this test was just my character running in a straight line with an occasional jump or zipline. It’s a great example of how even under ideal circumstances for AFMF, the feature still has limitations. For a more realistic gameplay experience, look at Returnal. This game has a relatively wide camera in combat, so it’s not as jittery as Starfield with its first-person perspective. Still, there’s a ton of variation with AFMF turned on. For all of these runs, I wasn’t just standing still and whipping the camera around — I was playing the game, reacting as anyone would when playing it. This batch of testing exposed how great FSR 3 really is. It’s not quite as high quality as Nvidia’s DLSS 3, but it’s close enough. Add on top the fact that you can use FSR 3 with virtually any GPU — and devices like the Steam Deck and ROG Ally — and there’s an argument that it’s even better than DLSS 3 in certain aspects. It’s just not available in enough games. Since October of last year, FSR 3 has only made its way into 12 games. Only three of those games are heavy hitters — Call of Duty Modern Warfare III, Farming Simulator 22, and as of a few days ago, Starfield. I wrote about this exact issue four months ago, and the situation has barely improved since then. For context, in the same four-month period from release, DLSS 3 showed up in 25 games, the bulk of which were new titles like Atomic Heart, Warhammer 40K: Darktide, Need for Speed Unbound, and Spider-Man: Miles Morales. There’s no doubt Nvidia has a big head start for DLSS 3 support, but FSR 3 is still lagging far behind in adoption rate. AFMF isn’t good enough to fill those gaps. In writing this article, I’ve seen half a dozen little tips and tricks users have found in using AFMF, such as adding a frame rate cap to eliminate tearing, and that’s great. I like that the feature exists and that users can mess around with it to see if it improves their gameplay experience, because in some cases, it actually does. It’s just not a solution for games lacking FSR 3 support. AFMF needs some big improvements before it can live up to its promise. To AMD’s credit, it’s not shouting from the rooftops about AFMF, and it’s certainly not saying AFMF is a replacement for FSR 3. It’s easy to see where you could make that assumption, though. AFMF and FSR 3 are always in the same conversation, and headlines talking about boosting performance in “most PC games” have already made the rounds. Even with seemingly good intentions, AFMF looks like a solution for games that lack FSR 3 support when it’s clearly not. AFMF needs some big improvements before it can truly fill in the games that FSR 3 misses, but given the driver-based approach of the tech, I’m not sure how much further it can go. It’s a very interesting feature that I’d love to see mature, theoretically providing a performance boost in just about any game you can throw at it. I just wish it came after we already had a wide swath of games that support FSR 3 because AFMF is clearly much worse right now. As it stands now, FSR 3 is only available in a small number of titles, the majority of which have very low player counts. And in place of proper FSR 3 support is AFMF, which does very little in most games to improve the experience. If AMD can fix up AFMF, I’ll be the first to cheer them on. But as of now, it has a long way to go. \"That's just too dim.\" It's the same feedback I always get when reviewing OLED gaming monitors, which have made waves throughout this year. The criticism puts a damper on the otherwise jaw-dropping color and perfect contrast. The brightness measurements certainly seem to affirm that suspicion, showing they sometimes provide more than half as much brightness of a traditional LCD display. But are they really too dim? \"Frames win games.\" That's been Nvidia's marketing campaign targeted at esports players since the introduction of Nvidia Reflex. It's a great slogan, catchy with the right amount of truth, and the perfect pairing for Nvidia's RTX technologies. In a new era of generated frames, though, it requires a bit of context. Nvidia's DLSS 3 generates frames on RTX 40-series graphics cards, massively improving your performance. The trade-off, however, is an increase in latency, which hasn't been a big deal up to this point. In games like Ratchet and Clank: Rift Apart and Cyberpunk 2077, you don't need to worry about gaining a competitive edge. But now, we're seeing DLSS 3 for the first time in a competitive shooter: Call of Duty Modern Warfare 3. Originally, the game only included DLSS 3 in the single-player campaign, but after a few days, it was patched into all game modes, including Zombies and multiplayer. The era of high-end desktops (HEDT) disappeared a few years ago. Intel's long-abandoned X-series processors dried up, and AMD relegated its Threadripper CPUs to the enterprise market, leaving enthusiasts with cash to burn to settle for flagships instead of HEDT. That is, until now. AMD's Threadripper 7000 CPUs are bringing HEDT back, making even the best processors look puny in comparison. After taking a generation off, AMD is reviving Threadripper for consumer desktops. That fact alone makes these CPUs important -- even you ignore the obscene performance numbers they put up. AMD has now carved out a performance class that it can call its own, straddling the line between flagship consumer chips and data center CPUs where Intel doesn't have any options. Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}