{
    "title": null,
    "date": "2/5/2024",
    "url": "https://www.notebookcheck.net/2-6-billion-for-controversial-CCS-project-European-companies-to-store-CO2-in-the-North-Sea.800503.0.html",
    "text": "A Norwegian project to create a European carbon capture and storage (CCS) network will cost $2.6 billion (27 billion-krone). The 'Longship' project on the Norwegian island of Blomoyna is part of an effort to reduce industrial pollution. The aim is to pump CO2 from industries such as the cement, fertiliser and steel industries into a pristine saline groundwater reservoir located deep below the seabed. The experimental project is also being supported by the German government and the European Union. But the expensive process can only capture a tiny fraction of the carbon dioxide that is partially responsible for global warming. Rather than trying to stop CO2 from being produced in the first place, several companies hope to find a simpler way. Offshore storage in the North Sea is inherently more costly than onshore. The solutions currently under discussion pose a threat of making the technology prohibitively expensive. - Jens Burchardt, a Berlin-based partner with Boston Consulting Group It is an experiment because it is not yet clear how carbon dioxide can be safely transported across national borders and then buried in the sea. The complex technology requires the pollutant to be compressed, dried and either liquefied and loaded onto a ship or piped to a storage facility linked to producers across Europe. Northern Lights is responsible for developing and operating the project's CO2 transport and storage facilities, along with other companies. International trading of industrial emissions is due to start next year. In the Longship project, the European Union is proposing to capture up to 450 million tonnes of CO2 per year by 2050 in order to meet its climate targets. However, this is unrealistic due to a number of challenges, and in the case of Germany, the project could only save 1% of German emissions, not even taking into account the combustion processes of the oil and gas industry. German Vice-Chancellor Robert Habeck visited the Brevik plant last year and said: In my view, I would rather have CO2 in the earth, than in the atmosphere. Bloomberg | Northern Lights "
}