{
    "title": "What is Windows on Arm? Everything you need to know",
    "date": "2/25/2024",
    "url": "https://www.androidauthority.com/windows-on-arm-explained-3100713/",
    "text": "Affiliate links on Android Authority may earn us a commission. Learn more. If you’re in the market for a new laptop or tablet you may have come across several options that fall under the Windows on Arm ecosystem. What’s Arm, you ask? Simply put, it’s the processor architecture that powers many portable electronics, including your smartphone. So far, Arm has yet to break into the desktop PC space. While smartphones have almost always used Arm-based processors, desktops and laptops have instead relied on the x86 architecture. That has started to change of late, though, thanks to Arm’s many advantages that make it a better fit for portable devices. We’ve already seen proof of this with Apple’s custom Arm-based chips for the Mac line since 2020. Not to be left behind, Microsoft also offers Windows on Arm to support Arm-based hardware. The winds of change are certainly heading in Arm’s direction but why is this suddenly preferable to traditional AMD- and Intel-powered laptops? Windows on Arm refers to Microsoft’s Windows OS running on computers powered by Arm processors, as opposed to the dominant x86 chips offered by Intel and AMD. The platform started out bringing Windows 10 to Arm-powered laptops and tablets all the way back in 2017 but has since been updated to run Windows 11 as well. Compared to a traditional Windows laptop, Windows on Arm promises superior battery life that lasts more than one day, always-online internet connectivity via 4G or 5G, super-fast boot times, and chipset-level support for security features like Windows Hello. However, there are also some platform caveats, including a lack of gaming support, the occasional driver issue, and software emulation that doesn’t quite cover everything you might need. But more on that in the following sections. Currently, Qualcomm is the only system-on-a-chip (SoC) vendor selling Windows on Arm chipsets. These fall under its Snapdragon 7c, 8c, and 8cx portfolios, which have been picked up by a range of manufacturers. Microsoft’s processors found in its Surface Pro X are essentially slightly tweaked versions of Qualcomm’s Snapdragon 8cx lineup as well. Qualcomm is rumored to have an exclusivity deal with Microsoft in exchange for co-developing a lot of the underlying software that allows Windows applications to run on Arm-based processors. While we’d like to see healthy competition in this space, Qualcomm is the only chip maker that has invested significant resources into developing desktop Arm processors. In late 2023, the company announced its first custom “Oryon” CPU cores and the Snapdragon X Elite chip. When it comes to the Windows experience, Windows on Arm is functionally the same as traditional Windows 10 and now Windows 11. This is, thankfully, not a return to the ill-fated Windows RT days, which was a limited version of Windows 8 ported to Arm that offered a miserably small app ecosystem. With Windows on Arm, you can run (virtually) all your favorite apps. Although an increasing number are specifically built for the platform, you can also emulate x86 applications. We’ll dive a little deeper into the implications of software emulation in the following section. If the software experience is identical, then there must be a reason to put all this effort into moving from x86 to Arm? Of course, there are quite a few good reasons. One of the key benefits of the Arm architecture over x86/x64 chips developed by AMD and Intel is power consumption. This has major implications for consumer products, from longer battery life to thinner and fan-less designs. Arm-based processors have also come on leaps and bounds in terms of performance. Apple’s 2020 M1 chip can rival the performance of some mid-tier x86 CPUs even today while consuming just a fraction of the power. We haven’t seen Arm’s Cortex CPUs hit these performance highs yet, so don’t expect bleeding-edge performance from Windows on Arm, but Qualcomm purchased CPU designer Nuvia with the explicit purpose of building more powerful custom CPUs. The Snapdragon X Elite is the first chip to have benefitted from this purchase, and it seems promising based on our benchmarks. The move to Arm-based processors isn’t just about CPU power, it’s also linked to the growing gap between traditional CPUs and SoCs as more expansive platforms. Qualcomm, for instance, bundles graphics, modem, machine learning, image processing, sensor hub, and security technologies into its Snapdragon platform. Likewise, Apple has its own equivalent technologies packed into its M3 chip that powers the latest MacBook line. By comparison, Intel only includes a CPU, integrated graphics, and some security enclave features in its chipsets. So they’re still more focused on the traditional workhorse paradigm rather than the all-inclusive approach we’ve come to associate with Arm SoCs. Intel and AMD processors still require additional external components in order to embrace broader and newer use cases, such as Wi-Fi 6E and 5G networking. In other words, Arm-based SoCs are complete integrated solutions that offer many benefits beyond simple performance and energy efficiency. The core Windows on Arm experiences, such as the Start Menu and File Explorer, are all compiled for and run natively on Arm chips, ensuring maximum performance. That is to say, they run directly on the processor with no need for translation, emulation, or any other middle layer, just like they do on an x86 PC. Windows also supports native applications compelled to run specifically on Arm hardware. The list of native apps is continually growing and now includes Microsoft Edge, Firefox, Adobe Photoshop, Netflix, VLC, and Zoom, to name but a few. With the introduction of Windows 11 and enhanced 64-bit support, Microsoft now has two avenues to help developers build apps for its platform. The first is fully native (ARM64 ABI) where the entire codebase is compiled for Arm. The second is partially native (ARM64EC ABI), whereby part of the code is built for Arm while parts that currently don’t have working Arm dependencies or plugins run in emulation. The latter option is designed to help developers migrate and improve the performance of their apps, even if some of the code they rely on can’t run natively yet. Although native apps are preferable, emulation is the key to Windows on Arm’s success (and Apple’s Arm-based Macs too). Users want to be able to run their entire back catalog of software, including software that may no longer be supported and thus is unlikely to ever see a native Arm update. If you’re not familiar with the concept, emulation takes software compiled for one architecture (such as x86) and converts it into machine code that will run on a different processor architecture, in this case, Arm. There is a small but tangible performance penalty for performing this conversion. Windows 10 on Arm provides emulation of 32-bit (x86) apps but can’t run non-native 64-bit applications. Windows 11 on Arm introduces 64-bit (x86-x64) emulation, greatly expanding the range of applications that run on the platform. The latter also allows you to run Android apps on Windows and get access to an even broader app library. Originally, Microsoft had planned to bring 64-bit emulation to Windows 10 but chose instead to reserve it for the Windows 11 update. Fortunately, it appears that virtually all existing Windows on Arm devices will see an update to Microsoft’s latest OS, ensuring they will eventually see 64-bit app support. The exception is first-gen Qualcomm Snapdragon 835-powered devices. Microsoft encourages users to download apps from the Microsoft Store, which will automatically detect and download the best native or emulated version for your device. However, third-parties can still host their own software installers for Windows on Arm too. Windows on Arm has a number of benefits but it’s not suitable for every use case, at least not yet. Weighing up the platform’s pros and cons is even more important than usual before making a purchase. For instance, playing all but the oldest and most basic games isn’t yet possible on Arm hardware. Between the emulation layer and lackluster graphics hardware, you won’t be able to play the latest AAA titles at acceptable frame rates on a Windows on Arm device. Similarly, those who require quite specific and demanding software, such as CAD applications, may find performance sluggish compared to a more performant platform. It’s best to steer clear if you require high-end performance from your main laptop. But a Windows on Arm device can be a great pick for those who desire portability. The platform provides ample performance for document editing, web browsing, and even some marginally more demanding tasks while providing all-day battery life. Combined with advanced networking options, such as 4G and 5G, and ultra-slim form fanless form factors, Arm-based laptops, and tablets are ideal for taking your work on the go. The Windows on Arm ecosystem is rather small at the moment. Here’s a non-exhaustive list of Windows on Arm laptops and tablets that you can currently buy: Discontinued models include the HUAWEI Matebook E 2019, Lenovo Flex 5G, Lenovo Miix 630, and Lenovo Yoga C630. Microsoft’s Surface Pro X hasn’t been formally discontinued but a new model hasn’t launched in a while. All of the above devices use Qualcomm’s Snapdragon 8cx platform. We should see manufacturers favor the newer Snapdragon X Elite going forward, here’s how the two chips compare: Yes, you can already install Windows 11 on Arm-based devices like the Microsoft Surface Pro X. Yes, Windows 10 was the first version ported to Arm. Not in emulation. Only native 64-bit (Arm64) apps work with Windows 10, along with x86 and Arm32 and apps. Windows 11 does support 64-bit software emulation. Currently, Microsoft only licenses Windows on Arm to OEMs. However, it is possible to gain access to Arm builds by joining the Windows Insider beta program. It is possible to install Windows on Arm-based M1 Macs using virtual machines. However, Microsoft does not yet sell Arm-specific license keys for Windows. Open the System > About page in the Settings menu. The ‘system type‘ field displays whether you’re on an Arm- or x86-based system. "
}