{
    "title": "AMD RX 7900 GRE review: the best AMD GPU this generation",
    "date": "2/26/2024",
    "url": "https://www.digitaltrends.com/computing/amd-rx-7900-review/",
    "text": "Digital Trends may earn a commission when you buy through links on our site. Why trust us? You may have not heard of AMD’s RX 7900 GRE. The GPU, dubbed Golden Rabbit Edition, was exclusively released in China in the middle of last year, and despite AMD noting a U.S. price, the card never made its way across the Pacific — until now. I’ve been testing the RX 7900 GRE, a version of the GRE for the U.S. that comes with an attractive new price of $550. Striking back at the RTX 4070 Super and delivering a step between AMD’s value-focused and flagship lineups, the RX 7900 GRE is a surprising option that I didn’t know the GPU market needed. And its smart pricing and great performance squarely lands it among the best graphics cards. The RX 7900 GRE comes in at only $50 more than the RX 7800 XT, but it’s a significant jump in specs. That’s because it’s using the Navi 31 GPU, which is the same core you’ll find on the RX 7900 XT and RX 7900 XTX. Unlike several GPUs we’ve seen this generation, the name is appropriate on this one. It’s a cut-down RX 7900 XT, not a souped-up RX 7800 XT. Unsurprisingly, the memory spec outclasses what Nvidia offers at this price. You’re getting 16GB of GDDR6 memory across a 256-bit bus, along with 64MB of AMD’s Infinity Cache. That’s the same memory configuration you’ll find on the RX 7800 XT, but the RX 7900 GRE earns its stripes with a massively boosted core count. It comes with 5,120 cores, which is 33% more than the RX 7800 XT, but more surprisingly, only 5% less than the RX 7900 XT — a GPU that’s currently selling for around $750. The RX 7900 XT comes with a better memory spec, and it’s a faster GPU overall. But it’s shocking how close the RX 7900 GRE gets considering its $550 price tag. This is still a lower-power GPU — literally. The RX 7900 XT can draw up to 300 watts, while the RX 7900 GRE tops out at 260W. That’s almost identical to the RX 7800 XT. The specs are fantastic, but that’s not surprising. When AMD originally revealed the RX 7900 GRE last year, it announced a price of $650 in the U.S. Several months in China has seemingly made AMD reverse course, with the RX 7900 GRE hitting the U.S. market at a much lower price. You’re getting a lot for your money here, which translates into real-world performance. Starting off with a look at 3DMark, the stage is already set well for the RX 7900 GRE. In the DirectX 12-based Time Spy, the card is 5% faster than Nvidia’s competing RTX 4070 Super, and a massive 18% faster than the RX 7800 XT. This is a dominating lead for AMD, as Nvidia’s competing GPU is not only slower, but also more expensive. It shouldn’t come as a surprise that a benchmark with ray tracing, like 3DMark’s Port Royal, paints a slightly different picture. In this test, the RTX 4070 Super and RX 7900 GRE trade places, with Nvidia’s GPU ahead by 4%. Still, the jump here for AMD is impressive, with the RX 7900 GRE leading the RX 7800 XT by 22%. The RX 7900 GRE is even ahead of the RTX 4070 by around 12%. The narrative that AMD is behind in ray tracing is alive and well, but it’s not as big of a deal today as it was even a year ago. The RX 7900 GRE matches the RTX 4070 Super if you take rasterized and ray tracing performance into account — just for $50 less. Once you start looking at real games, it even takes a lead. At $550, the RX 7900 GRE is an aspirational GPU for 4K. It can handle 4K in a lot of games, but the most demanding titles won’t run at playable frame rates without some upscaling assistance. On average, however, the RX 7900 GRE passes the playable mark more cleanly than its direct competitors. Across the full test suite, including ray tracing titles, the RX 7900 GRE is 6% ahead of the RTX 4070 Super and 12% ahead of the RX 7800 XT. There are games where the RX 7900 GRE shoots ahead of the RTX 4070 Super, including Forza Horizon 5, Red Dead Redemption 2, and most surprisingly, Returnal. That game is particularly impressive for the RX 7900 GRE as it matches the performance of the $800 RTX 4070 Ti Super. In other titles, the RX 7900 and RTX 4070 Super are much closer, such as Horizon Zero Dawn and Cyberpunk 2077. There are a few frames between the graphics cards, but this is performance parity overall. It’s not all upsides for the RX 7900 GRE, however. As you can see in The Last of Us Part One, the RX 7900 GRE falls short of the RTX 4070 Super and only provides a minor uplift over the RX 7800 XT. That said, you can see how the RTX 4070 Ti Super and RTX 4070 Super posted very similar results in game, showcasing that the title still has some strange behavior with GPUs. The Last of Us Part One is the only game where I saw the RX 7900 GRE below the competition from Nvidia. In Assassin’s Creed Valhalla, AMD is once again in the lead, and by a very significant margin if you factor in the performance of the base RTX 4070 that also sells for $550. The RX 7900 GRE is surprisingly potent at 4K. It managed to cross 60 frames per second (fps) in the vast majority of games I tested and occasionally headed into the triple digits. And in the titles where it fell short, a bit of help from upscaling went a long way. The RX 7900 GRE is most comfortable at 1440p, where it now reaches an average in the triple digits. It once again leads the RTX 4070 Super by about 5%, and it manages to outclass the RX 7800 XT by 12% and the base RTX 4070 by a massive 16%. Even with the Super refresh, Nvidia is still selling the RTX 4070 at $550, and the RX 7900 GRE is 16% faster at the same price. This average includes ray tracing, so the RX 7900 GRE leads in a more dominating way in some rasterized titles. In Forza Horizon 5, for example, it’s 14% faster than the RTX 4070, and in Returnal, it’s over 35% faster, matching the performance of the RTX 4070 Ti Super. Red Dead Redemption 2 also shows AMD out in front, with the card 22% ahead of the base RTX 4070 and 6% ahead of the Super variant. In Assassin’s Creed Valhalla and Horizon Zero Dawn, however, the RX 7900 GRE and RTX 4070 Super are evenly matched (though AMD’s card still shows a lead over the base RTX 4070). Some of the oddities at 4K come out in the favor of AMD at 1440p. In Cyberpunk 2077, for example, the performance barrier is gone, allowing the RX 7900 GRE to outclass the RTX 4070 Ti Super. That’s not too surprising, as you can see AMD’s GPUs perform exceptionally well in this title with ray tracing turned off. The biggest shift is The Last of Us Part One, where the lower resolution doesn’t stress the memory interface of these GPUs as much. Down at 1440p, the RX 7900 GRE leads the RTX 4070 Super by 10% and the base RTX 4070 by a massive 28%. Although the RX 7900 GRE is impressive at 4K, the GPU shines much more at 1440p. Without factoring in ray tracing, it’s leagues ahead of the RTX 4070 and RTX 4070 Super, and even when ray tracing is brought into the mix (more on that below), it still comes out slightly ahead. It’s hard justifying a $550 graphics card for 1080p, with options like the RX 7600 XT and RTX 4060 being better suited for this resolution. I still ran all of my benchmarks at 1080p, but we’ll just look at the high-level average rather than diving into individual games. At 1080p, we start to see a CPU bottleneck come into play, with the RX 7900 GRE and RTX 4070 Super showing identical performance on average. However, AMD still holds a sizeable 11% lead over the base RTX 4070, which is available at the same $550 price as the RX 7900 GRE. The elephant in the room with any new AMD GPU is ray tracing, and just like before, the script flips in favor of Nvidia in ray tracing titles. Cyberpunk 2077 is a great example of that. Across resolutions, even the base RTX 4070 manages to outclass the RX 7900 XT, much less the new RX 7900 GRE. The good news for AMD here is that the RX 7900 GRE is much closer to the RX 7900 XT than it is the RX 7800 XT. Cyberpunk 2077 remains one of the most demanding games with ray tracing. In a less demanding title like Returnal, the RX 7900 GRE trades blows with the RTX 4070 Super, but it consistently outclasses the base RTX 4070. It’s an impressive jump for AMD’s ray tracing efforts, and a big reason why the RX 7900 GRE comes out on top on average. Ray tracing is still Nvidia’s game, but the RX 7900 GRE has enough chops to keep up with Nvidia’s offerings around this price. You’re giving up some ray tracing performance, but you’re gaining better performance in titles without ray tracing, which still represents a majority of games you’ll likely play on the graphics card. Even with ray tracing catching up, Nvidia holds a lead in the feature department with its DLSS 3.5. AMD has FSR 3, which is available to the RX 7900 GRE and all other modern GPUs, but support still hasn’t picked up. At the time of writing, FSR 3 is available in less than 15 games, a good chunk of which are legacy titles. Hopefully, support will pick up soon. AMD holds a slight edge over Nvidia with its Fluid Motion Frames feature. This is exclusive to AMD graphics cards, offering driver-based frame generation for thousands of DirectX games. It doesn’t always work well, but it’s still an option you get with the RX 7900 GRE that you won’t find on the competition from Nvidia. The RX 7900 GRE could have been a disaster. Given what we saw last year with the GRE model in China and its initial pricing, it would have fallen short of expectations. A price adjustment has put it in a much better spot. On price, it’s directly in competition with the RTX 4070 while providing vastly superior performance. It even manages to trade blows with the more expensive RTX 4070 Super, often coming out ahead. It’s an aggressive GPU that’s sure to turn some heads at Team Green. The main thing holding the RX 7900 GRE back from a resounding recommendation right now is FSR 3 support. The feature isn’t in enough titles, and even with a performance loss, a GPU like the RTX 4070 Super still has a lot of value thanks to Nvidia’s robust DLSS 3.5 support. Thankfully for AMD, that’s a problem with an expiration date. FSR 3 support will improve over time, maybe reaching parity with DLSS. In the meantime, the RX 7900 GRE is an excellent GPU that plants a firm stake with its raw performance, even if it has to play a little catch-up on the feature front. Anti-aliasing is the hidden backbone behind making your games look great. It serves a simple purpose -- fixing the jagged edges that show up in games -- but the specifics are complicated. In this guide, we'll explain the anti-aliasing options you see in games so that you can achieve the image quality and performance your gaming PC needs. Among all of the graphics settings you need to tweak in PC games, anti-aliasing is one of the most important. It can tank your performance or make your game look terrible if harnessed incorrectly. But with a little guidance on what anti-aliasing settings to use, you can optimize any game in seconds. Let's take a closer look at anti-aliasing, its different types, and how to turn it on.\nWhat is anti-aliasing? If you use a desktop PC or laptop for long enough, chances are you're going to come across one of the common GPU problems that have plagued gamers and workers since the humble graphics card debuted for the first time. The question is, do you know how to fix them? If not, never fear. We're here to help. Whether you're encountering poor performance, overheating, visual artifacts, or a dreaded black screen, we're going to help you diagnose and fix these common GPU problems. The PC graphics card market witnessed notable growth in the fourth quarter of 2023, according to Jon Peddie Research. With shipments climbing by 6% to reach 76.2 million units, this surge marks a significant 24% increase year over year, representing the most substantial gain in over 25 years. Projections indicate a continued upward trend, with an expected 3.6% annual growth rate from 2024 to 2026, potentially culminating in a total installed base of 5 billion units by the end of 2026, with discrete GPUs comprising 30% of the market. Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}