{
    "title": "Nvidia's original GTX Titan benchmarked 11 years later — $1000 card now \n'barely usable' in modern titles, often ...",
    "date": "2/13/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/nvidias-original-gtx-titan-benchmarked-11-years-later-dollar1000-card-now-barely-usable-in-modern-titles-often-beaten-by-amds-sub-dollar200-rx-6400",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. How the tables have turned for Nvidia's flagship Kepler GPU. PC Games Hardware Germany has gone back and retested Nvidia's GTX Titan, which launched over a decade ago, to see how it performs in 2024. The review outlet found that the tables have turned on the Kepler GPU, and most games made today are not compatible due to missing features. Of the few modern games that do run on what was once among the best graphics cards for gaming, only a handful are playable at ultra settings.\n\nIt's worth mentioning that the particular GPU PCGH reviewed was the original GeForce GTX Titan that was unveiled in 2013, based on Nvidia's Kepler architecture. There have been multiple iterations of the Titan throughout the years, with some sharing names with their predecessors, so it's a bit difficult to keep track of each Titan SKU. The Kepler-based GTX Titan debuted with 6GB of GDDR5 memory operating on a 384-bit bus, with 2,688 cores, 876MHz boost clock, and a 250W TDP.\n\nDespite being Nvidia's flagship GPU from 2013, PCGH found that the Kepler GPU is a very poor gaming GPU in 2024. The biggest issue with the GPU is its age and lack of modern features. It barely qualifies as a DirectX 12 compatible GPU at all, meeting only the base specification without any extra features. It also only supports DirectX 12 through software emulation, which is less efficient than native hardware support. This is due to the fact that DirectX 12 was released two years after the GTX Titan debuted in 2015.\n\nAs a result, many populator titles today, such as Call of Duty, Guardians of the Galaxy, Forza Horizon 5, and many more wouldn't even start on the GTX Titan due to compatibility issues. That applies to all Kepler-era GPUs, incidentally — quite a few games simply refuse to run. Of the titles that did launch, the GTX Titan could barely hit playable frame rates in most games at 1080p ultra settings. It's a big departure from 11 years ago, when the GTX Titan could smoke any game you ran on it, even at 1440p.  Crysis Remastered only achieved 31 FPS on the GTX Titan, and The Riftbreaker which isn't a particularly demanding game, could only hit 33 FPS. In Cyberpunk 2077, the Kepler GPU only managed 12.3 FPS, and that's without ray tracing enabled (which the GPU of course doesn't support). The only titles PCGH tested that could get near 50 FPS were Diablo 4, Ghostwire Tokyo, and Psychonauts 2. The rest either achieved around 30 FPS or well under 30 FPS.\n\nWith overclocking, the story changes quite a bit. Overclocked to 1,250MHz, the GTX Titan saw a 34% performance boost overall, enabling the GPU to hit playable framerates in games that otherwise weren't. For example, in Control the GTX Titan only achieved 24.8 FPS at stock, but with overclocking it was able to run at a playable 33 FPS. Psychonauts 2 is the only game in PCGH's test suite that got to almost 60 FPS on the GTX Titan, after overclocking. Without overclocking the game ran at 46 FPS, but with overclocking the game ran at 59.8 FPS.  For comparison, PC Games Hardware also threw a RX 6400 into its testing suite to see what a modern-day discrete GPU can do against Nvidia's best GPU from 2013. The RX 6400 is by no means a fast GPU, but it has all the modern-day features and optimizations we've come to expect.\n\nPCGH found that the RX 6400 beat the GTX Titan in 9 out of the 12 titles it tested, with the RX 6400 at stock clocks (it doesn't support overclocking). With the GTX Titan overclocked, the GTX Titan turned the tables beating the RX 6400 in most of the tested games.  PCGH's testing confirms that the GTX Titan is no longer a competitive gaming GPU in 2024. Its lack of DirectX12 features is the primary reason for its downfall, as well as discontinued game-ready driver support which ended in 2021. That said, if you've been holding on to your GTX Titan for the past 11 years, you've likely gotten your money's worth out of it (even at its overpriced MSRP).\n\nOf course, you can run many games at lower graphics settings to boost FPS, but the GTX Titan is a flagship graphics card that was originally intended to provide the best gaming experience possible during its era. This is why PCGH tested the Titan at ultra settings rather than high, medium or low settings.\n\nThere are a few traits of the GTX Titan that are still decent even today. The biggest one is its VRAM buffer. 6GB's of VRAM was ludicrously overkill in 2013, to the point where people doubted if any game could use the Titan's full memory capacity. Little did they know that in 2024 that 6GB is often the minimum requirement to play games at ultra settings. PCGH reports that the Titan's 6GB's frame buffer is one of the few things that enabled it to run some games at ultra settings at playable frame rates. The 6GB capacity allowed the review outlet to max out the texture quality and shadow quality without encountering micro-stuttering problems.\n\nAnother amazing trait of the GTX Titan is its overclockablility. The Titan came out in an era when GPU overclocking was in a healthy state, and technologies such as GPU boost were in their infancy. The fact that it can gain over 30% more performance from overclocking alone is downright impressive compared to today's GPUs. A modern RTX 40-series card can barely squeeze out 10% more performance (if that) from overclocking. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Aaron Klotz is a freelance writer for Tom’s Hardware US, covering news topics related to computer hardware such as CPUs, and graphics cards. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 Logitech MX Brio Review: 4K, but not for content creators By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}