{
    "title": "Nightingale developers decide to remove AMD FSR3 support right before launch",
    "date": "2/18/2024",
    "url": "https://videocardz.com/newz/nightingale-developers-decide-to-remove-amd-fsr3-support-right-before-launch",
    "text": "A new survival game set to launch next week will lack FSR3 support.  Nightingale, a new game set to launch in two days, was initially planned to feature all the latest upscaling technologies such as Intel XeSS, NVIDIA DLSS 3, and AMD FSR3. However, the development team has made a last-minute decision to exclude AMD FSR support due to issues discovered during server stress testing for the online co-op game. Crash data revealed that a significant number of crashes were linked to the integration of AMD FSR3, regardless of whether the technology was actively enabled. As a result, the decision was made to remove FSR3 from the launch version of Nightingale. The development team is actively collaborating with external teams, presumably also from AMD, to address the issues and potentially reintegrate FSR3 in the future. However, it may not necessarily involve the FSR3 version with Frame Generation.   AMD FSR3 removed, Source: Nightingale  Before this announcement, the team posted the official performance guide for Nightingale, where it was recommended to use frame generation technology if possible. It could lead to up to 80% higher performance, it is claimed. Initially, both NVIDIA DLSS and AMD FSR were expected to support this technology. However, it appears that this no longer holds true for AMD FSR, as the decision has been made to exclude FSR from the game due to identified issues during server stress testing. Hopefully, the team can at least add FSR2 sometime after launch and FSR3 when all issues are fixed. Source: Nightingale We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}