{
    "title": null,
    "date": "3/17/2024",
    "url": "https://videocardz.com/newz/playstation-5-pro-leak-8-core-zen2-3-85-ghz-cpu-and-rdna4-ray-tracing-engine",
    "text": "Insider Gaming confirms the latest specs of the new console.¬†  Sony is about to launch its PlayStation 5 Pro gaming console, codenamed ‚ÄúTrinity‚Äù in the Fall 2024. The newest rumors have revealed a lot of information about the graphics capabilities and Sony‚Äôs concept for super-resolution tech. According to Insider Gaming, the APU in the new console is indeed featuring the same 8-core processors as in the existing model, but now slightly faster. This is an AMD Zen2 based CPU that will now boost up to 3.85 GHz in something called ‚ÄúHigh CPU Frequency Mode‚Äù. The site reiterates the leaked GPU specs, confirming it is being upgraded significantly. The GPU is now said to rely mainly on the RDNA3 architecture, and it will offer up to 45% faster rendering performance and 2-3x faster ray tracing. The GPU is said to combine 60 RDNA3 Compute Units, that should be clocked up to 2.18 GHz. The GPU will power the new temporal upscaling technology called PSSR (PlayStation Spectral Super Resolution), which is expected to support 8K resolution in a future SDK update. Currently, the PS5 Pro dev kits are running SDK 9.0 while 10 is expected to become available before the console release. Insider Gaming has revealed that the integrated graphics processor will take advantage of BVH8 traversal shaders. This stands for an 8-level bounding volume hierarchy for ray tracing, instead of the 4-level hierarchy on RDNA2 GPU in the current PS5 APU. Kepler, who was among the first to name the Viola APU as well as confirm that PS5Pro will still rely on Zen2 architecture, adds that BVH8 is a feature associated with RDNA4 RT architecture. Thus, one might say that the PS5 Pro GPU will be a hybrid of RDNA3 with RDNA4 features. BVH8 is interesting, not only confirms PS5 Pro is using RDNA4's RT engine but also confirms RDNA4 doubles RT throughput per cycle, something which hasn't been mentioned in any open source patch yet! üëÄ https://t.co/dht9fDWF79 ‚Äî Kepler (@Kepler_L2) March 17, 2024  The new PlayStation 5 Pro is expected to be ‚Äòas competitive as possible‚Äô. It will also have a detachable disc drive and will come with 1TB of storage by default. The system is currently targeting Fall 2024 for release date, with some claiming it should launch in November. Source: Insider Gaming We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright ¬© 2024 ¬∑ VideoCardz.com "
}