{
    "title": null,
    "date": "3/1/2024",
    "url": "https://finance.yahoo.com/news/why-amd-stock-jumped-again-224100206.html",
    "text": "Advanced Micro Devices (NASDAQ: AMD) recorded another day of strong gains in Friday's daily trading. The semiconductor company's share price closed out the session up 5.3%, according to data from S&P Global Market Intelligence. While there wasn't any business-specific news for AMD, its share price surged in conjunction with the latest bullish indicators for AI demand and growth opportunities. Dell published its fourth-quarter report after the market closed Thursday, and its results have spurred another round of bullish momentum for artificial intelligence (AI) stocks. If Wall Street was looking for another reason to be bullish on AI stocks, Dell's Q4 report and guidance seems to have delivered it. The company recorded non-GAAP (adjusted) earnings of $2.20 per share on sales of $22.3 billion, beating the average analyst estimate's call for per-share earnings of $1.72 on sales of roughly $22.15 billion. Even better, the company indicated that it was seeing strong demand for its AI server products and that it expected this catalyst to drive strong performance through 2025. Dell stock closed out Friday's trading up 31.6%, and the stock's surge had ripple effects for the valuations of top AI players. AMD stock is now up 37.5% across 2024's trading and 158% over the last year. AMD stock has been on an incredible rally thanks to excitement about the company's opportunities in AI. Shares now trade at 55.7 times this year's expected earnings and 37 times next year's expected profits. AMD's midpoint guidance calls for sales of roughly $5.4 billion in this year's first quarter; it looks like sales will come in roughly flat year over year in the period. Unlike Nvidia, AMD has yet to see an explosive uptick in sales and earnings thanks to the sale of artificial intelligence (AI) processors, but the market is optimistic that growth will accelerate in the near future. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Advanced Micro Devices made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks *Stock Advisor returns as of February 26, 2024 Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices. The Motley Fool has a disclosure policy. Why AMD Stock Jumped Again Today was originally published by The Motley Fool Related Quotes "
}