{
    "title": "HDMI Forum 'blocks AMD open sourcing its 2.1 drivers'",
    "date": "3/2/2024",
    "url": "https://www.theregister.com/2024/03/02/hdmi_blocks_amd_foss/",
    "text": "AMD says it has improved its FOSS display drivers for Linux, though the organization that controls the HDMI standard won't let it release them. As spotted by Linux benchmarking outfit Phoronix, AMD is having problems releasing certain versions of open-source drivers it's developed for its GPUs – because, according to the Ryzen processor designer, the HDMI Forum won't allow the code to be released as open source. Specifically, we're talking about AMD's FOSS drivers for HDMI 2.1 here. For some years, AMD GPU customers running Linux have faced difficulties getting high-definition, high-refresh-rate displays connected over HMDI 2.1 to work correctly. Some posts, such as this one about a 4K display at 120Hz, or this bug report about a 5K display at 240Hz, show that it's a long-standing problem: The issue isn't missing drivers: AMD has already developed them under its GPU Open initiative. As AMD developer Alex Deucher put it in two different comments on the Freedesktop.org forum: HDMI 2.1 is not available on Linux due to the HDMI Forum. The HDMI Forum does not currently allow an open source HDMI 2.1 implementation. The High-Definition Multimedia Interface is not just a type of port into which to plug your monitor. It's a whole complex specification, of which version 2.1, the latest, was published in 2017. It's known as HDMI to its friends – who, in its own words, include: Major motion picture producers including Fox, Universal, Warner Bros, and Disney, and system operators such as DirecTV, EchoStar (Dish Network) and CableLabs. With friends like these, as you might expect, HDMI cables are complicated things, including copyright-enforcing measures called High-bandwidth Digital Content Protection (HDCP) – although some of those were cracked way back in 2010. As we reported when it came out, you needed new cables to get the best out of HDMI 2.1. Since then, that edition was supplemented by version 2.1b in August 2023 – so now, you may need even newer ones. This is partly because display technology is constantly improving. 4K displays are old tech: We described compatibility issues a decade ago, and covered 4K gaming the following year. Such high-quality video brings two consequences. On the one hand, the bandwidth the cables are expected to carry has increased substantially. On the other, some forms of copying or duplication involving a reduction in image quality – say, halving the vertical and horizontal resolution – might still result in an perfectly watchable quality copy. We've reached out to both the HDMI Forum and to AMD's press office to see if they have anything to add, and if they get back to us, we will update this story. ® The increasingly elderly ThinkPad hardware that the Reg FOSS desk favors has DisplayPort outputs rather than HDMI. As we have noted before, we prefer DisplayPort to HDMI, and one reason is that you can happily drive an HDMI monitor from a DisplayPort output using a cheap cable, or if you have an HDMI cable to hand, an inexpensive adapter. We picked a random example which is a bargain at under $5. But the converse does not hold. You can't drive a DisplayPort screen from an HDMI port. That needs an intelligent adaptor which can resample the image and regenerate a display. Saying that, they are getting cheaper, and for lower-quality video such as old VGA or SCART outputs, these days, a circa-$5 microcontroller board such as a Raspberry Pi Pico can do the job, and you can build your own. Send us news The Register   Biting the hand that feeds IT Copyright. All rights reserved © 1998–2024 "
}