{
    "title": null,
    "date": "3/16/2024",
    "url": "https://www.xda-developers.com/best-rtx-4080-laptops/",
    "text": "These laptops can really fly thanks to the inclusion of a discrete RTX 4080 Laptop GPU. The best gaming laptops can now rival desktops, allowing you to take incredible PC performance with you practically everywhere you go. This is especially true when the laptop is running Nvidia's discrete RTX 4080 Laptop graphics card and modern Intel or AMD processors. You'll be able to enjoy even the most recent and demanding games, all on a display that's geared for a high-end experience. But RTX 4080 laptop aren't just great for gaming. There are also laptops and mobile workstations made more for creative and design tasks, giving professionals more portable options with plenty of power. Finding the perfect laptop can be tough, especially when there are so many brands and models vying for your attention. That's why we've collected a bunch of the best laptops that we've personally checked out at XDA, all sporting a Nvidia RTX 4080 Laptop GPU and other features that might attract a certain audience. They're not quite as powerful as the best RTX 4090 laptops, but they're generally available at a more affordable price and will land you the same great features. The perfect PC for a lot of people Lenovo's Legion Pro 7i (Gen 8) is one of our favorite gaming laptops, and it can be configured with a Nvidia RTX 4080 Laptop GPU. It doesn't throttle, it's built to a high standard, and there are plenty of configuration options available beyond the GPU. Lenovo's Legion Pro 7i (Gen 8) for 2023 gets almost everything right, resulting in a powerful laptop that can crush modern games in style. It's equipped with a 13th-gen Intel Core i9-13900HX processor (CPU), NVIDIA RTX 4080 or RTX 4090 Laptop graphics card (GPU), up to 32GB of DDR5 RAM, and up to 1TB of M.2 PCIe 4.0 NVMe solid-state drive (SSD) storage space. We tested a model with RTX 4080 in our Lenovo Legion Pro 7i (Gen 8) review, with Senior Editor Joāo Carrasqueira calling it \"an incredibly fast machine\". Performance is controlled by an AI engine, which keeps the system from overheating and throttling even under full load. We saw Apex Legends hit 192 FPS at max settings, which is perfect for the 16-inch display with 240Hz refresh rate and 2560x1600 (QHD+) resolution. The screen could be better equipped to deal with glare, but otherwise it offers perfect sRGB color reproduction and the right specs for high-end gaming. The laptop saw a slight redesign for this generation. It now has rounded corners for a more modern look, its aluminum build is truly sturdy, and there's a ton of customizable RGB lighting to mess around with. It's on the heavy side due to all of the features and performance hardware, but it's worth it for the power. The ninth-gen Legion Pro model for 2024 was announced, and we're looking forward to testing it to see how well the new 14th Gen Intel Core CPUs fare. If you're considering this laptop, you might want to wait for the newer version. Be sure to have a look at more of the best Lenovo laptops if this isn't quite what you need. Save some dough on a great PC HP's Omen 16 for 2024 picks up where 2023's redesign left off, bringing a powerful and balanced gaming laptop at a very competitive price. There are plenty of configurations available, with a Core i9-14900HX CPU option coming paired with a Nvidia RTX 4080 Laptop GPU. HP offers a wide range of configurations for its Omen 16 (2024), and those who might want something a bit less powerful than the RTX 4080 will have plenty of options starting at about $1,150. However, we're only focused on big performance in this collection. HP offers a high-end configuration with a 14th Gen Intel Core i9-14900HX CPU, Nvidia RTX 4080 Laptop GPU, 16GB of DDR5-5600MHz RAM, 512GB M.2 PCIe 4.0 NVMe SSD, and a 16.1-inch FHD display at a 165Hz refresh rate for about $2,250, which is still a very competitive price. There's only about a $70 difference between screen options, so upgrading to a QHD resolution with 240Hz refresh rate, 3ms response time, and about 300 nits brightness is certainly doable. The RTX 4080 running at a maximum 145W TGP can handle 1440p, and the boosted 240Hz refresh rate will come in handy during competitive play. In my HP Omen 16 (2023) review, I noted that \"your favorite titles are going to look full and colorful, and you'll have no issue with standard productivity work.\" You will have to live with some shortcomings — like the lack of an SD card reader and the screen's 16:9 aspect ratio — but you can expect to pay less and still get a great gaming laptop with the Nvidia GeForce RTX 4080. Don't hesitate to browse more of the best HP laptops if this one doesn't quite do it for you. Our favorite overall gaming laptop The Legion 9i for 2023 is our favorite overall gaming laptop today. It comes with liquid cooling (yes, in a laptop), a super thin chassis, gorgeous mini-LED display, and an almost unbelievably thin chassis. The Legion 9i for 2023 is the best gaming laptop that Lenovo makes, and it's our current top pick when it comes to the overall best gaming laptops on the market. It's the first ever 16-inch gaming laptop with a fully self-contained liquid cooling system; combined with Lenovo's AI tuning, you won't see any thermal throttling despite the monster performance. The 16-inch display has a 3200x2000 (3.2K) resolution with a 165Hz refresh rate, meaning it will easily keep up with the desired RTX 4080 Laptop GPU. Mini-LED technology provides some of the best color and contrast around, with many local zones for dimming. The screen supports HDR 1000, it manages up to 1,200 nits brightness, and it has perfect AdobeRGB and DCI-P3 color. In his Lenovo Legion 9i (2023) review, XDA Senior Editor João Carrasqueira said, \"Everything looks phenomenal on this screen, and when you consume HDR content, especially games, it really comes alive.\" Lenovo currently offers a model with 13th Gen Intel Core i9-13980HX CPU, Nvidia RTX 4080 Laptop GPU, 32GB of DDR5-5600MHz dual-channel RAM, 1TB M.2 PCIe 4.0 NVMe SSD, and the mini-LED display. Do note that a Legion 9i model for 2024 is expected, and you might want to wait for its launch if you're interested in Intel's 14th Gen Core HX-series CPUs. Huge screen, huge power The Blade 18 for 2023 is a monster gaming laptop that's also cut out for specialized work. It's relatively thin and lightweight (at least for an 18-inch device), it has modern performance hardware including 13th-gen Intel Core CPUs and an RTX 4080 Laptop GPU, and the 18-inch display has a QHD+ resolution and 240Hz refresh rate. Razer's Blade 18 was a fresh release for 2023 that really pushed the definition of \"laptop\". It is about 0.86 inches thin, and weighs in at 6.8 pounds. It's not likely something you'll want to take on your next flight, but it can deliver desktop-class performance in a very sleek chassis. Razer offers a 13th-gen Intel Core i9-13950HX CPU with up to an Nvidia RTX 4090 Laptop GPU, 2TB of M.2 PCIe 4.0 NVMe SSD storage space, and up to 32GB of DDR5-5600MHz RAM. There's also an i9-13980HX CPU option, though it seems to be less common. Of course, we're really only worried about the RTX 4080 model. Razer lets the GPU run at up to 175W of power, and it's all kept (relatively cool) with three fans and a huge vapor chamber. Combined with the HX-series Core i9 CPU, you can expect only the best performance. The aluminum chassis helps dispel heat while also looking downright svelte. Top- and bottom-firing speakers, of which there are six in total, produce outstanding audio with no need for a headset. The speakers are joined by a 5MP webcam and an impressive array of ports, including Thunderbolt 4, USB-C, HDMI 2.1, 2.5Gb Ethernet, USB-A, and a UHS-II SD card reader. As for the display, its 18-inch size will make you feel like you're sitting at a desktop setup wherever you go. The screen has a 2560x1600 (QHD+) resolution, 16:10 aspect ratio, 240Hz refresh rate, 3ms response time, 100% DCI-P3 color reproduction, and Nvidia G-Sync. It's a display that can handle specialized work anytime you aren't enjoying your favorite games. Razer also makes a Blade 16 that's available with an RTX 4080 Laptop GPU. It's a bit easier to carry around and costs less, and it's even available with an optional mini-LED display. We went hands-on with these laptops, and you can check out our Blade 16 vs Blade 18 comparison for more information. Also note that new Blade 18 models for 2024 have been announced. Anyone looking to land an 18-inch 4K display at 165Hz and the latest Intel Core processors will probably want to wait until it launches. Lots of power in a slim body The second-gen Alienware x16 R2 hasn't really changed physically compared to last year, but that's OK for anyone who wants a slim and powerful gaming laptop. Get it with Intel Core Ultra CPUs, up to a Nvidia RTX 4090 Laptop GPU, and a 16-inch QHD+ display with 240Hz refresh rate and 3ms response time. Dell's Alienware brand has a lot of different models, but one that we love is the 16-inch Alienware x16 R2, now in its second generation. It's relatively thin and compact compared to other gaming laptops, measuring 0.73 inches in thickness and weighing in at about six pounds (2.7kg). Dell upgraded to Intel's Core Ultra chips for 2024, with up to a Core Ultra 9 185H with 16 cores. The design hasn't really changed since the last generation. In his Alienware x16 (2023) review, Senior Editor João Carrasqueira remarked that \"this laptop proved to me that CPU performance isn't as important as [other] laptops might make it seem.\" XDA's review unit did have the Nvidia RTX 4080 Laptop GPU inside, and it performed admirably with high frame rates in modern games. The latest model so far has just one display option to configure, but its QHD+ resolution, 240Hz refresh rate, 3ms response time, Nvidia G-Sync and Advanced Optimus support, and 100% DCI-P3 color should suit many users. Dell went all in with rear ports, and there are no hookups on the sides of the laptop. The two USB-C (one with Thunderbolt 4), two USB-A, HDMI, mini DisplayPort, microSD card reader, and 3.5mm audio jack are all housed in a port bank along the back. This keeps cables out of the way, especially when you're working at a desk with other accessories. The chassis has some customizable RGB ring lighting to go along with the keyboard's per-key lighting, and you can even opt for a mechanical keyboard with CherryMX switches. Above the screen is an FHD webcam with IR support for Windows Hello. This is a relatively expensive laptop, and you can get similar specs and performance elsewhere for less money if you don't care as much about a slim chassis. Dell does host frequent sales, so keep an eye out for discounted models. Tons of performance potential The Lenovo ThinkPad P1 (Gen 6) is the right choice for professionals who need a blend of mobile workstation and premium ThinkPad. It's available with truly potent performance hardware, and it's a delight to use thanks to the many premium features. Lenovo refreshed its ThinkPad P1 workstation for 2023, bringing it to the sixth generation. The laptop is reminiscent of the X1 Carbon, with an optional carbon fiber lid, top-firing speakers, and classic black ThinkPad finish. But while the laptops might look similar, the performance hardware inside is much better geared toward professionals who need extra performance for tasks like designing, editing, and engineering. In my ThinkPad P1 (2023) review, I noted that \"the keyboard is outstanding, there's a useful selection of ports, the 5MP camera comes with extra privacy and security features, and the 4K OLED touch display is just a joy to use.\" It's available with up to a 13th-gen Intel Core i9-13900H CPU, 96GB of RAM, and 4TB of M.2 PCIe 4.0 NVMe storage space, as well as Nvidia's RTX Ada or regular GPUs. The RTX 4080 is readily available, though you can go up to an RTX 4090 or RTX 5000 Ada if required. It's all powered by a 90Wh battery with rapid charge support. The 16-inch display is available in FHD+, QHD+, and UHD+ resolutions to go with the 16:10 aspect ratio. The premium UHD+ screen uses an OLED panel with anti-reflective finish, 100% DCI-P3 color, DisplayHDR 400, Dolby Vision, and excellent contrast. If you go with a lower resolution, the screens use an IPS panel and feature 100% sRGB color. Compact gaming laptop The Asus ROG Zephyrus G14 has been on my radar for years as a competent gaming laptop with relatively a compact size. It's packed with high-end features, it has a speedy AMD Ryzen 9 7940HS CPU and RTX 4080 Laptop GPU, and the QHD+ screen is a gorgeous addition to show it all off. The refreshed Asus Zephyrus ROG G14 is a more compact 14-inch gaming laptop that I've been following for years. The current 2023 model continues the trend of portable, with a build that weighs 3.79 pounds (1.72kg) and is about the size of a 13-inch device. The keyboard has a single-zone RGB backlight, with comfortable keys without a cramped feel. Above the display is a 1080p webcam with IR sensor, while audio is handled by four speakers, a smart amp, and Dolby Atmos tuning. Despite its size, the laptop has a great selection of ports including HDMI 2.1, two USB-A, two USB-C (one USB4), and a UHS-II microSD card reader. Powering the system is an AMD Ryzen 9 7940HS CPU with eight cores and a 5.2GHz boost clock, joined by a Nvidia RTX 4080 Laptop GPU, 16GB of DDR5 RAM, and a 1TB M.2 PCIe 4.0 NVMe SSD. The 76Wh battery isn't as large as you'll find on some bigger gaming laptops, but in most cases you'll want to be plugged in to get the most performance out of the CPU and GPU. The 14-inch display has a 16:10 aspect ratio and a boosted 2560x1600 (QHD+) resolution to match. It boasts a 165Hz refresh rate to accommodate the RTX 4080, it hits 100% DCI-P3 color coverage, and it has a 3ms response time. G-Sync is included, plus the MUX switch can come in handy when you need to work on lightweight tasks and need the best battery life possible. Nvidia's RTX 4080 is considered one of the best GPUs on the market today, and its laptop-focused sibling is a top choice for many gamers and creators looking to maximize performance in modern games and other software. Laptops with RTX 4080 GPUs aren't usually considered portable, but they can make great alternatives to a true desktop setups. You might not want to make a habit of toting around most of these laptops (save maybe the ROG Zephyrus G14), but if necessary, you'll have a much better time than trying to move your tower and monitor. Lenovo's Legion Pro 7i (Gen 8) for 2023 is our top choice for laptops with RTX 4080 graphics. It's more geared toward gamers (mostly due to the display's color reproduction), but it has the power to crush modern games and many intensive apps. The modern design results in a chassis with rounded edges and a port bank along the back, plus there's RGB lighting for the keyboard and body. More importantly, Lenovo's AI engine is onboard to keep the system from overheating even when at its full potential. You might not get the full wattage all the time from the internal hardware, but you'll never see the system throttle itself. Lenovo offers many configuration options, and while shopping you might find a different setup that better suits your needs. As with most Lenovo products, we recommend waiting for a sale to buy. Lenovo's pricing fluctuates greatly, and spending full price on a Legion laptop will leave you out more money than is really necessary. The Lenovo Legion Pro 7i is a super fast gaming laptop with a premium design that hits all the right boxes so you can play your favorite games.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Cale has been testing and reviewing laptops, PC hardware, and accessories for more than six years, with hundreds of reviews to his name. He is a multi-platform user with no real staked allegiance, though he does have a soft spot for Windows laptops and PC gaming. Gaming handhelds are trending right now, but is a gaming laptop still better for you? Find out which of Samsung’s newest Galaxy Book notebooks 4 is worth the price tag in this head-to-comparison If you're looking to add one of AMD's Ryzen 7000 to your system without spending a ton, check out our collection of the best budget AM5 motherboards. DisplayPort connectivity remains the only viable workaround What decides how fast your RAM is? Frequency or latency? These are some of the best deals you're going to find on the Google Pixel Fold so don't miss out. "
}