{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.notebookcheck.net/AMD-Radeon-760M-GPU-Benchmarks-and-Specs.680920.0.html",
    "text": "The AMD Radeon 760M is an integrated GPU in the Ryzen 7040 series for laptops (Phoenix, e.g. Ryzen 5 7640HS). The iGPU is based on the new RDNA3 architecture and has 8 of the 12 CUs (= 512 shaders) clocked at up to 2.8 GHz (depending on the CPU model). As the predecessor Radeon 660M, the 760M supports hardware raytracing, although the performance is too slow to use it in current games. \nThanks to the new architecture and higher clock speeds, the Radeon 760M should be clearly faster then the old Radeon 660M. \nThanks to the modern 4nm process and clever power-saving features, the power consumption is comparatively low (according to AMD). The whole chip of the first two models can be configured between 15 - 54 Watt TDP. The AMD Radeon 760M is an integrated GPU in the Ryzen 7040 series for laptops (Phoenix, e.g. Ryzen 5 7640HS). The iGPU is based on the new RDNA3 architecture and has 8 of the 12 CUs (= 512 shaders) clocked at up to 2.8 GHz (depending on the CPU model). As the predecessor Radeon 660M, the 760M supports hardware raytracing, although the performance is too slow to use it in current games. Thanks to the new architecture and higher clock speeds, the Radeon 760M should be clearly faster then the old Radeon 660M. Thanks to the modern 4nm process and clever power-saving features, the power consumption is comparatively low (according to AMD). The whole chip of the first two models can be configured between 15 - 54 Watt TDP. The following benchmarks stem from our benchmarks of review laptops. The performance depends on the used graphics memory, clock rate, processor, system settings, drivers, and operating systems. So the results don't have to be representative for all laptops with this GPU. For detailed information on the benchmark results, click on the fps number. For more games that might be playable and a list of all games and graphics cards visit our Gaming List In the following list you can select (and also search for) devices that should be added to the comparison. You can select more than one device. #0 no ids found in url (should be separated by \"_\") +0s ... 0s #1 not redirecting to Ajax server +0s ... 0s #2 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:39:02 +0200 +0.001s ... 0.001s #3 composed specs +0.062s ... 0.063s #4 did output specs +0s ... 0.063s #5 start showIntegratedCPUs +0s ... 0.063s #6 getting avg benchmarks for device 11566 +0.036s ... 0.099s #7 got single benchmarks 11566 +0.013s ... 0.111s #8 got avg benchmarks for devices +0s ... 0.111s #9 min, max, avg, median took s +0.623s ... 0.735s #10 before gaming benchmark output +0s ... 0.735s #11 Got 111 rows for game benchmarks. +0.023s ... 0.758s #12 composed SQL query for gamebenchmarks +0s ... 0.758s #13 got data and put it in $dataArray +0.02s ... 0.778s #14 benchmarks composed for output. +0.858s ... 1.636s #15 return log +0.037s ... 1.674s HP ZBook Firefly 14 G10 A: AMD Ryzen 5 PRO 7640HS, 14.00\", 1.5 kg\n  External Review » HP ZBook Firefly 14 G10 A Lenovo LOQ 15APH8 Ryzen 5: AMD Ryzen 5 7640HS, 15.60\", 2.5 kg\n  External Review » Lenovo LOQ 15APH8 Ryzen 5 » Comparison of GPUsDetailed list of all laptop GPUs sorted by class and performance. » Benchmark ListSort and restrict laptop GPUs based on performance in synthetic benchmarks. » Notebook Gaming ListPlayable games for each graphics card and their average FPS results. * Approximate position of the graphics adapter Top 10 LaptopsMultimedia, Budget Multimedia, Gaming, Budget Gaming, Lightweight Gaming, Business, Budget Office, Workstation, Subnotebooks, Ultrabooks, Chromebooks under 300 USD/Euros, under 500 USD/Euros, 1,000 USD/Euros, for University Students, Best Displays Top 10 SmartphonesSmartphones, Phablets, ≤6-inch, Camera Smartphones "
}