{
    "title": "New AMD Ryzen 5 benchmarks surprisingly beat popular GPU",
    "date": "1/5/2024",
    "url": "https://www.windowscentral.com/hardware/cpu-gpu-components/amds-next-cpu-features-an-internal-gpu-that-outranks-one-of-the-worlds-most-popular-graphics-cards",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Ryzen 5 8600G benchmarks show the processor beating the popular NVIDIA GeForce GTX 1060. AMD will announce its new Ryzen 8000G processors at CES 2024 if leaks, reports, and rumors turn out to be accurate. CES starts next week on January 9, so we likely won't have to wait that long to get official word from AMD about the chips, but that hasn't stopped the rumor mill from churning out some juicy tidbits. According to benchmarks, we now have details about the Ryzen 5 8600G. The Ryzen 5 8600G features integrated graphics, so it's not supposed to compete with powerhouse GPUs. That being said, its benchmarks are respectable and defeat the still-popular NVIDIA GeForce GTX 1060. The Ryzen 5 8600G scored 30,770 on Geekbench 6.2.2's Vulkan benchmark test and 24,842 on Geekbench's OpenCL test. Those scores place the Ryzen 5 8600G above the GTX 1060 on the Vulkan side of things but below the GTX 1060 in the OpenCL benchmark. In addition to showing how far integrated graphics have come, the scores also show how impressive discrete graphics cards can be. The GTX 1060 came out almost eight years ago. Our colleagues at Tom's Hardware put together the above chart to place the benchmarks of the Ryzen 5 8600G with Radeon 760M in context. The Ryzen 5 8600G that was benchmarked had Radeon 760M integrated graphics with a clock speed of 2.8Ghz. The system also features two 16GB DDR5-6000 DIMMs. Previous leaks by X users momomo_us stated that the Ryzen 5 8600G will cost between $236 and $281. That same leak included prices for the upcoming Ryzen 7 8700G ($338-$402) and Ryzen 5 8500G ($190-$219). At first it may seem odd to compare AMD's Ryzen 5 8600G to the NVIDIA GeForce GTX 1060. In addition to the fact that I'm comparing a discrete GPU to integrated graphics, the GTX 1060 came out in 2016. So, why the comparison? Even in 2024, the RTX 1060 is the third-most used GPU by Steam gamers. All the latest news, reviews, and guides for Windows and Xbox diehards. The GTX 1060 held the top spot for ages. Despite coming out in the middle of last decade, it was the most used GPU among Steam gamers until December 2022. It has since dropped to third place, which is more than respectable for a graphics card pushing eight years old. While the best graphics cards are much newer, they're also much more expensive. Plus, PC gamers who built their own system with a GTX 1060 inside can just keep using that GPU and PC to enjoy their favorite games. Sure, anyone with an GTX 1060 will have to drop settings for most games to their lowest option, but that's fine for some titles. Since Ryzen 5 8600G has better benchmarks than the GTX 1060, that means PCs with the new processor inside can game, at least on paper. The benchmarks of AMD's new CPU suggest that it can power systems that handle at least as many games as the third-most popular GPU among Steam users. The new AMD chip didn't just beat the GTX 1060, it did so while being more efficient. PCs with the new processor inside will also have other modern features, like DDR5 memory. Sean Endicott brings nearly a decade of experience covering Microsoft and Windows news to Windows Central. He joined our team in 2017 as an app reviewer and now heads up our day-to-day news coverage. If you have a news tip or an app to review, hit him up at sean.endicott@futurenet.com. Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}