{
    "title": "Best motherboard for RX 7900 XTX & RX 7900 XT (2024)",
    "date": "1/2/2024",
    "url": "https://www.videogamer.com/tech/motherboard/best-for-rx-7900-xtx-rx-7900-xt/",
    "text": "Posted in Tech Video Gamer is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more Shop on Amazon Shop on Amazon Shop on Amazon Like many others, when a new graphics card releases you’re likely tempted to build a whole new gaming rig around it, and often the first thing you’re going to want is the best motherboard for RX 7900 XTX or your RX 7900 XT. Recent releases of Intel 12th & 13th Gen and Ryzen 7000-series CPUs have ushered in new paradigms of LGA 1700 and AM5 chipset compatibility, so we’re going to be looking for options that both accommodate the new launches, whilst also considering those looking to build gaming PCs with older components. RAM DDR5 Compatible processors Intel Celeron, Intel Pentium Gold Chipset Type Intel Z790 Memory Clock Speed 7800 MHz CPU socket LGA 1718 RAM DDR5 Compatible processors AMD anthlon Chipset type AMD X670 CPU socket LGA 1718 RAM DDR5 Compatible processors AMD anthlon Chipset type AMD X670 CPU Socket Socket TR4 RAM Technology DDR5 Chipset Type AMD X670 Memory Clock Speed 6600 MHz RAM DIMM Compatible processors AMD 3rd gen Ryzen Chipset Type AMD X570 Memory clock speed 4400 MHz If you’re struggling to decide which is the best CPU to pair with your RX 7900 XTX or RX 7900 XT, you’re either hesitating between a Ryzen 7000 series CPU or a Raptor Lake Intel CPU. Once you have decided on your CPU – you’re then going to be tasked with deciding which motherboard best compliments it alongside the RDNA 3 GPU of your choice. Whichever it is, we hope to have options that suit you. Without further ado, here are our picks for the best motherboard for RX 7900 XTX & RX 7900 XT. Once you managed to buy an RX 7900 XTX or an RX 7900 XT, to build the best gaming PC around it you’re going to want to pick one of the best motherboards we’ve listed below. We have provided options covering LGA 1700 and AM5 chipsets, the best options for gaming, future-proofing, compatibility with PCIe 5.0, and budget options that might minimize the costs of a whole new gaming rig. RAM DDR5 Compatible processors Intel Celeron, Intel Pentium Gold Chipset Type Intel Z790 Memory Clock Speed 7800 MHz The ASUS ROG Maximus Z790 is a motherboard designed specifically for Intel 13th Gen CPUs, though 12th Gen is fully compatible with the LGA 1700 socket.One of the main features that drives this motherboard’s position is the compatibility with PCIe 5.0 and the complete reduction of any data transfer bottle-necks between CPU and motherboard. If you’re building a high end gaming PC, and you’ve settled for an Intel i9-13900K, the best motherboard to pair with your RX 7900 XTX or RX 7900 XT is the ASUS ROG Maximus Z790. There’s a fairly straightforward answer here – no, you don’t need a Z790 motherboard for RX 7900 XTX or RX 7900 XT card. The only reason you might need a Z790 card is if you’re sporting an Intel 13th Gen Raptor Lake CPU and you want to make the most of the PCIe 5.0 data bandwidth capabilities. If you’re on an Intel 12th Gen CPU, you’ll be perfectly happy with a Z690 motherboard instead. Read Now: RX 7900 XTX vs RX 7900 XT CPU socket LGA 1718 RAM DDR5 Compatible processors AMD anthlon Chipset type AMD X670 The ASUS ROG Crosshair X670E Extreme is by far the best AMD & AM5 chipset motherboard available at the moment, and probably the highest-end AM5 motherboard fit for commercial use at the moment. The price is high, so you might be wondering how does the product justify the price tag? It is fully compatible with DDR5 RAM, supporting speeds up to 7400MHz – which speaks volumes for itself.Like the Z790 motherboards, the X670E motherboards also are fully compatible with PCIe 5 on the 16x slot, and there’s full support for any M.2 SSDs you’ll probably be loading your OS and games from. The motherboard is fully future-proofed in this sense, with PCIe 5.0 being one of the main features the Z670E brings. Read Now: RX 7900 XTX vs RTX 4080 CPU socket LGA 1700 Compatible devices 12th Gen Intel Core RAM DDR5 Chipset type Intel Z690 Form Factor: EATX | Power Stages: 20 + 2 | Connectivity: 2 x USB4, 10GbE Ethernet, Wi-Fi 6E adapters | M.2 & PCIe x 16 Slot | Memory Type: DDR5 If you’re looking for the best budget Intel motherboard for the RX 7900 XTX & RX 7900 XT, the Gigabyte Z690 Aorus Ultra is your best option. With limited support for PCIe 5.0 and full compatibility with DDR5 memory, this is a fantastic option if you’re looking for a motherboard that pairs well with an Intel 12th Gen CPU, or perhaps you’ve bagged a 13th Gen and don’t think you’ll need to make full use of PCIe 5.0 – which, the truth is, most people won’t. The 16+1+2 power phase design is welcome, whilst there’s connectivity options for 4 x NVMe PCIe M.2 ports. If you’re thinking about picking up an older 12th Gen Intel CPU, and you’re looking to limit the costs of your new RX 7900 XTX or RX 7900 XT gaming rig – this is the motherboard for you. Read Now: RX 6950 XT vs RX 7900 XTX CPU Socket Socket TR4 RAM Technology DDR5 Chipset Type AMD X670 Memory Clock Speed 6600 MHz The board offers full compatibility with PCIe 5.0 – though only offers a single slot for this. DDR5 compatibility is another huge advantage with a max memory speed of 6600MHz and max capacity of 128GB. There are also integrated graphics, though your RX 7900 XTX or RX 7900 XT entirely negates the need for this. The low price of this motherboard is the biggest determining factor in choosing it – and if you’re already spending upwards of $1,000 on the graphics card and the CPU – this is a fine choice to negate further expenses. RAM DIMM Compatible processors AMD 3rd gen Ryzen Chipset Type AMD X570 Memory clock speed 4400 MHz The ASUS ROG Strix X570-F is the best AM4 motherboard for RX 7900 XTX & RX 7900 XT, with support for PCIe 4.0 and its comparatively cheap price-tag next to the prior mentioned goliath motherboards. Costing upwards of $300, you’re still not exactly skimping on quality or price here, though with that comes some quality-assured features making this a very desirable motherboard for your RX 7900 XTX or RX 7900 XT gaming rig. These features include a 12+2 digital power phase design so your AM4 CPU is going to be sufficiently fuelled, AURA Sync RGB, an M.2 expansion card, dual M.2 SSD slots, and bounds of external connectivity including but not limited to Display Port 1.2 and HDMI 2.0. GPUs are connected to motherboards via a PCIe slot which exchanges data with the other components – CPU, Memory, Storage, via PCIe. The graphics card is attached to the motherboard via the PCIe X16, where the 16 represents the amount of lanes that the slot is linked to. Each lane is limited by how much data it can transfer. This is called bandwidth. This determines the speed and volume of data which is transferred between components via the lanes. So, if a lane has faster speed and higher bandwidth, the rate of data transfer is much, much higher. PCIe 5.0 has almost 2x the bandwidth of PCIe 4.0, which you can read more about here, though the RX 7900 XTX & RX 7900 XT don’t have the capabilities to utilise the bandwidth offered by PCIe 5.0. So, to summarise, PCIe 5.0 won’t affect how your RX 7900 graphics card performs as PCIe 4.0 is the bottleneck. All of the motherboards on this list offer PCIe 4.0, so you don’t have to worry. You can read more about motherboard parts here, as WePC’s CPU and motherboard specialist Jack Howarth has compiled a comprehensive list and guide. Read Now: Will RDNA 3 be PCIe 5.0? How do I know if a graphics card is compatible with my motherboard? For a graphics card to work with a motherboard, the GPU needs a PCI Express X16 slot, and thankfully all of the motherboards on this list have that very slot. Can I add multiple GPUs to my motherboard? If you’re seeking to add a second GPU to your motherboard, you’re going to firstly need to find a motherboard with two PCI Express X16 slots, which the ASUS ROG Maximus Z790 has. You’ll also need an SLI bridge to connect the two graphics cards. Are there PCIe 5.0 motherboards? Yes – Intel’s 12th and 13th generation Core processors, a.k.a, “Alder Lake” and “Raptor Lake,” support PCIe 5.0. The same goes for Ryzen’s 7000 series. If you’re confused about the difference between PCIe 5.0 and 4.0, check out our article here. Amaar loves retro hardware and boring games with more words than action. So, he writes about them daily. "
}