{
    "title": "AMD Zen 5 chips could turn up in April, but you'll have to be patient for \nthe most powerful next-gen desktop CPUs",
    "date": "1/26/2024",
    "url": "https://www.techradar.com/computing/cpu/amd-zen-5-chips-could-turn-up-in-april-but-youll-have-to-be-patient-for-the-most-powerful-next-gen-desktop-cpus",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. 3D V-Cache versions of Zen 5 may not be here until the start of 2025 AMD’s Zen 5 desktop processors (perhaps Ryzen 9000 models) might just be announced as soon as April, but there could be a long wait before 3D V-Cache variants subsequently turn up. RedGamingTech (RGT) on YouTube has been spilling more details on Zen 5 (which could still also be called Ryzen 8000), though much of this is a recap on existing rumors – though some of it is news to us. We were expecting Zen 5 CPUs to debut perhaps in the middle of the year at the earliest – most likely Q3 (they have gone into mass production, by the way) – but the suggestion from RGT is that Zen 5 silicon could arrive as soon as April. And admittedly, maybe as late as June, which would align more with what we’ve been hearing elsewhere. Whatever the case, it’s going to be a long pause before the X3D (3D V-Cache-toting) models follow up on that launch, as these won’t pitch up until the start of 2025 (at CES) according to regular hardware leaker Kepler on X (formerly Twitter). X3D is CES 2025.January 23, 2024 RGT also recaps that we can expect Zen 5 to be a robust 10% to 15% performance boost over the current generation. It’ll keep the same core configurations through the range as the existing Ryzen 7000 CPUs. You may notice in the above tweet that Kepler is replying to another leaker on X (called High Yield) who floats the idea that next-gen X3D processors could come out hot on the heels of the vanilla Zen 5 CPUs (or maybe even at the same time). That doesn’t feel right to us, and we don’t see why AMD wouldn’t go with the usual sizeable gap between these launches, as Kepler (and RGT) expect. With Ryzen 7000, the standard processors launched in September 2022, to be followed by X3D variants in February 2023, a gap of five months. Assuming a July 2024 launch for Zen 5 CPUs, a January 2025 reveal for X3D would be about right. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. It makes more sense to hit Intel with Zen 5, wait for the Arrow Lake response (theoretically late in 2024), then punch back again with Zen 5 X3D (after having given Zen 5 vanilla chips a good amount of time to sell with no interference). As to the idea of an April launch, that feels off to us, as well. Next-gen desktop CPUs arriving from AMD in three months’ time? Well, it could happen, we suppose, or rather an initial unveiling might, before the processors hit shelves maybe a couple of months later. Whatever the case, AMD certainly appears to have the upper hand for the next-gen release timeframe, as Arrow Lake rumors are all pointing to late in the year for Intel’s next desktop contenders. That said, speculation around Arrow Lake being a big step forward has been pretty rife, so this could be a launch that sees Intel really grab hold of our list of the best processors. Indeed, we’d argue that it has to be, given that Intel’s current-gen Raptor Lake Refresh was a pretty ‘meh’ affair (just a simple refresh, as the name suggests), and Zen 5 will call for a potent fightback from Team Blue. Darren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013). AMD could release faster versions of last-gen Ryzen CPUs that are perfect for budget builds and upgrades An excellent AMD budget gaming CPU is now on sale for less than $200 at Walmart Apple tipped to launch new iPads in May By Rhys WoodMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By James IdeMarch 28, 2024 By Mackenzie FrazierMarch 28, 2024 By Kristina TerechMarch 28, 2024 By Craig HaleMarch 28, 2024 By Darren AllanMarch 28, 2024 By Nigel PowellMarch 28, 2024 By Steve ClarkMarch 28, 2024 By Jody BaileyMarch 28, 2024 By Craig HaleMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}