{
    "title": "Why Are AMD (AMD) Shares Soaring Today",
    "date": "1/19/2024",
    "url": "https://finance.yahoo.com/news/why-amd-amd-shares-soaring-210311053.html",
    "text": "Shares of computer processor maker AMD (NASDAQ:AMD) jumped 5.1% in the afternoon session after Raymond James maintained a Strong Buy rating and raised the price target on the stock from $140 to $190. The price target represents a potential 10% upside from where shares traded when the update was announced. Separately, stocks rallied as the S&P 500 index reached an all-time high, gaining 1.1%. The tech-focused Nasdaq index also gained 1.5% as we head into a new earnings season, with early indicators pointing to a potential turning point for semiconductor stocks after the challenges in 2023. Is now the time to buy AMD? Access our full analysis report here, it's free. AMD's shares are very volatile and over the last year have had 23 moves greater than 5%. In context of that, today's move is indicating the market considers this news meaningful but not something that would fundamentally change its perception of the business. The previous big move we wrote about was 1 day ago, when the company gained 5.3% on the news that peer, Taiwan Semiconductor Manufacturing Company reported strong Q4'2023 results that exceeded Wall Street's revenue and EPS expectations. During TSMC's earning call, CEO C.C. Wei added, \"2023 was a challenging year for the global semiconductor industry, but we also witnessed the rising emergence of generative AI-related applications, which TSMC as a key enabler.\" Looking ahead, the company expects revenue to grow in the low-to-mid 20% range in 2024, supported by \"strong demand for nanometer technologies and robust AI-related demand.\" This suggests a possible turning point for the semiconductor sector as we approach the upcoming earnings season, considering the challenges observed toward the end of 2023. AMD is up 25.8% since the beginning of the year. Investors who bought $1,000 worth of AMD's shares 5 years ago would now be looking at an investment worth $8,821. Do you want to know what moves the stocks you care about? Add them to your StockStory watchlist and every time a stock we cover moves more than 5%, we provide you with a timely explanation straight to your inbox. It's free and will only take you a second. Related Quotes "
}