{
    "title": "AMD Ryzen 7 8700G and Ryzen 5 8600G Review: Zen 4 APUs with RDNA3 Graphics",
    "date": "1/29/2024",
    "url": "https://www.anandtech.com/show/21242/amd-ryzen-7-8700g-and-ryzen-5-8600g-review/6",
    "text": "Rendering tests, compared to others, are often a little more simple to digest and automate. All the tests put out some sort of score or time, usually in an obtainable way that makes it fairly easy to extract. These tests are some of the most strenuous in our list, due to the highly threaded nature of rendering and ray-tracing, and can draw a lot of power. If a system is not properly configured to deal with the thermal requirements of the processor, the rendering benchmarks are where it would show most easily as the frequency drops over a sustained period of time. Most benchmarks, in this case, are re-run several times, and the key to this is having an appropriate idle/wait time between benchmarks to allow for temperatures to normalize from the last test. Some of the notable rendering-focused benchmarks we've included for 2024 include the latest CineBench 2024 benchmark and an update to Blender 3.6 and V-Ray 5.0.2. We are using DDR5-5200 memory as per the JEDEC specifications on the Ryzen 7 8700G and Ryzen 5 8600G, as well as DDR4-3200 on the Ryzen 7 5700G and Ryzen 5 5600G. The same methodology is also used for the AMD Ryzen 7000 series and Intel's 14th, 13th, and 12th Gen processors. Below are the settings we have used for each platform:  Another area where a mobile-based chip ported to a desktop doesn't quite match the bigger desktop chips is in rendering, a quintessential power and multi-threaded scenario where more cores and threads typically equate to higher performance. Both the Ryzen 7 8700G and Ryzen 5 8600G beat out the Ryzen 5000G series APUs, although the Ryzen 7 5700G consistently beats the Ryzen 5 8600G as we would expect from having two more cores with four more threads. In our rendering tests without STAPM limitations, we saw notable gains in performance in Blender 3.6. The performance increase without sustained power loads being limited, we're seeing up to 7.5% better performance across the longer tests, with around 5% more performance in the shorter tests. "
}