{
    "title": "Intel, AMD Unveil New AI Chips to Beat Nvidia's H100",
    "date": "1/3/2024",
    "url": "https://www.cdotrends.com/story/3730/intel-amd-unveil-new-ai-chips-beat-nvidias-h100",
    "text": "Intel and AMD are doubling down on AI and taking wraps off new AI processors as they seek to take on Nvidia and garner a slice of the burgeoning AI pie. Intel has taken the wraps off Gaudi3, an AI chip for generative AI software due to launch later this year to compete with the likes of Nvidia’s H100 flagship, though details are light at this point. In addition, Intel also unveiled new CPUs that will come with an NPU, or a neural processing unit, for “low-power AI acceleration and CPU/GPU off-load”. The idea is for the NPU to perform certain AI-powered tasks, like background blur, eye tracking, and picture framing locally. On its part, AMD has launched its MI300X chip, which it touts as “the most advanced AI accelerator in the industry”. AMD expects its MI300 chips to be its fastest product to hit USD1 billion in sales, a feat it believes it can achieve around mid-2024. Crucially, OpenAI in a statement says it plans to support AMD’s GPUs such as the MI300. So how good is the MI300? “On raw specs, MI300X dominates H100 with 30% more FP8 FLOPS, 60% more memory bandwidth, and more than 2x the memory capacity,” wrote Dylan Patel and Daniel Nishball at semiconductor consulting firm SemiAnalysis. Patel and Nishball expect AMD’s[ ]()performance to keep growing against the H100. In other news, Nvidia has launched a modified “D” version of its most advanced gaming chip to comply with US export controls targeting China. The new “GeForce RTX 4090 D” is currently available to Chinese customers. Export rules unveiled by the US government last October meant that the modified AI chips created by Nvidia to meet the previous export rules, the A800 and H800, were blocked from sale. This includes its highest-end gaming chip, the RTX 4090, typically used by gamers. \"The GeForce RTX 4090 D has been designed to fully comply with US government export controls. While developing this product, we extensively engaged with the U.S. government,” says a Nvidia spokesperson. Nvidia currently commands more than 90% share of China's USD7 billion AI chip market, according to a report from Reuters. Aggressive US curbs on AI chips are incentivizing Chinese firms such as Huawei to design and manufacture its own AI chips. Image credit: iStockphoto/JHVEPhoto Paul Mah is the editor of DSAITrends, where he report on the latest developments in data science and AI. A former system administrator, programmer, and IT lecturer, he enjoys writing both code and prose. Copyright ©2018 - 2023 CDOTrends. All Rights Reserved. "
}