{
    "title": "Stocks Fall On China Weakness; Nvidia Drops As Cathie Wood Sells AMD Shares",
    "date": "1/17/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-falls-on-china-weakness-nvidia-tesla-fall/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     A strong retail sales report couldn't keep the Dow Jones Industrial Average and other major indexes from falling Wednesday, as disappointing economic data from China shook the markets. Dow Jones stocks were trading 0.2% lower, while the S&P 500 was off 0.6% on the stock market today. Among the S&P's 11 sectors, consumer staples and health care did better than others. Meanwhile, the Nasdaq composite trimmed losses to 1% by midday. The small-cap Russell 2000 index also underperformed with a 1% fall. Volume was lower on the New York Stock Exchange and the Nasdaq compared with the same time on Tuesday. Breadth was poor, with decliners beating advancers by nearly 3-to-1 on both exchanges. The Innovator IBD 50 (FFTY) exchange traded fund was 1.1% lower. But the yield on the benchmark 10-year Treasury note jumped 3 basis points to 4.11% A gross domestic product report from China disappointed investors in the early going. While China's economy came off Covid lockdowns, the nation's GDP for 2023 grew only 5.2% from the year before. That was its slowest rate since 1976, with the exception of Covid-plagued 2020. GDP for the fourth quarter was also 5.2%, slightly below expectations. That contrasted with the Commerce Department's Wednesday report, which said U.S. retail sales growth for December came in at 0.6%, above Econoday estimates for 0.4%. Excluding autos, retail sales rose 0.4% vs. views of 0.2%. Excluding both autos and gas, retail sales rose 0.6% ahead of forecasts for 0.3%. Adding to the sell-off were words Tuesday from Federal Reserve Gov. Christopher Waller, who cautioned against speedy rate cuts this year. According to the CME FedWatch Tool, the odds of a 25-basis-point rate cut in March now stands at 42.9%. Health care and bank leaders rose in the Dow. Merck (MRK) and UnitedHealth (UNH) gained. Boeing (BA) rose nearly 1% after a big sell-off in recent days. JPMorgan Chase (JPM) was off slightly and remains near the top of its buy zone. Outside the Dow, Interactive Brokers (IBKR) pared early losses and rose more than 2% after fourth-quarter results. Shares are in a cup with handle that has a buy point of 89.72. Another financial firm, Charles Schwab (SCHW) fell below the 50-day moving average in strong volume and triggered a sell signal. The stock attempted a breakout from a cup earlier at a buy point of 68.80 but had been slipping ahead of earnings. Progress Software (PRGS) rebounded from its 50-day line after reporting fourth-quarter earnings. Sales grew 13% while earnings of $1.02 per share declined 9% from the prior year quarter. For the first quarter, the company expects revenue of $182 million with earnings of $1.16 cents per share. Tesla (TSLA) fell nearly 3% after announcing further price cuts in Europe, which is likely to affect gross profit margins. Tesla is cutting its prices on the Model Y Long Range and Model Y Performance in Germany by $5,400 after making similar cuts last week in China. Futures: Nasdaq Holds Key Level; 17 Stocks To Watch Among the Magnificent Seven stocks, Nvidia (NVDA) was down 1.4%. Alphabet (GOOGL), Meta Platforms (META) and Amazon (AMZN) slipped as well. Meanwhile, Cathie Wood's ARK Next Gen Internet ETF (ARKW) sold shares of Advanced Micro Devices (AMD) on Tuesday, according to the company's disclosures. AMD gained 128% in 2023 and is up 7% so far in January. Also outside the Dow Jones index, several stocks in the IBD 50 took a dive. Among software leaders in the IBD 50, CrowdStrike (CRWD), Samsara (IOT), Cloudflare (NET) and Monday.com (MNDY) all dropped 2% or more. MercadoLibre (MELI) also lost 2%. Further, PDD (PDD) fell more than 2%, joining other Chinese stocks in the sell-off. The China e-commerce giant pared some earlier losses. Please follow VRamakrishnan on X/Twitter for more news on the stock market today. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders MarketSmith: Research, Charts, Data And Coaching All In One Place How To Research Growth Stocks: Why This IBD Tool Simplifies The Search For Top Stocks</ 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}