{
    "title": "AMD Ryzen 8000G series with Radeon graphics and Ryzen AI, new Ryzen 5000 \nSeries including 5700X3D announced",
    "date": "1/9/2024",
    "url": "https://www.fonearena.com/blog/413678/amd-ryzen-8000g-series-price-features.html",
    "text": "Fone Arena The Mobile Blog  AMD has introduced its new Ryzen 8000G Series desktop processors based on Zen 4 cores for the AM5 platform with built-in Radeon graphics and Ryzen AI, including the Ryzen 7 8700G, which the company says is the world’s most powerful built-in graphics. The top-end AMD Ryzen 7 8700G features eight cores, 16 threads, 24MB of Cache, and Radeon 780M graphics, the AMD Ryzen 5 8600G offer six cores, 12 threads, 22MB of Cache, and Radeon 760M graphics. Both these feature AMD Ryzen AI technology, including the first NPU on a desktop PC processor, uniquely able to accelerate AI software capabilities in your PC to optimize AI workloads, improve AI processing efficiencies, and unlock exciting experiences like AI-powered noise cancellation, said the company.  All 8000G Series feature Radeon 700M graphics that promise a smooth AAA 1080p gaming experience. The AMD Ryzen 8000G Series desktop processors are expected to roll out starting January 31st, 2024 and the OEM systems are expected to arrive in Q2, 2024.  At the event, AMD also introduced Ryzen 5000 Series desktop processors based on “Zen 3” architecture. These include Ryzen 7 5700X3D, Ryzen 5 5700, AMD Ryzen 5 5600GT, and AMD Ryzen 5 5500GT. The AMD Ryzen 7 5700X3D is purpose-built for gamers looking for a massive boost in gaming performance. With eight cores and 16 threads, the processor leverages AMD 3D V-Cache technology to deliver an astonishing 100MB of on-chip memory, providing power and productivity gains for games and applications at any setting and any resolution, said the company.  There are new 5600GT and 5500GT that have similar specs to the 5600G/GE chips and the same Radeon Vega 7 integrated graphics. However, the Ryzen 5 5600GT has a 300 MHz slower base frequency than the Ryzen 5 5600G but has a 200 MHz faster turbo core clock speed. The Ryzen 5 5500GT has the same 3.6 GHz base frequency as the 5600GT, and features the same 4.4 GHz turbo frequency as the 5600G. The new Ryzen 5000 Series desktop processors are expected to roll out starting January 31st, 2024. Srivatsan Sridhar is a Mobile Technology Enthusiast who is passionate about Mobile phones and Mobile apps. He uses the phones he reviews as his main phone. You can follow him on  Twitter and Instagram \n\t\t\t\tView all posts by Srivatsan Sridhar "
}