{
    "title": "AMD debuts AI-focused Ryzen 8000G desktop chips at CES 2024",
    "date": "1/8/2024",
    "url": "https://finance.yahoo.com/news/amd-debuts-ai-focused-ryzen-8000g-desktop-chips-at-ces-2024-153139652.html",
    "text": "AMD (AMD) is bringing the AI PC race to the world of desktop computers at CES 2024 with the debut of what it says is the world’s first desktop processor with a dedicated neural processing unit (NPU). Coming to AMD’s upcoming Ryzen 8000G series chips, which hit the market Jan. 31, the NPU is designed to handle AI-based tasks on your desktop computer without having to send data to the cloud. Apple (AAPL) already offers a dedicated neural engine in its M line of processors for its Mac laptops and desktops, but AMD says it’s the first to put a dedicated NPU in an x86 desktop chip. Apple’s chips are based on ARM processors. The AI PC revolution is seen as the next major growth area for the PC industry, as manufacturers and developers lean into the massive explosion in interest in AI following the debut of ChatGPT in 2022. AMD, Intel (INTC), and Qualcomm (QCOM) have each already debuted their own laptop chips with AI capabilities, but AMD is the first to bring that to the desktop. What exactly that does for consumers, though, is still largely up in the air. Sure, there are a handful of programs that take advantage of the neural engines available in AI PCs, but chipmakers are depending on developers to pump out a swath of applications that put their NPUs to the test. According to chipmakers, using an onboard NPU means that you’ll be able to run generative AI applications on your device rather than in the cloud. That should mean that your data will stay secured on your own system, rather than having to send it to a third-party company’s servers where it could also be used to train that firm’s AI systems. Cloud-based AI services can also require fees to process some requests, something that onboard AI programs won’t. It’s not just chipmakers, either. Ahead of CES, Microsoft (MSFT) announced that it and its PC partners are bringing dedicated Copilot buttons to Windows laptop and desktop keyboards. The first major change to the Windows keyboard in three decades, the Copilot button will call up Windows’ built-in Copilot AI assistant. In addition to the Ryzen 8000 series’ NPU, AMD says the chip also packs the world’s fastest integrated desktop graphics processor. That means you’ll be able to play games like “Cyberpunk 2077” and “Far Cry 6” at frame rates of more than 60 frames per second. The caveat here, though, is that you’ll have to opt for the high-end Ryzen 7 8700G version of the chip with a built-in Radeon 780M GPU and set the games’ performance to low with a resolution of 1080p. If you’re a serious gamer, you’re still going to want to purchase a separate, dedicated graphics card. But the fact that you can even run those games on an integrated GPU is still impressive. The new chips are also another shot at rival Intel as that company navigates its turnaround efforts and attempts to gain back market share it’s lost to AMD. Shares of AMD have jumped 122% over the last 12 months as of the close of trading on Friday. Intel's stock price has climbed just 70% over the same period. Neither chipmaker, however, can touch Nvidia's (NVDA) performance. That company's shares have rocketed 244% over the last year. Read more coverage from CES 2024: Nvidia debuts RTX 40 Super chips to power gaming and AI efforts at CES 2024 AMD debuts AI-focused Ryzen 8000G desktop chips at CES 2024 Microsoft is adding an AI button to PC keyboards, their first major change in 30 years From AI to flying cars, here’s what to expect at CES 2024 Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}