{
    "title": "AMD Radeon RX 7000M GPUs missing from new gaming notebooks at CES 2024",
    "date": "1/12/2024",
    "url": "https://videocardz.com/newz/amd-radeon-rx-7000m-gpus-missing-from-new-gaming-notebooks-at-ces-2024",
    "text": "GeForce RTX 40 Laptop GPU series grab spotlight, no love for Radeon 7000M, reports ComputerBase.  Four months before CES 2024 AMD had presented its latest RDNA3 GPU called Navi 32. This GPU is now used in Radeon RX 7800XT and RX 7700XT graphics cards for desktops, both already available on the market. Navi 32 arrived nearly a year after Navi 31, the flagship GPU which was later modified and shrunk for Radeon RX 7900M graphics card for laptops. The current Navi 3X lineup for laptops features only two GPUs: Navi 33 and Navi 31, with Navi 32 clearly absent. Before CES, it was believed that AMD will introduce its mid-range Radeon 7000M cards based on this GPU, filling the large gap in the series and possibly giving AMD OEM partners something to announce at CES 2024. Sadly, that wasn’t the case. At CES 2024 there was not a single new laptop featuring Radeon RX 7000M graphics card, as reported by ComputerBase. AMD GPU series were absent from new laptops and some existing models that featured such graphics exclusively, like Alienware m16 R2 and m18 R2 or ASUS TUF Gaming A16 2024, have even switched to GeForce RTX 40 entirely. To make things worse, NVIDIA did not even announce new cards, as the SUPER refresh was only for desktop GPUs. The year 2023 was particularly bad for AMD mobile GPUs, despite introducing four Radeon SKUs: 7700S, 7600S, 7600M and 7600M XT, with only one laptop being available on the German market (TUF 16 by ASUS) after this launch. Later, only one laptop was added to price comparison tools, which is Alienware m16 R1, leaving customers with only these two options. The year 2024 is off to an even worse start. As the CES 2024 comes to a close, the answer is clearly “No.” Not only, according to the editorial team’s knowledge, have there been no new notebooks with Radeon RX 7000 Mobile, but also, the m16 R2 and m18 R2 have switched to a pure GeForce RTX 4000 offering – at least currently, the RDNA-3 configurations are no longer available. The same applies to the new Asus TUF Gaming A16 (2024), which, in combination with an AMD Dragon Range (7x45HX) processor, was a flagship AMD Advantage product just a year ago. However, it has maintained the Ryzen 9 7945HX as the CPU. There is also no sign of the Corsair Voyager a1600 (Test) from 2022, which was personally introduced by AMD CEO Dr. Lisa Su with an AMD Ryzen 6900HS and Radeon RX 6800S, or any successor. — ComputerBase The only good news is that there are new devices with Radeon 7000M series, such as products from Geekom, Peladn and Minisforum have all confirmed their plans for Radeon RX 7600M XT-based gaming Mini-PCs. There is also an external GPU solution called OneXGPU which is expected to be launched this quarter. The only issue is that none of them is a gaming laptop, but a Mini-PC or external GPU. AMD is now preparing to launch its Radeon RX 7600 XT desktop GPU, again featuring Navi 33, on January 24th. Along with this update, AMD will release a new driver that finally enables Fluid Motion Frames (Frame Generation) tech in a public driver. It appears that this is the only major news coming from the AMD GPU division this quarter. Source: ComputerBase We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}