{
    "title": "PowerColor reveals its RX 7900 XT Hellhound Spectral White GPU",
    "date": "2/6/2024",
    "url": "https://overclock3d.net/news/gpu-displays/powercolor-launches-their-radeon-rx-7900-xt-hellhound-spectral-white-edition-gpu/",
    "text": " Following on from the success of their Radeon RX 7800 XT Spectral White Edition graphics card (see our review of this card here), PowerColor has now expanded their Spectral White range with a new RX 7900 XT model. Meet the RX 7900 XT Hellhound Spectral White Edition. With a white heatsink, PCB, I/O cover, and more, PowerColor’s new RX 7900 XT graphics card will look great in any white-themed PC. The graphics card also features a hefty overclock, offering users a game clock of up to 2130 MHz and a boost clock of 2500 MHz. That’s a 130 MHz game clock and 100 MHz boost clock speed boost over AMD’s reference Radeon RX 7900 XT.  Like all Radeon RX 7000 series graphics card, this new Radeon RX 7900 XT GPU model is based on AMD’s RDNA 3 architecture. This model also features 20GB of GDDR6 memory, AV1 encoding and decoding support, and support for AMD-only features like AMD Fluid Motion Frames, Radeon Anti-Lag, and Radeon Boost. With dual-BIOS functionality, users of this GPU can also choose to utilise this GPU in OC (overclocked) or Silent mode. Both modes feature faster clock speeds than AMD’s reference RX 7900 XT model, but only OC mode can deliver this GPU’s 2500MHz boost clock speed. You can join the discussion on PowerColor’s new RX 7900 XT Hellhound Spectral White Edition on the OC3D Forums. A Northern Irish father, husband, and techie that works to turn tea and coffee into articles when he isn’t painting his extensive minis collection or using things to make other things. No crappy Google banners here, only PC related advertising you may actually find interesting. Please disable Ad Blockers in order for us to keep producing the same level of quality, informational reviews and news. Worst case they actually look pretty and fill the empty gaps <3 "
}