{
    "title": "Orange Pi Neo gaming handheld runs Linux Manjaro OS and packs AMD Ryzen 7 \n7840U APU",
    "date": "2/4/2024",
    "url": "https://www.notebookcheck.net/Orange-Pi-Neo-gaming-handheld-runs-Linux-Manjaro-OS-and-packs-AMD-Ryzen-7-7840U-APU.800174.0.html",
    "text": "Manjaro has detailed a brand-new gaming handheld called the Orange Pi Neo, a brand that’s best known for single-board computers (SBC). As per the official listing on Manjaro’s website, the Orange Pi’s first handheld gaming device will equip the Ryzen 7 7840U APU, an identical processor to the Ryzen Z1 Extreme found in ASUS Rog Ally and Lenovo Legion Go (16/512 GB curr. $649.99 on Amazon). To ensure that the APU can offer its full performance, Orange Pi has integrated a “super cooling” system. Also, Neo pairs the popular gaming handheld processor with up to 32 GB of LPPDR5 RAM, 2 TB of PCIe 4 SSD, and a 50 Wh battery. On the front, the gaming handheld features a 7-inch screen with a 1920 x 1200 pixels resolution, which is lower than the Legion Go, Rog Ally, and Steam Deck (OLED 1 TB curr. $888 on Amazon). But the good news is that the display has a 120 Hz refresh rate and a brightness rating of 500 nits. As for the form factor, Manjaro’s website says that the Orange Pi Neo is “ultra small and ultra slim.” The “ultra” term may be a bit too exaggerated here as, according to the dimensions on the listing, the gaming handheld measures 259 x 107 x 19.9 mm. We already have devices close to these measurements, such as the Ayaneo Air 1S (224 x 89.5 x 21.6 mm). But yes, Neo is definitely on the smaller side. Regarding the operating system, the Neo gaming handheld runs on the Manjaro OS, a relatively popular Linux distribution. But there could be other variants with different OS too. The device is currently being showcased at FOSDEM 2024, and the pricing and availability details are yet to be announced. You can check out the complete spec sheet attached below to learn more. Manjaro via: VideoCardz "
}