{
    "title": "Forget Nvidia: AMD Could Be Super Micro Computer's New Best Friend",
    "date": "2/24/2024",
    "url": "https://finance.yahoo.com/news/forget-nvidia-amd-could-super-181300880.html",
    "text": "Super Micro Computer (NASDAQ: SMCI), more commonly known as Supermicro, has seen its stock skyrocket by 2,220% over the past three years. That stunning rally was fueled by the rapid expansion of the artificial intelligence (AI) market, which drove data center operators to purchase more of its high-performance AI servers. A lot of Supermicro's growth can be directly attributed to Nvidia (NASDAQ: NVDA), which provides the high-end GPUs that process complex machine learning and AI tasks. Nvidia worked closely with Supermicro to design a new line of servers and workstations that fully supported its H100 GPUs, and that tight relationship enabled Supermicro to carve out a high-growth niche with its AI servers in the heavily commoditized market for pre-built servers. Yet Supermicro's dependence on Nvidia is a double-edged sword. It struggled to secure a steady supply of Nvidia's GPUs in early 2023, and its two largest competitors -- Hewlett Packard Enterprise and Dell Technologies -- have also been working with Nvidia to design new AI servers. In its latest 10-K filing, Supermicro admitted that it doesn't hold any long-term agreements with Nvidia or its other suppliers that actually lock them in as exclusive partners. That's why AMD's (NASDAQ: AMD) recent expansion into the data center GPU market might be great news for Supermicro. AMD only controlled about 17% of the discrete GPU market last year, according to Jon Peddie Research, putting it in a distant second place behind Nvidia with its 80% share. AMD's share mainly consists of gaming GPUs for PCs, but it has been expanding its reach into the data center market with its Instinct GPUs for processing AI tasks. AMD rolled out its first batch of Instinct GPUs (the MI6, MI8, and MI25) in 2017. It launched its newest MI300 Instinct GPUs, which are manufactured using TSMC's 5nm and 6nm process nodes, in late 2023. By several industry benchmarks, AMD's high-end MI300X actually beat Nvidia's H100 in terms of raw processing power and memory usage. That's a bright red flag for Nvidia, since the H100, which faces ongoing supply chain constraints, still costs about four times as much as the MI300. Nvidia claims the H100 still beats the MI300 when it's running optimized software, but that slight difference probably won't justify its premium price tag for cost-conscious data center operators. That's why it wasn't surprising when AMD's CEO Lisa Su recently said the MI300 was on track to be the \"fastest revenue ramp of any product\" in the company's history. Su also estimates that AMD's Epyc CPUs have claimed 25% of the server CPU market at the expense of Intel's (NASDAQ: INTC) market-leading Xeons. Between the growth of those two businesses and the expansion of its programmable chip business (from Xilinx), AMD has more data center bundling options than Nvidia. Supermicro already works closely with AMD to design servers for its Epyc CPUs and Instinct GPUs. In November, Supermicro CEO Charles Liang predicted that AMD's MI300 GPUs, Nvidia's latest GPUs, and Intel's Gaudi AI accelerator chips would all \"gain broad adoption and expand our share in the accelerated compute market.\" In January, Liang predicted that ongoing diversification would \"more than double the size\" of the company's AI portfolio. If Supermicro sells more AMD-powered AI servers, it could reduce its long-term dependence on Nvidia and insulate itself from any future supply chain constraints. Competitive pressure from AMD could also drive Nvidia to lower its GPU prices, which would boost Supermicro's gross margins by reducing its component costs. Supermicro already generates about half of its revenue from its AI servers, and Bank of America believes it could expand its share of the dedicated AI server market from 10% today to 17% over the next three years. That's why analysts expect its revenue to grow at a compound annual rate of 42% from its fiscal 2023 (which ended in June) through its fiscal 2026. That's a stunning growth rate for a stock that trades at just 3 times this year's sales. That low valuation already makes Supermicro an attractive long-term play on the AI market, but its gradual diversification away from Nvidia with AMD-powered servers might make it a more balanced play on the AI market than either chipmaker. Should you invest $1,000 in Super Micro Computer right now? Before you buy stock in Super Micro Computer, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Super Micro Computer wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 20, 2024 Bank of America is an advertising partner of The Ascent, a Motley Fool company. Leo Sun has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Bank of America, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Intel and Super Micro Computer and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Forget Nvidia: AMD Could Be Super Micro Computer's New Best Friend was originally published by The Motley Fool Related Quotes "
}