{
    "title": "Acemagic AD15 Mini-PC review: On par with AMD Ryzen 5 6600U thanks to \n6-core Intel Core i5-11500B",
    "date": "2/28/2024",
    "url": "https://www.notebookcheck.net/Acemagic-AD15-Mini-PC-review-On-par-with-AMD-Ryzen-5-6600U-thanks-to-6-core-Intel-Core-i5-11500B.808281.0.html",
    "text": "The Acemagic AD15 is a simple mini PC for home use. It is based on the Intel Core i5-11500B, which is not a cutting-edge SoC, but this is superfluous - the 6-core still offers sufficient performance reserves in 2024. For a price of around 460 US dollars, you also get 16 GB DDR4 RAM and a 1 TB SSD with pre-installed Windows 11 Home Edition. Alternatively, the mini PC is also available with a more powerful Intel Core i7-11800H. There is also a model with a slightly more modern Intel Core i5-12450H. In this review, the Acemagic AD15 competes against already-known competitors, which we have previously tested in detail. You can find a list of the comparison devices for this review in the following table.  The Acemagic AD15 is mostly made of black plastic. There is not much to complain about in terms of workmanship. We couldn't find any noticeable gaps or sharp edges. Nevertheless, due to the choice of materials, the device does not look very high-quality. The Blackview MP200 also only has a simple plastic casing, but it has a much more premium feel, and the Morefine M600 chassis is even mostly made of aluminum. Due to its design, the Acemagic AD15 requires slightly less desk space than most other mini PCs. However, the AD15 is not extremely small, and at 772 grams, our test sample is also one of the heaviest devices in the current comparison. In terms of connectivity, Acemagic only offers the simple standard with the AD15. There are a total of five USB ports, of which the Type-C socket can also be used for image output. There are also two HDMI ports and a LAN socket on the rear. There is currently information that, together with the pre-installed Windows, spyware is to be installed on various mini PCs. Apparently, mini PCs from Acemagic could be affected. As we have also recently tested some of these devices, we are naturally alarmed. However, we were unable to detect any malware on the current test system with an external scan (with Bitdefender) of the data storage. After consultation with the manufacturer, the problem is said to have already been resolved. The manufacturer has already issued a corresponding statement. Unfortunately, the manufacturer does not offer barebone devices, which would easily resolve this problem. However, if you still have a bad feeling, you should completely reinstall the pre-installed operating system immediately after purchase. This process should be carried out on every device anyway, regardless of the manufacturer, as there are often many programs installed ex-works that are not absolutely necessary. The built-in Wi-Fi module comes from Realtek and uses the 5 GHz frequency band and alternatively can also use the 2.4 GHz band. Our test sample performed quite well in the test, although the competition performed slightly better in terms of data reception speed. The performance of the wireless connection is certainly sufficient for everyday use. We carried out this test with our Asus ROG Rapture GT-AXE11000 test router. Alternatively, the Acemagic AD15 also offers a wired connection, which enables a maximum transfer rate of 1 GBit/s. The device is supplied with a 120-watt power supply unit and is therefore ready for immediate use. The scope of delivery also includes an HDMI cable and the power cable. As the Acemagic AD15 is always sold with RAM and SSD, it is generally not necessary to disassemble the device. Nevertheless, the right-hand side seen from the front can be easily dismantled. To do this, two small screws must be removed from the underside, which hold the side panel in place. The RAM and the pre-installed mass storage are then concealed under the side cover. As is easy to see, a second storage drive can also be accommodated. The WLAN module can also be replaced, but the Acemagic AD15 has to be dismantled further for this. With a little skill, however, this is not a major obstacle. Even the complete removal of the circuit board is possible and does not require any special tools. This also allows dust to be removed from the small CPU fan. Acemagic has installed an Intel Core i5-11500B processor from the Tiger Lake series in the AD15. This gives the mini PC a very fast SoC, which promises good performance in terms of power consumption. Together with 16 GB DDR4 RAM and the 1 TB NVMe SSD, everyday tasks are no great challenge. Alternatively, identical models are also available with an Intel Core i5-12450H or an Intel Core i7-11800H. We carried out all performance tests with the maximum power plan. We did not change the performance of the SoC and left it in the delivery state according to the BIOS settings. Energy-saving plans were only used for the power consumption measurements and the noise measurements according to our Test criteria. The Acemagic AD15 is equipped with an Intel Core i5-11500B. However, the SoC is no longer one of the latest and is still based on the Tiger Lake architecture. In the performance comparison, however, our test sample ranks where we had already assumed it would: directly ahead of the Blackview MP200 with the Intel Core i5-11400H. With its 6 cores and 12 threads, the SoC delivers solid multi-core performance. The two 8-cores cannot really stand out in the average performance comparison. The Intel Core i7-11800H and the AMD Ryzen 7 5800H can only prevail in individual tests. In the AIDA64 tests, our test device is in the midfield. Here, the Geekom A5 can clearly set itself apart. According to Intel, the power limit of the Intel Core i5-11500B is 65 watts. Acemagic adheres to this specification, although this value is only used for the short-term Turbo mode. Under continuous load, the power consumption is then reduced to 45 watts. For further comparisons and benchmarks, please refer to our CPU comparison table. * ... smaller is better With the Cinebench R15 continuous loop, we now take a look at the processor's performance under continuous load. Our test device is able to master the first run almost consistently with the higher power target. In all subsequent runs, the power consumption quickly drops to 45 watts, which can then be kept stable. The temperatures of the Intel Core i5-11500B are unproblematic with a peak of 77 °C. In the synthetic benchmarks in terms of system performance, our test sample ranks in the lower midfield. Basically, the Acemagic AD15 based on the Intel Core i5-11500B does not deliver much less performance than its supposedly faster counterpart with the Intel Core i7-11800H. In the synthetic benchmarks, the Acemagic AD15 has a somewhat harder time asserting itself. The mini PC lacks 3D performance in PCMark10, which is why the two devices with AMD processors take the first two places here. In Crossmark, too, it is only enough for third place, although the gap to the Morefine M600 is much smaller here. We see the RAM configuration of the Acemagic AD15 as a weak point. The manufacturer uses two modules, which is basically a good thing. However, these only clock at 2,666 MT/s, which means that our test device is only in the lower midfield in the RAM tests. The use of RAM with a clock rate of 3,200 MT/s would be more optimal. * ... smaller is better The Acemagic AD15 is ideal for playing high-resolution videos. The 4K test video playback went without any problems. The iGPU is utilized at around 25 percent and thus relieves the processor. Our test sample always remains in the green range in terms of the documented latencies. The test system also coped excellently with opening several browser tabs and a stress test with Prime95. * ... smaller is better Our test device contains a 1 TB SSD from an unknown manufacturer. Anyway, the M.2 SSD connected via the PCIe interface, allowing us to achieve comparatively fast transfer rates in the test. This means that Acemagic can now secure second place with the AD15. However, we experienced problems under continuous load. The performance of the SSD cannot be consistently maintained at the initial level. A second mass storage device can be installed in the device, a free 2.5-inch slot is still available. For further comparisons and benchmarks, please refer to our Comparison table. * ... smaller is better Image output is handled by the Intel UHD Graphics Xe with 32 EUs. This quickly makes it clear that not much 3D performance can be expected here. The results are correspondingly poor, as our test device is only in second to last place. The performance that can be achieved with the Acemagic AD15 in configuration with the Intel Core i5-12450H can be seen in the example of Minisforum Venus Series UN1245. However, the limits for demanding tasks are quickly reached here. Noticeably more performance is only available with an AMD Radeon 680M or an AMD Radeon 780M. The latter comes in the Minisforum EliteMini UM780 XTX is used. For further comparisons and benchmarks, please refer to our GPU comparison table. The Intel UHD Graphics Xe is only suitable for playing 3D games to a limited extent. Nevertheless, there are some games that the iGPU masters. Older games and undemanding titles do not necessarily present the graphics adapter with unsolvable tasks. Nevertheless, you often have to make do with low details to achieve adequate frame rates. For further comparisons and benchmarks, please refer to our GPU comparison table. In most scenarios, the Acemagic AD15 operates very quietly, although the fans rarely stand still when idling. With a sound pressure level of just 25 dB(A), the device is almost inaudible when idling. Under average load, we note a little more than 28 dB(A). At maximum load, however, up to 42.4 dB(A) can be measured. However, the maximum value is not consistently reached during the stress test. In the meantime, the noise level drops to around 40 dB(A). Noise Level * ... smaller is better We never see high case temperatures in the Acemagic AD15. The processor itself reached a maximum of 86 °C during the stress test. However, our test sample only holds this value for a short time. The performance limits, which are defined as PL1 and PL2, are reached, and the PL1 value of 45 watts can be easily maintained in the further course. The average CPU temperature also drops to around 70 °C during the test. The big advantage of mini PCs is their low energy consumption. In principle, our test sample is also relatively economical, but in detail we see somewhat questionable values. The Acemagic AD15 is not economical in idle mode with 10.7 to 30.5 watts. We also see a very fluctuating power consumption at idle. We were unable to identify Windows updates and other processes as the reason for this. We repeated the measurements several times with the same result. Under average load, the power consumption rose to 49 watts, although up to 98.9 watts were reached at peak times. The included 120-watt power supply (19V; 6.3 A) is never overloaded. * ... smaller is better The Acemagic AD15 impresses in our test with its good everyday performance. Thanks to the Intel Core i5-11500B there is a 6-core processor with 12 threads, which is supplemented with a solid configuration of 16 GB RAM and the 1 TB SSD. After all, Acemagic installed suitable RAM with a clock frequency of 3,200 MHz in our test device. This was not the case with the identical model based on the Intel Core i7-11800H. A slightly better RAM performance is therefore the result for the AD15 with Intel Core i5-11500B SoC. The Acemagic AD15 can score with a reasonable performance in everyday use. In terms of price, however, the manufacturer needs to make some improvements to ensure the right price-performance ratio. In terms of CPU performance, the Intel Core i5-11500B can compete with an AMD Ryzen 5 6600U. Nevertheless, there is a clear disadvantage for the Intel SoC: the integrated graphics unit cannot keep up with the AMD iGPUs. This limits its usability exclusively to office applications and surfing the Internet. However, due to the low DPC latencies, the Acemagic AD15 is also suitable for playing high-resolution videos. Nothing prevents you from using it as a streaming client in the living room. The low volume level of the CPU fan should also be mentioned again at this point. The Acemagic AD15 has to put up with criticism when it comes to the choice of materials. The manufacturer currently charges 459 US dollars. For this price, you only get a simple plastic case with a now outdated CPU. The housing and the processor certainly fulfill their purpose, but the AD15 looks cheap compared to other devices. However, you can still save a little with discounts. The test device is currently available for 399 euros on Amazon. You can also expect a little more in terms of connectivity, as some of the competitors offer Thunderbolt support. The Acemagic AD15 is currently available in our test version from Amazon for 399 euros. The identical model with 512 GB SSD costs only 369 euros and is also available from Amazon. The AD15 can of course also be ordered from the Acemagic store. Prices here start at 359 US dollars (Intel Core i5-12450H, 16 GB RAM, 512 GB SSD). Acemagic AD15\n- 2024-02-20\n02/20/2024  v7\n\nSebastian Bade The present review sample was given to the author by the manufacturer free of charge for the purposes of review. There was no third-party influence on this review, nor did the manufacturer receive a copy of this review before publication. There was no obligation to publish this review. "
}