{
    "title": "GEEKOM A7 review: AMD Ryzen 9 with untapped NPU power in an aluminum shell",
    "date": "2/18/2024",
    "url": "https://www.neowin.net/reviews/geekom-a7-review-amd-ryzen-9-with-untapped-npu-power-in-an-aluminum-shell/",
    "text": "3 hours ago 3 hours ago 6 hours ago 6 hours ago 3 hours ago 13 hours ago 13 hours ago 19 hours ago Mar 28, 2024 Mar 27, 2024 Mar 26, 2024 Mar 26, 2024 Mar 28, 2024 Mar 28, 2024 Mar 26, 2024 Mar 26, 2024 7 hours ago Mar 30, 2024 Mar 30, 2024 Mar 30, 2024 Mar 25, 2024 Mar 23, 2024 Mar 20, 2024 Mar 17, 2024 Dec 31, 2023 Oct 14, 2023 Apr 11, 2023 Mar 27, 2024 Mar 25, 2024 Mar 10, 2024 Mar 3, 2024 Mar 24, 2024 Mar 21, 2024 Sep 23, 2023 Sep 21, 2023 19 hours ago Mar 29, 2024 Mar 28, 2024 Jun 14, 2003 Feb 23, 2024 Jan 20, 2024 Dec 6, 2023 Jun 6, 2023 Steven Parker\nCEO - Neowin.net\nNeowin\n@aSteveParker        ·\n    \n\n    Feb 18, 2024 14:00 EST\n    \n         · Hot! \nwith 10 comments GEEKOM is a brand known to us here at Neowin. In recent times, we've reviewed a number of their Mini PCs (1, 2), and, more recently, an Intel-powered Mini PC called the Air12 (which is currently being heavily discounted). Today, we are taking a look at the GEEKOM A7, Our configuration is powered by the Ryzen 9 7940HS, which came out last April, and despite its TDP of just 35W, has a base clock of 4.0 GHz and a Turbo Boost of 5.2 GHz, invoking up to a max TDP of 54W. The Ryzen 7000 series mobile APUs is part of AMD's Phoenix lineup (Zen 4). Below are its full specifications, and bold indicates our configuration. Dimensions Weight CPU Graphics Memory Storage Operating System Bluetooth Wireless LAN Kensington Lock Adapter   Front I/O Ports 1 x USB 3.2 Gen 2 Type-A\n\t\t\t1 x USB 4 Gen 3 Type-C\n\t\t\t1 x USB 3.2 Gen 2 Type-C\n\t\t\t1 x USB 2.0 Type-A\n\t\t\t2 x HDMI 2.0b\n\t\t\t1 x 2.5G RJ45 LAN\n\t\t\t1 x DC-in Price (MSRP) GEEKOM has two configurations of the A7, with the only difference being a slightly less-powerful Ryzen 7 CPU with half the storage (1TB). This knocks $150 off the price compared to the $849 Ryzen configuration. In both instances, a Windows 11 Pro license is also preloaded. This appears to be an update on the A5 with an all-new sleek casing.  The packaging follows the same design and experience as in GEEKOM Mini PCs. After pulling the top off, you are presented with the Mini PC sitting on a \"shelf\" and a Thank You card below it. Upon removing the side cushion, card, and cardboard shelf, you can find the power lead, HDMI cable, and documentation. As you can see, there's no VESA mount option, but that is also because the case does not allow for it, but if you really need to mount it behind a monitor, there are several third-party options that you can use to save you from voiding your warranty. Otherwise, you'll have everything to get started. In addition, the specs say that it has a Kensington Lock option, but that is not present on the A7. I have reached out to my contact for them to update the specifications to that effect.  The look of it is pretty cool, it is made from, what GEEKOM calls \"aviation-grade aluminum alloy\", it essentially encasses the entire PC so that there is no detachable lid. The top is completely flat, with the GEEKOM logo slightly indented and in reflective silver, centered on the top of the Mini PC. All of the edges are rounded off, so there are no sharp edges, and it definitely has a premium feel to it. The A7 is light as well; it's just 450 grams with a volume of just under a half liter at 0.47L, so it won't weigh you down when carrying it from place to place. The front of the A7 includes two USB 3.2 Gen 2 type A ports, I would have liked to have seen at least one Type C port, more and more devices are shipping with Type C connectors and come with cables that are Type C end to end. It's also not possible to connect a screen on the front, which is a bit of an inconvenience. It's worth mentioning that GEEKOM also claims on the product page that the A7 series underwent the following tests prior to production: For some reason the humidity and temperature tests are mentioned twice, and it is again disappointing that there is no more information about the above tests, I have asked my contact if GEEKOM plan to clarify any data points that customers can look in on, and will update when I hear back on this. The manufacturer claims that the unit never goes above 45dB. However, I have yet to come across a noisy Mini PC, I did some measuring using Sound Meter, and the noise level remained around 40dB. The only moving part inside the A7 is the fan, so I guess the only way it might get a little noisier is if dust is allowed to accumulate in the fan housing or you seriously stress the Mini PC. No complaints here.  The A7 includes a laptop-inspired cooling system that GEEKOM claims minimizes overheating and noise, and I can confirm the A7 generally did not get hot to the touch (except with the Cinebench 2024 test) and barely made any noise that I could hear.  As far as looks go, it is completely silver, and thanks to the shell being made from one piece of aluminum, there are no joints to be seen on the sides or up top where you would normally find a \"lid\" that can be removed to access the internals. It goes without saying, thanks to the aluminum finish, it isn't a fingerprint magnet. The top GEEKOM logo is a nice touch too, it looks and feels like premium hardware.         Accessing the A7 is anything but a simple task. First of all you have to remove the four rubber feet which are glued on, a small flat head screwdriver is enough for the job. Under that you will find four of the smallest screws that are used in computers, they are essentially the same ones used to hold down a NVMe M.2 SSD drive. Upon removing the four screws, you can then detach the plastic cover, which exposes another metal cover that is also fastened with four of the same screws. In total, eight screws. Then, for some wild reason, the Wi-Fi antenna is taped to the bottom plastic cover and routed through the metal plate, and with only about 1 centimeter left at the corner screw hole, which caused it to detach from the PCIe Wi-Fi card that is located under the NVMe M.2 SSD. I removed the SSD only to find that it was not possible to remove the Wi-Fi card (to reconnect the wire) because it was glued in with a plastic cover; this means I can't reattach one of the antennas. I've asked my contact about this strange design choice. I challenge anyone to remove the bottom covers without causing the Wi-Fi antenna to detach. It simply is not possible with only around 1cm between the metal cover and the Mini PC. On a positive note, the four rubber feet also have \"flaps\" or \"wings\" that can be inserted into tiny slots as you reattach then, meaning the rubber feet do not rely entirely on the less sticky glue to stay in place. As it is not possible to add another SSD, you may not need to access it anyway, but if you plan to expand the memory from 32GB to 64GB, for example, you'll need to be really careful with that Wi-Fi antenna wire. Update: I managed to remove the Wi-Fi card by removing the nut, but I had to break the plastic cover that had been glued over the wire contacts, this is probably because the contacts will not stay plugged into the board, I ended up having to jam it back over the contact and then pressing the plastic cover down again so that it remained connected.  On first boot, you are prompted to complete the setup of Windows 11 Pro, meaning you do not have to fork out for a license, which is nice. After the setup was completed, I was impressed that I only had to install the KB5033055: Out of Box Experience update for Windows 11, KB4023057: Update Health Tools update, and the February Patch Tuesday update (see above). In addition, GEEKOM does not include any bloatware in their PCs, so that is always a bonus. The A7 supports up to 4 screens at 8K @ 30Hz through the USB 4 and USB 3.2 Gen 2 (DP 1.4) ports or 4K @ 60Hz over the two HDMI 2.0b ports. However, for the purpose of this review, I was using my ZSCMalls 17.3\" FullHD 144Hz portable screen, which was also powered by one of the rear USB Type C ports.     Regarding connectivity, there are two HDMI 2.0b, a USB 3.2 Gen 2, and USB 4 Gen 3 Type C ports, one USB 2.0 port, an RJ45 2.5 GbE Ethernet port, along with a barrel port for power on the back. Around the front, there are two more USB 3.2 Gen 2 ports and a port for a 3.5mm headphone jack. Unfortunately, there is no Type C on the front. For audio output, I linked my Edifier 360DB over Bluetooth, and I did not experience any noticeable audio delays. As you can see from the images above, you cannot affix a Kensington lock on one side despite (as of writing) this being claimed in the specs on the official website. The entire top and sides are one piece of aluminum with ample venting on the sides for air cooling.  The above image should show a bit more clearly how small this thing is, it is even smaller than the slim and lightweight Mini Air12, which also can't be expanded with a 2.5-inch SSD, and it pales in comparison in size to the Beelink SER6 Max. Before I started running benchmarks, I ensured that Windows 11 and drivers were up to date. At the time of testing, the A7 was running Windows 11 Professional 23H2 build 22631.3155, and I also upgraded to the latest available Adrenalin 24.1.1 WHQL certified driver (Jan 2024). With that out of the way, and because people like that sort of thing, I ran some benchmarks and compared it to my main PC that I built last year. The reference PC consists of the following: For our benchmarks, UL Solutions provided us with Professional (commercial use) licenses for 3DMark, PCMark 10, and Procyon. In addition, we used a licensed version of Geekbench 5 and Cinebench 2024. 3DMark Time Spy tests gaming capability with DX12 graphics performance and 7-Zip for compression and decompression speeds. PCMark tests are a mix of CPU and real-world productivity tests, such as using an office suite, web browsing, light photo/video editing, and making conference calls. Cinebench stresses the entire CPU as it is a multi-threaded rendering test. Finally, Geekbench is a synthetic benchmark that is great for a quick look at the potential performance across a wide range of workloads. We were also interested to see what happens in UL's Procyon, which is an Inferencing benchmark meant to test AI and ML performance. We know the Ryzen 7940HS has an NPU but unfortunately, at the moment, Windows can't recognize it as DirectML does not yet support AMD's NPU. However, AMD has confirmed that support will be added soon and you will be able to monitor NPU usage after a future Task Manager update. 112\n\t\t\t1,857 As you can see, for some reason the Ryzen 9 7940HS in the A7 is 14 points lower than the Ryzen 7 7735HS in Procyon's AI Inference Benchmark for Windows test. While we knew the lack of NPU support meant we wouldn't get the full flavor of the 7940HS' performance in this test, we weren't quite expecting it to get beat by its 7735HS predecessor. For those wondering, the Ryzen 7735HS is built on Zen 3+ and is part of the Rembrandt R family. The 7950X3D score was also much closer to the others than we expected, as it is, after all, a 16-cored desktop part. From my own testing it also appears that the Procyon score is also influenced by the number of background apps and services running in Windows, with this in mind I disabled as many apps as was possible but this did not change the outcome. Both the A7 and Beelink were clean installs of Windows 11 updated to 23H2. However, as you might see from the Timespy and Compute scores, don't think you can replace your gaming desktop with this, you'd still need a dedicated GPU if you intended to do much of any gaming on it. I also tested the SSD's capability using AS SSD and CrystalDiskMark.   Despite running all of the above benchmark tests, the A7 did not get hot to the touch, and there were no annoying noises coming from the single fan that cooled the unit. As I did this on all the previous Mini PCs, I decided to give Quake Champions a go to see if it would be playable. Everything was detected as \"Low\" in the video settings. It was definitely playable, it didn't lag or glitch. I was even able to bump the Details, Post Processing, and Texture Filtering to Medium, which is probably helped by the extra 256 CUDA Cores present in the Radeon 780M compared to Vega 8, as well as a 35% bump in Boost Clock  .  As with all the Mini PCs I've reviewed in the past couple of years, the A7 isn't a gaming PC. You will not be able to enjoy graphically intensive games on it. Still, it is suited as something like an office workstation with a mixture of light gaming, or perhaps a good solution for a student or office worker without a permanent desk, affording the ability to pack this away after every use. This thing also doesn't take up much room in your bag if you need to move it from place to place. When it comes to Mini PCs, the market is saturated with cheaper options, but you'll be quickly disappointed to find they might not include USB 3.2 Gen 2, USB 4, dual channel memory, and more. Some manufacturers are also still selling \"new\" Mini PCs with 8th gen Intel Core mobile CPUs, so you really have to be on the lookout. When you're spending a few hundred dollars to replace the job of a full-sized PC, you're going to want it to replicate as much of the capability as possible, aside from the obvious lack of GPU prowess. As I said earlier, the decision ultimately comes down to what you're willing to pay for the options you need. This Mini PC will let you connect up to four displays, all operating at 4K @ 60Hz, whereas cheaper solutions might be limited to just two screens.  It goes on sale on Feb 20 for $849 on the official website, or $849 on Amazon, and you can save a further $20 if you apply the NEOWINA7 coupon (at GEEKOM or AMAZON) during checkout. For this A7 Mini PC, which includes a Ryzen 9 7940HS processor, 32GB of 5600MT/s DDR5 memory, and a 2 TB PCIe 4.0 NVMe with Windows 11 Pro installed on it, it's pretty good value for your money. For me, this loses a point for the weird design choice with the Wi-Fi antenna, making it almost impossible to access without the cable detaching from the Wi-Fi PCIe card, which cannot be removed to reattach the wire, and half a point for not having a USB Type C port on the front, but then going with a USB 2.0 port around the back. This is a seriously capable Mini PC that includes a dedicated NPU for accelerating AI workloads, along with a quick PCIe 4.0 SSD and DDR5 5600MT/s memory. I give it a solid thumbs up! As an Amazon Associate, I earn from qualifying purchases.  Steven Parker\n                                                ·\n                    \nFeb 20, 2024\n\nwith\n0\n                            comment\n                                s Steven Parker\n                                                ·\n                    \nJan 14, 2024\n\nwith\n5\n                            comment\n                                s Steven Parker\n                                                ·\n                    \nOct 29, 2023\n\nwith\n12\n                            comment\n                                s Steven Parker\n                                                ·\n                    \nJun 11, 2023\n\nwith\n8\n                            comment\n                                s Login or Sign Up to read and post a comment. Please enter your reason for reporting this comment. blackview bl8000 horizon forbidden west windows 11 insider preview promo microsoft weekly twirl 158 windows 11 insider preview promo windows 11 moment 5 dragons dogma 2 task manager notepad © Since 2000 Neowin®\n                                    All trademarks mentioned are the property of their respective owners. "
}