{
    "title": null,
    "date": "2/5/2024",
    "url": "https://www.pcgamesn.com/amd/fsr-3-mod-nvidia-dlss-frame-generation",
    "text": "The DLSS to FSR 3 mod unlocks frame generation for every Nvidia RTX GPU, providing big performance gains, but it's not without its issues. Samuel Willetts Published: Feb 5, 2024 With support for FSR 3 growing, but still well behind that of DLSS 3, it’s difficult for owners of older graphics cards to escape the feeling that they’re still on the outside, looking in at the sky-high frame rates that frame generation can provide. Thanks to a new mod, however, they needn’t look on with quite so envious eyes anymore. Part of the reason that the likes of the GeForce RTX 4070 Super and its siblings dominate discussions regarding the best graphics card, is because of their native support for Nvidia DLSS Frame Generation. This advantage, though, could prove less enticing to owners of older GeForce RTX GPUs, now that this AMD FSR 3 mod has come along. Created by modder Nukem, ‘DLSSG to FSR 3’ is a free-to-download mod that injects FSR 3 into games that only support Nvidia DLSS 3. In doing so, it replaces Nvidia’s frame generation system with FSR 3, enabling older graphics cards to enjoy the benefits of frame generation. Before we get into performance gains, it’s worth noting that this mod sadly only supports GeForce RTX graphics cards. This is unfortunate, given that FSR 3 is brand agnostic in its native form, but that’s the situation at the moment. Testing the mod with a GeForce RTX 3080, Alex Battaglia of Digital Foundry observed performance increases of up to 73% using DLSSG to FSR 3 in Cyberpunk 2077, boosting frame rates from the mid 40s to high 70s, using the game’s RT Overdrive mode. Yes, that’s path tracing running on a graphics card outside of the GeForce RTX 40 series. However, as per the official FSR 3 guidelines provided by AMD itself, if you want an optimal experience with the technology, “it is highly recommended to be always running at a minimum of ~60fps before frame generation is applied for an optimal high-quality gaming experience.” This scenario, thankfully, is possible with DLSS Super Resolution set to ‘Performance’ at 1440p on the RTX 3080, and still results in a sizeable 67% improvement, with frame rates pushing triple digits. Though these frame rates are indeed fantastic, there are some problems. According to Battaglia’s findings, FSR 3 appears to have intermittent issues with producing smooth frame times, which can result in perceived judder or stuttering. There are also minor issues with image fidelity, particularly with shadows, but they appear easy to mostly ignore when it comes to gameplay. You can download the mod for yourself from Nexus Mods, with the installation process appearing simple to follow. While it’s not perfect. this mod is an awesome example of how the open-source nature and wide compatibility of FSR 3 can benefit older graphics cards, especially in lieu of widespread native adoption of the technology. That said, with Starfield AMD FSR 3 support now here, and with more games likely to follow, we hopefully shouldn’t have to wait too long before the feature becomes as prolific (if not more so) than DLSS 3. Samuel Willetts                 Sam has spent the past two decades tinkering with computers, a tradition he proudly continues as a Hardware Editor for PCGamesN. For all things systems and components, he's your man. You'll regularly find his hands inside a PC, swapping out components from the likes of AMD, Intel, and Nvidia as fast as you can say Windows. Otherwise, you'll find him on the showfloor of CES and Computex, talking the night away about the latest pieces of shiny silicon. You may also know him from outlets such as Custom PC, PC Gamer, Pocket Tactics, T3, and TopTenReviews. "
}