{
    "title": null,
    "date": "2/9/2024",
    "url": "https://www.pcgamesn.com/amd/nvidia-graphics-card-prices-fall",
    "text": "The cost of Nvidia GeForce and AMD Radeon GPUs alike are rapdily reducing, with some graphics cards now being sold for far below their MSRP. Samuel Willetts Published: Feb 9, 2024 A complaint lodged at both AMD and Nvidia graphics cards over the past several years is that they’re simply too expensive, with MSRPs increasing across the price spectrum. Thankfully, it appears that we may now be seeing some welcome adjustments, as the prices of GPUs from both manufacturers appear to be tumbling downward. Separating the best graphics cards from the rest of the pack requires performance and price to be taken into account, and the latter has been a key factor for both AMD and Nvidia GPUs lately. Not only have MSRPs already been high, but high demand and short supply both from gamers and crypto miners in the past few years caused prices to rocket for a while. Thankfully, some healthy competition in the GPU industry is reversing that situation in plenty of places. Looking at both Amazon and Newegg, there are plenty of exciting price drops for current-generation graphics cards. As I predicted in our RTX 4080 Super review, the launch of that GPU and its cheaper Super siblings are having a dramatic effect on the market. The biggest shift we’ve spotted is the RX 7900 XT, which can now be had for $669.99 (Amazon). That’s an all-time low in terms of pricing, and a whopping $220 below its MSRP. This will make it more competitive with the RTX 4070 Ti Super, which has also prompted the cost of the RTX 4070 Ti to fall, with the GPU now available for $699.99 (Newegg). Deals for the more budget-conscious are aplenty too, with the RTX 4070 now dropping to $519.99 (Amazon) from its recently adjusted $549.99 MSRP following the release of the RTX 4070 Super. Meanwhile, the RX 7700 XT is approaching the $400 mark (Amazon), a price more befitting the GPU and leaving the RTX 4060 Ti 8GB look like an even worse value offering than before. The situation is a little less rosy on the high-end, sadly. While the RX 7900 XTX is now purchasable for just $919.99 (Newegg), a lack of MSRP stock is causing RTX 4080 Super prices to become inflated. Worse still, the cost of the RTX 4080 is yet to fall enough to make buying one worthwhile. There’s little movement on RX 7600 and RTX 4060 prices either, but it’s hopefully only a matter of time before we see discounts hit both these GPUs. There’s no one-size-fits-all option when it comes to GPUs, so I strongly suggest checking out our best graphics card list, as well as our reviews, to help you determine which pixel pusher suits your needs. Samuel Willetts                 Sam has spent the past two decades tinkering with computers, a tradition he proudly continues as a Hardware Editor for PCGamesN. For all things systems and components, he's your man. You'll regularly find his hands inside a PC, swapping out components from the likes of AMD, Intel, and Nvidia as fast as you can say Windows. Otherwise, you'll find him on the showfloor of CES and Computex, talking the night away about the latest pieces of shiny silicon. You may also know him from outlets such as Custom PC, PC Gamer, Pocket Tactics, T3, and TopTenReviews. "
}