{
    "title": "MSI Claw Gets Benchmarked, Initial Testing Shows ASUS ROG Ally With AMD \nRyzen Z1 Ahead of Intel Meteor Lake For Handhelds",
    "date": "2/17/2024",
    "url": "https://wccftech.com/msi-claw-gets-benchmarks-asus-rog-ally-amd-ryzen-z1-ahead-intel-meteor-lake-handhelds/",
    "text": "Intel's Meteor Lake-powered MSI Claw handheld has been tested and compared against the ASUS ROG Ally powered by the AMD Ryzen Z1 series. The reason why MSI's Claw has managed to gain the spotlight is that it will tell us whether Intel's Meteor Lake SKUs are \"worthy enough\" for the handheld segment. Despite not setting foot into the global market, it seems like multiple Chinese reviewers have obtained units of the device, and fortunately have compared them against existing market competitors, to tell potential consumers whether it is a good choice or not. Before we go into the reviews, let's take a rundown on the MSI Claw. It comes in two different variants, the Intel Core Ultra 7 155H and the Core Ultra 5 135H, both of the SKUs coming with a moderate performance difference. The reviewers have tested the handheld across various gaming scenarios, showing what kind of performance we should expect with both variants and comparing it with ASUS's ROG Ally handheld. The results are pretty interesting, and they have also been tested across multiple TDP settings. Moving on to benchmarks, a reviewer tested the handhelds at Shadow of The Tomb Raider and based on the game's in-built benchmarking, the MSI Claw (Core Ultra 155H) fell behind the ROG Ally across all of the power levels tested, with an average performance difference of 10 to 15 percent. A similar disparity was seen in other titles, such as Cyberpunk 2077 and Red Dead Redemption 2.  While this difference is huge, it is important to note that the ASUS ROG Ally is in a much more mature state regarding driver support and other resources, whilst the MSI Claw hasn't even hit the markets yet. So, we could expect the performance difference to narrow down, but it would probably exist in the longer run. Apart from testing it with the ROG Ally, a reviewer has put up the variants of MSI Claw against each other as well, showing the performance gaps between the two different models. Since both of the models feature an onboard Intel Meteor Lake SoC with disparities such as lesser Xe cores and CPU cores, the performance difference was noticeable, especially in demanding titles, where the gap exceeded 20%. While these results are surely entertaining, it is important to note that one shouldn't expect them to be conclusive, as the device could witness a major performance boost as it nears official launch dates. However, it is clear that ASUS's ROG Ally with AMD's Ryzen Z1 series is still a very capable device, and it will be interesting to see how the next-generation models frame up against Intel's handheld options based on Meteor Lake and future Core Ultra CPUs. News Sources: Videocardz, Bilibili, Bilibili, Bilibili Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}