{
    "title": "AMD’s new CPU slammed as ‘anti-consumer at best’",
    "date": "2/7/2024",
    "url": "https://www.digitaltrends.com/computing/amd-ryzen-7-5700-reviewed/",
    "text": "AMD makes some of the best processors, but this one is most likely not one of them. According to a video review of the recently released Ryzen 7 5700, the CPU is not only a letdown — it’s downright misleading. Compared to previous non-X Ryzen processors, the 5700 appears to be significantly cutdown, which affects its performance in a big way. Historically, AMD’s non-X Ryzen CPUs were pretty much the same as their X counterparts, but with slightly lower clock speeds. Take the Ryzen 5 5600 and the Ryzen 5 5600X, for example. Both chips have six cores and 12 threads, as well as 32MB of cache, but the Ryzen 5 5600 has a clock speed of 4.4GHz, while the 5600X hits 4.6GHz. As a result, many chose the non-X part due to it being slightly cheaper while not being a major downgrade. Although the above applies to almost all Ryzen chips, the Ryzen 7 5700 quietly changes that. The name implies it has the same specs as the Ryzen 7 5700X, minus a lower clock speed, but no — the changes are much bigger. The video review comes from the YouTube channel Hardware Unboxed and points out that the new AMD CPU, the Ryzen 7 5700, is more like the Ryzen 7 5700G than the 5700X. It sports the same eight cores and 16 threads, and even the same 4.6GHz frequency as both those chips, but it shares the same cache as the 5700G, not the 5700X. This means that the Ryzen 7 5700 only features 16MB of L3 cache, as opposed to the 32MB you’re getting with the Ryzen 7 5700X. AMD itself has taught us that this is a significant difference. The power of the L3 cache is especially visible in gaming scenarios, which is why CPUs like the Ryzen 7 7800X3D are so good for such purposes. As expected, cutting the cache in half on the Ryzen 7 5700 makes it a disappointing processor thatthe reviewer referred to as “anti-consumer at best.” The YouTuber tested the Ryzen 7 5700 and compared it to various chips at a similar price point, such as the Ryzen 7 5700X, the Ryzen 7 5700G, and the Ryzen 5 5600. The 5700 turned out to be an exact replica of the 5700G, minus the integrated graphics. The smaller cache stifled its performance by a lot, making it 16% slower than the Ryzen 7 5700X. In some games, the difference was tremendous, reaching as high as 40%. In theory, a 16% difference is not the end of the world. The Ryzen 7 5700 currently costs $175, while the 5700X costs $205, so you’d be saving $30 while getting a slightly worse chip. But this doesn’t tell us the whole story, as the Ryzen 5 5600 outperforms the new 5700, all the while costing only $135. For pure gaming purposes, there’s a clear winner — and it’s definitely not the Ryzen 7 5700. The review from Hardware Unboxed casts a shadow on AMD’s naming scheme, and this isn’t even the first time we’re getting a product with a name that doesn’t reflect its actual performance. The Ryzen 7000 umbrella includes Zen 2, Zen 3, Zen 3+, and Zen 4 chops, and the Ryzen 8000 series sounds like a new lineup, but it’s really not. The Ryzen 7 5700 marks another instance of a chip that should be named according to its specs. If someone buys this CPU thinking it’s a slightly underclocked version of the Ryzen 7 5700X, they are likely to be sorely disappointed. For a while, AMD's highly anticipated new CPUs seemed like they had slipped to 2025. That would have been bad news for AMD, but according to some new reporting on the topic, Zen 5 chips may be getting announced sooner than we thought. As reported by Paul Alcorn of Tom's Hardware, an AMD rep confirmed that the Zen 5 lineup is on track for a 2024 release, likely in the second half of the year. The information was shared during an AMD earnings call for the final quarter of 2023. AMD just revealed its new lineup of desktop APUs with built-in graphics at CES 2024: the Ryzen 8000G series. According to AMD, the Ryzen 8000G lineup can run AAA titles without requiring a discrete GPU. Will these CPUs really rival some of the best processors when it comes to graphics performance? Here's everything we know. Equipped with AMD's Radeon 700M graphics, these chips combine a CPU and a GPU, and AMD claims that the integrated graphics can compete against some of the most popular discrete graphics cards. For five years straight, Nvidia’s GTX 1060 was the most popular graphics card for gamers. But now, AMD might be able to match it with only integrated graphics. Fresh information around AMD’s upcoming desktop APUs, specifically the Ryzen 5 8600G, has emerged to give us a fair idea of how the upcoming processor and integrated graphics could shape up. Recently leaked Geekbench benchmark scores not only offer a performance metric, but the listing also reveals crucial specifications about the upcoming chip. Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}