{
    "title": "AMD: The Price Is Too High",
    "date": "2/29/2024",
    "url": "https://seekingalpha.com/article/4674723-amd-the-price-is-too-high",
    "text": "JHVEPhoto/iStock Editorial via Getty Images  JHVEPhoto/iStock Editorial via Getty Images AMD’s (NASDAQ:AMD) shares have been aggressively appreciating in recent months as the enthusiasm surrounding the latest launch of the company’s MI300A APUs and MI300X GPUs for AI has been surging after the initial positive sales data. While there’s no denying that AMD would be able to greatly improve its overall sales in the following quarters due to the high demand for AI chips, the rising competition from Nvidia (NVDA) along with China-related risks make it hard to justify the company’s current price. What’s more is that it appears that after the latest rally, AMD is trading in the overbought territory, which makes it risky to accumulate shares at the current price considering that currently there’s minimal margin of safety and a limited upside. Last year, I wrote about AMD first in January and then in November. I was initially bullish about the company at the start of last year but later closed the position in November at a ~70% return after the stock reached my price target. Even though AMD’s shares continued to appreciate in recent months thanks to the AI-related hype, I’ve managed to still generate great returns thanks to my long positions in other AI names such as Nvidia (NVDA) and Palantir (PLTR). While I don’t have a long position in AMD at the moment, I still believe that the company could perform relatively well in FY24, especially after it reported decent earnings results a few weeks ago where the revenues increased by 10.7% Y/Y to $6.2 billion in Q4. One of the company’s biggest growth catalysts at the moment is the potential recovery of the PC market where AMD continues to gain a foothold. The company in recent quarters continued to take the market share from Intel (INTC), while its PC-related sales in Q4 increased by 62% Y/Y to $1.5 billion. What’s more, is that the recent launches of MI300A APUs and MI300X GPUs for AI-related tasks in December helped AMD boost its data center revenues in Q4 by 38% Y/Y to $2.3 billion, and there are reasons to believe that the revenues would continue to aggressively increase in the following quarters. One of the biggest advantages of the company’s latest GPUs is the fact that it appears that they’re more powerful in comparison to Nvidia’s H100 GPUs and businesses such as Meta Platforms (META) are already deploying AMD’s chips to run AI-related tasks. Another thing that needs to be mentioned is that the launch of AMD’s chips comes at a perfect time as the chips market is starting to improve while the upcoming distribution of federal funds through the CHIPS Act should give an additional boost to the industry in the coming quarters. The biggest issue with AMD is that after the recent rally, its shares no longer have a decent margin of safety, while the challenges that the company is facing continue to mount. At this stage, it makes it hard to justify the company’s ~$290 billion market cap, as it currently trades at nearly 50 times its forward earnings and 11 times its forward sales. For comparison, the S&P 500 average P/E is currently around 27x. While the latest rally in part was fueled by the management’s better-than-expected sales expectations of its AI chips this year, it’s still hard to justify AMD’s current valuation. While it’s good to see that AMD expects to sell $3.5 billion worth of AI chips in FY24, up from the previous expectations of $2 billion, and might even generate $8 billion in sales in FY25, that’s still not enough to justify its current share price. That’s likely one of the main reasons why Seeking Alpha’s Quant system gave a grade of D- for AMD’s valuation and an overall rating of HOLD. What’s more, is that it appears that the gaming and PC businesses are unlikely to greatly improve their performances this year. This puts additional pressure on AMD to meet or even exceed expectations for the data center segment in Q1 and beyond in order to satisfy the market. In addition to that, it will likely be hard for AMD to properly compete with Nvidia in the following quarters. In recent months, Nvidia has been receiving dozens of upward revisions from the street, its business is expected to grow at 80% in the current fiscal year, and its data center operations generated $18.4 billion in Q4 alone thanks to the surge in demand for its AI GPUs. Considering that AMD expects to sell only $3.5 billion worth of AI chips in the whole of 2024, it will be hard for the company to outcompete its peers. What’s more is that in addition to having greater growth prospects, Nvidia is also trading at a forward P/E of ~32x, which makes its stock more attractive in comparison to AMD. There are two additional obstacles that would be hard for AMD to overcome. On the one hand, Nvidia has the advantage of owning one of the most popular parallel computing platforms called CUDA which is heavily used in the development of AI projects. While AMD last year bought its own platform to improve its software portfolio, it’s still too soon to tell whether it will help the company gain an advantage against Nvidia. What’s more important is that it looks like AMD is losing the price war in the AI space as well. The latest data shows that AMD is selling its MI300X GPUs for $10,000 - $15,000 depending on the customer. For comparison, the average price of Nvidia’s H100 GPU is ~$30,000, while the newest H200 GPUs could be even more expensive given the rising demand. On top of all of that, AMD is facing major external risks that could make it harder for it to achieve its fiscal year goals in 2024 and beyond. Considering that ~22% of AMD’s revenues are generated in China and Hong Kong, the company is exposed to geopolitical challenges that could undermine its growth story. The management of Nvidia in its latest conference call stated that the China-related revenues have declined significantly in Q4 primarily due to chip export restrictions. So far, that decline has been mitigated thanks to the increased demand from other regions. However, once the capacity issues are resolved and demand stabilizes, there’s a risk that the growth rate will significantly decrease within the chip industry, especially since China could face additional restrictions later this year. As such, AMD might not be the best AI bet at this stage. AMD is a great company that is more than likely to continue to generate decent returns and improve its overall sales for a while thanks to the increased demand for its products. However, at the current price, it makes little sense to accumulate a sizable position given the number of challenges that the company faces, as they are likely to limit its upside in the near term. That’s why I’m sticking with a HOLD rating for now as the company’s stock appears to be limited for now, but it could trade close to the current market price due to the overall market optimism surrounding AI names. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of PLTR, NVDA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Bohdan Kucheriavyi is not a financial/investment advisor, broker, or dealer. He's solely sharing personal experience and opinion; therefore, all strategies, tips, suggestions, and recommendations shared are solely for informational purposes. There are risks associated with investing in securities. Investing in stocks, bonds, options, exchange-traded funds, mutual funds, and money market funds involves the risk of loss. Loss of principal is possible. Some high-risk investments may use leverage, which will accentuate gains & losses. Foreign investing involves special risks, including greater volatility and political, economic, and currency risks and differences in accounting methods. A security’s or a firm’s past investment performance is not a guarantee or predictor of future investment performance. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}