{
    "title": "AMD reached new CPU market share record against Intel in 2023",
    "date": "2/12/2024",
    "url": "https://www.crn.com.au/news/amd-reached-new-cpu-market-share-record-against-intel-in-2023-605026",
    "text": "AMD reached a new record in overall x86 CPU market share against Intel last year, mainly thanks to gains it made in the PC and server segments. The chip designer’s CPU share grew a half point to 31.1 percent in 2023 while Intel’s decreased as much to 68.9 percent when counting total CPU shipments between both companies last year, according to CPU-tracking firm Mercury Research. Mercury President Dean McCarron told CRN that AMD achieved an all-time high in overall CPU share last year because, in a down market for both companies, it experienced a smaller decline in CPU shipments for servers, PCs and embedded/IoT than Intel did in those segments. However, AMD and Intel ended 2024 on a high note, with both companies seeing increases in CPU shipments for servers and PCs in the fourth quarter after partners, in prior periods, sold through excess inventories that had built up due to a slowdown in demand. In the fourth quarter, AMD’s overall CPU share declined 2.1 points sequentially and 2.7 points year-over-year to 28.6 percent while Intel’s grew as much to 71.4 percent, according to Mercury’s latest report. But this share drop was mainly due to a continued decline in shipments of AMD’s semi-custom chips for video game consoles such as Sony’s PlayStation 5. When not counting the semi-custom, embedded or IoT segments, AMD’s overall CPU share grew by 0.7 points to 20.4 percent in 2023’s fourth quarter against Intel’s 79.6 percent. This put AMD’s share 3.2 points higher than it was in the fourth quarter of 2022. AMD grew its overall CPU share in the fourth quarter because it managed to increase CPU shipments for PCs faster than Intel did, according to McCarron. This resulted in the company growing PC CPU share for the period by 0.8 points sequentially and 3 points year-over-year to 20.2 percent against Intel’s 79.8 percent. When it came to CPU share for laptops and other mobile devices in the fourth quarter, Intel’s rival grew share by 0.9 points sequentially and 3.9 points year-over-year to 20.3 percent against the semiconductor giant’s 79.7 percent. McCarron attributed AMD’s share grab in the mobile segment to strong growth in shipments of the company’s Ryzen 7040 processors—the first to include its neural processing unit (NPU) for the emerging categories of AI PCs—as well as the lower-end Ryzen/Athlon 7020 chips. He said Intel also experienced ample growth for its 13th-generation Core processors as well as the Intel Processor N100 and N200 chips. For desktop PCs, AMD grew CPU share by 0.6 points to 19.8 percent against Intel’s 80.2 percent. This amounted to a 1.2-point year-over-year increase for AMD. What drove this was a strong uptick in shipments of AMD’s Ryzen 7000 processors as well as its Ryzen 5000 processors, the latter of which McCarron considered a surprising development because the lineup is an older generation of CPUs. The server segment was a different story: Intel managed to eke out a tiny share gain of 0.2 points sequentially to 76.9 against AMD’s 23.1 percent. McCarron noted that this was “the first time Intel has had an on-quarter share gain in nearly five years.” But Intel’s return to sequential share growth barely did anything to offset the server gains AMD made in the prior quarters, resulting in the rival increasing its slice of the segment in the fourth quarter by 5.4 points from the same period a year ago. The fact that CPU share barely moved in the server segment reflected how both AMD and Intel “saw significant growth in conventional data center CPU products,” according to McCarron. These products included Intel’s fourth-generation Xeon Scalable processors as well as AMD’s fourth-generation EPYC “Genoa” and “Bergamo” chips. What helped Intel get ahead in the server market were CPUs like Xeon D and Atom that are not designed for data centers but rather networking and storage appliances, McCarron said. A veteran executive at a high-performance computing systems integrator told CRN US that Mercury’s latest server CPU figures fall in line with what his company saw last year, with AMD continuing to garner major interest in part because of EPYC’s higher core counts. “One of the universities that we just [spoke to], they've got what's referred to as ‘embarrassingly parallel’ projects in the HPC space. And they’re just bringing in nodes that have as many cores as possible. And, of course, you look at AMD for that kind of thing,” said Dominic Daninger, vice president of engineering at Burnsville, Minn.-based Nor-Tech. What has also helped AMD continue momentum is the fourth-gen EPYC lineup’s addition of AVX-512 instructions, which can accelerate certain AI, HPC and analytics workloads and were previously only available in Intel’s Xeon processors, according to Daninger. But to the HPC executive, Intel has made “nice performance gains” with fourth-gen Xeon processors, which has helped with customer conversations, especially those who have used the chipmaker’s CPUs “for a long time” and would prefer to keep it that way. “Some people will move across to AMD […] But Intel can get pretty aggressive too,” he said. What’s “really seeing a lot of interest,” however, are Nvidia GPUs, according to Daninger. While Nvidia’s GPUs don’t compete directly with CPUs, businesses have started to spend substantially more money on GPUs than CPUs for AI and other demanding workloads. “I can't believe the number of conversations I had with potential customers just in the last week here. Really substantial investments we're talking about,” he said. "
}