{
    "title": "How to check your CPU temperature - keep your Intel and AMD chipset chilled",
    "date": "2/15/2024",
    "url": "https://www.videogamer.com/tech/how-to-check-your-cpu-temperature-keep-your-intel-and-amd-chipset-chilled/",
    "text": "Posted in Tech Video Gamer is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more Needing to know how to check CPU temperature can come in clutch if you’ve noticed your PC struggling or overheating. It’s also something to keep an eye on if you’ve been debating investing in a CPU cooler. If you already have one and want to install it, we’ve got you covered, check out how to apply thermal paste to get started. With Windows 11, keeping a keener eye on your CPU and GPU stats is so much easier, you just have to pop into Task Manager, and under the Performance tab you’ll find relevant information about your core processor; and if you have been wanting to know how to check GPU temperature, you’ll be able to see that under the GPU section within Task Manager. Unfortunately, checking your CPU temperature isn’t that simple. So we’re going to talk through a some third-party software to help you keep a closer eye on your CPU’s temperature. Let’s get into it. Architecture Zen 3 Core count 16 Thread count 32 Base clock 3.4GHz Boost clock Up to 4.9GHz Cache 64MB If your CPU exceeds its maximum temperature threshold, it will begin to throttle, which means drops in performance while the CPU reduces its speed to reduce the heat being produced. This will look something like your PC becoming unresponsive or sluggish, your PC randomly shutting down or restarting, loud noises and potentially smells coming from the computer itself, and it’s likely you’ll be able to feel the PC getting hot. This happens when either the CPU isn’t able to distribute its produced heat quickly and efficiently enough, this can be caused by your fans being broken, poor airflow around your core processor, your PC being filled with dust or not cleaned regularly, or if you don’t have a cooler installed and you’re putting a large amount of demand on your CPU for extended periods of time. Each processor has a different maximum temperature, but the general rule of thumb is that if your CPU is running at between 60 degrees Celsius and 80 degrees Celsius, you’re fine; if you’re hitting 80 degrees Celsius regularly then it’s worth giving your PC a good clean, or changing your thermal paste, to try and keep that temperature a bit lower. That being said, certain core processors can hit the low 80s when gaming so it may not be worth worrying about if you’ve noticed your temperature creeping up during gaming sessions. If you are exceeding the 80 mark regularly, or you’ve noticed your CPU temperature reaching 90 and above, that is when throttling will start to occur. Reaching and exceeding the maximum temperature of your CPU regularly will diminish its ‘shelf life’ over time, so if you have noticed your PC struggling frequently, or have seen your temperature rising above 90 degrees Celsius, it is probably time to think of more invasive measures or investing in a cooler if you don’t already have one. Overclocking will also cause your CPU temperature to rise, so if you’re overclocking your CPU and have noticed the temperature getting too high, it’s probably a good idea to dial it down a bit. Cores 24 (8P + 16E) Threads 32 L3 Cache 36MB Base clock 3.2 GHz ( P-core) ; 2.4 GHz (E-core) Boost clock 5.6 GHz (P-core) ; 4.4 GHz (E-core) Socket LGA 1700 If you’re using an AMD core processor, the quickest way for you to check on your CPU is by using AMD’s own software. Though not currently available via Windows, checking your CPU temperature is still easy with free, third-party softwares. Core Temp, as suggests the name, is an easy software to keep a close watch on how your core processor’s temperatures are doing, recording minimum, maximum and average temperatures, easily accessible in a System Tray via the taskbar. Much like Core Temp, HWMonitor is a software that allows you to keep track of your CPU metrics including temperature. Though this software is meant to be used with NZXT’s products, it’s a sleek and easy tool to monitor your CPU and GPU without needing NZXT hardware. As of right now,  Windows 11 doesn’t have a quick and easy way to keep an eye on CPU temperature in the same way you can with GPU temperature. The quickest way to track your CPU temperature is with a third-party software like Core Temp that monitors minimum, maximum and average temperature of your processing cores. The general rule is that around the 60-70 degrees Celsius mark is good, 80 degrees Celsius isn’t anything to worry about (especially if you’re gaming) but may warrant a clean of your fans and PC. Temperatures at 90 degrees Celsius or higher is considered too high. Meghan Coon is a Tech & Hardware Writer for Videogamer "
}