{
    "title": "Rumor: New PlayStation Handheld Powered by AMD is in Early Development - \nNews",
    "date": "2/1/2024",
    "url": "https://www.vgchartz.com/article/459831/rumor-new-playstation-handheld-powered-by-amd-is-in-early-development/",
    "text": "A new rumor has surfaced claiming a new PlayStation handheld powered by AMD is in early development, according to YouTube channel Moore's Law Is Dead and spotted by Wccftech. The new PlayStation handheld is in the \"High Level Design Phase\" and will be powered by a custom AMD APU. The handheld is at least two years away and has yet to be greenlit for release.  The specs for the new PlayStation handheld have not been finalized, however, Moore's Law is Dead speculates it will likely use 18 CUs so it can be compatible with PS4 titles available on the PlayStation Store. He also claims it will be compatible with PS5 titles as well. However, developers would have to patch their games to ensure they run properly on the console. He also speculates the GPU could run at 1.8 GHz or lower due to the PS5's variable clock speeds. This should be treated with a grain of salt until an official announcement from Sony. A life-long and avid gamer, William D'Angelo was first introduced to VGChartz in 2007. After years of supporting the site, he was brought on in 2010 as a junior analyst, working his way up to lead analyst in 2012 and taking over the hardware estimates in 2017. He has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel. You can contact the author on Twitter @TrunksWD. Moore Law is Dead is not a trustworthy, verifiable, empirical source of information.\n\nThe guy has made hundreds of \"claims\" in the past which turned out to be a lie.\n\nSo take any of his statements with a grain of salt.\n\nI would implore vgchartz to use more credible sources going forth. he's often not even making claims, but actually showing roadmaps that are leaks, not rumors He sells himself on baseless \"gossip\" and will \"sensationalize\" rumors and try to pass them as facts.\n\nHe also goes back and deletes videos that ended up being incorrect...\nBut will constantly mention stuff he got right to make himself SEEM more legitimate, which can be chalked up to being a lucky guess as he gets more stuff wrong than right.\n\nhttps://www.reddit.com/r/BustedSilicon/comments/yo9l2i/collection_of_mlidmoores_law_is_dead_past_claims/ Doubt MLID is just a little more reliable than a 4-Chan post, though. not true, he is the number one source of leaks right now for future roadmaps and hardware, but not sure what to say, see you in 2 years?\n\nhe usually has actual sources, not rumors, and he publishes actual leaks also (from people that work at AMD) He gets more wrong than right.\n\nThe guy even goes back and deletes videos that were incorrect.\n\nThis is the guy you believe. well so exactly what will you say if a Sony portable is announced from AMD. He said he knows an AMD employee with knowledge of contracts being signed. I think the part you don't seem to understand is that it doesn't matter if this specific claim turns out to be correct.\n\nHe still gets more wrong, than right.\n\nWhich means as far as credibility is concerned, he has none as he can't be trusted. no thank you, im happy with my switch as a portable and xseries and ps5 at home Finally the VITA 2 I think there will inevitably be another Sony handheld regardless of this rumour. PS5 spec hardware is kind of the benchmark for conventional gaming experiences & I don't think we'll see needs far beyond it for the foreseeable future because diminishing returns. Things like RT & path tracing is nice but not a necessity.\n\n\nA portable PS5 at the end of the decade will be an ever green machine with constant software support without too much effort Native PS4 games playable on a handheld via backwards compatability sounds nice tbh.\nOntop of its own library of games. Like that sounds like a win to me. So this would be a portable PS4? Could be possible with the way AMD CPUs have become more power efficient over the years. The Steam Deck has similar power to PS4, so anything close to that would be fantastic. Imagine playing Bloodborne on the go. The advantage Steam Deck has is that...\n\n1) It's CPU is actually more powerful than the Playstation 4.\n4 Cores/8 threads @ 3.5Ghz vs 8 Cores/8 threads @ 1.6Ghz.\n\n2) More Ram.\n16GB @ 88GB/s vs 8GB @ 176GB/s.\n\n3) GPU.\nRDNA 2.0 - 512 Shaders@1.6Ghz for 1.62Tflop of single precision.\nHas Delta Colour Compression, Primitive Shaders, Ray Tracing, Mesh Shaders, VRS,\nvs\nGCN - 1152 shaders@800mhz for 1.84 Teraflops.\n\n\nIn general the chip in the Steam Deck should hold an advantage over the Playstation 4 in every single scenario. Except... Memory bandwidth. - Which hampers texture and pixel fillrates, preventing it from being efficient at higher resolutions.\n\nWhich probably explains why at a Steam Decks default resolution games look far better than a Playstation 4 equivalent.\n\nIt's a more flexible and efficient chip. That sounds awesome. With that level of efficiency, perhaps Sony can make a handheld PS4 with better battery life than what the Steam Deck has. It would be amazing if they release it like 2027 and it could run PS5 games It would be great if it can run PS5 games, all we need is 1080p 60 fps. It depends how it can scale. A ps5 on 6nm consumes 200 watts. On 3nm it would probably be closer to 100 watts. On 2N maybe like 70w.\n\nOf course we will also see RDNA5 by then. So you could get PS5 performance in a 20-25W system which is crazy to think of. And you don’t even need 4K output but that would require game modifications.\n\nOnly thing is cost. A handheld that can play ps5 games natively and runs for 3h with an OLED screen will cost a lot. You might as well get the next steam deck or rog ally because Sony releases their games on steam and you have 1000s of games available. So it should be super easy to use and priced reasonable. no, you are talking about at the same clock speeds, but lower clocks speeds massively reduce power consumption\n\nThe RTX 4070 Max-Q already works at 35W with 1/3 clock speeds. I'd like to see a portable PS5 which has the full GPU hardware in it but runs at 1/3 clock speeds. A radeon 8600 XT basically, at 3nm. Could run at 30W.\n\nAt 1/3 speed we basically have 1080p PS5 gaming on the go. also it does not cost a lot, we are talking about the the smallest laptop GPU you can buy for example, something that is sold to laptop makers for $100 each\n\nif you stick the silicon in a portable, it doesn't become more expensive Im using the PlayStation Portal a lot and I really like it. So if they come with a native way to play without the need to connect the main console, I’m all for it. That being said I have time believing this is true… I don't think that YouTuber is known for being reliable. That said, a handheld based on AMD's architecture is not rocket science for Sony. They could fart out the hardware within 6 months or so given the mobile engineering expertise at Sony's Xperia division combined with AMD's experiences since helping with the Steam Deck and then put the very same operating system on it that runs on the PS5.\n\nI think the open question is not whether Sony is prototyping such a device (I'm sure they are), the question is more if they are willing to make games for it. It would mean that games either need to scale in a way they could run on both PS5 and the handheld or even make dedicated games for it. AMD handhelds are a dime a dozen currently. OneXPlayer\n\nAnd probably a heap more.\n\nSo Sony would be building on already established and successful designs already built using AMD hardware but with a Linux based OS like Steam.\n\n...Provided that is what they are even contemplating on doing, which I doubt.\nAfter the colossal failure of the Vita... I think it's a hard ask to compete with Nintendo anymore in the handheld space, the Switch has that market locked down. Why would Sony switch to Linux when they chose FreeBSD as base for OrbisOS. They would get 100% PS4 (and potentially limited PS5) compatibility for free. Should add that FreeBSD is Unix-like.\nLinux is also Unix-Like.\n\nLinux and FreeBSD do tend to share a significant amount of superficial similarities to the point where FreeBSD can have binary compatibility with Linux.\n\nSo you wouldn't loose compatibility.\n\nHowever in my previous comment I was just providing an example of a semi-custom OS built for the AMD hardware designed primarily for gaming which is the approach Sony would take rather than Sony actually explicitly using Linux. Honestly I see no point in Sony going back to the handhelds.\nNintendo has now competent handheld hardware, and Steamdeck is there for more high-end demands.\nWith how long it takes to make games nowdays, Sony would better keep focusing on doing very high quality titles and not downscalling or side branching their franchises.\nTheir current focus is very succesful both quality and financial wise, keep at it. Does this rumor have anything to say about an 8\" LCD Screen? (I didnt watch the vid). Without physical games it's just another Ally. Meh Another one to add to Sony's puny attempts to make a chink into Nintendo's Handheld Dominance. Facts. Sony could be competitive if they go all in. How many times has that been said about any company vs Nintendo in handhelds? Sony tried with all their might with PSP and still got its ass whooped. what are you talking about? the PSP was a huge success, it sold as much as the Xbox 360 or PS3, it outsold the 3DS, the NES, the SNES etc....\n\nare you going to call the NES, the SNES, and the 3DS failures now? You don't seem to understand. No one said PSP wasn't a success but it still got its ass handed to it in sales compared to DS. It was never competitive with DS. It was left in the dust. NIntendo cannot be beat in the handheld space. Every attempt has been the same. More power, more features than Nintendo. It has beaten Nintendo 0 times. It doesn't have to beat Nintendo, it only needs to be profitable enough to justify its existence. the PSP is one of the best selling systems of all time and we're getting downvoted here\n\nthe community at VGChartz is pretty irritating honestly, a bunch of Nintendo-huggin crazy people\n\nthere is no discussion at all on this website about anything\n\nthey hate Nintendo home consoles, they hate Sony, they hate Xbox , they love the Switch (despite the PS5 being the best selling console for the last year, almost every month, despite the Switch forcing Nintendo fans like myself to have the same tired graphics for 12 years in a row, and I already own almost every great Switch game on my Wii U) The aim is to be profitable more than to outsell the competition. Nintendo has lost against Sony for 5 generations in a row. PS1 until now. So what? Doesn't mean Nintendo never had a successful console. N64 + Wii successful. They still got beat hard by Sony. So what. \"you don't seem to understand\" jesus... The Wii outsold the PS3, The Switch outsold the PS4. What are you saying 5 generations in a row. But never ever Any Sony Handheld beat Nintendos. Also add in the facts that never ever 1st Party Sony Games ever outsold just\nthe latest Animal Crossing. Even in the Top  10 Best Selling Games of all time No Sony 1st Party game. Ever. Facts! The Wii was sold to non gamers, imo the PS3 outsold the Wii to gamers. Look at games sales numbers, way more games sold on the PS3.\n\nAlso the Switch isn't the PS4 competition, the Wii U is. also Nintendo gets more sales because you have less options, Sony is competing against a much larger game library, I don't think the top 10 matters. GTA5 is a game on a Sony console, that matters. Not if Sony made the game themselves, also. basically you said nonsense, I pointed out you were 100 percent wrong about the PSP not being a success (selling as much as the Wii and PS3 and Xbox 360 for god's sake) and then you changed the subject to pretend that I was wrong\n\npathetic really No, you just suck at reading. Blocked. Bye. Then did it win against the DS in sales? Dont get out of context. In your dreams. I wonder if releasing portal n seeing the sales helped them realise that maybe it’s time to try a handheld again n maybe bite into Nintendo’s dominance This would be the best time to try a handheld again. Sony is at it's peak right now and people are buying all their accessories without question. This could do really well for them. Perhaps the next Playstation will be a hybrid, and this is the PS6? I hope not. I kind of hope this rumor isn't real because personally I don't want their main games to be held back by inferior hardware. If it can maintain the level of quality we are seeing now though than I'm ok with that. Most Sony games run fine on Steam Deck which is available right now. Well now that you mention it that kind of is true. In another 2 years with newer technology it could work. Nice. A portable PS4 would be cool but I think the time has passed. It would make sense as an accessory to play PS4 downloaded games and stream PS5 games from anywhere but requiring dedicated software would be a non-starter. Dedicated software with Remote Play for console titles is indeed a nonstarter. Vita was a flop, and the best a successor to the Vita could hope for is more sales than Vita but selling far worse than 3DS, GBA, and PSP.\nSomething I'd like to see (which should've been what the PS Portal is) is a handheld that natively plays digital PS4 games even offline and without a PS4 or PS5 console.  And PS5 games could be supported via Remote Play if you have a robust enough connection. Heck, PS4 games could be remote as well if you really wanted that extra option and perhaps even streaming of PS3 games from PS Plus. The device obviously wouldn't be as cheap as Switch Lite, but I don't see it being any more expensive than the cheaper SKUs of Steam Deck. Still, Sony could always increase their capacities to support a handheld with exclusive Software. If they want there are ways, if they dont they'll find excuses.\nGames sell hardware after all. It will need exclusives or its reason to (hypothetically) exist are naught. If this rumor turns out to be true, I'll definitly keep an eye on the device.\n\nAnd if it is at least as powerful as the Switch 2, then it should have no problems getting the same games. I really want a PSVita successor. I have one myself and I use it just as much as my Switch For the sake of conversation, it would need to essentially be a portable PS4 with the ability to handle scaled back PS5 games.\n\nCould Sony offer that for about $300 without being much bigger than a Switch? I kinda doubt it. It's going to bleed Sony dry,\nI don't even think they're making massive profits from ps5 An actually good handheld would be 1 million times better than Sony VR. Can't believe SonyPlaystation thought a 2nd rate VR would be a better Idea than a good handheld. It's so easy to be better than the Switch's bad tech and bad controls. Take the PS5 GPU, the full thing, and shrink it to 3nm. Run it at 1/3 clock speeds. 30W like the ROG Ally. Should be possible by 2026. (the RTX 4070 mobile already runs fine at 35W in the Dell XPS 15 for example, today).\n\nIf necessary they can switch the CPU to a 2W 8 core ARM CPU like what Nintendo would be using. The A78 CPUs in the Switch 2 are very old, Snapdragon 695 basically. It was a 3W ARM CPU that released in 2021, 3 years ago.\n\nIf you use a 2W ARM CPU cluster in 2026, you can save all your TDP for the GPU part. Nothing wrong with AMD's current mobile APU's.\n\nThe biggest limitation is always memory bandwidth... There is only so much you can do with commodity DDR5/LPDDR5 memory on a 128bit memory bus... Which keeps resolutions low.\n\nSteamdeck is running many PS5 games at 720P just fine... It will be interesting to see how that handheld holds up as we progress through the generation and developers start to more heavily utilize RDNA's more advanced feature set.\n\nAs for 3nm... That's just marketing. Geometrically it's not actually 3nm. well exactly so if you target 1080p you save a lot of power on the memory Not enough bandwidth for even 1080P with PS5 equivalent settings.\n\nI don't think you understand how much of a handicap having less than 100GB/s of bandwidth is for 1080P... Regardless if you employ delta colour compression, draw stream binning rasterization and more advanced culling. etc'.\n\n720P is the ideal resolution for handhelds with current technology. Look, I have an RTX 3080. I play at 720p, upscaled to 1080p. It can only handle 720p if I want to play at 120hz. Star Wars, Jedi Survivor. Last of Us. and more.\n\n720p is very common right now. Common on PC, common on PS5. What AMD needs to do is keep improving FSR. A 3080's optimal resolution is not 720P due to it's relatively high fillrate.\n\nGPU's have an efficiency curve with resolutions, you would not have a corresponding hit to performance at 1080P. yeah, it's also cache and other things, the RTX 3000 series had poor low res performance (AMD was much faster at 1080p). I was just pointing out that even an RTX 3080 in 2024 needs to run at 720p upscaled to 1080p to hit 100hz in the latest games i was agreeing with you, I just thought it would be funny to hear I play at 720p with an RTX 3080 ;) 3nm is the name, so what, 4nm is marketing, 5nm is marketing, 7nm is marketing too Correct. They are all marketing.\n\nHowever many share the same design rules and geometries.\n\nFor example... TSMC's \"5nm\" process has a interconnect pitch equivalent to IRDS 7nm and a gate pitch that is larger than IRDS 7nm.\n\nThe more you know. so what? I didn't say anything wrong, people arguing for argument's sake How can I be arguing if I literally agreed with your statement? because you are trying to school me in something that I already know and is irrelevant to my comment??? (the more you know? huh? you didn't teach me anything...)\n\ni said power usage will decrease a lot with 3nm, and then you tried to school me about the meaning of 3nm despite my comment being 100 percent correct and yeah, I never even disagreed with you But how can I school you when I literally replied to your statement with \"correct\"? It was literally the first word of my reply.\n\nI think you have made this to be something it's not. ok no problem, I just thought the response of \"3nm isn't real\" wasn't a useful response, nor the 'the more you know\" stuff\n\nno problem, have a great day :) Popular Stories About Us | \n                  Terms of Use | \n                  Privacy Policy | \n                  Advertise | \n                  Staff | \n                  Contact\n\n\nDisplay As Desktop\n\n\n\nDisplay As Mobile\n\n\n                  © 2006-2024 VGChartz Ltd. All rights reserved. "
}