{
    "title": "When (AMD) Moves Investors should Listen",
    "date": "3/29/2024",
    "url": "https://news.stocktradersdaily.com/news_release/34/When+%28AMD%29+Moves+Investors+should+Listen_032924020002.html",
    "text": "March 29, 2024, 14:00 pm ET, BY Rick W.- Contributor| Editor: Thomas H. Kee Jr. (Follow on LinkedIn) Longer Term Trading Plans for AMD\n\nBuy AMD slightly over 168.32 target 195.78 stop loss @ 167.83  Details\nThe technical summary data tells us to buy AMD near 168.32 with an upside target of 195.78.  This data also tells us to set a stop loss @ 167.83 to protect against excessive loss in case the stock begins to move against the trade.  168.32 is the first level of support below 180.49 , and by rule, any test of support is a buy signal.  In this case, support 168.32 is being tested, a buy signal would exist.\nShort AMD slightly under 195.78, target 168.32, stop loss @ 196.35  Details\nThe technical summary data is suggesting a short of AMD as it gets near 195.78 with a downside target of 168.32.  We should have a stop loss in place at 196.35though. 195.78 is the first level of resistance above 180.49, and by rule, any test of resistance is a short signal.  In this case, if resistance 195.78 is being tested, a short signal would exist. \n\nSwing Trading Plans for AMD\n\nBuy AMD slightly over 195.78, target n/a, Stop Loss @ 195.21  Details\nIf 195.78 begins to break higher, the technical summary data tells us to buy AMD just slightly over 195.78, with an upside target of n/a.  The data also tells us to set a stop loss @ 195.21 in case the stock turns against the trade.  195.78 is the first level of resistance above 180.49, and by rule, any break above resistance is a buy signal.  In this case, 195.78, initial resistance, would be breaking higher, so a buy signal would exist.  Because this plan is based on a break of resistance, it is referred to as a Long Resistance Plan.\nShort AMD slightly  near 195.78, target 179.95, Stop Loss @ 196.35.  Details\nThe technical summary data is suggesting a short of AMD if it tests 195.78 with a downside target of 179.95. We should have a stop loss in place at 196.35 though in case the stock begins to move against the trade.  By rule, any test of resistance is a short signal.  In this case, if resistance, 195.78, is being tested a short signal would exist.  Because this plan is a short plan based on a test of resistance it is referred to as a Short Resistance Plan.\n\nDay Trading Plans for AMD\n\nBuy AMD slightly over 182.28, target 195.78, Stop Loss @ 181.85  Details\nIf 182.28 begins to break higher, the technical summary data tells us to buy AMD just slightly over 182.28, with an upside target of 195.78.  The data also tells us to set a stop loss @ 181.85 in case the stock turns against the trade.  182.28 is the first level of resistance above 180.49, and by rule, any break above resistance is a buy signal.  In this case, 182.28, initial resistance, would be breaking higher, so a buy signal would exist.  Because this plan is based on a break of resistance, it is referred to as a Long Resistance Plan.\nShort AMD slightly  near 182.28, target 179.95, Stop Loss @ 182.71.  Details\nThe technical summary data is suggesting a short of AMD if it tests 182.28 with a downside target of 179.95. We should have a stop loss in place at 182.71 though in case the stock begins to move against the trade.  By rule, any test of resistance is a short signal.  In this case, if resistance, 182.28, is being tested a short signal would exist.  Because this plan is a short plan based on a test of resistance it is referred to as a Short Resistance Plan.\n Real Time Updates are available on our   Advanced Micro Devices Inc. (AMD) Page here:   AMD. AMD Ratings for March 29:\n\n\nTerm →Near\nMid\nLong\n\n\nRating\nNeutral\nWeak\nStrong\n\n\nP1\n0\n0\n144.07\n\n\nP2\n178.56\n170.61\n168.32\n\n\nP3\n182.28\n179.95\n195.78\n\n ⚠Triggers may have already comeGet Real Time Triggers HereSupport and Resistance Plot Chart for AMD    Blue = Current PriceRed= ResistanceGreen = SupportReal Time Updates for Repeat Institutional Readers:Factset: Request User/PassBloomberg, Reuters, Refinitiv, Zacks, or IB users: Access Here.Instructions:Click the Get Real Time Updates button below.In the login prompt, select forgot usernameType the email you use for FactsetUse the user/pass you receive to loginYou will have 24/7 access to real time updates.From then on you can just click to get the real time update whenever you want.GET REAL TIME UPDATESMarket Crash Leading IndicatorOur Market Crash Leading Indicator isEvitar Corte.Evitar Corte warned of market crash risk four times since 2000.It identified the Internet Debacle before it happened.It identified the Credit Crisis before it happened.It identified the Corona Crash too.See what Evitar Corte is Saying Now.Get Notified When our Ratings Change:Take a Trial How do we know what is going on #behindthescenes of a company?  According to Stock Traders Daily, a 20-year #financialindustry innovator, the best way to do this to to watch the price action in the stock.  The  Advanced Micro Devices Inc. (NYSE: AMD) report below is a real world example. Included are trading plans for AMD, but this report is static.  If you want an update, or a different stock, please get one here Unlimited Real Time Reports.   Fundamental Charts for AMD:AMD EPS AnalysisAMD Revenue ChartAMD Dividend ChartAMD Stock chartAMD Growth rate - QuarterlyAMD Growth rate - YearlyAMD PE chartAMD PEG chart The technical summary data tells us to buy AMD near 168.32 with an upside target of 195.78.  This data also tells us to set a stop loss @ 167.83 to protect against excessive loss in case the stock begins to move against the trade.  168.32 is the first level of support below 180.49 , and by rule, any test of support is a buy signal.  In this case, support 168.32 is being tested, a buy signal would exist. The technical summary data is suggesting a short of AMD as it gets near 195.78 with a downside target of 168.32.  We should have a stop loss in place at 196.35though. 195.78 is the first level of resistance above 180.49, and by rule, any test of resistance is a short signal.  In this case, if resistance 195.78 is being tested, a short signal would exist. If 195.78 begins to break higher, the technical summary data tells us to buy AMD just slightly over 195.78, with an upside target of n/a.  The data also tells us to set a stop loss @ 195.21 in case the stock turns against the trade.  195.78 is the first level of resistance above 180.49, and by rule, any break above resistance is a buy signal.  In this case, 195.78, initial resistance, would be breaking higher, so a buy signal would exist.  Because this plan is based on a break of resistance, it is referred to as a Long Resistance Plan. The technical summary data is suggesting a short of AMD if it tests 195.78 with a downside target of 179.95. We should have a stop loss in place at 196.35 though in case the stock begins to move against the trade.  By rule, any test of resistance is a short signal.  In this case, if resistance, 195.78, is being tested a short signal would exist.  Because this plan is a short plan based on a test of resistance it is referred to as a Short Resistance Plan. If 182.28 begins to break higher, the technical summary data tells us to buy AMD just slightly over 182.28, with an upside target of 195.78.  The data also tells us to set a stop loss @ 181.85 in case the stock turns against the trade.  182.28 is the first level of resistance above 180.49, and by rule, any break above resistance is a buy signal.  In this case, 182.28, initial resistance, would be breaking higher, so a buy signal would exist.  Because this plan is based on a break of resistance, it is referred to as a Long Resistance Plan. The technical summary data is suggesting a short of AMD if it tests 182.28 with a downside target of 179.95. We should have a stop loss in place at 182.71 though in case the stock begins to move against the trade.  By rule, any test of resistance is a short signal.  In this case, if resistance, 182.28, is being tested a short signal would exist.  Because this plan is a short plan based on a test of resistance it is referred to as a Short Resistance Plan. Real Time Updates are available on our   Advanced Micro Devices Inc. (AMD) Page here:   AMD. AMD Ratings for March 29: Blue = Current PriceRed= ResistanceGreen = Support Click the Get Real Time Updates button below. In the login prompt, select forgot username Type the email you use for Factset Use the user/pass you receive to login You will have 24/7 access to real time updates. From then on you can just click to get the real time update whenever you want. GET REAL TIME UPDATES Evitar Corte warned of market crash risk four times since 2000. It identified the Internet Debacle before it happened. It identified the Credit Crisis before it happened. It identified the Corona Crash too. See what Evitar Corte is Saying Now. Get Notified When our Ratings Change:Take a Trial How do we know what is going on #behindthescenes of a company?  According to Stock Traders Daily, a 20-year #financialindustry innovator, the best way to do this to to watch the price action in the stock.  The  Advanced Micro Devices Inc. (NYSE: AMD) report below is a real world example. Included are trading plans for AMD, but this report is static.  If you want an update, or a different stock, please get one here Unlimited Real Time Reports.  Fundamental Charts for AMD: TRADING PLANS ON MORE STOCKS Type a few symbols to get started. The technicals for these will appear immediately on your My Stocks Page. We do the work. Type a few symbols to get started. The technicals for these will appear immediately on your My Stocks Page. We do the work. © 2022-2024 - All Rights Reserved "
}