{
    "title": null,
    "date": "3/5/2024",
    "url": "https://techraptor.net/gaming/news/horizon-forbidden-west-pc-requirements",
    "text": " Nixxes and Guerrilla Games have revealed the kind of PC specs you're going to need to run Horizon Forbidden West. Published: March 5, 2024 8:50 AM / By: Joseph Allen Nixxes and developer Guerrilla Games have announced the Horizon Forbidden West PC requirements you're going to need to fulfil if you want to run the game on your machine. In a PlayStation Blog post revealing the specs, the two studios say they've worked to create a range of presets in order to ensure that you'll be able to run the game \"on a wide variety of PC hardware\". Hopefully, this should mean that you'll be able to enjoy the delights of Horizon Forbidden West Complete Edition on PC, even if your computer is a few years old by now. Here's the full Horizon Forbidden West PC spec sheet. There are four presets, and they'll all require at least 16GB of RAM, as well as 150GB of SSD space and Windows 10 or above as your operating system. Naturally, you'll also find lots of options within Horizon Forbidden West's graphics menus that allow you to tweak individual settings like level of detail, shadow quality, and more. It looks like if your machine is somewhere between the aforementioned presets, you should still be able to find something that works for you. Horizon Forbidden West Complete Edition arrives on PC on March 21st. It'll pack in both the base game and its Burning Shores expansion. You can read our very own Tyler's review of the base game here, and you can check out what he thought of the DLC here. Have a tip, or want to point out something we missed? Leave a Comment or e-mail us at tips@techraptor.net Joe has been writing for TechRaptor for five years, and in those five years has learned a lot about the gaming industry and its foibles. He’s originally an… More about Joseph TechRaptor is a gaming website that covers topics around video games and tabletop games for gamers.  Whether it is news, reviews, features, or guides – we're your source for high quality gaming content since 2013. Copyright © 2013-2024 TechRaptor LLC - All Rights Reserved "
}