{
    "title": "Fisker Ocean becomes sudden Tesla Model 2 competitor with new $24999 price \n— you still probably shouldn't buy one",
    "date": "3/28/2024",
    "url": "https://www.notebookcheck.net/Fisker-Ocean-becomes-sudden-Tesla-Model-2-competitor-with-new-24-999-price-you-still-probably-shouldn-t-buy-one.819183.0.html",
    "text": "Looking back, there have been many signs pointing Fisker's slow march towards death, with a last-ditch switch in sales tactics, severely lacking software features, and an overall lack of polish on the vehicles it delivered to customers. Additionally, as The LA Times reports, the EV company has cut back 15% of its staff and halted production for six weeks while it looks for a financial saviour. In what appears to be a move to generate cash flow, Fisker announced massive price cuts across the board for its Ocean electric SUVs, turning what was once a luxury SUV into a competitor for the upcoming Tesla Model 2 with a new $24,999 starting price. The new price cuts apply to the 2023 model year Fisker Ocean Extreme, Ultra, and Sport trims, with the biggest drop coming from the Ocean Extreme, which dropped by $24,000 Fisker Ocean price changes: There is one glaring problem with these price cuts, though, according to a report by Motor1, who spoke to a Fisker dealer, Classic Fisker, for more details. Allegedly, the only Fisker Ocean EV in stock in the US is the Fisker Ocean Extreme, which is itself not available in the base model at all. \"I would caution you and other customers—Sports don’t exist right now. The $25,000 Sports, they’re not even here in the US right now. The Ultras at $35,000, they don’t exist in the US right now.\" When you look at this sitting inventory, there are no base Ultras available.\" –via Motor1 Confusingly, Fisker has this to say about the additional options in the discount announcement: \"Certain Ocean vehicles come equipped with as much as $7,000 worth of additional options – such as colors, 22” wheels, interiors, and other options – included in the discounted price.\" Whether those optional extras will end up costing buyers more at the end of the day remains to be seen, it seems, since Fisker's official announcement and the dealer's information are in direct conflict. While Fisker's announcement positions the Ocean as a compelling alternative to the Tesla Model Y or even the upcoming Tesla Model 2, that seems to be far from the reality of the situation. Given Fisker's current financial situation and the production halt, it seems risky to spend even $24,999 on a base Ocean Sport when they have yet to be produced. Read about the development of Tesla's EVs in Walter Isaacson's biography of Elon Musk, available on Amazon, or grab a Peak Design car vent phone mount on Amazon. Motor1 (1, 2), LA Times, Fisker [PDF] "
}