{
    "title": "Intel shipped 50 million PC CPUs in Q4 2023, six times as many as AMD",
    "date": "3/12/2024",
    "url": "https://www.techspot.com/news/102231-intel-shipped-50-million-pc-cpus-q4-2023.html",
    "text": "What just happened? In Q4 2023, Intel reportedly shipped 50 million CPUs, six times as many as AMD. The PC processor market is virtually a duopoly between Intel and AMD, with their chips powering almost all computers globally. However, over the past few years, OEMs have begun shipping some Arm-powered notebooks and convertibles, although they remain a small minority for the most part. The latest report on global CPU shipments comes from Canalys, which claims that Intel's global CPU market share climbed by three percent year-over-year in Q4 2023, reaching 50 million units. AMD was the second-largest manufacturer with eight million units, while Apple came in at number three with six million. However, unlike Intel, both AMD and Apple experienced a loss in market share, with their shipments decreasing by one percent and four percent, respectively. Overall, Intel held a massive 78 percent market share during the last quarter, while AMD's share stood at just 13 percent. Despite being major players in the mobile segment, MediaTek and Qualcomm both have marginal shares in the PC market. However, the former still managed to achieve 27 percent growth during the last quarter, largely due to the success of Chromebooks. According to Canalys analyst Ben Yeh, both companies could increase their market share in the future by providing processors for Windows devices.  The report also reveals that Intel managed to increase its CPU revenues by two percent to $41 billion, while Apple's revenues increased by eight percent year-over-year to reach $8 billion. AMD brought in $5 billion, representing a six percent increase over the same period last year. Qualcomm and MediaTek are yet to breach the $1 billion barrier, but the former is banking on a big year ahead with the impending launch of its Snapdragon X Elite and X Plus SoCs. Looking at the PC vendors, Lenovo was the biggest one for Intel, accounting for 25 percent of its total CPU shipments, while HP, Dell, Acer, and Asus rounded out the top five with 23 percent, 19 percent, seven percent, and six percent, respectively. For AMD, Lenovo was once again the biggest customer with a 40 percent share of the total CPU shipments for the company. HP, Asus, and Acer accounted for 29 percent, 14 percent, and six percent shares, respectively. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}