{
    "title": "AMD Ryzen 5 7600X vs Intel Xeon W-10855M vs Intel Core i7-10850H",
    "date": "3/27/2024",
    "url": "https://www.notebookcheck.net/R5-7600X-vs-W-10855M-vs-i7-10850H_14615_12207_11960.247596.0.html",
    "text": "The AMD Ryzen 5 7600X is a fast mid-range desktop processor of the Raphael series. It offers 6 cores based on the Zen 4 architecture that supports hyperthreading (12 threads). The cores clock from 4.7 (base) up to 5.7 GHz (single core boost). When all 6 cores are fully loaded, 5.3 GHz is the max. clock speed.  \nThe performance of the R5 7600X is clearly better than the old Ryzen 5 5600X thanks to the improved architecture and modern 5nm process. The single core performance is very good thanks to the high turbo clock speed (-400 MHz compared to the high end CPUs like the Ryzen 9 7950X). The multi-threaded performance is of course not that competitive due to only 6 cores. \nThe Raphael series still uses a chiplet design with two CCD-clusters (each with 8 possible cores) in 5nm and an IO-die (including the memory controller and the Radeon Graphics iGPU) in 6nm. \nThe R5 7600X is rated 105 Watt TDP and Raphael is rather power hungry compared to the 5000 series. The AMD Ryzen 5 7600X is a fast mid-range desktop processor of the Raphael series. It offers 6 cores based on the Zen 4 architecture that supports hyperthreading (12 threads). The cores clock from 4.7 (base) up to 5.7 GHz (single core boost). When all 6 cores are fully loaded, 5.3 GHz is the max. clock speed. The performance of the R5 7600X is clearly better than the old Ryzen 5 5600X thanks to the improved architecture and modern 5nm process. The single core performance is very good thanks to the high turbo clock speed (-400 MHz compared to the high end CPUs like the Ryzen 9 7950X). The multi-threaded performance is of course not that competitive due to only 6 cores. The Raphael series still uses a chiplet design with two CCD-clusters (each with 8 possible cores) in 5nm and an IO-die (including the memory controller and the Radeon Graphics iGPU) in 6nm. The R5 7600X is rated 105 Watt TDP and Raphael is rather power hungry compared to the 5000 series. The Intel Xeon W-10855M is a high-end processor for laptops with six cores based on the Comet Lake architecture (CML-H, 4th generation of Skylake). The processor clocks at between 2.8 and 4.8 GHz (probably 4.4 GHz with 6 cores) and can execute up to twelve threads simultaneously thanks to Hyper-Threading. The processor is still manufactured in the old 14nm (14nm++) process.  \nThe Comet Lake architecture is similar to Coffee Lake and offers the same features and is produced in the same 14nm process. Other than the improved clock rates, the memory controller now also supports faster DDR4-2933 RAM. More information on Comet Lake and all the models and articles on it can be found here. \nThe Intel Xeon W-10855M supports the management features vPro, TXT and SIPP and is the professional version of the Core i7-10850H with slightly higher clock speeds (+100 MHz base speed).  \nPerformance \nThe performance of the Xeon W-10855M should be similar to the old top model Core i7-8950H (6 cores, 2.9 - 4.8 GHz). Thanks to the 6 cores and high Turbo speeds, even demanding applications should run fine on the CPU. However, long term performance is always depending on the laptop cooling system and system configuration. \nGraphics \nThe integrated Intel UHD Graphics P630 iGPU is supposed to offer a similar performance as the UHD630 in the Core i7-9750H. As a  low-end solution it will only run current games smoothly at reduced details - if at all. \nPower Consumption \nIntel specifies the TDP with 45 watts and therefore the i7 is only suited for big laptops with good cooling solutions. Using cTDP-down, the CPU can also be configured to 35 Watt resulting in a reduced performance. The Intel Xeon W-10855M is a high-end processor for laptops with six cores based on the Comet Lake architecture (CML-H, 4th generation of Skylake). The processor clocks at between 2.8 and 4.8 GHz (probably 4.4 GHz with 6 cores) and can execute up to twelve threads simultaneously thanks to Hyper-Threading. The processor is still manufactured in the old 14nm (14nm++) process. The Comet Lake architecture is similar to Coffee Lake and offers the same features and is produced in the same 14nm process. Other than the improved clock rates, the memory controller now also supports faster DDR4-2933 RAM. More information on Comet Lake and all the models and articles on it can be found here. The Intel Xeon W-10855M supports the management features vPro, TXT and SIPP and is the professional version of the Core i7-10850H with slightly higher clock speeds (+100 MHz base speed). Performance The performance of the Xeon W-10855M should be similar to the old top model Core i7-8950H (6 cores, 2.9 - 4.8 GHz). Thanks to the 6 cores and high Turbo speeds, even demanding applications should run fine on the CPU. However, long term performance is always depending on the laptop cooling system and system configuration. Graphics The integrated Intel UHD Graphics P630 iGPU is supposed to offer a similar performance as the UHD630 in the Core i7-9750H. As a  low-end solution it will only run current games smoothly at reduced details - if at all. Power Consumption Intel specifies the TDP with 45 watts and therefore the i7 is only suited for big laptops with good cooling solutions. Using cTDP-down, the CPU can also be configured to 35 Watt resulting in a reduced performance. The Intel Core i7-10850H is a high-end processor for laptops with six cores based on the Comet Lake architecture (CML-H, 4th generation of Skylake). The processor clocks at between 2.7 and 5.1 GHz (with Thermal Velocity Boost and Turbo Boost 3.0). Using only Turbo Boost 3.0 (when the temperatures don't allow the the Thermal Velocity Boost) a single core can reach 4.9 GHz. All six cores can reach 4.4 GHz. The processor is still manufactured on the old 14nm (14nm++) process.  \nThe Comet Lake architecture is similar to Coffee Lake and offers the same features and is produced on the same 14nm process. Other than the improved clock rates, the memory controller now also supports faster DDR4-2933 RAM. More information on Comet Lake and all the models and articles on it can be found here. \nThe Core i7-10850H supports the management features vPro, TXT and SIPP. \nPerformance \nThe average 10850H in our database proves to be a somewhat disappointing CPU, only matching the Core i5-10500H and the Ryzen 5 5500U in multi-thread performance. While the Core i7 will have no issue running any app or any game you can install in 2021, there are better options out there both in terms of sheer power and in terms of power efficiency. \nYour mileage may vary depending on how high the CPU power limits are, and how competent the cooling solution of your system is. \nGraphics \nThe integrated Intel UHD Graphics 630 iGPU is supposed to offer a similar performance as the UHD 630 in the Core i7-9750H. As a low-end solution it will only run current games smoothly at reduced details - if at all. \nPower consumption \nThis Core i7 series chip has a default TDP, also known as the long-term power limit, of 45 W, a value that laptop makers are free to reduce somewhat (with 35 W being the minimum Intel-recommended value) resulting in lower clock speeds and lower performance. Either way, the CPU is way too power-hungry to be the heart of a passively cooled mini-PC, laptop, tablet. \nThe i7-10850H is manufactured on one of the old 14 nm Intel processes leading to subpar, as of early 2023, energy efficiency. The Intel Core i7-10850H is a high-end processor for laptops with six cores based on the Comet Lake architecture (CML-H, 4th generation of Skylake). The processor clocks at between 2.7 and 5.1 GHz (with Thermal Velocity Boost and Turbo Boost 3.0). Using only Turbo Boost 3.0 (when the temperatures don't allow the the Thermal Velocity Boost) a single core can reach 4.9 GHz. All six cores can reach 4.4 GHz. The processor is still manufactured on the old 14nm (14nm++) process. The Comet Lake architecture is similar to Coffee Lake and offers the same features and is produced on the same 14nm process. Other than the improved clock rates, the memory controller now also supports faster DDR4-2933 RAM. More information on Comet Lake and all the models and articles on it can be found here. The Core i7-10850H supports the management features vPro, TXT and SIPP. Performance The average 10850H in our database proves to be a somewhat disappointing CPU, only matching the Core i5-10500H and the Ryzen 5 5500U in multi-thread performance. While the Core i7 will have no issue running any app or any game you can install in 2021, there are better options out there both in terms of sheer power and in terms of power efficiency. Your mileage may vary depending on how high the CPU power limits are, and how competent the cooling solution of your system is. Graphics The integrated Intel UHD Graphics 630 iGPU is supposed to offer a similar performance as the UHD 630 in the Core i7-9750H. As a low-end solution it will only run current games smoothly at reduced details - if at all. Power consumption This Core i7 series chip has a default TDP, also known as the long-term power limit, of 45 W, a value that laptop makers are free to reduce somewhat (with 35 W being the minimum Intel-recommended value) resulting in lower clock speeds and lower performance. Either way, the CPU is way too power-hungry to be the heart of a passively cooled mini-PC, laptop, tablet. The i7-10850H is manufactured on one of the old 14 nm Intel processes leading to subpar, as of early 2023, energy efficiency. #0 checking url part for id 14615 +0s ... 0s #1 checking url part for id 12207 +0s ... 0s #2 checking url part for id 11960 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.032s ... 0.033s #6 did output specs +0s ... 0.033s #7 getting avg benchmarks for device 14615 +0.014s ... 0.046s #8 got single benchmarks 14615 +0.018s ... 0.065s #9 getting avg benchmarks for device 12207 +0.003s ... 0.068s #10 got single benchmarks 12207 +0.006s ... 0.073s #11 getting avg benchmarks for device 11960 +0.014s ... 0.087s #12 got single benchmarks 11960 +0.01s ... 0.097s #13 got avg benchmarks for devices +0s ... 0.097s #14 min, max, avg, median took s +0.227s ... 0.324s #15 return log +0s ... 0.324s "
}