{
    "title": null,
    "date": "3/16/2024",
    "url": "https://www.fool.com/investing/2024/03/16/could-amd-become-the-next-nvidia/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia's (NVDA 0.12%) stock price nearly quadrupled over the past 12 months as its clients ramped up their orders for its high-end data center graphics processing units (GPUs) to help them take on complex artificial intelligence (AI) tasks. The soaring popularity of generative AI platforms like OpenAI's ChatGPT caused the market's demand for new GPUs to outstrip its available supply, and analysts expect the chipmaker's revenue to surge 81% in fiscal 2025 (which ends in January 2025). Nvidia's stock might still have plenty of room to run as the AI market expands, but its stock is getting a bit pricey at 37x forward earnings. With a market cap of $2.3 trillion, Nvidia has already become the world's third-most valuable company after Microsoft and Apple. So it could be tough to replicate its multibagger gains from the past several years. Image source: Getty Images. That's why many growth-oriented investors are already on the lookout for the \"next Nvidia.\" Could the top candidate for that title actually be its rival Advanced Micro Devices (AMD 0.50%), which competes against Nvidia in the gaming and data center GPU markets? AMD is a much smaller company than Nvidia. It only has a market cap of $315 billion, and analysts expect it to generate less than one-quarter of Nvidia's annual revenue this fiscal year. AMD only controlled 19% of the discrete GPU market in the fourth quarter of 2023, according to JPR, while Nvidia held an 80% share. Intel held the remaining 1% share. AMD usually sells cheaper GPUs than Nvidia, but the latter has also rolled out lower-end chips in recent years to limit the former's gains in the lower-end market. Nvidia also established a strong position in the data center GPU market before AMD. Unlike Nvidia, AMD competes against Intel in x86 CPUs for PCs and servers. AMD held 35.5% of that market in the first quarter of 2024, according to PassMark Software, while Intel held a 63.4% share. Over the past eight years, AMD grew its share of the x86 CPU market by consistently selling cheaper, denser, and more power-efficient chips than Intel. It accomplished that by outsourcing its production to Taiwan Semiconductor Manufacturing as Intel struggled to upgrade its own internal foundries. AMD also sells custom APUs (which merge a GPU and CPU) for gaming consoles and notebook computers, as well as programmable chips for various markets. Nvidia sells Arm-based Tegra CPUs for set-top boxes and the Nintendo Switch and offers data center networking products through its Mellanox subsidiary. Simply put, AMD is a more broadly diversified chipmaker that generated 29% of its revenue from the data center market, 27% from the gaming market, 23% from embedded chips (including its programmable chips), and the remaining 21% from client computing chips (PC CPUs and GPUs) in 2023. In its comparable fiscal 2024, Nvidia generated a whopping 78% of its revenue from its data center GPUs and the remaining 22% from other types of chips. AMD's heavy exposure to the PC market, which suffered a major slowdown after the pandemic passed, throttled its growth over the past year. In 2023, its revenue and adjusted earnings per share (EPS) fell 4% and 24%, respectively. By comparison, Nvidia's revenue and adjusted EPS surged 126% and 288%, respectively, in fiscal 2024. That growth was entirely driven by its brisk sales of data center GPUs, which offset the slower growth of its PC-oriented chips. AMD has been expanding into the data center market with its own AI-oriented Instinct GPUs, and CEO Lisa Su recently said those deployments were \"accelerating\" and on track to become the \"fastest revenue ramp of any product\" in its entire history. AMD plans to carve out its own niche in the data center market with those cheaper GPUs and can bundle them with its Epyc data center CPUs and programmable chips. It probably won't overtake Nvidia in the AI race, but many major companies -- including Microsoft, Meta Platforms, Oracle, Dell, and Hewlett Packard Enterprise -- have already been installing AMD's chips as a cost-efficient alternative to Nvidia's chips. Analysts expect AMD's revenue and adjusted EPS to rise 14% and 37%, respectively, in 2024 as the PC market stabilizes and its data center business expands. In 2025, they expect its revenue and adjusted EPS to grow 26% and 51%, respectively. AMD seems a bit pricier than Nvidia at 58x forward earnings, and its near-term growth will rely more on the PC market than the data center market. It will also remain an underdog in the GPU and CPU markets -- instead of leading those two markets like Nvidia and Intel. AMD is still a promising semiconductor play, but its broader diversification, slower growth rates, and lower market share should prevent it from becoming the \"next Nvidia\" over the next few years. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Leo Sun has positions in Apple, Meta Platforms, and Nintendo. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Meta Platforms, Microsoft, Nvidia, Oracle, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Intel and Nintendo and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short January 2026 $405 calls on Microsoft, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}