{
    "title": "AMD's CTO Threatens To Bring AI To All Their Gaming Devices",
    "date": "3/15/2024",
    "url": "https://gameranx.com/updates/id/493004/article/amds-cto-threatens-to-bring-ai-to-all-their-gaming-devices/",
    "text": "Gameranx Video Game News, Lists & Guides This is one rumor that gamers may not want to actually be true. AMD is a major player in the video game console industry, and also one of many tech proponents eager to go all in on AI. Now, AI states they plan to bring all of it together. As reported by WCCFTech, AMD’s Chief Technology Officer Mark Papermaster stated that AMD plans to ‘deploy’ their new technologies across their businesses. He also specifically mentions AI upscaling for gaming. Here’s his statement, as transcribed in the No Priors Podcast: “Well this, for us, is a huge year because we have spent so many years developing our hardware and software capabilities for AI. We’ve just completed AI enabling our entire portfolio. So Cloud, Edge, our PCS, our our embedded devices, our gaming devices – we’re enabling our gaming devices to upscale using AI. And 2024 is really a huge deployment year for us.” Papermaster then elaborated on what AMD wants to accomplish in 2024 in the AI space of the tech industry: “I think we’re often unknown in the AI space. Everyone knows our competitor. We not only want to be known in the AI space, but, based on the results, based on the capabilities, and the value we provide, we want to be known, over the course of 2024, as the company that really enabled and brought AI across those breadth of applications.“ So Papermaster makes two very interesting assertions in regards to AI and video game consoles. He claims that AMD has already ‘enabled’ AI upscaling on their CPUs. We know that both the PlayStation 5 and the Xbox Series X|S use AMD CPUs manufactured years ago, and those DPUs didn’t have AI capabilities yet. AI for Microsoft’s and Sony’s consoles may be coming to future iterations, if they use AMD’s new technologies. Now, rumors are going around that Sony is planning to release a PlayStation 5 Pro this year, partly to compensate for a lack of AAA game releases. Microsoft’s future hardware plans are blurrier, as they may also release Xbox Series Pro consoles, or they may jump to the next console generation earlier than Sony. Whichever route Sony or Microsoft chooses for their future console hardware, they will be the beneficiaries of AMD’s ambitions. AMD will definitely do all they can to make PlayStation and Xbox alike as showcases of their AI upscaling technologies, and yes, the incentive is there to do well for both platforms. Outside of gaming, Microsoft is a bigger client for AMD than Sony is. On top of that, AMD doesn’t want to create this perception that they will give preferential treatment to some clients over others. Gamers might like to see that, but potential clients, AMD’s real customers, will be turned off from doing business with them. AI upscaling would certainly raise the capabilities of PlayStation and Xbox consoles immediately, but of course, this technology creates new issues as well. Will gamers really want to play 60 FPS, even 120 FPS games on their consoles, if those frames are AI generated? Even gamers open to AI know that AI generated frames affect input lag for video games. All in all, it may be an interesting rumor, but it may not be something that gamers want to actually be true. Connect with Us Articles You’ll Enjoy Newsletter Subscribe to our newsletter to receive email notifications of new posts and updates. Copyright © 2024 · Gameranx · All Rights Reserved · Powered by BizBudding "
}