{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.notebookcheck.net/GeForce-GTX-1650-Ti-Max-Q-vs-Radeon-740M-vs-GeForce-GTX-1660-Ti-Max-Q_10309_11588_9832.247598.0.html",
    "text": "The Nvidia GeForce GTX 1650 Ti Max-Q (N18P-G62) is a dedicated mid range graphics card for laptops based on the Turing architecture. The Max-Q variant is the power saving version of the mobile GTX 1650Ti with reduced clock speeds, performance and of course power consumption. It is using the same TU117 chip with 1,024 shaders. Therefore, it is intended for thin and light gaming laptops. Compared to the faster RTX 2000 GPUs (e.g. RTX 2060), the 1650 Ti integrates no Raytracing or Tensor cores. \nThere are two variants of the 1650Ti Max-Q, one with 35 Watt and 1035 - 1200 MHz and a faster 40 Watt version with a clock speed of 1200 - 1365 MHz. Both however are significantly lower clocked than the normal Max-P version with 50 / 55 Watt and 1350-1385 MHz. The memory is most likely clocked at 1250 MHz = 10,000 MHz effective (Gbps) in most laptops, although there might be versions with 1500 MHz = 12,000 Gbps.The Turing generation did not only introduce raytracing for the RTX cards, but also optimized the architecture of the cores and caches. According to Nvidia the CUDA cores offer now a concurrent execution of floating point and integer operations for increased performance in compute-heavy workloads of modern games. Furthermore, the caches were reworked (new unified memory architecture with twice the cache compared to Pascal). This leads to 50% more instructions per clock and a 40% more power efficient usage compared to Pascal. \nCompared to the bigger Turing chips (like the TU116 of the GTX 1660 Ti and the RTX lineup), the TU117 does not include the new NVENC encoder but an older one similar to the one used in Pascal and Volta. \nThe power consumption of the 1650 Ti Max-Q laptops is specified at 35 Watt TGP (Total Graphics Power) by Nvidia and therefore 25 Watt lower than the mobile GTX 1650 Ti in the same package (other variants can reach up to 80 Watt). The Nvidia GeForce GTX 1650 Ti Max-Q (N18P-G62) is a dedicated mid range graphics card for laptops based on the Turing architecture. The Max-Q variant is the power saving version of the mobile GTX 1650Ti with reduced clock speeds, performance and of course power consumption. It is using the same TU117 chip with 1,024 shaders. Therefore, it is intended for thin and light gaming laptops. Compared to the faster RTX 2000 GPUs (e.g. RTX 2060), the 1650 Ti integrates no Raytracing or Tensor cores. There are two variants of the 1650Ti Max-Q, one with 35 Watt and 1035 - 1200 MHz and a faster 40 Watt version with a clock speed of 1200 - 1365 MHz. Both however are significantly lower clocked than the normal Max-P version with 50 / 55 Watt and 1350-1385 MHz. The memory is most likely clocked at 1250 MHz = 10,000 MHz effective (Gbps) in most laptops, although there might be versions with 1500 MHz = 12,000 Gbps. The Turing generation did not only introduce raytracing for the RTX cards, but also optimized the architecture of the cores and caches. According to Nvidia the CUDA cores offer now a concurrent execution of floating point and integer operations for increased performance in compute-heavy workloads of modern games. Furthermore, the caches were reworked (new unified memory architecture with twice the cache compared to Pascal). This leads to 50% more instructions per clock and a 40% more power efficient usage compared to Pascal. Compared to the bigger Turing chips (like the TU116 of the GTX 1660 Ti and the RTX lineup), the TU117 does not include the new NVENC encoder but an older one similar to the one used in Pascal and Volta. The power consumption of the 1650 Ti Max-Q laptops is specified at 35 Watt TGP (Total Graphics Power) by Nvidia and therefore 25 Watt lower than the mobile GTX 1650 Ti in the same package (other variants can reach up to 80 Watt). The AMD Radeon 740M is an integrated GPU in the Ryzen 7040 series for laptops (Phoenix, e.g. Ryzen 5 7540U). The iGPU is based on the new RDNA3 architecture and has only 4 of the 12 CUs (= 256 shaders) clocked at up to 2.5 GHz (depending on the CPU model). The 740M supports hardware raytracing, although the performance is too slow to use it in current games. \nDue to the reduced core count and clock speed, the performance is clearly below the Radeon 760M and 780M. \nThanks to the modern 4nm process and clever power-saving features, the power consumption is comparatively low (according to AMD). The whole chip of the first two models can be configured between 15 - 30 Watt TDP. The AMD Radeon 740M is an integrated GPU in the Ryzen 7040 series for laptops (Phoenix, e.g. Ryzen 5 7540U). The iGPU is based on the new RDNA3 architecture and has only 4 of the 12 CUs (= 256 shaders) clocked at up to 2.5 GHz (depending on the CPU model). The 740M supports hardware raytracing, although the performance is too slow to use it in current games. Due to the reduced core count and clock speed, the performance is clearly below the Radeon 760M and 780M. Thanks to the modern 4nm process and clever power-saving features, the power consumption is comparatively low (according to AMD). The whole chip of the first two models can be configured between 15 - 30 Watt TDP. The Nvidia GeForce GTX 1660 Ti with Max-Q Design is a mobile graphics card for laptops that is based on the Turing architecture (TU116 chip). It is designed for thin and light laptops and about 10-15% slower than a regular GTX 1660 Ti for laptops (depending on the cooling capabilities). According to the specifications, the Max-Q variant clocks 22% slower for the base speed and 16% for the boost speed. \n Compared to the faster RTX 2000 GPUs (e.g. RTX 2060), the 1660Ti integrates no Raytracing or Tensor cores. The performance is similar to the old GTX 1070 (Max-Q) but at a reduced TGP of 60 Watt (versus 80 of the laptop version 115 Watt of the desktop version).  \nIn April 2020 Nvidia refreshed the GTX 1660 Ti with the new codename N18E-G0-A1 with similar specs and pin compatible to the refreshed RTX chips (e.g., RTX 2070 Super Mobile).The Turing generation did not only introduce raytracing for the RTX cards, but also optimized the architecture of the cores and caches. According to Nvidia the CUDA cores offer now a concurrent execution of floating point and integer operations for increased performance in compute-heavy workloads of modern games. Furthermore, the caches were reworked (new unified memory architecture with twice the cache compared to Pascal). This leads to 50% more instructions per clock and a 40% more power efficient usage compared to Pascal. \nNvidia specifies a power consumption of 60 Watt TGP (Total Graphics Power) and therefore 20 Watts lower than a normal (Max-P) 1660Ti for laptops. Therefore, the Max-Q variant is well suited for thin and light gaming laptops. The TU116 chip is manufactured in 12nm FFN at TSMC. The Nvidia GeForce GTX 1660 Ti with Max-Q Design is a mobile graphics card for laptops that is based on the Turing architecture (TU116 chip). It is designed for thin and light laptops and about 10-15% slower than a regular GTX 1660 Ti for laptops (depending on the cooling capabilities). According to the specifications, the Max-Q variant clocks 22% slower for the base speed and 16% for the boost speed. Compared to the faster RTX 2000 GPUs (e.g. RTX 2060), the 1660Ti integrates no Raytracing or Tensor cores. The performance is similar to the old GTX 1070 (Max-Q) but at a reduced TGP of 60 Watt (versus 80 of the laptop version 115 Watt of the desktop version). In April 2020 Nvidia refreshed the GTX 1660 Ti with the new codename N18E-G0-A1 with similar specs and pin compatible to the refreshed RTX chips (e.g., RTX 2070 Super Mobile). The Turing generation did not only introduce raytracing for the RTX cards, but also optimized the architecture of the cores and caches. According to Nvidia the CUDA cores offer now a concurrent execution of floating point and integer operations for increased performance in compute-heavy workloads of modern games. Furthermore, the caches were reworked (new unified memory architecture with twice the cache compared to Pascal). This leads to 50% more instructions per clock and a 40% more power efficient usage compared to Pascal. Nvidia specifies a power consumption of 60 Watt TGP (Total Graphics Power) and therefore 20 Watts lower than a normal (Max-P) 1660Ti for laptops. Therefore, the Max-Q variant is well suited for thin and light gaming laptops. The TU116 chip is manufactured in 12nm FFN at TSMC. The following benchmarks stem from our benchmarks of review laptops. The performance depends on the used graphics memory, clock rate, processor, system settings, drivers, and operating systems. So the results don't have to be representative for all laptops with this GPU. For detailed information on the benchmark results, click on the fps number. Average Gaming 30-70 fps → 100% Average Gaming 30-70 fps → 155% For more games that might be playable and a list of all games and graphics cards visit our Gaming List #0 checking url part for id 10309 +0s ... 0s #1 checking url part for id 11588 +0s ... 0s #2 checking url part for id 9832 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:39:02 +0200 +0.001s ... 0.001s #5 composed specs +0.106s ... 0.107s #6 did output specs +0s ... 0.107s #7 start showIntegratedCPUs +0s ... 0.107s #8 getting avg benchmarks for device 10309 +0.034s ... 0.141s #9 got single benchmarks 10309 +0.037s ... 0.178s #10 getting avg benchmarks for device 11588 +0.002s ... 0.18s #11 got single benchmarks 11588 +0.006s ... 0.185s #12 getting avg benchmarks for device 9832 +0.016s ... 0.202s #13 got single benchmarks 9832 +0.029s ... 0.23s #14 got avg benchmarks for devices +0s ... 0.23s #15 min, max, avg, median took s +0.226s ... 0.456s #16 before gaming benchmark output +0s ... 0.456s #17 Got 747 rows for game benchmarks. +0.077s ... 0.533s #18 composed SQL query for gamebenchmarks +0s ... 0.533s #19 got data and put it in $dataArray +0.049s ... 0.582s #20 benchmarks composed for output. +0.15s ... 0.732s #21 calculated avg scores. +0s ... 0.732s #22 return log +0.004s ... 0.736s "
}