{
    "title": "Missed Out on Nvidia? My Best Chip Stock to Buy and Hold",
    "date": "3/11/2024",
    "url": "https://ca.finance.yahoo.com/news/missed-nvidia-best-chip-stock-003000246.html",
    "text": "Written by Puja Tayal at The Motley Fool Canada The ChatGPT sensation in 2023 reversed the 2022 tech bubble burst for Nvidia (NASDAQ:NVDA), struggling with huge declines in the PC and gaming markets. Nvidia stock surged almost 500% since January 2023, making new milestones of US$400 and US$800, way above its 2021 crypto peak of around US$330. If you missed Nvidia’s stock price rally, you could still make up for it by buying Advanced Micro Devices (NASDAQ:AMD) stock. AMD stock has surged 182% since January 2023 and is yet to realize the sales growth from its artificial intelligence (AI) portfolio. After PC, server, and mobile computing, we are entering the next age of AI and accelerated computing. AI computing processes large amounts of data in real time and develops inferences from it to deliver actionable insights. This level of computing needs specialized chips and supporting software that can handle such large amounts of computing load. Nvidia’s graphics processing units (GPUs) remain unbeatable in AI, gaming, and edge computing. However, AMD has also been developing a complete end-to-end AI infrastructure, comprising AI chips for clouds, data centres, servers, PCs, and embedded devices. AMD has a full suite of competitive central processing units (CPUs) used for general-purpose computing, GPUs for accelerated computing, and data processing units (DPUs) for moving data around the data centre. Like Nvidia, AMD’s data centre segment’s revenue has surpassed the revenue of the PC and gaming segments, marking the age of AI. However, AMD has not yet realized the sales from the AI boom. AMD’s data centre revenue surged 7% to US$6.5 billion in full-year 2023, while Nvidia’s data centre revenue surged 409% to US$18.4 billion in just the fourth quarter of 2023. AMD may not realize the same growth as Nvidia, but it is chasing the same AI boom as Nvidia. Some analysts expect Nvidia’s stock price to see some correction as the AI GPU shortage eases. AMD could also see some correction. But these are the stocks to buy and hold for the long term, irrespective of the market. Here’s why. A PC, mobile phone, car, or software can face disruption from technological advancements. Mobile phones replaced PCs in many areas, like accessing the internet. But a chip is the starting point of any technological innovation. They are here to stay and facilitate disruptive technological advancements through more powerful and efficient chips. Semiconductors are the most complex pieces of technology, and mastering them takes decades of research. There are very few chip companies that can make advanced chips. Nvidia and AMD are the only two that offer high-performance discrete GPUs. AMD and Intel are the only two companies with high-performance PC and server CPUs. This intellectual property (IP) advantage puts AMD and Nvidia at the sweet spot for long-term growth. In this digital age, work is ongoing on several technology forms like AI, robotics, drones, autonomous cars, satellites, and space research. All of it needs high-performance computing of AMD and Nvidia chips. AMD is set to ride the AI wave. It is developing the networking capabilities to facilitate the AI ecosystem. Nvidia already rode the gaming and crypto wave and is now riding the AI wave. It also has a competitive advantage in the future technologies of autonomous cars and AI at the edge. In the next 10 years, US$880 might look cheap for one stock of Nvidia. Similarly, US$200 might look like a bargain for a stock of AMD 10 years from now. The post Missed Out on Nvidia? My Best Chip Stock to Buy and Hold  appeared first on The Motley Fool Canada. Before you buy stock in Advanced Micro Devices Inc., consider this: The Motley Fool Stock Advisor Canada analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices Inc. wasn’t one of them. The 10 stocks that made the cut could potentially produce monster returns in the coming years. Consider MercadoLibre, which we first recommended on January 8, 2014 ... if you invested $1,000 in the “eBay of Latin America” at the time of our recommendation, you’d have $17,988!* Stock Advisor Canada provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month – one from Canada and one from the U.S. The Stock Advisor Canada service has outperformed the return of S&P/TSX Composite Index by 35 percentage points since 2013*. See the 10 stocks * Returns as of 1/24/24 More reading 10 Stocks Every Canadian Should Own in 2024 [PREMIUM PICKS] Can You Guess the 10 Most Popular Canadian Stocks? (If You Own Them, You Might Be Losing Out.) More Canadian Stock Market News How to Build a Bulletproof Monthly Passive-Income Portfolio in 2024 With Just $25,000 Subscribe to Motley Fool Canada on YouTube Two New Stock Picks Every Month! Fool contributor Puja Tayal has no position in any of the stocks mentioned. The Motley Fool recommends Advanced Micro Devices, Intel, and Nvidia. The Motley Fool has a disclosure policy. 2024 The CPP pegs the start retirement age at 65, but it's not necessarily the ideal option to start pension payments. The post Why Claiming CPP at 65 Could Be a Mistake appeared first on The Motley Fool Canada. Here's why undervalued TSX energy stocks such as Secure Energy Services should be part of equity portfolio in 2024. The post 2 Absurdly Cheap Energy Stocks I’d Buy in April 2024 appeared first on The Motley Fool Canada. This dividend stock has been absolutely crushing the TSX 60 and looks like it will continue to do so while providing a juicy dividend. The post Beat the TSX With This Cash-Gushing Dividend Stock appeared first on The Motley Fool Canada. Berkshire Hathaway’s chairman Warren Buffett, one of the world's most famed investors, is still faithful to the fact that holding steady, being patient and believing in the power of value investing is key to successful investments. Just as important to Buffett's investment strategy, though, are the investments he doesn't believe in. Here are but a few of the investment types that the Oracle of Omaha would rather not waste money on. The stock value of Reddit and Donald Tump's Truth Social took a hit by the end of trading on Thursday ahead of Easter weekend and the NYSE's Friday closure. BCE (TSX:BCE) stock is a dividend juggernaut that's getting beyond cheap at multi-year depths. The post 1 Nosediving Blue-Chip Stock That’s Getting Ridiculously Cheap appeared first on The Motley Fool Canada. With stocks off to their best start in five years, many strategists on Wall Street still make a case for the S&P 500 to keep chugging higher. Sienna stock (TSX:SIA) looks like a strong dividend stock that's only getting stronger, but there is more growth available. The post 1 Dividend Stock Down 20% to Buy Right Now appeared first on The Motley Fool Canada. Fairfax Financial Holdings (TSX:FFH) and another TSX stock I'd buy and hold for the next five decades in a TFSA! The post Millennials: 2 TFSA-Worthy Stocks to Buy and Hold for 50 Years appeared first on The Motley Fool Canada. Do you own Enbridge (TSX:ENB) in your portfolio? Here's why every investor needs to own some Enbridge stock. The post Why Enbridge Stock Belongs in Every Portfolio appeared first on The Motley Fool Canada. Three million dollars sounds like the kind of money that lets you spend retirement sitting on the dock of your own boat, sipping mai tais (or coffee, if that's more of your thing). But a $3 million... Resale value is just one of many benefits. In this piece, we will take a look at the 25 biggest food companies in the world by revenue. If you want to skip our coverage of the global food industry and recent events, then you can check out 5 Biggest Food Companies in the World by Revenue. Just like the oil industry, the food […] When thinking about whether you’re financially prepared to retire or not, you’ll want to think about it in a certain way. You have a lifestyle that you would like to maintain, and a portfolio that can safely generate a specific amount of income each year. Once your costs and means overlap, you can afford to […] The post I'm 59 With a $1.4 Million Net Worth and $5k in Monthly Expenses. Can I Retire Now? appeared first on SmartReads by SmartAsset. If you've already created a diversified portfolio and are looking for more options from a windfall, here is where I would invest next. The post Where to Invest $10,000 in April 2024 appeared first on The Motley Fool Canada. Existing home inventory increased nearly 6% last month, suggesting the housing market's inventory crisis is easing. You can save a lot for retirement by cutting out expenses, and you can invest your savings in stocks like Toronto-Dominion Bank (TSX:TD). The post Cutting This 1 Expense Could Save You Thousands in Retirement appeared first on The Motley Fool Canada. Boom and Bust It was only a matter of time. Reddit shares are cratering right now, plunging almost 25 percent in just two days, as CNBC reports. The social media company went public last week at an IPO price of $34 and initially rallied to around $65. This week, however, shares started slipping, following Hedgeye […] Telus (TSX:T) and BCE (TSX:BCE) stocks are free-falling, and a bottom may still be far off. The post Better Buy in April 2024: BCE or Telus Stock? appeared first on The Motley Fool Canada. The price of gold hit a record high this week. While support for the rally may be fading, the yellow metal could still gain. "
}