{
    "title": "Hear That? 3 Stocks Wall Street Is Hinting Will Break Out Soon.",
    "date": "3/13/2024",
    "url": "https://investorplace.com/2024/03/hear-that-3-stocks-wall-street-is-hinting-will-break-out-soon/",
    "text": " Wall Street likes these 3 breakout stocks Advertisement Source: eamesBot / Shutterstock It’s almost never a bad idea to consider Wall Street’s opinion of a given stock before investing. After all, that’s what the firms pay their analysts to do: Form logical opinions based on data and insider knowledge. The potential breakout stocks discussed below are three among many That Wall Street is hinting will see a rise. Investors won’t be surprised at all that certain themes including artificial intelligence are well represented in the discussion. it seems it will continue to dominate investing themes and Wall Street analysis throughout 2024. Yet, the discussion will also include sectors that aren’t currently performing well. This list is certainly not a definitive analysis of the absolute best stocks possessing breakout potential. It does however identify and discuss stocks that have the potent combination of strong buy ratings and high price upside. Advanced Micro Devices (NASDAQ:AMD) stock absolutely benefits from the aforementioned combination of strong buy ratings and high price upside. 30 analysts currently cover AMD. Among them, 13 rate the stock as a “Strong Buy,” 14 as a “Buy,” and 3 as a “Hold.” While AMD is clearly worth considering on the basis of its ratings the pricing upside conversation is somewhat more muddled. That’s because AMD’s Current $211 share price is higher than its consensus price of $185. It’s clear that Wall Street continues to wonder whether AMD has become overpriced and is in need of something of a correction. It’s true, AMD has more than doubled since the end of October. That suggests that it may be time to take a breather. Yet at the same time, there are voices on Wall Street that expect AMD shares could rise as high as $270. Other Wall Street voices believe that AMD can quadruple from its current price point. That’s unlikely to happen over the months but is expected to materialize nonetheless. It’s all predicated upon AI data center spending projections from AMD CEO Lisa Su. Investors who take a look at price predictions for Schlumberger (NYSE:SLB) stock will note that it is currently very cheap. $50 share prices are $12 below the low analyst price and $20 below the consensus price. Some analysts even believe that shares could rise as high as $81. Those shares also include a dividend paying $1.10 inching potential returns slightly higher. So what then is the issue for the firm which supplies products and services throughout the energy industry? It’s very simple. No one really knows what is going to happen with energy prices this year. There is simply too much geopolitical instability at the moment. The various investment houses dotted along Wall Street have differing opinions on what factors will influence oil prices in 2024. However, they all basically operate under the same assumption, which is that prices should remain relatively flat. Schlumberger won’t do particularly well in such a scenario. firms that employ its services do so under the expectation that oil prices will rise. Otherwise they’re unlikely to be exploring new sources of oil. The Catalyst for Schlumberger is a volatility inherent in the current geopolitical balance. It could quickly change and that has the potential to send prices rapidly higher which is why Wall Street continues to pay attention to SLB. Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) isn’t currently the clear consensus buy that it normally enjoys. The company has made multiple missteps in relation to AI with recent missteps costing its shareholders again. Oh well. For one, too much emphasis is currently being placed on the importance of artificial intelligence. Very few firms have yet found ways to monetize the technology that have a material effect. Yes, Google has to find out how to do that especially in light of Microsoft’s (NASDAQ:MSFT) success in that regard. The Gemini AI debacle is a problem. However, it’s clouding the greater good around GOOG which is cause for bullishness. Ad revenues continue to strengthen and Alphabet’s operating results are strong. The current narratives around a potential CEO shake up are not particularly important, its improved fundamentals are. What really matter is the monetization of AI, and GOOGL will get there eventually. When compared to other breakout stocks, investors should console themselves with the cheap price and strong forecast. On the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Alex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/hear-that-3-stocks-wall-street-is-hinting-will-break-out-soon/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}