{
    "title": "TSMC 3nm To Dominate Apple, Intel & AMD Products, Leading To Significant \nRevenue Increase",
    "date": "3/26/2024",
    "url": "https://wccftech.com/tsmc-3nm-to-dominate-apple-intel-amd-products-leading-to-significant-revenue-increase/",
    "text": "TSMC's 3nm supply seems to be reserved by the three big tech firms, as Apple, Intel, and AMD manage to grasp a hefty portion of the production. With the launch period of generational upgrades coming near, tech firms are battling against each other, especially in the segment of the supply chain, since everyone wants the best in the industry.  The Taiwan Economic Daily reports that TSMC's 3nm process has received massive interest from the markets in recent times, with the likes of Apple & Intel in the race to acquire a healthy portion of the supply. It is revealed that with this huge demand, the Taiwan giant could witness a tremendous rise in revenue, potentially amounting to 20% of total revenue from its 3nm sales, which puts the process right behind 5nm, TSMC's most popular product. When it comes to the products expected to be fueled up by TSMC's 3nm, Apple plans on releasing their A18 Pro SoC next year, which will feature the process, and we did see that the upcoming chip by Apple will boast impressive performance figures. It is reported that the Cupertino giant will likely get 50% of the share in the 3nm supply, as not only has Apple been TSMC's largest customer, but both companies have a deep-rooted relationship, which is why the allocation seems justified in this case. Moreover, Apple also plans on utilizing the process with its M4 chip as well, likely to be used in the next-gen Macbook lineup. Intel is expected to employ TSMC's 3nm process in their upcoming Lunar Lake and Arrow Lake CPUs, which was later validated by CEO, Pat Gelsinger, himself. The iGPU tile is among the list of IPs that will utilize the 3nm node. Similarly, AMD also plans on utilizing Taiwan's giant process with its upcoming Zen 5 CPUs, showing that next-gen CPU markets will be dominated by TSMC's semiconductors. In terms of the release date, we could expect the products to drop by somewhere in 2025, when we will have a better view of what the 3nm goodness brings into the markets. News Source: Taiwan Economic Daily Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}