{
    "title": "Asus offers up to $110 for AMD Radeon GPUs with new cashback promo",
    "date": "3/2/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/asus-offers-up-to-dollar110-for-amd-radeon-gpus-with-new-cashback-promo",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Receive up to $110 in cashback for a Radeon RX 7900 XTX. A new promotion called the 'Asus AMD VGA Cashback Q1-2024' is introduced to certain EU countries, giving discounts of up to £110 ($108) with selected TUF Gaming and Dual Model RX 7000-series products, which are among the best graphics cards. Buyers in the United Kingdom, Germany, Austria, and France are the ones who will have this offer. Buyers can redeem these cards by purchasing them from selected retailers mentioned on their EU, French, and UK websites. The GPUs getting the highest cashback are the TUF-RX7900-024G-Gaming and the RX7900XT-020G-Gaming. This campaign started on February 26 but ended on March 31, giving plenty of time to choose and redeem the offer by submitting the invoice within the required date. German/ Austrian buyers must submit a code, which the dealer likely provides, and the invoice, which also gives a Gamesplanet voucher via email. In the UK, Asus gives 'Rate My Gear' reward points, which you redeem with your account. Customers in France are only getting the cashback offer on selected Radeon GPUs. April 14, 2024, is the last date to submit the invoices. The following GPUs are the ones that qualify for the cashback offer: Asus is selling its TUF Gaming AMD Radeon RX 7900 XTX 24G OC Edition graphics card for £994.97 via Amazon UK, which qualifies for £85 cashback. But when looking at other alternatives, XFX sells its 7900 XTX 24G for £903.80, while MSI and Powercolor sell it for around £939. Despite offers making these GPUs look tempting initially, other AIC partners provide better pricing with respective SKUs without needing to redeem them. Naturally, one will compare prices, especially when offers are given, so perhaps applying these discounts by default without having the user redeem an option would be better. However, prices vary depending on the region and the GPU you choose, so comparing the pricing between AIC partners before purchasing is best. The Radeon RX 7800 XT is a good choice if you want to buy a graphics card over $500. It has 16GB of VRAM although Nvidia has only 12GB offerings in this price range, the performance roughly matches this GPU. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 Seven-year-old AMD gaming GPU continues to stick around — low-profile RX 550 arrives for SFF PCs By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}