{
    "title": "Institutional investors in Advanced Micro Devices, Inc. (NASDAQ:AMD) lost \n3.7% last week but have reaped the ...",
    "date": "3/18/2024",
    "url": "https://simplywall.st/stocks/us/semiconductors/nasdaq-amd/advanced-micro-devices/news/institutional-investors-in-advanced-micro-devices-inc-nasdaq",
    "text": "Stock Analysis A look at the shareholders of Advanced Micro Devices, Inc. (NASDAQ:AMD) can tell us which group is most powerful.  With 72% stake, institutions possess the maximum shares in the company.  Put another way, the group faces the maximum upside potential (or downside risk). No shareholder likes losing money on their investments, especially institutional investors who saw their holdings drop 3.7% in value last week.  However, the 97% one-year return to shareholders may have helped lessen their pain.  They should, however, be mindful of further losses in the future. In the chart below, we zoom in on the different ownership groups of Advanced Micro Devices. Check out our latest analysis for Advanced Micro Devices Institutional investors commonly compare their own returns to the returns of a commonly followed index. So they generally do consider buying larger companies that are included in the relevant benchmark index. Advanced Micro Devices already has institutions on the share registry. Indeed, they own a respectable stake in the company.  This can indicate that the company has a certain degree of credibility in the investment community. However, it is best to be wary of relying on the supposed validation that comes with institutional investors. They too, get it wrong sometimes.  It is not uncommon to see a big share price drop if two large institutional investors try to sell out of a stock at the same time. So it is worth checking the past earnings trajectory of Advanced Micro Devices, (below). Of course, keep in mind that there are other factors to consider, too. Investors should note that institutions actually own more than half the company, so they can collectively wield significant power.    Advanced Micro Devices is not owned by hedge funds.      The Vanguard Group, Inc. is currently the largest shareholder, with 8.8% of shares outstanding.       Meanwhile, the second and third largest shareholders, hold 7.7% and 4.1%, of the shares outstanding, respectively. A deeper look at our ownership data shows that the top 25 shareholders collectively hold less than half of the register, suggesting a large group of small holders where no single shareholder has a majority. While studying institutional ownership for a company can add value to your research, it is also a good practice to research analyst recommendations to get a deeper understand of a stock's expected performance.   Quite a few analysts cover the stock, so you could look into forecast growth quite easily. While the precise definition of an insider can be subjective, almost everyone considers board members to be insiders.  Company management run the business, but the CEO will answer to the board, even if he or she is a member of it. Most consider insider ownership a positive because it can indicate the board is well aligned with other shareholders. However, on some occasions too much power is concentrated within this group. Our information suggests that Advanced Micro Devices, Inc. insiders own under 1% of the company.   As it is a large company, we'd only expect insiders to own a small percentage of it. But it's worth noting that they own US$1.7b worth of shares.  It is good to see board members owning shares, but it might be worth checking if those insiders have been buying. The general public-- including retail investors -- own 27% stake in the company, and hence can't easily be ignored.   While this group can't necessarily call the shots, it can certainly have a real influence on how the company is run. While it is well worth considering the different groups that own a company, there are other factors that are even more important.    To that end, you should be aware of the   2 warning signs  we've spotted with Advanced Micro Devices . If you are like me, you may want to think about whether this company will grow or shrink. Luckily, you can check this free report showing analyst forecasts for its future. NB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures. Find out whether Advanced Micro Devices is potentially over or undervalued by checking out our comprehensive analysis, which includes fair value estimates, risks and warnings, dividends, insider transactions and financial health. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. Flawless balance sheet with reasonable growth potential. Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. "
}