{
    "title": null,
    "date": "3/1/2024",
    "url": "https://www.tomshardware.com/tech-industry/artificial-intelligence/baidu-admits-us-sanctions-on-nvidia-and-amd-gpus-mean-it-might-not-have-access-to-leading-edge-gpus-again",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Baidu expands its AI compute prowess with Huawei's HiSilicon Ascend 910B. Baidu recently told its investors that it would not be able to procure leading-edge GPUs for AI applications in the future due to U.S. export restrictions, reports The Register. However, the company believes its advanced software stack will ensure its competitive position despite using less sophisticated processors. \"In the long run, we may not have access to the most cutting-edge GPU,\" said Robin Li, chief executive of Baidu, at the company's earnings call this week (via SeekingAlpha). \"But with the most efficient homegrown software stack, […] the user experience will not be compromised.\" Baidu has not been significantly impacted by the U.S. export restrictions on high-performance AI GPUs and other processors, so it will not be impacted in the short term, according to chief executive Robin Li. The company says its existing reserves of Nvidia's GPUs and current procurement capabilities are sufficient to power its existing AI services, AI-native applications, and at least some future projects. This includes support for ERNIE, Baidu's answer to ChatGPT, which is touted as China's most powerful foundation model. Baidu has traditionally used Nvidia's high-performance GPUs for training and inferencing of its AI models. Several years ago, the company introduced its own Kunlun II chip, which could rival Nvidia's A100 in AI workloads. However, whether it currently powers a significant portion of the company's services is unclear. The company also reportedly adopted Huawei's Ascend 910-series processors late last year to reduce its reliance on Nvidia. Now that Baidu cannot procure Nvidia's A100 and H100 processors and will not have access to Nvidia's B100 GPUs when they are released this year, it will have to rely on processors developed and made in China, which are not as fast as those from Nvidia, of course. This is where the company pins a lot of hope on its software stack and innovation. \"There is ample room for innovation in the application layer, the model layer and the framework layer,\" said Li. \"Our end-to-end self developed four-layer AI architecture along with our strong R&D team will support us in using less advanced chips for efficient model training and inferencing. This provides Baidu with a unique competitive advantage over our domestic peers.\" Baidu claims to have China's most cost-efficient AI infrastructure for model training and inferencing. This efficiency, coupled with the company's innovative AI architecture, positions Baidu favorably against its domestic competitors. All Chinese tech companies face similar challenges with access to Nvidia's highest-end products. In contrast, international cloud services like AWS, Azure, and Google Cloud can buy tons of Nvidia processors (literally). To that end, how the shortage impacts Baidu and its domestic peers against global competitors remains to be seen. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Anton Shilov is a Freelance News Writer at Tom’s Hardware US. Over the past couple of decades, he has covered everything from CPUs and GPUs to supercomputers and from modern process technologies and latest fab tools to high-tech industry trends. Arm China bolsters its AI accelerator with open source driver to compete against AMD, Intel, and Apple AMD lists mystery MI388X AI GPU in official docs, says it's barred from China sales due to US sanctions Chinese manufacturer Tryx reveals unique AIO cooler with curved AMOLED display By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Ash HillMarch 28, 2024 By Anton ShilovMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}