{
    "title": "Italian Energy Company Eni Acquiring 600 PFLOPS AMD-Powered HPE-Cray EX HPC \nSystem - High-Performance ...",
    "date": "1/23/2024",
    "url": "https://insidehpc.com/2024/01/italian-energy-company-eni-acquiring-600-pflops-amd-powered-hpe-cray-ex-hpc-system/",
    "text": "Italian energy giant Eni, long  in the vanguard of commercial adoption of supercomputing, announced it is acquiring a monstrous 600 Pflops HPE-Cray EX4000 HPC system comprised of 3472 nodes, each one with a 64-core AMD EPYC CPU and four AMD Instinct MI250X GPUs, for a total of 13,888 accelerators. At 600 Pflops, the system would be placed third on the current TOP500 list of the world’s most powerful supercomputers. Storage for the system, called HPC6, will use HPE Cray ClusterStor E1000 technologies along with the HPE Slingshot Interconnect, an open Ethernet-based fabric, with Dragonfly topology. HPC6’s performance will mark a substantial increase over Eni’s current HPC capacity, HPC4 and HPC5, which have a combined computing power of 70 Pflops. The new system will be housed in Eni’s Green Data Center in Ferrera Erbognone, which the company said is one of the most energy-efficient and carbon footprint-friendly computing centres in Europe. Other system features: HPC6’s ndarly 14,000 GPUs will be organised into 28 racks. The system uses a direct liquid cooling technology that Eni said will dissipate 96 percent of generated heat. The system has a maximum power consumption of 10.17 MVA. “Through this initiative we continue to demonstrate our technological leadership, reaffirming Eni’s role in supercomputing and relaunching our ambitions through dedicated infrastructure,” said Claudio Descalzi, CEO of Eni, which had revenues of $108 billion for the 12 months ended last September 30. “This project underlines our ongoing commitment to innovation and digitalisation, while also supporting our energy transition process. The new HPC system significantly enhances our computational capabilities and marks a pivotal shift in the way we address challenges related to energy security, competitiveness and sustainability.” [SPONSORED GUEST ARTICLE BY HPE AND NVIDIA] With the transformation of medicine from analog to digital, plus the rise of new data-generating devices for health tracking and genomic information, we can look forward to a new world in which virtually every aspect of a patient’s…. The high-performance computing (HPC) market is witnessing a notable shift towards the cloud, partially driven by the benefits of enhanced energy efficiency. According to Hyperion Research nearly every organization running HPC workloads is either already using or investigating the cloud to accelerate application performance, with the cloud market for HPC workloads forecast to reach $11.5 […] "
}