{
    "title": "How does AMD AI engines transform car tech at CES 2024?",
    "date": "1/12/2024",
    "url": "https://techwireasia.com/01/2024/proofed-amd-revolutionizes-auto-tech-unveiling-next-gen-ai-engines-at-ces-2024/",
    "text": "AMD has expanded its portfolio with two new devices: the Versal AI Edge XA Adaptive SoC and the Ryzen Embedded V2000A family of processors.Source: AMD’s video. By Dashveenjit Kaur | 12 January, 2024 AMD has unveiled its latest processors to redefine the driving experience in a groundbreaking stride toward the future of automotive technology. AT CES 2024, the US chip giant took the stage to introduce the Versal AI Edge XA adaptive system-on-chip (SoC) and the Ryzen Embedded V2000A Series processor, expanding its prowess in the realm of automotive applications. The devices, showcased at the annual trade show, are designed to serve critical automotive segments, including infotainment, advanced driver safety, and autonomous driving. The Versal AI Edge XA adaptive SoCs add an advanced AI engine, enhancing their adaptability for a wide range of next-generation advanced automotive systems and applications. These applications encompass forward cameras, in-cabin monitoring, LiDAR, 4D radar, surround-view, automated parking, and autonomous driving. Notably, Versal AI Edge XA adaptive SoCs represent AMD’s inaugural 7nm device to achieve automotive qualification, introducing robust intellectual property and heightened security features to automotive applications where safety is paramount. Then there are the Ryzen Embedded V2000A Series processors fueling the evolution of the next-generation automotive digital cockpit. According to AMD, the processors drive performance across various elements, from the infotainment console to the digital cluster and passenger displays. The extended presence of the AMD Ryzen Embedded V2000A Series marks the introduction of the initial x86 auto-qualified processor family. This advancement ensures that consumers can now experience the familiar PC-like interface they enjoy at home seamlessly integrated into their in-vehicle entertainment, providing an on-the-go entertainment experience. CAN AMD DISRUPT NVIDIA’S AI REIGN WITH ITS LATEST MI300 CHIPS?Dashveenjit Kaur | 8 December, 2023 Dashveenjit Kaur | 8 December, 2023 “Our expanding automotive portfolio presents a significant opportunity to serve this high-growth market while also underscoring the synergy of our combined automotive teams since the acquisition of Xilinx almost two years ago,” said Salil Raje, senior VP and GM, adaptive and embedded computing group, AMD. AMD keynote at #CES2024 in 7 minutes pic.twitter.com/LLvu36foMq — Engadget (@engadget) January 8, 2024  Imagine Versal AI Edge XA adaptive SoCs as super-smart brains with particular engines for doing new things with AI. These ‘brains’ will handle AI tasks related to computer processing, vision, and signals. They’re good at understanding a lot of information quickly and can also work in different devices like car sensors, such as LiDARs, radars, and cameras. A research director at ABI Research, James Hodgson, says, “In the future, automakers will use autonomous vehicle applications to shape their brand identities. With these applications relying heavily on AI, automakers need compute platforms that deliver powerful and efficient AI computing.” That said, the Versal AI Edge XA can make sense of data and make decisions either in a central control unit or in the devices themselves. The cool part is that these ‘brains,’ equipped with AI engines, can tackle various AI tasks, like recognizing objects and tracking features. Depending on the complexity of the task, the Versal AI Edge XA comes in different sizes, ranging from smaller ones with 20k LUTs to bigger ones with 521k LUTs. CES 2024: INTEL AND QUALCOMM TO TAKE ON NVIDIA IN AUTOMOTIVE INDUSTRYAaron Raj | 11 January, 2024 Aaron Raj | 11 January, 2024 They also vary in speed, from 5 TOPs to super-fast 171 TOPs. And here’s the magic trick – designers can use the same tools and methods to make smart gadgets using these brains. These “brains” aren’t just smart, they’re also safe and secure. They are designed to ensure everything runs smoothly and securely, especially in advanced automotive designs. The first batch of Versal AI Edge XA is set to hit the market in early 2024, with more versions planned to come out later in the year. Hodgson also believes that the number of highly automated vehicles shipping each year is set to grow at a CAGR of 41% between 2024 and 2030, signaling a healthy growth opportunity for suppliers of heterogeneous SoCs with powerful and efficient AI compute, including the AMD Versal AI Edge XA.” New Versal AI Edge XA adaptive SoCs and Ryzen Embedded V2000A Series processors underscore AMD leadership for powering next-generation automotive systems. Source: AMD. Picture your car as a futuristic entertainment hub on wheels, thanks to the AMD Ryzen Embedded V2000A Series processor. You know how gadgets keep getting cooler and more connected. That’s happening inside the vehicles these days, too. AMD came up with a super-advanced processor that delivers entertainment, connectivity, and safety all in one. This AMD Ryzen Embedded V2000A, built using the 7nm process and featuring ‘Zen 2’ cores and AMD Radeon Vega 7 graphics “delivers high-definition graphics, with enhanced security features and automotive software enablement through hypervisors in addition to support for automotive grade Linux and Android automotive,” AMD noted. The Embedded V2000A Series processor acts as the brain of a digital cockpit, promising the best visuals and connected experiences while cruising. Companies like Ecarx are already using it to power their advanced car solutions, and it’s expected to be the key to next-gen digital cockpit solutions in 2024 and beyond.  By Dashveenjit Kaur @DashveenjitK Dashveenjit Kaur\n|  @DashveenjitK Dashveen writes for Tech Wire Asia and TechHQ, providing research-based commentary on the exciting world of technology in business. Previously, she reported on the ground of Malaysia's fast-paced political arena and stock market. © 2024 Tech Wire Asia | All Rights Reserved Terms of use Privacy Policy "
}