{
    "title": "AMD Ryzen 7 8700G and Ryzen 5 8600G Review: Zen 4 APUs with RDNA3 Graphics",
    "date": "1/29/2024",
    "url": "https://www.anandtech.com/show/21242/amd-ryzen-7-8700g-and-ryzen-5-8600g-review/5",
    "text": "Another of the interesting elements of modern processors is encoding performance. This covers two main areas: encryption/decryption for secure data transfer and video transcoding from one video format to another. In the encrypt/decrypt scenario, how data is transferred and by what mechanism is pertinent to on-the-fly encryption of sensitive data - a process by which more modern devices are leaning towards improving software security. We've updated our list of encoding benchmarks for our 2024 CPU suite to include some of the most relevant and recent codecs, such as AV1, HEVC, and VP9. Not only this, but we have also included FLAC audio encoding as well as WebP2 image encoding into the mix to show not only how the latest processors perform with these codecs but also to show discrepancies in performance throughout the different segments. We are using DDR5-5200 memory as per the JEDEC specifications on the Ryzen 7 8700G and Ryzen 5 8600G, as well as DDR4-3200 on the Ryzen 7 5700G and Ryzen 5 5600G. The same methodology is also used for the AMD Ryzen 7000 series and Intel's 14th, 13th, and 12th Gen processors. Below are the settings we have used for each platform:  When it comes to encoding performance, as expected, the performance of both the Ryzen 7 8700G and the Ryzen 5 8600G doesn't quite reach the levels of the typical desktop chips. Performance in this area is where we expected it to be, again with the Ryzen 7 8700G beating out the previous Ryzen 7 5700G APU, and the same with the Ryzen 5 8600G and the Ryzen 5 5600G. With the latest firmware, which removes the STAPM power limitations, we can see that it doesn't really affect the Ryzen 7 8700G in our encoding tests. We do, however see some bumps in performance without STAPM limitations on the Ryzen 5 8600G, although in the vast majority of use cases, the performance is very marginal. "
}