{
    "title": "AMD FSR 3 with Frame Generation added to Call of Duty Modern Warfare 3 and \nWarzone",
    "date": "1/17/2024",
    "url": "https://www.tweaktown.com/news/95676/amd-fsr-3-with-frame-generation-added-to-call-of-duty-modern-warfare-and-warzone/index.html",
    "text": "Call of Duty: Modern Warfare III and the free-to-play Warzone just got an update, adding support for AMD FidelityFX Super Resolution 3 or FSR 3 that adds upscaling and frame generation to a broader range of gamers. Call of Duty: Modern Warfare III launched with NVIDIA DLSS 3 Frame Generation support and DLSS 2, FSR 2.1, and Intel XeSS upscaling. However, like with all DLSS 3-enabled titles, the Frame Generation side of the equation is limited to the GeForce RTX 40 Series of cards - due to NVIDIA's approach using new specialized AI hardware in its latest line-up. AMD's approach is different, an open-source platform agnostic version of both upscaling and frame generation - meaning that it's available for all players no matter if they're rocking a new 40 Series, a GeForce RTX 30 Series, or a Radeon RX 6000 or RX 7000 Series GPU. AMD recommends using at least a Radeon RX 5000 or GeForce RTX 20 Series GPU for Frame Generation, as it requires a certain base level of performance to work as intended. FSR 3's addition to Call of Duty means there are now six titles with the tech, including Avatar: Frontiers of Pandora, Forspoken, Immortals of Aveum, Like a Dragon Gaidan: The Man Who Erased His Name, and MotorCubs RC. FSR 3 differs from the upcoming driver-based AMD Fluid Motion Frames (AFMF) release on January 24. Like DLSS and earlier FSR versions, game developers must implement FSR 3 with Frame Generation into a title. Unfortunately, you can't mix and match upscaling technologies without mods. FSR 3 requires using FSR upscaling (or running the game with the Native profile), so image quality suffers compared to DLSS - not to mention the generated frames not being quite up to NVIDIA's AI-generated level. The trade-off, of course, is that FSR 3 works with basically every GPU, so much so that the news of FSR 3 being added to Call of Duty was first spotted on Reddit (via Videocardz) by a player rocking a GeForce RTX 3060 laptop GPU. Either way, it now means the countless gamers with GeForce RTX 30 Series cards can enable Frame Generation in Call of Duty. Kosta Andreadis Kosta is a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}