{
    "title": "AMD reshapes automotive industry with advanced AI engines and elevated \nin-vehicle experiences at CES 2024",
    "date": "1/9/2024",
    "url": "https://www.zawya.com/en/press-release/companies-news/amd-reshapes-automotive-industry-with-advanced-ai-engines-and-elevated-in-vehicle-experiences-at-ces-2024-url13a6t",
    "text": "New Versal AI Edge XA adaptive SoCs and Ryzen Embedded V2000A Series processors underscore AMD leadership for powering next-generation automotive systems SANTA CLARA, Calif.:— Recently, AMD (NASDAQ: AMD) announced it will showcase automotive innovation at CES 2024 and expand its portfolio with the introduction of two new devices, the Versal™ AI Edge XA adaptive SoC and Ryzen™ Embedded V2000A Series processor. The devices underscore AMD automotive technology leadership and are designed to serve key automotive focus segments including infotainment, advanced driver safety and autonomous driving. Working alongside a growing automotive partner ecosystem, AMD will demonstrate at CES 2024 the broad range of capabilities and applications for these new devices in automotive solutions available today and in the future. Versal AI Edge XA adaptive SoCs add an advanced AI Engine, enabling the devices to be further optimized for numerous next-generation advanced automotive systems and applications including: forward cameras, in-cabin monitoring, LiDAR, 4D radar, surround-view, automated parking and autonomous driving. Versal AI Edge XA adaptive SoCs are also the first AMD 7nm device to be auto-qualified, bringing hardened IP and added security to automotive applications where safety is paramount. Ryzen Embedded V2000A Series processors power the next-generation automotive digital cockpit, from the infotainment console to the digital cluster and passenger displays. The expansion of the AMD Ryzen Embedded V2000A Series brings the first x86 auto-qualified processor family to offer the same PC-like experience consumers have come to expect from home entertainment which they can now enjoy in-vehicle, on the go. “Our expanding and highly diversified AMD automotive portfolio presents a significant opportunity to serve this high-growth market while also underscoring the tremendous synergy of our combined automotive teams since the acquisition of Xilinx almost two years ago,” said Salil Raje, senior vice president and general manager, Adaptive and Embedded Computing Group, AMD. “As we look ahead to 2024’s Consumer Electronics Show, we are excited to showcase our achievements working in collaboration with our ecosystem partners that will advance the future of the automotive industry.” Elevating AI Engines with Versal AI Edge XA Versal AI Edge XA adaptive SoCs, equipped with AI Engines offer many benefits for AI compute, vision and signal processing. Versal AI Edge XA adaptive SoCs can perform AI inference on large ingests of data, and can also be used in edge sensors, such as LiDARs, radars and cameras, or in a centralized domain controller. The AI Engines are capable of handling different types of AI models such as classification and feature tracking. This device portfolio ranges from 20k LUTs to 521k LUTs, and from 5 TOPs to 171 TOPs. Scalable across this product portfolio, designers can easily port their designs with the same tools, ecosystem and safety certifications. Versal AI Edge XA adaptive SoCs can accelerate high-performing AI compute applications, while providing safety and security features and advance automotive designs. The first devices will be released early 2024, with further releases planned later in the year. “In the future, automakers will leverage autonomous vehicle applications to shape their brand identities. With these applications relying heavily on artificial intelligence, automakers need compute platforms that deliver powerful and efficient AI compute,” said James Hodgson, research director at ABI Research. “The number of highly automated vehicles* shipping each year is set to grow at a CAGR of 41% between 2024 and 2030, signaling a healthy growth opportunity for suppliers of heterogenous SoCs with powerful and efficient AI compute, including the AMD Versal AI Edge XA.” Enhancing Consumers’ In-vehicle Experiences with AMD Ryzen Embedded V2000A Advances in consumer electronics have raised expectations for in-vehicle experiences (IVX). Entertainment, connectivity, workplace on wheels and safety are becoming important factors that influence consumer decisions, which is what led AMD to launch the new AMD Ryzen Embedded V2000A Series processor. This auto-grade device enables carmakers to deliver impressive performance and multitasking for infotainment and IVX systems so passengers can stay connected on the go. Built on innovative 7nm process technology, ‘Zen 2’ cores and high-performance AMD Radeon Vega 7 graphics, the AMD Ryzen Embedded V2000A Series processor provides a new class of performance. It delivers high-definition graphics, with enhanced security features and automotive software enablement through hypervisors in addition to support for Automotive Grade Linux and Android Automotive. “Since introducing the ECARX Makalu digital cockpit using AMD Ryzen Embedded processors, they have proven to be key for powering the ECARX automotive solutions that require advanced compute power with visual graphic rendering capabilities,” said Peter Cirino, Chief Operating Officer, ECARX. “With the Ryzen Embedded V2000A Series processor, ECARX looks forward to expanding the capabilities of our next-generation digital cockpit solutions for software-defined vehicles in 2024 and beyond.” AMD Advancing Automotive at CES AMD will be showcasing its broad range of automotive solutions in conjunction with ecosystem partners. Demonstrations include: In-Vehicle Experience, AI Optimized Real-time Multi-sensor Object Detection, Automated Parking, Display Expansion, LiDAR, 3D Surround View, Driver Monitoring, and more. Participating automotive ecosystem partners include: BlackBerry, Cognata, ECARX, Hesai, Luxoft, QNX, QT, Robosense, SEYOND, Tanway, Visteon and XYLON. Visit the AMD booth at LVCC West Hall #W319 at CES 2024 to learn more about AMD automotive solutions and speak with AMD experts. -Ends- AMD in Automotive As the pace of innovation continues to accelerate in the automotive industry, the need for high-performance compute, compute acceleration and graphics technologies is increasing. AMD is a leader at this inflection point, with a broad line of high-performance CPUs, GPUs, FPGAs and Adaptive SoCs. From powering in-vehicle infotainment systems to advanced driver-assistance systems, autonomous driving and networking applications where functional safety is of paramount importance, AMD provides carmakers with a one-stop shop for silicon and software solutions. For more information, visit AMD's Automotive website. About AMD For more than 50 years AMD has driven innovation in high-performance computing, graphics and visualization technologies. Billions of people, leading Fortune 500 businesses and cutting-edge scientific research institutions around the world rely on AMD technology daily to improve how they live, work and play. AMD employees are focused on building leadership high-performance and adaptive products that push the boundaries of what is possible. For more information about how AMD is enabling today and inspiring tomorrow, visit the AMD (NASDAQ: AMD) website, blog, LinkedIn and Twitter pages. *Vehicles with Level 2+ functionality or higher AMD, the AMD Arrow logo, Ryzen, Versal,  and combinations thereof are trademarks of Advanced Micro Devices, Inc. Other names are for informational purposes only and may be trademarks of their respective owners. © Press Release 2024 Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release. The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk. To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages. "
}