{
    "title": "AYANEO’s AM02 Retro Mini Launches On January 18th, Packs AMD Ryzen 7 7840HS \nAPU",
    "date": "1/15/2024",
    "url": "https://wccftech.com/ayaneo-am02-retro-mini-launches-january-18th-packs-amd-ryzen-7-7840hs-apu/",
    "text": "AYANEO has revealed more information about its AM02 Retro-styled Mini PC which is launching this week and packs an AMD Ryzen 7 7840HS APU. The AYANEO AM02 Retro Mini is under the company's \"REMAKE\" lineup of products, which is the industry's first portfolio of retro-styled gaming devices, with the integration of modern technology coupled with classical designs, that provide consumers with a nostalgic vibe. AYANEO Retro Mini PC #AM02 New Release - 07:00AM EST 1/18/2024,Welcome to visit AYANEO official Youtube:AYANEO 🎮IGG Campaign - 07:30AM EST 1/18/2024,Subscribe to get an early bird price🤟 IGG Pre-launch: https://t.co/jadNv8AwmT pic.twitter.com/yMMBbrd00o — AYANEO (@AYANEO__) January 15, 2024  AYANEO unveiled its lineup back in November 2023, by revealing the design of the SKUs, however, the specifics such as onboard components weren't disclosed back then. However, with the listing of AM02 Retro Mini, we might have an idea of how AYANEO will position the complete lineup, based on AMD's iconic Phoenix APUs. Starting with the specifications, the AM02 Retro Mini features AMD's Ryzen 7 7840HS, a popular choice amongst handheld manufacturers mainly due to the performance per watt it brings onboard. The APU features 8 cores and 16 threads based on the Zen 4 core architecture, 8 MB of L2 and 16 MB of L3 cache, & clocks of up to 5.1 GHz. It comes with a TDP configurable between 35-54W and houses the Radeon 780M \"RDNA 3\" iGPU, which packs 12 compute units running at 2700 MHz. The AM02 packs great performance on paper, and judging by the device's form factor, it is certainly something innovative. Moving on to the device's design language, it features a design that replicates the memorable Nintendo NES, featuring a similar color scheme and structure as well. To top things up, AYANEO has included a dedicated 4-inch touchscreen as well which is aimed at bringing in \"multifunctionality\" and a futuristic touch to the device. While such a small screen certainly can't cater to gaming experiences, it is a great addition to displaying details such as date and time and even the device's temperature and similar specifics. Another unique factor about the AM02 Retro Mini is its front opening cover, which hides your I/O ports, which compliments the overall look. AYANEO hasn't specified what type of ports the device supports, but based on the shared images, it certainly features USB Type-C and Type-A and an HDMI connection as well. AYANEO hasn't revealed the pricing for AM02 Retro Mini however, just recently, the company has disclosed that the device will launch by January 18th, with those part of the crowdfunding campaign getting an \"early bird\" discount. News Source: Indiegogo Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}