{
    "title": "AMD Ryzen 7 7800X3D was the #1 Bestseller for the 10th Straight Month, \nIntel’s Core i9-14900K Takes Off",
    "date": "1/18/2024",
    "url": "https://www.hardwaretimes.com/amd-ryzen-7-7800x3d-bestseller-intel-14900k-comes-second/",
    "text": "AMD’s star 3D V-Cache CPU, the Ryzen 7 7800X3D, has continued to reign supreme for the tenth consecutive month. The octa-core gaming processor leads the bestselling charts across most retailers, including Amazon, Newegg, B&H, Microcenter, BestBuy, and Mindfactory. Thanks to its 3D stacked cache, the 7800X3D has vanquished much more expensive chips from AMD’s blue rival. The latest sales numbers from Mindfactory (via TechEpiphany) indicate that the situation won’t change anytime soon: The Ryzen 7 7800X3D was the #1 bestseller at Mindfactory (Germany), selling 1340 units through the second week of January. The Ryzen 7 5800X3D was the second most popular processor, selling close to 600 units. The Ryzen 7 7500F came in third with a weekly figure of 490 units. Intel’s top-selling SKU, the Core i9-14900K, sold only 80 units alongside the 14700K and the 7900X. At B&H, the Ryzen 7 7800X leads the bestsellers, followed by the Core i9-14900K, Ryzen 5 5600, and the Core i7-14700K at #2, #3, and #4, respectively. Intel’s 14th Gen Raptor Lake Refresh may have had a slow start, but it’s starting to pick up. At BestBuy, the Ryzen 7 7800X3D remains the top dog, followed by the Core i9-14900K and the Core i5-12600K at #2 and #3, respectively. Several older Intel chips also make it to the top ten. Newegg follows the same trend, with the Ryzen 7 7800X3D at the top spot and the Core i9-14900K occupying the second one. The Core i7-14700K is ranked third, followed by a couple of 12th-Gen CPUs and the Ryzen 7 7600X at #6. On Amazon, the Ryzen 5 5600X makes it to the #1 spot, with the Ryzen 7 7800X3D and the 5600G at #2 and #3, respectively. Behind them, we’ve got a pair of AM4 and older Core K-series chips. The Core i9-14900K stands at #8, ahead of the 9th ranked Ryzen 5 7600X. Microcenter caters to the more hardcore PC builders. Surprisingly, the Ryzen 7 5800X3D is the top-seller, followed by the 7800X3D and the Core i9-12900K at the second and third spots, respectively. The Core i7-12700K and the 13700K grab the fourth and fifth spots, leaving the 14900K at #5. "
}