{
    "title": "3 Artificial Intelligence (AI) Stocks Ripe to Be One of the Next \n\"Magnificent Seven\"",
    "date": "1/22/2024",
    "url": "https://www.fool.com/investing/2024/01/22/3-artificial-intelligence-ai-stocks-ripe-to-be-one/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More How important was the so-called \"Magnificent Seven\" in 2023? Well, according to S&P Senior Index Analyst Howard Silverblatt, it was very important. Consider this: The Magnificent Seven -- Apple, Nvidia, Amazon, Microsoft, Alphabet, Meta Platforms, and Tesla -- accounted for more than 60% of the S&P 500's total return of 26%. Indeed, if those seven stocks were excluded, the index would have only returned 7.6%, making 2023 a below-average year for the benchmark index. Yet, as important as the Magnificent Seven may be, investors shouldn't get tunnel vision; there are many other stocks worthy of their attention. Let's have a look at three such names. Image source: Getty Images. First up is CrowdStrike Holdings (CRWD -0.52%). CrowdStrike's stock is one of the top-performing Nasdaq-100 names so far this year, having registered a 12% gain as of this writing. The stock is also up almost 180% over the last 12 months. And why has the stock been on fire? In short, it's down to the old rules of supply and demand. CrowdStrike is one of the world's leading cybersecurity companies. Through the use of artificial intelligence (AI), the company provides its customers with cloud-based security modules that protect networks, data, and endpoints. The need for this protection is increasing. Organizations are desperate to secure their digital assets due to the rapid rise in cyberattacks, ransomware, and data breaches. In light of this situation, CrowdStrike's customer base is exploding, and its revenue is skyrocketing. As of its most recent quarter (the three months ended on Oct. 31, 2023), CrowdStrike reported revenue of $786 million, up 35% from a year earlier. Moreover, $733 million of that revenue -- some 93% -- was subscription-based.  CRWD data by YCharts Those improving fundamentals are driving CrowdStrike's stock back toward its all-time high. Growth-oriented investors should take note that CrowdStrike remains primed to cash in on the rapid growth of the cybersecurity market. Next is Arista Networks (ANET 0.54%). The company, which provides networking solution tools, is an under-the-radar AI play, given the importance of networking resources to the advancement of AI. As the company notes in a recently published white paper available on its website, \"As AI continues to advance at unprecedented pace, networks need to adapt to the colossal growth in traffic transiting hundreds and thousands of processors with trillions of transactions and gigabits of throughput.\" To put it another way, as data centers and supercomputers grow larger and more complex to handle more advanced AI, the networks connecting the underlying processors will also need to improve. Fast AI requires fast networks, and Arista is one of the leaders in optimizing networks. Turning to finances, Arista Networks' key metrics are soaring. In one year, the company's free cash flow per share has increased from $1.42 to $4.77 -- an increase of 336%. That's hugely important, as free cash flow per share is one of the most important financial metrics for a stock. In summary, Arista Networks is well positioned to benefit from the skyrocketing demand for AI products and systems. Moreover, its strong, improving fundamentals make it an attractive choice for growth investors willing to buy and hold. Finally, we come to a personal favorite: Advanced Micro Devices (AMD 0.50%). In my view, there are three reasons why AMD is such an attractive stock. First, there is the secular growth story. The growth of the Graphics Processing Unit (GPU) market is, by far, the biggest reason to be bullish on AMD. These high-powered semiconductors are the chips of choice for AI developers, thanks to their ability to quickly process data. Now, thanks to the introduction of its MI300 series of chips, AMD is directly competing with Nvidia in this red-hot market. Indeed, in a recent conference, AMD's Chief Executive Officer (CEO) Lisa Su estimated that the Total Addressable Market (TAM) for AI-related chips will reach $400 billion over the next four years. That leads to my second reason to be bullish on AMD: the company's fantastic leadership. Starting with CEO Lisa Su, AMD's management team has delivered incredible returns for AMD. In point of fact, AMD shares have gained an eye-popping 4,370% during Su's time as CEO -- meaning a $10,000 investment made on her start date of Oct. 8, 2014, would be worth a staggering $484,000 as of this writing.  AMD Total Return Level data by YCharts What's more, AMD's key fundamentals can't be ignored. Over the last 12 months, the company has generated $22.1 billion in revenue, nearly double the $11.4 billion it reported three years ago. Granted, valuation will be a concern for some investors. The company's forward price-to-earnings (P/E) ratio stands at 42 times, putting it out of reach for value investors or those otherwise uncomfortable with high-valuation stocks. Nevertheless, long-term growth investors should give AMD a hard look. The AI revolution is here to stay, and AMD, with its excellent leadership and new AI-focused chips, is a stock with a bright future ahead of it. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Jake Lerch has positions in Alphabet, Amazon, CrowdStrike, Nvidia, and Tesla. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Arista Networks, CrowdStrike, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}