{
    "title": null,
    "date": "1/25/2024",
    "url": "https://www.videogamer.com/tech/gpu/amd-equivalent-of-the-rtx-4070-ti-super/",
    "text": "Posted in Tech Video Gamer is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more Now that Nvidia’s latest Super has launched, it’s a good time to think about what AMD GPU is equivalent to the RTX 4070 Ti Super. In fact, it’s a good thing that you’ve sought the answer to this question, because we think the alternative is actually a better option. The RTX 4070 Ti Super has had an interesting past. After the RTX 4080 12GB variant was ‘unlaunched,’ the GPU was shelved and later repurposed as the suffix-tacked RTX 4070 Ti model. Now it’s been restored to what it should have been in the first place with an AD103 die and a bump to 16GB GDDR6X memory. We’ve just reviewed the RTX 4070 Ti Super, and now we’re going to be finding its AMD equivalent for any die-hard fans of Team Red’s Radeon graphics cards. VRAM 16GB GDDR6X CUDA cores 8,448 Memory bus width 256-bit GPU processor AD103 Bandwidth 21 Gbps When it comes to finding a graphics card equivalent, you’re going to want to define a few things: price, performance, and features. The RTX 4070 Ti Super costs $799 at its base MSRP, so you’re going to want to find a graphics card that falls somewhere within this price-range. In terms of performance and features, the RTX 4070 Ti Super is stocked up with 16GB of GDDR6X VRAM, alongside 8,488 CUDA cores. To me, there’s only one real competitor to the RTX 4070 Ti in a similar price range, and that’s the RX 7900 XT. The RX 7900 XT MSRP is priced at $899, though having released in 2022, it’s price has seen fairly consistent discounts to make it more affordable. It’s been available for as low as $709, perhaps in an attempt to undercut the launch of the 4070 Ti Super. When you receive 20GB GDDR6 VRAM, alongside a 5 nm process size chip powered by over 5000 shader cores, all for an extremely affordable price, it’s obvious why we’ve chosen to suggest this as the best equivalent alternative to the RTX 4070 Ti Super. Despite being slower memory, you get 4GB extra here which should offset some performance based differences. After comparing the RTX 4070 Ti Super with its peers, including the RTX 3090 and RTX 4080, most of ours findings concluded that the RTX 4070 Ti was slightly underwhelming for what it offered. The same goes here, really, as the RX 7900 XT offers a little bit more than the RTX 4070 Ti Super does, all for a better price too. Base Clock 2220 MHz Boost Clock 2,400 MHZ VRAM 20GB GDDR6 Dimensions 276 x 135 x 51mm Recommended PSU 750W If you end up choosing RDNA 3 over Ada, you’re essentially trading off Nvidia’s DLSS for AMD’s FSR. I’m not going to sugar-coat the comparison of frame generation between the two graphics companies – DLSS is just simply better. In terms of fidelity, performance, and stability, it makes gains over its opposition in all aspects. Put it into perspective, though. There’s only 290 games that actually support DLSS, alongside 195 games that support FSR. Not every game out there natively has frame generation baked in as a feature, so the DLSS over FSR argument loses a little bit of strength here. Even more so when you consider that AMD’s Fluid Motion Frames tech applies a blanket performance boost across all DX11 and DX12 games without the need for developer input. AMD’s value pricing structures works well with their driver frame generation solutions. It offers an alternative, albeit lower-fidelity, option for AI upscaling frame rates without demanding a drastic toll on the hardware. Is an RX 7900 XT better than the RTX 4070 Ti Super? The RX 7900 XT has better specs and a better price than the RTX 4070 Ti Super, so we deem it a better card. Amaar loves retro hardware and boring games with more words than action. So, he writes about them daily. "
}