{
    "title": "Industrial ATX motherboard gets AMD AM5 Ryzen embedded 7000",
    "date": "1/11/2024",
    "url": "https://www.electronicsweekly.com/news/products/bus-systems-sbcs/industrial-atx-motherboard-gets-amd-am5-ryzen-embedded-7000-2024-01/",
    "text": "By  Steve Bush \n11th January 2024 Advantech has used AMD Ryzen Embedded 7000 processors in a series of industrial ATX motherboards dubbed AIMB-723. Advantech has used AMD Ryzen Embedded 7000 processors in a series of industrial ATX motherboards dubbed AIMB-723. “This is the first industrial-grade motherboard integrated with the AMD B650 chipset, delivering high computing performance with a seven-year lifespan,” said Advantech. “It stands out as the first AIMB motherboard to embrace DDR5 UDIMM, as well as support up to a three-slot discrete GPU card and three additional frame grabber cards for machine vision.” The ram can be spread across four DIMM sockets up to 128Gbyte of DDR5 5200. IO includes triple displays (DP-HDMI-VGA), USB 3.2 (Gen 2) 10Gbit/s, dual 2.5Gbit Ethernet, M.2, SATA (RAID 0, 1, 10), PCI and up to six serial ports (5x RS-232, 1x RS-232/422/485). Windows 10 version 21H2 LTSC, Windows 11 version 22H2 GAC, Windows Server 2022 and Ubuntu 22.04 are supported with OS images and essential drivers. Applications are foreseen in AI-based machine vVision and automated optical inspection. Tagged with: Advantech industrial single board computers Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Get our news, blogs and comments straight to your inbox! Sign up for the Electronics Weekly newsletters: Mannerisms, Gadget Master and the Daily and Weekly roundups.  Find out more » Read our special supplement celebrating 60 years of Electronics Weekly and looking ahead to the future of the industry. Read the Electronics Weekly @ 60 supplement »\n\nRead the first ever Electronics Weekly online: 7th September 1960. We've scanned the very first edition so you can enjoy it.\nRead the very first edition »  Read the first ever Electronics Weekly online: 7th September 1960. We've scanned the very first edition so you can enjoy it. Read the very first edition » Keep up with developments relating to space technology - satellite technology, PNT, thermal imaging, SatIoT, spaceports and more View our busy aerospace section »  Image: ESA Read our special supplement celebrating 60 years of Electronics Weekly and looking ahead to the future of the industry. Read the Electronics Weekly @ 60 supplement »\n\nRead the first ever Electronics Weekly online: 7th September 1960. We've scanned the very first edition so you can enjoy it.\nRead the very first edition »  Read the first ever Electronics Weekly online: 7th September 1960. We've scanned the very first edition so you can enjoy it. Read the very first edition » Keep up with developments relating to the Internet of Things (IoT) - Industrial IoT, sensors, Edge AI, battery technology, SatIoT and more View our popular Internet of Things section »  Image: ESA "
}