{
    "title": "AMD Radeon RX 7600 XT GPU announced at CES 2024",
    "date": "1/8/2024",
    "url": "https://www.shacknews.com/article/138206/amd-radeon-rx-7600-xt-gpu-ces-2024",
    "text": "New to Shacknews? Signup for a Free Account Already have an account? Login Now The RX 7600 XT GPU comes with 16GB of memory built in and will hit shelves later in January 2024. With CES 2024 kicking off this week, AMD was one of the first to take the stage and talk about what innovations it has for the tech space, including a new graphics card. The AMD Radeon RX 7600 XT GPU was announced during the company’s keynote. It’s powered by 16GB of graphics memory, allowing players and content creators a fairly futureproof option while also making way for the build of AI PCs that require a certain minimum of memory on a variety of applications. It will be launching later this January 2024. AMD announced the Radeon RX 7600 XT GPU during the company’s CES 2024 keynote. Set to in late January, this GPU represents AMD’s next generation of graphics power. One of its main features is the 16GB memory size in GDDR6 format. That’s additionally powered by a cache of 32MB and a memory speed of 18GB/s. With the specs of the GPU, games like Cyberpunk 2077 should be able to reach up to 117 FPS at 1440p on max graphics settings. With tech underneath the hood of the Radeon RX 7600 XT GPU, it should also be futureproof in handling most of AMD’s latest technology, including AMD FidelityFX Super Resolution, AMD Enhanced Sync Technology, and AMD Radeon Boost, to name a few. The GPU will also support Windows 10, Windows 11, Linux, and Unbuntu 64-bit operating systems. With a launch slated for later in January, stay tuned for further details on the AMD Radeon RX 7600 XT GPU, such as official date and pricing. Be sure to check out our other CES 2024 coverage as well. TJ Denzer is a player and writer with a passion for games that has dominated a lifetime. He found his way to the Shacknews roster in late 2019 and has worked his way to Senior News Editor since. Between news coverage, he also aides notably in livestream projects like the indie game-focused Indie-licious, the Shacknews Stimulus Games, and the Shacknews Dump. You can reach him at tj.denzer@shacknews.com and also find him on Twitter  @JohnnyChugs. TJ Denzer posted a new article, AMD Radeon RX 7600 XT GPU announced at CES 2024 "
}