{
    "title": "AMD Driver Not Showing Up in Device Manager [Solved]",
    "date": "1/3/2024",
    "url": "https://www.drivereasy.com/knowledge/amd-graphics-card-not-showing-in-device-manager/",
    "text": "No file downloaded? To install Driver Easy We only recommend products we believe in. Products that work. But, just so you know, we may earn commission in doing so. Home › Knowledge Base › Technical Tips  Katie Yan Many users reported the issue that their AMD graphics cards are not showing up in Device Manager. It’s a common issue but it doesn’t necessarily mean your hardware is broken. If you encounter this error, here are some quick fixes you can try. You don’t have to try them all, just work your way down the list until you find the one that does the trick! 1: Show hidden devices in Device Manager 2: Update your graphics driver 3: Check for the latest Windows updates 4: Restore BIOS The first thing you can check is to see if your AMD graphics card is listed as a hidden device in Device Manager. If it’s just hidden, you can simply enable it in Device Manager. Here’s how: If this doesn’t work for you, try the next fix. A corrupted or outdated graphics driver may cause the graphic card to disappear in the Device Manager. You may need to update your graphics driver to solve this issue. Normally you can find the exact driver for your graphics card on the AMD website and install it via Device Manager. As your AMD graphics card doesn’t show up in Device Manager now, you’ll need to use either the AMD Radeon software or a third-party tool. Automatic driver update – If you don’t have the time, patience, or computer skills to update your driver manually, you can, instead, do it automatically with Driver Easy. Driver Easy will automatically recognize your system and find the correct driver for your exact graphics card and your Windows version, then it will download and install it correctly: You can restart your PC and check if your graphics card shows up in Device Manager now. If this doesn’t solve your problem, try the next fix. It’s important to keep your system up-to-date. According to many users’ reports, we’ve found that installing the latest Windows updates may solve this issue. Meanwhile, some users also mentioned that they encountered this error after they updated their OS, and rolling back the update solved the issue for them. In both cases, you’ll need to check for the latest Windows updates and decide if you need an update or a rollback. Below are the steps to install and uninstall Windows updates: If you still can’t see your AMD graphics card in Device Manager, there’s one more fix you can try. If the fixes above didn’t solve your problem, you may need to restore the BIOS settings on your PC. This will clear the BIOS settings to default but won’t erase any data on your PC. Here’s how:  Hopefully this article helps! Please feel free to leave us a comment if you have any questions or suggestions. Katie Yan As a technical writer at Driver Easy, Katie writes solutions for daily tech issues and pro tips on games. She has a strong enthusiasm for technology and feels inspired when her posts can help readers solve their problems. When she's not writing, she's usually exploring the latest tech news, playing games, enjoying hip-hop music, and reading. Contributor(s): English / Deutsch / Français / 日本語 Copyright © 2009-2024 Easeware Technology Limited. All rights reserved. "
}