{
    "title": null,
    "date": "2/11/2024",
    "url": "https://seekingalpha.com/article/4669414-amd-stock-ready-to-conquer-the-ai-boom",
    "text": "da-kuk  da-kuk We all know that AI will play an increasingly important role in society. The market for AI is expected to grow twentyfold by 2030 up to nearly two trillion USD. With this in mind, it's important to note that AMD (NASDAQ:AMD) provides universal hardware solutions for the deployment of AI. Meaning no matter what industry you are in, if you utilize AI chances are high that your hardware includes components made by AMD. Everything from supply chains, marketing, product making, research, and analysis are examples of fields that will in some aspect adopt artificial intelligence within their businesses. The fact is, that the future of AI is a key factor for AMD's continued growth. For the last few years, revenues have been growing exponentially for AMD, with revenues going from $6.7 billion for FY 2019 to $22.7 billion for FY 2023. We believe AMD will continue to deliver strong positive results, reinforced by its strong Q4 2023 and driven by the expansion of AI. For Q4 2023, AMD posted revenues of $6.20 billion, which is near its all-time high of June 2022, and beating wall street estimates of $6.13 billion. Furthermore, earnings per share landed at $0.77, which is significantly higher than that of the previous quarter. Moreover, due to economics of scale as the AI boom ramp up we expect AMD to grow EPS even further in the coming years moving above its peak EPS of $3.25 in Q3 2021, hence normalising the P/E ratio of the company. AMD has announced that AI chips would be a $400 billion market already in 2027, so there is major room for both revenue and EPS to grow for AMD which is leading the race in AI chips together with Nvidia. Although the battle for the AI market with Nvidia will continue, there is plenty of room for both of them and we believe Intel will struggle to keep up. AMD recently doubled up on its 2024 AI chip projection, now encompassing $3.5 billion. However, Intel is lagging behind and just recently announced its first AI chips for PC and server usage, a market already dominated by AMD and Nvidia. Macrotrends Macrotrends The fact is that Intel lost its momentum years ago. The lack of strength from Intel is apparent when looking at Intel's revenues for the last few quarters. Revenues for Intel have been falling consistently since Q4 2021. Also, Intel's Data Center and AI Revenue is down by 30% from $19.44 billion one year ago. In contrast, at AMD the Data Center segment accounts for the largest share of revenue and operating income and grew revenues by an astonishing 38% Y/Y while operating income grew by 50% Y/Y. AMD's performance was driven by strong growth in both AMD server GPU and CPU sales, more specifically the Instinct GPUs and the 4th Gen AMD EPYC. When it comes to Nvidia they are leading on GPUs but when choosing between investing in Nvidia or AMD, we believe AMD to be the better choice. First, the market cap of AMD is approximately 1/6 of Nvidia, making it a comparatively cheap stock if you want in on hardware AI albeit its high P/E ratio. AMD is also an established producer of CPUs fit for AI, a market just recently entered by Nvidia and Intel. AMD was early in investing in its AI portfolio which has created a significant competitive advantage for AMD. The company can now brag about its wide AI portfolio supporting any deployment of AI, and it does. The company has AI-optimized products not only in one segment but for both Cloud & Data Center, Enterprise, PC, and embedded products. In relation to AMD's Data Center segment, AMD offers the world's first data center APU. The APU is an accelerated processing unit that houses both a CPU and GPU on a central die which offers great core and thread counts at an affordable price. This is a major key competitive advantage for AMD against its rivals. Remember, Intel's revenues in the Data Center segment contracted by 30%. Furthermore, AMD provides PC CPUs tailored to AI applications such as the Ryzen 8040 processor as well as AI-optimized server CPUs for enterprise customers. The fact is that AMD has sold millions of Ryzen AI-enabled PCs to all the leading PC OEMs in the last year, with Ryzen CPUs now powering more than 90% of AI-enabled PCs in the market. AMD was the first semiconductor manufacturer to offer desktop PC processors with a dedicated AI module. Meanwhile, Intel in comparison just recently released AI powered PC CPUs and has completely failed to grow revenues for the last few quarters, while Nvidia just recently entered the CPU market. As you can see AMD is several steps ahead of Intel, still leading in AI tailored CPUs, and perfectly positioned to benefit from the ongoing AI boom. AMD IR AMD IR AMD has also been extremely successful in penetrating the market with its product portfolio. Just take their data center APU, the AMD Instinct MI300X accelerator, as an example. This product is used by Microsoft, Meta, Oracle, Dell Hewlett Packard, Lenovo, ASUS, and Gigabyte just to name a few enterprise customers. For valuation purposes, we apply a straightforward DCF model. The starting point of our model is the FY2023 year's revenue. Based on the anticipated strong growth of the AI market, together with AMD's robust product portfolio within the AI domain combined with its excellent track record of growth, we find it highly plausible that revenues will grow by at least 25% per year in the next five years. We then use a 5% perpetual growth rate which is at the lower end, to say the least taking into account the infant AI market. EBITDA margins are set to 10% for the first few years followed by improved operating margins capped at 20% as revenues grow and economies of scale come into effect. For D&A we use 2023 years ratio of 16%. HedgeMix HedgeMix Based on our model, the target price for AMD is around 185. But if AMD continues to grow double-digit, which we find highly plausible, the fair value for AMD is significantly higher than that. Here are the main risks we see with investing in AMD. To summarize, AMD is one of a few companies that provide microprocessor components tailored for AI deployment. As such, AMD is perfectly positioned to benefit from the ongoing AI boom. In comparison, Intel just recently released AI tailored CPUs a market entered by AMD years ago. Meanwhile, Nvidia just recently announced it will enter the CPU market. Although this means tightened competition for AMD, AMD is years ahead of Nvidia when it comes to CPU development. Furthermore, AMD provides a wide range of AI tailored solutions for both private and commercial use, with Ryzen CPUs now powering more than 90% of AI-enabled PCs in the market. If you want in on AI, then AMD is a great contestant. The deployment of AI is still in its early days. So even if the stock is near all-time highs there is still major room for further growth. Based on AMD's strong product portfolio within AI and the vast untapped growth opportunity of the AI market, we see an opportunity for major growth going forward. As such, we issue a strong buy for AMD. As the title of this article states, AMD is ready to conquer the AI boom. Feel free to follow us! This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of AMD either through stock ownership, options, or other derivatives.   I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}