{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.datacenterdynamics.com/en/news/vodafone-samsung-and-amd-trial-open-ran-chipset/",
    "text": "The test was carried out at Samsung's R&D lab in Korea Vodafone has partnered with Samsung and AMD to carry out a phone call using AMD’s new general-purpose processor on an Open RAN platform. Operators are keen to point out new technology, but not everyone is convinced that Open RAN has fully arrived The trial was conducted at Samsung’s R&D lab in Korea. The first call was completed using Samsung’s Open RAN-compliant, virtualized RAN (vRAN) software, integrated with AMD’s latest generation general purpose processor Epyc 8004 on Supermicro’s latest Edge servers, and supported by Wind River’s cloud-based platform. Vodafone has been pushing Open RAN heavily, launching the service in the UK last summer. Open RAN aims to allow providers to ‘mix and match’ solutions from multiple vendors, which is impossible with proprietary network equipment. “Vodafone, together with Samsung and AMD, are pioneering the development of purpose-built silicon to power the next-generation mobile networks,\" said Nadia Benabdallah, network strategy and engineering director at Vodafone Group. \"Through greater industry collaboration, we can create a vibrant Open RAN ecosystem to stay ahead of customer demand for faster connectivity without compromising reliability.” The partnership between the trio has seen trials carried out around the development, functionality, and testing of silicon chips for Open RAN. Vodafone added that it is \"exploring the potential of silicon photonic chips,\" which use light instead of electricity to compute mathematical operations, while the computation time is measured by how long it takes the light to cross the microchip. Photonic chips are expected to be faster. Data Centre Dynamics Ltd (DCD), 296-300 St John St, London EC1V 4PAEmail. [email protected]DCD is a subsidiary of InfraXmedia "
}