{
    "title": "Six AMD Radeon RX 7900 XT GPUs Packed Into An AI Package, Starting At US \n$15,000",
    "date": "2/28/2024",
    "url": "https://wccftech.com/six-amd-radeon-rx-7900-xt-integrated-into-ai-package-starting-for-usd-15000/",
    "text": "It seems like consumer GPUs are turning into the next AI accelerators, as the firm Tiny integrates six AMD Radeon RX 7900 XT GPUs into a single package for AI applications. With the recent AI GPU shortage, multiple individuals have resorted to gaming GPUs as an alternative since they offer decent AI performance, depending on what workloads you implement. Similarly, Tiny, an AI-related firm, has formulated a package, the TinyBox, for consumers deprived of AI GPUs, coming with AMD's flagship RDNA 3 GPUs at a reasonable price. Six AMD's Radeon RX 7900 XT are stacked into a 12U rack and interconnected using PCIe 4.0 x16 lanes to ensure seamless data transfer without speed compromise. While TinyBits themselves haven't disclosed the performance you could get with this system, based on calculations, you can get around 738 TLFOPS of FP16 performance out of the six onboard GPUs, along with 96GB GDDR6 memory, which does make it a decent choice considering the performance per dollar you are getting here. TinyBits themselves mention that utilizing the RDNA3 flagship SKU was the better choice here compared to the GeForce RTX 4090, solely because of the value AMD gives. Other vendors are also making customized AI machines such as the AI Workstation from GPTshop which is offering the Grace Hopper Superchip solution for $41,000 US. In terms of other specifications, the system comes with AMD's EPYC 7532 processor along with 128 GB RAM. For storage, 5x 1TB SN850X SSDs are onboard, and an empty 16x OCP 3.0 slot is used for networking purposes. Tiny has garnered attention for its TinyBox system, as the firm has received 583 preorders for the system, which will start shipping by April. Moreover, the firm has revealed intentions to tape out its chips, but apparently, that is a plan for the future. Tiny's AI-focused system retails for around US $10,000, which is decent, considering the GPUs would have cost the firm around $6,000 if they managed to snag it at MSRP, which is highly unlikely. As we progress into a market where getting AI accelerators is a massive problem for smaller AI startups, opting for such options seems feasible. While they certainly can't give the performance equivalent of AI accelerators in the same configuration, they do get the job done. News Source: Tiny Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}