{
    "title": "Minisforum Unveils V3: A 2-in-1 Tablet with Ryzen 7 8840U and Windows 11 Pro",
    "date": "2/8/2024",
    "url": "https://www.anandtech.com/show/21260/minisforum-unveils-v3-a-2in1-tablet-with-ryzen-7-8840u-and-windows-11-pro",
    "text": "Minisforum has formally announced its V3, one of the industry's first AMD Ryzen 7 8840U-based hybrid PCs that can serve as a tablet, a laptop, and an external display, which is why the company positions it as a '3-in-1' system. As the machine packs an eight-core CPU, it may offer the performance of some mid-range laptops. Meanwhile, despite being a 'tablet,' it has two USB4 ports and an SD card reader, a rare feature for this class of devices. The Minisforum V3 is closer to a classic laptop than a tablet, but this happens often. The system features a 14-inch detachable multitouch display with a 2560×1600 resolution, a 500 nits brightness, a 165 Hz refresh rate (which will undoubtedly be appreciated by gamers), and a stylus support that measures 323.26×219×9.8 mm and weighs 946 grams without the keyboard. The device is made of die-cast magnesium alloy and packs all the common sensors and features for tablets, such as a 5MP rear and 2MP front camera, gyroscopes, and a fingerprint reader.  The Minisforum V3 is powered by AMD's Ryzen 7 8840U (8C/16T, 3.30 GHz – 5.10 GHz, up to 28W) with built-in Radeon 780M graphics (768 stream processors) and is mated to up to 32 GB of LPDDR5-6400 memory as well as an up to 2 TB M.2-2280 SSD with a PCIe interface. To ensure consistent performance under high loads, Minisforum squeezed a cooling system into the tablet with four copper tubes and two fans, a rare feature.  When it comes to connectivity, the Minisforum V3 comes with a Wi-Fi 6E + Bluetooth 5.3 adapter, two USB4 ports, a V-Link connector (a USB-C that acts like a DisplayPort In), a UHS-II SD card reader, and a 3.5-mm jack for headsets. Thanks to the V-Link connector, Minisforum's V3 can act like a tablet and a laptop and as a display for another notebook.  Minisforum V3 comes with an integrated 50 Wh battery, which is more or less in line with what some other thin-and-light 14-inch laptops offer. To easily balance between a long battery life and maximum performance, V3 has three power profiles, including power-saving mode (15W), balanced mode (18W – 22W), and high-performance (28W). Meanwhile, Minisforum does not estimate the actual battery life of the device for now.  Minisforum is expected to announce the pricing of its V3 hybrid PC next month. Source:\n                Minisforum "
}