{
    "title": "Hungarian AKs (Part 3): AMD 65 - the Best Most Hated AK -",
    "date": "2/23/2024",
    "url": "https://www.thefirearmblog.com/blog/2024/02/23/hungarian-aks-part-3-amd-65-best-hated-ak/",
    "text": "Posted February 23, 2024 in AK-47 / AK-74 / Everything AK, Editorial, Machine Guns, Rifles  by Vladimir Onokoy with No CommentsTags: amd 65, amd65, hungarian, hungary In Part 1 of this article, I talked about the origins of Hungarian AKs. Part 2 is dedicated to AMD 65, its history, and the complaints Afghan police officers had after they were issued those guns. This article is about my own experiences with AMD 65. Apart from Afghanistan, many AMD 65s ended up in Iraq. Locals in Basra called this AK “Lybian” for no apparent reason and I was in charge of the repair of a few hundred of those guns. And in a few weeks after the arrival, my list of complaints was longer than that of the Afghan police. Handguard When it is +45 outside, the steel of the handguard is hot before you even start shooting. After a couple of magazines, it is like an under-barrel grill for your palm. AMD 65 with plastic handguard of Zastava M21. And many guns we had were missing front grips, so you had no choice but to grip that miniature grill with your support hand. Some Iraqis found a good solution and installed polymer handguards from Zastava M21 on their AMD 65. Folding stock But that is not all. When you grip the rifle properly, with the palm of your hand being high on the pistol grip, you often press the folding stock button and it collapses on you just when you’re ready to make a shot. On top of that, the stock is just plain uncomfortable when you’re used to a decent cheek weld. And the rubber pad on the stock often falls off, leaving you with a piece of bare metal. And rarely, the entire buttpad falls off, leaving you with a metal rod for the stock. A rare occasion when the buttpad on AMD 65 falls off completely The rear trunnion is nonstandard, so once the stock breaks, you cannot replace it with anything. I welded the stocks back on and they fell off 2 minutes later, before I could even get the gun from the welding shop into the armory. I glued the stocks with the most ridiculous mix of epoxies, tested all kinds of glue, only to see that the stocks were falling off again sooner or later. Another attempt to glue the stocks with epoxy. After applying the glue, you have to make sure it has time to harden, so sometimes you get creative. Non-standard parts But the biggest problem was not even there. Many guns actually had stoppages all the time, but very specific stoppages – dead trigger. I spent days trying to figure it out, mixing and matching different trigger components, until I realized the problem was far worse. Apparently, the tiny sear trip on the right bottom side of the bolt carrier was getting worn off on many guns. As a result, it didn’t do its job and didn’t push down auto-sear, activating the trigger. It easy fix for a normal AK – just replace the bolt carrier and carry on for another 30 years, but on AMD 65 it was impossible. AMD’s bolt carrier is an inch shorter, so you can’t replace it, a standard bolt carrier won’t fit inside AMD 65. And in Iraq, you can’t buy a new bolt carrier for AMD 65. Standard AKM bolt carrier (top), AMD 65 bolt carrier (bottom) Perhaps if I had a decent machine shop I could make some calculations, shorten a few bolt carriers, make new threads to screw in standard pistons, build some prototypes, test them, and finally make an entire batch to save those AMDs… But in reality, I didn’t even have a half-decent welding machine. So all the AMDs I inspected were doomed. More bolt carriers will wear off, more guns will end up broken in far, dark, and dusty corners of armories, and sooner or later the guns will be destroyed. Perhaps it will take a few more years, but the end is nigh for those poor Hungarian AKs. Like a doctor who couldn’t save the patient, I was mortified, and those AMDs are still coming to me in my memories sometimes. My typical workbench in Iraq. No fancy equipment was available. What can be done to improve AMD 65? But it shouldn’t be like that. AMD is a fine gun that deserves better. Pretty accurate, if you get past the ergonomics, with a long barrel life (15,000 rounds, according to the factory, and even more in reality). It is well built, and you don’t see cracked bolts, trunnions, or receivers (I’ve seen a cracked receiver on the Hungarian AK once, but that is expected with the number of AMDs I handled). It is a very potent SBR that has a place today, especially since subsonic 7.62×39 ammunition is becoming more available, broadening the capabilities of such guns. In Hungary, there was an attempt to modernize it, but unfortunately, that particular company isn’t operational anymore. Modernized FEG AMD-65  There was another company called AMD65Tech, based in the US, that developed a new stock for the AMD 65 and had prototypes for the rail system. Unfortunately, it doesn’t seem to be active as well. JMac developed a stock adapter that allows you to install Picatinny-mounted stocks, and it is probably the best solution if you don’t like the original stock. One thing we can learn from it – if you plan to use your gun for generations to come, make sure it has standard spare parts that you actually find. Vladimir Onokoy is a small arms subject matter expert and firearms instructor. Over the years he worked in 20 different countries as a security contractor, armorer, firearms industry sales representative, product manager, and consultant. His articles were published in the Recoil magazine, Small Arms Review, Small Arms Defence Journal, and Silah Report. He also contributed chapters to books from the “Vickers Guide: Kalashnikov” series. ► Email:  machaksilver at gmail dot com.\n► Facebook: https://www.facebook.com/Vladimir-Onokoy-articles-and-videos-about-guns-and-other-unpopular-stuff-107273143980300/\n► Instagram: https://www.instagram.com/vladonokoy/\n► YouTube: https://www.youtube.com/user/machaksilver "
}