{
    "title": "AMD: The Market Has Gotten Ahead Of Itself (NASDAQ:AMD)",
    "date": "2/3/2024",
    "url": "https://seekingalpha.com/article/4667071-amd-the-market-has-gotten-ahead-of-itself",
    "text": "DNY59  DNY59 We previously covered Advanced Micro Devices, Inc. (NASDAQ:AMD) in November 2023, discussing the management's underwhelming MI300 revenue guidance of only $2B in 2024, well below our expectations and Nvidia (NVDA)'s massive wins thus far. Combined with Intel's (INTC) drastic price cuts across its CPU and discrete GPUs offerings, we believed that AMD might be losing the ongoing chips war at most fronts despite its best efforts, resulting in our Hold rating then. In this article, we shall discuss how the market continues to reward AMD with the premium growth valuations, with us missing out on the impressive +51.4% rally since then, with it well outperforming the SPY at +12.4% and QQQ at +14.2% over the same time period. However, we maintain our previous conclusion in that the AMD investment thesis has gotten way ahead of itself, especially due to the management's underwhelming FQ1'24 guidance, delayed H2'24 ramp, and likely to be impacted profit margins in the intermediate term. For now, AMD has delivered a bottom line beat in its FQ4'23 earnings call, with revenues of $6.16B (+6.2% QoQ/ +10.2% YoY) and adj EPS of $0.77 (+10% QoQ/ +11.5% YoY). Part of its tailwinds is attributed to the robust Data Center sales of $2.28B (+43.3% QoQ/ +38.1% YoY), as the MI300 series ramps up in production and delivery from December 2023 onwards. Demand appears to be healthier than expected, with the management already aggressively raising the MI300 revenue contribution guidance from $2B to $3.5B in FY2024. While these are great news indeed, it is also painfully apparent that AMD's other segments are not doing as well, attributed the underwhelming performance in the Client segment at $1.46B (inline QoQ/ +62.2% YoY) in the latest quarter. It appears that INTC's choice to consistently cut ASPs has worked as intended, with it reporting a sustained growth in the Client Computing segment sales to $8.84B (+12.4% QoQ/ +33.1% YoY) over the same time period. Therefore, while AMD has been able to preserve its adj gross margins of 50% (-2 points YoY/ +7.4 from FY2019 levels of 42.6%) in FY2023, compared to INTC's impacted gross margins of 40% (-3 points YoY/ -18.6 from FY2019 levels of 58.6%), it is apparent that the former has also lost out in sales as the latter enjoys the new PC replacement cycle of between three to four years after the 2020 boom. GPU Price Trends Tech Spot Tech Spot At the same time, AMD has not been able to catch a break in the Gaming and Embedded segments, with both underperforming at $1.36B (-9.3% QoQ/ -17% YoY) and $1.05B (-15.3% QoQ/ -24.4% YoY) respectively, in the latest quarter. Part of the headwind is also attributed to INTC's price cuts in the GPU segments, similarly pulling down AMD's prices for the older models, worsened by the elongated replacement cycle for consoles/ IoT/ automotive sectors in the Embedded segment. While Super Micro Computer, Inc. (SMCI) continues to raise their FY2024 revenue guidance thus far, we believe that much of the Data Center tailwinds are attributed to NVDA, as the \"Deep-Learning and LLM-optimized NVIDIA HGX-H100 continues gaining high popularity,\" with AMD's AI offerings likely to play catch up. The same is also suggested by AMD's intensified annualized R&D efforts of $6.04B (inline QoQ/ +11% YoY/ +292.2% from FY2019 levels of $1.54B), with it comprising 24.5% of its revenues in the latest quarter (-1.3 points QoQ/ +0.2 YoY), 25.8% over the LTM, and 22.8% in FY2019. This is compared to NVDA's ratio of 12.6% in the prior quarter (-2.5 points QoQ/ -20.1 YoY), 18.1% over the LTM, and 25.8% in 2019, with AMD likely to aggressively invest in its next-generation processors, accelerators, and ROCm software suites. As a result of this trend, we may see AMD's operating profit margins underwhelm in the intermediate term, as similarly reported at 5.6% in the latest quarter (+1.7 points QoQ/ +8.2 YoY), 1.8% over the LTM, and 9.4% in FY2019. Readers must also note that NVDA's margins are notably more profitable in comparison, at 57.5% in the prior quarter (+7.2 points QoQ/ +47.4 YoY), 45.9% over the LTM, and 26.1% in CY2019. However, we believe that AMD has also made excellent use of its liquidity, with a growing net cash situation of $4.06B (inline QoQ/ +19.7% YoY) and a somewhat stable share count of 1.62B (inline QoQ/ YoY). This is despite the growing annualized share-based compensation of $1.49B (+5.9% QoQ/ +18.7% YoY). With the latter \"intended to attract, retain, and motivate highly qualified employees,\" it is apparent that AMD is working hard to avoid falling behind. AMD Valuations Seeking Alpha Seeking Alpha With the one bright spot in AMD's recent earnings call being its growing Data Center revenues, even then, lagging from NVDA's impressive guidance, it is uncertain if the former deserves the growth premium we are currently observing in its FWD valuations. For now, AMD trades at elevated FWD P/E valuations of 43.85x, compared to its 1Y mean of 33.94x and 2Y pre-pandemic mean of 37.38x. This number is notably higher than INTC's at 31.57x and nearing NVDA at 51.07x. The Consensus Forward Estimates Seeking Alpha Seeking Alpha Most importantly, despite the recently raised forward estimates, AMD is expected to generate a decelerating top/ bottom line growth at a CAGR of +20.2%/ +38.5% through FY2026, compared to its historical CAGR of +27.3%/ +58.1% between FY2017 and FY2023, respectively. We believe that AMD's growth rate pales in comparison to the market leader as well, with NVDA expected to generate an accelerated top/ bottom line expansions at a CAGR of +45.3%/ +68.4% over the next three years, demonstrating Mr. Market's conviction on the former's slower growth. With the market awarding AMD with the overly lavish growth premiums compared to its direct peers, we are uncertain if there is any margin of safety at these inflated levels indeed, especially due to the management's underwhelming FQ1'24 revenue guidance of $5.4B (-12.3% QoQ/ +1% YoY). It is apparent that while there may be \"strong demand from multiple enterprise customers for the MI300 platforms,\" the company may face more top-line headwinds from the underperforming segments, easily negating the robust growth in the Data Center segment. While the AMD management has offered an optimistic H2'24 commentary, attributed to the AI PCs ramp and increased Data Center supply capacity then, we believe that there remains a wide gap between its prospects and NVDA's leadership thus far. While the AI chip opportunity may be very well worth over $400B by 2027, it remains to be seen how much room there is for AMD's growth over the next few years, especially given the intense competition offered by NVDA and INTC thus far. AMD 4Y Stock Price Trading View Trading View Based on the price chart above, it is evident to us that Mr. Market is expecting a lot from AMD, with the stock already rallying by +191.3% since the October 2022 bottom and +71.8% since the October 2023 bottom. On the one hand, we are uncertain if there is any margin of safety at these levels, with the stock trading way above its fair value of $89.90. This is based on its 1Y P/E mean of 33.94x and the FY2023 adj EPS of $2.65 (-24.2% YoY). On the other hand, based on the consensus FY2026 adj EPS estimates of $7.04, there appears to be an excellent upside potential of +42.4% to our long-term price target of $238.90, partly aided by the recent pullback. As a result of these developments, readers may want to time their entry points according to their dollar cost averages and risk appetite, with the NVDA earnings call on February 21, 2024 likely to further influence Mr. Market's forward consideration. For now, we prefer to prudently maintain our Hold (Neutral) rating on the AMD stock. Interested investors may want to wait for further AMD pullbacks for an improved upside potential, especially since the \"once-in-a-generation AI transition\" does not happen overnight. Do not chase this rally. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of AMD, INTC, NVDA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. The analysis is provided exclusively for informational purposes and should not be considered professional investment advice. Before investing, please conduct personal in-depth research and utmost due diligence, as there are many risks associated with the trade, including capital loss. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}