{
    "title": "AMD RX 7800 XT Review Philippines: Better Choice? - UNBOX PH",
    "date": "2/18/2024",
    "url": "https://unbox.ph/gadget/amd-rx-7800-xt-review-philippines-better-choice/",
    "text": "AMD RX 7800 XT Review Philippines verdict: Now more than ever, AMD’s in a great place to challenge the green team with their mid-range cards. AMD’s RX 7800 XT might be six months older than NVIDIA’s latest releases, but it’s still a great card to buy for mid-range PC gaming at 1440p especially if you live in the Philippines. Pros Cons Building a gaming PC nowadays is so much easier compared to the dark times during the pandemic. There’s now a plethora of options for parts and components, and both AMD and NVIDIA have released mid-range GPUs that won’t break the bank. The AMD RX 7800 XT isn’t a new card compared to the ones that NVIDIA has released previously, but it’s become even more desirable now thanks to its price relative to the competition.  AMD’s RX 7800 XT was meant to fill the gap between AMD’s more expensive RX 7900 XTX and 7900 XT enthusiast-level cards and the lowly, oft-forgotten budget RX 7600XT. The RX 7800XT sits in the upper tier of the lineup, targeting 1440p gamers who want to dabble in 4K once in a while. Read more:\nAMD Unveils Radeon RX 7800 XT, 7700XT for 1440p Gaming\nAMD Radeon RX 7900 XTX Review: Better Than The 4080? We’re not going to dive into the nitty-gritty of the technology behind the card, since other outfits have already gone through that pretty extensively. What you do need to know is that the card has 16GB of GDDR6 RAM, which is a lot higher than the 12GB that NVIDIA’s 4070 series offers gamers. That’s going to matter in higher resolutions, as you’ll see later. Our test unit is a reference design model, which is pretty much unobtanium for normal gamers since it’s not being sold anywhere. Thankfully you can buy the card from AIB partners like Gigabyte, Sapphire, and ASUS, who put their spin on the card by adding RGB, more fans, a better backplate, and cooling. These AIB cards also sport a mild factory overclock to slightly increase performance, so your result on your system, if you buy one of these cards, may be different from what we get. There’s no good reason to dive into the overall design of the card that we’re testing as again, it’s simply a reference model that’s not obtainable in the market. It has the same design aesthetic as the Founder’s Edition RX 7900 XT and 7900 XTX, though with two fans instead of three. The card itself has three DisplayPort and one HDMI port and takes power via two 8-pin PCIe connectors.  One of the things that AMD has continually tried to improve on is FSR, which is now on version 3.0. FSR or FidelityFX Super Resolution is AMD’s answer to Nvidia’s DLSS. In a nutshell, it’s a software solution that boosts the frame rate by inserting frames created by an algorithm in between frames generated by the GPU. Sadly, while FSR has advanced by leaps and bounds, it’s still no match for NVIDIA’s DLSS in like-for-like situations.  Similarly, AMD has also managed to improve Ray Tracing in the RX 7800 XT, though NVIDIA is still the RT champ. Our advice to anyone considering or buying the RX 7800 XT is to keep RT off and depend entirely on pure rasterization because that’s what it’s good at anyway.\nAMD advertises the total board power of the RX 7800 XT is 263 watts, and AMD recommends a minimum of 700 watts for the PSU. Before we dive into our benchmarks let’s take a look at our test system first. It’s the same test system that we used for our recent review of Intel’s 14th Gen Core i7 processor, though we’re using a Core i9-13900K to try and alleviate bottlenecks in our review. Anyway, here’s the testbed specs: With that, let’s move on to the benchmarks: The RX 7800 XT is built primarily for 1440p, so let’s take a look at that first with the limited GPUs that we have access to. We’re aware that we don’t have data for NVIDIA’s recently released cards, though we’ll touch on that in a bit. First off we’re going to take a look at the performance of the RX 7800 XT in a fairly sedate competitive FPS title, Rainbow Six Siege. At 1440p it’s trading blows with the RTX 4070, scoring a frames higher than NVIDIA’s now discontinued RTX 4070. At a higher 4K resolution, it leaves NVIDIA’s offering behind by 30FPS, largely thanks to its larger 16GB GDDR6 RAM. More RAM means better performance at higher resolutions, which you can see here. Moving on to an older game, Shadows of the Tomb Raider, the RX 7800 XT is beaten by the RTX 4070, but not by much. 1440p performance has the two cards pretty close performance-wise at this resolution. The lead narrows down to almost nothing when you bump the resolution up to 4K, with the RTX 4070 leading by .2 frames. Moving on to Horizon Zero Dawn at 1440p, the RX 7800 XT is ahead of the RTX 4070 by around 5% here. Things get a little better when you move to 4K, though the RX 7800 XT is still ahead by 4%. Finally, we move on to Cyberpunk 2077, probably the most punishing game in our testing. This game is very demanding and requires a lot of VRAM, which is probably why the RX 7800 XT performed as well as it did VS the RTX 4070. 1440p is particularly brutal for the RTX 4070 since the RX 7800 XT performed 27.5% better without RT enabled. Moving onto 4K makes it even worse, as the RTX 4070 is nigh unplayable in this resolution without DLSS help, while the RX 7800XT is still somewhat playable at 39 FPS. Take note that all of these benchmarks were done without Ray Tracing enabled, and this is where the RTX 4070 (and really, any of NVIDIA’s recent cards) shine. With DLSS enabled the RTX 4070 gets performance parity with the RX 7800XT in some titles. But as far as pure rasterization performance goes, the RX 7800XT wins over the vanilla RTX 4070 hands down. Power consumption for the RTX 7800 XT peaked at 252 watts while we were doing our review, with average power consumption hovering around 249 watts. As for thermals, we recorded a high of 73 degrees Celcius when gaming. Fan noise for the reference model was a bit high but not that bad – not that data’s useful because AIB partners will have their fan design for their offerings anyway.  Six months since it launched the RX 7800 XT is still great value even with the recent releases of its main competitor. Rasterization performance is what you primarily want, and even in 4K the RX 7800 XT still manages to pull good performance without help from FSR. However, it doesn’t have access to NVIDIA’s excellent DLSS upscaling tech, and its ray tracing performance still has a ways to go. But if you’re simply looking at the price versus the performance you’re getting, then the RX 7800 XT is a pretty solid buy. Pulling up prices for the RX 7800 XT in Lazada, the cheapest you can get right now is the Sapphire Pulse RX 7800XT which is priced at Php 32,495. Similarly, the cheaper RTX 4070 Super is priced at Php 39,999 for the Colorful RTX 4070. That’s a significant price gap for the two, and the money you save, if you go with the red team, can easily net you a decent SSD, cooler, or case for your build.  Your email address will not be published. Required fields are marked *  Δ "
}