{
    "title": "Huawei's new CPU matches Zen 3 in single-core performance - HiSilicon \nTaishan V120 server CPU benchmark",
    "date": "2/25/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/huaweis-new-cpu-matches-zen-3-in-single-core-performance-hisilicon-taishan-v120-server-cpu-benchmark",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Sadly only the single-core tests were run. A Geekbench 6 result features what is likely the first-ever look at the single-core performance of the Taishan V120, developed by Huawei's HiSilicon subsidiary (via @Olrak29_ on X). The single-core score indicates that Taishan V120 cores are roughly on par with AMD's Zen 3 cores from late 2020, which could mean Huawei's technology isn't that far behind cutting-edge Western chip designers. The Taishan V120 core was first spotted in Huawei's Kirin 9000s smartphone chip, which uses four of the cores alongside two efficiency-focused Arm Cortex A510 cores. Since Kirin 9000s chips are produced using SMIC's second-generation 7nm node (which may make it illegal to sell internationally according to U.S. lawmakers), it would also seem likely that the Taishan V120 core tested in Geekbench 6 is also made on the second-generation 7nm node. The benchmark result doesn't really say much about what the actual CPU is, with the only hint being \"Huawei Cloud OpenStack Nova.\" This implies it's a Kunpeng server CPU, which may either be the Kunpeng 916, 920, or 930. While we can only guess which one it is, it's almost certain to be the 930 given the high single-core performance shown in the result. By contrast, the few Geekbench 5 results for the Kunpeng 920 show it performing well behind AMD's first-generation Epyc Naples from 2017. This appearance of what is likely the Kunpeng 930 is the first we've seen since it was announced in 2019. A report from The Next Platform in 2021 expected the 930 to launch that year on TSMC's 5nm, followed by the Kunpeng 950 on TSMC's 3nm node in 2023. Obviously, that didn't happen, and even if the 930 and 950 were going to be made on TSMC's cutting-edge nodes, those plans had to be shelved since Huawei is banned from fabbing at TSMC. Additionally, the benchmark was only run on one core, and since the last-generation Kunpeng 920 capped out at 64 cores, this result was likely run on a virtual machine or some configuration where only one core was tested. That in turn means the multi-core score isn't really useful and can't tell us too much about how performant the full chips are. Per Geekbench's processor rankings, the Taishan V120-powered server CPU is about on par with AMD's Zen 3-based Epyc Milan CPUs, specifically the midrange Epyc 7413. It's also about equivalent to Intel's Xeon E-2136, a Coffee Lake-based Xeon from 2018. Considering the Geekbench 6 result says the Huawei CPU operated at 2.9 GHz, it's not a bad result; the Epyc 7413 boosts to 3.6 GHz and the E-2136 to 4.5 GHz. However, it is clearly behind modern Epyc Genoa based on Zen 4, as well as Intel's Sapphire Rapids, which are both around 25% faster. To be fair to the Taishan V120 chip, it is likely fabbed on a less performant node, as Genoa uses TSMC's 5nm and Intel uses its own Intel 7 process. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Unfortunately, without a look at multi-threaded performance, power consumption, and efficiency, it's hard to say how competitive Taishan V120 cores will be. For servers in particular, power and efficiency are key due to the cost of electricity, and even if Huawei's latest server CPUs are fast, that won't mean much if they consume tons of power. Matthew Connatser is a freelancing writer for Tom's Hardware US. He writes articles about CPUs, GPUs, SSDs, and computers in general. AMD 170W Granite Ridge Zen 5 CPUs and 128W Strix Point APUs revealed in shipping manifest — 16-core 'Fire Range' mobile CPUs also coming AMD says the UCIe universal chiplet interface will create a whole ecosystem — custom multi-chiplet designs are the future OpenAI and Microsoft reportedly planning  $100 billion datacenter project for an AI supercomputer By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}