{
    "title": "PowerColor Hellhound Radeon RX 7900 GRE review: A decent GPU overshadowed \nby others",
    "date": "2/26/2024",
    "url": "https://www.xda-developers.com/powercolor-hellhound-radeon-rx-7900-gre-review/",
    "text": "Seems AMD is releasing graphics cards just for fun these days You'd be forgiven if you've never heard of the AMD Radeon RX 7900 Golden Rabbit Edition (GRE) as it was a graphics card released for the Chinese market. AMD is now rolling out the GPU worldwide, which awkwardly sits between the Radeon RX 7800 XT and RX 7900 XT in the product stack. On paper, it's a limited RX 7900 XT with similar specifications here and there, but it also manages to encroach on the territory governed by the RX 7800 XT. So I find myself wondering who this graphics card is manufactured for. About this review: AMD provided XDA-Developers with an RX 7900 GRE sample for this review, but had no input on its contents. The Radeon RX 7900 GRE is a capable graphics card. It can handle 1440p gaming as well as the 7800 XT and can even do a little 4K if you don't mind turning down most visual settings. That said, should you buy this over a 7800 XT or 7900 XT? The AMD Radeon RX 7900 GRE is launching with an MSRP of $549. This puts it in between the RX 7800 XT at $499 and RX 7900 XT at $749, though performance can be a hit or a miss when compared to the more affordable RX 7800 XT. In terms of specifications, we're looking at 80 compute units, which is four less than the RX 7900 XT. Where things take a turn for the worse is with the memory and clock speeds. This GPU has less memory bandwidth than the RX 7800 XT and is unable to boost as high with stock settings. This puts the RX 7900 GRE in a strange position as it's not as fast as the RX 7900 XT, but it's only marginally faster than the RX 7800 XT. Although AMD launched the RX 7900 GRE in China alone, I have to ask who this GPU is targeting with its wider release. Interestingly, AMD cut the price of the RX 7900 GRE by $100, and I can see why, as paying $649 for a GPU that can be beaten by a card costing $150 less could be viewed as terrible value. Still, this is the GPU market that we know and love today.  The PowerColor Hellhound Radeon RX 7900 GRE is an attractive graphics card with a large cooling shroud and three fans to keep temperatures in check. If you've used an AMD Radeon RX 7800 or RX 7900 GPU, you'll feel right at home here. The three fans have LED lighting for a subtle effect, which should look good inside most PC cases, mounted horizontally or vertically. Two 8-pin connections are available for supplying the GPU with power. Alongside the PCI slot, this GPU will suck up to 260W of electricity through the PSU. It's a hefty card and weighs a fair amount. The large plastic shroud is met by the metal backplate with some HEllhound branding. The rear of the AMD Radeon RX 7900 GRE GPU is visible, and so too is the passthrough for the right fan. The fin stack is huge, spanning the entire length of the graphics card. The AMD Radeon RX 7900 series runs considerably warm, but with lower clock speeds and capable cooling, the PowerColor Hellhound Radeon RX 7900 GRE shouldn't have any problems with thermals. Even though this GPU isn't the lightest or most compact graphics card on the market, you won't require a supporting bracket. There is the option to do so with four points located on the end of the card. It looks the part with a sleek stealthy design with minimal noise. There are two switches on the GPU, one for switching between OPC or silent BIOS modes, and the other alters the LED lighting between blue, white, and off. It's simple, gets the job done, and provides minimal fuss in the installation process. Making use of AMD's RDNA 3 architecture, the AMD Radeon RX 7900 GRE is a unique GPU in that it shares similar underlying technologies to the RX 7900 XT but has some notable differences. Powering the GPU is the same Navi 31 found inside the RX 7900 XT and 7900 XTX but it has been physically shrunk. Then there's the memory bus, running at 256-bit wide, considerably narrower than the 384-bit bus found on the two other 7900 series GPUs. I'm not quite sure which 6000 series this GPU is meant to replace as it's so close to the 7800 XT. There are additional shader units, totaling 5,120 but its clock speeds are only capable of hitting 2,245 MHz and the memory bandwidth comes in at 576 GB/s. Where positives should be found is with thermals, particularly with aftermarket cards such as the PowerColor Hellhound Radeon RX 7900 GRE. This thing has a massive fin stack and three power fans that should be able to handle the lower heat output compared to the 7900 XT. To test the PowerColor Hellhound Radeon RX 7900 GRE, I used a testbench with an AMD Ryzen 9 7950X processor, 32 GB of DDR5-6400 RAM, and a 1TB M.2 SSD to allow the GPU to run to its maximum potential. Passing through the benchmarks, I managed to achieve some respectable scores in 3DMark's suite of tests. Benchmark Radeon RX 7900 GRE Fire Strike Ultra 13,467 Time Spy (DX12) 20,629 Time Spy Extreme (DX12) 9,899 This is about in line with expectations, placing this GPU between the RX 7800 XT and RX 7900 XT. As noted already, the specifications of the RX 7900 GRE make it more akin to the RX 7800 XT than the same GPU it's based on. This is what would have made AMD's original MSRP plans categorically backfire. Benchmark Radeon RX 7800 XT Radeon RX 7900 GRE Radeon RX 7900 XT Time Spy (DX 12) 19,789 20,629 25,980 For games, I fired up a few modern titles to see how this GPU performed at 1080p and 1440p. These included more heavy hitters such as Cyberpunk 2077. The RX 7900 GRE was able to handle just about all of them well at 1080p and 1440p, which was to be expected as the RX 7800 XT is no slouch. Game / Average FPS Radeon RX 7800 XT Cyberpunk 2077  Far Cry 6  GTA 5  Metro Exodus  Red Dead Redemption 2  Shadow of the Tomb Raider  I measured 264W of power being pulled by the PowerColor Hellhound Radeon RX 7900 GRE, which is about what AMD and PowerColor state in their marketing. Even though a considerable amount of power was being shared across the PCB, the GPU managed to keep its temperatures relatively low, especially when playing games. As well as having the ability to spin its fans to zero when not in use, the PowerColor Hellhound Radeon RX 7900 GRE was barely noticeable when pushed hard. During testing, I was able to record a maximum temperature of 74C, though it stabilized to around 70C for longer gaming sessions. It's a shame as there's more room for the card to work with, but AMD purposely handicapped it to position the RX 7900 GRE closer to the RX 7800 XT. I'm first going to compare the specifications between the AMD Radeon RX 7800 XT and Radeon RX 7900 GRE. The 7900 GRE was supposed to launch worldwide at $650, but AMD reduced the launch price to $550, costing just $50 more than the 7800 XT. By choosing the 7900 GRE, you're essentially getting up to a 10% performance increase, but this varies depending on the workload and game. It has more shaders, RT cores, and AI accelerators, but the VRAM is weaker with lower bandwidth and speeds. The clock speeds have also taken a hit with the 7900 GRE maxing out at 2,245 MHz compared to the 2,430 MHz on the RX 7800 XT. The next GPU up in the family of AMD Cards is the RX 7900 XT, which is considerably more powerful than both the RX 7800 XT and RX 7900 GRE. Where things take a turn for the worse is when comparing this new GPU against RX 6000 series cards. It's barely faster than the RX 6950 XT. This makes recommending an AMD GPU to upgrade to from the 6000 series incredibly difficult as the potential gains are largely offset by the increase in price. Then there's the Nvidia GeForce RTX 4070 Ti Super, which AMD doesn't have an answer for. This card won't come close to matching Team Green's GPU. You should buy the PowerColor Hellhound Radeon RX 7900 GRE if: You shouldn't buy the PowerColor Hellhound Radeon RX 7900 GRE if: PowerColor makes some excellent GPUs and the Hellhound Radeon RX 7900 GRE is a decent graphics card. It's let down by the AMD GPU that powers it. It's simply not that much better than the 7800 XT or 6950 XT, making it a tough sell, and you can forget 4K gaming, which is where the 7900 XT comes into play. It's quiet under load and the three fans are more than capable of keeping temperatures low. At 1080p and 1440p, this GPU performs well with excellent results across the board. It's just a shame the only way I could recommend buying one is if you pretended AMD didn't launch the RX 7800 XT. There's also the case of Nvidia's RTX 40 series Super cards, which offer better performance at the same (or similar) prices. The PowerColor Hellhound Radeon RX 7900 GRE is a solid card, but it seems AMD didn't quite know how to position the RX 7900 GRE. It's not a 7900 series GPU outside of sharing the same underlying tech, but it does manage to power through the latest games. PowerColor's Hellhound Radeon RX 7900 GRE is a unique graphics card in that it has a special name, uses parts from other GPUs, and attempts to offer a middle ground between the RX 7800 XT and RX 7900 XT. It's an ideal pick for 1440p gaming.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Richard is a Senior Editor at Valnet and has been covering the technology industry for almost two decades. He's been building PCs since young and when not creating content, you can often find him inside a chassis somewhere. Nvidia, in collaboration with HuggingFace and ServiceNow, has released StarCoder2, and it will help you generate code. The Start menu has been a staple of Windows for nearly 30 years. Here's how it's evolved in that time. Nvidia power wherever you go. If you use two PCs as part of the same desk setup, a KVM switch could be the way to simplify your workstation. The Nvidia app beta adds cool new features, but it's still quite barebones. There are many creative ways to use different services, and Telegram actually allows you to use it as cloud storage. "
}