{
    "title": "RTX works with AMD to develop next-gen Multi-Chip Package",
    "date": "2/1/2024",
    "url": "https://www.rtx.com/news/news-center/2024/02/01/rtx-works-with-amd-to-develop-next-gen-multi-chip-package",
    "text": "Collaboration will accelerate the delivery of microelectronics packaging for military systems ARLINGTON, Va., Feb. 1, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, has been awarded a $20 million contract through the Strategic and Spectrum Missions Advanced Resilient Trusted Systems (S2MARTS) consortium to develop a next-generation multi-chip package for use in ground, maritime and airborne sensors. Under the contract, Raytheon will package state-of-the-art commercial devices from industry partners like AMD to create a compact microelectronics package that will convert radio frequency energy to digital information with more bandwidth and higher data rates. The integration will result in new system capabilities designed with higher performance, lower power consumption and reduced weight. \"By teaming with commercial industry, we can incorporate cutting-edge technology into Department of Defense applications on a much faster timescale,\" said Colin Whelan, president of Advanced Technology at Raytheon. \"Together, we will deliver the first multi-chip package that features the latest in interconnect ability – which will provide new system capabilities to our warfighters.\" This multi-chip package will be created with the latest in industry-standard die-level interconnect ability, enabling individual chiplets to reach their peak performance and achieve new system capabilities in a cost-effective and high-performance way. It's designed for compatibility with Raytheon's scalable sensor processing requirements. Chiplets from commercial partners will be integrated onto a Raytheon-designed and fabricated interposer by our 3D Universal Packaging (3DUP™) domestic silicon manufacturing process in Lompoc, California. This award will be managed by the National Security Technology Accelerator and administered by the Naval Surface Warfare Center Crane Division in Indiana. About RaytheonRaytheon, an RTX business, is a leading provider of offensive and defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, offensive and defensive cybersecurity tools, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space. About RTXRTX is the world's largest aerospace and defense company. With more than 185,000 global employees, we push the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems for operational success, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $68.9 billion, is headquartered in Arlington, Virginia. All rights reserved. AMD, and combinations thereof are trademarks of Advanced Micro Devices, Inc. For questions or to schedule an interview, please contact corporatepr@rtx.com SOURCE RTX If you like this article, share it. RTX RTX Businesses Follow Us "
}