{
    "title": "FOMO Warning: Why Chasing AMD Stock in 2024 Could Backfire",
    "date": "2/12/2024",
    "url": "https://investorplace.com/2024/02/fomo-warning-why-chasing-amd-stock-in-2024-could-backfire/",
    "text": " AMD stock is overvalued, and their AI chip sales won’t justify its valuation Advertisement Source: JHVEPhoto / Shutterstock.com The AMD (NASDAQ:AMD) stock outlook may be fading. has doubled in the last year, and investors are turning increasingly bullish on their AI chip prospects in 2024. The company plans to release their MI300 AI chips, forecasting between $2-$4 billion in sales in the 2024 fiscal year. While this is great news, AMD has yet to penetrate the AI GPU market. Analysts on Wall Street are getting overly optimistic, despite the company’s already rich valuation and weak margin profile. Taiwan Semiconductor largely fueled the increased optimism on AMD stock by forecasting 20% revenue growth in the 2024 fiscal year. This has led to many Wall Street analysts increasing their forecast for their MI300 AI chip sales. However, the company has yet to penetrate the market and there could be hiccups along the way. AMD is currently in the product ramp stage, while Nvidia is forecasting $20 billion in sales in Q4 FY24. Nvidia will release their H200 GPUs in the second quarter of next year, while also planning their new China-based AI chip. AMD has gotten way ahead of itself, and the stock could plunge if it cannot meet expectations. What is even more ridiculous is the recent news of OpenAI’s CEO Sam Altman supposedly seeking to raise $7 trillion for a new AI chip project. That is nearly the size of Japan and Canada’s GDP combined. There definitely exists opportunity in the AI GPU market, but irrational exuberance continues to overshadow reality. Advanced Micro Devices plans to make a dent in the AI GPU market, after they forecasted the market to grow to $400 billion by 2027. There is obvious competition in the marketplace, and Nvidia’s first mover advantage should scare AMD bulls. They currently hold between 80-95% market share, with new product ramps that are underway. Opportunity exists for them to steal market share, but how much will be a tell tale sign. Some analysts on Wall Street are now forecasting AMD will grab 15-20% market share. While this is a possible scenario, this may be many years out from today. AMD’s trailing P/E ratio of 325.43 and P/S ratio of 12 goes to show how much investors are willing to pay for this AI stock. Even when looking closer at AMD’s margin profile over the last several years, it is really nothing special at all. There are much cheaper alternatives, like Broadcom, that exhibit superior financial performance and a demonstrated history of returning cash to shareholders. While AMD’s MI300x chips hold a lot of promise, investors will be better off waiting on the sidelines than chasing street high price targets in 2024. When looking closer at the AI GPU market, its potential has garnered a lot of hysteria. Evidently, there are many aspects of the AI technology boom that exhibit similarities to the dot com bubble in the late 1990s to early 2000s. There are a significant amount of AI stocks that are riding in the overbought territory. What investors should understand is that the early innings will have a ton of FOMO and irrational exuberance. Eventually, these companies will not be clocking triple digit growth, and their share prices will fall back down to reality. Therefore, it would not be wise to chase AMD stock at a potential top, even if it can move higher from here. On the date of publication, Terel Miles did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Terel Miles is a contributing writer at InvestorPlace.com, with more than seven years of experience investing in the financial markets. Artificial Intelligence, Semiconductor, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/fomo-warning-why-chasing-amd-stock-in-2024-could-backfire/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}