{
    "title": "AMD Unveils Embedded+ Architecture; Combines Embedded Processors with \nAdaptive SoCs to Accelerate Time-to ...",
    "date": "2/6/2024",
    "url": "https://www.globenewswire.com/en/news-release/2024/02/06/2824378/0/en/AMD-Unveils-Embedded-Architecture-Combines-Embedded-Processors-with-Adaptive-SoCs-to-Accelerate-Time-to-Market-for-Edge-AI-Applications.html",
    "text": "February 06, 2024 09:00 ET\n\n\r\n            | Source:\r\n            \nAdvanced Micro Devices, Inc.\n\n\n\n\n\nAdvanced Micro Devices, Inc. — AMD-validated solutions provide a simplified path to AI inferencing, sensor fusion, industrial networking, control, and visualization for ODM partners — SANTA CLARA, Calif., Feb.  06, 2024  (GLOBE NEWSWIRE) -- AMD (NASDAQ: AMD) today announced the launch of AMD Embedded+, a new architectural solution that combines AMD Ryzen™ Embedded processors with Versal™ adaptive SoCs onto a single integrated board to deliver scalable and power-efficient solutions that accelerate time-to-market for original design manufacturer (ODM) partners. Validated by AMD, the Embedded+ integrated compute platform helps ODM customers reduce qualification and build times for faster time-to-market without needing to expend additional hardware and R&D resources. ODM integration using Embedded+ architecture enables the use of a common software platform to develop designs with low power, small form factors, and long lifecycles for medical, industrial, and automotive applications. “In automated systems, sensor data has diminishing value with time and must operate on the freshest information possible to enable the lowest latency, deterministic response,” said Chetan Khona, senior director of Industrial, Vision, Healthcare and Sciences Markets, AMD. “In industrial and medical applications, many decisions need to happen in milliseconds. Embedded+ maximizes the value of partner and customer data, with energy efficiency and performant computing that enables them to focus in turn on addressing their customer and market needs.” In a first of its kind, Embedded+ architecture combines leadership AMD x86 compute with integrated graphics and programmable hardware for critical AI inferencing and sensor fusion applications. Adaptive computing excels in deterministic, low-latency processing, whereas AI Engines improve high performance-per-watt inferencing. Ryzen Embedded processors, which contain high-performance “Zen” cores and Radeon™ graphics, also offer world-class rendering and display options for uplifted 4K multimedia experience and a built-in video codec for 4K H.264/H.265 encode decode. The combination of low latency processing and high performance-per-watt inferencing enables high performance of key tasks, including integrating adaptive computing in real-time with flexible I/O, AI Engines for inferencing, and AMD Radeon graphics, within a solution that leverages the best aspects of each technology. Sapphire Technology delivers inaugural AMD Embedded+ ODM solution Embedded+ also allows system designers to choose from an ecosystem of ODM board offerings based on the Embedded+ architecture and scale their product portfolios to deliver performance and power profiles best suited to customers’ target applications. The first ODM solution based on Embedded+ architecture is the Sapphire Edge+ VPR-4616-MB, a low-power Mini-ITX form factor motherboard from Sapphire Technology. It offers the full suite of capabilities in as low as 30W of power by leveraging the Ryzen Embedded R2314 processor and Versal AI Edge VE2302 Adaptive SoC. The VPR-4616-MB is also available in a full system, including memory, storage, power supply, and chassis. “By working with a compute architecture that is validated and reliable, we’re able to focus our resources to bolster other aspects of our products, shortening time to market and reducing R&D costs,” said Adrian Thompson, senior vice president of global marketing, Sapphire Technology. “Embedded+ is an excellent, streamlined platform for building solutions with leading performance and features.” The Embedded+ qualified VPR-4616-MB from Sapphire Technology is immediately available to customers for purchase at launch. Supporting Resources About AMDFor more than 50 years AMD has driven innovation in high-performance computing, graphics, and visualization technologies. Billions of people, leading Fortune 500 businesses, and cutting-edge scientific research institutions around the world rely on AMD technology daily to improve how they live, work, and play. AMD employees are focused on building leadership high-performance and adaptive products that push the boundaries of what is possible. For more information about how AMD is enabling today and inspiring tomorrow, visit the AMD (NASDAQ: AMD) website, blog, LinkedIn, and Twitter pages. AMD, the AMD Arrow logo, Radeon, Ryzen, Versal and combinations thereof are trademarks of Advanced Micro Devices, Inc. Other names are for informational purposes only and may be trademarks of their respective owners. Contact:Mike Sanchez AMD Communications+1 209 262-7458 M.Sanchez@amd.com Suresh BhaskaranAMD Investor Relations+1 408-749-2845Suresh.Bhaskaran@amd.com A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/97d94976-7e83-47fb-b4af-b479148021ef "
}