{
    "title": "Intel Core i3 14100 / i5 14500 vs. AMD Ryzen 5 8500G / 8600G In 500+ \nBenchmarks Review",
    "date": "2/22/2024",
    "url": "https://www.phoronix.com/review/intel-14100-14500-amd-ryzen/4",
    "text": "Show Your Support:  This site is primarily supported by advertisements. Ads are what have allowed this site to be maintained on a daily basis for the past 19+ years. We do our best to ensure only clean, relevant ads are shown, when any nasty ads are detected, we work to remove them ASAP. If you would like to view the site without ads while still supporting our work, please consider our ad-free Phoronix Premium. For workstation graphics performance, the 8500G/8600G were still delivering much better performance and value. When it comes to the AI benchmarks, they were all carried out with the CPU cores. The Raptor Lake Refresh processors do not sport any NPU while the Ryzen 8000G series has the Ryzen AI support but with the Linux driver only recently published and currently very limited scope of software support. With the OpenVINO performance the Core i5 14500 was leading in some of the benchmarks thanks to its 20 threads while in other cases the 8000G APUs with AVX-512 support were delivering better performance. The Ryzen 8500G/8600G were performing at the top in a number of the benchmarks while typically having lower power consumption than the Raptor Lake Refresh processors in these multi-threaded tests. Phoronix Premium allows ad-free access to the site, multi-page articles on a single page, and other features while supporting this site's continued operations. The mission at Phoronix since 2004 has centered around enriching the Linux hardware experience. In addition to supporting our site through advertisements, you can help by subscribing to Phoronix Premium. You can also contribute to Phoronix through a PayPal tip or tip via Stripe.  Legal Disclaimer, Privacy Policy, Cookies | Privacy Manager | Contact Copyright © 2004 - 2024 by Phoronix Media. All trademarks used are properties of their respective owners. All rights reserved. "
}