{
    "title": null,
    "date": "3/6/2024",
    "url": "https://finance.yahoo.com/news/why-amd-tsmc-broadcom-stocks-172501659.html",
    "text": "After sliding on Tuesday, shares of semiconductor stocks Advanced Micro Devices (NASDAQ: AMD), Broadcom (NASDAQ: AVGO), and Taiwan Semiconductor Manufacturing Company (NYSE: TSM) are all inching higher again on Wednesday morning, rising 2.8%, 2.8%, and 5.1%, respectively, through 11:05 a.m. ET. Two key factors appear to be driving today's outperformance: generalized, global trends in semiconductor demand and... the U.S. government. First things first. On Monday, the Semiconductor Industry Association (SIA) trade group reported that global semiconductor sales in January 2024 declined slightly in comparison to December 2023 (down 2.1%), but increased dramatically in comparison to the year-ago period. January 2024 sales totaled $47.6 billion, up 15.2% year over year from January 2023 -- the largest year-over-year increase in monthly sales seen since May 2022, the association noted. The SIA described January's results as a strong start to the year, and predicted that as 2024 progresses, semiconductor sales worldwide will continue to grow double-digits over 2023 numbers. For the time being at least, it seems a lot of this growth is being concentrated among just a handful of companies -- Nvidia and its contract manufacturer TSMC being notable winners -- such that it's not 100% certain that each and every individual semiconductor stock can be expected to grow this year. But it's certainly better news than a report that semiconductor sales are slowing would have been. On a more granular level, the SIA report noted that semiconductor sales growth was fastest in China (sales up 26.6% year over year) and second-fastest in the U.S. (sales up 20.3%) -- which leads us to our second point today, influencing the prices of AMD, Broadcom, and TSMC stock prices: the U.S. Chips Act. As Reuters reports today, \"close to $30 billion\" worth of U.S. government subsidies awarded to semiconductor manufacturers under the Chips Act will \"start flowing in the next few weeks.\" Again, it's not 100% certain at this time who will benefit from this largesse. Reuters reports that Intel, Samsung, and TSMC are all \"likely\" to receive subsidies under the Chips Act, while it's less clear how much Broadcom and AMD might benefit -- and for now, the Commerce Department is remaining mum on who is getting how much of the money. Until we know more, therefore, investors are probably best advised to keep their focus on valuation. And in that regard, at 26 times earnings today, TSMC looks like the safest of the three stocks to invest in. Broadcom shares cost at least 50% more at a valuation of 41 times trailing earnings, and AMD looks much more expensive at a P/E ratio of 387 (!). Admittedly, TSMC also has the lowest projected earnings growth rate of the three stocks -- 11%, versus 14% for Broadcom and 52% (also \"!\") for AMD. On the plus side, though, that more conservative growth rate also means that TSMC has the lowest bar to clear -- and the greatest chance of outperforming expectations and delivering a positive earnings surprise for investors. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Advanced Micro Devices made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks *Stock Advisor returns as of February 26, 2024 Rich Smith has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Why AMD, TSMC, and Broadcom Stocks Are All Up Today was originally published by The Motley Fool Related Quotes "
}