{
    "title": "Dragon’s Dogma 2 PC Benchmark Test: AMD RX 7900 XTX Beats the NVIDIA RTX \n4090",
    "date": "3/23/2024",
    "url": "https://www.hardwaretimes.com/dragons-dogma-2-benchmarks/",
    "text": "Dragon’s Dogma 2 is out on PC and consoles, but there’s a lot left to say about the performance. Capcom’s open-world RPG is unusually CPU-intensive, bringing the fastest processors down on their knees. We tested the game on some of the latest NVIDIA and AMD graphics cards, and it looks like much hasn’t changed with the RE Engine. It continues to favor Radeon GPUs with muddy temporal anti-aliasing and artifacting on reflective textures. Table of Contents Dragon’s Dogma 2 Performance Benchmark – PC Optimized Settings Dragon’s Dogma 2 is relatively easy on the GPU but brutal on the CPU. The CPU overhead is more apparent on NVIDIA GPUs (likely driver overhead) while competing Radeon cards get off easy. At 1080p, the GeForce RTX 4070 and 4080 Super are driver-bound, falling short of the RX 7900 XT and the 7900 XTX. The Radeon RX 7900 XTX is 19% faster than the RTX 4080 Super on average, although the 1% lows are similar. Interestingly, the $699 RX 7900 XT also manages to outpace the 4080 Super, but the lows are nearly identical. The Radeon RX 7900 XTX retains the top spot at 1440p, beating the RTX 4080 Super and the twice-as-expensive RTX 4090. Like before, the GeForce RTX GPUs net higher 1% lows but fall short on the averages. The Radeon RX 7900 XT (a $699 GPU) delivers comparable performance to the RTX 4090 (a $1599 card). The RX 7900 XTX is 18% faster than the RTX 4080 Super and 7% faster than the RTX 4090. Conversely, the RTX 4090 produces 22-23% higher 1% lows, while the 4080 Super’s lowest 1% figures are 12% higher than the RX 7900 XTX. The CPU bottlenecks subside at 4K, as the GeForce RTX 4090 claims the top spot with an average of 81 FPS. The RX 7900 XTX averages almost the same, but the lows are 24% worse than the top NVIDIA card. Regardless, it continues to beat the RTX 4080 Super by 13.6% with slightly lower 1% lows. The RX 7900 XT fails to catch up to its pricier rival, with 13% lower 1% figures. Dragon’s Dogma 2 features ray-traced global illumination, drastically impacting image quality in poorly lit scenes. The implementation isn’t perfect, with lots of blurring, but it’s a notable upgrade over SSAO and its derivatives. The Radeon RX 7900 XT one-ups the RTX 4080 Super at 1080p, a rare sight in ray-traced games. It delivers a slightly higher average with similar 1% lows. The RTX 4090 offers the best performance at 1440p, with the RX 7900 XTX/XT following closely. The Radeons continue to struggle with comparatively worse lows, sullying an otherwise remarkable showing. The RTX 4080 Super is slower than the 7900 XT (on average) but delivers higher lows. Ultra HD or 4K is completely GPU-bound, or so you’d think. However, the GeForce RTX 4080 and 4090 are CPU-bound with a GPU-busy deviation of 26%. In contrast, the Radeon GPUs produce GPU-busy deviations of only 4-6%. Regardless, the RTX 4090 comes out on top with an average of 73 FPS, followed by the RX 7900 XTX (66 FPS) and the RTX 4080 Super (61 FPS). The 1% lows fail to show an improvement on the AMD cards, trailing their GeForce rivals by 14-23%. Dragon’s Dogma 2 plays and looks like an indie game with lots of visual artifacts and janky gameplay. While the average performance is decent, there’s plenty of micro-stuttering with random freezes. The GeForce cards, in particular, suffer from (some sort of) CPU or driver overhead that severely handicaps the average frame rates. The Radeons deliver higher averages but much worse lows. "
}