{
    "title": "Better AI Stock: AMD vs. Nvidia",
    "date": "3/9/2024",
    "url": "https://finance.yahoo.com/news/better-ai-stock-amd-vs-093500665.html",
    "text": "Whether you're a casual investor or trade professionally, you're likely aware of the boom in artificial intelligence (AI) that kicked off last year. The launch of OpenAI's ChatGPT reignited interest in the technology, leading countless tech companies to pivot their businesses toward the high-growth sector. As a result, the AI market is projected to expand at a compound annual growth rate of 37% through 2030, which will see it hit just under $2 trillion. The industry is expanding at a rapid pace, making it one of the best places to make a long-term investment. Two stocks currently leading the way in AI are Advanced Micro Devices (NASDAQ: AMD) and Nvidia (NASDAQ: NVDA), with their shares recently up 149% and 257% respectively year over year. As prominent chipmakers, these companies supply the hardware necessary to train and run AI models. Their stocks could soar further in the coming years as the market develops. So, let's compare these companies' businesses and determine whether AMD or Nvidia is the better AI stock this March. AMD was slightly overshadowed by Nvidia's head start in AI chips last year, as Nvidia seized an estimated 80% to 95% market share in AI graphics processing units (GPUs). However, the massive potential of the industry suggests AMD won't need to dethrone Nvidia to still see major gains from AI. So, despite spending years prioritizing its position in central processing units (CPUs), AMD has shifted its focus to developing its GPU technology and expanding in the budding AI market. Last December, the company unveiled its MI300X AI GPU. The chip was designed to compete directly with Nvidia's offerings and has already caught the attention of some of tech's most prominent players. In November 2023, Microsoft announced that Azure would become the first cloud platform to use AMD's MI300X to optimize AI capabilities. Microsoft has a close partnership with ChatGPT developer OpenAI, making the company a powerful ally for AMD. An agreement with Meta -- which aims to use the new chips as well -- also helps AMD's future in AI look bright. Moreover, AMD isn't banking solely on stealing market share from Nvidia in GPUs. AMD seeks to lead its own space within AI by investing in AI-powered PCs. According to research firm IDC, PC shipments are projected to see a major boost this year, with AI integration serving as a key catalyst. And a Canalys report predicts that 60% of all PCs shipped in 2027 will be AI-enabled. Nvidia captivated Wall Street over the last year as its chips became the gold standard for AI developers everywhere. Soaring demand for AI GPUs enabled Nvidia's revenue to skyrocket. In the fourth quarter of 2024 (ended in January), the company's revenue increased by 265% year over year to $22 billion. Meanwhile, operating income jumped 983% to nearly $14 billion. The monster growth was primarily from a 409% increase in data center revenue, reflecting increased chip sales. In addition to soaring earnings, Nvidia's free cash flow is up 430% in the last year to more than $27 billion, significantly higher than AMD's $1 billion. So, despite new GPU releases from its competitors, Nvidia's head start in AI potentially pushed it further ahead with greater cash reserves to continue investing in its technology and retain its market supremacy. Nvidia has a powerful position in AI that looks unlikely to dissipate anytime soon. Its market cap surpassed $2 trillion this year thanks to its massive success in AI. AMD's market cap is significantly lower at about $327 billion. However, that could mean AMD has more room to run over the long term as the company is still in the early stages of its AI journey. AI can potentially boost countless industries, from cloud computing to consumer products, autonomous vehicles, video games, and more. With so many sectors prioritizing generative technology, chip demand is only likely to continue rising for the foreseeable future. As a result, AMD and Nvidia are two exciting options to invest in AI. However, earnings per share (EPS) estimates indicate AMD might have more growth potential in the near term. This chart shows AMD's earnings could hit just over $7 per share in the next two fiscal years, while Nvidia's may reach $34 per share. On the surface, Nvidia looks like the clear winner. However, multiplying these figures by the companies' forward price-to-earnings ratios (AMD's 56 and Nvidia's 35) yields stock prices of $403 for AMD and $1,197 for Nvidia. Considering their current positions, these projections would see AMD's stock rise 99% and Nvidia's 41% by fiscal 2026. Alongside heavy investment in AI and potentially more room to run, AMD is the better AI stock over Nvidia and a screaming buy this month. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Advanced Micro Devices made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks *Stock Advisor returns as of March 8, 2024 Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool has a disclosure policy. Better AI Stock: AMD vs. Nvidia was originally published by The Motley Fool Related Quotes "
}