{
    "title": "AMD might leverage AI to turn FSR into a true DLSS competitor",
    "date": "3/4/2024",
    "url": "https://www.xda-developers.com/amd-ai-fsr-dlss-competitor/",
    "text": "The AI wars rage on. In every niche of tech, companies are using artificial intelligence to compete with one another. However, the fight is particularly strong amongst the big GPU names. Each side has its own technologies which are becoming enhanced with AI, and there's a big battle to see who can apply AI for the best results. And while AMD has been lagging in the graphical upscaling department, the company might be working to enhance your games using the power of artificial intelligence. You can hear about AMD's intentions in a recent interview with its CTO, Mark Papermaster. In it, Mark hints that AMD is planning to add AI to their upscaling technology. If this is the first time you've heard of it, upscaling is a special kind of technology designed to improve people's framerates in games. The idea is that the game renders at a lower resolution than what you set, after which the upscaling technology kicks in and refines the image so it looks like what you're expecting. That way, your PC struggles less to render your graphics, and you don't notice a dip in quality. AMD's hint toward AI upscaling is huge news, because Nvidia and AMD have been in an upscaling battle for a little while now. Nvidia has its Deep Learning Super Sampling (DLSS) technology, while AMD has its FidelityFX Super Resolution (FSR). For a little while now, both of them have used machine learning to upscale your games; however, Nvidia began to take the lead when it implemented modern-day AI technologies into DLSS. In doing so, AMD may be able to bring its technologies up to par with Nvidia's. Right now, people are experiencing a noticeable difference between DLSS and FSR, and chances are that AI is the reason why Nvidia's tech keeps pulling ahead. And even though AI-based solutions are best combined with a dedicated AI processor, we're seeing more and more AI PCs equipped with their own NPU - the AI version of a CPU or GPU. As such, if AMD does decide to take the plunge, Nvidia may not find itself to be the king of upscaling anymore.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Simon is a Computer Science BSc graduate who has been writing about technology since 2014, and using Windows machines since 3.1. After working for an indie game studio and acting as the family's go-to technician for all computer issues, he found his passion for writing and decided to use his skill set to write about all things tech. AMD made significant improvements to its APU lineup with the Ryzen 5 8600G. But is it good enough to beat the Ryzen 5 7600? If you're looking to add one of AMD's Ryzen 7000 to your system without spending a ton, check out our collection of the best budget AM5 motherboards. Some AI integration we never thought would be possible a few years ago. Nvidia, in collaboration with HuggingFace and ServiceNow, has released StarCoder2, and it will help you generate code. I wasn't impressed at first, but Copilot is beginning to grow on me. If you want to use ChatGPT to master your Microsoft Excel or Google Sheets, then we have the perfect guide for you. "
}