{
    "title": "AMD Ryzen 5 PRO 6650HS vs AMD Ryzen 5 7540U vs AMD Ryzen 5 PRO 7640U",
    "date": "3/27/2024",
    "url": "https://www.notebookcheck.net/R5-PRO-6650HS-vs-R5-7540U-vs-R5-PRO-7640U_14380_15027_15060.247596.0.html",
    "text": "The AMD Ryzen 5 PRO 6650HS is a processor for big (workstation) laptops based of the Rembrandt generation. The R5 6650HS integrates six of the eight cores based on the Zen 3+ microarchitecture. They are clocked at 3.3 (guaranteed base clock) to 4.5 GHz (Turbo) and support SMT / Hyperthreading (12 threads). The chip is manufactured on the modern 6 nm TSMC process. The HS variant offers a 10 W reduced TDP and therefore a lower sustained performance than the H version. The 6650HS is the professional version of the consumer R5 6600HS with additional management features and the Microsoft Pluton Security processor. \nThe new Zen 3+ is a refresh of the Zen 3 architecture and should not offer a lot of changes. The chip itself however, offers a lot of new features, like support for USB 4 (40 Gbps), PCI-E Gen 4, DDR5-4800MT/s or LPDDR5-6400MT/s, WiFi 6E, Bluetooth LE 5.2, DisplayPort 2, and AV1 decode. \nIn the 6000 series, AMD finally switched to the current RDNA 2 graphics architecture for the iGPU. The 6650HS only offers the slower Radeon 660M with 6 of the 12 CUs enabled and 1.9 GHz max. clock rate. \nPerformance \nWhile we have not tested a single system built around the 6650HS as of August 2023, we have tested at least one system featuring the 6600HS, a chip with very similar specs (6 cores, 12 threads, up to 4.5 GHz, Zen 3+). Based on that, expect the 6650HS to be about as fast as the Ryzen 5 5600H, the Ryzen 7 5800U and also the Core i7-1260P, as far as multi-thread benchmark scores are concerned. \nYour mileage may vary dependingon how high the CPU power limits are and how competent the cooling solution of your system is. \nPower consumption \nThis Ryzen 5 has a default TDP (also known as the long-term power limit) of 35 W. Which is way too high to allow it to become a heart of a passively cooled tablet, laptop, mini-PC. \nThe APU is built with TSMC's 6 nm process for great, as of late 2022, energy efficiency. The AMD Ryzen 5 PRO 6650HS is a processor for big (workstation) laptops based of the Rembrandt generation. The R5 6650HS integrates six of the eight cores based on the Zen 3+ microarchitecture. They are clocked at 3.3 (guaranteed base clock) to 4.5 GHz (Turbo) and support SMT / Hyperthreading (12 threads). The chip is manufactured on the modern 6 nm TSMC process. The HS variant offers a 10 W reduced TDP and therefore a lower sustained performance than the H version. The 6650HS is the professional version of the consumer R5 6600HS with additional management features and the Microsoft Pluton Security processor. The new Zen 3+ is a refresh of the Zen 3 architecture and should not offer a lot of changes. The chip itself however, offers a lot of new features, like support for USB 4 (40 Gbps), PCI-E Gen 4, DDR5-4800MT/s or LPDDR5-6400MT/s, WiFi 6E, Bluetooth LE 5.2, DisplayPort 2, and AV1 decode. In the 6000 series, AMD finally switched to the current RDNA 2 graphics architecture for the iGPU. The 6650HS only offers the slower Radeon 660M with 6 of the 12 CUs enabled and 1.9 GHz max. clock rate. Performance While we have not tested a single system built around the 6650HS as of August 2023, we have tested at least one system featuring the 6600HS, a chip with very similar specs (6 cores, 12 threads, up to 4.5 GHz, Zen 3+). Based on that, expect the 6650HS to be about as fast as the Ryzen 5 5600H, the Ryzen 7 5800U and also the Core i7-1260P, as far as multi-thread benchmark scores are concerned. Your mileage may vary dependingon how high the CPU power limits are and how competent the cooling solution of your system is. Power consumption This Ryzen 5 has a default TDP (also known as the long-term power limit) of 35 W. Which is way too high to allow it to become a heart of a passively cooled tablet, laptop, mini-PC. The APU is built with TSMC's 6 nm process for great, as of late 2022, energy efficiency. The AMD Ryzen 5 7540U is a fast mid-range laptop processor of the Phoenix series. It offers 6 cores (hexa core) based on the Zen 4 architecture that supports hyperthreading (12 threads). The cores clock from 3.2 (base) up to 4.9 GHz (single core boost). The processor includes 6 MB L2 cache and 16 MB L3 cache. \nThanks to the new Zen 4 architecture and higher clock speeds, the R5 7540U is clearly faster than the old Ryzen 5 6600U (Zen 3, 6 cores, 4.5 GHz). Compared to the similar 7640U, the 7540U offers a lower base clock and a slower iGPU. \nThe chip integrates a modern and fasts RDNA 3 graphics card (iGPU) called Radeon 740M with 4 of the 12 CUs and 2.5 GHz clock speed. Furthermore, the Phoenix series include a video engine with AV1 de- and encoding and a dual-channel DDR5-5600 / LPDDR5x-7500 memory controller (with ECC support). The new Xilinx FPGA based XDNA AI accelerator (Ryzen AI) is not included in the 7540U. The connectivity features includes 2 possible USB 4 (40 Gbps) ports and 20 PCIe 4.0 lanes for a GPU and SSDs. \nThe Phoenix series uses a single monolithic design (unlike the chiplet design of the 7045HX series) and is manufactured in the modern 4nm process at TSMC. The TDP can be configured between 15 and 30 Watt (28 Watt default). The AMD Ryzen 5 7540U is a fast mid-range laptop processor of the Phoenix series. It offers 6 cores (hexa core) based on the Zen 4 architecture that supports hyperthreading (12 threads). The cores clock from 3.2 (base) up to 4.9 GHz (single core boost). The processor includes 6 MB L2 cache and 16 MB L3 cache. Thanks to the new Zen 4 architecture and higher clock speeds, the R5 7540U is clearly faster than the old Ryzen 5 6600U (Zen 3, 6 cores, 4.5 GHz). Compared to the similar 7640U, the 7540U offers a lower base clock and a slower iGPU. The chip integrates a modern and fasts RDNA 3 graphics card (iGPU) called Radeon 740M with 4 of the 12 CUs and 2.5 GHz clock speed. Furthermore, the Phoenix series include a video engine with AV1 de- and encoding and a dual-channel DDR5-5600 / LPDDR5x-7500 memory controller (with ECC support). The new Xilinx FPGA based XDNA AI accelerator (Ryzen AI) is not included in the 7540U. The connectivity features includes 2 possible USB 4 (40 Gbps) ports and 20 PCIe 4.0 lanes for a GPU and SSDs. The Phoenix series uses a single monolithic design (unlike the chiplet design of the 7045HX series) and is manufactured in the modern 4nm process at TSMC. The TDP can be configured between 15 and 30 Watt (28 Watt default). The AMD Ryzen 5 PRO 7640U is a fast mid-range laptop processor of the Phoenix series. It offers 6 cores (hexa core) based on the Zen 4 architecture that supports hyperthreading (12 threads). The cores clock from 3.5 (base) up to 4.9 GHz (single core boost). The processor includes 6 MB L2 cache and 16 MB L3 cache. \nCompared to the consumer Ryzen 5 7640U, the PRO models offer additional security, manageability, and reliability features designed for professional users and workstation environments. \nThanks to the new Zen 4 architecture and higher clock speeds, the R5 PRO 7640U is clearly faster than the old Ryzen 5 6600U (Zen 3, 6 cores, 4.5 GHz). Compared to the similar 7640HS, the U-series offers a lower TDP and slightly lower core clocks. \nThe chip integrates a modern and fasts RDNA 3 graphics card (iGPU) called Radeon 760M with 8 of the 12 CUs and 2.6 GHz clock speed. Furthermore, the Phoenix series include a video engine with AV1 de- and encoding, a new Xilinx FPGA based XDNA AI accelerator (Ryzen AI) that should be faster than the AI engine in the Apple M2 SOC and a dual-channel DDR5-5600 / LPDDR5x-7500 memory controller (with ECC support). The connectivity features includes 2 possible USB 4 (40 Gbps) ports and 20 PCIe 4.0 lanes for a GPU and SSDs. \nThe Phoenix series uses a single monolithic design (unlike the chiplet design of the 7045HX series) and is manufactured in the modern 4nm process at TSMC. The TDP can be configured between 35 and 45 Watt. The AMD Ryzen 5 PRO 7640U is a fast mid-range laptop processor of the Phoenix series. It offers 6 cores (hexa core) based on the Zen 4 architecture that supports hyperthreading (12 threads). The cores clock from 3.5 (base) up to 4.9 GHz (single core boost). The processor includes 6 MB L2 cache and 16 MB L3 cache. Compared to the consumer Ryzen 5 7640U, the PRO models offer additional security, manageability, and reliability features designed for professional users and workstation environments. Thanks to the new Zen 4 architecture and higher clock speeds, the R5 PRO 7640U is clearly faster than the old Ryzen 5 6600U (Zen 3, 6 cores, 4.5 GHz). Compared to the similar 7640HS, the U-series offers a lower TDP and slightly lower core clocks. The chip integrates a modern and fasts RDNA 3 graphics card (iGPU) called Radeon 760M with 8 of the 12 CUs and 2.6 GHz clock speed. Furthermore, the Phoenix series include a video engine with AV1 de- and encoding, a new Xilinx FPGA based XDNA AI accelerator (Ryzen AI) that should be faster than the AI engine in the Apple M2 SOC and a dual-channel DDR5-5600 / LPDDR5x-7500 memory controller (with ECC support). The connectivity features includes 2 possible USB 4 (40 Gbps) ports and 20 PCIe 4.0 lanes for a GPU and SSDs. The Phoenix series uses a single monolithic design (unlike the chiplet design of the 7045HX series) and is manufactured in the modern 4nm process at TSMC. The TDP can be configured between 35 and 45 Watt. #0 checking url part for id 14380 +0s ... 0s #1 checking url part for id 15027 +0s ... 0s #2 checking url part for id 15060 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.034s ... 0.035s #6 did output specs +0s ... 0.035s #7 getting avg benchmarks for device 14380 +0.003s ... 0.038s #8 got single benchmarks 14380 +0s ... 0.038s #9 getting avg benchmarks for device 15027 +0.002s ... 0.041s #10 got single benchmarks 15027 +0s ... 0.041s #11 getting avg benchmarks for device 15060 +0.002s ... 0.044s #12 got single benchmarks 15060 +0s ... 0.044s #13 got avg benchmarks for devices +0s ... 0.044s #14 min, max, avg, median took s +0s ... 0.044s #15 return log +0s ... 0.044s "
}