{
    "title": "AMD CEO offers to help AI Startup that uses Radeon 7900 XTX GPUs — but will \nit backfire for Lisa Su as she ...",
    "date": "3/11/2024",
    "url": "https://www.techradar.com/pro/amd-ceo-offers-to-help-ai-startup-that-uses-radeon-7900-xtx-gpus-but-will-it-backfire-for-lisa-su-as-she-seemingly-supports-use-of-consumer-parts-in-enterprise-use-cases",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. tiny corp is unhappy with AMD and its AI acceleration toolkit bugs We’ve written previously about tinybox. The $15,000 AI server system is powered by AMD Radeon RX 7900 XTX graphics cards and can reportedly deliver 37% of Nvidia H100 compute performance. It seems however, that the creators of tinybox have run into problems with bugs affecting the Radeon-based platform. After parent company tiny corp posted several tweets expressing frustration with AMD’s AI acceleration toolkit – in which it cheekily tagged AMD rivals Nvidia and Intel – AMD’s CEO, Lisa Su, stepped in, saying her team was working to fix the issues. Unfortunately, the fixes weren’t good enough for tiny corp, which fired off another round of frustrated tweets, asking AMD to “fix their basic s*t” and suggesting the tech giant open source its firmware so that the tiny startup could do what AMD seemed incapable of - namely “fix their LLVM spilling bug and write a fuzzer for HSA”. If AMD open sources their firmware, I'll fix their LLVM spilling bug and write a fuzzer for HSA. Otherwise, it's not worth putting tons of effort into fixing bugs on a platform you don't own. https://t.co/c4I2So27YGMarch 5, 2024 After things got even more heated, Su tweeted “Thanks for the collaboration and feedback. We are all in to get you a good solution. Team is on it.” While that could be good news for tiny corp – time will tell – Su could well face a backlash for essentially stepping in to support the use of its consumer products in a server aimed at the enterprise. As jlake3 commented over on Tom’s Hardware, “tinybox is buying consumer cards instead of datacenter models, but seems to expect a datacenter SLA? They got revised firmware within 6 hours of the earliest linked tweet and a call with engineering the next day, which is more than I’d think a startup buying a bunch of gaming cards would qualify for when there are actual paying enterprise clients, and they appear to be having a public meltdown that AMD isn’t doing more for a startup with less than 100 servers built and none yet shipped (and expressly avoiding using pro GPUs).\" He also made another good point. \"As for Nvidia, their EULA forbids using GeForce products for datacenter CUDA applications, so they’d definitely not be dedicating anyone to talk to tinybox in this situation, except maybe a lawyer.\" Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. Samsung archrival plans construction of world's largest chip factory — at more than $90 billion, it will take more than 20 years to finish, so one wonders what other exciting tech will it produce This is what a single 256GB DDR5 memory module looks like — but you won't be able to fit this Micron RAM in your desktop or laptop and it will almost certainly cost more than $10,000 if you can buy it Microsoft's repair-friendly Surface puts other laptop makers on notice – and it's about time By Sead FadilpašićMarch 29, 2024 By Al GriffinMarch 29, 2024 By Cesar CadenasMarch 29, 2024 By Alex WhitelockMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}