{
    "title": "Nvidia Reportedly Wants Gaming Handheld To Dominate AMD Again",
    "date": "3/3/2024",
    "url": "https://tech4gamers.com/nvidia-gaming-handheld/",
    "text": "Nvidia Unhappy With AMD-Based Devices On Market! If Nvidia hopes to catch up to AMD and compete with the Intel handheld alternatives that are anticipated later this year, it is now or never for the company to return to the portable gaming industry. The Switch 2, which many believe will arrive in early 2025, is already expected to be based on Nvidia silicon. However, popular rivals, like the recently launched Steam Deck OLED, Asus ROG Ally, and more, are already saturating the market with AMD hardware. This may change in the future, however, with rumors suggesting Nvidia intends to return with a dedicated gaming handheld. Why it matters: Handheld gaming is still growing, and it holds the potential to rival home consoles in the future, as shown by the Nintendo Switch.  As per YouTuber Moore’s Law Is Dead, Nvidia is developing a handheld PC gaming device, stating that the company is serious about this push. Nvidia is serious about making more handheld devices with their graphics IP in them. -Moore’s Law is Dead The report states Nvidia does not enjoy AMD’s current dominance in the market and console gaming in general. According to the reports from the same source, PlayStation is also working on an AMD-based handheld. It seems Nvidia wants to make an early investment while this market is still expanding. Moore’s Law is Dead states that the company is now working with somebody on a premium gaming handheld. Although the identity of this partner is unknown, he speculates it might be Intel. While the company will already dominate this market through the Nintendo Switch 2 next year, Nintendo has always taken a conservative approach to hardware. Therefore, it’s encouraging to see that Nvidia is considering a handheld that can go toe to toe with the best. It is also important to note that this isn’t its first experiment with the market. Previously, the Nvidia Shield served as a streaming device in addition to a portable game console. It was similar to the Logitech G Cloud but ultimately failed against competition in the industry.  Latest Updates  Today, Nvidia is also in a different position. Having dominated AI sales and becoming one of the world’s largest companies, it has all the resources needed to make the best gaming handheld. Even if it does not launch a dedicated handheld of its own, another company looking to enter the market could use Nvidia hardware for major advantages over the competition in areas like AI, ray-tracing, and more. Featured Image Credit: Shutterstock [News Reporter] Malik Usman is student of Computer Science focused on using his knowledge to produce detailed and informative articles covering the latest findings from the tech industry. His expertise allows him to cover subjects like processors, graphics cards, and more. In addition to the latest hardware, Malik can be found writing about the gaming industry from time to time. He is fond of games like God of War, and his work has been mentioned on websites like Whatculture, VG247, IGN, and Eurogamer. Subscribe to our newsletter Check your inbox or spam folder to confirm your subscription.  Subscribe to our newsletter Check your inbox or spam folder to confirm your subscription.  "
}