{
    "title": "AMD Ryzen 7 8700G vs 7800X3D: Which gaming CPU is best?",
    "date": "3/8/2024",
    "url": "https://www.xda-developers.com/amd-ryzen-7-8700g-vs-7800x3d/",
    "text": "Should you go for more cache or a better integrated GPU? AMD's Ryzen 7 8700G is an 8000-series Zen 4 processor with impressive integrated graphics. You won't need a discrete GPU to play all your favorite games. This CPU was designed with a discrete GPU in mind. The integrated graphics may be weaker, but it has an impressive amount of cache for smooth gaming performance. AMD launched the Ryzen 7 7800X3D as one of its gaming processors with a beefy cache to help it perform better in more demanding games. The more cache a processor has, the less it has to rely on system memory, which is slower than local cache. The AMD Ryzen 7 8700G is a whole different beast. Built on a similar platform, this processor has a \"normal\" amount of cache but has an uprated integrated GPU that's capable of handling tasks usually sent to a discrete video card. We've tested both processors extensively and found picking the best CPU out of the two depends on what you want to do with the processor and if you already have a dedicated GPU. If you're building a system from scratch and want to save the most money, the AMD Ryzen 7 8700G makes the most sense and will happily provide solid gaming experiences at 1080p and 1440p. The Ryzen 7 7800X3D comes into play when you've already got a discrete graphics card. It's more expensive but will provide a considerable performance boost over the AMD Ryzen 7 8700G. The AMD Ryzen 7 8700G has an MSRP of $329 whereas the AMD Ryzen 7 7800X3D costs considerably more at $449. Both processors are available now and work with the AM5 socket and the latest AMD motherboards. This platform is still in its infancy and AMD has a good track record of using the same socket for many chip generations with AM4 supporting all Ryzen processors up to the 5000 series. Although both chips are based on Zen 4 architecture, the newer AMD Ryzen 7 8700G is built using TSMC's 4 nm manufacturing process. There are 8 physical cores on the Ryzen 7 8700G and Ryzen 7 7800X3D. 16 threads are available for handling heavier workloads and the same 4.2 GHz base clock speed is present across the board. Where things differ is the boost clock speed with the Ryzen 7 8700G boosting slightly higher at 5.1 GHz (vs. 5.0 GHz) and having a lower TDP of just 65W. The AMD Ryzen 7 7800X3D may have a TDP of 120W, but it has a cache of 96 MB (vs. 24 MB) and full support for PCIe 5.0. It's difficult to compare the AMD Ryzen 7 8700G and Ryzen 7 7800X3D for gaming since both processors are designed for different applications. The former is capable of running the latest games without a GPU, producing solid results at 1080p and even 1440p with settings scaled back slightly. The Ryzen 7 7800X3D needs a GPU and thus we're unable to compare apples to pears here. Depending on which GPU you end up pairing this chip with, the results will differ greatly. An Nvidia GeForce RTX 4090 with the Ryzen 7 7800X3D will perform better than an AMD Radeon RX 7800 XT. If you were to compare the processors directly, the 8700G would win without a GPU. The tables would then turn with a discrete graphics card, allowing the Ryzen 7 7800X3D to comfortably take the lead. It's a far more powerful processor and while it may not be able to boost as high and have the same number of threads, it's simply capable of powering through heavier tasks with better results. This is due to how the 8700G is designed and AMD had to cram the Radeon GPU on the same package so general computing performance had to take a slight hit. The AMD Ryzen 7 8700G should only be picked if you don't have a GPU or have an older graphics card that isn't up to the task with modern games. The main selling point of this processor is the integrated graphics, which becomes irrelevant as soon as a discrete GPU is connected to the primary PCI slot. If you want to save money and use less power, producing less heat in the process, the Ryzen 7 8700G is a fantastic gaming chip with excellent graphics processing capabilities. Just bear in mind the lack of any PCIe 5.0 support for the latest storage drives. The AMD Ryzen 7 8700G is the most powerful APU AMD has released to date, offering the mighty Radeon 780M integrated GPU for butter-smooth 1080p gaming. Those with a discrete GPU should buy the AMD Ryzen 7 7800X3D. It's designed for use with a graphics card and the exceptional amount of cache will allow this chip to perform well under heavier loads. Whether you're into first-person shooters or more complex simulation games, the 7800X3D will be able to power through with strong specifications, allowing the GPU to handle all the graphics work. There's also PCIe 5.0 support! If you don't plan on buying a separate GPU, this CPU will struggle against the 8700G. AMD's Ryzen 7 7800X3D CPU is the company's cheapest model with 3D V-Cache and can deliver gaming performance on par or even better than that of the Ryzen 9 7950X.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Richard is a Senior Editor at Valnet and has been covering the technology industry for almost two decades. He's been building PCs since young and when not creating content, you can often find him inside a chassis somewhere. Some AI integration we never thought would be possible a few years ago. If you use two PCs as part of the same desk setup, a KVM switch could be the way to simplify your workstation. Recent updates to the Microsoft 365 Roadmap page suggest Microsoft is working on collaboration features. Nvidia power wherever you go. Save on Anker's impressive 150W charger that can really do it all. I recently reviewed the Ayaneo AM02 mini PC, and I turned it into a home gaming console. "
}