{
    "title": "AMD updates FreeSync minimum requirements — 144Hz or higher refresh rate \nneeded for 1080p and 1440p displays",
    "date": "3/7/2024",
    "url": "https://www.tomshardware.com/monitors/amd-updates-freesync-minimum-requirements-144hz-or-higher-refresh-rate-needed-for-1080p-and-1440p-displays",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. AMD's new FreeSync requirements will reduce the amount of garbage gaming monitors that end up getting FreeSync support. After nine years, AMD is increasing its variable refresh rate Freesync technology requirements to account for the significant adoption of triple-digit refresh-rate panels in the modern monitor market. The new requirements now enforce a 144Hz refresh rate or greater on all 1080p or 1440p gaming monitors. AMD decided to update its FreeSync requirements due to the enormous shift in mainstream gaming monitor performance from 2015 to 2024. When FreeSync was first introduced in 2015, 60Hz was considered the norm for mainstream gaming, with relatively few monitors sporting triple-digit refresh rates such as 120Hz or 144Hz. But now, 144Hz is one of the most common and affordable refresh rates you can buy today. To recap, AMD's previous FreeSync requirements did not have a refresh rate requirement for the lowest FreeSync tier. The only requirements were low-flicker and low-latency support. AMD's mid-range Premium FreeSync tier was where a refresh rate limit was enforced, that being 120Hz at 1080p. AMD's new FreeSync requirements now incorporate a minimum refresh rate limit across all three FreeSync Tiers depending on the horizontal resolution. For AMD's baseline FreeSync tier, AMD is enforcing a 144Hz refresh rate or greater for displays that have a horizontal resolution of less than 3440 pixels. For displays that exceed that resolution limit, a refresh rate limit is not enforced. This means that 1920x1080 and 2560x1440 gaming monitors must have a 144Hz refresh rate or greater to qualify for AMD's baseline FreeSync tier. High-resolution displays, such as 3840x2160 displays, can bypass this limit entirely. AMD's mid-range Premium FreeSync tier takes these resolution and refresh rate requirements up a notch. Displays that have a horizontal resolution of less than 3440 pixels will need a 200Hz refresh rate or greater to qualify for AMD's FreeSync Premium plan. Alternatively, any display with a horizontal resolution of 3440 pixels or greater will need a 120Hz refresh rate or greater can qualify for AMD's Premium tier as well. This means that 1920x1080 and 2560x1440 monitors will need a 200Hz refresh rate to qualify for AMD's Premium tier. It also means that high-resolution displays such as 3440x1440 ultrawide or 4K monitors will need a 120Hz refresh rate or greater to be eligible for AMD's Premium tier. AMD's flagship FreeSync Premium Pro tier takes on the exact same resolution and refresh rate requirements as the Premium tier but requires HDR support on top of it. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. AMD's new requirements are very different from its old requirements, but it is a very appropriate change for the times that we live in. The new refresh rate requirements should prevent bottom-of-the-barrel 60-75Hz gaming monitors from getting FreeSync support, and improve the overall monitor quality users can expect out of FreeSync-certified displays going forward. Aaron Klotz is a freelance writer for Tom’s Hardware US, covering news topics related to computer hardware such as CPUs, and graphics cards. Monoprice 44394 40-inch Crystal Pro 144 Hz gaming monitor review: Jumbo size at a surprisingly low price Best Ultrawide Gaming Monitors 2024 OpenAI and Microsoft reportedly planning  $100 billion datacenter project for an AI supercomputer By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}