{
    "title": "This Red-Hot Artificial Intelligence (AI) Company Just Joined Nvidia and \nAMD in the S&P 500: Is It Time to Buy?",
    "date": "3/10/2024",
    "url": "https://www.fool.com/investing/2024/03/10/this-red-hot-artificial-intelligence-ai-company-ju/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More If you've been investing in artificial intelligence (AI) stocks, then you're doubtless familiar with Nvidia. The chipmaker develops powerful graphics processing units (GPUs) that can be used to power accelerated computing, machine learning, and a variety of generative AI applications. Another company that has been garnering much enthusiasm from investors is Nvidia's cohort, Super Micro Computing (SMCI -1.30%). Unlike Nvidia, Supermicro does not design or manufacture chips. Instead, it designs integrated systems for IT architecture, including storage clusters and server racks. The boom in demand for GPUs over the last year has served as a tailwind for Supermicro -- its revenue is currently growing by over 100% annually. But that's not all -- the good news just keeps on rolling in for Supermicro. After trading hours on Friday, news broke that Supermicro will be joining the S&P 500. Shares surged 12% post-market and are now nearing all-time highs. While this is quite an impressive achievement, does this make Supermicro stock a buy? While estimates vary, some Wall Street research suggests that Nvidia in 2023 held 98% of the data center GPU market. Demand for its A100 and H100 GPUs is extraordinarily high. Given Supermicro's close ties to Nvidia, it's not surprising to see that it, too, experienced steep sales growth in recent quarters. SMCI Revenue (Quarterly) data by YCharts. Indeed, in light of its critical role in integrated data center services, George Tsilis of TD Ameritrade has labeled Supermicro a \"stealth Nvidia.\" However, there is much more to the investment case than just its top-line growth. Image Source: Getty Images For its fiscal 2024 second quarter, which ended Dec. 31, Supermicro reported a gross margin of 15.4%. That was a decline from both the prior quarter and the same period in the prior year. Moreover, the company's current margin profile is in line with its 10-year average -- not growing in tandem with revenue. SMCI Gross Profit Margin (Quarterly) data by YCharts. Management attributed margin deterioration to more aggressive investments in IT design and market share acquisition. This approach should be OK for now. But in the long run, Supermicro needs to demonstrate that it can expand its margins and cash flows. Otherwise, a liquidity crunch could arise. One threat that could continue putting strain on Supermicro's margin profile is competition in the semiconductor space. Other AI leaders, including Microsoft and Amazon, are entering the AI chip market. Nvidia's near-total dominance in the market could start eroding sooner than later. It would behoove Supermicro to foster relationships with other chip designers, as its growth cannot hinge solely on demand for Nvidia's products in the long run. One of the things I've warned about regarding Supermicro is that the stock often trades in tandem with Nvidia. While this may seem like it makes sense, it could eventually become dangerous. They are entirely different businesses. Moreover, Nvidia's top line is growing at much faster rates than Supermicro's -- and the chipmaker is far more profitable. Supermicro as a business is not really comparable to Nvidia or Advanced Micro Devices. Rather, it competes with the likes of Dell Technologies, Hewlett Packard Enterprise, Lenovo, and even IBM to some degree. SMCI PS Ratio data by YCharts. At a price-to-sales ratio of 5.6, Supermicro is trading at a noticeable premium to that of its peers. This is not to say that Supermicro is a poor investment choice, per se. Many investors have made a lot of money from the stock over the last year. But that doesn't mean you should follow the crowd at this point. Given Supermicro's pending addition to the S&P 500 on March 18 (when S&P Global conducts its standard quarterly rebalance), I suspect the company will now get much more attention from institutional investors. This would be a good thing for shareholders in the long run, as a more diverse set of opinions will enter the discussion around Supermicro and its long-term prospects. I think it's going to take years to get a concrete idea of which companies will emerge as long-term winners in artificial intelligence. For this reason, I think a prudent strategy would be to keep an eye on Supermicro's operating performance and see if the company can maintain its momentum. But given the activity fueling its shares higher by the day, I think I'd wait this one out for now. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Adam Spatacco has positions in Amazon, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, Microsoft, and Nvidia. The Motley Fool recommends International Business Machines and Super Micro Computer and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}