{
    "title": "AMD vs. Intel: the rivalry has never been more fierce",
    "date": "3/12/2024",
    "url": "https://www.digitaltrends.com/computing/amd-vs-intel/",
    "text": "If you’re building your own PC, there’s plenty of criteria to consider when molding your machine. What operating system do you plan on using? What graphics card will be best for gaming? And where exactly can one buy all these components? There’s a lot to think about, but one important decision you can’t forget is whether you’ll be using an AMD or Intel processor for your new machine. A war of chips and cores that shows no sign of stopping, the age-old battle of AMD vs Intel is a classic competition, but is one processor brand better than the other? That’s where we come in. Between AMD’s Ryzen 7000 CPUs and Intel’s 14th-generation Meteor Lake and Raptor Lake Refresh processors, there are plenty of great features to look at. So let’s get this side-by-side comparison started! AMD and Intel are two of the most iconic names in PC building, and for good reason. For decades, they’ve been duking it out to offer the fastest, most capable, and most feature-rich processors for gamers, casual web browsers, and professionals alike. They’ve gone back and forth a few times over the years, with AMD launching groundbreaking designs and Intel responding with revolutionary chips of its own, but where Intel maintained a strong grasp on flagship performance between 2005 and 2015, AMD really turned things around with the launch of its Ryzen processors. Debuting in 2017, these chips brought the fight to Intel in a more dramatic fashion than AMD had managed in over a decade, and ever since then, the competition has only increased. Today, Intel and AMD are neck and neck with their latest designs, offering the greatest CPU performance we’ve ever seen in mainstream components. With more cores, higher clocks, and new features, the best processors from Intel and AMD are something to get very excited about. AMD and Intel both have wide ranges of processors that are all well worth considering when it comes to your next upgrade. The latest mainstream models are AMD’s Ryzen 7000 and Intel’s 14th-generation Raptor Lake. These processors offer up to 24 cores, clock speeds that have finally reached 6GHz, and more cache than even some of the fastest CPUs of previous generations could dream of. They’re not dramatically faster than the previous, 13th-generation, though, keeping Intel’s last-gen parts still very relevant. Here are all the latest mainstream CPUs from AMD and Intel: AMD also has a new limited-generation Ryzen 8000 APUs, which offer the same Zen 4 architecture as the Ryzen 7000 series but with more onboard graphics cores. They’re designed for all-in-one gaming, but their processor performance is notably weaker. AMD and Intel also offer credible options with their last-generation Ryzen 5000 and 12th-gen Alder Lake, although those aren’t as fast and don’t support all of the latest features. Both also have very cheap budget options that can cost as little as $50, but they’re only recommendable for those building the most lightweight of PCs. AMD also offers a unique offshoot of its main processors designed specifically for gaming, known as 3D V-Cache CPUs. These include the 7950X3D and 7800X3D. These processors have additional cache bolted on to one of the core complex dies inside the chip, giving them a big boost in gaming power. It does mean lowering clock speeds, though, which impacts productivity performance in turn. Intel and AMD have excellent processors for gaming and productivity tasks like video editing and transcoding. While you will find the best bang for your buck around the midrange of both camps (Intel’s Core i5-14600K and AMD’s Ryzen 7700X are particular standouts), the flagship CPUs from both AMD and Intel offer the best performance in gaming and more demanding multithreaded workloads. The Intel Core i9-14900K has 24 cores (8 + 16) and supports up to 32 threads, while the best AMD CPU uses a more traditional 16-core and 32-thread layout — though with additional cache in the gaming X3D CPUs. Both chip lines are neck and neck in demanding games and trade blows in workplace applications. Where more full cores can be leveraged, the 14900K and 13900K steal the top spot, while applications that rely on more powerful individual cores lean toward AMD. You don’t need to buy the best to get a great CPU for gaming or work, though. At a more affordable price, Intel’s Core i5-13600K and 14600K are some of the best bang for the buck CPUs of their generations, offering amazing gaming and productivity performance for a much lower price. AMD can compete on performance, but its 7600X falls behind, and the 7700X is more expensive, so Intel steals the value in the midrange for now. If you’re focused mainly on gaming, AMD’s 3D V-Cache processors are arguably still the best of the bunch. You can see how they perform in our Ryzen 7 7800X3D review and Ryzen 9 7950X3D review. There are also older-generation CPUs worth considering, too. AMD’s Ryzen 5000 series are still very capable processors, with its 5800X3D being amazingly competitive with even the latest and greatest in games. It is a dead end for upgrades, though, as the Ryzen 7000 needs a whole new motherboard and memory configuration. The Intel 12th-generation CPUs are great picks, too, with the 12600K being another great standout in the midrange and a clear upgrade path to the 13th or 14th generation when you want it. Both companies also offer extensive ranges of budget CPUs, though you’ll be stuck with the previous generation for now. On Intel’s side, there’s the excellent quad-core Core i3-12100F for around $100, while AMD’s six-core Ryzen 5 5500 is about $120 and offers comparable performance in games. Intel is probably your best option if you build a cheap system with no discrete graphics. Although AMD’s new Ryzen 7000 CPUs have onboard graphics and AMD’s previous-generation APUs are relatively capable, they aren’t as affordable. You’d spend $130 on a Ryzen 5 5600G or about $100 on an Intel Core i3-12100. If you want to use your PC for heavy video editing at high resolutions or perform intensive video transcoding or CAD work, you need heaps of processing power across plenty of cores. The best mainstream CPUs are great options for that, but if you need even more than the 24 cores of the 14900K, you might want to consider a high-end desktop (HEDT) CPU. Although Intel does have HEDT CPUs, like the 18-core Core i9-10980XE, they’re all severely outdated and easily beaten by the latest high-end mainstream CPUs. Instead, if you need extra cores and CPU power, AMD’s Threadripper Pro range of Ryzen 7000 CPUs is your best bet. AMD’s Threadripper CPUs offer 24, 32, 64, and even 96 cores with support for double that number of simultaneous threads, all while maintaining clock speeds as high as 5.1GHz. If your software can make use of all those extra cores, AMD’s Threadripper CPUs offer unparalleled performance outside of obscenely expensive server CPUs, easily outstripping the Intel competition. They also support a greater number of PCI-Express lanes — 144 versus just 44 on the Intel alternatives — making them more suited to larger storage arrays. You’ll pay up to $10,000 for the 96-core 7995WX, but if you can accelerate your work and, therefore, earn more money by using one of these CPUs, it could be well worth it. You’ll get 64 cores for half that, though, so make sure your application can use whatever core count you’re considering. The laptop market is a different story. Most notebooks you’ll find are based on an Intel processor of various generations and integrated graphics, but AMD CPUs are growing more common, and the latest Ryzen 6000 and 7000 mobile CPUs offer impressive performance and efficiency. Right now, Intel’s latest laptop CPUs are mostly based on its Raptor Lake generation, though some 14th-generation laptops are making their way into the market, marked by the change in branding to Core Ultra. In the past, existing models came in four flavors: low-power U, middle-power P, and high-power H and HX models. The P-series has been removed, with the H-series ranging from a base power of 28 watts up to 45 watts. Generally speaking, the more power, the faster the CPU, but there are some H and HX CPUs with fewer cores than others, so performance will depend on the tasks you are throwing their way as much as the CPUs themselves. Meteor Lake mixes things up with the new naming scheme, though, with Intel even dropping a video to help explain it: Ryzen mobile CPUs come in different flavors, just like Intel’s: Typically, you’ll find U- and P-type CPUs in lighter, thinner laptops focusing on good battery life, decent integrated graphics, and overall satisfactory performance. H and HX CPUs are primarily for gaming and workstation laptops, and they’ll usually be paired with a powerful AMD or Nvidia GPU. AMD’s Ryzen 7000 chips are worthy competitors, though. As you can read in our Asus ROG Strix Scar 17 review, they give Intel a tough fight and continue to do so today. They tend to be more efficient, too, so they feature in laptops with longer battery life. The next generation hasn’t been announced yet, though, as the Ryzen 8040 remains more of a misnomer than a true next step forward. Both AMD and Intel offer credible performance for work and play, and there are many more considerations to make when buying a laptop than the CPU, so looking at individual model reviews is a must. For everyday web browsing, watching Netflix, and answering emails, Intel and AMD CPUs will give you excellent performance right out of the box. There are certain tasks, though, where one company’s options perform better than the others. If you’re looking to work with your processor performing intensive multithreaded tasks like video editing or transcoding or heavy multitasking activities with tons of browser tabs open, Intel’s laptop CPUs are the fastest, but AMD’s are close behind and often offer better battery life. On desktop, it’s a toss-up, with both AMD and Intel delivering incredible multithreaded performance. You’ll get more bang for your buck with Intel’s midrange options, but at the top end, either camp is great, and Intel’s CPUs are typically far more power-hungry, raising energy bills and temperatures in turn. If you’re looking to game on your desktop, AMD’s Ryzen 7800X3D is the king of the hill, offering flagship gaming performance at an affordable price and incredible efficiency. The 7950X3D is worth considering if you use your gaming machine for work too, while Intel’s top 14th and 13th generation processors are better if you predominantly work with your PC — just be prepared for a high power draw. If you’re still unsure which chip is best for you, check out our guide on buying a CPU for more help. Alternatively, look forward to the next generations of chips later in 2024. We have Zen 5 and Arrow Lake just over the horizon. AMD makes some of the best processors, but this one is most likely not one of them. According to a video review of the recently released Ryzen 7 5700, the CPU is not only a letdown -- it's downright misleading. Compared to previous non-X Ryzen processors, the 5700 appears to be significantly cutdown, which affects its performance in a big way. Historically, AMD's non-X Ryzen CPUs were pretty much the same as their X counterparts, but with slightly lower clock speeds. Take the Ryzen 5 5600 and the Ryzen 5 5600X, for example. Both chips have six cores and 12 threads, as well as 32MB of cache, but the Ryzen 5 5600 has a clock speed of 4.4GHz, while the 5600X hits 4.6GHz. As a result, many chose the non-X part due to it being slightly cheaper while not being a major downgrade. AMD Zen 5 is the next-generation Ryzen CPU architecture for Team Red and is slated for a launch sometime in 2024. We've been hearing tantalizing rumors for a while now and promises of big leaps in performance. In short, Zen 5 could be very exciting indeed. We don't have all the details, but what we're hearing is very promising. Here's what we know about Zen 5 so far.\nZen 5 release date and availability\nAMD confirmed in January 2024 that it was on track to launch Zen 5 sometime in the \"second half of the year.\" Considering the launch of Zen 4 was in September 2022, we would expect to see Zen 5 desktop processors debut around the same timeframe, possibly with an announcement in the summer at Computex. Intel's next-generation Arrow Lake chips are said to be coming out later this year, but we don't know much about them just yet. However, a new leak shows us that two crucial features may be missing from the next-gen CPU lineup: hyperthreading and support for the AVX-512 extension. If Intel is ditching hyperthreading, it's not entirely unexpected, but it might make it trickier for even its best processors to beat AMD. Hyperthreading allows physical cores in Intel processors to perform two tasks simultaneously, improving efficiency and performance in multi-threaded applications. Intel first introduced it in 2002, but it hasn't used the technology in every generation of its CPUs between then and now. The tech was all but gone from client processors for many years following its launch, although it was still present in certain models. Since then, Intel has selectively implemented HT across its product stack. In the last few years, it became a staple, especially in midrange and high-end chips. Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}