{
    "title": "AMD could be cooking up a faster and cheaper version of the Ryzen 5000 \nseries",
    "date": "3/26/2024",
    "url": "https://www.pcguide.com/news/amd-could-be-cooking-up-a-faster-and-cheaper-version-of-the-ryzen-5000-series/",
    "text": "PC Guide is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Read More Last Updated on March 26, 2024 While AMD is gearing up for the upcoming release of the Zen 5 architecture, it seems they’ve got more up their sleeves. While the current flagship Ryzen 7000 and 8000 series are available for all, it seems new, faster versions of the 5000 series could be coming to the market as well. The two CPUs, photographed by HXL on Twitter, were shown off during AMD’s Beijing AI PC Innovation Summit. This processor, named the Ryzen 5 5000XT, could be a faster version of the existing Ryzen 5000 series. These CPUs would appeal to a more budget-conscious audience, providing a solid alternative to the higher-end models AMD has on the market. AMD has previously released faster versions of their older CPUs, specifically the Ryzen 3000 series. These AMD Ryzen CPUs provided a budget-friendly alternative. The slide the Ryzen 5 5000XT was shown on was specifically titled “attacking every price point”, so it seems AMD has the goal of making CPUs to fit every budget. An XT spin on the Ryzen 5000 series could be a great addition to the lineup. There is a caveat, though. HXL speculates that these models might only be coming for Chinese audiences. Just like the Ryzen 7 8700F and Ryzen 5 8400F shown on the same slide, the leaker believes these CPUs could only be released in China. This would be a big loss for Western audiences if this is true. However, this is just speculation at this point. Nothing official is saying that these CPUs won’t have a US release. There’s nothing to complain about when it comes to better speeds at a cheaper price. AMD appears to be solid in supporting its older CPU models, and this launch would only confirm it. If the Ryzen 5 5000XT is released to enthusiasts everywhere, it could snatch the budget audience. This is a market that many other processors aren’t catering to.  Annie is a journalist focusing on the latest technology news and deals. At PC Guide, Annie covers the latest bundle deals and news from the world of tech, with a particular focus on GPU and CPU news. PCguide.com is part of the BGFG family of websites. Our mission is to provide you with great editorial and essential information to make your PC an integral part of your life. You can also follow PCguide.com on our social channels and interact with the team there. © 2024 PC Guide. All rights reserved. Part of "
}