{
    "title": null,
    "date": "3/17/2024",
    "url": "https://investorplace.com/2024/03/intel-who-underdog-amd-stocks-2130-surge-isnt-over-yet/",
    "text": " Can this Nvidia competitor take market share over time? Advertisement Source: Pamela Marciano / Shutterstock.com In just five years, Advanced Micro Devices (NASDAQ:AMD) stock has shot through the roof. Shares of this semiconductor company have skyrocketed over 2,130% over this period, far exceeding the growth of the S&P 500. Now, there was a hiccup in 2022. But AMD quickly recovered and tripled from its most recent lows. AMD’s data center AI processor challenges Nvidia (NASDAQ:NVDA) for the throne in the high-performance semiconductor space. It’s been garnering the attention of top clients like Microsoft (NASDAQ:MSFT) and Meta Platforms (NASDAQ:META). AMD and other tech stocks have plenty of room to expand in the AI market. A year ago, AMD’s stock exploded 159% thanks to the strong demand for its data center CPUs. Mizuho Securities analysts raised the price target to $235, eager for more future growth. This bodes well for AMD’s performance and for possibly breaking new highs for 2024. AMD shares have gone through losses for a second consecutive session after a surge in AI chip makers that entered previously uncharted territories. After nearly reaching a new peak, AMD shares fell 1.9% on Friday, then added by 4.3% on Monday. AMD’s stock saw a 0.7% increase in premarket trading, up 35% so far this year. As AMD is usually viewed as a smaller competitor in the enterprise AI industry, AMD’s perception has taken a hit from similar concerns about Nvidia’s recent performance. With Microsoft and Meta rolling out its newest chip, AMD will increase its market share in AI chips. Analysts believe the yearly increase in earnings will touch 40% with $7 a share,quite the prediction for 2026. The 50-day moving average, plus a fundamental Fibonacci level, plus an uptrend line suggests the $176 level could be a potential key support level to watch. AMD recently announced efforts to stop Intel (NASDAQ:INTC) from providing advanced chips to a significant Chinese client. That client is Huawei, and AMD said that the licensing was unfair. With the support of other doubters, AMD disputed Intel’s license obtained under Trump’s presidency. Trade restrictions on Huawei and other Chinese companies coincide with this move. The semiconductor company has not yet received a response from President Joe Biden’s administration regarding its request to supply advanced chips to Huawei. The request dates way back to early 2021. Data from AMD revealed a decline in AMD-powered laptops, while a surge happened for Intel-powered ones. With Intel dominating the market, it has built walls for Huawei’s laptop offers. AMD, Huawei, and Intel went quiet on the matter, while Microsoft announced it would join Intel in producing more chips for AI model developments. The strong demand for data center chips caused AMD’s forward price-earnings ratio to soar to 57-times, double that of the previous year. Even with a Q4 6% revenue boost, and AMD’s earnings per share growing from $0.01 to $0.41, some speculation has built around the company’s valuation being overextended. There’s probably something to that. But with AMD launching its new AI-focused Instinct MI300 GPUs, and the AI infrastructure industry rapidly expanding, this stock is one with strong secular tail winds. Along with Nvidia, AMD stock holds incredible long-term growth potential, and is worth its valuation in my view. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective. Artificial Intelligence, Semiconductor, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/intel-who-underdog-amd-stocks-2130-surge-isnt-over-yet/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}