{
    "title": "AMD's Success in Cloud Expansion - This Analyst Sees Potential for Market \nLeadership",
    "date": "3/15/2024",
    "url": "https://markets.businessinsider.com/news/stocks/amd-s-success-in-cloud-expansion---this-analyst-sees-potential-for-market-leadership-1033169490",
    "text": "KeyBanc analyst John Vinh maintained an Overweight rating on Advanced Micro Devices, Inc (NASDAQ:AMD) with a price target of $270. The analyst said AMD grew modestly in February, as Genoa’s growth remained strong. AMD processor instances were +1% month-on-month (M/M), +24% Y/Y, compared with January (+1% M/M,+35% Y/Y). Genoa instance growth remained strong (+19% M/M), led by Amazon.Com Inc (NASDAQ:AMZN) AWS, after growing +13% M/M in January. Rome was +1% M/M,+14% Y/Y. AMD’s price target is $270, based on 30x Vinh’s 2025 EPS estimate of $9.05. AMD is trading at 21x Vinh’s 2025 EPS estimate and 38x the 2025 consensus EPS estimate compared to its peers, trading at an average consensus 2025E P/E multiple of 34x.  Vinh’s February results showed a continued decline in traditional server demand and China, as cloud instances saw a slight decrease of 1% M/M, a downturn from January’s 1% growth M/M. This overall decline was marked by Alibaba Group Holding Limited’s (NYSE:BABA) significant 11% reduction in M/M, underscoring the weakness in China’s cloud sector. On a company basis, Nvidia Corp (NASDAQ:NVDA) and Arm Holdings Plc  (NASDAQ:ARM) remained stable M/M, and Intel Corp (NASDAQ:INTC) experienced a 1% decline M/M. In contrast, Intel’s Sapphire Rapids instances slowed to 2% M/M growth following a significant 50% M/M surge in January. Nvidia’s GPU growth remained stagnant M/M, mirroring its January performance, with U.S. cloud service providers (CSPs) allocating capital expenditure towards internal generative AI workloads.  ARM’s server growth was flat m/m versus a slight 1% M/M increase in January. Based on the latest cloud tracker data, these findings suggest a moderately positive outlook for AMD and a neutral impact on ARM, Intel, and Nvidia. Investors can gain exposure to AMD via AOT Growth And Innovation ETF (NASDAQ:AOTG) and Invesco PHLX Semiconductor ETF (NASDAQ:SOXQ). Price Action: AMD shares traded higher by 3.20% at $193.05 on the last check Friday. Photo by cebbi from Pixabay Indices Commodities Currencies Stocks "
}