{
    "title": "Another crypto-mining boom threatens CPU prices, with AMD's Ryzen 7950X now \nsold out – and Intel could be the real ...",
    "date": "3/14/2024",
    "url": "https://www.techradar.com/computing/cpu/another-crypto-mining-boom-threatens-cpu-prices-with-amds-ryzen-7950x-now-sold-out-and-intel-could-be-the-real-winner-here",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Another crypto nightmare on the horizon for consumers? Let’s hope not… Are we about to see a return of crypto-mining causing havoc with PC hardware pricing? Hopefully not, but there are already hints that mining activity is pushing up the prices of some CPUs. Yes, processors, not GPUs as has been the case in the past, and specifically, we’re talking about AMD Ryzen chips – high-end models from the Ryzen 7000 family. What’s happening is that the recent spike in the value of Bitcoin has had a knock-on effect with the prices of other alternate cryptocurrencies, some of which are well-suited to being mined with a beefy CPU. Enter stage left the flagship Ryzen 9 7950X, a 16-core processor which excels at those kind of mining workloads, thanks to the AMD CPU’s support for AVX instructions (which Intel Core CPUs don’t offer since Alder Lake) and its plentiful L3 cache. The cherry on top for miners is Ryzen’s power-efficiency, too. With the crypto balloon rising fast right now, what this means is that as Wccftech points out, there’s money to be made mining obscure currencies like Qubic, to the tune of $3 per day currently. (That’s profit made after the electricity costs of running the Ryzen 9 7950X, assuming it’s at 170W, going by the tech site’s calculations). If we compare that to an RTX 4090 graphics card, that offers a daily profit of up to $1.90, with a much heftier power draw to boot (450W). So, you can see why folks are now looking at CPUs rather than GPUs in some scenarios. As a result, looking at the retail picture in the US, the Ryzen 9 7950X is sold out online at Newegg, Best Buy, and Micro Center – even in-store pickup is only an option in a few stores at the latter, with AMD’s flagship mostly sold out at bricks-and-mortar shops, too. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. Furthermore, the 7950X has been pushed up in price, at least with Newegg, to $741 in the US (but not at the other retailers, we should note). Okay, so all this sounds pretty bad, but in reality, how worried should we be about this apparent development? Well, on the more positive side, it’s still early days, and this could just be a temporary spike in interest with crypto-mining. When Bitcoin (inevitably) experiences its next dip, and these alternate coins also deflate, the situation with AMD’s top-end Ryzen processors should normalize again. We further need to bear in mind that this is only applicable to those top dog CPUs of the Ryzen 7000 family, and away from the highest tiers, the processor market isn’t affected. Obviously Intel’s CPUs aren’t hit, either, as they lack the mentioned strengths (AVX) as outlined above. If this crypto surge does continue, or at least keep much of its momentum over a longer period, it raises some worrying questions. AMD has next-gen CPUs coming later this year, and as a hardware leaker, Kepler, asserts on X (formerly Twitter), those Zen 5 chips have double the AVX-512 performance of current Zen 4 silicon. Which means that the Ryzen 9 models for the next-gen desktop launch might be highly sought after by miners, and stock – which can be thin on the ground at the higher tiers to begin with anyway – is going to vanish very swiftly. (Enter the price gougers, emerging from the general hive of PC villainy too). All of which could play havoc with AMD’s Zen 5 launch, at the top-end anyway, leading to speculation of LHR processors (chips with their performance restricted for mining tasks, as happened with GPUs at the height of the last mining boom). That speculation is mostly in jest at this stage, of course, but it makes the point that this is clearly becoming a concern. For AMD, anyway – for Intel it could be a golden opportunity, as its next-gen Arrow Lake chips are apparently not going to come with AVX-512 support again (at least based on current leaks), and so won’t be hit in the same way. This could push a lot of consumers towards the Intel side of the equation in the higher-end CPU space for desktop PCs, purely by necessity – depending on how the mining situation pans out, naturally. Via PC Gamer Darren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013). AMD could release faster versions of last-gen Ryzen CPUs that are perfect for budget builds and upgrades An excellent AMD budget gaming CPU is now on sale for less than $200 at Walmart Samsung archrival plans construction of world's largest chip factory — at more than $90 billion, it will take more than 20 years to finish, so one wonders what other exciting tech will it produce By Sead FadilpašićMarch 29, 2024 By Al GriffinMarch 29, 2024 By Cesar CadenasMarch 29, 2024 By Alex WhitelockMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}