{
    "title": "ASRock launches new mini-PCs for AMD's latest Ryzen CPUs — DeskMeet, \nDeskMini, and Jupiter arrive with X600 ...",
    "date": "1/13/2024",
    "url": "https://www.tomshardware.com/desktops/mini-pcs/asrock-launches-new-mini-pcs-for-amds-latest-ryzen-cpus",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. ASRock mini-PCs upgraded to the AM5 socket As AMD is getting ready to launch its Zen 4-based Ryzen 8000G processors with decent integrated graphics, its partners are gearing up to introduce their compact desktops supporting Ryzen 7000 and 8000-series processors. ASRock is undoubtedly one of them, with DeskMeet X600 and DeskMini X600 systems showcased at CES. Both machines use AMD's unannounced X600 chipset and support USB4. Both DeskMeet X600 (8 liters), DeskMini X600 (1.92 liters), and Jupiter X600 (1.0 liters) support AMD's Ryzen 7000 and Ryzen 8000G-series processors with up to 65W thermal design power. The larger DeskMeet X600 features a PCIe x16 slot for graphics cards as well as four slots for DDR5 memory modules, whereas the smaller DeskMini X600 and Jupiter X600 do not have a slot for discrete graphics boards and are equipped with two slots for DDR5 SODIMMs. A version of the DeskMeet X600 that ASRock demonstrated at CES packed AMD's Ryzen 7 7700 and latest Radeon RX 7600 XT graphics card, though actual configurations may vary. There are two intriguing things about these systems. Firstly, all three machines are said to be based on AMD's unannounced X600 chipset, and we can only wonder about its differences from the A620, the company's entry-level AM5 platform. Secondly, ASRock representatives at the trade show implied that the company's DeskMeet X600, DeskMini X600, and Jupiter X600 will support USB4, even though product descriptions do not reflect this capability for now (probably due to lack of formal certification, but we are speculating here). Although both the DeskMeet X600, DeskMini X600, and Jupiter X600 are positioned as mainstream compact desktops, all three can pack capable hardware. For example, the DeskMini X600 has two M.2 2280 slots for SSDs featuring a PCIe 5.0 x4 and PCIe 4.0 x4 interface and an M.2 2230 slot for a Wi-Fi + Bluetooth module. The DeskMini X600 machine also has a 2.5 GbE port, four display outputs (DisplayPort, HDMI, D-Sub, USB-C), a combination of USB Type-A and USB Type-C connectors, and an audio jack for headsets. Meanwhile, the Jupiter X600 does not have a D-Sub but has a COM port. ASRock says its DeskMeet X600 should be available shortly, so expect it to arrive in the coming weeks. Meanwhile, the DeskMini X600 and Jupiter X600 will hit the market later, probably after AMD launches its Ryzen 8000G APUs with built-in RDNA 3-based graphics. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Anton Shilov is a Freelance News Writer at Tom’s Hardware US. Over the past couple of decades, he has covered everything from CPUs and GPUs to supercomputers and from modern process technologies and latest fab tools to high-tech industry trends. The Sibolan SZBox S69 Ryzen Mini PC is made in a 'Power-Ranger' choice of colors — but older hardware and pricing means this isn't a superhero Asus ROG NUC has a $1,629 starting price —  entry-level SKU comes with Core Ultra 7 155H CPU and RTX 4060 GPU Best Budget 3D Printers 2024: High-Quality Output on the Cheap By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}