{
    "title": "Is It Too Late to Buy AMD Stock?",
    "date": "1/20/2024",
    "url": "https://finance.yahoo.com/news/too-buy-amd-stock-161700804.html",
    "text": "The advent of artificial intelligence (AI) in 2023 meant potent computer processing power was suddenly in high demand. This was a boon for semiconductor chipmaker Advanced Micro Devices (NASDAQ: AMD), which produces high-performance chips well suited to AI. This hunger for AI products helped to drive the company's stock price from a 52-week low of $67.27 last January to a high of $151.05 by December. So, does AMD's dramatic stock price surge mean it's now too late to buy shares? As 2024 kicks off, the stock remains near its 52-week high. But could it potentially rise even higher? Digging into the company can help to assess whether AMD is a worthwhile investment. Certainly, AMD stands to benefit from the rise of AI. For instance, Microsoft is incorporating AMD's AI chips into its Windows PC operating system as part of a multiyear partnership. And corporations, such as Facebook parent Meta, are looking to AMD's AI processors as a lower-cost alternative to those provided by industry leader Nvidia. AMD's CEO Lisa Su noted that the appetite for the company's MI300 accelerators, its data center-specific AI product, is so strong that it looks to be \"the fastest product to ramp to $1 billion in sales in AMD history.\" To capitalize on this demand, AMD acquired AI software companies Nod.ai and Mipsology in 2023 to strengthen its AI offerings. Nod.ai allows customers to automate the implementation and optimization of AI chips. Mipsology assists AI software in running through data and making decisions, a process known as inference. The company's AI progress helped to buoy AMD's stock price. But the next test comes when AMD releases its fourth-quarter earnings results later this year. In its third quarter, the company generated revenue of $5.8 billion, a 4% jump over the prior year. AMD expects around $6 billion in Q4 sales, an increase over 2022's $5.6 billion. AMD's Q4 revenue would likely need to surge past these expectations for its stock price to rise higher, however. Despite the potential upside, over the long term, AMD's business is susceptible to the cyclical nature of the computer hardware industry. When PC or gaming console sales drop, for example, demand for AMD's chips also declines, hurting its revenue. This was the case in the first quarter of 2023. AMD revenue was down 9% year over year due to sales softness in the PC market. The Q1 revenue decline was significant enough to cause the company to suffer a net loss of $139 million in the quarter, a substantial 118% drop from 2022's net income of $786 million. Another factor to consider is AMD's high stock valuation. Currently, the company's price-to-earnings ratio (P/E ratio) of 1,156 over the trailing 12 months is shockingly high. Contrast this with rival Nvidia's P/E multiple of 72. AMD has to deliver impressive financial results going forward to justify its current valuation. Moreover, the average price target for AMD shares among Wall Street analysts is $144.03 at the time of this writing. This is yet another consideration to weigh when evaluating whether AMD's stock is too pricey to warrant an investment right now. AMD's potential business boom from the AI market is a compelling reason to invest, but any short-term revenue boost appears to be priced into the company's stock already. As a result, it's hard to justify buying AMD shares now, given its current sky-high valuation. That could change as AMD delivers on the promise of strong AI sales over time. So, a prudent approach would be to wait for the price to dip and pick up shares then. Another strategy is to buy a small position now in case the company manages to smash Wall Street expectations in its Q4 results. Then, use the technique of dollar-cost averaging to add to your position when subsequent price drops occur. Should you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Advanced Micro Devices wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 8, 2024  Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Robert Izquierdo has positions in Meta Platforms, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Is It Too Late to Buy AMD Stock? was originally published by The Motley Fool Related Quotes "
}