{
    "title": "Here’s how AMD counters Nvidia’s big RTX Super launch",
    "date": "1/17/2024",
    "url": "https://www.digitaltrends.com/computing/heres-how-amd-counters-nvidia-rtx-super/",
    "text": "Digital Trends may earn a commission when you buy through links on our site. Why trust us? Well done, AMD. Today is a big day for Nvidia — after all, today is when the RTX 4070 Super hits the shelves. So what does AMD do? It serves up a huge price cut on one of its top graphics cards in this generation to strike back at Nvidia and counter its big release. Coincidence? No way. But will this price tag be low enough when Nvidia launches the RTX 4070 Ti Super? AMD’s RX 7900 XT is the GPU that’s now a lot cheaper, with an official price of $750, but some models are as cheap as $710. It initially launched at $900 and was never the most popular option out of AMD’s two flagships. The RX 7900 XTX, priced at just $100 more, often made more sense due to its greatly improved performance. As such, the RX 7900 XT was a bit of a forgotten entry in AMD’s lineup. Its price quickly plummeted to $800 and even lower at certain retailers. The fact that the GPU had been slowly dropping in price over the last year makes this price cut a little less impactful, but on paper, the card went down from $900 to close to $700 in the span of 13 months. At around $710, it makes a competitive alternative to the new RTX 4070 Super, which, as we’ve found, lags behind this GPU at every resolution. Of course, throwing DLSS 3 and ray tracing into the mix shakes things up a lot. Running Cyberpunk 2077 on ultra settings, at 4K, with ray tracing enabled and DLSS 3 toggled on produced 77.5 frames per second (fps) in our testing. The RX 7900 XT averaged 18 fps. However, this is more of a testament to the power of Nvidia’s DLSS 3 and not the new GPU itself. When the RTX 4070 Ti Super hits the market with its new specs and the same $800 price tag, things might get tougher for AMD. Seeing as the new Nvidia launch is expected to perform at around the same level as the RTX 4080 (non-Super), it’ll likely beat the RX 7900 XT in every scenario. At $800, it will, once again, put the RX 7900 XT in an awkward position on the market where it’s not quite cheap enough to be a steal and also not quite powerful enough to be a must-have. With that said, if DLSS 3 is of no use to you, the new deals on the RX 7900 XT are pretty great right now — and you’ll still save $50 to $100 compared to buying the RTX 4070 Ti Super when it comes out. AMD’s RX 7900 XT is . Keep in mind that, according to TweakTown, this might just be a seasonal promotion and not a permanent price cut, so it’s best to buy it quickly before AMD changes its mind. The RTX 4070 Ti Super and RX 7900 XT are unlikely rivals when shopping for the best graphics card in 2024. Price shifting and market repositioning have placed these two GPUs in direct competition, both targeting gamers looking for a premium 4K gaming experience without spending over $1,000. Both graphics cards hit the mark, offering a smooth frame rate at 4K with all the settings cranked up. The differences between them lie in features and pricing. AMD's new RX 7600 XT graphics card isn't off to a great start, at least according to sales data shared by 3DCenter. The new video card launched on Wednesday alongside Nvidia's RTX 4070 Ti Super, and even with a relatively poor reception, Nvidia sold nearly 10 times as many graphics cards as AMD did in a sampling at a German retailer. There are a few caveats to that, however. 3DCenter takes data for the number of sales from Mindfactory, a German hardware retailer, 12 to 14 hours after release. According to the data, weaker GPUs like the RTX 4060 and RX 7600 sell considerably less than more powerful GPUs like the RTX 4070 Super and RX 7800 XT. It indicates some bias in this data, perhaps showing that this retailer caters to a crowd willing to spend more money on a graphics card. The market for graphics cards around $300 is getting crowded, and the two frontrunners among the best graphics cards are Nvidia's RTX 4060 and AMD's RX 7600 XT. Both cards are around the same price, and they offer similar performance, so choosing between them isn't easy. I've tested both cards extensively -- read my RTX 4060 review and RX 7600 XT review for the full breakdown -- and they're remarkably close. It's hard to go wrong with either GPU, but after comparing them extensively, there's a clear winner.\nPricing and availability Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}