{
    "title": "AMD’s new integrated graphics might beat popular Nvidia GPU",
    "date": "1/3/2024",
    "url": "https://www.digitaltrends.com/computing/amd-ryzen-8600g-igpu-leak/",
    "text": "For five years straight, Nvidia’s GTX 1060 was the most popular graphics card for gamers. But now, AMD might be able to match it with only integrated graphics. Fresh information around AMD’s upcoming desktop APUs, specifically the Ryzen 5 8600G, has emerged to give us a fair idea of how the upcoming processor and integrated graphics could shape up. Recently leaked Geekbench benchmark scores not only offer a performance metric, but the listing also reveals crucial specifications about the upcoming chip. The upcoming Ryzen 5 8600G could arrive with the Radeon 760M integrated graphics chip clocked at 2.8GHz and featuring eight compute units and 512 GPU shader cores. Paired with two sticks of 16GB DDR5-6000 memory, the 8600G achieved a score of 30,770 points in the Vulkan benchmark, while in the OpenCL test, it scored 24,842 points. As pointed out by Tom’s Hardware, benchmark scores of the Radeon 760M are almost as good as Nvidia’s GeForce GTX 1060. Granted that the GTX 1060 launched almost seven years ago, but it is important to note that AMD has managed to deliver the same performance using significantly less power. Essentially, it would mean this integrated GPU will be capable of running certain modern games at 1080p at 60 frames per second (fps), which would be very impressive. For many years, the GTX 1060 was the standard bearer for entry level PC gaming, topping the Steam survey charts from 2017 to 2022. It would be a massive win for AMD to deliver graphics at this level, but we’ll have to wait for more official information before we know what its capabilities are for sure.  The benchmark listing also confirms that the upcoming Ryzen 5 8600G may feature six cores, 12 threads, and a boost clock of 4.996GHz. This is almost the same configuration as the Ryzen 5 7600, with the only difference being the lower boost clock speed. It is also expected that the Ryzen 7 8700G will be making use of AMD’s Radeon 780M, which could deliver up to 50% better performance. While we don’t have a confirmed date or release schedule for the upcoming Ryzen 8000G series of desktop processors, Gigabyte spilled the beans about it in November. Upon releasing a new AGESA beta BIOS for its X670, B650, and A620 motherboards last year, the company had accidentally mentioned the following in its announcement: “The forthcoming AM5 next-gen APU will be launched at the end of January 2024.” Since CES is just around the corner, we could see AMD making some sort of announcement there and eventually releasing the chips by the end of this month. One of the main interface elements of the macOS experience is the Dock. Located at the bottom of the screen by default, the Dock is your Mac or MacBook’s nerve center. It’s where all of your most used apps are located, and having the ability to just click an icon to launch a program is quite the convenience. But how do you customize the Dock to display the apps you love? If you have one of the best Chromebooks and it works properly, chances are it is properly updated. Why? When Chromebooks get internet access they update automatically on a regular basis. However, if you're facing common Chromebook problems, you'll know that making a manual check to get your Chromebook updated is useful. Also, just because technology says it will do something, it doesn't always mean it will. Here's how to update your Chromebook in case it doesn't do so automatically. When it comes to getting devices online, Wi-Fi is the gold standard. Millions of people use their laptops, TVs, gaming consoles, and smartphones with the wireless technology – and routers are the magical devices that make this possible. Setting a password on your Wi-Fi router is crucial to keeping it safe and secure, as an unprotected router can easily be targeted by hackers or bogged down by neighbors who take advantage of the free access. Because of this, it's important to change the default password for your router. A good Wi-Fi password consists of a long alphanumeric string that can't be easily guessed. Changing your router's Wi-Fi password is a pretty easy process, though it might be a bit confusing if you're new to the concept. Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}