{
    "title": "AMD Strengthens Portfolio With New Radeon & Ryzen Products",
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/news/amd-strengthens-portfolio-radeon-ryzen-144800245.html",
    "text": "Advanced Micro Devices AMD is expanding its gaming portfolio with the launch of the Radeon RX 7600 XT graphics card. The graphics card features 16GB of high-speed GDDR6 memory that supports next-generation AI and content creation workloads. The new graphics card improves AMD’s competitive prowess against NVIDIA NVDA.Users with AMD’s latest graphics card, in support with AMD FidelityFX Super Resolution and AMD HYPR-RX with AMD Fluid Motion Frames, can deliver up to 1.9 times faster gaming and raytracing performance than the NVIDIA GeForce RTX 2060.AMD Radeon RX 7600 XT graphics card is expected to be available beginning Jan 24, 2024, from leading AMD board partners, including Acer, ASRock, ASUS, Gigabyte, PowerColor, Sapphire and XFX.AMD is also expanding its desktop portfolio with the introduction of the new Ryzen 8000G series desktop processors for the AM5 platform, including the Ryzen 7 8700G, with the world’s most powerful built-in graphics. AMD Ryzen 8000G series features up to eight cores and 16 threads.AMD is also introducing Ryzen AI to unlock more AI for desktop consumers. Moreover, AMD is introducing new Ryzen 5000 processors that include the new Ryzen 7 5700X3D, leveraging powerful 3D V-Cache technology. Advanced Micro Devices, Inc. price-consensus-chart | Advanced Micro Devices, Inc. Quote AMD’s expanding portfolio is driving its prospects. It recently launched the Ryzen 8040 series processor with Ryzen AI and Instinct MI300 Series data center AI accelerators. The company also introduced the ROCm 6 open software stack with significant optimizations and new features supporting Large Language Models.The latest Ryzen 8040 series mobile processors, when combined with Ryzen AI NPU on-die, extend AMD’s leadership position in the AI-supported PC markets.Systems leveraging Ryzen 8040 series processors will be globally available from leading original equipment manufacturers, including Acer, Asus, Dell Technologies DELL, HP, Lenovo and Razer, beginning in 2024.AMD is expanding its data center footprint with the new Instinct MI300X accelerator. It combines CDNA 3 architecture and Zen 4 CPUs to deliver robust performance for HPC and AI workloads. Partners like Microsoft MSFT, Oracle and Dell are already using the accelerators in their systems.Microsoft is using AMD’s Instinct accelerator portfolio in its new Azure ND MI300x v5 virtual machine series, optimized for AI workloads.AMD, which currently carries a Zacks Rank #3 (Hold), expects fourth-quarter 2023 revenues to be $6.1 billion (+/-$300 million), which indicates year-over-year growth of 9% and 5% sequentially at the mid-point. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.AMD expects to witness year-over-year growth in the Data Center and Client segments by double-digit percentage. Sequentially, the Data Center segment’s revenues are expected to grow on a double-digit percentage, while Client is expected to increase.The Zacks Consensus Estimate for fourth-quarter 2023 revenues is pegged at $6.11 billion, indicating 9.2% year-over-year growth. The consensus estimate for earnings is pegged at 77 cents per share, suggesting 11.59% year-over-year growth. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Advanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Dell Technologies Inc. (DELL) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}