{
    "title": "Acer Nitro 16 AMD review: performance on a budget",
    "date": "1/14/2024",
    "url": "https://www.techradar.com/computing/gaming-laptops/acer-nitro-16-amd",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The Acer Nitro 16 AMD is not the prettiest gaming laptop out there – it’s a bit bulky as well – but it delivers competent performance even with a 165Hz refresh rate. It’s also on the affordable side of the gaming laptop spectrum. You won’t be wowed by the webcam or battery life, but the overall package will deliver, especially for competitive gamers. Surprisingly robust 1080p at 165Hz performance All configurations have 165Hz refresh rate Solid keyboard with RGB backlighting Affordable pricing Has that budget gaming look A bit bulky Webcam only 720p Why you can trust TechRadar \n\n\nWe spend hours testing every product or service we review, so you can be sure you’re buying the best. Find out more about how we test. Writing reviews on gaming laptops with an Nvidia GeForce RTX 4050 like the Acer Nitro 16 AMD is an exercise in splitting hairs. Some are a little more expensive, some are a little cheaper. Some quality of life factors like changes in refresh rate or webcam resolution differ from laptop to laptop. The guts, however, are very similar. The Acer Nitro 16 AMD, then, is a lot like many of the best budget gaming laptops with its surprisingly solid performance while sitting at the lower end of the gaming laptop spectrum. In its case, it does have that faster refresh rate and a good keyboard with bright RGB backlighting. However, its aesthetics are a bit more aggressively gamer-centric than many of the best gaming laptops, which have in recent times taken lessons from MacBooks and Ultrabooks. That said, it has a lot to offer, especially for competitive gamers on a budget. You can surely go cheaper with models sporting older GPUs, but those will start to show their limitations much earlier. Because of that, the Acer Nitro 16 AMD is not a hard laptop to recommend for the right budget-conscious gamer.  Acer is no stranger to budget laptops and that’s certainly the case with the Acer Nitro 16 AMD. Whether you go for the most basic model with its $999.99 (about £788 / AU$1,471) price tag and its AMD Ryzen 5 7640HS CPU, 8GB RAM, RTX 4050 GPU, and 512 GB SSD or the max version that clocks in at $1,799.99 (about £1,418 / AU$2,647) and has an AMD Ryzen 9 7940HS CPU, 16GB RAM, RTX 4070 GPU, and 1 TB SSD, you’ll be dropping less than a lot of other gaming laptops. Part of that is the fact that Acer generally runs cheaper than other brands and part of that is that AMD-equipped laptops are often cheaper than similarly specced Intel models. For comparison sake, the Lenovo LOQ 15 (AMD) I reviewed back in October starts at $1,189.99 / £1,080 / AU$2,199 for a model that is very similar with a slightly different CPU, the AMD Ryzen 5 7640S, and a slightly smaller 15.6 inch screen with a 144Hz refresh rate. Of course, it does come in a slightly more attractive package. The one thing I will complain about here is the fairly different versions of this laptop across different territories. Those in the US have the widest selection while those in the UK have one AMD-equipped model available that’s essentially the review unit with a slightly weaker Ryzen 5 processor. Those in Australia have two – one just like the review configuration and one that’s almost identical but with a Ryzen 7 7840HS CPU. The Acer Nitro 16 AMD, being a budget-oriented gaming laptop, comes with a fairly limited array of options despite there being up to 11 options depending on your territory. The processors range from the AMD Ryzen 5 7535HS 3.30GHz chip to the AMD Ryzen 9 7940HS 4.0GHz one. RAM ranges from 8GB to 32GB. And, the GPU goes from the Nvidia GeForce RTX 4050 to the 4070. Strangely, the weakest CPU is not in the cheapest model as that one has less RAM. And, the most expensive model with that AMD Ryzen 9 CPU doesn’t have the highest amount of RAM. Beyond the internal components, there aren't any other variables to worry about such as colorways or displays. Regardless of which model you get, you end up with a 16-inch 1900 x 1200p screen with a 165Hz refresh rate. As far as aesthetics go, the Acer Nitro 16 AMD does not pull its punches when it comes to its gamer looks. From the angled blue and reddish lines adorning the laptop lid as well as the aggressive looking N (for “Nitro”) on the lid as well as under the screen, this laptop is not going to pass as a non-gaming laptop the way a Razer laptop can. Of course, it doesn’t help that it is pretty bulky, not only in size but in weight, especially considering that it weighs 5.95 lbs (2.70 kg). And, it certainly looks chunky. It is over an inch thick – the same as two MacBook Airs stacked on top of each other. Since this is a budget gaming laptop, that form factor is somewhat to be expected. At least Acer made sure to put plenty of venting underneath and on the sides. Because of the side venting though, not all the ports fit on the sides as some of them, namely the power, HDMI and USB-C ones are on the back. Some people like having ports on the back for a cleaner look. I don’t as I find them to be harder to access.  On the bright side, Acer included a 16:10 1920 x 1200 display with a speedy 165Hz refresh rate (and 3ms response time), which is perfect for competitive gamers. Of course, it’s basically a slightly larger 1080p screen so you’re not going to step up in resolution. However, that’s never the case with budget gaming laptops. Still, it’s a good screen. Plus, it has a 125% sRGB color gamut and at least the review unit came with a Delta-E of 0.22 so you can do some photo editing here. Its DCI-P3 coverage is 89%, so it’s not as ideal for professional video editing.  As far as the keyboard and trackpad go, they’re more than competent for regular use. The keyboard is easy to type on with a nice textured feel. I didn’t find that I experienced any missed presses when gaming. More interesting is the fact that it has full-color backlighting, though only in four zones so you won’t be able to adjust key by key.  Here's how the Acer Nitro 16 AMD performed in our suite of benchmark tests: 3DMark: Port Royal: 4,682; Fire Strike: 19,390; Time Spy: 8,472\nGeekBench 6.1: 2,593.7 (single-core); 10,798.3 (multi-core)\n25GB File Copy: 14.1s\nHandbrake 1.6: 5:25\nCrossMark: Overall: 1,799 Productivity: 1,781 Creativity: 1,859 Responsiveness: 1,681\nFar Cry 6 1080p (Ultra) 76 fps\nCyberpunk 2077: 1080p (Ultra) 23.44 fps\nWeb Surfing (Battery Informant): 9:15:40\nPCMark 10 Battery Life (Gaming): 2:26 I’ve continually been impressed by all the laptops I’ve tested with a Nvidia GeForce RTX 4050 GPU. And, that continues to be true with the Acer Nitro 16 AMD. Obviously, there’s a ceiling to that performance. For instance, this laptop can achieve a 64.7 fps on Cyberpunk 2077 on Ultra settings, but as soon as ray tracing is on, the fps drops like an anchor. Just look at the benchmark for Far Cry 6 – it also gets 76 fps on Ultra. In more real world testing, I’ve been able to run Starfield and Hogwarts Legacy at higher than expected settings. Of course, that’s with ray tracing off and a tick or two off Ultra settings. Still, the results were very playable with just a tiny bit of screen tearing. Turning on Vsync takes care of that.  It’s important to note also that the Acer Nitro 16 AMD is also running that display at a 165Hz refresh rate so getting the results is even more impressive. That means this is perfect for competitive gamers on a budget. To test, I ran Battlefield 2042 and had stable results without any issues at high settings. As far as the sound goes, it’s not going to win any awards but it’s serviceable, just lacking some low end. The webcam is a little less impressive with its peak 720p resolution. It also gets a bit grainy. The battery life of the Acer Nitro 16 AMD is about as interesting as an episode of the Great American Baking Show (yes, it does exist). Yes, we must discuss. You’re not going to be wowed with its longevity. But, it’s ok in certain instances. When using it in a non-gaming capacity, you can get a little over nine hours of use. For a gaming laptop, that’s pretty good. Of course, you’ll want to be plugged in to actually game as it can only get just under two and a half hours when playing titles. Other than some configurations of the Asus Rog Zephyrus, most gaming laptops have not cracked the battery code. You’re a competitive gamer\nWith an RTX 4050 GPU and a screen with a 165Hz refresh rate, you’ll be able to keep up in the fastest competitive games, skill notwithstanding. You’re on a budget\nYou don’t have to spend all that much relatively to get quality gaming performance. The only way to go cheaper is to go console or with an older GPU that might not keep up. You want a more portable gaming machine\nIt’s bulky and on the heavy side so the Acer Nitro 16 AMD is not an ideal grab-and-go gaming machine, not to mention that the battery life isn’t all that great either. You can splurge\nThe Acer Nitro 16 AMD is all about getting decent quality gaming at a decent price. If you can spend more however, you’ll find some laptops from Acer and other manufacturers that will far surpass its capabilities. If our Acer Nitro 16 AMD review has you considering other options, here are two laptops to consider... MSI Katana 15 (2023)\nThe MSI Katana 15 (2023) might offer subpar battery life (like most gaming laptops) and look a bit outdated, but it’s an ideal entry-level gaming laptop. That’s not only thanks to its relatively affordable price, but the fact that it still manages to provide good 1080p performance with a fast refresh rate no less at that accessible price point. Read our full MSI Katana 15 (2023) review Asus ROG Zephyrus G15\nThe Asus ROG Zephyrus G15 is the closest one can get in a gaming laptop to that Ultrabook experience. It’s fairly petite and light weight with a respectable eight hour battery life. Plus, it has excellent performance for a fairly reasonable price. Read our full Asus ROG Zephyrus G15 review I used the Acer Nitro 16 AMD for a couple weeks, playing a number of demanding games like Starfield, Hogwarts Legacy, Battlefield 2042 and Cyberpunk 2077. While doing so, I ran the games at various settings, particularly at the highest ones with ray tracing on wherever possible, and took note of the results. I also tested each aspect of the laptop from the keyboard and trackpad to the webcam and speakers.\n\nAfter spending time with the Acer Nitro 16 AMD, it’s clear that this is meant to be a budget-conscious model for those that care about competitive gaming or for those that want something affordable while still equipped with a current generation GPU.\n\nI’ve spent the last few years reviewing tech gear for gaming and otherwise, where I’ve gotten a feel for what to look for and how to put a piece of kit through its paces to see whether it’s worth the recommendation. Read more about how we test First reviewed January 2024 James Holland loves audio gear! So much so that he covers all the ins and outs, good and bad for Tech Radar and T3. Where does that so-called expertise come from? Not only is he a lifelong music-lover but he also works in the music industry and is a musician. When not testing headphones or listening to music, he loves to travel, rage at the latest PC games, and eat off-the-beaten-path but not too off-the-beaten-path food. Quordle today – hints and answers for Sunday, March 31 (game #797) Microsoft's repair-friendly Surface puts other laptop makers on notice – and it's about time Here’s what going to bed with wet hair does to your mattress – and it's disgusting By Bryan M WolfeMarch 27, 2024 By Jim HillMarch 27, 2024 By Al GriffinMarch 27, 2024 By Steve ParisMarch 27, 2024 By Steve ParisMarch 27, 2024 By Dashiell WoodMarch 26, 2024 By James DavidsonMarch 25, 2024 By Al GriffinMarch 25, 2024 By Steve ParisMarch 25, 2024 By John LoefflerMarch 25, 2024 By Alison BarrettaMarch 24, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}