{
    "title": "AMD lays out new AI PC features: CES 2024",
    "date": "1/11/2024",
    "url": "https://finance.yahoo.com/video/amd-lays-ai-pc-features-173410125.html",
    "text": "American semiconductor manufacturer Advanced Micro Devices (AMD) has revealed a slew of new products, including desktop chips aimed at unlocking AI capabilities and improving productivity. The battle for AI PCs has begun as Intel (INTC), Qualcomm (QCOM), and other chip players roll out hardware aimed at AI supremacy. Jason Banta, AMD Corporate Vice President and General Manager of Client OEM, sits down with Yahoo Finance Anchor Akiko Fujita to discuss what features consumers can expect to come in the first leg of the AI PC race. \"Using generative AI or inferencing in the cloud, there are costs associated with that, typically that is the person who is using the device or using that experience is paying a cloud provider to access those generative AI capabilities,\" Banta says. \"By having it local on the device, that AI model is really running closer to the user without accessing the cloud and requiring those cloud costs.\" Click here to view more of Yahoo Finance's coverage of CES 2024 this week, or you can watch this full episode of Yahoo Finance Live here. Editor's note: This article was written by Nicholas Jacobino. [MUSIC PLAYING] AKIKO FUJITA: I'm Akiko Fujita on the ground here in Las Vegas at CES 2024, where the conversation has been about artificial intelligence, specifically about AI in devices. To talk more about that, we got Jason Banta. He is the general manager for client OEM at AMD. So AMD first unveiled its AI PC last year, certainly been a big focus here at CES this year. As you kind of assess the landscape, how are you thinking about this right now? JASON BANTA: Yeah, so AI PC is a big topic of conversation. Thank you for joining us in the AMD booth to talk more about that. And AI PC is something that we're seeing emerge in the PC market overall. Really what that does is that brings AI capability that typically you see in the cloud or in server devices, you bring that locally into the PC to perform closer to the user. And that means a lot of things that you see from a generative AI capability in the market today, things like content creation or assistance, those things can actually happen local on the device, which brings a lot of cost, and performance, and privacy advantages to people accessing those generative AI experiences. As you mentioned, we introduced Ryzen AI, which was our entry into that AI PC market last year. We were the first to bring that into the x86 PC market. And we're making it bigger this year in 2024 with higher-performance Ryzen AI engine, a larger portfolio in the notebook side. And we're also bringing it into the desktop market as well, bringing that Ryzen AI capability. So it's a big expansion for us from '23 to '24 from an AI PC perspective. AKIKO FUJITA: You mentioned a number of advantages when you get the AI on the device. But cost and performance specifically, what shifts as a result, when it's not in the cloud and on the device? JASON BANTA: Yeah. So using generative AI or inferencing in the cloud, there are costs associated with that. Typically, that is the person who is using the device or using that experience is paying a cloud provider to access those generative AI capabilities. By having it local on the device, that model, that AI model is really running closer to the user without accessing the cloud and requiring those cloud costs. The performance of it, you see lower latency because you don't have to send that data up, make a request, send it back. You can actually make that-- whether you're generating an image or trying to get a response from a prompt, you can do that with lower latency by having it on the device. And all that information stays on the device privately as opposed to going up to the cloud. So there's a lot of advantages there from a cost perspective, latency performance perspective, as well as a privacy perspective. So all of that really, the end user can see that when they get an AI PC on their hands. AKIKO FUJITA: We've certainly gotten to see, you could argue, a bit of a preview right in terms of the usage on the PC. Copilot being integrated through Microsoft and Enterprise certainly the first to integrate in that way. But as you look beyond, how does this fundamentally change the PC experience for the user? JASON BANTA: Yeah. The AI experience, I think, is probably the most transformational thing we've seen in the PC in a very, very long time. You talked about Microsoft. They were partnered with us in '23 and we're going bigger in that partnership in '24. They lit up some of the earliest experiences we've seen from an AI PC perspective, a lot of it around video conferencing. There are image enhancement, things you can do in video conferencing that you couldn't do before. And you can do those at much lower power, much longer battery life by Microsoft building those experiences around AI PCs. You talked about Copilot, that ability to get that assistance and be able to use your device much more seamlessly, get what you want in natural language is something that Copilot brings. And so we're partnered with Microsoft on that as well. They're bringing Copilot to PCs. They talked about that late last year. And so we're partnered with Microsoft on a number of those. They're really our premier ISV partner when it comes to bringing AI PC experiences to the local device. AKIKO FUJITA: No surprise, we've seen some big announcements from your competitors out there as well. We were just speaking to Intel the other day. This really is or seems to be the big focus. How does AMD position itself in this space? JASON BANTA: So we want to be first and best when it comes to AI PCs. That's our objective on all of our different IP, whether it's cores, graphics, or AI. First invest in everything. From an AI perspective, you can really feel those performance benefits. So in 2023, we launched Ryzen AI with 10 TOPS performance. We increased that to 16 TOPS per performance for our XDNA engine which is the engine that powers those AI experiences. Enhance that performance and you can really feel that when you get a response from a prompt or whether you generate an image. Some of the stuff that's going on behind us here, when you generate an image from a prompt locally on the device, it happens much faster because you don't want to sit if you're trying to generate an image for a, you know, PowerPoint presentation or whatever. You don't want to wait too long for that response, so enhancing that AI performance brings that. And so we want to stay ahead from an AI performance perspective and we want to do that in a much more accessible way. There's a lot of Ryzen PCs out there, so bringing that AI technology into Ryzen devices is going to make it much more accessible to the broader market. AKIKO FUJITA: You mentioned desktop is sort of that next phase here. JASON BANTA: Correct. AKIKO FUJITA: You've unveiled a desktop processor here at CES. It feels like there's more opportunity there, just given that the power that exists, right, beyond the PC. I mean, how are you thinking about that piece right now within AMD? JASON BANTA: Yeah, desktop is an exciting market and that's why we made the move to bring out the 8000G products that have that Ryzen AI capability. A lot of our core market and a lot of our, you know, AMD audience is desktop based. They love the desktop device. And so bringing that capability in there, it's a lot of the same experiences that you would see on the notebook. So whether it's content generation or assistance, chat assistance, chat bots, et cetera, having those same capabilities on the desktop translate very well as they do on the notebook. So it's a big market that uses desktop PCs today and so we wanted to bring those experiences to them as well. AKIKO FUJITA: As you sort of sit here and think about all the possibilities, and we're really just in the beginning phase it feels like about generative AI, how should we be thinking about where AI is headed? JASON BANTA: I think it's very early in the development of AI PC. I think the-- AKIKO FUJITA: Or AI experience in general, not just within PCs, not just within desktops. But I mean, you're right in the thick of it. JASON BANTA: Right. And AMD is uniquely positioned because we're one of the few players that can really offer AI from the cloud down to the PC. I mean, there's not many players in the market that can do that. And to your point, we're very much in the thick of it. The adoption curve of this or how exciting this is going to be is really determined by those experiences and the development of those models. As we saw in 2023, the models got better and better, fewer hallucinations, better accuracy, better accuracy to prompts. And so we're seeing that evolve with that model development and as people research that and find new ways to generate models. We're seeing a lot of growth there. So they're looking at it and saying, OK, this is more accurate. I can get more of the response I want from the model. And that's happening in real time. But also, people are finding new ways. You look at some of the models that are out there, they're finding new ways to plug it into productivity tasks or other things. So the adoption of those models into content generation or getting responses or help with things that's going to continue to evolve as it integrates into more applications that people are familiar with. AKIKO FUJITA: Yeah, certainly points to the big potential for AMD. Jason Banta, the general manager for client OEM. Thank you so much for joining us. JASON BANTA: Thank you, Akiko. Related Quotes "
}