{
    "title": "AMD RX 7900 GRE Review",
    "date": "2/26/2024",
    "url": "https://www.kitguru.net/components/graphic-cards/dominic-moass/amd-rx-7900-gre-review/35/",
    "text": "Dominic Moass \nFebruary 26, 2024\nFeatured Tech News, Featured Tech Reviews, Graphics, Reviews 1. Introduction2. Meet the AMD RX 7900 GRE3. Testing Methodology4. 3DMark Fire Strike & Time Spy5. 3DMark DirectX Raytracing6. Alan Wake II7. Assassin's Creed Mirage8. Cyberpunk 20779. Forza Horizon 510. The Last of Us Part 111. A Plague Tale: Requiem12. Ratchet and Clank: Rift Apart13. Red Dead Redemption 214. Resident Evil 415. Returnal16. Starfield17. Total War: Pharaoh18. Performance Summary (12-Game Average)19. Cost Per Frame Analysis20. Ray Tracing: Alan Wake II21. Ray Tracing: Avatar Frontiers of Pandora22. Ray Tracing: Cyberpunk 207723. Ray Tracing: F1 2324. Ray Tracing: Hitman 325. Ray Tracing: Ratchet and Clank: Rift Apart26. Ray Tracing: Returnal27. Ray Tracing: Shadow of the Tomb Raider28. Ray Tracing Performance Summary29. Clock Speed30. GPU Temperatures31. Acoustics32. Power Draw: 1080p33. Power Draw: 1440p34. Power Draw: 2160p (4K)35. Performance per Watt: 1080p36. Performance per Watt: 1440p37. Performance per Watt: 2160p (4K)38. Total System Power Draw39. Closing Thoughts40. View All Pages Using the graphics card-only power draw figures presented earlier in the review, here we present performance per Watt on a per-game basis for all twelve games we tested at 1080p. Per-Game Results at 1080p: Click to enlarge. 12-Game Average at 1080p:  At 1080p, performance per Watt is actually the best of all RDNA 3 GPUs tested – not by much, but it creeps ahead of the RX 7800 XT by 4%. As a bonus, we now include the power figures for all six games we test with ray tracing enabled. 8-Game ray tracing average:  Become a Patron! Be sure to check out our sponsors store EKWB here Tags 7900 gre review AMD gpu review Navi 31 Review RX 7900 GRE After eight major releases, HWiNFO is finally getting a built-in OSD, allowing users to see …   DDR5 speed on your next PC: How fast?  View Results "
}