{
    "title": "New Open RAN ready chip tested by Vodafone, Samsung and AMD",
    "date": "2/13/2024",
    "url": "https://www.vodafone.com/news/technology/new-open-ran-ready-chip-tested-by-vodafone-samsung-and-amd",
    "text": "Please choose your local Vodafone website Vodafone, together with Samsung and AMD, announced the successful demonstration of their first end-to-end data call using AMD’s new general-purpose processor on an Open RAN platform. In addition to proving that the technology works well, it also reinforces Vodafone’s aim to introduce new silicon partners to the Open RAN eco-system, driving both innovation and more competition. A stronger Open RAN ecosystem gives network operators greater choice of software and hardware whilst strengthening the vendor supply chain. In order to deliver improved services to customers, fully open and flexible radio access network platforms need higher performing and more efficient general-purpose processors, capable of conducting the most advanced tasks. This joint achievement underlines the companies’ technical leadership in the development, functionality, and testing of silicon chips, combined with leading software, optimised to power Open RANs. Conducted in Samsung’s R&D lab in Korea, the first call was completed using Samsung’s Open RAN-compliant, virtualized RAN (vRAN) software, integrated with AMD’s latest generation General Purpose Processor (GPP) EPYC™ 8004 on Supermicro’s latest Edge servers, supported by Wind River’s cloud-based platform. The companies showed how the new platform can meet Vodafone’s technology objectives and verified key metrics such as performance and energy efficiency, while demonstrating successful interoperability between partners’ products. Nadia Benabdallah, Network Strategy and Engineering Director at Vodafone Group said: “Vodafone, together with Samsung and AMD, are pioneering the development of purpose-built silicon to power the next generation mobile networks. Through greater industry collaboration, we can create a vibrant Open RAN ecosystem to stay ahead of customer demand for faster connectivity without compromising reliability.” “This collective effort marks a key milestone for the mobile network industry to steer Open RAN forward, by embracing multiple providers at every layer of the network stack. The demonstration illustrates Samsung’s commitment to delivering the full potential of mobile networks by embracing openness,” said June Moon, Executive Vice President & Head of R&D, Networks Business at Samsung Electronics. Today’s news complements the work Vodafone engineers are undertaking at its R&D centre in Málaga, Spain, to test and propel the development of new silicon chip solutions, which will feature on Vodafone’s stand (Hall 3, stand 3E11) at Mobile World Congress (MWC) 24, 26 – 29 February 2024. In addition to testing new electronic processors, Vodafone also has one eye on the future. It is exploring the potential of silicon photonic chips which use light instead of electricity to compute mathematical operations and the computation time is measured by how long it takes the light to cross the microchip. As a result, photonic chips promise to be far faster, more efficient, and reliable than today’s electronic equivalent found in most devices and networks. Meanwhile, Vodafone’s work with vendors such as Samsung and AMD will continue to enhance the performance of today’s microprocessors when used to power Open RAN for many years to come. No results found linkedintwitteryoutubeinstagramfacebook ©2024 Vodafone Group Vodafone Group Plc. Registered Office: Vodafone House. The Connection, Newbury, Berkshire RG14 2FN. Registered in England No 1833679 We use cookies to improve your experience on this site. Read our policy "
}