{
    "title": "AMD Zen 5 CPUs tipped to enter mass production in Q3 2024",
    "date": "2/19/2024",
    "url": "https://www.techspot.com/news/101937-amd-zen-5-cpus-tipped-enter-mass-production.html",
    "text": "What just happened? AMD's Zen 4 and 4c designs are showing their age, and the company is actively developing their successor, which is rumored to debut later this year. A recent leak now suggests that Zen 5 CPUs will enter mass production in Q3 2024. The news originates from the Chinese technology outlet UDN, and claims that Zen 5 chips are expected to enter TSMC fabs between April and June, with mass production scheduled for the following quarter. The report indicates that mainstream Zen 5 CPUs will feature \"Nirvana\" cores, while chips designed for the dense-compute segment for both client and server applications will ship with Zen 5c \"Prometheus\" cores. It's worth noting that while earlier rumors suggested that Zen 5 and 5c would utilize TSMC's 4nm and 3nm process nodes, respectively, the new report proposes that the Zen 5 \"Nirvana\" CCD will be built using the 3nm node. Currently, it remains unclear which report is accurate, and further clarification is needed.  The latest report contradicts a recent leak that suggested the Ryzen 9000 \"Granite Ridge\" processors with Zen 5 cores would debut in the second quarter of this year. The leaker also claimed that the new chips would bring at least a 10 percent improvement in IPC over the Ryzen 7000 series, resulting in better performance despite similar clock speeds. Additionally, the leaker revealed that the Ryzen 9000 SKUs would feature the same on-package chiplet design as Zen 2/3/4 and the same IO-die as Zen 4. Earlier reports also indicated that the Ryzen 9000 CPUs would offer between six and 16 cores and include either RDNA 2 or RDNA 3.5 integrated graphics. The TDP of these chips is reportedly expected to range between 65 watts and 170 watts. The Granite Ridge processors are believed to come with up to 64MB of L3 cache and 16MB of L2 cache. They are also said to support DDR5 memory with speeds up to 6,400 MT/s. Not much else is officially known about Zen 5 at this point, but AMD had earlier confirmed that the next-gen cores would be part of the Ryzen 9000 desktop CPUs. The upcoming chips have also been confirmed to use the AM5 socket and be compatible with existing 600-series motherboards. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}