{
    "title": "An Easter Egg In The Form Of A Revolver And Texas Was Found On A \n25-year-old AMD Athlon K7 Processor",
    "date": "2/8/2024",
    "url": "https://technewsspace.com/an-easter-egg-in-the-form-of-a-revolver-and-texas-was-found-on-a-25-year-old-amd-athlon-k7-processor/",
    "text": "The first AMD processor of the Athlon K7 series was released in 1999 and seriously competed with the then Intel chips, practically defeating its competitor Pentium III. And a quarter of a century later, inquisitive researchers discovered on AMD Athlon K7 chips an engraving in the form of a revolver, a bullet flying out of it, and the silhouette of the state of Texas. This discovery was made Fritzhens Fritz (Fritzchens Fritz), a lover of macro photography and studying processor crystals.  Image source: Fritzchens Fritz The images are likely a reference to AMD’s facilities in Austin, Texas. Or is this a hint of an upcoming “duel” with Intel. Apparently, one of the chip’s creators was no stranger to the romance of Westerns and the charm of the Wild West. And such a person may well be Jim Keller, who had a hand in creating the K7, widely known as one of the leading chip architects of recent decades and the developer of the current AMD Zen architecture. It was the Athlon K7 that for the first time put AMD on an equal footing with Intel in terms of performance. It had the same 600 MHz peak clock speed as the Pentium III and performed excellently in benchmarks, including floating point calculations, which were previously the preserve of Intel’s best processors. In addition, the AMD Athlon K7 turned out to be faster than the Pentium III in Quake III, providing just under 120 frames per second in the game, while the Pentium III could not even produce a hundred. This had a huge impact on the consumer processor market. Many gamers and computer enthusiasts are taking a fresh look at AMD products.  Dylan Harris is fascinated by tests and reviews of computer hardware. Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  TECH NEWS SPACE The Tech News Space team monitors news from the world of high technology, science, the gaming industry and delivers them to its readers in a timely manner. "
}