{
    "title": "Enshrouded Mod, HDR, Ultrawide (21:9), Super Ultrawide (32:9), AMD FSR 3 & \nDLSS Support Details",
    "date": "2/28/2024",
    "url": "https://digistatement.com/enshrouded-mod-hdr-ultrawide-219-super-ultrawide-329-amd-fsr-3-dlss-support-details/",
    "text": "Enshrouded Mod, HDR, Ultrawide (21:9), Super Ultrawide (32:9), AMD FSR 3 & DLSS Support Details Developer Keen Games’ recent release, Enshrouded, has turned out to be quite a successful title. In fact, Enshrouded amazingly achieved a 2 million player count in less than a month following its release on January 24, 2024. The developers have been very receptive to feedback, and continue on to drop in regular patches for the game. Now that the game happens to be in early access, there’s a lot about it that players want to know. And something that’s been the subject of major curiosity is whether the game supports mods, HDR, ultrawide, super ultrawide, AMD FSR 3, and DLSS. Early-access games tend to have a lot of features missing. But it also depends on what the developers consider more of a priority. Features like HDR, upscaling technologies, and such always happen to be in demand, but sometimes devs prefer adding them later in a game. So, what’s the case with Enshrouded? Have Keen Games added support for mods, HDR, ultrawide, super ultrawide, AMD FSR 3, and DLSS? Well, let’s go ahead and find out. Currently, there’s no official mod support for Enshrouded. However, this doesn’t mean that Keen Games doesn’t have plans for adding mod support. In the FAQ section of the official Enshrouded website, the developers themselves have confirmed that they will introduce mod support for Enshrouded later on. “There are no questions that mods are what makes a game truly great, but at this stage, we cannot make promises that the game will be moddable, but it is something we would love to implement in the future.” Now, we do know that there are mods on the NexusMods page of the game. But know that all of them either need Reshade or a cheat engine tool. So, if you want full mod support, then better wait for Keen Games to release a mod kit. As for HDR, that also isn’t available natively in the game right now. However, Windows 11’s Auto-HDR does serve as a workaround of sorts. Additionally, there are also some HDR-related mods on NexusMods, which you can make use of if you want. Now, while there might not be native HDR support, the game does support both ultrawide and super ultrawide. So, don’t worry about having to download some third-party tool or modify config files to play the game in ultrawide and super ultrawide aspect ratios. And at last, we come to the topic of AMD FSR3 and DLSS. Well, currently Enshrouded doesn’t support FSR 3 but the game does have DLSS as an option. However, this doesn’t mean that only DLSS is available in the game. In fact, besides DLSS, there’s also FSR 2.0 as another upscaling option. If the developers do add in FSR3 later on, then we will be sure to update our readers on it. Well, that’s all the information we have on this. You can also take a quick look here if you want to know whether Enshrouded can be played on Legion Go and the Rog Ally. And for more such content, keep following DigiStatement. Also read: Best Enshrouded Steam Deck settings for High FPS & performance © 2021 DigiStatement - All Rights Reserved © 2021 DigiStatement - All Rights Reserved "
}