{
    "title": "AMD Ryzen 9 7900X 12-Core CPU Available For Just $335 In China",
    "date": "3/21/2024",
    "url": "https://wccftech.com/amd-ryzen-9-7900x-12-core-cpu-335-usd-price-china/",
    "text": "AMD's Ryzen 9 7900X CPU which is a high-end AM5 part with 12 powerful Zen 4 cores is now available for as low as $335 in China. The AMD Ryzen 9 7900X can be seen as a great multi-threading chip since it packs a total of 12 cores and 24 threads based on the Zen 4-core architecture. The CPU has a base clock of 4.7 GHz and a boost clock of 5.6 GHz while offering 12 MB of L2 and 64 MB of L3 cache. The chip comes with a default TDP of 170W and can be overclocked just like the rest of the lineup. The AMD Ryzen 9 7900X also comes compatible with almost all AM5 motherboards and while the A620 series may not feel like the perfect choice for this chip, users who want to go the undervolting route might consider those as an option. Now for gamers, it might be better to go for the Ryzen 9 7900X3D since that packs an extra pool of stacked cache which can deliver better performance but for those who are looking for faster multi-threaded performance, the 7900X is the way to go. Currently, in China, the Ryzen 9 7900X is listed for 2426 RMB or $335 US which is a 77% drop versus its official MSRP of 4299 set by AMD. Even compared to the US MSRP, the chip has seen significant price drops from its $549 price point. The CPU costs around $370-$390 at major US retailers & the thing that is most interesting is the fact that the Ryzen 9 7900X3D also costs pretty much the same. The AMD Ryzen 9 7900X reached its lowest price back in November during the holiday deals at Microcenter. The chip was priced at an incredible $288 US but the deal only lasted a few days & since then, it has gotten back up to $300+. With the falling prices of Ryzen 7000 CPUs, they make great choices for PC builders and gamers who want to upgrade to something new and something that will have better support in the future. News Source: ITHome Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}