{
    "title": null,
    "date": "3/24/2024",
    "url": "https://sg.news.yahoo.com/amd-rx-7700-xt-drops-115351831.html",
    "text": "AMD’s RX 7700 XT has dropped to new pricing lows over in the US, making this mid-range GPU a tempting proposition. As you may have seen, just last week the RX 7700 XT was treated to an official price cut by AMD, with Team Red dropping the MSRP in the US by 7%, down to $419. Tom’s Hardware spotted that there are now more RX 7700 XT GPUs down at that level on Amazon.com and Newegg, which is good news – while AMD can recommend a price, its third-party card-making partners don’t necessarily have to follow that guidance. (And there is no reference board made by AMD in the case of this GPU). But it seems those card vendors are doing just that, and indeed looking at Newegg right now, the 7700 XT has sunk below that new MSRP. There’s a Sapphire Pulse RX 7700 XT down to $419, but with a $10 off promo code at checkout, it’s now $409, a real bargain for this graphics card. That one is still in stock – at least at the time of writing – although there’s another model with the same deal, a $10 off discount code making it $409, but it’s run dry sadly. That’s the ASRock Challenger spin on the 7700 XT, which you can back-order if you wish (or it might even come back in stock by the time you read this). It’s a good sign that two of these GPUs are now barely over $400 in the US, and just maybe we’ll see pricing coming down further – and proportionate reductions in other regions outside the US, too. We are seeing some movement in the UK, for example, like a Gigabyte Gaming 7700 XT down at £420 at Overclockers, but that’s out of stock currently, unfortunately. This is a good graphics card and a sterling 1440p performer, but as we point out in our RX 7700 XT review, the main problem is the pricing. Or was the pricing, rather, as with the cost of the GPU now having been reduced nicely (at least in the US), it makes a lot more sense. The gap between the RX 7700 XT and 7800 XT didn’t really line up before – with the latter only being $50 more expensive, it was a no-brainer unless that extra expenditure broke your budget. However, on Newegg now the cheapest 7800 XT is $500, so the 7700 XT is almost a hundred bucks under that, where it looks like a good value proposition – and maybe it’ll be sneaking onto our list of the best graphics cards soon, at this rate. And that most definitely wasn’t a possibility at the launch of the 7700 XT. All that noted, if you’re looking at a mid-range GPU from AMD, and can wait, it might be prudent to do so. After all, RDNA 4 is going to top out at the mid-range, if the rumor mill is right – and those graphics cards are likely to really go for the throat in terms of value proposition, as this will likely be AMD’s best way of looking good in the face of Nvidia’s rival next-gen GPUs. The RTX 5090 could arrive as early as Q3 2024 perhaps – though Q4 is more likely – and is purportedly going to be a massive leap in performance that’ll truly blow away anything Team Red has. So, AMD’s obvious counterattack could be on pricing in the middle of the pack, to save its public perception in terms of starting to look too far behind the competition. The best cheap graphics cards out there Top gaming PCs: great rigs for serious PC gaming Best PC games of 2024: must-play titles you don't want to miss A new rumor suggests Apple will use a glossy titanium finish instead of a brushed one on its next iPhone. I want Apple to focus on the core iPhone experience, not lean into generative AI.  Revenue at Chinese telecom rose 10% as net profit more than doubles Phone companies are experiencing a rise in sales of “dumbphones” as parents become more wary of the dangers of social media for children. Apple's new Reasons to Upgrade page is one tool to use when considering whether you need a new iPhone. But here's what our managing editor for mobile looks at when weighing whether it's time for a new phone.  Telecom company AT&T said on Saturday that it is investigating a data set released on the \"dark web\" about two weeks ago, and said that its preliminary analysis shows it has impacted approximately 7.6 million current account holders and 65.4 million former account holders.  The company said the data set appears to be from 2019 or earlier.  AT&T said it does not have evidence of unauthorized access to its systems resulting from the incident. Fifteen years after it was created, the messaging app runs the world. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order.  My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap.  New agile US Marine formations are learning how to battle adversaries like China on remote islands, according to The Washington Post. In this week’s travel roundup we bring you transport trivia, Roman engineering marvels and the world’s tastiest dumpling. When Sam* married her husband, she never imagined that 20 years on, she'd have not one, but two affairs...  Dini von Mueffling is a PR professional in New York City's who's worked with Monica Lewinsky and Virginia Giuffre. The post Bites by Ann Chin: Michelin popiah, loaded waffles & local bites in hole-in-wall eatery appeared first on SETHLUI.com. Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp. 經渣打投保安聯旅遊保障可享6折。18歲以下更可享半價保費優惠！ The visibly upset MSNBC anchor was responding to the Trump's attack on Judge Juan Merchan's daughter despite gag orders The post Nicole Wallace Gets Fed Up, Tosses Script While Covering Latest Trump Attack: ‘What Are We Going to Do Different?’ | Video appeared first on TheWrap. City Developments Limited ( SGX:C09 ), is not the largest company out there, but it received a lot of attention from a... Israel assassinated a Syrian colonel in Damascus and a senior Hezbollah commander in Lebanon in a series of pinpointed strikes amid the largest attacks on neighbouring countries since the start of the war in Gaza. "
}