{
    "title": "AMD Ryzen 3 3200U vs HiSilicon Kirin 9000W vs Loongson 2F 900MHz",
    "date": "3/9/2024",
    "url": "https://www.notebookcheck.com/R3-3200U-vs-Kirin-9000W-vs-Loongson-2F_11191_17388_480.247552.0.html",
    "text": "Der AMD Ryzen 3 3200U ist ein Mobilprozessor für schlanke Notebooks. Der SoC beinhaltet 2 Zen Kerne (Quad-Core CPU) mit SMT / Hyperthreading und dadurch können 4 Threads gleichzeitig abgearbeitet werden. \nIm Vergleich zum Vorgänger Ryzen 3 2200U wurde nur der Takt um 100 MHz erhöht, im Unterschied zu den stärkeren Ryzen 3000 CPUs, nutzt der 3200U nicht die neuere Zen+ Microarchitektur und wird noch in 14nm hergestellt. \nDie integrierte Radeon RX Vega 3 bietet 3 CUs (192 Shader) mit bis zu 1200 MHz. \nDie Features bleiben bei den neuen APUs der Picasso Serie vergleichbar zur Vorgängergeneration, wodurch wir auf unseren Raven Ridge APU Artikel verweisen können. Der AMD Ryzen 3 3200U ist ein Mobilprozessor für schlanke Notebooks. Der SoC beinhaltet 2 Zen Kerne (Quad-Core CPU) mit SMT / Hyperthreading und dadurch können 4 Threads gleichzeitig abgearbeitet werden. Im Vergleich zum Vorgänger Ryzen 3 2200U wurde nur der Takt um 100 MHz erhöht, im Unterschied zu den stärkeren Ryzen 3000 CPUs, nutzt der 3200U nicht die neuere Zen+ Microarchitektur und wird noch in 14nm hergestellt. Die integrierte Radeon RX Vega 3 bietet 3 CUs (192 Shader) mit bis zu 1200 MHz. Die Features bleiben bei den neuen APUs der Picasso Serie vergleichbar zur Vorgängergeneration, wodurch wir auf unseren Raven Ridge APU Artikel verweisen können. Der HiSilicon Kirin 9000W ist ein SoC, welches in auf Android basierenden Smartphones und Tablets zum Einsatz kommen kann und erstmals im Huawei MatePad Pro 13.2 verbaut wurde. \nHuawei verrät zum SoC keine Informationen. Die wenigen Informationen, die vorhanden sind stammen aus Benchmarks und Systemanalyse-Tools. Einig sind sich alle, dass die CPU aus drei Clustern mit insgesamt 12 Kernen besteht. Das Stromsparcluster besitzt vier ARM Cortex-A510-Kerne, welche jeweils mit bis zu 1.530 MHz arbeiten, sechs weitere Kerne greifen auf nicht näher spezifizierte Kerne von HiSilicon (0x0D42) zurück und takten mit bis zu 2.150 MHz. Im dritten Cluster befinden sich zwei HiSilicon-Kerne (0x0D02), die jeweils maximal 2.487 MHz leisten. Die Performance-Kerne könnten eventuell auf die TaiShan V120 Architektur (oder Nachfolger) basieren (wie beim Kirin 9000S).  \nDie Single-Core-Leistung fällt entsprechend durchwachsen aus, jedoch ist die Multi-Core-Performance aufgrund er zahlreichen Kerne auf Niveau eines Highend-SoCs aus dem Jahre 2022. Als Grafikeinheit ist eine Maleoon 910 integriert. \nÜber das Fertigungsverfahren oder die Architektur ist nichts konkretes bekannt. Das SoC wird wahrscheinlich in 7 nm bei SMIC gefertigt. Der HiSilicon Kirin 9000W ist ein SoC, welches in auf Android basierenden Smartphones und Tablets zum Einsatz kommen kann und erstmals im Huawei MatePad Pro 13.2 verbaut wurde. Huawei verrät zum SoC keine Informationen. Die wenigen Informationen, die vorhanden sind stammen aus Benchmarks und Systemanalyse-Tools. Einig sind sich alle, dass die CPU aus drei Clustern mit insgesamt 12 Kernen besteht. Das Stromsparcluster besitzt vier ARM Cortex-A510-Kerne, welche jeweils mit bis zu 1.530 MHz arbeiten, sechs weitere Kerne greifen auf nicht näher spezifizierte Kerne von HiSilicon (0x0D42) zurück und takten mit bis zu 2.150 MHz. Im dritten Cluster befinden sich zwei HiSilicon-Kerne (0x0D02), die jeweils maximal 2.487 MHz leisten. Die Performance-Kerne könnten eventuell auf die TaiShan V120 Architektur (oder Nachfolger) basieren (wie beim Kirin 9000S). Die Single-Core-Leistung fällt entsprechend durchwachsen aus, jedoch ist die Multi-Core-Performance aufgrund er zahlreichen Kerne auf Niveau eines Highend-SoCs aus dem Jahre 2022. Als Grafikeinheit ist eine Maleoon 910 integriert. Über das Fertigungsverfahren oder die Architektur ist nichts konkretes bekannt. Das SoC wird wahrscheinlich in 7 nm bei SMIC gefertigt.  #0 checking url part for id 11191 +0s ... 0s #1 checking url part for id 17388 +0s ... 0s #2 checking url part for id 480 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.083s ... 0.084s #6 did output specs +0s ... 0.084s #7 getting avg benchmarks for device 11191 +0.017s ... 0.1s #8 got single benchmarks 11191 +0.029s ... 0.129s #9 getting avg benchmarks for device 17388 +0.002s ... 0.132s #10 got single benchmarks 17388 +0.006s ... 0.138s #11 getting avg benchmarks for device 480 +0.003s ... 0.14s #12 got single benchmarks 480 +0.005s ... 0.146s #13 got avg benchmarks for devices +0s ... 0.146s #14 min, max, avg, median took s +0.201s ... 0.346s #15 return log +0s ... 0.346s "
}