{
    "title": "Do the Intel Wi-Fi 7 BE200 and BE202 work with AMD systems?",
    "date": "3/13/2024",
    "url": "https://www.breakinglatest.news/technology/do-the-intel-wi-fi-7-be200-and-be202-work-with-amd-systems/",
    "text": "Intel’s WLAN cards are without question the best on the market. These usually work very reliably and stably and have good performance. With all of my AMD notebooks and systems, one of my first acts is to replace the “AMD” WLAN card with an Intel model. This is not a problem at all with the Intel WLAN 6 and 6E models. But what about Intel’s new WLAN 7 models? Do the BE200 and BE202 also work so smoothly in AMD systems? Why should there be a limitation here at all? After all, these are “normal” M.2 WLAN modules?! However, I have heard rumors that this is not so easy in practice. In short, I ordered the Intel Wi-Fi 7 BE200 and BE202. Let’s see if these work in AMD systems! I tested the WLAN cards in 6 systems, 5 with AMD CPU and 1 with Intel CPU. The following were the results: CPU\nIntel Wi-Fi 7 BE202\nIntel Wi-Fi 7 BE200 ASUS ROG Strix X670E-E\nAMD Ryzen 5 7600X\nNot recognized\nNot recognized Geekom A5\nAMD Ryzen 7 5800H\nDoes not start\nDoes not start ASUS ROG Zephyrus G15\nAMD Ryzen 7 5800HS\nBootloop\nBootloop ASUS ExpertCenter PN53\nAMD Ryzen 7 6800H\nDoes not start\nDoes not start Minisforum UM790 Pro \nAMD Ryzen 9 7940HS\nBootloop\nBootloop Geekom IT13\nIntel Core i9-13900H\nFunctions\nFunctions Let’s make it short, I couldn’t get the WLAN 7 cards from Intel to work in the AMD systems! This result more than surprised me, especially since in many cases the systems completely refused to start (only a black screen) and therefore new drivers etc. would not help. In the Intel-based system, however, both WLAN 7 cards worked without any problems after installing the drivers. The ASUS ROG Strix X670E-E produced the most unspectacular results. Both WLAN cards were simply not recognized. By not recognized, I really mean this. The WLAN cards do not appear at all in the device manager etc. The two mini PCs with AMD Ryzen 7 5800H and AMD Ryzen 7 6800H with built-in Intel Wi-Fi 7 cards completely refused to start! After installing the WLAN cards, the picture remains completely black on both systems. Accordingly, there must be a significantly deeper incompatibility here that cannot simply be remedied with a new driver. The ASUS ROG Zephyrus G15 and the Minisforum UM790 Pro reacted completely differently. Both systems started but refused to load Windows. So they ended up in an infinite bootloop. Even Windows automatic repair refused to run. Something loads briefly, but then the systems suddenly restart. To make sure that the WLAN cards really work, I installed them in the Geekom IT13, which uses the Intel Core i9-13900H. Both WLAN cards were recognized well and worked without any problems after installing the appropriate drivers. Unfortunately, the first Intel Wi-Fi 7 cards (BE200 and BE202) really don’t seem to work with AMD systems. The problem seems to be a lot deeper than just driver problems. Some systems completely refused to start with the Intel WLAN cards. In an Intel system, however, the WLAN cards worked without any problems. It’s a real shame that Intel has (apparently) “artificially” limited the compatibility here.     Save my name, email, and website in this browser for the next time I comment.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More "
}