{
    "title": "Intel Core i3-1315U vs AMD Ryzen 7 7840HS vs AMD Ryzen 5 7640HS",
    "date": "3/15/2024",
    "url": "https://www.notebookcheck.com/i3-1315U-vs-R7-7840HS-vs-R5-7640HS_14920_14948_14950.247552.0.html",
    "text": "Der Intel Core i3-1315U ist eine Einstiegs-Notebook-CPU auf Basis der Raptor Lake-U Serie (Alder-Lake-Architektur), die im Januar 2023 vorgestellt wurde. Die CPU bietet 2 Performance Kerne (P-Kerne, Golden Cove Architektur) und 4 der 8 Effizienzkerne (E-Kerne, Gracemont Architektur). Die P-Kerne unterstützten Hyperthreading (daher gemeinsam 8 Threads) und takten von 1,2 bis 4,5 GHz. Die E-Kerne takten von 0,9 - 3,3 GHz und sollen eine vergleichbare Performance wie alte Skylake Kerne bieten (z.B. i7-6300HQ). Der Core i3 bietet keine vPro Features für Management. \nPerformance \nDie Performance sollte leicht oberhalb des alten Core i3-1215U liegen (-100 MHz P-Core Boost). \nGrafikeinheit \nWie auch der Vorgänger, integriert Intel in Alder Lake / Raptor Lake eine Intel Xe basierende Grafikeinheit namens Intel UHD Graphics. Beim 1315U sind 64 der 96 EUs aktiviert und takten mit bis zu 1,25 GHz. \nFeatures \nWie auch Tiger Lake, hat auch Raptor-Lake WiFi 6E und Thunderbolt 4 (4x) teilintegriert. Der integrierte Speicherkontroller unterstützt DDR5-4800, DDR4-3200, LPDDR5-5200 und LPDDR4x-4267. Der integrierte Gaussian and Neural Accelerator (GNA) ist nun in Version 3.0 verbaut. Die Media Engine Quick Sync 8 ist die selbe wie in Rocket Lake und unterstützt MPEG-2, AVC, VC-1 Decode, JPEG, VP8 Decode, VP9, HEVC und AV1 Decode. Der Chip unterstützt nur PCIe 4.0 (x8 for GPU und zwei x4 für SSDs). \nLeistungsaufnahme \nDer Intel Core i3-1315U ist mit 15 Watt (PL1) TDP und 55 Watt (PL2) max. Turbo Power angegeben. Gefertigt wird der Prozessor im weiter verbesserten Intel 7 Prozess (10 nm SuperFin). Der Intel Core i3-1315U ist eine Einstiegs-Notebook-CPU auf Basis der Raptor Lake-U Serie (Alder-Lake-Architektur), die im Januar 2023 vorgestellt wurde. Die CPU bietet 2 Performance Kerne (P-Kerne, Golden Cove Architektur) und 4 der 8 Effizienzkerne (E-Kerne, Gracemont Architektur). Die P-Kerne unterstützten Hyperthreading (daher gemeinsam 8 Threads) und takten von 1,2 bis 4,5 GHz. Die E-Kerne takten von 0,9 - 3,3 GHz und sollen eine vergleichbare Performance wie alte Skylake Kerne bieten (z.B. i7-6300HQ). Der Core i3 bietet keine vPro Features für Management. Performance Die Performance sollte leicht oberhalb des alten Core i3-1215U liegen (-100 MHz P-Core Boost). Grafikeinheit Wie auch der Vorgänger, integriert Intel in Alder Lake / Raptor Lake eine Intel Xe basierende Grafikeinheit namens Intel UHD Graphics. Beim 1315U sind 64 der 96 EUs aktiviert und takten mit bis zu 1,25 GHz. Features Wie auch Tiger Lake, hat auch Raptor-Lake WiFi 6E und Thunderbolt 4 (4x) teilintegriert. Der integrierte Speicherkontroller unterstützt DDR5-4800, DDR4-3200, LPDDR5-5200 und LPDDR4x-4267. Der integrierte Gaussian and Neural Accelerator (GNA) ist nun in Version 3.0 verbaut. Die Media Engine Quick Sync 8 ist die selbe wie in Rocket Lake und unterstützt MPEG-2, AVC, VC-1 Decode, JPEG, VP8 Decode, VP9, HEVC und AV1 Decode. Der Chip unterstützt nur PCIe 4.0 (x8 for GPU und zwei x4 für SSDs). Leistungsaufnahme Der Intel Core i3-1315U ist mit 15 Watt (PL1) TDP und 55 Watt (PL2) max. Turbo Power angegeben. Gefertigt wird der Prozessor im weiter verbesserten Intel 7 Prozess (10 nm SuperFin). Der AMD Ryzen 7 7840HS ist ein High-End-Notebook-Prozessor der Phoenix Serie mit 8-Kernen und Hyperthreading (SMT), womit dieser in Summe bis zu 16 Threads gleichzeitig verarbeiten kann. Die CPU nutzt die neue Zen 4 Architektur und taktet diese von 3,8 GHz (Basistakt) bis zu 5,1 GHz (Einzelkern-Boost). Die CPU bietet 8 MB L2-Cache und 16 MB L3-Cache. \nDie Performance des zweitschnellsten Modells der Phoenix-Serie sollte nur geringfügig hinter dem Ryzen 9 7940HS liegen (+100 - 200 MHz Takt, z.B. nur 2% langsamer Turbo). Dadurch sollte die Performance bei 54W TDP auch vergleichbar mit dem AMD Ryzen 7 7745HX (ebenfalls 8 Zen 4 Kerne, max 5,1 GHz, 55W, 32 MB L3) und damit deutlich vor dem alten Spitzenmodell AMD Ryzen 9 6980HX bzw. 6980HS (mit geringerem TDP). \nDer Chip integriert eine moderne RDNA 3 basierende Grafikkarte (iGPU) namens Radeon 780M mit 12 CUs und bis zu 2,7GHz inklusive AV1 Video-Engine. Erstmals ist auch eine Xilinx FPGA basierte XDNA AI Beschleuniger integriert. Dieser soll schneller sein als die AI-Engine im Apple M2 SoC. An Anschlüssen bietet Phoenix 2x USB 4 (40 Gbps), 20 PCIe 4.0 Lanes und einen Dual-Channel DDR5-5600 / LPDDR5x-7500 Speicherkontroller (mit ECC Support). \nDie Phoenix Serie ist ein einzelner Chip (im Unterschied zur Dragon Range 7045HX Serie) und wird bei TSMC im modernen 4nm FinFET Prozess gefertigt. Der AMD Ryzen 7 7840HS ist ein High-End-Notebook-Prozessor der Phoenix Serie mit 8-Kernen und Hyperthreading (SMT), womit dieser in Summe bis zu 16 Threads gleichzeitig verarbeiten kann. Die CPU nutzt die neue Zen 4 Architektur und taktet diese von 3,8 GHz (Basistakt) bis zu 5,1 GHz (Einzelkern-Boost). Die CPU bietet 8 MB L2-Cache und 16 MB L3-Cache. Die Performance des zweitschnellsten Modells der Phoenix-Serie sollte nur geringfügig hinter dem Ryzen 9 7940HS liegen (+100 - 200 MHz Takt, z.B. nur 2% langsamer Turbo). Dadurch sollte die Performance bei 54W TDP auch vergleichbar mit dem AMD Ryzen 7 7745HX (ebenfalls 8 Zen 4 Kerne, max 5,1 GHz, 55W, 32 MB L3) und damit deutlich vor dem alten Spitzenmodell AMD Ryzen 9 6980HX bzw. 6980HS (mit geringerem TDP). Der Chip integriert eine moderne RDNA 3 basierende Grafikkarte (iGPU) namens Radeon 780M mit 12 CUs und bis zu 2,7GHz inklusive AV1 Video-Engine. Erstmals ist auch eine Xilinx FPGA basierte XDNA AI Beschleuniger integriert. Dieser soll schneller sein als die AI-Engine im Apple M2 SoC. An Anschlüssen bietet Phoenix 2x USB 4 (40 Gbps), 20 PCIe 4.0 Lanes und einen Dual-Channel DDR5-5600 / LPDDR5x-7500 Speicherkontroller (mit ECC Support). Die Phoenix Serie ist ein einzelner Chip (im Unterschied zur Dragon Range 7045HX Serie) und wird bei TSMC im modernen 4nm FinFET Prozess gefertigt. Der AMD Ryzen 5 7640HS ist ein High-End-Notebook-Prozessor der Phoenix Serie mit 6-Kernen und Hyperthreading (SMT), womit dieser in Summe bis zu 12 Threads gleichzeitig verarbeiten kann. Die CPU nutzt die neue Zen 4 Architektur und taktet diese von 4,3 GHz (Basistakt) bis zu 5 GHz (Einzelkern-Boost). Die CPU bietet 6 MB L2-Cache und 16 MB L3-Cache. \nDurch die reduzierte Kernanzahl (6 der 8 Kerne des Chips) ist die Mulitthread-Performance des Ryzen 5 deutlich schwächer als bei den beiden schnelleren Modellen (Ryzen 7 7840HS, Ryzen 9 7940HS). Vergleichen zur etwas schnelleren HX Serie, sollte der 7640HS (bei 54W TDP) sich knapp hinter dem Ryzen 5 7645HX einordnen. \nDer Chip integriert eine moderne RDNA 3 basierende Grafikkarte (iGPU) namens Radeon 760M mit 8 CUs und bis zu 2,6 GHz inklusive AV1 Video-Engine. Erstmals ist auch eine Xilinx FPGA basierte XDNA AI Beschleuniger integriert. Dieser soll schneller sein als die AI-Engine im Apple M2 SoC. An Anschlüssen bietet Phoenix 2x USB 4 (40 Gbps), 20 PCIe 4.0 Lanes und einen Dual-Channel DDR5-5600 / LPDDR5x-7500 Speicherkontroller (mit ECC Support). \nDie Phoenix Serie ist ein einzelner Chip (im Unterschied zur Dragon Range 7045HX Serie) und wird bei TSMC im modernen 4nm FinFET Prozess gefertigt. Der AMD Ryzen 5 7640HS ist ein High-End-Notebook-Prozessor der Phoenix Serie mit 6-Kernen und Hyperthreading (SMT), womit dieser in Summe bis zu 12 Threads gleichzeitig verarbeiten kann. Die CPU nutzt die neue Zen 4 Architektur und taktet diese von 4,3 GHz (Basistakt) bis zu 5 GHz (Einzelkern-Boost). Die CPU bietet 6 MB L2-Cache und 16 MB L3-Cache. Durch die reduzierte Kernanzahl (6 der 8 Kerne des Chips) ist die Mulitthread-Performance des Ryzen 5 deutlich schwächer als bei den beiden schnelleren Modellen (Ryzen 7 7840HS, Ryzen 9 7940HS). Vergleichen zur etwas schnelleren HX Serie, sollte der 7640HS (bei 54W TDP) sich knapp hinter dem Ryzen 5 7645HX einordnen. Der Chip integriert eine moderne RDNA 3 basierende Grafikkarte (iGPU) namens Radeon 760M mit 8 CUs und bis zu 2,6 GHz inklusive AV1 Video-Engine. Erstmals ist auch eine Xilinx FPGA basierte XDNA AI Beschleuniger integriert. Dieser soll schneller sein als die AI-Engine im Apple M2 SoC. An Anschlüssen bietet Phoenix 2x USB 4 (40 Gbps), 20 PCIe 4.0 Lanes und einen Dual-Channel DDR5-5600 / LPDDR5x-7500 Speicherkontroller (mit ECC Support). Die Phoenix Serie ist ein einzelner Chip (im Unterschied zur Dragon Range 7045HX Serie) und wird bei TSMC im modernen 4nm FinFET Prozess gefertigt. #0 checking url part for id 14920 +0s ... 0s #1 checking url part for id 14948 +0s ... 0s #2 checking url part for id 14950 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.038s ... 0.039s #6 did output specs +0s ... 0.039s #7 getting avg benchmarks for device 14920 +0.003s ... 0.042s #8 got single benchmarks 14920 +0.01s ... 0.051s #9 getting avg benchmarks for device 14948 +0.016s ... 0.068s #10 got single benchmarks 14948 +0.056s ... 0.124s #11 getting avg benchmarks for device 14950 +0.019s ... 0.143s #12 got single benchmarks 14950 +0.019s ... 0.162s #13 got avg benchmarks for devices +0s ... 0.162s #14 min, max, avg, median took s +0.237s ... 0.398s #15 return log +0s ... 0.398s "
}