{
    "title": "Advanced Micro Devices (NASDAQ:AMD) Trading Up 0.5%",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/31/advanced-micro-devices-nasdaqamd-trading-up-0-5.html",
    "text": "Posted by Defense World Staff on Mar 31st, 2024 Shares of Advanced Micro Devices, Inc. (NASDAQ:AMD – Get Free Report) shot up 0.5% on Friday . The company traded as high as $183.40 and last traded at $180.49. 57,628,614 shares traded hands during trading, a decline of 27% from the average session volume of 78,801,392 shares. The stock had previously closed at $179.59. A number of research firms recently weighed in on AMD. JPMorgan Chase & Co. boosted their target price on Advanced Micro Devices from $115.00 to $180.00 and gave the stock a “neutral” rating in a report on Wednesday, January 31st. KeyCorp upped their price objective on Advanced Micro Devices from $195.00 to $270.00 and gave the company an “overweight” rating in a report on Wednesday, January 31st. The Goldman Sachs Group upped their price objective on Advanced Micro Devices from $157.00 to $180.00 and gave the company a “buy” rating in a report on Wednesday, January 31st. Rosenblatt Securities  reaffirmed a “buy” rating and issued a $200.00 price objective on shares of Advanced Micro Devices in a report on Tuesday, January 30th. Finally, Roth Mkm upped their price objective on Advanced Micro Devices from $125.00 to $190.00 and gave the company a “buy” rating in a report on Wednesday, January 31st. Four equities research analysts have rated the stock with a hold rating and twenty-five have given a buy rating to the stock. According to MarketBeat, the company currently has an average rating of “Moderate Buy” and an average target price of $181.82. Read Our Latest Report on AMD The company has a current ratio of 2.51, a quick ratio of 1.86 and a debt-to-equity ratio of 0.03. The firm has a market capitalization of $291.70 billion, a P/E ratio of 347.10, a P/E/G ratio of 2.70 and a beta of 1.66. The firm has a 50-day moving average of $181.50 and a two-hundred day moving average of $141.76. Advanced Micro Devices (NASDAQ:AMD – Get Free Report) last posted its earnings results on Tuesday, January 30th. The semiconductor manufacturer reported $0.77 EPS for the quarter, meeting the consensus estimate of $0.77. The firm had revenue of $6.17 billion during the quarter, compared to the consensus estimate of $6.13 billion. Advanced Micro Devices had a return on equity of 5.73% and a net margin of 3.77%. The business’s quarterly revenue was up 10.2% on a year-over-year basis. During the same period last year, the company earned $0.54 earnings per share.  On average, analysts anticipate that  Advanced Micro Devices, Inc. will post 2.67 EPS for the current year. In other Advanced Micro Devices news, Director Joseph A. Householder sold 6,572 shares of the stock in a transaction dated Monday, March 4th. The stock was sold at an average price of $208.08, for a total value of $1,367,501.76. Following the completion of the transaction, the director now directly owns 2,197 shares in the company, valued at $457,151.76. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available through the SEC website. In other news, Director Joseph A. Householder sold 6,572 shares of the stock in a transaction dated Monday, March 4th. The stock was sold at an average price of $208.08, for a total value of $1,367,501.76. Following the completion of the sale, the director now owns 2,197 shares of the company’s stock, valued at $457,151.76. The sale was disclosed in a legal filing with the SEC, which is available at this link. Also, insider Victor Peng sold 100,000 shares of the stock in a transaction dated Friday, February 2nd. The shares were sold at an average price of $175.11, for a total value of $17,511,000.00. Following the completion of the sale, the insider now directly owns 241,266 shares of the company’s stock, valued at approximately $42,248,089.26. The disclosure for this sale can be found here. Over the last three months, insiders sold 324,943 shares of company stock worth $59,919,994. 0.73% of the stock is currently owned by insiders. Several institutional investors and hedge funds have recently made changes to their positions in AMD. Norges Bank acquired a new stake in  Advanced Micro Devices in the fourth quarter valued at approximately $3,426,529,000.  Moneta Group Investment Advisors LLC grew its stake in  Advanced Micro Devices by 105,415.5% in the fourth quarter. Moneta Group Investment Advisors LLC now owns 8,526,710 shares of the semiconductor manufacturer’s stock valued at $552,275,000 after acquiring an additional 8,518,629 shares during the period.  Renaissance Technologies LLC bought a new position in shares of  Advanced Micro Devices in the first quarter valued at approximately $777,111,000.  Viking Global Investors LP bought a new position in shares of  Advanced Micro Devices in the fourth quarter valued at approximately $698,340,000.  Finally, Northern Trust Corp lifted its holdings in shares of  Advanced Micro Devices by 35.5% in the first quarter. Northern Trust Corp now owns 17,086,683 shares of the semiconductor manufacturer’s stock valued at $1,868,258,000 after purchasing an additional 4,475,368 shares in the last quarter. Institutional investors and hedge funds own  71.34% of the company’s stock. (Get Free Report) Advanced Micro Devices, Inc operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products.  Receive News & Ratings for Advanced Micro Devices Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Advanced Micro Devices and related companies with MarketBeat.com's FREE daily email newsletter. Head-To-Head Review: RealReal (REAL) and Its Competitors PACCAR (NASDAQ:PCAR) Stock Price Down 0.5% "
}