{
    "title": "Hackers could target AMD CPUs by using ZenHammer attacks",
    "date": "3/28/2024",
    "url": "https://windowsreport.com/hackers-could-target-amd-cpus-by-using-zenhammer-attacks/",
    "text": "Follow us Share this article Latest news Hackers could steal your data and gain control of your device 2 min. read Published on March 29, 2024 published on \n\nMarch 29, 2024 Share this article Read the affiliate disclosure page to find out how can you help Windows Report effortlessly and without spending any money. Read more Soon, hackers might use ZenHammer, a Dynamic Random Access Memory (DRAM) attack, to target AMD processors. This method worked only on Intel and Arm processors. However, according to its creators, the hack only works in theory. Yet, they said that it could work in the real world. In the past, AMD’s handling technique on the DRAM tech protected them from Rowhammer attacks. Yet, the ZenHammer is an updated version. Thus, it is more effective than the previous method since it can target AMD’s DRAM. The ZenHammer attack is similar to its predecessor, Rowhammer. After all, it’s an exploit that manipulates DRAM data. It works by repeatedly accessing specific rows of memory cells, and it does this until it changes the value of bits from 1 to 0 or from 0 to 1. According to Bleeping Computer, this method is also known as bit flipping. Through it, hackers can corrupt data from the DRAM. Afterward, cybercriminals can steal cryptographic keys. If you didn’t know, they are similar to digital locks. Thus, threat actors can use them to access your private information, such as passwords, private information, and documents. In addition, through the ZenHammer attack, wrongdoers can change escalate privileges on your device. This way, they could allow themselves to install malicious files with malware into your device, steal more data, and damage your system. Ultimately, they could gain control over your device. Zen 2 is the most susceptible AMD Processor to ZenHammer attacks. Afterward, Zen 3 follows it with a 60% rate of being hacked. Yet, Zen 4 is the most resilient, with a 10% hacking rate. The huge difference is due to Zen 4 using DDR5 memory instead of DDR4. The DDR5 memory can defend better than DDR4 against ZenHammer attacks. After all, it has better characteristics and features. DDR5 has a higher refresh rate of 32ms and a built-in error correction code. Hopefully, the ZenHammer attack remains theoretical. After all, we don’t want someone to access our data, especially since it might give them control over our devices. Also, to defend against the ZenHammer attack, consider upgrading your processor from DDR4 to DDR5. What are your thoughts? Will you upgrade your processor as a preventive measure? Let us know in the comments. More about the topics: amd, Cybersecurity, intel Sebastian Filipoiu Sebastian Filipoiu Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}