{
    "title": null,
    "date": "3/22/2024",
    "url": "https://www.windowslatest.com/2024/03/23/windows-11-gets-march-2024-drivers-from-intel-amd-and-nvidia/",
    "text": "March 2024 driver updates are now available for Windows 11 or 10 from Intel, AMD, and Nvidia. These updates are designed to fix bugs and help some games run better on your devices. Important driver updates will be offered via Windows Update, so you don’t need to rush for drivers when you don’t need these fixes. Let’s first take a closer look at Intel’s updated GPU drivers. According to release notes, Intel has released an update for its graphics drivers, which support a range of hardware, including Arc, Iris Xe, and Core Ultra. Intel GPU driver version 31.0.101.5379 optimizes several popular games, such as Diablo IV and The Legend of the Condor Heroes. Notably, games like Sons of the Forest and Granblue Fantasy: Relink see performance boosts ranging from 5% to 174%. Intel published the graphics driver 31.0.101.5379 version on March 20, and you can grab the offline installer (gfx_win_101.5379.exe) on the company’s website. But we strongly recommend using Intel’s support assistant app, which is a web-based installer that quickly updates drivers. Also, you’ll find it in your system tray, so you can check for updates anytime. Here’s a full list of key fixes you’d see after the update: However, watch out for some known issues. Intel warns some of you may experience increased loading times for Horizon Forbidden West and potential crashes. One more thing: If you use Arc Pro Series workstation graphics, there’s also a new update for your gig, which increases the version to 31.0.101.5319 (WHQL), adds certifications for new software, and improves DirectX API optimizations. This update is especially beneficial for users of Autodesk 2024 software, and you can grab the offline installer from Intel’s website. AMD’s March 2024 driver release brings Adrenalin Edition 24.3.1, which fixes several issues, including micro stutter in games when AMD Fluid Motion Frames are enabled. There are also improvements for games like HELLDIVERS 2. Finally, some may notice World of Warcraft opens faster after the update. You can get the updated drivers directly on AMD’s website. Also, there’s an AMD chipset driver version 6.02.07.2300, which is available on the company’s website (installer now works) with minor fixes, but watch out for these issues: Nvidia GeForce version 551.86 brings support for Horizon Forbidden West Complete Edition with DLSS 3 technology, as well as the following changes: As shown in the above screenshot captured by Windows Latest, you can grab the update using the Nvidia GeForce app or the new unified app called Nvidia. Of course, if you’re looking for offline installers, you can get them directly from Nvidia (DCH). Remember, when you install any of these drivers, your screen could flash or turn black for a while, but that’s an expected behaviour. About The Author Mayank Parmar Mayank Parmar is an entrepreneur who founded Windows Latest. He is the Editor-in-Chief and has written on various topics in his seven years of career, but he is mostly known for his well-researched work on Microsoft's Windows. His articles and research works have been referred to by CNN, Business Insiders, Forbes, Fortune, CBS Interactive, Microsoft and many others over the years. Featured in "
}