{
    "title": "AMD FreeSync: New Requirements Guarantee at least 144 Hz",
    "date": "3/7/2024",
    "url": "https://basic-tutorials.com/news/amd-freesync-new-requirements-guarantee-at-least-144-hz/",
    "text": "Manufacturer AMD is currently taking the next steps in the field of technology. It was only on Tuesday that the company hinted at future AI support for FSR Super Resolution upscaling technology. Now they are updating the certifications for the AMD FreeSync display technology. In order to receive certification, gaming monitors and TVs must now deliver higher frame rates. AMD FreeSync was launched in 2015 as an alternative to NVIDIA’s G-Sync solution and has long been the top dog in the field of image synchronization technologies. Like its counterpart, FreeSync is designed to prevent tearing by adjusting the frame rate of the monitor to the frame rate of the respective game. The result is a smoother, clearer picture. However, the relevant standards for obtaining FreeSync certification have not changed since 2015. Back then, 60 Hz was considered normal and gaming displays with 120 Hz were a rarity. Today, however, the situation is completely different, which has now prompted AMD to adjust the standards for AMD FreeSync certification. The company announced this in a blog post on its own website. AMD divides FreeSync into three categories: FreeSync, FreeSync Premium and FreeSync Pro. For example, the simplest variant must now support low frame rate compensation (called LFC), enable low latency and achieve a frame rate of 144 Hz or more up to a horizontal resolution of 3,440 pixels. FreeSync Premium or FreeSync Premium Pro can be used for monitors and televisions above this number of pixels, i.e. with a 4K UHD resolution. In future, at least 120 Hz must be achieved here. Displays with a lower resolution will be certified from a frame rate of 200 Hz. However, this only applies to monitors and TVs; notebooks can already bear the FreeSync logo from a maximum refresh rate of 40-60 Hz. FreeSync Premium requires a frame rate of at least 120 Hz. According to AMD, the new requirements have already applied to new monitors and TVs since September 2023, although they have only now been publicly communicated. According to AMD, over 4,000 displays have already been FreeSync-certified, including TVs, monitors, notebooks and even games consoles. The official list of FreeSync monitors can be viewed on the provider’s website and currently includes 3,286 entries. Beginne die Diskussion → Neue Antworten laden... Gehört zum Inventar Manufacturer AMD is currently taking the next steps in the field of technology. It was only on Tuesday that the company hinted at future AI support for FSR Super Resolution upscaling technology. Now they are updating the certifications for the AMD FreeSync display technology. In order to receive certification, gaming monitors and TVs must now deliver higher frame rates. AMD FreeSync: New requirements for certification AMD FreeSync was launched in 2015 as an alternative to NVIDIA’s G-Sync solution and has long been the top dog in the field of image synchronization technologies. Like its counterpart, FreeSync is designed to prevent … (Weiterlesen...) Antworten\n Like Beteilige dich an der Diskussion in der Basic Tutorials Community → Contact us via one of our social media channels to send us your comments or suggestions for improvement. We look forward to your message! "
}