{
    "title": "Advanced Micro Devices, Inc. (NASDAQ:AMD) Position Reduced by Adage Capital \nPartners GP L.L.C.",
    "date": "3/3/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-amd-sec-filing-2024-03-03/",
    "text": "Adage Capital Partners GP L.L.C. decreased its position in shares of Advanced Micro Devices, Inc. (NASDAQ:AMD - Free Report) by 4.6% during the 3rd quarter, according to the company in its most recent Form 13F filing with the Securities and Exchange Commission (SEC). The institutional investor owned 1,426,394 shares of the semiconductor manufacturer's stock after selling 68,100 shares during the period. Adage Capital Partners GP L.L.C. owned 0.09% of Advanced Micro Devices worth $146,662,000 at the end of the most recent quarter. Other hedge funds and other institutional investors have also recently added to or reduced their stakes in the company. Financial Gravity Asset Management Inc. bought a new stake in Advanced Micro Devices during the second quarter worth approximately $2,908,000. Castleview Partners LLC increased its holdings in shares of Advanced Micro Devices by 62.5% in the second quarter. Castleview Partners LLC now owns 234 shares of the semiconductor manufacturer's stock valued at $27,000 after buying an additional 90 shares in the last quarter. Peoples Bank KS bought a new position in shares of Advanced Micro Devices in the third quarter valued at $26,000. Activest Wealth Management bought a new position in shares of Advanced Micro Devices in the third quarter valued at $26,000. Finally, Indiana Trust & Investment Management CO bought a new position in shares of Advanced Micro Devices in the third quarter valued at $31,000. Institutional investors own 68.43% of the company's stock. Analysts Set New Price Targets Several research analysts have issued reports on the company. Morgan Stanley upped their price target on Advanced Micro Devices from $128.00 to $193.00 and gave the company an \"overweight\" rating in a report on Monday, January 29th. Stifel Nicolaus reaffirmed a \"buy\" rating and issued a $145.00 price target on shares of Advanced Micro Devices in a report on Thursday, December 7th. New Street Research upgraded shares of Advanced Micro Devices from a \"neutral\" rating to a \"buy\" rating and set a $215.00 price objective on the stock in a research report on Wednesday, January 24th. Susquehanna lifted their price objective on shares of Advanced Micro Devices from $170.00 to $210.00 and gave the stock a \"positive\" rating in a research report on Monday, January 29th. Finally, Truist Financial lifted their price objective on shares of Advanced Micro Devices from $154.00 to $174.00 and gave the stock a \"hold\" rating in a research report on Wednesday, January 31st. Three investment analysts have rated the stock with a hold rating and twenty-five have issued a buy rating to the company. According to data from MarketBeat.com, Advanced Micro Devices currently has an average rating of \"Moderate Buy\" and an average price target of $179.06. View Our Latest Stock Analysis on Advanced Micro DevicesAdvanced Micro Devices Stock Performance AMD stock traded up $10.11 during mid-day trading on Friday, reaching $202.64. 103,820,773 shares of the stock traded hands, compared to its average volume of 59,012,584. The company has a quick ratio of 1.86, a current ratio of 2.51 and a debt-to-equity ratio of 0.03. Advanced Micro Devices, Inc. has a 52 week low of $76.65 and a 52 week high of $202.72. The business has a 50-day moving average of $164.32 and a two-hundred day moving average of $130.17. The firm has a market capitalization of $324.22 billion, a PE ratio of 389.70, a P/E/G ratio of 3.05 and a beta of 1.66. Advanced Micro Devices (NASDAQ:AMD - Get Free Report) last released its earnings results on Tuesday, January 30th. The semiconductor manufacturer reported $0.77 earnings per share for the quarter, meeting the consensus estimate of $0.77. Advanced Micro Devices had a net margin of 3.77% and a return on equity of 5.73%. The business had revenue of $6.17 billion during the quarter, compared to analysts' expectations of $6.13 billion. During the same quarter last year, the company earned $0.54 earnings per share. The firm's revenue was up 10.2% on a year-over-year basis. As a group, equities analysts predict that Advanced Micro Devices, Inc. will post 2.67 EPS for the current fiscal year. Insider Activity at Advanced Micro Devices In related news, EVP Mark D. Papermaster sold 16,200 shares of the stock in a transaction dated Thursday, February 15th. The shares were sold at an average price of $177.57, for a total value of $2,876,634.00. Following the completion of the sale, the executive vice president now owns 1,554,602 shares in the company, valued at $276,050,677.14. The transaction was disclosed in a filing with the SEC, which can be accessed through this link. In other Advanced Micro Devices news, CAO Darla M. Smith sold 4,000 shares of the firm's stock in a transaction dated Thursday, December 7th. The shares were sold at an average price of $125.69, for a total transaction of $502,760.00. Following the completion of the transaction, the chief accounting officer now owns 5,604 shares in the company, valued at $704,366.76. The sale was disclosed in a filing with the SEC, which can be accessed through the SEC website. Also, EVP Mark D. Papermaster sold 16,200 shares of the firm's stock in a transaction dated Thursday, February 15th. The stock was sold at an average price of $177.57, for a total transaction of $2,876,634.00. Following the transaction, the executive vice president now owns 1,554,602 shares of the company's stock, valued at approximately $276,050,677.14. The disclosure for this sale can be found here. Over the last 90 days, insiders sold 254,493 shares of company stock worth $40,152,154. Company insiders own 0.73% of the company's stock. Advanced Micro Devices Company Profile (Free Report) Advanced Micro Devices, Inc operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products.Further ReadingFive stocks we like better than Advanced Micro DevicesWhat is a Death Cross in Stocks?MarketBeat Week in Review – 2/26 - 3/1Trading Stocks: RSI and Why it's UsefulHow to Buy Bitcoin Stock: 3 Easy Ways to Do ItHow to invest in marijuana stocks in 7 steps Snowflake Stock Plunges, Don't be Fooled, Bargain Alert Want to see what other hedge funds are holding AMD? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Advanced Micro Devices, Inc. (NASDAQ:AMD - Free Report).This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ Bill Ackman will be blindsided by this event (From Porter & Company) (Ad)Should you invest $1,000 in Advanced Micro Devices right now?Before you consider Advanced Micro Devices, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Advanced Micro Devices wasn't on the list.While Advanced Micro Devices currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here The Next 7 Blockbuster Stocks for Growth InvestorsWondering what the next stocks will be that hit it big, with solid fundamentals? Click the link below to learn more about how your portfolio could bloom.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Advanced Micro Devices, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Advanced Micro Devices wasn't on the list. While Advanced Micro Devices currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering what the next stocks will be that hit it big, with solid fundamentals? Click the link below to learn more about how your portfolio could bloom. MarketBeat gives you seven stocks that you should be looking at to create your own Magnificent Seven in 2024. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}