{
    "title": "Computex 2024: AMD CEO to deliver opening keynote",
    "date": "3/14/2024",
    "url": "https://www.gadgetmatch.com/computex-2024-amd-ceo-to-deliver-opening-keynote/",
    "text": "Apple M3 MacBook Air Review Nothing Phone (2a) Review Apple Vision Pro Review: Part 2 Apple Vision Pro Review: Part 1 eufy X10 Pro Omni: Ultimate Hands-Free Cleaning Under $1,000 Xiaomi Watch S3 review: There’s nothing wrong with the familiar Rise of the Ronin has a blade that cuts deep X-Men 97 is astonishing Brothers: A Tale of Two Sons Remake review: A worthy upgrade The HONOR Magic6 Pro is a bonafide speedster eufy X10 Pro Omni: Ultimate Hands-Free Cleaning Under $1,000 The HONOR Magic V2 RSR will make your heart race Apple Vision Pro: Complete Unboxing & Set Up! OnePlus 12 Unboxing Samsung Galaxy S24 Ultra Unboxing and First 24 Hours Found: Cute smartphone to match your coquette aesthetic NissanConnect makes walk around checks easier Painting a slice of life with the OPPO Reno11 Pro 5G Apple Vision Pro: Complete Unboxing & Set Up! realme C67 hands-on: A budget phone revelation Stellar Blade First Impressions Horizon Forbidden West: PC requirements revealed ROG Ally bundle: Discount, Steam credits, free earbuds Rise of the Ronin kimono jackets released Eiyuden Chronicle: Hundred Heroes First Impressions Dyson Airstrait: Hair straightening with air, not heat Filipina who created Window Garden joins Google Play program Dyson unveils ‘most intelligent hair dryer’ yet Found: Cute smartphone to match your coquette aesthetic Supersonic r: Dyson’s lightest, smallest hair dryer yet Nissan launches Note e-Power in Singapore MediaTek unleashes AI-driven chipsets for smart cars The Nissan Almera is giving ~slay~ HONOR starts car engine using AI eye-tracking on phone NissanConnect makes walk around checks easier India imposes a ban on imported laptops, tablets, and PCs Samsung overtakes Xiaomi as top phone brand in India Apple is preparing to open its first stores in India India to enforce USB-C on all phones by 2024 India might force Apple to adopt USB-C soon HONOR Pad 9 Philippine pricing, availability ROG Ally bundle: Discount, Steam credits, free earbuds These Lenovo Legion, LOQ laptops come with free monitors Globe brings roaming data packages to GCash Smart Infinity treats members to exclusive golf tournament OPPO Reno11 F 5G Singapore pricing, availability Nissan launches Note e-Power in Singapore vivo V30 now in Singapore: Pricing, availability OPPO Watch X in Singapore: Price, availability Sharp unveils new FL1X TV series in Singapore Computex 2024 in Taiwan Published on By AMD Chair and CEO, Dr. Lisa Su will deliver the opening keynote at the Computex 2024 in Taiwan, the Taiwan External Trade Development Council (TAITRA) announced. Computex 2024 will be held from June 4 to 7 at the Taipei Nangang Exhibition Center Halls 1 and 2. Dr. Su will have her keynote address a day before the event’s proceedings. As her company is known for being a leading developer of computer processors and more, she is expected to discuss the next generation of AMD products, breakthrough AI capabilities, and intelligent devices. Dr. Su recently received the highest semiconductor honor from IEEE: the Robert N. Noyce Medal. A leading global technology exhibition, this year’s Computex will fittingly focus on the AI PC era. The event will cover six major themes: Computex 2024 will also feature partners like Acer, ASRock, ASUS, Delta, Gigabyte, G.Skill, Intel, MSI, Pro Gamersware, and more. Furthermore, there will be an InnoVEX exhibit for startups to connect teams from around the world. The event will be the 24th staging of the mid-year tech show in Taipei. Computex 2022 returns to a live event Acer, AMD, Intel, Qualcomm confirm participation in Computex 2021 Hybrid Computex 2020 is cancelled Unlocking smart technologies Published on By Tech companies continue to harness the power of AI to help provide consumers with better devices that are tailor-fit for today’s demands. Lenovo is no exception. At Lenovo’s Innovate 2024 event, the company gave its consumers a glimpse of its future lineup of Yoga, Legion, and LOQ devices for the Asia-Pacific market. In a nutshell, Lenovo calls these new devices the new standard in terms of what they can offer. The latest computers are all smarter and come equipped with the latest Intel Core Ultra processors (select models) and Copilot in Windows 11.  Basically, Lenovo has added even more innovative features, mostly AI-enabled, for all lineups. These enhancements make them even more exceptional. Lenovo consumers know by now what each specific lineup is exceptional at. For instance, the Lenovo Yoga lineup is mainly engineered to help creators. On the other hand, the Lenovo Legion devices are meant to handle gaming effortlessly, on top of other tasks.  To set the latest Yoga devices apart, Lenovo has equipped them with PureSight Pro and Puresight OLED displays. These color-calibrated screens deliver greater brightness, contrast, and accuracy that meet the demands of creators for precise visual work — whether it’s graphic design, photo editing, or video production. The Yoga laptops also have a Copilot key shortcut to assist users right away with the help of AI. Specifically, the Yoga 9i 2-in-1 and Yoga Pro 9i incorporate Lenovo AI Engine+ driven by Lenovo’s LA AI Core chips. This utilizes software machine learning algorithms, leading to a more optimized system performance. Lastly, the Yoga lineup is enhanced with Lenovo Creator Zone. This generative AI software turns text or sketches into visuals to aid creators. Select Yoga Pro laptops will also support image training, where creators can train a personalized model that learns and creates images that match their preferences.  On the gaming side, Lenovo’s Legion and LOQ products likewise now harness the capabilities of Lenovo LA AI Core chips. These allow higher FPS and improved power efficiency to handle titles better and provide gamers the top-tier experience. Furthermore, Lenovo has introduced the Legion Coldfront: Hyper thermal solution exclusively for the Intel-based Legion 7i and Legion 5i. This new cooling system transforms the airflow within the chassis, channeling hot air from the chips to optimize heat exchange.  LOQ laptops, meanwhile, debut the new hyperchamber thermal technology to keep processors cooler. This technology draws out up to an additional 25W power in Extreme Mode, while keeping temperatures lower. Here are the new Lenovo PCs to be introduced to the Asia-Pacific market, for your perusal.  The new Lenovo Yoga lineup includes:  Meanwhile, the latest generation Lenovo Legion and LOQ models include: New lineup includes the Strix SCAR 18 Published on By ASUS has officially unveiled the latest ROG Strix SCAR and Strix G laptops powered by 14th Gen Intel Core processors. The 2024 ROG Strix laptop series includes the Strix SCAR 18, the first 18-inch ROG gaming laptop. It comes equipped with a Mini LED ROG Nebuula HDR display and up to an NVIDIA GeForce RTX 4090 Laptop GPU. All new ROG Strix models also feature the latest Intel Core i9 14900HX processor. They’re also paired with the latest intelligent cooling improvements, like the Tri-Fan technology and Conductonaut Extreme liquid metal. The series headliner, the Strix SCAR 18 becomes the first ROG laptop with an 18-inch display powered by Mini LED. It has an exclusive Nebula HDR Display supports HDR content and games. It boasts over 2000 discrete dimming zones and 1,100 nits of peak brightness. This display is complemented by the ROG Nebula HDR Engine that minimizes blooming and haloing. Meanwhile, other Strix SCAR laptops feature 2.5K displays with 240Hz refresh rate and 3ms GTG response time. The screens have a 16:10 aspect ratio and 100% DCI-P3 color space. Furthermore, these panels support Dolby Vision for accurate colors. Aside from the displays, the SCAR and Strix G have received facelifts, sporting reimagined ROG cyberpunk design elements.  When it comes to performance, the new ROG Strix laptops all come with the latest Intel Core i9 14900HX processor. This processor can handle heavy rendering projects, as well as AAA game titles. To make sure usage is seamless, the laptops also have up to 32GB of DDR5 memory and up to 2TB of PCIe Gen 4 storage. In the graphics department, the Strix SCAR 16 has a GeForce RTX 4080 GPU, while the SCAR 18 offers up to a GeForce RTX 4090 GPU. These GPUS assure that the new laptops are prepared for even the most intense gamign sessions. Meanwhile, the Strix G16 comes equipped with up to a GeForce RTX 4060 GPU while the Strix G18 features a GeForce RTX 4070 GPU.  Lastly, ROG Strix laptops have improved intelligent cooling systems. Both the Strix SCAR and Strix G models utilizes Tri-Fan techology, a system that uses a third auxiliary fan to increase flow to the motherboard. It also helps reroute excess heat from the GPU towards the heatsink. Furthermore, the 2024 lineup features a high-performing Conductonaut Extreme liquid metal that reduces temperatures better than traditional thermal pastes. The ROG Strix SCAR and Strix G laptops are available in the Philippines for the following prices: The laptops also come with a complimentary warranty package. To purchase, visit ASUS and ROG concept stores or multi-brand stores. Built for portability and customization Published on By When looking for a new keyboard, two of the most important aspects are comfort and customizability. As always, Drop has those two in spades. Further adding to how many options you can grab from the company, Drop has announced the new CSTM65 keyboard. As the name suggests, the CSTM65 keyboard is a 65% keyboard. Despite its size, the keyboard still offers the same amount of customization as Drop’s other offerings. It complements the CSTM80, the brand’s 80% keyboard.  The keyboard features an interchangeable, magnetic case, which is available in aluminum or polycarbonate. Users can easily change the case to match their style. As always, users can also customize the keycaps, switches, and cables. The package offers either the tactile Gateron Brown Pro 3.0 or the linear Gateron Yellow KS3. Under the hood, the CSTM65 keyboard comes with per key RGB LEDs, custom ABS south-facing keycaps, PCBA mounted stabilizers, and 5-pin switch support. The CSTM65 keyboard is available now through Drop’s website. The barebones package will sell for US$ 79. An assembled kit will cost US$ 129. Customers can also grab a custom case — coming in black, white, Laser Purple, Skiidata Orange, and Shinai Green — for US$ 25. Finally, users can get an upgraded forged aluminum case for US$ 59. SEE ALSO: OnePlus is building its own mechanical keyboard For a budget-friendly price But falls short of dealing a fatal blow. We saw the first 3 episodes OPPO names BSS (Seventeen) as latest ambassadors Porsche Design Magic6 RSR is HONOR’s best flagship smartphone yet Nissan launches Note e-Power in Singapore Brothers: A Tale of Two Sons Remake review: A worthy upgrade PlayStation 5 Pro reportedly coming out later this year FFVII: Ever Crisis released for Southeast Asia, more Dyson unveils ‘most intelligent hair dryer’ yet MediaTek unleashes AI-driven chipsets for smart cars Copyright © 2020 GadgetMatch Pte. Ltd. "
}