{
    "title": "AMD, Apple, Qualcomm GPUs leak AI data in LeftoverLocals attacks",
    "date": "1/17/2024",
    "url": "https://www.bleepingcomputer.com/news/security/amd-apple-qualcomm-gpus-leak-ai-data-in-leftoverlocals-attacks/",
    "text": "Red Hat warns of backdoor in XZ tools used by most Linux distros Activision: Enable 2FA to secure accounts recently stolen by malware Cisco warns of password-spraying attacks targeting VPN services Decade-old Linux ‘wall’ bug helps make fake SUDO prompts, steal passwords It's surprisingly difficult for AI to create just a plain white image AT&T confirms data for 73 million customers leaked on hacker forum Vultur banking malware for Android poses as McAfee Security app Train to be an IT pro with this top bootcamp, less than $5 a course How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to open a Windows 11 Command Prompt as Administrator How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  A new vulnerability dubbed 'LeftoverLocals' affecting graphics processing units from AMD, Apple, Qualcomm, and Imagination Technologies allows retrieving data from the local memory space. Tracked as CVE-2023-4969, the security issue enables data recovery from vulnerable GPUs, especially in the context of large language models (LLMs) and machine learning (ML) processes. LeftoverLocals was discovered by Trail of Bits researchers Tyler Sorensen and Heidy Khlaaf, who reported it privately to the vendors before publishing a technical overview. The security flaw stems from the fact that some GPU frameworks do not isolate memory completely and one kernel running on the machine could read values in local memory written by another kernel. Trail of Bits researchers Tyler Sorensen and Heidy Khlaaf, who discovered and reported the vulnerability, explain that an adversary only needs to run a GPU compute application (e.g. OpenCL, Vulkan, Metal) to read data a user left in the GPU local memory. \"Using these, the attacker can read data that the victim has left in the GPU local memory simply by writing a GPU kernel that dumps uninitialized local memory\" - Trail of Bits LeftoverLocals lets attackers launch a 'listener' - a GPU kernel that reads from uninitialized local memory and can dump the data in a persistent location, such as the global memory. If the local memory is not cleared, the attacker can use the listener to read values left behind by the 'writer' - a program that stores values to local memory. The animation below shows how the writer and listener programs interact and how the latter can retrieve data from the former on affected GPUs.  The recovered data can reveal sensitive information about the victim's computations, including model inputs, outputs, weights, and intermediate computations. In a multi-tenant GPU context that run LLMs, LeftoverLocals can be used to listen in on other users' interactive sessions and recover from the GPU's local memory the data from the victim's \"writer\" process. The Trail of Bits researchers have created a proof of concept (PoC) to demonstrate LeftoverLocals and showed that an adversary can recover 5.5MB of data per GPU invocation, depending on the GPU framework. On an AMD Radeon RX 7900 XT powering the open-source LLM llama.cpp, an attacker can get as much as 181MB per query, which is sufficient to reconstruct the LLM's responses with high accuracy. Trail of Bits researchers discovered CVE-2023-4969 in September 2023 and informed CERT/CC to help coordinate the disclosure and patching efforts. Mitigation efforts are underway as some vendors already fixed it while others are still working on a way to develop and implement a defense mechanism. In the case of Apple, the latest iPhone 15 is unaffected and fixes became available for A17 and M3 processors but the issue persist on M2-powered computers. AMD informed that the following GPU models remain vulnerable as its engineers investigate effective mitigation strategies. Qualcomm has released a patch via firmware v2.0.7 that fixes LeftoverLocals in some chips but others remain vulnerable. Imagination released a fix in DDK v23.3 in December 2023. However, Google warned in January 2024 that some of the vendor's GPUs are still impacted. Intel, NVIDIA, and ARM GPUs have reported that the data leak problem doesn't impact their devices. Trail of Bits suggests that GPU vendors implement an automatic local memory clearing mechanism between kernel calls, ensuring isolation of sensitive data written by one process. While this approach might introduce some performance overhead, the researchers suggest that the trade-off is justified given the severity of the security implications. Other potential mitigations include avoiding multi-tenant GPU environments in security-critical scenarios and implementing user-level mitigations. Acer confirms Philippines employee data leaked on hacking forum ExpressVPN bug has been leaking some DNS requests for years AT&T confirms data for 73 million customers leaked on hacker forum INC Ransom threatens to leak 3TB of NHS Scotland stolen data $700 cybercrime software turns Raspberry Pi into an evasive fraud tool Arm doesn't make any hardware, they're a technology R&D licensing firm. There's no way non-existent hardware could be affected to begin with since the problem doesn't appear to be in the generalized ISA from Arm. It's in the implementation details in GPUs grafted onto the Arm based processors that are faulty.\n\nThis is one of those vulnerabilities that is probably a lot less relevant to most users unless they're running some compute model in the cloud. Even less relevant because the majority of such instances are going to be running on Nvidia hardware with CUDA, not AMD's migraine inducing ROCm, and definitely not on phones and Macs which are primarily single user environments. Patch when offered, don't worry about it otherwise. Not a member yet? Register Now Red Hat warns of backdoor in XZ tools used by most Linux distros AT&T confirms data for 73 million customers leaked on hacker forum Terms of Use -  Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2024  Bleeping Computer® LLC  - All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited. "
}