{
    "title": "AMD Fluid Motion Frames now works in most DirectX games",
    "date": "1/24/2024",
    "url": "https://www.pcworld.com/article/2216804/amd-fluid-motion-frames-now-works-in-most-directx-games.html",
    "text": "When you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence. AMD’s latest Adrenalin driver has just been released and it’s a doozy. In addition to explicit support for the Radeon RX 7600 XT card and new titles such as Like a Dragon: Infinite Wealth and Tekken 8, the company’s FPS-boosting Fluid Motion Frames technology is expanding to most recent cards. It’s also available to “any DirectX 11 and 12 game,” which should mean pretty much anything released in the last decade or more. In ideal circumstances, it should be able to dramatically improve framerates. What exactly is AMD Fluid Motion Frames, abbreviated as the only-slightly-less-awkward “AFMF?” The company describes its interpolation tech as a “frame generation technology designed to increase frame rates and smooth movement for game winning performance with minimal impact to image quality.” The tech is available on any AMD card in the Radeon RX 6000 or 7000 family, mobile or desktop. It’s similar to, but distinct from, AMD’s FidelityFX Super Resolution, which competes with Nvidia DLSS. AMD makes some startling performance claims with this new driver-based technique. The notes for Adrenaline 24.1.1 say that in ideal circumstances it can boost framerates by “up to 103 percent” with AFMF and FSR 2 enabled at Quality Mode, tested versus baseline with the RX 7600 XT at 1440p resolution. AFMF only works with games in full screen mode and with v-sync disabled, and AMD does not recommend enabling it for fast-paced online multiplayer games, as it introduces additional visual latency. Other improvements in Adrenaline 24.1.1 include AMD’s take on video upscaling, applying similar tech to low-resolution videos on the web and local files. This can boost video quality up to 4K for common applications like Chrome, Edge, Windows Media Player, etc (only available on RX 7000 cards). We’ve seen similar, platform-agnostic tools from Microsoft, but this version should offload the task to your GPU. Michael is a former graphic designer who's been building and tweaking desktop computers for longer than he cares to admit. His interests include folk music, football, science fiction, and salsa verde, in no particular order. Business Laptop Mobile PC Hardware Deals Digital Magazine - Subscribe Manage Subscription Gift Subscription Newsletters "
}