{
    "title": null,
    "date": "1/25/2024",
    "url": "https://www.crictracker.com/fantasy-cricket-tips/dream11-pnl-vs-amd-dream11-prediction-fantasy-cricket-tips-playing-xi-pitch-report-injury-updates-for-match-36-of-ecs-cyprus-t10-2024/",
    "text": "Published - 25 Jan 2024, 15:45 IST | Updated - 25 Jan 2024, 15:56 IST View : 663 1 Min Read Table Of Contents Preview Get ready for an exciting clash at the Ypsonas Cricket Ground, Limassol, as MSN Punjab Lions (PNL) face off against Amdocs CC (AMD) in Match 36 of the ECS Cyprus T10 2024. Both teams, belonging to Group B, are set to bring their A-game to the field. In the ongoing tournament, MSN Punjab Lions have been in exceptional form, winning five out of the six matches they've played. On the other hand, Amdocs CC have also had a commendable run, securing victory in three out of the four matches they've contested. In their recent match against Nicosia Fighters, MSN Punjab Lions displayed dominance, securing a convincing 61-run victory. MSN Punjab Lions posted a formidable total of 163 runs for the loss of five wickets in 10 overs. Mangala Gunasekara's stellar performance, scoring 73 runs and taking two wickets, was a key highlight. Neeraj Tiwari contributed with 38 runs and also chipped in with one wicket. Manzoor Ali added to the bowling attack with one wicket, contributing to Nicosia Fighters being restricted to 102 runs for the loss of 6 wickets. Amdocs CC, in their recent encounter against Black Caps, showcased their skills and emerged victorious by 22 runs. Amdocs CC set a challenging target of 128 runs for the loss of three wickets in 10 overs. Preetaj Deol played a crucial role with the bat, scoring 54 runs, while Chaitas Shah contributed with 40 runs. Vinod Sawant played his part in the bowling department, taking one wicket. Amdocs CC's bowlers then restricted Black Caps to 106 runs for the loss of six wickets. Match Information ECS Cyprus T10, 25 Jan 2024, Thur, 6:15 PM IST, Ypsonas Cricket Ground, Limassol Live Stream FanCode Weather Report Clouds 30% (Humidity) Team Form (Last 5 matches) Punjab Lions CC PNL vs AMD ECS Cyprus T10 NFC vs PNL ECS Cyprus T10 NFC vs PNL ECS Cyprus T10 NRK vs PNL ECS Cyprus T10 NRK vs PNL ECS Cyprus T10 Amdocs CC PNL vs AMD ECS Cyprus T10 AMD vs BCP ECS Cyprus T10 AMD vs BCP ECS Cyprus T10 AMD vs NFC ECS Cyprus T10 AMD vs NFC ECS Cyprus T10 Probable Playing XI Punjab Lions CC Zeeshan Mehamood, Mangala Gunasekara (C), T Singh-I, Chami Kumara, Prasad Suranga, Neeraj Kumar Tiwari, P Wellege (wk), H Singh, Gurdeep Sharma, Vikram Verma, Manzoor Ali Bench : I Muhammad, Harvinder Singh, Amandeep Singh, Kapila Hemantha, M Mohommed, I Madushan, T Jayakodi, B Ranasinghe, A Dantuluri, Denuwan Prarthana, Vansham, Nalin Gamage, Muhammad Bilal Amdocs CC Preetaj Deol (C), Chaitas Shah, Vimal Khanduri, V Sawant, Gaurav Sagwan, Ketan Dhane, Sagar Sanap, P Parvesh, R Shukla, A Nath, Hitesh Thadani Bench : Srikanth Komiripalepu, Ramana Katakam, Santosh Manda, Abbas Kazi, R Dhanotiya, A Singh, Prashant Bhagat, D Patel, Puneet Abichandani, P Rai, P Rai, Hareesh Kakita, Hareesh Kakita, Akhilesh Karande, Akhilesh Karande, S Vijayan, S Vijayan Injury and availability news Pitch Report 70% Pace Bowling 30% Spin Bowling 50% Batting Pitch Average Score 50% Bowling Pitch Player Picks Mangala Gunasekara PNL |  ALL The dynamic all-rounder, Mangala Gunasekara, has been a force to reckon with in this tournament. With an impressive performance of 170 runs and six wickets, Gunasekara brings a perfect blend of batting and bowling prowess to the MSN Punjab Lions. Vinod Sawant AMD |  BAT Amdocs CC boasts the all-round capabilities of Vinod Sawant, who has made valuable contributions with both bat and ball. Sawant has scored 80 runs and taken three wickets in the ECS Cyprus T10 2024, showcasing his versatility. Avoid Having These Players In Your Fantasy Sports Team Rahul Shukla AMD |  BOWL His bowling performance has been unimpressive in the last few matches, so he can be avoided in your fantasy team. Ketan Dhane AMD |  BAT He did not get any opportunity to bat in this tournament, so he can be avoided in your fantasy team. Last Updated On  - Jan 25 2024 3:56 PM Players 11/11 Team 1 6 : 5 Credits Left 9.5/100 8 8.5 8 8.5 7 8.5 8.5 9 8.5 8 8 More Match Details Get every cricket updates! Follow Us: Note Disclaimer Download Our App © 2013 - 2024 CricTracker Pvt Ltd All rights reserved. "
}