{
    "title": "What is AMD FSR? Everything we know about the DLSS rival",
    "date": "1/23/2024",
    "url": "https://www.club386.com/what-is-amd-fsr-everything-we-know-about-the-dlss-rival/",
    "text": "Bigger resolution and frame rates, smaller performance cost. Jump to: Compatibility | FSR 1 | FSR 2 | FSR 3 | Conclusion AMD FSR (FidelityFX Super Resolution) is a rendering feature that Team Red designed to help you get better frame rates in games. Unlike its rival, Nvidia DLSS, FSR is open-source. This means it officially works with all the best graphics cards, and unofficially even works with Intel integrated GPUs. Not all games support the feature and there are many different versions, some better than others. Here’s everything you need to know about the supersampler, including how it works, its compatibility, and what to expect. Monitor resolutions and refresh rates are climbing faster than PC components can keep up with. Pair that with the ever-increasing system requirements to run games, and it’s a difficult battle. Instead of raw power pushing native pixels, graphics card vendors sought alternative ways to lower performance overheads. As a result, we turn our attention to upscalers. The first upscaling solution for games was basic to say the least. It took the colour of each pixel and its surroundings to guess what the intermediary ones would look like. The end result looked muddy, and details weren’t the best. Nvidia changed this with DLSS in its RTX 20 lineup, spurring AMD FSR as a counterpoint. It doesn’t do AMD FSR justice simply calling it an upscaler, but the term summarises the internal process nicely. In a nutshell, your GPU renders a lower-resolution image and then artificially lifts it to a higher resolution. We’ve seen the technique plenty in video, but pre-compiled media isn’t as demanding. Games constantly change depending on user inputs, creating frames in real time. They need fresh data, and quickly, to avoid introducing latency. Fortunately, games are quite flexible, running at different resolutions and separating into multiple layers you can manage independently. That’s why upscaling technologies are so effective. On the surface, upscaling in games is straightforward. Using a lower native resolution alleviates GPU load and performance pressure. Your PC then only needs to allocate resources for the upscaler, which does most of the heavy lifting, bringing the resolution back up in a less demanding way. Behind the scenes, though, it’s as complicated as technology comes. Some rely on artificial intelligence, creating system requirements of their own, while others, like FSR, are much more hardware-friendly. AMD lists any Nvidia GTX 10 series and AMD Radeon RX 400 series GPU or later as compatible with FSR. If your model isn’t on the list below, it’ll be trial and error. Fortunately, the chances are it should pair just fine: We know that FSR works with a lot more than this list, including the GeForce GTX 900 Series. Since AMD doesn’t use an AI-powered approach requiring specific hardware, it’s open to much more than Nvidia DLSS. Note that this list doesn’t include Intel Arc simply because FSR predates the GPU releases. Like Nvidia DLSS, there are several AMD FSR versions and updates. Most notably, there’s FSR 1, FSR 2, FSR 2.2, and FSR 3. FSR 1, i.e. AMD FidelityFX Super Resolution, is a spatial upscaler. It works by taking a lower-resolution frame and upscaling it to the display’s resolution without relying on other data, such as frame history or motion vectors. The feature relies on an algorithm that detects and recreates high-resolution edges from the source frame. FSR 1 does this in two steps. First, it takes the frame through an upscaling pass called EASU (Edge-Adaptive Spatial Upsampling) that also performs edge reconstruction. Then, it puts it through a sharpening pass called RCAS (Robust Contrast-Adaptive Sharpening) to extract more details, i.e. make it less blurry. Therefore, FSR 1 runs its magic before adding effects such as Film Grain and Chromatic Aberration to avoid introducing noise to the final image. Compared to the first gen, FSR 2 starts earlier in the frame pipeline and uses a Depth Buffer, Motion Vector, and Colour Buffer to render the final image. Since it replaces TAA (Temporal Anti-Aliasing), any post-processing that requires Anti-Aliasing must come after the upscaling phase. The same is true for post-processing effects that require a Depth Buffer. In other words, FSR 2 is a temporal and not a spatial upscaler. FSR 2 was followed by FSR 2.1 and FSR 2.2, each of which aimed to reduce ghosting on fast-moving objects as well as improve image quality. It’s particularly significant for racing games. While more complex than the first version, FSR 2 results in a better final image. However, this result will also depend on your selection parameter. Like its predecessor, FSR 2 offers multiple quality options. They are named, Quality, Balanced, Performance, and Ultra Performance. Each step down lowers the input resolution to extract more performance/fps, but can impact the quality. The higher your selected resolution, the more demanding it is to render, lowering your fps. If a 1080p resolution totals some 2,073,600 pixels, Ultra HD has four times that at 8,294,400 pixels. Roughly four times the resolution will quarter your frame rate without more GPU horsepower to hand. Even top graphics cards struggle in this area. This is why GPU manufacturers have developed alternative solutions like DLSS, FSR, and XeSS. The idea is to render most of the game parts at a lower resolution, then upscale it using algorithms or AI to simulate a higher resolution result. For example, FSR 2 Performance mode renders the game at 960 x 540, upscales it, then outputs a 1920 x 1080 image. Meaning four times fewer pixels to calculate. This way, your GPU can make more frames per second, subsequently enhancing the fluidity of your games. Naturally, the higher the input resolution, the better the output image will be because the algorithm has more data to work with. A lower starting point is still better than dealing with choppy gameplay, but you trade image quality for higher frame rates. This applies to all upscaling technologies. FSR 3 is the latest major version of AMD’s upscaling efforts. Like DLSS 3, it’s paired with frame generation technology. Team Red’s version is called FSR 3 Frame Generation or Fluid Motion Frames (FMF for short). FMF is entirely optional for developers and works by slotting an artificial frame in between two native ones. The technology renders two ‘normal frames’, holds them, and then generates a new frame based on the differences between the two before sandwiching it. While it also uses Motion Vectors and Optical Flow, this extra frame costs less render time than a ‘real frame’, effectively doubling the fps at minimum cost. However, since we’re not living in a wizard’s world, there must be a price. The Law of Equivalent Exchange, if you will. That price comes in the form of a higher latency. Since the GPU has to hold the most recent frame to generate the one in between, your inputs are subsequently delayed. You can reduce this delay using technologies such as AMD Anti-Lag, but not totally nullify it. A traditional render would still be faster. Additionally, Frame Generation runs best when interpolating from a minimum of 60fps since lower fps may cause visual artefacts. Frame Generation won’t result in double the fps in real-world scenarios, but more like a 70% increase. You can, however, combine it with traditional FSR 3 upscaling to get even more. Just like the others, FSR 3 doesn’t use an AI-accelerated solution. To generate these extra frames, AMD uses an algorithm to keep wide compatibility. It’s wide enough that even Nvidia GeForce cards that don’t have tensor cores (non-RTX models) can get frame generation thanks to AMD. The brand says it works best on its own cards running RDNA graphics (AMD Radeon RX 5000 and later), but we’ve yet to see any real-world difference between manufacturers using FMF. Lastly, FSR 3 adds a new quality mode, Native AA, which is a pure anti-aliasing option without any upscaling. This is seen as a nice companion to Frame Generation as it provides a higher-quality image for the algorithm to work with. The beginning of FSR 3 Frame Generation was rough, but with the recent optimisation, the results are much better with fewer artefacts. The best example currently is Avatar: Frontiers of Pandora. RSR (Radeon Super Resolution) is basically FSR but on a driver level, i.e. you can enable it in games that don’t support FSR. That said, it does require exclusive full-screen support and a Radeon RX 5000 GPU or newer. Since it doesn’t integrate within the game render pipeline, the quality is lower than a proper implementation of FSR 2, for example. So, in conclusion, FSR 1 is better than a basic monitor or game upscaling option, offering an OK image quality but nothing groundbreaking. FSR 2, which is much more widely used, provides a noticeable image quality improvement without requiring dedicated hardware like DLSS 2. And FSR 3 builds on FSR 2 and introduces frame generation, which creates new frames in between traditional ones to improve the perceived smoothness of games. While upscaling technologies already offer some compelling advantages and good enough results to be considered by gamers, we are still in the development phase, with new versions and features coming up continuously. Unless some new disturbing technology comes to drastically improve the GPU render pipeline, upscaling is here to stay – whether we like it or not. AIO\nAlder Lake\nAMD\nAOC\nApple\nArc\nASRock\nAsus\nBusiness\nCES\nchassis\nCooler\ncooling\nCorsair\nCPU\nDDR5\ndeals\nDrivers\ngaming\nGeForce\nGigabyte\nGPU\nhandheld\nIntel\nKeyboard\nLaptop\nM.2\nmemory\nMicrosoft\nmods\nmonitor\nMotherboard\nMSI\nNvidia\nPlayStation\nPSU\nRadeon\nRTX\nRTX 40-series\nRyzen\nSamsung\nSony\nSSD\nWindows 11\nXbox About | Contact | Editorial Policies | News Tip Advertise | Privacy | Newsletter | Donate "
}