{
    "title": "AMD FSR Upscaling Tech Coming To YouTube & VLC, Fluid Motion Frames Goes \nOfficial On 24th January",
    "date": "1/11/2024",
    "url": "https://wccftech.com/amd-fsr-upscaling-tech-coming-youtube-vlc-fluid-motion-frames-official-24th-january/",
    "text": "AMD has announced that its FSR upscaling tech is coming to YouTube & VLC while Fluid Motion Frames will be out of BETA on 24th January. The news comes from TweakTown, who have reported that AMD is preparing a new FSR feature that will target video content, particularly those at consumer applications such as YouTube and VLC. AMD says that the update will be part of the Radeon Adrenalin Software, and video upscaling is currently under development. Now video upscaling through FSR is going to be a direct competitor to NVIDIA's RTX Video Super Resolution, which debuted almost a year ago at CES 2023. The AI-boosting software uses Tensor Core acceleration to deliver upscaled video & video playback across various platforms such as YouTube & Twitch with support on Chromium browsers, Microsoft's Edge browser, and streaming services as well. However, with FSR, things will heat up in this segment and it will be interesting to see what sort of a difference does the two technologies bring onboard. Team Green has recently upgraded RTX Video Super Resolution as well, with a new version 1.5, which has made things much more competitive. Speaking of FSR performance, AMD did show a glimpse of video upscaling through FSR, where the firm managed to bump up the resolution from native 720p to 1440p, and while the difference is noticeable in the included image demo, we can't see the wider picture unless a running sample is shown to us, which we do expect Team Red to unveil in the upcoming days. FSR isn't just limited to YouTube since it is said that AMD is preparing to integrate it at VLC, the famous media player, which will get a \"Radeon-specific\" update by Q1 2024, that is expected to bring in features such as upscaling and noise reduction through hardware implementation. VLC already supports NVIDIA's RTX Video Super Resolution hence FSR will go head-to-head here as well. In addition to FSR Video Super Resolution, AMD's Fluid Motion Frames technology (AFMF) will also be leaving its Technical Preview state on the 24th of January. The technology will become an official part of the main driver branch which would mean that everyone with a support GPU can enjoy the FPS-boosting frame-generation feature that can be enabled via the drivers. The technology comes with support for almost every DX12 and DX11 title and can be enabled via a simple toggle. It works great for handheld and laptop devices where integrated GPUs can benefit. The Radeon RX 7600 XT also launches the same day so expect lots of action in the coming weeks. News Sources: TweakTown, PCGamer Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}