{
    "title": "AMD Ryzen 5 8600G Desktop Processor with Radeon 760M IGP Spotted in \nGeekBench",
    "date": "1/3/2024",
    "url": "https://www.guru3d.com/story/amd-ryzen-5-8600g-desktop-processor-with-radeon-760m-igp-spotted-in-geekbench/",
    "text": "Published 2024-01-03 08:42 by Hilbert Hagedoorn Benchmark scores for the Ryzen 5 8600G's Radeon 760M IGPU indicate substantial performance, achieving 24,842 in OpenCL and 30,770 in Vulkan. These results denote an approximate twenty percent enhancement over the Ryzen 5 7640HS laptop processors with the same GPU. The Ryzen 5 8600G features a 6-core/12-thread CPU based on the Zen 4 architecture. Each core is accompanied by 1 MB of L2 cache, complemented by a shared 16 MB L3 cache. The CPU's base and maximum boost frequencies are 4.35 GHz and 5.00 GHz, respectively. These frequencies are akin to the mobile Ryzen 5 7640H. Enhanced by a 65 W Thermal Design Power (TDP) and a possible 90 W Package Power Tracking (PPT), the 8600G offers improved boost frequency performance. The APU's Radeon 760M GPU utilizes 8 out of the available 12 RDNA3 CUs on the silicon, comprising 512 stream processors. Its engine clock reaches 2.80 GHz, exceeding the 2.60 GHz clock speed of the Radeon 760M in the Ryzen 5 7640H. The test configuration for the 8600G ES included an MSI MEG X670E Ace motherboard and 32 GB of dual-channel DDR5-6000 memory. Regarding the Ryzen 8000G desktop processors, information about their release is speculative. They are anticipated to be AM5 platform-compatible, with some attributes, like those of the Ryzen 5 8600G, already disclosed. The exact release date remains uncertain. AMD is expected to host an event at the upcoming CES trade show in Las Vegas, but confirmation about an announcement related to the Ryzen 8000G series is yet to be provided.  Sources: Geekbench Database 1, Geekbench Database 2, VideoCardz  Share this content\n\n\n Twitter\n                                \n\n\n Facebook\n                                \n\n\n Reddit\n                                \n\n\n WhatsApp\n                                \n\n\n Email\n                                \n\n\n Print Steam Ends Support for Windows 7, 8, and 8.1 ZOTAC RTX 4070 SUPER Series Surfaces Online Copyright ©1997-2024 guru3dPowered by Contentteller® CMS System "
}