{
    "title": "AMD Ryzen 9000 desktop CPUs expected to launch between April and June this \nyear, possibly together with X3D ...",
    "date": "1/26/2024",
    "url": "https://www.notebookcheck.net/AMD-Ryzen-9000-desktop-CPUs-expected-to-launch-between-April-and-June-this-year-possibly-together-with-X3D-models.797530.0.html",
    "text": "Youtuber High Yield recently tweeted what they call “a collection of what we know so far and the most common/likely leaks and rumors” concerning the upcoming Ryzen 9000 desktop processors based on the Zen 5 architecture. While most rumor sources were not specific about the release window, High Yield is fairly confident that the new processors could launch in Q2 this year, which is a rather odd timing considering that previous release windows happened in Q3 or Q4. The most plausible scenario is a Computex release in early June. High Yield also mentions that the Ryzen 9000 desktop processors will retain the same on-package chiplet design from Zen 4 and same IO-die size as Zen 4, which means they should be compatible with the current X670 / B650 motherboards. Of course, AMD is expected to release new chipset models, as well, but motherboard makers might release these in late summer. The new chipsets are adding DDR5-6400 support by default. Thanks to TSMC’s N4 nodes, the Ryzen 9000 models could see double-digit IPC uplift. However, since the N4 are intermediary nodes, higher clocks compare to Ryzen 7000 are probably out of the question. Core configuration should remain the same, as well, with up to 16 cores and 32 threads for the high-end models. As for the X3D variants, rumor sources do not seem to agree on the release window. Some believe that the X3D models could launch together with the “vanilla”ones, while others point out that AMD may wait to launch them as a response to Intel’s Arrow Lake. Techspot suggests Ryzen 9000 could end up being the first desktop lineup to integrate an NPU, most likely the new XDNA2 coming with Strix Point, as it needs to have an alternative to the AI accelerator offered with the Intel Arrow Lake-S models.  Buy the AMD Ryzen 7 7800X3D desktop processor on Amazon High Yield via Techspot "
}