{
    "title": "CES 2024 - AMD Announces 8000 series APUs",
    "date": "1/10/2024",
    "url": "https://www.overclockers.com/ces-2024-amd-announces-8000-series-apus/",
    "text": "This year at CES, we didn’t have a meeting scheduled with AMD but more of a mixer with executives and technical people alike available to the attendees. We were unable to make that get-together (flew here feeling under the weather), but did stop by the next day to capture some pictures of some available wares. Unfortunately, we didn’t get to see the new 8000 series APUs or the GPU (did I miss it?!), but here’s what was going on in the booth. Not pictured are some items from the server world and AI, one of the big themes for CES 2024. If you’d like to know more about the new APUs, check out THIS THREAD in the forums! In the meantime, here’s an image from the thread.   Read more of our CES 2024 coverage! Joe Shields (Earthdog) CES 2024 – Las Vegas, here we come! CES 2024 – ADATA shows off Project Neonstorm M.2 drive, new AIO, and more AMD held a brief press conference Monday morning to announce availability of the new A10-6790K Richland APU. The A10-6790K APU comes in at 4.1 GHz base clock and 4.3 Ghz max turbo core. The only difference specifications wise from the A10-6800K is a 100 MHz drop in core speed and support for 1866 MHz memory versus 2133 MHz its bigger brother offers. On the graphics end, the A10-6790K offers the same HD 8670D iGPU as the flagship A10-6800K. This is AMD’s new Accelerated Processing Unit (APU) architecture. They are unveiling the APUs for notebooks today with desktop APUs to come down the road; we’re told sometime in June (can you say Computex?). For today’s visitor to the chopping block, we take a look at something a bit different from our normal review pieces. This BIOSTAR unit is a CPU/GPU/Motherboard all in one, also known as a “system-on-chip” setup. It comes fitted with an AMD A4-5000 Quad-Core APU and Radeon HD 8330 graphics in a mITX form factor, which makes for a very versatile board. The passive cooling system ensures silent operation, making it perfect for a HTPC or something similar. Who’s ready to take a look at the A68N-5000? Join the discussion → Loading new replies... Benching Team Leader I'm not convinced so far. I really liked 4000/5000 APUs, but mostly because of how they were overclocking, and RAM scaling was much better than on regular series. I don't think it will happen now, but I haven't seen any leaks if 8000 APUs have any better memory controllers or motherboards will actually run at more than 8000MT/s. Currently, most popular motherboards reach 8000 stable but don't even start at the next ratio or with bclk OC (like 8000 is stable, 8060 can't pass training).\nMost RAM brands (officially) don't have anything above 6400 for AMD in their offer. Many don't even have anything above 6000. It suggests some possible issues, even though unofficially, we can set much higher clocks. 4-module setups (low or high capacity) are also very disappointing, so most users end with 2 modules or 2-module motherboards. Soon, we will see 64GB modules, so it's not bad, but if you go with 4 modules vs 2, then you will go down from 6000-8000 (depending on capacity and IC) to 3600-5200.\nRemember that cheap motherboards = no bclk OC ... or maybe there is, but it won't work much above 102MHz. I just see it as no RAM OC or anything additional, and it will be \"fun\" for one weekend. New mobile APUs and some weird motherboards like MinisForum can be more interesting. I see MinisForum is selling out before they release a new generation. They just finished the Christmas sale, and released at least two new products (discontinuing two older). So far, they have only BD770i with Ryzen 7745HX, but I bet they are working on the 8k series already. Just one tip. If you decide on anything from them, then better use their Amazon store as it's much faster with shipping, and you can always return it if you don't like it. People complain about their online store - delivery time, basic info about orders, and some more. I somehow missed it before, but there is Universal x86 Tuning Utility, which works with desktop and mobile CPUs, so even if you have very limited BIOS, then you can unlock power limits and some other things. Ryzen Master and Intel XTU work with some of the highest mobile CPUs, too. You probably know that, but if you didn't, then you can play with the software, regardless of which way you pick. The APU with C+c cores can be quite cheap, but everything around will cost a bit. Since current motherboards will support Ryzen 9000 CPUs, then I recommend something better than the cheapest motherboard, as you may lose full support in a couple of months. It's my point of view and, of course, you don't have to agree with that. Reply\n 1 Like Senior Forum Spammer not gonna lie, if it was not for left over parts and a free 13100F i have.  i would be building a 8300G for a small case build. Reply\n Like Member My interests are not in memory OC. Consumer tier ram is nowhere near fast enough and OC doesn't make enough of a difference to be worth the pain to look for a stable long term setting for me. Will probably get the cheapest 6000 2x16GB kit and call it a day. Normally I'd prefer 2R ram but I can work around it for testing purposes with a 4 slot board, regardless of how slow it has to run. If I got an AMD hybrid CPU, I can finally do two things:\n1, get a precise measurement on the Zen 4 AVX-512 IPC relative to Rocket Lake and Skylake-X. My preliminary results from indirect data suggests it is somewhere in between, but I'd like to narrow it down more. I could widen this to AVX2 and general usage too.\n1, look at the power scaling of C and c cores, along with their clock limits. I hope it is possible to totally disable all C or c cores at a given time, otherwise it would be more work but not impossible to do. Maybe I mispoke on the mobo. I want low cost, not low end, although the two usually go together. My needs will be multiplier OC and not a lot more. Do I want BLCK OC? The last time I used that was for non-K OC on Skylake. If it could otherwise be done by multiplier it is easier. Looking roughly, mATX B650 boards start above £100 or so, same again for the ram. The CPU I'm really hoping will be low enough tier it will be in a similar ball park. I'd probably skip it if it is £150+. For US people, pretend the £ is a $ and it is close enough for comparison purposes. Reply\n Like Member    I haven't compared the details but it seems the rumours came true.\nPricing:\n8700G $329\n8600G $229\n8500G $179 I think that kills off the 8500G idea for me. Given how much it is cut back relative to the 8600G I was hoping the price would be also. Reply\n 1 Like Benching Team Leader I was also counting on new/better graphics. It uses 740/760/780M, so about the same as 600 series (slightly faster but not so much), and exactly the same as 700 series we have in the last gen APUs (mobile but still).\nSince low 7000 CPUs are cheaper now and prices still go down, then I expect that these APUs won't sell well and their prices will be reduced in the upcoming months. Either way, I bet you don't want to wait, not to mention these APUs are not in stores yet. 8600G seems much more interesting at the given price, but it has only C-cores, which kills one of the test ideas. Reply\n Like Member I had to make this table to summarise some key numbers comparing it against similar Raphael models. Key changes vs existing consumer AMD CPUs:\nMove from RDNA2 to RDNA3\nMove from TSMC 5nm to 4nm\nSupport for PCIe gen 4 only.\nSmaller L3 cache\nTop two models have the new AI NPU.\nThe lower two models don't say OC support on AMD's website. I haven't seen yet how many PCIe lanes they support as this is an area they have cut in the past too. The smaller L3 cache and going back a generation on PCIe support was also a thing on past APUs.\nProbably a typo on AMD's part, their web page for 8500G currently says it is single channel memory whereas everything else is dual. Edit: table updated to fixed typo in clocks, add available user PCIe lanes. Reply\n 1 Like Senior Moment Senior Member It seems that I saw somewhere that the next gen Phoenix point APU will have up to 40 GPU cores.  That does interest me quite bit Reply\n Like Benching Team Leader It seems that I saw somewhere that the next gen Phoenix point APU will have up to 40 GPU cores.  That does interest me quite bit I guess you mean Strix Point, as this is going to have some more changes, more CUs, etc. However, it's a mobile APU. Desktop APUs seem like 0.5 generations back. I mean still 700M series GPUs, but higher clocks and some other things. Still, mobile 8000 will be newer regarding integrated components (at least this is what all the leaks from the last months say). I wonder how fast brands like Minisforums use 8000 APUs in their mini motherboards. Right now they have a pretty good price for their ITX mobos with 7745HX CPUs. I wonder how high these CPUs can be overclocked and if it even works on these mobos. The motherboard itself has PCIe 5.0 x16 and 2x M.2 PCIe 5.0, so it's already great, but the used APU has 610M graphics, so it's pretty slow. If I'm right, then in Feb, they will finally release a 16-core 7945HX version. I just noticed they added info in their German store. I am still waiting for the Intel mobo from them; it's been delayed by nearly a month. I wanted AMD, but the Intel version has 24 cores and in Dec, it cost not much more than the 8-core AMD. Reply\n Like Member Just saw the available user CPU PCIe lanes and updated the table in previous post. 16 on the upper two models, 10 on the lower. So many cutbacks in features but not on the price. The detailed specs on AMD's page do say it it supports EXPO, PBO, Curve Optimiser and Ryzen Master. It just misses the \"unlocked for overclocking\" line found on other CPUs. What even counts as overclocking on AMD these days? I wonder if this is just a marketing limitation or if there is some problem with allowing people to adjust C and c cores separately? Reply\n Like Benching Team Leader Just saw the available user CPU PCIe lanes and updated the table in previous post. 16 on the upper two models, 10 on the lower. So many cutbacks in features but not on the price. The detailed specs on AMD's page do say it it supports EXPO, PBO, Curve Optimiser and Ryzen Master. It just misses the \"unlocked for overclocking\" line found on other CPUs. What even counts as overclocking on AMD these days? I wonder if this is just a marketing limitation or if there is some problem with allowing people to adjust C and c cores separately? On most motherboards, you can only adjust power limits and try to push cores to their maximum boost for longer. On motherboards with a separate bclk (higher-series only) you can use bclk.\nIf the CPU isn't marked as \"unlocked for overclocking\" then Ryzen Master won't work - it will show an unsupported CPU.\nIf curve settings work the same as in regular desktop Ryzens, then you can probably get something around 100-200MHz more on C-cores. Reply\n 1 Like Load more replies Join the full discussion at the Overclockers Forums → Copyright © Overclockers Media Group, LLC | Privacy Policy | Terms of Service | Accessibility "
}