{
    "title": "Why Advanced Micro Devices Stock Popped 8% This Morning",
    "date": "1/16/2024",
    "url": "https://finance.yahoo.com/news/why-advanced-micro-devices-stock-165040966.html",
    "text": "Shares of semiconductor company Advanced Micro Devices (NASDAQ: AMD) were up 8.2% as of 10:45 a.m. ET Tuesday -- and it's no great secret why. On Tuesday morning, not one, not two, but three analysts raised their price targets on AMD stock, citing decent performance in graphics processing units and a big boost to business as the artificial intelligence (AI) trend enters its \"second wave.\" AMD's biggest vote of confidence came from analysts at British bank Barclays, who nearly doubled their share price target on the semiconductor stock from $120 to $200. Barclays named AMD as a beneficiary of this second wave of AI interest as more customers jump on the bandwagon and begin looking for more suppliers of AI chips. In AMD's case, that mainly refers to its MI300X line of accelerator chips. Analysts at KeyBank were just behind Barclays in their enthusiasm for AI, setting a $195 price target and predicting we'll see a \"meaningful inflection in demand\" for AMD's new AI chip this year, according to TheFly.com. And as MI300 sales ramp up, KeyBank forecasts $8 billion in GPU sales for AMD this year. Rounding out the list, Susquehanna Research reports that GPUs are selling \"around MSRP,\" which suggests at least decent demand for GPUs used to facilitate AI functions. Not all the news is great. In its report, Susquehanna injected notes of caution regarding weaker segments of the semiconductor universe. Buyers of automotive and industrial semiconductor chips are still flooded with inventory, it seems, and are engaged in a period of \"destocking\" as they work through their inventories. That won't be great for pricing. Demand for PC chips is still \"bouncing along the bottom,\" too, it asserts. Cellphone chip demand seems more or less flat, with weakness evident in China -- primarily affecting Apple's suppliers. All this notwithstanding, it's the AI story that is resonating with investors on Tuesday. If AMD books $8 billion in GPU sales this year as KeyBank predicts, that would be a huge boost to its business, which booked barely $22 billion in revenues over the last 12 months across all of its product lines. While AMD stock looks admittedly pricey at more than 1,100 times trailing earnings right now, a big boom in AI chip demand, undergirded by strong pricing in these chips, has analysts forecasting AMD will earn enough this year to drive its price-to-earnings ratio down to just 39. AMD investors are betting that price will look cheap a year from now -- and are buying the rumor in hopes of profiting from the news. Should you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Advanced Micro Devices wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 8, 2024  Rich Smith has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Apple. The Motley Fool recommends Barclays Plc. The Motley Fool has a disclosure policy. Why Advanced Micro Devices Stock Popped 8% This Morning was originally published by The Motley Fool Related Quotes "
}