{
    "title": "Nvidia, AMD To Triumph Over Q4 Market Weakness With Cutting-Edge AI, Says \nAnalyst: What To Expect From Th",
    "date": "1/22/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36719297/nvidia-amd-to-triumph-over-q4-market-weakness-with-cutting-edge-ai-says-analyst-her",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Artificial intelligence could have saved the day for semiconductor companies in the fourth quarter, an analyst at KeyBanc Capital Markets said Monday. Weak Industry Fundamentals: Broad-based demand trends remain weak, weighed down by continued inventory destocking in the auto and industry end markets, said John Vinh in a note. Despite the bottoming of the PC industry, demand trends remained weak, he added. The analyst also noted weakness in the traditional server market and Chinese iPhone demand. On the flipside, Android smartphone demand sustained and AI server demand remained robust, he said. “We see AI and Android handset-exposed names as best positioned into earnings, while anticipatingmoderate risk to analog names with outsized auto and industrial exposure,” said Vinh. See Also: Best Semiconductor Stocks Positive On AMD: Advanced Micro Devices, Inc. AMD will likely post higher results and higher guidance, said Vinh. The analyst expects fourth-quarter revenue and earnings per share of $6.18 billion and 80 cents, respectively, compared to the consensus estimates of $6.12 billion and 77 cents. The positive expectation is premised on strong server results amid improving Genoa demand, the analyst said. Genoa is AMD’s high-performance server processor based on the Zen 4 microarchitecture. The analyst estimates first-quarter revenue and earnings per share of $5.98 billion and 77 cents, ahead of the consensus estimates of $5.76 billion and 68 cents. Customer traction for AMD’s AI accelerator chipset MI300x is inflecting, the analyst said. This will lead to upside to the management’s 2024 estimate for over $2 billion in revenue, he said. “Street sentiment on the name is incrementally positive, given signs of growing MI300X traction, and expectations of server share gains given the ramp of Genoa despite weak traditional data center demand,”   KeyBanc said. The firm expects investors to focus on customer engagements for MI300X, updates on theprior $2 billion revenue estimate, plus, the target for 2024, Genoa ramp and the status of PC recovery, and market share expectations versus Intel Corp. INTC. The firm has an Overweight rating and $195 price target for AMD shares. AMD is scheduled to report its quarterly results after the market close on Jan. 30. Nvidia On Track To Q4 Beat Despite China Weakness: Nvidia Corp. NVDA will likely report higher results and issue higher guidance despite a meaningful sequential decline in China data center GPU sales due to export restrictions, Vinh said. “We expect demand from the rest of the world to be able to backfill, with GPUs remaining on allocation,” the analyst said. As Nvidia continued to bring in incremental supply, it should be able to better service demand, he added. KeyBanc estimates Nvidia’s fourth-quarter revenue and earnings per share to come in at $21 billion and $4.72, respectively, ahead of the consensus estimates of 20.2 billion and $4.71. The firm expects the China-compliant GPUs, i.e. H20, to begin ramping toward the end of the first quarter, contributing modestly to the outlook. For the first quarter, Vinh estimates revenue of $22.3 billion and earnings per share of $5.03 compared to the $21.2 billion and $4.71 billion consensus estimates. Street sentiment on Nvidia is positive due to the company’s unique position in monetizing generative AI demand, the analyst said. Investors will likely be keen to know expectations for 2024, order visibility, updates on China outlook and long-term implications of export restrictions, ramp and uptake of H100/H200/GH200 and H20, and  updates on CoWoS capacity and any adjustment for the second-half, he added. The analyst has an Overweight rating and $740 price target for Nvidia. Nvidia is due to report its quarterly results after the market closes on Feb. 21. The iShares Semiconductor ETF SOXX was down 0.1% to $600.61 at last check on Monday, according to Benzinga Pro data. Read Next: Tesla, Netflix, Intel Take Center Stage In Pivotal Q4 Earnings Week As S&P 500 Eyes Breaking New Highs Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}