{
    "title": "AMD FSR 3 supports another game, but not the one you're expecting",
    "date": "1/19/2024",
    "url": "https://www.pcgamesn.com/amd/fsr-3-farming-simulator-22",
    "text": "The latest addition to the library of games that support AMD frame generation leaves us wanting to see the tech in more demanding titles. Samuel Willetts Published: Jan 19, 2024 Since the launch of AMD FSR 3 with frame generation, now several months ago, the number of games that support the feature has grown but the adoption rate has been slow and many glaring omissions frustratingly remain. Now, the newest addition to the FidelityFX roster isn’t one we were entirely expecting. With FSR 3 now publicly available for developers to integrate into their games, AMD has given new life to the worst and best graphics cards alike with its brand agnostic frame generation system. Still, many games that would benefit from the technology are yet to support it. As part of its most recent update, 1.13.1.1, Farming Simulator 22 is the latest addition to the roster. Its arrival comes hot on the heels of Modern Warfare 3 FSR 3 support, which dropped earlier this week. These are both popular games and undoubtedly welcome feathers in AMD’s cap, but neither serve as ideal showcases for the feature. The former for its niche, but admittedly passionate audience, and the latter because increased latency, however small, is no good for competitive shooters. It surprises me, even now, that Starfield supports DLSS 3 but is yet to integrate FSR 3. In terms of features, this leaves owners of Nvidia GeForce RTX 40 series graphics cards, such as the new RTX 4070 Super, with more options to improve their performance than Radeon users in an AMD-sponsored title. There’s also no indication of when it will eventually be added. Similarly, Cyberpunk 2077 was highlighted as a game that will eventually support FSR 3, but we’re yet to hear from either AMD or CD Projekt Red about when this support will materialize. All that said, with recent mainstream releases such as Like A Dragon: Infinite Wealth and Avatar: Frontiers of Pandora both sporting FSR 3 at launch, the coming year looks bright for increased support. Still, I look forward to the day that we’re able to benchmark FSR 3 and DLSS 3 against one another in Cyberpunk 2077. Until then, however, we’ll settle for testing gains with FSR 2 in our upcoming AMD Radeon RX 7600 XT review, which arrives next week. Samuel Willetts                 Sam has spent the past two decades tinkering with computers, a tradition he proudly continues as a Hardware Editor for PCGamesN. For all things systems and components, he's your man. You'll regularly find his hands inside a PC, swapping out components from the likes of AMD, Intel, and Nvidia as fast as you can say Windows. Otherwise, you'll find him on the showfloor of CES and Computex, talking the night away about the latest pieces of shiny silicon. You may also know him from outlets such as Custom PC, PC Gamer, Pocket Tactics, T3, and TopTenReviews. "
}