{
    "title": "AMD's Fluid Motion Frames could give your games a free boost very soon",
    "date": "1/15/2024",
    "url": "https://www.techradar.com/computing/amds-fluid-motion-frames-could-give-your-games-a-free-boost-very-soon",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Heavy on the frame gens AMD’s Fluid Motion Frames technology is launching later this month (around January 24, to be precise), offering a new, more accessible way to boost your framerates and get the most out of your video game experience. Fluid Motion Frames is a driver-level frame generation technology that promises to work across game titles off the jump, without the need for developer-level integration. Basically, Nvidia’s competing DLSS 3 frame-gen tool involves developer implementation, which means functionality comes only when a game’s developers choose to implement it. If DLSS3 isn’t supported on your desired game title yet, you’re going to have to wait until it is in order to enjoy the full effects of Nvidia’s frame-gen technology. AMD’s Fluid Motion Frames is reportedly being included as part of a HYPR-RX performance boosting mode, according to Pokde.net. Last week AMD’s Aaron Steinman shared in an interview with PCGamer’s Jacob Ridley, where Ridley shared that he sees Team Red and Team Green engaged in a cat-and-mouse game, that Nvidia might have to do some catching up now. Normally we expect to see Nvidia drop a new product or feature like this with AMD trailing behind. With Team Red releasing it’s own version of frame-gen, although Steinman challenges that idea of Nvidia leading, as the AMD spokesperson followed by saying “I would be curious to know if Nvidia feels now they have to match what we’ve done in making some of these solutions driver-based.” AMD’s Steinman adds “DLSS is only available on certain solutions, so either Nvidia is going to have to benefit from our solution because we did make it open-source and cross-vendor, or they're probably going to need to do something similar”. So, now that we have a solid date to look forward to, we’ll have to sit back and see how Team Green responds - and whether it will take AMD up on the offer to use its product, or come up with something similar of its own in the near future. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. Muskaan is TechRadar’s UK-based Computing writer. She has always been a passionate writer and has had her creative work published in several literary journals and magazines. Her debut into the writing world was a poem published in The Times of Zambia, on the subject of sunflowers and the insignificance of human existence in comparison.\n\nGrowing up in Zambia, Muskaan was fascinated with technology, especially computers, and she's joined TechRadar to write about the latest GPUs, laptops and recently anything AI related. If you've got questions, moral concerns or just an interest in anything ChatGPT or general AI, you're in the right place. \n\nMuskaan also somehow managed to install a game on her work MacBook's Touch Bar, without the IT department finding out (yet). Microsoft Surface Pro 9 gets huge $540 discount at Best Buy ahead of Pro 10 launch GHD Chronos vs GHD Platinum Plus 4 fun horror movies leaving Netflix in April 2024 you don't want to miss By Alex WhitelockMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Tom PowerMarch 29, 2024 By Mike MooreMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}