{
    "title": "AMD Ryzen 5 8600G Zen4 desktop APU to feature 2.8 GHz Radeon 760M \"RDNA3\" \ngraphics",
    "date": "1/2/2024",
    "url": "https://videocardz.com/newz/amd-ryzen-5-8600g-zen4-desktop-apu-to-feature-2-8-ghz-radeon-760m-rdna3-graphics",
    "text": "The launch of the new AM5 desktop APU series is expected this quarter.   AMD Ryzen AM5 8000G desktop CPU (mockup), Credit: Expreview  AMD is preparing to introduce its new desktop AM5 processors, a long-overdue update to the desktop APU segment, featuring powerful RDNA3 graphics. The CPUs will be based on the mobile Phoenix/Hawk Point silicon, incorporating up to 12 RDNA3 Compute Units. Even though the name Ryzen 8000G might suggest it is a successor to the 7000 series, the intention behind this new series is to cater to a different market segment. The Ryzen 8000G series is designed for users who don’t prioritize CPU performance and may not require dedicated discrete GPUs. Recent testing has unveiled details about one of the upcoming 8000G SKUs. The Ryzen 5 8600G APU underwent testing on an MSI X670E ACE motherboard. This choice of motherboard, a premium option, indicates that the testing was likely conducted by someone at MSI or a reviewer, as enthusiast-class motherboards are not commonly paired with APUs.   AMD Ryzen 5 8600G specs, Source: Geekbench  According to the leaked information, the Ryzen 5 8600G is confirmed to feature 6 cores and 12 threads. While sharing similarities with the Ryzen 5 8500G in terms of specifications, the former is expected to employ 6 Zen4 cores, whereas the latter is alleged to have a hybrid of 2xZen4 and 4xZen4c cores. The leak further reveals a base clock of 4.35GHz and a boost reaching 5.0 GHz. Notably, this positions it 450 MHz and 600 MHz ahead of its predecessor, the Ryzen 5 5600G, which was based on the Zen3 architecture. New details on the GPU specifications indicate that the APU will feature Radeon 760M integrated graphics, comprising 8 Compute Units clocked at 2.8 GHz. The specs for the 8700G featuring Radeon 780M (12CU) variant are yet to be confirmed, but for now it seems desktop AM5 series are not reaching 3.0 GHz clock. Nevertheless, 2.8 GHz clock is already 900 MHz higher than Ryzen 5 5600G which came with 7 CU Vega graphics. Unofficially, the Ryzen 8000G series is expected to launch within this quarter. AMD has not announced any specific events aligned with this launch schedule, suggesting that the new SKUs could be introduced at any moment, potentially even at the upcoming CES 2024 next week. Source: Geekbench #1, #2 We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}