{
    "title": "AMD has finally brought software-based frame generation to handheld gaming \nPCs and the Radeon 700M iGPUs",
    "date": "1/9/2024",
    "url": "https://www.pcgamer.com/amd-has-finally-brought-software-based-frame-generation-to-handheld-gaming-pcs-and-the-radeon-700m-igpus/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The latest AMD Fluid Motion Frames preview driver lists support for the integrated GPU found in both its best mobile chips and the new Ryzen 8000G APUs. If you're rocking a handheld gaming PC that isn't the Steam Deck, then I've got some good news for you to start the new year: AMD has released a new preview driver enabling its software-based frame generation tech on any system running an RDNA 3-based integrated graphics chip. The Radeon 700M has been added to the list of supported GPUs in the latest AMD Fluid Motion Frames (AFMF) preview driver (via Videocardz), and that's the iGPU at the heart of both the AMD Z1 family of handheld chips and the Ryzen 7 7840U that's prevalent in pretty much every other handheld PC on the market today. So, what that also means is that it will be functional on any AMD laptop running that chip, too, such as the Framework 13 with the latest AMD mainboard. But the driver notes do state that if you're hoping to get AFMF feature working on a laptop which also has a discrete graphics card inside it, you'll need to make sure that the display is running from the integrated graphics for it to work. The AFMF preview driver has been out for a while, and has been slowly increasing its level of support from the initial Radeon RX 7000-series GPUs it launched with, to now encompassing almost every modern slice of AMD graphics silicon it has. Apart from the custom APU that sits at the heart of the Steam Deck, that is. The Steam Deck's Aerith and Sephiroth APUs (for LCD and Steam Deck OLED versions respectively) still use a custom RDNA 2 GPU, and that is so far not supported in this Windows preview driver, nor does there seem to be a Linux equivalent. But for everything from the Ayaneo Air 1S to the ROG Ally to the Lenovo Legion Go, the new preview driver ought to be able to deliver higher, smoother frame rates in any DirectX 11 or 12 title. There's likely one big reason why AMD has added 700M support when it has, and that's because it has just announced, at CES 2024, the upcoming release of its new Zen 4 and RDNA 3 powered Ryzen 8000G APUs. These desktop chips will run the same 700M iGPU and will absolutely benefit from having AFMF available right from the off. And that could help make them the best fit for a budget gaming PC of any hardware available this year. Sign up to get the best content of the week, and great gaming deals, as picked by the editors.  Steam Deck OLED review: Our verdict on Valve's handheld.\nBest Steam Deck accessories: Get decked out.\nSteam Deck battery life: What's the real battery life?\nBest handheld gaming PC: What's the best travel buddy? It's worth noting that AFMF is not some sort of performance panacea, however, as it can add a certain amount of latency—just like game-based frame generation—and is only really going to look good when you've already got a decent level of performance already. The suggestion is that 60 fps is the target before AFMF gets involved, though I would expect that on a handheld you might well be able to get away with performance below that mark and still be happy about how a game runs. I've got the preview downloading on the Framework 13 right now, and I also have a couple of new handhelds that will be itching to get some AFMF loving on them, so we'll soon see whether it's going to have the impact on handheld gaming I hope it will. Dave has been gaming since the days of Zaxxon and Lady Bug on the Colecovision, and code books for the Commodore Vic 20 (Death Race 2000!). He built his first gaming PC at the tender age of 16, and finally finished bug-fixing the Cyrix-based system around a year later. When he dropped it out of the window. He first started writing for Official PlayStation Magazine and Xbox World many decades ago, then moved onto PC Format full-time, then PC Gamer, TechRadar, and T3 among others. Now he's back, writing about the nightmarish graphics card market, CPUs with more cores than sense, gaming laptops hotter than the sun, and SSDs more capacious than a Cybertruck. Putin's ordered his government to look into creating Russia's own Steam Deck, SteamOS, and basically Steam itself Phil Spencer, forever the optimist, hints that he's interested in a Microsoft version of Big Picture Mode for handheld gaming PCs: 'I want my Legion Go to feel like an Xbox' Today's Wordle answer for Sunday, March 31 By Christopher Livingston29 March 2024 By Morgan Park29 March 2024 By Rick Lane29 March 2024 By Rick Lane29 March 2024 By Rick Lane29 March 2024 By Rick Lane29 March 2024 By Jeremy Laird29 March 2024 By Kerry Brunskill29 March 2024 By Tyler Colp28 March 2024 By Andy Chalk28 March 2024 By Tyler Colp28 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}