{
    "title": "What motherboard chipset and socket do I need?",
    "date": "2/16/2024",
    "url": "https://www.pcgamer.com/how-to-choose-a-motherboard-sockets-and-chipsets-explained/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. How to pick the right motherboard for your next AMD or Intel PC build. Motherboards don't get the same level of media attention as the best CPUs and graphics cards do, but they're just as important. Where processors are the brains of a computer, a motherboard is the skeleton, blood, and nervous system all in one. However, the range of models and types you can choose is vast in size and can be utterly bewildering, even to a seasoned PC builder. Choose the wrong one and you can end up with a system that's limited in connectivity and upgrade options, or even cap the overall performance. So to help you on your way, here's our guide on choosing the right motherboard for AMD and Intel PC builds. Once you're done here, check out our best gaming motherboards feature to see which models are worth your money.  You might think that this isn't important; after all, it's simply the system that's used to connect the CPU to the rest of the computer. However, both AMD and Intel have several types of sockets available and each one supports a very specific range of processors. As we're only considering gaming PC builds, we can ignore those for workstations and servers, as well as laptops (though you don't typically build them). AMD has two CPU sockets to choose from: AM4 and AM5. The former has been around since 2016 but lots of new motherboards still sport this socket, as AMD only introduced the newer AM5 system in 2022. A CPU built for the AM5 socket will not work in an AM4 socket, and vice versa. They also use different system memory chips, with the latest one using DDR5 and the older one using DDR4. Because AM4 has been around for so long and is in the process of being slowly phased out, CPUs and motherboards for it are generally a lot cheaper than those for AM5. Over a similar period, Intel has released three CPU sockets: LGA 1151v2 (2017), LGA 1200 (2020), and LGA 1700 (2021). Just as with AMD's sockets, they are not compatible with each other and an LGA 1200 CPU will not work in an LGA 1700 motherboard. Sign up to get the best content of the week, and great gaming deals, as picked by the editors. Intel designed the two most recent sockets to support both DDR4 and DDR5 memory, but motherboards can't have both at the same time. That means there are lots of Intel motherboards that come in two variants, one each for the different memory systems. However, unlike AMD, Intel no longer produces CPUs for its older sockets, so unless you happen to find an old but new motherboard that's priced appropriately low, you should only consider LGA 1700 motherboards. Summary: Choose AMD AM4 for budget builds, AM5 for performance and longevity, and Intel LGA 1700 for all types of builds.  Modern CPUs contain a specialized controller for a high-speed communication system called PCI Express (PCIe). It's used to send instructions and data back and forth between devices like graphics cards and NVMe storage drives (as shown above), with the information being transferred across connections called lanes. But CPUs have a limited number of lanes and it's not enough to support all the different storage, networking, and connectivity ports that a PC needs. This is where the motherboard chipset, sometimes called the PCH (Platform Controller Hub), steps in to save the day. This comprises one or two medium-sized chips, soldered onto the motherboard, and both AMD and Intel offer different types of chipsets for each socket.  They differ based on the type and number of PCIe devices that can be connected to the motherboard, and the same is true for USB and SATA ports. Entry-level chipsets also limit the amount of control you have over the CPU's settings and budget models typically won't let you overclock a processor, though it varies hugely between the various makes and models of motherboards. Motherboard chipsets are designed to only support certain generations of CPUs, which also means they're linked to what socket you pick as well. The following tables highlight some of the important features of the main chipsets that AMD and Intel have. Several chipsets are missing, mostly budget or office PC-oriented ones, and those shown are the chipsets we recommend for gaming. It's worth noting that AMD's Ryzen processors have extra USB and SATA controllers inside them, so the total number of peripheral devices you can attach to an AM4/5 motherboard will be more than the above figures show. However, the board itself will still need to have additional slots and ports for the CPU to use them. The latest Ryzen CPUs offers lots of connectivity but only in the right motherboard. Take the best X670E motherboard, Gigabyte's Aorus Elite AX. It has a total of 13 USB ports on the back IO panel, with eight of them being handled by the CPU and the remaining five managed by the chipset. The latter also supports a further nine USB ports, via internal headers on the motherboard. Few motherboards are likely to offer the maximum number of all the available ports. This is because each chipset places a restriction on the combination of different USB generations and the same is true of some of the PCI Express lanes. For example, a motherboard might have six SATA ports for storage drives but if you use all of the chipset PCIe lanes for NVMe drives, then you could be restricted to just two or four SATA ports. But while AMD and Intel chipsets vary considerably in terms of connectivity options, they perform reasonably similar to each other for the same CPU. For example, a Core i5 14600K processor will run just as well in a B660 motherboard as it does in a Z790 one, provided the former can provide sufficient power (see motherboard power systems below). If you need to have dozens of SATA or PCIe devices connected to your computer, then you're better off looking for more specialized motherboards, rather than those targeted at the gaming segment. You can play games on such PCs, of course, but you'll be paying a lot more money for the additional connectivity support. Summary: Choose the most recent chipsets for AMD and Intel processors, to get the best support for PCIe devices, and USB and SATA ports.  Today's processors consume far more energy than those from a decade ago, especially when running at full speed under a heavy load. Motherboards use numerous voltage regulation modules (VRMs) to provide the necessary power to do this, at the required voltage. In general, the cheaper the motherboard, the fewer and/or less powerful the VRMs are. That means that while a given chipset might support the full range of CPUs available for it, the performance of the most energy hungry models will be constrained by the power delivery system. For example, it is possible to use a Ryzen 9 7950X3D in a budget motherboard with a B650 chipset, but there's a good chance that the board simply won't be able to supply enough power at full load. When this happens, the CPU is unable to maintain a high clock speed and so will run slower. Most motherboard manufacturers display VRM details for their expensive, high-end models, but this is rarely the case in the budget sector. What you want to look for are the number of phases provided, as well as the peak current each phase can supply.  MSI's MAG Z790 Tomahawk Max motherboard sports 16 phases rated to 90A each just to power the CPU and it has twice as many phases as the much cheaper Pro B660-M motherboard. Both models support all 12th, 13th, and 14th Gen Core processors but one is clearly better equipped to deal with the highest power consuming CPUs than the other. However, don't think that the CPUs with the most cores and highest clocks require the most expensive motherboards. Vendors often put an excess of VRMs on the board purely for heavy overclocking and/or product status. The only way to be sure that you're picking the right motherboard is to read as many reviews as possible. Summary: Make sure that the motherboard provides enough power, if you're aiming to pair it with the most energy hungry CPUs.  There's one aspect about all motherboards that's important to consider when configuring your next PC upgrade and it's how large the board is. There are standard form formats that most vendors stick to but as there's no actual requirement to do so, motherboards can often be larger or smaller that these formats. The motherboard will need to fit into a PC case so it's crucial that you double-check the vendor's specifications for the case you plan on using. For example, a mini-ITX motherboard will clearly fit inside a case large enough for an E-ATX board, but it might not have the right mounts inside for it. Another thing to consider is that the smaller the motherboard, the less space there will be for PCIe slots and other ports. This is why most vendors won't use a high-end chipset on a small form factor, as the chipset's connectivity potential will be wasted. The same is true for the power delivery system, though to a lesser extent. If you want the best possible overclocking potential, then you're going to be looking at an ATX or E-ATX sized motherboard. With AMD systems, you can overclock on the smaller, low-end motherboards but the limits of what you'll be able to reach will be more constrained. Summary: Make sure the motherboard you want will fit in your PC case. Remember that larger motherboards will generally have more peripheral ports than smaller ones.  AMD has said in the past that it plans to continue using the AM5 socket for its desktop CPUs to at least 2025 and almost certainly longer. So does that mean if you buy an AM5 motherboard now, you can drop in a new Ryzen chip in a few years time? The answer to this question is somewhat complex because it depends on the chipset and motherboard vendor. For example, when AMD released its Zen 3 Ryzen models, the chip giant initially limited them to X570 and B550 chipsets, though this rapidly changed under the weight of complaints. AMD will probably want to avoid the same issue in the future, so we can be reasonably confident in saying 'yes' to that question above. Or at least, for two more generations of Ryzen CPUs, anyway. On the other hand, Intel's next generation of desktop processors will use a completely new socket codenamed LGA 1851. It will be the same size as the current LGA 1700, so you will be able to use the same cooler, but it comprises 151 more pins, so it won't be backward compatible with older CPUs. Intel has historically only supported a socket for two (sometimes three) generations of processors, so no matter what motherboard you buy now, you won't be able to insert a 15th Gen or later CPU into as an upgrade option. What you can do, though, is buy the best Intel motherboard you can get right now, and use a cheap 12th Gen processor in it. And then when funds permit, you can drop one of the latest 14th Gen chips in, if you need more cores or a small performance boost. Nick, gaming, and computers all first met in 1981, with the love affair starting on a Sinclair ZX81 in kit form and a book on ZX Basic. He ended up becoming a physics and IT teacher, but by the late 1990s decided it was time to cut his teeth writing for a long defunct UK tech site. He went on to do the same at Madonion, helping to write the help files for 3DMark and PCMark. After a short stint working at Beyond3D.com, Nick joined Futuremark (MadOnion rebranded) full-time, as editor-in-chief for its gaming and hardware section, YouGamers. After the site shutdown, he became an engineering and computing lecturer for many years, but missed the writing bug. Cue four years at TechSpot.com and over 100 long articles on anything and everything. He freely admits to being far too obsessed with GPUs and open world grindy RPGs, but who isn't these days? Sponge made from a cheesy waste product can help recover the gold from your dumped circuit boards AMD's top Zen 5 motherboards will reportedly come in a triple-chip configuration for guaranteed USB4 40Gbps support Spectator rushes stage at CS2 tournament and gets tackled into trophy, smashing it to pieces By Timothy Monbleau28 March 2024 By Morgan Park27 March 2024 By Shaun Prescott27 March 2024 By Christopher Livingston27 March 2024 By Kara Phillips27 March 2024 By Kerry Brunskill27 March 2024 By Wes Fenlon26 March 2024 By PC Gamer26 March 2024 By Harvey Randall26 March 2024 By Tyler Colp26 March 2024 By Andy Edser26 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}