{
    "title": "MWC 2024: Lenovo’s ThinkPads get faster and easier to use",
    "date": "2/25/2024",
    "url": "https://www.theverge.com/2024/2/25/24081225/lenovo-thinkpad-thinkbook-laptops-mwc-2024",
    "text": "By  Joanna Nelius, laptop reviewer. She has covered consumer technology, with an emphasis on PC gaming, since 2018. Previous bylines: USA Today, Gizmodo, PC Gamer, Maximum PC, among others. While the ThinkBook Transparent Display Laptop Lenovo showed off at MWC 2024 is just a proof of concept, the company also announced refreshed versions of several ThinkPads and ThinkBooks as well as a few accessories. That includes three refreshed ThinkPad T-series laptops: the ThinkPad T14 Gen 5, ThinkPad T14s Gen 5, and ThinkPad T16 Gen 3, all with Intel Core Ultra processors (or an AMD Ryzen 8040 option for the T14 Gen 5). All three get Lenovo’s communication bar, which extends a portion of the top bezel to house the camera and microphones, giving those laptops slimmer top bezels and taller display ratios. Lenovo previously added this feature to other ThinkPad laptops, like the X1 Carbon and X1 Nano. The T-series keyboards also now have the same tactile markings, (homing bars) on the Fn, Insert, Enter, and volume keys as the ThinkPad X1 Carbon Gen 12 and ThinkPad X1 2-in-1 Gen 9 laptops to make typing more accessible to those who are visually impaired. Lenovo also broke with its long-standing tradition of putting the Fn key on the outermost edge and swapped it with Ctrl, where the majority of laptop and keyboard manufacturers put them. There’s a physical Microsoft Copilot key between right Alt and Ctrl, too, but Lenovo left the Windows key alone. (Phew!) Lenovo also collaborated with iFixit to make it easier to replace certain hardware components on the ThinkPad T14 Gen 5 and T16 Gen 3. This includes a move back to fully socketed DIMM slots instead of soldered RAM, user-replaceable cable-free batteries (with fewer screws to remove them), and accessible SSD and wireless adapter slots. For users who are super new to laptop repairs, the SSD and RAM slots are clearly marked, and Lenovo now includes QR codes inside the laptop body near each repairable component with instructional videos about the process. There are also indicators that point to the specific screws to remove if you’re looking to just replace the keyboard and trackpad. There is one more ThinkPad laptop up Lenovo’s sleeve: the ThinkPad X12 Detachable Gen 2. We liked the first-gen model a lot when it was released in April 2021; this upcoming version will have an Intel Core Ultra U processor, 32GB LPDDR5x soldered RAM, a 5MP front-facing webcam that supports Windows Hello, an 8MP outward-facing cam, and support for a 4G LTE wireless adapter. Lenovo has made some adjustments to its ThinkBook 14 2-in-1 laptop, too, by shortening the key travel to 1.5mm and enlarging the touchpad. It also has new peripherals and accessories, including the ThinkVision M14t Gen 2 Mobile touch monitor and a USB-C Slim travel dock. All Intel-configured ThinkPads hit stores starting April 2024, with pricing expected to start at $1,199. (The ThinkPad T14 Gen 5 AMD configuration will be available in May 2024, starting at $949.) The ThinkBook and USB-C dock arrive in March 2024, starting at $1,169 and $89.99, respectively. The portable monitor ($399) arrives in July 2024. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}