{
    "title": "2024 Lenovo ThinkBook Ryzen Edition 14+ and 16+ laptop line debuts with AMD \nRyzen 7 8845H",
    "date": "2/23/2024",
    "url": "https://www.notebookcheck.net/2024-Lenovo-ThinkBook-Ryzen-Edition-14-and-16-laptop-line-debuts-with-AMD-Ryzen-7-8845H.806421.0.html",
    "text": "2024 Lenovo ThinkBook 14+ and 16+ Ryzen Edition laptops have officially dropped in China. Both of them pack an AMD Ryzen 7 8845H processor with Radeon 780M iGPU. It can offer about 65-watt performance in max mode. This Zen 4 Hawk Point APU is paired with up to 32 GB of LPDDR5x RAM, with the base variant of each laptop coming with 16 GB of RAM. As for storage, all the variants of the ThinkBook 14+ and 16+ laptops come with 1 TB of storage and have the same 85 Whr battery that can charge to 50% in just 30 minutes. The two also share the same 1080p webcam and have similar connectivity ports, including USB4, HDMI, Thunderbolt 4 support, Ethernet, and a microSD card reader. What mainly sets the two 2024 Lenovo ThinkBook 14+ and 16+ laptops is the screen. The base variant of the Ryzen Edition 14+ laptop equips a 14.5-inch 2.5K display with a 90 Hz refresh rate, while the expensive configs bump it up to a 3K panel with a 120 Hz refresh rate. The latter screen has high DCI-P3 coverage, making it a good pick for light content creation tasks. On the other hand, both the two configurations available for the 2024 Lenovo ThinkBook 16+ have a 16-inch 2.5K screen with a 120 Hz refresh rate. All the screen options have TÜV Low Bluelight and Eyesafe certifications, making them comfortable for prolonged viewing. You can learn more from the images attached at the end. When it comes to the price, the Ryzen Edition 2024 ThinkBook 14+ laptop starts at CNY4999 (around $694), and the 16+ starts at CNY5399 (around $750). There’s no word on global availability yet, but Lenovo does offer ThinkBook laptops with AMD Ryzen processors for regions outside China (AMD ThinkBook 14 Gen 6 with Ryzen 7530U available on Amazon). So, there’s a chance that these may debut in the international markets as rebranded Gen 7 notebooks with Ryzen 7 8845HS, as the 8845H is exclusive to China. Lenovo on Weibo via: IT Home "
}