{
    "title": "Leak claims AMD RDNA 4 GPUs hit 3.3GHz but we've heard it all before",
    "date": "2/13/2024",
    "url": "https://www.club386.com/leak-claims-amd-rdna-4-gpus-hit-3-3ghz-but-weve-heard-it-all-before/",
    "text": "Is AMD leaving the high-end segment? Latest rumours have revealed that AMD RDNA 4 GPU architecture can clock above the 3GHz mark. It’s a great improvement, especially while still in the engineering phase. The issue is that we heard Team Red say the same thing about RDNA 3 at release. As you can tell, the current generation never truly reached these heights. We’re probably still a year away from next-gen Radeon products, but rumours are already popping up. Moore’s Law Is Dead claims RDNA 4 engineering samples, i.e. Navi 48 and 44 chips, clock between 3GHz and 3.3GHz. Assuming it’s true, this makes it at least a couple hundred megahertz faster than manually overclocked RX 7900 XTX cards. Buying into it is a big ask, though. MLID has a great inside track but isn’t always right due to plans changing or rumours faltering. Worse yet, AMD directly marketed RDNA 3 as an architecture designed to “exceed 3GHz.” It’s not a lie, as much as it is playing fast and loose with the truth. AMD Radeon RX 7900 XTX has fleeting moments that hit above 3GHz, but it never stays consistent. You could maintain it with a significantly higher power draw but that goes beyond the card’s spec. Generally, you’d expect to see closer to 2.3GHz. This new rumour, we assume, is more about a consistent clock speed instead of aggressive performance curves. Frequency aside, the leak suggests Navi 48 GPUs will measure around 300 to 350mm², slotting between the RX 7900 XT and RX 7900 XTX in rasterization performance. They’ll reportedly carry a 256-bit memory controller, likely paired with 20Gbps GDDR6 VRAM – at least for the initial launch. The smaller Navi 44 GPU, on the other hand, should sit between the RX 7600 XT and the RX 7800 XT using a 128-bit memory controller. Both may use monolithic dies instead of the chiplet design found on Radeon 7000 series, built using TSMC’s N4P node. They are expected to launch later this year or by early 2025. This means we have ample time for specs to change, so take these rumours with a pinch of salt regardless of whether they are correct. Once more, ray tracing should be a step above the RX 7000 series, though probably not matching Nvidia’s offerings. AMD seems to be targeting lower price brackets for its upcoming GPUs instead of fighting Nvidia on raw performance. A good move if this trickles down to the low range. It has been a long time since we saw an exciting product below the £300 mark. AIO\nAlder Lake\nAMD\nAOC\nApple\nArc\nASRock\nAsus\nBusiness\nCES\nchassis\nCooler\ncooling\nCorsair\nCPU\nDDR5\ndeals\nDrivers\ngaming\nGeForce\nGigabyte\nGPU\nhandheld\nIntel\nKeyboard\nLaptop\nM.2\nmemory\nMicrosoft\nmods\nmonitor\nMotherboard\nMSI\nNvidia\nPlayStation\nPSU\nRadeon\nRTX\nRTX 40-series\nRyzen\nSamsung\nSony\nSSD\nWindows 11\nXbox About | Contact | Editorial Policies | News Tip Advertise | Privacy | Newsletter | Donate "
}