{
    "title": "Windows Task Manager Will Soon Include AMD NPU Activity",
    "date": "2/22/2024",
    "url": "https://www.extremetech.com/computing/windows-task-manager-will-soon-include-amd-npu-activity",
    "text": "If you're like us, you're no stranger to the Windows Task Manager. It's always our first stop on any troubleshooting adventure and is a handy way to do a quick system check-up. Though Task Manager allows CPU and GPU monitoring, it's also begun to add neural processing engines (NPUs) to Task Manager. Microsoft has already added support to Task Manager for Intel's Meteor Lake chips, and AMD has confirmed it's also working with Microsoft on adding real-time monitoring for its Ryzen NPUs into Windows. AMD started talking about AI performance with last year's 7040-series mobile launch but is now really leaning into it with its 8000-series CPUs, announced at CES 2024. In a new blog post written by an obscure author, the company states it's now working with Microsoft to add real-time monitoring for AMD NPUs to the Task Manager for its 8040 mobile CPUs. It's unclear if this would also apply to its desktop APUs, but we see no reason why it wouldn't. AMD says it's doing this by working to enable MCDM (Microsoft Compute Driver Model) infrastructure for AMD's NPUs, which is related to the Windows Display Driver Model (WDDM) and can monitor non-GPU compute devices such as an NPU. AMD says the MCDM allows an NPU to access the device management infrastructure used by a GPU, including scheduling, power management, and memory management. This will allow developers and home users to analyze application performance in real time. This kind of monitoring can be beneficial on notebooks, according to AMD, as a user can prioritize battery life by ensuring certain tasks are offloaded to the NPU and not the CPU or GPU. Real-time monitoring of NPU performance will also benefit developers attempting to build new AI applications for the PC. AMD says adding an NPU to the Task Manager benefits the entire ecosystem. AMD also notes that the arrival of NPUs alongside CPUs and GPUs in Task Manager signifies their arrival as an important component in future PCs. 2024 is largely expected to be the year of \"AI PCs,\" though their definition is yet to be strictly identified due to the nascent status of these NPUs and applications designed to take advantage of them. Right now, NPUs—hardware made for AI workloads—only exist in a small number of CPUs from both Intel and AMD, but clearly, that will change in the future as both companies seek to claim superiority in AI performance. As such, it certainly makes sense to add them to Task Manager. It'll be useful to see how applications utilize these new NPUs and whether the industry can arrive at some standard benchmarks for them in future PCs. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}