{
    "title": "The best laptop deals of February 2024: Three generations of Apple MacBooks \nare on sale",
    "date": "2/10/2024",
    "url": "https://sea.mashable.com/laptops/30658/the-best-laptop-deals-2024-from-apples-m3-macbook-pro-to-a-480-hp-gaming-pc",
    "text": "UPDATE: Feb. 10, 2024, 5:00 AM EST This story has been updated with the latest laptop deals, pricing, and availability. A new laptop is almost always a splurge, but keeping your eyes peeled for deals can make it much easier to pull the plug on an upgrade. The good news is that you've got options at a variety of price points via Best Buy, Amazon, and beyond, whether you're looking for an everyday workhorse, a cheap Chromebook for homework, a 2-in-1 Windows PC for drawing, or a powerful premium gaming laptop. Read on for our running list of the best laptop deals as of Feb. 10. (And if you don't see any models that check all the boxes on your spec wish list, come back soon — we're adding new picks every week.) This Dell laptop features a 12th-generation (2022) Intel Core i3 CPU, 8GB of RAM, 512GB of SSD storage, and a 15.6-inch display with a 120Hz refresh rate. It's nothing spectacular, but it's a spec sheet we rarely see at this price point: Most cheap, entry-level PCs under $300 have dinky discontinued Intel Pentium/Celeron CPUs, 4GB of RAM, pokier eMMC flash storage that maxes out at 128GB, and 60Hz refresh rates. (Hell, even some nicer laptops don't have 120Hz refresh rates — M2 MacBook Airs included!) It's marked down to $299.99 on Dell's website, which is an incredible deal for this configuration; it was $30 cheaper than the 256GB model at the time of writing. Traditional laptops 2-in-1 laptops Chromebooks Read Mashable's review of the Acer Nitro V 15. The award for \"cheapest gaming laptop you can snag this week\" goes to the Mashable's Choice Award-winning Acer Nitro V 15, a 15.6-inch PC from last year that features a 144Hz display and a backlit keyboard. This particular configuration comes equipped with a 13th-gen Intel Core i5 H-series CPU (the \"H\" indicates desktop-level performance), 8GB of RAM, NVIDIA GeForce RTX 3050 graphics, and 512GB of storage. It could use more memory and a better webcam — its resolution is only 720p — but those are some easy compromises to make for this price. Traditional laptops 2-in-1 laptops Chromebooks Read Mashable's review of the M1 Apple MacBook Air. The 13-inch MacBook Air from late 2020 nabbed a Mashable Choice Award upon release for its zippy M1 chip, quiet fanless design, and 18-hour battery life. We're still recommending it years later as the best budget MacBook available, and its 256GB base model is currently on sale for just $749.99 at Amazon and Best Buy (a 25% savings). It's dipped lower once before, briefly hitting $729.99 in early December, but it's still a bargain at $750 — and you won't find a cheaper MacBook anywhere right now unless you go the used or refurbished route. Traditional laptops 2-in-1 laptops Gaming laptops Read Mashable's review of the 15-inch M2 Apple MacBook Air. Last year's 15-inch version of the M2 MacBook Air has a slightly larger (but just as pretty) Liquid Retina display and six speakers instead of four. Best of all, it still only weighs about three pounds. Best Buy has the 256GB model marked down to $999, or 23% off its $1,299 MSRP — that's an all-time low and a pretty sweet buy if you don't want to splurge on one of the newer M3 MacBook Pros (though those are also on sale). Traditional laptops 2-in-1 laptops Gaming laptops Apple dropped its new 14-inch, M3-powered MacBook Pro last fall, and Amazon currently has the base model on sale for its lowest price to date. Compared to the older 13-inch M2 MacBook Pro (the model it replaced), its upgrades include a brighter mini-LED Liquid Retina XDR display with ProMotion technology (i.e., a 120Hz adaptive refresh rate), a battery life of up to 22 hours, a 1080p FaceTime camera, and more ports along with that faster next-gen processor. It also has twice as much starting storage — 512GB instead of 256GB. Traditional laptops 2-in-1 laptops Gaming laptops "
}