{
    "title": "AMD Announces Embedded+ Architecture For Ryzen Paired With Xilinx IP Review",
    "date": "2/6/2024",
    "url": "https://www.phoronix.com/review/amd-embedded-plus",
    "text": " With Ryzen AI found in the very newest Ryzen processors, AMD began making use of IP from their acquisition of Xilinx. Today though AMD is announcing their Embedded+ Architecture that is taking the marriage of AMD and Xilinx tech much further by combining the wares onto a single PCB for new embedded applications as an integrated compute platform.  AMD Embedded+ integrates Ryzen Embedded processors with Versal AI Edge adaptive SoCs onto a single PCB. With Embedded+ they are aiming to create an ideal platform for AI inferencing at the edge, industrial networking, command / control, and other embedded/edge type applications.  The Ryzen Embedded processors paired with Versal AI edge adaptive SoCs aim to offer a wealth of connectivity options and other features previously not possible in such an integrated manner from a single vendor.  The Ryzen Embedded SoC initially of main focus is the Ryzen Embedded R2314 that features 4c/4t Zen+ cores and 6 Radeon compute units. The DDR4-2667 platform isn't too interesting from the performance perspective but is proven and mature.  The deeply embedded space isn't typically of much interest/coverage on Phoronix, but is one where AMD is placing much emphasis on Linux and so will hopefully yield more benefits to Ryzen on Linux at large in terms of broader hardware enablement and support. The R2314 SoC is being promoted as supporting Ubuntu 22.04 LTS and for Embedded+ in healthcare and other applications it's a Linux-first approach. Gratifying to see the Linux support available while \"Microsoft Windows OS support on roadmap\" in AMD's press deck.  Besides the Ryzen Embedded R2000 series, AMD Ryzen Embedded also includes the V2000 series and then the much more capable Ryzen Embedded 7000 series featuring Zen 4 CPU cores. Phoronix Premium allows ad-free access to the site, multi-page articles on a single page, and other features while supporting this site's continued operations. The mission at Phoronix since 2004 has centered around enriching the Linux hardware experience. In addition to supporting our site through advertisements, you can help by subscribing to Phoronix Premium. You can also contribute to Phoronix through a PayPal tip or tip via Stripe.  Legal Disclaimer, Privacy Policy, Cookies | Privacy Manager | Contact Copyright © 2004 - 2024 by Phoronix Media. All trademarks used are properties of their respective owners. All rights reserved. "
}