{
    "title": null,
    "date": "2/5/2024",
    "url": "https://videocardz.com/newz/overclocker-achieves-ddr5-10600-memory-oc-with-ryzen-7-8700g-apu",
    "text": "No exotic cooling needed.  The AMD Ryzen 8000G is gaining attention among enthusiasts for its support for high-frequency memory overclocking. Recently, overclockers managed to achieve a DDR5-10346 memory overclock with the Ryzen 7 8700G on the AORUS B650 AORUS Tachyon overclocking board. However, the ASUS OC team has already set a new record. SafeDisk has just released details of a new overclocking attempt featuring the ROG Crosshair X670E Gene motherboard with dual-channel DDR5 memory running at 10600 MT/s. This marks a new high for DDR5 memory on the Ryzen 8000G platform, making it the fastest memory overclock on the AMD AM5 socket.   DDR5-10600 with Ryzen 8700G, Source: SafeDisk  The overclocking achievement was accomplished using G.Skill Trident Z5 memory, originally validated for 7800 MT/s CL36 specs. It was found to perform smoothly at 10600 MT/s overclock with CL50 and 1.4V. Interestingly, no exotic cooling was necessary for either the memory or the APU, which utilized a standard liquid cooler. Reports suggest a potential bug in the AGESA firmware, which might display higher frequencies than actually achieved. SafeDisk has shared a picture with an oscilloscope as evidence to confirm the accuracy of the achieved memory frequency. Although SafeDisk’s success may not be as high as Intel’s in official HWBOT rankings for memory OC, it’s important to remember that AMD uses dual-channel memory instead of Intel’s single-channel configuration.   DDR5-10600 with Ryzen 8700G, Source: SafeDisk  Source: SoonHo Jeong (Safedisk), Validation, Wccftech We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}