{
    "title": "SolidRun's first computer-on-module features AMD's 8-core V3000 APU",
    "date": "2/27/2024",
    "url": "https://www.xda-developers.com/solidrun-com-amd-v3000-apu/",
    "text": "AMD’s Zen 3 architecture is a critical component of the Ryzen V3000 CX7 Com While not everyone has a use for a computer-on-module (CoM), these single-board devices can be immensely valuable to certain developers. With an operating system, drivers, RAM, and other core computing features, CoMs are capable of doing a lot of heavy lifting. Raspberry Pi is one of the most well-known compute modules, featuring everything from memory to ports on one chip. Now, SolidRun is hoping to make waves with its own CoM, featuring a powerful APU. CoM developer SolidRun is now launching its new Ryzen V3000 CX7 Com module, its first x86-based CoM. Featuring AMD’s V3000 APU, this device can execute a wide range of tasks without skimping on performance. The APU has AMD’s signature Zen 3 architecture with an eight-core design. Depending on your needs, the APU can be used with NVMe storage via the CoM’s PCIe 4.0 lanes. Additionally, it is compatible with DDR5 RAM sticks, giving you the option to max out at 96GB. In terms of connectivity, you can expect 10GB Ethernet MAC and 5G infrastructure. SolidRun claims that the Ryzen V3000 CX7 Com has a TDP range between 10W and 54W, which would be indicative of its potential use in several applications. The company notes that the CoM can adjust to temperature variances without exhibiting performance issues, and it can operate with or without a fan. The Ryzen V3000 CX7 Com comes in two variations — you can choose from a 15-watt V3C18I model or a 45-watt V3C48 device. Pricing details are only provided if you inquire with SolidRun directly. While there seems to be little risk in trying out the new CoM, it’s worth examining all of your options. The Ryzen V3000 CX7 Com is packed with versatility, but a long-standing model like one from Raspberry Pi could give you what you need with a reputation to back it.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Krystle Vermes is a Boston-based news writer for XDA. She is a graduate of the Suffolk University journalism program, and has more than a decade of experience as a writer and editor in industries ranging from biotech to health. When she's not reporting on the latest news, Krystle is usually researching new smart home devices to fully automate her humble abode. Her first love may be writing, but new, hyped technology is a close second. You can learn more about her work at krystlevermes.com. AMD made significant improvements to its APU lineup with the Ryzen 5 8600G. But is it good enough to beat the Ryzen 5 7600? If you're looking to add one of AMD's Ryzen 7000 to your system without spending a ton, check out our collection of the best budget AM5 motherboards. What decides how fast your RAM is? Frequency or latency? Gaming handhelds are trending right now, but is a gaming laptop still better for you? DisplayPort connectivity remains the only viable workaround Find out which of Samsung’s newest Galaxy Book notebooks 4 is worth the price tag in this head-to-comparison "
}