{
    "title": "The Rocket Has Taken Off for Nvidia. Where Does That Leave AMD Stock?",
    "date": "2/24/2024",
    "url": "https://investorplace.com/2024/02/the-rocket-has-taken-off-for-nvidia-where-does-that-leave-amd-stock/",
    "text": " If AMD is to have outsized success in 2024 it will be on the client side of AI Advertisement Source: Pamela Marciano / Shutterstock.com Advanced Micro Devices (NASDAQ:AMD) stock is right where it was 30 years ago, swimming in the eye of a growth hurricane. Today’s hurricane, of course, is Nvidia (NASDAQ:NVDA), whose blowout earnings February 21 turned the whole market around. The previous hurricane was Intel (NASDAQ:INTC), which doubled multiple times in the 1990s as half of the “WinTel” monopoly, alongside Microsoft (NASDAQ:MSFT). I got off the AMD train recently, warning that you’re paying steak prices for ground beef. An overnight bump has it opening close to where it was when that story was published. Where do we go from here? None of my bearishness should distract from the fact that AMD is a well-run company. It’s still worth owning. AMD stock is just not the best play because Nvidia, led by its CUDA toolkit, is a better place to be. I’m a reporter, not a guru. I was too pessimistic on Nvidia’s earnings, just like everyone else. If you got out just before the bell Feb. 21, you’re feeling stupid right now. I stayed in it. If its 31 analysts are right, however, AMD’s business is about to accelerate.They see $5.4 billion in revenue this quarter, but $25.8 billion for the full year. Profits will also jump 50%, they think. The gain won’t be over its continuing battle with Nvidia in graphics processing units, but in an older technology that’s on your desk right now. That would be Zen5, a CPU (like the Intel chip in client PCs) due for delivery in the second half of the year. We can be fairly certain it’s coming because CEO Lisa Su has agreed to keynote CompuTex, the Taiwanese computer show, this spring. If you still have AMD stock, you are doing OK. You’ve doubled your money over the last year. You’ve just got your money on the wrong horse. The right horse, of course, is Nvidia, up about 25% just since the start of 2024, and 215% over the last year. As I have written many times now, the key to Nvidia is its software. The design of any chip is software, but CUDA means Nvidia is the default operating system for AI. Its customers, especially Cloud Czars like Alphabet (NASDAQ:GOOG)(NASDAQ:GOOGL), Microsoft and Amazon.Com (NASDAQ:AMZN), are desperate to change this.  But developers’ needs for CUDA means they can’t. The work around is called ZLUDA, which lets someone run Nvidia code on AMD or Intel hardware. AMD funded it for a while, but recently backed away. The project is now open source. This means cost conscious developers, especially those who already use AMD Radeon GPUs, can develop using the open source ZLUDA code. But that’s not where the market is. AMD’s decision to drop it, like Intel’s in 2021, means its future is uncertain. I have seen this movie before. There were many Windows workarounds in the early 1990s. You could even run OS/2 from IBM (NYSE:IBM). They all failed. Once the rocket takes off it’s too late to get off. The rocket has taken off for Nvidia and CUDA. The latest quarter proves it. If you’re to see outsized gains in AMD this year, it will come from its competition with Intel. Clients will need to be upgraded for AI just as servers have to be. If you can afford to take multiple positions in the chip space, owning AMD is practically a defensive play, even after its doubling over the last year. But that’s not how aggressive investors, or retiring ones, will be playing it. As of this writing, Dana Blankenhorn had LONG positions in AMZN, NVDA, INTC, MSFT, and GOOGL. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Dana Blankenhorn has been a financial and technology journalist since 1978. He is the author of Technology’s Big Bang: Yesterday, Today and Tomorrow with Moore’s Law, available at the Amazon Kindle store. Tweet him at @danablankenhorn, connect with him on  Mastodon or subscribe to his Substack. Technology, Artificial Intelligence, Semiconductor   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/the-rocket-has-taken-off-for-nvidia-where-does-that-leave-amd-stock/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}