{
    "title": null,
    "date": "2/11/2024",
    "url": "https://www.notebookcheck.net/Lenovo-ThinkPad-P16s-laptop-with-AMD-Ryzen-7-Pro-and-32GB-RAM-gets-hefty-64-price-cut.802505.0.html",
    "text": "Lenovo is almost always running sales on its popular ThinkPad laptops, but in many cases, certain models can be found for even cheaper prices at third-party retailers. This is now the case as a reputable online shop has introduced a massive discount for the AMD version of the Lenovo ThinkPad P16s Gen 1. This deal is available at Adorama, which is where the ThinkPad P16s with the AMD Ryzen 7 Pro 6850U octa-core processor and soldered 32GB RAM can be purchased for just $699 including free shipping.  This deal price is the result of a gigantic 64 percent discount, which shaves $1,260 off of Lenovo's regular list price for the ThinkPad P16s Gen 1 SKU with these components. Furthermore, the Lenovo laptop is equipped with a 512GB NVMe SSD as well as an 16:10 IPS display with a resolution of 1920 by 1200 and a peak brightness of 300 nits. Unfortunately, this base panel only covers 45% of the NTSC color space, which means that the Lenovo ThinkPad P16s is not the best fit for workstation users with a heavy focus on multimedia applications such as Photoshop. Deal hunters should also note that the steeply discounted ThinkPad P16s is currently on backorder, which means that buyers might have to wait until April to get their hands on their brand-new workstation laptop. Nonetheless, this noteworthy deal for the 16-inch ThinkPad offers a great value and might be a good fit for patient buyers who can wait two more months for their new machine to arrive. Buy the Lenovo ThinkPad P16s Gen 1 AMD on sale for $699 at Adorama and a fitting laptop bag pack on Amazon Disclaimer: Notebookcheck is not responsible for price changes carried out by retailers. The discounted price or deal mentioned in this item was available at the time of writing and may be subject to time restrictions and/or limited unit availability. Adorama, Image: Lenovo "
}