{
    "title": "AMD Ryzen 7 8700G Review: Zen 4 For The Budget-Minded",
    "date": "2/26/2024",
    "url": "https://www.lowyat.net/2024/316637/amd-ryzen-7-8700g-review/",
    "text": "A little more than a year since AMD launched Zen 4 and the Ryzen 7000 Series, we’re finally looking at the Ryzen 7 8700G, one of four APUs launched earlier this year, and one of two SKUs to be fitted with Ryzen AI. Couple that with an RDNA3 Radeon integrated GPU, there’s a lot to talk about with regards to this APU, both in favour and against it. The 870GG is one of AMD’s first CPUs to be based not on TSMC’s 5nm FinFET, but the fab’s smaller and more power-efficient 4nm FinFET die lithography. It’s still Zen4 and the AM5 chipset but compared to the Ryzen 7000 Series, there’s more than just a couple of additions to the processor. For starters, the 8700G is equipped with Ryzen AI, meaning that there is an NPU built directly into the chipset, alongside the main CPU and GPU cores, and powered by AMD’s XDNA technology. Speaking of GPUs, the integrated graphics cores inside this processor are RDNA3 and not RDNA2, and more specifically, it’s the Radeon 780M that we’ve seen deployed in the red chipmaker’s Ryzen 7040U Series processors for the laptops, as well as the Ryzen Z1 lineup that it created for the gaming handheld series. Specs-wise and as with all Ryzen 7 series processors, the 8700G features an 8-cores, 16-threads configuration, and comes with a base and boost clock of 4.2GHz and 5.1GHz, respectively. There are, however, some drawbacks to this APU, chief among which being its rather pitiful 16MB L3 Cache size, which is half the size of the L3 Cache in the 7700X. Additionally, the CPU also supports up to PCIe 4.0 only, and not PCIe 5.0. Oh, and it has a peak TDP of 65W, putting on par with the non-X Ryzen 7000 CPUs that we’ve tested in the past. To test the 8700G, AMD was kind enough to provide me with a test kit – the CPU, a B650 motherboard, and a pair of dual-channel DDR5-6400 RAM to test with it. On that note, do ignore the RAM choice in the testbed; I had forgotten to update the chart to reflect the change in hardware but it should be noted that AMD’s recommendation of RAM frequencies includes DDR5-6000 models or higher. As always, the chipmaker says that this is to ensure the optimal performance of its APU. Moving on, while I am testing the 8700G with an NVIDIA GeForce RTX 4090 FE, I am also testing the onboard Radeon 780M integrated GPU as a separate entity and have therefore provided its prowess in the next section. Of course, it should go without saying that the graphics presets will be different (read: lower) than what I would set with a dedicated GPU, on account that it is…well, less powerful. On that note, I am only listing gaming benchmarks in Full HD resolution.  On a synthetic level, the 8700G isn’t too shabby. the scores on 3DMark and PCMark 10 indicate that it isn’t a slouch by any measure of the term but when it comes to rendering, this APU leans on the slow slide of thing. And that 16MB L3 Cache clearly isn’t helping its performance, quite literally. As for the gaming side of it, I’ll be frank: the RTX 4090 notwithstanding, I’ve certainly seen better performance averages from other 8-cores, 16-threads CPUs. On the plus side, it is reassuring to see that the CPU a more-than-100 fps average with all three games that I’ve chosen, putting it more or less on par with the Intel Core i5-14600K. Now, take the RTX 4090, or any other GPU out the equation, and what you’ll find is that the 8700G and its onboard Radeon 780M are actually pretty self-sustaining, so long as you’re willing to do away with the modern creature comforts that are ray-tracing and AI upscaling. Yes, it’s essentially the same GPU as the one in the Z1 Extreme but the difference between the two? This one has a higher TDP headroom. In Cyberpunk 2077, the APU can give me a near 50 fps of solid gameplay, and with Starfield, we’re looking at 57 fps while running on FSR2. However, with the launch of FSR3 and the ability to run Frame Generation, that average shot up to 75 fps.  At RM1,659 a pop, the Ryzen 7 8700G is yet another hard sell to grace my labs. At that same price, and assuming I am planning on getting a discrete GPU, I would rather spend that money on a 7700X and said GPU for a desktop PC. That combo alone provides greater value for performance, both from productivity and gaming standpoints. From the viewpoint of a small form factor PC though, and that of someone who is perfectly fine with the idea of gaming using the same integrated graphics that you find in current gaming handhelds like the ASUS ROG Ally and Lenovo Legion Go, this APU will make the ideal mini HTPC. Just don’t expect it to give it the beans at resolutions greater than Full HD. Follow us on Instagram, Facebook, Twitter or Telegram for more updates and breaking news. ©2024 VIJANDREN RAMADASS. ALL RIGHTS RESERVED. ©2024 LOWYAT, LLC. ALL RIGHTS RESERVED. "
}