{
    "title": "Samsung lands 2 nm AI chip production contract, as Japanese company PFN \nditches TSMC for the South Korean giant",
    "date": "2/15/2024",
    "url": "https://www.notebookcheck.net/Samsung-lands-2-nm-AI-chip-production-contract-as-Japanese-company-PFN-ditches-TSMC-for-the-South-Korean-giant.803661.0.html",
    "text": "Samsung is already offering GAAFET transistor technology on its 3 nm nodes, but the company is still trying to figure out how to improve yields. Because of this, the client roster is not as big as the TSMC one. Contrarily, TSMC has not yet implemented GAAFET tech in the latest N3 nodes, but yields are apparently superior and is attracting more clients, despite historically higher production prices. The Taiwanese foundry plans to include its first version of GAAFET tech in the N2 nodes next year, but by that time, Samsung would have second gen GAAFET transistors ready with its 2 nm nodes. As reported by ETNews, both foundries managed to secure 2 nm orders from Qualcomm and the battle to attract more clients is on. Initially looking to collaborate with TSMC, for future advanced AI chips, Japanese company Preferred Networks (PFN) is reportedly switching to Samsung, which could open the door for more important clients to side with the South Korean giant. Seoul Economic Daily reports that PFN is currently the most advanced AI company in Japan. It has been developing supercomputer AI chips as well as AI software since 2016 and TSMC already produced two processor generations for PFN. The third gen chips, however, will be produced by Samsung on the 2 nm nodes. Industry sources cite Samsung’s superior know-how and possibly better efficiency. This cooperation with PFN could open the gateway to Silicon Valley for Samsung, as the Japanese company has close ties with Intel and Nvidia. TSMC is considerably ahead in the race to attract clients for the 2nm nodes as it already secured orders from Apple and Intel. Nevertheless, Samsung is not sitting on its hands either, as it is already collaborating with IBM and Nvidia. Given the high production cost policies imposed by TSMC as of late, Samsung may have managed to negotiate a more attractive contract for PFN’s next gen AI chips. According to a graph published by Seoul Economic Daily, TSMC appears to control almost 58% of the chip production in the SEA region, whereas Samsung controls only 12.4%. If Samsung manages to secure more clients for the 2 nm nodes, these percentages could look completely different in the coming years.Buy the Samsung Galaxy Book3 laptop on Amazon Seoul Economic Daily via WCCFTech "
}