{
    "title": "AMD creates its own edible chips, embraces Guai Guai culture to ensure \nsmooth running Ryzens",
    "date": "2/4/2024",
    "url": "https://www.tomshardware.com/tech-industry/amd-creates-its-own-edible-chips-embraces-guai-guai-culture-to-ensure-smooth-running-ryzens",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. It turns out engineers aren’t averse to superstition. AMD engineers also seem to be very fond of Taiwan’s potato-chip-like Guai Guai (乖乖) snacks. At a meeting with the AMD team in Taiwan last summer, AMD CEO Dr. Lisa Su proudly held a large special edition pack of Guai Guai featuring her caricature. In the same picture, we see another exec holding a standard-size AMD Ryzen co-branded packet. These AMD-branded snacks are now available for sale online in Taiwan, while other versions are handily available in convenience stores across Taiwan. Last week we reported on TSMC’s recent release of Guai Guai co-branded chips, but tech titans like AMD and Microsoft have also sought to leverage the power of superstition, using this lucky charm to ensure their products always run smoothly. It turns out that semiconductor engineers working at the industry’s cutting edge are a superstitious bunch. In our previous report, we highlighted Taiwan’s Guai Guai culture, but it is worth outlining again. It is very common on this tech-saturated island for engineers and machine operators to place a pack of this snack food on top of or near a crucial device. Doing so ensures the operation will run smoothly, according to tech folklore. A Wikipedia entry about Guai Guai culture notes that this snack food doesn’t just get placed next to computer machinery to work its lucky magic. It has become a regular feature in police stations, tool booths, hospitals, theaters, various government offices, and more. Microsoft is also claimed to have partnered with Guai Guai for a special edition Peacock rice puff. That might have been a mistake, as no one seems to use that snack for good luck. Moreover, the superstition dictates that Guai Guai's coconut cream variety (green pack) is the only really lucky one as its green color ensures your machinery will always be running with a green light. On the back of the green pack, the mascot holds a green light sign with the (machine-translated) words saying, “Green Jin Shun, obediently, give me the green light and keep going!” 乖乖 for debugging an @AMD-powered laptop. pic.twitter.com/IAH9DDDHXRFebruary 1, 2024 The green pack of Guai Guai is a puffed corn snack created in a similar way to Cheetos in the US or Wotsits in the UK. However, these are cream coconut flavor and a little larger with a firmer outer shell. A 52g pack costs TWD$25 (USD$0.80) in convenience stores. Other Guai Guai flavors we have seen include Chinese Five Spice (yellow pack) and Spicy (red pack). Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Guai Guai cream coconut flavor is a baked product with ingredients as follows: corn, sugar, cream, coconut powder, whole milk powder, whey powder, coconut oil, salt, and calcium carbonate. Before we go, readers might be interested to know I've begun deploying Guai Guai packs next to computers used to write Tom’s Hardware articles here in Taiwan. If the idea is good enough for TSMC, AMD, Microsoft, and others, it should have some tech merit. Perhaps we should also look at adding Guai Guai enhanced test results in upcoming device and component benchmarks… Mark Tyson is a Freelance News Writer at Tom's Hardware US. He enjoys covering the full breadth of PC tech; from business and semiconductor design to products approaching the edge of reason. HP ends ties with Russia, shutting down its Russian website — website redirects to Kazakhstan with no support Chinese chipmaker launches 14nm AI processor that's 90% cheaper than GPUs — $140 chip's older node sidesteps US sanctions Best Resin 3D Printers 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}