{
    "title": "Minisforum V3 Tablet Lands In Late March, Powered by AMD Ryzen 7 8840U APU, \n38 AI TOPS In a 14-Inch 165Hz Screen",
    "date": "2/7/2024",
    "url": "https://wccftech.com/minisforum-v3-tablet-lands-in-late-march-powered-by-amd-ryzen-7-8840u-apu/",
    "text": "Minisforum has officially settled on a launch date for its V3 tablet powered by AMD's Ryzen 7 8840U APU which is all set for a late March debut. Press Release: Recently, MINISFORUM updated the CPU of V3 to AMD's latest Ryzen7 8840U on its official website. Previously, the preview page for V3 went live on January 3rd. It is understood that MINISFORUM is expected to hold the V3 and Spring New Product Launch Event at the end of March 2024. MINISFORUM V3 is the world's first high-performance AMD AI 3-in-1 tablet, featuring AMD's latest Ryzen7 8840U, built on a 4nm process, with Zen4 CPU and RDNA3 GPU architecture, 8 cores 16 threads, a base frequency of 3.3GHz, and a maximum boost frequency of 5.1GHz, with a TDP of 15-30W, and a 16MB L3 cache. It integrates Radeon 780M graphics. V3 also boasts a dual-fan and four-copper-pipe cooling system, achieving 28W sustained performance release, providing sustained power for AI model training, graphic rendering, video editing, and gaming entertainment. The AMD 8840U is also paired with a proprietary XDNA AI processor, with NPU computing power up to 16TOPS and processor computing power up to 38TOPS. Based on this, V3 is equipped with a new AMD Ryzen AI, creating an AI Windows triple-in-one tablet PC with the highest security level from Microsoft, supporting Microsoft Real-time Communication, and hardware design supporting Microsoft Copilot, which can be called upon with a single click, providing real-time intelligent suggestions and assistance, helping users easily complete tasks in various scenarios for efficient office work. V3 features a magnesium alloy shell with a minimalist design, exuding business style. It is equipped with a 14-inch 16:10 2.5K 165Hz touch screen, with a maximum brightness of 500nit, covering 100% of the DCI-P3 wide color gamut, containing 1.07 billion colors, displaying more vibrant colors, comparable to professional-grade film displays, and paired with stereo four-speakers, suitable not only for professional designers but also as the top choice for audiovisual entertainment. As the world's first Windows tablet supporting VLink (DP-in video input), V3 can connect to MINISFORUM's own Mini PCs to be used as a display; it can also connect to laptops for dual-screen multitasking to improve work efficiency; furthermore, it can connect to Nintendo Switch/Windows handhelds, providing a larger and higher-quality screen for gaming visuals, enhancing the gaming experience for users. In terms of interfaces and storage, V3 features two full-blooded USB4 interfaces with a maximum transmission speed of 40Gbp/s, and can also be connected to an external graphics dock; one semi-inserted SD card slot; and one 3.5mm headphone jack. It supports a maximum storage combination of 32+2TB, and comes with a professional touch pen, supporting up to MPP2.6 protocol and 4096 levels of pressure sensitivity, meeting the professional needs of creative workers and photography enthusiasts. Other parameters include support for Windows Hello and fingerprint unlock (integrated into the power button), support for PD 65W fast charging, and a 50.84Wh large-capacity battery; it also features the exclusive intelligent Control Center VSPACE, which can intelligently adjust power consumption, freely switch between power-saving mode (15W), balance mode (18-22W), and performance mode (28W), meeting the different usage scenarios of users. MINISFORUM is expected to hold the V3 and Spring New Product Launch Event at the end of March, where more information about V3 pricing and availability will be revealed. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}