{
    "title": "Controller Not Working on PC: Why & How to Get It Recognized",
    "date": "2/12/2024",
    "url": "https://windowsreport.com/windows-10-gamepad-not-recognized/",
    "text": "Follow us Share this article Improve this guide Expert solutions to get your gamepad working in minutes 4 min. read Updated on February 12, 2024 updated on \n\nFebruary 12, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help Windows Report effortlessly and without spending any money. Read more While portable gaming systems come with a built-in gamepad, some controllers are designed to connect to a computer via a USB connection. And this is where our readers reported their PC is not detecting the controller. Usually, the controller is not working on PC due to driver issues and many had problems with the vJoy driver. Bluetooth drivers are also to blame sometimes, and if you tried to use the gamepad inside a Steam game, you will need to tweak the controller settings as we have done below. 1. Right-click the Start icon, then select Device Manager. 2. Click on the Human Interface Devices section. 3. Right-click on Vjoy. 4. Select Uninstall device. The USB Controller not recognized in Windows 10 issue will be solved. 5. Check whether the issue persists. vJoy is a device driver that can be used to bridge the gap between any device that is not a joystick and an application that needs a joystick to function properly. However, sometimes it can cause more issues, such as the PC not detecting the Xbox controller. Therefore, uninstalling vJoy should fix the issue. Disabling the device can also help you fix other controller issues, like Controller acting as a mouse on your Windows 11 computer. Downloading and installing drivers manually is a process that carries the risk of getting the wrong driver installed, which may lead to serious malfunctions. If you want to avoid this kind of risk, you can use a dedicated driver updater to obtain the latest driver versions for your device automatically. ⇒ Get IObit Driver Booster Although the gamepad has nothing to do with the Bluetooth driver, some users reported this solution as effective. So make sure to try it as well to fix the PS4 controller not detected by PC error. In most cases, you need to connect the controller to the PC, and you can start using it. If you encounter any issues, we wrote a guide on how to find your gamepad on Windows 10 if it’s not recognized, so be sure to check it out. Although using a USB controller should be intuitive, many reported that the Xbox One controller is not recognized on their PC, but that issue can be easily resolved. Here are some of the common issues that users reported: That’s about it for this article. However, if you need more solutions, we have a dedicated guide that addresses the gamepad that is recognized but not working in games issue. So make sure to check it out! To get the most out of your Dualsense Edge controller while playing FPS, you need to change the settings; learn all about them in this guide. If you have further suggestions on the PC not detecting controller issue, please share them with us in the comments section below. More about the topics: game fix, gamepad Radu Tyrsina Radu Tyrsina has been a Windows fan ever since he got his first PC, a Pentium III (a monster at that time).\nFor most of the kids of his age, the Internet was an amazing way to play and communicate with others, but he was deeply impressed by the flow of information and how easily you can find anything on the web.\nPrior to founding Windows Report, this particular curiosity about digital content enabled him to grow a number of sites that helped hundreds of millions reach faster the answer they're looking for. Radu Tyrsina Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}