{
    "title": "AMD's Zen 5 chips will reportedly hit mass production at TSMC in the summer",
    "date": "2/19/2024",
    "url": "https://www.pcgamer.com/amds-zen-5-chips-will-reportedly-hit-mass-production-at-tsmc-in-the-summer/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Just in time to give your gaming PC a serious Christmas upgrade. We all love a good architecture or two in the PCG hardware office and we especially like AMD's current Zen 4 and 4c designs. They're super efficient, clock really high, and their performance in games is spot on. So a report that the chip giant's next generation of designs will be hitting mass production toward the end of summer 2024 has piqued our interest and it'll be good news for games if that's the case. There's no official announcement, of course, as AMD itself has been rather tight-lipped about Zen 5 but early snippets have suggested that the performance improvements are rather noteworthy. The rumour about the chips being ready around the end of summer stems from a report by technology outlet UDN (via Wccftech), that says 'the most critical core computing chip is manufactured by TSMC using the 3nm process' (Google translate). This may be a typo or misunderstanding, as it has generally been rumoured that AMD will use TSMC's N4 process node for Zen 5. One possible explanation is that the 3nm production line, aka N3, will be used for the server-focused Zen 5c chips instead. I think we can assume that Zen 5c will be exactly like Zen 4c, in that it performs just the same as the normal architecture does, but the more compact layout limits its maximum clock speed. That's fine for the server market, where all you want is as many cores and threads as possible, in the smallest chip possible. Making it on a 3nm node will mean the next generation of EPYC processors will be as compact and core-heavy as they possibly can, though I have no doubt they'll be fiercely expensive. For PC gamers, even if the normal Zen 5 chips are made on the N4 lines, it will still be better than the current N5 chiplets that power the Ryzen 7000-series. How much better? Well, a recent update to AMD's GCC compiler suggests the Zen 5 core will sport more integer, addressing, and floating point pipelines, all of which means more instructions can be processed per clock cycle.  Best gaming PC: The top pre-built machines.\nBest gaming laptop: Great devices for mobile gaming. The most notable use of TSMC's N4 process node so far has been Nvidia's Ada Lovelace graphics chips. These not only pack in far more transistors per square millimetre than the previous Ampere generation, but they also clock a lot higher and use considerably less power. GPUs and CPUs aren't really comparable that way, but Zen 5 chips are probably going to be a lot more potent than Zen 4 ones, without sucking in more energy. I suspect AMD won't be going down the Intel route of trying to push for a 6GHz processor, but you never know. Sign up to get the best content of the week, and great gaming deals, as picked by the editors. The best part about it all will be the fact that Ryzen 7000 chips will almost certainly drop in price and, if that does happen, 2024 could be the perfect year to do a full upgrade of your PC. Nick, gaming, and computers all first met in 1981, with the love affair starting on a Sinclair ZX81 in kit form and a book on ZX Basic. He ended up becoming a physics and IT teacher, but by the late 1990s decided it was time to cut his teeth writing for a long defunct UK tech site. He went on to do the same at Madonion, helping to write the help files for 3DMark and PCMark. After a short stint working at Beyond3D.com, Nick joined Futuremark (MadOnion rebranded) full-time, as editor-in-chief for its gaming and hardware section, YouGamers. After the site shutdown, he became an engineering and computing lecturer for many years, but missed the writing bug. Cue four years at TechSpot.com and over 100 long articles on anything and everything. He freely admits to being far too obsessed with GPUs and open world grindy RPGs, but who isn't these days? Dragon's Dogma 2 is an object lesson in how system requirements pages are failing PC gamers This home-brew GPU built by a lone enthusiast is a slightly labour-intensive way to avoid painful graphics card prices Classic '90s space sim Star Wars: X-Wing had one mission that was so brutally hard, a fan cut up his floppy disks and mailed them back to LucasArts By Tyler Colp28 March 2024 By Andy Chalk28 March 2024 By Tyler Colp28 March 2024 By Morgan Park28 March 2024 By Andy Chalk28 March 2024 By Rich Stanton28 March 2024 By Joshua Wolens28 March 2024 By Dave James28 March 2024 By Wes Fenlon28 March 2024 By Wes Fenlon28 March 2024 By Harvey Randall28 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}