{
    "title": "5 Best Stocks to Buy According to Billionaire D.E. Shaw",
    "date": "2/29/2024",
    "url": "https://www.insidermonkey.com/blog/5-best-stocks-to-buy-according-to-billionaire-d-e-shaw-1266058/2",
    "text": "DE Shaw’s Stake: $1,367,788,793 Earlier this month, Citi quoted data from Mercury Research which shows Advanced Micro Devices, Inc. (NASDAQ:AMD) gained CPU microprocessor market share in the fourth quarter. Advanced Micro Devices, Inc. (NASDAQ:AMD) now has a 18.4% market share, while Intel lost a share of 27 basis points. DE Shaw had a $1.9 billion stake in Advanced Micro Devices, Inc. (NASDAQ:AMD) as of the end of the fourth quarter. White Falcon Capital Management stated the following regarding Advanced Micro Devices, Inc. (NASDAQ:AMD) in its fourth quarter 2023 investor letter: “It is important to note that the returns depicted above actually originated in the market turmoil of 2022 and were only realized in 2023. We assess that about 75% of the returns in 2023 were derived from just 35% of the portfolio. Notably, the technology companies we acquired in 2022 – Advanced Micro Devices, Inc. (NASDAQ:AMD), Amazon, Docebo, NU, Rover – performed exceptionally well. In hindsight, the decision to allocate to technology stocks appears straightforward; but it actually demanded courage and conviction to buy and add to these stocks during the fear and uncertainty of the 2022 bear market. The top 5 positions in the portfolio were: Precious Metals royalty basket, Nu Holdings, AMD Amazon.com and Converge Technology Services. AMD has worked out great for us but we must admit that it has gotten expensive. AI was not part of our original investment thesis and AMD is a great reminder of how one can get ‘lucky’ investing in quality businesses run by competent management teams (ditto for Amazon).” NASDAQ:AMDNASDAQ:AAPLNASDAQ:AMZNNASDAQ:MSFTNASDAQ:NVDAApple Inc (NASDAQ:AAPL)Nvidia Corp (NASDAQ:NVDA)Microsoft Corp (NASDAQ:MSFT)Amazon.com Inc. (NASDAQ:AMZN)Advanced Micro Devices Inc. (NASDAQ:AMD)13 Best Long-Term Dividend Stocks to Buy Now10 Small-Cap Energy Stocks with Strong Returns5 Best Stocks to Buy According to Billionaire D.E. ShawShow more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                            Get our editor’s daily picks straight in your inbox!  "
}