{
    "title": "Is AMD Stock the Next Big Thing for Chip Investors in 2024?",
    "date": "2/1/2024",
    "url": "https://investorplace.com/2024/02/is-amd-stock-the-next-big-thing-for-chip-investors-in-2024/",
    "text": " Despite strong share price appreciation, AMD is still a \"Strong Buy\" Advertisement Source: JHVEPhoto / Shutterstock.com This will be the year Advanced Micro Devices (NASDAQ:AMD) enters the AI chip market, and the company is poised to directly challenge Nvidia’s (NASDAQ:NVDA) dominance. According to my AMD stock analysis, the chip maker’s untapped potential the AI revolution and semiconductor market trends make AMD’s stock a “Strong Buy.” Let’s take a closer look. Taiwan Semiconductor Manufacturing Company (NYSE:TSM), the business behind the manufacturing of advanced silicon from AMD, Nvidia, and Apple, has consecutively provided the market with positive news. Last year, in their Q3 earnings report, TSM not only boosted revenue guidance but also predicted the “chip slump” was coming to an end. For those unaware, the “chip slump” refers to the period of weak demand and elevated inventory levels experienced by a variety of semiconductor companies since the last couple of years. Similarly, TSM’s Q4 earnings results, released in mid-January, are bolstering that sentiment. CEO C. C. Wei mentioned the company would return to growth in 2024, definitively marking the bottom of the chip maker slump. Statements from TSMC’s management shed light on a possible uptick in demand for the CPU and GPU market in the coming quarters, and this would greatly benefit AMD’s revenue growth and bottom line. Thiswill be the year AMD makes its long-awaited foray into the AI chip space, and demand for these kinds of chips remains high. The chip maker announced the MI300x GPU chipset almost a year ago in their second quarter 2023 earnings report. Investors wondered how AMD would commercialize its new GPUs. Some analysts were even losing hope as the year dragged on. However, in their third quarter earnings report, the chip maker announced it expects to sell $2 billion in AI chips next year. In December 2023, AMD announced a new swath of AI chips: the Instinct MI300X accelerator and the Instinct M1300A accelerated processing unit. These work to train large-language models, and AMD CEO Lisa Su said these chips are comparable to Nvidia’s H100 but are “better on the inferenc[ing].” The chip maker also announced the new Ryzen 8040, which the company claims offers 1.6 times more AI processing performance than previous models. Despite their initial skepticism on AMD’s advanced AI chips, Wall Street analysts are overwhelmingly positive on the chip maker’s share price appreciation potential. According to Koyfin, there are some 48 analysts covering AMD, and 33 of which have rated the company’s shares either a “Buy” or a “Stong Buy.” There has also been a series of analyst revisions to AMD’s price target. In particular, analysts from Morgan Stanley, HSBC, and Bank of America to Susquehanna have increased their price targets for the chip maker. All of this means, while AMD shares have risen more than 136% over the past 12 months, there is still enough upside potential to get new investors interested. On the date of publication, Tyrik Torres did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Tyrik Torres has been studying and participating in financial markets since he was in college, and he has particular passion for helping people understand complex systems. His areas of expertise are semiconductor and enterprise software equities. He has work experience in both investing (public and private markets) and investment banking. Technology, Artificial Intelligence, Semiconductor   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/is-amd-stock-the-next-big-thing-for-chip-investors-in-2024/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}