{
    "title": "How to use integrated graphics instead of GPU?",
    "date": "3/15/2024",
    "url": "https://www.xda-developers.com/how-to-use-integrated-graphics-instead-of-gpu/",
    "text": "It is best to use a GPU when playing a game or doing video editing. However, integrated graphics on your CPU will still work in a pinch. A good GPU is the best way to experience high-quality graphics on a computer. However, you can bypass the graphics card on most computers and get a display output directly from the motherboard. This relies on the CPU's onboard graphics processor. There are a couple of reasons to switch back to integrated graphics from your dedicated GPU. The first is if you are getting rid of the GPU. But a more common reason is to diagnose problems with the graphics card. This is a good way to do some testing if your GPU is not working properly. Now, let's take a closer look at switching from dedicated to integrated graphics. Before trying to switch to integrated graphics, it is important to verify that your CPU actually has the capability. AMD and Intel sell processors that do not have graphics capabilities built in. Processors without integrated graphics require a dedicated graphics card. If you try to use the motherboard's HDMI port with one of these processors, nothing will show up on the display. The easiest way to determine whether your CPU has integrated graphics is to look at the model number. AMD CPUs ending with a G have integrated graphics that you can switch to. Conversely, Intel processors ending with the lettersX or F do not have integrated graphics. The easiest way to switch to integrated graphics is by removing the GPU. However, that requires taking the case apart and working around delicate components. If you want to temporarily switch to integrated graphics, then it is best to change the output method in the BIOS. Additionally, you can switch from dedicated to integrated graphics for a single game or an application in the Settings menu. This is a great option if you are having problems with specific programs. When you first install a GPU, the computer should automatically download the necessary drivers. All you have to do is connect the HDMI or DisplayPort cable to the GPU and power on the computer. But switching back to a GPU after leaving it for integrated graphics may require a couple more steps, including changing the output in the BIOS. By now, you may be wondering why bother switching from a graphics card to integrated graphics. There certainly is no performance benefit unless something is substantially wrong with the GPU. However, some people choose to sell their current GPU before buying a new one. Another reason is to diagnose a malfunctioning GPU. Switching to integrated graphics can be a lifesaver when a GPU goes out, because it allows you to still use the computer for everyday tasks. Of course, serious gamers will want to use a dedicated graphics card that can deliver higher resolution and FPS. Fortunately, GPUs have come down dramatically in price, and there are some really affordable graphics cards. With that in mind, integrated graphics have come a long way, and a modern CPU can actually output many games in high-definition. If you have an old graphics card, you may be surprised that a newer CPU like the Ryzen 7 8700G with integrated graphics may outperform it.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Christopher is a writer at XDA Developers from Louisiana. He primarily covers topics related to electronics and gaming, with a passion for how technology can make a positive impact. Holding a bachelor’s degree in marketing and a master’s degree in hospitality, he also writes about various aspects of business and finance. Outside of writing, Christopher’s hobbies include woodworking and building LEGO sets. In addition to his enthusiasm for all things nerdy, he loves collecting and playing video games, particularly older ones. Thermal paste is a vital component of any CPU cooling solution, but here's how long you can expect it to last It was an exciting month for new releases and thorough reviews, and you'll find the best ones here. If you're looking for tons of storage space, this deal's going to be right up your alley. Nvidia power wherever you go. Recent updates to the Microsoft 365 Roadmap page suggest Microsoft is working on collaboration features. Peak Design's Everyday Backpack has been one of the best tech bags out there for a while, but how does it stack up to competition? "
}