{
    "title": "Best Fortnite PC settings: How to boost FPS, performance & visibility",
    "date": "3/8/2024",
    "url": "https://www.charlieintel.com/fortnite/best-fortnite-pc-settings-to-boost-fps-80773/",
    "text": "Now that Fortnite Chapter 5 Season 2 is out, you’d want to reevaluate your graphics settings, as they can greatly affect the experience. To boost FPS, performance, and visibility, here are the best Fortnite PC settings.   Fortnite Chapter 5 Season 1 was a huge hit, as players appreciated the new map and regular content updates. With the release of Chapter 5 Season 2, you can check out new POIs such as Mount Olympus and Hades’ Castle and try new weapons like Hades’ Chains and Icarus’ Wings. A new season also means that you’ll have to restart your competitive progress and level up the Battle Pass from scratch. If you play on PC, double-checking all your settings and optimizing them to get the best performance might help make the grind easier. On that note, here are the best Fortnite PC settings for low-end as well as high-end hardware. Thanks to Epic Games, we know which PCs can run Fortnite. Although the minimum requirements are quite lenient, you likely won’t get great visuals or be able to hit high FPS. Still, it should run well enough for you to enjoy the game. However, if you have a high-end PC with a beefy graphics card, feel free to run the game at its maximum settings. To get the optimal performance from your system and make sure Fortnite runs as smoothly as possible, you need to make sure your graphics drivers are up-to-date. Here’s how to update your graphics drivers on NVIDIA and AMD GPUs. If you have an NVIDIA graphics card, the GeForce experience app will handle this for you. If you have an AMD GPU, you can use the Radeon Settings to update your drivers. NVIDA DLSS (or Deep Learning Super Sampling) is a clever technology that allows you with an NVIDIA RTX Series graphics card to run Fortnite at high resolution while still maintaining a solid frame rate. DLSS sets your game to a lower resolution, giving a higher frame rate, but uses the technology to give the appearance of high resolution. It’s the perfect mid-point for those who need both visuals and performance. You can find the DLSS settings in the Advanced Graphics section of the Video tab, right at the very bottom. From here, you can set DLSS as either Performance, Balanced, or Quality. You’d only need Performance if playing at 4K, otherwise Balanced or Quality would suit a 1440p resolution. On a low-end system, you want to shoot for 60 FPS. This will give you smooth and stable performance, but you can take it higher by changing certain settings. We’ve picked out the settings that will have the biggest impact on Fortnite’s performance, and given you the optimal options to select for high FPS. The only setting you want to have on High or Epic is View Distance. Seeing players, builds, and loot in the distance is vital and worth losing a few frames for. If your PC is struggling with View Distance set to Epic, experiment with lowering it. Ray Tracing can be found at the very bottom of the Settings tab, but you want to have it all turned off. It will make your game look great, but will absolutely tank your performance. High-end systems can take advantage of a combination of stunning graphics and high FPS. We’ve got the best Fortnite PC settings to take advantage of your high-end gaming rig. We’ve recommended medium settings for high-end hardware, but feel free to experiment if your system can handle it. Ray Tracing can be found at the very bottom of the Settings tab, but it’s unnecessary. Even if your rig can handle it, it’s not worth sacrificing frames in multiplayer games like Fortnite. A good FPS number is hard to define, as it depends on the hardware you are using. Generally, 60 FPS would be considered on the lower end of the FPS scale, with 120 FPS and up considered high. The recommended Fortnite FPS is a tricky question to answer and is based on your existing monitor and its refresh rate. The refresh rate is how many frames your monitor can show per second, and is measured in Hertz, or Hz. If you have a monitor that has a 60Hz refresh rate, there’s no point running your game at 120 FPS, as you’re wasting your PC’s performance on frames your monitor can’t show. If you know your refresh rate, we recommend going 10 FPS over that number, which should give you optimal performance without wasting too much processing power. There are several reasons your Fortnite game might be laggy on PC, from slow internet connection to bad graphics settings. Here is a full list of possible causes: If your game continues to lag, try restarting the client, or performing a full reinstall if nothing seems to fix it. If you are on Wi-Fi, try using a direct/wired connection from your router to your PC to ensure satisfactory ping during matches. If you’re playing on an outdated PC or want to squeeze every last frame out of your system, perhaps performance mode is for you. This offers “significant performance gains” by reducing the visual quality of the game. This will lighten the load on your GPU and CPU, making Fortnite run at much higher frames. Fortnite won’t look as pretty, but you’ll see a massive boost in FPS. To set Fortnite to Performance Mode: Try out these settings on Fortnite Battle Royale for PC, and you will see a marked improvement in the game’s performance. Now that you’ve optimized your PC settings, check out our other Fortnite guides: Best Fortnite keybinds and settings for mouse & keyboard | Best Fortnite controller settings | How to land at Hot Spots in Fortnite | What does Siphon mean in Fortnite? | What are account levels in Fortnite? | All Fortnite NPC locations Liam is CharlieIntel's Editor who focuses on Call of Duty but also plays lots of fantasy RPGs or anything else in his massive gaming backlog. After graduating in Journalism from Edinburgh Napier University, Liam freelanced in games journalism before joining CharlieIntel in November 2020. You can contact Liam at [email protected]. "
}