{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.pinkvilla.com/trending/world/who-is-iris-kerala-school-introduces-first-humanoid-robot-as-a-teacher-to-make-learning-interesting-amd-fun-1284079",
    "text": "Tom Brady’s Former Teammate Reveals Out of 53 Guyz on Roster, ‘52 Would Say They Hated’ NFL Legend Bollywood Newsmakers of the Week: Taapsee Pannu and Mathias Boe reportedly tie knot; Bade Miyan Chote Miyan trailer released Jung Kyung Ho steps in to direct Hospital Playlist co-star Jo Jung Suk’s debut music video as singer BLACKPINK’s Lisa celebrates 27th birthday bash in Thailand with (G)I-DLE’s Minnie, Ex-CLC’s Sorn, and more; PICS WATCH: Arjun Kapoor arrives at Malaika Arora’s mom’s house for Easter celebration; Amrita Arora joins Lakers Injury Report: Will LeBron James Play against Brooklyn Nets Tonight? What Is Bill Belichick’s New Job? Discover What Former Patriots Coach Is Reportedly Up To EXCLUSIVE: Vignharta Ganesha's Kuldeep Singh to enter Karan Wahi-Jennifer Winget's Raisinghani v/s Raisinghani What Role Did Rebel Wilson Play In Pizza? Find Out As Actress Opens Up About Harsh Reality Behind Breakthrough Role In Memoir Bollywood Newsmakers of the Week: Taapsee Pannu and Mathias Boe reportedly tie knot; Bade Miyan Chote Miyan trailer released WATCH: Arjun Kapoor arrives at Malaika Arora’s mom’s house for Easter celebration; Amrita Arora joins What Role Did Rebel Wilson Play In Pizza? Find Out As Actress Opens Up About Harsh Reality Behind Breakthrough Role In Memoir WATCH: Shilpa Shetty celebrates Easter Sunday with family ft lip-smacking desserts; 'Swasth raho mast raho' PIC: Hrithik Roshan’s GF Saba Azad poses with his ex-wife Sussanne Khan; thanks her for ‘best time ever’ in Goa Ram Charan and wife Upasana enjoy a ‘Happy Easter Sunday’ with friends and doggo Rhyme; see PIC 'I Don't Even Get Hangry': Poor Things Star Ramy Youssef Appears in Hilarious 'Ozempic for Ramadan' SNL Sketch Are Athiya Shetty and KL Rahul expecting first baby? Suniel Shetty drops major hint The Beach Boys Documentary: Release Date, Streaming Details And Everything We Know So Far Capricorn to Sagittarius: 4 Zodiac Signs Who Express Platonic Love in Tender Ways Gemini to Libra: 4 Zodiac Signs Who Support Bae’s Friendships And Social Connections Taurus to Pisces: 4 Zodiac Signs Who Help Their Buddies with Financial Responsibilities Leo-Aries to Libra-Gemini: 4 Zodiac Besties Who Illuminate Each Other's Paths Through Friendship Aries to Gemini: 4 Zodiac Signs Who Unapologetically March to the Beat of Their Own Drum Virgo to Pisces: 4 Zodiac Signs Who Evaluate And Learn from Past Fights in Relationships 101+ Hopeless Romantic Quotes That Will Melt Your Heart Gemini to Aries: 4 Zodiac Signs Who Are Unbiased And Receptive to New Ideas Leo-Aries to Virgo-Taurus: 4 Zodiac Couples Who Love Giving Back to the Community as a Family Tom Brady’s Former Teammate Reveals Out of 53 Guyz on Roster, ‘52 Would Say They Hated’ NFL Legend Lakers Injury Report: Will LeBron James Play against Brooklyn Nets Tonight? What Is Bill Belichick’s New Job? Discover What Former Patriots Coach Is Reportedly Up To WATCH: After Pat Cummins, Marcus Stoinis Uses Daniel Ricciardo to Get Oscar Piastri’s Support in IPL 2024 Taylor Swift to Likely Not Perform at Kelce Jam as Travis Kelce Makes Big Reveal On Festival Lineup ‘He’s Absolutely Killing Your Culture’: NBA Analyst Claims Draymond Green Has Destroyed the Warriors Kirk Cousins' Wife Julie REVEALS Her 'Best Purchase From Facebook Marketplace' And It's For Her Kids Who Is Ashley ShahAhmadi? Everything About the Hornets Reporter Who Went Viral After Warriors Game Former WWE Manager Criticizes Goldberg for His Remarks on Asuka Breaking the Streak: ‘He Couldn’t Do 5–10 Minute Match’ Jung Kyung Ho steps in to direct Hospital Playlist co-star Jo Jung Suk’s debut music video as singer BLACKPINK’s Lisa celebrates 27th birthday bash in Thailand with (G)I-DLE’s Minnie, Ex-CLC’s Sorn, and more; PICS BTS’ V attends football match between Gangwon FC vs Seoul amid military service; Watch Duty After School turns 1: Exploring how Moon Sang Min, Shin Hyun Soo's promising show was dimmed by a weak finale Song Joong Ki to reunite with Descendants of the Sun and Arthdal Chronicles co-star Kim Ji Won in Kim Soo Hyun starrer Queen of Tears; see stills ‘I still vividly remember…’ BLACKPINK’s Jisoo pens heartfelt note on 1st anniversary of debut solo album ME and track FLOWER Han So Hee and Ryu Jun Yeol’s acquaintances provide insight into couple’s premature breakup BLACKPINK's Jennie reacts to rumors of first comeback since leaving YG Entertainment via ODD ATELIER Son Ye Jin shares mesmerizing snaps with Hyun Bin to celebrate second wedding anniversary; see PICS 10 Best Bride After-party Dresses to Help You Steal the Spotlight 10 Best Eyelid Lifting Serums And Creams I Have Tried And Reviewed 11 Best Hair Scissors – Tested And Recommended By Our Experts 11 Best Toners for Hyperpigmentation — Tested And Approved by Experts 10 Best Hypoallergenic Shampoos to Gently Cleanse Sensitive Scalps 13 Best Tinted Moisturizers for Hydration And Adequate Coverage 9 Best Hugo Boss Colognes for Men to Master Masculinity 10 Best Face Washes for Hyperpigmentation - Expert’s Reviews 11 Best Eyeshadow Palettes for Brown Eyes — Tested And Reviewed Priyanka Chopra Jonas, Deepika Padukone to Alia Bhatt; 6 must-try celebrity-approved eye makeup trends for 2024 Kareena Kapoor Khan adds a dash of sass to all-denim airport look with hard to miss customized Crew jacket Tamannaah Bhatia serves 'green flag energy' in Masaba Gupta's pre-stitched saree with gold embroidery Priyanka Chopra-Malti Marie make powerful mother-daughter style statement as they serve desi girl vibes in ethnic fits Best-dressed celebs of the week: From Alia Bhatt to Ananya Panday, five celebs who set style bar high Malaika Arora looks hot in an all-white ensemble at son Arhaan Khan's bash Mira Rajput repeats her backless Alice and Olivia halter jumpsuit for dinner with friends Priyanka Chopra is kicking off weekend in style in her white bralette and skirt from Devon Windsor Sonam Kapoor wears white floral embroidered jacket from husband Anand Ahuja’s brand to amp up basic off-duty look Yoga for Constipation: 10 Poses to Relieve Gas And Get Things Moving Exercises And Yoga for Tinnitus, Alternative Therapies, And More Miranda Lambert's Weight Loss Journey: Diet And Workout Tips Revealed Jordyn Woods Weight Loss Transformation Story — Secrets Revealed How to Do Cobbler’s Pose (Baddha Konasana) to Open Up Your Hips Seated Yoga Poses to Stretch And Rejuvenate: Types And Benefits Kundalini Meditation: Balancing Mind, Body, And Spirit Emily Simpson’s Weight Loss Journey: How the RHOC Star Shed 40 Lbs Garland Pose (Malasana): The Hip-opener You Need in Your Yoga Routine How to Apply Foundation Easily: Steps And Tips for Smooth Application Benefits of Body Lotion: Tips to Use, Side Effects, And More How to Deep Condition Your Hair: A Complete Guide to Getting Smooth Locks How to Use Rosemary Oil for Hair Growth: Benefits, DIY Remedies, And Precautions How Long Does Sunburn Last? Understanding Duration, Symptoms, And Treatment How Do Silicone Scar Sheets Work: Efficacy, Uses, And Benefits How to Make Your Eyelashes Grow Naturally: A Comprehensive Guide How to Fix a Broken Nail: Causes, Tips, And Preventive Measures How to Stop Sweating on the Face: Everything You Need to Know Horoscope Today, March 31, 2024 Pisces Horoscope Today, March 31, 2024 Aquarius Horoscope Today, March 31, 2024 Capricorn Horoscope Today, March 31, 2024 Sagittarius Horoscope Today, March 31, 2024 Scorpio Horoscope Today, March 31, 2024 Libra Horoscope Today, March 31, 2024 Virgo Horoscope Today, March 31, 2024 Leo Horoscope Today, March 31, 2024 Kerala's KTCT Higher Secondary School welcomed an AI-powered robot teacher named Iris, created by Makerlabs Edutech. In recent years, artificial intelligence has emerged as one of the most talked-about technological advancements, influencing every area of life, including education. In the past, some predicted that fields like teaching, science, medicine, and even leadership would be fully automated, with humans replaced by robots. However, what we are seeing now is not a robot \"takeover\" but rather humans leveraging robots and AI to augment and assist - not replace - human skills and capabilities. A school in Kerala has hired a humanoid instructor named Iris and the AI robot has made learning more accessible and engaging. The robot teacher was unveiled last month at Thiruvananthapuram's KTCT Higher Secondary School in collaboration with Makerlabs Edutech Private Limited.   Iris was created as part of the Atal Tinkering Lab (ATL), a 2021 NITI Aayog initiative aimed at increasing extracurricular engagement for students in the classroom, according to Makerlabs. The humanoid robot can speak three languages, respond to complex questions, and has features including a voice assistant, interactive learning tools, manipulation capabilities, and mobility.\nRelated StoriestrendingBus crash claims 45 lives in South Africa; 8YO sole survivortrendingGreat American Eclipse 2024: Duration, path of totality, and more Iris is capable of teaching students from Nursery through Class 12. She can imitate human movements such as extending her hand and navigating around the classroom. Students are paying close attention in her classes, making it a priority to attend the humanoid's lessons. As a result, school attendance has increased.   Iris' linguistic capabilities will be expanded to 20 languages in the future. The AI-powered robot can filter out specific subjects, like drugs, from its extensive knowledge base. Iris speaks in a feminine tone and exhibits many qualities of a human teacher, but she lacks emotional investment in her students and cannot recognize them individually. The school, which has over 3,000 students, plans to add more AI-powered teachers for the next academic year in response to the highly positive feedback from students. ALSO READ: Scientists develop new AI model that identifies diseases; explains each diagnosis with a visual map A content writer with a Bachelor's Degree in Mass Media and two years of experience in Content Writing. \n...\nA content writer with a Bachelor's Degree in Mass Media and two years of experience in Content Writing. Apart from being a dancer, Marita is a movie buff and can watch South films all day. Here to give you all the updates on what is trending with fact checks. Currently working as a Trending Content Writer at PINKVILLA. A content writer with a Bachelor's Degree in Mass Media and two years of experience in Content Writing. A content writer with a Bachelor's Degree in Mass Media and two years of experience in Content Writing. Apart from being a dancer, Marita is a movie buff and can watch South films all day. Here to give you all the updates on what is trending with fact checks. Currently working as a Trending Content Writer at PINKVILLA. By providing this information, you agree that we may process your personal data in accordance with our Privacy Statement "
}