{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.notebookcheck.net/GeForce-GTX-1650-Super-Desktop-vs-Radeon-740M-vs-GeForce-GTX-1660-Ti-Mobile_10646_11588_9641.247598.0.html",
    "text": "The Nvidia GeForce GTX 1650 Super for desktops is an entry-level gaming graphics card based on the Turing architecture. The chip, which has been named TU116, was introduced in November 2019. The GTX 1650 series does not offer ray tracing and tensor cores, unlike the more powerful RTX 2000 cards (e.g. RTX 2060). Performance is slightly better than with the GeForce GTX 1650 and comparable with the AMD Radeon RX 5500 XT.There have also been significant improvements in the Turing architecture in terms of the CUDA cores. Float and INT operations can now be executed simultaneously, the cache has been unified and improved, and Adaptive Shading has been introduced. As a result, Nvidia speaks of an up to 50% higher performance per core compared to Pascal.The new entry-level card benefits from the advantages of the TU116 chip, since the newer NVENC video encoding delivers more performance compared to Pascal.Nvidia specifies a power consumption of 100 watts TGP (Total Graphics Power) for the graphics card. The TU11 chip is manufactured by TSMC in a 12 nm FFN process. The Nvidia GeForce GTX 1650 Super for desktops is an entry-level gaming graphics card based on the Turing architecture. The chip, which has been named TU116, was introduced in November 2019. The GTX 1650 series does not offer ray tracing and tensor cores, unlike the more powerful RTX 2000 cards (e.g. RTX 2060). Performance is slightly better than with the GeForce GTX 1650 and comparable with the AMD Radeon RX 5500 XT.There have also been significant improvements in the Turing architecture in terms of the CUDA cores. Float and INT operations can now be executed simultaneously, the cache has been unified and improved, and Adaptive Shading has been introduced. As a result, Nvidia speaks of an up to 50% higher performance per core compared to Pascal.The new entry-level card benefits from the advantages of the TU116 chip, since the newer NVENC video encoding delivers more performance compared to Pascal.Nvidia specifies a power consumption of 100 watts TGP (Total Graphics Power) for the graphics card. The TU11 chip is manufactured by TSMC in a 12 nm FFN process. The AMD Radeon 740M is an integrated GPU in the Ryzen 7040 series for laptops (Phoenix, e.g. Ryzen 5 7540U). The iGPU is based on the new RDNA3 architecture and has only 4 of the 12 CUs (= 256 shaders) clocked at up to 2.5 GHz (depending on the CPU model). The 740M supports hardware raytracing, although the performance is too slow to use it in current games. \nDue to the reduced core count and clock speed, the performance is clearly below the Radeon 760M and 780M. \nThanks to the modern 4nm process and clever power-saving features, the power consumption is comparatively low (according to AMD). The whole chip of the first two models can be configured between 15 - 30 Watt TDP. The AMD Radeon 740M is an integrated GPU in the Ryzen 7040 series for laptops (Phoenix, e.g. Ryzen 5 7540U). The iGPU is based on the new RDNA3 architecture and has only 4 of the 12 CUs (= 256 shaders) clocked at up to 2.5 GHz (depending on the CPU model). The 740M supports hardware raytracing, although the performance is too slow to use it in current games. Due to the reduced core count and clock speed, the performance is clearly below the Radeon 760M and 780M. Thanks to the modern 4nm process and clever power-saving features, the power consumption is comparatively low (according to AMD). The whole chip of the first two models can be configured between 15 - 30 Watt TDP. The Nvidia GeForce GTX 1660 Ti for laptops is a mobile graphics card that is based on the Turing architecture (TU116 chip). Compared to the faster RTX 2000 GPUs (e.g. RTX 2060), the 1660Ti integrates no Raytracing or Tensor cores. The performance is similar to the old GTX 1070 (laptop) but at a reduced TGP of 80 Watt (versus 115 Watt). Compared to the desktop GTX 1660 Ti, the clock speeds are reduced (3% lower base, 10% lower boost). \nIn April 2020 Nvidia refreshed the GTX 1660 Ti with the new codename N18E-G0-A1 with similar specs and pin compatible to the refreshed RTX chips (e.g., RTX 2070 Super Mobile).The Turing generation did not only introduce raytracing for the RTX cards, but also optimized the architecture of the cores and caches. According to Nvidia the CUDA cores offer now a concurrent execution of floating point and integer operations for increased performance in compute-heavy workloads of modern games. Furthermore, the caches were reworked (new unified memory architecture with twice the cache compared to Pascal). This leads to up to 50% more instructions per clock and a 40% more power efficient usage compared to Pascal. \nThe power consumption of the 1660Ti for latops is specified at 80 Watt TGP (Total Graphics Power) by Nvidia and therefore 20 Watt higher than the efficient (and slower) Max-Q variant of the 1660 Ti. The TU116 chip is manufactured in 12nm FFN at TSMC. The Nvidia GeForce GTX 1660 Ti for laptops is a mobile graphics card that is based on the Turing architecture (TU116 chip). Compared to the faster RTX 2000 GPUs (e.g. RTX 2060), the 1660Ti integrates no Raytracing or Tensor cores. The performance is similar to the old GTX 1070 (laptop) but at a reduced TGP of 80 Watt (versus 115 Watt). Compared to the desktop GTX 1660 Ti, the clock speeds are reduced (3% lower base, 10% lower boost). In April 2020 Nvidia refreshed the GTX 1660 Ti with the new codename N18E-G0-A1 with similar specs and pin compatible to the refreshed RTX chips (e.g., RTX 2070 Super Mobile). The Turing generation did not only introduce raytracing for the RTX cards, but also optimized the architecture of the cores and caches. According to Nvidia the CUDA cores offer now a concurrent execution of floating point and integer operations for increased performance in compute-heavy workloads of modern games. Furthermore, the caches were reworked (new unified memory architecture with twice the cache compared to Pascal). This leads to up to 50% more instructions per clock and a 40% more power efficient usage compared to Pascal. The power consumption of the 1660Ti for latops is specified at 80 Watt TGP (Total Graphics Power) by Nvidia and therefore 20 Watt higher than the efficient (and slower) Max-Q variant of the 1660 Ti. The TU116 chip is manufactured in 12nm FFN at TSMC. The following benchmarks stem from our benchmarks of review laptops. The performance depends on the used graphics memory, clock rate, processor, system settings, drivers, and operating systems. So the results don't have to be representative for all laptops with this GPU. For detailed information on the benchmark results, click on the fps number. Average Gaming 30-70 fps → 100% Average Gaming 30-70 fps → 133% For more games that might be playable and a list of all games and graphics cards visit our Gaming List #0 checking url part for id 10646 +0s ... 0s #1 checking url part for id 11588 +0s ... 0s #2 checking url part for id 9641 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:39:02 +0200 +0.001s ... 0.001s #5 composed specs +0.115s ... 0.116s #6 did output specs +0s ... 0.116s #7 start showIntegratedCPUs +0s ... 0.116s #8 getting avg benchmarks for device 10646 +0.049s ... 0.166s #9 got single benchmarks 10646 +0.012s ... 0.178s #10 getting avg benchmarks for device 11588 +0.001s ... 0.18s #11 got single benchmarks 11588 +0.005s ... 0.184s #12 getting avg benchmarks for device 9641 +0.013s ... 0.197s #13 got single benchmarks 9641 +0.121s ... 0.318s #14 got avg benchmarks for devices +0s ... 0.318s #15 min, max, avg, median took s +0.286s ... 0.604s #16 before gaming benchmark output +0s ... 0.604s #17 Got 1969 rows for game benchmarks. +0.152s ... 0.756s #18 composed SQL query for gamebenchmarks +0s ... 0.756s #19 got data and put it in $dataArray +0.096s ... 0.853s #20 benchmarks composed for output. +0.368s ... 1.221s #21 calculated avg scores. +0s ... 1.221s #22 return log +0.006s ... 1.227s "
}