{
    "title": "Best Gaming Laptops 2024: Tested, benchmarked and reviewed",
    "date": "3/19/2024",
    "url": "https://www.tomshardware.com/laptops/gaming-laptops/best-gaming-laptops",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Our picks for the best gaming laptops for every type of gamer and budget  The list in brief\n1. Best Overall\n2. Best Budget\n3. Best Budget Alternative\n4. Best Thin and Light\n5. Best Esports Machine\n6. Best Dual-Screen\n7. Best Crossover Productivity/Gaming Laptop \n8. How we test\n9. Shopping tips Whether you want to take your rig on the road, carry it to the couch or just save space on your desk, a gaming laptop packs PC performance into a compact, portable form factor. Because people have different needs and budgets, the market is loaded with choices that come with screens ranging from 14 to 18 inches, graphics cards that can handle a variety of resolutions and prices that start at less than $999 but creep over the $5,000 mark. The best gaming laptops often come with fancy RGB lights, high refresh rate panels and, sometimes, even mechanical keyboards. To help you choose the right gaming laptop for you, we test many models each year, benchmarking them in popular games such as Cyberpunk 2077 and Borderlands 3, measuring the color gamut and brightness of their screens, determining battery life and, of course, playing with them. Below, we’ve listed the best gaming laptops for different sizes, price points and use cases. For those on a tight gaming budget, we also have dedicated pages for the best gaming laptops under $1,500 and the best gaming laptops under $1,000. Best overall  The Best Gaming Laptop MSI's flagship gaming laptop has a gorgeous 18-inch Mini-LED display, an RGB touchpad, and a mechanical keyboard. For gaming, it's powered by an Intel Core i9-14900HX and Nvidia GeForce RTX 4090 Laptop GPU, plus luxurious amounts of RAM and storage. The downside? It's $5,399.99, putting it out of reach for most. Read more below Best Budget  Best Budget Gaming Laptop The Acer's Nitro line has often a place on this list, mixing build quality, performance, and low pricing to create a reasonable product. The Nitro 16, replacing the old Nitro 5, delivers the entry-level power of an RTX 4050 and a Ryzen 5 7640HS, but with some niceties, you can get for under $1,000. Read more below Best Budget Alternative  Best Budget Gaming Laptop Alternative The $999 model features a Core i7-13620H and Nvidia GeForce RTX 4050 and offers strong 1080p performance. It includes 16GB of RAM and 1TB of storage, which is nice to see, as those are often some of the first specs to get cut for a budget PC. Its 144 Hz refresh rate will be a boon for esports players. We also appreciate the quality of the speakers for the price. Read more below Best thin/light  Best Thin and Light Gaming Laptop The Asus ROG Strix G16 is catching up to Razer in powerful, portable gaming laptops well. The Strix G16's Core i9-13980HX and Nvidia GeForce RTX 4070 provided great performance in a  0.89-inch thick chassis. Is the design as sleek as Razer's Blades? No, but at $1,999.99 when we tested it, Asus is also competing on price. Read more below Best Esports Machine  Best Esports Machine Sometimes you want to run your games fast, and sometimes you prioritize making them look great. The Lenovo Legion Pro 5i splits the difference, with a 2560 x 1600 screen that goes up to 165 Hz, allowing for both quick-twitch esports alongside immersive action games. The fact that you can get it for under $1,500 sure doesn't hurt, and the gaming performance with an RTX 4060 is solid. Read more below Best Dual-Screen  Best Dual-Screen Gaming Laptop Sometimes one screen isn't enough. The Asus ROG Zephyrus Duo adds a second screen for chat apps, music, or guides so you never have to take your games off of the beautiful, mini LED display. The dual-screen design can create some awkward situations — the keyboard is at the bottom of the wrist rest — but this system is powerful and flexible if you need more displays. Read more below Best Crossover Productivity/Gaming Laptop  Best Crossover Productivity/Gaming Laptop Think of the Aliewnare m16 R2 as a crossover laptop. It's got gaming-grade components, but it's styled to look a bit more like a productivity-focused machine, with strong build quality and sleek looks. We loved the keyboard and touchpad for work, and the gaming performance here delivered for play. Read more below Why you can trust Tom's Hardware \n\n\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test.  Our expert review: The MSI Titan GT77 HX has everything, and, we'll be honest, it should. We tested it at $5,399.99, which is way out of reach for most people (don't worry, there are cheaper options further down the list). Between powerful performance, an excellent 18-inch mini-LED screen, and a clicky, mechanical keyboard, there's a lot to enjoy here. The Intel Core i9-14900HX and Nvidia GeForce RTX 4090 Laptop GPU are powerful, though they admittedly don't offer a huge bump over previous generations. But with 128GB of RAM and 4TB of SSD storage there's plenty of room for games and more memory than you'll ever need for gaming. This would be a great machine for video editors. Admittedly, the 14th Gen Intel Core processor doesn't have any huge performance gains over 13th Gen Core gaming laptops, but the Titan 18 HX did great in some of our most difficult tests, like running Cyberpunk 2077 on the Ray Tracing Ultra preset. MSI is using a Cherry MX mechanical keyboard, which is clicky and comfortable. It's a luxury for typing and gaming, though it's unfortunate that MSI doesn't also use these switches for the number and arrow keys. But the highlight is the 18-inch, mini-LED display, which covered 112.4% of the DCI-P3 color gamut in our testing and measured an incredibly bright 559 nits with our light meter. Games and movies look excellent on this HDR display.\n\nWith the Titan, MSI has come as close to cramming a desktop into a laptop chassis as possible. It's for people who don't have room for — or don't want — a desktop. It's the best in many ways, assuming you can afford it. Read: MSI Titan 18 HX review  Our expert review: The Acer's Nitro line has often a place on this list, mixing build quality, performance, and low pricing to create a reasonable product. The Nitro 16, replacing the old Nitro 5, delivers the entry-level power of an RTX 4050 and a Ryzen 5 7640HS, but with some niceties you can get for under $1,000.\n\nOur $999 review unit included a 1920 x 1200, 165 Hz display with G-Sync support, which is great for esports gaming. It's nice and bright at 371 nits on our light meter, and covered 91% of the DCI-P3 color gamut. In our game testing, we found that the system is not the most powerful, but that it has enough power for today's games at the system's native 1920 x 1200. In almost every game we tested, the Nitro surpassed 60 fps. We also appreciated that the laptop offered 8 hours and 24 minutes of battery life on our test, which beat other laptops in i's class — some by multiple hours. The webcam isn't amazing, and Acer has a habit of putting too much bloatware on laptops that you'll spend some time uninstalling. But getting USB 4 under $1,000, alongside a solid screen and decent performance for the price makes this a great choice for someone whose budget it set at $1,000. Read: Acer Nitro 16 Review  Our expert review: The MSI Katana 15 is among our favorite gaming laptops for those with just $1,000 to spend. We tested a $999 model with a Core i7-13620H and Nvidia GeForce RTX 4050 offering strong 1080p performance, though you may have to turn down some settings in some games. In our testing, the Katana passed 60 fps in most benchmarks at some pretty high settings, though some, like Red Dead Redemption 2, were run lower. As games get more challenging, budget laptops won't run at the highest settings for long. Even under $1,000, you get 16GB of RAM and 1TB of storage, which is nice to see, as those are often some of the first specs to get cut for a budget PC. Instead, the chassis is made of cheap plastic, but the internals should get the job done.  The display could be a bit more vivid, but its 144 Hz refresh rate will be a boon for esports players. And for its price, it delivers solid audio.\n\nRead: MSI Katana 15 Review  Our expert review: The Asus ROG Strix G16 is catching up to Razer in powerful, portable gaming laptops well. The Strix G16's Core i9-13980HX and Nvidia GeForce RTX 4070 provided great performance in a  0.89-inch thick chassis. Is the design as sleek as Razer's Blades? No, but at $1,999.99 when we tested it, Asus is also competing on price.  We also appreciated the Strix's battery life — it lasted for 8 hours and 49 minutes on our battery test, as well as the RGB keys with 2 millimeters of travel.\n\nThe laptop's lid is aluminum, but the rest is plastic. In our time with the laptop, not once did we think the ROG Strix G16 felt cheap. In fact, in each of the benchmarks we ran, the ROG Strix G16 surpassed 60 fps (often handily!), showing solid performance at both 1080p and its native 1920 x 200. Perhaps the biggest issue we had is that our unit had a 1920 x 1200 touch screen. The RTX 4070 should power that no problem based on our benchmarks, and in this price range you often see 1440p (or, in 16:10 screens like this one, 1600p) display panels.\n\nRead: Asus ROG Strix G16 Review  Our expert review: For under $1,500, you can get a 16-inch esports machine with a screen that also allows for high-resolution, intensive titles. The 2560 x 1600 display goes up to 165 Hz, which is fast enough for esports at 1080p, while the high resolution will make action games look great. Sure, some gaming laptops have faster displays, but they're often more expensive. The \"i\" in 5i Pro stands for Intel. We tested with an Intel Core i7-13700HX along with Nvidia's GeForce RTX 4060. Our system also had 16GB of DDR5 RAM and a 512GB SSD.\n\nThis model has an improved 1080p webcam over previous generations, which is good for working as well as gaming. We found that its SSD was fast in our testing, and it offered competing gaming performance. That being said, you may want to consider one of the best gaming headsets because there's plenty of fan noise and the audio quality isn't the best. Read: Lenovo Legion Pro 5i (Gen 8) Review  Our expert review: For when one screen isn't enough, the Asus ROG Zephyrus Duo 16 offers two, powered by AMD's top-end Ryzen 9 7945HX and an Nvidia GeForce RTX 40890. The second screen, dubbed ScreenPad Plus, provides a bit of extra real estate for chat apps or guides while gaming, and lifts up in order to increase ventilation.  The main mini LED screen, at an incredible 684 nits of brightness on our light meter, looks excellent with HDR games and shows. It's matte, while the ScreenPad Plus is glossy, but that's a minor issue.\n\nWith shiny purple and blue lines, Asus eschews the standard RGB on the lid, and it looks refined and unique because of it. Now if only Asus could refine the placement of the keyboard and mouse, which have been awkward for a few generations now. You'll have to decide if that second screen is worth the effort. On our gaming suite, the Zephyrus Duo didn't perform as well as Intel-based competitors, so that may be worth considering if frames per second is the most important measure of your experience. But if you're going by the number of screens, this definitely has an advantage. Read: Asus ROG Zephyrus Duo 16  Review  Our expert review: Many laptop companies have aimed to make gaming machines that look more like traditional PCs while still maintaining a bit of personality. These crossover laptops have often been lower on power, but we found that the Alienware m16 R2 offered strong gaming performance alongside its relatively muted design. We were impressed with the build quality, including the frame but also the keyboard and touchpad, which we found comfortable to use in our testing. Additionally, the m16 R2 has plenty of aftermarket upgradeability. When we opened the machine up, we were happy to see that the RAM, SSD, Wi-Fi card, and battery are user-serviceable.\n\nWe do wish the display were a bit brighter and that Alienware would bring the price down on the most entry-level models, but in general, this is a well-built machine for work and play. It looks good just about anywhere. If you want something smaller, we also tested the Asus ROG Zephyrus G14 and the HP Omen Transcend 14, but we preferred the is larger PC because it delivers more graphics power. Read: Alienware m16 R2 review Every gaming laptop that we review goes through a rigorous series of tests and benchmarks to decide whether it's worth your consideration. Currently, games that we run and may include in our reviews are: We also run a stress test, which currently consists of the Metro Exodus benchmark on the RTX preset, run 15 times in a loop while recording system statistics with HWInfo. (This is also when we take our heat tests).\n\nAdditionally, we run a series of productivity benchmarks, including Geekbench, Handbrake, and our in-house file transfer test.\n\nWe measure gaming laptop displays with our colorimeter and light meter, and report brightness in nits, as well as the volume of the DCI-P3 and sRGB color gamut that the screen covers.\n\nOur battery test connects to a local web server over Wi-Fi, and continuously browses the web, runs simple OpenGL graphics tests, and streams videos. We report the amount of time the laptop ran for in hours and minutes. We also think it's important to actually use the gaming laptops we test. Our writers and editors spend time playing games and using gaming laptops in other ways, like writing their reviews, watching videos, and listening to music, so that we can report on our own thoughts and feelings about the keyboard, design, port selection, audio, and other features. Because the ability to upgrade and repair gaming laptops is particularly important, we open every system to see which parts are user replaceable, and document that experience so you know what you can change down the line. Whether you're shopping for one of the best gaming laptops or another model that didn't quite make our list, you may find some savings by checking out our lists of Dell coupon codes, HP coupon codes, Lenovo coupon codes, Razer promo codes or Newegg promo codes. MORE: How to Buy a Gaming Laptop MORE: Best Gaming PCs MORE: Best Ultrabooks and Premium Laptops Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Andrew E. Freedman is a senior editor at Tom's Hardware focusing on laptops, desktops and gaming. He also keeps up with the latest news. A lover of all things gaming and tech, his previous work has shown up in Tom's Guide, Laptop Mag, Kotaku, PCMag and Complex, among others. Follow him on Threads @FreedmanAE and Mastodon @FreedmanAE.mastodon.social. Alienware m16 R2 review: Now more mainstream The Lenovo Legion Slim 5 OLED RTX 4060 gaming laptop is now only $1,049 at Best Buy AMD 170W Granite Ridge Zen 5 CPUs and 128W Strix Point APUs revealed in shipping manifest — 16-core 'Fire Range' mobile CPUs also coming By Sarah Jacobsson PurewalMarch 15, 2024 By Matt SaffordMarch 12, 2024 By Andrew E. FreedmanMarch 11, 2024 By Shane DowningMarch 08, 2024 By Paul AlcornMarch 08, 2024 By Brandon HillMarch 06, 2024 By Matt SaffordMarch 05, 2024 By Matt SaffordMarch 05, 2024 By Matt SaffordMarch 05, 2024 By Jarred WaltonMarch 04, 2024 By Les PounderMarch 01, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}