{
    "title": "Where to buy AMD Radeon RX 7900 XT: specs, price, performance",
    "date": "3/14/2024",
    "url": "https://www.pcguide.com/gpu/where-to-buy-amd-radeon-rx-7900-xt/",
    "text": "Reviewed By: Kevin Pocock PC Guide is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Read More Last Updated on March 14, 2024 The newest high-end graphics card from Team Red is incoming, and so we present out where to buy AMD Radeon RX 7900 XT round-up. Fortunately, you won’t have to wait long for the top-performing RDNA 3 GPU, as it’s release is just around the corner. But we’re also bringing you everything you need to know about the company’s latest model right here, right now. Interestingly, the AMD Radeon RX 7900 XT isn’t the absolute flagship of the graphics card generation. This is because there’s another high-performance card releasing as well, the more powerful RX 7900 XTX. If you want the absolute bleeding edge of video cards, then you can turn your attention to the brawnier sibling for even more power. The AMD Radeon RX 7900 XT will be available for purchase on December 13, 2022. This is considerably later than what some sources originally cited the release date to be, originally theorized to drop after the announcement itself. While no pre-orders or retailer information was given at the RDNA 3 event, these are the retailers where we’re expecting to find RX 7900 XT stock in December. No knowledge of pre-orders or landing pages have materialized at present, but we’ll be updating you with all we know closer to the time. The AMD Radeon RX 7900 XT will retail starting at $899 for the company’s official reference design model. As you may expect, partner cards will vary in rates at and above this price point. No AIB models were shown off at the event. What’s interesting is that this card comes in significantly cheaper than the RTX 4080, by a full $300. Specs-wise, things are looking pretty even, too. This is a price point that was unexpected from the wider press. While people had the figure of $999 in mind, as was customary for the previous RDNA 2 frontrunner, AMD has made the decision to target gamers after a cheaper card. This is likely in direct response to the somewhat mixed reception of Nvidia’s two premium GPU offers both clocking in well over $1,000. Fortunately, there’s no need for rumors or speculation here. While the entire technical specs of the RX 7900 XT weren’t revealed, we do have a fair few details to go over, best summarized by the company itself: As you can see, there’s 84 AMD RDNA 3 ray tracing cores, 2000 GHz Game Clock speeds, 20GB GDDR6 memory, and a 300 TDP. That’s a considerable amount of horsepower given the power draw here is lower than you would typically expect. What’s most interesting here, though, is the support for DisplayPort 2.1 meaning resolutions of up to 8K165, which is truly next-generation. Another minor inclusion of this card is the fact that it runs off of 2x 8-pin PCIe power cables. The company made quite the comment about how no adapter would be needed here, and how all you need to do is swap your old card out with the cables and PSU you already own. It’s definitely a step in the right direction as far as being pro-consumer goes. Now we’ve seen one in real life, it’s clear anyone picking up an XT is going to get a very sleek-looking graphics card. And not one that will require a whole new case either. Of course, actual appearances will change based on AIB (add-in board partner) designs. But the card we’ve held with our very own hands gives an exciting sense of understated prowess. Everything down to the backplate looks smart, and there’s no doubt it’ll look just as good in most systems too. While the vast majority of performance demos were focused on the RX 7900 XTX, what we can gauge from the secondary card is that it’s more-than-ready for demanding titles in 4K and even 8K. Much was made of the advancements made with FSR, the company’s A.I. supersampling tech, meaning that this card can push titles to new heights without the hardware strain. What we also know is that the company has made leaps in the field of ray tracing, too. Real-time demos rendering in Unreal Engine 5 have gone to show the prowess of what Super Resolution 3 is capable of. What does this mean for the end consumer? Simply put, it means having access to higher FPS and more consistent ray tracing performance in target resolutions like 4K. Not likely. While the former features 4GB of additional VRAM, said memory is the slightly slower GDDR6 compared to the latter’s faster GDDR6X. In our initial RX 7900 XT vs RTX 4080 piece, we’ve put the two pretty much neck and neck with DLSS and Ray Tracing turned off. But it’s little surprise that the RTX 4080, being $300 more, will outperform the 7900 XT overall. Performance for price and performance-per-watt? AMD will take the win. Considering the price point of $899, we think that the RX 7900 XT certainly has enough horsepower to justify its asking price, at least from what we’ve seen. Given that the card appears to be able to handle not just 4K120 but also 8K60 with the help of FSR 3, the value for money seems to speak for itself. Especially when considering that Nvidia doesn’t have any GPUs under $1,000 yet. FidelityFX Super Resolution 3, or FSR 3, is the brand’s upcoming iteration of the A.I.-powered supersampling technology. You can think of it as AMD’s answer to Nvidia’s DLSS 3, with the key difference here being that Team Red’s latest innovations will work with previous generation GPUs, too.  Aleksha McLoughlin is Hardware and News Editor for PC Guide and she oversees buying guides, reviews, news, and features on site. She was previously Hardware and Affiliates Editor at VideoGamer. PCguide.com is part of the BGFG family of websites. Our mission is to provide you with great editorial and essential information to make your PC an integral part of your life. You can also follow PCguide.com on our social channels and interact with the team there. © 2024 PC Guide. All rights reserved. Part of "
}