{
    "title": "AMD Is the AI-Powered Chipmaker Set to Outshine Nvidia in 2024",
    "date": "3/11/2024",
    "url": "https://www.tradingview.com/news/investorplace:6a430b462094b:0-amd-is-the-ai-powered-chipmaker-set-to-outshine-nvidia-in-2024/",
    "text": "Up 20% in the last month, and 50% year-to-date, the stock of Advanced Micro Devices AMD stock is a great choice in this bull market that is being driven by artificial intelligence technologies. AMD, as the company is commonly known, is a leading microchip and semiconductor company and a fantastic way to play the hype surrounding AI. AMD stock is second only to rival chipmaker Nvidia’s NVDA 81% gain this year. With new, ultra-powerful microchips coming to market and red hot demand for its products, AMD looks likely to continue outperforming in the months ahead. Big Growth Ahead In January, Advanced Micro Devices issued solid earnings for the fourth quarter of 2023. But what got analysts on Wall Street buzzing and revising up their targets on AMD stock was the company’s bullish outlook for the year ahead, particularly when it comes to AI-driven demand for its microchips. Last fall, the company said it expected $2 billion in AI chip sales in 2024. It is now forecasting $3.5 billion of AI chip sales this year. AMD’s business has undergone a fundamental shift in a short period of time. The company’s main business used to be developing microchips for personal computers (PCs) and servers, and, to a lesser extent, video game consoles. In the past year, AMD’s data center business, which includes AI chips, has become its largest business segment. The data center business rose 38% on an annual basis in Q4 2023 to $2.28 billion in sales. Exciting New Products Powering growth at AMD stock moving forward are two new powerful microchips from the company, the Ryzen 8040 that promises to boost AI applications by up to 60%, and the MI300X accelerator chip that is used in data centers and meant to compete directly against Nvidia’s data center AI chips. Both of the new chips went on sale before Christmas last year and their sales for a full quarter have yet to be included in AMD’s earnings. The new Ryzen 8040 chips are being incorporated into laptops and PCs made by companies such as Dell Technologies DELL. At the same time both Meta Platforms META and Microsoft MSFT have placed big ordersto purchase the MI300X chip from AMD. The MI300X chip has 192 gigabits of memory and is more powerful that Nvidia’s top H100 chip that supports 120 gigabits of memory. Buy AMD Stock Few stocks have proven to be better investments than AMD. The company’s share price has risen 153% over the last 12 months and is up 790% over five years. Yet analysts still see more upside ahead. There are currently 28 “buy” ratings on the stock and no “sell” ratings. With accelerating growth and powerful new chips on the market, AMD remains one of the best ways to play the AI trade. AMD stock is a buy. On the date of publication, Joel Baglole held long positions in NVDA and MSFT. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Joel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @dehandreh @yo44ge4real @stvmcg @Arcanebear.eth @retirewithforex @sethsickness @aliams_david_trading_gram @mytradingsetup @fx_bitcoin_expert11 @tradingfrance @mytradingsetup @jordan_fx_ @nav.fx @itzi71 @laptopmoneygang @heinrich_j96 @johndollery @aggressivecalculator Whatever the trade "
}