{
    "title": "AMD Ryzen 7 5800U vs Intel Core i7-12650H vs AMD Ryzen 5 5560U",
    "date": "3/27/2024",
    "url": "https://www.notebookcheck.net/R7-5800U-vs-i7-12650H-vs-R5-5560U_12976_14051_15096.247596.0.html",
    "text": "The AMD Ryzen 7 5800U is a processor for thin and light laptops based on the Cezanne generation. The R7 5800U integrates all eight cores based on the Zen 3 microarchitecture and is the fastest U-series processor at launch. They are clocked at 1.9 (guaranteed base clock) to 4.4 GHz (Turbo) and support SMT / Hyperthreading (16 threads). The chip is manufactured on the modern 7 nm TSMC process. \nThe new Zen 3 microarchitecture offers a significantly higher IPC (instructions per clock) compared to Zen 2. For desktop processors AMD claims 19 percent on average and in applications reviews showed around 12% gains at the same clock speed. \nIn addition to the eight CPU cores, the APU also integrates a Radeon RX Vega 8 GPU with 8 CUs at up to 2000 MHz. The dual channel memory controller supports DDR4-3200 and energy efficient LPDDR4-4266 RAM. Furthermore, 16 MB level 3 cache (up from 8 MB at the 4800U) can be found on the chip. \nPerformance \nThe average 5800U in our database matches the Core i5-11260H and, perhaps a little disappointingly, the Ryzen 7 4800U in multi-core performance. \nThanks to its decent cooling solution and a long-term CPU power limit of 22 W, the ProBook x360 435 G8 is among the fastest laptops powered by the 5800U that we know of. It can be more than 10% faster in CPU-bound workloads than the slowest system featuring the same chip in our database, as of August 2023. \nPower consumption \nThis Ryzen 7 series chip has a default TDP (also known as the long-term power limit) of 15 W, a value that laptop makers are allowed to change to anything between 10 W and 25 W with clock speeds and performance changing accordingly as a result. Choosing the lowest value would allow one to build a passively cooled system around the Ryzen, however, most laptop manufacturers will do the opposite to extract as much performance out of the chip as possible. \nThe Ryzen 7 5800U is built with TSMC's 7 nm process for average, as of mid 2023, energy efficiency. The AMD Ryzen 7 5800U is a processor for thin and light laptops based on the Cezanne generation. The R7 5800U integrates all eight cores based on the Zen 3 microarchitecture and is the fastest U-series processor at launch. They are clocked at 1.9 (guaranteed base clock) to 4.4 GHz (Turbo) and support SMT / Hyperthreading (16 threads). The chip is manufactured on the modern 7 nm TSMC process. The new Zen 3 microarchitecture offers a significantly higher IPC (instructions per clock) compared to Zen 2. For desktop processors AMD claims 19 percent on average and in applications reviews showed around 12% gains at the same clock speed. In addition to the eight CPU cores, the APU also integrates a Radeon RX Vega 8 GPU with 8 CUs at up to 2000 MHz. The dual channel memory controller supports DDR4-3200 and energy efficient LPDDR4-4266 RAM. Furthermore, 16 MB level 3 cache (up from 8 MB at the 4800U) can be found on the chip. Performance The average 5800U in our database matches the Core i5-11260H and, perhaps a little disappointingly, the Ryzen 7 4800U in multi-core performance. Thanks to its decent cooling solution and a long-term CPU power limit of 22 W, the ProBook x360 435 G8 is among the fastest laptops powered by the 5800U that we know of. It can be more than 10% faster in CPU-bound workloads than the slowest system featuring the same chip in our database, as of August 2023. Power consumption This Ryzen 7 series chip has a default TDP (also known as the long-term power limit) of 15 W, a value that laptop makers are allowed to change to anything between 10 W and 25 W with clock speeds and performance changing accordingly as a result. Choosing the lowest value would allow one to build a passively cooled system around the Ryzen, however, most laptop manufacturers will do the opposite to extract as much performance out of the chip as possible. The Ryzen 7 5800U is built with TSMC's 7 nm process for average, as of mid 2023, energy efficiency. The Intel Core i7-12650H is a high-end mobile CPU for laptops based on the Alder Lake architecture. It was announced in early 2022 and offers 6 performance cores (P-cores, Golden Cove architecture) and 4 of the 8 efficient cores (E-cores, Gracemont architecture). The P-cores support Hyper-Threading leading to 16 supported threads when combined with the E-cores. The clock rate ranges from 2.3 to 4.7 GHz on the performance cluster and 1.7 to 3.5 GHz on the efficient cluster. The performance of the E-cores should be similar to old Skylake cores (compare to the Core i7-6700HQ). All cores can use up to 24 MB L3 cache. Compared to the 12700H, the 12650H offers only 4 instead of 8 E-cores, a slower iGPU and no vPro features (for remote management). \nPerformance \nThe average 12650H in our database is in the same league as the Core i9-11950H, Ryzen 5 7640HS, Ryzen 9 5900HS, as far as multi-thread benchmark scores are concerned. This is a very good result, as of early 2023. \nThanks to its decent cooling solution and a long-term CPU power limit of 80 W, the TUF Dash F15 FX517ZR is among the fastest laptops built around the 12650H that we know of. It can be more than 25% faster in CPU-bound workloads than the slowest system featuring the same chip in our database, as of August 2023. \nFeatures \nThe integrated memory controller supports various memory types up to DDR5-4800, DDR4-3200, LPDDR5-5200, and LPDDR4x-4267. The Thread Director (in hardware) can support the operating system to decide which thread to use on the performance or efficient cores for the best performance. For AI tasks, the CPU also integrates GNA 3.0 and DL Boost (via AVX2). Quick Sync in version 8 is the same as in the Rocket Lake CPUs and supports MPEG-2, AVC, VC-1 decode, JPEG, VP8 decode, VP9, HEVC, and AV1 decode in hardware. The CPU only supports PCIe 4.0 (x8 for a GPU and two x4 for SSDs). \nThe integrated graphics card is based on the Xe-architecture and offers 64 of the 96 EUs (Execution Units) operating at up to 1.4 GHz. \nPower consumption \nThis Core i7 has a \"minimum assured\" power consumption of 35 W, with 45 W being its Base power consumption. The processor's maximum Intel-recommended Turbo power consumption sits at 115 W. It would take at least two fans to cool such a beast. \nLast but not the least, Intel Core i7-12650H is built with Intel's fourth-generation 10 nm process marketed as Intel 7 for OK, as of early 2023, energy efficiency. The Intel Core i7-12650H is a high-end mobile CPU for laptops based on the Alder Lake architecture. It was announced in early 2022 and offers 6 performance cores (P-cores, Golden Cove architecture) and 4 of the 8 efficient cores (E-cores, Gracemont architecture). The P-cores support Hyper-Threading leading to 16 supported threads when combined with the E-cores. The clock rate ranges from 2.3 to 4.7 GHz on the performance cluster and 1.7 to 3.5 GHz on the efficient cluster. The performance of the E-cores should be similar to old Skylake cores (compare to the Core i7-6700HQ). All cores can use up to 24 MB L3 cache. Compared to the 12700H, the 12650H offers only 4 instead of 8 E-cores, a slower iGPU and no vPro features (for remote management). Performance The average 12650H in our database is in the same league as the Core i9-11950H, Ryzen 5 7640HS, Ryzen 9 5900HS, as far as multi-thread benchmark scores are concerned. This is a very good result, as of early 2023. Thanks to its decent cooling solution and a long-term CPU power limit of 80 W, the TUF Dash F15 FX517ZR is among the fastest laptops built around the 12650H that we know of. It can be more than 25% faster in CPU-bound workloads than the slowest system featuring the same chip in our database, as of August 2023. Features The integrated memory controller supports various memory types up to DDR5-4800, DDR4-3200, LPDDR5-5200, and LPDDR4x-4267. The Thread Director (in hardware) can support the operating system to decide which thread to use on the performance or efficient cores for the best performance. For AI tasks, the CPU also integrates GNA 3.0 and DL Boost (via AVX2). Quick Sync in version 8 is the same as in the Rocket Lake CPUs and supports MPEG-2, AVC, VC-1 decode, JPEG, VP8 decode, VP9, HEVC, and AV1 decode in hardware. The CPU only supports PCIe 4.0 (x8 for a GPU and two x4 for SSDs). The integrated graphics card is based on the Xe-architecture and offers 64 of the 96 EUs (Execution Units) operating at up to 1.4 GHz. Power consumption This Core i7 has a \"minimum assured\" power consumption of 35 W, with 45 W being its Base power consumption. The processor's maximum Intel-recommended Turbo power consumption sits at 115 W. It would take at least two fans to cool such a beast. Last but not the least, Intel Core i7-12650H is built with Intel's fourth-generation 10 nm process marketed as Intel 7 for OK, as of early 2023, energy efficiency. The AMD Ryzen 5 5560U, is a fairly fast Cezanne family processor designed for use in thinner, lighter laptops. The R5 5560U integrates six of the eight cores based on the Zen 3 microarchitecture. The cores are clocked at 2.3 (guaranteed base clock) to 4 GHz (Turbo) and support SMT for a total of 12 threads. The chip is manufactured on the modern 7 nm TSMC process. \nThe new Zen 3 microarchitecture offers a significantly higher IPC (instructions per clock) compared to Zen 2. For desktop processors AMD claims 19 percent on average and in applications reviews showed around 12% gains at the same clock speed. \nIn addition to the six CPU cores, the APU also integrates a Radeon RX Vega 6 integrated graphics card with 6 CUs at up to 1600 MHz. The dual channel memory controller supports DDR4-3200 and energy efficient LPDDR4-4266 RAM. Furthermore, 16 MB level 3 cache (up from 8 MB at the 4800U) can be found on the chip. \nPerformance \nThe Ryzen 5 is a solid upper mid-range CPU and should be only slightly slower than the Ryzen 5 5600U (+200 MHz Boost). \nPower consumption \nThis Ryzen 5 has a default TDP of 15 W, a value that laptop makers are allowed to change to anything between 10 W and 25 W with clock speeds and performance changing accordingly as a result. By going for the lowest value possible, it is possible to build a passively cooled system around this chip. Most laptop makers, however, will do the opposite to maximize performance. \nThe AMD Ryzen 5 5560U is built with TSMC's 7 nm manufacturing process for average, as of mid 2023, energy efficiency. The AMD Ryzen 5 5560U, is a fairly fast Cezanne family processor designed for use in thinner, lighter laptops. The R5 5560U integrates six of the eight cores based on the Zen 3 microarchitecture. The cores are clocked at 2.3 (guaranteed base clock) to 4 GHz (Turbo) and support SMT for a total of 12 threads. The chip is manufactured on the modern 7 nm TSMC process. The new Zen 3 microarchitecture offers a significantly higher IPC (instructions per clock) compared to Zen 2. For desktop processors AMD claims 19 percent on average and in applications reviews showed around 12% gains at the same clock speed. In addition to the six CPU cores, the APU also integrates a Radeon RX Vega 6 integrated graphics card with 6 CUs at up to 1600 MHz. The dual channel memory controller supports DDR4-3200 and energy efficient LPDDR4-4266 RAM. Furthermore, 16 MB level 3 cache (up from 8 MB at the 4800U) can be found on the chip. Performance The Ryzen 5 is a solid upper mid-range CPU and should be only slightly slower than the Ryzen 5 5600U (+200 MHz Boost). Power consumption This Ryzen 5 has a default TDP of 15 W, a value that laptop makers are allowed to change to anything between 10 W and 25 W with clock speeds and performance changing accordingly as a result. By going for the lowest value possible, it is possible to build a passively cooled system around this chip. Most laptop makers, however, will do the opposite to maximize performance. The AMD Ryzen 5 5560U is built with TSMC's 7 nm manufacturing process for average, as of mid 2023, energy efficiency. #0 checking url part for id 12976 +0s ... 0s #1 checking url part for id 14051 +0s ... 0s #2 checking url part for id 15096 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.038s ... 0.039s #6 did output specs +0s ... 0.039s #7 getting avg benchmarks for device 12976 +0.017s ... 0.055s #8 got single benchmarks 12976 +0.035s ... 0.09s #9 getting avg benchmarks for device 14051 +0.016s ... 0.107s #10 got single benchmarks 14051 +0.063s ... 0.17s #11 getting avg benchmarks for device 15096 +0.017s ... 0.186s #12 got single benchmarks 15096 +0.008s ... 0.194s #13 got avg benchmarks for devices +0s ... 0.194s #14 min, max, avg, median took s +0.397s ... 0.591s #15 return log +0s ... 0.591s "
}