{
    "title": "AMD calls time on the 60Hz gaming monitor era",
    "date": "3/7/2024",
    "url": "https://www.pcgamesn.com/amd/freesync-spec-144hz",
    "text": "AMD updates the specs for its FreeSync technology, requiring gaming displays to hit 144Hz to get even the basic level of certification. Ben Hardwidge Published: Mar 7, 2024 AMD has just consigned 60Hz gaming monitors to the trash when it comes to support for its active sync tech, with the company announcing a raft of changes that will see even the basic AMD FreeSync certification requiring a maximum refresh rate of at least 144Hz. This move by AMD reflects gamers’ demands for ever-increasing refresh rates, which result in much smoother visuals if your GPU’s frame rate can keep up with them. You won’t find a single display with a refresh rate under 144Hz on our best gaming monitor guide, and monitors that refresh at 240Hz or even 360Hz are now commonplace. Adaptive sync technologies such as FreeSync, as well as Nvidia G-Sync, basically synchronize your monitor’s refresh rate with the frame rate output of your GPU. This eliminates the tearing artifacts that appear when the two metrics are out of sync, plus Freesync stops image stutter that can happen if you use v-sync (also used to stop image tearing) as the refresh can vary with frame rate fluctuates, unlike v-sync, which is fixed. At the base level, the vanilla FreeSync spec used to only require a maximum refresh rate of 40-60Hz to get certified, but AMD has now whacked this all the way up to 144Hz, with the spec applying to monitors with a horizontal resolution below 3,440 pixels. Likewise, the spec for FreeSync Premium used to require a maximum refresh rate of at least 120Hz, but this figure has now increased to 200Hz for monitors with a horizontal resolution under 3,440 pixels. However, the spec remains at 120Hz for monitors with resolutions beyond this point, which is understandable, given that there aren’t too many 4K monitors that go beyond 144Hz right now. These spec changes only affect TVs and monitors, however – laptop displays currently retain the same FreeSync specs as before. Meanwhile, the FreeSync Premium Pro spec has changed in line with the FreeSync Premium spec, and adds support for FreeSync HDR. Explaining the move, AMD Product Marketing Manager for AMD Radeon graphics and AMD FreeSync technology, Oguzhan Andic, explained that “gaming monitors at 120Hz were a rarity in 2015; today the majority of gaming monitors are 144Hz or higher, which clearly shows the upward refresh rate trend in the industry.” Andic added that “AMD FreeSync technology certification is a guarantee of a great experience and we want to keep it that way.” If you want to learn more about how today’s gaming monitors work, make sure you read our full guide to the best monitor panel tech, where we explain all about how IPS, VA, and TN panels work. Ben Hardwidge                 A tech journalist since 1999, and a PC hardware enthusiast since 1989, Ben has seen it all, from the horrors of CGA graphics to the amazing ray-tracing GPUs of today. Ben is mainly interested in the latest CPU and graphics tech. "
}