{
    "title": "AMD Stock Has Stumbled Amid Pause in AI Chipmaker Rally—Watch This Key \nPrice Level",
    "date": "3/12/2024",
    "url": "https://www.investopedia.com/amd-stock-has-stumbled-amid-pause-in-ai-chipmaker-rally-8607793",
    "text": " Advanced Micro Devices (AMD) extended losses for a second straight session on Monday as investors reassessed how much more room artificial intelligence (AI) chipmakers have to run after their record breaking rally. After closing at a record high on Thursday, AMD shares fell 1.9% on Friday and dropped another 4.3% on Monday, The stock, which has gained 35% since the start of the year, was up 0.7% at $199.70 in pre-market trading Tuesday at 7:00 a.m. ET. Magnificent Seven member Nvidia (NVDA) first tripped the AI bull run circuit breaker Friday after its stock staged a dramatic 10% intraday reversal after prominent analysts cautioned about its future growth potential. Those concerns carried over into AMD’s’ stock Monday, as the chipmaker is seen by many investors as a smaller version of Nvidia that has ridden the enterprise AI adoption boom. Despite the pause in AMD’s stock rally, the chipmaker looks well positioned to capture a growing market share of AI chip sales. In December, Facebook parent Meta (META) and Microsoft (MSFT) said they will use AMD’s newest AI chip in a sign that technology companies are searching for alternatives to Nvidia’s pricy graphics processors units (GPUs) when building out their AI infrastructure. Moreover, analysts expect AMD to grow earnings annually by around 40% to more than $7 a share by 2026. Like Nvidia’s stock, the AMD share price formed a bearish engulfing pattern on Friday before gapping lower and extending its decline Monday. If further weakness persists, keep an eye on the $176 level. This area on the chart finds a confluence of support from a uptrend line stretching back to the late October low, the rising 50-day moving average, and the key 38.2% Fibonacci retracement level. A breakdown below this important technical level could lead to a deeper pullback towards the 200-day moving average, currently sitting at $127.99. The comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author does not own any of the above securities. CNBC. \"Meta and Microsoft Say They Will Buy AMD's New AI Chips as an Alternative to Nvidia's.\" Barron's. \"6 Stocks to Buy—When the Market Finally Drops.\" "
}