{
    "title": "Better AI Stock: Arm Holdings vs. Advanced Micro Devices (AMD)",
    "date": "3/18/2024",
    "url": "https://www.fool.com/investing/2024/03/18/better-ai-stock-arm-holdings-vs-advanced-micro-dev/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Arm Holdings (ARM -0.50%) and AMD (AMD 0.50%) represent two different ways to invest in the booming demand for artificial intelligence (AI) chips. Arm doesn't produce any chips of its own; it only designs central processing units (CPUs) and licenses its designs to chipmakers including Qualcomm and Apple. It's been rolling out new AI-oriented chip designs for phones, servers, and vehicles. AMD produces x86 CPUs, discrete graphics processing units (GPUs), custom accelerated processing (which combine CPUs and GPUs), and programmable chips. It outsources the production of those chips to third-party foundries such as Taiwan Semiconductor. It's also been carving out a niche in the data center market with its Epyc server CPUs and Instinct GPUs for processing AI applications. Image source: Getty Images. Arm went public again last September, seven years after Japanese conglomerate SoftBank acquired it, and its stock has rallied nearly 150% since its IPO. AMD's stock has also risen nearly 90% over the past six months. Let's see why these two chip stocks soared -- and which one is the better buy right now. Arm's chip designs are generally more compact and more power-efficient than Intel and AMD's x86 CPUs. That makes them well suited for mobile devices, Internet of Things gadgets, low-end servers, and connected vehicles. Arm's chip designs are used in more than 95% of the world's smartphones, and it generates most of its royalties and licensing revenue from the smartphone market. Its revenue rose 33% in fiscal 2022, which ended in March 2022, as the 5G upgrade cycle continued, but dipped 1% in fiscal 2023 as that cycle ended. Macro headwinds in China and other major smartphone markets exacerbated that slowdown. But in the first nine months of fiscal 2024, Arm's revenue increased 13% year over year. It expects 18%-20% growth for the full year. It attributed that acceleration to the stabilization of the smartphone market, the growing demand for its new AI-enabled handset chip designs that sport higher royalty rates, market share gains against x86 CPUs in the cloud server market, and more installations of advanced driver assistance systems in connected vehicles. Arm's gross margin also held steady at 95% in the first nine months of fiscal 2024, and it expects its adjusted operating margin to rise from 29% in fiscal 2023 to a midpoint of 53% in fiscal 2024, even as it develops new chips. For fiscal 2025, analysts expect Arm's revenue and adjusted earnings per share (EPS) to rise 25% and 28%, respectively, as the AI market expands. Those growth rates are impressive, but its stock looks richly valued at 82 times forward earnings and 34 times next year's sales. AMD is an underdog in the x86 CPU and discrete GPU markets. Intel leads the former while Nvidia dominates the latter. However, AMD stayed competitive in both markets by selling comparable chips at lower prices. It usually accomplished that feat by drawing more power through its older chip designs, which made them less power efficient but more economical than Intel and Nvidia's chips. AMD has been ramping up its production of Epyc CPUs, Instinct GPUs, and programmable chips for data centers, but it still generates most of its revenue from the PC and gaming console markets. In 2023, its revenue fell 4% as sales of PCs and gaming consoles cooled off in a post-pandemic market. Its gross margin dipped from 52% to 50%, its operating margin dropped from 27% to 21%, and its adjusted EPS declined 24%. That slowdown was disappointing, but analysts expect AMD's revenue and adjusted EPS to grow 14% and 37%, respectively, in 2024. That acceleration should be driven by the stabilization of the PC market and the rollout of its latest Instinct GPUs, which cost significantly less than Nvidia's top-tier GPUs, for the AI market. But based on those expectations, AMD's stock isn't cheap at 57 times forward earnings and 12 times this year's sales. Investors clearly have high expectations for its nascent AI business, but it still faces fierce competition from Nvidia and a resurgent Intel, which could both throttle its long-term growth and compress its lofty valuations. Arm and AMD should both benefit from the secular expansion of the AI market, but both stocks seem pricy relative to their near-term growth potential. In fact, both stocks are actually more expensive than the market bellwether Nvidia, which is growing a lot faster but trades at 36 times forward earnings and 20 times this year's sales. Therefore, I wouldn't be in a hurry to buy Arm or AMD right now. But if I had to choose one over the other, I'd stick with AMD because its growth rates are more stable, its business is more broadly diversified, and its stock is significantly cheaper. Moreover, Arm's former parent company, SoftBank, also still owns about 90% of its outstanding shares, and it could drive its stock a lot lower if it decides to cash in on the chip designer's big post-IPO gains. Leo Sun has positions in Apple and Qualcomm. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Nvidia, Qualcomm, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}