{
    "title": "AMD is working on an AI-powered version of FSR to compete with DLSS and XeSS",
    "date": "3/4/2024",
    "url": "https://www.dsogaming.com/news/amd-is-working-on-an-ai-powered-version-of-fsr-to-compete-with-dlss-and-xess/",
    "text": "By now, we’ve showcased how superior both NVIDIA DLSS and Intel XeSS Super Resolution are to AMD FSR. While FSR can sometimes be faster, it has noticeably worse image quality. That has been a HUGE issue with FSR Super Resolution. And from the looks of it, AMD is currently working on an AI-powered version of FSR. AMD CTO Mark Papermaster told No Priors that AMD will be enabling gaming devices to upscale using AI and 2024 will be a really huge deployment year. As Papermaster claimed: “2024 is a giant year for us because we spent so many years in our hardware and software capabilities for AI. We have just completed AI-enabling our entire portfolio, so you know cloud, edge, PCs, and our embedded devices, and gaming devices. We are enabling gaming devices to upscale using AI and 2024 is a really huge deployment year.” We currently don’t know which AMD Radeon GPUs will support this AI-powered version of FSR. My guess is that the latest AMD 7000 GPU series will be able to take advantage of it. Whether RDNA and RDNA 2 will also be able to use it remains to be seen. There is currently no ETA on when this AI-powered version of FSR will come out. We also don’t know whether the games that already support FSR will be able to automatically take advantage of it. Will they have to update their games with the new FSR code? Or will FSR be able to automatically use the AI in order to improve the quality of Super Resolution? The former seems like the most possible scenario. Thus, unless developers update their games, AMD GPU owners won’t be able to enjoy a higher image quality. Again, this is great news for AMD fans. Moreover, this shows how late to the party AMD is. NVIDIA has invested a lot of money and R&D on its AI-powered DLSS. And from the looks of it, this has paid off as pretty much everyone else is following its example. For what it’s worth, AMD hasn’t officially announced yet this new version of FSR. Naturally, though, we’ll be sure to keep you posted! John is the founder and Editor in Chief at DSOGaming. He is a PC gaming fan and highly supports the modding and indie communities. Before creating DSOGaming, John worked on numerous gaming websites. While he is a die-hard PC gamer, his gaming roots can be found on consoles. John loved – and still does – the 16-bit consoles, and considers SNES to be one of the best consoles. Still, the PC platform won him over consoles. That was mainly due to 3DFX and its iconic dedicated 3D accelerator graphics card, Voodoo 2. John has also written a higher degree thesis on the “The Evolution of PC graphics cards.”\nContact: Email "
}