{
    "title": "PeakDo concept involves AMD Ryzen 7 8840H and handheld screen for local \ngame streaming",
    "date": "1/7/2024",
    "url": "https://videocardz.com/newz/peakdo-concept-involves-amd-ryzen-7-8840h-and-handheld-screen-for-local-game-streaming",
    "text": "Sony Remote Player just for Windows.  Chinese company PeakDo is previewing its upcoming gaming handheld concept. At first glance, it may resemble a typical system powered by the Ryzen 7 7840U/Ryzen Z1 APUs, but its functionality is more aligned with the Sony PlayStation Portal Remote Player. Essentially, this device consists of a screen with gamepads that receives data from a local main unit. Rather than relying on the internal processor’s power, the console utilizes a remote device to transmit the image. In other words, it needs an external device to stream the content from. While this approach introduces some additional latency, the concept minimizes this delay by being based on a local device using Millimeter Wave connectivity. The MM waves are also used by Wi-Fi, but it is assumed that PeakDo will use custom frequency for this device.   Source: PeakDo  The device features a built-in 100Wh battery, with the option for expansion by an additional 100Wh. It’s noteworthy that current laptops adhere to a 99.9Wh battery limit due to regulations for Lithium-ion size during air travel. Additionally, the system supports storage expansion (up to 2x PCIe Gen4), along with 5G, Wi-Fi 6, and Bluetooth 5.2 connectivity.   Source: PeakDo  More importantly, it houses an AMD Ryzen 7 8840H APU with a TDP of up to 54W. Such a high TDP is typically seen in larger handheld systems with efficient cooling, and in this case, the external device takes care of this issue. Interestingly, the entire concept assumes that gamers will carry both the handheld streaming device and the screen. No mention is made of any option to use the handheld device independently. Thus, this is more of a shoulder-carried-system with a handheld screen. This somewhat contradicts the idea of a truly portable gaming device. A similar idea was already employed by ZOTAC for the gaming backpacks for Virtual Reality. Nevertheless, the company appears committed to unveiling a fully functional device around March this year during the expected official release. Source: Bilibili via Everest We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}