{
    "title": "I tested Nvidia’s RTX 4070 Super against the RX 7800 XT — and it’s \nshockingly close",
    "date": "1/17/2024",
    "url": "https://www.digitaltrends.com/computing/nvidia-rtx-4070-super-vs-amd-rx-7800-xt/",
    "text": "Digital Trends may earn a commission when you buy through links on our site. Why trust us? Nvidia’s new RTX 4070 Super feels like a direct response to AMD. After losing in some rankings to AMD’s RX 7800 XT, this Super refresh appears like Nvidia’s bid to reclaim the performance crown among the list best graphics cards. Which is the better card for your next PC build, though? We’ve tested both GPUs extensively, which you can read about in our RTX 4070 Super review and RX 7800 XT review. Here, we’re putting the cards head-to-head to see which GPU comes out on top. And it’s a much closer battle than we expected. Nvidia’s RTX 4070 Super is the newer GPU between these two, and will launch on January 17 for a list price of $600. There are models available at that price, but you’ll commonly find overclocked versions for slightly more. We’ve seen prices around $650, with some of the most extreme models pushing up to $700. Still, you only need to spend $600 to get an RTX 4070 Super. Stock is plentiful, at least at the time of writing, so we don’t expect prices to shoot up out of nowhere. The RX 7800 XT is in a slightly different position. The card released late last year for a list price of $500, but it didn’t stay at that price for long. Due to how the card performed compared to the base RTX 4070, most models rose to around $550. Nvidia’s Super model is reversing that price increase, but most models are still listed above list price. At the time of writing, we only found one model available at $500. Most others are listed between $530 and $550. It’s hard to say where prices go from here. With the RTX 4070 Super at $600, it’s hard to imagine the RX 7800 XT will drop below its original list price. For now, we’re looking at a price difference of somewhere between $50 and $100, with the RTX 4070 Super being the more expensive card. It’s not worth comparing the core specs of an AMD and Nvidia graphics card. AMD and Nvidia count their cores differently, and those cores interact with clock speed differently. Nvidia has twice as many cores, and even a slightly faster clock speed. But that doesn’t actually mean much of anything when it comes to performance. The two specs we can compare are power and memory. In terms of power, Nvidia definitely has an edge. The RTX 4070 Super has a Total Graphics Power (TGP) of 220 watts, while AMD comes in higher at 263W. That said, AMD uses two traditional 8-pin power connectors while most RTX 4070 Super models opt for a 12VHPWR 16-pin connector. If you don’t have an ATX 3.0 power supply, that means you’ll need to use an adapter with more RTX 4070 Super models, which can be a bit unsightly in a case. Still, Nvidia comes out ahead with lower power and better efficiency overall. AMD’s win comes in memory. The RX 7800 XT comes with 16GB of GDDR6 memory on a 256-bit bus. AMD also packs in 64MB of its Infinity Cache, which improves the overall effective bandwidth of this memory interface. Nvidia took some notes from AMD with the RTX 4070 Super. It boasts a bit of extra cache — 48MB of extra speedy L2 cache, to be exact — but it comes with a thinner bus and less overall capacity. Nvidia squeezes in 12GB of GDDR6X memory on a 192-bit bus. Nvidia’s effective bandwidth is lower, but that shouldn’t be much of an issue with the card. Between the two, AMD is definitely better equipped to handle the VRAM demands of modern games, particularly at 4K with ray tracing enabled. However, neither card struggles with VRAM issues in most games. It would be nice to have 16GB on the RTX 4070 Super, but the 12GB available to the card rarely becomes a limiting factor. Both the RTX 4070 Super and RX 7800 XT are built for 1440p, though with enough juice to power 4K gaming with a few compromises. The cards trade blows at 1440p, but as the prices suggest, Nvidia comes out slightly ahead with the RTX 4070 Super. Across our full suite of games, including titles with ray tracing, the RTX 4070 Super is about 8% faster at 1440p. Ray tracing does a lot of the heavy lifting, however. If we single out just the games without ray tracing, you can see how close the two cards really are at this resolution. The RTX 4070 Super takes some big wins in titles like Horizon Zero Dawn and Red Dead Redemption 2. However, the lead in games like Returnal and The Last of Us Part 1 are barely large enough to register. In fact, the RX 7800 XT actually wins in a few titles, namely Cyberpunk 2077 and Resident Evil 4. The margins are small for AMD, but it’s important to keep in mind that the RX 7800 XT is anywhere from 8% to 17% cheaper than the RTX 4070 Super depending on the model you buy. That’s 1440p, but what about 4K? The margins become much tighter, with Nvidia leading by only around 4% across my entire test suite. The spacing is similar to what we saw at 1440p, but the differences in frame rate become much smaller. Short of a few games, it would be hard to tell the difference between these frame rates in a blind test. We need some context here, though. In 3DMark Time Spy, the RTX 4070 Super is around 12% ahead of the RX 7800 XT. We can only test so many games, and we’re mostly focused on the newest, most demanding titles. Overall, we expect the RTX 4070 Super to be between 5% and 10% ahead of the RX 7800 XT. AMD still wins in that battle due to the RX 7800 XT’s price, but Nvidia has two feathers in its cap: ray tracing and DLSS. It shouldn’t come as a surprise, but the RTX 4070 Super shoots ahead when you factor in ray tracing games. AMD has massively improved its ray tracing efforts, but Nvidia still holds a lead that’s hard for Team Red to contend with. The bigger factor here isn’t ray tracing, however. It’s DLSS. The RTX 4070 Super supports DLSS 3.5, which includes upscaling, frame generation, and ray reconstruction. It makes extremely demanding games like Alan Wake 2 and Cyberpunk 2077 possible with path tracing. The list of titles that support DLSS Frame Generation has grown massively as well, so you can get a performance boost in most modern games. For its part, AMD has FSR 3 for the RX 7800 XT. The list of FSR 3 games is much smaller, and the quality isn’t as good as DLSS 3. However, AMD also offers its Fluid Motion Frames feature through the driver. This applies frame generation to any game. It doesn’t work nearly as well as DLSS 3, especially through the driver, but it’s a shortcut to higher performance if you need it. Considering the package the RTX 4070 Super offers with DLSS 3.5, it definitely has an edge. You don’t need to use the full suite of features in every game, but it makes a world of difference when those showcase games like Alan Wake 2 come along. AMD takes a wide approach with support for basically any game, though not enough quality or performance to make a difference where it really counts. It’s a tough choice between the RTX 4070 Super and RX 7800 XT. Both are excellent graphics cards, so you’ll have a great 1440p gaming experience regardless of the GPU you choose. For most gamers, however, the RTX 4070 Super is the way to go. The card is more expensive, but Nvidia makes up for it with not only higher overall performance, but also DLSS 3.5 and far better ray tracing. It’s easy to write these features off when you’re eyeing more budget-focused graphics cards, but when you’re spending $500 or $600 on a GPU, you want access to the latest and greatest. And the RTX 4070 Super handles that level of gameplay much better than the RX 7800 XT does. AMD’s card still has its place, however, particularly if you don’t need those showcase experiences like Alan Wake 2 and Cyberpunk 2077‘s path tracing mode. If you’re more concerned with overall performance across a wide swath of games, the RX 7800 XT gets most of the way there — and it’s a heck of a lot cheaper. AMD and Nvidia are always competing when it comes to producing the best graphics card of the year. It's safe to say that they both always try, but AMD's latest attempt feels like it may seriously backfire. The new RX 7600 XT feels like an attempt to fix problems with the original RX 7600, but it ends up being something that Nvidia should be sending AMD a fruit basket for.\nAMD repeated Nvidia's mistakes\nNvidia's RTX 40-series is, for the most part, a success. The addition of DLSS 3 made the lower-tier cards really pop, and the flagship RTX 4090 offers a massive generational uplift. But Nvidia made a couple of mistakes with this generation, and surprisingly, AMD repeated them both with the RX 7600 XT. The RTX 4070 Ti Super and RX 7900 XT are unlikely rivals when shopping for the best graphics card in 2024. Price shifting and market repositioning have placed these two GPUs in direct competition, both targeting gamers looking for a premium 4K gaming experience without spending over $1,000. Both graphics cards hit the mark, offering a smooth frame rate at 4K with all the settings cranked up. The differences between them lie in features and pricing. AMD's new RX 7600 XT graphics card isn't off to a great start, at least according to sales data shared by 3DCenter. The new video card launched on Wednesday alongside Nvidia's RTX 4070 Ti Super, and even with a relatively poor reception, Nvidia sold nearly 10 times as many graphics cards as AMD did in a sampling at a German retailer. There are a few caveats to that, however. 3DCenter takes data for the number of sales from Mindfactory, a German hardware retailer, 12 to 14 hours after release. According to the data, weaker GPUs like the RTX 4060 and RX 7600 sell considerably less than more powerful GPUs like the RTX 4070 Super and RX 7800 XT. It indicates some bias in this data, perhaps showing that this retailer caters to a crowd willing to spend more money on a graphics card. Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}