{
    "title": "AMD Radeon RX 7800 XT is now available for $489 (Update: now $479)",
    "date": "1/28/2024",
    "url": "https://videocardz.com/newz/amd-radeon-rx-7800-xt-is-now-available-for-489",
    "text": "The most popular RDNA3 desktop GPU is on sale for the lowest price ever.  The AMD RX 7800XT, equipped with the Navi 32 XT GPU featuring 3840 Stream Processors, has proven to be a success for the company. Unlike its sibling, the RX 7700 XT, the 7800XT not only came with great specs straight out of the box, but was also reasonably priced. It was also released in September at the same time as important updates for AMD’s software, including FSR3 technology. What sets the RX 7800XT apart is its consistent availability at the suggested retail price (MSRP) for the past five months, a testament to its strong sales performance. Compared to its closest price competitor, the GeForce RTX 4060 Ti 16GB, it shows superior performance. However, it is now facing a new competitor, the RTX 4070 SUPER, although at a $100 higher price, which is indeed faster in gaming tests. Now, surrounded by two RTX 4070 models (the non-SUPER SKU is now available at $549), ASRock has decided to be the first board partner to lower the price for their Navi 32 powered Radeon model to $489.99. This price is available through a promo code. Update: Gigabyte has lowered the price for their Gaming OC model as well. The card is available at $480 with the promo code. This is even lower price than ASRock GPU. Radeon RX 7800 XT deal at Newegg (affiliate link): The card still comes with the $70 worth Avatar Frontiers of Pandora game code. Worth adding that this promotion is live only for the next two days.   ASRock Challenger SKU, Source:Newegg  As for the card itself, this is a custom GPU with some small overclocking. The card ships with 2169 MHz game clock and 2475 MHz boost clock, which is about 2% increase over AMD specs, but this is a standard OC for the budget-oriented RX 7800 XT models. The card is a 2.5-slot design with 3x DisplayPort 2.1 (UHBR3 13.5) support. The card is also equipped with one HDMI 2.1 connector. ASRock’s Challenger measures 26.7 cm in length and 13 cm in width. It requires two standard 8-pin power connectors to run, no adapters needed. Source: Newegg We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}