{
    "title": "ASRock's new AMD entry-level gaming GPUs look enticing — custom Radeon RX \n7600 XT GPUs with boost clock ...",
    "date": "1/19/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/asrocks-new-amd-entry-level-gaming-gpus-look-enticing-custom-radeon-rx-7600-xt-gpus-with-boost-clock-speeds-up-to-2810-mhz",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Two custom Radeon RX 7600 XT to rival the RTX 4060s on the market AMD's looming Radeon RX 7600 XT is poised to replace the regular Radeon RX 7600 as one of the best graphics cards available. ASRock has unveiled the Radeon RX 7600 XT Steel Legend and Radeon RX 7600 XT Challenger based on the Navi 33 (codenamed Hotpink Bonefish) silicon and wielding 16GB of GDDR6 memory. The Radeon RX 7600 XT Steel Legend measures 12 inches (304 mm) long and features a 2.6-slot design with a triple-fan cooling solution. The graphics card has a white shroud, an arctic camouflage-inspired metal backplate, and abundant RGB lighting that falls into ASRock's Polychrome Sync ecosystem. The company utilizes a two-ounce cop manufactured with high-density glass fabric and 90A power chokes for the Radeon RX 7600 XT Steel Legend. A huge nickel-plated copper base keeps the Navi 33 die and surrounding GDDR6 memory modules cool, while thick heat pipes transfer the heat to the big heatsink with stacked fins. The game and boost clock speeds on the Radeon RX 7600 XT Steel Legend are 2,810 MHz and 2,539 MHz, respectively. They're only up to 3% faster than the reference Radeon RX 7600 XT specifications, so it's not a substantial factory overclock. The Radeon RX 7600 XT Steel Legend draws power from two 8-pin PCIe power connectors, and ASRock recommends a 650W power supply as the minimum capacity. The graphics card connects to your displays with three DisplayPort 2.1 outputs and a single HDMI 2.1 port. Meanwhile, the Radeon RX 7600 XT Challenger is on the opposite end of the product stack. Measuring just 10.5 inches (267 mm), the graphics card has a toned-down look, with a completely black exterior with white highlights. There is still some illumination, but it's limited to four blue LED indicators. Despite the aesthetic difference with the Radeon RX 7600 XT Steel Legend, the Radeon RX 7600 XT Challenger features similar ingredients, such as the two-ounce copper PCB, 90A power chokes, and a bulky heatsink. The Radeon RX 7600 XT Challenger functions with a 2,516 MHz game clock but can boost up to 2,799 MHz. It's a hairline slower than the Radeon RX 7600 XT Steel Legend. Therefore, it requires the same dual 8-pin PCIe power connector arrangements and has the same 650W power supply recommendation. Outputs include three DisplayPort 2.1 outputs and one HDMI 2.1 port. The Radeon RX 7600 XT will launch on January 24 with a SEP (Suggest Etail Price) of $329; therefore, ASRock hasn't revealed the pricing for the Radeon RX 7600 XT Steel Legend (RX7600XT SL 16GO) and Radeon RX 7600 XT Challenger (RX7600X CL 16GO). The former will likely carry a small premium, whereas the latter could arrive at AMD's $329 SEP. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. In terms of competition, the Radeon RX 7600 XT will go up against Nvidia's GeForce RTX 4060 ($299) and Intel's Arc A770 ($329). AMD won't sell an MBA (Made by AMD) model for the Radeon RX 7600 XT, so we'll only see custom models from the chipmaker's AIB partners, such as Acer, ASRock, Asus, Gigabyte, PowerColor, Sapphire, and XFX. Zhiye Liu is a Freelance News Writer at Tom’s Hardware US. Although he loves everything that’s hardware, he has a soft spot for CPUs, GPUs, and RAM. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 Dutch gov't to invest $2.7 billion to keep ASML in the Netherlands - roads, trains and education included in package By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Ash HillMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}