{
    "title": null,
    "date": "1/4/2024",
    "url": "https://www.medicalnewstoday.com/articles/wet-amd-progression",
    "text": "Age-related macular degeneration (AMD) is a progressive disease that affects a person’s central vision. Wet AMD is a less common, late stage form of AMD that involves rapid vision loss. However, treatment can help. Treatment for wet AMD may help slow the disease’s progression and prevent further vision loss. Early treatment may also help reverse some of the initial damage from the disease. This article reviews wet AMD, its progression, and more. Wet AMD develops in approximately 10% of people living with dry AMD. In 2019, about 19.8 million Americans, or about 12.6% of the population, were living with AMD. Wet AMD is a progressive disease. It occurs when new blood vessels form in the back of the eye and then leak or burst. The fluid leakage can cause scarring on the macula, a central section of the retina that helps provide clear central vision. Without treatment, wet AMD can lead to irreversible vision loss. Even with treatment, a person may still experience some vision loss as the disease progresses. A person can slow the progression of wet AMD with treatment. Treatments focus on reducing the number of blood vessels that form in the eye and help reduce or slow the leakage of fluids from these vessels. A person who thinks they have AMD should seek treatment promptly to help preserve as much vision as possible. Regular eye examinations are also crucial in detecting AMD and preventing vision loss. There are two types of AMD: dry and wet. Dry AMD has three stages, including: It typically progresses slowly over several years. It is also the most common form of AMD. Experts consider wet AMD a form of late stage AMD, though it is less common than dry AMD. It is more likely to cause rapid vision loss. Without treatment, wet AMD can cause significant central vision loss. Treatment can help, but a person may still lose some of their vision. People living with wet AMD may notice symptoms such as: Treatment can help slow the progression of wet AMD. Currently, treatments include intravitreal anti-vascular endothelial growth factor (anti-VEGF) agents and photodynamic therapy (PDT). Healthcare professionals inject anti-VEGF agents directly into the eye. This medication helps reduce the number of atypical blood vessels in the eye and slow leaking. PDT involves a combination of laser treatment and medications. Laser treatments help reduce the number of blood vessels in the eyes. Before a diagnosis of wet AMD, a person with more advanced forms of dry AMD may find that taking AREDS 2 can help slow the progression of the disease and prevent wet AMD from developing. AREDS 2 is a supplement containing several different vitamins that support eye health. Though available over the counter, a person should discuss taking AREDS 2 with a doctor before taking them, as they can interact with other medications. A person with AMD should also follow a diet rich in green leafy vegetables, brightly colored fruits and vegetables, and fatty fish to support eye health. Making certain lifestyle changes may help reduce a person’s risk of developing AMD, including: These steps may not directly slow or treat wet AMD but may help prevent its development. Wet AMD is a progressive disease that can cause significant vision loss. Treatment and lifestyle changes may help slow the progression of the disease. However, in most cases, reversing lost vision is not possible. A person needs to speak with an eye doctor if they notice changes in their vision. They should also consider getting regular eye exams to help detect and treat eye problems. Last medically reviewed on  January 4, 2024 Share this article What does inflammation have to do with the progression of age-related macular degeneration (AMD)? Read more about the effect of inflammation and… There are two types of macular degeneration: wet and dry. Read about the symptoms, progression, and treatment of both types. Macular degeneration is not reversible, but it is treatable and preventable in some cases. Click here to learn more. Find out about possible interactions between Izervay and other medications, supplements, alcohol, foods, and more. Get the facts on Beovu’s dosage. You can also learn how to use the drug, which form it comes in, and more. OUR BRANDS "
}