{
    "title": "AMD's new Ryzen 5 8600G with RDNA 3 graphics spotted in new online \nbenchmarks",
    "date": "1/3/2024",
    "url": "https://sg.news.yahoo.com/amds-ryzen-5-8600g-rdna-155438857.html",
    "text": "AMD may be gearing up to release its latest additions to its AM5 desktop processors, the Ryzen 5 8600G, featuring updated RDNA 3 graphics technology. These processors will be based on the mobile Hawk Point silicon, capable of incorporating up to 12 RDNA 3 Compute Units. Despite the nomenclature, the Ryzen 8000G series is not a direct successor to the 7000 series. Instead, it's designed to cater to a distinct market segment that prioritizes integrated GPU performance over CPU capabilities. Recent testing spotted by VideoCardz has provided insights into one of the upcoming 8000G SKUs, the Ryzen 5 8600G APU. Testing took place on an MSI X670E ACE motherboard, an unusual choice for an APU as it is typically paired with the very best processors from an enthusiast standpoint, not a more modest APU. According to Geekbench 6 benchmark compute reports (found here and here), the Ryzen 5 8600G will boast 6 cores and 12 threads, differentiating it from its predecessor, the Ryzen 5 8500G. It's expected to employ 6 Zen 4 cores, a notable upgrade from the hybrid configuration of two Zen 4 and four Zen 4c cores in the 8500G. The benchmark results also reveal a base clock of 4.35GHz and a boost clock reaching 5.0 GHz, a significant improvement over the Zen 3+ architecture-based Ryzen 5 5600G. As for GPU specifications, the APU will feature Radeon 760M integrated graphics, comprising 8 Compute Units clocked at 2.8 GHz. The Ryzen 8000G series is expected to launch within the next couple of months, though AMD has not disclosed any specific launch events. But with CES 2024 right around the corner, there's a chance we'll get more details sooner rather than later. With the success of the AMD Ryzen 7000-series processors, which feature integrated RDNA 2 graphics, some might wonder if new AMD Ryzen 8000G-series chips are really needed. In previous generations, like the Ryzen 5000-series, there was no integrated graphics in the main Ryzen releases like the AMD Ryzen 7 5800X3D, so having a chip like the Ryzen 5 5600G, which integrated RDNA GPU cores, made sense. At this point though, even the upgrade to RDNA 3 cores doesn't make as much sense since, while more powerful, these cores aren't going to be so much more powerful on their own to replace having one of the best graphics cards in your PC for gaming purposes, and having a regular Ryzen 7000 chip in your mini PC is going to be more than sufficient for non-gaming purposes. Still, for budget builders who are looking to make their little cousins a Fortnite rig on the cheap, these chips might be just what they're looking for when even the best cheap graphics card still costs a couple hundred dollars. AMD reveals a full stack of shiny new Ryzen laptop processors, supercharged with AI What I want to see from AMD in 2024 AMD in 2023: year in review Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order.  My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap.  New agile US Marine formations are learning how to battle adversaries like China on remote islands, according to The Washington Post. In this week’s travel roundup we bring you transport trivia, Roman engineering marvels and the world’s tastiest dumpling. Dini von Mueffling is a PR professional in New York City's who's worked with Monica Lewinsky and Virginia Giuffre.  When Sam* married her husband, she never imagined that 20 years on, she'd have not one, but two affairs... Surveillance footage captures the harrowing moment a wild boar viciously attacks a 70-year-old man in his front yard in Guangyuan, China, on March 24. The man sustains severe spinal injuries while defending himself against the enraged animal's assault. Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp.  The post Bites by Ann Chin: Michelin popiah, loaded waffles & local bites in hole-in-wall eatery appeared first on SETHLUI.com. The visibly upset MSNBC anchor was responding to the Trump's attack on Judge Juan Merchan's daughter despite gag orders The post Nicole Wallace Gets Fed Up, Tosses Script While Covering Latest Trump Attack: ‘What Are We Going to Do Different?’ | Video appeared first on TheWrap. City Developments Limited ( SGX:C09 ), is not the largest company out there, but it received a lot of attention from a...  Israel assassinated a Syrian colonel in Damascus and a senior Hezbollah commander in Lebanon in a series of pinpointed strikes amid the largest attacks on neighbouring countries since the start of the war in Gaza. Watch as King Charles III attends church on Easter Sunday in his most significant public appearance since he was diagnosed with cancer.  The Princess of Wales and her family will not be at the service.  Charles, 75, will join the Queen and other members of the royal family at the annual Easter Mattins Service at St George’s Chapel at Windsor Castle on Sunday 31 March. Full-back has become invaluable at Anfield and would surely thrive under Klopp’s possible replacement Roberto De Zerbi  The post Fiie’s Cafe — ‘Mr Grumpy’ fried chicken officially lands in Toa Payoh appeared first on SETHLUI.com. Health officials are alerting doctors to be on the lookout for certain types of rare but serious meningococcal infections that are on the rise in the United States. Princess Eugenie and Princess Beatrice reportedly want to become working royals and are upset about King Charles snubbing them. "
}