{
    "title": "This AMD Ryzen 7 CPU is now cheaper than its Black Friday price",
    "date": "1/15/2024",
    "url": "https://www.trustedreviews.com/deals/this-amd-ryzen-7-cpu-is-now-cheaper-than-its-black-friday-price-4408156",
    "text": "Trusted Reviews is supported by its audience. If you purchase through links on our site, we may earn a commission. Learn more. We’re well beyond Black Friday now, and the Boxing Day sales are in the rearview mirror, but the deals continue. This AMD processor can be nabbed for cheaper than its Black Friday deal price. AMD has a strong range of desktop processors with many capable in both gaming and creative work. This one may not be one of the latest and greatest but it’ll still get the job done. Getting the job done is currently even cheaper, as you can get the AMD Ryzen 7 5800X3D for just £262 right now, down from £289. It’s a solid deal for a chip category that often costs you between £300-£450, and this particular chip also comes equipped with AMD’s cutting-edge 3D V-Cache technology – a luxury addition to this mid-range CPU. Save £27 on this AMD Ryzen 7 5000 series processor Amazon has slashed a solid £27 off this AMD Ryzen 7 5800X3D, now just £262 (£529.66 RRP). Amazon has slashed a solid £27 off this AMD Ryzen 7 5800X3D, now just £262 (£529.66 RRP). This deal is an eye-catcher as this new January price is down to below the discount that was available during the big Black Friday sales. That sales event saw it drop down to £270 for a limited time before rising once again. Now, you can get this chip with another neat discount on top too. If you’re considering building a PC around a chip like this then you’ll be invested in the specifications on offer. What you find with the AMD Ryzen 7 5800X3D processor is 8 cores, 16 threads, a 4.5GHz boost clock and 105W TDP. It’s compatible with both AMD’s 500 and 400 chipset AM4 motherboards. And, you can’t forget that 3D V-Cache technology, which involves the stacking of memory to enable faster speeds. It has been surpassed by newer chips from AMD now, but the Ryzen 7 5800X3D burst on the scene as an extremely fast gaming processor, enabled by the new (at the time) 3D V-Cache technology. Nevertheless, it remains very capable and is a handy way to save some cash by going something a tad older. So, a reminder of what you can pick up here. It’s the gaming-friendly AMD Ryzen 7 5800X3D for a £262 price, which is remarkably lower than what you could get it for on Black Friday. Adam is the Computing Editor of Trusted Reviews. He joined as a staff writer in 2019 after graduating from Newcastle University with an MA in Multimedia Journalism. \nAfter spending two years at WIRED,… Founded in 2003, Trusted Reviews exists to give our readers thorough, unbiased and independent advice on what to buy. Today, we have millions of users a month from around the world, and assess more than 1,000 products a year. Editorial independence means being able to give an unbiased verdict about a product or company, with the avoidance of conflicts of interest. To ensure this is possible, every member of the editorial staff follows a clear code of conduct. We also expect our journalists to follow clear ethical standards in their work. Our staff members must strive for honesty and accuracy in everything they do. We follow the IPSO Editors’ code of practice to underpin these standards. Founded in 2003, Trusted Reviews exists to give our readers thorough, unbiased\n                        and independent advice on what to buy. Today, we have millions of users a month from around the world, and assess more than 1,000 products a year. Editorial independence means being able to give an unbiased verdict about a product or company, with the avoidance of conflicts of interest. To ensure this is possible, every member of the editorial staff follows a clear code of conduct. We also expect our journalists to follow clear ethical standards in their work. Our staff members must strive for honesty and accuracy in everything they do. We follow the IPSO Editors’ code of practice to underpin these standards. Get the best of Trusted Reviews delivered right to your inbox. Products tested and reviewed since 2003 "
}