{
    "title": "3 Catalysts That Could Take AMD Stock to New Highs in 2024",
    "date": "1/2/2024",
    "url": "https://investorplace.com/2024/01/3-catalysts-that-could-take-amd-stock-to-new-highs-in-2024/",
    "text": " Can AMD stock continue to climb higher this year? Advertisement Source: Casimiro PT / Shutterstock.com Advanced Micro Devices’ (NASDAQ:AMD) journey in the microprocessor space was volatile in 2023. Fortunately for investors, AMD stock mostly moved up and to the right, finishing the year with an impressive gain of more than 125%. The company’s Ryzen 8040 Series laptop processors promise a 60% performance boost for AI applications, leading AMD back into the spotlight. AMD’s Instinct MI300 Series accelerators also position the company well to compete in the AI chip field long term. Additionally, AMD’s MI300 chips position the company as a formidable competitor to Nvidia (NASDAQ:NVDA) in the data center and AI segments. CEO Lisa Su anticipates a $2 billion contribution from these markets in 2024, though some analysts view this projection as conservative. Amid strong competition in 2024, AMD’s innovative AI chip presence is certainly worth considering for investors looking at relative value in this sector. Here are a few catalysts investors may want to watch right now regarding AMD stock. In addition to the company’s product lineup, AMD is set to release its Radeon RX 7600 XT. This chip is intended to bridge the performance and pricing gap between the RX 7600 and RX 7700XT. Launching sometime during the week of January 22nd as a rival Nvidia’s RTX 4060 and RTX 4060 Ti chips should gain traction given this chip’s improved VRAM. AMD will exclusively rely on custom models from partners like Sapphire, XFX, ASUS and Gigabyte for the Radeon RX 7600 XT, bypassing an MBA (Made By AMD) GPU release. While exact specifications remain undisclosed, speculation suggests the GPU might boast 10GB or 12GB of GDDR6 memory, potentially outpacing Nvidia’s RTX 40 series GPUs in VRAM. Assuming no plans for a Radeon RX 7700 non-XT, speculation is that the RX 7600 XT, likely featuring around 40 Compute Units, will serve as an RDNA 3 replacement for the RX 6700 XT. Utilizing Navi 32 silicon with 10GB or 12GB of VRAM, AMD maximizes its Navi 33 silicon, leaving no untapped resources for the Radeon RX 7600. The expectation is that any higher-end GPU below the RX 7700 XT will utilize Navi 32 silicon with disabled CUs, eliminating the need for new RDNA 3 GPU silicon. At an AMD investor event, Meta (NASDAQ:META), OpenAI and Microsoft (NASDAQ:MSFT) announced adoption of AMD’s latest AI chip, the Instinct MI300X. This signals a shift toward alternatives to Nvidia graphics processors in AI, potentially impacting Nvidia’s market dominance. AMD CEO Lisa Su highlighted the industry’s focus on powerful GPUs for the cloud, discussing the MI300X’s new architecture and key feature—192GB of high-performance HBM3 memory. The comparison with Nvidia’s H100 emphasizes improved user experiences. Still, the challenge for AMD lies in convincing companies accustomed to Nvidia to invest time and resources in adopting an additional GPU supplier. Su acknowledged the effort required for this transition. AMD upgraded ROCm to rival Nvidia’s CUDA, addressing a key preference among AI developers. Pricing for the MI300X wasn’t disclosed, but Lisa Su emphasized the necessity for cost-effectiveness compared to Nvidia’s chips, which can reach around $40,000. AMD has swiftly secured major clients for its MI300X chip. Strategic pricing, estimated by Ark Invest at $18,000 to $19,000 to maximize market share, could entice customers away from Nvidia’s pricier alternatives. AMD’s MI300X boasts substantial performance gains over NVDA’s H100, promising cost efficiency for adopters. Despite Nvidia’s H200 chip being faster, AMD’s integrated software makes this company a formidable competitor in the AI chip race. Additionally, given the company’s relative value compared to Nvidia, I could certainly see much better performance with AMD stock in 2024, all things being equal. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective.   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/3-catalysts-that-could-take-amd-stock-to-new-highs-in-2024/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}