{
    "title": "AMD Removes \"Diffused In Taiwan\" Label From Ryzen CPUs",
    "date": "1/22/2024",
    "url": "https://www.lowyat.net/2024/315055/amd-removes-diffused-in-taiwan-label-from-ryzen-cpus/",
    "text": "(Image source: Zed_Wang via Twitter.) It looks like all future AMD Ryzen processors will be shipping out with a slight change in the typography of its Integrated Heat Spreader (IHS): the words “Diffused in Taiwan” will not be visible on it and completely omitted. The changes to the labelling of its Ryzen CPUs have raised concerns that AMD is doing this as a way of pandering to the demands of Mainland China, where the country has insisted that products created in Taiwan be labeled as “Made in China.” To that end, other theories suggest that these newly labelled CPUs will only see shipment into China, while the rest of the world would still receive units that state its point of diffusion. Meanwhile, the Made in Malaysia labelling is still present. For those who don’t know the difference between diffusion and its manufacturing point, Tom’s Hardware provides an easy summary of the processes: “Diffused’ denotes the silicon die chipmaking process. (etching, masking, diffusion, etc.) AMD uses this term to note where the die was fabricated. The ‘Made in’ marking denotes the location where the die is placed into the chip package and then tested (OSAT) — i.e., mounted on a substrate (PCB) and then covered with the lid (IHS – Integrated Heat Spreader)” AMD has denied any accusations that the move to remove its “Diffused in Taiwan” labelling from its Ryzen CPUs is in any way political. “AMD removed the country of diffusion from all new CPU and APU products in 2023 to align with the product marking process for our other products,” a spokesperson from the company said in a statement to Tom’s Hardware. That statement isn’t untrue either: if you take a close look at CPUs shipped to Malaysia, you’ll notice that the recent shipments of Ryzen 7000 Series CPUs are devoid of any such labelling. (Source: Tom’s Hardware, Twitter) Follow us on Instagram, Facebook, Twitter or Telegram for more updates and breaking news. ©2024 VIJANDREN RAMADASS. ALL RIGHTS RESERVED. ©2024 LOWYAT, LLC. ALL RIGHTS RESERVED. "
}