{
    "title": null,
    "date": "1/25/2024",
    "url": "https://www.hardwaretimes.com/amd-ryzen-9000x3d-zen-5-3d-v-cache-cpus-allegedly-launching-in-jan-2025/",
    "text": "AMD is set to launch its next-gen Ryzen 9000 processors later this year. Based on the Zen 5 core architecture and TSMC’s 4nm/3nm process node, they’re expected to offer a substantial performance uplift over existing Ryzen 7000 CPUs. As explained in an earlier post, the Zen 5 core will focus on the front end, with improvements to the cache and integer pipeline. AMD has yet to announce the Ryzen 9000 chips, but tipsters have already started talking about their 3D V-Cache variants. According to Kepler, the Ryzen 9000X3D processors (Zen 5 3D V-Cache) will be revealed during CES 2025, slated to be held in the first week of January 2025. If the Ryzen 9000 “Zen 5” CPUs launch between summer and fall (June to September), then a 6-month gap separating them from the 3D V-Cache variants makes sense. Furthermore, Intel is expected to launch its 15th Gen Arrow Lake family in late 2024. This will be the chipmaker’s first design overhaul in years, and AMD would likely want a 3D-stacked answer to it. Till then, the Ryzen 9000 CPUs should do well against Raptor Lake and its refresh. The Zen 5 decoder is still somewhat of a mystery. Existing Ryzen cores use a dated 4-way decoder, something Zen 5 will likely target. Rumors have pointed to a branched frontend similar to Intel’s Atom cores and design choices reminiscent of the disastrous Bulldozer, but they are too vague and cryptic. All we know with some certainty is that it’ll be paired with a wider 8-way dispatch and the same 32KB L1 Instruction Cache. Down below in the backend, AMD is beefing up its already formidable integer execution, adding two more ALUs along with a wider unified scheduler. The load-store unit is also getting a touchup, but the other intriguing part about Zen 5 will be the interconnect. According to AdoredTV, the Ryzen 9000 CPUs will use an upgraded core interconnect known as the Ladder L3 Fabric. This is related to the 3rd Gen Infinity Fabric, which will form the binding fabric of the next-gen Zen designs. The Ryzen 9000 processors are (allegedly) already in mass production. They should hit the retail market sometime in late summer (July-August). People with a 600-series board are already set for a Zen 5 upgrade, as these chipsets will be retained for at least two more generations. "
}