{
    "title": "AMD Fluid Motion Frames Support for 700M Series Integrated GPUs Rolls Out, \nBrings Frame Generation to Asus ROG ...",
    "date": "1/10/2024",
    "url": "https://in.ign.com/asus-rog-ally/200347/news/amd-fluid-motion-frames-support-for-700m-series-integrated-gpus-rolls-out-brings-frame-generation-to",
    "text": "AMD has released a new Windows preview driver for its AMD Fluid Motion Frames, bringing in support for Radeon 700M series integrated GPUs. The company has been rolling out support for some time now for other Radeon RX 7000 and RX 6000 series integrated graphics, but the latest update has more significance, especially for those who have handheld devices such as Asus ROG Ally and Lenovo Legion Go. AMD Fluid Motion Frames (AFMF) is a software tech and AMD’s answer to Nvidia’s Frame Generation feature. AFMF adds frame generation to Direct 11 and 12 games, to improve the frame rates for a smoother gaming experience with fewer stutters. One of the most crucial aspects that separate AFMF from Nvidia’s Frame Generation tech is that the AMD variant works with any DX 11 and 12 game, whereas Nvidia’s technology does require game developers to add support for the technology. Almost all handheld consoles in the market make use of Radeon 700M series iGPUs, which are RDNA 3-based chips. All except Valve’s Steam Deck, which uses a custom RDNA 2 chip, and also runs on Linux. So, the Windows preview driver's addition (as reported first by Videocardz.com) is mainly for ROG Ally, and also other desktops which make use of the 700M series. So, the handheld consoles are bound to benefit the most from this new addition. AFMF will be leaving the beta stage on January 24 and will become a part of AMD Software: Adrenalin Edition and the HYPR-RX profile, which essentially is a one-click solution to add more performance to a game through the use of Radeon Anti-Lag, Radeon Boost, and setting the resolution one step lower than native or by turning on the FSR Quality preset if the game supports it. Since AFMF supports 700M series GPUs, AMD’s announcement of Ryzen 8000G APUs at CES 2024, is also important as the Zen-4-based APUs will feature the same 700M series integrated GPUs which have received support for AFMF. So, PC gamers with the upcoming 8000G, Radeon RX 7000 and RX 6000 series, and 700M series can also go to AMD Software: Adrenalin Edition to enable AMD’s frame generation tool for their DX 11 and 12 games. "
}