{
    "title": "AMD is showing every sign of supporting AM4 for the foreseeable future",
    "date": "1/20/2024",
    "url": "https://www.techspot.com/news/101586-amd-showing-every-sign-supporting-am4-foreseeable-future.html",
    "text": "Forward-looking: AMD will keep supporting the AM4 platform until the cost of producing older DDR4 memory becomes more expensive than that of DDR5, said Donny Woligroski, AMD's technical marketing manager. As for migrating to AM5, that's for people \"who want to tee up for the future.\" AMD's AM4 user base can rest easy regarding any doubts about the support the company will give to the platform. Not only did it announce four more AM4 processors at CES this year – the Ryzen 7 5700X3D, Ryzen 7 5700, Ryzen 5 5600GT, and Ryzen 5 5500GT – but AMD's Donny Woligroski flat out told PC World that the company would continue to support the platform for the time being, or at least until the cost of producing the older DDR4 memory becomes greater than that of DDR5. But doesn't the company want people to upgrade to AM5? Most certainly, but Woligroski made it clear that AM5 is for those with an eye on the future. It's been over a year since the launch of Ryzen 7000 processors and the first AM5 motherboards – ample time for users to decide whether to upgrade or stick with AM4. While AM5 boasts the latest memory and PCIe standards, there are compelling reasons to stick with AM4. That now includes the ongoing support provided by the company. These reasons range from the difficulty of moving to a whole new socket architecture and the additional hardware you would have to buy to support AMD's current platform, to the lower expenses associated with AM4 and, at least in the early days of AM5's release, certain reliability issues. To be fair, many of these issues have been resolved as AM5 got its sea legs. For instance, when AM5 first launched, the relationship with its AGESA microcode and the DDR5 memory standard could be best described as rocky: there were SOC voltage issues and instability above specific frequencies, problems that prevented users from pushing the limits of DDR5's capabilities.  Then in July 2023, several AM5 motherboard manufacturers began rolling out AMD's new AGESA update. According to reports from AM5 users and overclockers that received the update, the new firmware substantially increased AM5's overall DDR5 compatibility and support. AMD plans to support AM5 for the next couple of years at least, according to an interview corporate VP and GM of the client channel business, David Mcafee, had with Overclockers UK. In fact, he said AMD believes the longevity of the AM4 platform was one of the biggest factors behind Ryzen's success and that AMD will think carefully about moving to a next-gen socket. They want to stay on AM5 for as long as possible, he said. \"We are firmly committed to 2025 and beyond and we will see how long that promise lasts beyond 2025,\" the executive added. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}