{
    "title": null,
    "date": "1/1/2024",
    "url": "https://investorplace.com/2024/01/do-amds-huge-opportunities-outweigh-its-significant-threats/",
    "text": " AMD may not be able to gain share from Intel next year, causing AMD stock to underperform Advertisement Source: Pamela Marciano / Shutterstock.com Driven by large opportunities in artificial intelligence in particular and a general recovery of the chip market, AMD (NASDAQ:AMD) stock could very well outperform the S&P 500 and the Nasdaq in 2024. But on the other hand, the firm’s valuation appears to bake in continued, large market share gains by AMD at Intel’s (NASDAQ:INTC) expense, and that scenario may very well not materialize. Given these points, I rate AMD stock as a “hold” at this point, and I view INTC as a much better alternative. This article will walk the reader through my thesis and comparison of AMD stock and its peers. On Dec. 22, Swiss bank UBS issued a bullish note on the chip market in general and AMD stock in particular. According to the bank, chip makers are heading into a “sweet spot… (as) inventory has peaked and started converting to revenue,” Moreover, the firm thinks that AMD is well-positioned to benefit from data centers’ expansion while the entire sector will get a lift from the incorporation of AI chips into smartphones and PCs. UBS named AMD and Micron (NASDAQ:MU) as its two top picks in the chip space. Meanwhile, on Dec. 6, AMD launched its “next-gen AMD Instinct MI300 data center GPU accelerator family,” another InvestorPlace columnist, Chris MacDonald, noted. CEO Lisa Su has asserted that these chips are “comparable to Nvidia’s H100 chips in training (large language models)” but are superior to NVDA’s H100 chips on inference by 40% “when working with Meta’s Llama 2, a 70 billion parameter LLM,” The Verge reported. Assuming that Su’s assertions are at least close to accurate, the Instinct MI300 chips can accelerate AMD’s top and bottom line growth by large amounts, given the huge demand for high-quality AI chips and Nvidia’s inability to meet that demand. Trading at a forward price/earnings ratio of 40 and an Enterprise Value/EBITDA ratio of 58, AMD stock is pricey. Tech enthusiast Jackson Luca asserts that “most bullish forecasts for AMD assume continued share grabs against Intel across PCs and the cloud data center. ” Given Luca’s statement and the high valuation for AMD stock, I believe the shares will probably bake in continued major share gains by AMD at Intel’s expense. But with Intel appearing to have greatly improved the quality of its offerings, those gains may not come to pass. Specifically, the firm has started incorporating ‘neural processing units’ into its computer processing unit chips, enabling its CPUs to handle “AI workloads without needing an external GPU,” Luca noted. And, although the benchmark score of Intel’s upcoming Gaudi 3 AI chips is meaningfully lower than that of AMD’s MI300, Gaudi 3 does beat AMD’s offering regarding transistor count. Also importantly, the Gaudi 3 offers double the memory capacity of the MI300, even though the chips are the same size. Moreover, as I reported in a previous column, Intel cannot make the Gaudi 2 (Gaudi 3’s predecessor) quickly enough to meet demand. Of course, that indicates that firms are enthusiastic about Gaudi 2 and will like Gaudi 3 even more. Also noteworthy is that Luca’s “base case” scenario involves AMD losing “marginal..(market) share” to Intel, causing AMD stock to stay “rangebound” for some time going forward. I believe that’s a very realistic prediction. I view Intel as a better choice than AMD for investors. With a forward price-earnings ratio of 28, Intel has a huge opportunity in AI and, over the longer term,  looks poised to generate a great deal of revenue by manufacturing chips for other companies. On the date of publication, Larry Ramer held a long position in INTC. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Larry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer. Technology Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/do-amds-huge-opportunities-outweigh-its-significant-threats/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}