{
    "title": "AMD’ Ryzen 8000G “Hawk Point” APUs To Feature Support For USB4 On Some AM5 \nMotherboards",
    "date": "1/5/2024",
    "url": "https://wccftech.com/amd-ryzen-8000g-hawk-point-apus-feature-usb4-support-on-am5-motherboards/",
    "text": "AMD Ryzen 8000G \"Hawk Point\" APUs will deliver additional I/O capabilities on a few AM5 boards such as the AORUS B650E series such as USB4. Benchlife reports that manufacturers are planning to integrate USB4 into AM5 motherboards which will target AMD's Ryzen 8000G Desktop APUs. The outlet reports that companies such as Gigabyte might release motherboards that finally come with support for USB4 transmission since AMD has lacked in this department, as Intel had already integrated the transfer standard with its 11th Generation lineup, whilst AMD was nowhere to be found. USB4 capabilities were usable through add-in cards such as those from MSI, but the platform has yet to see native support on the AM5 side. News regarding USB4 enablement on AMD AM5 motherboards started surfacing a few months ago when AMD's CEO Lisa Su paid a visit to several Taiwanese manufacturers intending to reach USB4 support on desktop processors. It was said that the Taiwanese firm Asmedia would be responsible for bringing Thunderbolt 4 support on the AMD platform, but since then, we haven't heard any development up till now. It is speculated that Gigabyte's AORUS B650E ELITE X AX ICE motherboard will potentially feature USB4 support with AMD's upcoming Ryzen 8000G \"Hawk Point\" APUs. Gigabyte has already pushed out AMD's AGESA 1.1.0.1a BIOS firmware update for AM5 motherboard supporting the Hawk Point APUs, however instead of just bringing on new architecture support, the company does plan on making advancements within the \"connectivity\" department as well. For a brief recap on Thunderbolt 4 (USB4) capabilities, the new platform supports up to 40Gbps of transfer speeds. The key difference from previous generations is the inclusion of port expansion since several devices can be linked at a time with a single Thunderbolt 4 dock. It is expected that we might see USB4 debut on AMD's AM5 platform with their upcoming Ryzen 8000G \"Hawk Point\" APU lineup release, but this is just a rumor for now. News Source: Benchlife Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}