{
    "title": "AMD Radeon 700M “RDNA 3” iGPUs Recieve Fluid Motion Frames Support, Brings \nFPS-Boost To Laptop & Handheld Gamers",
    "date": "1/9/2024",
    "url": "https://wccftech.com/amd-radeon-700m-rdna-3-igpus-fluid-motion-frames-support-fps-boost-laptop-handheld-gamers/",
    "text": "AMD has expanded its Fluid Motion Frames (AFMF) technology to Radeon 700M iGPUs which play a major role in laptops, handhelds & very soon, in desktops too. AMD has recently been focusing on its software resources at a steady pace, especially with the advent of AFMF (AMD Fluid Motion Frames). The firm has released optimization updates in the past as well, and they are still looking to find ways to make the feature competitive in the industry, mainly because it is the only competition to NVIDIA's Frame Generation technology, and can be implemented within any DX11 or DX12 game. AMD's AFMF was exclusive to the Radeon RX 7000 \"RDNA 3\" series in the start, however gradually the company did push out support for the RX 6000 lineup, and now it has been extended to the Radeon 700M iGPU series. The extended support of AFMF is currently available in AMD's beta driver and hasn't seen inclusion in the mainstream (WHQL) ones, which means that for now, Team Red is testing the feature out on the mobile platform. With this update, it means that AMD's APU that features the Radeon 700M iGPU platform, such as the Ryzen 7040 series and above, can leverage from AFMF, which means that the mobile platform can now leverage frame interpolation on the driver side, providing an enhanced gaming experience. Furthermore, AMD will soon be releasing its Ryzen 8000G APUs which feature the same Radeon 700M iGPUs, bringing FPS boosts to budget desktop gamers and also to the handheld APU platform. It will be interesting to see what sort of effect we witness in terms of performance when frame generation is implemented on the laptop platform, especially when comes to comparing alternatives out there. You can find the latest technical preview here. News Source: AMD Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}