{
    "title": "Nvidia, Intel, AMD, Qualcomm, and more: CES highlights",
    "date": "1/12/2024",
    "url": "https://finance.yahoo.com/video/nvidia-intel-amd-qualcomm-more-214724968.html",
    "text": "The world's top technology companies and best tech innovators met in Las Vegas for the 2024 Consumer Electronics Show (CES) this week. Yahoo Finance spoke with experts across the industry to showcase their latest products and unveil a new generation of technology. Naqi Logix earbuds (00:00:04) Yahoo Finance's Akiko Fujita caught up with Naqi Logix Founder David Segal and Director of Product Management Zavier Alexander, who demonstrated the functionality of Naqi Logix's earbuds. \"This is totally hands-free,\" Alexander said. \"He's just looking at the text that he wants to type, and then it is being typed on screen.\" Segal added, \"I'm confident if we can fly a 737 with nothing but an earbud, you can control anything and everything.\" AI PCs (00:00:49) Michelle Johnston Holthaus, Intel (INTC) EVP and GM Client Computing Group, discussed the integration of artificial intelligence into devices like PCs. She said, \"It's a game changer because you can take these large language models that have been in cloud, this kind of ambiguous set of experiences that no one tangibly could actually ever touch or hold, and now you've brought it into the CPU.\" Qualcomm (00:01:20) Qualcomm CEO Cristiano Amon (QCOM) discussed company plans to advance on-device AI capabilities in 2024, including automotive applications. Amon said, \"We're working with virtually every company as the car is really becoming a computer on wheels. Digital is becoming the most important part of the automotive transformation.\" AI-powered cocktail-making robot (00:01:37) Stephanie Callaway, Doosan Robotics Senior Marketing Manager, demonstrated the AI-powered Mixmaster Moodie, a cocktail-making robot. Utilizing OpenAI's ChatGPT and facial recognition features, the Mixmaster Moodie serves drinks based on the user's mood and voice inflections. Callaway said, \"It takes about 10 seconds ... looking at your face.\" Intel (00:02:01) Intel Automotive Vice President and GM Jack Weast discussed Intel's AI chip integration to vehicle systems to create more unique and enhanced user experiences. Weast explained, \"This new line up of products brings the best of the AI PC, and all the reliability of the data centric into the vehicle so automakers can evolve their architecture away from fixed function to software defined and dynamic architectures going forward.\" AMD (00:02:25) American semiconductor manufacturer has revealed a slew of new products, including desktop chips aimed at unlocking AI capabilities and improving productivity. The battle for AI PCs has begun as Intel (INTC), Qualcomm (QCOM), and other chip players roll out hardware aimed at AI supremacy. Jason Banta, Advanced Micro Devices (AMD) Corporate Vice President and General Manager of Client OEM, broke down the features that consumers can expect in the first leg of the AI PC race. \"AI PC is something that we're seeing emerge in the PC market overall. Really what that does is that brings AI capability that typically you see in the cloud or in server devices, you bring that locally into the PC, to perform closer to the user,\" Banta said. \"And that means a lot of things that you see from a generative AI capability ... those things can actually happen local on the device.\" Kohler's smart toilets (00:03:00) Andrew Van Gorden, Kohler Product Manager, Smart Toilets, showcased the company's new smart toilet technology. Van Gorden said, \"This is the future of the toilet. This is our Numi 2.0 Smart Toilet. It automatically opens as you walk up to it. A completely touchless experience.\" Nvidia (00:03:32) Nvidia (NVDA) announced a partnership with Mercedes-Benz to hone self-driving capabilities. Nvidia Vice President of Automotive Danny Shapiro discussed the company's autonomous driving projects. Shapiro said, \"That's our AI platform for automated driving, driver assistance, all kinds of convenience features. So we're basically bringing the type of AI from the cloud that we're used to seeing, but bringing it right into the car.\" Watch all of Yahoo Finance's coverage of CES 2024. Editor's note: This video was produced by Zach Faulds. Related Quotes "
}