{
    "title": "3 reasons why 2024 is a crucial year for AMD",
    "date": "1/26/2024",
    "url": "https://www.xda-developers.com/2024-is-crucial-for-amd/",
    "text": "AMD appears to have a lot in store for us this year, but it needs to get a lot of things right. Despite a few worrying wobbles, AMD managed to deliver a convincing portfolio of products for PC gamers in 2023. It didn't shoot for the stars with its RDNA 3 GPUs like Nvidia did with its RTX 4090, but it turned some heads with the reasonably priced RX 7900 XTX. Similarly, its Ryzen 7000 series chips delivered in spades for both laptop and desktop gamers, and I truly believe it had an edge over Intel with the likes of Ryzen 7 7800X3D and the 7950X3D leading the pack for both gamers and those who predominantly use their PC for work. The road ahead for 2024 appears to be all set for AMD as it prepares for an interesting battle against the green and blue teams. There is a lot that AMD can do to pull ahead of the competition, and it all starts with improving and building upon its existing products in 2024. Nvidia's new RTX Super GPUs are here, delivering a decent performance uplift over their non-Super counterparts on the market. And the fact that the new and improved Super GPUs can be had for the same price or lower means the ball is now in AMD's court to strike back with even better-value RX 8000 GPUs later this year. AMD has already slashed the price of its RX 7900 GPUs in response to Nvidia's new RTX 40 Super GPU launch, which means that it's less likely to launch new cards to fight the Super models. That's a good thing because it needs to look beyond the new Super GPUs anyway and play its cards right to go against the high-end offerings in Nvidia's upcoming Blackwell GPU lineup. Simply beating the RTX 4080 Super or the RTX 4090 GPUs — which the current-gen Radeon 7000 series GPUs don't — won't be enough, and AMD is going to need more than that to attract potential buyers. Considering AMD doesn't really have solid GPUs to go against Nvidia's high-end cards in the 40-series right now, it'll be interesting to see what the Radeon 8000 series GPUs bring to the table for the high-end market. Not only do they have to beat Nvidia's current-gen RTX 40 Super GPUs, but they also need to have enough performance headroom to keep Nvidia on its toes until AMD can strike back with an answer to Nvidia's Blackwell GPUs properly later in 2025 as a part of its usual release cycle. Either that or AMD can try to win the market with pricing and compete in the budget space with its 8000-series GPUs instead of scrambling to match the performance of Nvidia's top-of-the-line cards. We're less likely to see an RTX 5090 rival from Team Red in 2024, so it's better to set the flagship battle aside, in my opinion, and continue focusing on delivering more reasonably priced GPUs. AMD has already made a promising start to 2024 by launching the RX 7600 XT GPU in the hotly contested $300 market, and I hope it continues to leave a mark on the budget space. That's what makes this one of the crucial launches for AMD this year, as it'll tell us whether it will continue competing with Nvidia's high-end GPUs, or it plans to pull ahead of the competition in the budget space. Let's be real — Nvidia is still dominating the upscaling battle, with its DLSS technology reaching new heights and unlocking better gameplay experiences with improved frame generation, ray reconstruction, and more. Simply put, DLSS 3.5 beats FSR 3 right now, and that's still problematic for AMD, especially if it wants to dominate the mainstream GPU market. I say that because upscaling becomes less of a big deal as you move higher up in the ranks and look at GPUs like the RTX 4080 and above, which can handle games at ultra settings anyway. The mainstream GPUs need the uplifting, meaning AMD really needs to improve FSR 3.0 if it wants to move the needle and become a threat to Nvidia in the $300 to $600 segment. Let's not forget AMD's Fluid Motion Frames (AFMF) technology, which is leaving beta later this month with the launch of RX 7600 XT. I am cautiously optimistic about AFMF, but AMD has a lot of ground to cover this year to improve both FSR and AFMF and add more value to its GPU offerings. While I don't have too many qualms with FSR's image quality or latency, I definitely think it needs better support. We saw some popular titles picking up FSR last year, but I hope it's even better in 2024. It's no secret that AMD's Ryzen 8000 series desktop CPUs, codenamed \"Granite Ridge,\" are arriving this year. It's all but confirmed at this point, and AMD is said to launch it in the last quarter of 2024. This is also crucial for AMD as it ushers the new Zen 5 core architecture. Rumor has it that AMD may be switching to TSMC's 3nm process node, targeting a balanced performance and efficiency instead of putting all eggs in the performance basket the way Intel does in some of its CPUs. What's interesting about the Ryzen 8000 CPUs is that AMD appears to be sticking with the same 16-core design as Zen 4. It's an interesting choice, considering how Intel is chasing high-core count figures these days. Early predictions, however, say that we might see up to 25% IPC gains compared to Ryzen 7000 CPUs. It'll be interesting to see how much of an improvement these chips bring to the table. The current-gen Ryzen 7000 series desktop chips lead the pack in my books, and I hope AMD has some serious upgrades in store for us with Zen 5. I'll have a more measured take on the RX 7600 XT once it officially launches, but it looks very promising on paper. That's a good start to 2024 by AMD as it tries to keep Nvidia on its toes with a competent GPU. AMD essentially took a page out of Nvidia's book by bumping the RX 7600's memory capacity for the RX 7600 XT. How it stacks up against other GPUs on the market remains to be seen, but I hope we see more activity from AMD in the mainstream market. Noteworthy performance upgrades to the desktop CPUs with Zen 5 and more meaningful improvements to its software and hardware solutions in the GPU space are all I want to see from AMD in 2024. It's indeed a crucial year for the Red Team, but it can play the right cards to dish out some attractive products in 2024 and set it up in a good position to compete with the best in 2025.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. A senior evergreen writer at XDA Developers serving up reviews, buying guides, deals, and more on laptops, PC hardware, and smartphones that you care about. He's been covering the computing and smartphone industry for over seven years now and has worked with various brands to establish an authority in the technology space. Before joining XDA Developers, Karthik was a senior reviewer at Digit, a popular tech magazine in India. You will likely find him yelling at his monitors while playing an online shooter in his free time. AMD made significant improvements to its APU lineup with the Ryzen 5 8600G. But is it good enough to beat the Ryzen 5 7600? If you're looking to add one of AMD's Ryzen 7000 to your system without spending a ton, check out our collection of the best budget AM5 motherboards. The Nvidia GeForce RTX 4070 Super brings even more value to the best of the 40-series. From crazy concepts to impressive technology, this year's MWC had it all. I recently reviewed the Ayaneo AM02 mini PC, and I turned it into a home gaming console. Dell puts all the pieces together with the UltraSharp 34 Thunderbolt, making a \"super monitor\" for productivity. "
}