{
    "title": "AMD Radeon RX 79000M mobile GPUs were MIA in gaming notebooks at CES 2024",
    "date": "1/14/2024",
    "url": "https://www.tweaktown.com/news/95569/amd-radeon-rx-79000m-mobile-gpus-were-mia-in-gaming-notebooks-at-ces-2024/index.html",
    "text": "AMD had plenty to talk about at CES 2024, but one thing we didn't hear a peep on was their RDNA 3-based Radeon RX 7000M mobile GPU designs... and it's a big disappointment. AMD Radeon RX 7900M 16GB Laptop GPU specs (source: AMD) ComputerBase was on the ground in Las Vegas at CES 2024, noting that there was not a single new laptop with a Radeon RX 7000M mobile GPU. The site explained: \"As CES 2024 concludes, the answer is clearly \"no.\" Not only has there been no new notebooks with Radeon RX 7000 Mobile to the editors' knowledge, but the m16 R2 and m18 R2 have also switched to a pure GeForce RTX 4000 offering - at least currently the RDNA 3 configurations are not available more\". ComputerBase continued: \"The same applies to the new ASUS TUF Gaming A16 (2024) , which in combination with an AMD Dragon Range (7x45HX) processor was an AMD Advantage flagship product just a year ago. At least the Ryzen 9 7945HX remained as the CPU. From 2022 with AMD Ryzen 6900HS and Radeon RX 6800S from AMD CEO Dr. There is also no trace of the Corsair Voyager a1600 (test) presented personally by Lisa Su or its successor\". AMD Radeon RX 7900M 16GB GPU full specs: Anthony Garreffa Anthony joined the TweakTown team in 2010 and has since reviewed 100s of graphics cards. Anthony is a long time PC enthusiast with a passion of hate for games built around consoles. FPS gaming since the pre-Quake days, where you were insulted if you used a mouse to aim, he has been addicted to gaming and hardware ever since. Working in IT retail for 10 years gave him great experience with custom-built PCs. His addiction to GPU tech is unwavering and has recently taken a keen interest in artificial intelligence (AI) hardware. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}