{
    "title": "Here's why Futu, AMD, and LiveRamp stocks are rising",
    "date": "1/18/2024",
    "url": "https://invezz.com/news/2024/01/18/heres-why-futu-amd-and-liveramp-stocks-are-rising/",
    "text": "Follow Invezz on Telegram, Twitter, and Google News for instant updates > American equities were in the red in the pre-market session as investors focused on the ongoing earnings season and the next actions by the Federal Reserve. Dow Jones dropped by 65 points, continuing a trend that has been happening this week. Similarly, the S&P 500 and Nasdaq 100 futures fell by 0.50%. Still, not all stocks were in the red as Futu Holdings, AMD, and LiveRamp (RAMP) were among the top movers.   Futu Holdings (FUTU) is a Chinese company that provides trading solutions for Chinese customers. The stock has come under intense pressure lately as it dropped by more than 30% from its highest point in 2023. This retreat has given it a market cap of over $6 billion. Futu stock price jumped in the pre-market as investors cheered a rating upgrade by analysts at JP Morgan. In a note, analysts at the bank said that the recent sell-off, which happened after the company missed its earnings was now overdone. The note added that: “JPMC thinks the concerns are overdone, as only half of NII is rate sensitive, and downside on NII will be compensated by higher trading volume, in its view.” Further, JPMorgan’s analysts believe that the company will benefit from its upcoming pivot to crypto and overseas investments. Morgan Stanley also published a positive report on Futu in December, hiking it to equal-weight.  Invest and trade CFD stocks, ETFs, digital assets & commodities in minutes with our highest-rated broker. AMD (NASDAQ: AMD) stock price continued its remarkable rally on Thursday as investors cheered results by Taiwan Semiconductor (TSMC). In a report, the company said that its revenue jumped in the last quarter and estimated that it will grow by 20% this year. This is a sign that the semiconductor industry was doing well as IT spending jumps. Are you looking for fast-news, hot-tips and market analysis? \n\n  \n    Sign-up for the Invezz newsletter, today. AMD share price is also rising as many investors focus onthe artificial intelligence (AI) boom at the ongoing World Economic Forum. The company will be a major beneficiary of this trend because of its advanced chips. Other semiconductor companies like Nvidia, Microchip Technology, and NXP Semiconductor also jumped after receiving an upgrade from Wolfe Research. LiveRamp (NYSE: RAMP) stock price jumped by more than 10% in the pre-market session as investors focused on its acquisition of Habu in a $200 million deal. The company also said that it made $174 million in the third quarter. LiveRamp is a SAAS company that provides data collaboration software to companies like Google, Marketo, Walmart, and Danone. Its stock has been in a strong uptrend in the past 12 months as it jumped by over 53%. This growth happened after the company’s revenue accelerated. LiveRamp’s recent results showed that it made $160 million, $8 million above its target. Its operating income came in at $32 million while ARR jumped to $428. Therefore, the company hopes that Habu, a data clean room software provider will help to supercharge its growth. Copy expert traders easily with Plus500. Invest in stocks like Tesla & Apple. Instantly trade ETFs like FTSE 100 & S&P 500. Sign-up in minutes. Buy or sell stock CFDs with Plus500. 82% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money.  Should you buy Bitcoin before the halving? Should you buy Bitcoin before the halving?  Use Invezz APP Get a better user experience Allow notifications? Allow us to send you updates You must agree to the privacy policy. "
}