{
    "title": "XFX reveals their white AMD Radeon RX 7800 XT QICK",
    "date": "2/17/2024",
    "url": "https://overclock3d.net/news/software/xfx-has-revealed-their-first-white-amd-rdna-3-gpu-the-rx-7800-xt-speedster-qick-319/",
    "text": " XFX is getting ready to reveal their first white RDNA 3 graphics card. This GPU is their RX 7800 XT Speedster QICK 319 White Edition, which has been listed by bermoresone.com. XFX are the latest GPU manufacturer to jump on the growing white GPU trend. Earlier this month, PowerColor revealed their White Edition RX 7900 XT Hellhound, and at CES 2024, Gigabyte revealed a range of new white hardware, which included a white GPU. Right now, XFX only appears to be making a White Edition version of their RX 7800 XT Speedster QICK 319. So far, not images of White Edition Radeon RX 7700 XT, RX 7900 XT, or RX 7900 XTX graphics cards have leaked. It also looks like XFX’s higher-end Speedster MERC RX 7800XT will not be getting the White Edition treatment.  We expect XFX’s new White Edition graphics card model to feature the same clock speeds and performance levels as its standard black counterpart. If this is the case, XFX’s new QICK 319 GPU will ship with AMD’s reference RX 7800 XT clock speeds. This will give the GPU a game clock speed of 2124 MHz and a boost frequency of 2430 MHz. XFX’s RX 7800 XT Speedster Qick 319 is a 2.5-slot GPU that features a three fan cooling solution. The GPU features 16GB of GDDR6 memory, and 3840 stream processors. The graphics card also supports both DisplayPort 2.1 and HDMI 2.1. You can join the discussion on XFX’s RX 7800 XT Speedster Qick White Edition graphics card on the OC3D Forums. A Northern Irish father, husband, and techie that works to turn tea and coffee into articles when he isn’t painting his extensive minis collection or using things to make other things. No crappy Google banners here, only PC related advertising you may actually find interesting. Please disable Ad Blockers in order for us to keep producing the same level of quality, informational reviews and news. Worst case they actually look pretty and fill the empty gaps <3 "
}