{
    "title": "Intel Sapphire Rapids Xeon W-3500 & W-2500 Workstation CPU Lineup Leaks \nOut, Less Impressive Than AMD’s Threadripper",
    "date": "2/4/2024",
    "url": "https://wccftech.com/intel-sapphire-rapids-xeon-w-3500-w-2500-workstation-cpu-lineup-leak-more-cores/",
    "text": "Intel will soon release its refreshed Sapphire Rapids Xeon W-3500 & W-2500 workstation CPUs for consumers with slightly updated core counts. Just like the Sapphire Rapids Xeon W-3400 and Xeon W-2400 CPU family, the Xeon W-3500 & Xeon W-2500 CPU families will be based on the same Golden Cove P-Core architecture with a slight CPU core count bump. It looks like Intel is giving away the best it has to offer to workstation & HEDT PC consumers before moving to the next-gen series. We already got to see the Xeon W-2500 family in a full spec leak a while back and the flagship Xeon W9-3595X just a few days ago so let's get into the details of the upcoming lineup. Starting at the top, we have the Intel Xeon W-3500 \"Sapphire Rapids-112L\" refresh CPU family, consisting of 7 SKUs including the flagship W9-3595X. The Xeon W9-3595X features a total of 60 cores and 120 threads followed by the Xeon W9-3575X with 44 cores, W7-3565X with 32 cores, W7-3555 with 28 cores, W7-3545 with 24 cores, W5-3535X with 20 cores and W5-3525 with 16 cores. The CPU lineup TDPs range from 290W and up to 350W and feature-based clock speeds range from 2.2 to 3.2 GHz. Each CPU gets a slight core count bump over its predecessor which is shown below: You can see that all of the Intel Xeon W-3500 SKUs except the W9-3575X feature a core count uplift of 4 cores while the Xeon W9-3575X features an increase of 8 cores. The increased core count also gives a small cache count increase. Moving over to the Intel Xeon W-2500 \"Sapphire Rapids-64L\" refresh CPU family, we have at least 7 SKUs listed in the leak. Starting at the top, we have the Xeon W7-2595X with 26 cores, W7-2575X with 22 cores, W5-2565X with 18 cores, Xeon W5-2555X with 14 cores, Xeon W5-2545 with 12 cores, Xeon W3-2535 with 10 cores, and the Xeon W3-2525 with 8 cores. These chips have TDPs ranging from 175W and up to 250W with clocks ranging from 2.8 GHz and up to 3.5 GHz. Just like the Xeon W-3500 lineup, the Xeon W-2500 family also gets a core count bump though not as significant as the 3500 parts as seen below: All SKUs get a nominal 2-core count uplift while the Xeon W7-2575X features a 4-core increase. All CPUs will be compatible with existing W790 HEDT and workstation motherboards with support of DDR5-4800 memory. The \"X\" SKUs will enable overclocking support and feature higher boost clock speeds. Since this is a refresh, we can expect Intel to price its Xeon W-3500 and Xeon W-2500 CPU family close to the existing W-3400 and W-2400 SKUs. For a comparison perspective, AMD's Threadripper families are still the more disruptive platform, offering up to 96 cores, 192 threads, faster DDR5 memory support, unlocked OC design across all SKUs, an insane amount of Gen5 PCIe lanes and other I/O and great support on the TRX90 and the WRX90 motherboard platforms. AMD Threadripper CPUs also offer much better multi-threaded & general efficiency in workstation/HEDT-oriented tasks versus existing Intel Sapphire Rapids Xeon offerings so it is unlikely that this refresh is going to change things much in the workstation field. News Sources: Momomo_US #1, #2 Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}