{
    "title": "A5G Networks Exceeds 1.5 Tbps of 5G Core User Plane Performance with 4th \nGen AMD EPYC™ Processors",
    "date": "2/22/2024",
    "url": "https://www.prweb.com/releases/a5g-networks-exceeds-1-5-tbps-of-5g-core-user-plane-performance-with-4th-gen-amd-epyc-processors-302068625.html",
    "text": "Searching for your content... Contact Us 11AM ET Sunday – 8PM ET Friday News provided by Feb 22, 2024, 10:05 ET Share this article A5G Networks, Inc., a market-leading autonomous 5GCore software company, announced today an industry-leading 5G core UPF throughput of 1.5 Tbps by leveraging 4th Gen AMD EPYC™ processors. As 5G networks enable high bandwidth applications such as AR/VR, cloud gaming, streaming, and immersive entertainment use cases, 5GCore user plane performance becomes essential to serve ever-growing data demands in the network. NASHUA, N.H., Feb. 22, 2024 /PRNewswire-PRWeb/ -- A5G Networks, Inc., a market-leading autonomous 5GCore software company, announced today an industry-leading 5G core UPF throughput of 1.5 Tbps by leveraging 4th Gen AMD EPYC™ processors. As 5G networks enable high bandwidth applications such as AR/VR, cloud gaming, streaming, and immersive entertainment use cases, 5GCore user plane performance becomes essential to serve ever-growing data demands in the network. A5G Networks' 5GCore is cloud-native and AI-native, 3GPP R17 compliant 4G, 5G, converged core. The UPF is responsible for processing massive amounts of data traffic from various mobile or fixed wireless device applications. The UPF represents a significant compute workload performing packet detection, enforcing QoS policies, and applying forwarding rules to meet real-time packet processing requirements for latency-sensitive applications. A5G Networks UPF enables enterprises and mobile network operators to address these challenges while providing deployment flexibility and optimizing CAPEX and OPEX. A5G Networks' offering is well positioned to meet the growing data and low latency demands in the network while enabling new services for enterprises and mobile network operators worldwide. A5G Networks UPF can elastically scale and cater to the industry-leading throughput of 1.5 Tbps+. A5G Networks UPF is cloud platform agnostic, making it a perfect choice for edge deployments. By employing machine-learning based dynamic network slicing and deep packet inspection, the A5G Networks UPF can support a wide range of use cases, like URLLC, e-MBB & mMTC. A5G Networks' offering is well positioned to meet the growing data and low latency demands in the network while enabling new services for enterprises and mobile network operators worldwide. 4th Gen AMD EPYC processors are built on the innovative \"Zen 4\" core architecture. AMD EPYC 9004 Series CPUs are an ideal computational base for running 5G containerized network functions (CNFs). High-speed data processing and transfer capabilities, facilitated by the platform's robust memory and I/O support, ensure CNFs operate efficiently and reliably. The platform's Compute Express Link™ (CXL™) interconnect feature further enhances CNF performance by enabling the disaggregation of computing tasks among PCIe devices, improving overall system performance. \"4th Gen AMD EPYC processors have been instrumental in enabling A5G Networks' UPF to achieve the significant milestone of 1.5 Tbps throughput to deliver on the increased demand for bandwidth on 5G networks. We look forward to continuing our collaboration with A5G Networks, empowering mobile network operators worldwide with optimized, flexible, and reliable solutions to meet the demands of growing data traffic volume,\" said Kumaran Siva, corporate vice president, Strategic Market Development, AMD. \"With digital transformation and advanced services, significant data growth is expected in the networks. The network infrastructure must be ready to handle that data volume at a low cost and with a reduced energy footprint. We are pleased to collaborate with AMD to provide a joint offering to address the growing network data demand. With A5G Networks UPF optimization on 4th Gen AMD EPYC processors, we have achieved more than 1.5 Tbps of throughput in a single server. This significantly reduces the CAPEX and OPEX required to run high-performance networks and significantly reduces energy requirements to run high-capacity data centers,\" said Kaitki Agarwal, co-founder and President of A5G Networks. About A5G Networks Inc. A5G Networks Inc. is a leader and innovator in autonomous mobile core software. The company is headquartered in Nashua, NH, USA with offices in Pune MH, India. A5G Networks is pioneering secure and scalable 4G, 5G and Wi-Fi software to enable distributed network of networks. To learn more about A5G Networks, visit www.a5gnet.com AMD, the AMD Arrow logo, EPYC, and combinations thereof are trademarks of Advanced Micro Devices. Media Contact Kaitki Agarwal, A5G Networks, Inc., 1 6033247375, [email protected], www.a5gnet.com Twitter, LinkedIn SOURCE A5G Networks, Inc. "
}