{
    "title": "SolidRun Announces Module Leveraging AMD’s 6nm “Zen3” Architecture",
    "date": "2/28/2024",
    "url": "https://embeddedcomputing.com/technology/processing/compute-modules/solidrun-announces-module-leveraging-amds-6nm-zen3-architecture",
    "text": "Production Editor Embedded Computing Design February 28, 2024 News SolidRun released its new Ryzen V3000 CX7 COM Module leveraging  the 8-core/16-thread Ryzen Embedded V3C48 processor with AMD’s 6nm “Zen3” architecture. The module delivers processing power, thermal efficiency, and high-speed I/O connectivity to the COM Express Type 7 form factor. “Our new Ryzen V3000 CX7 COM Module is an exciting addition to our CX7 product line as it represents a significant leap forward in embedded computing and offers unmatched performance and scalability for networking and edge applications,” said Dr. Atai Ziv, CEO at SolidRun. “By leveraging the power of AMD’s Ryzen Embedded V3000 processor, we are empowering developers to create innovative solutions that meet the evolving demands of modern embedded computing.” “AMD Ryzen Embedded V3000 processors meet the processing requirements of a wide range of embedded applications, including storage, cloud, enterprise, networking, security, and edge,” said Sasha Strizhiver, embedded product line manager at SolidRun. “With features such as extensive RAS coverage, enterprise-class reliability, and up to 10-year planned product availability, our new Ryzen V3000 CX7 SOM offers a compelling solution for industrial customers with demanding workloads.” For more information, visit solid-run.com. Chad Cox. Production Editor, Embedded Computing Design, has responsibilities that include handling the news cycle, newsletters, social media, and advertising. Chad graduated from the University of Cincinnati with a B.A. in Cultural and Analytical Literature.  More from Chad March 29, 2024 March 28, 2024 March 28, 2024 March 25, 2024 March 22, 2024 March 29, 2024 March 27, 2024 March 20, 2024 March 19, 2024 March 19, 2024 March 28, 2024 March 11, 2024 March 05, 2024 February 23, 2024 February 01, 2024 February 6, 2024 January 15, 2024 December 28, 2023 December 27, 2023 December 20, 2023 March 28, 2024 March 27, 2024 March 20, 2024 March 18, 2024 March 15, 2024 "
}