{
    "title": "Local Fullerton physician-scientist pioneers eye disease study in space",
    "date": "2/25/2024",
    "url": "https://fullertonobserver.com/2024/02/25/local-fullerton-physician-scientist-pioneers-eye-disease-study-in-space/",
    "text": " Hema Ramkumar, MD, an ophthalmologist and physician-scientist based in Fullerton, is launching a groundbreaking study on an eye disease called macular degeneration – into space. As a local physician-scientist and founder of the drug development firm Oculogenex, Dr. Ramkumar has long been interested in treatments for age-related macular degeneration, or AMD. AMD is a disease of the eye’s retina that affects 20 million Americans. People affected by AMD often suffer from vision loss involving their central vision. Some earlier stages of the disease are currently considered incurable, but Dr. Ramkumar hopes to change that. And the treatments that do exist for later stages are effective but burdensome, sometimes requiring patients to undergo monthly administration indefinitely. As a retinal specialist, she sought to find a way to decrease this burden for her patients, so she looked for genetic therapies that would confer lifelong benefits. So, Dr. Ramkumar turned her attention to creating a treatment that would strengthen the retinal cells and prevent them from dying off, as they typically do in AMD. She found that spaceflight causes the same type of oxidative damage to the retina as AMD does and wondered whether she could use spaceflight to study this AMD treatment. After founding Oculogenex in 2020, she set up a research laboratory in BioLabs LA that has since been under the directorship of Zhongyang Lu, MD, PhD, a talented ophthalmologist and physician-scientist. NASA approached her with a grant to apply her experiments to space travel. This project will test Dr. Ramkumar’s treatments with the help of mice. Some of the mice will be given the experimental genetic AMD therapy, and some will receive a placebo. After launching from a SpaceX rocket, these mice will spend 30 days aboard the International Space Station, where they will be cared for by ISS astronauts under strict humane research standards. Meanwhile, an on-the-ground “control” group will undergo the same treatments and experience the same conditions, even down to the “whooshing” sounds from takeoff, landing, and on-board fans. This means that the only difference between the in-space and on-the-ground groups will be the gravitational forces and unique spaceflight experience. Before and after the trip, the mice’s eyes will be scanned, and the results will help determine whether this genetic therapy stops, slows, or reverses AMD. Dr. Ramkumar explains that she is treating space as an “accelerated aging model” in that the chronic stress from space travel mimics real-life aging. In multiple other models of AMD, this investigational therapy has demonstrated retinal cell protection, and she plans to start human clinical trials with the treatment this year. This will be a groundbreaking study involving the first retinal photos after spaceflight, the first gene therapy study in space, the first ophthalmic treatment study on live animals in space, and the first study involving an all-female mouse team (previous studies only used male mice). Beyond age-related macular degeneration, this project may shed light on the effect of spaceflight on the retina, as well as unravel the potential to enhance our ability to combat the stressors of spaceflight — topics NASA is very interested in as it continues to pioneer human space exploration. Dr. Ramkumar expects a “high chance of success” for this mission. She explains her passion for both research and clinical medicine. As a lifelong problem-solver, she loves the cycle of seeing patients, then conducting research, applying what she has learned in the lab to caring for her patients and seeing patients improve as a direct result of Ocluogenex’s research. Every step of the process is important to further scientific knowledge and improve her patient’s quality of life. Dr. Ramkumar is practicing in Fullerton, CA, and can be reached at 714-738-4620. Categories: Health, Local Business, Local News Tagged as: age-related macular degeneration, Dr. Ramkumar, first retinal photos after spaceflight, groundbreaking study, Hema Ramkumar, Oculogenex, ophthalmologist, physician-scientist, spaceflight ——————————————————————————————————————————————————————————— Protect local journalism – please subscribe to the print edition or online edition of the Fullerton Observer. All editions are free, but subscriptions allow us to print, distribute, and post the paper.  Annual subscription is only $39/year. It only takes a minute – Click Here To Subscribe. Thank you for supporting the Fullerton Observer. Click here to view a copy of the print edition. ——————————————————————————————————————————————————————————— Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading Privacy Policy | Terms and Conditions "
}