{
    "title": null,
    "date": "2/11/2024",
    "url": "https://sg.news.yahoo.com/instincts-massively-cheaper-nvidias-h100-124519598.html",
    "text": "AMD's flagship AI GPUs, the Instincts, are being sold at a significant discount to Microsoft, offering a competitive alternative to Nvidia's pricier H100. According to Tom's Hardware, Nvidia's H100 AI GPUs cost up to four times more than AMD's competing MI300X, with prices peaking beyond $40,000. Despite the price advantage, AMD's market strategy is not expected to significantly impact Nvidia's stronghold in the AI GPU market. This is due to Nvidia's established CUDA software stack, which has been optimized for a wide range of AI applications and workloads, resulting in overwhelming demand for its GPUs. AMD recently raised its guidance for artificial intelligence-related revenue to $3.5 billion this year, up from $2 billion. However, Citi analyst Christopher Danely believes that AMD could be purposefully underestimating sales figures. He predicts that AMD will generate $5 billion this year and $8 billion next year from the MI300. Microsoft and Meta are reportedly the largest customers for the MI300, which was unveiled in December. The average selling price for Microsoft is roughly $10,000, while other customers pay $15,000 or more. Despite AMD's aggressive pricing strategy, risks remain. The PC space replenishment might be over, and Intel is catching up to Taiwan Semiconductor (TSM) in manufacturing. Furthermore, AMD's sales figures could be affected by the fact that Nvidia does not officially disclose the pricing of its H100 80GB products, which depends on various factors such as the volume of the batch and overall volumes procured by a particular client. While AMD's Instincts are massively cheaper than Nvidia's H100, the impact on Nvidia's dominant market position remains to be seen. With AMD's sales of data center GPUs expected to exceed $3.5 billion, and supply still available, it provides a stark comparison to Nvidia's rumored 52-week wait times. However, given Nvidia's established software infrastructure and high demand, AMD's price advantage may not be enough to significantly disrupt the market. AMD’s next-gen CPU is superfast Nvidia is powering a mega Tesla supercomputer powered by 10,000 H100 GPUs Intel has a new rival to Nvidia's uber-popular H100 AI GPU Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order.  My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap.  New agile US Marine formations are learning how to battle adversaries like China on remote islands, according to The Washington Post. In this week’s travel roundup we bring you transport trivia, Roman engineering marvels and the world’s tastiest dumpling. When Sam* married her husband, she never imagined that 20 years on, she'd have not one, but two affairs...  Dini von Mueffling is a PR professional in New York City's who's worked with Monica Lewinsky and Virginia Giuffre. Surveillance footage captures the harrowing moment a wild boar viciously attacks a 70-year-old man in his front yard in Guangyuan, China, on March 24. The man sustains severe spinal injuries while defending himself against the enraged animal's assault. Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp. 透過這項突破性的發現增強您對疾病的防禦能力！ 採用科學支援的解決方案，增強您的免疫系統並抵禦有害的自由基。 The post Bites by Ann Chin: Michelin popiah, loaded waffles & local bites in hole-in-wall eatery appeared first on SETHLUI.com. The visibly upset MSNBC anchor was responding to the Trump's attack on Judge Juan Merchan's daughter despite gag orders The post Nicole Wallace Gets Fed Up, Tosses Script While Covering Latest Trump Attack: ‘What Are We Going to Do Different?’ | Video appeared first on TheWrap. City Developments Limited ( SGX:C09 ), is not the largest company out there, but it received a lot of attention from a...  Israel assassinated a Syrian colonel in Damascus and a senior Hezbollah commander in Lebanon in a series of pinpointed strikes amid the largest attacks on neighbouring countries since the start of the war in Gaza. Watch as King Charles III attends church on Easter Sunday in his most significant public appearance since he was diagnosed with cancer.  The Princess of Wales and her family will not be at the service.  Charles, 75, will join the Queen and other members of the royal family at the annual Easter Mattins Service at St George’s Chapel at Windsor Castle on Sunday 31 March. Full-back has become invaluable at Anfield and would surely thrive under Klopp’s possible replacement Roberto De Zerbi  The post Fiie’s Cafe — ‘Mr Grumpy’ fried chicken officially lands in Toa Payoh appeared first on SETHLUI.com. Health officials are alerting doctors to be on the lookout for certain types of rare but serious meningococcal infections that are on the rise in the United States. Princess Eugenie and Princess Beatrice reportedly want to become working royals and are upset about King Charles snubbing them. "
}