{
    "title": null,
    "date": "2/5/2024",
    "url": "https://www.benzinga.com/government/24/02/36931625/amd-faces-new-challenge-as-china-advances-with-risc-v-chip-technology",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Advanced Micro Devices Inc AMD, alongside Intel Corp INTC, controls the x86 chip standard, pivotal in the global semiconductor market. This dominance is challenged by China’s strategic pivot towards the open-source RISC-V architecture, revealed through a patent by a Beijing-based military institute. RISC-V’s design for cloud computing and smart cars indicates China’s intent to circumvent U.S. sanctions and reduce dependency on Western chip technologies, including AMD’s x86 and Britain’s Arm Holdings Plc ARM architecture, Reuters reports. Analysts hail AMD as the most significant AI technology beneficiary after Nvidia Corp NVDA. The stocks saw some profit booking last month as fund managers sought better price points. Despite existing U.S. and U.K. export controls limiting the sale of advanced x86 and Arm designs to China, the inclusive nature of RISC-V positions it as a geopolitically neutral alternative, potentially reshaping chip manufacturing and application. In contrast with the proprietary and complex nature of x86 and Arm, RISC-V’s simplicity and flexibility offer a path towards more energy-efficient and customizable chip solutions. Despite the current dominance of x86 and Arm, China’s push for RISC-V adoption, backed by significant patent filings and the development of high-performance chips and operating systems, suggests a potential shift in the balance of chip technology power. This shift could influence AMD’s market position, as RISC-V’s growth challenges the established architectures and opens new avenues for chip innovation and application. Price Actions: AMD shares closed higher by 4.21% at $177.65 on Friday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}