{
    "title": "Starfield beta now supports AMD FSR3",
    "date": "2/7/2024",
    "url": "https://videocardz.com/newz/starfield-beta-now-supports-amd-fsr3",
    "text": "For now, only in beta.  As promised, AMD and Bethesda are introducing FidelityFX Super Resolution 3 technology in Starfield. Despite AMD being a PC launch partner for this game and the fact that FSR3 was announced more than a year ago, the game did not support FSR3 at launch, to many gamers’ disappointment. In fact, the game received support for DLSS3 with Frame Generation in November last year, with no sign of FSR3. The long wait is over, and FSR3 can now be enabled in the game, but only if you’re using Steam and select the beta build manually. The game with FSR3 is supposed to launch for everyone later this month.   AMD FSR in Display Settings, Source: Bethesda  AMD and Bethesda are recommending users to disable Vertical Sync and ideally use a monitor with Variable Refresh Rate support. The FSR3 comes with Frame Generation support for more than just AMD’s latest RDNA3 GPUs. Even GeForce RTX 20 and 30 series should support this technology, which is something not supported by NVIDIA DLSS3 Frame Generation feature. AMD #FSR 3 is now available in @StarfieldGame's Steam Beta! Details: https://t.co/QJ6bBWJe0f Today’s Beta update also includes several other improvements, such as a change to FormIDs to improve stability for saves that have visited many locations. For more information, read the… pic.twitter.com/S2LfqJoPVf — Bethesda Game Studios (@BethesdaStudios) February 7, 2024  As of today, we have the 12th title joining the FSR3 support list. We are still waiting for many games, such as Cyberpunk 2077, Dying Light 2, Frost Punk 2, which were announced to support this technology at some point. Source: Bethesda We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}