{
    "title": "Turns out AMD's 'Compressonator' tool for artists and devs was named after \nThe Governator himself, Arnold ...",
    "date": "2/2/2024",
    "url": "https://www.pcgamer.com/turns-out-amds-compressonator-tool-for-artists-and-devs-was-named-after-the-governator-himself-arnold-schwarzenegger/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Big Arnie doesn't often turn up in PC hardware news, but would you look at that. Arnold Schwarzenegger is a man with a long and varied career, from his entrance onto the world stage as a bodybuilder nicknamed \"The Austrian Oak\", to multiple Mr Olympia title wins, a massive Hollywood career, and eventually, his rise to the status of Governor of California. However, he may have just added another title to his impressive collection, as it's been revealed that he was the inspiration for the naming of, err, a set of digital art compression tools. Ex Intel and AMD graphics chief Raja Koduri dropped this little tidbit in a recent tweet, revealing that then-ATI software engineer Seth Sowery coined the name \"Compressonator\" for the now AMD-owned toolset in reference to Schwarzenegger's famous nickname. He was known as \"The Governator\" when he became the 38th Governor of California in 2003. There's little similarity between Arnold Schwarzenegger and a set of compression tools (let me add that to my \"things I never thought I'd write\" folder), although it's likely that given the program's long shelf life it has at some point been used to work with assets depicting the man himself. After all, Arnie's likeness has a long history of appearing in all sorts of digital media, including the recent use of his likeness as a tank commander in World of Tanks.  Best gaming PC: The top pre-built machines.\nBest gaming laptop: Great devices for mobile gaming. The gaming association may come as a surprise to those of you who remember some of his views on the subject, particularly in regards to depictions of \"violence or mayhem\" in the medium, as during his tenure as The Governator he signed into law a bill that sought to ban sale or rental of video games deemed violent to anyone under the age of 17. The bill was later blocked by a federal judge on the grounds of a lack of evidence for links between violent video games and injury to children. Sign up to get the best content of the week, and great gaming deals, as picked by the editors. While this latest news is unlikely to make him fall off his chair, the Austrian muscle-man can now chalk up another cultural win, and it's all thanks to a bit of tongue-in-cheek tomfoolery back in the heady days of ATI. It's unclear if this nice bit of referencing came before or after the Wendy's \"Baconator\" cheeseburger, but in my mind at least, it was the Compressonator that got there first. Andy built his first gaming PC at the tender age of 12, when IDE cables were a thing and high resolution wasn't. After spending over 15 years in the production industry overseeing a variety of live and recorded projects, he started writing his own PC hardware blog for a year in the hope that people might send him things. Sometimes they did.  Now working as a hardware writer for PC Gamer, Andy can be found quietly muttering to himself and drawing diagrams with his hands in thin air. It's best to leave him to it.  Dragon's Dogma 2 is an object lesson in how system requirements pages are failing PC gamers This home-brew GPU built by a lone enthusiast is a slightly labour-intensive way to avoid painful graphics card prices 73M AT&T customers have had their personal data, including passcodes, leaked online By Tyler Wilde29 March 2024 By Christopher Livingston29 March 2024 By Morgan Park29 March 2024 By Rick Lane29 March 2024 By Rick Lane29 March 2024 By Rick Lane29 March 2024 By Rick Lane29 March 2024 By Jeremy Laird29 March 2024 By Kerry Brunskill29 March 2024 By Tyler Colp28 March 2024 By Andy Chalk28 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}