{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.ig.com/sg/news-and-trade-ideas/amd-under-pressure-as-washington-ramps-up-china-export-rules-240306",
    "text": "CFDs are leveraged products. CFD trading may not be suitable for everyone and can result in losses that exceed your deposits, so please ensure that you fully understand the risks involved. \n CFDs are leveraged products. CFD trading may not be suitable for everyone and can result in losses that exceed your deposits, so please ensure that you fully understand the risks involved. View more search results ​​AMD’s stock fell briefly yesterday on news that the US government will not allow the company to sell certain chips without an export license. ​U.S. officials have told AMD it cannot sell an AI chip tailored for Chinese customers without an export license, ensnaring the chipmaker in Washington's crackdown on tech exports to China. AMD had hoped to get approval to sell the lower-performance chip to Chinese buyers since it operates below AMD's offerings outside China. ​AMD has declined to comment on whether it will seek the required license. AMD's shares fell 2.2% Tuesday amid investor concerns over potential impact on its China business, though the shares rebounded by the end of the session. ​​The U.S. unveiled export curbs in 2022 to limit China's access to advanced chips and chipmaking tools over national security worries. Controls were tightened further in October 2022 to cover more tech. Like AMD, Nvidia has downgraded performance of AI chips for the Chinese market to comply with escalating U.S. restrictions. ​Major Chinese tech firms like Tencent and Baidu have stockpiled Nvidia's powerful pre-ban AI chips to sustain development for 1-2 years. Huawei is developing its own AI chips to fill potential gaps from the U.S. ban. ​​The Biden administration's intensifying efforts force AMD, Nvidia to navigate complex export rules that risk impacting a major market. ​The AMD share price, which has risen by nearly 50% year-to-date, accelerated to the upside last week and added around 15% of gains since last Thursday. ​The fact that the last few days’ swift rally occurred while three price gaps were made, one of which has been filled on Tuesday, does mean that the current advance might be fragile as it seems to be driven by investors who jump on the bandwagon for fear of missing out. ​Having said that, even if a short-term retracement lower were to be seen, the mid-January to late February $184.92 to $161.81 sideways trading range should offer solid support. ​​While it and the October-to-March uptrend line underpin, the medium-term uptrend will remain valid. ​A rise above Tuesday’s $211.01 record high would put the minor psychological $250 mark on the cards.​​ IGA, may distribute information/research produced by its respective foreign affiliates within the IG Group of companies pursuant to an arrangement under Regulation 32C of the Financial Advisers Regulations. Where the research is distributed in Singapore to a person who is not an Accredited Investor, Expert Investor or an Institutional Investor, IGA accepts legal responsibility for the contents of the report to such persons only to the extent required by law. Singapore recipients should contact IGA at 6390 5118 for matters arising from, or in connection with the information distributed.\n\nThe information/research herein is prepared by IG Asia Pte Ltd (IGA) and its foreign affiliated companies (collectively known as the IG Group) and is intended for general circulation only. It does not take into account the specific investment objectives, financial situation, or particular needs of any particular person. You should take into account your specific investment objectives, financial situation, and particular needs before making a commitment to trade, including seeking advice from an independent financial adviser regarding the suitability of the investment, under a separate engagement, as you deem fit.\n\nNo representation or warranty is given as to the accuracy or completeness of this information. Consequently, any person acting on it does so entirely at their own risk. Please see important Research Disclaimer. Please also note that the information does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. Any views and opinions expressed may be changed without an update. Go long or short on thousands of international stocks. See more forex live prices See more shares live prices Prices above are subject to our  website terms and agreements. Prices are indicative only. All shares prices are delayed by at least 15 mins. See more indices live prices Prices above are subject to our  website terms and agreements. Prices are indicative only. All shares prices are delayed by at least 20 mins.  Get the week’s momentum report sent directly to your inbox every Monday for FREE. The Week Ahead gives you a full calendar of upcoming key events to monitor in the coming week, as well as commentary and insight from our expert analysts on the major indices to watch.  For more info on how we might use your data, see our privacy notice and access policy and privacy webpage. Find out what charges your trades could incur with our transparent fee structure. Discover why so many clients choose us, and what makes us a world-leading provider of CFDs. Stay on top of upcoming market-moving events with our customisable economic calendar. Forex Indices Shares Other markets Premium services Our charges and margins About IG Marketing Partnership Web platform Mobile trading MetaTrader 4 ProRealTime Compare features News and trade ideas Economic calendar Momentum Report Market data New client: +65 6390 5133 or accountopening@ig.com.sg Clients: Help and support WhatsApp: Click here IG | Sitemap | Terms and agreements | Privacy | Security | IG Community | Refer a friend | Cookies Follow us online: Disclaimer: All forms of investments carry risks and trading CFDs may not be suitable for everyone. CFDs are leveraged instruments and can result in losses that exceed deposits, so please ensure that you fully understand, and are aware of, the risks and costs involved. Refer to the Risk Disclosure Statement and Risk Fact Sheet. IG Asia Pte Ltd (Co.Reg.No. 200510021K) is regulated by the Monetary Authority of Singapore and holds a capital markets services licence for dealing in capital markets products that are over-the-counter derivatives contracts and is an exempt financial adviser. IG provides an execution-only service. The information in this advertisement does not contain (and should not be construed as containing) investment advice or an investment recommendation, or an offer of or solicitation for a transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. You should consider your specific investment objectives, financial situation or particular needs before making a commitment to trade, including seeking advice from an independent financial adviser regarding the suitability of the investment, under a separate engagement, as you deem fit. The information on this site is not directed at residents of the United States or Belgium and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation. This advertisement has not been reviewed by the Monetary Authority of Singapore. Careers | Marketing partnership "
}