{
    "title": "AMD Athlon Silver 7120U vs Intel Pentium Gold 4410Y vs AMD Athlon Gold 7220U",
    "date": "3/15/2024",
    "url": "https://www.notebookcheck.net/Athlon-7120U-vs-Pentium-4410Y-vs-Athlon-7220U_15048_9584_14613.247596.0.html",
    "text": "The AMD Athlon Silver 7120U is a mobile processor for cheap laptops of the Mendocino series. It integrates two older Zen 2 cores (similar to the Ryzen 4000 series). The CPU cores clock from 2.4 GHz (base) to 3.5 GHz (single core Turbo) and can use 2 MB L3 cache. The Athlon Silver does not support SMT/Hyperthreading and therefore can only work on 2 threads simultaneously. The integrated memory controller only supports fast LPDDR5 memory (5500 MHz max.). Compared to the faster Mendocino models like the Ryzen 5 7520U, the 7120U offers only two cores, no SMT, less L3 cache and reduced clock speeds, leading to a clearly lower CPU performance. \nThe integrated graphics card (Radeon 610M iGPU) uses the modern RDNA 2 architecture, but only 2 CUs (128 shaders) and clocks with up to 1.9 GHz. \nThe CPU performance should be to the fastest Ryzen dual-core (Ryzen 3 3250U, 2.6 - 3.5 GHz, Zen 1) but clearly stay behind modern quad-core CPUs (in multi threaded tests). \nThe Mendocino series are produced in a relatively modern 6nm FinFET process at TSMC and should offer a good power efficiency. The Athlon Silver 7120U is rated at 8-15 W TDP and therefore well suited for thin and light laptops. The AMD Athlon Silver 7120U is a mobile processor for cheap laptops of the Mendocino series. It integrates two older Zen 2 cores (similar to the Ryzen 4000 series). The CPU cores clock from 2.4 GHz (base) to 3.5 GHz (single core Turbo) and can use 2 MB L3 cache. The Athlon Silver does not support SMT/Hyperthreading and therefore can only work on 2 threads simultaneously. The integrated memory controller only supports fast LPDDR5 memory (5500 MHz max.). Compared to the faster Mendocino models like the Ryzen 5 7520U, the 7120U offers only two cores, no SMT, less L3 cache and reduced clock speeds, leading to a clearly lower CPU performance. The integrated graphics card (Radeon 610M iGPU) uses the modern RDNA 2 architecture, but only 2 CUs (128 shaders) and clocks with up to 1.9 GHz. The CPU performance should be to the fastest Ryzen dual-core (Ryzen 3 3250U, 2.6 - 3.5 GHz, Zen 1) but clearly stay behind modern quad-core CPUs (in multi threaded tests). The Mendocino series are produced in a relatively modern 6nm FinFET process at TSMC and should offer a good power efficiency. The Athlon Silver 7120U is rated at 8-15 W TDP and therefore well suited for thin and light laptops. The Intel Pentium 4410Y is a low power entry level processor for small laptops or tablets and based on the Kaby Lake architecture. It was announced in Q2 2017 and offers two processor cores clocked at 1.5 GHz (no Turbo Boost). Thanks to Hyper Threading, the processor can execute up to four threads simultaneously. The chips also includes the Intel HD Graphics 615 GPU, a dual-channel memory controller (DDR3L/LPDDR3) as well as VP9 and H.265 video de- and encoder. It is still produced in a 14 nm process with FinFET transistors. Compared to the much faster Core m3-7Y30, the Pentium 4410 offers no Turbo Boost, different CPU and GPU clock speeds, a smaller L3 cache and a higher TDP of 6 Watt. \nArchitecture \nIntel basically used the familiar micro architecture from the Skylake generation, so the per-MHz performance is identical. Only the Speed-Shift technology for faster dynamic adjustments of the voltages and clocks was improved, and the matured 14 nm process now also enables much higher frequencies and better efficiency than before.  \nPerformance \nDue to the missing Turbo Boost, the Pentium 4410Y offers a significantly worse single thread performance than the more expensive Core m3-7Y30. This should be noticeable in daily tasks. The similar Pentium 4415Y is slightly faster due to the 100 MHz higher core clock of the processor cores. \nGraphics \nThe integrated Intel HD Graphics 615 GPU has 24 Execution Units (EUs) like the old HD Graphics 515 and runs with clocks between 300 and 850 MHz in combination with this processor. The performance heavily depends on the TDP limit as well as the memory configuration; with fast LPDDR3-1866 RAM in dual-channel mode, the GPU should sometimes be able to compete with the HD Graphics 520, but can also be much slower in other scenarios. Modern games from 2016 will, if at all, only run smoothly in the lowest settings. \nContrary to Skylake, Kaby Lake now also supports hardware decoding for H.265/HEVC Main10 with a 10-bit color depth as well as Google's VP9 codec. \nPower Consumption \nThe chip is manufactured in an improved 14 nm process with FinFET transistors, so the power efficiency was once again improved significantly. The TDP is rated at 6 Watt and can be reduced to 4,5 Watt (cTDP down). The Intel Pentium 4410Y is a low power entry level processor for small laptops or tablets and based on the Kaby Lake architecture. It was announced in Q2 2017 and offers two processor cores clocked at 1.5 GHz (no Turbo Boost). Thanks to Hyper Threading, the processor can execute up to four threads simultaneously. The chips also includes the Intel HD Graphics 615 GPU, a dual-channel memory controller (DDR3L/LPDDR3) as well as VP9 and H.265 video de- and encoder. It is still produced in a 14 nm process with FinFET transistors. Compared to the much faster Core m3-7Y30, the Pentium 4410 offers no Turbo Boost, different CPU and GPU clock speeds, a smaller L3 cache and a higher TDP of 6 Watt. Architecture Intel basically used the familiar micro architecture from the Skylake generation, so the per-MHz performance is identical. Only the Speed-Shift technology for faster dynamic adjustments of the voltages and clocks was improved, and the matured 14 nm process now also enables much higher frequencies and better efficiency than before. Performance Due to the missing Turbo Boost, the Pentium 4410Y offers a significantly worse single thread performance than the more expensive Core m3-7Y30. This should be noticeable in daily tasks. The similar Pentium 4415Y is slightly faster due to the 100 MHz higher core clock of the processor cores. Graphics The integrated Intel HD Graphics 615 GPU has 24 Execution Units (EUs) like the old HD Graphics 515 and runs with clocks between 300 and 850 MHz in combination with this processor. The performance heavily depends on the TDP limit as well as the memory configuration; with fast LPDDR3-1866 RAM in dual-channel mode, the GPU should sometimes be able to compete with the HD Graphics 520, but can also be much slower in other scenarios. Modern games from 2016 will, if at all, only run smoothly in the lowest settings. Contrary to Skylake, Kaby Lake now also supports hardware decoding for H.265/HEVC Main10 with a 10-bit color depth as well as Google's VP9 codec. Power Consumption The chip is manufactured in an improved 14 nm process with FinFET transistors, so the power efficiency was once again improved significantly. The TDP is rated at 6 Watt and can be reduced to 4,5 Watt (cTDP down). The AMD Athlon Gold 7220U is a mobile processor for cheap laptops of the Mendocino series. It integrates two older Zen 2 cores (similar to the Ryzen 4000 series). The CPU cores clock from 2.4 GHz (base) to 3.7 GHz (single core Turbo) and can use 4 MB L3 cache. Thanks to SMT/Hyperthreading, the CPU can work on 4 threads simultaneously. The integrated memory controller only supports fast LPDDR5 memory (5500 MHz max.). Compared to the faster Mendocino models like the Ryzen 5 7520U, the 7220U offers only two cores and reduced clock speeds, leading to a clearly lower CPU performance. \nThe integrated graphics card (Radeon 610M iGPU) uses the modern RDNA 2 architecture, but only 2 CUs (128 shaders) and clocks with up to 1.9 GHz. \nThe CPU performance should be better than the fastest Ryzen dual-core (Ryzen 3 3250U, 2.6 - 3.5 GHz, Zen 1) but clearly stay behind modern quad-core CPUs (in multi threaded tests). \nThe Mendocino series are produced in a relatively modern 6nm FinFET process at TSMC and should offer a good power efficiency. The Athlon Gold 7220U is rated at 8-15 W TDP and therefore well suited for thin and light laptops. The AMD Athlon Gold 7220U is a mobile processor for cheap laptops of the Mendocino series. It integrates two older Zen 2 cores (similar to the Ryzen 4000 series). The CPU cores clock from 2.4 GHz (base) to 3.7 GHz (single core Turbo) and can use 4 MB L3 cache. Thanks to SMT/Hyperthreading, the CPU can work on 4 threads simultaneously. The integrated memory controller only supports fast LPDDR5 memory (5500 MHz max.). Compared to the faster Mendocino models like the Ryzen 5 7520U, the 7220U offers only two cores and reduced clock speeds, leading to a clearly lower CPU performance. The integrated graphics card (Radeon 610M iGPU) uses the modern RDNA 2 architecture, but only 2 CUs (128 shaders) and clocks with up to 1.9 GHz. The CPU performance should be better than the fastest Ryzen dual-core (Ryzen 3 3250U, 2.6 - 3.5 GHz, Zen 1) but clearly stay behind modern quad-core CPUs (in multi threaded tests). The Mendocino series are produced in a relatively modern 6nm FinFET process at TSMC and should offer a good power efficiency. The Athlon Gold 7220U is rated at 8-15 W TDP and therefore well suited for thin and light laptops. #0 checking url part for id 15048 +0s ... 0s #1 checking url part for id 9584 +0s ... 0s #2 checking url part for id 14613 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.042s ... 0.043s #6 did output specs +0s ... 0.043s #7 getting avg benchmarks for device 15048 +0.003s ... 0.046s #8 got single benchmarks 15048 +0s ... 0.046s #9 getting avg benchmarks for device 9584 +0.003s ... 0.049s #10 got single benchmarks 9584 +0s ... 0.049s #11 getting avg benchmarks for device 14613 +0.003s ... 0.052s #12 got single benchmarks 14613 +0.006s ... 0.058s #13 got avg benchmarks for devices +0s ... 0.058s #14 min, max, avg, median took s +0.007s ... 0.065s #15 return log +0s ... 0.065s "
}