{
    "title": "AMD stock analysts overhaul price targets after China news",
    "date": "3/25/2024",
    "url": "https://www.dcourier.com/news/2024/mar/25/amd-stock-analysts-overhaul-price-targets-after-ch/",
    "text": "  Nvidia's CEO Jensen Huang is winning in the emerging artificial intelligence chip market. However, his advantage may shrink following the launch of Advanced Micro Devices' MI300X AI chips this year. How much of the global AI market AMD captures remains to be seen. However, new rules phasing out AMD chips in computer systems sold in China suggest it's unlikely to do any better in China than Nvidia, which saw Middle Kingdom sales evaporate after the U.S. government enacted restrictions to limit next-generation AI chip sales last fall. China's decision creates a speedbump that has caught analysts' attention, leading them to update their outlooks. Travis P&period Ball&solGetty Images The launch of OpenAI's ChatGPT showed the promise of using AI apps to quickly search, parse, and create content, unlocking a flurry of AI research and development activity. Companies across most industries are knee-deep in evaluating whether AI can improve practices and processes and create new previously unforeseen revenue streams. Related: AMD sees big demand for 'Nvidia killer' chips but issues unexpected forecast Banks are using AI to hedge portfolio risks, manufacturers are seeing if it can improve quality and maintenance, retailers are considering its potential to prevent theft, and healthcare is researching its use in drug development. The U.S. government is even judging if AI can reshape warfare. The surge in activity is exciting, but it's also exposing flaws in existing technology infrastructure. Networks have primarily been built around lower-cost central processing units, or CPUs, that perform basic tasks well but struggle to efficiently handle training and running complex AI programs. The need for more powerful and energy-saving servers has turned the attention of enterprises and cloud solution providers, including Amazon, Google Cloud, and Microsft's Azure, toward equipment featuring graphic processing units, or GPUs, made by Nvidia. GPU's ability to better address AI developers' needs has caused Nvidia's revenue to soar, and expectations are that AMD will profit similarly from the transition now that its MI300x is available. Deloitte expects chips optimized for generative AI to exceed $50 billion in 2024. Nvidia's CEO Jensen Huang recently said the market for AI chips could eventually total hundreds of billions. AMD has come to a similar conclusion. Its CEO, Lisa Su, told investors earlier this year that its next-generation AI chips will rack up $3.5 billion in sales this year, up from prior expectations for $2 billion. Importantly, Su estimates that the AI chip market could be worth as much as $45 billion in 2024, growing to $400 billion by 2027. On March 24, the Financial Times reported that China had rolled out guidelines to eliminate Intel and AMD chips from government computers and servers. Instead, China wants to make sure that its systems are powered by silicon made by Chinese semiconductor companies like Semiconductor Manufacturing International Corporation (SMIC), HiSilicon, and Yangtze Memory Technologies Corp. More AI Stocks: The move is significant because, in 2020, China was responsible for buying 54% of the world's semiconductor chips, valued at about $240 billion. Historically, China's domestic production was best suited for lower-end applications. It turned to the West for high-end chips. However, its reliance on foreign chips exposed it to a similar risk cited by the U.S. government- the potential for non-domestic technology to one day be used against it. As a result, China increased efforts to support the development of more sophisticated domestic chips. Those chips are apparently ready for prime time, given China's push to use them in devices sold there. The country's decision to phase out U.S. chipmakers is reminiscent of last year's decision to mandate government employees shift away from Apple devices to Chinese smartphone suppliers, including Huawei, HONOR, and Xiaomi. That decision took a big bite out of Apple's China revenue, causing sales to drop 13% to $21 billion in the fourth quarter. Since China accounted for 15% of AMD’s $22.7 billion revenue in 2023, the impact of its decision could be substantial. The latest in the U.S. versus China technology tit-for-tat has caught the eye of two TheStreet Pro analysts, Stephen Guilfoyle and Bruce Kamich. Guilfoyle has been picking stocks since working on the New York Stock Exchange floor in the 1980s, and Kamich has used technical analysis to evaluate major markets and stocks for over 50 years. Although AMD is Guilfoyle's second-largest holding, he's watching it closely. If the China news causes investors to get antsy about valuation, causing shares to slide, he may book some profit. \"AMD has been one of the darlings of the revolution in generative AI, considered by many to be the one challenger to Nvidia that might actually be able to take some (maybe not much, but some) market share,\" wrote Guilfoyle. \"Still, AMD went into the weekend trading at 53 times forward earnings.\" That's arguably rich given Nvidia trades at 39 times forward earnings. AMD's stock price has fallen to about $180 from a peak near $227 in early March, putting it right about on its 50-day moving average. Many investors, including Guilfoyle, track whether a stock price is above or below that moving average when deciding whether to buy or sell shares. \"Should AMD break contact with its 50-day SMA, there are risk managers on Wall Street who will force their portfolio managers to reduce long-side exposure,\" said Guilfoyle. Kamich also sees troubling signs in his analysis of AMD's stock charts. \"I can see a dramatic looking top reversal pattern,\" wrote Kamich. \"The weekly [On-balance volume] OBV line shows us the early start of a decline. The [Moving average convergence divergence] MACD oscillator has narrowed in recent weeks and is close to a downside crossover and take profit sell signal.\" On-balance volume is essentially a measure of up minus down day volume. MACD is a momentum indicator. Using point-and-figure charts, Kamich calculated divergent price targets. The daily P&F price target of $155 is concerning to short-term investors. However, long-term investors may take solace in the fact that the weekly P&F target of $358 remains much higher than prices today. Of course, this weekly target could change if AMD shares lose more ground. That said, P&F charts aren't guaranteed and don't suggest when a target may be reached. While the China news could mean AMD shares head lower, it's possible that we see a similar scenario for AMD play out as we saw with Nvidia last October. When the U.S. government announced AI chip restrictions, Nvidia's shares fell 17%  from peak to low. They've rallied 144% since then. Regardless, investors may want to watch closely to see what happens to AMD shares given Guilfoyle and Kamich's comments. Related: Veteran fund manager picks favorite stocks for 2024 Click Below to: Contents of this site are © Copyright 2024 Prescott Newspapers, Inc. and Western News&Info®, Inc. All rights reserved. |  Terms of Service | Privacy Policy "
}