{
    "title": "The Thaumaturge Mod, HDR, Ultrawide (21:9), Super Ultrawide (32:9), AMD FSR \n3 & DLSS Support Details",
    "date": "3/8/2024",
    "url": "https://digistatement.com/the-thaumaturge-mod-hdr-ultrawide-219-super-ultrawide-329-amd-fsr-3-dlss-support-details/",
    "text": "The Thaumaturge Mod, HDR, Ultrawide (21:9), Super Ultrawide (32:9), AMD FSR 3 & DLSS Support Details March 2024 is already looking to be a great month for video games thanks to upcoming and already released titles like Unicorn Overlord, Dragon’s Dogma: 2, Rise of the Ronin, and the subject of this article: The Thaumaturge. Developed by Fool’s Theory, the Polish studio behind the upcoming The Witcher Remake, The Thaumaturge is a story-driven RPG set in early 20th-century Warsaw, where the world is filled with strange creatures called Salutors. You will be playing as Wiktor Szulski, a thaumaturge who possesses the ability to tame salutors. There are a lot of secrets to be discovered, powers to be gained, and a fun experience to be had. But before that, it seems like a lot of players want to know whether the game supports modding, HDR, ultrawide, super ultrawide, AMD FSR 3, and DLSS. For some, having beforehand knowledge of these types of things is preferable. After all, if someone is going to drop money and spend multiple hours on a game, then it’s only evident that they would want to know whether the game has support for features they want to play the game with. So, does The Thaumaturge support modding, HDR, ultrawide, super ultrawide, AMD FSR3, and DLSS? Well, let’s go ahead and find out. At the time of publishing this, there’s no official mod support available for The Thaumaturge. Certainly, it is disappointing news but an understandable one since the game was just released. And even if the developers don’t add mod support, we believe that players will be perfectly able to mod the game since it happens to be a single-player title. And like mod support, the game also doesn’t have native HDR. But if you want, you can use Windows’s Auto-HDR feature or tools like Special K or autohdr_force. On the other hand, if you really want to use native HDR, then you will need to wait for the developers to add it to the game. As for ultrawide and super ultrawide, publisher 11 Bit Studios has stated in the FAQ that The Thaumaturge supports both. However, do note that during cutscenes, the screen will switch to a 16:9 aspect ratio. The developers are aware of this and have clarified that “They are there by design and currently there’s no way to disable them”. And at last, we come to the topic of AMD FSR 3 and DLSS support. Well, players should be happy to know that The Thaumaturge has native support for both DLSS (DLSS 3, to be specific) and AMD FSR 3. Not only that, it’s also got Frame Generation in the settings. The game doesn’t even have that much of a high-end system requirement in the first place. However, it’s great to see that the developers have added both DLSS 3 and FSR 3 in the game, giving players more options to choose from. Well, that’s all the information we have on this right now. You can also take a quick look here if you want to know whether Secrets of Grindea also supports the same features. And for more such content, keep following DigiStatement. Also read: DayZ Mod, HDR, Ultrawide (21:9), Super Ultrawide (32:9), AMD FSR 3 & DLSS Support Details © 2021 DigiStatement - All Rights Reserved © 2021 DigiStatement - All Rights Reserved "
}