{
    "title": "AMD no longer supports 60Hz gaming monitors",
    "date": "3/9/2024",
    "url": "https://stealthoptional.com/hardware/amd-no-support-60hz-gaming-monitors-144hz-only/",
    "text": "Open menu The epicentre of gaming and technology The era of 60fps gaming is coming to an end 10 Mar 2024 12:45 AM +00:00 AMD has made it much harder for monitors to get their basic certifications, as they increased the minimum requirements from 60Hz to 144Hz. This means that 60Hz monitors will be left behind in the dust and can be dumped as far as AMD is concerned. AMD has confirmed that their AMD Freesync certification will no longer be available to these lower refresh rate monitors. For the uninitiated, AMD Freesync is an adaptive sync technology similar to Nvidia's G-sync. Both of these softwares adapt your monitor's refresh rate to the frame rate output by your GPU. Adaptive sync is superior to V-sync, which still suffers from issues such as screen tearing and random noise on your display if the two frame rates are out of sync. Losing access to AMD Freesync is bound to be felt by those still using 60Hz displays. The basic Freesync requirement jumped up from 60Hz to 144Hz. Meanwhile, the minimum requirement for FreeSync Premium jumped up from 120Hz to a whopping 200Hz as well. There is some good news for those of you with 4k monitors, which won't get hit with these new requirements as they are not that common in the market right now. This move by AMD is a sign of the drastic changes we've seen in the market over the past few years. AMD released a statement to clarify their position on the matter and said, \"Gaming monitors at 120 Hz were a rarity in 2015; today, the majority of gaming monitors are 144Hz or higher, which clearly shows the upward refresh rate trend in the industry.\" These changes currently affect gaming monitors and TVs, with gaming laptops still retaining the old requirements. However, this might change soon, and we'll eventually see similar requirement upgrades hitting both gaming laptops and 4k displays. If you're still using an older gaming monitor, it might be time to upgrade to the current generation of gaming monitors. You can check out our list of the best monitors in 2024. On the topic of AMD, you should also learn how long their AM5 socket will be supported. For more articles like this, take a look at our  Hardware,  Peripherals, and  AMD  pages. "
}