{
    "title": "AMD FSR Super Resolution: Upscaling technology to receive AI support",
    "date": "3/4/2024",
    "url": "https://basic-tutorials.com/news/amd-fsr-super-resolution-ai-support/",
    "text": "In contrast to NVIDIA’s DLSS solution, AMD’s FSR Super Resolution upscaling technology does not yet use AI functions to improve performance in games. However, this could soon change, as Mark Papermaster, Chief Technology Officer (CTO) at AMD, has now indicated. The theory is simple: upscaling technologies of current graphics cards calculate the image in a lower resolution and then upscale it, which should ensure better performance. At NVIDIA, the solution is called DLSS (Deep Learning Super Samling), Intel calls it XeSS (XeSS Super Sampling) and AMD calls it FidelityFX Super Resolution (FSR). However, the red camp has a decisive disadvantage so far: unlike both competitors, FSR Super Resolution does not yet use an AI algorithm and machine learning – but this could soon change. At least that’s what Mark Papermaster, Chief Technology Officer (CTO) at AMD, suggests in a podcast interview on No Priors. In it (from minute 36:16), Papermaster reveals that the company has been working on AI functions in hardware and software for years and has now completed this development across its entire portfolio: We are enabling our gaming devices to upscale using AI. And 2024 really is a big year for distribution. Papermaster did not provide any further details and there is no explicit mention of AMD FSR Super Resolution. It is therefore also conceivable that AMD is preparing other or even new solutions with AI support. Click here to display content from youtu.be Always display content from youtu.be However, it is extremely likely that this is an update for FSR. After all, AMD had at least not ruled out the use of artificial intelligence in the performance enhancement of graphics cards. With the third generation of DLSS, NVIDIA has further extended its lead over the AMD alternative. In terms of image quality and performance enhancement, the use of AI functions shows a clear performance advantage here. AMD FSR Super Resolution therefore urgently needs to catch up here to avoid falling even further behind. If AMD succeeds in achieving the same quality with FSR as NVIDIA with DLSS, it could be a real changing of the guard. The AMD solution has the great advantage that it is open source and therefore also works with graphics cards from other manufacturers. If FSR Super Resolution really does compete with DLSS with the help of AI functions, we could be facing a scenario similar to that of the open-source AMD FreeSync technology and NVIDIA G-Sync in the monitor segment. Beginne die Diskussion → Neue Antworten laden... Gehört zum Inventar In contrast to NVIDIA’s DLSS solution, AMD’s FSR Super Resolution upscaling technology does not yet use AI functions to improve performance in games. However, this could soon change, as Mark Papermaster, Chief Technology Officer (CTO) at AMD, has now indicated. AMD FSR Super Resolution with AI algorithm The theory is simple: upscaling technologies of current graphics cards calculate the image in a lower resolution and then upscale it, which should ensure better performance. At NVIDIA, the solution is called DLSS (Deep Learning Super Samling), Intel calls it XeSS (XeSS Super Sampling) and AMD calls it FidelityFX Super Resolution (FSR). However, … (Weiterlesen...) Antworten\n Like Beteilige dich an der Diskussion in der Basic Tutorials Community → Contact us via one of our social media channels to send us your comments or suggestions for improvement. We look forward to your message! "
}