{
    "title": "Intel Arc A310 vs NVIDIA RTX A1000 Laptop GPU vs Intel Arc A350M",
    "date": "3/21/2024",
    "url": "https://www.notebookcheck.net/A310-vs-RTX-A1000-Laptop-GPU-vs-A350M_12464_11320_11149.247598.0.html",
    "text": "The Intel Arc A310 is a dedicated entry-level graphics card from Intel for desktops. It is based on the ACM-G11 chip and offers 6 of the 8 Xe cores (96 ALUs), 6 of the 8 ray tracing units, 1.152 MB L1 cache and 4MB L2 cache. The memory interface is 64 bits wide and supports 4GB GDDR6 graphics memory with 15.5 Gbps. The TGP is between 40 and 75 watts depending on the model. \nThe A310 is similar to the mobile Arc A350Mexcept for the higher clock rates of the cores and memory. \nThe ACM-G11 chip is manufactured at TSMC in 6nm (N6 process) and offers 7.2 billion transistors and is 157 mm2 in size. It integrates two media engines for VP9, AVC, HEVC, AV1 8k60 12-bit HDR decoding and 8k 10-bit HDR encoding. The integrated 4 display pipes support 4x 4k120 HDR, HDMI 2.0B, DP 2.0 10G and Adaptive Sync. The Intel Arc A310 is a dedicated entry-level graphics card from Intel for desktops. It is based on the ACM-G11 chip and offers 6 of the 8 Xe cores (96 ALUs), 6 of the 8 ray tracing units, 1.152 MB L1 cache and 4MB L2 cache. The memory interface is 64 bits wide and supports 4GB GDDR6 graphics memory with 15.5 Gbps. The TGP is between 40 and 75 watts depending on the model. The A310 is similar to the mobile Arc A350Mexcept for the higher clock rates of the cores and memory. The ACM-G11 chip is manufactured at TSMC in 6nm (N6 process) and offers 7.2 billion transistors and is 157 mm2 in size. It integrates two media engines for VP9, AVC, HEVC, AV1 8k60 12-bit HDR decoding and 8k 10-bit HDR encoding. The integrated 4 display pipes support 4x 4k120 HDR, HDMI 2.0B, DP 2.0 10G and Adaptive Sync. The NVIDIA RTX A1000 Laptop GPU or A1000 Mobile is a professional graphics card for mobile workstations. It is based on the GA107 Ampere chip and offers a slightly slower performance than the consumer GeForce RTX 3050 Laptop GPU. It offers 2,048 CUDA cores, 16 Raytracing and 64 Tensor cores paired with a 128 Bit memory bus.  It is available in different variants from 35 - 95 Watt (TGP) with different clock speeds (and performance). The GPU supports eDP 1.4b to connect the internal monitor and DisplayPort 1.4 and HDMI 2.1 for external connections. \nThere is no more Max-Q variant (formerly used for the low power variants) but every OEM can choose to implement Max-Q technologies (Dynamic Boost, WhisperMode). \nThe raw performance should be sloghtly slower than GeForce RTX 3050 for laptops at the same TGP level. Both GPUs depend heavily on good cooling and a high TGP for good performance. At a similar power consumption level the RTX A1000 should be clearly faster than the old Quadro T1200.  \nThe GA107 chip offers 2.560 FP32 ALUs of which half can also execute INT32 instructions (i.e. 1,280 INT32 ALUs). With Ampere all shaders could still execute FP32 or INT32 instructions. The raytracing and tensor cores on the chip were also improved according to Nvidia. However, RTX A1000 can only use 2048 CUDA cores. The Ampere chips also include an improved 5th generation video encoder (NVENC for H.264 and H.265) and a 7th generation decoder (for various formats now including AV1). \nThe GA107 chip is manufactured by Samsung in 8nm (8N), which is not quite able to keep up with the 7nm node at TSMC (e.g. used by AMD and also for the professional GA100 Ampere chip). Depending on the TGP, the A1200 can also be used in thin and light laptops (with 35 Watt TGP e.g.). The NVIDIA RTX A1000 Laptop GPU or A1000 Mobile is a professional graphics card for mobile workstations. It is based on the GA107 Ampere chip and offers a slightly slower performance than the consumer GeForce RTX 3050 Laptop GPU. It offers 2,048 CUDA cores, 16 Raytracing and 64 Tensor cores paired with a 128 Bit memory bus.  It is available in different variants from 35 - 95 Watt (TGP) with different clock speeds (and performance). The GPU supports eDP 1.4b to connect the internal monitor and DisplayPort 1.4 and HDMI 2.1 for external connections. There is no more Max-Q variant (formerly used for the low power variants) but every OEM can choose to implement Max-Q technologies (Dynamic Boost, WhisperMode). The raw performance should be sloghtly slower than GeForce RTX 3050 for laptops at the same TGP level. Both GPUs depend heavily on good cooling and a high TGP for good performance. At a similar power consumption level the RTX A1000 should be clearly faster than the old Quadro T1200. The GA107 chip offers 2.560 FP32 ALUs of which half can also execute INT32 instructions (i.e. 1,280 INT32 ALUs). With Ampere all shaders could still execute FP32 or INT32 instructions. The raytracing and tensor cores on the chip were also improved according to Nvidia. However, RTX A1000 can only use 2048 CUDA cores. The Ampere chips also include an improved 5th generation video encoder (NVENC for H.264 and H.265) and a 7th generation decoder (for various formats now including AV1). The GA107 chip is manufactured by Samsung in 8nm (8N), which is not quite able to keep up with the 7nm node at TSMC (e.g. used by AMD and also for the professional GA100 Ampere chip). Depending on the TGP, the A1200 can also be used in thin and light laptops (with 35 Watt TGP e.g.). The Intel Arc A350M is a dedicated mobile entry level graphics card for laptops based on Xe HPG microarchitecture. It uses the ACM-G11 chip and offers 6 of the 8 Xe-cores (95 ALUs), 6 of the 8 ray tracing units and a 64-bit memory bus for 4 GB GDDR6 graphics memory. The chip integrates 7.2 billion transistors and the die measures 157 mm2. \nThe chip also integrates two media engines for VP9, AVC, HEVC, and AV1 8k en- and decoding. The 4 display pipes support up to 4x 4k120 HDR via DMI 2.0B or DisplayPort 2.0 10G.  \nThe A350M is produced in 6nm at TSMC (N6 process) and supports dynamic power share (using Deep Link) with 12th gen Intel CPUs (Alder Lake). The Intel Arc A350M is a dedicated mobile entry level graphics card for laptops based on Xe HPG microarchitecture. It uses the ACM-G11 chip and offers 6 of the 8 Xe-cores (95 ALUs), 6 of the 8 ray tracing units and a 64-bit memory bus for 4 GB GDDR6 graphics memory. The chip integrates 7.2 billion transistors and the die measures 157 mm2. The chip also integrates two media engines for VP9, AVC, HEVC, and AV1 8k en- and decoding. The 4 display pipes support up to 4x 4k120 HDR via DMI 2.0B or DisplayPort 2.0 10G. The A350M is produced in 6nm at TSMC (N6 process) and supports dynamic power share (using Deep Link) with 12th gen Intel CPUs (Alder Lake). The following benchmarks stem from our benchmarks of review laptops. The performance depends on the used graphics memory, clock rate, processor, system settings, drivers, and operating systems. So the results don't have to be representative for all laptops with this GPU. For detailed information on the benchmark results, click on the fps number. Average Gaming 30-70 fps → 100% Average Gaming 30-70 fps → 186% Average Gaming 30-70 fps → 84% For more games that might be playable and a list of all games and graphics cards visit our Gaming List #0 checking url part for id 12464 +0s ... 0s #1 checking url part for id 11320 +0s ... 0s #2 checking url part for id 11149 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:39:02 +0200 +0.001s ... 0.001s #5 composed specs +0.1s ... 0.101s #6 did output specs +0s ... 0.101s #7 start showIntegratedCPUs +0s ... 0.101s #8 getting avg benchmarks for device 12464 +0.049s ... 0.151s #9 got single benchmarks 12464 +0.005s ... 0.156s #10 getting avg benchmarks for device 11320 +0.001s ... 0.158s #11 got single benchmarks 11320 +0.016s ... 0.173s #12 getting avg benchmarks for device 11149 +0.001s ... 0.175s #13 got single benchmarks 11149 +0.01s ... 0.184s #14 got avg benchmarks for devices +0s ... 0.184s #15 min, max, avg, median took s +0.391s ... 0.576s #16 before gaming benchmark output +0s ... 0.576s #17 Got 445 rows for game benchmarks. +0.055s ... 0.631s #18 composed SQL query for gamebenchmarks +0s ... 0.631s #19 got data and put it in $dataArray +0.042s ... 0.673s #20 benchmarks composed for output. +0.141s ... 0.815s #21 calculated avg scores. +0s ... 0.815s #22 return log +0.003s ... 0.817s "
}