{
    "title": "AMD Ryzen Granite Ridge Zen5 Desktop CPUs: Some Specifications and TDP \nExposed",
    "date": "3/28/2024",
    "url": "https://www.guru3d.com/story/amd-ryzen-granite-ridge-zen5-desktop-cpus-some-specifications-and-tdp-exposed/",
    "text": "Published 2024-03-29 09:11 by Hilbert Hagedoorn AMD's upcoming \"Granite Ridge\" desktop CPUs based on the Zen5 architecture were disclosed, according to a report by IT House. The information came to light following a tweet from the user Momomo_US, who shared a photo of a shipping list that included details about the AMD Ryzen Granite Ridge Zen5 desktop CPUs. The document specifies the core counts and categorizes each CPU within the Ryzen Desktop family, indicating the 8-core variant as potentially a higher-tier Ryzen 7 model and the 6-core variant as a mid-range Ryzen 5 model. The 6-core CPU is referred to as the A0 version, while the 8-core CPU is listed as the B0 version. The shipping list reveals two variants of the Granite Ridge CPUs: The first variant, identified as 100-000001404-01, features 8 cores and 16 threads, and is noted to have a Thermal Design Power (TDP) of 170W. This model is anticipated to be part of the Ryzen 7 series. The second variant, with the identifier 100-000001290-21, includes 6 cores and 12 threads, with a TDP of 105W. This CPU is expected to belong to the Ryzen 5 series. These CPUs are likely in the prototype stage, and the TDP values provided may not reflect the final specifications of the retail versions. Sources: momomo_us #1, momomo_us #2 Share this content\n\n\n Twitter\n                                \n\n\n Facebook\n                                \n\n\n Reddit\n                                \n\n\n WhatsApp\n                                \n\n\n Email\n                                \n\n\n Print AMD Zen 5 Mobile Processors Exposed: Ryzen 9050 Strix Point and Ryzen 9055 Fire Range Details Western Digital Launches 24TB WD Red Pro HDD for Enhanced NAS / Enterprise Performance Copyright ©1997-2024 guru3dPowered by Contentteller® CMS System "
}