{
    "title": "Mysterious Huawei CPU test success arise on-line and you might be in for a \nshock — if real, the advancements signify ...",
    "date": "3/2/2024",
    "url": "https://tech-gate.org/2024/03/02/mysterious-huawei-cpu-test-success-arise-on-line-and-you-might-be-in-for-a-shock-if-real-the-advancements-signify-that-huawei-is-not-considerably-driving-amd-epyc-or-intel-xeon/",
    "text": "Switch to the dark mode that's kinder on your eyes at night time. Switch to the light mode that's kinder on your eyes at day time.   Switch to the dark mode that's kinder on your eyes at night time. Switch to the light mode that's kinder on your eyes at day time. by\n\n\nbourbiza mohamed\n\n\nMarch 2, 2024, 1:11 pm \n\n1.2k Views  Benchmark effects for Huawei’s HiSilicon Taishan V120 server CPU have unexpectedly surfaced on-line, revealing a effectiveness surprisingly on par with AMD’s Zen 3 cores from four yrs back. The effects, discovered on Geekbench listed here and listed here, counsel that Huawei’s chip technology may perhaps not be considerably at the rear of major CPU companies, AMD and Intel. As Tom’s Hardware reviews, the Taishan V120 core, from Huawei’s HiSilicon subsidiary, was initially spotted in Huawei’s Kirin 9000s smartphone chip. The new Geekbench 6 outcomes, which were being uploaded a couple of times ago, show that the Taishan V120 main is very likely created on the second-generation 7nm node, as is the situation with the Kirin 9000s chips. The precise CPU product tested continues to be a secret having said that, with the only clue becoming “Huawei Cloud OpenStack Nova” on the benchmark internet pages. This suggests it could be a Kunpeng server CPU, potentially the Kunpeng 930, specified its large solitary-core general performance. The Kunpeng 930 has been relatively elusive considering that its announcement in 2019. A 2021 report speculated a launch that year on TSMC’s 5nm, with the Kunpeng 950 next in 2023 on TSMC’s 3nm node. On the other hand, these options were being probably deserted thanks to Huawei’s ban from production at TSMC. The benchmarks have been operate on a one main, implying that the chip could have been analyzed on a digital device or a related configuration. For that reason, the multi-main rating may not accurately mirror the chip’s in general overall performance. In the one-core rating benchmark, the Taishan V120 CPU scored 1,527, a little at the rear of AMD’s Epyc 7413 at 1,538 and Intel’s Xeon E-2136 at 1,553. It was considerably outperformed by the Epyc 9554, which scored 1,957, and the Xeon w9-3495X, which led the pack with a score of 2,087. As Tom’s Components factors out, with out details on multi-threaded effectiveness, ability intake, and effectiveness, it really is really hard to gauge the competitiveness of Taishan V120 cores. Irrespective of velocity, superior electrical power intake could prevent opportunity users because of to the price tag of energy. Read more on google news See more by\n\n\nbourbiza mohamed\n\n\nMarch 31, 2024, 8:55 am by\n\n\nbourbiza mohamed\n\n\nMarch 31, 2024, 7:43 am by\n\n\nbourbiza mohamed\n\n\nMarch 31, 2024, 7:07 am by\n\n\nbourbiza mohamed\n\n\nMarch 31, 2024, 5:59 am by\n\n\nbourbiza mohamed\n\n\nMarch 31, 2024, 5:58 am by\n\n\nbourbiza mohamed\n\n\nMarch 31, 2024, 4:48 am Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.   Δ by\n\n\nbourbiza mohamed\n\n\nMarch 24, 2024, 6:32 pm by\n\n\nbourbiza mohamed\n\n\nMarch 18, 2024, 12:41 pm by\n\n\nbourbiza mohamed\n\n\nNovember 22, 2023, 6:16 pm by\n\n\nbourbiza mohamed\n\n\nMarch 15, 2024, 9:24 am by\n\n\nbourbiza mohamed\n\n\nMarch 2, 2024, 5:40 am by\n\n\nbourbiza mohamed\n\n\nDecember 1, 2023, 11:06 pm © 2024 by bring the pixel. Remember to change this "
}