{
    "title": "China blocks use of Intel and AMD chips in government computers: report",
    "date": "3/29/2024",
    "url": "https://www.aol.com/finance/china-blocks-intel-amd-chips-172357103.html",
    "text": "Advertisement For premium support please call: China has put in place new guidelines aimed at phasing out U.S.-made microprocessors from Intel and AMD from being used in the government's personal computers and servers, according to a report from the Financial Times on Sunday. The new procurement guidance also looks to bring an end to the use of Microsoft's Windows operating system as well as foreign-made database software on Chinese government devices in favor of domestic options, the report said. Government agencies above the township level have been told to include criteria requiring the use of \"safe and reliable\" processors and operating systems when making purchases, the outlet reported. China's industry ministry issued a statement in late December that included three separate lists of CPUs, operating systems and centralized databases that are deemed \"safe and reliable\" for three years after the publication date – all of which were Chinese companies, a review by Reuters found. INTEL PLANS US BUILDING SPREE THANKS TO BILLIONS IN FEDERAL CHIP SUBSIDIES The announcement comes just days after the U.S. government announced its largest financial award to date under the CHIPS and Science Act, a law that provides federal incentives and subsidies for tech companies to ramp up the production of advanced chips and semiconductors in the U.S. READ ON THE FOX BUSINESS APP The award provided about $20 billion to Intel, including $8.5 billion in direct funding and up to $11 billion in federal loans, as well as an investment tax credit of up to 25% on up to $100 billion in qualified investments. INTEL EMBARKING ON A 'JOURNEY TO REBUILD' US CHIP DOMINATION, CEO SAYS The funding will help Intel build two new factories and modernize an existing facility in Arizona, as well as advance the construction of a leading-edge chip manufacturing project in Ohio that has experienced delays. It will also fund a nearly complete advanced packing facility in New Mexico and allow Intel to expand its research and development facility in Oregon. Intel has pledged to invest $100 billion in the U.S. over five years to expand domestic chipmaking capacity and other capabilities that are critical to economic and national security. Those facilities will also play a role in Intel's efforts to produce cutting-edge artificial intelligence (AI) chips. Intel declined to comment on the report regarding China's move to ban the company's chips. AMD did not immediately respond to a request for comment. Reuters contributed to this report.  Original article source: China blocks use of Intel and AMD chips in government computers: report Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}