{
    "title": null,
    "date": "1/1/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/shipping-records-reveal-potential-existence-of-amd-rx-7800m-other-unreleased-navi-32-gpus",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. 43 AMD Navi GPUs appear under \"Cuarzo (Quartz)\" codenames, and come in \"Cuarzo Rojo\", \"Cuarzo Verde\", and \"Cuarzo Azul\" variations Hardware detective Harukze5179 on Twitter has found, through an investigation of AMD's shipping manifests, the existence of \"AMD Cuarzo\" codenames in Spanish that correspond to Navi 31, 32, and 33 GPUs [h/t VideoCardz]. Many of the GPUs named in these shipping manifests (a total of 43) are already on the market in some form, but some refer to GPUs that don't officially exist yet. For example, under the AMD Navi 32/Cuarzo Verde listings, there are two Cuarzo Verde Mobile listings. Navi 32 is a desktop GPU chip that currently exists in the Radeon Pro W7700, the RX 7700 and 7700 XT, and the RX 7800 XT. A 7800 non-XT doesn't exist, but Navi 32 would be the top candidate for it if it did. These Navi 32 GPUs all fall squarely into the high-end 1080p and entry-level 1440p range, though falter considerably compared to Nvidia AD106 GPUs (RTX 4060 Ti, etc) with ray-tracing effects enabled. In pure rasterization performance, though, the RX 7800 XT can outperform even the RTX 4070. This means if you're willing to make the right compromises to settings, Navi 32 GPUs become incredibly potent for mid-range gaming. Since no Navi 32 GPUs are currently seen in laptops, these shipping manifests refer to a mobile \"Cuarzo Verde (Navi 32)\" GPU that doesn't yet exist. Most speculation seems to point toward this part being for an RX 7800M, though, which would make sense as a move from AMD to stay competitive in laptop graphics. Since the RX 7600M, 7700S, and 7900M already exist, the 7800M or 7700M seem like the most natural gaps for this yet-unannounced GPU to fill. While most seem to lean toward this unreleased laptop GPU being an RX 7800M, the  lack of a 7700M also makes it a likely choice. After all, whispers earlier this year seemed to point toward the existence of both an RX 7800M and an RX 7700M, and an RX 7700M could potentially be a stronger competitive choice for high-value laptops from AMD. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 OpenAI and Microsoft reportedly planning  $100 billion datacenter project for an AI supercomputer By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}