{
    "title": "AMD just did Nvidia a serious favor",
    "date": "1/27/2024",
    "url": "https://www.digitaltrends.com/computing/amd-just-did-nvidia-a-favor/",
    "text": "AMD and Nvidia are always competing when it comes to producing the best graphics card of the year. It’s safe to say that they both always try, but AMD’s latest attempt feels like it may seriously backfire. The new RX 7600 XT feels like an attempt to fix problems with the original RX 7600, but it ends up being something that Nvidia should be sending AMD a fruit basket for. Nvidia’s RTX 40-series is, for the most part, a success. The addition of DLSS 3 made the lower-tier cards really pop, and the flagship RTX 4090 offers a massive generational uplift. But Nvidia made a couple of mistakes with this generation, and surprisingly, AMD repeated them both with the RX 7600 XT. For starters, the value for the money of some RTX 40 graphics cards is pretty terrible. Take the RTX 4080 — that was a $1,200 GPU that should have cost $800 to $900. Nvidia fixed that mistake with the RTX 4080 Super, but that’s an outlier and not the norm. For the most part, Nvidia’s GPUs could stand to be cheaper in this gen, and this is true for GPUs like the RTX 4070 Ti and the RTX 4060 Ti, too. At their current prices, they’re still too expensive. However odd that might sound, the $330 RX 7600 XT suffers from the same predicament. It’s a budget graphics card, to be sure, but that just makes the price tag more noticeable than it would have been on a high-end model. At $60 more than its predecessor, the RX 7600 XT doesn’t really have much of a claim to that kind of increase. It makes sense that AMD would bump up the price a little bit with the XT model, but honestly, even $300 would have felt like a lot given that the GPU offers little to justify the change. That’s the second mistake that AMD has made — the specs of the RX 7600 XT leave something to be desired. It’s essentially the same graphics card as the $270 RX 7600, with the same number of stream multiprocessors (SMs) and compute units (CUs). We’re getting a small boost in the game clock speed and a bump in TDP. More notably, the RX 7600 XT gets twice the memory as its predecessor, going from 8GB to 16GB VRAM. Unfortunately, AMD chose to keep the same narrow 128-bit bus, effectively stifling the card’s bandwidth. This is the same thing that Nvidia’s done with the RTX 4060 Ti. Controversial from the get-go due to the $400 price tag and less-than-impressive performance, the GPU received a second version not long after its launch. It sports the exact same specs, aside from the VRAM, which has gone up from 8GB to 16GB. And, again, that memory is spread across a 128-bit interface. Putting those two blunders together makes for a disappointing card. Instead of ruling the budget segment, the RX 7600 XT only serves to make Nvidia’s mediocre cards look better. We’ve tested the RX 7600 XT extensively and compared it to our benchmarks for some of its rivals. It’s safe to say that AMD has strayed from what worked for it in the past. The RTX 4060 is an obvious example of this. It costs $30 less, but across our entire test suite, it came out to be around 2% faster than the RX 7600 XT on average in 1080p gaming. This is a GPU that was disappointing in its own right, seeing as it couldn’t even keep up with the last-gen RTX 3060 Ti — and it’s not leagues faster than the RTX 3060, either. Putting it at a higher price point is nothing for AMD to be proud of right now. In terms of actual gameplay, the RX 7600 XT is comparable to the RTX 4060 in most titles. However, in some games, the extra VRAM — against all odds — helps it shoot ahead. This includes Red Dead Redemption 2 and The Last of Us Part I. On the other hand, in Resident Evil, the RTX 4060 wins by a decent margin of 125. Moving on to 1440p helps the RX 7600 XT catch up to Nvidia’s RTX 4060. And it still wins in certain games that benefit from the 16GB of memory, but it’s not a victory across the board. If anything, it just proves that the RTX 4060 does a surprisingly decent job with just 8GB of VRAM. Ray tracing is still the Achilles’ heel of AMD GPUs, and although the RX 7600 XT isn’t bad at in this regard, Nvidia does it better. No surprise there, but it (again) makes me wonder what that extra $30 is getting me. Nvidia’s RTX 4060 isn’t the only competitor of the RX 7600 XT, however. This segment is becoming quite crowded, with cards like the RTX 4060 Ti and the Arc A770 all offering similar performance. Even AMD’s last-gen RX 6700 XT is a viable choice, seeing as it only costs around $20 more. It’s no surprise that the RTX 4060 Ti shoots ahead of the other GPUs on the list. Comparing the $400 Nvidia card to the $330 AMD alternative really makes the RTX 4060 Ti look like it’s some sort of a great deal, which — let’s be clear — it isn’t. It’s comparable to the last-gen RTX 3060 Ti in many games, and even when it wins, it doesn’t win by much. Then there’s the 16GB version that sometimes ends up being slower than the 8GB one, and even when it’s not, it’s close to the same. See how similar that situation is to what we’re seeing with AMD here? It’s really like Team Red’s take on the RTX 4060 Ti all over again. The RX 7600 XT also just slightly outpaces Intel’s Arc A770, and that GPU costs $300 to $320 with 16GB VRAM. Intel doesn’t have the same kind of trump card that Nvidia does in this generation, though. Nvidia also provides access to DLSS 3.5. Frame generation can elevate the RTX 4060 to much higher levels of performance, and, while AMD’s rival FSR 3 is an improvement over the previous gens, it barely exists right now. It’s only supported by four games so far. Nvidia’s list is far longer, at around 80 titles, including some of the most popular AAA games out right now. Nvidia’s midrange GPUs in this generation haven’t been too impressive. With mediocre performance gains and inflated prices, the 60-level cards aren’t the go-to options that they once were. The RTX 4070 Super is the first great value/great performance offering in Nvidia’s lineup, and that card is $600. Everything below that price point should be ripe for the picking, and AMD should be dominating those sales. Instead, it’s pushing buyers toward Nvidia. Not every GPU needs to be a masterpiece to be remembered for years like some of the best graphics cards of all time. All AMD had to do to make the RX 7600 XT worthwhile was to price it according to its capabilities. The design choices are questionable, but it wouldd still be a decent alternative to Nvidia’s overpriced GPUs … if only AMD had followed its usual performance-per-dollar strategy. The RX 7800 XT, at $500, is a fantastic deal.  The RX 7600, at $270 and below, is a solid 1080p option. AMD’s claim to fame is usually that it can offer more for less. The RX 7600 XT, while not a bad GPU, makes very little sense to buy over Nvidia’s alternatives. Even if the RTX 4060 (and the Ti versions) is poor value, the RX 7600 XT is just as bad. With similar performance and with no DLSS 3.5 to justify the price hike, all it does is make Nvidia’s “meh” offerings look better than they are in reality. AMD’s claim to fame is usually that it can offer more for less. It also typically offers more VRAM than Nvidia. It’s hard to say why it chose to stray from what worked in the past by overpricing the RX 7600 XT and adding 16GB VRAM without an interface to match. I like to root for the underdog, but I truly can’t see many reasons to buy the RX 7600 XT over an RTX 4060 right now. Unless you specifically only want to play the few games where the 16GB of VRAM will make a massive difference, or need the GPU for memory-intensive tasks, there’s just no point in spending that extra $30. AMD couldn’t have done Nvidia a bigger favor. If you lived through the insanity that was the GPU shortage, you might be tempted by the current prices of graphics cards. Don't be. We just got yet another sign that Nvidia might soon be launching the RTX 40 Super refresh, and with three new GPUs set to come out next month, there might be better options right around the corner that could adjust the entire GPU landscape in terms of pricing. I'm not mad, just disappointed. Nvidia's RTX 4060 Ti has aged like milk, and it just released in May. The card was disappointing when it first released, hamstrung by a memory interface that held it back in games released this year. But it has grown even more stale over the course of the year as some of the best graphics cards, both from the last generation and the current one, have fallen in price. Well, now we've seen it all. You may have heard of dual GPU setups in the past, but combining AMD and Nvidia in the same system? Even if you're using two of the best graphics cards, that's always going to be tricky. However, it's now been done and benchmarked, and the results are shockingly good -- with a few major caveats. QuasarZone took a chance on this, as the outlet itself admits, \"crazy idea,\" and it turned out better than most of us might have expected. The publication combined an Nvidia RTX 4090 with an RX 6600 to try to use both GPUs at once. The goal wasn't just to see whether it was possible for it to work but rather to try the combined power of Nvidia's DLSS 3 and AMD's Fluid Motion Frames (AFMF). The latter is still in the technical preview stage. Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}