{
    "title": null,
    "date": "1/25/2024",
    "url": "https://indianexpress.com/article/technology/gaming/amd-radeon-rx-7600-xt-gpu-launch-price-specs-performance-9126916/",
    "text": "AMD on Wednesday announced its latest graphics card — Radeon RX 7600 XT based on RDNA 3 architecture. The latest high-performance GPU from AMD is said to be capable of handling modern AAA titles at 1080p resolution with ray tracing and can also handle AI-specific tasks and the GPU is priced at $329 (approx Rs 27,347). Now Available: The AMD Radeon RX 7600 XT graphics card, featuring the groundbreaking AMD RDNA™ 3 architecture, delivers ultra-high frame rates for your favorite games. 🔗 Get yours: https://t.co/BnbvAQkP1X pic.twitter.com/aI13lDdC1g — AMD Radeon (@amdradeon) January 24, 2024  AMD compares the performance of the Radeon RX 7600 XT GPU with the NVIDIA GeForce RTX 2060 and claims to offer 1.9x faster gaming and raytracing performance. The graphics card does support all the latest Radeon software technologies such as AMD Fluid Motion Frames (AFMF), which generates additional frames to make the game look smoother. It is also compatible with the AMD HYPR-RX technology to manage the simultaneous interoperation of AMD Fluid Motion Frames, AMD Radeon Super Resolution, and AMD Radeon Boost technologies to deliver a smooth and fast gaming experience. The graphics card comes with 16 GB of video memory with a recommended board power of 190W. The GPU has an HDMI 2.1 port with support for 8K resolution output, and it even has a DisplayPort 2.1, which can drive gaming monitors with a higher refresh rate. The Radeon RX 7600 XT packs 32 compute units, 32 ray accelerators, 64 AI accelerators, and 2048 stream processors. This graphics card can offer over 150fps at 1080p at maximum graphics quality and can deliver over 120fps at 1440p resolution on games that are compatible with the AMD FSR 2 or 3 upscaling technology. AMD’s latest graphics card will be available from board partners like Acer, ASRock, ASUS, Gigabyte, PowerColor, Sapphire and XFX starting today, and it is meant for those, who are planning to build a mid-tier gaming PC.  BSEB will declare the Bihar Board 10th exam results 2024 today at 1:30 pm. Around 16.4 lakh students took the offline exams from February 15 to 23, with strict measures in place to prevent cheating. A press conference will be held at the board's headquarters to announce the toppers' names.    "
}