{
    "title": "AMD's $225 Milestone Ahead (NASDAQ:AMD)",
    "date": "1/19/2024",
    "url": "https://seekingalpha.com/article/4663788-amd-225-milestone-ahead",
    "text": "Just_Super  Just_Super Advanced Micro Devices, Inc. (NASDAQ:AMD) is venturing into the automotive AI market, targeting the rapidly growing sector of AI, infotainment, and autonomous driving systems. With the automotive AI market projected to reach $15 billion by 2030 and an expected annual growth rate of 24% from 2022-2030, AMD's strategic move positions it to capitalize on this expansion by providing scalable, efficient, and advanced technology solutions in the automotive industry. Since our last analysis, which set a target price of $190 for AMD, the stock has shown a remarkable performance, surging nearly 33% and closely approaching our target. AMD's stock price currently faces resistance at $165, reaching this level earlier than anticipated. Our analysis suggests that AMD's stock could reach $225 by the end of 2024. Data by YCharts AMD's expansion into the automotive AI with Versal AI Edge XA adaptive SoC and Ryzen Embedded V2000A Series processor is an important fundamental development. This is a strategic move to target high-growth markets, as automotive is experiencing a vital shift towards advanced technologies like AI, infotainment systems, and autonomous driving (ADAS). The sector is projected to hit $15 billion in market size by 2030. In this context, the Automotive AI market may deliver a CAGR of 24% (2022–2030). Fundamentally, AMD is capitalizing on the demand for advanced automotive applications through Versal AI Edge XA and Ryzen Embedded V2000A. Automotive Artificial Intelligence (AI) Market Report 2023-2030 (ww.precedenceresearch.com) Automotive Artificial Intelligence (AI) Market Report 2023-2030 (ww.precedenceresearch.com) Specifically, the Versal AI Edge XA adaptive System-on-Chips (SoCs) are designed to capture the demand for next-generation automotive systems. These SoCs are equipped with advanced AI engines and can be optimized for many applications, including forward cameras, in-cabin monitoring, LiDAR, 4D radar, surround-view, automated parking, and autonomous driving. The specifications, ranging from 20k look-up tables (LUTs) to 521k LUTs and from 5 Tera Operations per Second (TOPS) to 171 TOPs, highlight the scalability and versatility of the product portfolio. At the ground level, this scalability allows designers to easily port their designs with the same tools, ecosystem, and safety certifications, ensuring flexibility and integration for automotive manufacturers. Regarding competition with Nvidia Corporation (NVDA), scalability is a critical edge. Scalability was the original motive behind Versal AI (before AMD acquired Xilinx) to counter the competition. Versal AI Edge Announcement (www.xilinx.com) Versal AI Edge Announcement (www.xilinx.com) Notably, the Edge AI Platform is a strong moat (offering cost-effectiveness to clients) for AMD in the case of a single architecture. The platform scales from sensor to accelerator, which is not the case with Nvidia's product line, which depends on exclusivity and performance (TOPs). NVIDIA Embedded Systems for Next-Gen Autonomous Machines (www.nvidia.com) NVIDIA Embedded Systems for Next-Gen Autonomous Machines (www.nvidia.com) Furthermore, a notable fundamental is the Versal AI Edge XA SoCs, the first AMD 7nm devices to be auto-qualified for automotive applications. The auto-qualification process itself involves a series of tests and certifications. Auto-qualification at 7nm emphasizes providing advanced and secure solutions for automotive applications where safety is vital. This auto-qualification enhances AMD's competitiveness and reliability in the automotive sector in line with the stringent safety standards required in the industry. Additionally, the optimized transistor geometry achieved with 7nm technology is crucial for packing more computing power into a smaller footprint, a vital consideration in automotive design. In the context of automotive applications, where space constraints, energy efficiency, and reliability are critical, the 7nm process places AMD in a favorable position. This allows for integrating advanced features and capabilities into compact, energy-efficient automotive systems. In short, the Versal AI's scalability and related cost-effectiveness may lead to rapid adaptability in the upcoming years. Based on historical adoption patterns, AMD's top line growth may benefit from the expected growth of the automotive AI market. www.goldmansachs.com www.goldmansachs.com Moreover, the Ryzen Embedded V2000A Series processors are another strategic move to capture the demand for enhancing the digital cockpit experience. In-vehicle experiences are a crucial factor influencing consumer decisions, and AMD is focusing on high-performance processors for automotive digital cockpits. In detail, the automotive digital cockpit holds a range of functions, including infotainment consoles, digital clusters, and passenger displays. Ryzen Embedded V2000A Series processors power these components, improving performance and multitasking capabilities. This move aligns with vehicles increasingly connecting with features such as advanced infotainment and navigation options. Technically, the processors are based on 7nm process technology, coupled with \"Zen 2\" cores and high-performance AMD Radeon Vega 7 graphics. The 7nm process provides improved power efficiency and performance. Hence, these are critical factors in the automotive context, where power consumption and thermal management are crucial. Moreover, the Ryzen Embedded V2000A Series processors provide a PC-like experience in in-vehicle environments. This fundamental strength aligns with consumer expectations for an easy and familiar computing experience during driving. Integrating x86 architecture into auto-qualified processors yields the same performance and capabilities as in home entertainment systems. Overall, these products may provide an edge to AMD in the automotive AI market, similar to its lead in the data center AI market. In the data center market, AMD has already noted positive developments as tech leaders, especially Microsoft Corporation (MSFT) and Meta Platforms (META), two of the largest clients of Nvidia, have signaled a shift towards AMD's Instinct MI300X as a cost-effective alternative to Nvidia's chips (which cost around $40K per chip).  We are seeing very strong demand for our new Instinct MI300 GPUs, which are the highest-performance accelerators in the world for generative AI. We're now expecting that the data center accelerator TAM will grow more than 70% annually over the next four years to over $400 billion in 2027. CEO: Dr. Lisa Su. AMD is significantly emphasizing the anticipated growth in its data center GPU segment. The company projects that data center GPU revenue will be approximately $400 million in Q4 and is expected to surpass $2 billion in 2024. This projection is based on the progress made in the data center GPU business, particularly with introducing the Instinct MI300 accelerators. MI300 is potentially becoming the fastest product to ramp to $1 billion in sales in AMD's history. Interestingly, the entire growth projection for data center GPU revenue appears to hinge on the progress of the MI300 accelerators. To support prolonged and significant progress in the data center GPU business, AMD lacks a diversified portfolio approach to capture market share from Nvidia. Therefore, it raises concerns about the company's capability to shield itself from shifts in market demand for specific types of GPUs and an edgy product launch from Nvidia or Intel. Over the long term, AMD's stock (~700%) has outperformed the benchmark iShares U.S. Technology ETF (IYW) (~200%) and competitor Intel Corporation (INTC) (~9%). However, the stock underperformed Nvidia (+1350%), which capitalized heavily on AI hype during 2023. However, with the vital announcements in December 2023 and January 2024, AMD is leading the performance with a 34% price return since December 2023 against IYW (6%), Intel (7%), and Nvidia (22%). StockCharts.com | Advanced Financial Charts & Technical Analysis Tools StockCharts.com | Advanced Financial Charts & Technical Analysis Tools Following the previous technical coverage, AMD's stock price is now experiencing resistance at $165, as expected (but sooner). Based on the current analysis, AMD's stock price may reach $225 by the end of 2024. In an optimistic scenario, it may hit $270 projected through higher high momentum and Fibonacci retracement. On the upside, the price may experience resistance near $203. The short-term trend is bullish, as observed in moving average convergence/divergence (MACD). However, the relative strength index (RSI) is over 70, signaling an overbought state of the stock price. Also, a bearish divergence is emerging (not fully developed yet). Therefore, a correction in the coming weeks may lead the stock price towards the pivot level of $129. On the downside, $107 serves as critical mid-term support. However, considering the Fed's rate cuts, resumed supply chain resilience, and improving macroeconomic data (especially inflation), a significant downside is less likely. A correction can be considered an opportunity to accumulate, as the price has completely recovered, leaving 2021's high behind. As a navigator, the performance of a company's top and bottom lines should be monitored. It may continue to influence the stock price and cause large shifts in volatility, which justifies Nvidia's outperformance relative to AMD. Previous coverage Nov 27 (tradingview.com)  AMD's New Price Target (tradingview.com) Previous coverage Nov 27 (tradingview.com) AMD's New Price Target (tradingview.com) AMD's strategic expansion into the automotive AI market with products like Versal AI Edge XA SoC and Ryzen Embedded V2000A processors aligns with the sector's growth potential, projected to reach $15 billion by 2030. This move, coupled with impressive stock performance nearing a $190 target and the potential to hit $225 by 2024, highlights AMD's market strength. However, its heavy reliance on data center GPUs, especially the Instinct MI300, underscores the need for portfolio diversification to remain competitive against rivals like Nvidia and Intel. Overall, AMD shows promising growth and adaptability in key technology sectors. Author of Yiazou Capital Research Unlock your investment potential through deep business analysis. I am the founder of Yiazou Capital Research, a stock-market research platform designed to elevate your due diligence process through in-depth analysis of businesses. I have previously worked for Deloitte and KPMG in external auditing, internal auditing, and consulting. I am a Chartered Certified Accountant and an ACCA Global member, and I hold BSc and MSc degrees from leading UK business schools. In addition to my research platform, I am also the founder of a private business.  This article was written by Yiannis Zourmpanos is a Charter Certified Accountant, a former corporate auditing consultant and a Fellow Member of ACCA Global with both BSc and MSc degrees. He is also a private business owner. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}