{
    "title": null,
    "date": "1/4/2024",
    "url": "https://www.theregister.com/2024/01/04/amd_car_chips/",
    "text": "+Comment Just in time for CES, which has become just as much a car show as an electronics event in recent years, AMD has revealed its newest chips for the automotive market: a processor powered by a nearly five-year-old core architecture, and a 2.5-year-old FPGA with some Arm cores and AI accelerators baked in. Of course, the key element to both chips is they've been qualified against a slew of automotive safety and reliability tests, which AMD explained takes time. As such, it's not all that surprising that the chip designer is using more mature silicon for this role. Digging into the CPU, AMD's Ryzen Embedded V2000A – the \"A\" here presumably standing for automotive – is designed to power automotive infotainment consoles, dashboards, and passenger displays. While the chip may be new to the automotive market, the underlying design has been kicking around for years. Its six Zen 2 cores were introduced alongside the chip biz's 3000-series Ryzen and 2nd-gen Epyc processor families all the way back in 2019. Even so, those cores only made their way into AMD's embedded processor family with the V2000 three and a half years ago. The chip also features AMD's Vega 7 integrated GPU, which is based on a graphics architecture that first showed up in 2017. The standalone processor features seven compute units and will support up to four 4K displays. However, for automakers that need even more displays or faster graphics, the chip can be expanded with much more modern discrete mobile graphics. Despite its age, AMD claims it's \"the first x86 auto-qualified processor family to offer the same PC-like experience\" to drivers. While AMD is targeting infotainment with its Ryzen processor family, it hopes to sell automakers Versal FPGAs to power things like forward-looking cameras, in-cabin monitoring, LiDAR, 4D radar, surround-view, parking, and autonomous driving functionality. Specifically AMD is pushing its Versal AI Edge XA adaptive SoCs, which pack a complement of AI engines alongside FPGA – specifically, four Arm processor cores: two Cortex-A72 and two Cortex-R5. According to AMD, the mix of general purpose, programmable logic, and AI acceleration makes the chips particularly well suited to automotive environments. For example, the Ryzen slinger reckons the AI engines might be used for object detection, while the FPGA handles data conditioning and/or environment characterization. The Versal AI Edge series of chips first showed up in mid 2021, and are also based on a 7nm process node. Looking through the SKU list we see the part numbers align with AMD's previously announced Versa AI Edge products, albeit with an \"XA\" prefix and slightly different performance figures. According to AMD, the automotive variant will be available in a variety of SKUs with between 20,000 and 512,000 lookup tables, and AI engines capable of crunching anywhere from 5-171 TOPS (Tera Operations Per Second) of what appears to be Int8. This range is to account for the variety of autonomous vehicle capabilities. AMD explains that some automakers may prefer a disaggregated approach, dedicating one SoC per sensor or group of sensors. Meanwhile, others may want a single higher performance chip to handle the majority of sensor processing. The new chips are slated to start rolling out to automakers early this year, with Tesla – a long-time AMD partner – among the first to adopt the tech. While neither AMD nor its Xilinx division are strangers to the automotive market, it's becoming an increasingly competitive space as autonomous driving capabilities see wider adoption. Nearly every major chipmaker has a leg – wheel? – in this race, and many are claiming higher performance or greater degrees of integration than AMD. This may have something to with the fact that most of AMD's competitors in this space aren't just certifying existing products for use in automotive environments – they're building dedicated silicon. Qualcomm's latest chips are arguably more sophisticated than AMD's. Qualy's Snapdragon Ride Flex, announced at CES last year, was designed to address both ADAS and infotainment in a single chip. That part is also built on a much more modern 4nm process node and, last we heard, the chip is due to enter production any day now. Then there's Nvidia, which is also developing GPU accelerated SoCs for ADAS and electronic control units. Revealed at Nvidia's fall GTC event in 2022, Drive Thor is slated to deliver up to 2,000 TOPS of inferencing performance. Much like Qualcomm's Ride Flex chips, Nvidia's next-gen autonomous vehicle computer system is designed to unify the litany of computer systems into a single centralized platform. Unfortunately, Nvidia's Drive Thor parts aren't quite ready just yet. While announced in late 2022, the Hopper-based chip isn't slated to launch until 2025. Nonetheless Nvidia's Drive Orin platform, launched in 2019, offers higher, top-line performance, at least on paper, than AMD's latest offering at 253 TOPS. However, Intel's autonomous driving offshoot Mobileye insists more TOPS isn't strictly necessary to achieve high levels of autonomous driving functionality. Chipzilla's upcoming EyeQ Ultra chips, due out in 2025, are slated to deliver 176 TOPS – roughly on par with AMD's Versal SoCs today. Which chipmaker will ultimately come out ahead remains to be seen. However, looking at each vendor's financial reports shows there's plenty of money to be had. While AMD doesn't break out automotive revenues, Qualcomm, Mobileye, and Nvidia do – and they're are on the rise. While automotive remains a relatively small part of Qualcomm's $30 billion in annual revenues, it's one of its fastest growing verticals. In fiscal year 2023, Qualcomm's automotive division netted $1.87 billion – up 24 percent from $1.5 billion the year prior. In a preliminary financial disclosure for fiscal year 2023 published Thursday, Mobileye projected revenues of roughly $2 billion. Meanwhile, Nvidia's fiscal 2023 earnings report showed automotive revenues growing 60 percent to $903 million, and we expect that number to rise when it releases its fiscal 2024 earnings early this month. ® Send us news The Register   Biting the hand that feeds IT Copyright. All rights reserved © 1998–2024 "
}