{
    "title": "AMD beats Intel in mobile gaming despite new and refreshed CPUs — Ryzen 9 \n7945HX3D prevails over the Core i9 ...",
    "date": "1/13/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/amd-beats-intel-in-mobile-gaming-despite-new-and-refreshed-cpus",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Intel's new Raptor Lake Refresh chip barely qualifies as a refreshed CPU Notebookcheck reviewed Intel's new Core i9-14900HX (Raptor Lake Refresh) mobile CPU and found its performance underwhelming in synthetic and gaming benchmarks. The chip performs decently in single-core applications, but the 14900HX showed lackluster gains in gaming workloads. The laptop review outlet found that Intel's previous generation parts are just as good for gaming. AMD's Ryzen 9 7945HX3D counterpart was far superior in the same area — sporting slightly higher FPS while consuming far less power. For testing, the publication used a Schenker XMG Neo 17 2024 engineering sample gaming laptop, powered by a 24-core (8+16) Intel Core i9-14900HX featuring a max turbo clock of 5.8 GHz, RTX 4090 laptop GPU, and 32GB of DDR5-5600 memory. In Cinebench R23, the 24-core Core i9-14900HX scored 2,232 points in the single-core test and 23,336 points in the multi-core test. In the single-core test, the Core i9-14900HX was able to dominate the rest of the field, easily beating chips like the Ryzen 9 7945HX and its X3D sibling by up to 13% and slightly outperforming its 13th Gen predecessors like the Core i9-13980HX and Core i9-13950HX by up to 6%. But that's where the fun ends for the Core i9-14900HX. Several notebooks outperformed the Core i9-14900HX's multi-core R23 result. The Ryzen 9 7945HX, Ryzen 9 7945HX3D, Core i9-13980HX, and Core i9-13950HX all outperformed the new Raptor Lake Refresh chip by up to 7%, even though the Core i9-14900HX has more cores than the Ryzen 9 parts. As previously stated, the Core i9-14900HX failed to (outright) beat its predecessors in gaming notebooks and AMD's latest Zen 4-based Ryzen 9 CPUs. In the CPU test for 3DMark TimeSpy, the Core i9-14900HX was defeated by the Core i9-13980HX by a couple of percentage points. But on the flip side, it did outperform AMD's Ryzen 9 7945HX and Intel's less powerful 13th Gen i9 SKUs. However, in real games like Shadow of the Tomb Raider, the Ryzen 9 7945HX3D returned on top, beating the Core i9 14900HX by a healthy 13%. Surprisingly, the Core i9-13900HX, Core i9-13950HX, and Ryzen 97945HX also won the Core i9-14900HX, anywhere between 5% and 8%. Notebookcheck also tested The Witcher 3, which showed even less favor towards Intel's new Raptor Lake Refresh flagship mobile CPU. The news outlet also benchmarked power efficiency, and it found that the Core i9-14900HX delivered underwhelming power efficiency in Cinebench R23's multi-core benchmark, worse than even Intel's previous generation Core i9-13980HX. The Core i9-14900HX scored 145 points per watt, while the last-gen Core i9-13980HX scored 160.9 points. AMD's Ryzen 9 7945HX took second place in Notebookcheck's list, scoring 207 points per watt. At the top was Apple's M3 Max 16 core chip, which beat every other chip by a landslide, featuring a score of 306 points per watt. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Notebookcheck's review reveals that Intel's new Core i9-14900HX is an underwhelming chip, providing lackluster performance. Performance is boosted by higher power limits, keeping its efficiency poor. Performance could be rectified in other laptop chassis with superior cooling and power delivery systems, but generally, the 14900HX barely qualifies as a refreshed product. Aaron Klotz is a freelance writer for Tom’s Hardware US, covering news topics related to computer hardware such as CPUs, and graphics cards. AMD 170W Granite Ridge Zen 5 CPUs and 128W Strix Point APUs revealed in shipping manifest — 16-core 'Fire Range' mobile CPUs also coming AMD says the UCIe universal chiplet interface will create a whole ecosystem — custom multi-chiplet designs are the future Mini-ITX board transformed into a Mini-ITX Laptop with a battery and 32GB of memory By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}