{
    "title": "Is AMD Stock a Buy Now?",
    "date": "1/14/2024",
    "url": "https://www.fool.com/investing/2024/01/14/is-amd-stock-a-buy-now/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Advanced Micro Devices (AMD 0.50%) stock has rallied hard over the past year, vaulting 127% even though the chipmaker's revenue and earnings shrank in recent quarters due to weakness in the personal computer market. This may lead one to wonder if buying AMD is a good idea at this point considering its expensive valuation. After all, AMD's price-to-sales multiple has increased over the past year while its top line has headed south. Meanwhile, the consensus of Wall Street analysts estimates that AMD's earnings will drop 31% for 2023 to $2.40 per share. Savvy investors, however, should consider looking past these recent results as there are two big catalysts that could supercharge AMD in 2024 and beyond.  AMD Revenue (TTM) data by YCharts. The decline in PC sales weighed heavily on AMD's performance in 2023, but that problem looks set to disappear in the new year. Researchers at Canalys are forecasting an 8% jump in PC sales in 2024 following 2023's 12.4% decline. This will be a big tailwind for AMD's client CPU (central processing unit) business, which relies on sales of PCs, and which took a big hit in 2023. AMD's client revenue fell by 40% year over year in the first nine months of 2023. That segment produced 19% of the company's top line, which explains why AMD's total revenue in the first three quarters of 2023 fell 8% year over year to $16.5 billion. Weak demand for PCs led to an oversupply of the types of computer processors that AMD sells, which is why the company resorted to offering discounts in a bid to move more units. This weighed on the margins and shrunk AMD's earnings. Specifically, AMD generated an operating loss of $101 million from the client business in the first nine months of 2023 as compared to an operating profit of $1.34 billion in the same period in 2022. The good news is that AMD's client segment revenue has started growing once again as the oversupply is over, and PC manufacturers are buying CPUs to prepare for the anticipated jump in demand next year. In Q3, AMD's client revenue rose 42% year over year to $1.45 billion. The segment also posted an operating profit of $140 million as compared to an operating loss of $26 million in the year-ago period. So the expected sharp turnaround in the PC market this year should help lift AMD out of its rut. The growing pipeline of customers for its artificial intelligence (AI) chips will be another key growth driver. Big players including Meta Platforms, OpenAI, Oracle, and Microsoft recently said that they will be deploying AMD's flagship MI300X AI accelerators. The chipmaker expects its AI chips to generate at least $2 billion in revenue in 2024. While that may not seem like much considering the massive amount of revenue that rival Nvidia is generating from AI chips, investors should note that AMD's sales into this market could be greater than what the company is forecasting right now. For instance, AMD has forecast that it will report $400 million in Q4 revenue from its data center GPU (graphics processing unit) business. So the $2 billion annual revenue forecast for the data center GPU business for 2024 would mean that AMD's quarterly revenue run rate from that segment is set to pick up to $500 million. But at the same time, one shouldn't forget that AMD is likely to get its hands on a big chunk of AI chip supply from its foundry partner, which may lead to even stronger growth in the data center GPU business. Citing industry sources, the Taiwan-based daily newspaper DigiTimes points out that AMD could ship 400,000 AI GPUs in 2024. AMD hasn't revealed the pricing of its AI processors yet, but it could price it aggressively to win market share from Nvidia, which sells its flagship H100 processors for $40,000 on average. Assuming AMD decides to undercut Nvidia and offers its AI GPU at $30,000, it could generate $12 billion in revenue from the data center GPU segment. So it won't be surprising to see AMD growing at a much faster pace than analysts are expecting in 2024 and beyond. As the following table suggests, AMD's top and bottom lines are set to return to solid growth in 2024 followed by another robust year in 2025. Year Revenue estimate (in $billion) Year-over-year change (%) Earnings per share estimate Year-over-year change (%) 2023 $22.7 -4% $2.65 -24% 2024 $26.5 17% $3.83 45% 2025 $31 17% $5.16 35% Source: YCharts and Yahoo! Finance This explains why the company's forward earnings and sales multiples are at comparatively attractive levels when compared to the trailing multiples mentioned earlier in the article.  AMD PS Ratio (Forward 1y) data by YCharts. The market could further reward the acceleration in AMD's growth, especially considering its big addressable opportunity in the AI chip market. As such, savvy investors looking to buy growth stocks to capitalize on the accelerating adoption of AI and the resurgence of the PC market should consider adding AMD to their portfolios before it soars further. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Meta Platforms, Microsoft, Nvidia, and Oracle. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}