{
    "title": "AMD Zen 6 “Ryzen” CPUs Reportedly Codenamed Medusa, Feature 2.5D \nInterconnect With Increased Bandwidth",
    "date": "1/6/2024",
    "url": "https://wccftech.com/amd-zen-6-ryzen-cpus-codenamed-medusa-2-5d-interconnect-increased-bandwidth/",
    "text": "AMD's next-gen Zen 6 CPUs for clients which include Ryzen chips will reportedly be labeled under the \"Medusa\" codename. Based on information shared by @Olrak29_, it looks like AMD has finalized the codename for its client desktop CPUs based on the next-gen Zen 6 architecture. The upcoming Zen 5 desktop CPU lineup will fall under the Granite Ridge codename while the Zen 6 desktop CPU lineup will feature the Medusa codename. These chips aren't expected to arrive until late 2025 / early 2026 so it will be some time before AMD officially starts sharing information on them as even Zen 5 isn't detailed much (officially). Medusa is the codename of Zen 6 client — Everest (@Olrak29_) January 4, 2024  In addition to the codename, it also looks like AMD's Zen 6 client CPUs, or Medusa, will be utilizing a brand new interconnect based around a 2.5D chiplet design. This design is said to allow for higher chip-to-chip bandwidth so that the Zen 6 CCDs can communicate faster through each CCD and also with the IOD. Yes, I have teased this before... Medusa will use 2.5D interconnect with a much higher bandwidth https://t.co/G8Ep211iBr — Everest (@Olrak29_) January 5, 2024  A die representation was showcased using a Navi 31 GPU with the two MCD stacks representing the dual CCDs and the small portion of the GCD representing the IOD. This might hint that the Zen 6 \"Ryzen\" CPUs might once again adopt a dual CCD chiplet design with a single IO die. The IOD might get bigger to incorporate next-gen technologies but we can't say for sure right now. Some additional details pointed out are that Medusa CPUs (Ryzen Zen 6 Desktop) will not be stacking the CCDs on top of the IOD due to higher costs associated with such designs. AMD might experiment with these designs in the future as they did with 3D V-Cache stacking on Ryzen 5000 chips and further matured it with the Ryzen 7000 SKUs. Based on previous information, the AMD Zen 6 core architecture is codenamed \"Morpheus\" and is going to launch by 2025-2026. With the launch of Zen 5 all set for 2024, we can expect the company to start sharing more info on its next-gen Zen 6 architecture and the respective products once they are done with the upcoming releases.  Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}