{
    "title": "AMD's barnstorming Ryzen 9 5950X processor is now better than half price",
    "date": "1/26/2024",
    "url": "https://www.club386.com/amds-barnstorming-ryzen-9-5950x-processor-is-now-better-than-half-price/",
    "text": "The best AM4 chips still make for a potent upgrade. It’s been a whole lot of fun hearing about readers’ CPU choices in this week’s QOTW. Turns out a lot of folk put their faith in AMD’s Ryzen 5000 Series, and with good reason. Despite the launch of a newer generation, AM4 chips continue to offer excellent performance and rock-solid reliability on a tried-and-trusted platform. Falling prices only enhance that appeal, and after last year’s scorching-hot deals, we’re now starting to find select CPUs are returning to must-have territory. AMD Ryzen 9 5950X “16 Cores. 0 Compromises. One processor that can game as well as it creates.” We earn a commission if you make a purchase, at no additional cost to you. The pick of the bunch naturally has to be former flagship, AMD Ryzen 9 5950X. Despite having launched back in 2020, the 16-core, 32-thread chip remains a powerhouse by any meaningful metric. It is no coincidence Club386 employs this very CPU in our present test rigs, which are still going strong. Better yet, while the all-conquering Ryzen originally fetched $799, it’s now on offer at Amazon for an all-time-low of $365 while stocks last. Comfortably better than half price and outstanding bang for buck. UK pricing of £369 is nearly as good as it gets, too. AMD Ryzen 9 5900X “AMD Ryzen 9 5900X series desktop processors come with 12 cores to power through gaming, streaming and more.” We earn a commission if you make a purchase, at no additional cost to you. Tempted to jump on one last upgrade for your trusty AM4 machine? 5950X is the all-singing, all-dancing choice, yet it’s worth pointing out Ryzen 9 5900X as an alternative. AMD’s 12-core, 24-thread part is no slouch and has dropped to £260 in the UK; that’s very close to the lowest it has ever been. A worthy alternative to the popular 5800X3D, especially if you lean more towards productivity than gaming. Hard to argue with either choice and it’s clear to see why AM4 remains such a strong proposition for DIY builders. Here’s hoping AM5 longevity lives up to these lofty standards. We’ll keep a close eye on any further CPU price drops in the months ahead, but don’t expect Ryzen 5000 Series to go much lower. Follow on Twitter or Facebook to keep up to date with the latest deals, and subscribe to our free weekly newsletter to be kept abreast of all the latest developments in the world of tech. AIO\nAlder Lake\nAMD\nAOC\nApple\nArc\nASRock\nAsus\nBusiness\nCES\nchassis\nCooler\ncooling\nCorsair\nCPU\nDDR5\ndeals\nDrivers\ngaming\nGeForce\nGigabyte\nGPU\nhandheld\nIntel\nKeyboard\nLaptop\nM.2\nmemory\nMicrosoft\nmods\nmonitor\nMotherboard\nMSI\nNvidia\nPlayStation\nPSU\nRadeon\nRTX\nRTX 40-series\nRyzen\nSamsung\nSony\nSSD\nWindows 11\nXbox About | Contact | Editorial Policies | News Tip Advertise | Privacy | Newsletter | Donate "
}