{
    "title": "AMD Ryzen 7 8700G Review: Most Powerful Integrated Graphics",
    "date": "1/29/2024",
    "url": "https://www.techspot.com/review/2796-amd-ryzen-8700g/",
    "text": "The Ryzen 7 8700G is a Zen 4, Ryzen 7000-class processor that also includes a Radeon 700M GPU on the same chip. The integrated graphics portion is based on the RDNA 3 architecture, using up to 12 compute units, AMD says these iGPUs will be powerful enough to play pretty much any PC game at 1080p. As of writing, this is the most powerful integrated graphics in a desktop CPU, but can this new APU take on your graphics card? We'll figure that out in this review, but, probably not...  AMD has announced four chips in the Ryzen 8000G series so far. While we'll be looking at the 8700G today, we also have the Ryzen 5 8600G on hand, which we'll review in the coming days. The Ryzen 7 8700G packs 8 cores/16 threads and clocks as high as 5.1 GHz with a 65-watt TDP. It is built using a 4nm process, and the cores are based on the Zen 4 architecture. However, because this is a monolithic design that also includes a reasonably large GPU, some aspects like cache capacity have been reduced compared to the standard Ryzen 7000 series. For instance, the 8700G features a 16 MB L3 cache and 8 MB of L2 cache, whereas the Ryzen 7 7700 is equipped with a much larger 32 MB L3 cache, but the L2 capacity is the same 8 MB. The Ryzen 7 7700 includes an RDNA 2 GPU with just 2 CUs and a boost clock of 2.2 GHz, while the 8700G is armed with the Radeon 780M, a 12 CU RDNA 3 GPU that clocks as high as 2.9 GHz. Therefore, you can expect significantly more from the 8700G's integrated graphics.  More differences are seen on the PCIe bus: the Ryzen 7700 offers 28 lanes of PCIe 5.0, of which four are reserved for connecting the chipset. The 8700G packs just 20 lanes in total, and they're PCIe 4.0. This means there are a maximum of eight PCIe 4.0 lanes for the primary PCIe slot, whereas the 7700 has 16 PCIe 5.0 lanes. The Ryzen 8700G includes \"Ryzen AI,\" the first dedicated AI engine on a desktop processor. Using AMD's XDNA architecture clocked at 1.6 GHz, this is separate to the CPU and GPU cores we've just looked at, you can call it an NPU \"Neural Processing Unit.\"  How useful you'll find this hardware AI implementation at this point in time is debatable, and because gaming is usually our primary focus, we won't be delving into AI benchmarks just yet. Moreover, anyone interested in AI on a desktop computer would likely purchase a discrete GPU, as they are much more powerful for AI workloads. For testing, we've used the Asus ROG Strix B650-A Gaming WiFi motherboard with beta BIOS 2263. For memory, we've opted for a 32 GB DDR5-6400 CL32 kit of G.Skill's Trident Z5 Neo memory, and the FCLK has been manually set to 2400 MHz. This is due to an issue with the beta BIOS not setting this parameter correctly automatically, but this will be fixed for the public release. Let's go see what the 8700G can do… We'll start with some basic application benchmarks, and first up is Cinebench and its single-core test. Here, the 8700G scores 111 fps, making it 21% faster than the 5700G and just 5% slower than the 7700. However, it was 15% slower than the 14700K.   Now, when measuring multi-core performance, we find that the 8700G is comparable to the 7700. This makes sense as they're both 8-core/16-thread Zen 4 processors, and factors like cache capacity and memory performance only play a very small role in this test. Compared to the 5700G, that's a 37% increase and a massive 144% increase over the Core i3-12100F, which will prove to be a more relevant comparison as we delve into the gaming benchmarks.  Next, we have the 7-Zip File Manager Compression test. Here, the 8700G is 40% faster than the 5700G and just 13% slower than the Ryzen 7 7700.  Then, for decompression, it's just 8% faster than the 5700G and 12% slower than the 7700.  When it comes to Photoshop performance, we're looking at a 34% improvement over the 5700G, marking a significant uplift. Meanwhile, the 8700G was just 6% slower than the 7700.  It's worth noting that the 12100F doesn't have an iGPU, so for these application benchmarks, it's paired with the Radeon RX 6600. Interestingly, the Core i3 and Radeon GPU cost slightly less than the 8700G. This poses an issue for AMD's new APU, as Premiere does utilize GPU acceleration. As a result, the more affordable Core i3 + RX 6600 combination is 86% faster in this test. Time to look at gaming performance, and we're starting with the integrated graphics because this is what makes the 8700G special. For all these benchmarks, we're looking testing at 1080p low-quality setting gaming as this is integrated graphics after all.  First up is Baldur's Gate 3, where the 8700G was good for 49 fps on average. This is impressive compared to the likes of the 5700G and standard processors such as the Core i7-14700K and Ryzen 7 7700. When compared to AMD's previous 8-core APU, the 8700G is 145% faster, which is not just a significant performance uplift but also the difference between unplayable and playable.  Next, we have Counter-Strike 2, which is possible to play using an iGPU. The 5700G, for example, is good for 61 fps on average, though the 1% lows aren't great. The 8700G, however, is 95% faster when comparing the average frame rate, and with 119 fps on average, the game is very playable. It might not be suitable for competitive gaming, but it's definitely playable.  It's a similar story with Fortnite. Compared to the 5700G, the 8700G offers a 78% performance boost, averaging an impressive 132 fps. The game ran surprisingly well. Again, this isn't good enough for competitive gamers, but it's more than adequate for casual play.  As expected, more demanding games like Cyberpunk 2077: Phantom Liberty are a stretch, but with 41 fps on average and 1% lows of 30 fps, the game is playable. That's significantly more than what can be said for the 5700G.  F1 2023 ran really well with the 8700G, outputting 125 fps on average, which is a 123% uplift from the 5700G. It's also a world of difference when compared to the 14700K and 7700.  In Spider-Man Remastered, the 8700G delivers a smooth, playable experience with 68 fps on average. This makes it more than twice as fast as the 5700G, which managed just 32 fps on average.  Like Cyberpunk 2077, Ratchet & Clank: Rift Apart is a bit much even for the 8700G, especially for 60 fps gaming. However, for those satisfied with 30 fps, it works. This is more than can be said for the 5700G and anything slower, which is basically everything else.  Finally, we have Call of Duty: Modern Warfare III, where the 8700G can output over 60 fps, averaging 74 fps. That's an incredible improvement over the 5700G, tripling the frame rate, and more importantly, allowing gamers to actually play the game using an iGPU. Before we look at discrete GPU benchmarks, let's take a look at memory scaling performance. For testing, we used a DDR5-6400 memory kit at a 1:1 ratio with a 2400 MHz FCLK. This isn't necessarily the optimal configuration, though AMD claims all CPUs will be capable of achieving this specification. AMD also notes that most CPUs will achieve DDR5-7200 using a 1:2 ratio, which can be beneficial. This is important because memory bandwidth is crucial for iGPU performance, so the priorities here differ from those of a Ryzen 7000 series processor, where you'd typically prioritize latency. Also, because the 8000 series APUs use a monolithic die, they will default to a higher clocked FCLK. This change is due to the absence of a GMI (Global Memory Interconnect) in the monolithic design, as opposed to the chiplet approach. Whereas Ryzen 7000 tries to default to 2000 MHz, the 8000 series APUs aim for 2400 MHz. With all of this in mind, we're going to run a few different configurations, including a 1:2 configuration using DDR5-7200.  Starting with Fortnite, we find that using 7200 memory boosts performance by a further 4%, which, while not groundbreaking, is still additional performance. It's also worth noting that the official memory spec for the 8700G is DDR5-5200, and using 5200 spec memory saw performance decline by 15%.  Moving on to F1 2023, we find this title to be less memory sensitive, only gaining an additional 2% in performance using DDR5-7200, or losing 8% with DDR5-5200.  Spider-Man Remastered shows that DDR5-7200 isn't always faster, as in this example, performance declined, dropping a frame when compared to the 6400 configuration. We also observed a significant 22% reduction in performance when using the official 5200 memory spec. So far we've seen how the 8700G and its integrated graphics compare to other processors with iGPUs. But how does it stack up against a really bad discrete graphics card, like the Radeon 6500 XT? We're about to find out. Keep in mind the 6500 XT costs $140 right now. The 8700G is comparable to the 6500 XT using PCIe 3.0 with a processor like the 5700G in Baldur's Gate 3. It's quite astonishing just how poorly the 6500 XT performs with the 5700G in this title, using the low-quality preset at 1080p.  However, if you pair the 6500 XT with a PCIe 4.0 enabled configuration, it's around 45% faster, as we saw when pairing it with the 8700G. Yet, it's about 70% faster when paired with the Ryzen 7 7700, which is less than ideal for the 8700G.  The Counter-Strike 2 results are quite striking. Here, the 5700G armed with the 6500 XT is more than twice as fast as the 8700G's integrated GPU. That's concerning because the combined cost of the 5700G and the 6500 XT is less than the 8700G. We'll discuss this further soon.  Testing in Fortnite shows the 6500 XT to be at least 58% faster than the 8700G, and up to 74% faster with processors like the Ryzen 7 7700 or Core i7-14700K. Remember, the 6500 XT is considered a lower-tier graphics card.  The Cyberpunk 2077: Phantom Liberty results are quite revealing, highlighting the 6500 XT's limitations. Using PCI Express 3.0 with the 5700G, we're looking at 33 fps on average, making the discrete GPU slower than the iGPU of the 8700G. Then, with PCIe 4.0 enabled, the 6500 XT just manages to edge out the 8700G's iGPU, showing weak performance overall.  A similar trend is seen in F1 2023. The iGPU of the 8700G can outperform the 6500 XT when the Radeon GPU is limited to PCIe 3.0 with a processor like the 5700G. But when paired with the Core i3-12100F, it's only 8% faster, though we are somewhat CPU limited here as the Ryzen 7 7700 shows up to a 34% increase.  The Spider-Man Remastered results are intriguing. Again, PCIe 3.0 severely limits the 6500 XT, reducing it to just 46 fps on average when paired with the 5700G. Interestingly, the 8700G delivered similar performance using either its iGPU or the 6500 XT, in fact, performance was slightly better with the iGPU. It wasn't until we paired the 6500 XT with high-end desktop CPUs that it could outperform the 8700G's iGPU.  In Ratchet & Clank: Rift Apart, the 6500 XT also struggled with PCIe 3.0, achieving only 30 fps on average with the 5700G. Even with PCIe 4.0, it was only slightly faster than the 8700G's iGPU.  Finally, for Call of Duty: Modern Warfare III, the 8700G matched the 6500 XT when paired with most processors. The results with the 14700K don't seem consistent, as it shouldn't be much faster than the Ryzen 7 7700. We suspect this may be due to a Resizable BAR issue, but that requires further investigation. It's not crucial for this content, but it is certainly intriguing. Enough messing around, now it's time to see what we can do with $330, the price of the 8700G. For example, if we buy the Core i3-12100F for $100 and pair it with a $200 Radeon RX 6600, are we getting a better experience? Let's find out…  For testing, we've included a few GPU configurations, one of which features the 7900 XTX to see how fast these CPUs really are. As you can see, when maxed out, the 8700G is 17% faster than the 12100F, or 35% faster when comparing 1% lows. Technically, it's the better gaming CPU, but that's no surprise since it costs three times more. However, the problem for the 8700G, and the reason why it ultimately makes little to no sense for gaming, is this: the Core i3-12100F paired with the Radeon RX 6600, a combo that's 127% faster in Baldur's Gate 3. This is a best-case scenario for the APU. If we were to increase the quality settings, the RX 6600 would still render over 60 fps while the 8700G would struggle significantly.  In Counter-Strike 2, using the 7900 XTX, we see that the 8700G is 30% more powerful than the Core i3 in this title. However, comparing $300 combinations, the Core i3-12100F/RX 6600 combo is 113% faster, and fast enough for competitive gameplay.  The situation is similar in Fortnite. Again, the 8700G is 30% faster than the Core i3 when paired with the 7900 XTX. However, comparing its iGPU performance to the RX 6600 combo, the Core i3 is an astonishing 182% faster, rendering 372 fps compared to 132 fps.  Cyberpunk 2077: Phantom Liberty, being more GPU limited, shows the 8700G as 19% faster than the Core i3 when pairing both processors with the 7900 XTX. But comparing the $300 combos, the Core i3 with the RX 6600 offers 124% more performance, rendering 92 fps compared to just 41 fps.  The Core i3-12100F performs very well in F1 2023, allowing for 333 fps to be rendered when using the 7900 XTX, making the 8700G just 7% faster. The Core i3 + RX 6600 combo significantly outperforms the 8700G and its iGPU, providing a 154% performance uplift.  With ray tracing disabled, Spider-Man Remastered isn't a very CPU-demanding game, and as a result, the Core i3-12100F matches the 8700G when paired with a high-end GPU like the 7900 XTX. Comparing the Core i3 with the RX 6600, we find it's 113% faster than the 8700G and its iGPU, and the Core i3 combo actually costs a little less.  Ratchet & Clank: Rift Apart also isn't very CPU-demanding, so the Core i3 matches the 8700G when equipped with a high-end GPU. Again, for those with around $300 to spend on a CPU and GPU combo, the 8700G doesn't make sense as the Core i3/RX 6600 combo is 141% faster, offering a significantly more enjoyable gaming experience with 94 fps on average.  Finally, in Call of Duty: Modern Warfare III, the 8700G is 56% faster than the 12100F when paired with the 7900 XTX. However, comparing the $300 budget combos, the Core i3 still wins, delivering more than twice the performance with 154 fps on average.  Bottom line, if you're spending $330 on a CPU for gaming, the 8700G is not a good option. The standard Ryzen 7700 was, on average, 26% faster in our testing when using the 7900 XTX. Admittedly, we're using low-quality settings for continuity across the range of testing for this review, but even with ultra settings and features like ray tracing, the larger L3 cache of the 7700 will yield better performance. Here's a quick look at power consumption. At idle, the 8700G system consumed 41 watts. Then, with a single-core load, the total system draw hit 79 watts, and for an all-core workload, it went as high as 131 watts.  As for gaming in Spider-Man, we observed a total load of 148 watts, so it's clear this is a very low-powered combo. We've got to admit, we're still not entirely sure who the 8700G is for. It may be carrying the most powerful integrated graphics in a desktop processor, but that doesn't mean it brings good value for end users. The Ryzen 7 8700G is not exactly affordable at $330, and at that price, it's not the best value combination of CPU and GPU hardware. Sure, in a single package, what the 8700G delivers as an all-in-one solution is impressive, but unless you specifically require your desktop CPU and GPU integrated into a single solution, it doesn't make sense.  For ultra mini-PCs, this processor can certainly enable next-level performance, but beyond that niche use case, we don't see its appeal. This certainly isn't a mainstream part, simply because there are better alternatives. If you're after strong CPU performance for gaming, the 7800X3D will be much faster for a small $70 premium, or as we saw with the 7900 XTX, the Ryzen 7 7700 can be significantly faster for the same price. So, in what use case does the 8700G make sense?  If it's for general computing, then the 8700G is overkill, and if it's for gaming, there are significantly better hardware combinations available for the same price, or even less. For instance, the Core i3-12100F and Radeon RX 6600 can deliver over twice the gaming performance as shown in our benchmarks. The Core i3-12100F combo is also superior for video production work, given how heavily GPU-accelerated those workloads are now. So, while the 8700G is technically impressive, at $330 it's not going to appeal to the vast majority of consumers. Our focus is on gaming, and we can confidently say that the 8700G is not a good investment for gaming.  For those of you who want to jump on the AM5 platform, consider getting a Ryzen 5 7600 for $230 and pairing it with a Radeon RX 6600 or better. For a total of $430, your experience is going to be significantly better. It's a 30% premium for ~150% greater performance. The idea of a gaming APU for budget users always sounds great, but in practice, they're just never fast enough. More affordable discrete combos always deliver significantly better performance, and we don't expect this to change any time soon. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}