{
    "title": "Intel Core Ultra 7 Meteor Lake vs. AMD Ryzen Z1 Extreme Performance",
    "date": "1/7/2024",
    "url": "https://www.phoronix.com/review/z1-extreme-meteorlake",
    "text": "In recent days there have been leaks about an MSI \"CLAW\" gaming handheld device set to be announced this coming week at CES in Las Vegas. Making this gaming handheld device interesting is that unlike the Valve Steam Deck and ASUS ROG Ally or Legion Go, it's expected to be the first handheld featuring an Intel Meteor Lake SoC. In particular, the recently launched Intel Core Ultra 7 155H. For those curious about what the performance is likely to roughly be in comparison to the AMD Ryzen Z1 Extreme, here are some benchmarks looking at the performance of these competing SoCs.  The Intel Core Ultra 7 155H is what i've been testing over the past few weeks within the Acer Swift Go 14. The Arc Graphics with the Intel Core Ultra 7 have been great and the part I've been most impressed by along with the upgraded power efficiency of Meteor Lake. The integrated Arc Graphics are a big upgrade over prior generations while the CPU performance hasn't been quite as exciting in raw performance terms.  In any event with my Meteor Lake benchmarking I hadn't run any comparison benchmarks against the AMD Ryzen Z1 Extreme that powers the likes of the ASUS ROG Ally. But given the recent MSI CLAW handheld console leaks, I decided to run some Intel Core Ultra 7 155H versus AMD Ryzen Z1 Extreme Linux benchmarks to see how the graphics/system performance and performance-per-Watt will roughly compete. The ASUS ROG Ally was benchmarked both in its default (balanced) ACPI Platform Profile as well as the performance platform profile. The Meteor Lake benchmarks continued to be done from the Acer laptop given the hardware availability and the Ryzen Z1 Extreme from the ASUS ROG Ally. Both devices were tested on Ubuntu 23.10 with the Linux 6.7 Git kernel and Mesa 24.0-devel for looking at the very latest Linux performance capabilities of both competing SoCs. This testing is just intended as a quick weekend article for looking at roughly how the Intel Core Ultra 7 Meteor Lake can compete (or not) with the AMD Ryzen Z1 Extreme. More tests if/when getting my hands on the MSI CLAW or other Meteor Lake powered consoles. Expect more news this coming week at CES. Phoronix Premium allows ad-free access to the site, multi-page articles on a single page, and other features while supporting this site's continued operations. The mission at Phoronix since 2004 has centered around enriching the Linux hardware experience. In addition to supporting our site through advertisements, you can help by subscribing to Phoronix Premium. You can also contribute to Phoronix through a PayPal tip or tip via Stripe.  Legal Disclaimer, Privacy Policy, Cookies | Privacy Manager | Contact Copyright © 2004 - 2024 by Phoronix Media. All trademarks used are properties of their respective owners. All rights reserved. "
}