{
    "title": "Age-related macular degeneration is on the rise. What to know",
    "date": "1/11/2024",
    "url": "https://www.medicalnewstoday.com/articles/age-related-macular-degeneration-expected-to-affect-288-million-people-by-2040",
    "text": "The number of people worldwide affected by age-related macular degeneration is expected to rise significantly during the next 20 years, according to a review published in the Journal of the American Medical Association (JAMA). Researchers looked at previous research on narrative reviews about macular degeneration published between 2018 and 2023 and identified 1,072 articles. They included 58 articles in their reviews. The researchers determined that age-related macular degeneration affects approximately 20 million people in the United States and 196 million people worldwide. They said they expect the disease to increase to 288 million globally by 2040. One expert, however, said the condition may not actually be increasing. “I don’t think it is on the rise. I think we are diagnosing it more. We have better tools for diagnosing so we can diagnose more often and earlier. Both are positives for patients,” Dr. Talia Kaden, an ophthalmologist at Northwell Health in New York who was not involved in the review, told Medical News Today. She added the higher numbers might actually be a good trend. “Diagnosing macular degeneration earlier means better outcomes. The better your vision is at the start of treatment, the better it is after treatment,” Kaden said. Age-related macular degeneration (AMD) is the leading cause of severe vision impairment in older populations. AMD occurs when extracellular deposits accumulate in the outer retina, leading to photoreceptor degeneration and loss of central vision. It is a progressive disease that affects the macula – the retina’s central portion responsible for sharp vision. People may not experience symptoms in the early and intermediate stages. However, people who have progressed to the later stages can experience serious vision loss. The disease is the leading cause of vision loss in people over 55 and is responsible for 6% to 9% of cases of legal blindness worldwide. Many people indicate they have trouble reading and recognizing faces. An early symptom is difficulty performing tasks in areas with low light or contrast. “The first symptom is a distortion of a straight line,” said Kaden. “If you look at a door or window frame and the straight lines are distorted, you should make an appointment with your eye doctor. If you have questions, eye doctors typically have tools that can help you.” Today, there is equipment that is effective at diagnosis. “Optical coherence tomography (OCT) – an imaging test that produces detailed images of the retina – is the gold standard of diagnosis,” said Dr. Yasha Modi, an associate professor in the Department of Ophthalmology at NYU Grossman School of Medicine who also was not involved in the review. “It should be included as a standard part of eye exams. Early diagnosis is essential for effective treatment,” he told Medical News Today. Nutritional supplements can sometimes decrease progression to late-stage AMD. Supplements can include: A comparison found that people taking supplements that contained the above nutrients had a 20% probability of progressive to late-stage AMD compared to a 28% probability for those taking a placebo. “The AREDS trial showed a benefit only in patients with definite early AMD,” said Dr. Thomas Hanscom, an ophthalmologist and retina specialist at Providence Saint John’s Health Center in California who was not involved in the review. “The average person should not take them.” Modi agreed. “In the absence of symptoms, supplements have not shown any benefit,” he said. “They are helpful once the intermediate stage is reached. Early on, I would be more apt to suggest dietary modifications.” Brigham and Women’s Hospital suggests eating food high in antioxidants and carotenoids. These include: “I think these foods are good for you, but I am not sure about their specific association with macular degeneration,” Kaden said. “I usually tell my patients – what is good for your body is good for your eyes.” Age-related macular degeneration is typically caused by older age, genetic factors, and environmental factors, such as cigarette smoking. Those who maintain good vision in one eye are less likely to report losing their ability to read, drive, recognize faces, or see fine details. “Although the sections on pathophysiology and risk factors are excellent, the review falters on the topics of diagnosis and treatment,” Hanscom told Medical News Today. “Regarding the diagnosis section, fluorescein angiography is no longer the ‘gold standard”‘ in the diagnosis and management of neovascular AMD. OCT and color photography are the standard.” Anti-vascular endothelial growth factor is a first-line treatment for treating and stabilizing wet AMD. The study authors refer to a review completed in 2019 that indicates that anti-VEGF treatment was associated with the ability to see at least 15 letters more than at baseline. In 2023, the Food and Drug Administration (FDA) approved intravitreal injections (pegcetacoplan and avacincaptad pegol) to treat geographic atrophy, the late stage of AMD. The authors note that delays in treatment can lead to visual loss. In a 2012 study of 185 people, scientists found that those with a delay of treatment of 7 weeks or less had a 38% improvement of vision at 6 months compared to those with a delay of 21 weeks while having an improvement of 20%. The authors suggest that, ideally, treatment should begin 14 days after the initial diagnosis. “Some of this information could be considered outdated,” Modi said. “However, this could be due to the rapidly changing treatments. For example, in 2023, the FDA approved two new medications and we are now into third generation medications.” Some newer medications were not mentioned in the review. Dry AMD is the thinning of the macula and is the result of aging. There is no treatment for dry AMD. Suggestions for living with dry AMD include using magnifying lenses, incorporating brighter lights in your home, and using accessibility features on your phone and computer to make them easier to use. For wet AMD, the anti-VEGF injections are first-line treatments. Another treatment is photodynamic therapy. This treatment uses a light-sensitive medicine activated by a specific type of laser. The medicine breaks down blood vessels that are causing vision loss. This treatment is used less commonly, according to the National Eye Institute. “In the not-too-distant past, a macular degeneration diagnosis meant eventual blindness,” Kaden said. “But in the past 10 years, we have new diagnostic tools and new medicines. It no longer means blindness – especially for people who were diagnosed early and receive treatments. It can, however, cause vision impairment severe enough to stop some people from driving, reading, and recognizing faces. “Most patients with AMD retain their ability to drive. With the advancements in the treatment of wet and dry AMD, loss of driving vision should become less common,” said Hanscom. Share this article Researchers say the drug aflibercept performed better in a clinical trial than bevacizumab in helping wean people off treatments for wet age-related… Research in mouse models suggests that having a history of obesity is linked to a higher risk of age-related macular degeneration, which is a common… Scientists have discovered that people with dry eye disease have different bacteria species that make up their eye microbiomes compared to people with… The results of a new trial indicate that castor oil could be a safe and effective natural alternative to treat dry eye disease. OUR BRANDS "
}