{
    "title": "AMD recommends pairing Ryzen 8000G APUs with dual-channel DDR5-6000 memory",
    "date": "1/12/2024",
    "url": "https://www.techspot.com/news/101505-amd-recommends-pairing-ryzen-8000g-apus-dual-channel.html",
    "text": "In brief: AMD at CES this week introduced its Ryzen 8000 G-series APUs for its AM5 platform, and PCWorld recently spent some time with AMD technical marketing manager Donny Woligroski to get an idea of what the what the new chips have to offer and how to get the most out of them. As the executive correctly highlights, integrated GPUs rely entirely on the memory subsystem in your machine meaning your system RAM is also what powers your graphics. Cutting corners here, say with slower memory, could impact day to day tasks as well as in-game performance. That said, Woligroski said going with dual-channel RAM is an absolute must if you want to maximize an 8000 series chip's capabilities. He also recommends going with at least DDR5-6000 as it is still reasonably affordable and you will get the best frame rates with it. Woligroski also spoke on the benefits of an APU in a desktop versus a laptop. Namely, the desktop variant puts a lot more power at your disposal. All of them are 65W TDP parts, and he said that power is pretty linear with graphics in these parts. The desktop platform also provides a lot more headroom with regard to thermals so you will not be constrained by hot temperatures like you would with a laptop (assuming you are running a decent heatsink and good case cooling, of course). AMD introduced four new 8000G chips at CES including the Ryzen 7 8700G, the Ryzen 5 8600G, the Ryzen 5 8500G, and the Ryzen 3 8300G. All but the Ryzen 3 will be available directly to consumers, with the Ryzen 3 being limited to OEM system builders. Pricing starts at $180 for the 8500G and scales up to $230 for the 8600G and $330 for the 8700G, are are schedule to launch on January 31. As for whether or not an 8000 series APU is right for you, you will want to check out Tim's recent write-up for a deeper dive. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}