{
    "title": "Get AMD's former fastest graphics card for $500 at Newegg when you buy an \nopen box model",
    "date": "1/16/2024",
    "url": "https://www.rockpapershotgun.com/get-amds-former-fastest-graphics-card-for-500-at-newegg-when-you-buy-an-open-box-model",
    "text": "The ASRock RX 6900 XT Phantom Gaming D is one of the fastest variants too. AMD's flagship RDNA 2 graphics card, the RX 6900 XT, continues to drop in price over in the US. Right now you can pick this once-fastest-ever Radeon GPU for just $500 when you buy an open box model from Newegg. That's outstanding, given that this card cost twice as much when it debuted in 2020. This is the fancy AsRock Phantom Gaming D model too, which brings a snazzy design and a faster 2340MHz boost clock (versus 2250MHz on the vanilla spec). So is the RX 6900 XT still worth considering in 2024? It's obviously been a while since the card's heyday, but it's still quite a powerful option for anyone that values rasterised performance over RT performance, with a hefty chunk of VRAM - 16GB - as a bonus. That latter point makes it a good choice for a video production machine, or other use cases that use a lot of VRAM like 3D modelling or scientific computing. In terms of missing features, AMD's new FSR 3 frame generation tech works fine on \"last-gen\" RX 6000 graphics cards like the RX 6900 XT - versus DLSS 3 which is only available for the latest series of Nvidia GPUs. Similarly, AMD's Fluid Motion Frames, a kind of more limited but almost universal frame generation tech that doesn't require developer input, was initially announced as being an RX 7000 exclusive but now works on RX 6000 cards too. The only thing you're really missing out on is Anti-Lag+, a latency-reducing feature that is built in by developers versus vanilla Anti-Lag that which works more universally without developer input. The big question here is whether the RX 6900 XT is better than the RX 7800 XT, which is in a similar price and performance class - you can get a very basic reference model for around $510 at Newegg, for instance, which ought to perform within five percent or so of the RX 6900 XT. I'd be tempted to go for the newer 7800 XT, as it's a bit more power-efficient, but both cards are viable options I'd say, with both being capable of performance advantages depending on the game chosen. Rock Paper Shotgun is the home of PC gaming Sign in and join us on our journey to discover strange and compelling PC games. Will Judd Contributor Will Judd is a journeyman from the forges of Digital Foundry, here to spread the good word about hardware deals and StarCraft. Please enable JavaScript to see comments. Deals: \n\n\nMy favourite PC case, the NZXT H5 Flow, is 21% off in the Amazon Spring sale Deals: \n\n\nGet Dragon’s Dogma 2 for free with a Crucial T500 SSD in Ebuyer’s anti-Amazon Spring sale Deals: \n\n\nOne of the best Steam Deck docks is up to 40% off in Amazon’s Spring sale – though it's for Prime members only Deals: \n\n\nTime to upgrade to 4K? With these Amazon Spring sale gaming monitor deals, maybe Deals: \n\n\nAmazon’s Spring sale is making RTX 4060 Ti discounts a little less rare Deals: \n\n\nPsst, one of Intel’s low-key best gaming CPUs is down to £108 for Amazon Spring Deal Days Deals: \n\n\nAmazon Spring Deal Days cuts the fast, roomy Crucial P3 2TB SSD to just £86 Deals: \n\n\nOne of the best cheap microSD cards is even cheaper for Amazon Spring Deal Days Rock Paper Shotgun is owned by Gamer Network Limited, a ReedPop company and subsidiary of Reed Exhibitions Limited. © 2024 Gamer Network Limited, Gateway House, 28 The Quadrant, Richmond, Surrey, TW9 1DN, United Kingdom, registered under company number 03882481. All rights reserved. No part of this website or its content may be reproduced without the copyright owner's permission. "
}