{
    "title": "AMD Ryzen 3 8300G specs, expected price, launch date, and more",
    "date": "1/10/2024",
    "url": "https://www.sportskeeda.com/gaming-tech/amd-ryzen-3-8300g-specs-expected-price-launch-date",
    "text": "The AMD Ryzen 3 8300G is at the bottom of the lineup of new 8000G APUs launched at CES 2024. The chip will be OEM-only, which means only system integrators can pair it with their pre-built systems. DIY builders can't buy it for a custom PC. The 8300G is powered by the latest Zen 4 architecture, has an RDNA 3-based graphics processor, and will be pretty affordable. This makes it a fantastic option for gamers on a strict budget. Let's go over the details of the 8300G APU, including its specs, prices, launch dates, and more in this story. The AMD Ryzen 3 8300G will be a low-power budget APU. It features four cores and eight threads like the Ryzen 3 APUs launched in the past. However, being part of Hawk Point, this processor now features a hybrid architecture. It has one Zen 4 core and three Zen 4c cores. All features of the chip have been severely cut down to help it hit its target price point. For starters, this is the first Zen 4-based processor that doesn't hit 5 GHz clock speeds. It has a base clock of 3.4 GHz and goes up to 4.9 GHz. Moreover, the total (L2+L3) cache has been cut down to just 12 MB from the 22 MB buffer on the higher-end Ryzen 5 8500G and Ryzen 5 8600G. The 8300G bundles the same four-core Radeon 740M graphics processor as found on the 8500G. However, the operating clock speeds have been reduced by 200 MHz to 2600 MHz on this APU. Besides, it is also limited to 65W TDP to go well with budget systems that draw around 100W or less in total. It also doesn't have an APU, unlike the costlier Ryzen 7 8700G and the Ryzen 5 8600G. The detailed specs of the chip are as follows: The AMD Ryzen 3 8300G won't be available for purchase in retail stores. The chip is OEM-only, which means only system integrators can buy it from AMD to pair with their pre-built rigs. However, sometime down the line, it will be available for purchase at retail stores. AMD hasn't commented on an official price tag for the chip. Once it hits shelves, we are expecting it to fare for around $129. This is just an educated guess, and the actual price may vary from retailer to retailer. All AMD Ryzen 8000G processors will be available for purchase starting January 31, 2024. Some retailers may start offering the 8300G alongside these products as part of a pre-built on this date. However, the actual date on which you'll be able to purchase just the processor will vary. We will update this article when it becomes available at leading retail stores. Quick Links   "
}