{
    "title": "AMD Ryzen 7 5700 Review: A Scammy CPU?",
    "date": "2/17/2024",
    "url": "https://www.techspot.com/review/2802-amd-ryzen-5700/",
    "text": "In testing the Ryzen 7 5700, we feel we've stumbled upon a product that is borderline scammy, or is at best anti-consumer. But maybe we're overreacting, so let's take a look and see what you think. This is one of the \"new\" AM4 processors AMD has recently released, which of course technically isn't new at all, but rather binned silicon repackaged as a new product. We must admit, AMD caught us off guard with this one. We were excited to learn about the impending release of the Ryzen 7 5700, especially since the 5700X is one of the best value CPUs available right now, certainly for AM4 owners. It has sold for as little as $170, which is an amazing value for a relatively powerful 8-core / 16-thread processor. Thus, our initial assumption was that the 5700 would be a slightly reduced version of the 5700X, with 100-200 MHz trimmed off and a price tag of $150 or less. However, as the saying goes about assumptions, they proved correct.  So, we threw down over $1,000 AUD to buy all the new AM4 processors, including the 5700X3D that we reviewed just recently. Now here's the issue, and to best illustrate the problem, let's go back to the original Ryzen 1000 series. Back in 2017, you could buy X or non-X versions of multiple models, with the only difference being clock speed, although all parts were unlocked. For example, the Ryzen 5 1600X and the 1600 were effectively the same part, as were the Ryzen 7 1700X and 1700.  With the arrival of the Zen+ parts in the Ryzen 2000 series, we observed a similar naming structure; the 2600X and 2600 were the same, with a minor clock speed discrepancy, as was the case for the 2700X and 2700. The Ryzen 3000 series introduced a broader range of models, with a pretty heavy product segmentation along with the growing success of Ryzen. But generally, the same rules applied; for example, the Ryzen 9 3900X and 3900 were the same CPU, with the same core count and cache configuration, the difference being a 300 MHz clock speed advantage for the X variant.  Technically this was true for all retail models, though AMD did release a non-X version of the 3500X into the OEM channel – the Ryzen 3500 – breaking an unwritten rule. Whereas the 3500X came with 32 MB of L3 cache, the non-X version retained the same core configuration and even the same operating frequency, but saw its L3 buffer slashed in half to 16 MB. This model flew under the radar as it was an OEM-only part, meaning we couldn't simply buy it without purchasing an entire system, which we probably would have done if it hadn't been exclusive to Japan. AMD managed to slip this chip past us, which is unfortunate because the 3500 is a highly misleading product. Halving the L3 cache significantly impacts performance, especially for gaming.  Moving to the Ryzen 5000 series, for the most part, things are as they should be. Non-X models such as the Ryzen 5 5600 are the same as their X-variants, but with a 200 MHz reduction in clock speed, resulting in a very minor performance drop. As a result, most opted for the 5600 over the 5600X as it offered basically the same performance for a typical $30 saving, and being unlocked, you could overclock it if you wanted to. But with the recent debut of the Ryzen 7 5700, many might assume the 5700 is to the 5700X what the 5600 is to the 5600X. Sadly, this is far from the truth.  Rather than a slightly reduced 5700X – the 5700 is actually a 5700G – but with the integrated graphics disabled. This means the 32 MB L3 cache of the 5700X has been reduced to 16 MB, a significant reduction that will impact performance. It also lacks PCI Express 4.0 support, limiting PCIe bandwidth to the 3.0 specification, another major downgrade. Now, releasing a 5700G chip without the integrated graphics is perfectly acceptable, but it should be designated the 5700F or perhaps the 5700GF. In any case, it certainly should not be simply called the 5700, as this is incredibly misleading. AMD initially planned to get away with this by selling the 5700 in the OEM market and have been doing so since April 2022, only announcing retail availability last December. We purchased our CPU from PC Case Gear for $270 AUD, which is currently the same price as the 5700X, though the 5700 does include the Wraith Stealth cooler. One might think, \"Okay, no harm done, anyone paying attention would just buy the 5700X if the 5700 is the same price,\" and perhaps that's fair. However, keep in mind the 5700 has just been released, so its pricing is likely to decrease soon, making the 5700 cheaper than the 5700X.  Looking at Newegg for pricing, the Ryzen 5700 is listed at $175, while the 5700X is at $205, offering a 15% discount. This $30 saving is more likely to entice buyers towards the 5700, especially when the real differences between the two are unclear. Anyway, we've established that the Ryzen 5700 and Ryzen 5700X are very different products, despite what one might assume based on their naming. So, how does the 5700 perform? To answer this, we've conducted a series of gaming benchmarks, which we'll briefly present before discussing the 12-game average. Spoiler alert: as mentioned, this chip is merely a 5700G with the iGPU disabled. Diving into the benchmarks and starting with ACC, we observe just how the 5700 lags behind the 5700X and even 6-core models such as the more affordable 5600. In this example, the 5700X is 22% faster than the 5700, indicating that no matter which GPU is used, the 5700 cannot render more than 94 fps in our test.   Next, we examine Assassin's Creed Mirage, where the 5700X is 16% faster than the 5700. However, even the Ryzen 5 5600 outperforms the 5700, albeit marginally in this instance. As expected, once aware of the specifications, the 5700 performs similarly to a 5700G.  The difference narrows in Cyberpunk 2077, yet the 5700X remains 13% faster than the 5700, a more significant margin than one might anticipate based on their model names. For comparison, the 5800X is just 1% faster than the 5700X, with typically only a 1-3% difference observed between X and non-X models.  Similar to what was seen in ACC, the 5700 significantly underperforms compared to the 5700X in Hitman 3, yielding 22% less performance. The Ryzen 5 5600 also proves to be considerably faster, highlighting the importance of the additional L3 cache.  In Hogwarts Legacy, where ray tracing is enabled, every frame is crucial, and the 15% performance increase provided by the 5700X leads to a notably better gaming experience.  The results for Spider-Man Remastered are noteworthy as this game is very sensitive to memory performance, and CPUs that are limited on DDR4 memory heavily rely on cache performance. The 5700X, for instance, is 15% faster than the 5700 in terms of average frame rate, but an impressive 40% faster when comparing 1% lows.  Star Wars Jedi: Survivor, another memory-sensitive game, demonstrates how halving the L3 cache capacity severely impacts 1% lows. In this instance, the 5700X was 14% faster in terms of average frame rate, but 37% faster when comparing 1% lows. At this point, the picture is clear, and there's no need to examine dozens more titles to understand that the Ryzen 5700, when paired with a discrete GPU, essentially matches a 5700G. The 12-game average data shows that, on average, the 5700X is 16% faster than the 5700, or 19% faster when comparing 1% lows. However, in certain cases, this margin can reach as much as 40%.  It's also worth mentioning that for gaming with a discrete GPU, the Ryzen 5 5600, currently available for just $130, offers not only a more affordable option but also superior performance. So there you have it, the most anti-consumer product we've seen from AMD in some time. What do you think? We know some will point to the value of the Ryzen 5700 as some kind of justification for the misleading naming. The 5700 is 15% cheaper than the 5700X at retail in the US, and we found that on average, it's 14% slower for gaming, or 16% slower if you compare 1% lows. In that sense, it's not bad value, though it does drop PCIe 4.0 support, which can be problematic depending on the GPU used. The fact that the Ryzen 5700 isn't bad value, based on current Newegg pricing, is positive. However, the faster Ryzen 5700X has sold for as little as $170 in recent months, so it's not exactly a new price point.  Our main issue is that you're not getting what you might expect based on the name. We've spoken with a few people in the industry, people who is fairly up to speed with these products, and all of them assumed a Ryzen 7 5700 would be a slightly dialed-down version of the 5700X. Some of these people were even planning to sell the 5700. We even bought the 5700 under the same assumption, and although the part has technically existed for years as an OEM-only model, we'd never heard of it until recently when we could actually buy it.  Admittedly, we didn't really care what it was at the time; we just bought it because we knew you'd be interested. But if we had to guess, we would have thought it would be a similar deal to the Ryzen 5600 and 5600X, because that's what we've seen from AMD's Ryzen lineup for 7 years now. Had AMD named this product appropriately, such as the 5700GF for example, then we think it would have been a decent product, at the right price. But as it stands, it's too anti-consumer for our liking, and we recommend you avoid it. The Ryzen 5600 is a better gaming CPU anyway, and it's cheaper. As we've known for a long time now, cache matters more than cores for gaming, at least within reason. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}