{
    "title": null,
    "date": "2/11/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/amd-zen-5-support-arrives-with-five-new-instructions-gnu-compiler-collection-posted",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The AI-focused AVXVNNI instruction stands out. The GNU Compiler Collection has gained support for AMD's upcoming Zen 5 architecture with a new patch, indicating a handful of new instructions will be coming to Zen 5-based chips (via Phoronix). Not only is the update an indication that AMD is steadily preparing Zen 5 for launch, but the particular instructions flag where AMD is seeking to take its brand-new architecture. Interestingly, the compiler update indicates Zen 5 will debut five instructions never-before-seen on Zen-based chips. Four of the instructions have been native to Intel CPUs for a few years now, and one will be coming to the company's Granite Rapids server CPUs sometime shortly, so in a sense AMD is playing catch-up with Intel. That's not entirely unusual, as AMD doesn't seem to prioritize instruction set support as much as Intel, especially with regard to AVX-related instructions. Perhaps the most notable of the five instructions is AVX-VNNI, which Intel first introduced with its 2021 Alder Lake CPUs. VNNI stands for Vector Neural Network Instructions, and it's become increasingly relevant in today's AI-focused environments. AVX-VNNI isn't to be confused with AVX512-VNNI, it is more powerful relative to the banner of AVX512 instructions. Both instructions can perform the same operations, but AVX512-VNNI has access to 512-bit vectors and EVEX extensions for even better performance. Zen 4 already has AVX512-VNNI, so adding support for a weaker version may seem pointless, but Intel did the same thing years ago. The benefit of using the non-512-bit version may be for consumer parts, which could run software that doesn't take advantage of AVX512 the same way data center programs do. In any case, it seems certain that AMD is continuing to focus on AI with its future CPUs (including consumer models), which isn't that surprising. The latest GCC patch isn't the first we've seen that adds support for Zen 5 CPUs. Zen 5 code has been trickling in since July of last year, and there was an update to Linux that added new power management features. For reference, GCC support for Zen 4 was added until after Ryzen 7000 processors had already launched, and although that shouldn't be taken as a sign that Zen 5 is right around the corner, it does probably mean it is launching sometime this year. AMD has hardly talked about Zen 5 thus far, but it may break its silence at its upcoming Computex presentation in May. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Matthew Connatser is a freelancing writer for Tom's Hardware US. He writes articles about CPUs, GPUs, SSDs, and computers in general. Granite Rapids shows up on CPU-Z boasting 80 cores and 672MB of L3 cache Half of Russian-made chips are defective: Baikal struggles to meet Russia's demand GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 By Christopher HarperMarch 28, 2024 By Roshan Ashraf ShaikhMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Anton ShilovMarch 27, 2024 By Aaron KlotzMarch 27, 2024 By Anton ShilovMarch 27, 2024 By Paul AlcornMarch 27, 2024 By Paul AlcornMarch 26, 2024 By Aaron KlotzMarch 26, 2024 By Avram PiltchMarch 26, 2024 By Anton ShilovMarch 26, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}