{
    "title": "Early Intervention is Critical to Saving Sight with Macular Degeneration",
    "date": "2/4/2024",
    "url": "https://www.newswise.com/articles/eyes-on-the-future-amdf-and-tli-partner-to-illuminate-macular-degeneration-awareness-with-patient-story",
    "text": "sign up for the wires and see archived wires Browse experts available to comment on breaking news Request an expert contact, get responses directly to your inbox Find an expert by topic in a comprehensive database A day in the life of Laura Carabello, who has wet AMD in both eyes, but has preserved her vision through early intervention and treatment adherence. Newswise — Northampton, MA – [Feb 4, 2024] – Today, the American Macular Degeneration Foundation (AMDF) and the Thought Leadership & Innovation Foundation (TLI) announce a new strategic partnership aimed at amplifying awareness and understanding of macular degeneration, a leading cause of vision loss in older adults. Kicking off this collaboration is the release of Living with Macular Degeneration: Patient Stories | Laura Carabello: The Benefits of Early Intervention, a short film produced by AMDF featuring TLI Fellow and AMDF patient advocate Laura Carabello. \"This strategic partnership with TLI unlocks a vast potential to reach millions impacted by macular degeneration,\" says Matthew Levine, Director of Grants, Advocacy & Partnerships at AMDF. \"TLI's expertise in thought leadership amplification will strengthen our trusted resources, elevate patient voices, and drive impactful conversations with eye care specialists, researchers, and policymakers.\"Carabello's story offers a window into daily life with macular degeneration and the experience of anti-VEGF treatments. Diagnosed with wet macular degeneration, Laura credits her awareness of her genetic risk with seeking immediate medical attention upon experiencing symptoms, and thereby retaining much of her vision. Her narrative powerfully underscores the importance of early detection of macular degeneration and adherence to treatment plans.Macular degeneration, also known as age-related macular degeneration (AMD), affects central vision, color perception, and fine detail clarity, greatly impacting daily living and independence. Aging, family history, smoking, poor diet, obesity, and high blood pressure are key risk factors. \"This partnership embodies a shared commitment to making a tangible difference in the lives of those living with macular degeneration,\" says Shawn Murphy, vice president, TLI. \"Laura's story is a powerful testament to the power of early intervention, ongoing care, and the transformative potential of effective treatments.\"Together, AMDF and TLI are poised to illuminate a brighter path for individuals facing macular degeneration. Beginning in February, which is AMD Awareness Month, through ongoing collaborative efforts in awareness campaigns, groundbreaking research initiatives, and patient/provider support, they aim to minimize the impact of this condition and safeguard the precious gift of sight.Watch Laura's story in Living with Macular Degeneration: Patient Stories | Laura Carabello here.Learn more about macular degeneration and AMDF's resources: www.macular.orgCheck the 2024 AMD Awareness Month Resource Page throughout the month of February for events, new content releases, and opportunities for action. About The American Macular Degeneration FoundationThe American Macular Degeneration Foundation (macular.org) is a patient-centric foundation that supports potentially game-changing AMD research, education and advocacy in order to improve quality of life and treatment outcomes for all of those affected by AMD.About TLIThe Thought Leadership & Innovation Foundation (TLI) is a not-for-profit organization that works at the nexus of science, technology and public health, innovating for superior prevention, treatment and outcomes for those facing life-altering medical diagnoses.TLI helps patients across the country and around the world find better healthcare outcomes. Visit www.thoughtfoundation.org and follow us on LinkedIn. Newswise — Northampton, MA – [Feb 4, 2024] – Today, the American Macular Degeneration Foundation (AMDF) and the Thought Leadership & Innovation Foundation (TLI) announce a new strategic partnership aimed at amplifying awareness and understanding of macular degeneration, a leading cause of vision loss in older adults. Kicking off this collaboration is the release of Living with Macular Degeneration: Patient Stories | Laura Carabello: The Benefits of Early Intervention, a short film produced by AMDF featuring TLI Fellow and AMDF patient advocate Laura Carabello. \"This strategic partnership with TLI unlocks a vast potential to reach millions impacted by macular degeneration,\" says Matthew Levine, Director of Grants, Advocacy & Partnerships at AMDF. \"TLI's expertise in thought leadership amplification will strengthen our trusted resources, elevate patient voices, and drive impactful conversations with eye care specialists, researchers, and policymakers.\" Carabello's story offers a window into daily life with macular degeneration and the experience of anti-VEGF treatments. Diagnosed with wet macular degeneration, Laura credits her awareness of her genetic risk with seeking immediate medical attention upon experiencing symptoms, and thereby retaining much of her vision. Her narrative powerfully underscores the importance of early detection of macular degeneration and adherence to treatment plans. Macular degeneration, also known as age-related macular degeneration (AMD), affects central vision, color perception, and fine detail clarity, greatly impacting daily living and independence. Aging, family history, smoking, poor diet, obesity, and high blood pressure are key risk factors. \"This partnership embodies a shared commitment to making a tangible difference in the lives of those living with macular degeneration,\" says Shawn Murphy, vice president, TLI. \"Laura's story is a powerful testament to the power of early intervention, ongoing care, and the transformative potential of effective treatments.\" Together, AMDF and TLI are poised to illuminate a brighter path for individuals facing macular degeneration. Beginning in February, which is AMD Awareness Month, through ongoing collaborative efforts in awareness campaigns, groundbreaking research initiatives, and patient/provider support, they aim to minimize the impact of this condition and safeguard the precious gift of sight. The American Macular Degeneration Foundation (macular.org) is a patient-centric foundation that supports potentially game-changing AMD research, education and advocacy in order to improve quality of life and treatment outcomes for all of those affected by AMD. The Thought Leadership & Innovation Foundation (TLI) is a not-for-profit organization that works at the nexus of science, technology and public health, innovating for superior prevention, treatment and outcomes for those facing life-altering medical diagnoses.TLI helps patients across the country and around the world find better healthcare outcomes. Visit www.thoughtfoundation.org and follow us on LinkedIn.  Newswise gives journalists access to the latest news and provides a platform for\nuniversities, institutions, and journalists to spread breaking news to their\naudience. [email protected] Newswise, Inc "
}