{
    "title": "AMD, Amazon succumb to low demand for Ryzen 12-core 7900X3D as price drops \nhard",
    "date": "2/15/2024",
    "url": "https://www.neowin.net/deals/amd-amazon-succumb-to-low-demand-for-ryzen-12-core-7900x3d-as-price-drops-hard/",
    "text": "3 hours ago 3 hours ago 6 hours ago 6 hours ago 3 hours ago 13 hours ago 13 hours ago 19 hours ago Mar 28, 2024 Mar 27, 2024 Mar 26, 2024 Mar 26, 2024 Mar 28, 2024 Mar 28, 2024 Mar 26, 2024 Mar 26, 2024 7 hours ago Mar 30, 2024 Mar 30, 2024 Mar 30, 2024 Mar 25, 2024 Mar 23, 2024 Mar 20, 2024 Mar 17, 2024 Dec 31, 2023 Oct 14, 2023 Apr 11, 2023 Mar 27, 2024 Mar 25, 2024 Mar 10, 2024 Mar 3, 2024 Mar 24, 2024 Mar 21, 2024 Sep 23, 2023 Sep 21, 2023 19 hours ago Mar 29, 2024 Mar 28, 2024 Jun 14, 2003 Feb 23, 2024 Jan 20, 2024 Dec 6, 2023 Jun 6, 2023 Sayan Sen\n\nNeowin\n                ·\n    \n\n    Feb 15, 2024 09:52 EST\n    \n         · Hot! \nwith 8 comments Ever since the launch of the Nvidia RTX 4000 Super cards, prices of mid to high-end GPUs have shown signs of dropping to more affordable levels. Over the last few days, we have had price cuts on the Radeon RX 7900 series, and 7800 series, as well as on Nvidia's 4070 Ti and 4070 as well. Even the newly released RTX 4070 Super has been discounted by $10 and as such it is already under its MSRP value. Meanwhile, on the CPU side, both AMD and Intel have also been offering some very good deals. The Ryzen 9 5950X for example, recently hit its lowest price ever of just $365. Intel, on the other hand, has made a price cut across its 14th Gen desktop lineup it seems as the Core i5-14600K is currently at $300. This looks like a permanent price adjustment from the company.  Coming back to AMD, it looks like we have another price slash today as the 12-core Ryzen 9 7900X3D has now dropped to just $410 (buying link towards the end of the article). The discount makes sense as the 12-core part is neither as good as the 7800X3D or 7950X3D in terms of gaming nor is it much better value as a production or workstation-class product as the non-X3D 7900X. The way AMD has implemented its 3D V-cache on the 7000X3D processors is that while one of the CCDs or Core Complex Dies (that packs up to 8 cores) comprises the V-cache, the other 8-core CCD does not feature this and clocks higher. The 7950X3D has all eight cores in both of its CCDs, meanwhile, the 7800X3D has only one CCD with the eight cores. However, the 7900X3D has six out of the eight cores in each of the two CCDs which gives it 12 cores in total. This is why it is not as good at gaming as the two other Ryzen 7000X3D SKUs, nor is it a good value unit. Thanks to this price drop, the Ryzen 7900X3D makes much more sense. And since it has 12 cores, you also don't need a motherboard with a robust and powerful VRM. Get the Ryzen 7900X3D at the link below: AMD Ryzen™ 9 7900X3D 12-Core, 24-Thread, Boost Clock: Up to 5.6GHz, Base Clock: 4.4GHz, L1 Cache: 768KB, L2 Cache: 12MB, L3 Cache: 128MB, TDP: 120W: $409.99 (Amazon US) If this doesn't interest you, you can also browse through Amazon US, Amazon UK, or Newegg US, to see if you find some great deals that we missed. You can also go visit the Deals section of our articles to see if there's something you fancy. As an Amazon Associate I earn from qualifying purchases. Sayan Sen\n                                                ·\n                    \nMar 20, 2024\n\nwith\n0\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nMar 12, 2024\n\nwith\n0\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nMar 8, 2024\n\nwith\n2\n                            comment\n                                s Fiza Ali\n                                                ·\n                    \nFeb 28, 2024\n\nwith\n4\n                            comment\n                                s Login or Sign Up to read and post a comment. Please enter your reason for reporting this comment. blackview bl8000 horizon forbidden west windows 11 insider preview promo microsoft weekly twirl 158 windows 11 insider preview promo windows 11 moment 5 dragons dogma 2 task manager notepad © Since 2000 Neowin®\n                                    All trademarks mentioned are the property of their respective owners. "
}