{
    "title": "Starfield will get support for AMD FSR 3.0 Frame Generation next week",
    "date": "2/2/2024",
    "url": "https://www.dsogaming.com/news/starfield-will-get-support-for-amd-fsr-3-0-frame-generation-next-week/",
    "text": "Bethesda has just announced that a new beta patch for Starfield will be released next week that will add support for AMD FSR 3.0 Frame Generation. Starfield already supports NVIDIA DLSS 3 Frame Generation. As such, it will be interesting to see whether FSR 3.0 will be able to come close to it. And yes, we’ll benchmark FSR 3.0 once it comes out, and compare it against DLSS 3. We're excited to share that @AMD FSR 3 is coming to @StarfieldGame's Steam Beta next week!#FSR 3 will be available to all PC players later this month ahead of our next scheduled update. pic.twitter.com/LQ1pA8TU78 — Bethesda Game Studios (@BethesdaStudios) February 2, 2024  The first games that supported AMD FSR 3.0 were quite disappointing. Both Forspoken and Immortals of Aveum played awful with it. And while Avatar had a better implementation, it still had major issues. However, things completely changed with Like a Dragon: Infinite Wealth and The Talos Principle 2. In these two games, AMD FSR 3.0 Frame Generation works incredibly well. So, I’m really curious to see whether the FSR 3.0 in Starfield will be as good as in those two games. Before closing, you might be interested in some mods for Starfield. Last month, we talked about one that adds cool quests when you explore new places. There’s also a mod that makes dead bodies move realistically, as well as a mod that aims to overhaul the game’s enemy AI. In September, we shared the Disk Cache Enabler Mod, which helps reduce how much space the game uses on your computer. There’s also a mod that gives characters super realistic eyes. Oh, and if you don’t like the default camera views in dialogue, there’s a mod to disable them. Sprinting Stuttering Fix is another cool mod that stops the annoying stutters when you run. Then, you can grab this mod that makes the game run smoother by fixing a bunch of scripts. And don’t forget these two must-have mods that make the game look and feel better with a new User Interface and cooler Particle Effects. On the other hand, this mod lets you travel between planets in real-time. Oh, and let’s not forget this mod that brings a dynamic weather system into the game, as well as this mod that aims to improve the behavior of NPCs. Finally, here are all the best Starfield mods you can download. Be also sure to read Nick’s review. Stay tuned for more! John is the founder and Editor in Chief at DSOGaming. He is a PC gaming fan and highly supports the modding and indie communities. Before creating DSOGaming, John worked on numerous gaming websites. While he is a die-hard PC gamer, his gaming roots can be found on consoles. John loved – and still does – the 16-bit consoles, and considers SNES to be one of the best consoles. Still, the PC platform won him over consoles. That was mainly due to 3DFX and its iconic dedicated 3D accelerator graphics card, Voodoo 2. John has also written a higher degree thesis on the “The Evolution of PC graphics cards.”\nContact: Email "
}