{
    "title": "4DMT Reports Full Year 2023 Financial Results and Operational Highlights",
    "date": "2/29/2024",
    "url": "https://www.globenewswire.com/en/news-release/2024/02/29/2838382/0/en/4DMT-Reports-Full-Year-2023-Financial-Results-and-Operational-Highlights.html",
    "text": "February 29, 2024 16:05 ET\n\n\r\n            | Source:\r\n            \n4D Molecular Therapeutics, Inc.\n\n\n\n\n\n4D Molecular Therapeutics, Inc. EMERYVILLE, Calif., Feb.  29, 2024  (GLOBE NEWSWIRE) -- 4D Molecular Therapeutics (Nasdaq: FDMT, 4DMT or the Company), a leading clinical-stage genetic medicines company focused on unlocking the full potential of genetic medicines to treat large market diseases, today reported full year 2023 financial results and provided operational highlights. “2023 was a transformative year for 4DMT with incredible progress across our product pipeline and platform in multiple therapeutic areas, especially for our lead program 4D-150 in wet age-related macular degeneration (wet AMD) and diabetic macular edema (DME),” said David Kirn, M.D., Co-founder and Chief Executive Officer of 4DMT. “Robust enrollment ahead of schedule across multiple cohorts in the PRISM clinical trial of patients with wet AMD and the SPECTRA clinical trial of patients with DME have set the stage for multiple important data readouts in 2024, starting with our recent positive interim data at Angiogenesis, Exudation, and Degeneration 2024 Conference in the hardest-to-treat wet AMD patients. As of the most recent data update, 110 patients have been dosed with 4D-150 with no clinically significant inflammation, which continues to build on the emerging profile of 4D-150 as a potentially best-in-class long-acting genetic medicine with the opportunity for broad market adoption. We look forward to further updates in the broad wet AMD population and DME patients in the second half of 2024, setting the stage for our first Phase 3 clinical trial in wet AMD currently expected to initiate in the first quarter of 2025. We also look forward to providing updates on other key programs beyond 4D-150 in 2024, including 4D-175 for geographic atrophy, 4D-710 for cystic fibrosis and 4D-310 for Fabry disease cardiomyopathy. Our recent financing and resulting cash position allows us to execute on our vision of becoming a fully integrated, next-generation genetic medicines company.” Recent Highlights in Large Market Ophthalmology Portfolio Recent Highlights in Pulmonary Portfolio Recent Highlights in Cardiology Portfolio Strategic Agreements & Partnerships Expected Upcoming Milestones Full Year 2023 Financial Results Cash and Cash Equivalents and Marketable Securities: Cash and cash equivalents and marketable securities were $299 million as of December 31, 2023, as compared to $218 million as of December 31, 2022. The net increase in cash was primarily a result of cash inflows from $129 million of net proceeds from our public offering of common stock completed in May, $19 million of net proceeds under our Open Market Sales Agreement, and the $20 million upfront payment in connection with the Astellas License Agreement and was partially offset by cash used in operations. In addition, in February 2024 we completed a public offering of common stock and prefunded warrants that resulted in us receiving net proceeds of approximately $281 million. We currently expect cash and cash equivalents to be sufficient to fund operations into the first half of 2027. R&D Expenses: Research and development expenses were $97.1 million for 2023, as compared to $80.3 million for 2022. This increase was driven by the progression of our existing clinical trials, primarily 4D-150 in wet AMD and DME, along with increased payroll and stock-based compensation expense due to higher headcount. G&A Expenses: General and administrative expenses were $36.5 million for 2023, as compared to $32.9 million for 2022. Net Loss: Net loss was $100.8 million for 2023, as compared to net loss of $107.5 million for 2022. About 4DMT 4DMT is a leading clinical-stage genetic medicines company focused on unlocking the full potential of genetic medicines to treat large market diseases in ophthalmology and pulmonology. 4DMT’s proprietary invention platform, Therapeutic Vector Evolution, combines the power of the Nobel Prize-winning technology, directed evolution, with approximately one billion synthetic AAV capsid-derived sequences to invent customized and evolved vectors for use in our wholly owned and partnered product candidates. Our product design, development, and manufacturing engine helps us efficiently create and advance our diverse product pipeline with the goal of revolutionizing medicine with potential curative therapies for millions of patients. Currently, 4DMT is advancing five clinical-stage and two preclinical product candidates, each tailored to address rare and large market diseases in ophthalmology, pulmonology, and cardiology. In addition, 4DMT is also advancing programs in CNS through a gene editing partnership. 4D Molecular Therapeutics™, 4DMT™, Therapeutic Vector Evolution™, and the 4DMT logo are trademarks of 4DMT. All of our product candidates are in clinical or preclinical development and have not yet been approved for marketing by the FDA or any other regulatory authority. No representation is made as to the safety or effectiveness of our product candidates for the therapeutic uses for which they are being studied. Learn more at www.4DMT.com and follow us on LinkedIn. Forward Looking Statements: This press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended, including, without limitation, implied and express statements regarding the therapeutic potential, and clinical benefits of 4DMT’s product candidates, as well as the plans, announcements and related timing for the clinical development of our clinical and preclinical product candidates, and statements regarding our financial performance, results of operations and anticipated cash runway. The words \"may,\" “might,” \"will,\" \"could,\" \"would,\" \"should,\" \"expect,\" \"plan,\" \"anticipate,\" \"intend,\" \"believe,\" “expect,” \"estimate,\" “seek,” \"predict,\" “future,” \"project,\" \"potential,\" \"continue,\" \"target\" and similar words or expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. Any forward looking statements in this press release are based on management's current expectations and beliefs and are subject to a number of risks, uncertainties and important factors that may cause actual events or results to differ materially from those expressed or implied by any forward-looking statements contained in this press release, including risks and uncertainties that are described in greater detail in the section entitled \"Risk Factors\" in 4D Molecular Therapeutics’ most recent Quarterly Report on Form 10-Q as well as any subsequent filings with the Securities and Exchange Commission. In addition, any forward-looking statements represent 4D Molecular Therapeutics' views only as of today and should not be relied upon as representing its views as of any subsequent date. 4D Molecular Therapeutics explicitly disclaims any obligation to update any forward-looking statements. No representations or warranties (expressed or implied) are made about the accuracy of any such forward looking statements.   Contacts: Media: Katherine SmithInizio Evoke CommsKatherine.Smith@inizioevoke.com Investors: Julian PeiHead of Investor Relations and Corporate CommunicationsInvestor.Relations@4DMT.com  "
}