{
    "title": "Hungarian AKs (Part 2): AMD-65 - the Best Most Hated AK -",
    "date": "2/21/2024",
    "url": "https://www.thefirearmblog.com/blog/2024/02/21/hungarian-aks-part-2-amd-65-best-hated-ak/",
    "text": "Posted February 21, 2024 in AK-47 / AK-74 / Everything AK, Editorial, Machine Guns, Rifles  by Vladimir Onokoy with No CommentsTags: amd 65, amd65, hungarian, hungary In Part 1 of this article, I talked about the first Hungarian AKs, AK-55 and AKM-63. In this article, I want to talk about perhaps the most famous and controversial Hungarian AK – AMD-65. AMD-65 was developed by Hungarian engineer Karoly Zala. The first prototype was ready by March of 1965, and in September of the same year, the factory produced the first batch for trials. Mass production of the gun started in January 1967. The concept, albeit simple, was much ahead of its time. AMD-65 is the first compact AK that was ever designed. 10 years before AKS74U, commonly known in the US as Krink(ov), and almost 30 years before Russian engineers finally developed their own short 7.62×39 Kalashnikov called AK 104. AMD-65, late production with darker plastic parts In fact, the idea of a shortened 7.62×39 AK made so much sense that over time it created a myth of AKMSU which I dissected in one of my previous articles: The legend of AKMSU – a mysterious AK that never was. The name AMD stands for Automata Módosított Desszant (automatic modified desant). “Desant” is a word of Slavic origin that basically means “troops that are deployed via some unusual way” and it is usually translated as “airborne troops”. However, during WW2, the Red Army used “tank desant”, when a bunch of soldiers sat on top of the tank and jumped from it when the time came. So whether you’re airborne “desant”, marine “desant” or airborne “desant”, AMD-65 was the right gun for you. Light and compact, easy to carry, but still very capable. Short guns have their cool factor, so it is not surprising that AMD-65 appeared in so many movies. Sylvester Stallone shooting AMD-65 in the movie Rambo III It was used by Rambo when he helped noble freedom fighters in Afghanistan to repel a foreign invasion (yeah, some movies don’t age well), and by Dolph Lundgren in “Red Scorpion” where he played a Soviet Spectnaz officer. AMD-65 has a 12.7 inch (320 mm) barrel, and such a weird length is easy to explain – it was the shortest that could fit all the original components, so the factory didn’t have to spend a dime on a new gas block or front sight. Apart from “desant”, AMD was used by officers with a special compact 20-round magazine, almost as a PDW (personal defense weapon). In the 80s, the AMD-65 in the Hungarian army was replaced by the more conventional AK-63. It seemed that it was destined to spend its remaining time covered in cosmoline slowly decaying in military warehouses. But life had a different plan for those little guns. Dolph Lundgren in the movie “Red Scorpion”, wreaking havoc in the bar with his AMD-65 New life abroad for AMD-65 In 2005, the Hungarian government sold 45,000 to the Pentagon, so the US Government could arm the Afghan National police. The price was around $300 apiece. Later on, Hungary donated another 39,000 rifles to the US. What they didn’t understand is that most Afghans are exquisite Kalashnikov connoisseurs and only want the best. The situation got so bad that the New York Times published an article by C.J. Chivers: “One Poor Choice in Arming the Afghans, and Its Repercussions” explaining all the issues with AMD-65. He listed five main complaints: AMD-65, late production with darker plastic parts When I read this article, I dismissed those concerns thinking that “the rifle is fine” and that Afghans just love to complain. A few years later I came to Afghanistan and actually learned a whole lot from Afgan armorers, realizing I was dead wrong on both points. In the next part of the article, I want to talk about my personal experiences with AMD-65 and how it was different from the opinions of Afghan police officers. P.S. For the information in this article I want to thank my friend Zoltán Szőrös, the author of the best website about Hungarian AKs https://www.kalasnyikov.hu/ Vladimir Onokoy is a small arms subject matter expert and firearms instructor. Over the years he worked in 20 different countries as a security contractor, armorer, firearms industry sales representative, product manager, and consultant. His articles were published in the Recoil magazine, Small Arms Review, Small Arms Defence Journal, and Silah Report. He also contributed chapters to books from the “Vickers Guide: Kalashnikov” series. ► Email:  machaksilver at gmail dot com.\n► Facebook: https://www.facebook.com/Vladimir-Onokoy-articles-and-videos-about-guns-and-other-unpopular-stuff-107273143980300/\n► Instagram: https://www.instagram.com/vladonokoy/\n► YouTube: https://www.youtube.com/user/machaksilver "
}