{
    "title": "Loongson Confirms Tape-Out of 16-Core 3C6000 CPU For China’s Domestic \nServer Market",
    "date": "2/13/2024",
    "url": "https://wccftech.com/loongson-confirms-tape-out-of-16-core-3c6000-cpu-for-chinas-domestic-server-market/",
    "text": "China's CPU manufacturer, Loongson, has confirmed the successful tape-out of the company's 3C6000 CPU which features 16 cores & 32 threads. Regarding the development of in-house solutions, China is rapidly advancing since the nation has been making decisive efforts in the computing segment. In the midst of it comes Loongson, a popular firm striving to make China a self-sufficient CPU-developing nation. Loongson has reportedly taped out its \"server-focused\" 3C6000 CPU which means that it is indeed ready for industry deployment soon. MyDrivers report that the Loongsoon 3C6000 features a 16 core and 32 thread count and significant generational improvements from the firm's previous 3C5000. Moreover, the processor has seen wider compatibility with the industry's operating systems, such as Windows, which has made the lineup a great option for Chinese consumers, who aren't looking much in terms of performance and prefer opting for something grown on their soil. Loongson says that the Chinese server markets hold immense potential, and the firm is in a great spot to capitalize the most out of it. Loongson's dedication towards its CPU lineup is quite evident here, as the firm, despite being bound by global sanctions and limitations, has brought in decent generational improvements among its SKUs, particularly in the area of IPC performance. The company has plans to offer higher core counts such as 32 core and 64-core designs using the Dragon Chain interconnect in the future. We recently covered the benchmarks of Loongson's 3A6000 CPU, which is designed for the client segment and boasts a quad-core design (4C/8T) and an operating frequency of 2.5 GHz (peak). It disclosed that while the gen-to-gen improvement is vast, it isn't enough to hold up against the current competition, but the performance figures were indeed impressive, considering the firm's track record. In terms of IPC, the chip achieved results on par with current-gen chips from AMD & Intel which is a rather big achievement. News Source: MyDrivers Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}