{
    "title": "AMD Radeon RX 7900 GRE coming to North America next week, new models \nalready listed",
    "date": "2/24/2024",
    "url": "https://videocardz.com/newz/amd-radeon-rx-7900-gre-coming-to-north-america-next-week-new-models-already-listed",
    "text": "AMD brings its first Golden Rabbit Edition GPU to the USA, Canada and other western countries.  As we have exclusively revealed, AMD is now preparing to make a formal launch of Radeon RX 7900 GRE in the western countries. The company will be adding this upper high-end option as a response to the RTX 4070 (Ti) SUPER. The GRE (Golden Rabbit Edition) will finally be available in North America, and not just through system integrators. As shown below, some retailers are starting to list new RX 7900 GRE backorders, with shipments varying between retailers:   RX 7900 GRE in Canada, Source: DirectDial  The RX 7900 GRE serves as a middle ground between Radeon RX 7900 XT and RX 7800 XT. It features Navi 31 XL GPU and 5120 Stream Processors, which is just 5% fewer cores than RX 7900 XT and over 33% more cores than RX 7800 XT. In terms of memory, the card has 16GB GDDR6 capacity, so in that regard, very similar specs to RX 7800 XT. On paper the RX 7900 GRE appears to be an interesting upgrade over RX 7800 XT, but in reality, this model is bottlenecked by its board power of 260 watts, even less than RX 7800 XT of 263W. Perhaps with more custom variants coming, AMD will allow board partners to increase the power. We can now confirm that board partners will be releasing new models based on RX 7900 GRE, some of which were recently spotted in China, others coming exclusively next week. These models include Sapphire RX 7900 GRE PURE, XFX RX 7900 GRE (QICK 319), PowerColor RX 7900 GRE Hellhound and Gigabyte RX 7900 Gaming OC.   PowerColor RX 7900 GRE Hellhound XFX RX 7900 GRE QICK 319, Source: VideoCardz  In total, we have 12 models based on RX 7900 GRE, all of which are either based on RX 7900 XT or RX 7800 XT PCB. However, given the similar power requirements, the coolers are typically borrowed from the Navi 32 model. We put them all together in the chart below:   Sapphire RX 7900 GRE PURE & Gigabyte RX 7900 GRE Gaming OC, Source: VideoCardz  According to rumors, the launch of Radeon RX 7900 GRE should take place on February 27th with formal review embargo limiting a day sooner. This was stated by Moore’s Law is Dead in the recent video. We have confirmed that there is indeed a new wave of reviews coming next week, but it is worth noting that many western media outlets have already reviewed this model upon its release a half a year ago. The new reviews are just a formality. The card recently got a price cut from $649 to $549, which now only applies to system integrators. However, it should also be the MSRP for the DIY launch. We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}