{
    "title": "Legendary Chip Designer, Jim Keller, Believes Sam Altman’s AI Semiconductor \nAmbitions Are Costly",
    "date": "2/18/2024",
    "url": "https://wccftech.com/legendary-chip-designer-jim-keller-believes-sam-altmans-ai-semiconductor-ambitions-are-costly/",
    "text": "The renowned chip design expert Jim Keller has called the \"AI ambitions\" of OpenAI's CEO Sam Altman unnecessary, claiming he can do the same with much less capital. Sam Altman has recently made the headlines, and the reason behind it is quite outrageous since he believes that the semiconductor industry needs him. Sam Altman aims to establish a network of diverse fabrication units by seeking massive funding from global investors. Interestingly, Sam Altman believes that he needs to raise a whopping $8 trillion to fulfill his ambitions, which is a figure that in itself is shocking, and in literal terms, it means combining NVIDIA's market cap by eight times. Considering the fact that Altman is new in the business, I wonder where he gets the idea. I can do it for less than $1T https://t.co/BgWp3OUmRi — Jim Keller (@jimkxa) February 17, 2024  Well, Tenstorrent CTO Jim Keller, who is famous for the work he has done in chip architectures across firms such as AMD and Intel, came on the X to express his \"opinions\" about Sam Altman's shocking ambitions, and he claimed that the same job could be done for less than a trillion dollars. He believes that we could be in a much better position through certain improvements within the supply chain and implementing the generational changes within both hardware and software resources. However, according to him, moving ahead is a difficult task. Tenstorrent is also rapidly working on improving the existing AI-based chip architectures, as the firm recently unveiled a partnership with Samsung Foundry, to develop the next-gen RISC-V-based chiplet, which will utilize Samsung's SF4X process. The firm hasn't made huge strides in the market for now, but based on where they are heading, Tenstorrent could indeed play a vital role in the world of semiconductors, as the firm plans on making advancements within the RISC-V architecture in the form of heterogenous and chiplet designs. Sam Altman's ideas haven't received the welcome he thought they would since every other personality sees his claims as unfeasible. Just recently, NVIDIA's CEO Jensen Huang predicted that the AI-backed data center segment would expand to a $2 trillion market within the next five years and emphasized the fact that improvements in volumes of production aren't simply the way to lead rather it is important to implement architectural changes as well. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}