{
    "title": "Stakes Are High for Regeneron's Eylea HD as Genentech's Vabysmo Continues \nto Gain Momentum, Prompting ...",
    "date": "2/8/2024",
    "url": "https://www.globenewswire.com/fr/news-release/2024/02/08/2826411/0/en/Stakes-Are-High-for-Regeneron-s-Eylea-HD-as-Genentech-s-Vabysmo-Continues-to-Gain-Momentum-Prompting-Doctors-to-Weigh-Their-Options-Between-Two-Industry-Titans-According-to-Spherix.html",
    "text": "08 févr. 2024 15h17 HE\n\n\r\n            | Source:\r\n            \nSpherix Global Insights\n\n\n\n\nSpherix Global Insights Exton, Pennsylvania, Feb.  08, 2024  (GLOBE NEWSWIRE) -- As Age-Related Macular Degeneration (AMD) Awareness Month unfolds, illuminating the visual challenges faced by millions of Americans with AMD, the need for optimal treatment solutions becomes increasingly evident. Wet AMD poses a particularly severe threat to vision, necessitating treatment with biologic therapies administered in four to twelve-week intervals. However, the current treatment landscape often burdens elderly patients with high treatment frequencies, impacting their ability to attend all appointments. Spherix Global Insights conducted an in-depth analysis through its RealTime Dynamix™ report series, delving into the evolving perceptions of ophthalmologists (n=101) regarding approved therapies for wet AMD. In January 2024, ophthalmologists were surveyed on their preferred biologic treatment for wet AMD among other topics. Historically, cost considerations have driven insurers like Medicare and commercial payers to initiate treatment with cheaper, first-generation anti-VEGF biologics for wet AMD patients. However, as ophthalmologists strive to preserve their patients' vision, they frequently transition them to newer-generation anti-VEGF therapies to optimize outcomes. The emergence of newer, more efficacious anti-VEGF biologics arose in 2011 with Regeneron’s Eylea (2mg), followed by Genentech’s Vabysmo more recently in 2022. Regeneron very recently introduced Eylea HD, a higher-dose formulation, with an apparent strategy to switch Eylea 2mg patients to the new version offering greater patient benefit. While these advanced therapies have resulted in better patient outcomes, they come at a higher price. Spherix's latest market tracking data reveals over 80% of ophthalmologists are extremely satisfied with Eylea HD, a satisfaction level bolstered by their extensive experience with its lower-dose form. Yet, satisfaction rates are slightly higher for Vabysmo than Eylea HD. Whereas it took Vabysmo two years on the market to surpass 80% of physicians being highly satisfied, Eylea HD reached that level in just six months post-launch. This indicates a competitive landscape where preferences are nuanced. Ophthalmologists were asked about their preferred biologic treatment for wet AMD, resulting in approximately one in four ophthalmologists selecting Vabysmo compared to Eylea or Eylea HD, marking the first time it has emerged as the top choice in Spherix’s tracking since its launch. In terms of Regeneron’s apparent marketing strategy, it appears that ophthalmologists are primarily prescribing Eylea HD to patients previously using Eylea 2mg, and further they have no intentions of transitioning patients from Vabysmo to Eylea HD. Considering that most AMD patients initially receive early-generation Avastin or Lucentis treatments before switching to Eylea 2mg, it follows that the majority of Vabysmo users have also been switched from Eylea 2mg. It appears Vabysmo may continue to gain market share from the Eylea franchise until Eylea HD is considered by ophthalmologists to be the first biologic used after Avastin/Lucentis. In the very competitive AMD treatment market, it will be paramount to watch the battle between biotechnology titans Genentech and Regeneron play out. However, this dynamic landscape is poised for further disruption as gene therapies from 4D Molecular Therapeutics, AbbVie/RegenxBio and non-injectable therapies from Ocular Therapeutix and others loom on the horizon, potentially reshaping the industry in the next three to five years. Spherix will continue to track the Wet AMD market within our RealTime Dynamix™: Age-Related Macular Degeneration services. Stay up to date on further shifts as new treatments emerge and current treatments expand in the market. RealTime Dynamix™ is an independent service providing strategic guidance through quarterly or semiannual reports, which include market trending and a fresh infusion of event-driven and variable content with each wave. The reports provide an unbiased view of the competitive landscape within rapidly evolving specialty markets, fueled by robust HCP primary research and our in-house team of experts. About Spherix Global Insights Spherix Global Insights is a leading provider of market research, business intelligence and advisory services to the global life sciences industry. The company’s unique service offerings are powered by deep therapeutic knowledge, the Spherix Network specialty physician panel, and commercially relevant analyses to enable strategic decision-making by our valued customers. A trusted advisor and industry thought leader, Spherix Global Insights provides specialized market expertise in six (6) focused therapeutic areas including: dermatology, gastroenterology, nephrology, neurology, rheumatology, and ophthalmology. To learn more about Spherix Global Insights, visit spherixglobalinsights.com or connect through LinkedIn. For more details on Spherix’s primary market research reports and interactive dashboard offerings, visit or register here: https://clientportal.spherixglobalinsights.com NOTICE: All company, brand or product names in this press release are trademarks of their respective holders. The findings and opinions expressed within are based on Spherix Global Insight's analysis and do not imply a relationship with or endorse. "
}