{
    "title": null,
    "date": "2/9/2024",
    "url": "https://gamerant.com/best-motherboards-motherboard/",
    "text": "The motherboard is a core part of any new PC build. Getting the right one is crucial to ensure you have a good experience with your new PC Intel and AMD are both pushing new tech upgrades along with their CPUs including, but not limited to PCI-E 5.0 and DDR5. Both of these require significant chipset upgrades that also double as a requirement for both Intel's 12th, and 13th generation as well as the now-released 14th generation Intel CPUs. AMD's latest Ryzen 7000 series takes a different approach unlike Intel's DDR4 and DDR5 memory motherboard split to concentrate on only DDR5 for its memory needs. This has ushered in a new generation of Intel and AMD motherboards to support said tech upgrades and their newest processors. Intel offers the H610, B660, H670 & Z690 chipsets for the 12th generation and H710, B760, H770 & Z790 chipsets for the 13th generation, which saw refreshes around the same chipsets for the 14th generation. For AMD, the charge is led by the B650, B650E, X670, and X670E with the A620 series catering to budget builds. CPU Support: With Both AMD and Intel's motherboard chipsets getting regular refreshes and the latter's socket regularly changing, it is important to know if the motherboard a user plans to get works with the CPU they want to pair it with. Some motherboards might require a BIOS update; this is something users would want to know since it would limit their need to diagnose issues stemming from a lack of compatibility of a newer processor on a motherboard with an older BIOS version that does not recognize the CPU paired to it. Some motherboards may not get BIOS updates to support the latest generation, making it a good idea to check for compatibility fairly early in build considerations. An example would be Intel's 12th and 13th gen CPUs. While the 12th gen works with both, Intel's 12th and 13th generation motherboards, the 13th gen requires a mandatory BIOS update on most 12th gen motherboards to be detected and run smoothly. The same is true for Intel's 14th-generation CPUs. Memory Support: The first important distinction one needs to make when looking for a new motherboard is if it is DDR4 or DDR5 compatible. While AMD's AM5 socket-based motherboards are only DDR5 and AM4 are only DDR4-based, making this an easier affair, Intel's motherboards for the 12th,13th, and 14th gen offer DDR4 and DDR5 SKUs. While this is a welcome addition for most system builders and enthusiasts, many of whom would like to use cheaper DDR4 memory or repurposed modules from older builds, it does also require knowledge of which motherboard users are getting out of the box. Thankfully DDR5 memory is considerably cheaper now, making a transition to the newer memory modules an easier task than it was previously. Storage And Expansion Options: Modern games require increasingly larger amounts of storage to retain larger game engines and larger game assets as time goes on. This results in significantly larger storage requirements for modern gamers. On the productivity front, the same is true with modern applications often taking up large chunks of space. Given that some users also want a backup drive or secondary storage, it is worth checking out what storage slots a motherboard has and if they are enough for current and future storage needs. Ideally, power users or users in need of storage for gaming or productivity reasons, should want multiple M2 (NVME) slots on their motherboard and possibly SATA slots if they plan to go for hard drives over SSDs. Given that modern SSDs are historically cheap, it does make sense to pick one off shelves (virtually) instead of delaying that purchase. Form Factor: A motherboard's form factor is an important thing to consider since it directly influences, the choice of case, expansion options, and area on a work desk or leg-room depending on where users place their PC. This does directly affect aesthetics and also the cooling options one might have in some cases. Some smaller motherboards have reduced memory slots too, opting for 2 versus the standard 4 DIMMs which could hamper upgrade potential. Ideally, users want an ATX motherboard for most PC cases, but they can also invest in a mATX/ITX case if they want a smaller PC or an EATX case if they want to maximize their build in terms of expansion slots and features. PCI Express Compatibility: It is important to check what PCI-E slots the motherboard has. While PCI-E slots are backward and forward compatible, they can restrict one's ability in some cases to get the most out of their newer SSD drive or graphics cards especially when upgrading down the line. While the highest-end GPUs currently cap out at PCI-E 4.0 x 16 speeds, it can also help to be ready for PCI-E 5.0 speeds at the GPU level to ensure a GPU upgrade next generation is only a graphics card swap away. Price: As motherboards push past a certain configuration, moving from essential requirements to recommended requirements, they start moving into enthusiast territory where they get expensive extremely fast for features that one could consider niche in certain cases. This does result in users looking for budget options in both Intel's 12th and 13th-generation motherboards and AMD's new AM5-based motherboards for their Ryzen 7000 series processors. Many of these options are competitive and offer excellent features and value-added solutions that rival those of their higher-end peers in many cases. Overclocking Support: Most modern motherboards allow for the ability to push accompanying Intel and AMD CPUs and support RAM modules to higher clock speeds but not all of these are created equal. The process of achieving a stable overclock includes a variety of factors, including the hardware being overclocked itself, power delivery mechanisms, and the underlying chipset and BIOS optimizations available at a motherboard level. A general rule of thumb is that higher-end motherboards tend to have better overclocking features, but this can be proven wrong when it comes to certain motherboards that are custom-designed to overclock as well as possible, making it a key factor for power users looking to eke out as much performance as possible from their gaming PCs. Here are some of the best Intel and AMD motherboards handpicked by the team at GameRant to help users make an educated purchase this year: A White Odyssey The ASUS ROG Maximus Z790 Formula is the successor to its well-received Z690-based predecessor, offering a cleaner aesthetic and plenty of upgrades under the hood.With Wi-Fi 7 under the hood in addition to the ability to overclock RAM better than previous models thanks to DIMM Flex as well as a 5Gb Ethernet port in play, the ROG Maximus hits a nice balance between form and function thanks to its excellent OLED display that can be customized using the bundled armory crate software. The ASUS ROG Maximus Z790 Formula is one of the newest Z790 motherboards on offer as multiple generational refreshes continue to show up after Intel's 14th-generation CPUs were unveiled last month. It has the added benefit of supporting all desktop CPUs from the 12th, 13th, and 14th generation out of the box, making it an easy choice for PC builders looking to go for a high-end motherboard that works from the get-go. It offers Wi-Fi 7 compatibility and a 5 gigabit Ethernet port in addition to as many as 5 M2 slots under the hood, allowing users to add as much storage as needed. With a pure white aesthetic in play in addition to an excellent OLED LiveDash display on offer, the Z790 Formula is dressed to impress even as it offers plenty of functionality. Bottom Line: The ASUS ROG Maximus Z790 Formula emerges as one of the most capable and yet most expensive candidates for a new Intel motherboard but backs it with looks, powerful overclocking potential, and plenty of connectivity under the hood to make it an excellent candidate for most premium PC builds. A Masterclass In Features Gigabyte's high-end X670E offers plenty of IO and PCI-E Gen 5 support natively as it aims to couple reliability with value for money in a bid to capture the market with a competitive entry geared towards midrange/high-end users without breaking the bank. The GIGABYTE X670E AORUS Master Motherboard is an excellent X670E chipset-based motherboard that delivers the tall ask of acceptable AM5 performance with plentiful I/O options and premium design and it does so at a relatively large discount over some of its most immediate competitors that have offerings that cost $100 or more above the ask. With an excellent power delivery system that is adequately cooled in tow with SSD slots that also maintain low temperatures, the Gigabyte X670E Aorus Master has users covered on the networking and I/O fronts thanks to plenty of USB ports, M2 slots, and PCI-E 5.0 support in tow. It did have some software issues at launch, but that is somewhat of a standard when one is an early adopter of a new platform like AM5. Multiple BIOS updates later, the X670E Aorus Master has excellent memory compatibility, runs the new X3D processors with ease and offers a set of features that few if any motherboards can beat, and even less so at the price points it competes at. Bottom line: A solid, premium motherboard with plenty of I/O options and networking features, and excellent cooling at a price that seems more affordable than other competitors' offerings as it continues to trade at a sub-10% discount. The MSI PRO Z790-A Wi-Fi Gaming Motherboard is an excellent, well-rounded Z790 motherboard with plenty of connectivity features while supporting Intel's 12th and 13th-generation processors. In addition, it has a decent 16+1+1 phase power delivery system at a price that makes it comparable to Intel's more budget B760 motherboards. While AMD's overclockable chipsets come at a hefty cost, the Z790 chipset motherboards are available at a wide range of prices, targeting every type of consumer. Users don't have to compromise on overclocking anymore, as at a slight price increase, they can get their hands on this amazing motherboard from MSI, which has got almost everything right. The PRO Z790-A WiFi surprisingly boasts an impressive VRM with 16 VCore power phases for high stability during overclocks and gets cooled down by grooved aluminum heatsinks. With plenty of SATA and M.2 connectors, it further provides a much better value compared to the more expensive alternatives and gives 4x PCI-E slots for GPUs and various expansion cards. The EZ Debug LEDs are also available at the top, which has been a hallmark for most MSI motherboards, and they are very handy in times of troubleshooting the root cause of the inability to boot. Connectivity is also decent, which includes three different generations of USB ports and a fast USB Type C Gen 2x2 port to support high bandwidth devices. Bottom line: Instead of going with a B760 chipset, it's recommended to save a little bit for the PRO Z790-A WiFi that unlocks the potential of Intel CPUs and brings twice as much as PCI-E lanes through the chipset. Well-Priced, Feature-Packed The Gigabyte B650 Aorus Elite AX is a high-end motherboard featuring the B650 chipset that allows it to command a much lower price point, closer to AMD's more budget-oriented motherboard lineups. It is a capable entry that also offers a PCI-E Gen 5 M2 slot that should allow access to faster PCI-E 5.0 storage down the line. The GIGABYTE B650 AORUS Elite AX is a capable B650 chipset-based motherboard with an excellent networking stack coupled with decent DDR5 memory in tow on a spacious ATX motherboard. With decent power delivery, 4 RAM slots, and a comprehensive 5-year warranty, it doesn't leave much to ask for, especially from a budget-level gaming motherboard. The B650 Aorus Elite is a complete package and while some might feel that a PCI-E Gen 4.0 X16 slot is dated, it still runs every current-generation graphics card at full capacity currently. It is important to note that the motherboard does come with some issues that require a BIOS update to get sorted, something that some end users might not like in addition to somewhat questionable heatsink placement that can be a bit annoying to handle while fitting in the motherboard in a case. Bottom line: Solid specs, excellent networking, and a decent price, all have users going for the Aorus Elite B650 Motherboard. While it's not perfect, it comes close to taking on most X670 motherboards. Next-Gen Ready Hero The ASUS ROG Maximus Z790 Dark Hero is the latest in a series of well-established Z790 Motherboards in the ROG lineup. It adds native Wi-Fi 7 support as one of the first motherboards in the industry to do so while throwing in better memory overclocking and power delivery.It comes with a bolder aesthetic in addition to cutting down to four available SATA ports from the original Hero with an otherwise identical arsenal as it integrates its additional M2 slots on the board itself, eliminating the need for users to get space for the ROG Hyper M2 card its predecessor uses. The ASUS ROG Maximus Z790 Dark Hero is one of ASUS's latest and greatest Z790-based motherboards as Intel's intentions of keeping the Z790 chipset around for another year become increasingly apparent. It bakes in the M2 slots that the Hero previously used an M2 card for onto the motherboard, throws in better RAM overclockability, and adds Wi-Fi 7 to the mix. Asus also improves the power delivery to 20+1+2 from the 20+1 offered in the Hero as it brands the motherboard ready for \"Intel Core Next-Gen\" CPUs ahead of the 14th generation CPU's release later this month. It does cut corners in other areas though despite clocking in an impressive $100 increase in price. The Dark Hero keeps an identical set of ports on offer to the Hero itself but removes two SATA ports and keeps the Ethernet port on offer limited to 2.5GB/s. While it is noticeably more aesthetically appealing than its predecessor, it does also offer subtle changes under the hood even as it is limited by the Z790's PCI-E 5.0 lanes on offer: The 16 lanes in play are shared between the dual 5.0 GPU slots as well as the first M2 socket meaning that users looking for a next-generation upgrade may have to decide between next-gen storage or GPU if planning to run either at maximum bandwidth at PCI-E 5.0. Bottom Line: All in all, the Z790 Dark Hero is an excellent, albeit even more pricey offering than the Hero it replaces and is expected to be 14th-generation ready out of the box (updates to current motherboards are already available on-site for ASUS) that does limit its upgrades to a mix of subtle under-the-hood tweaks, aesthetic gains and Wi-Fi 7. Overclocking AMD Juggernaut The MSI MEG X670E GODLIKE is MSI's version of what the highest-end AMD motherboard offering should look like. And it does check nearly all of those boxes and then some.The MEG X670E GODLIKE's price however might be too restrictive for most users except overclocking enthusiasts. The MSI MEG X670E GODLIKE Motherboard is one of the most expensive MSI motherboards to date and doubles as one of the most expensive AMD-centric motherboards users can purchase going into 2024. It sports the high-end X670E chipset, an excellent power delivery mechanism for users looking to push their AMD CPU to higher clocks. The Godlike motherboard offers Wi-Fi 6E, and dual Ethernet, with up to 10 gigabit speeds, throwing in an excellent touch screen M-Vision external dashboard into the mix that can be used to control certain motherboard functions or display information as per user needs. The Godlike does fall short in some areas, however. It does not have USB 4 or Thunderbolt 4 support unlike some of its high-end competition and remains priced at what can only be considered a prohibitively high price tag for even a premium gaming motherboard with extras currently. Bottom Line: All in all, the MSI MEG X670E GODLIKE Motherboard is one of the finest in the business even if its price tag pushes it well out of range of most of its competition when it comes to AMD motherboards. It takes its place as similar high-end motherboards such as the ASUS ROG Crosshair X670E Extreme have become notoriously hard to find in the current market and despite its shortcomings, it is the best gaming-centric motherboard users can buy currently. While most barebones motherboards that offer the same socket and CPU compatibility can suffice for entry-level users, they can be important enablers or alternatively limiting factors when it comes to most users if they are not picked based on one's needs. While user needs can vary, they generally revolve around the following: - Longevity of the underlying CPU socket - Expansion slots for storage and additional hardware - Ease and availability of BIOS updates for newer hardware support - Power delivery mechanism for higher-end CPUs (with more power-hungry cores at high clocks) - RGB lighting support - Diagnostic LEDs/on-board displays - Support for newer ports (Thunderbolt 4, USB 3.2 Gen 2x2) AMD's latest Ryzen 7000 and 7000X3D series CPUs and APUs are all compatible with the AM5 socket. Users might need a BIOS update in some cases for their motherboards to recognize new AMD Ryzen 7000X3D CPUs and/or newer APUs when released. PCI-E 5.0 is a relatively newer standard that is backward compatible with PCI-E 4.0; it offers double the bandwidth of its predecessor but has yet to see widespread adoption in 2024 with plenty of PCI-E 5.0 motherboards available but peripherals being much harder to find currently. If users must have the fastest SSD storage possible, it might be a necessary consideration for them; fast PCI-E 5.0 SSDs that exceed PCI-E 4.0 speeds already exist and are sold commercially. There are currently no mainstream GPUs that use PCI-E 5.0-tier bandwidth effectively, making it more of a future-proofing mechanism than an actual requirement for users. The most common motherboard size and/or form factor is the ATX spec which is 305 x 244 mm. (12 x 9.6 inches). Other popular form factors include: EATX (Extended ATX) mATX/μATX/uATX (microATX) mITX (Mini-ITX) We hope you like the items we recommend and discuss! Game Rant has affiliate and sponsored partnerships, so we receive a share of the revenue from some of your purchases. This won’t affect the price you pay and helps us offer the best product recommendations.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Rahim is a Senior Tech/Commerce Writer at Valnet and builds PCs & networking solutions on demand. Whether It's your GPU, CPU, Display, or just an SSD upgrade, expect him to have a well-researched opinion on offer. When he's not helping with tech hardware or writing about it, you can find him playing the latest single-player titles or toying around with Unreal Engine with friends.\n\nInterests: PC Hardware, Final Fantasy, Pokemon, Game Development, The Witcher (not necessarily in that order) Sarfraz is an avid PC enthusiast who has a decade of experience in PC hardware. He has written extensively on all types of consumer PC components and peripherals on Xtremegaminerd since the time when Ray Tracing was non-existent.\n\nHe is not only a veteran in writing comparison and buyer's guides but also excels in reviewing PC hardware. His favorite games include the iconic Prince of Persia Trilogy, Uncharted and Halo series. Here are some of the best gaming CPUs that can be bought without breaking the bank. Logitech produces highly rated peripherals for both work and play. These innovative keyboards deserve special attention from gamers. A new mod for the PSP Go is making a major upgrade to the 15-year-old digital-only handheld console, with an easy to install adjustment. Years after it didn't take off as a revolutionary gaming peripheral, a gamer spots an Xbox Kinect serving a different and useful purpose. An Xbox gamer makes an exciting discovery after getting their hands on a used Xbox 360 console from the mid-2000s. Sony Interactive Entertainment releases a brand-new update for the PS3, a console that the company discontinued nearly eight years ago. "
}