{
    "title": null,
    "date": "3/5/2024",
    "url": "http://www.3dcenter.org/news/die-grafikchip-und-grafikkarten-marktanteile-im-dritten-vierten-quartal-2023",
    "text": "Von Jon Peddie Research kommen die Marktanteile für Grafikchips für Desktop-Grafikkarten für das vierte Quartal 2023, gleichzeitig werden hiermit auch die erst spät nachgereichten (und daher an dieser Stelle leider untergegangenen) Marktanteile für das dritte Quartal eingearbeitet. In diesem halben Jahr hat augenscheinlich eine Rückkehr zu normalen Auslieferungszahlen bei den Grafikchip-Entwicklern stattgefunden (die ausgewerteten Daten beziehen sich auf Absätze von AMD, Intel & nVidia selber, nicht diejenigen des Einzelhandels), nachdem zum Ende des Cryptomining-Hypes wieder einmal zu viel gefertigt bzw. nicht rechtzeitig der Aus-Schalter gefunden wurde. In dessen Folge liefen in der Handelskette die Läger voll und wurde für grob ein Jahr dann sehr unterdurchschnittlich nachgeordert. Von Q3/2022 bis Q2/2023 lagen somit die kumulierten Auslieferungsmengen pro Quartal bei 6-7 Mio. Stück, während sie davor im Cryptomining-Hype bei jeweils über 10 Mio. Stück pro Quartal lagen und in den letzten beiden Quartalen wieder jeweils 9 Mio. Stück erreicht haben. Wie den Verkaufs-Zahlen von vor dem IT-Boom des Jahres 2020 zu entnehmen, ist dies eine vergleichsweise normale Menge, wenn auch nicht besonders hoch angesiedelt. Mit dieser nunmehr abgeschlossenen Lagerbereinigung haben sich auch die Marktanteile der Grafikchip-Entwickler wieder normalisiert, welche im Zuge eben dieser Effekte einige Kapriolen durchgangen sind. Damit ist insbesondere AMDs Berührung mit der 10%-Marke gemeint, welche für AMD sicherlich (psychologisch) schmerzhaft war, jedoch aller Wahrscheinlichkeit eher eine Folge der jeweiligen Lagerbereinigungs-Aktivitäten war. Dafür sprechen insbesondere die übergroße Zugewinne, welche AMD bei den Quartals-Absätzen zum jeweiligen Vorjahreszeitraum hinlegen konnte: Im dritten Quartal +124%, im vierten Quartal +117%. Damit stiegen die AMD-Marktanteile bei Grafikchips für Desktop-Grafikkarten wenigstens wieder auf 17% bzw. 19% – kein Grund zum Jubeln, weil immer noch zu niedrig, um als echter Kontrahent wahrgenommen zu werden, aber immerhin wieder etwas weg von vorgenannter Schreckensmarke. Intel fand bei diskreten Grafikchips für den Desktop-Einsatz hingegen noch weniger statt als in den Vorquartalen, wo Intel vielleicht auch noch den einen oder anderen Projekt-Auftrag realisieren konnte. Nun jedoch steht man mit eine ganze Generation zurückliegenden Grafikchips im Wettbewerb mit zwei langgedienten Platzhirschen – und verkauft dementsprechend homöopathisch. Ins langfristige Bild der AMD- und nVidia-Dominanz ist damit schwerlich einzubrechen, derzeit bleibt Intel in dieser Frage eher nur die Rolle der Rundungsdifferenz. Dies war selbst ganz am Anfang dieser Statistik schon einmal anders, denn selbst im vierten Quartal des Jahr 2002 belegten AMD & nVidia zusammen nur 91% des Marktes, blieben also noch ganze 9% für andere Anbieter (seinerzeit noch aktiv: Matrox, PowerVR & VIA). Heuer sieht es eher danach aus, als würde nVidia selbst AMD noch seine Underdog-Marktanteile streitig machen, denn obwohl sich AMD immer mal wieder vorwärtsrobbt, kommen dann auch wieder Zeiten großer Einbrüche – und am Ende hat nVidia wieder mehr Marktanteile als vorher. Wirklich gesund ist das natürlich nicht, wenn sich dieses klare Unverhältnis seit nunmehr fast 10 Jahren im groben nicht von der Stelle bewegt, sondern wie gesagt tendentiell eher schlimmer wird. Daneben wurden kürzlich auch noch die Zahlen zum \"Markt\" aller PC-Grafikchips seitens Jon Peddie Research kundgetan – welcher insofern keinen wirklichen Markt darstellt, als dass die hierbei mengenmäßig dominierenden iGPUs weder einzeln erworben werden können noch (durchgehend) einen klar bezifferbaren Kaufwert aufweisen. Besonders viel läßt sich dieser Statistik damit regelmäßig nicht entnehmen, gerade da hier die wichtigen Detail-Zahlen zur konkreten Menge der iGPUs bzw. aller dGPUs fehlen. Allerdings deutet die zu sehende Steigerung des Intel-Marktanteils üblicherweise auf ein Ansteigen der mengenmäßigen Dominanz der iGPUs hin, da Intel im dGPU-Geschäft (derzeit) wie bekannt nur extrem kleine Brötchen backt.  "
}