{
    "title": "Intel Core i5-1230U vs AMD Ryzen 7 7840U vs Intel Pentium 8500",
    "date": "3/30/2024",
    "url": "https://www.notebookcheck.com/i5-1230U-vs-R7-7840U-vs-Pentium-8500_14110_15023_14114.247552.0.html",
    "text": "Der Intel Core i5-1230U ist eine sparsame Notebook-CPU auf Basis der neuen Alder-Lake-Architektur, die im Januar 2022 vorgestellt wurde. Die CPU basiert auf den Alder Lake-M Chip (für die 9W U-Serie) und bietet 2  Performance Kerne (P-Kerne, Golden Cove Architektur) und 8 Effizienzkerne (E-Kerne, Gracemont Architektur). Die P-Kerne unterstützten Hyperthreading (daher gemeinsam 12 Threads) und takten von 1 bis 4,4 GHz. Die E-Kerne takten von 0,7 - 3,3 GHz und sollen eine vergleichbare Performance wie alte Skylake Kerne bieten (z.B. i7-6300HQ). Der i5-1230U bietet wie der i7-1250U die eingeschränkten \"Essentials\" vPro Management Features. \nPerformance \nDurch die 10 Kerne und die neue Architektur sollte die Leistung in allen Bereichen deutlich oberhalb der alten 7-Watt 4-Kerner der Comet-Lake-> Serie liegen (wie z.B. dem i7-10510Y). Im Vergleich zum ähnlich benannten i5-1235U sollte jedoch der verringerte TDP deutlich limitieren. \nGrafikeinheit \nWie auch der Vorgänger, integriert Intel in Alder Lake eine Intel Xe basierende Grafikeinheit. Beim 1230U sind 80 der 96 EUs aktiviert und takten mit bis zu 0,85 GHz. \nFeatures \nWie auch Tiger Lake, hat auch Alder-Lake-P WiFi 6E und Thunderbolt 4 (4x) teilintegriert. Der integrierte Speicherkontroller unterstützt DDR5-4800, DDR4-3200, LPDDR5-5200 und LPDDR4x-4267. Der integrierte Gaussian and Neural Accelerator (GNA) ist nun in Version 3.0 verbaut. Die Media Engine Quick Sync 8 ist die selbe wie in Rocket Lake und unterstützt MPEG-2, AVC, VC-1 Decode, JPEG, VP8 Decode, VP9, HEVC und AV1 Decode. Der Chip unterstützt nur PCIe 4.0 (x8 for GPU und zwei x4 für SSDs). \nLeistungsaufnahme \nDer Intel Core i5-1230U ist mit 9 Watt (PL1) TDP und 29 Watt (PL2) max. Turbo Power angegeben. Gefertigt wird der Prozessor im modernen Intel 7 Prozess (10 nm). Der Intel Core i5-1230U ist eine sparsame Notebook-CPU auf Basis der neuen Alder-Lake-Architektur, die im Januar 2022 vorgestellt wurde. Die CPU basiert auf den Alder Lake-M Chip (für die 9W U-Serie) und bietet 2  Performance Kerne (P-Kerne, Golden Cove Architektur) und 8 Effizienzkerne (E-Kerne, Gracemont Architektur). Die P-Kerne unterstützten Hyperthreading (daher gemeinsam 12 Threads) und takten von 1 bis 4,4 GHz. Die E-Kerne takten von 0,7 - 3,3 GHz und sollen eine vergleichbare Performance wie alte Skylake Kerne bieten (z.B. i7-6300HQ). Der i5-1230U bietet wie der i7-1250U die eingeschränkten \"Essentials\" vPro Management Features. Performance Durch die 10 Kerne und die neue Architektur sollte die Leistung in allen Bereichen deutlich oberhalb der alten 7-Watt 4-Kerner der Comet-Lake-> Serie liegen (wie z.B. dem i7-10510Y). Im Vergleich zum ähnlich benannten i5-1235U sollte jedoch der verringerte TDP deutlich limitieren. Grafikeinheit Wie auch der Vorgänger, integriert Intel in Alder Lake eine Intel Xe basierende Grafikeinheit. Beim 1230U sind 80 der 96 EUs aktiviert und takten mit bis zu 0,85 GHz. Features Wie auch Tiger Lake, hat auch Alder-Lake-P WiFi 6E und Thunderbolt 4 (4x) teilintegriert. Der integrierte Speicherkontroller unterstützt DDR5-4800, DDR4-3200, LPDDR5-5200 und LPDDR4x-4267. Der integrierte Gaussian and Neural Accelerator (GNA) ist nun in Version 3.0 verbaut. Die Media Engine Quick Sync 8 ist die selbe wie in Rocket Lake und unterstützt MPEG-2, AVC, VC-1 Decode, JPEG, VP8 Decode, VP9, HEVC und AV1 Decode. Der Chip unterstützt nur PCIe 4.0 (x8 for GPU und zwei x4 für SSDs). Leistungsaufnahme Der Intel Core i5-1230U ist mit 9 Watt (PL1) TDP und 29 Watt (PL2) max. Turbo Power angegeben. Gefertigt wird der Prozessor im modernen Intel 7 Prozess (10 nm). Der AMD Ryzen 7 7840U ist ein High-End-Notebook-Prozessor der Phoenix Serie mit 8-Kernen und Hyperthreading (SMT), womit dieser in Summe bis zu 16 Threads gleichzeitig verarbeiten kann. Die CPU nutzt die neue Zen 4 Architektur und taktet diese von 3,3 GHz (Basistakt) bis zu 5,1 GHz (Einzelkern-Boost). Die CPU bietet 8 MB L2-Cache und 16 MB L3-Cache. \nDurch den geringeren TDP, sollte die Leistung etwas unterhalb des Ryzen 7 7840HS liegen. Der schnellste alte U-Prozessor, der Ryzen 7 PRO 6850U sollte deutlich abgehängt werden. \nDer Chip integriert eine moderne RDNA 3 basierende Grafikkarte (iGPU) namens Radeon 780M mit 12 CUs und bis zu 2,7GHz inklusive AV1 Video-Engine. Erstmals ist auch eine Xilinx FPGA basierte XDNA AI Beschleuniger integriert. Dieser soll schneller sein als die AI-Engine im Apple M2 SoC. An Anschlüssen bietet Phoenix 2x USB 4 (40 Gbps), 20 PCIe 4.0 Lanes und einen Dual-Channel DDR5-5600 / LPDDR5x-7500 Speicherkontroller (mit ECC Support). \nDie Phoenix Serie ist ein einzelner Chip (im Unterschied zur Dragon Range 7045HX Serie) und wird bei TSMC im modernen 4nm FinFET Prozess gefertigt. Der TDP ist von AMD mit 28 Watt spezifiziert und kann von 15 bis 30 Watt konfiguriert werden vom Hersteller. Der AMD Ryzen 7 7840U ist ein High-End-Notebook-Prozessor der Phoenix Serie mit 8-Kernen und Hyperthreading (SMT), womit dieser in Summe bis zu 16 Threads gleichzeitig verarbeiten kann. Die CPU nutzt die neue Zen 4 Architektur und taktet diese von 3,3 GHz (Basistakt) bis zu 5,1 GHz (Einzelkern-Boost). Die CPU bietet 8 MB L2-Cache und 16 MB L3-Cache. Durch den geringeren TDP, sollte die Leistung etwas unterhalb des Ryzen 7 7840HS liegen. Der schnellste alte U-Prozessor, der Ryzen 7 PRO 6850U sollte deutlich abgehängt werden. Der Chip integriert eine moderne RDNA 3 basierende Grafikkarte (iGPU) namens Radeon 780M mit 12 CUs und bis zu 2,7GHz inklusive AV1 Video-Engine. Erstmals ist auch eine Xilinx FPGA basierte XDNA AI Beschleuniger integriert. Dieser soll schneller sein als die AI-Engine im Apple M2 SoC. An Anschlüssen bietet Phoenix 2x USB 4 (40 Gbps), 20 PCIe 4.0 Lanes und einen Dual-Channel DDR5-5600 / LPDDR5x-7500 Speicherkontroller (mit ECC Support). Die Phoenix Serie ist ein einzelner Chip (im Unterschied zur Dragon Range 7045HX Serie) und wird bei TSMC im modernen 4nm FinFET Prozess gefertigt. Der TDP ist von AMD mit 28 Watt spezifiziert und kann von 15 bis 30 Watt konfiguriert werden vom Hersteller. Der Intel Pentium 8500 ist eine Notebook-CPU der Einstiegsklasse auf Basis der neuen Alder-Lake-Architektur, die im Januar 2022 vorgestellt wurde. Die CPU basiert auf den Alder Lake-M Chip (für die U-Serie mit 9W) und bietet einen Performance Kern (P-Kerne, Golden Cove Architektur) und 4 Effizienzkerne (E-Kerne, Gracemont Architektur). Der P-Kern unterstützten Hyperthreading (daher gemeinsam 6 Threads) und taktet von 1 bis 4,4 GHz. Die E-Kerne takten von 0,7 - 3,3 GHz und sollen eine vergleichbare Performance wie alte Skylake Kerne bieten (z.B. i7-6300HQ). Im Vergleich zum schnelleren Core i3-1210U, bietet der Pentium einen P-Kern weniger und ebenfalls keine vPro Funktionen. \nPerformance \nDurch die 6 Kerne und die neue Architektur sollte die Leistung in allen Bereichen deutlich oberhalb der alten 7-Watt 4-Kerner der Comet-Lake-Y Serie liegen (wie z.B. dem i5-10310Y). Im Vergleich zum ähnlich benannten Pentium 8505U (15W) sollte jedoch der verringerte TDP deutlich limitieren. \nGrafikeinheit \nWie auch der Vorgänger, integriert Intel in Alder Lake eine Intel Xe basierende Grafikeinheit. Beim Pentium sind 48 der 96 EUs aktiviert und takten mit bis zu 0,8 GHz. \nFeatures \nWie auch Tiger Lake, hat auch Alder-Lake-P WiFi 6E und Thunderbolt 4 (4x) teilintegriert. Der integrierte Speicherkontroller unterstützt DDR5-4800, DDR4-3200, LPDDR5-5200 und LPDDR4x-4267. Der integrierte Gaussian and Neural Accelerator (GNA) ist nun in Version 3.0 verbaut. Die Media Engine Quick Sync 8 ist die selbe wie in Rocket Lake und unterstützt MPEG-2, AVC, VC-1 Decode, JPEG, VP8 Decode, VP9, HEVC und AV1 Decode. Der Chip unterstützt nur PCIe 4.0 (x8 for GPU und zwei x4 für SSDs). \nLeistungsaufnahme \nDer Pentium 8500 ist mit 9 Watt (PL1) TDP und 29 Watt (PL2) max. Turbo Power angegeben. Gefertigt wird der Prozessor im modernen Intel 7 Prozess (10 nm). Der Intel Pentium 8500 ist eine Notebook-CPU der Einstiegsklasse auf Basis der neuen Alder-Lake-Architektur, die im Januar 2022 vorgestellt wurde. Die CPU basiert auf den Alder Lake-M Chip (für die U-Serie mit 9W) und bietet einen Performance Kern (P-Kerne, Golden Cove Architektur) und 4 Effizienzkerne (E-Kerne, Gracemont Architektur). Der P-Kern unterstützten Hyperthreading (daher gemeinsam 6 Threads) und taktet von 1 bis 4,4 GHz. Die E-Kerne takten von 0,7 - 3,3 GHz und sollen eine vergleichbare Performance wie alte Skylake Kerne bieten (z.B. i7-6300HQ). Im Vergleich zum schnelleren Core i3-1210U, bietet der Pentium einen P-Kern weniger und ebenfalls keine vPro Funktionen. Performance Durch die 6 Kerne und die neue Architektur sollte die Leistung in allen Bereichen deutlich oberhalb der alten 7-Watt 4-Kerner der Comet-Lake-Y Serie liegen (wie z.B. dem i5-10310Y). Im Vergleich zum ähnlich benannten Pentium 8505U (15W) sollte jedoch der verringerte TDP deutlich limitieren. Grafikeinheit Wie auch der Vorgänger, integriert Intel in Alder Lake eine Intel Xe basierende Grafikeinheit. Beim Pentium sind 48 der 96 EUs aktiviert und takten mit bis zu 0,8 GHz. Features Wie auch Tiger Lake, hat auch Alder-Lake-P WiFi 6E und Thunderbolt 4 (4x) teilintegriert. Der integrierte Speicherkontroller unterstützt DDR5-4800, DDR4-3200, LPDDR5-5200 und LPDDR4x-4267. Der integrierte Gaussian and Neural Accelerator (GNA) ist nun in Version 3.0 verbaut. Die Media Engine Quick Sync 8 ist die selbe wie in Rocket Lake und unterstützt MPEG-2, AVC, VC-1 Decode, JPEG, VP8 Decode, VP9, HEVC und AV1 Decode. Der Chip unterstützt nur PCIe 4.0 (x8 for GPU und zwei x4 für SSDs). Leistungsaufnahme Der Pentium 8500 ist mit 9 Watt (PL1) TDP und 29 Watt (PL2) max. Turbo Power angegeben. Gefertigt wird der Prozessor im modernen Intel 7 Prozess (10 nm). #0 checking url part for id 14110 +0s ... 0s #1 checking url part for id 15023 +0s ... 0s #2 checking url part for id 14114 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.039s ... 0.041s #6 did output specs +0s ... 0.041s #7 getting avg benchmarks for device 14110 +0.017s ... 0.058s #8 got single benchmarks 14110 +0.013s ... 0.071s #9 getting avg benchmarks for device 15023 +0.018s ... 0.089s #10 got single benchmarks 15023 +0.031s ... 0.12s #11 getting avg benchmarks for device 14114 +0.002s ... 0.123s #12 got single benchmarks 14114 +0s ... 0.123s #13 got avg benchmarks for devices +0s ... 0.123s #14 min, max, avg, median took s +0.304s ... 0.427s #15 return log +0s ... 0.427s "
}