{
    "title": "China bans Intel, AMD chips from government computers: Report",
    "date": "3/23/2024",
    "url": "https://www.republicworld.com/business/international-business/china-bans-intel-amd-chips-from-government-computers-report/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated March 24th, 2024 at 11:47 IST The procurement guidance also advocates for the sidelining of Microsoft's Windows operating system and foreign-made database software. China chip ban: China has introduced guidelines to phase out microprocessors from Intel and AMD from government personal computers and servers, The Financial Times on Sunday. The procurement guidance also advocates for the sidelining of Microsoft's Windows operating system and foreign-made database software in favour of domestic alternatives. According to the Financial Times report, these guidelines were unveiled in December, and Chinese officials have already begun adhering to them. Government agencies above the township level are now required to include criteria for \"safe and reliable\" processors and operating systems in their procurement processes. As of now, neither Intel nor AMD has responded to Reuters' request for comment on the matter. The development comes amid US government's efforts to boost domestic semiconductor production and reduce dependency on China and Taiwan. The Biden administration's 2022 CHIPS and Science Act aims to bolster US semiconductor capabilities and includes provisions for financial aid to support domestic production, including subsidies for the manufacturing of advanced chips. (With Reuters inputs) Published March 24th, 2024 at 11:47 IST Send us your views, we’ll publish them. This section is moderated. Viral Video Shows A Man Seen Riding Bull On Busy City Street | WATCH Zodiac Signs With The Best Sense Of Humour Zodiac Signs That Are Incompatible With Each Other BSF Foils Intrusion Attempt, Recovers China-Made Pak Drone in Punjab YouTube Music web app launches offline downloads Apple extends discounts to employees on select Apple Watch bands Woman In Lahore Thrown Out Of Window By Her Husband, Video Goes Viral Pooran makes bold statement on Mayank Yadav after LSG vs PBKS Four Arrested For Attack On Interfaith Couple In Hyderabad Unseen pictures from LSG vs PBKS match as Lucknow emerge victorious © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}