{
    "title": null,
    "date": "3/22/2024",
    "url": "https://www.notebookcheck.net/Fujifilm-X100VI-Limited-Edition-scalpers-thwarted-as-pre-order-dry-up-in-minutes.816054.0.html",
    "text": "We previously reported on the Fujifilm X100VI's immense popularity, which led to the camera selling out quickly after launch, as well as more than a few drastically overpriced eBay listings popping up from scalpers. In spite of Fujifilm's best efforts, we are seeing history repeat itself with the Fujifilm X100VI Limited Edition, of which the company only produced 1934 units to commemorate its 90th anniversary. As reported by Fuji Rumors, the Fujifilm X100VI sold out almost instantly across Europe, with several reports of the Fujifilm order site crashing under the load. This is to be expected, as many European retailers handled X100VI Limited Edition orders on a first-come, first-serve basis. In the US, however, Fujifilm decided to instead manually verify each purchase, enforcing a one-unit limit per person, email address, and shipping address — all in order to weed out scalpers. Fujifilm US has also spaced out its pre-orders, selling only 100 units of the X100VI Limited Edition per day, ending on March 23. It seems as though the measures Fujifilm has taken to curtail scalping may have had some impact on the ability of third-party sellers to get their hands on the X100VI Limited Edition. A quick search on eBay reveals only a handful of listing for the X100VI Limited Edition, with the most generous scalpers demanding on the order of $4,450 for the compact APS-C camera, and prices ranging all the way into the $8,000 range. While, at the time of writing, there are only two Fujifilm X100VI Limited Edition listings on eBay hailing from the US, it wouldn't be surprising to see more pop up in the coming weeks — especially since Fujifilm has only just finished selling through 200 of its 300-unit X100VI Limited Edition allocation. Compare the handful of X100VI Limited Edition eBay listings to the dozens of listings that popped up shortly after the vanilla X100VI launched, and the reality appears to be that Fujifilm's efforts have at least had some impact on the success of scalpers. If you're on the hunt for a compact Fujifilm camera, but don't want to pay the X100VI tax, look no further than the Fujifilm X-S20 (curr. $1,499 on Amazon with a 15–45 mm lens and starter bundle), or check out the Fujifilm X-T30 II (curr. $999 with an XC15–45 mm kit on Amazon) We're all sold out of X100VI Limited Edition for TODAY. Please try again tomorrow (3/23) at 12pm EDT (NOON). Please note that we're manually verifying orders for fraud and suspicious activity. https://t.co/iRPfAQgbnU Fujifilm X USA on X (formerly Twitter), Fuji Rumors (1, 2), eBay "
}