{
    "title": "AMD Hires Thomas Zacharia to Expand Strategic AI Relationships",
    "date": "3/4/2024",
    "url": "https://www.globenewswire.com/en/news-release/2024/03/04/2840015/0/en/AMD-Hires-Thomas-Zacharia-to-Expand-Strategic-AI-Relationships.html",
    "text": "March 04, 2024 17:00 ET\n\n\r\n            | Source:\r\n            \nAdvanced Micro Devices, Inc.\n\n\n\n\n\nAdvanced Micro Devices, Inc. SANTA CLARA, Calif., March  04, 2024  (GLOBE NEWSWIRE) -- Today AMD (NASDAQ: AMD) announced that Thomas Zacharia has joined AMD as senior vice president of strategic technology partnerships and public policy. Zacharia will lead the global expansion of AMD public/private relationships with governments, non-governmental organizations (NGOs) and other organizations to help fast-track the deployment of customized AMD-powered AI solutions to meet rapidly growing number of global projects and applications targeting the deployment of AI for the public good. “Thomas is a distinguished leader with decades of experience successfully creating public/private partnerships that have resulted in consistently deploying the world’s most powerful and advanced computing solutions, including the world’s fastest supercomputer Frontier,” said AMD Chair and CEO Lisa Su. “As the former Director of the U.S.’s largest multi-program science and energy research lab, Thomas is uniquely positioned to leverage his extensive experience advancing the frontiers of science and technology to help countries around the world deploy AMD-powered AI solutions for the public good.” “After spending 35 years at Oak Ridge National Laboratory, I knew I wanted to apply my experience and capabilities to help drive the adoption of HPC and AI technologies to make a positive impact for the globe. As well, getting to work with the AMD team for the launch of Frontier, I saw first-hand the capabilities of AMD leadership team and its leadership technology solutions,” said Zacharia. “Now I get to leverage my extensive experience in science, AI and public policy, while working with the amazing AMD team to create impactful technologies and solutions that will make a global impact for countries and organizations around the world.” Zacharia is a distinguished industry leader with extensive experience in scientific research, technology development, public policy and strategic public/private partnerships. He spent 35 years at Oak Ridge National Laboratory, leaving there as the director that oversaw the creation and implementation of the AMD-powered Frontier supercomputer; the first supercomputer to break the Exascale barrier. Frontier is powered by AMD EPYC™ processors and AMD Instinct™ accelerators and has been the fastest supercomputer in the world, according to the Top500 list, since May of 2022. Frontier has won multiple Gordon Bell Awards for outstanding science and continues to push the boundaries of science and AI for healthcare, materials, energy and more. Zacharia holds a B.S. in mechanical engineering from the National Institute of Technology Karnataka, Surathkal, India, an M.S. in materials science from the University of Mississippi in Oxford, Mississippi, and a Ph.D. in engineering science from Clarkson University in Potsdam, New York. While at Oak Ridge National Laboratory, he led critical multi-institutional research efforts, including the Exascale Computing Project, Quantum Science Center, and Center for BioEnergy Innovation. He also drove a focused attention on the application of science to national security challenges with creation of a new National Security Sciences Directorate. Supporting Resources About AMDFor more than 50 years AMD has driven innovation in high-performance computing, graphics and visualization technologies. Billions of people, leading Fortune 500 businesses and cutting-edge scientific research institutions around the world rely on AMD technology daily to improve how they live, work and play. AMD employees are focused on building leadership high-performance and adaptive products that push the boundaries of what is possible. For more information about how AMD is enabling today and inspiring tomorrow, visit the AMD (NASDAQ: AMD) website, blog, LinkedIn and Twitter pages. © 2024 Advanced Micro Devices, Inc. All rights reserved. AMD, EPYC, Instinct, the AMD Arrow logo and combinations thereof are trademarks of Advanced Micro Devices, Inc.  "
}