{
    "title": "Ocular Therapeutix™ Reports Fourth Quarter and Full Year 2023 Results",
    "date": "3/11/2024",
    "url": "https://www.globenewswire.com/en/news-release/2024/03/11/2844143/0/en/Ocular-Therapeutix-Reports-Fourth-Quarter-and-Full-Year-2023-Results.html",
    "text": "March 11, 2024 16:05 ET\n\n\r\n            | Source:\r\n            \nOcular Therapeutix, Inc.\n\n\n\n\n\nOcular Therapeutix, Inc. Leadership Appointments Move Ocular Towards Being a Leader in Retinal Care Screening Underway in AXPAXLI™ Phase 3 SOL-1 Trial for Wet AMD Topline Clinical Data for AXPAXLI in Diabetic Retinopathy and PAXTRAVA™ in Glaucoma Expected in Q2 2024 Cash Expected to Support Operations Into At Least 2028 Based on $196M YE 2023 Cash Balance Plus $325M Gross Proceeds from February 2024 PIPE Planning to Host an Investor Day in Q2 2024 to Outline Updated Corporate Strategy BEDFORD, Mass., March  11, 2024  (GLOBE NEWSWIRE) -- Ocular Therapeutix, Inc. (NASDAQ:OCUL, “Ocular”, the “Company”), a biopharmaceutical company committed to enhancing people’s vision and quality of life through the development and commercialization of innovative therapies for wet age-related macular degeneration (wet AMD), diabetic retinopathy, and other diseases and conditions of the eye, today reported financial results for the fourth quarter 2023 and full year ended December 31, 2023. “I joined Ocular because I see the opportunity to unlock significant value for patients and stockholders through the development of safe, effective and durable treatments for retinal diseases, starting with our lead candidate, AXPAXLI for wet AMD,” said Pravin Dugel, MD, Executive Chairman of Ocular Therapeutix. “Bringing together our dedicated, world-class team of acknowledged strategic and clinical experts has enabled us to position Ocular as a leader in retinal care. Our goal is to bring AXPAXLI to the market as soon as possible. Our strengthened team provides us with an opportunity to enrich and accelerate the AXPAXLI clinical programs.” Dr. Dugel concluded, “I believe the Company has made outstanding progress over the last several months, with the initiation of the Phase 3 SOL-1 study with AXPAXLI in wet AMD and successful financings that raised more than $440 million in gross proceeds from existing and new top tier health care investors. Further, I believe that wet AMD is just the beginning for AXPAXLI. We look forward to providing an update on the Company’s strategy and objectives related to our increased focus on retinal disease during our upcoming Investor Day, planned for the second quarter 2024.” Recent Achievements: Anticipated Upcoming Milestones: Fourth Quarter and Year End December 31, 2023 Financial Results Total cash and cash equivalents (Cash) were $195.8 million as of December 31, 2023. The Company also completed a private placement of common shares in February 2024 that provided gross proceeds of $325.0 million, before deducting placement agent fees and offering expenses. Based on current plans and related estimates of anticipated cash inflows from DEXTENZA®, the Company believes that its current cash balance is sufficient to support its planned expenses, obligations and capital expenditure requirements into at least 2028. Total net revenue includes both gross DEXTENZA product revenue, net of discounts, rebates, and returns, which the Company refers to as net product revenue; and collaboration revenue. Total net revenue was $14.8 million for the fourth quarter of 2023, a 5.0% increase over total net revenue of $14.1 million in the comparable period in 2022, driven by DEXTENZA sales. Total net revenue for the full year 2023 was $58.4 million versus $51.5 million in 2022, an increase of 13.4%. Research and development expenses for the fourth quarter of 2023 were $16.2 million versus $13.5 million for the comparable period in 2022, driven primarily by an increase in overall clinical and regulatory expenses associated with product development programs. Overall R&D expenses for the full year increased $7.6 million to $61.1 million from $53.5 million in 2022, reflecting the timing and conduct of our clinical trials. Selling and marketing expenses were $9.2 million in the fourth quarter of 2023, as compared to $10.5 million for the comparable quarter of 2022, primarily reflecting a reduction in personnel costs driven by lower expense for stock-based compensation and other items. Overall, selling and marketing expenses for the full year increased nominally to $40.5 million from $39.9 million in 2022, related to an increase in personnel costs and other costs, offset by lower spend on professional services. General and administrative expenses were $8.0 million for the fourth quarter of 2023 versus $8.3 million in the comparable quarter of 2022, lower primarily due to a reduction of professional-related fees and other expenses. Overall, G&A expenses for the full year increased by $1.7 million to $33.9 million from $32.2 million in 2022, related to an increase of personnel-related expenses, including stock-based compensation, partially offset by lower professional-related fees and other expenses. Net loss for the fourth quarter of 2023 was $(29.2) million, or a loss of $(0.35) per share on both a basic and diluted basis, compared to a net loss of $(15.5) million, or net loss of $(0.20) per share on a basic basis and a loss of $(0.24) per share on a diluted basis, for the comparable period in 2022. The net loss in the fourth quarter of 2023 included a $(6.5) million non-cash expense attributable to changes in the fair value of the derivative liabilities associated with the Company’s convertible notes and the Barings credit facility versus the net loss in the fourth quarter of 2022 that included a $5.2 million non-cash gain attributable to the derivative liability associated with the Company’s convertible notes. Non-cash charges for stock-based compensation and depreciation and amortization were $5.3 million in the fourth quarter of 2023 versus $4.7 million for the comparable quarter in 2022. Overall, the Company reported a net loss of $(80.7) million, or a loss of $(1.01) per share on a basic basis and a loss of $(1.02) on a diluted basis, for the year ended December 31, 2023 versus a net loss of $(71.0) million, or a loss of $(0.92) per share on a basic basis and a loss of $(0.97) on a diluted basis, for the year ended December 31, 2022. Outstanding shares as of March 6, 2024 were approximately 148.6 million. About Ocular Therapeutix, Inc.Ocular Therapeutix, Inc. is a biopharmaceutical company committed to enhancing people’s vision and quality of life through the development and commercialization of innovative therapies for wet age-related macular degeneration (wet AMD), diabetic retinopathy, and other diseases and conditions of the eye, including glaucoma. AXPAXLI™ (axitinib intravitreal implant, also known as OTX-TKI), Ocular’s product candidate for retinal disease, is based on its ELUTYX™ proprietary bioresorbable hydrogel-based formulation technology. AXPAXLI is currently in the first of two planned pivotal Phase 3 trials for wet AMD, the SOL-1 trial, and a Phase 1 clinical trial for the treatment of non-proliferative diabetic retinopathy. The clinical portfolio also includes PAXTRAVA™ (travoprost intracameral implant, also known as OTX-TIC), currently in a Phase 2 clinical trial for the treatment of primary open-angle glaucoma or ocular hypertension. Ocular’s expertise in the formulation, development and commercialization of innovative therapies and the ELUTYX™ platform supported the development and launch of its first commercial drug product, DEXTENZA®, an FDA-approved corticosteroid for the treatment of ocular inflammation and pain following ophthalmic surgery and ocular itching associated with allergic conjunctivitis. ELUTYX is also the foundation for two other clinical-stage assets, OTX-CSI (cyclosporine intracanalicular insert) for the chronic treatment of dry eye disease and OTX-DED (dexamethasone intracanalicular insert) for the short-term treatment of the signs and symptoms of dry eye disease, as well as several preclinical programs. Follow us on our website, LinkedIn or X. DEXTENZA® is a registered trademark of Ocular Therapeutix, Inc. AXPAXLI™, PAXTRAVA™, and ELUTYX™ are trademarks of Ocular Therapeutix, Inc. About DEXTENZA DEXTENZA is FDA-approved for the treatment of ocular inflammation and pain following ophthalmic surgery and ocular itching associated with allergic conjunctivitis. DEXTENZA is a corticosteroid intracanalicular insert placed in the punctum, a natural opening in the inner portion of the lower eyelid, and into the canaliculus, and is designed to deliver dexamethasone to the ocular surface for up to 30 days without preservatives. DEXTENZA resorbs and exits the nasolacrimal system without the need for removal. Please see full Prescribing and Safety Information at the DEXTENZA website. Forward-Looking StatementsAny statements in this press release about future expectations, plans, and prospects for the Company, including the development and regulatory status of the Company’s product candidates, including the timing, design, and enrollment of the Company’s pivotal trials of AXPAXLI (also called OTX-TKI) for the treatment of wet AMD; the Company’s plans to advance the development of AXPAXLI and its other product candidates; the Company’s cash runway and sufficiency of the Company’s cash resources; and other statements containing the words \"anticipate”, \"believe”, \"estimate”, \"expect”, \"intend\", \"goal”, \"may\", \"might”, \"plan”, \"predict”, \"project”, \"target”, \"potential”, \"will”, \"would”, \"could”, \"should”, \"continue”, and similar expressions, constitute forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors. Such forward-looking statements involve substantial risks and uncertainties that could cause the Company’s preclinical and clinical development programs, future results, performance or achievements to differ significantly from those expressed or implied by the forward-looking statements. Such risks and uncertainties include, among others, the timing and costs involved in commercializing DEXTENZA or any product or product candidate that receives regulatory approval; the ability to retain regulatory approval of DEXTENZA or any product or product candidate that receives regulatory approval; the initiation, design, timing, conduct and outcomes of clinical trials, including the SOL-1 trial, the planned SOL-2 trial and the Company’s other ongoing clinical trials; the risk that the FDA will not agree with the Company’s interpretation of the written agreement under the SPA for the SOL-1 trial; the risk that even though the FDA has agreed with the overall design of the SOL-1 trial, the FDA may not agree that the data generated by the SOL-1 trial supports potential marketing approval; uncertainty as to whether the data from earlier clinical trials will be predictive of the data of later clinical trials, particularly later clinical trials that have a different design or utilize a different formulation than the earlier trials; availability of data from clinical trials and expectations for regulatory submissions and approvals; the risks that the leadership appointments referenced in this release are not successful in achieving the anticipated results; the Company’s scientific approach and general development progress; uncertainties inherent in estimating the Company’s cash runway, future expenses and other financial results, including its ability to fund future operations, including clinical trials; the Company’s existing indebtedness and the ability of the Company’s creditors to accelerate the maturity of such indebtedness upon the occurrence of certain events of default; the Company’s ability to enter into strategic alliances or generate additional funding on a timely basis, on favorable terms, or at all; and other factors discussed in the “Risk Factors” section contained in the Company’s quarterly and annual reports on file with the Securities and Exchange Commission. In addition, the forward-looking statements included in this press release represent the Company’s views as of the date of this press release. The Company anticipates that subsequent events and developments will cause the Company’s views to change. However, while the Company may elect to update these forward-looking statements at some point in the future, the Company specifically disclaims any obligation to do so, whether as a result of new information, future events or otherwise, except as required by law. These forward-looking statements should not be relied upon as representing the Company’s views as of any date subsequent to the date of this press release. InvestorsOcular TherapeutixDonald NotmanChief Financial Officerdnotman@ocutx.com Joyce AllaireLifeSci Advisorsjallaire@lifesciadvisors.com  "
}