{
    "title": "Unless You're Nvidia, the AI Chip Business Is Complicated",
    "date": "3/8/2024",
    "url": "https://www.oodaloop.com/briefs/2024/03/08/unless-youre-nvidia-the-ai-chip-business-is-complicated/",
    "text": "OODA Loop Understand tomorrow, today. News Briefs, Technology / March 8, 2024 by OODA Analyst Investors have been treating Broadcom like the next Nvidia. They forgot about the iPhone. Broadcom’s market value has more than doubled over the past year, and its stock has been the third-biggest gainer on the PHLX Semiconductor Index in that time behind Nvidia and Advanced Micro Devices AMD. Surging demand for systems to power generative artificial intelligence services has driven sales for Broadcom’s networking chips, which are used for things like connecting Nvidia’s popular GPU chips together in data centers to form what are effectively AI supercomputers. That is quickly becoming a big business for Broadcom. The company told analysts during its fiscal first quarter earnings call Thursday afternoon that revenue from AI chips totaled $2.3 billion in the January-ending quarter—a 53% jump from the previous quarter. Chief Executive Officer Hock Tan also added that the company now expects AI revenue to top $10 billion in its current fiscal year, which is more than double the $4.2 billion from those products during the previous year. But, unlike Nvidia, which is now drawing the vast majority of its overall revenue from AI processors used in data centers, Broadcom is now a well diversified tech giant spanning both the semiconductor and software markets. Most of them aren’t growing anything like AI—with some not growing at all. Broadcom’s wireless segment, which primarily supplies radio-frequency chips to Apple for the iPhone, saw revenue slip 4% year-over-year to about $2 billion. Other parts of the company’s chip business, such as server storage and broadband connectivity, are faring even worse. Thus, Broadcom’s overall semiconductor segment grew revenue just 4% year-over-year to $7.4 billion during the most recent quarter—basically matching Wall Street’s estimates. Full report : Unless You’re Nvidia, the AI Chip Business Is Complicated. OODA is comprised of a unique team of international experts capable of providing advanced intelligence and analysis, strategy and planning support, risk and threat management, training, decision support, crisis response, and security services to global corporations and governments.  "
}