{
    "title": "AMD Berlin Graduate Show 2024 - Stage.24 - Mode, Shopping, Designer, Trends",
    "date": "3/9/2024",
    "url": "https://www.breakinglatest.news/entertainment/amd-berlin-graduate-show-2024-stage-24-mode-shopping-designer-trends/",
    "text": "The AMD Berlin STAGE.24 Graduate Fashion Show of the Academy of Fashion & Design presented the creative final collections of the graduates in the Silent Green concrete hall in Berlin on March 1st, 2024. Around 24 collections from the Fashion Design (BA) course and one collection from the Fashion & Design Management (BA) course were proudly presented. On the same evening, the two best graduates were chosen and the final theses from the Fashion & Design Management (BA), Fashion Journalism & Communication (BA) and Sustainability in Fashion & Creative Industries (MA) degree programs were presented in the form of an exhibition. The three best graduates of the year were selected and awarded with the help of a renowned jury. This year the jury consisted of the designers Labels Richert Beil Jale Richert and Michele Beil as well as the art director Petra Langhammer. A particular focus was on the collection’s quality of workmanship. The designers were particularly convincing here Julian Stamm with the collection “The Unknown” as well as designers Fabian Kunert with the collection “WHAT ARE YOU AFRAID OF?” She also became a designer Hayley Gare was awarded the “Aphelion” collection by the jury. This slideshow requires JavaScript. In addition to the fashion show, there was an exhibition of final theses from the Fashion & Design Management (BA), Fashion Journalism & Communication (BA) and Sustainability in Fashion & Creative Industries (MA) courses. Among the graduates of the Fashion & Design Management (BA) course was Jacob Langemeyer, who successfully runs the Berlin label SF1OG as Brand Manager & Founder together with the designer Rosa Marga Dahl. Julian Stamm’s final collection plays with the familiar appeal of the forbidden as well as human curiosity for what is unknown to us. There are different legends and interpretations about what happens after death. Stamm’s The Unknown incorporates these into six deconstructed fashion-driven looks, including one called Coffin and Cemation, which features a wooden coffin as the protagonist. Lonely in Gorgeous is about the Japanese “Hikikomori”. These are people who withdraw heavily from society and stay at home for long periods of time. Divided into four acts and inspired by classical ballet, Vu’s collection shows six women’s fashion looks that playfully and femininely portray and reflect the different situations and individual dealings with self-isolation. With her final collection, Annemarie Höltge wants to make one thing clear: you can be a child as an adult. Here she plays on the lightness and naivety that children carry within them and how you don’t have to let go of this even as an adult. Too tight on the body and yet too wide on the shoulders, the six looks are reminiscent of children’s clothing and, above all, disguises on adult models who have already outgrown them. Somewhat dark and with a deeper meaning, the clothing looks excessively uncomfortable on the so-called SHADOW CHILDREN. Clara Born retells the fairy tale Sounds My Linden by Astrid Lindgen using the six looks from her final collection. The focus is on the character Malin and especially her fate and social relationships. Asymmetrical, playful and unconventionally styled, the looks in this collection have an almost mystical, fairytale effect. The textiles vary from head to toe with the help of hood-like headgear and socks. Vintage lace is combined here with wool and fur as well as knitted and crocheted. Solitude & Sanctuary was created after Alica Braun’s three-month stay in Seoul and, among other things, deals with the history of Korean comfort women during the Second World War. This final collection celebrates the elegance of black and white as well as simple, straight silhouettes. They are also strongly inspired by traditional Korean and Japanese clothing such as hanboks or kimonos. The graduate would like to draw attention to unheard voices of this time and, above all, injustices that happened to women back then and that continue to resonate today. Elmira Pashaei presents six simple looks in her final collection. Above all, they carry the essence of holy Christianity and divine femininity. Silhouettes known from Christianity flow into the designs and the gently falling fabrics create an elegant, feminine and graceful effect. The color palette consists of white, light pink and lilac and is reminiscent of idyllic sunrises. Mary Magdalene served primarily as the inspiration for A Love that Never Ends. Friederike Köpsell’s collection Fur!ia breaks norms and defends female rage, which is not nearly as accepted in our society as that of men. The inspiration for the collection was primarily the German story Aunt Jolanthe Ritter Annegret and the feminist Riot Grrrl movement, which wanted to create revolution through music in the hardcore punk scene of the 90s. Köpsell’s designs are intended to make women feel safe and empowered so that they can live out their anger, make fun of the male gaze, but also actively take action against the patriarchal system. Malte von Holtum’s final collection appears dark and mysterious. The future takes place before the eyes of the past. unknown demise consists of six looks that consist of upcycling and reuse already used textiles. The different materials create textures like patterns on the clothing. In particular, the hoods that cover the head or even cover the face probably allude to our future or that of the earth and humanity as a whole. With her final collection, Noelle Trüeb presents Stereotypes & Prejudices in Fashion, as the name suggests, prejudices in fashion. The six looks look almost clichéd for fashion with fur, boots, wide trouser legs, different prints and patterns – everything is there and it looks like you’re leafing through a fashion magazine – full of dynamism and inspiration. The final collection Blending Nature and Human Life on sustainable fashion is about climate change and our society. Inspired by Grandma’s Manhattan Project, Bartsch’s final collection is about a city built to be in harmony with nature and urban life. The six looks primarily focus on destructive, unique designs made from upcycled and deadstock materials. In order, they tell a story with an appeal to us as humanity. The sensational final collection Fie On Thee! Fie On Me! is about the uncomfortable feeling of sheer shame and its importance in society. Face-covering hoods evoke the desire to be invisible when one is ashamed. Overall, Pipal’s designs explore the process from feeling ashamed to the point of making peace with it. With SENSE, Hannah Bentley investigates how clothing supports human well-being and the environment. In today’s world and in the future, we are so affected by stress and pressure, as well as by climate change, that we desperately need clothing for comfort, but we also need to protect our environment from it. The graduate presented three meaningful looks with this goal in mind. She used different materials for the designs, such as recycled plastic bottles. Le Bal des Increvable is all about the mystical nature of vampires. In addition to the collection, Marchand created a 1-minute short film. The three looks serve as costumes and also represent pure art. The graduate came up with six vampire characters to tell an eerie story with her final collection with short films that is conceptually inspired by modern and contemporary art. Hayley Gare’s collection includes seven feminine women’s fashion looks with slim silhouettes and straight cuts, of which only 6 were presented in the show. It was not without reason that she was praised and chosen by the jury. Aphelion is about the contradiction between the romanticized fantasy of being alone and the reality of isolation, which can have a huge impact on mental health. The collection includes a delicate lace dress next to a modern tracksuit. What are you afraid of? examines the manipulative tactics used by members of destructive cult circles to enforce their ideologies and system structures. For this purpose, Fabian Kunert presents six destructive looks that are reminiscent of paparazzi photos and are inspired by cult and celebrity culture. With the help of extraordinarily large shoulder parts, the human body is given a strange silhouette and a hood over the face gives people greater anonymity. Author: Aaliyah – Photos: KOWA-Berlin     Save my name, email, and website in this browser for the next time I comment.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More "
}