{
    "title": "2 Brilliant AI Stocks To Grab Now — TradingView News",
    "date": "3/10/2024",
    "url": "https://www.tradingview.com/news/barchart:94573d232094b:0-2-brilliant-ai-stocks-to-grab-now/",
    "text": "The “Magnificent Seven” are not the only stocks riding the artificial intelligence (AI) wave. While Nvidia NVDA continues to dominate the semiconductor market, other semiconductor companies have also upped the ante with the help of AI. Intel INTC and Advanced Micro Devices AMD, in particular, show promising prospects after integrating AI into their offerings. Intel stock surged 90% in 2023, fueled by strong quarterly results and AI-related growth prospects. It became one of the Dow Jones Industrial Average's ($DOWI) best-performing stocks last year. However, the stock is off to a slow start in 2024, down 12.4% compared to the Dow's 3.2% year-to-date gain. Similarly, Advanced Micro Devices (popularly known as AMD) has established its own stronghold over the market in the last decade. Its stock has risen an eye-catching 5,071% over that 10-year period. Let’s find out why investors should consider these two AI stocks now. The Case For Intel Stock Founded in 1968, Intel INTC is renowned for its semiconductor products. Intel's Pentium, Core, and Xeon processor families have consistently set new standards for performance, energy efficiency, and advanced features. It has also expanded its product portfolio to include memory solutions and graphics processing units (GPUs), among others. Barchart Intel's fourth-quarter revenue rose 10% year on year to $15.4 billion, thanks to strong consumer demand for all of its products. What was particularly impressive was the massive 260% increase in diluted earnings per share to $0.54 from $0.15 the previous year. Intel operates in five business segments. The Client Computing Group (CCG), Data Center and AI (DCAI), and Network and Edge (NEX) divisions all struggled in 2023. However, the Mobileye segment grew 11%, while Intel Foundry Services (IFS) increased by 103% year-on-year. In the DCAI segment, Intel launched the 5th Gen Intel Xeon processor, which is specifically designed for AI workloads. Talking about this year, CEO Pat Gelsinger stated, “In 2024, we remain relentlessly focused on achieving process and product leadership, continuing to build our external foundry business and at-scale global manufacturing, and executing our mission to bring AI everywhere as we drive long-term value for stakeholders.” The company also reported $3 billion in cost savings for 2023 and paid out dividends of $3.1 billion. For the full year 2023, revenue and earnings were down by 14% and 37%, respectively. While macroeconomic factors and slow PC demand weighed on 2023 financials, Intel's future growth prospects appear promising. According to market research firm Canalys, AI-powered devices are expected to drive an 8% increase in global PC shipments this year. This recovery could boost Intel's CCG unit, which declined 8% in 2023 and accounts for a significant portion of the company's total revenue. In Q1 of 2024, management expects a profit of $0.13 per share, compared to a loss of $0.04 in the year-ago quarter, while revenue could grow between 4.2% to 13%. Analysts predict revenue growth of 6.1% to $57.5 billion in 2024, with earnings increasing by 30%. Furthermore, in 2025, revenue and earnings are expected to increase by 11.7% and 70.6%, respectively. Based on the explosive growth estimates for 2025, Intel’s shares look quite reasonable at 19 times forward earnings, and particularly when compared to peer Nvidia’s forward price-to-earnings multiple of 37x. What is Wall Street’s View on Intel Stock? Out of the 33 analysts covering Intel stock, four have a “strong buy” recommendation, two suggest a “moderate buy,” 23 recommend a “hold,\" and four analysts call the stock a “strong sell.” Intel stock ended last week nearly flat with analysts' average price target of $44.31. The high target price of $68, however, implies a potential upside of about 54.5% in the next 12 months.Barchart The Case For AMD Stock Over the last few years, AMD has emerged as a major player in the semiconductor industry. It has established itself as a formidable competitor to industry leader Nvidia. AMD has made significant progress in both the CPU and GPU markets, with its Ryzen processors and Radeon graphics cards gaining traction. Furthermore, the integration of AI improved AMD's fundamentals last year, causing its stock to rise 127% - easily outperforming the tech-heavy Nasdaq Composite's ($NASX) gain of 44.5%. So far this year, AMD has gained 40.7%.Barchart AMD's data center business is finally recovering, with revenue up 38% year-on-year to $2.3 billion in the fourth quarter. Revenue increased 21% sequentially, driven by strong demand for its 4th generation EPYC CPUs and Instinct GPUs. Talking about the Q4 results, CEO Dr. Lisa Su emphasized that higher “AMD Instinct GPU and EPYC CPU sales and higher AMD Ryzen processor sales” led to the company ending 2023 on a strong note. Total revenue increased 6% year-over-year to $6.1 billion. Diluted earnings per share (EPS) increased a massive 128% to $0.41 in the quarter. Aside from the Data Center segment, AMD operates in three other segments. Client segment revenue rose 62% to $1.5 billion in Q4. However, the Gaming and Embedded segments fell 17% and 24%, respectively, from the year-ago quarter. Management anticipates that demand for the embedded segment will remain soft this year. However, they are confident in the segment's growth trajectory, with the AI-powered, expanded portfolio. Plus, bolstered by the rise of online gaming and virtual reality, the gaming segment's fortunes could also improve. Furthermore, investors can expect AMD's strategic acquisitions to incorporate open AI software into its hardware to bear fruit in the coming years. As AI advances, the demand for data processing and storage will increase dramatically, and AMD stands to gain from this growth. Management expects the first quarter’s revenue to be around $5.4 billion (plus or minus $300 million), in line with the consensus estimate. Furthermore, adjusted gross margins could be around 52%. For 2024, analysts predict a 13.8% year-on-year increase in revenue, with continued growth of 25.9% in 2025. Earnings could increase by 37.5% in 2024 and 50.4% in 2025. What Do Analysts Say About AMD? Overall, Wall Street rates AMD stock as a “strong buy.” Out of the 33 analysts covering the stock, 27 rate it a “strong buy,” with one “moderate buy” rating and five “hold” ratings. AMD has already wildly surpassed its average target price of $186.14, but its high target price of $270 implies the stock could surge by 30.1% from current levels.Barchart On the date of publication, Sushree Mohanty did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policy here. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @dehandreh @yo44ge4real @stvmcg @Arcanebear.eth @retirewithforex @sethsickness @aliams_david_trading_gram @mytradingsetup @fx_bitcoin_expert11 @tradingfrance @mytradingsetup @jordan_fx_ @nav.fx @itzi71 @laptopmoneygang @heinrich_j96 @johndollery @aggressivecalculator Whatever the trade "
}