{
    "title": "Zoho's ManageEngine Invests $10 Mn in NVIDIA, Intel, and AMD GPUs",
    "date": "3/29/2024",
    "url": "https://analyticsindiamag.com/zohos-manageengine-invests-10-mn-in-nvidia-intel-and-amd-gpus/",
    "text": "ManageEngine, the enterprise IT management division of Zoho Corporation, has been accelerating its infrastructure development exponentially to unleash generative AI offerings for its customers.The company recently invested nearly $10 million in procuring GPUs from all three majors. “We are working closely with Intel, NVIDIA, and AMD,” said Shailesh Kumar Davey, co-founder and VP of engineering of ManageEngine, in an exclusive interview with AIM. “Considering NVIDIA’s dominance in the GPU market, we’ve allocated nearly $10 million for infrastructure investments, primarily in NVIDIA products, though we’ve also included Intel and AMD,” shared Davey. Zoho chief Sridhar Vembu expressed a similar sentiment on the sidelines of Zoholics in October last year when he discussed the short supply of NVIDIA GPUs and the six-month wait period. The wait is almost over. Recently, Yotta became India’s first company to receive the NVIDIA H100 GPUs, with Blackwell in the pipeline. Hopefully, Zoho’s ManageEngine will also get its NVIDIA GPUs really soon. “Whenever we discuss transformer models, we often think of GPT as a prime example. This leads to the assumption that a large-scale model like GPT is always necessary. However, that’s not the case,” said Davey, advocating for smaller, more cost-effective models tailored to specific needs. Further, he said that ManageEngine is looking at deploying smaller language models (SLMs) and medium language models (MLMs)—the likes of Llama 2, Mistral, Claude 3, and now DBRX. “We will deploy them in the cloud, and some of our tools are already adopted,” he added. He said that for large language models, the company has already partnered with companies such as OpenAI and Anthropic. In the coming months, it is also planning to build its own SLMs and MLMs. Going beyond the LLM hype, ManageEngage has been one of the early adopters of AI/ML. “Since 2011, we have incorporated AI/ML across our solutions, including IT operations, IT service management, IT security, and endpoint management. We offer nearly 50 different solutions to meet the needs of IT and enterprise IT teams,” he added. For nearly two decades, ManageEngine has been a significant player in the tech industry. Initially, the United States was its largest market, but India has been rapidly gaining ground. The surge in ManageEngine’s growth in India can be attributed to increased investment in IT infrastructure by sectors such as Banking, Financial Services and Insurance (BFSI), retail, manufacturing, and government. These sectors are the company’s primary markets in India. Davey said that the company’s focus on IT infrastructure in these areas has resulted in significant growth in India. He pointed out that just six years ago, the country ranked as the seventh or eighth largest market for ManageEngine. Now, it is their second go-to market for growth. “In the past four to five years, there has been a dramatic change. India is now our number two market, growing at 40%. In that, the cloud-based solutions are growing at 70%,” shared Davey. With UPI-like models mushrooming in Dubai and Saudi Arabia, he believes that these countries will also be digitising themselves. Davey said that there is a clear dichotomy in market growth: while developed countries are experiencing slower growth, emerging markets are rapidly expanding and leading the way in technological advancements. At present, the company provides both on-prem and cloud services and has two data centres in India—one in Chennai and another in Mumbai. “Data sovereignty is taken care of, and all our solutions are hosted in these two, catering to the needs of the Indian market,” said Davey. ManageEngine has 18 data centres and close to 100 POPs (point of presence), which are small one or two-rack solutions worldwide. They recently opened data centres in Canada and Saudi Arabia, and soon in the UAE. Data sovereignty is in its DNA. Nearly two decades ago, the company began developing its own hosting methods. “One decision we made in 2005 was to avoid using hyperscalers like AWS or Azure or GCP for hosting. We thought this could become a key competitive advantage,” said Davey, saying that people are now recognising more limitations in cloud services, leading to a shift away from them. Very early on, the company realised the importance of having engineering control over the entire stack—from the data centre it operates into the solutions deployed and how they are optimised. “We believe that optimising everything from the software to the server and the data centre can provide significant value to our customers,” said Davey ManageEngine is surely the “bread and butter” of Zoho, as it sets to cross $1 billion in revenue in a couple of years. Access all our open Survey & Awards Nomination forms in one place >> Discover special offers, top stories, upcoming events, and more. Stay Connected with a larger ecosystem of data science and ML Professionals “Mark your calendars for #WWDC24, June 10-14. It’s going to be Absolutely Incredible!” says Apple “Krutrim took a risk to be one of the first with a native model, but The company sees India as the second go-to market for growth and scale after the Voice Engine can create emotive and realistic voices with a single 15- second sample. Discover the transformative power of India’s leading GCC summits in 2024, shaping the future of Grok-1.5 beats Mistral Large on various benchmarks including MMLU, GSM8K and HumanEval. The company is seeking data scientists and engineers to further bolster its tech team. And we are nowhere close; the current Neuralink has about 1,000 electrodes implanted in the Decision Point’s expertise has garnered recognition from industry giants such as Microsoft and the Promotion © Analytics India Magazine Pvt Ltd & AIM Media House LLC 2024 The Belamy, our weekly Newsletter is a rage. Just enter your email below. "
}