{
    "title": "Macular Degeneration Research Heads to the ISS",
    "date": "3/14/2024",
    "url": "https://www.issnationallab.org/release-spx30-vision-loss-oculogenex/",
    "text": "ISS National Laboratory Taken with a specialized camera, images of a mouse retina before spaceflight (left) and a fluorescein angiogram, captured using a fluorescent dye, of the microvascular circulation of a mouse retina (right) are shown here. Media Credit: Image courtesy of Oculogenex March 14, 2024 CAPE CANAVERAL (FL), March 14, 2024 – Age-related macular degeneration (AMD) is a leading cause of blindness in older adults, affecting more than 200 million people globally. Patients in the intermediate stage of the disease currently lack an effective treatment to improve vision or slow disease progression. Now, a new gene therapy from biotech innovator Oculogenex, Inc. may change that narrative by preventing and even reversing symptoms of this pervasive condition. Set to launch on SpaceX’s 30th Commercial Resupply Services (CRS) mission to the International Space Station (ISS) contracted by NASA, an investigation to test the therapy in space may open new avenues for treating vision loss with this novel ocular gene therapy. Experiments on Earth have shown Oculogenex’s therapy is effective against retinal damage in models of retinal degeneration, indicating the potential to prevent progression to advanced AMD. However, these models do not emulate intermediate AMD’s milder, chronic oxidative stress. To address this, an ISS National Laboratory®-sponsored investigation by Oculogenex will validate spaceflight as a novel biologic model of intermediate AMD. It will allow the company to evaluate its therapy in the space environment, providing an unparalleled opportunity to replicate a hard-to-study stage of the condition. The investigation seeks to ascertain whether gene therapy can thwart spaceflight-induced retinal dysfunction and degeneration. “The microgravity investigation could pave the way for future clinical trials and treatments, offering hope to those grappling with this debilitating condition,” said Hema Ramkumar, CEO of Oculogenex and a physician treating people affected by macular degeneration in California. The gene therapy enhances cellular response to oxidative stress and prevents retinal cell death, an approach that aims to restore the functionality of damaged cells and prevent vision loss. “As we age, an epigenetic switch stops cellular repair, leading to cell degradation,” said Ramkumar. “Our gene therapy renews dormant retinal stem cells, enhances mitochondrial function, and prevents cell senescence and death,” she said. “By targeting this epigenetic switch, our therapy instructs cells to remain active and resilient, promoting repair and sustaining vision.” Distinguishing itself from conventional therapies that typically address singular factors, Oculogenex’s gene therapy will target the root causes of dry macular degeneration at the intermediate stage, for which there are currently no treatment options. Female rodents on the space station will be used to conduct this experiment, considering that macular degeneration disproportionately affects women. Spaceflight will serve as a disease model for age-related macular degeneration, with oxidative stress induced by spaceflight mirroring pathways observed in patients on Earth. Ramkumar explained, “By harnessing the distinctive conditions of spaceflight, we aim to gain invaluable insights into the potential of spaceflight as a model of dry AMD. We anticipate our transformative gene therapy strategy will translate into improved and preserved vision for the millions living with dry macular degeneration.” Oculogenex received funding for this investigation through the Technology in Space Prize, funded by Boeing and the Center for the Advancement of Science in Space, manager of the ISS National Lab, in partnership with the MassChallenge startup accelerator program. Since its inception, the prize has provided approximately $20 million in funding to 32 projects for R&D sponsored by the ISS National Lab. NASA’s SpaceX CRS-30 mission is slated to launch from Cape Canaveral Space Force Station in mid-March. This mission will include more than 40 ISS National Lab-sponsored payloads. To learn more about all ISS National Lab-sponsored research on this mission, please visit our launch page. Download a high-resolution photo for the release: Oculogenex Research Image Media Contact:        Patrick O’Neill 904-806-0035 [email protected] # # # About the International Space Station (ISS) National Laboratory: The International Space Station (ISS) is a one-of-a-kind laboratory that enables research and technology development not possible on Earth. As a public service enterprise, the ISS National Laboratory® allows researchers to leverage this multiuser facility to improve quality of life on Earth, mature space-based business models, advance science literacy in the future workforce, and expand a sustainable and scalable market in low Earth orbit. Through this orbiting national laboratory, research resources on the ISS are available to support non-NASA science, technology, and education initiatives from U.S. government agencies, academic institutions, and the private sector. The Center for the Advancement of Science in Space™ (CASIS™) manages the ISS National Lab, under Cooperative Agreement with NASA, facilitating access to its permanent microgravity research environment, a powerful vantage point in low Earth orbit, and the extreme and varied conditions of space. To learn more about the ISS National Lab, visit our website. As a 501(c)(3) nonprofit organization, CASIS accepts corporate and individual donations to help advance science in space for the benefit of humanity. For more information, visit our donations page. Read More Read More From the 1st launch back in 2013 to the most recent one, take a look back at all the science that launched to the ISS National Lab! Get Details Get details on our current and upcoming research opportunities. Details ISS National Laboratory® is a registered trademark of the National Aeronautics and Space Administration (NASA), used with permission. The ISS National Laboratory® is managed by the Center for the Advancement of Science in Space, Inc. under Cooperative Agreement with NASA. NASA Partner logo is used with permission. © 2011-2024 The Center for the Advancement of Science in Space, Inc. (CASIS), a 501 (c)(3) Corporation. "
}