{
    "title": "AMD vs Intel comparison - which is better in 2024?",
    "date": "1/2/2024",
    "url": "https://www.wepc.com/cpu/compare/amd-vs-intel-gaming/",
    "text": "Home » CPU » CPU Comparison » AMD vs Intel comparison – which is better in 2024? Looking for your next CPU, but you're not too sure whether to pick up an Intel or AMD CPU? We have you covered! WePC is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more Ever wondered which is better, AMD or Intel? We’re going to take you on a journey through both to find you the answers you seek. Here at WePC, we have slaved for days over testing the best CPU and best GPU from both AMD and Intel, making us experts in our field and more than qualified to educate you on the advantages and disadvantages each company presents. Choosing the best CPU for gaming or work is one of the most important decisions you will make when building your dream PC. This decision affects both the potential performance of your PC and the components you can subsequently equip it with. Here at WePC, we have the expertese to help you in this important desicion. We will take a deep dive into both AMD and Intel, not just as CPU manufacturers, but as companies. We will examine market shares, company profits, year-on-year growth, and more. By the end of this article, you will be an AMD and Intel expert! 3D V-cache makes for fantastic gaming performance Less limited thanks to dual CCD config Relatively efficient Expensive Locked to auto overclocking, no manual Shop on Amazon Efficient performance gains over the last generation Higher DDR5 XMP speeds beyond 8000MT/s Overclocking potential is high Intel Application Optimization is impressive Expensive, of course Has issues with ASUS MCE tech at present Shop on Amazon If you’re in the market for a motherboard, or need one for your shiny new CPU, we have a best motherboard of 2024 piece avalible to you as a resource. With that being said then, AMD or Intel, which is better? Let’s find out. The intel 14th generation is here! We have reviews of the 14600K and the 14900K if you’re interested in the performance of Intel’s latest. We are working on keeping all of the information in the article up to date, there is a massive set of information to be looked after and it takes a lot of time! Please be patient. Intel has finally released it’s 14th generation CPUs, the release culminated in a pretty big dissapointment for Intel, with the performance of the 14th generation CPUs barely able to exceed the 13th generation CPUs that came before them. It’s important to inlude the 14th generation, althoug we do not reccomend them as any kind of best Intel CPU. Intel and AMD have recently released their 13th gen CPUs and 7000 series CPUs respectively, and we want to take a brief look into each set of CPUs and determine which is objectively better. Both Intel and AMD have made glorious advancements in the CPU industry. There’s plenty to talk about here, so that is why we’ve broken it down into smaller easy-to-digest packages. We will analyze both CPU flagships from each team and determine which one would be best for you. We will also take the platform into account, but they’re both largely the same. The Intel 13th generation CPU is built upon the 10nm “Intel 7” process. This is Intel’s own in-house design and does not share any part of the manufacturing process with TSMC, as AMD does. The latest 13th-generation CPUs have broke ground in terms of what we thought was possible, setting new records in both clock speed and performance. We will now analyze the flagship 13900K CPU. Below we will list the specifications of the i9-13900K Below we will list the specifications for the Ryzen 9 7950X AMD Ryzen 7000 X3D are here, and they’ve taken the gaming performance crown away from Intel and its 13900KS. The new 3D V-cache is much improved from the previous generation, as it does not as heavily inhibit the CPU it’s featured in. But how does the X3D 3D V-cache work? and what is it? New AMD Ryzen 7000 X3D processors have integrated 3D V-Cache technology, which enhances the performance of 3D graphics-intensive applications like video games, animation, and video rendering. The V-Cache reduces the amount of data that must be transferred between the GPU and main memory, resulting in quicker rendering times and improved overall performance. The “3D” designation of the technology comes from the stacking of the cache memory. In X3D CPUs, the cache is stacked vertically on top of the Core Complex Die (CCD), rather than horizontally. This method enables the use of a larger amount of cache within the same footprint, without sacrificing access speeds. The AMD Ryzen 5800X3D boasts 96MB of total L3 cache, with 64MB being the new 3D V-Cache. During the keynote presentation at CES 2023, AMD compared the performance of two of its processors, the Ryzen 9 7950X3D and the Ryzen 7 7800X3D, against the 13900K and 5800X3D from Intel. The comparison was performed using 1080P resolution and high image quality settings, as stated by AMD at the Consumer Electronics Show (CES) 2023. According to AMD’s benchmark data, the 7950X3D performed about 10% faster, on average, than the 13900K. However, the accuracy of these results will not be confirmed until the X3D CPUs are officially released. Here is the benchmark data: The Ryzen 7 7800X3D was compared to the legend that is the previous generation’s Ryzen 7 5800X3D in 1080P on the high image quality preset. The Ryzen 7 7800X3D performance is better than the 5800X3D in all games by a considerable margin. Here are AMD’s benchmark results: As you can see, we’re anticipating great things from the Ryzen 7000 X3D line-up. We can’t wait to get our hands on the latest and greatest from AMD. Both CPUs are the titans of their company, both flagship models from either side. This is the bottle that everybody far and wide lines up to see. So, without further ado, let’s pit the Ryzen 9 7950X against the Core i9-13900K. It’s important to note that we tested these CPUs on systems as close to identical as possible. A like-for-like copy could not be achieved as each CPU requires a different platform. on paper, the 13900K has eight more cores, even if they are efficiency cores, and has a faster core boost speed. but will that be enough to cement the 13900K as the top-dog CPU? And will Intel finally be able to claim the single-core performance throne for themselves? Intel has a trick up its sleeve this time around, however, in addition to the 13900K being built on Intel’s LITTLE.big technology, half of the E-cores within the 13900K are hyperthreaded this time around. What does this mean? This means that, whilst less powerful, the hyperthreaded E-cores can now output almost double the processing power as the non-hyperthreaded ones. This little Ace in the hole is reflected in the benchmark results. As you can see, the 13900K dominates in nearly every space of our synthetic benchmarks. The 13900K manages to score over 4400 points in the Cinebench R32 multi-core benchmarks, showcasing just what those hyperthreaded E-cores can achieve. Everything else shouldn’t come as a surprise. Intel has always held the single-core performance crown, and this time is no different with its faster core boost speeds. Intel announced that Raptor Lake would be the first-ever architecture to play host to a CPU that hits a 6GHz boost speed out of the box. Here we will examine the price and specifications of a select set of AMD and Intel CPUs, which will help us determine the broader value of each company’s processors, and just how much your hard-earned money gets you when it’s given to either of these CPU giants. As a general rule, AMD’s processors are less expensive. Not only that, but AMD technically holds the record for the fastest gaming CPU with its 5800X3D. The 5800X3D managed to surpass the 12900KS, Intel’s latest flagship CPU, in some gaming scenarios. If you’re interested, we delve more into the 5800X3D in our Ryzen 7 5800X3D review. So, if AMD is faster as a whole and generally cheaper, then we have a winner, right? Well no, it’s not quite so clear-cut. Let’s take a closer look at some of AMD’s CPUs and their Intel counterparts. Let’s take a look at the two last-generation CPU flagships, the Ryzen 9 5950X and the Core i9 12900KS. Both the 5950X and the 12900KS are incredible processors, but there are clear differences in how they operate that define them, leading to massive performance differences in some cases. As we previously mentioned, Intel’s 12th-generation CPUs are built upon ARM’s LITTLE.big technology, splitting the CPU into P-cores and E-cores. The 5950X does not contain such technology, so its cores remain uniform. Because of this division of cores, the 12900KS has more power overhead to pump into its performance cores, allowing for its 5.5GHz max boost speed. Despite Intel’s recent efforts to increase CPU efficiency, the 12900KS still has a 45W higher TDP than the 5950X – totaling a huge 150W. The 5950X, with its eight additional threads, manages a TDP of 105W. When it comes to computing, having a strong cache is just as important as having CPU cores. The 5950X manages to pack almost double the cache of the 12900KS onto its die, that’s twice the stored and qued instructions ready for execution – lowering latency and increasing speed. You’d think that with the 5950X having more threads, almost twice the cache, and a lower TDP, the 5900X would be magnitudes more expensive than the 12900KS – but it isn’t. The 5950X is around $250 less than the 12900KS, but it is older. We’re still waiting for AMD’s response to Intel’s 12th-generation CPUs. That response is coming in the form of Zen 4 Raphael CPUs – more on that later. But if AMD can pack this much of a punch into a CPU that is a generation behind, then we can’t wait to see what the next generation of AMD CPUs can do. We have a review of the 12900KS, you can check it out here. With the flagships out of the way, let’s jump more toward mid-level processors. Okay, admittedly the 5800X3D isn’t exactly a mid-level processor, as it holds the title of the world’s fastest gaming CPU. This is all thanks to AMD’s 3D V-cache – the 5800X3D is the only desktop processor to feature this caching technology. Technically speaking though, in terms of specifications the 5800X3D is pretty mediocre, and at a first glance would be a good match for something like the 12700K – however, looks can be deceiving. This example serves as a reminder that the CPU industry is ever-changing, and it’s not quite as easy as it once was to analyze CPU specifications and come out with a clear winner. The 12700K has four more threads than the 5800X3D and four more processing cores. This makes the 12700K the better processor, right? Wrong, the 5800X3D has a huge advantage over the 12700K thanks to its 3D V-cache, despite its shortcomings in core speed, core count, thread count, and TDP. The 3D cache is stacked vertically as opposed to laterally, all thanks to recent technological advancements in 3D printing. Stacking the cache shiplets vertically drastically increases the number you can fit into one footprint, without compromising speed or efficiency. This vertical cache stacking has allowed AMD to pack 96MB of total L3 cache with access speeds of up to 2TB/s into the 5800X3D. This technology increases the amount of cache present and decreases cache latency, making for a better CPU overall. It seems as though AMD has the upper hand, even at the lower end of current-generation processors. On paper, these two CPUs seem incredibly similar, with the only real differences being in cache, and base clock frequency. Both are priced at around $180, making them the ideal ‘budget’ CPU. The 5600, with its larger cache, outperforms the 12400 in most cases. That being said, however, single-core performance is something the 12400 shines at, always scoring higher in single-core synthetic benchmarks. There’s not too much to say about these CPUs, as they’re incredibly similar, but there’s still a performance difference between the two. AMD almost always outperforms Intel in multi-core workloads, and Intel almost always nips the top spot in terms of single-core performance. AMD seems to be aiming for the multi-core performance side of computing, and if it can do that at a lower price point than Intel then it will, as it has proved time and time again. You can expect an AMD CPU to be efficient, easy to cool and dominate in the multi-core performance aspect of computing. Every AMD CPU generation gains ground toward taking the top spot from Intel, both in single and multi-core performance. AMD will always be a fan favorite, devoted to bringing the best performance possible, all while undercutting the competition in terms of price. At the heart of most budget PC builds, you’ll probably find team red. That’s not to say that budget builds are all AMD is good for. AMD is pushing the boundaries of CPU and caching technology with the 5800X3D, and swiping the top CPU for gaming spot off of Intel with that very same CPU. Intel aims to be the single-core rocket of the industry, putting all of its eggs into one CPU core. Intel has made progress towards higher frequencies on multiple cores, with its 12th generation of CPUs, instead of just one. As you can see, Intel dominates the single-core performance space, with titans like the 12900KS and the 11900K tearing holes through what we thought was possible – with blistering core boost speeds over 5GHz. However, Intel CPUs are a lot more pricey. We doubt you’d find many new Intel CPUs at the heart of many budget builds, but if you have money to burn and want the best of the best, Intel is a good way to go. If you’re a tech and PC enthusiast looking to push a component to the maximum, the favorite is always a CPU from team blue. Overclocking is an Intel game – something we’ll explore in more detail later on. Both Intel and AMD have CPU suffixes or ‘identifiers’ that help us determine what type of CPU it is, whether that be low power, with or without integrated graphics, or if it’s unlocked for overclocking. These identifiers come in the form of one or two letters at the end of the SKU. Here are the Intel CPU identifiers. Here are the AMD CPU identifiers, since they have been known to also cause some confusion. As you can see, there is a multitude of different CPU identifiers – this isn’t even all of them. We only outlined the ones that may still be relevant, even to those of you that have some of the older CPUs. But how does all this equate to performance? For the purpose of this article, we have split this performance section into two, gaming performance and workstation performance. CPUs, being multi-core and multithreaded, now have two main areas to focus on in terms of performance – single and multi-core performance. Single-core performance covers gaming for the most part, and multi-core performance covers workstation tasks, although more and more games are utilizing multiple cores these days. So, with that out of the way, let’s get into it. We’re basing this portion of the article on data from Primate Labs, the company behind the Geekbench benchmark software. First of all, let’s cover single-core performance. As we mentioned earlier, and as you can see from this graph, Intel still very much dominates the single-core performance scene, with the Core i9 12900K scoring almost 2,000 points in Geekbench benchmarks. Interestingly enough, our 12900KS only scored 1,998 in single-core benchmarks, but we have no idea what kind of system this data was collated on. But it is safe to say, in our testing, the 12900KS outperformed the 12900K by about 1.36%, cementing the 12900KS atop the leaderboard for the fastest single-core performance in the world. You may notice that there’s not a single AMD CPU listed here. You may remember us mentioning that AMD isn’t really in the running for great single-core performance just yet, although we expect that to change with the release of Zen 4. We’re again basing this portion of the article on the same data from Primitive Labs, only this time it’s for multi-core performance. Okay, what’s going on here? What’s a Threadripper? A very valid question, let’s briefly discuss what these new types of CPU are. Threadrippers and Intel Xeon processors are specially designed workstation processors, designed with a high core count, massive cache sizes, and lower clock speeds. Xeon processors are more geared toward server setups, but the same design principles apply. Since these CPUs aren’t really gaming-focused, we haven’t touched upon these much at all. In fact, there are multiple types of processors we haven’t discussed. The CPU world is large, vast, and very populated with things the general public never really sees. Tangent aside, note that these CPUs have up to 64 cores/128 threads, and make a 5950X look like a Tamagotchi. Observe that a good 60% of this graph belongs to team red, but it’s not just how many AMD CPUs are up there, it’s also the score they lead by. The best CPU on this list, as of February 2020, is the Threadripper 3990X. This CPU has a full 5,000-point lead over the best Intel can come up with – that is a very impressive lead. Remember when we mentioned that AMD has multi-core processing locked down? Well, we meant it. We also expect this to change somewhat with the release of AMD’s 7000 series CPUs. Note: this data is from February 2022, and will be updated with dates from newer CPU releases as soon as it’s available. The iGPU that resides in the 13th-generation of Intel CPUs is the exact same one that can be found inside the 12th-generation processors. The Intel UHD 770 iGPU. We also tested the Intel iGPU to see if its performance has been improved over the last generations application of it. First of all, we tested the iGPU in 3DMARK’s Time Spy. In Time Spy, the 13900K managed to score a respectable 1,388 points in 1080P, that’s way ahead of the 7900X’s 739 points. However, the 7900X only had two computing units to work with. Both GTA V and CS:GO actually wielded similar results, with a 64 FPS average and a 60 FPS average respectively. Not a terrible performance, of course, the settings were set to the lowest of the low in GTA V but set to high in CS:GO. Both games were tested at 1080P. These results seem strange compared to the 7900X’s results. As the 7900X managed 54 FPS in GTA V, but 131 FPS in CSGO, much lower performance in GTA V, but much higher in CS:GO. We do know just how powerful the new RDNA 2 architecture is, and it’s strange to see it have such an affinity for older games. This makes AMD’s APUs a little harder to come by. Because of this, Intel dominates the GPU market, despite not making a single dedicated GPU. As you can see, Intel holds a majority share of the GPU market, and this came as a surprise to us. We assume this is because of how saturated Intel has made the CPU market. Take a look at how many Intel CPUs were released this generation compared to AMDs – because of this sheer mass of CPUs containing iGPUs designed by Intel, it holds the majority share. Never before has one word struck so much fear into the hearts of CPU novices, but in this day and age, overclocking is a pretty safe and useful practice. To understand who and what can be overclocked, we need to refer back to that CPU identifier table we showed you earlier. You may notice that we only displayed Intel’s suffix table, and this is for a very good reason. Only a select few Intel CPUs have the privilege of being unlocked to overclocking., These are the K, KS, and KF variants – basically, if it has a ‘K’, you’re okay. Meanwhile, technically every AMD CPU is unlocked to overclocking, except the new Ryzen 7 5800X3D. However, AMD has a special ‘X’ variant that gives you an extended frequency range, which means it’s more susceptible to overclocking. The rest of the AMD CPUs are boosted by AMD’s own PBO (precision boost overdrive). Overclocking also largely depends on your motherboard, and whether it supports overclocking your CPU – we’ll go more into motherboards later. Overclocking is safer than it’s ever been before, but that does not mean you can’t damage your CPU or motherboard. Extreme care should be taken when overclocking any of your PC components. If you want to know how to safely overclock your CPU, check out our ‘how to overclock your CPU’ guide. Here we will explore the potential compatibility headaches each CPU manufacturer brings to the table, and how you could possibly circumvent them. Each CPU manufacturer has a different set of motherboard chipsets available to them, each with its own advantages and disadvantages. AMD has compatibility in the bag. After a recent update, AMD has extended the compatibility of most motherboards to accept all Ryzen processors, from 1st Gen all the way to 4th. The exceptions to this are lower-end A series motherboards. We’d recommend you google it first, but whatever AM4-based CPU you currently have, chances are that it will fit into every AM4 motherboard – with a little BIOS update. This fantastic compatibility can’t last forever, though. AM4 has been in service for a little over six years, and with it being stuck on PCIe gen 4 and the DDR4 RAM standard, it’s starting to show its technical limitations. This is where AM5 comes in. AM5 is the next generation of CPU sockets, designed for future compatibility just like AM4. AMD will be making the switch to AM5 with the release of its Zen 4 Raphael CPUs. The respective AM5 motherboards are expected to release alongside the CPUs because, well, it would be silly not to, wouldn’t it? More on this later. But if you can’t wait until later arrives, you can check out our ‘AM5 what we know’ article. The thing is, Intel isn’t really the kind of company that builds future compatibility in its tech. Intel, in recent years, has upgraded its motherboards and socket systems for each new CPU release – forcing users to pick up a new motherboard alongside a CPU. While AMD CPUs needing BIOS updates to extend the compatibility of processors is a little annoying, imagine having to buy a whole new motherboard and rebuild it into your PC every time you want a new CPU. Whilst LGA 1151 did extend from Kaby lake (7th gen) all the way up to Coffee Lake (9th gen) it’s nothing compared to the compatibility offered by AM4. Speaking of compatibility, we arrive nicely at motherboards. Motherboards don’t really have a huge connection to this article, however, they are important to your CPU. Motherboards affect aspects such as performance, overclocking, and power delivery. So, we’re going to cover the latest generation of motherboards briefly. Much like CPUs, motherboards are very important to your PC’s operation. The Motherboards are the component that all your other PC parts connect to in order to communicate with one another. Like CPUs, some motherboards are better than others, and they follow a similar set of suffixes or identifiers. Below are both AMD and Intel motherboard identifiers. As you can see, Intel is as confusing as ever, using the same letter twice to indicate two different chipset types. Despite the confusing letters on Intel’s part, both manufacturers use a system of letters to indicate how powerful or feature-rich a motherboard is. Above, we used the word ‘chipset’, but what is that exactly? A chipset resides on every motherboard and is one of the most important components of a motherboard. The chipset is the device that controls the communication between your CPU, RAM, and other components and peripherals. The chipset also determines how many devices such as USB devices your motherboard can support at any given time. Chipsets are usually composed of one or more chips that feature controllers for hardware devices and more commonly used peripheral devices, such as keyboards and mice. If you know anything about motherboards you will have heard the terms X570, Z690, B440, and so on – these are the chipsets. The names can seem confusing at first but all you need to know is that they follow the hierarchy we discussed earlier for both AMD and Intel processors, and the higher the number the better the chipset and the more it will support. Now chipsets are out of the way, we can discuss why motherboards are important. We will now outline a few examples where the wrong motherboard choice can break a setup. We think you understand that there are plenty of incompatibilities you can run into. With technology advancing faster than ever and more components being available to us, it’s imperative you pay attention to the components on hand, and whether or not they are compatible. The current top-dog motherboards are the X570 for AMD and the Z690 for Intel. If you want to get the most out of your 5000 series AMD CPU or your Intel 12th gen, you should consider one of these. Below are some of our ‘best of’ guides for motherboards. Here we will take a look at AMD and Intel’s revenue, year-on-year growth, market share, and a few other things to determine how they’re both performing as companies and not just CPU manufacturers. The following data comes courtesy of macrotrends, and details of both AMD and Intel can be found here: First up under the microscope is AMD. AMD has been on the rise since 2017 in terms of revenue. In 2017, AMD earned annual revenue of $5,253 (millions of US$) and grew exponentially to a revenue of $16,434 in 2021, an increase of 212.85% over four years. AMD has since been able to sustain an average YOY quarterly growth rate of about 50% from 2017 until 2021. Although we don’t have full numbers for 2022, as we’re only halfway through it currently, we do have AMD’s first-quarter revenue for 2022. AMD’s first quarter stands at $5,887, a record-high number for AMD. Here’s Intel’s revenue and YOY growth. Intel right off the bat brings in much larger numbers than AMD. Intel, in 2017, earned annual revenue of $62,761 (millions of US$) and in 2021, it brought in a revenue of $77,070, meaning an increase of 22.79% for the company over four years – much less than AMD’s growth. YOY growth of Intel is a little unsteady, with half of 2019, 2020, and 2021 seeing year-on-year decreases of around 1% on average over the three periods. Again, we’re only halfway through 2022, but in Intel’s first quarter of 2022, it netted $18,353 (millions of US$), nowhere near a record high for the company. Intel’s best quarter came in the third quarter of 2021 with a revenue of $20,528 Here we will analyze both AMD and Intel’s revenue numbers and compare them. This information is only up to data as of 2022, but we are working hard to gather eveyerhting and keep the data as up to date as possible. When comparing the two companies in terms of revenue, they are completely different beasts. Intel brings in magnitudes more than AMD does and at first, it might be hard to understand why. Intel only offers CPUs, right? Well yes, and no. The reason Intel makes so much money compared to AMD is the fact that Intel has completely saturated the market in terms of CPU numbers. Following the Steam hardware survey, we see that in February 2018, 90.91% of people that used Steam had an Intel CPU – that’s 90% of Steam’s reported 18.36 million concurrent users that month. This translates well to revenue. Intel’s revenue is greater than AMD’s because of Intel’s hold on the market – that is changing, however. AMD is creeping closer and closer to Intel. Even if it seems like they’re still a million miles away, they’re in a much better position thanks to the success of Ryzen, and deals involving EPYC server solutions. In recent years, AMD CPUs are becoming more and more popular in the eyes of consumers, thanks to amazing technology and hard-to-beat prices. The below chart shows the sales of both AMD and Intel CPUs through German retailer Mindfactory. As you can see, AMD has been dominating the market in terms of sales for the last few years, selling thousands more CPUs every month than its competitor. We know this is only one retailer, but it does reflect a global trend. The fact of the matter is, people, love AMD and if it wasn’t for the stock shortages around the launch of the 5000 series, we feel AMD would be in an even better place. This data is a little old now, but we are waiting for updated information. The older data goes to show just how far AMD has become in the last few years, since the release of Ryzen CPUs. We see AMD and Intel processors used in desktop PCs, laptops, tablet computers, and servers. Now, while Intel has been the market leader in the CPU realm for a long time, AMD hasn’t stopped growing in strength, especially since the latest CPU architecture release. From 2014 to 2018, Intel’s revenue grew from $55.9B to $70.8B, and AMD’s from $5.5B to $6.5B. Despite the dominance of Intel, both companies saw a very similar average revenue growth rate of 6.2%(Intel) and 6.4%(AMD). So, where is the revenue coming from? As you can see from these figures by Trefis, both manufacturers’ primary source of revenue comes from China, with the US only accounting for half as much for both Intel and AMD products. Here is a brief history of both the companies we’re analyzing in this article. This may help you better understand the state of things, and why these two companies always seem to be at each other’s throats. All we know is that after putting this together, we have a newfound appreciation for both. So maybe you will too.   AMD (Advanced Micro Devices) is a company that specializes in manufacturing semiconductor devices used in computer processing. The company also produces flash memory, graphics processing units, motherboard chipsets, and a further variety of goods used in consumer electronics. AMD is based in Santa Clara, California.  The company AMD was first founded in 1969 by a man named Walter Jerrohmiah Sanders, a former executive at Fairchild Semiconductor Corporation. AMD released its first product in 1970 and decided to go public two years after that.  In the Mid 1970s, AMD began producing computer chips. AMD started out as a second-source manufacturer of computer chips, but AMD placed a great emphasis on quality and started growing steadily.  In 1982, AMD began to supply second-source chips to Intel, which made the microprocessor used in IBM personal computers. The agreement with Intel then ended in 1986.  In 1991, AMD released its Am386 microprocessor family, a reverse-engineered chip that was compatible with Intel’s next-gen 32-bit 386 microprocessor. There ensued a long legal battle that eventually led to the U.S. Supreme Court ruling in AMD’s favor in 1994.  That same year, Compaq Computer Corporation contracted AMD to produce Intel-compatible chips for their computers.  In 1996 AMD acquired a microprocessor company called NexGen and began branching out from the Intel-compatible chip market.  In 2000, AMD introduced the Athlon processor line-up, which was designed to run Microsft’s Windows operating system. With the release of the Athlon CPU, AMD became the first ever company to produce a 1GHz processor. Which marked AMD as a serious competitor in the CPU market.  In 2006 AMD absorbed ATI Technologies, a manufacturer of GPUs. Back in 2008 AMD announced plans to split the company in two, with one half designing microprocessors and the other half tasked with manufacturing them.  In 2009, The European Commission fined Intel a record $1.45 billion for engaging in anti-competitive practices. That violated the European Union’s antitrust laws. These practices involved Intel financially compensating and rebating manufacturers and retailers who favored its computer chips over AMD’s, as well as paying manufacturers to cancel or postpone the launching of products that used AMD’s chips.  In 2014, the company was restructured into two main parts, one for manufacturing CPUs and the other for manufacturing graphical components.  It was around this time that Dr. Lisa Su took over as CEO, this marked the beginning of one of the most miraculous technology company turnarounds in history.  The first Ryzen CPUs were released in 2017 under the guidance of Dr. Lisa Su, AMD began to make headway in the CPU market once more with their affordable and powerful CPUs. The rest you probably already know. AMD is now a formidable force in the CPU industry, making anything from server EPYC chips to budget desktop chips. With five Ryzen generations under their belt.    Intel, or in full Intel Corporation, is an American manufacturer of semiconductor computer circuits. Coincidentally, Intel is headquartered in Santa Clara, the same as AMD.  Intel was founded in July 1968 by American engineers Robert Noyce and Gordon Moore. These founders were already middle-aged technologists with established reputations. Noyce was the coinventor of the silicon integrated circuit back in 1959 when he was the general manager of Fairchild Semiconductor. And Moore was the head of research and development at Fairchild Semiconductor at the same time.  Noyce and Moore recruited other Fairchild employees, including American businessman Andrew Grove. Noyce, Moore, and Grove served as chairman and chief executive officer in succession during the first three decades of Intel’s history.  Intel’s first-ever products were memory chips, including the world’s first metal oxide semiconductor, 1101, which didn’t do too well in terms of sales. But its sibling, however, 1103, a one-kilobit dynamic DRAM chip, was a big hit. It was the first chip to store a significant amount of information successfully. The technology was then purchased by Honeywell Incorporated in 1970.  Since DRAMs were cheaper and used less power than core memory, they quickly became the standard memory devices in computers worldwide.  Intel then became a public company in 1971 following the success of DRAM. That very same year, Intel introduced its EPROM chip, which was the company’s most successful product up until 1985.  In 1974, Intel controlled 82.9% of the DRAM market but, with the rise of foreign semiconductor companies, the company’s market share dropped to 1.3 percent by 1984. By that time, however, Intel had shifted its focus from memory chips to its microprocessor business.  Of the many microprocessors Intel produced after 1971, the most important may very well be the 80386, a 32-bit chip released in 1985 that started the company’s commitment to making all future microprocessors backward-compatible with previous Intel CPUs. Users were assured that the technology developed for older Intel CPUs, would also be compatible with the newest ones.  Intel’s business strategy relied on making newer microprocessors much faster than previous generations to convince users to upgrade the processors in their PCs. One way to accomplish this was to manufacture chips with vastly more transistors in each processor.  For example, the 8088 found in the first IBM PC had 29,000 transistors, while the Intel 80386 that debuted four years later included 275,000, and the Core 2 Quad released in 2008 had more than 800,000,000 transistors. The Itanium 9500, which was released in 2012, had 3,100,000,000 transistors. This observed growth in transistor count became known as Moore’s law, named after company co-founder Gordon Moore.  In 1991, Intel began increasing brand awareness by launching advertisements including the iconic “Intel Inside” slogan that still holds up today.  back In 2009, the  European Union fined Intel $1.45 billion for alleged monopolistic actions. In 2009 Intel also paid AMD a massive $1.25 billion to settle a decades-long legal dispute in which AMD accused Intel of pressuring PC makers not to use the former’s chips or technologies in their products.  Ever since Intel and AMD have been at each other’s throats trying to one-up each other. Currently, Intel’s CPUs are seen to hold the title of the best single-core performance and AMD CPUs hold the best multi-core performance title. But the trouble is,  both companies want both.  This was a brief history of both AMD and Intel, most of the information was sourced from Britannica. So, who is better? Well, technically speaking it’s Intel. Intel has dominated the CPU market for a very long time and continues to do so, regardless of the fact AMD is slowly gaining on them – winning is winning. Who makes the better CPU? Now that is a good question, one we feel should be answered with another question – what do you need the CPU for? If the answer is single-core performance then it’s a resounding Intel. Intel has single-core CPU performance on lockdown, and it looks like that reign may only be ended by Zen 4. For now, though, Intel does the single-core performance better. However, if you’re looking for some weight in the multi-core performance area, then you need to pick up an AMD CPU. Multi-core workloads include gaming too, as we mentioned earlier. AMD managed to snag the title of fastest gaming CPU with the 5800X3D, a pretty impressive feat when you consider what it’s up against and the limitations placed on it. What about the future? AMD seems to have an incredibly promising future, as recently a Zen 4 engineering sample was leaked reporting an all-core boost speed of 5.21GHz, and boasting RDNA2 GPU capabilities. We already know AMD’s integrated graphics are much better than Intel’s and achieving an all-core speed of 5.21GHz is very impressive, engineering sample or not. The battle for dominance between AMD and Intel is far from over, but now the ball is in AMD’s court. What will Zen 4 and AM5 bring? We hope to find out soon enough. Objectively, AMD CPUs are better at multi-core performance. But Intel CPUs take home the gold when it comes to single-core performance. But for us, AMD is easier to use. Intel tends to have stronger CPUs that are way less prone to damage due to the lack of Pins. AMD CPUs that work off the PGA standard (Pin grid array), are much more prone to accidental damage. If you’re taking in terms of software and use case reliability, they’re both pretty par for the course. It all depends on how you take care of your hardware. Jack is a Tech and News Writer who has a vast and proficient knowledge of CPUs, Motherboards, and Computer technology. Trusted Source WePC’s mission is to be the most trusted site in tech. Our editorial content is 100% independent and we put every product we review through a rigorous testing process before telling you exactly what we think. We won’t recommend anything we wouldn’t use ourselves. Read more *UPDATED* AMD Ryzen 7000 series Zen 4 release date, pre order & price AMD Ryzen 6000 series: release date & more – what we know AMD Ryzen 7000 series – Where to buy 7000 series CPUs, Zen 4 Pre order & Price AMD Zen 3D: Release date, price, and everything we know The Warehouse, Use Space, Paddock St, Manchester M12 6PN WePC is the essential site for serious PC gamers. We offer everything from high end PC custom builds and advice to the latest hardware and component reviews, as well as the latest breaking gaming news. You take your gaming PC seriously. So do we. WePC. ©2024 WePC. All rights reserved. Part of "
}