{
    "title": "Minisforum BD770i review: The mini-ITX motherboard with AMD Ryzen 7 7745HX \nas the basis for small gaming PCs",
    "date": "1/13/2024",
    "url": "https://www.notebookcheck.net/Minisforum-BD770i-review-The-mini-ITX-motherboard-with-AMD-Ryzen-7-7745HX-as-the-basis-for-small-gaming-PCs.792900.0.html",
    "text": "Minisforum, renowned for its Mini-PCs, is stepping into new territory with the Minisforum BD770i by offering a motherboard with a soldered CPU. Adhering to the ITX standard as the form factor, this motherboard is compatible with most PC cases. Given its compactness, it is likely to find applications in very small Mini-ITX housing. The BD770i is powered by an AMD Ryzen 7 7745HX processor, featuring eight Zen4 cores. This SoC is expected to deliver ample performance for handling complex tasks. We delved into the gaming performance together with an Nvidia GeForce RTX 4090, as the graphics card can operate at peak performance thanks to the full PCIe x16 slot. Minisforum currently offers five different motherboards, each equipped with a processor from the notebook sector. In the following overview, we have compiled information about these devices, highlighting their key specifications.  In order to ensure the test's authenticity, we choose to run all tests without a dedicated graphics card. We used the Phanteks Enthoo Evolv Shift XT case, chosen for its compact design, to provide a solid foundation. Additionally, for the performance comparison involving a dedicated graphics card, we assessed the Minisforum BD770i alongside the Palit GeForce RTX 4090 GameRock OC in an open setup. The size of the graphics card prevented its installation in the Phanteks Enthoo Evolv Shift XT. The case accommodates graphics cards with a length not exceeding 32.4 centimeters. Included in delivery is the Minisforum BD770i mainboard With a SoC heat sink already fitted. Furthermore, a relatively large WLAN antenna with a magnetic stand and the matching IO shield are included also. Other parts are needed in order to operate the Minisforum BD770i. Neither a 120-millimeter fan nor pre-installed RAM or SSD are offered by the producer. In addition, a suitable PC power supply is needed; it should be small and in SFX format to fit within the Phanteks Enthoo Evolv Shift XT case. Consequently, the Minisforum BD770i serves as a solid foundation for a compact DIY PC in a miniature form factor. Equipped with the AMD Ryzen 7 7745HX, the Minisforum BD770i mainboard features a modern SoC, albeit not the latest AMD processors. Nonetheless, the installed SoC stands out with its eight Zen4 cores capable of processing 16 threads. The excellent cooling ensures consistent high performance, and thermal limitations are not as severe as in laptops or mini PCs. In our performance assessment, the AMD Ryzen 7 7745HX closely trailed an  AMD Ryzen 7 7800X3D. In comparison to Intel, it surpassed a Core i5-12600K, although an Intel Core i5-13600K performed slightly better. We appreciated the strategy of integrating a mobile processor into a traditional desktop PC, as these CPUs are generally easier to cool while still delivering commendable performance. Even a current Intel Core i5-14600K only achieves a ten percent lead in the performance rating. This highlighted the positive performance development of mobile SoCs with efficient cooling. During individual tests, the AMD Ryzen 7 7745HX may not match the performance of well-known flagship models due to its lower core count. Notable is the comparison of the AMD Ryzen 7 7840HS and the AMD Ryzen 9 7940HS, which were both evaluated in Minisforum Mini-PCs (Minisforum EliteMini UM780 XTX and Minisforum Venus Series UM790 Pro). Not to be overlooked is the fact that the two HS models use marginally less power. Nonetheless, it becomes apparent that mobile SoCs can deliver significantly more performance with effective cooling. This requires appropriate UEFI settings that allow the processor to receive more sustained power, provided thermal conditions permit. The BD770i from Minisforum does not artificially limit values, and the power limit can be manually adjusted. In the default state, we documented a stable power consumption of 75 watts for the AMD Ryzen 7 7745HX. For additional comparisons and benchmarks, please refer to our CPU comparison table. * ... smaller is better The Cinebench R15 Multi continuous test provides an initial insight into the performance of the installed cooling solution. Overall, the AMD Ryzen 7 7745HX demonstrates relatively stable performance. With an average score of 2,867 points, our test sample delivered an outstanding result in this scenario. Notably, it outperforms the result obtained by an AMD Ryzen 7 7840HS in this measurement. In terms of system performance, we briefly outlined our subjective experience with the Minisforum BD770i test system: The system's performance was consistently high, with the native 8-core handling demanding applications effectively. Paired with the fast NVMe SSD and DDR5 RAM, it ensured a swift operational speed. This observation held true for all the comparison systems mentioned here. No combination exhibited significant shortcomings, and the differences were mainly measurable. The Minisforum BD770i system ranked in the lower midfield, a position shared with the two mini PCs from Minisforum. While these devices may not have matched a high-end desktop system in power, it's essential to note that this comparison was somewhat unfair. However, including these devices in the overview provided a better context for evaluating the performance of the Minisforum BD770i with the AMD Ryzen 7 7745HX. * ... smaller is better In our test system built around the Minisforum BD770i, we observed very low latencies. Whether engaged in simple internet browsing or playing a 4K test video, even the Prime95 stress test did not lead to high latencies. As a result, the Minisforum BD770i mainboard is well-suited for creating compact and quiet streaming systems for the living room. * ... smaller is better As previously mentioned, Minisforum provides the BD770i mainboard without built-in mass storage. For our testing purposes, we utilized a relatively affordable 2 TB SSD from the manufacturer Fikwot. This model employs the M.2 interface and connects via PCIe 4.0 x4, resulting in excellent transfer rates. The mainboard supports up to two mass storage devices and is compatible with the latest PCI 5.0 standard. The SSDs can also be equipped with active cooling, particularly beneficial for PCIe 5.0 SSDs. Throughout our testing, our SSD exhibited no thermal issues under load, maintaining consistent performance. For additional comparisons and benchmarks, please refer to our comparison table. The AMD Ryzen 7 7745HX is equipped with an AMD Radeon 610M iGPU. However, this iGPU is based on the RDNA2 architecture and offers only 2 Compute Units (CUs), resulting in a total of 128 shader units handling 3D calculations. Consequently, the performance of the AMD Radeon 610M is relatively modest.In our average comparison, the Minisforum BD770i's iGPU exceeded that of a conventional laptop but was confined to simple graphics tasks. Expectations beyond simple image output should be kept in check given the limitations of this entry-level graphics solution. For additional comparisons and benchmarks, please refer to our GPU comparison table. Only a limited amount of 3D applications may benefit from the AMD Radeon 610M's performance, as demonstrated by the synthetic benchmarks. This is also evident in the gaming tests. The integrated GPU (iGPU) can only generate decent frame rates at the lowest graphical settings and a resolution of just 1,280 x 720 pixels. The two Mini-PCs equipped with the AMD Radeon 780m iGPU deliver noticeably better performance, but even in these cases, the system quickly reaches its limits when trying to play modern games. All current graphics cards can be easily connected via the PCI Express interface. For a comprehensive overview of the iGPU's performance compared to other graphics cards, please consult our GPU game list. If you intend to use the Minisforum BD770i mainboard as the foundation for a gaming system, you can proceed without hesitation. The AMD Ryzen 7 7745HX boasts ample performance reserves to keep up with current systems. In synthetic benchmarks, our test system even managed to secure the third position. However, due to the size of the graphics card, we had to utilize the Minisforum BD770i in an open configuration for these tests, as the Pait GeForce RTX 4090 Gamerock OC is too large for the Phanteks Enthoo Evolv Shift XT case. In terms of gaming benchmarks, it is crucial to make a distinction: when determining pure CPU performance, it is essential to stay within the CPU limit. In this scenario, the AMD Ryzen 7 7745HX is on par with an Intel Core i7-13700, and even the Intel Core i7-13700K cannot outperform it. The ranking of our test sample remains consistent at higher detail levels and maximum settings. The Minisforum BD770i mainboard continues to compete with the Intel Core i7-13700, and when examining individual tests separately, the AMD Ryzen 7 7745HX, paired with the Palit GeForce RTX 4090 Gamerock OC, can compete with top models in certain instances. All current titles may be played smoothly in 2,160p with no loss of detail in this configuration.All the systems listed in this comparison were tested with the same graphics card, namely the Pait GeForce RTX 4090 Gamerock OC. An important note when using an Nvidia GeForce RTX 4090: Our test sample of the Minisforum BD770i was not equipped with the latest BIOS during testing. Consequently, the graphics card was only connected with PCIe 4.0 x1. Version 1.05 is the only one that allows the graphics card to run at maximum bandwidth; it can be found on the support website. The BIOS update process can be initiated directly from Windows. Minisforum provides the BD770i mainboard with a pre-installed heatpipe cooling system. However, users are given the flexibility to choose the 120-millimeter fan for installation. It's worth noting that temperature variations may occur with different fans compared to our Noctua NF-A12x25 fan. Overall, we have few criticisms about the cooling unit. The SoC and voltage converters on the motherboard receive direct cooling, emphasizing that alternative coolers cannot be installed. The temperatures of the AMD Ryzen 7 7745HX hover just above 90 °C in both closed and open systems. This is within the acceptable range for a CPU from the mobile sector, as AMD's specifications allow the processor to reach temperatures up to 100 °C before experiencing performance reduction. Even during extended stress tests, we did not reach 100 °C. One of the standout features of the Minisforum BD770i is its power consumption. We recorded only 127.5 watts in the Cinebench R15 Multi test, resulting in exceptional efficiency, surpassing other desktop systems in comparison. In gaming scenarios, where a significant portion of energy is utilized for the graphics card's performance, we documented a comparatively good result with an average of 495 watts. The efficiency of the AMD Ryzen 7 7745HX is on par with the AMD Ryzen 7 7800X3D. However, in terms of efficiency in gaming mode, the AMD Ryzen 7 7745HX outperformed the AMD Ryzen 7 7800X3D. Without the use of a dedicated graphics card, the test system operateed significantly more economically, requiring an average of only 60 watts in gaming mode. Regarding overall operation and noise levels, we observed that our installed power supply unit is audible in our test setup. Throughout both idle and load conditions, we did not detect any measurements influenced by the installed adapter. The small pre-installed fan for active cooling of the SSD operates very quietly and remains inaudible from a closed case. The BIOS settings on the Minisforum BD770i motherboard offer limited options for adjustment. Users can set the CPU power in predefined steps (45, 55, and 75 watts) and adjust the maximum CPU temperature to any value. Compared to well-known motherboard producers, the Minisforum BD770i motherboard has more limited setting options. The ability to adjust the fan curve might be a valuable addition for users who prefer flexibility over experimenting with the SoC's power and temperature limits. * ... smaller is better * ... smaller is better The Minisforum BD770i from the Chinese system producer, known for compact PCs, provides an excellent foundation for building highly efficient devices. With the BD770i, Minisforum caters to customers interested in self-assembling their systems, as the package includes only the mainboard with a permanently installed CPU and a pre-assembled heatpipe cooler. This offers the flexibility to create budget-friendly systems for everyday office use or powerful gaming setups by incorporating a dedicated graphics card. Featuring the AMD Ryzen 7 7745HX, the Minisforum BD770i delivers robust performance and supports future graphics cards with its PCIe 5.0 connection. The strategy of integrating a mobile CPU into a desktop has proven to be successful. The effective power delivery, free from thermal throttling, ensures remarkable efficiency due to the low power consumption. Even compared to AMD's current X3D processors, renowned for their outstanding efficiency, the Minisforum BD770i mainboard holds its ground. While the initial price of ~$399 may seem steep, considering its performance class in relation to a conventional desktop system, the Minisforum BD770i could be a compelling choice. It's particularly suitable for users who don't plan to upgrade their CPU later on. Even so, it's important to note that this is a sort of barebone system, entailing additional costs to make the device fully operational. Minisforum sells the BD770i via Amazon, where the mainboard can also be bought for $399. The present review sample was given to the author by the manufacturer free of charge for the purposes of review. There was no third-party influence on this review, nor did the manufacturer receive a copy of this review before publication. There was no obligation to publish this review. "
}