{
    "title": "Obscure Chinese brand beats HP, Dell, Lenovo to deliver first tablet with \nAMD's latest Ryzen 8000 CPU — you can ...",
    "date": "1/20/2024",
    "url": "https://www.techradar.com/pro/obscure-chinese-brand-beats-hp-dell-lenovo-to-deliver-first-tablet-with-amds-latest-ryzen-8000-cpu-you-can-even-use-it-as-a-portable-monitor-and-heres-how-it-works",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Minisforum's V3 tablet even runs Windows 11 Pro Minisforum, best known for its range of mini PCs, has launched the world's first 3-in-1 Windows tablet powered by AMD's latest Ryzen 8000 CPU. The tablet, named V3, also doubles as a portable monitor, offering flexibility for users on the go. The 14-inch LCD screen has a resolution of 2560x1600 and a 165Hz frame rate and 500nit brightness. It supports VLink (DP-in video input), which allows the tablet to serve as a secondary screen. The V3 is powered by a Ryzen 7 flagship processor backed up by AMD Radeon 780M graphics and up to 32GB of LPDDR5 RAM. Storage comes in the form of an M.2 PCIe 2280 SSD up to 2TB capacity. There are two USB4, full function, Type-C ports and one USB-C, VLink (DP-in) and a SD card slot. Connectivity is provided in the form of WIFI 6E (802.11ax) and Bluetooth 5.3. It comes with a detachable keyboard with backlight and an active pen for writing and drawing. One of the standout features of the V3 is its cooling system. It is equipped with dual fans and four copper tube cooling, which ensures sustained performance at 28W. This means users can expect the tablet to handle high-intensity tasks without overheating or slowing down. There are three energy modes on offer – power saver, balance, and high performance  - and you can switch between these using the system management dashboard, In terms of software, the V3 runs Windows 11 Pro and is designed to work seamlessly with Microsoft 365 Copilot. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! No word on pricing or availability at the moment, but Minisforum says it expects to start accepting pre-orders by the end of March. Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. Canonical announces Snap Store crackdown after crypto scam apps overload DNA storage is coming, it's just a matter of when not if — SNIA quietly unveils first specifications for storing bytes in DNA medium, an important first step towards almost ultra-cheap, limitless storage Quordle today – hints and answers for Saturday, March 30 (game #796) By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Tom PowerMarch 29, 2024 By Mike MooreMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Lance UlanoffMarch 29, 2024 By Craig HaleMarch 29, 2024 By Craig HaleMarch 29, 2024 By Rowan DaviesMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}