{
    "title": "AMD Ryzen 9 7940HX 16-core Zen4 \"Dragon Range\" CPU listed by ASUS, 200 MHz \nslower than 7945HX",
    "date": "1/14/2024",
    "url": "https://videocardz.com/newz/amd-ryzen-9-7940hx-16-core-zen4-dragon-range-cpu-listed-by-asus-200-mhz-slower-than-7945hx",
    "text": "The rumors were true, AMD is indeed launching a new Dragon Range processor, but the naming schema is already starting to lose its meaning.  Last April, AMD unveiled its flagship mobile series called the Ryzen 7040HX series, also known as the “Dragon Range,” featuring an set of four SKUs. Later on, AMD introduced an additional variant with 3D V-Cache technology, expanding the series to a total of five models. Towards the end of the same year, speculations emerged suggesting that AMD might be planning to introduce more models. Confirming these rumors, the Chinese media outlet Golden Pig Upgrade accurately identified at least one of these new additions. ASUS has recently confirmed the existence of the Ryzen 9 7940HX, listing it as a part of their TUF Gaming A16 2024 (F1607PI) laptop lineup:   Ryzen 9 7940HX in ASUS TUF laptop, Source: ASUS  As shown, the CPU boasts 16 cores and 32 threads, which are based on the Zen4 architecture. It’s worth noting that this CPU will have a turbo clock speed 200 MHz slower (5.2 GHz max boost) than the Ryzen 9 7945HX SKU, although details regarding the base clock are currently unavailable. But a valid question arises: why is this particular part labeled as Ryzen 9 7940HX and not 8940HX? AMD had previously indicated that parts released in 2024 would commence with “8.” Of course, should AMD have chosen otherwise, it would probably cause a lot of confusion. Although, technically, nothing prevented AMD from announcing these parts in late 2023.   AMD Ryzen mobile naming system, Source: AMD  For now, there’s no sign of the Ryzen 7 7840HX, but it’s a fair bet to figure it might roll out with a 200 MHz dip in clock speed. The big question remains – why does AMD flood the Dragon Range series with so many models? These CPUs aren’t exactly stealing the spotlight with laptop manufacturers. As ComputerBase recently covered, there are only 7 platforms (31 laptop models) based on Ryzen 7040HX series, and the only model with 7945X3D (ASUS ROG Strix Scar 17) is no longer available in Germany. Perhaps the slightly lower clock speeds give AMD the flexibility to send out a larger quantity to their partners, paving the way for more diverse designs. Source: ASUS We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}