{
    "title": "AMD’s Radeon RX 6750 GRE GPU Price Hits All-Time Low in China, Making \nSupply An Issue",
    "date": "1/28/2024",
    "url": "https://wccftech.com/amd-radeon-rx-6750-gre-gpu-price-hits-all-time-low-in-china-making-supply-an-issue/",
    "text": "AMD's Radeon RX 6750 GRE GPU has been making highlights in China as Team Red implements \"strict\" price control measures to ensure a balanced supply. While the Radeon RX 6750 GRE is relatively based on older architecture, it is a leading choice for budget and mainstream gamers in China and has made huge strides when it comes to market sales. Not only is the GPU an exclusive variant launched in celebration of a Chinese event, but the price-to-performance ratio it brings onboard is phenomenal, which is why it is being sold like \"hotcakes\" in the region. It is reported that AMD has sent out instructions to AIB partners in terms of the pricing of the Radeon RX 6750 GRE since the supply and demand of it is unexpected yet favorable for Team Red. Before we go into the specifics, let's take a look at what the Radeon RX 6750 GRE comes with. The GPU comes in two different variants, the 10 GB and the 12 GB model, with similar specifications. The 12 GB model features 40 Compute Units, 40 RT accelerators, 2560 cores, a base clock speed of 2439 MHz, a boost clock of 2581 MHz, and a TBP of 230W, while the 10 GB one has slightly less of each of the above-mentioned parameters, which is why it is priced slightly lower as well. In terms of what AMD has said to its partners, the Radeon RX 6750 GRE is advised to be sold at 2,149 yuan for the 10 GB and 2,379 yuan for the 12 GB model. However, despite the regulations, the GPU has dropped to an all-time low of 2,239 yuan or around USD 315, making it almost a \"freebie\" when it comes to how it is priced and the competitors in this segment. It is said that the Radeon RX 6750 GRE is subject to \"high volatility\" in terms of the market value, and it is expected that the price might consolidate at a point, but certainly below the proposed MSRP. Based on what we have seen, the Radeon RX 6750 GRE dominates over the \"newer\" GeForce RTX 4060 Ti in terms of rasterization & higher memory capacities, and competitors like NVIDIA don't have a \"compelling\" offering within the price segment at which the RX 6750 GRE comes at. Moreover, the attractiveness of the GPU has prompted AMD not to release their latest budget RDNA 3 GPU, the Radeon RX 7600 XT, in the Chinese markets, which shows how big of an impact an \"exclusive\" model made in the markets. News Source: MyDrivers Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}