{
    "title": "AMD receives DASA funding for U.K. unmanned air system competition",
    "date": "1/19/2024",
    "url": "https://www.compositesworld.com/news/amd-receives-dasa-funding-for-uk-unmanned-air-system-competition",
    "text": "Automotive technology supplier Forvia shares sustainability goals and recent developments aimed at bio-based and recycled materials and ramping up hydrogen tank production for clean mobility. New deal with Chinese auto firm will develop and commercialize Type IV tanks for European, U.S. and Asian business markets. Existing facility at Dayton International Airport will enable 500 eVTOLs per year, serving as Joby’s initial manufacturing footprint in the region. With the involvement of two schools from the Institut Mines-Télécom, the 4-year project aims to improve the intrinsic properties of a composite material based on Elium via four concrete demonstrators. Unveiling coincided with the opening of the new CityAirbus test center in Donauwörth, Germany, ahead of the aircraft’s maiden flight later this year. Fraunhofer IPT, Taniq and Pixargus have proven the success of a measuring head capable of optimizing the reliability, security and efficiency of FRP pressure vessel manufacturing. Strategic MOU initially introduces SikaBiresin CIM 120 and SikaBiresin CIM 80 to serve crucial composites market needs for 3D printing tooling, prototyping and more. Through this strategic collaboration, BEAD’s additive and subtractive capabilities for large-scale AM composite tooling production are made more accessible. Plyable continues to rid composites engineers of workflow bottlenecks through an end-to-end automated system — from mold design to quotation to manufacturing fulfillment. JEC World 2024: The RAMPF Group is bringing together three of its divisions — RAMPF Composite Solutions, RAMPF Tooling Solutions, and RAMPF Group Inc. — delivering a variety of materials and services to the composites industry. Computed tomography (CT) provides highly accurate 3D analysis of internal microstructure, performance simulation of carbon fiber/PEEK satellite strut. Kineco Kaman Composites India uses a bespoke Fill Accubot ultrasonic testing system to boost inspection efficiency and productivity. Swancor will supply all recyclable resin to Siemens by 2026, contributing to RecylableBlade efforts. Eco-friendly resin system using glycol lignin offers an eco-friendly option for CFRP structures and components, and core materials. Glass fiber-reinforced compound enhances rigidity, aesthetics and eco-friendliness of the biomimetic FlowTech 1 Single Fin. Partnership with Chinese automotive manufacturer will see the implementation of pultruded profiles in various bus models, backed by weight savings, complex geometries and long life. LOG Point Pallet fuses advanced materials with innovative design and manufacturing to improve supply chains worldwide. Storage compartment flap for truck interior produced via fully automated continuous fiber thermoplastic sandwich molding technology shows suitability for series manufacture. Partnership with Chinese automotive manufacturer will see the implementation of pultruded profiles in various bus models, backed by weight savings, complex geometries and long life. LOG Point Pallet fuses advanced materials with innovative design and manufacturing to improve supply chains worldwide. Airtech will provide extensive AM support, while AES commits to exclusive use of Airtech products, all of which will further materials development, market strategies and design practices. Storage compartment flap for truck interior produced via fully automated continuous fiber thermoplastic sandwich molding technology shows suitability for series manufacture. AI startup offers automation innovations for high-mix, high-variability, manual surface finishing applications. Startup company selected, including two special recognition awards, highlight FGF applications for children’s seats, FGF extrusion and LFAM for cores and mandrels for composite parts manufacture. Increasingly, prototype and production-ready smart devices featuring thermoplastic composite cases and other components provide lightweight, optimized sustainable alternatives to metal. CW explores key composite developments that have shaped how we see and think about the industry today. Knowing the fundamentals for reading drawings — including master ply tables, ply definition diagrams and more — lays a foundation for proper composite design evaluation. As battery electric and fuel cell electric vehicles continue to supplant internal combustion engine vehicles, composite materials are quickly finding adoption to offset a variety of challenges, particularly for battery enclosure and fuel cell development. Performing regular maintenance of the layup tool for successful sealing and release is required to reduce the risk of part adherence. The composite pressure vessel market is fast-growing and now dominated by demand for hydrogen storage. As part two of the webinar series about composites manufacturing processes, this webinar will focus on the continuous processes in the manufacturing of composite materials: filament winding, pultrusion and a combination of both. This presentation will briefly give an overview of both processes, discussing their advantages and disadvantages. You'll discover the product recommendations from Evonik's portfolio for these processes, including how they can be used to enhance the performance of the final composite materials. This webinar will conclude with an outlook on the various applications including infrastructure, marine and transportation. In this webinar, Instron will discuss the different solutions for strain measurement on composite materials, such as: strain gauges, clip-on extensometers, video extensometers and digital image correlation (DIC). It will discuss the advantages and disadvantages of each and when you might prefer one method over another.\n\nAgenda:\n\n\n\tBrief introduction to composite materials and properties\n\tStrain measurement techniques for coupon testing\n\tExamples of strain measurement for various test types including: in-plane tensile, compression, through thickness and v-notch shear As part three of the webinar series about composites manufacturing processes, this webinar will focus on the two main processes to manufacture semi-finished goods and the composites resulting from it: sheet molding compounding (SMC) and prepreg technology. This presentation will briefly highlight the advantages and challenges. The main part of the webinars will showcase product recommendations from Evonik's portfolio and how they can be used to enhance the performance of the final composite materials to meet the requirements from the automotive, aerospace and sporting goods industries. After having established a strong foundation in kinetic models in a previous webinar, part two delves into the exciting realm of machine learning and its transformative potential for composite manufacturing. While kinetic models have served the industry well, the growing complexity of composite manufacturing demands more sophisticated approaches.\n\nIn this session, sensXPERT will explore innovative pathways to supercharge your production efficiency and enhance sustainability beyond the limits of traditional models. See how machine learning empowers composite manufacturers to achieve unprecedented accuracy in predicting key production parameters such as temperature, pressure and cure time. This translates to reduced cycle times and waste while increasing production throughput to maximize efficiency.\n\nSensXPERT will provide concrete examples and case studies demonstrating how to bridge the gap between meticulously-controlled laboratory experiments and the realities of the production floor, overcoming the limitations of kinetic models.\n\nAgenda:\n\n\n\tDefine machine learning, its applications and their impact on composite manufacturing\n\tExplore real-world case studies in diverse composites manufacturing applications and how they exploit integration options\n\tCorrelation analysis: uncovering hidden relationships between process parameters and product outcomes\n\tTime series analysis: forecasting production trends\n\tAnomaly detection: identifying irregularities When developing new products and formulations, there are a large number of additive choices to improve a single property you are aiming for: tougheners, plasticizers, flame retardants, the list goes on. One promising additive is graphene and its derivatives, but most organizations don’t know where to begin, so development walls are hit early in the process and therefore projects can be abandoned before success.\n\nBut your chances of success are drastically increased when you partner with industry experts that know what forms of graphene will meet your needs. In this webinar Mito Materials will discuss how to successfully source, formulate and deploy any graphene material in the world — and do it to your specs and timeline. Semi-empirical techniques such as kinetic modeling play a pivotal role in setting up such systems for optimizing production without compromising quality or escalating cost.\n\nThis webinar is aimed to elevate your understanding of kinetic models to unlock their full potential, empowering you to make informed decisions and extract valuable insights for your polymer processing and applications. With a history of over 50 years, kinetic models are a powerful tool for comprehending and predicting material behavior.\n\nJoin our expert scientists as they explain the process of creating, interpreting and applying these models, from the lab to the production floor. You'll gain insight into how kinetic models are used in the composite production process, as well as their limitations and why relying solely on kinetic models may not be sufficient to gain the process control now required.\n\nThis first masterclass gives the foundation for part two, where we look beyond kinetics and how to evaluate alternatives that challenge the status quo and enable innovative pathways to boost your production efficiency and improve sustainability.\n\nAgenda: \n\n\n\tDecoding kinetic models: the core principles of kinetic models and how they wield immense power in optimizing your manufacturing processes\n\tApplication insights: strategic applications of kinetic models within polymer processing and unlocking new avenues for efficiency and performance enhancement in production\n\tNavigating limitations: insights into the derivation process of kinetic models and how to navigate inherent limitations with confidence and clarity Over 12,000 ASTM standards operate globally. Defined and set by us, they improve the lives of millions every day. Combined with our innovative business services, they enhance performance and help everyone have confidence in the things they buy and use.  WCX World Congress Experience™ provides an unmatched opportunity to see all the moving parts in today’s mobility industry — and the groundbreaking innovations that are shaping the next phase. Powered by SAE International®, the global leader in connecting and educating engineers, this event serves as the only place for the latest technology, consumer metrics, regulatory standards and technical sessions covering the entire vehicle, from hardware to software and beyond. Join your community at North America’s largest technical mobility event, and be part of the collaborative problem-solving that drives the future of your industry. UTECH Europe will return on the 23-25 April 2024 to the MECC Maastricht, the Netherlands. Organised by Crain Communications' Global Polymer Group, and in association with Urethanes Technology International, the three-day exhibition and conference is where the global polyurethanes industry comes together. The 2nd EuReComp (“European recycling and circularity in large composite components”) Workshop will take place April 24, 2024 at the Aimen Technology Centre in Vigo, Spain. \n\nThe April workshop is dedicated to fostering innovation and sustainability within the composites recycling sector. It will feature a comprehensive program that includes keynote presentations by leading experts, interactive discussions on the circular economy and hands-on demonstrations showcasing the newest research and technological developments. ThermHex and Fraunhofer are set to host the third Composite-Sandwich Conference in Halle (Saale), Germany, on April 24-25, 2024. The conference will provide the opportunity for engineers and scientists from across the composites industry to explore new fields of application of sandwich materials and network with some of the leading minds in the sector.\n\nNot only will there be lectures from Daimler Truck, Porsche, Audi, Airbus Helicopters, Evonik Performance Foams and more, but both ThermHex Waben and Fraunhofer Pilot Plant Center for Polymer Synthesis and Processing will open up the doors to their facilities for all participants to receive guided tours of both facilities. Thousands of people visit our Supplier Guide\r\n            every day to source equipment and materials.\r\n            Get in front of them with a free company profile. Jetcam’s latest white paper explores the critical aspects of nesting in composites manufacturing, and strategies to balance material efficiency and kitting speed. Arris presents mechanical testing results of an Arris-designed natural fiber thermoplastic composite in comparison to similarly produced glass and carbon fiber-based materials. Cevotec, a tank manufacturer, Roth Composite Machinery and Cikoni, have undertaken a comprehensive project to explore and demonstrate the impact of dome reinforcements using FPP technology for composite tanks. Initial demonstration in furniture shows properties two to nine times higher than plywood, OOA molding for uniquely shaped components. The composite tubes white paper explores some of the considerations for specifying composite tubes, such as mechanical properties, maintenance requirements and more. Foundational research discusses the current carbon fiber recycling landscape in Utah, and evaluates potential strategies and policies that could enhance this sustainable practice in the region. Automotive technology supplier Forvia shares sustainability goals and recent developments aimed at bio-based and recycled materials and ramping up hydrogen tank production for clean mobility. LOG Point Pallet fuses advanced materials with innovative design and manufacturing to improve supply chains worldwide. Customer decarbonization goals demand supply chains with sustainable business practices. Here are four considerations for supporting those goals that will be discussed further at CW Tech Days. Airbus subsidiary CTC uses new technology to measure energy use in machine components and processes to optimize equipment, production lines and guide decisions for future composites. AI startup offers automation innovations for high-mix, high-variability, manual surface finishing applications. As companies strive to meet zero-emissions goals, evaluating a product’s carbon footprint is vital. Life cycle assessment (LCA) is one tool composites industry OEMs and Tier suppliers are using to move toward sustainability targets. Customer decarbonization goals demand supply chains with sustainable business practices. Here are four considerations for supporting those goals that will be discussed further at CW Tech Days. Airbus subsidiary CTC uses new technology to measure energy use in machine components and processes to optimize equipment, production lines and guide decisions for future composites. Three materials — bio-based carbon fibers, natural stone and biochar — act as an alternative to reinforced concrete in a house wall demonstrator in the DACCUS-Pre project. As companies strive to meet zero-emissions goals, evaluating a product’s carbon footprint is vital. Life cycle assessment (LCA) is one tool composites industry OEMs and Tier suppliers are using to move toward sustainability targets. Researchers have proven it’s possible to recycle CNTs at the macroscopic scale with nearly 100% retention of mechanical and electrical properties, removing a hurdle to sustainable CNT-based fiber, sheet and textile adoption. CW parent company names Julia Hider correspondent for robots and autonomy and CW’s Hannah Mason correspondent for sustainability in manufacturing. Each role will cover a broader topic scope across industry. Explore the cutting-edge composites industry, as experts delve into the materials, tooling, and manufacturing hurdles of meeting the demands of the promising advanced air mobility (AAM) market. Join us at CW Tech Days to unlock the future of efficient composites fabrication operations. CW’s editors are tracking the latest trends and developments in tooling, from the basics to new developments. This collection, presented by Composites One, features four recent CW stories that detail a range of tooling technologies, processes and materials. The composites industry is increasingly recognizing the imperative of sustainability in its operations. As demand for lightweight and durable materials rises across various sectors, such as automotive, aerospace, and construction, there is a growing awareness of the environmental impact associated with traditional composite manufacturing processes. During CW Tech Days: Thermoplastics for Large Structures, experts explored the materials and processing technologies that are enabling the transition to large-part manufacturing.  Closed mold processes offer many advantages over open molding. This knowledge center details the basics of closed mold methods and the products and tools essential to producing a part correctly. CompositesWorld’s CW Tech Days: Infrastructure event offers a series of expert presentations on composite materials, processes and applications that should and will be considered for use in the infrastructure and construction markets.  This CW Tech Days event will explore the technologies, materials, and strategies that can help composites manufacturers become more sustainable. In the Automated Composites Knowledge Center, CGTech brings you vital information about all things automated composites.   CompositesWorld’s CW Tech Days: Infrastructure event offers a series of expert presentations on composite materials, processes and applications that should and will be considered for use in the infrastructure and construction markets. Explore the cutting-edge composites industry, as experts delve into the materials, tooling, and manufacturing hurdles of meeting the demands of the promising advanced air mobility (AAM) market. Join us at CW Tech Days to unlock the future of efficient composites fabrication operations. Thermoplastics for Large Structures, experts explored the materials and processing technologies that are enabling the transition to large-part manufacturing. Explore the technologies, materials, and strategies that can help composites manufacturers become more sustainable. A report on the demand for hydrogen as an energy source and the role composites might play in the transport and storage of hydrogen. This collection features detail the current state of the industry and recent success stories across aerospace, automotive and rail applications. This collection details the basics, challenges, and future of thermoplastic composites technology, with particular emphasis on their use for commercial aerospace primary structures. This collection features recent CW stories that detail a range of tooling technologies, processes and materials. AMD will incorporate existing low-cost radar absorbing material technologies to advance autonomous air systems. Photo Credit: Shutterstock Nanotechnology company Advanced Material Development (AMD, Guilford, U.K.) has received U.K. government Defence and Security Accelerator (DASA) funding within the new “Affordable and Adaptable Unmanned Air Systems” competition. Funded by the Army Research Innovation and Exploitation Laboratory (ARIEL), a part of the Army’s Futures Directorate, the competition seeks novel, low-cost and adaptable autonomous air system development for the U.K. The challenge for AMD is to use its existing low-cost radar absorbing technologies to help such autonomous air systems survive against evolving counter-air and counter-uncrewed air system threats. “We are excited to be working within this program offering the U.K. government an opportunity to exploit AMD’s existing radar absorbing technologies that have been developed over the last 5 years,” John Lee, CEO of AMD, says. “We fully expect to be able to demonstrate that AMD materials will, without any other negative impact, provide a significant broadband reduction in the radar cross-section of the platform.” AMD creates ultra-lightweight, cost-effective and sustainable advanced sensors and electronic devices via its multifunctional materials platform, which can be integrated into coatings, plastics, composites and foams. The company is addressing challenges across multiple sectors, including defense, industrial, consumer and life sciences. Thunder Composite Technologies uses its automated pultrusion, RTM and other processes to produce custom-engineered composite parts for automotive and land defense vehicles. Targeting current and future needs in hypersonic and aeronautics applications, Lockheed Martin Skunk Works’ Allcomp team is increasing and digitizing its capabilities in ceramic matrix composite (CMC) materials and parts fabrication. Veteran aerostructures Tier 1 transforms into 21st century leader in thermoplastic composites and multiple new markets. CompositesWorld is the source for reliable news and information on what’s happening in fiber-reinforced composites manufacturing.\r\n                    About Us "
}