{
    "title": "AMD Radeon RX 7900 XT GPUs officially discounted to $749, down to $709.99 \non Newegg and Amazon",
    "date": "1/17/2024",
    "url": "https://www.notebookcheck.net/AMD-Radeon-RX-7900-XT-GPUs-officially-discounted-to-749-down-to-709-99-on-Newegg-and-Amazon.794041.0.html",
    "text": "In response to Nvidia launching the new RTX 4000 Super cards with lower price points compared to the MSRPs from late 2022, AMD is now slashing the prices for the Radeon RX 7900 XT cards. These models initially launched at $899, and we have seen various discounts throughout 2023, some retailers even offering them at $699 for a short while, but now Team Red is officially lowering the MSRP to $749, although only for this quarter. To spice things up, select retailers are dropping the prices even more to just $709.99. So far, only the ASRock Phantom Gaming, Sapphire Pulse and XFX Speedster MERC310 models of the Radeon RX 7900 XT are available for $709.99 at Newegg, while the PowerColor Hellhound is $719.99. Amazon also has the Sapphire Pulse model at $709.99. According to TweakTown, AMD mentions in the price cut press release that, as far as raw performance goes (no image upscaling or ray-tracing), “the 7900 XT is faster than the current RTX 4070 Ti in titles like Call of Duty: Modern Warfare III, GTA V, Starfield, Hogwarts Legacy, Cyberpunk 2077, and Resident Evil 4.” The lowest price for an RTX 4070 Ti on Newegg is $724 currently, so AMD can now claim that it has faster, more affordable cards, but it is clear that this move is actually targeted at the new Super cards. More specifically at the RTX 4070 Ti Super cards that are expected to launch by the end of this month with a $799 MSRP. Even though it is harder to find at retailers, the Radeon RX 7900 GRE is also getting a price cut down to $549. This version is slightly faster than the RX 7800 XT and comes with 16 GB VRAM instead of 20 GB. As Nvidia releases the rest of the Super cards, we could see AMD lowering prices for the RX 7900 XTX as well, from $999 to $899 or lower. Same could happen to the mid-range RX 7800 XT that might drop closer to $400. via TweakTown / Videocardz "
}