{
    "title": "AMD Link mobile app for game streaming, system monitoring and video capture \nsharing has been discontinued",
    "date": "1/26/2024",
    "url": "https://videocardz.com/newz/amd-link-mobile-app-for-game-streaming-system-monitoring-and-video-capture-sharing-has-been-discontinued",
    "text": "  AMD Link in 2017, Source: AMD  One might expect that the trend of integration and synchronization between desktop and mobile devices would continue to gain popularity in the future. However, AMD has chosen to discontinue its mobile app, Link. This app, initially introduced for Android and iOS devices in December 2017, was just another addition to the expanding set of features within the Adrenalin software. In its early stages, the Link app allowed gamers to view their ReLive footage captured on the PC directly on their phones. Users were also provided access to system monitoring data and kept informed about the latest AMD news. As AMD’s software continued to evolve, Link received updates with additional features, including the capability to stream from the local PC to a mobile device. This particular feature took advantage of the more capable encoding found in modern GPUs. Its functionality resembled that of Steam Link, but it was exclusive to AMD hardware. AMD has now confirmed that the Link app will be discontinued this quarter: Important Information About AMD Link Reaching End of Life For users that game remotely with AMD Link, one important announcement is that AMD is ending support for the AMD Link software application with a future AMD Software: Adrenalin Edition™ driver release. We originally launched AMD Link at a time when there were few alternative remote gaming solutions for Radeon graphics users. Today, there are many options available for users to stream their PC content to other devices. AMD’s role is to enable and support developers, not compete with them. As such, we are ending support for AMD Link and focusing our resources on other core capabilities and features that benefit users. We will also continue to support developers with our SDKs such as the AMD Advanced Media Framework that allow them to enable streaming functionality within their solutions. It's dead Jim.#AMD ending support for AMD Link. pic.twitter.com/0c1DQqlzC0 — Planet 3DNow! (@planet3dnow) January 25, 2024  AMD Link app is being discontinued, almost exactly a year after NVIDIA ended support for its GameStream service. Both apps allowed gamers to stream locally through their network without any external service requirement.   AMD Link in 2023, Source: AMD  Unlike NVIDIA, AMD is not providing any alternatives at this moment, but the company is working with developers to either integrate support for AMD Advanced Media Framework that enables streaming. However, those who preferred AMD software to have everything in one place may be disappointed and there is simply no such software available. The most obvious alternatives are Steam Link, but this app is limited to Steam games, or Moonlight with Sunshine. While it relies on NVIDIA GameSteam it can also work on AMD hardware. Source: AMD, AMD via Planet3D Now We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}