{
    "title": "Low-powered Raptor Lake CPU fails to impress in graphics benchmark — Intel \nCore 7 150U loses to AMD's CPUs with ...",
    "date": "1/10/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/low-powered-raptor-lake-cpu-fails-to-impress-in-graphics-benchmark",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Core 7 150U is a Raptor Lake CPU and is not to be confused with the new Meteor Lake lineup. A benchmark for Intel's highest-end member of its regular Core Mobile Series 1 lineup has leaked, and the results aren't particularly excellent (via BenchLeaks). The Core 7 150U is Intel's latest 15-watt chip for laptops. Although we can't expect too much of its integrated graphics, its performance in Geekbench 6 is still pretty disappointing for what is supposed to be a current-generation product. The Core 7 150U isn't a Meteor Lake CPU because it lacks the \"Ultra\" branding, but it might still confuse the less experienced users. It's a Raptor Lake refresh chip and an overclocked Core i7-1365U. At least for the moment, the difference between Core Ultra Series 1 and Core Series 1 processors is that the former uses Meteor Lake, and the latter uses Raptor Lake. For comparison, we've included scores for two of AMD's integrated GPUs according to Geekbench 6's rankings for the Vulkan graphics benchmark. Against even the Radeon 740M, which is the lowest-end iGPU AMD pairs with Phoenix and Hawk Point APUs, the Iris Xe graphics in the Core 7 150U loses. The Radeon 760M is even further ahead, and the top-end Radeon 780M in the handheld-oriented Z1 Extreme is over twice as fast as the 150U's graphics. Even compared to AMD's old RX Vega 11 iGPU, the 150U can't exactly win. Vega 11 graphics were first introduced in 2017 on first-generation Zen APUs, so it shouldn't be hard for Intel to win a decisive victory here. The problem for Intel is that it's been recycling Tiger Lake's Xe integrated graphics for years, with Meteor Lake introducing the first new iGPU since then. By contrast, Meteor Lake has such excellent graphics performance that it's on par with AMD's 780M. Of course, AMD has also been in the business of recycling, and for its part, it didn't get rid of Vega 11 until 2022, when it finally brought RDNA 2 to its APUs in the Ryzen 6000 series. To AMD's credit, though, it was able to stay in the lead almost the entire time with Vega 11 thanks to incremental upgrades to clock speeds. Recycling a losing component isn't a winning strategy, and it certainly hasn't worked for Intel recently. Not all hope is lost for Intel, though, as Core Series 1 seems to already be on the chopping block in favor of Core Series 2 Lunar Lake CPUs, which arrive later this year. These chips are expected to use cutting-edge hardware and introduce second-generation Arc Battlemage integrated graphics, which should undoubtedly boost performance. It's not clear if Lunar Lake can catch up to AMD's lower-power APUs, let alone beat them, but on paper, there's quite a bit of promise for Intel's upcoming CPUs. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Matthew Connatser is a freelancing writer for Tom's Hardware US. He writes articles about CPUs, GPUs, SSDs, and computers in general. AMD 170W Granite Ridge Zen 5 CPUs and 128W Strix Point APUs revealed in shipping manifest — 16-core 'Fire Range' mobile CPUs also coming AMD says the UCIe universal chiplet interface will create a whole ecosystem — custom multi-chiplet designs are the future Seven-year-old AMD gaming GPU continues to stick around — low-profile RX 550 arrives for SFF PCs By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}