{
    "title": "Defying obsolescence, AMD's 22-year-old Radeon GPUs get new Linux drivers",
    "date": "1/7/2024",
    "url": "https://www.techspot.com/news/101430-defying-obsolescence-amd-22-year-old-radeon-gpus.html",
    "text": "Bottom line: For users that still rely on the ancient ATI R300 graphics processor series, open source has come to the rescue once again. This latest update was not an easy fix to make, the developer says, and users will have access to it this year. The ATI R300 graphics processor series was first introduced in 2002 with the release of the ATI Radeon 9700 Pro. Built on the 150nm process and featuring an AGP interface – later to be supplanted by PCIe – the cards aren't able to run the latest games, but the open-source community still supports them allowing them to run on newer Linux distributions. Specifically, driver updates for ATI's R300 through R500 series Radeon GPUs will be available this quarter in Mesa 24.0 and users will have access to the update by the end of the year. Open-source developer Pavel Ondracka explains that the Mesa Gallium3D OpenGL driver update will focus on NIR lowering, which is related to the vertex shaders of the GPUs. \"The MR moves most of the remaining backend lowering into NIR, namely ftrunc, fcsel – when suitable – and flrp. The backend lowering paths are removed, which is a prerequisite for more backend cleanups, he says, pointing to a MR he has that is ready to get rid of backend DCE for vertex shaders.\" There have been numerous updates to the driver over the years by the open source community in its support for the pre-R600 series Radeon hardware, with a recent change being its adaptation to the new Mesa interfaces such as the transition to NIR intermediate representation. AMD, for its part, focuses primarily on current generation and future hardware. It is worthwhile to take a closer look at the ATI Radeon 9700 Pro as the fact that they can still run a contemporary Linux OS is admirable. The GPU had 110 million transistors, a core clock speed of 325MHz, 256MB of memory, and 19.8GB/s of memory bandwidth. It was the fastest GPU at the time of its launch and the first to fully support DirectX 9. Today its capabilities are largely limited to displaying windows and text but thanks to the open-source community they are still functional. It should also be noted that this current update was not an easy fix to make, according to Ondracka, who says he tried to get it right five times beforehand but always failed to make it work reasonably until now. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}