{
    "title": "AMD Makes Serious Critical Move to Help Automotive Market: Expect More at \nCES 2024",
    "date": "1/5/2024",
    "url": "https://techspective.net/2024/01/05/amd-makes-serious-critical-move-to-help-automotive-market-expect-more-at-ces-2024/",
    "text": "To get ahead of the CES announcement wave, AMD announced today two new parts for the automotive market. The Versal AI Edge XA, which is a 7nm part designed to provide AI functionality in automotive applications, and the Ryzen Embedded V2000 Series is designed to significantly enhance the in-vehicle experience (IVX) in those same cars. These announcements begin to set the stage for what will undoubtedly be many automotive AI and entertainment announcements at CES this year. Given how rapidly Chinese automotive and smartphone vendors (Xiaomi) are moving ahead of Western car companies, the help of companies like AMD couldn’t be timelier. Let’s talk about the critical need for Western car companies to grasp the competitive tsunami that is about to hit them and how they can use suppliers like AMD to survive the coming technology storm. From Porsche to VW and from Ford to GM, Western Car companies are in trouble. They are still largely operating as they did before the electric car revolution and haven’t adapted to the aggressively advanced approaches that Tesla has showcased are so effective. Still, even Tesla appears to be falling behind. Part of the problem is that, unlike companies like Tesla, which were designed to manufacture and sell electric cars, most Western car companies took practices and technologies from their legacy gas-powered cars and applied them to these new electric vehicles. This layered technology approach created excessive complexity, significantly slowed down development time, and made the resulting cars far less dependable and more costly than they should have been. Electric cars are rolling computers and, when done right, have more in common with your laptop than with your older automobile in terms of how the underlying technology is developed and applied. This also means these new cars can have a far quicker cycle time as technology in the smartphone and PC markets tends to advance within a year, not over a period of years as the typical automotive market does. As a result, most Western car companies are falling farther and farther behind their Chinese counterparts, which are advancing cars more on a tech product schedule measured in months and days as opposed to a typical gas car, which advances in terms of years or even decades. While this year AMD is the first to announce amazing new products targeting this automotive market, it is hardly alone as Intel, Qualcomm, and NVIDIA also play in and plan to expand this market. In all cases, if the car companies will listen to them, these vendors can use their experience to help make their product lines more up-to-date and attractive to the buying public. A case in point is the recently announced Zeekr 001, which compares favorably to the Porsche Taycan but massively undercuts the price of that electric flagship product from Porsche with comparable looks, performance, and even far better range (640 miles). Xiaomi, a company more connected to smartphones than vehicles, has announced its own Tesla killer, the SU7, which has significant range advantages when compared to Tesla, let alone Ford or GM, which are much further behind. BYD, another Chinese car company, just outperformed Tesla in electric car sales, so none of the western companies should be taking their survival or existing market positions for granted. The move to electric cars is going poorly largely because it was done backward with the needed infrastructure following the push to go electric and knowing that this infrastructure is likely to continue to be inadequate through the end of the decade. Ironically, China is taking this move far more seriously and, except for some of the Scandinavian countries, is moving far more aggressively than the West to pivot to this more sustainable but critically under-resourced automotive technology. Whether it is AMD or another large technology supplier, car companies, particularly Western car companies, need to use these tech providers as valuable resources to help them transition to this new electric and increasingly AI-driven automotive world or risk sharing a space with Studebaker on the list of promising but failed car companies in the future.  Copyright © 2024 TechSpective. "
}