{
    "title": "ASML, AMD, Super Micro Computer: Trending Tickers",
    "date": "1/22/2024",
    "url": "https://finance.yahoo.com/video/asml-amd-super-micro-computer-172109542.html",
    "text": "ASML Holding (ASML) shares hit a 2-year high on Monday after Bernstein analysts upgraded the semiconductor equipment maker to \"Buy\" from \"Neutral\". Bernstein cited an attractive valuation compared to peers. Advanced Micro Devices (AMD) shares fell after Northland downgraded the stock to \"Market Perform\". The firm believes generative AI hype inflated AMD's valuation, with the actual opportunity more muted than markets anticipate. Super Micro Computer (SMCI) continues to extend record highs set last Friday. The company forecasts surging generative AI demand will drive quarterly results far beyond expectations. Yahoo Finance's Rachelle Akuffo and Akiko Fujita break down the details of these trending tickers. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith RACHELLE AKUFFO: All right, now let's take a look at some of our trending tickers. We have our eyes on the chip stocks today. Starting with ASML, the company getting a boost from Bernstein, saying it is, quote, \"attractively priced\" compared to its competitors. An analyst at the firm upgraded ASML stock to buy from neutral, saying it's likely to continue seeing strong earnings per share growth through 2025. Now, that optimism pushing the stock to a two-year high, allowing it to reclaim its position of Europe's third biggest listed company. So this is an interesting one here because a lot of people were wondering how much room to run some of these companies had, especially, as we've talked about, that upgrade cycle. And they noted more likely to see that upgrade cycle kicking in 2025. So some optimism there. Do you think that's well founded? AKIKO FUJITA: Well, I mean, I wouldn't necessarily make an analyst call here. But with ASML, we're talking specifically about the machines that produce these advanced chips. So you could argue they're well positioned there in what is increasingly a crowded field in the chip making space. ASML, of course, one of those names that we've talked a lot about in terms of the context of this tension that's been playing out globally on chips between the US and China too. So probably a welcome sign for the company to be able to get this kind of upgrade on the fundamentals at a time-- which is something they can control-- at a time when we're talking so much about the geopolitical climate around this space. Let's talk about AMD shares. They are sinking as an analyst at Northland Capital Markets downgrades the stock to market perform, saying that AI is really big, but it's not as big as investors are thinking. This is one of those stocks that has seen a big run-up on the back end of the expectation of how big AI can be. The stock up more than 12% year-to-date. But as we've been saying, Rachelle, over the last few quarters, it really is about show me for investors right now, specifically as it relates to AI chips. But you could argue, AMD competes on the full spectrum for artificial intelligence. It's not just about devices, it is also about the cloud and everything in between. So sure, NVIDIA is the name that investors continue to hone in on. But AMD, certainly well positioned there to be able to compete on that front. RACHELLE AKUFFO: It's true. And something else to keep in mind in that space, you saw a lot of stockpiling, especially among Chinese companies as they saw that door closing as we get more pressure from the Biden administration and the Chips Act as well. So that's another factor to keep an eye on in the chip space. Well, staying in that space, looking at shares of Super Micro Computer extending gains after hitting a record high on Friday. The company forecasting that artificial intelligence demand will push quarterly results well above analyst estimates. Now, supercomputers an interesting one because there are too many semis that can say they actually outpaced NVIDIA's growth over the past year. But they're one of the few that over the last year, and still currently year-to-date, outpacing NVIDIA. It's one of those companies that doesn't get talked about much, very well priced at the moment, and really is a company that makes servers that have this cutting edge graphic processing unit technology for GPUs that creates the AI model. So it's a beneficiary of the run-up that we've seen with NVIDIA but more attractively priced, obviously, than those who missed out on the big rush with NVIDIA, Akiko. AKIKO FUJITA: Yeah, and getting caught up with that AI fueled rally that we have seen over the last week. That stock up 1 and 1/2 percent right now, roughly, in this session. Related Quotes "
}