{
    "title": "AMD Radeon RX 7600 XT review: double the memory and higher clocks, still \nNavi 33",
    "date": "1/24/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/amd-radeon-rx-7600-xt-review",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The AMD Radeon RX 7600 XT provides plenty of memory capacity, but that only improves performance in select workloads like AI, and the price increase ultimately pushes the card into competition with a higher tier of hardware. It's a good fit if you really need the VRAM, though it's mostly a sidestep from the pervious generation RX 6700 XT. Plenty of VRAM for AI and future games Higher clocks than the vanilla 7600 AI hardware, AV1, AFMF Less efficient than the competition Trails previous gen RX 6700 XT Games that need 16GB need more raw compute Why you can trust Tom's Hardware \n\n\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test. The AMD Radeon RX 7600 XT marks the third new graphics card launched in the past two weeks, following the Nvidia RTX 4070 Super and RTX 4070 Ti Super. It competes in an entirely different category, with a starting price of $329 that's only a bit more than half the cost of the 4070 Super. Using the same Navi 33 RDNA 3 architecture as the RX 7600, AMD increased the power limits and core clocks and doubled the VRAM capacity, similar to what Nvidia did with the RTX 4060 Ti 16GB. Will it become one of the best graphics cards? Let's find out.\n\nHere's the full rundown of the specifications for the mainstream current generation AMD and Nvidia GPUs, plus the previous generation RX 6700 XT. We're not sure if Navi 22 remains in production, as it's technically two and a half years old now and has been superseded by the RX 7700 XT. But it's basically available at the same price as the 7600 XT, and that can be a bit of a problem as we'll see in the benchmarks. The RX 7600 XT officially launches today, January 24, 2024. There's no reason to expect these cards to sell out, given the ready availability of pretty much every mainstream GPU over the past year. With a price of $329, AMD is asking for $60 more than the base model RX 7600 to get a modest bump in clocks and power limits plus double the GDDR6 memory. It's going to be more of a niche product, in our view, though it if happens to scratch your particular itch it could be a great choice.\n\nThe core specs are the same as the RX 7600, as both it and the RX 7600 XT use a fully enabled Navi 33 GPU. AMD couldn't magically add more compute units to the die, and opting for Navi 32 would have entailed a much more expensive design overall. That means tweaking TBP (Total Board Power) and boosting the clocks along with doubling the amount of VRAM per channel was about the only real option.\n\nThe RX 7600 XT has a boost clock of 2755 MHz, 100 MHz higher than the RX 7600. AMD also lists a \"Game Clock\" that's supposed to be a better representation of actual performance, though in most of our testing we've found it's mostly just a more conservative estimate of the clocks you'll see in the real world. (We'll have more details on page six if you're interested.) Anyway, the Game Clock for the 7600 XT is 2470 MHz versus 2250 MHz on the vanilla 7600, so potentially there's a bigger difference in performance than our above table might suggest.\n\nOverall, the peak theoretical compute for the 7600 XT is 22.6 teraflops FP32, which is only 4% higher than the 7600's peak compute. But the 7600 XT also has a 190W power limit that's 15% higher than the 165W on the 7600, so real-world performance could track more closely with the difference in TBP.\n\nOne thing AMD didn't do was to increase the VRAM speed. Both the 7600 and 7600 XT use 18 Gbps GDDR6 memory. It would have been nice to get 20 Gbps memory to provide more bandwidth, at least in theory — perhaps the benefit wouldn't have justified the added cost. And that's really the crux of the situation: Does the performance of the 7600 XT with its 16GB of VRAM justify the increase in price? That's going to depend on what you do with the card.  Before we move away from the specs, let's also quickly talk about the RX 6700 XT. Architectural differences mean it doesn't have AV1 support, or the AI accelerator in RDNA 3, but it does offer 40 CUs and similar core clocks. In practice, for gaming we've found that RDNA 2 and RDNA 3 CUs remain relatively comparable, which means the 6700 XT could still be the faster card (spoiler alert!). Also, it has less total VRAM than the 7600 XT but gets to 12GB via a 192-bit interface, which means higher total bandwidth.\n\nConsidering you can find the RX 6700 XT for $329 right now, that puts it in direct competition with the newcomer. This is a problem AMD has been facing with most of the RX 7000-series GPUs, with only the RX 7900 XT and XTX offering new levels of performance. Everything else basically ends up as a sideways movement on price —at least, street price — and performance compared to the RX 6000-series, but with some new features to potentially sweeten the pot.\n\nWe'll see some back and forth between the 7600 XT and 6700 XT in our tests, depending on the sort of workload. Games will likely favor the older GPU, but AI in particular should work better on the newer card. But the RX 6700 XT definitely feels like it's entering the realm of \"while supplies last\" — many of the 6000-series GPUs are now going out of stock (finally). AMD isn't providing a reference card for the RX 7600 XT, leaving it up to its add-in board (AIB) partners. We received the Sapphire RX 7600 XT Pulse for our review, which is a reference-clocked card at least, and it will start at the $329 MSRP. Overclocked cards will naturally exist, at higher price points, though at this end of the GPU spectrum there's not that much wiggle room. As soon as you're looking at spending $50 more for a custom factory overclocked card, you could potentially move up to the next GPU tier instead.\n\nThe Sapphire Pulse measures 250x129x45 mm, so it's just slightly wider than a dual-slot card and you should plan on it occupying three slots. It weighs 797g, making it a relative featherweight compared to many of the bulkier GPUs we've seen lately. It has dual 95mm fans, using Sapphire's \"Angular Velocity Fan Blade\" that includes an integrated rim to improve static pressure, and these should be more than sufficient to handle the cooling needs of the GPU.\n\nSapphire includes dual 8-pin power connectors on the Pulse, which is probably just to make things simpler. These days, nearly all PSUs support 8-pin connections, usually via adjustable 6+2-pin connectors, so why not just skip the 6-pin connector? Technically, even a single 8-pin should be more than sufficient for the 190W TBP (Sapphire actually lists 192W), but giving a bit of extra headroom isn't a bad idea and ensures the card won't need to try and pull too much power through the PCIe slot. Like other graphics card companies, Sapphire offers multiple tiers of hardware. The Pulse line represents the entry level and as such comes with fewer extras. There's no RGB lighting, for example, and no dual-BIOS switch. We rarely make use of the latter on cards that provide it, and for many the lack of RGB will actually be a positive aspect — not everyone wants a PC that lights up the room. If you do want an RGB card, you'll want to look at Sapphire's higher tier Pure and Nitro offerings, which usually include a factory overclock as well.\n\nSapphire opted for a slightly non-traditional route on the display outputs on the Pulse, providing two each of DP2.1 54Gbps and HDMI 2.1 48Gbps ports. As many users will only connect one or two monitors, we like this arrangement since you can use two of the same port type. (Sometimes, monitors behave a bit differently with HDMI versus DisplayPort connections.)\n\nOther than the card itself, there's nothing else to speak of in the packaging. It's a smaller box with less wasted space but still plenty of padding, giving you only what you need and none of the extra clutter. The card is also light enough that sag shouldn't be a serious concern, though we do always appreciate having a small support stand with the size of modern graphics cards.  Our current graphics card testbed has been in use for over a year now, and so far we haven't seen any pressing need to upgrade. The Core i9-13900K is still holding its own, and while the i9-14900K or Ryzen 9 7950X3D can improve performance slightly, at higher resolutions and settings we're still almost entirely GPU limited — though perhaps not when the future RTX 50-series and RX 8000-series arrive. We also conduct professional and AI benchmarks on our Core i9-12900K PC, which is also used for our GPU benchmarks hierarchy. TOM'S HARDWARE Gaming PC Intel Core i9-13900K\nMSI MEG Z790 Ace DDR5\nG.Skill Trident Z5 2x16GB DDR5-6600 CL34\nSabrent Rocket 4 Plus-G 4TB\nbe quiet! 1500W Dark Power Pro 12\nCooler Master PL360 Flux\nWindows 11 Pro 64-bit TOM'S HARDWARE 2022 AI/ProViz PC Intel Core i9-12900K\nMSI Pro Z690-A WiFi DDR4\nCorsair 2x16GB DDR4-3600 CL16\nCrucial P5 Plus 2TB\nCooler Master MWE 1250 V2 Gold\nCorsair H150i Elite Capellix\nCooler Master HAF500\nWindows 11 Pro 64-bit GRAPHICS CARDS\nNvidia RTX 4070 Super\nNvidia RTX 4070\nNvidia RTX 4060 Ti 16GB\nNvidia RTX 4060 Ti\nNvidia RTX 4060\nNvidia RTX 3060 12GB\nNvidia RTX 2060 6GB\nAMD RX 7800 XT\nAMD RX 7700 XT\nAMD RX 7600 XT\nAMD RX 7600\nAMD RX 6700 XT\nIntel Arc A770 16GB We're using preview drivers from AMD for the RX 7600 XT, version 23.40.01.15-RCP4-Radeon-RX7600XT to be precise. These drivers only support the 7600 XT, so other AMD GPUs were tested with the 23.12.1 drivers. For Nvidia, we used preview 551.15 and 546.42 drivers from the 4070 Ti Super and 4070 Super launches, while for Intel we tested with a preview 5186 driver that should be publicly available shortly.\n\nWe did notice some discrepancies in our data for the recent GPU launches, whether from driver, OS, or game updates isn't quite clear. As such we've been feverishly retesting as many of the cards on the latest drivers as possible. We've retested, at a minimum: Borderlands 3, Far Cry 6, Forza Horizon 5, Microsoft Flight Simulator, and Spider-Man: Miles Morales. The three 'bonus' games were also tested on every GPU using the latest drivers.\n\nAMD and Nvidia often like to talk about the upgrade potential of new GPUs, often comparing new parts with older offerings. We've added the RTX 3060 and RTX 2060 to our charts and comparisons for this review, along with the Arc A770 16GB. All of these are or were priced around the $300–$350 range.\n\nOur current test suite consists of 15 games. Of these, nine support DirectX Raytracing (DXR), but we only enable the DXR features in six games. The remaining nine games are tested in pure rasterization mode. We also have three newer 'bonus' titles that aren't in the main charts, two of which use DXR and one of which is a rasterization game. While many games in our test suite support upscaling, we're mostly skipping that due to time constraints, though we do enable FSR2/3 or DLSS Quality mode upscaling in two of the bonus games.\n\nWe test at 1080p (medium and ultra), 1440p ultra, and 4K ultra for most of our reviews — ultra being the highest supported preset if there is one, and in some cases maxing out all the other settings for good measure (except for MSAA or super sampling). The RX 7600 XT mostly targets 1080p, and perhaps 1440p, so the 4K results are included mostly for curiosity's sake.\n\nOur PC is hooked up to a Samsung Odyssey Neo G8 32, one of the best gaming monitors around, allowing us to fully experience the higher frame rates that might be available. G-Sync and FreeSync were enabled, as appropriate. As we're not testing with esports games, most of our performance results are nowhere near the 240 Hz limit, or even the 144 Hz limit of our secondary test PC. We've installed Windows 11 22H2 and used InControl to lock our test PC to that major release for the foreseeable future (though critical security updates still get installed monthly — and one of those probably caused the drop in performance that necessitated retesting a third of the games in our suite).\n\nOur test PC includes Nvidia's PCAT v2 (Power Capture and Analysis Tool) hardware, which means we can grab real power use, GPU clocks, and more during all of our gaming benchmarks. We'll cover those results on our page on power use.\n\nFinally, because GPUs aren't purely for gaming these days, we've run some professional content creation application tests, and we also ran some Stable Diffusion benchmarks to see how AI workloads scale on the various GPUs. Current page:\n\nAMD Radeon RX 7600 XT — Sapphire Pulse Jarred Walton is a senior editor at Tom's Hardware focusing on everything GPU. He has been working as a tech journalist since 2004, writing for AnandTech, Maximum PC, and PC Gamer. From the first S3 Virge '3D decelerators' to today's GPUs, Jarred keeps up with all the latest graphics trends and is the one to ask about game performance. We tried to install Windows 11 on Raspberry Pi 5 — lack of internet connectivity left us stuck YMTC: Our 3D QLC NAND matches endurance of 3D TLC NAND Watch this YouTuber turn an NES cartridge into a working console that plays other NES games — and itself By Sarah Jacobsson PurewalMarch 20, 2024 By Albert ThomasMarch 19, 2024 By Zhiye LiuMarch 19, 2024 By Charles JefferiesMarch 18, 2024 By Christian EberleMarch 17, 2024 By Denise BertacchiMarch 16, 2024 By Brandon HillMarch 15, 2024 By Denise BertacchiMarch 14, 2024 By Stewart BendleMarch 14, 2024 By Shane DowningMarch 13, 2024 By Christopher CokeMarch 13, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}