{
    "title": "Maxtang MTN-FP750 review – Part 2: Windows 11 Pro on an AMD Ryzen 7 7735HS \nmini PC",
    "date": "1/3/2024",
    "url": "https://www.cnx-software.com/2024/01/03/maxtang-mtn-fp750-review-part-2-windows-11-pro-on-an-amd-ryzen-7-7735hs-mini-pc/",
    "text": "CNX Software – Embedded Systems News Reviews, tutorials and the latest news about embedded systems, IoT, open-source hardware, SBC's, microcontrollers, processors, and more In the first part of the Maxtang MTN-FP750 mini PC review, we looked at the hardware with an unboxing, a teardown, and a first boot to the pre-installed Windows 11 Pro.  We’ve now spent more time testing the Maxtang MTN-FP750, also called NUC-7735HS-A16, and we will report our experience with the AMD Ryzen 7 7735H mini PC in Windows 11 Pro with a software overview, features testing, benchmarks, storage and network performance testing, cooling performance, fan noise, power consumption, and more.  The Maxtang MTN-FP750 shipped with Windows 11 Pro 22H2, but we updated it to 23H2 (and somehow entered the Windows Insider program) before starting our test. The System->About window confirms the update and that we have an FP750 PC powered by a 3.2 GHz AMD Ryzen 7 7735HS SoC with 32GB of RAM.  HWiNFO64  provides some details about the AMD Ryzen 7 7735HS 8-core/16-thread processor, the Maxtang FP750 motherboard, and the internal AMD Radeon 680M “Rembrandt” GPU.  GPU-Z gives a few more details about the AMD Radeon 680M Graphics.  The PL1 and PL2 power limits are both set to 35W, while the AMD Ryzen 7 7735HS processor has a TDP of 45W, so Maxtang played it safe here, and by comparison, Beelink SER6 Pro (7735HS) mini PC had PL1 set to 38W and PL2 to 45W. So we’ll have to see how it may impact benchmarks when we check out those below.  The system comes with 32GB DDR5 via two 16GB SO-DIMM memory sticks from Crucial Technology shown to be clocked at 2800 MHz (DDR5-5600) as we’ve seen during the teardown.  The Task Manager also reports two SODIMM memory slots are used for 28.8GB RAM (shared with GPU so we don’t get the full 32GB here?), but the speed is reported to be 4800 MHz. Maxtang MTN-FP750’s 512GB Foresee VP1000F512G M.2 SSD can be seen in the Device Manager, along with a 128GB SATA SSD (CHUANG JIU CJ225128TC) that we installed in the first part of the review.  We quickly tested our SATA SSD with CrystalDiskMark reporting read speeds of about 233 MB/s and write speeds of around 164 MB/s, as expected for this 3 Gbps SATA drive…  Since our Maxtang MTN-FP750 did not ship with any wireless module, we’ll only find a 2.5GbE port in the Network adapters section of the Device Manager.  HWiNFO64 helps us confirm the usual RealTel RTL8125 controller is found in the MP750. Ignore the link speed at this time, since the mini PC was connected to a router with a gigabit Ethernet port for that screenshot. Let’s now test all USB ports to confirm the speed of the USB ports on the Maxtang MTN-MP750, especially since none of those are properly marked. We will be using an ORICO M234C3-U4 M.2 NVMe SSD enclosure for testing together with HWiNFO64 to check the USB version and speed, and CrystalDiskMark to confirm the speed in a practical manner. We’ll be switching to a Seagate USB HDD to test the USB 2.0 port, since the ORICO enclosure is not backward compatible. The results of all 5 ports are as follows: So all USB 3.2 ports have a 10 Gbps speed (good!), although we can see some appear to be slightly faster than others. The mini PC also supports up to three independent displays thanks to two HDMI 2.0 ports and a USB Type-C port with DisplayPort Alt. mode. We tested that successfully with a 10.1-inch “RPI All-in-One” touchscreen display (HDMI), a VGA monitor connected through an HDMI to VGA adapter, and a 14-inch CrowView laptop monitor connected directly to the USB-C port. Let’s start the benchmarks with PCMark 10.  The AMD Ryzen 7 7735HS mini PC got 6,075 points in PCMark.  The FP750 mini PC achieved 6506 points in the 3DMark Fire Strike benchmark. (Note the Beelink SER6 Pro got 6,349 points in May 2023, i.e. with different drivers)  PerformanceTest 11 Passmark Rating score is 6,187 points. That compares to the 6,693 points for the Beelink SER6 Pro with higher PL1 and PL2 power limits, and the CPU Mark is indeed higher at 24,427 points against 21,879 points for the Maxtang mini PC. Users who want to extra a bit more performance can adjust power limits with tools like RyzenAdj. As we noted in previous reviews, the overall Passmark Rating can be heavily influenced by the Disk Mark results, and the Foresee SSD is in the top 86th percentile of results. We ran CrystalDiskMark on the 512GB M.2 SSD included with the mini PC to confirm with the fairly good sequential performance with a read speed of 3.4 GB/s and a write speed of 2.5 GB/s.  Next up is Cinebench R23 to test both the single-core and multi-core performance of the Ryzen 7 7735HS processor.  The multi-core score is 10,129 points, and the single-core score is 1,416 points, which results in a 7.15x MP ratio. The Beelink SER6 Pro delivered 11,771 and 1,538 points respectively with a 7.66x MP ratio. The higher performance for the Beelink mini PC should mostly be the result of the higher (default) power limits. We start GPU testing with the Unigine Heaven Benchmark 4.0 where the Maxtang MTN-FP750 mini PC achieved 69.8 FPS and a 1,757 score at 1920×1080 resolution in Windows 11. That’s about the same score as we got in the Beelink SER6 Pro, so power limits for the CPU do not directly impact GPU performance…  We then streamed some YouTube videos at 4K and 8K resolution in the Google Chrome web browser.  4K 30fps played just fine with no frames dropped at all during the 10-minute test.  No problem for 4Kp60 either although a few (19) frames were dropped out of over 40,000.  The Ryzen 7 mini PC can also handle 8K YouTube videos at 30 fps without trouble, but it really struggled with the 8K 60 fps video as shown in the screenshot below with 20,565 frames dropped out of 24,181. Needless to say, the video was unwatchable.  Let’s compare the Windows 11 benchmark results on Windows 11 of the Maxtang MTN-FP750 mini PC with other mini PCs such as the Beelink SER6 Pro with the same AMD Ryzen 7 7735HS CPU (but higher default power limits), mid-range mini PCs like the GEEKOM A5 (AMD Ryzen 7 5800H) and GEEKOM IT11 (11th Gen Core i7-11390H Tiger Lake SoC), and the higher-end GEEKOM AS 6 AMD Ryzen 9 6900HX mini PC. Let’s summarize the main features of the 5 mini PCs first. Here are the benchmark results for the five devices. The Beelink SER6 Pro is missing PCMark 10 data because it was not run on the mini PC at the time of the review. The Maxtang MTN-FP750 mini PC has a higher 3D graphics performance possibly because of newer graphics drivers, but slightly slower CPU performance compared to the Beelink SER6 Pro due to more conservative power limits which may make sense for a mini PC designed for 24/7 operation. The AMD Ryzen 7 7735HS processor offers better graphics performance than the other solutions in the table, but CPU performance is pretty much similar across the board, except for the older 11th Gen TIger Lake mini PC from GEEKOM. Let’s test the performance of the 2.5GbE interface with iperf3 using UP Xtreme i11 mini PC‘s 2.5GbE port on the other side connected through a 2.5GbE TP-Link switch.  2.37 Gbps in both directions so no issue at all here. We tested the thermal design and cooling efficiency using HWiNFO64 while running the 3Dmark Fire Strike benchmark and measured a maximum temperature of 89.8°C with no thermal throttling detected.  The Maxtang MTN-FP750 mini PC has a very noisy fan, and it should probably be avoided if you want to use it as an HTPC or even a powerful mini PC in a quiet room. However, fan noise may not matter that much for the target markets since it is mostly designed for “office retail and digital signage”. We measured the noise with a sound level meter placed approximately 5 cm from the top of the device: The sound level meter measures 38-39 dBA in the room when everything is quiet. Power consumption was measured with a wall power meter as follows: Note: The mini PC was connected to a gigabit Ethernet router, two USB RF dongles were used for a  wireless keyboard and mouse combo, and a VGA monitor was connected to one of the HDMI ports through an adapter. Maxtang MTN-FP750 mini PC worked reasonably well in Windows 11 Pro with good performance while browsing, 4Kp60 and 8Kp30 YouTube videos were smooth (but not 8Kp60 videos that were choppy), higher 3D graphics performance than most other mini PC, and connectivity is good with 2.5GbE, an M.2 socket for a wireless module (not included in our sample), five USB ports for expansion, and support for up to three independent displays. Some downsides include that by default, the MTN-FP750 will not fully leverage the performance of the AMD Ryzen 7 7735HS octa-core processor due to conservative 35W PL1 and PL2 power limits, and the fan is louder than most other mini PCs we’ve reviewed. I can hear it even about five meters away in another room, and there does not even need to be a heavy load. Having said that the cooling solution is working fine and we did not notice CPU throttling during our tests, which may be important for a machine that’s supposed to run all day or even 24/7. We’ll switch to Ubuntu 22.04 in the third and final part of the review to check out Linux on the Maxtang MTN-FP750 mini PC. We’d like to thank Maxtang for sending the MTN-FP750 mini PC with AMD Ryzen 7 7735HS CPU (NUC-7735HS-A16 model) with 32 GB DDR5 RAM, and 512GB M.2 SSD. The mini PC can be purchased for $387.03 and up on Aliexpress, as well as on the company’s online store where the model with 32GB RAM and a 512GB SSD as reviewed here goes for $483, but you can also select a barebone model for $400, and they offer a discount for orders of 4 pieces. Continue reading “Maxtang MTN-FP750 business mini PC review – Part 3: Ubuntu 22.04“. CNXSoft: This article is a translation of the review on CNX Software Thailand by Suthinee Kerdkaew. Jean-Luc started CNX Software in 2010 as a part-time endeavor, before quitting his job as a software engineering manager, and starting to write daily news, and reviews full time later in 2011. Support CNX Software! Donate via cryptocurrencies, become a Patron on Patreon, or purchase goods on Amazon or Aliexpress   Related posts:         Change Ad Consent\nDo not sell my data "
}