{
    "title": "CES 2024: AMD Unveils Zen 4 Based Ryzen 8000G APUs, Radeon RX 7600 XT \nGraphics",
    "date": "1/9/2024",
    "url": "https://www.mysmartprice.com/gear/ces-2024-amd-unveils-zen-4-based-ryzen-8000g-apus-radeon-rx-7600-xt-graphics/",
    "text": "AMD launches new affordable desktop processors and graphics cards curated for gaming AMD has finally released its APUs based on the Zen 4 architecture. The company unveiled its Ryzen 8000G Series of desktop processors at CES 2024. These chipsets feature Radeon-integrated RDNA-3 graphics, which are capable of running games at 1080p without an external GPU. The top models of the new AMD 8000G chips also come with a dedicated Ryzen AI neural processing unit (NPU), which improves the efficiency of these processors in AI processing tasks. AMD has also launched four new chipsets in its 5000 Series, which are based on the Zen 3 architecture and the AM4 socket. AMD has launched four new chipsets in its new Zen 4 APU lineup. These are the Ryzen 7 8700G, Ryzen 7 8600G, Ryzen 5 8500G, and the Ryzen 3 8300G. All chipsets are unlocked and have support for turbo boost. They also share the same TDP of 65W and are based on the AM5 socket. The Ryzen 7 8700G comes with 8 cores and 16 threads, along with 24MB of cache. It is paired with Radeon 780M graphics based on RDNA-3. The Ryzen 7 8600G features 6 cores and 12 threads with a 22MB cache. It gets the Radeon 760M graphics unit. Both Ryzen 7 chips feature a dedicated Ryzen AI NPU, to accelerate AI-powered tasks. AMD says that these two processors can handle 1080p gaming at an affordable price point. The Ryzen 5 8500G is a mid-range processor in the new Zen 4 desktop APU lineup. It gets 6 cores and 12 threads with a base clock speed of 3.5GHz. It also supports turbo boost up to 5GHz. The Ryzen 3 8300G is an entry-level chipset with 4 cores and 8 threads. The Ryzen 5 and Ryzen 3 models do not feature the Ryzen AI NPU. The Ryzen 7 8700G is priced at $329 (approx Rs 27,300), the Ryzen 5 8600G at $229 (approx Rs 19,000), and the Ryzen 5 8500G at $179 (approx Rs 14,800). AMD has not announced the price of the Ryzen 3 8300G yet. These processors will be available in consumer markets starting from January 31, 2024.  AMD has also launched four new chipsets in its 5000 Series. These APUs are based on the Zen 3 architecture and use the legacy AM4 socket. The company says that these chipsets are designed with higher clock speeds and improved efficiency for gaming. However, the 5000 Series does not feature Ryzen AI NPUs. The new processors in the 5000 Series are the Ryzen 7 5700X3D, Ryzen 7 5700, Ryzen 5 5600GT, and Ryzen 5 5500GT. These are also unlocked chipsets with support for turbo boost. However, the top model Ryzen 5700X3D has a higher TDP of 105W and comes with a huge 100MB cache. The Ryzen 7 5700 gets 8 cores and 16 threads, while the Ryzen 5 5600GT and the Ryzen 5 5500GT feature 6 cores and 12 threads. All three chipsets have a TDP of 65W. The Ryzen 7 5700X3D is priced at $249, the Ryzen 7 5700 at $ 175, the Ryzen 5600GT at $140, while the Ryzen 5500GT costs $125. These are significantly more affordable than the 8000G Series. The new Ryzen 5000 desktop APUs will be available in consumer markets starting from January 31, 2024.  AMD also launched its Radeon RX 7600 XT graphics card with raytracing support. It features 32 compute units based on RDNA-3 paired with 16GB of GDDR6 memory. It also supports AMD FidelityFX, HYPR-RX, and Fluid Motion Frames, enabling a smooth gaming experience at a resolution of up to 1440p. The RX 7600 XT is optimized for tasks like video editing, 3D rendering, AI processing, and other resource-heavy tasks alongside gaming. It also supports DisplayPort 2.1 and HDMI 2.1a displays. It also comes with 32MP of Infinity Cache with a starting TBP of 190W. The AMD RX 7600 XT graphics card is priced at $329 (approx Rs 27,300). It will be available for purchase from board partners like Acer, ASRock, ASUS, Gigabyte, PowerColor, Sapphire and XFX starting January 24, 2024. OnePlus 11R vs OnePlus 12R vivo V30 vs vivo V30 Pro OnePlus 12R vs OnePlus 12 realme Narzo 70 Pro vs realme 12 Plus Motorola Edge 40 vs Motorola Edge 40 Neo OnePlus Nord CE 3 5G vs OnePlus Nord CE 3 Lite 5G iQOO Z9 vs Nothing Phone 2a OnePlus 12R vs iQOO Neo 9 Pro Moto G54 vs Moto G34 OnePlus 12R vs vivo V30 Pro "
}