{
    "title": "Close up with ASUS' range of new NVIDIA RTX Super and AMD Radeon RX 7600 XT \nGPUs at CES 2024",
    "date": "1/11/2024",
    "url": "https://www.tweaktown.com/news/95521/close-up-with-asus-range-of-new-nvidia-rtx-super-and-amd-radeon-rx-7600-xt-gpus-at-ces-2024/index.html",
    "text": "While at CES 2024 in Las Vegas, we were invited to take a look at what ASUS had on display. Conveniently, both AMD and NVIDIA just announced new GPUs while at CES 2024. AMD launched the RX 7600 XT and NVIDIA the RTX Super series consisting of the RTX 4070 Super, RTX 4070 Ti Super, and the RTX 4080 Super. So, let's take a look at how ASUS has up its sleeves. The big boy, the Strix RTX 4090 BTF OC Edition, was a GPU that was not really talked about but is welcomed anyway. This version has a patented vapor chamber with a milled heat spreader for lower GPU temperatures. The real story here is the BTF (back to front) power connectors on this high-end GPU, which is exciting here with no visible need for the traditional 8-pin or 16-pin external power connections. The release date and the price are unknown. Next up is the new TUF Gaming GeForce RTX 4070 Ti Super BTF White Edition. It's all about the white this year at CES 2024, and this GPU is certainly no exception. The TUF gaming cooler seems to just be a superficial paint job over the original TUF cooler. The BTF (back to front) part is what is exciting here again. Available Jan 24th, 2024. There is no official word on the price as of yet. Lastly, the TUF Gaming Radeon RX 7600 XT OC Edition with 16GB GDDR6. Showing the traditional TUF heatsink, this is a tried and true design. Three dual-bearing fans can last up to twice as long as other conventional designs. The release date and the price are unknown. Ryan Gendreau Ryan joined TweakTown in 2022, but that doesn’t mean he hasn’t been around the block a time or two. He has always been a gamer through and through, and building PCs started when he took apart his family’s 486 DX2-based PC. He is into everything PC but enjoys building, gaming, and water cooling. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}