{
    "title": null,
    "date": "1/4/2024",
    "url": "https://investorplace.com/market360/2024/01/why-amd-stock-stands-to-stay-a-winner/",
    "text": " Despite a rich valuation, bringing AI chips to market could propel AMD even higher Advertisement Source: Pamela Marciano / Shutterstock.com Like most other tech stocks, Advanced Micro Devices (NASDAQ:AMD) has been off to a rough start for 2024. After reaching prices nearing $150 per share in late December, AMD stock has since slid back to around $135 per share. The general direction of the broad market has played a role in this. However, valuation-related worries have also been a factor. AMD continues to trade at a moderately high premium to its main peer, Nvidia (NASDAQ:NVDA). This comes despite the fact that Nvidia has made far more commercial progress in the area of AI-compatible chips. But while these factors suggest that declines are more likely than further gains in 2024 for AMD shares, it’s not necessarily set in stone that things play out this way. There’s still a path to further gains for the stock. Why? Let’s take a closer look and find out. As seen from AMD’s latest price performance, the stock is experiencing another round of bearishness. Again, much of this is in tandem with investor sentiment about the broad market. The November and December rally has given way to a January sell-off, as the market re-assess how much the macro picture will improve this year. This negative sentiment shift could carry on in the near-term, having a further impact on the valuation of AMD stock. Alongside this, the other aforementioned factor affecting AMD’s price performance may not be waning in impact, either. Valuation concerns have only just now had an effect, despite commentators from Barron’s and elsewhere expressing them a month ago. Possibly in “priced for perfection” territory, if Advanced Micro Devices falls short of expectations, when it releases its latest results/updates to guidance later this month, investors could use it as justification to make their exit from the stock. Then again, maybe not. Although the skeptics may think that it’s the beginning of the end for AMD’s incredible AI-driven run-up, that’s not necessarily the case. Subsequent developments related to the company’s move into chips for the generative AI market could instead provide more runway. At present, the price-to-forward-earnings ratio for AMD stock is approximately 51. NVDA stock has a forward earnings ratio of only 38.9. On the surface, this suggests that AMD is overvalued, given that it’s Nvidia, not Advanced Micro Devices, that has already capitalized on the AI chips trend. Still, this may be a short-sighted takeaway. AMD’s management has been quite conservative in its AI-related sales forecasts. Back in October, CEO Lisa Su forecasted that the company would sell $2 billion worth of its Instinct MI300 accelerators in 2024. However, AMD could ship 400,000 units of this chip this year. With comparable chips from Nvidia selling for tens of thousands per unit, clearly there’s room for the MI300 to have an outsized impact on AMD’s fiscal results this year. That’s not all. As discussed recently, the company has another promising AI chip product: its Ryzen 8040 Series processors for laptops. Put it all together, and AMD clearly has the ingredients in place for another banner year. The company could “beat and raise” in the quarters ahead, the sell-side could continue raising their earnings forecasts, and the market may carry on factoring in future growth into the stock price. If weakness persists with AMD shares in the coming weeks, this may work to your advantage. That’s not to say that you’ll be able to buy this stock at prices last hit in January 2023, but the recent pullback, or any pullback ahead of earnings, may prove to be a solid entry point. Considering Advanced Micro Devices’ latest product launches, plus continued strong demand trends for AI chips, chances are this month’s quarterly earnings release will unveil positive surprises rather than major disappointment. As the months progress, and the company not merely meets, but beats, AI-related expectations, the stock could re-hit its high water mark ($161.91 per share), then keep heading up to new highs. Hence, do not get scared off by the macro doom-and-gloom, or by the valuation skeptics. Make AMD stock a buy instead. AMD stock earns an A rating in Portfolio Grader. On the date of publication, Louis Navellier had a long position in NVDA. Louis Navellier did not have (either directly or indirectly) any other positions in the securities mentioned in this article. The InvestorPlace Research Staff member primarily responsible for this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article. Technology, Artificial Intelligence, Semiconductor   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/01/why-amd-stock-stands-to-stay-a-winner/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Stocks to Buy Market Analysis Stocks to Sell Stocks to Buy Stocks to Sell Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}