{
    "title": "AMD Ryzen 5 8500G \"Hawk Point\" APU With Radeon 740M Spotted in Geekbench",
    "date": "1/6/2024",
    "url": "https://appuals.com/r5-8500g-geekbench-leaks/",
    "text": "Multiple AMD “Hawk Point” desktop APUs were spotted in early benchmarks earlier this month, with Ryzen 5 8600G and Ryzen 7 8700G seen on Geekbench. Although AMD delayed the launch of Zen4 CPUs last year, it is almost certain that the company intends to showcase the 8000G budget chipsets at CES ’24 this year. The Ryzen 5 8500G, the (sort-of) successor to the Ryzen 5 5600G, features a 6-core, 12-thread CPU configuration with RDNA3 graphics and Zen4 CPU architecture. It operates at a base frequency of 3.55GHz, with the ability to boost all the way up to 4999MHz. This chipset is clocked slightly lower than the 8700, as it uses the A2 die and operates with a combination of Zen4 and 4c cores. Apart from that, the 8500G has a 6MB (6x1MB) L2 cache and 16MB of L3 cache, achieving a score of 1965 on Single-Core and 8768 on Multi-Core testing. It is important to note that the chipset was tested on a B650M motherboard running DDR5 at unlisted memory speeds. For a bit of comparison, the Ryzen 5 8500G showed a decent 36% performance uplift in single-core and almost an 11% increase in multi-core scores when compared to its predecessor, the Ryzen 5 5600G. It is important to note that AMD skipped the 7000G lineup entirely. While the GPU wasn’t listed on Geekbench, multiple reports have revealed that the 8500G will, in fact, feature the Radeon 740M, running at 2800MHz with 4 Compute Units. According to benchmarks, this GPU performs almost 35% below a 1060 3GB. So, in theory, it should at least be able to run some eSports titles and less demanding games. According to insider information, AMD plans on revealing the chipsets at CES and later making them available for purchase as soon as January 31st. This is all we know for now, but rest assured that we will keep you updated as new information becomes available. via: Olrak29_ Muhammad Qasim "
}