{
    "title": "What is FidelityFX Super Resolution: understanding AMD’s upscaling \ntechnology",
    "date": "2/22/2024",
    "url": "https://www.91mobiles.com/hub/amd-fidelityfx-super-resolution-everything-you-need-to-know/",
    "text": "When it comes to enhancing gaming visuals and performance, two technologies have been making waves in the gaming industry: DLSS (Deep Learning Super Sampling) and FSR (FidelityFX Super Resolution). DLSS, developed by Nvidia, and FSR, developed by AMD, both aim to improve gaming experiences by employing different approaches.DLSS utilises deep learning algorithms to upscale lower resolution images to higher resolutions, resulting in smoother gameplay and improved image quality. On the other hand, FSR focuses on enhancing performance by using spatial upscaling techniques to increase frame rates without significantly compromising image quality. Unlike DLSS, FSR does not rely on complex neural networks but instead utilises advanced rendering algorithms to upscale lower resolution frames in real time.While both technologies serve the same purpose of improving gaming performance and visual fidelity, they differ in their implementation and compatibility. DLSS is exclusive to Nvidia graphics cards and requires game developers to integrate support for the technology into their titles. In contrast, FSR is an open-source solution developed by AMD, making it accessible to a wider range of hardware configurations and game developers. Table of Contents AMD FSR 1.0The first version of AMD FidelityFX Super Resolution is primarily a spatial upscaler. It works by taking the current anti-aliased frame and upscaling it to display resolution without relying on other data such as frame history or motion vectors. Simply put, FSR can upscale the resolution of a game where, for instance, a game rendered at 1080p resolution can actually be displayed at 1440p. AMD FSR 2.0AMD FidelityFX Super Resolution 2.0 (FSR 2) is just an improved upscaler. It uses temporal algorithms to reconstruct fine geometric and texture detail, producing anti-aliased output from aliased input. FSR 2 was developed to provide higher image quality compared to FSR 1 and to deliver similar or better than native image quality and boost framerates in supported games across a wide range of products and platforms. AMD FSR 3.0AMD FidelityFX Super Resolution 3.0 (FSR 3) is the latest version of FSR that uses a combination of upscaling technology and frame generation to deliver a noticeable increase in framerates in supported games. FSR 3 extends upon FSR 2’s upscaling by adding frame generation – the ability to generate entirely new game frames and present those to the user to improve FPS. FSR 3 does this by adding two new technologies – Frame Interpolation and Optical Flow enhanced from AMD Fluid Motion Frames. Initially designed as a two-pass solution, AMD’s FidelityFX Super Resolution (FSR) has undergone a significant evolution with the introduction of FSR3, which integrates a third pass for image generation.In the first pass, FSR employs the Edge Adaptative Spatial Upsampling (EASU) algorithm to enhance image definition. This involves enlarging the image while maintaining adaptability and analyzing salient points such as edges. By utilising an improved Lanczos filter and a rational approximation technique, FSR effectively boosts resolution without taxing system resources excessively. With the introduction of FSR3, a crucial third pass is added to the image generation process. This pass considers user interface elements, allowing for seamless integration into the final image. By generating additional images after adding the user interface, FSR3 mitigates potential visual disruptions and enhances overall frame rates, resulting in a doubled number of frames per second displayed.Following this, the second pass involves the Robust Contrast Adaptative Sharpening (RCAS) algorithm, which enhances image sharpness. By adjusting the sharpening effect on a per-pixel basis, RCAS ensures uniform sharpness throughout the image, minimising artefacts and improving visual clarity.AMD FSR offers four modes: Ultra Quality, Quality, Balanced, and Performance, each with varying scaling factors affecting input resolution and prioritizing image quality or performance.In Ultra Quality Mode, image quality closely resembles native rendering but may exhibit shimmering in fine details. Quality Mode offers a balance between performance and image quality, with a 1.5x scale factor. Balanced Mode produces a softer image compared to native rendering, ideal for higher resolutions like 4K or 1440p. Performance Mode sacrifices image quality significantly for improved performance, suitable for demanding titles or esports where high refresh rates are crucial.Similar to Nvidia’s DLSS, FSR does come with its own set of issues. FSR 1 and 2 cannot counter CPU bottlenecks, which stem from slow or outdated CPUs or poorly optimized games. Lowering resolution, as FSR 1 or 2 does, mainly reduces GPU load and may not improve framerates if CPU bottlenecking occurs. FSR 3 shares similar drawbacks with DLSS 3, struggling with replicating UI elements and exhibiting latency issues. The delay between rendering frames can result in perceptible lag, resembling a lower framerate experience. While potential improvements in visual quality are feasible for FSR 3, tackling latency challenges remains a significant obstacle. Thanks to the open nature of FSR, support for the upscaling technology is available on a wider range of GPUs. If you wish to take advantage of AMD FSR 3, which is the latest version, you need to have either of the following GPUs: As for older versions, the following GPUs support FSR. While FSR 2 supports the same list of GPUs as above, AMD suggests that the requirements for an optimal experience requires a slightly more powerful graphics cards for higher resolutions.Access to FSR is available on a number of games including popular titles like Cyberpunk 2077, Marvel’s Spider-Man and Spider-Man Miles Morales, Red Dead Redemption 2, God of War and many more. The entire list of games is periodically updated and is available on AMD’s FidelityFX Super Resolution webpage. There’s even an option to request a game through the AMD FSR wishlist. To enable AMD FidelityFX Super Resolution (FSR), users first need to ensure their graphics drivers are updated and that the game they want to play supports FSR. Upon launching the game, navigate to the graphics settings menu, locate the FSR option (should be under graphics or display options) and toggle it on. Depending on the game, users may choose from different FSR quality modes. After selecting the desired mode, save the settings and restart the game if necessary. While playing monitor your system’s performance to ensure FSR is functioning as expected, noting an increase in framerate and smoother gameplay in graphically intense scenes. "
}