{
    "title": "AMD Ryzen 7 8700G & Ryzen 5 8600G APU Review: Modern APUs For A Modern \nPlatform",
    "date": "2/3/2024",
    "url": "https://wccftech.com/review/amd-ryzen-7-8700g-ryzen-5-8600g-apu-review/8/",
    "text": "Testing the AMD Ryzen 8000G APUs took me back to the Llano days. While the newest desktop chips are grander in all ways possible, they still have the same fundamentals of offering a high-performance CPU design with a GPU meant to replace entry-level discrete graphics cards within a package that's both effective in terms of cost and efficiency. AMD is the only company offering a capable and performant integrated graphics solution that can handle GPU-intensive tasks such as gaming and Hawk Point does it better than ever. Ryzen 8000G: The Zen's, The RDNA's & The XDNA's First, we have to talk about the three main components individually. The AMD Zen 4 cores are as strong as ever with the Ryzen 7 8700G almost matching the Ryzen 7 7700 while the Ryzen 5 8600G matches the Ryzen 7 5700G with its 6 cores. The other two SKUs have a split Zen 4 and Zen 4C core heirarchy but those are a different topic of discussion. The Zen 4 cores are as you would expect, fast and very tuneable, running very efficiently and delivering great multi-threaded performance versus their predecessors. The GPU is the highlight of these APUs. AMD was stuck with its Vega architecture in the previous desktop APU releases although the RDNA architecture was integrated on laptop chips a while back. So there was a discrepancy between the desktop and laptop platforms. This changes with the Ryzen 8000G packing the same RDNA 3 graphics as the desktop dGPUs and laptop APUs. The new RDNA 3 architecture has many advantages, first and foremost is proper driver support and support for the latest technologies such as FSR 3, HYPR-RX, and Fluid Motion Frames. These three techs provide the quintessential experience to budget and mainstream gamers. The APUs are great for 1080p gamers but whenever you feel like the need to boost your FPS further, frame-gen and a range of upscaling techniques will always be available to you. RDNA 3 iGPUs: Powerful Integrated Graphics For Gaming Backed By Powerful FiedlityFX Support Compared to the past generation Vega graphics, you are getting almost doubling of performance at the still great (or better) efficiency. The extra clock bump and higher TDPs do allow for a small boost over the laptop RDNA 3 SKUs too. Compared to discrete GPUs, it looks like AMD still has a long way to go to match modern desktop offerings such as the Intel Arc A310, RX 6400, or the RTX 3050 but they are on the right path. The iGPU matches a GTX 1650 which is still a widely popular choice for entry-level gamers and with these APUs, you can get a high-performance CPU with a very decent and feature-rich GPU core that also saves you wattage that is usually consumed by a 75W AIC. I also noticed in my tests that the new iGPUs are very bandwidth-starved. Switching from DDR5-6000 to DDR5-7000 netted over 10% performance gains. Using faster overclocked memory might be useful advice but the majority of budget and entry-level PC builders won't be spending big on DDR5 modules which are still costly compared to DDR4 sticks. Maybe we will see a day when the very same APUs feature a dedicated cache to eliminate some of these bandwidth bottlenecks but it isn't here yet. Lastly, we have the NPU. The NPU is still a work-in-progress but one can be assured that AMD has hardware ready for it and we can wait for software/driver releases to make it shine. With upcoming Windows updates focused on the AI PC ecosystem, this NPU will come in real handy with its 16 TOPs of dedicated AI compute power. We should also mention that this is the first desktop chip with a dedicated NPU and AMD has really been knocking out Intel in the race to AI PCs with both its laptops and now desktops being the first to feature a fast dedicated NPU for AI computing. Ryzen 7 8700G & Ryzen 5 8600G Are A Solid Upgrade For AM4 Owners On A Budget Now talking about the two SKUs that we tested. I think the AMD Ryzen 7 8700G is a well-rounded package with 8 fast Zen 4 cores and the fastest integrated graphics chip on the market which can let you play the latest AAA experiences using AMD's solid FiedlityFX technology suite. The CPU has very low power consumption and when paired with a solid B650 motherboard, it makes for a great mainstream PC that will be upgradable for years to come. The $329 US price point could've been tuned down to $299 US but even then, I think the 8700G is well worth it. The Ryzen 5 8600G offers a similar experience with its 6 cores and cut-down iGPU but it is a better value at the $229 US price. We have been waiting for AMD to modernize its APU portfolio for a long time now and with the AM5 platform and the Ryzen 8000G APUs, mainstream/budget PC gamers have a great solution to upgrade to. Kudos to AMD for its continued efforts in innovating the APU space, especially the PC desktop segment. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  You need to login to use this feature. "
}