{
    "title": "OpenAI reaches $80b valuation while CEO Altman preps for AI chip \nmanufacturing",
    "date": "2/17/2024",
    "url": "https://www.notebookcheck.net/OpenAI-reaches-80b-valuation-while-CEO-Altman-preps-for-AI-chip-manufacturing.804430.0.html",
    "text": "OpenAI, the maker of the popular generative AI platform ChatGPT, has signed a transaction with venture capital firm Thrive Capital, which has increased its worth to at least $80 billion, a nearly threefold rise from just nine months prior. Instead of a standard investment round to raise money for the company, employees are able to cash out their company shares under the terms of the agreement. Early last year, OpenAI consented to a similar agreement. OpenAI was valued at approximately $29 billion when venture capital firms Thrive Capital, Sequoia Capital, Andreessen Horowitz, and K2 Global decided to purchase shares in a tender offer. In the meantime, OpenAI CEO Sam Altman seeks a government license for his new AI chips business, which may raise antitrust and national security concerns. Altman, who is purportedly working on a new venture that might increase global chip manufacturing, has informed prospective partners and investors that he cannot proceed without approval from Washington. The introduction of OpenAI's ChatGPT in late 2022 has generated interest in artificial intelligence and prompted businesses to investigate how to utilise the technology best. OpenAI debuted Sora, its newest product, on Thursday. Sora can create films based on text cues. The video service is not yet accessible to the general public, and it is unclear when it will be because OpenAI states that it is currently implementing \"a number of important safety measures\" to reduce bias and disinformation. The Samsung Galaxy Tab A9+ 10.9” 64GB Android Tablet provides a reliable platform for exploring advanced AI applications due to its robust hardware and seamless integration with Android. It is currently available on Amazon at a 14% discount, priced at $189.99. The New York Times, Reuters, Forbes "
}