{
    "title": "Do Its Financials Have Any Role To Play In Driving Advanced Micro Devices, \nInc.'s (NASDAQ:AMD) Stock Up Recently?",
    "date": "2/28/2024",
    "url": "https://finance.yahoo.com/news/financials-role-play-driving-advanced-130010515.html",
    "text": "Advanced Micro Devices' (NASDAQ:AMD) stock is up by a considerable 47% over the past three months. Given that stock prices are usually aligned with a company's financial performance in the long-term, we decided to study its financial indicators more closely to see if they had a hand to play in the recent price move. Specifically, we decided to study Advanced Micro Devices'  ROE in this article. Return on Equity or ROE is a test of how effectively a company is growing its value and managing investors’ money. In simpler terms, it measures the profitability of a company in relation to shareholder's equity. Check out our latest analysis for Advanced Micro Devices The formula for ROE is: Return on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity So, based on the above formula, the ROE for Advanced Micro Devices is: 1.5% = US$854m ÷ US$56b (Based on the trailing twelve months to December 2023). The 'return' is the amount earned after tax over the last twelve months. One way to conceptualize this is that for each $1 of shareholders' capital it has, the company made $0.02 in profit. Thus far, we have learned that ROE measures how efficiently a company is generating its profits. We now need to evaluate how much profit the company reinvests or \"retains\" for future growth which then gives us an idea about the growth potential of the company. Assuming everything else remains unchanged, the higher the ROE and profit retention, the higher the growth rate of a company compared to companies that don't necessarily bear these characteristics. As you can see, Advanced Micro Devices' ROE looks pretty weak. Even when compared to the industry average of 15%, the ROE figure is pretty disappointing. However, the moderate 14% net income growth seen by Advanced Micro Devices over the past five years is definitely a positive. We believe that there might be other aspects that are positively influencing the company's earnings growth. For instance, the company has a low payout ratio or is being managed efficiently. Next, on comparing with the industry net income growth, we found that Advanced Micro Devices' reported growth was lower than the industry growth of 27% over the last few years, which is not something we like to see. Earnings growth is an important metric to consider when valuing a stock. What investors need to determine next is if the expected earnings growth, or the lack of it, is already built into the share price. This then helps them determine if the stock is placed for a bright or bleak future. Is AMD fairly valued? This infographic on the company's intrinsic value  has everything you need to know. Given that Advanced Micro Devices doesn't pay any dividend to its shareholders, we infer that the company has been reinvesting all of its profits to grow its business. On the whole, we do feel that Advanced Micro Devices has some positive attributes. Namely, its respectable earnings growth, which it achieved due to it retaining most of its profits. However, given the low ROE, investors may not be benefitting from all that reinvestment after all. That being so, the latest analyst forecasts show that the company will continue to see an expansion in its earnings. To know more about the company's future earnings growth forecasts take a look at this free report on analyst forecasts for the company to find out more. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}