{
    "title": "AMD to Potentially Skip RDNA 4 for Rumored Zen 6 CPUs",
    "date": "2/23/2024",
    "url": "https://gamerant.com/amd-skip-rdna-4-zen-6-cpus-rdna-5-rumor/",
    "text": "According to one tech insider, AMD might be skipping the use of RDNA 4 GPU architecture entirely for the company's rumored Zen 6 CPUs. AMD could be skipping RDNA 4 for its upcoming Zen 6 \"Medusa\" client CPUs in favor of an integrated RDNA 5 GPU. The RDNA 5 architecture was last referenced in the leaked FTC documents from September 2023, revealing that Microsoft plans to use a Zen 6 APU from AMD for its next-gen Xbox console. In May 2022, AMD's company roadmap claimed that Zen 5 CPUs would be released sometime in late 2024. Some rumors suggest AMD will release its Zen 5 Granite Ridge processors as early as April, while others claim volume production will instead ramp up in Q3 2024. Granite Ridge is rumored to be the Ryzen 9000 series of desktop CPUs for gaming and productivity, but AMD has yet to reveal any official details. As reported by Videocardz.com, Twitter user and tech insider Everest claims the Zen 6 Medusa client CPU architecture will use an RDNA 5 iGPU instead of RDNA 4, noting that the company will skip the architecture. It's rumored that AMD will use 2.5D interconnects instead of a multi-die design found in Ryzen 8000G series APUs. This would greatly increase the bandwidth speed between chiplets, with one of the chiplets featuring a new RDNA 5 tile and GDDR7 memory. The new Zen 6 client architecture from AMD is also rumored to use a smaller process node, such as 2nm or 3nm. Speculation currently points toward a release in 2025 or 2026 for Zen6 as well. RDNA 5 will also be featured in the Zen 6 APU for the next-gen Xbox console, which could launch in 2028, according to Microsoft's leaked documents. The console's Zen 6 APU will feature a balance of \"big\" and \"little\" CPU cores with an RDNA 5 GPU co-designed or licensed by AMD. The switch to RDNA 5 was expected by some enthusiasts in the PC gaming community, but others are disappointed with RDNA 4 potentially being a stopgap until RDNA 5 arrives. Some only consider RDNA 4 to be a slight upgrade to the existing RDNA 3 GPU, which is present on AMD graphics cards like the Radeon RX 7800 XT. At the very least, Zen 6 could be an enticing CPU generation for PC gamers due to the improved bandwidth. The RDNA 5 series of discrete AMD Radeon GPUs could pair quite well together with a Zen 6 CPU in the future. The AMD Ryzen 7 8700G 8-Core, 16-Thread CPU is a powerful APU that delivers modest gaming performance for PCs that do not currently utilize a discrete GPU by using the fastest iGPU solution currently available to end users.It comes bundled with a stock cooler, an octa-core CPU config, and a rated TDP of 65W, making it a great well-priced alternative to many budget CPU and GPU combos on the market currently.The AMD Ryzen 7 8700G also happens to be one of AMD's first desktop CPUs that offers the AMD Ryzen AI engine built into the chip. AMD Ryzen 7 5700X3D extends the lifespan of the AM4 platform through its 3D V-Cache technology that helps it perform equally well in games as the latest Ryzen 7000 CPUs. With 8 Cores/16 threads configuration, it is somewhat equivalent to the more expensive 5800X3D and is perfect for both gaming and CPU-intensive workloads We hope you like the items we recommend and discuss! Game Rant has affiliate and sponsored partnerships, so we receive a share of the revenue from some of your purchases. This won’t affect the price you pay and helps us offer the best product recommendations.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Raul is a freelance writer with four years of writing and editing experience in games journalism. Currently, he is a News Writer at Game Rant and the Managing Editor of Final Weapon, a Japanese gaming and anime/manga-oriented outlet. Raul has a passion for the Japanese gaming industry, but he dabbles into first-person shooters like Call of Duty and Destiny. Pokemon as a franchise has been around since 1996, and now the latest announcements from Pokemon Day seem to suggest a big streak will be broken. It's probably going to be a while until fans hear anything more from Civilization 7, and in the meantime, they might want to check out Millennia. An email from Rockstar leadership to employees reveals that the highly anticipated Grand Theft Auto 6 is entering the last stages of development. A recent update for the wildly popular open world survival game Palworld adds a feature Xbox players have been waiting for since launch. Want to get the most iconic Pokémon in the entire franchise? If so, here's all the intel on how to obtain a Pikachu Ph.D. in Pokémon Go. Several new Helldivers 2 weapons leak online ahead of a potential reveal or game update from Arrowhead Game Studios. "
}