{
    "title": "AMD Radeon RX 7900 GRE is a tough sell against Nvidia RTX 4070",
    "date": "2/19/2024",
    "url": "https://www.club386.com/amd-radeon-rx-7900-gre-is-a-tough-sell-against-nvidia-rtx-4070/",
    "text": "The RTX 4070 seems to be the better choice. Infamously known as the GPU you can’t buy, the AMD Radeon RX 7900 GRE has finally landed on UK shores. For now, there’s very low stock, but word on the grapevine says that even more custom AIB partner cards are on the way. Apparently, Gigabyte has a Gaming OC variant geared up for mainstream release. Plus, a PowerColor Hellhound RX 7900 GRE OC edition has been spotted on sale at European retailers. On top of that, RX 7900 GRE is rumoured to make its way to the US. Good news for Team Red fans. However, one question still remains: will it be good enough to take on Nvidia’s RTX 4070? As we all know, Nvidia has a bunch of RTX 40 Super Series replacements that have directly tanked its predecessor’s price tag. This puts RTX 4070 and Team Red’s 7900 GRE in the same price bracket and in direct competition with one another, particularly if the rumoured $549 price tag is correct. RTX 4070 discounts aren’t just the result of Nvidia adjusting to accommodate its latest and greatest graphics cards either. It’s a direct response to AMD slashing the prices of the RX 7900 XT. That’s not even considering the fact that some Europe e-tailers have already discounted their RX 7900 GRE stock, although those have long since sold out. Some may argue that if AMD satiates the market with its GRE variant, the more discounts we’ll receive. However, you could pick up an MSI GeForce RTX 4070 Ventus 3X right now for 6% less at £554.99. Compare that with the currently hard-to-find XFX Radeon RX 7900 GRE at £659.99, and there’s even less reason to consider the GRE card. Mind you, when placed head-to-head, 7900 GRE comes on top in pure rasterization, but RTX 4070 is naturally superior in ray tracing. And if ray-traced performance is all you care for, then we have an obviously clear winner here. But, if you need more convincing, then Nvidia has a few more tricks up its sleeve. With Nvidia DLSS under its belt, RTX 4070 gives a performance boost of up to 55% in supported games, including Cyberpunk 2077. This makes ray tracing a viable option without the same caveats you’d get buying a non-RTX 40 Series GPU. FSR 2 and FSR 3 are more prominent, but 4070 has access to those upscalers, too. Last but certainly not least is power efficiency. The RTX 4070 has a max TDP of 200W versus a 260W TDP on the RX 7900 GRE. This directly results in lower power draw, as well as lower cooling requirements. Another clear win for Team Green, as evident with the smaller Founder’s Edition card and other slimmer RTX 4070 partner cards we’ve received. However, the 7900 GRE provides 16GB of GDDR6 video memory, whereas the RTX 4070 only offers 12GB. AMD might be better for future proofing. At the end of the day, it doesn’t matter what you choose, as long as you’re happy with your choice. However, even as a dedicated AMD fan, RTX 4070 seems to be the best bang for your buck – at least for now. AIO\nAlder Lake\nAMD\nAOC\nApple\nArc\nASRock\nAsus\nBusiness\nCES\nchassis\nCooler\ncooling\nCorsair\nCPU\nDDR5\ndeals\nDrivers\ngaming\nGeForce\nGigabyte\nGPU\nhandheld\nIntel\nKeyboard\nLaptop\nM.2\nmemory\nMicrosoft\nmods\nmonitor\nMotherboard\nMSI\nNvidia\nPlayStation\nPSU\nRadeon\nRTX\nRTX 40-series\nRyzen\nSamsung\nSony\nSSD\nWindows 11\nXbox About | Contact | Editorial Policies | News Tip Advertise | Privacy | Newsletter | Donate "
}