{
    "title": null,
    "date": "2/9/2024",
    "url": "https://wccftech.com/tsmc-sk-hynix-form-strategic-ai-alliance-fueling-hbm4-for-next-gen-nvidia-amd-gpus/",
    "text": "TSMC and SK hynix, are reportedly forming an AI alliance to progress together into the future which will be accelerated with HBM4 development for NVIDIA & AMD's next-gen GPUs. Right now, the AI industry is dynamically evolving, and when it comes to the financial side of things, the revenue figures we are seeing right now have attracted every major tech firm you could think of. TSMC and SK hynix are two major players in supplying the fundamentals required by the industry, with one leading the semiconductor charts and the other leading the wagon regarding HBM supply. It is reported that both firms have formed a \"progressive\" alliance with the aim of joint development of next-gen products, ultimately leading them to take the spotlight in the markets. The report by Pulse News discloses that the new alliance, named \"One Team\", has come into effect to thwart industry competition by developing new products ahead of others. The primary focus this time would be on working on the next generation of HBM memory, the cutting-edge HBM4, which has a huge potential when it comes to revolutionizing the computing capabilities of the AI segment and is expected to power next-gen NVIDIA AI GPUs. TSMC's inclusion here could catalyze the South Korean giant's influence in the markets since the firm is an expert in garnering clients' attention. It is also said that the alliance is to combat the growing influence of Samsung Electronics on the markets since Samsung is in a position where it has both semiconductor and memory facilities, which is why the firm has been favored by companies involved in the AI race since it reduces supply chain complexities. Now that TSMC and SK hynix operate as a single unit, things would become a whole lot more competitive and interesting. The development of HBM4 will be accelerated to fast-forward NVIDIA and AMD's next-gen GPUs. NVIDIA is expected to utilize HBM3E in its upcoming H200 and B100 GPUs but we can see a future variant of Blackwell and the next-gen Vera Rubin chips to harness the full potential of the new HBM standards. The competitiveness in the markets is what drives innovation, and the \"One Team\" alliance is certainly going to speed things up. It will be interesting to see how the \"source\" side of things responds to two major firms teaming up, but we might see similar alliances forming as well as moving ahead. News Source: Taiwan Economic Daily Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}