{
    "title": "Super Micro Computer (SMCI) Faces Semiconductor Shortage After Explosive \nIncrease In Demand",
    "date": "2/18/2024",
    "url": "https://wccftech.com/super-micro-computer-smci-faces-semiconductor-shortage-after-explosive-increase-in-demand/",
    "text": "Super Micro Computer (SMCI), the well-known manufacturer, is reportedly facing a semiconductor shortage as demand reaches new levels. BNN Bloomberg reports that Super Micro Computer (SMCI) has made headlines when it comes to its recent stock performance in the markets, with an upsurge of a whopping 182% from its closing price in 2023. For those who haven't heard about SMCI, they are a leading provider of high-performance server and storage systems specifically designed for AI workloads and have partnered up with Team Green to dominate the data center space. After making huge strides in the markets, it seems like the firm has fallen short of \"semiconductors,\" a hurdle every other company in the AI domain faces. The developments in the AI servers markets have rapidly increased in 2024, with firms like NVIDIA and AMD leading the way when it comes to supplying crucial components. SMCI has indeed managed to capitalize on this immense demand, and its efforts have also been reflected in the firm's share pricing. There is a chip shortage — once we have more supply from the chip companies, from Nvidia, we can ship more to customers. The company's CEO has disclosed that the firm is able to entertain sales volume valued at US $25 billion for now, claiming that their current production capacity is indeed confined. SMCI is on track to reveal \"mindblowing\" revenue figures in the upcoming quarters, as Wall Street expects the firm's revenue to \"more than double to $14.5 billion\" by June. Such claims are well expected, judging by the fact that the data center market in itself is growing rapidly. NVIDIA's CEO Jensen Huang has stated that it could grow to 2 trillion dollars in the next five years, showing the potential captivated in this segment. We expected more stories like SMCI, especially regarding their stock market performance, to surface since the AI market is here to stay. With the significant increase in interest globally, we should expect \"shocking\" things ahead. News Source: BNN Bloomberg Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}