{
    "title": "AI and Semiconductor boom: A look at AMD and ARM's Trajectory",
    "date": "2/21/2024",
    "url": "https://www.cmcmarkets.com/en-au/analysis/ai-semiconductor-boom-amd-arm",
    "text": " Trade on the go Download our apps CFD app Share Trading app Trade the way that suits you Invest in Shares Invest in over 35,000 domestic and international shares and ETFs from 15 global markets. Plus a wide range of domestic products including Options, mFunds, warrants and more. Trade CFDs Trade contracts for difference (CFDs) on over 12,000+ products including FX Pairs, Indices, Commodities, Shares, Cryptocurrencies, and Treasuries.  Written by CMC Markets 21 Feb 2024, 12:35 Share this Semiconductor stocks have recently garnered significant interest from our clients, as developments in AI continue to unfold in real time. While NVIDIA and TSMC often grab the headlines, this brief turns the spotlight on AMD and ARM, two notable stocks worthy of attention. This analysis examines the technical trends, price drivers, and future trajectory for these stocks. Advanced Micro Devices, Inc. (AMD) is a global semiconductor company. Within the global semiconductor industry, it offers x86 microprocessors, either as standalone devices or incorporated into accelerated processing units for commercial and consumer markets. AMD devices are used in mobile personal computers (PCs), tablets, professional workstations, servers and graphics and multimedia products.  AMD has a pivot point potentially at $163.31 for a reversal to an upward trend. The alternative scenario is price goes below the $162.50 pivot with a potential pull to the Support at $149.97. Moreover, AMD is trading above both its 20- and 50-day MA at 173.8550 and $156.4430 respectively with a price Resistance is at $184.9050. The RSI is above the 50 with the MACD below its signal line, and positive. There is a probability the stock could retrace in the short term. AMD could potentially rise to the $198.00 – $214.20 range with a current bullish consensus Price Target of $193. Base case assumptions are of further share gains for AMD in server compute and notebook continue to drive growth, further supported by a strengthening AI story and a 1 year forward FY2025 EPS of $4.21. Bull consensus: Bull case assumes further execution for AMD. In computing and graphics, AMD continues to gain material market share, while both CPU and GPU markets remain healthier than forecasted. Their server business re-accelerates and grows faster than forecasted, culminating in a bull case FY2025 estimate of $5.03 EPS on a 50x multiple with a price target of $252.00. Bear consensus: The bear case assumes AMD loses momentum as Intel regains its footing with early success in server due to Granite Rapids. The multiple compresses to 30x as they are unable to drive meaningful revenues in AI markets beyond 2024 resulting in a FY2025 estimate of $3.84 EPS and a target price of $115.00. Catalyst To Upside Downside Risk ARM is a leading semiconductor IP provider specialising in the licensing of CPU cores for the use in advanced digital chips. Its low power, high performance designs are optimised for use in mobile, cloud infrastructure, and IoT as well as the emerging compute in vehicles. ARM also licenses designs for neural processing capabilities (NPUs), graphics cores (via its Mali products) and offers custom system-on-chip (SOC) services as well. The company also provides technical support and training services. ARM has headquarters in Cambridge, UK as well as its North American base in San Jose. It employs almost 6,000 people worldwide and was set up in the 1980s as a spin out of Acorn computers and was originally named Advanced RISC Machines (or ARM for short).  ARM Holdings has a pivot point at $118.1125 with potential a reversal continuing its upward trend. The alternative scenario is price goes below the $118.1125 level with a potential pull to the $72.28 Support. ARM is relatively extended and trading well above both its 20- and 50-day MA at 100.1852 and $83.2704 respectively with a price Resistance is at $163.9450. The RSI is above the 50, closer to the overbought level at ~67% with the MACD above its signal line in as strong momentum and positive. The stock is consolidating in the short term with a probability for a short-term reversal. ARM consensus price range of $55.40 – $140 with a current bearish Price Target of $107. Base case assumptions model ARM’s non-GAAP EBIT margin to pass c.51% in FY26e, giving EPS of $2.15. Consensus expectation is for revenues to grow with an estimated 22% CAGR to FY26, despite slowing growth in licensing. ARM’ s business model and dominant market position combined with structural growth opportunities (AI and autos) could suggest the stock deserves a valuation premium to peers. Bull consensus: ARM could see better than modelled gains, especially in the infrastructure segment, driven by AI and general cloud growth, as well as a more uniform transition to higher royalty rates (shift to v9 architecture) than modelled with key customers (esp. in autos, smartphones) all shifting to 5%+ rates. This would all drive higher royalties’ growth and could see adjusted EBIT pass 60% by FY26e. This could see its FY2026e EPS reach $4, a 50x multiple then takes the shares to $200. In this scenario AI & higher rates drive and creating an inflection; the EPS nears $4 with a Consensus Target Price of $200.00. Bear consensus: Key downside risks include (i) weaker royalty rates in key end markets, (ii) the business impact from an unfavourable litigation outcome, (iii) loss of share to competitors in growing end markets and (iv) the possibility that geopolitical issues limit global reach longer term. As such the FY26e EPS may reach only c.$1.5 as operating leverage fails to push EBIT margins much beyond c.40%. A cycle low c.25x PE multiple would mean a c.$38/share valuation in this bear scenario. Risk factors impact; EPS edges to c.$1.5 with a Consensus Target Price of $38.00. Catalyst to Upside Downside Risk This analysis was prepared on February 20, 2024. Past performance is not an indicator of future performance.  Written by Joseph Baffour-Diawuoh Sales Trader, CMC Markets APAC Joseph Baffour-Diawuoh is a Sales Trader at CMC Markets with 15 years of industry experience. His journey began at Newmont, the world's largest gold mining company, where he honed his analysis and project management skills before moving into wealth and asset management. Joseph has a diverse background in fintech, consulting and advisory with experience across Australia, Europe, North America, and Africa. Prior to joining CMC Markets, Joseph worked as an Equities Advisor managing portfolios for HNW, sophisticated and family office clients here in Australia. At CMC Markets, his focus on trade execution, research, and education guarantees top-tier service and support for premium clients.  Latest from CMC The 2024 Bitcoin halving explained: Critical factors for investors This analysis will break down the underlying mechanics of the halving, explain how it can impact Bitcoin's price, and review key considerations for the upcoming April 2024 halving. 14 Mar 2024 Navigating temptation: Strategies to avoid going short too early AI and Semiconductor boom: A look at AMD and ARM's Trajectory Nvidia: Amazon down, Alphabet next? Related articles The 2024 Bitcoin halving explained: Critical factors for investors This analysis will break down the underlying mechanics of the halving, explain how it can impact Bitcoin's price, and review key considerations for the upcoming April 2024 halving. 14 Mar 2024 Navigating temptation: Strategies to avoid going short too early As many markets hover around all-time highs, investors are increasingly opting for short positions. This timely analysis addresses risk management and pitfalls to avoid during this period, with a focus on leveraging divergences as a valuable trading signal. 27 Feb 2024 AI and Semiconductor boom: A look at AMD and ARM's Trajectory This analysis examines the technical trends, price drivers, and future trajectory for these stocks. 21 Feb 2024 Nvidia: Amazon down, Alphabet next? NVIDIA is vying for the top spot among tech giants like Amazon and Alphabet, but what are the current dynamics shaping this competition? 18 Feb 2024 Aus 1300 303 888 CFD lines open 24hrs, Monday morning–Saturday morning Share Trading lines open 7.30am – 7.00pm (Sydney time), Monday–Friday Contact Download our app Get greater control and flexibility for peak performance trading when you're on the go. CFD app Share Trading app Investing in CMC Markets derivative products carries significant risks and is not suitable for all investors. You do not own, or have any interest in, the underlying assets. We recommend that you seek independent advice and ensure you fully understand the risks involved before trading. Spreads may widen dependent on liquidity and market volatility. The information on this website is prepared without considering your objectives, financial situation or needs. Consequently, you should consider the information in light of your objectives, financial situation and needs. CMC Markets Asia Pacific Pty Ltd ABN 11 100 058 213, AFSL No. 238054 (the derivative product issuer), CMC Markets Stockbroking Limited, Participant of the ASX Group (Australian Securities Exchange) and SSX (Sydney Stock Exchange) and Cboe (previously known as Chi-X), ABN 69 081 002 851, AFSL No. 246381 (the stockbroking services provider) provides the financial products and/or services. It's important for you to consider the relevant Product Disclosure Statement ('PDS') or Information Memorandum (for CMC Pro accounts) and any other relevant CMC Markets Documents before you decide whether or not to acquire any of the financial products. Please also refer to our Financial Services Guide and Information Memorandum (for CMC Pro accounts) containing details of our fees and charges and our Target Market Determinations for our CFD products and Exchange Traded Options which include a description of who our financial products are suitable for. All of these documents are available at cmcmarkets.com.au or you can call us on 1300 303 888. Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. Android is a trademark of Google Inc. © 2024 CMC Markets Welcome to CMC Markets Support! To begin, please select the product your query is related to. "
}