{
    "title": "Better Artificial Intelligence (AI) Stock: AMD vs. Palantir Technologies",
    "date": "2/15/2024",
    "url": "https://www.fool.com/investing/2024/02/15/best-artificial-intelligence-ai-stock-amd-palantir/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Artificial intelligence (AI) has turned out to be a hot growth driver for many companies over the past 15 months or so. That is not surprising, considering that the technology has the potential to impact multiple industries and raise the global gross domestic product (GDP) by a whopping $7 trillion over the next decade, according to Goldman Sachs. Also not surprisingly, investors are looking for companies that can win big from this massive opportunity. Advanced Micro Devices (AMD 0.50%) and Palantir Technologies (PLTR -6.12%) are two such companies that have risen rapidly in the past year thanks to the AI hype. Both tech stocks have delivered eye-popping gains and are trading at premium valuations, even though their growth rates haven't been good enough to support the surge in their share prices. Investors are betting on the fact that AI will supercharge their growth. If you have to choose from one of these two potential AI winners, which one should you be buying right now? Let's take a closer look. There is no doubt that AMD is sitting on a huge addressable opportunity thanks to AI. The chipmaker estimates that the market for AI chips deployed in data centers could jump to a whopping $400 billion in 2027, up from $45 billion last year. The good part is that AMD's latest results indicate that it is on track to take advantage of this tremendous growth opportunity. In its latest report, AMD management said it expects AMD will generate at least $3.5 billion in revenue in 2024 from sales of its newly launched Instinct MI300 series of AI processors, which hit the market in December 2023. In a prior earnings update, management had said it was expecting AI chip revenue to total $2 billion. The big jump in AMD's AI revenue guidance tells us that its AI chips are indeed gaining traction among customers. The company has increased its production capacity of AI chips with the help of its supply chain partners, hoping to capitalize on additional demand from customers. Meanwhile, AMD management believes that the adoption of AI-powered personal computers (PCs) could turn out to be another catalyst for the company. On the latest earnings conference call, CEO Lisa Su said: Millions of AI PCs powered by Ryzen processors have shipped to date, and Ryzen CPUs power more than 90% of AI-enabled PCs currently in [the] market. Our work with Microsoft and our PC ecosystem partners to enable the next generation of AI PCs expanded significantly in the quarter. AMD is looking to push the envelope further in this market and points out that next-generation PC processors \"are expected to deliver more than three times the AI performance\" as compared to its Ryzen 7040 series processors. Given that the demand for AI PCs is expected to increase at an annual rate of 50% through 2030, according to Counterpoint Research, AMD is doing the right thing by pulling the strings in this market. In all, increasing demand for AI chips and PCs will be two solid catalysts for AMD going forward, which explains why analysts expect AMD's earnings to increase at a nice pace in 2024 and beyond.  AMD EPS Estimates for Next Fiscal Year data by YCharts More specifically, AMD's earnings could increase 38% this year from last year's reading of $2.65 per share, according to the chart. Also, the annual earnings growth forecast of 25% for the next five years seems solid, indicating that growing demand for AI hardware is likely to positively impact this chipmaker's business. While AMD can help investors benefit from the growing demand for AI hardware, they should expect Palantir will capitalize on a potential jump in AI software demand. That's because Palantir was ranked as the top supplier of AI software platforms in 2021, according to IDC, and the company's latest results indicate that its solid position in this market will drive robust growth. Palantir released fourth-quarter 2023 results on Feb. 5, and the company saw a sharp jump in the count of commercial customers thanks to the growing demand for its Artificial Intelligence Platform (AIP). On its latest earnings conference call, Palantir management remarked: Our momentum in AIP is driving both new customer conversions and existing customer expansions. The transformation that AIP is having on our business is best highlighted in our U.S. commercial bookings and backlog. More specifically, Palantir witnessed a 55% year-over-year increase in the number of commercial customers in the U.S. This translated into a 70% year-over-year increase in U.S. commercial customer revenue last quarter to $131 million. Meanwhile, overall commercial revenue (including international markets) increased 32% year over year to $284 million, driven by a 44% year-over-year jump in customer count. Apart from the improving customer count, Palantir points out that it is witnessing shorter sales cycles, accelerated new customer acquisition, and higher spending by existing customers thanks to AI. This is evident from the fact that Palantir closed 103 deals worth $1 million or more in the fourth quarter of 2023, which was double the prior-year period. So as Palantir's commercial business gains momentum thanks to the growing adoption of its AIP, which is already being used by more than 300 customers within just a year of its launch, its pace of growth should improve as well. This is exactly what analysts are forecasting following a 17% increase in the company's revenue in 2023 to $2.23 billion.  PLTR Revenue Estimates for Current Fiscal Year data by YCharts What's more, analysts expect Palantir to clock annual earnings growth of 85% over the next five years, suggesting that AI could indeed supercharge its growth in the future. As pointed out earlier, both AMD and Palantir trade at premium valuations. While AMD commands a price-to-sales ratio of 12, Palantir is even more expensive at 25 times sales. The forward sales multiples of both companies point toward healthy top-line growth.  AMD PS Ratio (Forward 1y) data by YCharts The chart indicates that Palantir remains the more expensive of the two stocks. But we have already seen that Palantir is expected to grow at a much faster pace than AMD. That won't be surprising, as Palantir is reportedly the leader in the fast-growing AI software market. AMD, on the other hand, has to compete with Nvidia in the AI chip market. The good part is that AMD could eventually carve out a nice share of the AI chip market for itself and deliver solid growth, which is why investors looking for a cheaper AI stock could consider buying it. However, those with a higher risk appetite might want to consider buying Palantir, as the software giant could very well justify its valuation by delivering stronger-than-expected growth. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Goldman Sachs Group, Microsoft, Nvidia, and Palantir Technologies. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}