{
    "title": "Alan Wake 2 PC Performance Benchmarks: Massive FPS Gains Since Launch",
    "date": "2/24/2024",
    "url": "https://www.hardwaretimes.com/alan-wake-2-pc-performance-optimization/",
    "text": "We tested Alan Wake 2 back when it came out last year. Like Remedy’s past games, it pushes the boundaries of 3D rendering, mainly in the lighting department. It features ray tracing, path tracing, mesh shaders, and more. The game runs fairly well with rasterization, but ray tracing can be taxing, while path tracing mandates upscaling/frame generation for playable frame rates. Luckily, Alan Wake 2 launched with DLSS 2, DLSS 3 “Frame Generation,” DLSS 3.5 “Ray Reconstruction,” and FSR 2 for Radeon users. Table of Contents The performance on both NVIDIA and AMD graphics cards has improved substantially since launch. We’re talking about gains of up to 30% on the GeForce side, and close to 40% on the Radeon end. Most of these are from driver updates, with game updates also contributing a fair bit. Regardless, the ray tracing performance of AMD GPUs remains poor with severe frametime issues at higher resolutions. We tested Alan Wake 2 at 1080p, 1440p, and 4K. For a purely rasterized workload, the general graphics preset was set to “High” and the ray tracing preset to “Off.” For single-bounce ray tracing tests, the ray tracing preset was set to “Low.” Finally, the general and ray tracing presets were set to “High” for the path tracing benchmarks. At 1080p “Ultra” without ray tracing, our fastest GPUs managed an average of up to 150 FPS. The GeForce RTX 4090 tops the chart with 153.6 FPS, followed by the Radeon RX 7900 XTX and the RTX 4080 Super with 135.2 FPS and 125.4 FPS, respectively. The RX 7900 XT matches the RTX 4080 Super, narrowly beating the now-retired RTX 4080. The Radeon RX 7800 XT (96.4 FPS) outmaneuvers the RTX 4070 (78.8 FPS) and the more expensive 4070 Super (92.9 FPS). 1440p is more taxing, but the RTX 4090 continues to average over 100 FPS. The Radeon RX 7900 XTX drops to 91.5 FPS and the RTX 4080 Super to 86.2 FPS. The RX 7900 XT falls behind the 4080, averaging 83.5 FPS. The RX 7800 XT (63.3 FPS) maintains a slim lead over the RTX 4070 (53.1 FPS) and the 4070 Super.  The Radeon GPUs suffer from severe, intermitted stuttering even though their averages are higher than rival GeForce cards. These frametime spikes are more prominent at higher resolutions, and less severe on the higher-end Radeons. 4K is more tolerable, thanks to graphics driver updates on both sides. The GeForce RTX 4090 scores an average of 59.2 FPS, followed by the RX 7900 XTX with 48.2 FPS. The RTX 4080 Super registers 46.3 FPS, while the RX 7900 XT continues to trail the 4080. The Radeon RX 7800 XT nets 33.8 FPS, still ahead of the RTX 4070 (28.1 FPS) and the 4070 Super. Unfortunately, the lows are significantly worse off on the Radeon GPUs, nullifying their otherwise remarkable performance. Alan Wake 2 uses direct lighting and reflections at the Ray Tracing “Low” quality preset. Indirect or diffuse lighting based on path tracing is disabled. Screen space reflections and rasterized global illumination remain enabled. Players with NVIDIA RTX GPUs can enable Ray Reconstruction, which uses an AI-based denoiser to improve lighting quality and performance. At 1080p (ray tracing), the GeForce RTX 4090 is the only GPU that breaks the 100 FPS barrier. The RTX 4080 Super comes in second with an average of 82 FPS. The Radeons perform poorly, as the RX 7900 XTX (47.5 FPS) falls bends to the RTX 4070 (49.3 FPS) and the 7800 XT (34.1 FPS) finishes last. Interestingly, the AMD cards don’t suffer from the previously seen low frametimes. That behavior appears to be resolution-related. At 1440p (ray tracing), the GeForce RTX 4090 is the only GPU to average over 60 FPS. The RTX 4080 Super yields 55 FPS, followed by the RTX 4080 and 4070 Ti Super. The RTX 4070 reports 32 FPS, slightly ahead of the RX 7900 XTX (31.5 FPS) and 7900 XT (30.2 FPS). Unfortunately, the frametime spikes are back on the Radeons, leading to even worse stutters. Path tracing benchmarks on the next page… "
}