{
    "title": "This Chinese version of a popular AMD graphics card is now on sale \nworldwide - and it's actually worth buying",
    "date": "2/27/2024",
    "url": "https://www.techradar.com/computing/gpu/this-chinese-version-of-a-popular-amd-graphics-card-is-now-on-sale-worldwide-and-its-actually-worth-buying",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The AMD Radeon RX 7900 GRE is a great GPU option Reviews are finally coming in for the AMD Radeon RX 7900 GRE, a Chinese version of a popular AMD graphics card, and it seems that it’s actually a great card. The RX 7900 GRE is made to reside in between the Radeon 7800 XT and the Radeon 7900 XT as the third model of AMD's largest Navi 31 GPU using the RDNA 3 architecture, according to the Tom’s Hardware review. It’s a far improvement from the 7800 XT, as it has 60 compute units (CUs) while the 7900 GRE has 80 CUs, which is a 33% increase. Its starting price is $549, which puts it right in the midrange market next to Nvidia’s RTX 4070 Super and the baseline Nvidia RTX 4070. A smart idea, considering that AMD could easily compete with Nvidia and gain a place among the best graphics cards. And from what we see of its specs and performance, it matches well or even exceeds similar cards in the market that are priced around the same or higher. Originally the RX 7900 GRE was launched in China only, but since then has had a slow release throughout the rest of the world. As of February 26, 2024, it has officially been made available in the US for a retail price of $549. Originally, it was slated for a Chinese-only release, but AMD decided to bring the graphics card to the global market due to the “changing competitive landscape of the GPU market.” It’s objectively a good call for AMD to bring the Radeon RX 7900 GRE to a global market, especially considering the lack of affordable mid-range graphics cards this generation. But why did AMD wait so long to release it outside China in the first place? Back when the RX 7900 GRE first launched, there were plenty of other mid-range choices like the RX 6950 XT, 6900 XT, and 6800 XT. But as dwindling inventory left open space on retail shelves, the opportunity opened for the 7900 GRE to replace them, especially as it fits right in between the 7800 XT and the 7900 XT. Considering how excellent those two cards are, scoring four and a half out of five stars and four out of five stars, respectively, making this card a comparable performer is quite the achievement. Regardless of the wait, it’s great to see that we can benefit from having yet another excellent mid-range option. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. Named by the CTA as a CES 2023 Media Trailblazer, Allisa is a Computing Staff Writer who covers breaking news and rumors in the computing industry, as well as reviews, hands-on previews, featured articles, and the latest deals and trends. In her spare time you can find her chatting it up on her two podcasts, Megaten Marathon and Combo Chain, as well as playing any JRPGs she can get her hands on. Samsung officially reveals GDDR7 memory for GPUs, which is great news for gamers Fresh leak is the first we’ve heard about Intel Battlemage in some time – complete with a suggestion that 2nd-gen GPUs will be worryingly late Intel Battlemage leak gives us hope that maybe there’ll be a more powerful 2nd-gen Arc GPU after all By Wayne WilliamsMarch 28, 2024 By Craig HaleMarch 28, 2024 By James IdeMarch 28, 2024 By Rhys WoodMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By Marc McLarenMarch 28, 2024 By Alex BlakeMarch 28, 2024 By Rhys WoodMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By James IdeMarch 28, 2024 By Mackenzie FrazierMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}