{
    "title": "AMD Ryzen 7 8845HS, 32 GB RAM, 1 TB SSD And Very Light Augmented Reality \nGlasses Included - For $350. Gimok ...",
    "date": "2/6/2024",
    "url": "https://gadgettendency.com/amd-ryzen-7-8845hs-32-gb-ram-1-tb-ssd-and-very-light-augmented-reality-glasses-included-for-350-gimok-k8-mini-pc-introduced/",
    "text": "Published on By The new Gimok K8 mini PC has been unveiled and is now available for pre-order in China starting at $350. The Gimok K8 mini PC has a silver-gray body and is equipped with an 8-core 16-thread AMD Ryzen 7 8845HS processor with Zen 4 architecture using a 4nm process technology, with a frequency of up to 5.1 GHz and a power consumption of up to 65 W.\nThe package includes augmented reality glasses that weigh 69 grams and can be connected to a computer, smartphone, drone, game console and other devices via USB-C.\nThe device received 32 GB of DDR5 5600 RAM (there are two slots) and 1 TB SSD.  Resolutions up to 4096 x 2160 pixels are supported.  The device is equipped with Wi-Fi 6 (RZ616 WIFI6E 160 MHz) and Bluetooth 5.2, as well as a full range of modern ports.\nDimensions are 128.8 x 127 x 51.8 mm and weighs 525 grams. The Gimok K8 mini PC has a silver-gray body and is equipped with an 8-core 16-thread AMD Ryzen 7 8845HS processor with Zen 4 architecture using a 4nm process technology, with a frequency of up to 5.1 GHz and a power consumption of up to 65 W. The package includes augmented reality glasses that weigh 69 grams and can be connected to a computer, smartphone, drone, game console and other devices via USB-C. The device received 32 GB of DDR5 5600 RAM (there are two slots) and 1 TB SSD.  Resolutions up to 4096 x 2160 pixels are supported.  The device is equipped with Wi-Fi 6 (RZ616 WIFI6E 160 MHz) and Bluetooth 5.2, as well as a full range of modern ports. Dimensions are 128.8 x 127 x 51.8 mm and weighs 525 grams. Dimensions are 128.8 x 127 x 51.8 mm and weighs 525 grams. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  Published on By AMD has solved the problem with overclocking the memory of the Radeon RX 7900 GRE video card, and recent tests have shown that the adapter now looks much more attractive.  Of course, for those who want to resort to overclocking.  The authors of Hardware Unboxed took the Sapphire adapter and overclocked it to 2.7 GHz for the core and 21.2 GHz for the memory.  As you can see, the performance increase turned out to be quite good.  At 1440p, the overclocked card became 12% faster relative to the reference one, and at 4K the increase was almost 17%, which is very good by modern standards. As a result, after overclocking, the RX 7900 GRE competes with the RTX 4070 Ti at 1440p, and reaches the RTX 4070 Ti Super at 4K.  At the same time, the RX 7900 GRE in Europe costs from 570 euros, the RTX 4070 Ti – from 700 euros, and the RTX 4070 Ti Super – from 840 euros.  Of course, Nvidia cards can also be overclocked, but the price difference will still remain. Published on By Not only new Intel video cards, but also a new processor appeared in the SiSoftware Sandra database today.  The Lunar Lake model included in the Samsung Galaxy Book5 Pro is registered in the software database, revealing some of its parameters.  The unnamed CPU contains only eight cores (four large and four small), but for Lunar Lake this is the maximum.  The presence of only eight threads confirms leaks that future Intel CPUs do not support Hyper-Threading. The processor operated at frequencies of 1.6-2.8 GHz.  These are clearly far from the final frequencies, but Lunar Lake is created with an eye to maximum energy efficiency, so perhaps they will not have very high frequencies.  The CPU also has 12 MB of L3 cache and a Xe2-LPG (Battlemage) generation GPU with 4 Xe cores and a frequency of 1.85 GHz. According to the latest roadmap, Lunar Lake is expected at the end of this year. Published on By Intel Meteor Lake processors only exist in mobile versions.  Or not?  The IBASE MI1002 industrial motherboard indicates that Intel is either planning or has already released Core Ultra as a desktop CPU.  The board with the LGA 1851 socket is designed for Meteor Lake-PS, which Intel has not officially presented.  There were rumors and leaks about such desktop CPUs, but then it became known that Intel abandoned the idea.  True, there was also evidence that such processors would still be released, but not in retail, but would be available to mini-PC manufacturers.  Whether such mini-PCs will appear in retail is still anyone’s guess, but in the industrial sector, as we see, yes. As for the parameters of such CPUs, they are not yet available.  Most likely, these are just mobile models in a different socket – Intel has already done this. Microsoft has made a major update to the Windows 11 operating system, also known as Moment 5, available to all... Space meteorologists have issued a forecast for this week warning of a possible geomagnetic storm caused by the release of... BYD is going to beat Toyota and Volkswagen by offering modern cars at very low prices. According to Bloomberg, the... Samsung promised to release the latest One UI 6.1 firmware for Galaxy S23 series smartphones at the end of March,... Toyota Corolla lost the title of best-selling car in the world for the first time in 20 years.  Tesla Model Y is the new king Scientists have created a quantum tornado in superfluid helium: a new step towards understanding the physics of black hole accretion Just four big cores, no Hyper-Threading, and this is Intel’s new flagship.  The top processor of the Lunar Lake generation appeared on the Internet Mitsubishi Fuso turned into an unusual motorhome © 2024 Gadget Tendency. All Rights Reserved "
}