{
    "title": "AMD has a lot to prove this year",
    "date": "2/4/2024",
    "url": "https://www.digitaltrends.com/computing/amd-has-a-lot-to-prove/",
    "text": "AMD has clawed its way up from many disasters. Always chasing Nvidia and Intel, the so-called Team Red stayed strong over the years and found its niche in the PC market, a niche that has seemingly worked well, especially over the past few years. Despite these valiant efforts, this past year has made me worry about the future of AMD, and the beginning of the year so far has only confirmed some of my worries. In the past year and some, AMD has had some wins, but it also stumbled a few times. AMD’s Ryzen 7000 has been a smashing success, with quite a few of the chips becoming the best processors of the year. The Ryzen 7 7800X3D is the fastest gaming CPU in the world, and AMD’s success in that department brought it closer to being the go-to than ever before. It helps that Intel didn’t put up much of a fight, and the longevity of each respective platform plays a part. AMD’s AM5 will last for years; Intel’s LGA1700 is on its last legs. That’s desktops, though. But what about laptops? Sure, the Ryzen 7000 for laptops is a robust lineup with a lot of interesting chips, including 3D V-Cache processors made for gamers. However, if you search for a gaming laptop at any popular retailer, you’ll find that the vast majority of these models feature Intel and not AMD. The few that do sport an AMD chip are gaming laptops, and that’s despite the fact that AMD also launched CPUs for productivity and day-to-day use. It’s hard to say exactly why AMD’s presence in laptops is so small. The CPUs themselves are solid; we’ve tested them ourselves in laptops like the Asus ROG Strix Scar 17, and while it wasn’t the ideal laptop for this kind of chip, the processor itself was impressive. But for whatever reasons, AMD has faced an uphill battle for years against Intel, and it seems as if the ground made up by AMD in recent years has even started to recede a bit. Some laptops are still holding down the fort, such as the new ROG Zephyrus G14 and Razer Blade 14, but we haven’t seen many new designs switch to AMD. In fact, even popular budget laptops like the Asus Zenbook 14 OLED have switched from AMD to Intel starting this year. AMD followed up by releasing the Ryzen 8040 series mobile processors, which sound like a next-gen product, but they’re still the same Zen 4 chips with minor tweaks and an improved neural processing engine (NPU). You wouldn’t know that without looking under the hood, though. The name implies otherwise. AMD’s confusing naming scheme is one of the major things its marketing department should have thought twice about. Not only are the Ryzen 8000 CPUs misleading, but the Ryzen 7000 laptop chips are too. Under the Ryzen 7000 umbrella, AMD is selling Zen 4, Zen 3+, Zen 3, and even Zen 2 chips.  And no, AMD, no amount of stickers will make up for this. As far as CPUs go, 2022 and 2023 were a confusing period for AMD. We’ve had some huge wins in the form of excellent gaming CPUs but very little movement on the laptop front. On the other hand, AMD’s graphics card lineup is far from confusing, but it’s fairly small — and even there, the future feels uncertain. The dawn of RDNA 3 brought us some top-notch graphics cards. No complaints there. However, I still expected more out of this generation, and I can’t help but wonder about the reasoning behind AMD’s relatively small GPU presence in this past year. AMD has only released six RDNA 3 GPUs so far. Four of the six launched in packs of two: the RX 7900 XTX with the RX 7900 XT, and then the RX 7800 XT with the RX 7700 XT. Inevitably, the less performant model ended up overlooked, offering pretty poor performance-per-dollar compared to its better counterpart. Truthfully, AMD could’ve released only two cards — the RX 7900 XTX and the RX 7800 XT — and we’d almost be no worse off. The RX 7600 and the RX 7600 XT arrived at two different times, but again, if the RX 7600 XT was never made, most of us wouldn’t have minded. It’s because, without beating around the bush, the RX 7600 XT proved to be a severe disappointment. With a shockingly narrow 128-bit bus and 16GB VRAM, it’s practically the same as its 8GB counterpart. Although it’s pricier than its non-XT counterpart, it doesn’t bring enough to the table to justify the price hike. AMD repeated Nvidia’s mistakes with this release, and that’s something it usually tends to avoid. Out of the four GPUs that launched in 2024 so far, AMD’s RX 7600 XT shares the spot for “least worth the money” with the RTX 4070 Ti Super — and that’s nothing to be proud of. As it turns out, even the new APUs that use RDNA 3 weren’t as impressive as we’d hoped they would be. AMD also sustained another heavy blow from Nvidia in this generation of GPUs. I’m talking about DLSS 3, meaning Nvidia’s frame generation tech that can substantially boost frame rates in games. It’s an impactful technology, so much so that it’s helped Nvidia sell graphics cards like the RTX 4060 Ti, which, truth be told, aren’t really worth the price. AMD’s answer to DLSS 3 is FSR 3.0, but sadly, it’s nowhere near as good. Not only did it take ages to arrive, but its adoption is also moving at a snail’s pace. Maybe in a year, or two, or three, it’ll be more useful, but now, with a mere four titles that support it, FSR 3.0 is a shadow of what it could be. This brings us to where we are now. I know that AMD’s released some excellent GPUs; I might go as far as to say that the RX 7800 XT offers unparalleled performance per dollar and should be found in way more PC builds. Regardless, the future of AMD’s GPU lineup has never seemed more uncertain. Several months have passed since we first heard that AMD may be opting out of the high-end GPU race in RDNA 4. At the time, I said it was a good thing, and I stand by that opinion. This generation has proven that AMD can’t compete against the likes of Nvidia’s RTX 4090, so it might as well stick to the mainstream market where it’s needed the most. That’s exactly what AMD is said to be doing in RDNA 4. The consensus is that the flagship may rival the RX 7900 XT in performance but be at around $500 in price. That’d certainly put some heat on Nvidia. It’s just that the RX 7600 XT is making me doubt whether AMD will really go down that path. With that one release, AMD threw away its previous “value first” approach, and it’s hard to tell where it’ll be headed now. I’m worried that we’ll end up with that RX 7900 XT equivalent at a higher price, and that’s something that Nvidia is likely to be able to match or even surpass. Still, even if RDNA 4 doesn’t turn out to be as amazing as we’d like, we all used to think 2024 would be AMD’s for the taking. After all, with Nvidia’s RTX 50-series graphics cards reportedly slated for a 2025 release, AMD has the opportunity to strike first and launch its next generation of GPUs well ahead of Nvidia. With limited competition, AMD wouldn’t need to do well; it just needs to be in the right place at the right time. Unfortunately, that might not be the case. If the rumors turn out to be true and Nvidia pushes its next-gen Blackwell GPUs out early, AMD will be overshadowed by cards like the RTX 5090 and the RTX 5080. But even if that doesn’t turn out to be true, AMD has a lot to prove with RDNA 4. And strangely, AMD has been rather quiet about its next generation of GPUs. RDNA 4 is supposed to be coming out in the second half of 2024, but AMD didn’t say a word about it at CES 2024. Sure, there’s still plenty of time, and it’ll likely host a special launch event when it’s ready, but it would have been nice for that hype to start building up. Right now, things are pretty quiet. I won’t go as far as to say that RDNA 4 will be a disappointment — we haven’t heard nearly enough information to make such judgment calls. However, I will say that I hoped for more out of RDNA 3. With RDNA 4, I’m keeping my expectations safe and low, and with good reason. Although things may sound pretty grim for AMD, there’s still plenty of good stuff to praise it for, which gives me a lot of hope. While less interesting to many consumers, AMD is also betting heavily on AI. Surprised? Me neither. In a recent interview with CNBC, Victor Peng, president of AMD, said that the AI PC market will expand, and the company is on track to keep up with the growing demand. To that end, it has recently launched new Instinct MI300X chips, which are graphics processors made to train large language models (LLMs). AMD’s presence in the data center and server landscape is already significant, but Nvidia leads in AI. This is a new opportunity for AMD, and while I’d personally prefer to see it expand in the consumer market, it makes perfect sense that it’s targeting the things that can make it more money right now. AMD is also doing great in the emerging gaming handheld market, with the Z1 Extreme chip now powering up some of the fastest portable PCs, like the Asus ROG Ally. Intel is trying to break into that segment, too, but this is one place where AMD is currently the undisputed leader of the pack. It’ll be interesting to watch that race unfold. In 2024, AMD is set to launch its next-gen Ryzen processors and, most likely, RDNA 4 graphics cards. There’ll be plenty of chances to right the wrongs and improve the rights. This year could be the year of AMD if it plays its cards right. While I no longer have the same unwavering confidence that it will, I’m all the more excited to see it compete against Intel and Nvidia. I just hope that the battle will be equally fierce on all three sides. AMD's current-gen graphics cards have been a revelation. Last generation, AMD was able to hit performance parity with Nvidia while sacrificing ray tracing performance. This generation, AMD is maintaining parity while getting closer in ray tracing, as showcased by GPUs like the RX 7900 GRE. But the next frontier of gaming is rapidly approaching, and AMD's current options aren't up to the task right now. I'm talking about path tracing. Nvidia calls it \"full ray tracing,\" and it's a lighting technique that can take gaming visuals to the next level. Path tracing is only available in a small list of titles right now, but with frame generation and upscaling tools better than they've ever been, it won't be long before we see these destination gaming experiences everywhere.\nPlayer two in path tracing It's safe to say that 2023 turned out to be a good year for the discrete graphics cards market. According to the latest data, both AMD and Nvidia saw an increase in add-in board (AIB) GPU shipments in the final quarter of 2023, and the year-to-year gains are also massive. While Nvidia still dominates the market, AMD's share is climbing steadily, and Intel remains in the shadows. Today's round of market insights comes from Jon Peddie Research (JPR), and it's all about discrete GPUs. According to the analyst firm, discrete GPU shipments increased by 6.8% over the fourth quarter of 2023 compared to the previous quarter. This is above the less-than-impressive 10-year average of -0.6%. The year-to-year gains are even more impressive, though, as JPR notes a 32% increase compared to the final quarter of 2022, with a total of 9.5 million GPUs shipped (as opposed to 8.9 million units at the end of 2022). AMD's FidelityFX Super Resolution 3 (FSR 3) has had an uphill climb so far, but things might get better in 2024. According to a statement from the company's chief technology officer, this year will be a big one for AMD in terms of AI -- and this doesn't just mean large-scale AI, but also upscaling. Are we going to see some major changes in AMD's next-gen RDNA 4 graphics cards? The tantalizing bit of information comes from Mark Papermaster, AMD CTO, who was a guest on the No Priors Podcast. At the very end of the interview, Papermaster gave a few hints as to what's on AMD's agenda for 2024. It's all about AI, and no surprise -- Nvidia has adopted the same approach. Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}