{
    "title": null,
    "date": "2/11/2024",
    "url": "https://www.pcgamer.com/delidding-a-ryzen-7-8700g-apu-allows-it-to-run-up-to-25-degrees-cooler/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The stock TIM is crap. It's been a week since the official launch of AMD's Ryzen 8000 series of APUs, and overclockers have had a week to tinker with the chips. It turns out the Ryzen 7 8700G has some decent overclocking headroom, particularly if you delid it, which will lower temperatures and allow it to be overclocked to Ryzen 7 7700X performance levels—or beyond. The test was run by Der8auer. He began by explaining why the Ryzen 8000-series chips don't feature soldered thermal interface material (TIM), saying it's because they are more closely related to mobile parts rather than higher TDP desktop parts. That makes sense given their 65W TDP. I'd add that it allows AMD to save a few cents. Given that a stock 8700G will run in the 80 to 90 degree range depending on your cooling capabilities, there's little need for soldered heat spreaders under default operating conditions. He then ran the same test with PBO enabled, followed by a test with a manual 5.0GHz overclock. This reveals the limitations of the stock TIM, with temperatures reaching into the 90s with some thermal throttling. Next, Der8auer repeats the tests but with a Thermal Grizzly Kryosheet and liquid metal TIMs. This resulted in temperature drops of between 10 to 25 degrees. The final overclock saw a result of just over 20,000 in Cinebench R23's multi thread test thanks to a 5.3GHz overclock at 1.37v. Temperatures stayed under 80 degrees. It's really impressive to see an overclocked and overvolted 8700G resulting in temperatures that are still below that of the chip running at default settings with its stock TIM.  Best CPU for gaming: The top chips from Intel and AMD.\nBest gaming motherboard: The right boards.\nBest graphics card: Your perfect pixel-pusher awaits.\nBest SSD for gaming: Get into the game ahead of the rest. If nothing else, these tests show the stock TIM is pretty much rubbish. Of course, AMD will say that the chips run perfectly well within their designed temperature tolerances. That's perfectly acceptable, but I like the idea of a chip running up to about 70 degrees rather than at 90+. It means a quieter system that doesn't result in fans ramping up and down, which is something everyone can appreciate. Of course, all of this is largely academic, since buyers of APUs are less likely to be interested in CPU overclocking than they are about the integrated graphics capabilities of the chip. Still, by lowering temperatures, it will allow users to get by with less capable cooling, which will benefit chips that go into small form factor systems with low profile coolers. Sign up to get the best content of the week, and great gaming deals, as picked by the editors. Personally, I have only bothered with delidding when shooting for maximum overclocks, but these kinds of tests really do show just how much cooler a delidded chip can run. I'll give it some serious thought for my next build, whatever form that will take. Chris' gaming experiences go back to the mid-nineties when he conned his parents into buying an 'educational PC' that was conveniently overpowered to play Doom and Tie Fighter. He developed a love of extreme overclocking that destroyed his savings despite the cheaper hardware on offer via his job at a PC store. To afford more LN2 he began moonlighting as a reviewer for VR-Zone before jumping the fence to work for MSI Australia. Since then, he's gone back to journalism, enthusiastically reviewing the latest and greatest components for PC & Tech Authority, PC Powerplay and currently Australian Personal Computer magazine and PC Gamer. Chris still puts far too many hours into Borderlands 3, always striving to become a more efficient killer. Intel's future multi billion dollar mega-fab is set smack-bang on top of multiple neolithic burial sites Elon Musk claims Tesla could build a silicon foundry and make its own chips, but says 'I sure hope we don’t have to' I never liked bullet hell shooters, until Xenotilt put one inside my new favourite pinball table By Rick Lane29 March 2024 By Jeremy Laird29 March 2024 By Kerry Brunskill29 March 2024 By Tyler Colp28 March 2024 By Andy Chalk28 March 2024 By Tyler Colp28 March 2024 By Morgan Park28 March 2024 By Andy Chalk28 March 2024 By Rich Stanton28 March 2024 By Joshua Wolens28 March 2024 By Dave James28 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}