{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.insightnews.com.au/aussie-biotech-filamon-commercialising-unsw-eye-drop-for-amd/",
    "text": "Being a small molecule, BT2 may be an ideal candidate for an eye dropper formulation. Image: Svitlana/stock.adobe.com A UNSW-developed molecule that could be administered via an eye drop for neovascular age-related macular degeneration (nAMD) is being commercialised by clinical-stage Australian biotechnology company Filamon Limited which hopes to have the therapy in clinical use within three years.  On Monday 12 February, the company announced it received $2.4 million from the Federal Government as part of the Department of Industry Cooperative Research Centres Projects (CRC-P) Grant scheme to fast-track development of the potentially self-administered drug. A year ago, Filamon joined forces with UNSW where the prospective treatment – based on the molecule BT2 – has been developed during the past eight years with the aim of overcoming several hurdles with the current standard of care, intravitreal anti-VEGF injections. Filamon CEO and chairman Dr Graham Kelly told Insight the team of UNSW scientists had been looking at whether it was possible to target more of the dozens of different genes involved in nAMD, rather than VEGF alone. The aim has been a more potent drug than aflibercept (Eylea) that works in more patients and stops, rather than slows, the disease process. BT2 is reported to have already shown superiority to current treatments in animal models of nAMD. “Working with WEHI (Walter and Eliza Hall Institute of Medical Research) in Melbourne, the UNSW team came up with BT2 which switches off about 12 different genes involved in the wet AMD disease process, including the all-important one – VCAM1. We think it is having this multiple effect via gene transcription factors,” he said. Kelly said Filamon became involved with the project 12 months ago when the IP was offered due to the company’s interest in creating drugs based on gene transcription. This is considered a novel approach offering the potential of both greater potency and safety compared to direct inhibition of activity of single gene products such as VEGF. The drug is part of a broader Filamon pipeline also focusing on cancer and addictive brain behaviour. A feature of the drug development program, according to the company, is molecules singling out drug targets previously considered to be “undruggable because of major safety concerns”, leading the pharmaceutical industry to focus on peripheral targets that are safer to inhibit but potentially less effective. Filamon says its drug candidates are designed to safely drug those targets previously considered off-limits. For BT2, Filamon and UNSW have also partnered with Australian drug designer MedChemSoft Solutions, and Macular Disease Foundation Australia. “The most exciting aspect of BT2 is its potential as a small molecule to be developed as a topical (eye dropper) dosage form,” Kelly said. “The aim is to be in the clinic with an eye dropper dosage form within three years.” If successful, this is thought to be a major advantage by overcoming the treatment burden associated with regular intravitreal injections of anti-VEGF. This approach has been associated with side-effects, pain and discomfort that – together with the inconvenience of monthly rest-of-life clinic visits – leads to about 40% of patients withdrawing from treatment after the first year. It’s also hoped BT2 could also offer greater cost-effectiveness and affordable treatment, with manufacturing costs said to be “a fraction of that of the current large molecule drugs”. “Drugs to treat wet AMD currently cost the Australian Government ~$620 million per annum. However, the true cost to the nation of wet AMD is multiples of that when you take into account the cost of caring for people with vision impaired from this disease because current treatment fails them,” Kelly said. “The University of NSW has come up with an experimental drug that outperforms current treatments, at least in the laboratory, in a number of key areas. Our task now is to translate that advantage into stopping more people from becoming blind by offering a product that is easier to use and works better.” Macular Disease Foundation Australia CEO Dr Kathy Chapman said bringing the voice of the macular disease community into the development of new treatment ensures relevance, effectiveness, and improved outcomes. “A potential new treatment that could be self-administered as eye drops would be a life-changing alternative to the current eye injections that many people with wet AMD undergo to retain sight,” she said. More reading Australian-made device by muPharma uses ultrasound to non-invasively deliver eye therapies New anti-VEGF port delivery system implanted at Australia trial sites Anti-VEGF remains most expensive PBS drug Cataract surgery product manufacturer Rayner has introduced its latest packaging updated to reduce its carbon footprint, fulfil its environmental goals,... RANZCO’s Referral Pathway for Age-Related Macular Degeneration (AMD) Management has been updated as Australia gears up for the first approved... Independent ophthalmic lens supplier CR Labs has launched Australis Easy, a multifocal lens the company says represents a breakthrough in... Insight has been the leading industry publication in Australia for more than 40 years. This longevity is largely due to our ability to consistently deliver accurate and independent news relevant to all ophthalmic professionals and their supporting industry. © 2024 All Rights Reserved. All content published on this site is the property of Prime Creative Media. Unauthorised reproduction is prohibited © 2024 All Rights Reserved. All content published on this site is the property of Prime Creative Media. Unauthorised reproduction is prohibited "
}