{
    "title": "Asus ROG Flow X13 (2023) laptop review",
    "date": "3/2/2024",
    "url": "https://www.digitalcameraworld.com/reviews/asus-rog-flow-x13-2023-laptop-review",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. For outright performance, there are better laptops. But the Asus ROG Flow X13 2-in-1 offers remarkable versatility in a compact and beautifully built package. It's just a pity the battery life isn't better. Compact, beautifully built chassis Great specifications Lush 13.4-inch display 165Hz screen hits battery life Skinny chassis hurts GPU performance Why you can trust Digital Camera World \n\n\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out how we test. Specifications\nDesign & Handling\nPerformance\nVerdict\nAlternatives Asus has updated its everything, everywhere, all-in-one laptop with the latest chips from AMD and Nvidia. The Asus ROG Flow X13 2-in-1 now runs both AMD's awesome Phoenix APU and Nvidia's new RTX 40 Series graphics. Specifically, you get the eight-core AMD Ryzen 9 7940HS APU plus an RTX 4060 GPU. You can opt for an even more powerful RTX 4070 graphics chip, but there are reasons why you might not bother, more on which in a moment. You also have the option of an even more powerful GPU via the Asus XG Mobile external graphics box that hooks up courtesy of a dedicated I/O port. Again, that's not something we'd recommend for most users, it's just so horribly expensive. Whatever graphics you go for, it outputs to a 13.4-inch display with 2,560 by 1,600 pixels and 165Hz refresh. It's touch-enabled and sports a 360-degree hinge that supports numerous configurations from conventional laptop use through tablet modes and everything in between but does so without obviously looking like a 2-in-1 convertible. That's a good thing. It's just a very slick little laptop. Indeed, this is a beautifully built machine that feels extremely high quality. Factor in decent connectivity including dual USB-C ports, including USB4 support and you have an overall proposition that's ready to do just about anything including take on any of the more portable members of our round up of the the very best photo-editing laptops. If there is an immediately obvious downside to the refreshed Asus ROG Flow X13 it's that those skinny chassis proportions do limit performance. It's not that this is a slow laptop, more that there is a price to be paid compared to larger, heavier and less versatile laptops in pure performance terms.  Any Asus ROG laptop comes with fairly high expectations in terms of build quality and styling and the Asus ROG Flow X13 absolutely does not disappoint. The chassis is super rigid thanks to an all-metal design and features a tactile finish that feels great to the touch. The keyboard bed is also super stable with pretty much zero bounce or flex, which just adds to the impression of a high quality machine. The same goes for the 360-degree hinge. Asus has got its stiction levels just so when you manipulate the screen and the overall size and weight of the Flow X13, helped by nice slim screen bezels, make it moderately useful as a tablet, even if a dedicated tablet is always going to be more ergonomic.  Still, it's great to have the flexibility, plus touchscreen capability. It's all pretty impressive given the slim proportions, especially considering you can configure this laptop with up to an Nvidia RTX 4070 GPU. Of course, there are limitations with this kind of form factor. If you want to maximise connectivity, a larger chassis will always make that easier. Still, you get arguably just enough ports with the Asus ROG Flow X13 (2023). There's a main USB4-spec USB-C port which doubles as the charging socket, a full-sized HDMI socket, a single USB-A interface, microSD, and a headphone connector.   Where things get a little complicated is the Asus XG Mobile IO connector on the left side of the chassis. Through it, you can hook up a box containing a powerful external GPU. That box also adds HDMI, DisplayPort, three USB-A ports and a Type-C socket. What's more, if you pull the cover off the connector, you can access an USB-C port on the laptop itself. That's handy if you are using the main USB-C to charge the laptop, but it is a tiny bit fiddly to access compared to a conventional exposed port. A quick glance at the Flow X13's slim side profile would have you assume the performance on offer was as slim as the chassis. Nope! The AMD Ryzen 9 7940HS CPU and Nvidia RTX 4060 mobile GPU combo delivers proper performance. OK, this isn't an out-and-out desktop replacement machine. But for all-round content creation and even gaming, it's remarkably effective. The eight-core Ryzen 9 7940HS chip is seriously powerful and will tear through most image editing workflows. It's also well up to the job of video encoding on the move. You really could have this as your portable production device. In extremis, the 16GB of memory configured here arguably isn't quite enough for the most demanding jobs, perhaps if you're working with a large batch of RAW images or several very high bitrate video clips. In those scenarios, the upgrade to 32GB is worth considering. And you might want to upgrade the 1TB SSD if demanding video workflows are your norm. But the CPU itself delivers all the grunt you could ask for, even in a much larger and heavier device.   Of course, you also have that Nvidia RTX 4060 graphics. It's a fair way down the pecking order by Nvidia's standards. But it's still miles, miles more powerful than an integrated GPU, and can come in very handy when processing certain filters and effects. If you fancy some gaming on the side, well, it'll do a decent job of that, too. All that said, there is that aforementioned price to be paid for the portability. The RTX 4060 GPU is capped at 60W. That translates into a clock frequency of 1,470MHz, well below the maximum 2,370MHz the 4060 hits in some larger laptops. Indeed, even if you opt for the RTX 4070 GPU, it too is capped at 60W power consumption. It's therefore debatable if paying extra for the 4070 is worth it. The bottom line is that a bigger, heavier machine will offer superior graphics performance.   Whatever, the Flow X13's 13.4-inch, 2,560 by 1,600 pixel display is a beaut'. OK, it can't compete with an OLED panel for contrast and HDR performance. But it's a lush, vibrant and extremely sharp IPS item running at a buttery smooth 165Hz. It's pretty super. If that all sounds good, there is one fairly substantial disappointment, namely battery life. The Asus ROG Flow X13 (2023) can't quite manage seven hours, even doing something as undemanding as video playback with the screen at half brightness. Actually, lean on the CPU or GPU, or crank up the brightness, and you'll see hours fall off that figure. When you consider how long a MacBook Air will last, much less the latest MacBook Pros with Apple silicon, it's clear that choosing this Asus machine will mean a major compromise on battery life. There's a huge amount to love about the Asus ROG Flow X13. It's beautifully engineered, it's quick and has a fab little touchscreen. More than anything, it's just so darned versatile. It really is remarkable to find something so slim and slick is also so powerful and useful. With all that in mind, the limited battery life is a major bummer. With another two or three hours of mains-free operation, this really would be the everything, everywhere, all-in-one laptop that did everything from replacing your desktop and tablet to double as an in-the-field editing device. As it is, it remains hugely desirable and yet significantly compromised.  The MacBook Air may seem the obvious choice. But it's obvious for a reason. It's just so good. Granted, it lacks a little in graphics performance. But in all other regards, it's a very nippy little machine. It also offers a good screen, fabulous build quality and truly excellent battery life. Unless you really must have a Windows machine, it's hard to ignore. Updated with Apple's latest M3 Series silicon, the MacBook Pro 14 is arguably the content creation portable by which all others are measured. It's impossibly well-engineered, and offers huge performance, especially as you scale up through the M3 Pro and Max options, plus epic battery life. The main downside is the ripoff pricing of some upgrade options. Thank you for reading 5 articles this month* Join now for unlimited access Enjoy your first month for just £1 / $1 / €1 *Read 5 free articles per month without a subscription Join now for unlimited access Try first month for just £1 / $1 / €1 Jeremy has been typing furiously about technology since the later triassic but hasn't lost his enthusiasm for everything from flat panels to a forensic examinations of advanced lithography. For the avoidance of doubt, he also welcomes the inevitable arrival of our AI overlords even if they definitely will put him out of a job. Digital Camera World is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}