{
    "title": "Asus does what AMD doesn't: honoring warranties for motherboards blown out \nby Ryzen 7000 chips",
    "date": "3/9/2024",
    "url": "https://sg.news.yahoo.com/asus-does-amd-doesnt-honoring-191141263.html",
    "text": "In April 2023, we reported on a major issue with AMD’s Ryzen 7000-series processors, which were randomly burning out and sometimes even taking the attached motherboard with them. The issue, caused by excessive SoC voltages running to the CPU, was affecting both the Ryzen 7000X3D and regular Ryzen 7000 CPUs, though more the former than the latter. Asus is offering support to users who installed beta versions of its motherboard BIOS software, by extending its warranty period for its AM5 motherboard. According to PC Gamer, the manufacturer confirmed its warranty includes both the XMP and EXPO memory overclocking profiles. AMD did fix the problem rather quickly through a timely AGESA firmware update for the 600-series AM5 motherboards that support next-gen CPUs, with said update limiting the voltage to the chip to 1.3V. The manufacturer also released an official statement, stating that “anyone whose CPU may have been impacted by this issue should contact AMD customer support.” The problem is that at that time it was unclear whether AMD would honor warranties for this particular issue. As we pointed out in a previous article, that statement concerning reporting to customer service could be for data-gathering purposes as damage caused by hardware overclocking is explicitly not covered in Ryzen product warranties. TechRadar has reached out to AMD for clarification regarding this situation and will update this story with any statements given to us. When looking over the evidence it’s clear that the AMD EXPO memory profiles are the main culprit. The memory overclocking setting in the motherboard BIOS is what's leading to the overvoltage of the chips, and it's not expressly stated that the users overclocked the chips themselves, just the RAM, which has manufacturer-provided presets. However, Asus isn’t entirely faultless either. As Gamers Nexus noted when investigating this issue, Asus motherboards were still running EXPO memory profiles beyond 1.3V, which is supposed to be the SoC voltage cap set by AMD. And while this is a huge oversight on Asus’s part, it did own up to this defect and is compensating buyers, while AMD hasn't said one way or the other. The fact that Asus is covering for a problem that’s the fault of both AMD’s own Ryzen 7000-series chips and Asus’s motherboard is absolutely bonkers. Regardless of whether or not it normally covers overclocking-related incidents, this is clearly the fault of both companies. AMD EXPO is AMD's own creation, after all, so it can hardly blame Asus entirely. Overclocking is a very common practice for gamers and tech enthusiasts alike, to the point that manufacturers will almost always list overclocked specs for their components and even provide tools to overclock their hardware. The idea that AMD did not make a clear statement of intent to rectify that issue when it really should be covered under warranty is a terrible business practice. Hopefully, AMD will fix this by honoring warranties for replacement CPUs, since its own AMD EXPO technology appears to be the root cause of all these problems and buyers having to replace such an expensive chip on their own budget is unfair. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order.  My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap.  New agile US Marine formations are learning how to battle adversaries like China on remote islands, according to The Washington Post. In this week’s travel roundup we bring you transport trivia, Roman engineering marvels and the world’s tastiest dumpling. When Sam* married her husband, she never imagined that 20 years on, she'd have not one, but two affairs...  Dini von Mueffling is a PR professional in New York City's who's worked with Monica Lewinsky and Virginia Giuffre. Surveillance footage captures the harrowing moment a wild boar viciously attacks a 70-year-old man in his front yard in Guangyuan, China, on March 24. The man sustains severe spinal injuries while defending himself against the enraged animal's assault. The post Bites by Ann Chin: Michelin popiah, loaded waffles & local bites in hole-in-wall eatery appeared first on SETHLUI.com.  Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp. The visibly upset MSNBC anchor was responding to the Trump's attack on Judge Juan Merchan's daughter despite gag orders The post Nicole Wallace Gets Fed Up, Tosses Script While Covering Latest Trump Attack: ‘What Are We Going to Do Different?’ | Video appeared first on TheWrap. City Developments Limited ( SGX:C09 ), is not the largest company out there, but it received a lot of attention from a...  Israel assassinated a Syrian colonel in Damascus and a senior Hezbollah commander in Lebanon in a series of pinpointed strikes amid the largest attacks on neighbouring countries since the start of the war in Gaza. Full-back has become invaluable at Anfield and would surely thrive under Klopp’s possible replacement Roberto De Zerbi Watch as King Charles III attends church on Easter Sunday in his most significant public appearance since he was diagnosed with cancer.  The Princess of Wales and her family will not be at the service.  Charles, 75, will join the Queen and other members of the royal family at the annual Easter Mattins Service at St George’s Chapel at Windsor Castle on Sunday 31 March.  The post Fiie’s Cafe — ‘Mr Grumpy’ fried chicken officially lands in Toa Payoh appeared first on SETHLUI.com. Health officials are alerting doctors to be on the lookout for certain types of rare but serious meningococcal infections that are on the rise in the United States. Princess Eugenie and Princess Beatrice reportedly want to become working royals and are upset about King Charles snubbing them. "
}