{
    "title": null,
    "date": "3/22/2024",
    "url": "https://www.pcgamesn.com/horizon-forbidden-west/prefers-amd-gpu",
    "text": "Benchmarks place Radeon graphics cards comfortably ahead of their GeForce competitors in the newly ported PlayStation 5 console exclusive. Samuel Willetts Published: Mar 22, 2024 With Horizon Forbidden West now available on PC, benchmarks have revealed whether the game plays better on AMD or Nvidia hardware. While GeForce GPUs put in a respectable performance, it’s clear that the port runs best on Radeon graphics cards. Despite its origins as a PlayStation 5 exclusive, you don’t need the best graphics card to play Horizon Forbidden West. In fact, the game appears to run well on aging pixel pushers, providing you’re willing to turn down a few settings and make use of dynamic resolution scaling (DRS). AMD’s victory in Forbidden West has been certified by Computer Base, which tested more than ten graphics cards across multiple generations and manufacturers, using a Ryzen 9 7950X3D CPU to get its results. Sitting at the top of the charts, we find AMD’s flagship, the Radeon RX 7900 XTX. At 1080p using Forbidden West’s Very High preset, the graphics card turns in a 146fps average, comfortably outperforming the 127fps turned in by the GeForce RTX 4080 Super. The gap narrows slightly at 1440p, but the XTX remains the frontrunner. AMD concedes no ground in the midrange either, with the Radeon RX 7800 XT outperforming the GeForce RTX 4070 at both resolutions, albeit with a much smaller difference in frame rates. Looking at prior generation graphics cards, the Radeon RX 6650 XT just manages to maintain an average frame rate above 60fps at 1080p, 63fps to be exact, while the GeForce RTX 3060 falls short at 51fps. However, these results were all obtained using the game’s highest preset without any form of upscaling or frame generation. Looking at Digital Foundry’s performance analysis of Forbidden West using the GeForce RTX 2070 Super at 1440p, with both DLSS and DRS enabled, the High preset saw a “generally good 60fps” with a few drops. Naturally, dropping to 1080p should see the almost five-year old graphics card hit that target. Even if the edge lies with AMD in this case, the game looks to offer a great time regardless of which graphics card brand your PC is rocking. It looks fantastic too, even if Forbidden West lacks ray tracing. To make absolutely sure your PC is up to the task of running the game, though, check out the Horizon Forbidden West system requirements. We’ll have our Horizon Forbidden West settings recommendations soon, so stay tuned for those too. Samuel Willetts                 Sam has spent the past two decades tinkering with computers, a tradition he proudly continues as a Hardware Editor for PCGamesN. For all things systems and components, he's your man. You'll regularly find his hands inside a PC, swapping out components from the likes of AMD, Intel, and Nvidia as fast as you can say Windows. Otherwise, you'll find him on the showfloor of CES and Computex, talking the night away about the latest pieces of shiny silicon. You may also know him from outlets such as Custom PC, PC Gamer, Pocket Tactics, T3, and TopTenReviews. "
}