{
    "title": "China Intel and AMD processors in government computers and servers",
    "date": "3/27/2024",
    "url": "https://hi-tech.ua/en/china-intel-and-amd-processors-in-government-computers-and-servers/",
    "text": "  China has introduced new rules banning the use of Intel and AMD processors in government computers and servers. Chinese government agencies must now use “safe and reliable” domestic replacements for AMD and Intel chips.  The list includes 18 approved processors, including chips from Huawei and state-owned Phytium, both of which are banned in the United States.  The forced switch to domestic alternatives such as processors from Huawei and Phytium underscores China’s push for self-sufficiency in key technology segments.  China’s move to ban the use of Intel and AMD processors, as well as the Microsoft Windows operating system and foreign databases in government computers and servers, is part of a broader strategy to strengthen technological independence and security. This decision not only strengthens the domestic market and supports local technology companies, but also reflects the growing technological and trade tensions between China and the United States.  For Intel and AMD, which generate a significant portion of their revenue from the Chinese market, these new rules could have a significant impact on their international sales and growth strategies. Likewise, the ban on Micron and restrictions on US companies such as NVIDIA reflect the depth of the technological divide between the two countries. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.   Δ вологість: тиск: вітер: The universal Baseus compressor is interesting because it has a built-in battery, a pressure sensor and good assembly, for which its devices from Aliexpress are valued. Let’s tell you more details The list includes 18 Chinese government-approved processors, including chips from Huawei and state-owned Phytium, both of which are banned in the United States. The Spotify miniplayer is a pop-up window with audio controls such as changing tracks, selecting playlists and adjusting volume "
}