{
    "title": "March Market Madness: 3 Stocks That Are a Slam-Dunk for Your Portfolio",
    "date": "3/15/2024",
    "url": "https://markets.businessinsider.com/news/stocks/march-market-madness-3-stocks-that-are-a-slam-dunk-for-your-portfolio-1033169593",
    "text": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips Today’s article takes us beyond basketball to introduce three stocks to buy in March. Forget buzzer-beaters and brackets, this March Madness is all about empowering your portfolio with artificial intelligence (AI). The global AI market is poised for significant growth, driven by its expanding applications across various industries. Forecasts indicate a robust compound annual growth rate (CAGR) of 37.3%, reaching a market size of nearly $2 trillion by 2030. Now, savvy investors are looking for slam-dunk stocks that capitalize on this explosive growth. But here’s the secret: You don’t need to chase the usual AI giants. Today, we’ll unveil three underappreciated names quietly benefiting from the proliferation of AI in their specific niches. These three stocks to buy offer the potential for robust returns as AI reshapes the world around us. Among our first stocks to buy is Celestica (NASDAQ:CLS), a leading electronics manufacturing services (EMS) company that builds custom hardware for clients across industries. Celestica released solid fourth-quarter and full-year financial results in late January. Revenue increased 5% year-over-year (YOY) to $2.14 billion, while adjusted earnings per share (EPS) rose 36% to 76 cents. That positive performance was driven by the Connectivity & Cloud Solutions segment, with significant demand for bespoke hardware solutions from hyperscaler clients.  Celestica’s strategic investments in AI, machine learning and cloud solutions have positioned it as a leader in the EMS space. In fact, management forecasts continued momentum in 2024. Robust revenue growth and improved product mix are expected to be the main drivers of future growth. As a result, CLS stock has gained more than 55% year-to-date (YTD), on top of a 150% increase in 2023. Despite this impressive run, shares are trading below sector median multiples at 15.2 times adjusted forward earnings and 0.7 times trailing sales. Long-term investors may regard a potential decline in the CLS stock price as an opportunity to invest in the booming AI hardware market. IT heavyweight Dell Technologies (NYSE:DELL) is a top contender in our March slam dunk stocks to buy list. Its focus on AI and on-premise deployments positions it well within the rapidly growing AI server market, projected to balloon to $150 billion by 2027. Dell recently released robust earnings, with EPS exceeding analyst expectations by a robust 22% YOY, despite a slight dip in overall revenue. Yet, the deferred revenue reached $30.3 billion, reflecting strong customer commitments. The metrics announced highlight the strength of their AI strategy. Currently, Dell offers a comprehensive AI server portfolio for the demanding workloads of advanced AI applications like machine learning and natural language processing. Management also recognizes the growing importance of multi-cloud and edge-computing Here’s the kicker: despite a 40% YTD surge, DELL stock still trades at a favorable valuation — 14.4 times forward earnings and 1.0 times trailing sales. Plus, Dell’s board just increased the dividend by 20% and committed to 10% annual hikes through 2028, making it a solid income earner. Analysts project a price target of $125, suggesting a 17% upside potential.  Don’t want to pick individual AI winners? No problem! Rounding out our March “stocks to buy” list is the VanEck Semiconductor ETF (NASDAQ:SMH). This exchange-traded fund (ETF) offers a one-stop shop for exposure to the booming AI chip market. SMH started trading on Dec 20, 2011, and currently has 26 holdings. The top 10 stocks comprise close to 74% of its $19.15 billion net assets, making it a concentrated fund. The leading 5 names in the fund include semiconductor giant Nvidia (NASDAQ:NVDA), followed by Taiwan Semiconductor Manufacturing (NYSE:TSM), Advanced Micro Devices (NASDAQ:AMD), Broadcom (NASDAQ:AVGO) and Netherlands-based ASML (NASDAQ:ASML), all crucial for developing the next generation of AI technology. With AI rapidly transforming industries, the demand for powerful AI chips is expected to skyrocket. VanEck recognizes this potential, highlighting strong growth indicators for the sector in 2024 and beyond. SMH boasts a solid track record, having returned 30% YTD and 81% over the past year. Plus, it offers a .48% dividend yield. Keep in mind the expense ratio is 0.35%. On the date of publication, Tezcan Gecgil ​h​olds both long and short positions in ​N​VDA stock. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.  Tezcan Gecgil, PhD, began contributing to InvestorPlace in 2018. She brings over 20 years of experience in the U.S. and U.K. and has also completed all 3 levels of the Chartered Market Technician (CMT) examination. Publicly, she has contributed to investing.com and the U.K. website of The Motley Fool. The post March Market Madness: 3 Stocks That Are a Slam-Dunk for Your Portfolio appeared first on InvestorPlace. Indices Commodities Currencies Stocks "
}