{
    "title": "AMD Radeon HD 8350G - NotebookCheck.net Tech",
    "date": "3/18/2024",
    "url": "https://www.notebookcheck.net/AMD-Radeon-HD-8350G.89653.0.html",
    "text": "The AMD Radeon HD 8350G is a processor graphics card in the AMD Richland APUs (A4-5150M). It offers only 128 VLIW4 shader cores (8650G: 384). The 8350G has no dedicated graphics memory, but shares the main memory with the CPU cores.\nThe integrated UVD3 video decoder allows the full decoding of Multi-View Codec (MVC), MPEG-4 Part 2 (DivX, xVid), MPEG-4 AVC/H.264 and Adobe Flash HD videos.\nAccording to the clock rates of 514 - 720 MHz (Turbo), the performance is only a few percent above a Radeon HD 7420G. Thus, the Radeon HD 8350G performs similar to a dedicated Radeon HD 7450M. Modern and demanding games (2013) will be only playable in very low settings and resolutions. Without fast dual-channel memory the performance drops even more.\nThe shaders of the chip can also be used for general computing.\nThe APU is manufactured in 32nm and rated at a TDP of 35 watts. This allows the chip to be used in notebooks from 13 to 14 inches or bigger. The AMD Radeon HD 8350G is a processor graphics card in the AMD Richland APUs (A4-5150M). It offers only 128 VLIW4 shader cores (8650G: 384). The 8350G has no dedicated graphics memory, but shares the main memory with the CPU cores. The integrated UVD3 video decoder allows the full decoding of Multi-View Codec (MVC), MPEG-4 Part 2 (DivX, xVid), MPEG-4 AVC/H.264 and Adobe Flash HD videos. According to the clock rates of 514 - 720 MHz (Turbo), the performance is only a few percent above a Radeon HD 7420G. Thus, the Radeon HD 8350G performs similar to a dedicated Radeon HD 7450M. Modern and demanding games (2013) will be only playable in very low settings and resolutions. Without fast dual-channel memory the performance drops even more. The shaders of the chip can also be used for general computing. The APU is manufactured in 32nm and rated at a TDP of 35 watts. This allows the chip to be used in notebooks from 13 to 14 inches or bigger. The following benchmarks stem from our benchmarks of review laptops. The performance depends on the used graphics memory, clock rate, processor, system settings, drivers, and operating systems. So the results don't have to be representative for all laptops with this GPU. For detailed information on the benchmark results, click on the fps number. For more games that might be playable and a list of all games and graphics cards visit our Gaming List In the following list you can select (and also search for) devices that should be added to the comparison. You can select more than one device. #0 no ids found in url (should be separated by \"_\") +0s ... 0s #1 not redirecting to Ajax server +0s ... 0s #2 did not recreate cache, as it is less than 5 days old! Created at Tue, 19 Mar 2024 05:33:38 +0100 +0.001s ... 0.001s #3 composed specs +0.066s ... 0.067s #4 did output specs +0s ... 0.067s #5 start showIntegratedCPUs +0s ... 0.067s #6 getting avg benchmarks for device 4044 +0.029s ... 0.096s #7 got single benchmarks 4044 +0.007s ... 0.103s #8 got avg benchmarks for devices +0s ... 0.103s #9 min, max, avg, median took s +0.478s ... 0.581s #10 before gaming benchmark output +0s ... 0.581s #11 Got 84 rows for game benchmarks. +0.004s ... 0.586s #12 composed SQL query for gamebenchmarks +0s ... 0.586s #13 got data and put it in $dataArray +0.025s ... 0.611s #14 benchmarks composed for output. +0.776s ... 1.387s #15 return log +0.037s ... 1.424s Playing LoL 5.3 a 5 vs 5 map against bots in the highest settings including AA and 1920x1080 resulted in slightly stuttering 25 fps with a min of 16. Reducing the details to high and turning off anti-aliasing, the game was fluid at 33 fps (min 21 fps). With minimum settings and still full HD resolution we recorded an average of 52 fps. In medium detail settings with 1366x768 we benchmarked only 22 fps on average on a 5 vs 5 game with bots. Still the game was playable. Reducing the details and resolution resulted in a much better framerate. No reviews found for this graphics card. » Comparison of GPUsDetailed list of all laptop GPUs sorted by class and performance. » Benchmark ListSort and restrict laptop GPUs based on performance in synthetic benchmarks. » Notebook Gaming ListPlayable games for each graphics card and their average FPS results. * Approximate position of the graphics adapter Top 10 LaptopsMultimedia, Budget Multimedia, Gaming, Budget Gaming, Lightweight Gaming, Business, Budget Office, Workstation, Subnotebooks, Ultrabooks, Chromebooks under 300 USD/Euros, under 500 USD/Euros, 1,000 USD/Euros, for University Students, Best Displays Top 10 SmartphonesSmartphones, Phablets, ≤6-inch, Camera Smartphones "
}