{
    "title": "Intel Core 2 Duo T9300 vs AMD A12-9700P vs Intel Core 2 Duo P9500",
    "date": "3/30/2024",
    "url": "https://www.notebookcheck.net/T9300-vs-A12-9700P-vs-P9500_377_8166_405.247596.0.html",
    "text": "The Intel Core 2 Duo T9300 was a upper middle class dual core CPU for laptops, at the time of introduction. It is similar to the Core 2 Duo T9400 but features a slower clocked front side bus.\nDue to the relatively high clock speed and 6MB Level 2 cache, the T9300 offers enough performance for most demanding games (in 2009) and applications.\nThe T9300 uses a Penryn (Montevina Update) core that features 2 integer units, 1 floating point unit, 1 load unit, and 1 store unit in a 14-stages long pipeline. Due to the Wide Dynamic Execution Technology, the core is able to simultaneously execute up to four instructions.\nThe integrated Enhanced Speedstep is able to downclock the core dynamically to save power (in idle mode). The Intel Core 2 Duo T9300 was a upper middle class dual core CPU for laptops, at the time of introduction. It is similar to the Core 2 Duo T9400 but features a slower clocked front side bus. Due to the relatively high clock speed and 6MB Level 2 cache, the T9300 offers enough performance for most demanding games (in 2009) and applications. The T9300 uses a Penryn (Montevina Update) core that features 2 integer units, 1 floating point unit, 1 load unit, and 1 store unit in a 14-stages long pipeline. Due to the Wide Dynamic Execution Technology, the core is able to simultaneously execute up to four instructions. The integrated Enhanced Speedstep is able to downclock the core dynamically to save power (in idle mode). The AMD A12-9700P is a mainstream SoC from the Bristol-Ridge APU series for notebooks (7th APU generation), which was announced mid 2016. The ULV chip with a TDP of 15 Watts (can be configured to 12 Watts) has four CPU cores (two Excavator modules), a Radeon R7 GPU as well as a dual-channel DDR4-1866 memory controller. Carrizo is a full-fledged SoC and is also equipped with an integrated chipset, which provides all I/0 ports. \nArchitecture \nBristol Ridge is the successor of the Carrizo architecture and the design is almost identical. Thanks to optimized manufacturing processes and more aggressive Boost behavior, however, the clocks are a bit higher at the same power consumption. The memory controller now also supports DDR4-RAM, in this case up to 1866 MHz. More technical details are available in the following articles:AMD's Bristol Ridge and Stoney Ridge ArchitectureAMD: Bristol Ridge APUs announcedPerformance \nThe performance of the A12-9700P is between the two 15-Watt processors A10-9600P and FX-9800P, and therefore roughly on par with a 15-Watt Core i3 from the Skylake or Kaby Lake series, respectively. Compared to the Intel model, the AMD chip has a small advantage in multi-thread scenarios, but is beaten when you only stress one or two cores. Due to the TDP limitation, the performance of the A12-9700P will drop significantly under sustained workloads. \nThis means there is sufficient performance for typical office and web applications as well as light multitasking. \nGraphics Card \nThe integrated Radeon R7 (Bristol Ridge) GPU has 512 active shader units (8 compute cores) clocked at up to 758 MHz. Thanks to the better utilization of the clock range as well as faster DDR4-RAm, the GPU can slightly beat its predecessors Radeon R7 (Carrizo) and competes with a dedicated GeForce 920MX in the best-case scenario (dual-channel memory, low CPU requirements). Many games from 2015/2016 can be played smoothly at low settings.  \nPower Consumption \nAMD specifies the TDP of the A12-9700P with 15 Watts, which is comparable to Intel's ULV models. This means the CPU is a good choice for thin notebooks starting with a 12-inch screen. The AMD A12-9700P is a mainstream SoC from the Bristol-Ridge APU series for notebooks (7th APU generation), which was announced mid 2016. The ULV chip with a TDP of 15 Watts (can be configured to 12 Watts) has four CPU cores (two Excavator modules), a Radeon R7 GPU as well as a dual-channel DDR4-1866 memory controller. Carrizo is a full-fledged SoC and is also equipped with an integrated chipset, which provides all I/0 ports. Architecture Bristol Ridge is the successor of the Carrizo architecture and the design is almost identical. Thanks to optimized manufacturing processes and more aggressive Boost behavior, however, the clocks are a bit higher at the same power consumption. The memory controller now also supports DDR4-RAM, in this case up to 1866 MHz. More technical details are available in the following articles: Performance The performance of the A12-9700P is between the two 15-Watt processors A10-9600P and FX-9800P, and therefore roughly on par with a 15-Watt Core i3 from the Skylake or Kaby Lake series, respectively. Compared to the Intel model, the AMD chip has a small advantage in multi-thread scenarios, but is beaten when you only stress one or two cores. Due to the TDP limitation, the performance of the A12-9700P will drop significantly under sustained workloads. This means there is sufficient performance for typical office and web applications as well as light multitasking. Graphics Card The integrated Radeon R7 (Bristol Ridge) GPU has 512 active shader units (8 compute cores) clocked at up to 758 MHz. Thanks to the better utilization of the clock range as well as faster DDR4-RAm, the GPU can slightly beat its predecessors Radeon R7 (Carrizo) and competes with a dedicated GeForce 920MX in the best-case scenario (dual-channel memory, low CPU requirements). Many games from 2015/2016 can be played smoothly at low settings. Power Consumption AMD specifies the TDP of the A12-9700P with 15 Watts, which is comparable to Intel's ULV models. This means the CPU is a good choice for thin notebooks starting with a 12-inch screen. The Intel Core 2 Duo P9500 was a upper middle class dual core CPU for laptops, at the time of introduction. It is similar to the Core 2 Duo T9400 except for the lower TDP of 25 versus 35 Watt).\nDue to the relatively high clock speed and 6MB Level 2 cache, the P9500 offers enough performance for most demanding games (in 2009) and applications.\nThe P9500 uses a Penryn (Montevina Update) core that features 2 integer units, 1 floating point unit, 1 load unit, and 1 store unit in a 14-stages long pipeline. Due to the Wide Dynamic Execution Technology, the core is able to simultaneously execute up to four instructions.\nThe integrated Enhanced Speedstep is able to downclock the core dynamically to save power (in idle mode). The Intel Core 2 Duo P9500 was a upper middle class dual core CPU for laptops, at the time of introduction. It is similar to the Core 2 Duo T9400 except for the lower TDP of 25 versus 35 Watt). Due to the relatively high clock speed and 6MB Level 2 cache, the P9500 offers enough performance for most demanding games (in 2009) and applications. The P9500 uses a Penryn (Montevina Update) core that features 2 integer units, 1 floating point unit, 1 load unit, and 1 store unit in a 14-stages long pipeline. Due to the Wide Dynamic Execution Technology, the core is able to simultaneously execute up to four instructions. The integrated Enhanced Speedstep is able to downclock the core dynamically to save power (in idle mode). #0 checking url part for id 377 +0s ... 0s #1 checking url part for id 8166 +0s ... 0s #2 checking url part for id 405 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.038s ... 0.039s #6 did output specs +0s ... 0.039s #7 getting avg benchmarks for device 377 +0.002s ... 0.042s #8 got single benchmarks 377 +0.056s ... 0.098s #9 getting avg benchmarks for device 8166 +0.003s ... 0.1s #10 got single benchmarks 8166 +0.012s ... 0.113s #11 getting avg benchmarks for device 405 +0.003s ... 0.115s #12 got single benchmarks 405 +0.03s ... 0.145s #13 got avg benchmarks for devices +0s ... 0.145s #14 min, max, avg, median took s +0.178s ... 0.324s #15 return log +0s ... 0.324s "
}