{
    "title": "Advanced Micro Devices (NASDAQ:AMD) Shares Down 0.9%",
    "date": "3/26/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-amd-percent-decline-2024-03-26/",
    "text": "Advanced Micro Devices, Inc. (NASDAQ:AMD - Get Free Report) fell 0.9% during trading on Tuesday . The stock traded as low as $176.33 and last traded at $177.00. 18,702,427 shares traded hands during mid-day trading, a decline of 76% from the average session volume of 77,869,969 shares. The stock had previously closed at $178.63. Several brokerages have commented on AMD. Melius Research upgraded shares of Advanced Micro Devices from a \"hold\" rating to a \"buy\" rating and set a $188.00 price objective for the company in a report on Monday, January 8th. Susquehanna increased their price target on shares of Advanced Micro Devices from $170.00 to $210.00 and gave the stock a \"positive\" rating in a research note on Monday, January 29th. The Goldman Sachs Group increased their price target on shares of Advanced Micro Devices from $157.00 to $180.00 and gave the stock a \"buy\" rating in a research note on Wednesday, January 31st. KeyCorp increased their price target on shares of Advanced Micro Devices from $195.00 to $270.00 and gave the stock an \"overweight\" rating in a research note on Wednesday, January 31st. Finally, JPMorgan Chase & Co. increased their price target on shares of Advanced Micro Devices from $115.00 to $180.00 and gave the stock a \"neutral\" rating in a research note on Wednesday, January 31st. Four equities research analysts have rated the stock with a hold rating and twenty-five have given a buy rating to the stock. According to data from MarketBeat, Advanced Micro Devices presently has a consensus rating of \"Moderate Buy\" and an average price target of $181.82. Check Out Our Latest Report on AMD The company has a quick ratio of 1.86, a current ratio of 2.51 and a debt-to-equity ratio of 0.03. The company has a market cap of $284.59 billion, a PE ratio of 342.06, a P/E/G ratio of 2.70 and a beta of 1.66. The business's fifty day moving average is $180.25 and its 200-day moving average is $140.19. Advanced Micro Devices (NASDAQ:AMD - Get Free Report) last released its earnings results on Tuesday, January 30th. The semiconductor manufacturer reported $0.77 EPS for the quarter, hitting analysts' consensus estimates of $0.77. Advanced Micro Devices had a net margin of 3.77% and a return on equity of 5.73%. The company had revenue of $6.17 billion for the quarter, compared to analysts' expectations of $6.13 billion. During the same quarter last year, the business earned $0.54 EPS. The firm's revenue was up 10.2% compared to the same quarter last year. As a group, research analysts predict that Advanced Micro Devices, Inc. will post 2.67 EPS for the current fiscal year. In other Advanced Micro Devices news, EVP Mark D. Papermaster sold 16,200 shares of the firm's stock in a transaction that occurred on Friday, March 15th. The shares were sold at an average price of $186.73, for a total transaction of $3,025,026.00. Following the sale, the executive vice president now owns 1,554,602 shares in the company, valued at approximately $290,290,831.46. The transaction was disclosed in a document filed with the SEC, which is available through this hyperlink. In other news, Director Joseph A. Householder sold 6,572 shares of Advanced Micro Devices stock in a transaction that occurred on Monday, March 4th. The shares were sold at an average price of $208.08, for a total transaction of $1,367,501.76. Following the sale, the director now owns 2,197 shares in the company, valued at $457,151.76. The transaction was disclosed in a document filed with the SEC, which is available at this link. Also, EVP Mark D. Papermaster sold 16,200 shares of Advanced Micro Devices stock in a transaction that occurred on Friday, March 15th. The shares were sold at an average price of $186.73, for a total transaction of $3,025,026.00. Following the sale, the executive vice president now owns 1,554,602 shares in the company, valued at approximately $290,290,831.46. The disclosure for this sale can be found here. In the last 90 days, insiders have sold 324,943 shares of company stock worth $59,919,994. Company insiders own 0.73% of the company's stock. Several institutional investors and hedge funds have recently modified their holdings of AMD. Fairfield Bush & CO. purchased a new position in shares of Advanced Micro Devices in the first quarter valued at $836,000. Mirae Asset Global Investments Co. Ltd. grew its holdings in shares of Advanced Micro Devices by 49.7% in the first quarter. Mirae Asset Global Investments Co. Ltd. now owns 2,384,719 shares of the semiconductor manufacturer's stock valued at $260,746,000 after purchasing an additional 791,710 shares in the last quarter. U.S. Capital Wealth Advisors LLC grew its holdings in shares of Advanced Micro Devices by 34.9% in the first quarter. U.S. Capital Wealth Advisors LLC now owns 2,677 shares of the semiconductor manufacturer's stock valued at $293,000 after purchasing an additional 692 shares in the last quarter. Raymond James Trust N.A. grew its holdings in shares of Advanced Micro Devices by 104.8% in the first quarter. Raymond James Trust N.A. now owns 7,959 shares of the semiconductor manufacturer's stock valued at $870,000 after purchasing an additional 4,072 shares in the last quarter. Finally, Baird Financial Group Inc. grew its holdings in shares of Advanced Micro Devices by 217.2% in the first quarter. Baird Financial Group Inc. now owns 398,051 shares of the semiconductor manufacturer's stock valued at $43,524,000 after purchasing an additional 272,557 shares in the last quarter. Institutional investors own 71.34% of the company's stock. Advanced Micro Devices, Inc operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products.Featured StoriesFive stocks we like better than Advanced Micro DevicesCompound Interest and Why It Matters When Investing3 Stocks With Unusual Call Option Activity5 Top Rated Dividend Stocks to ConsiderTrump Media & Technology Group Soars on Market Debut3 Best Fintech Stocks for a Portfolio Boost3 Stocks Insiders Are Buying That Analysts Love Before you consider Advanced Micro Devices, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Advanced Micro Devices wasn't on the list. While Advanced Micro Devices currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering when you'll finally be able to invest in SpaceX, StarLink, or The Boring Company? Click the link below to learn when Elon Musk will let these companies finally IPO. MarketBeat gives you seven stocks that you should be looking at to create your own Magnificent Seven in 2024. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}