{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.tomsguide.com/computing/gaming-laptops/epic-deal-one-of-alienwares-best-gaming-laptops-just-got-slashed-by-over-dollar700",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The Alienware m18 is a beast of a machine that you can currently pick up at a scarily good discount This is one of the best gaming laptop deals I’ve seen this year. Granted, it’s only March, but I’d be surprised if a discount this enticing pops up again outside of Black Friday or Cyber Monday. If you’re on the lookout for a large and in charge portable PC, you really should consider this brilliant discount from Dell. Right now, the excellent 18-inch Alienware m18 Gaming Laptop with AMD Radeon RX 7900M GPU is on sale for $2,499 at Dell. That’s a seriously sweet saving of $500 over the normal $2,999 list price. But wait! It gets even better. If you take advantage of a Dell newsletter coupon you can save an additional $230 (thanks, NotebookCheck). I may have learned to count from a vampire Muppet, but even I know that takes the price down even further to $2,069, making for a colossal total saving of $730 if you sign up to the company’s newsletter. Alienware m18 with AMD Radeon RX 7900M: was $2,999 now $2,069 @ Dell\nEPIC DEAL! While the site lists its Alienware m18 gaming laptop at $2,299, as we just pointed out above, you can save an additional 10% by signing up to the firm’s newsletter to take advantage of a Dell coupon. With an AMD Radeon RX 7900M GPU, Ryzen 9 7945HX CPU, 32GB of DDR5 RAM and 1TB of NVMe storage, this has all the graphical grunt you need to tame the best PC games. Port selection is also generous, with a duo of Gen 2 USB-C slots, an RJ45 Ethernet socket, single HDMI 2.1 port, a mini-Display connection and a DisplayPort slot. If you’re a fan of RGB lighting, you’ll also dig the m18’s chunky but classy chassis that sports AlienFX Lighting Zones with up to 16.8 million distinct colors. Better bust out your best pair of shades. This is a special machine, too. In our Alienware m18 review, my expert computing colleague Alex Wawro cited it as “the biggest, most powerful gaming laptop we’ve tested to date.\" He also added that “when plugged in it runs the latest games as well as some of the best gaming PCs, truly earning the term desktop replacement.” High praise indeed. Now while this specific config of the Alienware m18 that’s currently going for a song isn’t quite as powerful as the model Alex scored 4.5/5 (his review unit featured the best gaming GPU on the planet in the form of the Nvidia GeForce RTX 4090), this discounted m18 is still a big-ass laptop with sizable horsepower under the hood. It should absolutely slay the best Steam games, and will look damn good doing so in Dell’s fetching Dark Metallic Moon color scheme. This configuration goes the Team Red route, meaning it’s powered by some impressive AMD components. And make no mistake, this specific Alienware m18 packs a devastating GPU/CPU tag team. The Radeon RX 7900M is one of the fastest graphics cards AMD makes, and it’s roughly on par with Nvidia’s RTX 4080. Combine this GPU with a 16-core AMD Ryzen 9 7945HX processor that boasts a max boost clock of 5.40GHz, and you’re dealing with deadly gaming laptop power; even more so when you throw a whopping 32GB of DDR5 RAM into the mix.  The other headline selling point of this Alienware m18 is its astonishingly speedy display that tops out at a frankly absurd 480Hz while still managing to cover 100% of the DCI-P3 color gamut. Naturally with such a blistering refresh rate, screen resolution takes a bit of a hit, with this 18-inch FHD panel delivering 1,920 x 1,200 pixels. That’s still a perfectly respectable res, though. Especially when you factor in that the Radeon RX 7900M packs 16GB of GDDR6 onboard memory, meaning you’ll be able to run excellent PC games like the recent Helldivers 2, the breathless butchery of Doom Eternal and the fully redeemed The Last of Us Part 1 at the highest textures with anti-aliasing cranked to the max. That level of image quality will go a long way to covering any visual cracks of that 16:10 take on 1080p. Alex also found that giant 18-inch screen to be great for working on, while he was also pleased with the m18’s booming speakers. Just bear in mind Dell only guarantees battery life of a paltry 3 hours and 21 minutes with its discounted Alienware. Though with this m18 measuring in at 16.1 x 12.6 x 1.05 inches and tipping the scales at 8.9 pounds, you’re going to want to game with this bad boy plugged into a wall and plonked on either a desk or coffee table. Otherwise, you’re going to be dealing with one uncomfortably crushed crotch if you let the Alienware m18 sit on your lap for extended periods. Steady. With the eagerly anticipated Elden Ring Shadow of the Erdtree DLC out in a few short months and the graphical majesty of Alan Wake 2 begging to take advantage of the amazing Alienware m18, you should give this sweet Dell deal serious consideration if you’re a hardcore PC gamer. Upgrade your life with a daily dose of the biggest tech news, lifestyle hacks and our curated analysis. Be the first to know about cutting-edge gadgets and the hottest deals. Dave is a computing editor at Tom’s Guide and covers everything from cutting edge laptops to ultrawide monitors. When he’s not worrying about dead pixels, Dave enjoys regularly rebuilding his PC for absolutely no reason at all. In a previous life, he worked as a video game journalist for 15 years, with bylines across GamesRadar+, PC Gamer and TechRadar. Despite owning a graphics card that costs roughly the same as your average used car, he still enjoys gaming on the go and is regularly glued to his Switch. Away from tech, most of Dave’s time is taken up by walking his husky, buying new TVs at an embarrassing rate and obsessing over his beloved Arsenal. I've been testing the HP Omen Transcend 14 — and it's my favorite gaming laptop of the year so far This RTX 3050 gaming laptop with 144Hz display is an epic Amazon Spring Sale deal 5 biggest new games launching in April 2024 for PS5, Nintendo Switch, Xbox and PC By Dan BracagliaMarch 29, 2024 By Louis RamirezMarch 29, 2024 By Louis RamirezMarch 28, 2024 By Hunter FenollolMarch 28, 2024 By Morgan BulmanMarch 28, 2024 By Louis RamirezMarch 28, 2024 By Morgan BulmanMarch 28, 2024 By Frances DanielsMarch 28, 2024 By Millie Davis-WilliamsMarch 28, 2024 By Louis RamirezMarch 28, 2024 By Alison BarrettaMarch 28, 2024 Tom's Guide is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}