{
    "title": "AMD FSR 3.1 update to enable frame generation for other upscaling \ntechnologies",
    "date": "3/20/2024",
    "url": "https://videocardz.com/newz/amd-fsr-3-1-update-to-enable-frame-generation-for-other-upscaling-technologies",
    "text": " AMD is progressing with the development of its third-generation upscaling technology. The current iteration, FSR3, is being upgraded to version 3.1 and is expected to be available to game developers starting in the second quarter. The updated upscaling technology brings several improvements, including enhanced image quality, support for Vulkan and the Xbox Game Dev Kit, and a major innovation: decoupling frame generation technology from upscaling. This could practically allow game developers to combine frame generation with other upscaling techniques such as DLSS, XeSS, or TSR. If this works out the way we think, then NVIDIA DLSS users could benefit from frame generation tech powered by AMD software, while still being able to use NVIDIA upscaler. Introducing AMD FSR 3.1 with Improved Upscaling Quality Announced today at our GDC 2024 “High Performance Rendering in Snowdrop Using AMD FidelityFX™ Super Resolution 3 (FSR 3)” presentation, AMD FSR 3.1 will have some significant improvements, new capabilities, and updates: The FSR 3.1 was revealed at GDC 2024, showcasing enhancements to temporal stability and ghosting in side-by-side animations. These improvements were demonstrated using game Ratchet & Clank: Rift Apart, set to be one of the early adopters of FSR 3.1.   GHOSTING REDUCTION (FSR 2.2 vs FSR 3.1), Source: AMD    TEMPORAL STABILITY (FSR 2.2 vs FSR 3.1), Source: AMD  AMD claims that around 40 games are lined up to support FSR 3, but there’s no official list yet for FSR 3.1 supported titles. Developers will access FSR 3.1 through the GPUOpen platform. While no specific release date has been provided, AMD is aiming for a second-quarter launch. Source: AMD We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}