{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.trendforce.com/news/2024/03/25/news-escalating-us-china-tech-war-china-reportedly-tightens-grip-on-intel-and-amd-impacting-tsmc/",
    "text": " The US-China tech war continues to escalate, as reported by the Financial Times (FT). Beijing has reportedly instructed official institutions in China to refrain from using PCs and servers equipped with microprocessors from Intel and AMD, as well as to reduce procurement of Microsoft Windows operating systems and database software outside of China. In response to these reports, both Microsoft and Intel have declined to comment, while AMD, China’s Ministry of Finance, Ministry of Industry and Information Technology, and the China Information Security Evaluation Center have not responded to requests for comment from FT reporters. FT further reveals that Chinese authorities have requested state-owned enterprises to promote localization internally. Intel and AMD are the two major semiconductor giants in the United States, dominating nearly all global market shares of PC processors. As both Intel and AMD are significant customers of TSMC’s advanced process nodes, this move is expected to influence TSMC’s future order status. Regarding China’s full-scale development of proprietary computer processors, its potential impact on ASIC-related companies in Taiwan remains to be seen. As per Industry sources cited by the report, they have suggested that this move by Chinese authorities demonstrates their determination to strengthen local semiconductor autonomy and enhance manufacturing and design capabilities. On the manufacturing side, the focus remains on supporting SMIC, while chip design is primarily led by companies such as Huawei and Phytium. Per the same report, following the release of new guidelines by China’s Ministry of Finance and Ministry of Industry and Information Technology on December 26th last year, officials have begun adhering to the latest standards for PC, laptop, and server procurement this year. They have mandated that government departments at the township level and above, as well as party organizations, must incorporate standards for purchasing “secure and trustworthy” processors and operating systems. The China Information Technology Security Evaluation Center has published the first list of “safe and reliable” processors and operating systems, all of which are from Chinese enterprises. Among the 18 approved processors are chips from Huawei and Phytium. Chinese processor manufacturers are utilizing a hybrid architecture combining Intel x86, Arm, and self-developed designs for chip production, while operating systems are sourced from open-source Linux software. Prior to the speculated tightening of restrictions by China on the United States, a report from Bloomberg citing sources had already signaled that the US government is considering adding Chinese semiconductor companies linked to Huawei to a blacklist. Currently, companies that have been listed on the entity list by the US Department of Commerce include Huawei, SMIC (Semiconductor Manufacturing International Corporation), and Shanghai Micro Electronics. Additionally, China’s other major memory manufacturer, Yangtze Memory Technology Corp, was added to this restriction list in 2022. Read more (Photo credit: iStock)  "
}