{
    "title": null,
    "date": "3/16/2024",
    "url": "https://wccftech.com/24-gb-non-binary-lpddr5x-memory-spotted-intel-core-ultra-honor-notebook/",
    "text": "It looks like Non-Binary LPDDR5X memory is just around the corner as Honor has listed its Intel Core Ultra laptop with 24 GB RAM. The DRAM (memory) segment has seen an influx of higher capacities with the arrival of non-binary designs. We have seen the capacities go up from 8-16-32 GB to 12-24-48 GB & there are even talks of 64 GB capacities in the works. Most of the development on these high-capacities memory options is going on in the DIMM and SO-DIMM space and we have yet to see them appear on the soldered options such as LPDDR5 and LPDDR5X but it looks like the wait is finally over. According to Golden Pig Upgrade, Honor already has its MagicBook Pro laptops featuring Intel's Core Ultra CPUs equipped with 24 GB of LPDDR5 memory. The laptop supports dual-channel memory and has a total of 48 GB LPDDR5 capacity. In the task manager, you can see that the speeds are rated at 6400 MT/s which confirms that this isn't the LPDDR5X standard but those are also coming out soon and should be incorporated in upcoming products. Other details show that the total power consumption of the notebook is around 140 watts though that has nothing to do with the memory type or memory capacity. One should remember that the graphics performance can be affected a lot by memory specifications and LPDDR5X ensures that these bandwidth-starved iGPUs from AMD & Intel run at their fullest potential. There are also talks about JEDEC unveiling the next-generation LPDDR6 memory standard as early as 2H 2023. The memory capacity upgrade moving to non-binary standards (LPDDR5 & LPDDR5X) on laptops will be a huge deal. Most laptops are limited to 16 GB or 32 GB memory and these designs will be paving the way to meet future operating system requirements which are going to be set at 16 GB for the AI PC segment. News Sources: Geekbench, Many thanks to @Ruby_Rapids for the tip! Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}