{
    "title": "AMD’s new FreeSync specifications require FullHD monitors to have a 144Hz \nrefresh rate",
    "date": "3/8/2024",
    "url": "https://www.kitguru.net/peripherals/monitors/joao-silva/amds-new-freesync-specifications-require-fullhd-monitors-to-have-a-144hz-refresh-rate/",
    "text": "João Silva \n3 weeks ago\nFeatured Tech News, Monitors  AMD introduced FreeSync technology in 2015 as an alternative to Nvidia's G-Sync. Since its inception, FreeSync technology has been updated multiple times and upgraded with additional levels, including a dedicated tier for HDR displays. Recently, it received yet another update, raising the minimum requirements for monitors to be FreeSync certified. As gaming display technology advances, AMD has chosen to upgrade the current FreeSync spec. AMD has restructured the naming scheme to make it more user-friendly and accessible for end-users while ensuring the specifications are revised appropriately.  When FreeSync technology was introduced, displays with a refresh rate of 120Hz were not common, but today, high refresh rate displays are everywhere. To keep up with the latest technology, AMD has upgraded the FreeSync specification to demand faster refresh rates. It's worth noting that while AMD has upgraded the FreeSync specifications, the modifications apply only to monitors and televisions. The company has not changed the FreeSync specifications for laptop screens. You can see the current requirements for a monitor to be FreeSync-certified below: The upgraded FreeSync specifications went live last year, but AMD has only now shared a statement regarding the changes. The minimum FreeSync specifications for 1080p displays with sub-3440 horizontal resolution have been changed to 144Hz, which was not previously a requirement for the base tier. For displays with a bigger resolution, such as 4K panels, the maximum refresh rate supported must be equal to or greater than 120Hz. Displays with sub-3440 horizontal resolution must now deliver at least 200Hz for FreeSync Premium, while Premium Pro will need to meet those requirements while also offering HDR. Discuss on our Facebook page, HERE. KitGuru says: Do you agree with the changes AMD made to the FreeSync spec? Become a Patron! Tags 144 Hz AMD FreeSync FullHD news specifications After eight major releases, HWiNFO is finally getting a built-in OSD, allowing users to see …   DDR5 speed on your next PC: How fast?  View Results "
}