{
    "title": null,
    "date": "1/4/2024",
    "url": "https://www.benzinga.com/news/24/01/36490679/amd-unveils-future-of-driving-at-ces-2024-with-ai-enhanced-processors",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Advanced Micro Devices, Inc AMD announced its plans to highlight automotive innovation at CES 2024. It introduced two new devices: the Versal AI Edge XA adaptive SoC and the Ryzen Embedded V2000A Series processor. These devices represent AMD's commitment to automotive technology leadership, catering to key segments such as infotainment, advanced driver safety, and autonomous driving. AMD's automotive portfolio, which has expanded significantly since acquiring Xilinx, will be displayed at CES 2024. The Versal AI Edge XA adaptive SoCs feature an advanced AI Engine for optimization in automotive systems like forward cameras, in-cabin monitoring, LiDAR, and autonomous driving. As the first AMD 7nm device auto-qualified, these SoCs bring enhanced security to automotive applications, focusing on safety. Also Read: Nvidia and AMD Navigate Dutch Export Restrictions to China, Affecting AI Chip Market The Ryzen Embedded V2000A Series processors are designed for the next-generation automotive digital cockpit, offering a PC-like experience in vehicles. These processors support high-definition graphics, multitasking, and security features essential for advanced infotainment and in-vehicle experiences. Salil Raje, Senior Vice President and General Manager at AMD, emphasized the potential of AMD's automotive portfolio to address the growing market, leveraging the synergy from the Xilinx acquisition. The company aims to showcase these advancements at CES 2024 with various ecosystem partners. The Versal AI Edge XA adaptive SoCs will likely accelerate vehicle AI applications, providing safety and security features. Their versatility ranges from 20k LUTs to 521k LUTs and 5 TOPs to 171 TOPs, allowing designers to scale and port designs easily. The Ryzen Embedded V2000A Series processors, with their 7nm technology and 'Zen 2' cores, enable carmakers to deliver high-performance experiences for passengers, supported by automotive software including Automotive Grade Linux and Android Automotive. AMD's participation at CES 2024 will include demonstrations of various automotive solutions like AI-optimized object detection, automated parking, and driver monitoring in partnership with companies like BlackBerry, ECARX, Luxoft, and others. AMD's booth at the event will offer insights into these solutions and opportunities to interact with AMD experts. Price Actions: AMD shares traded lower by 1.17% at $136.90 on the last check Thursday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via Wikimedia Commons © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}