{
    "title": "AMD cuts prices on RX 7900 GPUs to fight Nvidia's new Super cards",
    "date": "1/17/2024",
    "url": "https://www.xda-developers.com/amd-gpu-rx-7900-super-nvidia-sale/",
    "text": "The reveal of Nvidia’s new graphics card has put pressure on competitors Renowned for its graphics cards, Nvidia faced ample pressure ahead of the release of its Super series. Now that the GeForce RTX 40 Super GPUs have finally debuted, it isn’t just consumers who have taken notice. Nvidia competitors are all too aware of the stakes that have been raised by the Super series, and now, AMD is responding with a move of its own. AMD has announced that it is now slashing the prices of products in its RX 7000 line, including the Radeon RX 7900 XT and Radeon RX 7900 GRE. To start, the RX 7900 XT can now be found for as low as $749, while the RX 7900 GRE is selling for $549 in China — both products are more than $100 off of their standard retail cost. The RX 7900 XTX, which retails for $999, is also included in the sale. AMD has noted that those who take advantage of the promotion from now through January 30 will be able to receive a complimentary copy of “Avatar: Frontiers of Pandora.” AMD has not confirmed an end date for the promotion or product line sale. While the company will likely drum up more sales from the ongoing promotion, it will undoubtedly be a challenge for AMD — as well as other competitors — to keep pace with Nvidia. When the graphics card manufacturer revealed its Super series, it also surprised many with its pricing. For instance, the RTX 4070 Super is starting at $599, which is more than worth its 224 Tensor cores and 56 ray tracing cores. The RTX 4070 Ti Super is going for $799, justifying its 16GB of vRAM and 1440p 144Hz gaming support. Even if competitors like AMD continue to slash prices, it may be difficult to contend with the hype surrounding Nvidia’s Super series — but in a heavily saturated market, it’s worth a shot.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Krystle Vermes is a Boston-based news writer for XDA. She is a graduate of the Suffolk University journalism program, and has more than a decade of experience as a writer and editor in industries ranging from biotech to health. When she's not reporting on the latest news, Krystle is usually researching new smart home devices to fully automate her humble abode. Her first love may be writing, but new, hyped technology is a close second. You can learn more about her work at krystlevermes.com. AMD made significant improvements to its APU lineup with the Ryzen 5 8600G. But is it good enough to beat the Ryzen 5 7600? If you're looking to add one of AMD's Ryzen 7000 to your system without spending a ton, check out our collection of the best budget AM5 motherboards. The 1993 edition of the game is coming to the Husqvarna Automower NERA Robotic lawnmower Gaming handhelds are trending right now, but is a gaming laptop still better for you? DisplayPort connectivity remains the only viable workaround What decides how fast your RAM is? Frequency or latency? "
}