{
    "title": "Top Analyst Reports for AMD, Abbott Laboratories & QUALCOMM",
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/top-analyst-reports-amd-abbott-174100430.html",
    "text": "Monday, January 15, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Advanced Micro Devices, Inc. (AMD), Abbott Laboratories (ABT) and QUALCOMM Incorporated (QCOM). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>AMD shares have outperformed the Zacks Electronics - Semiconductors industry over the past year (+106.4% vs. +80.8%). The company is benefiting from portfolio strength and an expanding partner base. Strong demand for EPYC processors has been a growth driver.The launch of the Ryzen 8040 series processor with Ryzen AI and Instinct MI300 Series data center AI accelerators bodes well for top-line growth. AMD continues to benefit from acquisitions, including Xilinx and Pensando, which has diversified its business. For fourth-quarter 2023, AMD expects to witness year-over-year growth in the Data Center and Client segments by double-digit percentage.Sequentially, the Data Center segment’s revenues are expected to grow on a double-digit percentage, while Client is expected to increase. However, weakness in the Gaming and Embedded segment revenues are expected to hurt top-line growth.(You can read the full research report on AMD here >>>)Shares of Abbott Laboratories have outperformed the Zacks Medical - Products industry over the past six months (+7.6% vs. +0.6%). The company is strategically expanding its global presence to address the unmet demand for advanced medical technologies. Within the EPD business, which is solely based in emerging markets.Within Core Diagnostics, Abbott is gaining market share following the end of the public health emergency, particularly in the United States and Europe region. Within Diabetes Care, Abbott is scaling up the production of Libre and gaining reimbursement approval in several countries. Innovations and market expansion efforts are helping it offset the impact of inflation and supply disruptions.However, a steep year-over-year decline in COVID testing-related sales hurt growth. Further, the decision to exit the pediatric nutrition business in China continue to impede overall growth in Nutrition.(You can read the full research report on Abbott Laboratories here >>>)QUALCOMM shares have outperformed the Zacks Wireless Equipment industry over the past year (+19.7% vs. +6.6%). The company is focusing on the seamless transition from a wireless communications firm for the mobile industry to a connected processor firm for the intelligent edge.The company is witnessing a solid momentum in IoT and remains well poised to benefit from solid 5G traction, greater visibility and a diversified revenue stream. Strength in the snapdragon portfolio is an additional tailwind as exemplified by the multi-year Apple deal for 5G modems for iPhones and the launch of Snapdragon 7 Gen 3 chipsets with advanced AI features for mid-range smartphones.However, inflationary pressures and soft recovery in China have resulting in lower-than-expected demand and elevated inventory levels. Weakness in the smartphone industry and cautious client approach are also weighing on margins. Rising geopolitical conflicts and high debt burden are other headwinds.(You can read the full research report on QUALCOMM here >>>)Other noteworthy reports we are featuring today include Morgan Stanley (MS), United Parcel Service, Inc. (UPS) and Intuitive Surgical, Inc. (ISRG).Director of ResearchSheraz MianNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>> Today's Must Read AMD Rides on Strong Adoption of EPYC & Ryzen Processors Abbott's (ABT) Diabetes Care Business Grows amid Forex Woes Qualcomm (QCOM) Rides on 5G Traction, Portfolio Strength Featured Reports Restructuring Efforts Aid Morgan Stanley (MS), Costs a WoePer the Zacks analyst, Morgan Stanley's efforts to strengthen the wealth management segment will continue to aid the top line. Higher costs due to its investments in franchise might hurt profits. UPS Banks on Dividends & Buybacks Amid Shipping Volume WoesThe Zacks analyst is impressed with the company's efforts to reward its shareholders. However, shipping volume-related weakness is a concern. Intuitive Surgical's (ISRG) da Vinci System Helps Offset RisksPer the Zacks analyst, growing adoption of Intuitive Surgical's da Vinci system is driving its revenues as well as helping offsetting risks like supply chain constraints and rising costs. Strategic Buyouts Aid Elevance Health (ELV), Cost Woes StayPer the Zacks analyst, a number of growth-related initiatives and an expanding product portfolio are strengthening Elevance Health's market position. However, high expenses put pressure on margins. Pet-Care Portfolio BoostZoetis (ZTS), Disease Outbreaks A WoePer the Zacks Analyst, the companion animal product sales are expected to boost Zoetis in the quarters ahead. Potential supply challenges and disease outbreaks could, however, hurt prospects. Digital Transformation, AI Proliferation Aid Infosys (INFY)Per the Zacks analyst, Infosys is benefiting from large deal wins and higher investments by clients in digital transformation, artificial intelligence and automation. Diageo (DEO) Gains From Premiumization & Price IncreasesPer the Zacks analyst, Diageo is benefiting from premiumization efforts, ongoing recovery in markets, pricing actions and disciplined cost management. It is also seeing favorable margin trends now. New Upgrades Solid Renewable Portfolio & Investments Aid OGE Energy (OGE)Per the Zacks analyst, OGE Energy's investment of $4.75 billion through 2027, will strengthen its existing operations. Initiatives to expand renewable energy portfolio will drive its performance. Solid Demand, Pricing Actions Aid Carpenter Technology (CRS)Per the Zacks analyst, Carpenter Technology is gaining from strong demand across its end-use markets. Cost-reduction initiatives and efforts to preserve liquidity are also driving growth. Gibraltar (ROCK) Benefits From Three-Pillar Growth StrategyPer the Zacks analyst, Gibraltar is poised to benefit from its growth strategy focused on business systems, portfolio management and organizational development. New Downgrades Stiff Competition and Regulations Ail Devon Energy (DVN)Per the Zacks analyst, Devon (DVN) results likely to be impacted by competition it faces to secure drilling rights and acquire properties. New regulations can increase cost and lower profitability. Falling Oil Price, Higher Capex to Impact Hess' (HES) MarginsThe Zacks analyst believes that Hess (HES) will witness a weak free cash flow due to lower oil prices and higher capital budget, given the unlikely return to the 2022 triple-digit highs soon. Lithia (LAD) Grapples With High Debt & Rising SG&A ExpensesThe Zacks analyst is worried about Lithia's high long-term debt-to-capitalization ratio. Rising selling, general & administrative (SG&A) expenses as a percent of gross profit remain a concern. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Morgan Stanley (MS) : Free Stock Analysis Report Abbott Laboratories (ABT) : Free Stock Analysis Report QUALCOMM Incorporated (QCOM) : Free Stock Analysis Report Advanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report United Parcel Service, Inc. (UPS) : Free Stock Analysis Report Intuitive Surgical, Inc. (ISRG) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}