{
    "title": "Video of ridiculously powerful 64-core AMD EPYC workstation laptop emerges \n— but that pales in comparison to the ...",
    "date": "1/22/2024",
    "url": "https://www.techradar.com/pro/video-of-ridiculously-powerful-64-core-amd-epyc-workstation-laptop-emerges-but-that-pales-in-comparison-to-the-dual-socket-512-core-powerhouse-its-chinese-maker-is-working-on",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Xinjuneng Technology's REV-9 requires advanced liquid cooling If you’ve ever cursed your laptop for being too slow when tackling an important or intensive task, then imagine what it would be like to work on a beast like the REV-9, the world's first laptop equipped with a 64-core AMD EPYC CPU and an RTX 4080 desktop graphics card. REV-9, from Chinese firm Xinjuneng Technology, is available in two variants, each with a different motherboard: one with an EPYC 7713 CPU based on the Zen 3 architecture, and another with an EPYC 9554 CPU based on Zen 4. The REV-9 features a 17.3-inch QHD display with a 240 Hz refresh rate and 100% sRGB color space. It’s also available with a 4K screen with a 120 Hz refresh rate. A dedicated 3.5-inch screen displays system information, including temperature, frequency, and power consumption. Server processors, like the one used in the REV-9, are known for their high power consumption and so the laptop comes with an advanced liquid cooling system. This uses a non-aqueous, electronic fluorinated coolant that is non-conductive, ensuring that any potential leaks will not affect the electronic components. As you can see from the video from The-P1S below, and the image above, the REV-9 is far from being the most attractive laptop in the world, but its capabilities are undeniable. According to The-P1S, Xinjuneng Technology says the REV-9 (with the EPYC 7713 processor) scored nearly 49,000 points in the Cinebench R23 program. The company says of its powerhouse laptop: \"The most powerful processor available in portable computers (laptops) is the i9-13980hx, which only has 24 cores. However, our company has developed a 64-core, 17-inch laptop with desktop-level graphics and built-in liquid cooling. Its multi-core performance is more than double that of the i9 13980hx. The overall thickness of the laptop is 4.6CM, with the main body being only 3.9CM thick. It comes with an RTX4080 16G desktop-level graphics card (whose gaming performance surpasses the RTX4090 16G mobile version), providing high performance and outstanding portability.\" Pricing details have not been released yet, but as The-P1S points out, the EPYC 9554 CPU alone costs between $7,000 to $9,000, so the laptop is going to be very expensive. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! However, this is just the beginning. Xinjuneng Technology says it is developing a variety of products, including (among others) a dual socket, 512-core 17-inch laptop. There is no information on when this will become available, but rest assured we will cover it when it does. Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. How AI smart video is powering business excellence Hot Topic confirms multiple new cyberattacks — customer details and payment info exposed online Dragon's Dogma 2's Dragonsplague is an early contender for game mechanic of the year - here's why By Rowan DaviesMarch 29, 2024 By Chris NortonMarch 29, 2024 By David NieldMarch 29, 2024 By Craig HaleMarch 29, 2024 By David NieldMarch 29, 2024 By Craig HaleMarch 29, 2024 By Darren AllanMarch 29, 2024 By Maxime VermeirMarch 29, 2024 By Lee McClendonMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Marc McLarenMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}