{
    "title": "ASUS is launching TUF Gaming and Dual AMD Radeon RX 7600 XT 16GB graphics \ncards",
    "date": "1/10/2024",
    "url": "https://www.tweaktown.com/news/95478/asus-is-launching-tuf-gaming-and-dual-amd-radeon-rx-7600-xt-16gb-graphics-cards/index.html",
    "text": "At CES 2024, AMD announced a new GPU for its Radeon RX 7000 Series line-up with the Radeon RX 7600 XT 16GB. Launching January 24 with an MSRP of $329, it's a rarity - a 1080p GPU with 16GB of VRAM. As exciting as that may sound, the extra VRAM (on a 128-bit bus) is more for content creation and AI than outright gaming. TUF Gaming AMD Radeon RX 7600 XT and the ASUS Dual AMD Radeon RX 7600 XT, image credit: ASUS. Spec-wise, the new Radeon RX 7600 XT shares the same GPU and chip as the Radeon RX 7600 8GB - 32 Compute Units/Ray Accelerators and 64 AI Accelerators. In addition to doubling the VRAM, it also increases Clock speeds, which AMD advises will deliver faster 1080p and 1440p gaming performance than the Radeon RX 7600 in all games. Triple-digit max settings performance with upscaling and frame generation. ASUS has announced that it is bringing two 7600 XT cards to market, the TUF Gaming AMD Radeon RX 7600 XT and the ASUS Dual AMD Radeon RX 7600 XT. These OC models are \"ready to unleash users' creativity in next-gen AI and content creation workloads.\" The TUF Gaming AMD Radeon RX 7600 XT looks similar to other TUF Gaming cards, so expect tank-like construction with excellent cooling and a rugged and robust physical design. The triple-fan design might be overkill for a 1080p card, but the additional VRAM does open the door to higher-resolution gaming and more intensive creative workloads. The ASUS TUF Gaming Radeon RX 7600 XT OC Edition 16GB GDDR6 product page is now live and will push the Boost Clock and Game Clock beyond AMD's reference specs of 2755 MHz and 2470 MHz - though the exact number is TBD. This model takes 2 x 8-pin power connections, so we assume it will be pushed pretty high. The ASUS Dual Radeon RX 7600 XT OC Edition 16GB GDDR6 graphics card is also an OC model and pushes the Boost Clock speed to 2801 MHz, so it's a nice little bump. It features the awesome and compact 'Dual' design previously limited to GeForce cards from ASUS - this will be the one that will more closely adhere to the MSRP set by AMD. A single 8-pin connector powers it. Here's a look at the specs. ASUS TUF Gaming Radeon RX 7600 XT OC Edition 16GB GDDR6 ASUS Dual Radeon RX 7600 XT OC Edition 16GB GDDR6 Kosta Andreadis Kosta is a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}