{
    "title": "AMD Zen 5 CPU Patches In Linux Confirm Next-Gen Architecture As “Family 26”",
    "date": "1/5/2024",
    "url": "https://wccftech.com/amd-zen-5-cpu-patches-linux-confirm-next-gen-architecture-family-26/",
    "text": "AMD has pushed out new Linux patches to proceed towards \"Zen 5\" enablement on the platform, validating the lineup's codename. Phoronix reports that AMD is all about providing next-gen CPU support in Linux, as the firm has released new kernel patches to support the upcoming Zen 5 architecture. This isn't the first time we have seen AMD releasing patches for Zen 5, but the difference this time is that Zen 5 has been validated to have the codename \"Family 1Ah or Family 26\", as previously it was unclear what this codename pointed towards, and it was speculated to be Zen 5. However, with the latest patches, AMD has made it clear that Family 26 is indeed the name attached to Zen 5 enablement. The latest patch adds the \"X86_FEATURE_ZEN5\" feature flag which is common in prior generations as well, and it aids in handling multiple processor bugs. Moreover, we might see the Family 26 codename attached to future Zen lineups as well, since they tend to stick with more than one generation, as seen previously in Zen 3 and Zen 4, which were labeled under \"Family 25\". It is quite interesting to see AMD hasten up developments towards next-gen products, especially at Linux, to ensure a seamless experience on actual launches. AMD has also started to prepare new drivers for the Zen 5 lineup, as reported in previous coverage. The new \"AMD PMC\" driver is responsible for handling the \"S2\" idle and related power management of the lineup in particular and directly targets the onboard SoC. Apart from CPU lineups, AMD has also been making progress in bringing next-gen support for upcoming RDNA architectures as well, such as the \"GFX12 or RDNA 4\". The new shift in approach by AMD hints that they might take Linux much more seriously this time, and hopefully get things ready on official launch dates. Based on a recent report, it looks like the next-gen chips will target a 2H 2024 launch but AMD might give us a taste of what's to come at their upcoming CES 2024 event which is just a few days away from now. News Source: Phoronix Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}