{
    "title": "AMD Ryzen 7 8700G “Hawk Point” Desktop APU Leak: 8 Zen 4 Cores at 5.1 GHz, \n& Radeon 780M iGPU at 2.9 GHz",
    "date": "1/3/2024",
    "url": "https://wccftech.com/amd-ryzen-7-8700g-hawk-point-apu-leak-8-zen-4-cores-radeon-780m-igpu-2-9-ghz/",
    "text": "The latest benchmarks of AMD's upcoming Ryzen 7 8700G \"Hawk Point\" Desktop APU have been leaked within the Geekbench database. Yesterday, we saw the benchmarks of the AMD Ryzen 5 8600G leak out and today, we have the latest benchmarks of the AMD Ryzen 7 8700G. The AMD Ryzen 7 8700G will be the flagship AM5 Desktop APU within the Hawk Point family and feature the same combination of Zen 4 / RDNA 3 cores in a single monolithic package. We have previously covered the ML performance results of the same chip which you can check out over here. Starting with the specifications, we are looking at the AMD Ryzen 7 8700G APU which features 8 cores, 16 threads, 16 MB of L3, and 8 MB of L2 cache. This chip has a base clock rated at 4.20 GHz and boosts up to 5.10 GHz. The iGPU includes the RDNA 3-based Radeon 780M with 12 Compute Units clocked at 2.9 GHz. We have seen the Hawk Point APUs getting support for upcoming 64 GB DDR5 modules for up to 256 GB DRAM capacities on the AM5 platform. The performance benchmarks were conducted on an ASUS TUF Gaming X670E-PLUS WIFI board with 32 GB of DDR5-4800 memory so the performance here is expected to be a little bit less than what you might expect. The AM5 platform and the Hawk Point APUs are compatible with faster memory modules which can result in higher performance aided by the extra bandwidth which is benefical for the iGPU. In terms of Vulkan performance, the AMD Ryzen 7 8700G \"Hawk Point\" APU scored 35,427 points and for OpenCL, we are looking at a score of 29,244 points. This is an increase of 15% in Vulkan & 18% in OpenCL versus the Ryzen 5 8600G which features the Radeon 760M iGPU. The AMD 780M iGPU has 12 compute units versus the 8 compute units on the 760M so the performance doesn't seem to scale literally for 50% more cores but we also have to consider that the 760M iGPU was running faster DDR5-6000 memory. It looks like this is the maximum that the Radeon iGPUs can achieve within this PL (Power Limit) however we look forward to seeing more results, especially overclocking tests in the future. Furthermore, you can see the Meteor Lake iGPUs much ahead but they are also leveraging from more premium memory configurations (LPDDR5x). We can see even better iGPU performance out of the RDNA 3 chips once the AM5 \"Hawk Point\" APUs are launched in late January. Expect more information to be unveiled at AMD's upcoming CES 2024 event. News Sources: Benchleaks #1, #2 Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}