{
    "title": "AMD will bring driver-level frame generation to most games on January 24",
    "date": "1/12/2024",
    "url": "https://www.techspot.com/news/101492-amd-bring-driver-level-frame-generation-most-games.html",
    "text": "Something to look forward to: The primary advantage of AMD's super resolution and frame generation technologies is that, unlike Nvidia's, they support GPUs from all vendors. Later this month, the company will launch a second option for frame generation that works on virtually any recent game. However, there are some caveats compared to FSR 3, which AMD introduced last year and competes with Nvidia's DLSS. Eagle-eyed viewers may have noticed that the fine print in one of AMD's CES presentation slides (shown below) confirmed that the company's Fluid Motion Frames technology (AFMF) is set to exit beta on January 24. Although inferior to FSR 3 and DLSS 3, the feature implements frame generation at the driver level, letting users apply it to virtually any DirectX 11 or 12 game. AFMF debuted in preview drivers last fall, shortly after developers began implementing AMD's FSR 3 in Immortals of Aveum, Forspoken, Avatar: Frontiers of Pandora, Like a Dragon Gaiden, and other titles. Although AFMF doesn't require developer intervention, it can't use motion vectors. This limitation results in a less stable image compared to FSR 3.  Nevertheless, beta testers have reported satisfactory results in games such as Cyberpunk 2077 (which will soon support FSR 3) and Star Wars Jedi: Survivor. These results suggest that AFMF is an acceptable alternative for games that don't officially support frame generation. AFMF is particularly beneficial for CPU-bound titles like Starfield and Microsoft Flight Simulator. AMD's Aaron Steinman predicts that Nvidia will eventually adopt a similar approach to AMD's driver-level frame generation, but maybe that's too optimistic of an opinion. Something similar did occur when Nvidia Image Scaling was introduced – a driver-level spatial upscaling solution for users with GTX 10 series GPUs and games that don't support DLSS. However, these days the full implementation of DLSS 2/3 is present in many triple-A game releases, and also Nvidia just happens to have deeper pockets than ever before (to keep sponsoring more games if they wanted to go that route).  Intel is also developing a frame generation solution called ExtraSS. A paper from the company explains that the technology opts for extrapolation instead of interpolation as used by Nvidia and AMD. It's unclear how Intel's choice will affect image quality, but it could result in less input latency than DLSS 3 and AFMF. When ExtraSS arrives, it could make for interesting comparisons with AFMF, as both will support integrated graphics from their respective companies. Meanwhile, another new image scaling tool called LSFG 1.0 is making the rounds, offering frame generation that supports most games, media, and hardware, including integrated graphics. A new update for Lossless Scaling introduces an ML-based frame generator that users have successfully tested on Tekken 8, Street Fighter 6, Alan Wake 2, Cyberpunk 2077, and many others. User reports indicated that ghosting in present some instances, but the feature works surprisingly well, depending on the source content. Notably, LSFG also works on emulators, remote play, and videos. It can double frame rates for retro console titles, PS5 games, and movies. Games running LSFG must be locked to half the display's refresh rate though. Lossless Scaling is a paid tool available on Steam for $6.99 and includes system-level options for AI upscaling and integer scaling. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}