{
    "title": "What Awaits Advanced Micro Devices (AMD) in Q4 Earnings?",
    "date": "1/26/2024",
    "url": "https://finance.yahoo.com/news/awaits-advanced-micro-devices-amd-121800145.html",
    "text": "Advanced Micro Devices AMD is set to release its fourth-quarter 2023 results on Jan 30.AMD expects fourth-quarter 2023 revenues to be $6.1 billion (+/-$300 million), which indicates year-over-year growth of 9% and 5% sequentially at the mid-point.It expects to witness year-over-year growth in the Data Center and Client segments by double-digit percentage. The Gaming segment is expected to decline due to the matured console cycle. Softness in the embedded market will likely hurt Embedded revenues.Sequentially, Data Center segment revenues are expected to grow on a double-digit percentage, while Client is expected to increase. However, Gaming and Embedded segment revenues are expected to decline by a double-digit percentage.The Zacks Consensus Estimate for revenues is pegged at $6.11 billion, suggesting growth of 9.2% year over year.The consensus estimate for fourth-quarter earnings is pegged at 77 cents per share, unchanged over the past 30 days. The figure indicates growth of 11.59% on a year-over-year basis.AMD’s earnings beat the Zacks Consensus Estimate in all the trailing four quarters, the earnings surprise being 4.10%, on average. Advanced Micro Devices, Inc. price-eps-surprise | Advanced Micro Devices, Inc. Quote Let’s see how things are shaping up for the upcoming announcement. AMD’s fourth-quarter top-line growth is expected to have benefited from an improving PC market, particularly the consumer side. Per Gartner’s latest report, global PC shipments totaled 63.3 million units in the fourth quarter of 2023, up 0.3% year over year.The reintroduction of the Ryzen Threadripper 7000 Series processors for high-end desktop users is noteworthy. AMD also introduced its flagship laptop graphics processor, Radeon RX 7900M, the fastest AMD Radeon GPU ever developed for laptops.The Zacks Consensus Estimate for Client revenues is pegged at $1.496 billion, indicating 65.7% year-over-year growth.AMD’s strong data center footprint is expected to benefit top-line growth. The company continues to strengthen its footprint in the enterprise data center arena by leveraging the power of fourth-generation EPYC CPUs and Pensando data processing units.AMD continues to make strides in the data center market by launching Ryzen Threadripper PRO 7000 WX-Series processors for professionals and businesses, offering top-tier performance and security.AMD, along with its partners, continues to offer solutions that enable greater data center consolidation. Its partnerships with the likes of Dell Technologies DELL, Microsoft MSFT, Amazon Web Services (“AWS”), Alibaba and Oracle have been key catalysts.AMD expanded its data center footprint with the new Instinct MI300X accelerator. It combines CDNA 3 architecture and Zen 4 CPUs to deliver robust performance for HPC and AI workloads. Partners like Microsoft, Oracle and Dell are already using the accelerators in its systems.Microsoft is using AMD’s Instinct accelerator portfolio in its new Azure ND MI300x v5 virtual machine series, optimized for AI workloads.Moreover, Oracle Cloud Infrastructure plans to add AMD Instinct MI300X-based bare metal instances to its high-performance accelerated computing instances for AI.Dell has demonstrated its PowerEdge XE9680 server, which features eight AMD Instinct MI300 series accelerators and the new Dell Validated Design for Generative AI with AMD ROCm-powered AI frameworks.AMD’s acquisition of Nod.ai, a compiler-based automation software provider, further strengthened its capabilities to develop software-driven technology, accelerating AI solutions’ deployment for its various product lines, including data center accelerators, processors and GPUs.The acquisition has strengthened AMD’s competitive position against NVIDIA NVDA in the software market.Through its CUDA toolkit, NVIDIA offers a development environment for creating high-performance GPU-accelerated applications.The consensus estimate for Data Center revenues is pegged at $2.29 billion, suggesting 38.5% growth year over year. AMD announced a new Ryzen 8040 series processor with Ryzen AI and Instinct MI300 Series data center AI accelerators in the to-be-reported quarter. The company also introduced the ROCm 6 open software stack with significant optimizations and new features supporting Large Language Models.AMD, in collaboration with Microsoft, highlighted the integration of AMD Instinct MI300X accelerators, EPYC CPUs and Ryzen CPUs with AI engines in Azure, advancing cloud computing, confidential computing, and empowering more intelligent PCs for diverse workloads.AMD introduced the Ryzen Embedded 7000 Series processors at Smart Production Solutions 2023, featuring Zen 4 architecture and integrated Radeon graphics, catering to the high-performance demands of industrial applications with a seven-year manufacturing commitment and support for various operating systems, including Windows Server and Linux Ubuntu.AMD introduced the AMD Radeon PRO W7700, an industry-leading professional workstation graphics card priced under $1,000, delivering unmatched reliability, stability, and exceptional price and performance for content creation, CAD and AI applications.AMD announced the extension of its third Gen AMD EPYC processor family with six new offerings, providing a robust suite of data center CPUs.It announced the much-anticipated Ryzen Threadripper PRO 7000 WX-Series processors and reintroduced the Threadripper processor lineup to the high-end desktop space with the Ryzen Threadripper 7000 Series processors.AMD currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Stay on top of upcoming earnings announcements with the Zacks Earnings Calendar. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Advanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Dell Technologies Inc. (DELL) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}