{
    "title": "Here are all the upcoming GPUs set to launch this year",
    "date": "1/21/2024",
    "url": "https://www.digitaltrends.com/computing/all-the-gpus-that-might-launch-in-2024/",
    "text": "The last year brought us plenty of releases from both Nvidia and AMD, including some of the best GPUs currently available. We’ve seen some hits, but also some cards that could classify as disastrous misses. What can we expect in 2024? Although only a few GPUs have been confirmed so far, chances are that we’ll see several more models by the time the year comes to a close. Here’s what Nvidia, AMD, and Intel might be cooking up in 2024. Nvidia’s RTX 40 series refresh hasn’t been a mystery for many months now, but Nvidia only officially unveiled it during CES 2024 earlier this month. One of the GPUs is already out, and it’s pretty great. I’m talking about the RTX 4070 Super. Priced at $600, the RTX 4070 Super isn’t exactly replacing its predecessor. Both graphics cards will continue being produced, but realistically, it’s easy to believe that the RTX 4070 Super will become the new go-to at that price range. For a midrange card, this GPU unlocks access to 1440p and even 4K gaming at a more reasonable price point than some of the better models. It offers a tangible improvement over the base model, and since the RTX 4070 was already Nvidia’s best value card in this generation, getting more performance at the same price is just a great deal all around. However, the RTX 4070 Super is only the beginning. Nvidia is also launching the RTX 4070 Ti Super in just a few days, on January 24, and it’ll be followed by the RTX 4080 Super on January 31. We still have to test those GPUs ourselves to know their exact performance, but their specs combined with their price tags tell us quite an interesting story. The RTX 4070 Ti Super might not quite be the RTX 4080 that we already know, but it’s the next best thing. With a notable boost to memory size and a CUDA core count that’s not too far behind, it’s a significant upgrade over the existing RTX 4070 Ti. It’ll be replacing that model, meaning that the RTX 4070 Ti is going to be phased out. Lastly, there’s the RTX 4080 Super. It’s hardly an upgrade over its predecessor — it’ll be, at most, around 2% to 5% faster. But Nvidia still managed to shock me with this release, because instead of driving up the price, it actually discounted this GPU down to $1,000. Arguably, this is the price tag the original version should have received back when it was first released in 2022. I’d go even lower, but hey, this is Nvidia — it’s not exactly known for having a benevolent pricing strategy. This is it from Nvidia for now, but rumor has it that it might be readying its next-gen GPUs for a late 2024 release. First, let’s check out what AMD has in store. AMD’s CES 2024 keynote was a little lackluster when it came to graphics cards — the company’s focus was almost solely on processors and AI this time around. However, it did announce a graphics card that we’ve all been waiting for: the RX 7600 XT. It’s no rival to the RTX 40 Super cards, but it stands in a league of its own as far as this year’s releases are concerned. It’s a budget GPU, priced at $330, that’s set to rival the RTX 4060 and outperform the RX 7600. The only problem is that it’s currently unclear just how much better this GPU will turn out to be. AMD’s approach to the RX 7600 XT is a strange one, although we’ve seen it before with Nvidia’s RTX 4060 Ti 16GB. Much like the Nvidia card, AMD changed next to nothing in the RX 7600 XT compared to the RX 7600, but it doubled the memory size. On the one hand, we’re getting the same number of stream processors, the same bandwidth, and the same 128-bit bus. On the other, the RX 7600 XT serves up 16GB of memory instead of 8GB, slightly higher clock speeds, and a higher TBP. Squeezing 16GB of VRAM across a 128-bit bus could potentially hinder the card’s performance in some titles. I won’t be surprised if the RX 7600 XT largely ends up being similar to its predecessor. The extra VRAM will be nice to have in some games, but it would have been much better if the increase came with a wider bus. AMD’s RX 7600 XT launches on January 24, so we’re just days away from finding out how it’ll hold up against similar models. Although AMD’s next-gen RDNA 4 lineup is said to be coming out this year, AMD failed to say a word about it during its CES 2024 keynote. I was a little disappointed, but not exactly surprised. Current rumors tell us that these graphics cards won’t start rolling out until the second half of the year, so we may still hear about them from AMD in a few months. Given the release timelines, this year could be AMD’s chance to beat Nvidia in a big way — but only if it plays its cards right. This means delivering solid GPUs to a wide range of mainstream users. We need AMD to be there at the entry-level part of the market, but also to be competitive closer to the high end. The rumor mill’s been pretty quiet about RDNA 4, but the few hints we’ve gotten all tell us the same thing: AMD may be giving up on the premium segment for this generation. Frequent PC hardware leakers like Kepler_L2 and All_The_Watts on X (formerly Twitter) both said that AMD might be killing off the Navi 41 and Navi 42 GPUs, both of which would belong to the high-end portion of the market if they were ever released. In that regard, the generation might turn out to be similar to RDNA 1, where AMD didn’t make any high-end GPUs at all. Navi4 lineup will not have any high-end GPUs Think of it like RDNA1 or Polaris generation. &mdash; Kepler (@Kepler_L2) August 4, 2023 All of this implies that we’re unlikely to see a card capable of competing against Nvidia’s rumored RTX 5090. Instead, according to Moore’s Law Is Dead, AMD’s top chip might be a midrange GPU with enough performance to rival the RX 7900 XT. Compared to Nvidia, this puts AMD’s future flagship at a performance level that’s similar to the RTX 4070 Ti Super. However, it’s unclear whether AMD would also serve up any significant improvement in ray tracing; if not, then Nvidia’s Ada cards would still rule in that regard. With the top GPU said to be at around the level of the RX 7900 XT, AMD might really be sitting this one out and focusing on the mainstream market, with a flagship priced at $400 to $700. This isn’t a bad strategy, and although it’s a shame to give Nvidia free rein over the enthusiast sector, most of us turn to these mainstream GPUs in our PC builds instead of shelling out $2,000 on an RTX 4090. If AMD focuses on performance per dollar, it might be quite successful and dominate sales in the second half of 2024, which is when RDNA 4 is expected to come out. Nvidia’s next-gen RTX 50 series is in a similar limbo as the RX 8000 series right now, at least as far as rumors and leaks are concerned. We know that it’s coming eventually, and we have some sort of an idea of what to expect, but Nvidia’s focus is still on the RTX 40 series, so we’re unlikely to hear more for quite some time. However, several PC hardware leakers are already dropping bits and pieces of information that help us piece together a clearer picture of Nvidia’s Blackwell. We actually know more than we do about AMD’s RDNA 4 right now, but how much of that will come true remains to be seen. According to recent leaks, Nvidia is building the RTX 50 series based on a TSMC 3nm process, and the chips that are expected to arrive include the GB202, GB203, GB205, GB206, and GB207. Notably missing is the GB204, which would be the successor to cards like the RTX 4070, currently based on the AD104 GPU. Frequent leaker kopite7kimi also revealed that the cards will feature support for DisplayPort 2.1, which is something AMD already provides in this current generation. The general consensus right now seems to be that the top chip in the lineup will come with GDDR7 memory and a 384-bit bus, as well as around 192 to 204 stream multiprocessors (SMs). However, all of these specs are still subject to change, and we won’t be able to confirm how legitimate the leaks are until Nvidia officially unveils the cards. Moore’s Law Is Dead recently talked about Nvidia’s RTX 50 series, citing anonymous industry sources. According to the YouTuber, Nvidia’s next-gen cards won’t offer a groundbreaking performance boost. However, Nvidia still has every chance to offer the (technically) best graphics card because AMD might not even be trying to make one in the first place. Initial rumors pinned the release date for Blackwell at around early 2025, giving AMD plenty of time to shine in 2024. However, Moore’s Law Is Dead believes that Nvidia could release its next-gen graphics cards in late 2024 if it wanted to, putting extra heat on AMD and stealing some of the holiday season sales. Whether that will happen remains to be seen. I sometimes forget that Intel even has a horse in the GPU race. Overshadowed by giants Nvidia and AMD, Intel certainly makes more of an impression with its processors, but it does play an important (albeit small) role in the GPU market. It gives gamers an alternative at 1080p, and its graphics cards are dirt cheap compared to some of Nvidia’s offerings. The downside is that, even now, Intel is one generation behind the competition. Once AMD comes out with RDNA 4 and Nvidia rolls out the RTX 50 series, Intel will be left in the dust. This is why 2024 is an important year for Intel, and a chance to catch up a little bit before its competitors have similarly priced, but better entry-level GPUs to offer. Fortunately, Intel’s next-gen Arc Battlemage cards are in progress. Tom Petersen, an Intel fellow, revealed in an interview that about 30% of Intel’s GPU engineers are working on Battlemage, and the hardware portion of the development seems to be well underway, with most of the team now working on the software side. However, recent rumors say that Intel may also stick to the entry-level and midrange segment and may not even try to release a high-end Battlemage card. This information comes from RedGamingTech. The YouTuber detailed the specs of the next-gen Intel flagship. This includes 56 Xe cores, a clock speed of up to 3GHz, a 192-bit memory bus, and 8MB of L2 cache accompanied by 512MB of “Adamantine” cache (which seems like Intel’s response to AMD’s Infinity Cache). Specs like this would mark a significant improvement over the Arc A770, but RedGamingTech now speculates that Intel might not even launch this GPU at all. It sounds like there’s not much profit to be had for Intel in the upper midrange segment where the competition is fierce from both AMD and Nvidia. Instead, Intel is said to be maxing out at a GPU with 40 Xe cores, a 192-bit bus, and 18MB of L2 cache. There’s no mention of the mysterious “Adamantine” cache for this one, either. I can’t say that I blame Intel if this ends up being true. With Arc Battlemage unlikely to show up before the very end of 2024 (and possibly later), it makes more sense to keep targeting that 1080p budget segment than to try to trade blows with RDNA 4 and RTX 50 series cards. Is 2024 going to be the year when we get loads of GPUs, or will it mostly be quiet? It’s too soon to tell. We only have four confirmed releases so far, but there’s probably more to come. We know about the fairly high possibility of AMD’s RDNA 4 in the third or fourth quarter, with Nvidia’s Blackwell possibly arriving to compete in late 2024. Intel Arc Battlemage in 2024 sounds like a pipe dream, but who knows? It could happen. That’s not all. AMD coming out with its own refresh, also referred to as RDNA 3.5, is likely given the fact that it did the same in the previous generation of cards. Nvidia could still launch the full AD102 GPU as an RTX 4090 Super. There’s also the possibility of an RTX 4050 or an RTX 4060 Super. However, various leakers haven’t had much to report on those GPUs, so I’m not too hopeful. We’re entering this year with a lot of guesses and not too many facts. If we don’t see too many new GPU releases, and the AI scene doesn’t disrupt the mainstream market, we might see prices drop and stock levels remain abundant. If we do get new cards, the scales may tip in the favor of either AMD or Nvidia. It’ll be interesting to see which GPU maker dominated 2024 by the time the year comes to a close. AMD's FidelityFX Super Resolution 3 (FSR 3) has had an uphill climb so far, but things might get better in 2024. According to a statement from the company's chief technology officer, this year will be a big one for AMD in terms of AI -- and this doesn't just mean large-scale AI, but also upscaling. Are we going to see some major changes in AMD's next-gen RDNA 4 graphics cards? The tantalizing bit of information comes from Mark Papermaster, AMD CTO, who was a guest on the No Priors Podcast. At the very end of the interview, Papermaster gave a few hints as to what's on AMD's agenda for 2024. It's all about AI, and no surprise -- Nvidia has adopted the same approach. Nvidia and AMD trade blows when it comes to making some of the best graphics cards, but there's one area where AMD obliterates Nvidia: gaming handhelds. The booming market of portable gaming PCs largely belongs to AMD right now. However, that might soon change, as it seems that Nvidia is gearing up to ensure that its chips power next-gen handhelds -- but there are a few obstacles to consider before such a device can ever be made. AMD really went all-in on gaming handhelds at just the right time. From the Steam Deck to the Asus ROG Ally, the portable PCs that bridge the gap between a computer and a console are all the rage right now, and they're almost exclusively powered by AMD APUs. There are a couple of Intel Core Ultra-based handhelds on the way, such as the MSI Claw, but so far, AMD dominates. Nvidia is completely absent, and it's safe to say it's missing out on a huge opportunity. The never-ending battle between AMD, Nvidia, and Intel doesn't just involve their graphics cards -- it also stretches to their respective upscaling solutions. It's not all about performance, either, but also the number of games that support them. Microsoft aims to streamline and unify these upscalers, making it easier for game devs to add support for every GPU vendor. The main issue with having three different upscaling solutions lies not just in how well they all perform in relation to each other (although that's pretty interesting, too), but in how many games can support them. After all, what's the point in DLSS, FSR, and XeSS, if they're not available in too many games? This is where Microsoft's new API, dubbed DirectSR, might come in handy. Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}