{
    "title": "AMD Stock Sank Today -- Is It a Buy for 2024?",
    "date": "1/2/2024",
    "url": "https://www.fool.com/investing/2024/01/02/amd-stock-fell-today-is-it-a-buy-for-2024/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More AMD (AMD 0.50%) stock lost ground Tuesday -- the first trading day of 2024. The semiconductor specialist's share price ended the day down 6%, according to data from S&P Global Market Intelligence. AMD stock fell on news that ASML had halted shipments of its lithography machines for semiconductor fabrication to China. ASML's decision reportedly stemmed from pressure applied by the U.S. government. In addition to the big semiconductor-industry news, tech stocks also fell after Barclays analyst Tim Long downgraded the investment company's rating on Apple stock from \"neutral\" to \"underweight.\" Long lowered his one-year price target on Apple from $161 per share to $160 per share citing a less favorable outlook for the iPhone line and potential weakening for the company's services business. Today's big pullback for AMD stock highlights some of the key valuation threats facing the tech sector -- and growth-dependent chip stocks in particular. In terms of AMD's business-performance outlook, the ASML news looks much more significant than the ratings downgrade for Apple stock from Barclays. Tensions continue to rise between the U.S. and China, and the semiconductor industry has become a central battleground in the competition between the two world powers. While the U.S. has made moves to limit China's ability to purchase and manufacture high-performance artificial intelligence (AI) chips, China has indicated that it plans to bring Taiwan back under its territorial control. Given that AMD relies on chip-fabrication services from Taiwan Semiconductor Manufacturing, the fraught geopolitical situation remains a key risk factor for the company. Following surging interest in AI technologies and momentum for the broader semiconductor space, AMD stock has also been pushed up to a much more growth-dependent valuation.  AMD PE Ratio (Forward 1y) data by YCharts. While AMD's stock has posted explosive gains over the last year, the business's recent performance has been less impressive. Revenue rose 8% year over year in the third quarter, while non-GAAP (adjusted) earnings per share were up 21%. The semiconductor specialist's business performance hasn't been bad, but it's important to keep in mind that the 114% increase for its share price over the last year has been aided significantly by excitement about future opportunities in AI. Ultimately, I do think that AMD has what it takes to be a worthwhile long-term investment. The company looks poised to continue gaining market share from Intel in the central processing unit (CPU) and server markets, and it may also be able to gain some ground against Nvidia in the graphics processing unit (GPU) space that is central to the AI race. AMD has the potential to be a big winner, but investors should keep in mind that the stock's outlook is much more speculative after a year of explosive gains. Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends ASML, Advanced Micro Devices, Apple, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Barclays Plc. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}