{
    "title": "RTX 3050 6GB alleged specs leak: Nvidia's killer blow to AMD's terrible \n6500 XT coming soon",
    "date": "1/14/2024",
    "url": "https://www.neowin.net/news/rtx-3050-6gb-alleged-specs-leak-nvidias-killer-blow-to-amds-terrible-6500-xt-coming-soon/",
    "text": "3 hours ago 3 hours ago 6 hours ago 6 hours ago 3 hours ago 13 hours ago 13 hours ago 19 hours ago Mar 28, 2024 Mar 27, 2024 Mar 26, 2024 Mar 26, 2024 Mar 28, 2024 Mar 28, 2024 Mar 26, 2024 Mar 26, 2024 6 hours ago Mar 30, 2024 Mar 30, 2024 Mar 30, 2024 Mar 25, 2024 Mar 23, 2024 Mar 20, 2024 Mar 17, 2024 Dec 31, 2023 Oct 14, 2023 Apr 11, 2023 Mar 27, 2024 Mar 25, 2024 Mar 10, 2024 Mar 3, 2024 Mar 24, 2024 Mar 21, 2024 Sep 23, 2023 Sep 21, 2023 19 hours ago Mar 29, 2024 Mar 28, 2024 Jun 14, 2003 Feb 23, 2024 Jan 20, 2024 Dec 6, 2023 Jun 6, 2023 Sayan Sen\n\nNeowin\n                ·\n    \n\n    Jan 14, 2024 18:58 EST\n    \n\nwith 18 comments Update: The RTX 3050 6GB is now official, the leaked specs were spot on. A new driver with support for the card is out too. Original article below.  Nvidia had an eventful CES 2024 as the company launched a trio of new GeForce GPUs, the RTX 4080 Super, the 4070 Ti Super, and the 4070 Super. Interestingly, the company inadvertently under-specced the 4070 Super in its slides and the card is actually even better than it was presented. In comparison, AMD's Radeon division put up a somewhat sorry figure as it only revealed a new 16GB variant of the RX 7600 that it has misleadingly named as 7600 XT as the card does not feature more Stream processors/ compute units, just higher clocks. However, this has been far from the worst launches AMD has done recently; that title goes to the 6500 XT that was revealed two years ago at CES 2022. In case you don't quite recall why, the company launched the GPU for $199 (equivalent to around $130 nowadays as it was during the period of chip shortage when everything was expensive), and it lacked AV1 decode and had no encoder either. What was even worse was the fact that this GPU only had four PCI Express (PCIe) lanes (x4) which meant it struggled to perform well on anything that was not PCIe Gen4. And since it only had 4GB of VRAM, graphics assets like textures would often saturate the frame buffer and spill over which in turn led to stuttering or generally lowered fps output as the GPU tried to access the system RAM via the narrow PCIe bus in order to store the assets. AMD later launched an 8GB variant to mitigate the issues but it has rarely been seen in the wild. Here's how the 6500 XT 4GB performs in modern AAA titles: To put a final death nail to the RX 6500 XT's coffin, Nvidia is purportedly soon going to release a 6GB variant of the RTX 3050. It won't however be as powerful as its original 8GB counterpart since the 3050 6GB will allegedly have 10% fewer CUDA cores (2340 vs 2560) and 33% less bandwidth (168 vs 224 GB/s) as a result of the reduced memory interface (96-bit vs 128-bit). While these are big reductions, the 8GB 3050 is around 30-35% faster than the 6500 XT in rasterization and twice as fast at ray tracing (on PCIe 4.0), which means the upcoming 3050 6Gig should be fairly close in performance to the AMD card and the 3050 6GB should perform better on a PCIe 3.0 board since the Nvidia card is supposed to be PCIe x8. In addition to that, the upcoming entry-level GeForce GPU will have AV1 decoding as well as encoders. And the TGP also apparently comes down to 70W which means no PCIe power connector may be necessary. Source: VideoCardz Sayan Sen\n                                                ·\n                    \nOct 3, 2022\n\nwith\n9\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nSep 21, 2022\n\nwith\n13\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nSep 7, 2022\n\nwith\n7\n                            comment\n                                s Sayan Sen\n                                                ·\n                    \nAug 15, 2022\n\nwith\n3\n                            comment\n                                s Login or Sign Up to read and post a comment. Please enter your reason for reporting this comment. blackview bl8000 horizon forbidden west windows 11 insider preview promo microsoft weekly twirl 158 windows 11 insider preview promo windows 11 moment 5 dragons dogma 2 task manager notepad © Since 2000 Neowin®\n                                    All trademarks mentioned are the property of their respective owners. "
}