{
    "title": "Where Will AMD Stock Be in 3 Years?",
    "date": "1/29/2024",
    "url": "https://www.fool.com/investing/2024/01/29/where-will-amd-stock-be-in-three-years/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More With shares up by over 20% year to date, Advanced Micro Devices (AMD 0.50%) stock has hit the ground running in 2024. The move is likely due to optimism surrounding its new Ml300x chips for training generative artificial intelligence (AI) platforms, which could boost near-term revenue and profits. But what could the long-term hold? Let's explore how this exciting chipmaker may perform over the next three years. On the surface, AMD's meteoric rise in 2023 and 2024 may seem confusing. After all, third-quarter revenue only increased by a measly 4% year over year (to $5.8 billion), and the company's core business of selling central processing units (CPUs) for PCs and laptops isn't exactly a red-hot industry. But now, AMD's valuation and future seem to rest on something new: AI chips. In 2023, AMD announced its much-anticipated Ml300x family of graphics processing units (GPUs) designed to help data-center clients train and run AI applications. It is unclear how much revenue the new products will generate. But AMD has already secured high-profile clients like Microsoft and Oracle, and its CEO Lisa Su expects AI chips to add a $400 million boost to fourth-quarter sales, rising to more than $2 billion in 2024. To be fair, that isn't much. To put things in perspective, over the last 12 months, AMD generated sales of $22.11 billion. And holding everything constant, the new AI chips would only grow this figure by a measly 9% annually, which doesn't seem to justify the stock's recent rally. But the bigger story could play out over the coming years. In the medium term, AMD is hugely optimistic about the future of the AI hardware opportunity. CEO Lisa Su expects the $45 billion addressable market to rise to $400 billion by 2027. If these projections hold, and the company can maintain a market share of just 5%, its new chips could add a whopping $20 billion to its top line in just three years. These numbers might sound outrageous on the surface. But as the CEO of a major tech company, Su probably didn't pull her projections out of thin air. The estimates look even more believable in light of the recent performance of AMD's main rival, Nvidia, which saw AI-related demand push its data-center chip sales up 206% year over year to $18.12 billion in just Q3. If AMD's data-center business can start scaling at a similar rate, it wouldn't be surprising if total revenue doubled by 2027. Image source: Getty Images. Investors should also pay close attention to AMD's efforts in other parts of the AI ecosystem, such as automobiles. This month, the company announced new devices in its Versal AI Edge series designed to help car companies with self-driving technology. While vehicle automation is still in a nascent stage, the business could become an increasingly important part of AMD's AI-related revenue over the coming years. AMD remains a solid pick for investors who want to bet on the long-term future of generative AI and other aspects of AI technology that could rise to prominence over the coming years. However, investors should remember they pay a significant premium for its stock. With a forward price-to-earnings (P/E) ratio of 47.6, AMD's shares are significantly pricier than the NASDAQ 100 average of 29. And that means the company doesn't have much room to disappoint in 2024 and beyond.  Will Ebiefung has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Microsoft, and Oracle. The Motley Fool recommends Nasdaq. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}