{
    "title": null,
    "date": "1/25/2024",
    "url": "https://www.notebookcheck.net/Lenovo-ThinkPad-P16s-G2-AMD-review-Power-plus-OLED-inside-this-workstation-laptop.796559.0.html",
    "text": "While an additional security chip, the option to perform remote maintenance and a SmartCard reader may only be of interest to corporate customers, the laptop's power, graphics performance, long runtimes and nice display should pique the interest of the general public. Its powerful AMD Ryzen 7 Pro 7840U processor draws attention in particular. This makes the ThinkPad P16s G2 suitable for working at home, on the go, at uni or even for creatives. Furthermore, an OLED display didn't have to be installed and its RAM and SSD offer a good range of configuration options for almost every field of use. In turn, its visuals could be described as rather conservative, but this doesn't have to be a negative point. At the same time, comparable competitors such as the Microsoft Surface Laptop Studio 2 or the HP EliteBook 845 G10 have slightly braver designs. Our review will show whether these are better or worse or simply just different, and whether the ThinkPad P16s G2 still has room to grow.  Textured surface, dark gray case: The ThinkPad visuals can be identified from a mile away. And as always, the dot above the \"I\" is illuminated. This doesn't appear sleek and by no means is it modern. Instead, it feels robust and durable. Tight hinges that hold the 16-inch display at any angle and a lid that closes almost seamlessly further cement this high-quality and stable impression—even without there being any metal components on the outer case. Naturally, the relatively large display can be twisted ever so slightly. The base, on the other hand, remains totally stable in every situation. We also couldn't elicit any noises from the case. After all, it is a work laptop that won't always be handled with care. The device's size and weight show where the stability comes from. For a laptop without a dedicated graphics card that is made completely from plastic, 1.8 kg is certainly noteworthy. Even more so is its case thickness, which measures in at almost 24 millimetres. The almost identically configured Acer Swift Edge SFE16 is about half as thick and weighs 500 grams less. In turn, it does feel a little more fragile than the ThinkPad P16s. Plus, a thick case has a few more advantages, which we will talk about in the \"performance\" section. The laptop's selection of connectivity options seems to be good in general. It features a full-sized LAN port without a flap or an adapter. There's a fast USB-4 port and a total of four flexible USB ports, allowing you plenty of options for peripherals. An HMDI port is also installed. On the other hand, only one USB-4 port isn't optimal. You would usually have the docking station connected to this in order to access the laptop's full performance. The second USB-C port at least supports charging as well as DisplayPort—but only at a quarter of the transfer speeds that USB 4 can achieve. Moreover,  the other two USB ports could also do with being a little faster. They are both connected via USB 3.0, which a lot of SSDs now easily surpass. Connected to the docking station while sitting on your desk, these small flaws shouldn't be too noticeable. But many of Intel's high-end laptops offer better connectivity options. This typically includes two TB4 ports. However, fast USB-A ports aren't common here either. The device's transfer rates are a little weak when it comes to sending, at 5 GHz as well as 6 GHz. However, its receive rates are as expected for Wi-Fi 6E. This is a lot better than a simple LAN cable can offer. Plus, thanks to its frequency range being expanded, you should still be able to achieve a high transfer rate with overlapping wireless networks. Its 5 MP alone ensure good picture quality, meaning people on the other end of your video call on a smartphone won't likely be able to tell that you are using a laptop's webcam—quite unlike the HD webcams that are so often installed which offer a fraction of the resolution. The very high color deviations which we measured come as a result of the pictures being automatically lightened. And this works really well. Even in low-light conditions, faces remain recognizable. At the same time, the image quickly gets quite grainy. Even so, the camera in its present form is perfectly suitable for video conference calls. This is not least due to its great dual-array microphone which records voices very accurately and at a consistent volume—even when your distance and direction of speech vary during the conversation. An IR sensor makes facial recognition via Windows Hello possible and a mechanical cover to block the lens rounds out the webcam's features. You shouldn't be missing any security functions. Everything is included, from a SmartCard to a Kensington lock and biometric sign-in features. You can either use the fingerprint sensor or facial recognition for this. Adding to this are extras such as a self-recovering BIOS. Lenovo has summarized all these functions under the term \"ThinkShield\". Further information can be found here. The laptop doesn't come with any additional adapters, a case or anything else of the sort. Instead, only a simple USB-C power supply is included. On a positive note, the ThinkPad's packaging is made entirely of recycled cardboard. As expected, the ThinkPad P16s G2 AMD can be opened up easily and without any problems. All the Phillips screws are easily accessible. Subsequently, you can remove the bottom case part with enough patience and force (but without needing to tug at it violently)—and ideally with the help of a small lifting tool. Its NVMe-M.2 SSD can be swapped out. The battery and fans can be accessed without any issues. Furthermore, you can install a 5G/LTE module into the case. There is space for this, the antenna cables are ready to be used and a SIM card slot is situated on the back. Unfortunately, the WLAN and RAM modules have been soldered on. You would especially wish for the RAM to be a little more flexible in a workstation laptop. This means when purchasing, you should just be very clear about whether you might want to select too much RAM rather than too little. Lenovo offers one year of premium support which also covers on-site repairs by the next working day. For a surcharge, there are options to extend this warranty. The keyboard, touchpad and trackpoint deserve praise. Satisfying pressure points, comfortable key resistance and precise inputs all make for smooth, speedy operation. You shouldn't likely have to deal with fatigue when typing or having to triple-click when controlling the pointer. In addition, the keyboard's backlighting, which has two brightness levels, keeps the keys legible at all times. Although, it can't escape all criticism. Its lift of 1.5 mm (our measurement) isn't terribly big and you definitely notice this while typing if you are used to a much higher lift. Plus, the keyboard frame which—like all of the case's other components—is made from plastic has a little bit of give. You notice this on the right side more than on the left. You do, however, get used to this and these issues shouldn't really get in the way. It does mean that we can't give it top marks, though. The installed OLED display shouldn't just be interesting for creative work. Although its 4K resolution which, in theory, covers the color space Display P3 in its entirety and assures strong contrast and color accuracy, is clearly a good start for demanding graphics applications. Even just in general, content looks intense and radiant on the laptop's screen. Text being shown slightly uncleanly at times is made up for by its extremely high resolution. The subpixels not being evenly structured sometimes results in blurred edges. Enlarging text by the recommended value of 175 % leads to this not being noticeable. You do have to take into account its reflective surface when it comes to the display's accurate color depiction—this isn't ideal when using the device outside. Inside, the screen's high contrast levels make up for this. Moreover, the OLED display uses a type of pulse width modulation. It is by no means as aggressive as on quite a few older LCD monitors. However, you might notice it ever so slightly, as the frequency we measured at high brightness showed only 60 Hz. For sensitive users, we would recommend one of the many other display options which use IPS panels and, in turn, don't use PWM: * ... smaller is better The OLED display is as generous as expected when it comes to color depiction. It completely covers Display-P3, a color space which is used for professional video productions. It only doesn't quite cover AdobeRGB in its entirety. When measuring the screen's color accuracy, we noted values beneath what is perceptible by the naked eye—even when it came to the highest deviations. On average, the deviations were even smaller. This means colors are depicted with almost perfect accuracy. The display backlight flickers at 60 Hz (worst case, e.g., utilizing PWM) . The frequency of 60 Hz is very low, so the flickering may cause eyestrain and headaches after extended use. In comparison: 53 % of all tested devices do not use PWM to dim the display. If PWM was detected, an average of 18015 (minimum: 5 - maximum: 3846000) Hz was measured. The high contrast levels and brightness of over 400 cd/m² ensure that content remains legible even outdoors. However, you should seek out a shaded spot, as reflections might otherwise get in the way. Colors and brightness always remain the same, almost regardless of the viewing angle. Color distortions which are typical of OLED displays only occur at more than 80 degrees. The AMD Ryzen 7 Pro 7840U is the powerhouse of the ThinkPads P16s G2, together with its Radeon 780M iGPU. This combination not only results in astounding computing power but also creates strong graphics performance—at least for an integrated GPU. The system's efficiency needn't shy away, either. Furthermore, you also have the option to select the smaller AMD Ryzen 5 Pro 7540U with the Radeon 740M. In addition to its high performance for a mobile system, the Pro series also features a security chip and lots of remote maintenance options, which are particularly useful for fleet use. Moreover, you can choose between three RAM sizes, namely 16, 32 or 64 GB at 6,400 MHz. They are soldered on, meaning they can't be swapped out or expanded. The three familiar Windows performance modes highest performance, balanced and highest energy-saving are available. Using the supplied software \"Lenovo Commercial Vantage\", the performance is always set to the highest setting. Even using the low setting, the CPU's power consumption remains quite high. We performed all our tests using the mode highest performance. On the other hand, if you select balanced mode, the laptop's computing power is reduced slightly. However, you shouldn't notice this when booting up applications, surfing the web or during most other day-to-day tasks. In turn, the fan noise only sinks by a small amount but even using highest-performance mode, it never truly gets in the way. As expected, its performance sinks further using energy-saving mode. At the same time, its computing speeds remain quite high, while starting programs leads to a slight delay. Plus, the fans remain considerably quieter with this mode selected. If you disconnect the device from the mains, the settings switch to balanced. However, they can be changed back to maximum right away. As a result, you have access to the laptop's highest performance even in battery mode. The following table shows how exactly the power limits change: As expected, the AMD Ryzen 7 Pro 7840U processor, which is additionally fine-tuned for efficiency, delivers very high performance rates. It is one of the most powerful mobile CPUs. With a total of 16 threads and a maximum clock rate above 5 GHz, it always has plenty of reserves for multitasking and complex uses—as you would expect from a workstation laptop. Its maximum power supply of 51 watts is appropriate for a 16-inch model and it evens out at 41 watts over a longer period of time. The 14-inch ThinkPad P14s G4 with an identical CPU has access to 20 per cent less power, for example, and did correspondingly worse in the CPU benchmarks. But even the AMD Ryzen 9 Pro 7940HS within the HP EliteBook 845 G10, which is better on paper, could only keep up. The Intel Core i7-13700H is also on a similar level but inside the Microsoft Surface Laptop Studio 2, for example, it did worse under permanent load. Moreover, the i7-13700H's power consumption is much higher. As a result, our test device made a very good total impression throughout all the tests, delivering above-average results with moderate power consumption values. AMD's CPU does extremely well inside the ThinkPad P16s G2. You can find further benchmarks in our CPU benchmark list. * ... smaller is better * ... smaller is better The ThinkPad P16s G2's general system performance is at a very high level. It clearly surpassed the Schenker Vision 16 with an i7-13700H, for example. And even a better-configured Lenovo ThinkPad P16v with a dedicated graphics card was only a few percentage points ahead. This means the P16s G2 AMD's handling is accordingly smooth—almost independent of the current load. Even with benchmarks running in the background, the laptop can still be operated well and it reacts quickly. You can use a number of programs at the same time and installation processes or complex tasks can be completed in no time. * ... smaller is better * ... smaller is better Its LatencyMon results weren't totally up to scratch. At least real-time audio editing could pose some issues for the device. It is interesting to note that the DirectX driver programs in particular led to some issues. An update would most likely solve a few of those. In general, the results could easily be changed in both directions through updated drivers or new software. Its video-streaming results leave a similar amount of room for improvement. The 15 dropped frames are simply too many and a GPU load of 50 % shows that the graphics driver hasn't been tuned ideally as of yet (during our test, the current driver status was from 01/2024). * ... smaller is better The laptop's elaborate cooling with a large copper plate really paid off during our continuous test. Its sequential write performance remained completely stable and high over a long period of time. The M.2-SSD from SK Hynix can't handle large quantities of small files well with lots of parallel accesses. However, this should only have a small negative effect when booting up. In normal use, this shouldn't have a noticeable impact. * ... smaller is better Of course, you shouldn't expect too much from an iGPU, although the AMD Radeon 780M did generally well. Even without its own RAM and with limited hardware and power supply, it was about on the same level as an RTX 2050 Mobile. Its distance to the Nvidia RTX A1000 or the RTX 3050 also wasn't too large. The ThinkPad P16s G2 AMD did accordingly well in the SPECviewperf benchmark, which gives us an insight into how it performs using professional graphics software. Here, the Nvidia T550 could clearly be kept at a distance. And although the RTX A1000 came about 50 % ahead, it requires a lot more power, more space and workstation laptops such as a Dell Precision 5470 are also a lot more expensive. Other iGPUs such as the Intel Iris Xe Graphics G7 96EUs are a lot weaker and its predecessor, the Radeon 680M, also remained far behind when it came to graphics performance. Further measurements, tests and ratings can be found in our GPU benchmark list. Gaming is by no means one of the P16s' core strengths. Even so, the ThinkPad proved to be able to play most games well with its integrated graphics unit. Even the relatively current F1 23 can be run at Full HD and with high details. Complex games such as Starfield and in general high resolutions and maximum details quickly show where the iGPU's limits lie. In particular, its external video memory is then no longer sufficient. Using the highest detail setting, the continuous test using The Witcher 3 ran completely smoothly and without any nasty surprises. This means its good graphics performance remains available over longer periods of time as well. Compared to the smaller ThinkPad P14s G4, the same-sized fan within the present ThinkPad P16s G2 has to tackle a lot more heat. At the same time, it even has to overcome a small distance to the outside. This isn't ideal, but was most likely done to save some money. This means the device's noise emissions are quite a bit more intense during high load, we would estimate them to be about twice as loud as the P14s G4. We measured maximum noise emissions of 40 dB, which is nothing to worry about. Furthermore, the P16s offers a bit more performance compared to the P14s G4 featuring the same CPU. A larger or better-positioned fan could've resulted in considerably better results. A positive, on the other hand, is how it behaves during very simple tasks. Then the fan remains completely silent. Noise Level * ... smaller is better Even without the fans being active, the laptop only heats up minimally. This is the case as long as you are surfing the web, streaming, carrying out office work or anything similar. At no point does the case reach 30 °C in these scenarios. On the flip side, the case gets quite a bit warmer as soon as heat has to be dissipated from the processor. We measured over 40 °C on the keyboard and even over 47 °C on the bottom. This means it might get a little uncomfortable to use under full load. * ... smaller is better If the CPU and iGPU are completely loaded using Prime95 and FurMark, its power supply remains stable, with 41 watts being given to the processor. When switching the performance mode, the parameters adjust smoothly. The graphics unit can be fully utilized at the same time, across the different power settings. The fan becomes a little quieter the more the maximum power supply is throttled. The processor temperature which we measured only hit 90 °C for a short while under full load. With the most power being saved, temperatures remained at 65 °C despite the lower fan volume. Nothing stands in the way of being able to utilize the system at all times. The speakers are weak—they are missing bass. Even the low mids are barely prominent and their maximum volume could do with being louder. In addition, they are missing some detail, although voices do generally sound good, even during complex songs. They are good enough for video calls, background music or the occasional streaming. We wouldn't expect anything better from simple laptop speakers, especially ones in a workstation. (±) | speaker loudness is average but good (76.2 dB)Bass 100 - 315 Hz(-) | nearly no bass - on average 26.5% lower than median(±) | linearity of bass is average (12.3% delta to prev. frequency)Mids 400 - 2000 Hz(+) | balanced mids - only 3.9% away from median(+) | mids are linear (6.9% delta to prev. frequency)Highs 2 - 16 kHz(+) | balanced highs - only 3.5% away from median(+) | highs are linear (4.8% delta to prev. frequency)Overall 100 - 16.000 Hz(±) | linearity of overall sound is average (21.3% difference to median)Compared to same class» 72% of all tested devices in this class were better, 6% similar, 22% worse» The best had a delta of 7%, average was 18%, worst was 35%Compared to all devices tested» 54% of all tested devices were better, 7% similar, 39% worse» The best had a delta of 4%, average was 25%, worst was 134% (+) | speakers can play relatively loud (84.7 dB)Bass 100 - 315 Hz(+) | good bass - only 3.8% away from median(+) | bass is linear (5.2% delta to prev. frequency)Mids 400 - 2000 Hz(+) | balanced mids - only 1.3% away from median(+) | mids are linear (2.1% delta to prev. frequency)Highs 2 - 16 kHz(+) | balanced highs - only 1.9% away from median(+) | highs are linear (2.7% delta to prev. frequency)Overall 100 - 16.000 Hz(+) | overall sound is linear (4.6% difference to median)Compared to same class» 0% of all tested devices in this class were better, 0% similar, 100% worse» The best had a delta of 5%, average was 18%, worst was 45%Compared to all devices tested» 0% of all tested devices were better, 0% similar, 100% worse» The best had a delta of 4%, average was 25%, worst was 134% Due to the system's permanent high power consumption, the measly 65-watt power supply could reach its limit when the most is demanded from the hardware. However, the 68 watts which we measured should be made available without any big issues. Still, it doesn't have a buffer to charge the laptop. If it only has half a charge, then this will remain the case until the CPU and GPU require less power. At the same time, we didn't register any unwanted discharging during the stress test. A larger 90-watt power surely would've been the better choice for the ThinkPad P16s G2 AMD. * ... smaller is better The AMD Ryzen 7 Pro 7840U's high efficiency is somewhat dampened by the laptop's OLED display. Its good runtimes are largely due to the battery's large 84 Wh capacity and not because it is frugal under low load. Its runtimes of over 13 hours and 10 hours (web surfing test) mean you can use the laptop on the go with no issues whatsoever. However, this is only the case when the brightness is reduced. In our test, this was set to around 60 %. At full brightness, on the other hand, the OLED display requires significantly more power, leading to web surfing draining the battery in less than 7 hours. With a different display, for example the one in the very similar ThinkPad P14s G4, it is possible to open websites continuously for over 11 hours—with a significantly smaller 52-Wh battery. Carefully extrapolated, the P16s G2 with the IPS panel and average color depiction should then be able to be used for 16 hours of surfing. The ThinkPad P16s G2 AMD features an unusually large variety of potential uses. The CPU's high performance paired with its good Radeon 780M iGPU allows for professional use—even for more graphically demanding tasks. This may not be quite as speedy as on a device with a dedicated graphics card, however, the workstation laptop has other things to offer. The fans are often quiet or remain completely deactivated and despite the OLED display's power-hungry nature, it delivers decent runtimes. Furthermore, its price is okay when you consider its performance capabilities. All this results in brilliant, contrast-rich images, allowing you to use the laptop for creative tasks. On the other hand, its portability could sure benefit from a slightly less elaborate display. Lots of power, usually enough graphics performance and decent connectivity make the P16s G2 AMD an excellent laptop for work, uni or creative jobs. Moreover, the device boasts a plethora of security features and its remote maintenance function could come in really handy for company devices. Its robust case and good keyboard also make it a great work laptop. In turn, its criticism isn't the harshest. Of course, a second USB4 port would be handy. The fans could be a little more efficient, especially when you consider how much space isn't being used on the inside. In addition, the power delivered via its power supply may be a little tight, but it shouldn't cause any severe limitations. An alternative featuring additional graphics performance could be the Lenovo ThinkPad P16v G1, for example. Better portability and slightly less performance are offered by the very similar Lenovo ThinkPad P14s G4 AMD—its 14-inch display may make it better suited to being used on the go. The version of the ThinkPad P16s G2 with 64 GB RAM and an OLED display can be found for US$1,599 on Amazon. Lenovo ThinkPad P16s G2 21K9000CGE\n- 2024-01-23\n01/23/2024  v7\n\nMario Petzold The present review sample was made available to the author as a loan by the manufacturer or a shop for the purposes of review. The lender had no influence on this review, nor did the manufacturer receive a copy of this review before publication. There was no obligation to publish this review.  "
}