{
    "title": "AYANEO AM02 Retro Mini PC Themed After Nintendo NES Officially Launches: \nAMD Ryzen 7 7840HS & Starting at $499",
    "date": "1/18/2024",
    "url": "https://wccftech.com/ayaneo-am02-retro-mini-pc-nintendo-nes-theme-launch-amd-ryzen-7-7840hs-499-usd/",
    "text": "AYANEO has officially launched its AM02 Retro Mini PC which packs an AMD Ryzen 7 7840HS APU in a retro-themed design starting at $499 US. The AYANEO AM01 and AM02 are two Mini PCs that are themed after the Retro consoles and PCs era. While the AM01 was themed after the Apple Macintosh, the AM02 was themed after the NES by Nintendo. It's much much smaller than the NES but shares a familiar design with a touch of the future. The case is a 0.9-liter design with three I/O ports hidden underneath the front flip cover and it supports wall-mounting. The shroud of the AM02 includes a touch panel LCD that measures 4\" and has loads of functions such as displaying real-time hardware metrics, letting you adjust the TDP on the go, adjusting volume & setting up animations amongst a wide list of other functions. The AM02 is powered by AMD's Ryzen 7 7840HS, a very popular choice amongst the handheld and Mini PC segment. This APU offers 8 cores, 16 threads, up to 5.1 GHz clocks, and a TDP of 35W which can be adjusted up to 54W. The APU is configured with a AMD Radeon 780M iGPU which offers 12 Compute units clocked at 2700 MHz. The RDNA 3 graphics architecture supports all the latest tech features such as FSR 3 and AFMF which should bring a decent gaming experience to this small yet interesting device. The company states that the integrated graphics solution should be enough to handle all of the latest AAA titles at 1080p with a mix of low and medium settings. Using upscaling can allow you to get even better performance and quality. A demo was shown with the AM02 Mini PC playing Lies of P at 1080p smoothly. To cool the system, AYANEO is using a four-copper tube cooling system that sits right over the AMD APU and is cooled by a large blower fan that pushes air out of the exhaust vents on the AM02 console. The Mini PC has a total of 68,105mm2 worth of aluminum cooling real estate and the fan can be adjusted in real-time based on your preferences through the AYASpace menu. Besides this, the AM02 also features support for up to 64 GB of DDR5-5600 SO-DIMM memory (two modules), a single PCIe Gen4 M.2 SSD with up to 8 TB capacities and 7 GB/s speeds, comes with dual 2.5 GbE LAN ports, WIFI 6E + BT 5.2 support, houses USB4 ports along with DP1.4 and HDMI 2.1 interfaces and is powered by the standard 12V adapter. In terms of pricing, AYANEO has set the baseline price for the barebone AM02 Mini PC at $499 US which can be obtained at an early bird pricing of $439 US. Following are the prices of the rest of the configurations: Configurations come in up to 32 GB DDR5 memory capacities and up to 1 TB SSD storage capacities but do note that both of these can be expanded by the users. According to AYANEO, the first AM02 Mini PCs are expected to be shipped by the end of February, globally.  Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}