{
    "title": "Tests reveal that AMD's Ryzen 7 5700 is actually slower than the Ryzen 5 \n5600",
    "date": "2/8/2024",
    "url": "https://www.notebookcheck.net/Tests-reveal-that-AMD-s-Ryzen-7-5700-is-actually-slower-than-the-Ryzen-5-5600.801718.0.html",
    "text": "Hardware Unboxed reports that buyers should be aware of AMD’s “anti-consumer” practices with some of its lower-end processors. The well-known YouTube hardware review channel recently tested the new Ryzen 7 5700X3D, along with the more elusive R7 5700G and the R7 5700 non-X model that is essentially binned silicon repackaged as a new product. While we would expect the non-X version to get a slight core clock reduction from the X variant, AMD actually bases the non-X on the R7 5700G that is derived from the mobile Ryzen 7 5800H version. Consequently, unlike the X version that has 32 MB L3 cache, the non-X one comes with only 16 MB L3 cache, significantly lagging behind. On top of that, the non-X only supports PCIe 3.0 specs. With the Ryzen 3000 lineup, AMD started selling most lower-end non-X CPUs directly to OEMs. This also applied to the R7 5700 that was available to OEMs beginning with April 2022, but last December, AMD decided to release this specific model to retail as well. As of now, the R7 5700 is available for $175 including a CPU cooler, while the R7 5700X sells for $180 without a cooler on Amazon. Granted, the R7 5700 would probably be $155 without the cooler, but prospective buyers who might think this is a good deal need to consider the performance differences. From the game tests presented by Hardware Unboxed, the R7 5700 is overall 16% slower in average fps and 19% slower in 1% low fps, with some games showing up to 40% slowdown in 1% lows. However, the R5 5600 that currently retails for $134.99 also appears overall slightly faster than the R7 5700 because it too has 32 MB L3 cache like the R7 5700X, so it clearly is a better deal, even though it does not come with a cooler. The main takeaway from this review is that the R7 5700 is not named properly, arguably mispriced and could mislead buyers expecting just a slight difference from the X variant. Hardware Unboxed suggests that AMD should have released this model as the R7 5700GF to better reflect its mobile origins. Hardware Unboxed "
}