{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.tweaktown.com/news/96210/amd-ryzen-8000g-hawk-point-apus-now-supported-in-master-tuning-utility/index.html",
    "text": "Ryzen Master Tuning Utility now supports AMD's new Ryzen 8000G \"Hawk Point\" APUs, thanks to its new update that you can download here (206MB download). AMD Ryzen Master software (source: AMD) AMD's internal Ryzen Master software has been updated to v2.13.0.2908 and supports the just-released Ryzen 8000G \"Hawk Point\" series APUs, which can also be overclocked (even though they're APUs and not pure CPUs). The new Ryzen Software update doesn't just support the new Hawk Point APUs but also has a new feature that makes using the software easier for consumers. AMD's Curve Optimizer is a utility inside of Ryzen Master that lets consumers play around with performance by tuning the exact amount of power being fed into the chip. This allows users to directly tweak their CPU voltages without annoying system restarts, as they can all be done within the operating system. You can also tweak the curve to get what you prefer: performance, cooling, or higher efficiency. AMD processors are fantastic at being undervolted, which is something people will want to play with if they've got a new Ryzen 8000G \"Hawk Point\" APU. AMD says its release highlights for the new Ryzen Master v2.13.0.2098 software are: Anthony Garreffa Anthony joined the TweakTown team in 2010 and has since reviewed 100s of graphics cards. Anthony is a long time PC enthusiast with a passion of hate for games built around consoles. FPS gaming since the pre-Quake days, where you were insulted if you used a mouse to aim, he has been addicted to gaming and hardware ever since. Working in IT retail for 10 years gave him great experience with custom-built PCs. His addiction to GPU tech is unwavering and has recently taken a keen interest in artificial intelligence (AI) hardware. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}