{
    "title": "Telstra collaborates with Ericsson and AMD to make its 5G core functions \n‘more efficient’",
    "date": "2/12/2024",
    "url": "https://itwire.com/business-telecoms/telstra-collaborates-with-ericsson-and-amd-to-make-its-5g-core-functions-%E2%80%98more-efficient%E2%80%99.html",
    "text": "Telecommunications company Telstra and Swedish telco vendor Ericsson have deployed Advanced Micro Devices (AMD) microprocessors for Ericsson’s bare metal cloud environment, known as cloud native infrastructure solution (CNIS), to deliver energy efficiency for Telstra’s 5G core functions. The deployment will see both companies leverage high core densities AMD Genoa processors, representing 4th generation of AMD’s EPYC family of server processors, on a closed loop liquid-cooled server system, powered by Hewlett Packard Enterprise (HPE). The combination of AMD’s processors with HPE’s closed-loop liquid cooling system reduces overall cooling requirement of the system compared to traditional air cooling, claimed the companies. Telstra and Ericsson used the new hardware to host containerised workloads for Ericsson’s Packet Core Gateway and Packet Core Controller applications.  In addition to delivering a liquid-cooled server and processor technology, Telstra and Ericsson also worked to improve Telstra’s infrastructure footprint by devising power management features and solutions with radio access network. Ericsson’s CNIS solution and packet core gateway and core controller demonstrated up to 49% less energy consumption. “Our latest deployment of Ericsson 5G Core functions using next-generation AMD processors on liquid-cooled infrastructure has the potential to deliver a step-change in performance and efficiency — one that will benefit individuals and businesses throughout Australia. Perhaps most importantly, this new milestone provides us with tangible progress towards contributing to achieving our T25 climate goals,” said Telstra executive network applications and cloud Shailin Sehgal. “This technology is an important milestone for delivering greater sustainability for the 5G mobile telecommunications infrastructure that millions of Australians rely on every day,” said Ericsson head ANZ Emilio Romeo.   REGISTER HERE! PROMOTE YOUR WEBINAR ON ITWIRE\nIt's all about Webinars.\nMarketing budgets are now focused on Webinars combined with Lead Generation.\nIf you wish to promote a Webinar we recommend at least a 3 to 4 week campaign prior to your event.\nThe iTWire campaign will include extensive adverts on our News Site itwire.com and prominent Newsletter promotion https://itwire.com/itwire-update.html and Promotional News & Editorial. Plus a video interview of the key speaker on iTWire TV https://www.youtube.com/c/iTWireTV/videos which will be used in Promotional Posts on the iTWire Home Page.\nNow we are coming out of Lockdown iTWire will be focussed to assisting with your webinars and campaigns and assistance via part payments and extended terms, a Webinar Business Booster Pack and other supportive programs. We can also create your adverts and written content plus coordinate your video interview.\r\nWe look forward to discussing your campaign goals with you. Please click the button below.\nMORE INFO HERE! MORE INFO HERE!  Kenn Anthony Mendoza is the newest member of the iTWire team. Kenn is also a contributing writer for South China Morning Post Style, and has written stories on Korean entertainment, Asian and European royalty, Millionaires and Billionaires, and LGBTQIA+ issues. He has been published in Philippine newspapers, magazines, and online sites: Tatler Philippines, Manila Bulletin, CNN Philippines Life, Philippine Star, Manila Times, and The Daily Tribune. Kenn now covers all aspects of technology news for iTWire.com. Kenn Anthony Mendoza is the newest member of the iTWire team. Kenn is also a contributing writer for South China Morning Post Style, and has written stories on Korean entertainment, Asian and European royalty, Millionaires and Billionaires, and LGBTQIA+ issues. He has been published in Philippine newspapers, magazines, and online sites: Tatler Philippines, Manila Bulletin, CNN Philippines Life, Philippine Star, Manila Times, and The Daily Tribune. Kenn now covers all aspects of technology news for iTWire.com.    "
}