{
    "title": "Early Snapdragon X Elite benchmark shows Arm CPU is faster than AMD's \ntop-end mobile APU",
    "date": "2/25/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/early-snapdragon-x-elite-benchmark-shows-arm-cpu-is-faster-than-amds-top-end-mobile-apu",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The Snapdragon X Elite is fast. A leaked Geekbench 6 result for the Snapdragon X Elite shows the Qualcomm CPU performing better than the Ryzen 9 7940HS - AMD's flagship laptop APU. The Snapdragon X Elite was faster in both the single- and multi-core scores. If genuine, these scores indicate that the upcoming Arm-based CPU will be more than a match for x86 silicon in laptops and maybe even desktop PCs. The leaked result apparently came from a test run on a \"Qualcomm ZH-WXX\" PC, which is presumably the name of a reference PC for the Snapdragon X Elite. It's hard to say if this reference PC shows performance consistent with what the final product is expected to have, however. The Snapdragon X Elite is highly anticipated as it should be Qualcomm's fastest Arm chip ever, featuring 12 Oryon cores developed by Nuvia, which Qualcomm acquired in January 2021. The CPU is fabbed on TSMC's 4nm node and can boost to 4.3 GHz on two cores, with the other cores being limited to 3.8 GHz. On paper, the CPU doesn't seem like it would lead the competition, since both AMD and Intel's top mobile offerings can break 5 GHz and come with more threads, and more cores in Intel's case too. Despite its on-paper specifications, the Snapdragon X Elite is able to exceed the performance of AMD's Ryzen 9 7940HS APU, which is AMD's top-end mobility-focused APU. Of course, AMD also has its 7045-series APUs, which are basically Ryzen 7000 desktop chips ported to a laptop form factor. The flagship Ryzen 9 7945HX beats the Snapdragon here, but not by a huge margin. The Snapdragon could even be a potent desktop CPU if Qualcomm wishes, as it was able to match the Ryzen 5 7600 in multi-core performance and come within striking distance of its single-core performance. To be clear, the Snapdragon X Elite probably won't be competing with the likes of the Ryzen 9 7950X or Intel's Core i9-14900K, but it would nevertheless be one of two other CPUs in the world able to compete with midrange x86 chips (the other being Apple's M3). Of course, there's one important question: is this benchmark legit? A couple of areas in the Geekbench 6 results are a little weird, with the reported base CPU clock speed being 4.01 GHz rather than 3.8 GHz and there being two CPU clusters of eight and four cores each, which is strange though it does at up to 12. Despite these oddities, there's good reason to believe this benchmark is the real deal. Searching \"Qualcomm Oryon\" on Geekbench 6 will show you tons of other results for what is ostensibly the Snapdragon X Elite, including six Windows results tested on the Qualcomm ZH-WXX PC, such as the one we just looked at. The scores were all pretty consistent too, which is one point that indicates the result's authenticity. The earliest result for Windows was done on October 31, which incidentally was just after Qualcomm hosted a press event in late October to preview the performance of the Snapdragon X Elite. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Additionally, at that very same press event, Qualcomm was showcasing the Snapdragon X Elite in Geekbench 6 for Windows. That alone strongly indicates the leaks could be real, but Qualcomm also made hard performance claims for Geekbench 6's Windows version: a single-core score of roughly 2,900 and a multi-core score of about 15,000 per Anandtech. The publicly available scores fall short of those claims, but since this is all pre-launch silicon, there could be several reasons why this is the case, such as a lack of optimization or misconfigured settings. Matthew Connatser is a freelancing writer for Tom's Hardware US. He writes articles about CPUs, GPUs, SSDs, and computers in general. Granite Rapids shows up on CPU-Z boasting 80 cores and 672MB of L3 cache Half of Russian-made chips are defective: Baikal struggles to meet Russia's demand Chinese flash memory maker claims breakthrough - QLC NAND matches endurance of TLC NAND By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Roshan Ashraf ShaikhMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Anton ShilovMarch 27, 2024 By Aaron KlotzMarch 27, 2024 By Anton ShilovMarch 27, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}