{
    "title": "Mixed Fortunes For Tech Giants, Powell Signals No March Interest Rate Cut, \nSpectacular January Jobs Repor",
    "date": "2/2/2024",
    "url": "https://www.benzinga.com/news/earnings/24/02/36917452/mixed-fortunes-for-tech-giants-powell-signals-no-march-interest-rate-cut-spectacular-january-jobs-r",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Wall Street witnessed a stark contrast in tech earnings this week, as Alphabet Inc. GOOGL, Advanced Micro Devices Inc. AMD and Apple Inc. AAPL fell slightly short of expectations, while Meta Platforms Inc. META and Amazon.com Inc. AMZN outperformed, delivering results that exceeded forecasts and offering optimistic outlooks. At the Federal Reserve’s first meeting of the year, interest rates remained unchanged as anticipated, with Fed Chair Jerome Powell dismissing the possibility of a rate reduction in March. The U.S. economy experienced a robust surge in job growth during January, surpassing predictions. AI Giants Mixed Investor confidence in the potential of artificial intelligence suffered a setback in the wake of earnings reports from Microsoft Corp. MSFT, Alphabet and AMD. The decline was attributed to Alphabet’s ad revenue falling short, Microsoft’s value drop after a previous AI-driven high and AMD’s forecast not meeting expectations despite a rise in AI chip sales. Meta's Dividend Debut Meta Platforms, formerly Facebook, announced its first dividend, prompting a 15% stock surge after stellar quarterly results. CEO Mark Zuckerberg declared Meta’s goal to develop the “most popular and most advanced” AI products and services. Amazon’s Robust Quarter Amazon had a remarkable Q4, generating $170 billion in revenue, a 14% YoY growth that outpaced predictions. Earnings per share exceeded expectations, driven by a record-breaking holiday season. This growth was seen across all segments, including AWS, and bodes well for a promising Q1 revenue outlook. Apple’s China Challenge CNBC's Jim Cramer criticized Apple’s “terrible” performance in China, highlighting a significant 12.9% revenue drop despite global successes. This downturn is linked to stiff competition, geopolitical tensions and a tough economic environment, spotlighting challenges for Apple in a key market. Powell Chills Investors Fed Chair Powell indicated a March interest rate cut is unlikely, highlighting the need for sustained achievement of the Fed's 2% inflation target before easing policy. Spectacular Jobs Report January saw a strong jobs report with non-farm payrolls surging by 353,000, the highest in a year, almost doubling expectations. Average hourly earnings grew by 0.6% for the month and 4.5% annually, outperforming predictions. Tesla Recalls Cybertruck Tesla Inc. TSLA’s first-ever Cybertruck recall, part of a larger 2.2-million vehicle callback, addresses a software flaw impacting warning light visibility. This software-related issue will be corrected through an over-the-air update. Now Read: EXCLUSIVE: Regional Banks A Buying Opportunity Amid ‘Ridiculously Cheap Valuations,’ Veteran Value Investor Says Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}