{
    "title": "AMD Ryzen CPUs at risk without this new BIOS fix",
    "date": "2/15/2024",
    "url": "https://www.pcgamesn.com/amd/ryzen-cpu-spi-bios-fix",
    "text": "Four new vulnerabilities have been identified in AMD Ryzen CPUs, but a fix available by downloading a motherboard BIOS update. Edward Chester Published: Feb 15, 2024 AMD has revealed that several of its Ryzen CPUs have vulnerabilities in them that could allow bad actors (and even good actors with coding skills) to gain control of your device or stop you from using it. The company has already fixed the AMD Ryzen vulnerability but you’ll want to act fast to download the latest BIOS for your motherboard to protect you and your system. The issue, which affects the Serial Peripheral Interface (SPI) link between the CPU and the motherboard, doesn’t affect all AMD CPUs but is a problem for some products on our best gaming CPU guide, so most AMD Ryzen CPU users should seek to download the latest BIOS update for their motherboard. The fixes are issued by AMD via its AMD Generic Encapsulated Software Architecture (AGESA), which is software motherboard vendors build into their BIOS/UEFI updates to ensure their boards work properly with AMD’s CPUs. However, while AMD has distributed updated AGESA versions to fix all the vulnerabilities, not all motherboards yet have a user-downloadable BIOS update that includes the AGESA fix. Specifically, all AM5-based boards are seemingly safe already, as are TRX50 and WRX90 motherboards, with the vulnerabilities having already been remedied or not present for those boards/chips. However, investigation by Tom’s Hardware reveals updates for several older boards have been more sporadic. Specifically, no AM4 motherboards appear to yet to offer a BIOS using the very latest AGESA version 1.2.0.C. According to AMD’s AGESA charts that means Ryzen 4000G and 5000G APUs are vulnerable no matter which motherboard you’re using. The slightly more recent AGESA version 1.2.0.B is more broadly available, with every 500 series board from Asus, ASRock, Gigabyte, and MSI being patched. However, many lower-tier 300 and 400 series boards are still on version 1.2.0.A.  Regardless of which combination of CPU, chipset, and specific motherboard you’re using, though, we recommend checking out whether there’s a new BIOS available for your board and updating it anyway. Meanwhile, if you want to cross check exactly whether your system is vulnerable, you can see which AGESA versions are relevant to your CPU on AMD’s website here (example shown above) then you can head to the BIOS download section for your motherboard’s website and check which AGESA version the latest update includes, as shown in the image below.  If you’re sat there with an Intel CPU thinking nothing like this ever happens to Intel CPUs, think again, as that company has also had its fair share of exploits over the years and it’s just as important to keep your Intel motherboard updated too. Edward Chester                 Edward Chester writes hardware reviews and news for PCGamesN. He has reviewed every bit of PC gaming hardware you can think of, and many you probably can't, during his 16 years in the industry. He has been a PC gamer since the mid-90s and still just about manages to find time to indulge in his decades-long passion. Away from playing Apex Legends, Counter-Strike, or Quake, he's an avid cook, musician, gardener, and woodworker. "
}