{
    "title": "Score an AMD Ryzen 9 7900X3D CPU now for its lowest ever price",
    "date": "2/28/2024",
    "url": "https://www.pcgamesn.com/amd/ryzen-9-7900x3d-deal-lowest-price",
    "text": "Armed with 12 cores, 24 threads, and 3D V-Cache technology, this AMD Ryzen processor is an absolute steal, be it for an upgrade or new PC. Samuel Willetts Published: Feb 28, 2024 3D V-Cache technology has proven to be a game changer for processor performance, and now you can grab a CPU with this feature for your own system, the Ryzen 9 7900X3D, at its lowest ever price. Better still, it’s better value right now than its more celebrated, cheaper, sibling. The AMD Ryzen 9 7900X3D falls just short of landing a spot on our best gaming CPU, but this is more to do with its status as the middle child of the 3D V-Cache family as what’s on offer here is still fantastic. In fact, at this limited time price, we’d sooner recommend it over the 7800X3D for some systems. Right now, the 7900X3D can be had for $401.07 via Amazon, well below its list price of $599.00 to the tune of $197.93 (33%). This is the cheapest we’ve ever seen it, and it’s only $37 more expensive than the 7800X3D, making it the better value buy. UK shoppers can get in on this deal too, with the 7900X3D going for £390.23. This makes for an even bigger £229.77 (37%) saving compared to its launch price of £620. The biggest draw for the 7900X3D versus the 7900X is its 128MB of L3 cache, allowing the CPU to make less calls to the system RAM and increase performance, particularly in games. While the frame rate gains vary depending on what you’re playing, this spec allows the likes of the 7800X3D to compete with the Core i9 14900K. While the 7900X3D has more cache than the 7800X3D, it also has more cores and threads at its disposal. Its 12 cores and 24 threads are more beneficial to creative and production workloads, but more compute-heavy games will relish the extra resources at their disposal. Just be aware that the chiplet design of the 7900X3D, which sees its 12 cores spread evenly across two CCDs, can cause some performance oddities in a select few games. This shouldn’t be too noticeable in most titles, but it can create situations in which performance is left on the table. If you subscribe to Amazon Prime, you can have your new CPU arrive at your doorstep much faster with next day delivery. New subscribers can also snag a 30-day free trial, so you won’t have to spend extra right now. Samuel Willetts                 Sam has spent the past two decades tinkering with computers, a tradition he proudly continues as a Hardware Editor for PCGamesN. For all things systems and components, he's your man. You'll regularly find his hands inside a PC, swapping out components from the likes of AMD, Intel, and Nvidia as fast as you can say Windows. Otherwise, you'll find him on the showfloor of CES and Computex, talking the night away about the latest pieces of shiny silicon. You may also know him from outlets such as Custom PC, PC Gamer, Pocket Tactics, T3, and TopTenReviews. "
}