{
    "title": "AMD Zen 5 leak reveals potential launch window",
    "date": "2/19/2024",
    "url": "https://www.pcgamesn.com/amd/zen-5-launch-window",
    "text": "The first batch of desktop Ryzen processors built using the new AMD Zen 5 microarchitecture should be ready to go before the year is out. Samuel Willetts Published: Feb 19, 2024 It may seem hard to believe that AMD debuted its first Zen 4 CPUs almost two years ago now, but it should soon be time for Zen 5 to take center stage. As expected, it shouldn’t be long now until new desktop processors emerge according to a new leak. Right now, AMD sits at the top of our best gaming CPU list. This is in part due to both its Zen 4 microarchitecture and its 3D V-Cache technology, which combine to make the Ryzen 7 7800X3D as excellent as it is. A success story that the company undoubtedly wishes to replicate with its upcoming Zen 5 processors. Whether AMD plans to launch a successor to the Ryzen 7 7800X3D right off the bat remains to be seen, but it seems as if the first Zen 5 chips will enter mass production in Q3 2023. By that metric, we should expect the CPUs to be on store shelves in the same quarter or in Q4. This is according to UDN (via WCCFTech), who also have some finer details about the microarchitecture to share. UDN claims that the main Zen 5 cores, codenamed “Nirvana” will be manufactured on a 3nm process, using TSMC’s foundries. However, this goes against previous reports that these cores will be produced using a 4nm process while only the Zen 5c cores, codenamed Prometheus, will use 3nm. For context, Zen 4 is built on a 5nm process. The shift to 4nm will allow more transistors to occupy the same area, which should in turn make for a more powerful processor. It will also be more efficient, meaning we can expect higher levels of performance at the same TDP, or the same at lower wattages. Turning back to the proposed release window, AMD released the Ryzen 7000 series at the tail-end of Q3 2022. As such, we could see history repeat itself, with another September launch. Hopefully, CEO Dr Lisa Su can provide more details at Computex, but that’s just a hope right now. Right now, however, AMD’s still largely enjoying the reception of its new Ryzen 8000G APUs. We’ll be sure to give you our perspective on whether they’re some of the best gaming CPUs around, when we get chance to review them. Samuel Willetts                 Sam has spent the past two decades tinkering with computers, a tradition he proudly continues as a Hardware Editor for PCGamesN. For all things systems and components, he's your man. You'll regularly find his hands inside a PC, swapping out components from the likes of AMD, Intel, and Nvidia as fast as you can say Windows. Otherwise, you'll find him on the showfloor of CES and Computex, talking the night away about the latest pieces of shiny silicon. You may also know him from outlets such as Custom PC, PC Gamer, Pocket Tactics, T3, and TopTenReviews. "
}