{
    "title": "Tecno’s Pocket Go Is A Handheld AR Gaming Device Powered By The AMD Ryzen 7 \n8840HS APU",
    "date": "2/27/2024",
    "url": "https://wccftech.com/tecno-pocket-go-handheld-ar-gaming-device-powered-by-amd-ryzen-7-8840hs-apu/",
    "text": "AMD's Ryzen 7 8840HS APU is finding a home in more unique gaming handheld devices such as the Pocket Go AR from Tecno Mobile. We have seen AMD's APUs in a range of devices from high-end PCs to notebooks, handhelds, Mini PCs, and more but there are also some unique devices coming out later this year that will harness the power of AMD's top Ryzen chips for gaming purposes. At MWC 2024, Tecno Mobile is unveiling one such device known as the Pocket Go. The Tecno Mobile Pocket Go is a high-end handheld gaming console that doesn't feature a display. This is because the display isn't on the device itself but a part of the AR glasses which come with dual 0.71-inch Micro-OLED displays. The OLED AR glasses are connected to the handheld via a standard USB Type-C cable and can also be connected to virtually any device. The main hardware of the Tecno Mobile Pocket Go handheld is featured within the controller itself which looks bulky for a reason. It comes with the standard buttons, joysticks, and triggers that you'll expect from a controller but it also houses the AMD Ryzen 7 8840HS APU. This chip comes with 8 Zen 4 cores, 16 threads, a core clock of up to 5.1 GHz, and a TDP that can be configured between 20-30W and 16 MB of L3 cache. To drive gaming, the chip features the RDNA 3-based AMD Radeon 780M iGPU which offers 12 compute units clocked at 2700 MHz and has been a great performer in entry-level gaming from the tests we've conducted. Additional specifications include 16 GB of LPDDR5 memory and 1 TB of PCIe 4.0 SSD. The Tecno Mobile Pocket Go AR gaming handheld also comes with a 50Wh battery for the glasses and these can create 215-degree projections at a distance of 6m so you can enjoy a gaming experience on the go which sounds fantastic. There is currently no pricing or launch date mentioned for the Pocket Go but we will share more information as it comes by. News Source: Many thanks to @faridofanani96 for the tip! Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}