{
    "title": "Acer Swift Go 14 and Swift Edge 16 laptops get a Ryzen 8040 update",
    "date": "2/20/2024",
    "url": "https://liliputing.com/acer-swift-go-14-and-swift-edge-16-laptops-get-a-ryzen-8040-update/",
    "text": "Liliputing Acer is refreshing two of its thin and light laptops with new models powered by AMD’s Ryzen 8040 processors featuring RDNA 3 integrated graphics and Ryzen AI features. The new Acer Swift Go 14 (SG140-63/T) sells for $700 and up and supports up to a 14 inch, 2.8K OLED, 90 Hz display and Ryzen 9 8945HS processor, while the Acer Swift Edge 16 (SFE16-44) starts at $1300, supports up to a Ryzen 7 8840U processor, and ships standard with a 3.2K OLED, 120 Hz refresh rate. Both laptops should hit the streets in the coming months. Acer is positioning the new laptops as “AI PCs,” thanks to the Ryzen AI neural processing units baked into AMD’s latest chips, along with a few other features including dedicated Windows Copilot buttons on the keyboards and support for Acer’s AI-enhanced voice, graphics, and image editing software. But those are hardly distinguishing features: most new laptops that ship this year with the latest Intel, AMD, or Qualcomm processors have built-in NPUs. Still, the upgraded NPU is just about the only thing setting AMD’s new Ryzen 8040 series processors apart from the previous-gen Ryzen 7040 chips, which have the same CPU and GPU architecture. The new Acer Swift Edge 16 is thinner and lighter than the new Swift Go 14, despite having a larger display. It measures 358 x 246 x 13mm (14.1″ x 9.7″ x 0.5″) and weighs 1.23 kg (2.71 pounds). It also offers optional support for WiFi 7, which is not available on the 14 inch model. But it achieves that thin and light design by featuring a smaller battery and a less power-hungry U-series processor. Here’s a run-down of key specs and options for Acer’s new thin and light notebooks: Liliputing's primary sources of revenue are advertising and affiliate links (if you click the \"Shop\" button at the top of the page and buy something on Amazon, for example, we'll get a small commission). But there are several ways you can support the site directly even if you're using an ad blocker* and hate online shopping. Contribute to our Patreon campaign or... Contribute via PayPal Enter your email address to subscribe to this blog and receive notifications of new posts by email. Email Address Subscribe 2 Comments Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Notify me of follow-up comments by email. Notify me of new posts by email.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Why is the frame around the screen so big in 2024? keyboard arrow keys are impractical.. Matthew Moniz YouTube review of a 2023 version of this same Swift Edge 16 with AMD 7840U (https://youtu.be/T9q5Yd8d5PE?t=285) uncovered an interesting fact about what otherwise seemed like a pretty compelling laptop – the fact that idle fan noise is around 45 dB and he was unable to tame/lower it with settings. Hopefully this years model somehow addresses it, but on the other hand who knows why the Acer chose to minimize heat so aggressively? Maybe there is a compelling reason to do so? I can only imaging how ridiculous it would be to buy a 7840U that is marketed as “ultra low power” APU only to discover that idle fan noise is not anywhere near zero. The blame is hard to place exactly. I would be inclined to look at AMD as far as “blame” goes because AMD for some reason it sees like it is not offering low enough power (TDP?) APUs besides custom designed chips for Steam Deck (AMD Van Gogh). That way AMD is loosing the entire x86 tablet market for example and who knows what else. Perhaps extreme minimization of weight of this device is also partially a culprit? I wonder if Acer should consider Frore AirJet or some similar passive cooling material or technique, perhaps peltier even? Perhaps there even exists a lightweight passive cooled material? I also wonder why x86 manufacturers don’t seem to get that passive cooled laptops are actually attractive for this segment as demonstrated with Mac Air passive cooled laptops..  Radxa Rock 5 ITX board coming in April (RK3588 processor, LPDDR5 memory and an ITX form factor)  MINISFORUM V3 2-in-1 tablet with Ryzen 7 8840U launches in China (coming soon to global markets)  Lilbits: Apple’s iPad Pro with an OLED display coming soon, and look at this DIY GPU designed from scratch  Daily Deals (3-29-2024) "
}