{
    "title": "AMD begins Zen5 enablement for GNU Compiler Collection (GCC), new AVX \ninstructions added",
    "date": "2/10/2024",
    "url": "https://videocardz.com/newz/amd-begins-zen5-enablement-for-gnu-compiler-collection-gcc-new-avx-instructions-added",
    "text": "AMD has begun work on enabling the Zen5 microarchitecture through the GNU Compiler Collection (GCC). First patches were shared through a mailing list titled “Enable support for next generation AMD Zen5 CPU with znver5 scheduler Model”.  One could have expected Zen5 enablement to come sooner, considering that the GCC 14 release is expected in March and April, which is a typical annual release for this compiler. However, AMD tends to release such updates even after the release of the new product. That said, AMD is actually speeding up its enablement by introduction first Zen5 patches even before the product launch. The Zen5 architecture is expected to make its debut later this year, featuring the desktop Granite Ridge series and potential mobile variants from the Strix Point series. Interestingly, AMD’s progress on Zen5 development is occurring alongside Intel’s work on the Clearwater Forest and Panther Lake CPU series, not expected to launch this year.   Zen5 instruction set, Source: GCC  According to the first patches, AMD Zen5 is confirmed to support new instructions such as AVXVNNI, MOVDIRI, MOVDIR64B, AVX512VP2INTERSECT, and PREFETCHI. Some of these instructions are already supported by Intel Tiger Lake series, but were absent in the AMD products until now: It’s great seeing AVX-512 VP2INTERSECT, which has been found on the Intel side since Tigerlake. MOVDIRI and MOVDIR64B have also been found on the Intel side since Tigerlake. PREFETCHI is exciting and only coming on the Intel side with Granite Rapids. Lastly is AVX-VNNI new to Zen 5 for being equivalent to AVX512-VNNI with VEX encoding. — Phoronix The report adds that the same instruction set is listed for the whole family of Zen5 products, which essentially means that Zen5c considered a more power-efficient variant, will support the same instructions. As this is an initial enablement, certain scheduling code has been ported from Zen4 until AMD engineers provide an updated version. Additionally, there’s an unresolved question regarding the availability of LLVM/Clang compilers for Zen5. Patches for this compiler are yet to be seen. Source: Phoronix We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}