{
    "title": "$1 Trillion AI Gold Rush: Analyst Equates Tech Firm To 'Messi,' Calls \nNVIDIA's Huang 'Godfather Of AI'",
    "date": "2/13/2024",
    "url": "https://markets.businessinsider.com/news/stocks/1-trillion-ai-gold-rush-analyst-equates-tech-firm-to-messi-calls-nvidia-s-huang-godfather-of-ai-1033062722",
    "text": "The tech industry is witnessing a transformation as significant as the advent of the Internet in the 1990s, with artificial intelligence (AI) at the forefront of this seismic shift, according to Wedbush. Analysts at Wedbush have drawn a striking analogy to describe the impact of AI, likening a standout company in the AI arena to football legend Lionel Messi, while still labelling NVIDIA Corp.‘s (NASDAQ:NVDA) Jensen Huang as the pioneering ‘Godfather of AI.’ Daniel Ives and his team at Wedbush predict a surge in technological investments towards AI in the coming decade. This anticipation stems from the evident monetization of AI technologies, as demonstrated in recent earnings reports across the tech sector. The analysts anticipated $1 trillion directed into AI technological advancements over the next 10 years. While Nvidia, under Jensen Huang‘s stewardship, initially stood unchallenged in the AI chip domain – with  Advanced Micro Devices Inc. (NASDAQ:AMD) gearing up to enter the scene – the narrative is rapidly expanding beyond these two giants. “It’s all about the 2nd, 3rd, and 4th derivative of this AI Revolution,” Wedbush wrote.  The focus is shifting from hardware to the applications and use cases of AI, where Palantir Technologies Inc. (NASDAQ:PLTR) emerges as the industry’s “Messi.” Palantir’s U.S. commercial business witnessed a remarkable 70% growth year-over-year, thanks to its innovative AI platform (AIP). The company recently reported earnings per share of 8 cents, doubling its performance from the previous year. Shares of Palantir Technologies rallied over 40% last week on the heels of a stronger-than-expected earnings report, marking the second-strongest week since the company’s IPO in 2020. The Global X Defense Tech ETF (NYSE:SHLD) holds the largest portfolio share of Palantir, with a 4.9% weight, followed by the Meet Kevin Pricing Power ETF (NYSE:PP), with a 4.7% weight. Chart: Palantir Shares Rocketed Following A Spectacular Earnings Report  Despite the growing competition, Wedbush maintains its preference for tech giants such as Apple Inc. (NASDAQ:AAPL), Microsoft Corp. (NYSE:MSFT), Alphabet Inc. (NASDAQ:GOOGL), Palo Alto Networks Inc. (NASDAQ:PANW), Palantir Technologies, Zscaler Inc. (NASDAQ:ZS), CyberArk Software Ltd. (NASDAQ:CYBR), Crowdstrike Holdings Inc. (NASDAQ:CRWD), and MongoDB Inc. (NASDAQ:MDB). These companies are positioned at the heart of what is described as the most significant technological revolution in three decades. Dubbed the “1995 Moment” for AI, the current period marks the beginning of the second, third, and fourth waves of the AI revolution, stretching into 2024. Read now: The Skinny On Novo Nordisk: Weight-Loss Meds Make Big Pharma A Big Foe For Food Industry Photo: Shutterstock Indices Commodities Currencies Stocks "
}