{
    "title": "2 Top AI Stocks to Buy Now, According to Wall Street",
    "date": "2/17/2024",
    "url": "https://finance.yahoo.com/news/2-top-ai-stocks-buy-115700339.html",
    "text": "As organizations ramp up investment in artificial intelligence (AI) technology, there are more chip stocks starting to get in on the action besides AI chip leader Nvidia. Goldman Sachs lists Advanced Micro Devices (NASDAQ: AMD) and Marvell Technology (NASDAQ: MRVL) as two of its top AI chip stocks to buy right now. These companies are seeing accelerating demand for their AI chips that could fuel new highs over the next few years. Here are more details on what's fueling interest in these two AI stocks. Shares of AMD are up 117% over the last year, despite the company experiencing a 4% decline in total revenue. AMD's chips are found in several markets, including video game consoles, personal computers, and even the world's most powerful supercomputers. However, investors are optimistic about the company's accelerating growth in data centers, where its new MI300X graphics processing units (GPUs) designed for AI are gaining significant traction in the marketplace. In the fourth quarter, AMD said data center revenue, which comprises less than a third of the business, grew 38% year over year and 43% over the previous quarter. GPU revenue for data centers exceeded management's expectations following the launch of the MI300 series. AMD is seeing strong interest from several leading cloud providers, including Microsoft, which is using the MI300X to power new capabilities in the Azure enterprise cloud service. It's the accelerating demand in the data center business that has Wall Street analysts expecting AMD to return to growth this year. The stock has already risen 20% year to date, as investors sense there could be a wave of growth on the horizon. While AMD expects the near-term environment to be mixed for its consumer chips, it raised 2024 revenue guidance for data center GPUs significantly. AMD previously expected these products to bring in $2 billion in revenue this year but now expects over $3.5 billion. Most importantly, strong demand for high-end data center chips are pushing the company's margins up. Analysts expect the company to grow earnings by 42% per year over the next few years. With this much momentum, it's clear why Goldman Sachs likes the stock, and why AMD shares could continue to outperform the market. Shares of Marvell Technology are up 60% over the last 12 months and already up 19% year to date, despite posting falling revenue in recent quarters. The company makes several chip products used in gaming consoles, advanced driver-assistance systems in cars, wireless carrier infrastructure, and more. But the reason for the stock's relatively strong performance is growing demand for its processing solutions in the AI and data center market. Sales to data centers made up 39% of the business in the October-ending quarter and are accelerating. Data center revenue surged 21% over the previous quarter, and management expects the segment to show sequential growth in the mid-30% range in the next earnings report. Marvell is partnering with Nvidia to deliver the required computing bandwidth for companies to use generative AI in the data center. In November, management noted strong demand for its electro-optic products, which are growing consistent with the demand for high-powered AI chips. As with AMD, demand for Marvell's AI solutions is coming in stronger than management previously expected. The company expects AI-related revenue to significantly exceed its previous forecast for $200 million in the fiscal fourth quarter. Analysts expect the company to post earnings growth of 14% on an annualized basis over the next few years, but that estimate could drift higher if Marvell continues to report better-than-expected growth from AI-related products. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Advanced Micro Devices made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks *Stock Advisor returns as of February 12, 2024 John Ballard has positions in Advanced Micro Devices and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Goldman Sachs Group, Microsoft, and Nvidia. The Motley Fool recommends Marvell Technology and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. 2 Top AI Stocks to Buy Now, According to Wall Street was originally published by The Motley Fool Related Quotes "
}