{
    "title": "DirectML is getting NPU support, but only on Intel",
    "date": "2/1/2024",
    "url": "https://www.xda-developers.com/directml-npu-support-intel/",
    "text": "No news on whether AMD processors will be supported. With the AI hardware competition heating up and AI PCs entering the market, we're beginning to see which technologies the big companies want to support. This is potentially huge, as these early days of technology adoption may define which products we end up using the most in the future, kind of like an AI version of the Blu-Ray vs. HD-DVD battle. Now, Microsoft has stated that its DirectML NPU API will only support Intel processors, which may shape how things will develop. As announced on the Windows Developer Blog, Microsoft is working with Intel's NPUs to use DirectML's API. NPUs are the new kid on the block; their full name is \"Neural Processing Unit\" and you can think of them as a new member of the family alongside CPUs and GPUs. While CPUs handle processing tasks and GPUs handle graphics, NPUs are dedicated to processing machine learning tasks and are becoming a key asset in the war between hardware manufacturers to take advantage of the recent AI boom. Likewise, DirectML is Microsoft's machine learning API that will allow developers to \"talk\" to the user's NPU. As such, with DirectML only working with Intel processors, it means that people with an AMD NPU won't be able to use it. It's still unclear if Microsoft intends to also bring DirectML over to AMD processors, but if it doesn't, it may harm AMD's chances of taking on Intel in the AI market. And given how AI PCs are just taking off, both Intel and AMD need companies to support its technologies, else consumers will end up choosing one over the other.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Simon is a Computer Science BSc graduate who has been writing about technology since 2014, and using Windows machines since 3.1. After working for an indie game studio and acting as the family's go-to technician for all computer issues, he found his passion for writing and decided to use his skill set to write about all things tech. The MacBook Air is one of the best lightweight laptops, but how does it compare to the new Samsung Galaxy Book 4 Pro? Let's take a look. Crucial's 2TB Gen4 M.2 SSD is now down to its lowest price, making it the perfect upgrade your computer or laptop. Looking to upgrade? This Keychron mechanical keyboard is going to be a great option and now comes in at just $30. HP unveiled a wide range of new Envy and Pavilion laptops, offering Intel and AMD hardware with AI enhancements. Thermal paste is a vital component of any CPU cooling solution, but here's how long you can expect it to last The Ayaneo Retro Mini PC AM02 is another mini PC from Ayaneo, and it's capable of quite a bit more than the first. "
}