{
    "title": "AMD Mobile on Desktop Mini-ITX board comes with up to 65W Ryzen 7 8845HS \nand four 2.5G network ports",
    "date": "2/3/2024",
    "url": "https://videocardz.com/newz/amd-mobile-on-desktop-mini-itx-board-comes-with-up-to-65w-ryzen-7-8845hs-and-four-2-5g-network-ports",
    "text": "A Chinese company is now offering an AMD-based desktop motherboard with a mobile processor.   AMD MoDT Mini-ITX board, Source: Changwang  Intel’s domination in MoDT (Mobile on Desktop) market is coming to an end. AMD’s powerful 8-core CPUs are now seamlessly integrated into emerging Mini-ITX platforms. These platforms are designed to either give users high-end CPUs at a lower price compared to standard desktop solutions, or give you many features for different applications that aren’t standard for the desktop form factor. Changwang’s board is specifically geared towards NAS and storage, accommodating up to nine SATA drives. However, its appeal extends beyond this with a range of notable features.   AMD MoDT Mini-ITX board, Source: Changwang  The board, lacking an official marketing name, can be equipped with four AMD CPUs: Ryzen 7 7735HS, Ryzen 7 7840HS, Ryzen 9 7940HS, and the latest Ryzen 7 8845HS. Presently, only the 7840HS variant is available for purchase, with or without a cooler. As per the company’s information, the board defaults to supporting 54W TDP, with users having the capability to unlock up to 65W through the BIOS. Essentially, this presents a viable alternative to desktop Ryzen 7 8700G APUs, which are also 65W TDP by default. In comparison to these socketed AM5-based Phoenix APUs CPUs, the MoDT platforms do not allow any upgrade or replacement options. Furthermore, AM5-based systems have U-DIMM memory, which can work at much higher speeds than most MoDT platforms. In this case, the 7840HS-based platform supports up to two SO-DIMM memory up to 5600 MT/s.   AMD MoDT Mini-ITX board, Source: Changwang  The limitations are clearly visible, which is why these MoDT platforms often come with plenty of options not typically available on the desktop. In Changwang platform case, that’s an impressive set of interface options, including Thunderbolt 4, USB4, four 2.5 Gbit NICs, and PCIe Gen4x4. In terms of storage, the board features two M.2 2280 PCIe Gen4x4 slots for SSDs, a single SATA 3.0 port, and two SFF-8643 ports enabling additional 8 SATA ports. Home servers and Network Attached Storage can easily take advantage of such options. The board supports Intel LGA1700 coolers and there is a full cover copper heatsink placed on top of the CPU for easier cooler mounting. This heatsink (shown above) is added to all orders.   AMD MoDT Mini-ITX board, Source: Changwang  Changwang has priced its Ryzen 7 7840HS-based board at 2888 RMB (around 405 USD). An option bundled with a cooler is also available, although its price remains undisclosed. This pricing places it near the Minisforum BD770I, equipped with a Ryzen 7 7745HX processor. Both use the AMD Zen4 processors, but they are made for different types of customers. The Minisforum system focuses on consumers and gamers, boasting full PCIe Gen5x16 support, while Changwang’s offering is specifically tailored for home servers. Source: Changwang via @9550pro We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}