{
    "title": "AMD Ryzen 8040 \"Neural Processing Unit\" monitoring will soon be available \nin Windows Task Manager",
    "date": "2/21/2024",
    "url": "https://videocardz.com/newz/amd-ryzen-8040-neural-processing-unit-monitoring-will-soon-be-available-in-windows-task-manager",
    "text": "  AMD Ryzen AI processor, Intel NPU in Task manager, Source: AMD, Wccftech, Intel  PC users should get used to seeing the NPU (Neural Processing Unit) more often in modern systems. Intel has recently released its Intel Core 100 series based on the Meteor Lake chip, which is Intel’s first consumer architecture featuring the AI Accelerator called VPU (Versatile Processing Unit). Right after the release, Microsoft has added support to monitor the NPU activity within the Windows Task Manager. Now it’s time for AMD. AMD has been shipping consumer CPUs with built-in XDNA processor for almost a year now, but use cases were very limited. In December, AMD announced an updated Hawk Point architecture based on the same silicon but with a 60% faster XDNA processor compared to Phoenix. The company is now working with Microsoft to enable MCDM (Microsoft Compute Driver Model), which is a derivative of WDDM (Windows Display Driver Model), except for AI workloads. The MCDM framework enables software to take advantage of the task scheduling, power and memory management and performance debugging. The latter will be even simpler once users and developers will be able to track how NPU is utilized from within the Windows Task manger itself. AMD has now confirmed they have also been working on enabling Ryzen 8040 NPU monitoring from Windows in real-time, and this will be part of the upcoming Task manger update. One of the reasons AMD has integrated an NPU into select Ryzen 8040 processors is to help vendors create new, AI-powered apps and experiences. Being able to monitor device usage in real-time can make software development easier, so integrating this functionality makes sense for everyone, from developers and system vendors to the individual end-user. — AMD Around 2017, Microsoft integrated GPU monitoring to the Task Manager, which even allows uses to monitor how much of the GPU performance is used for video coding. It serves as a very convenient method of monitoring the most important PC components these days, from CPU, GPU, memory or network, now extending to NPUs. It is unclear why only Ryzen 8040 series support is being added, while there is no mention of Ryzen 7040 or desktop 8000G series, both architectures also equipped with AMD XDNA unit. Source: AMD We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}