{
    "title": null,
    "date": "2/9/2024",
    "url": "https://www.techspot.com/news/101833-overclocking-ryzen-7-8700g-integrated-radeon-780m-graphics.html",
    "text": "In brief: We already know that AMD's new Ryzen 7 8700G APU responds favorably to fast DDR5. Now, we have a better idea of what's possible when stretching the iGPU's legs as well as what's possible when combining an overclocked iGPU with elevated CPU core frequencies and high-performance memory. Overclocker SkatterBencher recently pushed the platform using a variety of techniques. Paired with an Asus ROG Strix X670E-I Gaming WiFi and G.Skill Trident Z5 DDR5-6400 memory, the oc'er started by enabling Precision Boost Overdrive (PBO) 2 and AMD Expo which boosted performance in some tests by more than 26 percent. SkatterBencher then tuned the PBO graphics frequency and switched to the Expo Tweaked setting for the memory. These changes delivered only a modest performance bump over the first set of changes. Manual tuning was next and enabled a little more headroom. SkatterBencher was able to push the 780M to a stable frequency of 3.15 GHz at 1.2v, which delivered a 39.09 percent improvement in AI Benchmark over the stock configuration. SkatterBencher then applied the settings from a previous guide to overclock the CPU to 5350 MHz, which squeezed a little more performance out of the system. Finally, the oc'er swapped out the memory for a faster kit and tightened timings. While not entirely stable (more time would be needed to pinpoint the cause of instability), the settings do highlight the performance benefits of tweaking timings. The fully tuned (but not quite stable) system turned in a Furmark 1080P score that was 61.14 percent higher compared to stock. In Shadow of the Tomb Raider, the overclocked system was 50 percent faster. Returnal was 48.15 percent faster on the tweaked system. TechSpot's AMD Ryzen 7 8700G Review In the end, SkatterBencher said he wasn't terribly impressed by the poor overclocking headroom of the 780M iGPU. This, he said, is in part due to AMD maximizing the frequency out of the box – not exactly a bad thing. On the flip side, the oc'er was thoroughly impressed by how the system responded to memory tuning and believes an expert tuner could get even more from the configuration. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}