{
    "title": "Nvidia's Latest Results Are Proof Of AI's Turbocharging Potential For \nBusiness",
    "date": "2/22/2024",
    "url": "https://finance.yahoo.com/news/nvidias-latest-results-proof-ais-153952888.html",
    "text": "On Wednesday, Nvidia Corporation (NASDAQ: NVDA) delivered its fourth quarter results and they smashed Wall Street’s expectations across the board as generative AI demand is surging across the globe. While the Data Center business is running the show, Nvidia’s gaming business also has an important role in its success. Over the last 12 months, Nvidia’s stock price easily surpassed those of its rivals, Advanced Micro Devices (NASDAQ: AMD) and Intel (NASDAQ: INTC). For the quarter ended on January 29th, Nvidia reported total revenue grew 265% to $22.10 billion, topping LSEG’s estimate of $20.62 billion.  Data Center business, which includes sales of its high-powered GPUs for AI applications, saw revenue skyrocket 217% to $18.4 billion, also beating analysts' expectations of $17.2 billion. However, data center revenue was harmed by recent U.S. restrictions on exporting advanced AI chips to China. The gaming segment brought in 2.9 billion, topping analyst estimates of $2.7 billion as it rose 56% YoY. Impressively, net income rose 769% YoY to $12.29 billion with adjusted earnings of $5.16 also topping LSEG's estimate of $4.64. Nvidia is undoubtedly at the top of its game, but its rivals are not standing still. Its main rival, AMD, is investing heavily in its own AI chips. Moreover, AMD is claiming its new MI300X surpasses Nvidia’s H100 in certain workloads. AMD rolled out the MI300X before 2023 came to an end, placing it as the industry’s most advanced AI accelerator. Intel also has its own server chips while it continues to work on expanding its own capabilities on the AI front.Interestingly, Microsoft Corporation (NASDAQ: MSFT) turned to Intel and not Nvidia to make its future in-house chips. Microsoft plans to use 18A manufacturing technology that Intel developed. With this move, Microsoft will undoubtedly boost Intel and its made-to-order chip business. Perhaps an even bigger threat to Nvidia doesn’t come from its direct rivals but from its customers like Microsoft that are racing to develop their own specialized AI chips to lower their reliance on Nvidia’s offerings. Moreover, such customers brought in more than half of its Data Center revenue during the latest reported quarter, as Nvidia attributed more than half of quarterly revenue to large cloud providers for conducting internal workloads and external customers. Besides Microsoft, those that are either already offering or are actively developing their own in-house AI chips are Amazon.com Inc (NASDAQ: AMZN), Alphabet (NASDAQ: GOOG)-owned Google, Meta Platforms (NASDAQ: META) and even the EV leader, Tesla Inc (NASDAQ: TSLA). However, Reuters reported that Nvidia has met with Alphabet, Amazon, Meta, Microsoft, and OpenAI in an effort to get them on board to make custom chips for them. During the current quarter, Nvidia guided for revenue of $24 billion while CEO Jensen Huang assured investors that the AI chip leader is all set for continued growth. DISCLAIMER: This content is for informational purposes only. It is not intended as investing advice. This article is from an unpaid external contributor. It does not represent Benzinga's reporting and has not been edited for content or accuracy. \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? NVIDIA (NVDA): Free Stock Analysis Report This article Nvidia's Latest Results Are Proof Of AI's Turbocharging Potential For Business originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}