{
    "title": null,
    "date": "2/11/2024",
    "url": "https://wccftech.com/yuzu-switch-frame-generation/",
    "text": "Yuzu Switch Frame Generation support has been added to the latest builds of the popular Switch PC emulator, allowing for smoother gameplay. In a new progress update, the team behind the project has provided details on what is coming to Yuzu as well as new features that have been implemented. One of the main changes for 2024 will be covering the emulator into a multi-process emulator instead of a single-process emulator. Various changes have been made to the emulator, but there's still much work to do. \"As of writing, multiprocess support is not yet merged, but fixes in the GPU, input, and other modules have already been staged and released, allowing full support to be added in parts\", the team writes on the official Yuzu blog. Last month, the universal frame generator LFSG 1.0 was released, allowing frame generation to be added to many games. The most recent builds of Yuzu support this program, and while the use of it allowed for improved perceived framerates, graphical artifacts are quite common, especially on larger screens. We've included a comparison video of Breath of the Wild running with and without lossless scaling at 60FPS:   As the Yuzu writes, however, there's now a better way to benefit from a smoother gameplay experience for those with AMD GPUs - AMD Fluid Motion Frames, which was officially released by the Red team last month. Through a simple file edit, users can run on Vulkan, OpenGL, and Direct3D 9/10 as well as Direct3D 11 and 12. Image quality is better compared to the use of lossless scaling, and at a 60FPS base, the performance boost is quite amazing. For instance, in The Legend of Zelda: Tears of the Kingdom, the use of AMD Fluid Motion Frames can result in a performance of around 170 to 180FPS on a Radeon 5600X and an NVIDIA RTX 3060 Ti. We've included comparison videos of Breath of the Wild running at 60FPS with and without the use of AMD's tech. Check the video's out below and judge for yourself:   \"The games can be rendered with an NVIDIA or Intel GPU while still generating frames with AFMF, although the experience is slightly worse than just using the AMD card directly due to the added latency of transmitting the finished frames over PCIe\", the Yuzu team explains. \"The only requisite for AFMF to work is to have the display connected to the compatible AMD GPU, any other GPU can do the actual rendering after that.\" To enable AMD Fluid Motion Frames in Yuzu, be sure to read the full post on the Yuzu blog. Impressive work from the Yuzu team once again. Have you tried out frame generation in Yuzu yet? Hit the comments below. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}