{
    "title": "AMD Radeon Software 24.2.1 is out with Skull and Bones, Helldivers 2 and \nNightingale support",
    "date": "2/16/2024",
    "url": "https://www.neowin.net/news/amd-radeon-software-2421-is-out-with-skull-and-bones-helldivers-2-and-nightingale-support/",
    "text": "3 hours ago 3 hours ago 6 hours ago 6 hours ago 3 hours ago 13 hours ago 13 hours ago 19 hours ago Mar 28, 2024 Mar 27, 2024 Mar 26, 2024 Mar 26, 2024 Mar 28, 2024 Mar 28, 2024 Mar 26, 2024 Mar 26, 2024 7 hours ago Mar 30, 2024 Mar 30, 2024 Mar 30, 2024 Mar 25, 2024 Mar 23, 2024 Mar 20, 2024 Mar 17, 2024 Dec 31, 2023 Oct 14, 2023 Apr 11, 2023 Mar 27, 2024 Mar 25, 2024 Mar 10, 2024 Mar 3, 2024 Mar 24, 2024 Mar 21, 2024 Sep 23, 2023 Sep 21, 2023 19 hours ago Mar 29, 2024 Mar 28, 2024 Jun 14, 2003 Feb 23, 2024 Jan 20, 2024 Dec 6, 2023 Jun 6, 2023 Taras Buria\n\nNeowin\n@TarasBuria        ·\n    \n\n    Feb 16, 2024 19:18 EST\n    \n\nwith 1 comment  AMD Radeon Software 24.2.1 is now available for supported graphics cards from the \"red team.\" The latest driver introduces support and optimizations for Helldivers 2, Skull and Bones, and Nightingale. There is also a hefty list of fixes and minor improvements to make your gaming experience better. New Game Support: Skull and Bones Nightingale Fixed Issues: And here is the list of known issues: AMD Radeon Software 24.2.1 is available on systems with 64-bit Windows 10 and Windows 11. You can download it from the official website. Full release notes are available on the same page. Sayan Sen\n                                                ·\n                    \nFeb 27, 2024\n\nwith\n2\n                            comment\n                                s Taras Buria\n                                                ·\n                    \nOct 17, 2023\n\nwith\n5\n                            comment\n                                s Taras Buria\n                                                ·\n                    \nOct 21, 2022\n\nwith\n4\n                            comment\n                                s Taras Buria\n                                                ·\n                    \nMay 10, 2022\n\nwith\n5\n                            comment\n                                s Login or Sign Up to read and post a comment. Please enter your reason for reporting this comment. blackview bl8000 horizon forbidden west windows 11 insider preview promo microsoft weekly twirl 158 windows 11 insider preview promo windows 11 moment 5 dragons dogma 2 task manager notepad © Since 2000 Neowin®\n                                    All trademarks mentioned are the property of their respective owners. "
}