{
    "title": "Patients With Cataract, AMD, and Glaucoma Suffer Greater Risk of Falls and \nFractures - Peer to Peer: Spotlight on AMD",
    "date": "2/6/2024",
    "url": "https://www.medpagetoday.com/resource-centers/peer-to-peer-spotlight-amd/patients-cataract-amd-and-glaucoma-suffer-greater-risk-falls-and-fractures/4986",
    "text": " By Jennifer Logan, MD, MPH By Jennifer Logan, MD, MPH Fall and fracture risks are dramatically increased among patients with cataract, age-related macular degeneration (AMD), and glaucoma, a new study has found. Dr. Jung Yin Tsang, Research Fellow, Division of Population Health, Health Services Research and Primary Care, University of Manchester, in the United Kingdom, and colleagues reported their findings December 28, 2023, in JAMA Ophthalmology.1 More than half a billion persons worldwide are affected by visual impairment, with another 43.3 million experiencing blindness. Cataract, glaucoma, and AMD are among the major causes of age-related visual loss.2 Visual impairment may increase the risk for falls, but treatment of these diseases may help prevent morbidity and mortality related to falls.1 Early eye disease may impact balance, posture, and gait even before patients are aware of impairments, and affected persons may compensate for early visual impairment. Although cataract, glaucoma, and AMD have each been associated with fall risk, the associations with these diseases remain incompletely understood.1 In the current study, researchers aimed to determine how cataract, glaucoma, and AMD are associated with fall and fracture risk compared with those without visual impairment. Population-based database studyData for this study were obtained from 2 population-based databases that contain longitudinal medical records from 2 of the most commonly used clinical information systems in the United Kingdom. Data contained within these systems represent approximately one-quarter of the United Kingdom population and are nationally representative with respect to age, sex, race, and ethnicity. Patients aged 18 years or older with a diagnosis of cataract, glaucoma, or AMD were included in the study. A separate cohort was created for each eye disease, and patients could be included in multiple cohorts. Each case of cataract, glaucoma, or AMD was matched with up to 5 controls based on age, sex, and general practice. Study entry date was based on the first recorded eye disease diagnosis among those patients with at least 1-year registration within a general practice. The primary outcomes of interest were incident fall rate and incident fracture rate. The secondary outcome of interest was the rate of site-specific fractures. Data were also obtained regarding racial and ethnic group, patient-level deprivation score, Charlson Comorbidity Index, smoking history, and heavy alcohol use. Medications known to increase fall risk (benzodiazepines, antidepressants, antihypertensives, beta-blockers, antihyperglycemic medications, anticholinergics, and systemic steroids) were also noted from the patient records. Eye disease and fall riskThe mean age for patients in all cohorts was 74.3 years (73.8 years for cataract, 79.4 years for AMD, and 69.8 years for glaucoma). There was a slightly higher proportion of females than males in each cohort. For cataract, there were 410,476 cases and 2,034,194 controls with a median follow-up of 4.02 years and 3.91 years, respectively. The AMD cohort included 75,622 patients (median follow-up, 3.76 years) and 375,548 controls (median follow-up, 3.61 years). For glaucoma, there were 90,177 cases and 448,179 controls, with median follow-ups of 4.46 years and 4.24 years, respectively. Overall health was worse for all patient cohorts compared with controls at baseline, with patients having higher prevalences of physical health and mental health diagnoses and higher medication use. Specifically, patients from each eye disease cohort had higher prevalences of cardiovascular disease, respiratory disease, osteoporosis, depression, bipolar disorder, and dementia. Patients were also more likely than comparators to receive benzodiazepine, antidepressants, antihypertensives, antihyperglycemic medications, systemic steroids, and medications with a high anticholinergic burden. Patients with AMD and glaucoma were twice as likely to have a history of falls, and those with cataract were 3 times as likely to have a history of falls, compared with controls. In each cohort, patients with 1 eye disease were more likely to have a history of having the other 2 eye diseases studied compared with matched controls. Falls and fractures were more common among patients in each cohort compared with controls over the study period. Among those with cataract, 29.7% experienced falls (vs 13.9% of controls) and 14.4% experienced fractures (vs 8.2% of controls). For patients with AMD, 37.1% experienced falls (20.7% of controls) and 17.8% experienced fractures (11.6% of controls). For those affected by glaucoma, 25.2% had falls (12.8% for controls), and 12.2% had fractures (7.3% for controls). Site-specific analyses also showed that, compared with matched controls, patients in each of the 3 cohorts had increased risks for fractures of the hip, spine, forearm, skull or facial bones, pelvis, ribs or sternum, and lower legs. Interpreting the resultsThis very large multicohort, population-based study has shown that cataract, AMD, and glaucoma each increase the risk for falls and fractures, even after controlling for comorbidities and medication use. Although the association between eyesight limitation and increased risk for falls and fractures makes intuitive sense, the results from this study actually contradict those from some earlier investigations with more limited patient numbers.3 Dr. Tsang and colleagues point out that the relative risks for falls and fractures may vary over time among patients with cataract, AMD, and glaucoma. They suggest that studying linked outcomes (eg, hospitalizations, reductions in quality of life, or economic impacts) may provide further information regarding the full impacts of these increased fall and fracture risks. Doing so may help clarify which patients are most at-risk to focus efforts to provide more urgent treatments and support services.more urgently. Along those lines, the researchers believe that future research should evaluate medical and rehabilitation needs of patients with these eye diseases who are at increased risk for falls and fractures. The study team concluded that patients with these eye diseases “would likely benefit from improved advice, access, and referrals to falls prevention services and targeted interventions to prevent related adverse outcomes.” Published:  February 06, 2024 References  The material on this site is for informational purposes only, and is not a substitute for medical advice, diagnosis or treatment provided by a qualified health care provider.\n      © 2005–2024\n      MedPage Today, LLC, a Ziff Davis company. All rights reserved.\n      Medpage Today is among the federally registered trademarks of MedPage Today, LLC and may not be used by third parties without explicit permission. "
}