{
    "title": "Saudi Arabia Public Investment Fund in talks with venture capitalists to \ncreate $40 billion AI investment fund",
    "date": "3/20/2024",
    "url": "https://www.notebookcheck.net/Saudi-Arabia-Public-Investment-Fund-in-talks-with-venture-capitalists-to-create-40-billion-AI-investment-fund.815459.0.html",
    "text": "Saudi Arabia’s Public Investment Fund is in talks with venture capitalists to create a $40 billion investment fund to propel Saudi Arabia to a top leadership position in the field of artificial intelligence by 2030. The sovereign wealth fund manages nearly $1 trillion to drive growth in new sectors as the country pivots away from oil as their main source of revenue under the country’s master plan called Vision 2030. Saudi Arabia receives the majority of its revenue from oil sales, but as the world shifts away from using oil for transportation, heating, and cooking to counter global warming, revenues will decline. To counter this, Saudi Arabia created the Vision 2030 master plan in 2016 to rapidly drive innovation and growth across other sectors with the goal of becoming a world-leader in the respective fields by 2030. The Saudi Data and AI Authority (SDAIA) was created in 2019 as part of this drive and currently has over twenty thousand AI and data specialists on board focusing on education, government, healthcare, energy, and mobility sectors. The SDAIA has rapidly digitized Saudi cities and government services to improve the people while establishing collaborative training programs to train more than 45,000 specialists. Accenture has also assisted with their build-out of national cloud systems and government data systems. With six more years remaining until 2030, the PIF is preparing to spend four times the investment Microsoft has made in OpenAI ($1 billion in 2019, $10 billion in 2023) to achieve AI dominance. Despite a population half the size of the UK, the Saudi AI investment is also eight times what the UK and Microsoft UK are investing in AI (£1.5B + £2.5B or $5B). One venture capitalist company the Saudis might partner with is Andreessen Horowitz according to unofficial sources as reported by the NY Times and CNBC. Critically, Saudi Arabia is actively closing the gender gap in tech. Whereas only 1 in 5 CS graduates are women in America, the SDAIA is committed to training 25,000 women by 2030 and more than half their technical workers are women. Saudi Arabia is also less burdened by AI laws, with fewer than America to impede rapid AI development. Readers itching for a hot career in AI might want to start learning Arabic (with book like this at Amazon) before moving to sunny Riyadh. NY Times, CNBC, SDAIA, Saudi Arabia National Strategy for Data & AI, Saudi Arabia Vision 2030, Saudi Arabia Public Investment Fund, Accenture post, "
}