{
    "title": "Miners target AMD's Ryzen 9 7950X to chase Crypto profits",
    "date": "3/13/2024",
    "url": "https://overclock3d.net/news/cpu_mainboard/miners-target-amds-ryzen-9-7950x-to-chase-crypto-profits/?fbclid=IwAR0nHaEjfxQ-UWeqWjNMxwYgjHbfEkNo-1rk1Cm2pSnWuKVdBcC-rthtCA4",
    "text": " Cryptocurrency mining is starting to grow in popularity once again, but this time it’s the CPU market that is being affected. Specifically, AMD’s Ryzen 9 7950X is being targeted by cryptocurrency miners in some markets. This has lead to low stock levels in some regions, as this CPU is fairly profitable when it comes for QBIC mining. Right now, the UK market does not appear to be affected by this rising Ryzen 9 CPU demand. This is likely due to the UK’s high cost of electricity when compared to some global regions. Mining demand is highest in places where power is cheap. These are the areas where cryptocurrency mining becomes most profitable, allowing miners to recoup their investments faster. According to profit-mine.com, AMD’s Ryzen 9 7950X CPU can generate $3 in profit per day when mining QBIC. This assumes an electricity cost of $0.1 per KWH. For regions with more expensive power, CPU mining is less profitable or not profitable at all.  QBIC mining is only profitable on AMD’s Zen 4 processors. AMD’s support for AVX-512 with Zen 4 has given their latest CPUs a huge boost in performance when mining this specific cryptocurrency. With AMD’s 7950X CPU offering buyers the most cores/$, it makes sense that miners are targeting this specific CPU model. Thankfully, mining demand for AMD’s Zen 4 CPUs is restricted to global regions where electricity is cheap. Thanks to that we expect AMD’s Zen 4 CPUs to remain on store shelves in the UK, unless mining becomes much more profitable. Now I understand, 7950X is the king in Qubic mining. https://t.co/r8Uo79B6C6 — MEGAsizeGPU (@Zed__Wang) March 12, 2024  Is a new mining craze starting? Who knows. Bitcoin’s price has risen sharply in recent months, but mining remains largely unprofitable on today’s consumer-grade GPUs. Will that change in the future? Again, who knows? Let’s hope not. I think I speak for most PC enthusiasts when I say that cryptocurrency mining can have a hugely negative impact on the PC market. You can join the discussion on cryptocurrency miners targeting AMD’s Ryzen 9 7950X processor on the OC3D Forums. A Northern Irish father, husband, and techie that works to turn tea and coffee into articles when he isn’t painting his extensive minis collection or using things to make other things. No crappy Google banners here, only PC related advertising you may actually find interesting. Please disable Ad Blockers in order for us to keep producing the same level of quality, informational reviews and news. Worst case they actually look pretty and fill the empty gaps <3 "
}