{
    "title": null,
    "date": "3/16/2024",
    "url": "https://wccftech.com/acer-predator-bifrost-radeon-rx-7900-gre-oc-gpu-150-mhz-overclock-triple-fan-cooling/",
    "text": "ACER has unveiled its high-end Radeon RX 7900 GRE Predator BiFrost OC GPU which comes with a 150 MHz overclock out of the box. ACER has silently been expanding its Predator BiFrost GPU lineup which now includes a brand new addition to the Radeon RX 7000 series, the Radeon RX 7900 GRE OC. This new graphics card is also the fastest Predator Bifrost model and is powered by the flagship Navi 31 GPU core. In terms of specifications, we are looking at 5120 stream processors based on the RDNA 3 graphics architecture along with 320 TMUs, 160 ROPs and 80 RT cores. The graphics card features a chiplet design and comes with 6 MCDs out of which 4 are enabled for this specific GPU SKU, allowing for a 64 MB Infinity Cache and 16 GB of GDDR6 memory running across a 256-bit bus interface at a clock speed of 18 Gbps. This delivers 576 GB/s of bandwidth to the GPU. The ACER Radeon RX 7900 GRE OC Predator BiFrost has its GPU overclocked out of the box with a game clock of up to 2050 MHz and a boost clock of 2395 MHz which is +150 MHz above the stock clocks and the fastest clock of all the RX 7900 GRE variants. For cooling, ACER has gone with a 2.3 slot and triple-fan cooling solution which comes in an all-black design with an RGB-lit logo on the sides. The cooling is part of the ACER Frostblade 3.0 system which should deliver good cooling and there's even a backplate that complements the look of this custom model. ACER hasn't revealed the pricing of this model and it seems to be only available with its Predator pre-built gaming PCs but if the company offers it in the DIY segment, we can expect it to be priced around the $549 US MSRP which was recently announced by AMD. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}