{
    "title": "Nvidia could be working on a new gaming device to rival the Steam Deck",
    "date": "3/2/2024",
    "url": "https://www.techspot.com/news/102103-nvidia-reportedly-working-premium-handheld-gaming-device.html",
    "text": "Bottom line: It's now or never for Nvidia to re-enter the handheld gaming market if it wants to catch up with AMD and compete with the Intel alternatives expected later this year. The company will be providing the silicon for the Switch 2, which many suggest should outperform the Steam Deck. Nvidia may be having a serious case of FOMO. The company has been watching AMD APUs clean up in the somewhat new segment of PC-based gaming handhelds, and now that Intel alternatives are coming out later in 2024, Team Green wants in. That is what a source has told YouTube channel Moore's Law is Dead. Reportedly, Nvidia is working on a premium handheld gaming device to rival the Steam Deck and other similar devices. \"Nvidia is getting serious about making more handheld gaming devices with their graphics IP in them,\" Moore's Law said. \"I have been told directly that they are looking into working with somebody on a premium handheld gaming device.\" Who that partner could be is still unclear, but Moore's Law speculates it could be Intel. Because Nvidia doesn't have a license to manufacture x86 CPUs, it would need a partner to provide the processor. A tie-up with Intel, however, would mean the CPU and GPU would be discrete and require a proper heatsink similar to those found in the best gaming laptops, PCGamesN points out. However it shakes out, an Nvidia handheld is many years away, Moore's Law said. This wouldn't be the first time Nvidia tries to crack the gaming handheld market. Years ago, it launched the Nvidia Shield, a portable gaming device that also supported streaming. It never quite landed because of stiff competition and eventually became a 4K HDR streaming device that is priced out of many consumers' wallets. Meanwhile, the market waits for a Switch 2 to come out. Moore's Law says that Nvidia is definitely co-developing the console's SoC with Nintendo, having beaten AMD for the bid by a hair, according to another source.  It is hard to say when it will hit shelves as Nintendo is waiting to sell through its remaining Switch stock, the source said. But the Switch 2 silicon has been done since 2022. \"We presented several options to Nintendo including one that used Lovelace and they selected a cost-optimized version of Orin,\" Moore's Law quoted the source as saying. Assuming Nintendo doesn't \"cheap out\" on the specs, the Switch 2 is expected to outperform the Steam Deck. When the original Switch first came to market, the competition was slim. The PlayStation had given up on mobile gaming and at that time there was no burgeoning Windows handheld industry. Mobile gaming on a smartphone was in its infancy, too. In that sense, the competition will be far more intense for the Switch 2 even if Nintendo certainly has the upperhand. There are several controller options for playing on a phone and the Steam Deck is doing relatively well. Plus, more competitors should be joining the ranks, including Sony's PlayStation Portal handheld that lets you stream your PS5 games via Wi-Fi. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}