{
    "title": null,
    "date": "3/22/2024",
    "url": "https://www.hardwaretimes.com/horizon-forbidden-west-pc-performance-benchmarks/",
    "text": "Horizon Forbidden West has landed on PC in all its 4K glory, running at nearly 100 FPS (on the GeForce RTX 4090). We tested the latest PS5-PC exclusive and were pleasantly surprised by the result. Developed by Nixxes, the PC port of Forbidden West features scaled-up textures, highly detailed objects, and a trio of upscaling options (and Frame Generation) to back it up. At 122GB, the game takes up a large chunk of storage, and even on PCIe Gen 4 SSDs takes several seconds to load up. Table of Contents We tested Horizon Forbidden West on our usual test bench. The “Very High” quality graphics preset was used for all benchmarks without upscaling or frame generation. The tests were conducted at 1080p, 1440p, and 4K in the starting section of the game. As you’ll see, Horizon Forbidden West favors AMD GPUs, with the $699 Radeon RX 7900 XT matching the $1000+ RTX 4080 Super. At 1080p, the Radeon RX 7900 GRE is 16% faster than the similarly priced GeForce RTX 4070, extending the lead to 19.5% at 1440p. The GeForce RTX 4080 Super marks a slim victory over the Radeon RX 7900 XTX, trailing the RTX 4090 by 10-12%. The top five GPUs average over 100 FPS, with lows consistently hitting 80-90 FPS. At 4K, the AMD Radeon RX 7900 XTX edges past the RTX 4080 Super (courtesy of the wider bus and cache), while the RX 7900 GRE extends its lead over the RTX 4070 to 20%. The RX 7900 XT is nearly as fast as the 4080 Super, with almost identical 1% lows. The RTX 4090, a $1,600 card, is only 14% faster than the $899 RX 7900 XTX in this title. As per the below frametime variance graph, the Radeon RX 7900 XTX is slightly smoother than the RTX 4080 Super, which, in turn, performs a smidge better than the RX 7900 XT. The RX 7900 GRE is much more stable than the RTX 4070, courtesy of the larger VRAM and cache buffers. Despite averaging over 150 FPS at 1080p (RTX 4080 Super), Horizon Forbidden West is completely GPU-bound. The game is quite the CPU hog, with our Core i9-13900K sipping up to 238W during the test. The GPU power consumption was slightly better, peaking at 296W and 371W on the RTX 4080 Super and 4090, respectively. All-in-all, Forbidden West is a well-optimized PC port, something we rarely get to see these days. Most players should be able to run the game at the highest quality graphics preset (aided by FSR 2/DLSS 3) with consistent frametimes and minimal stuttering. "
}