{
    "title": "AMD Intends To Adapt Instinct MI300 For China, Despite The Failed First \nAttempt - Tech News Space",
    "date": "3/11/2024",
    "url": "https://technewsspace.com/amd-intends-to-adapt-instinct-mi300-for-china-despite-the-failed-first-attempt/",
    "text": "Last week it became known that AMD’s efforts to coordinate with the American authorities the supply of Instinct MI309 accelerators to China were unsuccessful, and an export license would be required to ship them in this direction. The company’s financial director was not so categorical and made it clear that the issue was still being worked out.  Image Source: AMD During the Morgan Stanley technology conference last week, AMD CFO Jean Hu was forced to answer questions from analysts, and the then-fresh news story surrounding the ban on the supply of Instinct MI309 involuntarily surfaced at this event. An AMD representative began her commentary by stating that the company’s revenue in this market segment in 2024 depends little on Chinese customers, and therefore, even if there are some bans, it will not decrease much. Secondly, Jin Hu explained that AMD supplies Instinct MI210 accelerators to customers in China, which comply with the current US Department of Commerce export control requirements. Currently, active work continues with clients in China and with the specified ministry regarding the continued possibility of supplying the derivative modification of the Instinct MI300 to this country, and there are no final decisions on this topic yet. In the future, AMD would like to maintain the ability to supply its products to the Chinese market, subject to compliance with the requirements of the US authorities. Speaking about competition in the accelerator segment, an AMD representative emphasized that Nvidia’s decision to speed up the release of new architectures prompted her company to take similar measures. In fact, even the transition from MI100 to MI300 took three to four years, so AMD is moving quite quickly in this regard. The company believes in its strengths, in the technological capabilities of TSMC, as well as in the prospects of packaging using chiplets. AMD’s new product release plan will be coordinated with key customers to meet their needs. The field of artificial intelligence will become the main driver of business development for AMD, and the company’s plans in this area will not be limited to 2024 alone, according to the CFO. Dylan Harris is fascinated by tests and reviews of computer hardware. Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  TECH NEWS SPACE The Tech News Space team monitors news from the world of high technology, science, the gaming industry and delivers them to its readers in a timely manner. "
}