{
    "title": "Best AI Stocks in 2024: Nvidia Versus Advanced Micro Devices",
    "date": "3/10/2024",
    "url": "https://247wallst.com/investing/2024/03/10/best-ai-stocks-in-2024-x-stock-vs-x-stock/",
    "text": "If any technological advancement has had one of the most significant impacts on the world and the stock market, it’s the rise of Artificial Intelligence. The emergence of Chat GPT started a fire in late 2022 that is burning ever brighter as more money and more big players keep entering the fray, all trying to one-up the others. The origins of artificial intelligence (AI) can be traced back to 1956 and the Dartmouth Summer Research Project on Artificial Intelligence. While no breakthroughs came out of the conference, the event was a significant catalyst for research over the next 20 years. As technology grew through the 1970s and 1980s, computing power and accessibility grew. Semiconductor chip speeds and data capabilities expanded, and by 1997, a computer called Deep Blue, made by International Business Machines (NYSE: IBM), was able to defeat chess giant Gary Kasparov, and Google’s Alpha Go was able to overcome Ke Jie, the Chinese Go Champion. AI was in the books with a big win. Then, the new millennium was upon us, and an era of big data flooded the marketplace with capabilities to extract massive amounts of data that were almost impossible for individuals to comb through, find, and document. However, with huge advancements in processing speeds and storage capabilities, the groundwork had been set for the AI revolution. We screened our 24/7 Wall St. Artificial Intelligence research database to see which company between Nvidia Inc. (NASDAQ: NVDA) and Advanced Micro Devices Corporation (NASDAQ: AMD) would be the best AI stock for 2024.  The company, which traded under $10 per share from 2000 to 2015, pioneered many technologies on which AI applications depend. The Nvidia graphics processing units (GPUs) helped the gaming industry explode and were simultaneously the go-to chips for multiple tasks. While Nvidia is still a massive player in the gaming world, the AI explosion changed everything. Nvidia’s CUDA (Compute Unified Device Architecture) platform began the AI explosion, allowing GPU acceleration. Developers could access the raw computing power of CUDA GPUs to process and assimilate data faster than older GPUs. While graphics remain a solid part of the business for Nvidia, the computing and networking silo has exploded. Nvidia’s revenue for computing and networking has accelerated by 1,345% over the last four years. Revenues for fiscal 2024 surged to $47 billion—driven in large part by the company’s H100 graphics cards which power generative AI apps like OpenAI’s ChatGPT. According to reports, the Nvidia data center platform, which supercomputing centers have embraced in a big way, is the world’s top accelerated computing solution. It allows incredible performance with fewer and more powerful servers. The profitable data center revenues helped to drive gross margins of over 70%. Nvidia is the clear market leader for chips in AI research and related products. Tech giants such as Alphabet and Meta are well-invested in the AI universe. Meta CEO Mark Zuckerberg stated his company’s computing infrastructure will include a stunning 350,000 H100 cards by the end of this year. The chip giant has been traded sideways for decades. From 1984 to 2018, the stock only traded over $20 only twice. Founded in 1969 by Jerry Sanders, most of the early chips the company produced were of the memory variety. AMD acquired Canadian 3D graphics card company ATI Technologies in a massive cash and stock deal. AMD put the ATI brand out to pasture and renamed the chips with the AMD brand. In 2020, in an all-stock deal, AMD bought Xilinx and created one of the industry’s high-performance and adaptive computing giants. Xilinx developed flexible and adaptive processing, allowing incredible innovation for cloud applications to the edge and intelligent devices. AMD’s acquisition of Xilinx gave them access to the company’s Field-Programmable Gate Array technology, which many feel was a massive boost for AMD. Xlinix had the highest-performing FPGA and, according to reports, AMD also acquired an extensive IP catalog.  AMD is starting to become a force that Nvidia will have to deal with. According to published reports, AMD claims that the firm’s AI accelerators are 1.6 times faster than Nvidia’s. AMD also boasts that the MI300X can train larger models than Nvidia chips. While AMD is rolling out data center chips that can compete with Nvidia, the reality is that executives at Nvidia have stated publicly that Huawei is a massive and perhaps more significant competitor, including producing processors that power many AI systems. While AMD and other companies have made tremendous technological advances in AI, catching up to Nvidia looks unrealistic. The good news for investors in the AI mix is that AMD has a lower stock price and could be poised for the kind of parabolic move Nvidia has enjoyed as more innovation is announced. With that in mind, trading near $1000, it’s an excellent bet that in the not-too-distant future, Nvidia announces a stock split that could likely be as small as 3 for one and as big as 10 for 1. The bottom line for investors is that Nvidia is the AI leader and will likely stay in that position for the foreseeable future.                Take This Retirement Quiz To Get Matched With An Advisor Now (Sponsored) Are you ready for retirement? Planning for retirement can be overwhelming, that’s why it could be a good idea to speak to a fiduciary financial advisor about your goals today. Start by taking this retirement quiz right here from SmartAsset that will match you with up to 3 financial advisors that serve your area and beyond in 5 minutes. Smart Asset is now matching over 50,000 people a month. Click here now to get started. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}