{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.tradingview.com/news/investorplace:b4cc3bacd094b:0-navigating-amd-stock-s-future-short-term-gains-vs-long-term-pains/",
    "text": "AMD AMD stock is likely to continue to climb over the short-to-medium term as investors become more excited about the chip maker’s considerable opportunities in the artificial intelligence space. Over the longer term, however, threats to the firm’s other businesses, along with the high valuation of AMD stock, are likely to drag down the shares or at least meaningfully stunt their momentum. A Large Opportunity in the AI Space On March 4, British bank Barclays predicted that AMD would “sell far more chips for artificial intelligence applications than expected,” Barron’s reported. Specifically, Barclays estimated that the firm’s sales from data-center GPUs, the chips used to produce AI, would come in at $4.5 billion in 2024 and $9.2 billion in 2025. AMD stock itself has predicted that it would obtain more than $3.5 billion from providing such chips this year. As I’ve noted in past columns, I do believe that data centers are indeed looking for alternatives to Nvidia’s NVDA very popular AI chips, since the latter products are, by all accounts, currently very expensive and extremely difficult to obtain. Moreover, the factthat the firm did manage to sell $400 million of AI chips last year, along with its estimate that it can sell $3.5 billion of such semiconductors in 2025, does indicate that there is significant demand for those products. AMD Is Facing Meaningful Threats The firm’s gaming unit posted uninspiring results in its fiscal 2023, contributing greatly to the fact that its overall revenue only increased 4% for the year. Moreover, Goldman Sachs expects that business to continue to experience “significant weakness” during the current quarter and in Q2. As a result, the bank predicts that the average earnings estimates for the firm among Wall Street analysts for Q1 and Q2 will actually decline. Meanwhile, in the last several years, AMD has relied on market share gains versus Intel INTC to fuel much of its top-and-bottom line growth. But the days of AMD having a clear edge over its longtime rival appear to be over, as digitaltrends recently called the battle between the firms “a neck-and-neck race that’s bound to get even more heated.” In other words, Intel appears to have pulled even with AMD, and the competition between them is likely to just get more intense going forward. Moreover, Intel has generally made huge strides under its current CEO, Pat Gelsinger, who took the helm of the firm in February 2021. Assuming the latter trend continues, I think that Intel could easily pull ahead of AMD in many areas in the not-too-distant future. But even assuming that Intel remains “neck-and-neck” with AMD, the latter firm’s days of boosting its sales and profits through market share gains at Intel’s expense are likely largely over. Finally, on March 5, multiple U.S. news outlets reported that the U.S. government had blocked AMD’s efforts to sell advanced AI chips to China. Over the longer term, the firm’s inability to sell such chips to the Asian country could undermine its financial results more than many expect. That’s because, with China unable to obtain top-notch GPUs from American firms, Chinese chip makers will likely invest a great deal of money to improve their products. As a result, they could ultimately easily take market share from AMD in China, not only in AI chips, but in many other types of processors as well. Since China has historically been a very important market for the firm, the latter development may significantly undermine AMD’s financial results over the longer term. Those phenomenon could start occurring by the end of this year or early in 2025. Valuation and the Bottom Line on AMD Stock MDis changing hands at a rather high forward price-earnings ratio of 60 times. That’s significantly higher than the valuations of two of its main competitors –Nvidia and Intel–whose forward P/E ratios are 34 and 33, respectively. Given AMD’s meaningfully more worrisome threats than both those firms, I view the premium of AMD stock as unjustified. So while AMD stock is likely to continue to surge over the next few months as AI euphoria continues, I think it will decline or at least underperform in the second half of this year. Therefore, I think short-term investors and traders can buy the shares, but I advise longer-term investors to sell them. On the date of publication, Larry Ramer held a long position in INTC. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Larry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @dehandreh @yo44ge4real @stvmcg @Arcanebear.eth @retirewithforex @sethsickness @aliams_david_trading_gram @mytradingsetup @fx_bitcoin_expert11 @tradingfrance @mytradingsetup @jordan_fx_ @nav.fx @itzi71 @laptopmoneygang @heinrich_j96 @johndollery @aggressivecalculator Whatever the trade "
}