{
    "title": "Ryzen 7800X3D hailed as a ‘game changer’ for esports",
    "date": "3/14/2024",
    "url": "https://www.kitguru.net/gaming/matthew-wilson/ryzen-7800x3d-hailed-as-a-game-changer-for-esports/",
    "text": "Matthew Wilson \n2 weeks ago\nFeatured Tech News, Software & Gaming  One of Counter-Strike 2's first major esports tournaments is set to kick off soon. For each esports tournament, a lot of thought is put together into the setups the players will be using to ensure that all competitors can play the game at the highest frame rates and fidelity settings available. For CS2's first major, players will be utilising PCs powered by AMD's Ryzen 7 7800X3D processor. As announced by tournament host, PGL, this week, the systems powering the event will include a Ryzen 7 7800X3D processor and a GeForce RTX 4080 graphics card. PGL specifically praises the CPU, calling it a ‘game changer' in the esports arena for its consistent gaming performance.  Obviously, the monitor is also an equally important part of the equation here. For this tournament, players will be using the ZOWIE ZL2566K, a 24.5-inch 1080p monitor with a 360Hz refresh rate, so players will get the fastest frames and lowest latency possible for the competition. The PGL CS2 Major Copenhagen kicks off on the 17th of March and ends on the 31st. 24 teams will be competing during the event, with four final teams then heading to the Royal Arena to compete live, for a prize pool of $1.25 million. Discuss on our Facebook page, HERE. KitGuru Says: Counter-Strike 2's esports debut is upon us. Valve has been consistently updating the game for months to get it in shape for competitive play, so hopefully there are no major upsets or issues during this inaugural major tournament. Become a Patron! Tags 7800X3D AMD Counter Strike 2 CS2 eSports Major news PGL Copenhagen 2024 RTX 4080 Ryzen After eight major releases, HWiNFO is finally getting a built-in OSD, allowing users to see …   DDR5 speed on your next PC: How fast?  View Results "
}