{
    "title": "China blocks use of US-made Intel & AMD chips in govt computers: Report",
    "date": "3/23/2024",
    "url": "https://www.hindustantimes.com/business/china-blocks-use-of-us-made-intel-amd-chips-in-govt-computers-report-101711258683912.html",
    "text": "Subscribe Now! Get features like China has introduced new guidelines that will mean U.S. microprocessors from Intel and AMD are phased out of government personal computers and servers the Financial Times reported on Sunday.According to the report, the guideline is also aimed at sidelining Windows operating system and foreign-made database software in the favour of domestic options. The latest move signals Communist China's initiative to build up its indigenous technology and echo moves in the US as tensions between the two superpowers intensify. ALSO READ: Xi Jinping says China seeks to be friends with US, won’t fight a 'cold or hot war’Washington DC has already imposed sanctions on numerous Chinese firms on national security grounds, and also legislated to encourage more technology products to be manufactured in the United States and blocked exports of advanced chips and related tools to Beijing. The Chinese government officials have begun to follow the new PC, laptop and server guidelines this year, the report added, after they were announced by the Chinese finance ministry and the ministry of industry and information technology last December. On December 26, China's Information Technology Security Evaluation Center had published its first list of “safe and reliable” processors and operating systems. The U.S has been aiming to boost domestic semiconductor output and reduce reliance on China and Taiwan with the Biden administration's 2022 CHIPS and Science Act. It is designed to bolster U.S. semiconductors and contains financial aid for domestic production with subsidies for production of advanced chips. Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}