{
    "title": "Intel Core i3-1215U vs AMD Ryzen 7 7840U vs Intel Core i5-1235U",
    "date": "3/30/2024",
    "url": "https://www.notebookcheck.com/i3-1215U-vs-R7-7840U-vs-i5-1235U_14098_15023_14078.247552.0.html",
    "text": "Der Intel Core i3-1215U ist eine Mid-Range Notebook-CPU auf Basis der neuen Alder-Lake-Architektur, die im Januar 2022 vorgestellt wurde. Die CPU basiert auf den Alder Lake-M Chip (für die U-Serie) und bietet 2 Performance Kerne (P-Kerne, Golden Cove Architektur) und 4 der 8 Effizienzkerne (E-Kerne, Gracemont Architektur). Die P-Kerne unterstützten Hyperthreading (daher gemeinsam 8 Threads) und takten von 1,2 bis 4,4 GHz. Die E-Kerne takten von 0,9 - 3,3 GHz und sollen eine vergleichbare Performance wie alte Skylake Kerne bieten (z.B. i7-6300HQ). Der Core i3 bietet keine vPro Features für Management. \nPerformance \nDurch die 6 Kerne sollte die Multithread-Leistung deutlich oberhalb der alten 15 Watt 2-Kerner der Tiger Lake Serie liegen (wie z.B. dem i3-1115G4). Bei der Einzelkernperformance sollte der i3 dank der neuen Architektur auch ähnlich hoch getaktete Tiger Lake CPUs abhängen können. \nGrafikeinheit \nWie auch der Vorgänger, integriert Intel in Alder Lake eine Intel Xe basierende Grafikeinheit. Beim 1215U sind 64 der 96 EUs aktiviert und takten mit bis zu 1,1 GHz. \nFeatures \nWie auch Tiger Lake, hat auch Alder-Lake-P WiFi 6E und Thunderbolt 4 (4x) teilintegriert. Der integrierte Speicherkontroller unterstützt DDR5-4800, DDR4-3200, LPDDR5-5200 und LPDDR4x-4267. Der integrierte Gaussian and Neural Accelerator (GNA) ist nun in Version 3.0 verbaut. Die Media Engine Quick Sync 8 ist die selbe wie in Rocket Lake und unterstützt MPEG-2, AVC, VC-1 Decode, JPEG, VP8 Decode, VP9, HEVC und AV1 Decode. Der Chip unterstützt nur PCIe 4.0 (x8 for GPU und zwei x4 für SSDs). \nLeistungsaufnahme \nDer Intel Core i3-1215U ist mit 15 Watt (PL1) TDP und 55 Watt (PL2) max. Turbo Power angegeben. Gefertigt wird der Prozessor im modernen Intel 7 Prozess (10 nm). Der Intel Core i3-1215U ist eine Mid-Range Notebook-CPU auf Basis der neuen Alder-Lake-Architektur, die im Januar 2022 vorgestellt wurde. Die CPU basiert auf den Alder Lake-M Chip (für die U-Serie) und bietet 2 Performance Kerne (P-Kerne, Golden Cove Architektur) und 4 der 8 Effizienzkerne (E-Kerne, Gracemont Architektur). Die P-Kerne unterstützten Hyperthreading (daher gemeinsam 8 Threads) und takten von 1,2 bis 4,4 GHz. Die E-Kerne takten von 0,9 - 3,3 GHz und sollen eine vergleichbare Performance wie alte Skylake Kerne bieten (z.B. i7-6300HQ). Der Core i3 bietet keine vPro Features für Management. Performance Durch die 6 Kerne sollte die Multithread-Leistung deutlich oberhalb der alten 15 Watt 2-Kerner der Tiger Lake Serie liegen (wie z.B. dem i3-1115G4). Bei der Einzelkernperformance sollte der i3 dank der neuen Architektur auch ähnlich hoch getaktete Tiger Lake CPUs abhängen können. Grafikeinheit Wie auch der Vorgänger, integriert Intel in Alder Lake eine Intel Xe basierende Grafikeinheit. Beim 1215U sind 64 der 96 EUs aktiviert und takten mit bis zu 1,1 GHz. Features Wie auch Tiger Lake, hat auch Alder-Lake-P WiFi 6E und Thunderbolt 4 (4x) teilintegriert. Der integrierte Speicherkontroller unterstützt DDR5-4800, DDR4-3200, LPDDR5-5200 und LPDDR4x-4267. Der integrierte Gaussian and Neural Accelerator (GNA) ist nun in Version 3.0 verbaut. Die Media Engine Quick Sync 8 ist die selbe wie in Rocket Lake und unterstützt MPEG-2, AVC, VC-1 Decode, JPEG, VP8 Decode, VP9, HEVC und AV1 Decode. Der Chip unterstützt nur PCIe 4.0 (x8 for GPU und zwei x4 für SSDs). Leistungsaufnahme Der Intel Core i3-1215U ist mit 15 Watt (PL1) TDP und 55 Watt (PL2) max. Turbo Power angegeben. Gefertigt wird der Prozessor im modernen Intel 7 Prozess (10 nm). Der AMD Ryzen 7 7840U ist ein High-End-Notebook-Prozessor der Phoenix Serie mit 8-Kernen und Hyperthreading (SMT), womit dieser in Summe bis zu 16 Threads gleichzeitig verarbeiten kann. Die CPU nutzt die neue Zen 4 Architektur und taktet diese von 3,3 GHz (Basistakt) bis zu 5,1 GHz (Einzelkern-Boost). Die CPU bietet 8 MB L2-Cache und 16 MB L3-Cache. \nDurch den geringeren TDP, sollte die Leistung etwas unterhalb des Ryzen 7 7840HS liegen. Der schnellste alte U-Prozessor, der Ryzen 7 PRO 6850U sollte deutlich abgehängt werden. \nDer Chip integriert eine moderne RDNA 3 basierende Grafikkarte (iGPU) namens Radeon 780M mit 12 CUs und bis zu 2,7GHz inklusive AV1 Video-Engine. Erstmals ist auch eine Xilinx FPGA basierte XDNA AI Beschleuniger integriert. Dieser soll schneller sein als die AI-Engine im Apple M2 SoC. An Anschlüssen bietet Phoenix 2x USB 4 (40 Gbps), 20 PCIe 4.0 Lanes und einen Dual-Channel DDR5-5600 / LPDDR5x-7500 Speicherkontroller (mit ECC Support). \nDie Phoenix Serie ist ein einzelner Chip (im Unterschied zur Dragon Range 7045HX Serie) und wird bei TSMC im modernen 4nm FinFET Prozess gefertigt. Der TDP ist von AMD mit 28 Watt spezifiziert und kann von 15 bis 30 Watt konfiguriert werden vom Hersteller. Der AMD Ryzen 7 7840U ist ein High-End-Notebook-Prozessor der Phoenix Serie mit 8-Kernen und Hyperthreading (SMT), womit dieser in Summe bis zu 16 Threads gleichzeitig verarbeiten kann. Die CPU nutzt die neue Zen 4 Architektur und taktet diese von 3,3 GHz (Basistakt) bis zu 5,1 GHz (Einzelkern-Boost). Die CPU bietet 8 MB L2-Cache und 16 MB L3-Cache. Durch den geringeren TDP, sollte die Leistung etwas unterhalb des Ryzen 7 7840HS liegen. Der schnellste alte U-Prozessor, der Ryzen 7 PRO 6850U sollte deutlich abgehängt werden. Der Chip integriert eine moderne RDNA 3 basierende Grafikkarte (iGPU) namens Radeon 780M mit 12 CUs und bis zu 2,7GHz inklusive AV1 Video-Engine. Erstmals ist auch eine Xilinx FPGA basierte XDNA AI Beschleuniger integriert. Dieser soll schneller sein als die AI-Engine im Apple M2 SoC. An Anschlüssen bietet Phoenix 2x USB 4 (40 Gbps), 20 PCIe 4.0 Lanes und einen Dual-Channel DDR5-5600 / LPDDR5x-7500 Speicherkontroller (mit ECC Support). Die Phoenix Serie ist ein einzelner Chip (im Unterschied zur Dragon Range 7045HX Serie) und wird bei TSMC im modernen 4nm FinFET Prozess gefertigt. Der TDP ist von AMD mit 28 Watt spezifiziert und kann von 15 bis 30 Watt konfiguriert werden vom Hersteller. Der Intel Core i5-1235U ist eine Mid-Range Notebook-CPU auf Basis der neuen Alder-Lake-Architektur, die im Januar 2022 vorgestellt wurde. Die CPU basiert auf den Alder Lake-M Chip (für die U-Serie) und bietet 2 Performance Kerne (P-Kerne, Golden Cove Architektur) und 8 Effizienzkerne (E-Kerne, Gracemont Architektur). Die P-Kerne unterstützten Hyperthreading (daher gemeinsam 12 Threads) und takten von 1,3 bis 4,4 GHz. Die E-Kerne takten von 0,9 - 3,3 GHz und sollen eine vergleichbare Performance wie alte Skylake Kerne bieten (z.B. i7-6300HQ). Im Vergleich zum ähnlichen Core i5-1245U, bietet der 1235 geringere Basistaktraten und nur \"Essentials\" vPro Features. \nPerformance \nDurch die 10 Kerne sollte die Multithread-Leistung deutlich oberhalb der alten 15 Watt 4-Kerner der Tiger Lake Serie liegen (wie z.B. dem i7-1160G7). Im Vergleich zu der H-Serie wird bei längerer Last aber der TDP die Leistung limitieren. Bei der Einzelkernperformance sollte der i5 dank der neuen Architektur auch ähnlich hoch getaktete Tiger Lake CPUs abhängen können. \nGrafikeinheit \nWie auch der Vorgänger, integriert Intel in Alder Lake eine Intel Xe basierende Grafikeinheit. Beim 1235U sind 80 der 96 EUs aktiviert und takten mit bis zu 1,2 GHz. \nFeatures \nWie auch Tiger Lake, hat auch Alder-Lake-P WiFi 6E und Thunderbolt 4 (4x) teilintegriert. Der integrierte Speicherkontroller unterstützt DDR5-4800, DDR4-3200, LPDDR5-5200 und LPDDR4x-4267. Der integrierte Gaussian and Neural Accelerator (GNA) ist nun in Version 3.0 verbaut. Die Media Engine Quick Sync 8 ist die selbe wie in Rocket Lake und unterstützt MPEG-2, AVC, VC-1 Decode, JPEG, VP8 Decode, VP9, HEVC und AV1 Decode. Der Chip unterstützt nur PCIe 4.0 (x8 for GPU und zwei x4 für SSDs). \nLeistungsaufnahme \nDer Intel Core i5-1235U ist mit 15 Watt (PL1) TDP und 55 Watt (PL2) max. Turbo Power angegeben. Gefertigt wird der Prozessor im modernen Intel 7 Prozess (10 nm). Der Intel Core i5-1235U ist eine Mid-Range Notebook-CPU auf Basis der neuen Alder-Lake-Architektur, die im Januar 2022 vorgestellt wurde. Die CPU basiert auf den Alder Lake-M Chip (für die U-Serie) und bietet 2 Performance Kerne (P-Kerne, Golden Cove Architektur) und 8 Effizienzkerne (E-Kerne, Gracemont Architektur). Die P-Kerne unterstützten Hyperthreading (daher gemeinsam 12 Threads) und takten von 1,3 bis 4,4 GHz. Die E-Kerne takten von 0,9 - 3,3 GHz und sollen eine vergleichbare Performance wie alte Skylake Kerne bieten (z.B. i7-6300HQ). Im Vergleich zum ähnlichen Core i5-1245U, bietet der 1235 geringere Basistaktraten und nur \"Essentials\" vPro Features. Performance Durch die 10 Kerne sollte die Multithread-Leistung deutlich oberhalb der alten 15 Watt 4-Kerner der Tiger Lake Serie liegen (wie z.B. dem i7-1160G7). Im Vergleich zu der H-Serie wird bei längerer Last aber der TDP die Leistung limitieren. Bei der Einzelkernperformance sollte der i5 dank der neuen Architektur auch ähnlich hoch getaktete Tiger Lake CPUs abhängen können. Grafikeinheit Wie auch der Vorgänger, integriert Intel in Alder Lake eine Intel Xe basierende Grafikeinheit. Beim 1235U sind 80 der 96 EUs aktiviert und takten mit bis zu 1,2 GHz. Features Wie auch Tiger Lake, hat auch Alder-Lake-P WiFi 6E und Thunderbolt 4 (4x) teilintegriert. Der integrierte Speicherkontroller unterstützt DDR5-4800, DDR4-3200, LPDDR5-5200 und LPDDR4x-4267. Der integrierte Gaussian and Neural Accelerator (GNA) ist nun in Version 3.0 verbaut. Die Media Engine Quick Sync 8 ist die selbe wie in Rocket Lake und unterstützt MPEG-2, AVC, VC-1 Decode, JPEG, VP8 Decode, VP9, HEVC und AV1 Decode. Der Chip unterstützt nur PCIe 4.0 (x8 for GPU und zwei x4 für SSDs). Leistungsaufnahme Der Intel Core i5-1235U ist mit 15 Watt (PL1) TDP und 55 Watt (PL2) max. Turbo Power angegeben. Gefertigt wird der Prozessor im modernen Intel 7 Prozess (10 nm). #0 checking url part for id 14098 +0s ... 0s #1 checking url part for id 15023 +0s ... 0s #2 checking url part for id 14078 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.035s ... 0.036s #6 did output specs +0s ... 0.036s #7 getting avg benchmarks for device 14098 +0.016s ... 0.052s #8 got single benchmarks 14098 +0.024s ... 0.076s #9 getting avg benchmarks for device 15023 +0.017s ... 0.092s #10 got single benchmarks 15023 +0.027s ... 0.119s #11 getting avg benchmarks for device 14078 +0.014s ... 0.133s #12 got single benchmarks 14078 +0.075s ... 0.208s #13 got avg benchmarks for devices +0s ... 0.208s #14 No cached benchmark found, getting uncached values +0.157s ... 0.366s #15 min, max, avg, median took s +0.215s ... 0.581s #16 return log +0s ... 0.581s "
}