{
    "title": "AMD Chair & CEO Dr. Lisa Su to Deliver Opening Keynote at COMPUTEX 2024",
    "date": "3/25/2024",
    "url": "https://www.wboy.com/business/press-releases/cision/20240326HK70787/amd-chair-ceo-dr-lisa-su-to-deliver-opening-keynote-at-computex-2024",
    "text": "WBOY.com Please enter a search term. Please enter a search term. News provided by Mar 26, 2024, 12:05 AM\t\t\t\t\t\tET TAIPEI, March 26, 2024 /PRNewswire/ -- TAITRA (Taiwan External Trade Development Council) announced that Dr. Lisa Su, Chair and CEO of AMD, will deliver the COMPUTEX 2024 Opening Keynote at the Taipei Nangang Exhibition Center Hall 2 7F on Monday, June 3, at 9:30 AM (UCT+8), with a session entitled \"The future of high-performance computing in the AI era.\"  With the certainty that 2024 will continue to drive focus on AI and its capabilities for companies around the world, Dr. Su's opening keynote at COMPUTEX 2024 will explore how AMD, together with its strategic technology partners, is pushing the limits of AI and high-performance computing from the data center to the edge and end-user devices. \"I'm honored to open COMPUTEX 2024 to highlight the latest AI and computing solutions from AMD and our partners,\" said Dr. Lisa Su, AMD Chair and CEO. \"AI is the most transformational technology of the last 50 years and the future of computing. COMPUTEX 2024 provides an excellent opportunity to bring the entire ecosystem together and highlight how we are working together across the industry to deploy the next-generation of AI solutions that will improve our daily lives.\" COMPUTEX 2024 with the theme \"Connecting AI,\" is set to take place from June 4th to June 7th. The event will feature 1,500 exhibitors using 4,500 booths, showcasing six major themes: AI Computing, Advanced Connectivity, Future Mobility, Immersive Reality, Sustainability, and Innovations. Registration for COMPUTEX Keynote is now open. For more information, please visit https://www.computextaipei2024.com.tw/en/index.aspx. For more exhibition information: COMPUTEX: https://www.computextaipei.com.tw/en/index.htmlInnoVEX: www.innovex.com.tw About COMPUTEX COMPUTEX was founded in 1981. It has grown with the global ICT industry and become stronger over the last four decades. Bearing witness to historical moments in the development of and changes in the industry, COMPUTEX attracts more than 40,000 buyers to visit Taiwan every year. It is also the preferred platform chosen by top international companies for launching epoch-making products. Taiwan has a comprehensive global ICT industry chain. Gaining a foothold in Taiwan, COMPUTEX is jointly held by the Taiwan External Trade Development Council and Taipei Computer Association, aiming to build a global tech ecosystem. COMPUTEX uses cross-domain integration and innovation services as the most powerful driving forces for achieving the goal of becoming a new platform for global technological resources. About TAITRA: Founded in 1970, TAITRA is Taiwan's foremost nonprofit trade-promoting organization. Sponsored by the government and industry organizations, TAITRA assists enterprises in expanding their global reach. Headquartered in Taipei, TAITRA has a team of 1,300 specialists and operates 5 local offices as well as 62 branches worldwide. Together with Taipei World Trade Center (TWTC) and Taiwan Trade Center (TTC), TAITRA has formed a global network dedicated to promoting world trade. TAITRA's five local branch offices in Taoyuan, Hsinchu, Taichung, Tainan, and Kaohsiung provide services to companies outside metropolitan Taipei. Through these domestic offices, TAITRA is able to maintain close contact and interaction with local companies in their respective areas and provide direct and substantial services in areas such as feature trade promotion, business information, market seminars, on-the-job training, procurement meetings, meeting room rental, etc. Branch offices play vital roles in Taiwan Trade Shows coordination between Taipei headquarters and local companies, and invite buyers to visit local industries. View original content to download multimedia:https://www.prnewswire.com/news-releases/amd-chair--ceo-dr-lisa-su-to-deliver-opening-keynote-at-computex-2024-302098919.html SOURCE  COMPUTEX NOTE: This content is not written by or endorsed by \"WBOY\", its advertisers, or Nexstar Media Inc. "
}