{
    "title": "Lords of the Fallen Patch 1.1.598 brings performance optimizations, AMD \nstability improvements and PVP balance ...",
    "date": "3/15/2024",
    "url": "https://www.dsogaming.com/patches/lords-of-the-fallen-patch-1-1-598/",
    "text": "Hexworks has released Title Update v.1.1.598 for Lords of the Fallen. According to the devs, this latest patch brings to the game performance optimizations, AMD stability improvements and PVP balance tweaks. Going into more details, in Patch 1.1.598, Hexworks made some changes to how the game loads levels to make it run smoother in certain areas like Skyrest Bridge and near the big boss fight with the Sundered Monarch. Also, the devs teamed up with AMD to fix crashes that were happening on AMD’s graphics cards. So now, if you’re playing on an AMD GPU, the game should be more stable. As said, Title Update 1.1.598 also packs numerous PVP balance tweaks. For example, the PVP damage multiplier was reduced from 0.5 to 0.25. Additionally, the PVP Status Effect buildup multiplier was decreased from 0.66 to 0.5. The dual wield status effect buildup was also reduced from 1.0 to 0.7, and the devs have made an overall balancing pass of spells. In Version 1.1.598, matchmaking now only pairs up players who have the same game version. This means you’ll be playing against others with the same updates as you. Also, the devs fixed a problem where some special holy weapons were doing extra magic damage during invasions. Along with that, they sorted out a bunch of visual bugs and other problems in the game. Like always, Steam will download this update the next time you launch its client. Below you can also find its complete changelog. John is the founder and Editor in Chief at DSOGaming. He is a PC gaming fan and highly supports the modding and indie communities. Before creating DSOGaming, John worked on numerous gaming websites. While he is a die-hard PC gamer, his gaming roots can be found on consoles. John loved – and still does – the 16-bit consoles, and considers SNES to be one of the best consoles. Still, the PC platform won him over consoles. That was mainly due to 3DFX and its iconic dedicated 3D accelerator graphics card, Voodoo 2. John has also written a higher degree thesis on the “The Evolution of PC graphics cards.”\nContact: Email "
}