{
    "title": "How to Prevent Macular Degeneration",
    "date": "3/3/2024",
    "url": "https://www.health.com/macular-degeneration-prevention-8580455",
    "text": "PeopleImages / Getty Images Macular degeneration, or age-related macular degeneration (AMD), is a form of vision loss that affects your ability to see things in the center of your vision. Some people a higher risk of developing AMD. This includes those with a family history of the condition, people who have obesity, and people who smoke. While there’s no way to reverse or completely stop macular degeneration, there are ways to prevent or slow its progression. AMD is a leading cause of vision loss in those older than 60 and is a progressive disease, worsening over time. It occurs due to aging-related changes to the macula, which is the central portion of the retina—the layer of light-sensitive cells in the back of the eye critical for vision. While aging is not preventable, understanding your other risks of AMD can help you take steps to reduce your risk as you age. Though all people are susceptible to macular degeneration, certain populations are at increased risk. Since this condition is associated with aging, older adults—those over 55—are more likely to have it. Only 2% of those 40 to 44 have AMD; this figure rises to 46.6% among those older than 85. Another consistent risk factor is tobacco smoking. The damage to the macula occurs due to toxic compounds found in smoke, which can both directly damage the macula and affect blood circulation in the eye. Oxidative stress—when the body can’t get rid of toxic compounds called reactive oxygen species—results from smoking and can damage your eyes. Excessive body fat or obesity—which is clinically defined as a body mass index (BMI) of 30 or higher—is another risk factor for macular degeneration. BMI is calculated by dividing your weight in kilograms (kg) by your height in meters squared (m²), meaning the formula is BMI = kg/m2. As with smoking, both being overweight and having obesity are linked with oxidative stress, inflammation (which is part of your body’s immune response), and blood cholesterol levels, all of which can cause damage to the macula. Disclaimer: Body Mass Index, or BMI, is a biased and outdated metric that uses your weight and height to make assumptions about body fat, and by extension, your health. This metric is flawed in many ways and does not factor in your body composition, ethnicity, sex, race, and age. Despite its flaws, the medical community still uses BMI because it’s an inexpensive and quick way to analyze health data. Researchers have found that having hypertension (high blood pressure) increases your risk of macular degeneration. At this time, it is thought that this is due to the damage and narrowing of blood vessels in the retina. This leads to areas of dead cells in the macula (geographic atrophy) as well as wet age-related macular degeneration (wet AMD), a severe form of AMD caused by abnormal vessel growth. High cholesterol, or hyperlipidemia, is another risk factor. Higher high-density lipoprotein (HDL) cholesterol levels can lead to advanced or wet AMD. Raised total cholesterol is associated with an increased risk of geographic atrophy. Cholesterol makes up more than 40% of drusen—buildups in the macula that are an early sign of AMD. Researchers have consistently found diabetes, a chronic inability to digest sugars, to raise the risk of macular degeneration, especially the wet form. Among the health effects of diabetes, is retinopathy—damage to the retina. In addition, this chronic disease raises inflammation and oxidative stress, which can damage the macula. Studies have found white people to have higher rates of early, intermediate, and advanced AMD, compared to African Americans (who have the lowest risk), Hispanic people, and Asian Americans. More research is needed to understand why this is the case and if certain genetic markers play a role. Several genes have been associated with an increased likelihood of developing AMD, although more unidentified genes may also contribute. This makes family history a major risk factor for AMD. Mutations of complement factor H (CPH), a gene associated with immune function, can lead to drusen buildup and raise your overall risk of AMD. This is also the case for age-related maculopathy sensitivity 2 (ARMS 2), which researchers have linked to both macular degeneration onset and progression. Currently, genetic testing is not recommended for macular degeneration. The results of such tests don’t affect how macular degeneration treatment is performed at this time. While there’s no guaranteed way to prevent macular degeneration, there is a lot you can do to reduce your risk and slow down progression. Screening for this condition can help optometrists (eye doctors) or ophthalmologists (specialty eye doctors) identify the condition before symptoms begin and when medical treatments are likely to be most effective. In addition, lifestyle changes play a central role in prevention and management. Especially if you’re at increased risk for AMD, you should get your eyes checked annually. This involves a full optometric exam, testing your visual acuity (how well you focus near and far), and detecting any early signs of AMD or other eye conditions. Regularly screening for AMD and early detection is critical for both prevention and management. Optometrists or ophthalmologists use the slit lamp exam—a high-intensity light and high-powered microscope—to examine your macula for drusen or other signs of damage. During the test, your pupils are dilated (enlarged using a temporary eye drop), allowing them to take a closer look. Among many other negative health effects, cigarette smoking is a major risk factor for macular degeneration. If you smoke, quitting can help prevent onset and slow the progress of this condition. Talk to your healthcare provider about techniques and strategies to quit, if needed. Studies have found that taking combinations of certain vitamins and minerals may help with preventing macular degeneration. A type of supplement called AREDS 2 is sometimes recommended as a means of slowing down the progression of AMD. This includes: Always consult your healthcare provider before adding a supplement to your treatment regimen. Good nutrition can help manage various risk factors associated with AMD, such as obesity and high blood pressure, while also helping to prevent AMD itself. In particular, studies have found that incorporating the Mediterranean diet reduces the risk of advanced AMD by 41%. Features of this diet include: In addition, reducing or stopping alcohol consumption may also help. Talk to your healthcare provider about methods that can help you incorporate healthier eating habits, if needed. Ensuring you're getting regular, moderate-intensity physical activity can be another way to manage risk factors for macular degeneration, helping to both prevent onset and slow AMD’s progress. Even small changes can help. Studies have found that as little as three hours of moderate to light activity (like walking or swimming) a week can have significant effects on your health. Since chronic conditions, such as high blood pressure, high cholesterol, and obesity, increase your risk, managing them can be another means of AMD prevention. In addition to making lifestyle changes, this may involve taking medications, such as statins like Lipitor (atorvastatin) for high cholesterol, or calcium channel blockers (Norvasc (amlodipine)), ACE inhibitors (Prinivil (lisinopril)), or others for hypertension. Light contains ultraviolet (UV) rays, which can damage your retina. Wearing wraparound sunglasses that block UV-B rays (typically labeled “UV 400”) may help, especially if you’re often exposed to direct sunlight. In addition, wearing glasses that block blue frequencies in light can also prevent AMD onset and slow progression. Ensuring you’re getting enough sleep can also help. Studies have linked getting fewer than 6 hours of sleep a night with an increased risk of wet AMD. Others noted that sleeping too much—more than 8 hours—raises macular degeneration risk. If you’re an adult, aim to get 7 to 8 hours a night; children and infants need more. Try to go to bed and get up at consistent times and avoid working, using screens, or watching TV in bed. If you have a family history of macular degeneration or are living with increased risk, talk to your optometrist or ophthalmologist about your concerns about developing macular degeneration. Ask them about any preventive measures you can take and develop a plan for regularly checking for the condition. It can also help to consult with them if you’re considering adopting any lifestyle or medical changes, as they can help you determine what types of changes are best for you. Macular degeneration is a common form of age-related vision loss that affects central vision. It typically begins during older age and worsens as you continue to age. Other risk factors for this condition include smoking and having various co-occurring conditions, such as high blood pressure, high cholesterol, and obesity. Prevention methods, which often address these factors, include everything from making dietary or lifestyle changes to taking medications and/or supplements. Ruia S, Kaufman EJ. Macular degeneration. In: StatPearls. StatPearls Publishing; 2024. Centers for Disease Control and Prevention. Prevalence of age-related macular degeneration (AMD). Velilla S, García-Medina JJ, García-Layana A, et al. Smoking and age-related macular degeneration: review and update. J Ophthalmol. 2013;2013:895147. doi:10.1155/2013/895147 Zhang QY, Tie LJ, Wu SS, et al. Overweight, obesity, and risk of age-related macular degeneration. Invest Ophthalmol Vis Sci. 2016;57(3):1276. doi:10.1167/iovs.15-18637 Xu X, Ritz B, Coleman A, et al. Hypertension, antihypertensive medications use and risk of age-related macular degeneration in California Teachers Cohort. J Hum Hypertens. 2020;34(8):568-576. doi:10.1038/s41371-019-0269-9 Thomas CJ, Mirza RG, Gill MK. Age-related macular degeneration. Medical Clin North America. 2021;105(3):473-491. doi:10.1016/j.mcna.2021.01.003 Fan Q, Maranville JC, Fritsche L, et al. HDL-cholesterol levels and risk of age-related macular degeneration: a multiethnic genetic study using Mendelian randomization. Int J Epidemiol. 2017;46(6):1891-1902. doi:10.1093/ije/dyx189 Chen X, Rong SS, Xu Q, et al. Diabetes mellitus and risk of age-related macular degeneration: a systematic review and meta-analysis. PLoS One. 2014;9(9):e108196. doi:10.1371/journal.pone.0108196 Di Carlo E, Augustin AJ. Prevention of the onset of age-related macular degeneration. J Clin Med. 2021;10(15):3297. doi:10.3390/jcm10153297 Stahl A. The diagnosis and treatment of age-related macular degeneration. Dtsch Arztebl Int. 2020;117(29-30):513-520. doi:10.3238/arztebl.2020.0513 Centers for Disease Control and Prevention. How much sleep do I need? "
}