{
    "title": "Advanced Micro Devices (NASDAQ:AMD) Price Target Increased to $235.00 by \nAnalysts at Mizuho",
    "date": "3/9/2024",
    "url": "https://www.defenseworld.net/2024/03/09/advanced-micro-devices-nasdaqamd-price-target-increased-to-235-00-by-analysts-at-mizuho.html",
    "text": "New Rank-Based ScoringMarketRank™ is calculated by averaging available category scores (with extra weight given to analysis and valuation), then ranking the company's weighted average against that of other companies. 3.92 out of 5 stars 166th out of 594 stocks 25th out of 88 stocks Advanced Micro Devices has received a consensus rating of Moderate Buy. The company's average rating score is 2.89, and is based on 25 buy ratings, 3 hold ratings, and no sell ratings. According to analysts' consensus price target of $181.82, Advanced Micro Devices has a forecasted upside of 0.7% from its current price of $180.49. Advanced Micro Devices has been the subject of 23 research reports in the past 90 days, demonstrating strong analyst interest in this stock. Advanced Micro Devices does not currently pay a dividend. Advanced Micro Devices does not have a long track record of dividend growth. In the past three months, Advanced Micro Devices insiders have sold more of their company's stock than they have bought. Specifically, they have bought $0.00 in company stock and sold $59,919,994.00 in company stock. Only 0.73% of the stock of Advanced Micro Devices is held by insiders. 71.34% of the stock of Advanced Micro Devices is held by institutions. High institutional ownership can be a signal of strong market trust in this company. Earnings for Advanced Micro Devices are expected to grow by 58.05% in the coming year, from $2.67 to $4.22 per share. The P/E ratio of Advanced Micro Devices is 347.10, which means that it is trading at a more expensive P/E ratio than the market average P/E ratio of about 135.88. The P/E ratio of Advanced Micro Devices is 347.10, which means that it is trading at a more expensive P/E ratio than the Computer and Technology sector average P/E ratio of about 252.12. Advanced Micro Devices has a PEG Ratio of 2.70. PEG Ratios above 1 indicate that a company could be overvalued. Advanced Micro Devices has a P/B Ratio of 5.22. P/B Ratios above 3 indicate that a company could be overvalued with respect to its assets and liabilities. Advanced Micro Devices, Inc., also known as AMD, is a semiconductor company operating in the global market. The company was incorporated in 1969 and is one of the oldest semiconductor manufacturers on the market today. Headquartered in Santa Clara, California, Advanced Micro Devices is fundamental to most verticals within the global economy.\nAdvanced Micro Devices operates in two segments; Computing And Graphics and Enterprise, Embedded, and Semi-Custom. Advanced Micro Devices products span a range of semiconductor applications including microprocessors, chipsets, GPUs, data centers, system-on-a-chip, development services, and technology for gaming consoles which gives it some of the broadest exposure of any semiconductor company today.\nAdvanced Micro Devices markets its high-performance products under a host of brands that include AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, AMD FX, AMD A-Series, AMD PRO A-Series, AMD Radeon graphics, and AMD Embedded Radeon graphics brands and there are pro-models available in all categories.\nThe company serves OEMs across all verticals, cloud service providers, independent distributors, online retailers, and add-in-board manufacturers through a network of direct sales, independent distributors, and sales representatives that have offices in all major markets.\nAdvanced Micro Devices is run by a team of industry-leading innovators who believe in the concepts of high-performance and adaptive computing. Adaptive Computing is a technology that can learn and alter its functioning and adapt to meet the needs of its users. The push toward adaptive computing is being led by Dr. Lisa Su who joined the team in 2012 as a Senior Vice President and is now Chairman of the Board and CEO. Before joining Advance Micro Devices Dr. Su spent 18 years working in various positions at two other very high-profile semiconductor companies that are still in operation today.\nThe factor that makes AMD stand out from the crowd is its twin focus on high-performance computing and high-performance graphics. This focus gives AMD an edge over the competition because it is the best at combining the two aspects into custom solutions that are driving innovations and advancements in other industries and fields of research. The latest innovation, and one hailed as the biggest advance in CPU cache technology in over a decade, is the creation of the AMD EPYC processors which include AMDs 3-D V-Cache technology. The V-Cache technology alters the way data is stored in the cache and is resulting in up to 66% improvement in performance.\nIf quality, performance, leadership, and innovation aren’t enough to sway an investor Advanced Micro Devices is also a leader in the push toward sustainable and green operations. The company is on track to meet the four pillars of its plan which are 1) a 50% reduction in greenhouse gas emissions by 2030 2) reach a 30X increase in efficiency for many of its processors 3) 100% of suppliers must have public GHG goals and 4) 80% of suppliers sourcing renewable energy by 2025. Advanced Micro Devices, Inc., also known as AMD, is a semiconductor company operating in the global market. The company was incorporated in 1969 and is one of the oldest semiconductor manufacturers on the market today. Headquartered in Santa Clara, California, Advanced Micro Devices is fundamental to most verticals within the global economy. Advanced Micro Devices operates in two segments; Computing And Graphics and Enterprise, Embedded, and Semi-Custom. Advanced Micro Devices products span a range of semiconductor applications including microprocessors, chipsets, GPUs, data centers, system-on-a-chip, development services, and technology for gaming consoles which gives it some of the broadest exposure of any semiconductor company today. Advanced Micro Devices markets its high-performance products under a host of brands that include AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, AMD FX, AMD A-Series, AMD PRO A-Series, AMD Radeon graphics, and AMD Embedded Radeon graphics brands and there are pro-models available in all categories. The company serves OEMs across all verticals, cloud service providers, independent distributors, online retailers, and add-in-board manufacturers through a network of direct sales, independent distributors, and sales representatives that have offices in all major markets. Advanced Micro Devices is run by a team of industry-leading innovators who believe in the concepts of high-performance and adaptive computing. Adaptive Computing is a technology that can learn and alter its functioning and adapt to meet the needs of its users. The push toward adaptive computing is being led by Dr. Lisa Su who joined the team in 2012 as a Senior Vice President and is now Chairman of the Board and CEO. Before joining Advance Micro Devices Dr. Su spent 18 years working in various positions at two other very high-profile semiconductor companies that are still in operation today. The factor that makes AMD stand out from the crowd is its twin focus on high-performance computing and high-performance graphics. This focus gives AMD an edge over the competition because it is the best at combining the two aspects into custom solutions that are driving innovations and advancements in other industries and fields of research. The latest innovation, and one hailed as the biggest advance in CPU cache technology in over a decade, is the creation of the AMD EPYC processors which include AMDs 3-D V-Cache technology. The V-Cache technology alters the way data is stored in the cache and is resulting in up to 66% improvement in performance. If quality, performance, leadership, and innovation aren’t enough to sway an investor Advanced Micro Devices is also a leader in the push toward sustainable and green operations. The company is on track to meet the four pillars of its plan which are 1) a 50% reduction in greenhouse gas emissions by 2030 2) reach a 30X increase in efficiency for many of its processors 3) 100% of suppliers must have public GHG goals and 4) 80% of suppliers sourcing renewable energy by 2025. Sign-up to receive the latest news and ratings for Advanced Micro Devices and its competitors with MarketBeat's FREE daily newsletter. Wondering what the next stocks will be that hit it big, with solid fundamentals? Click the link below to learn more about how your portfolio could bloom. Here are some ways that investors could benefit from investing in Advanced Micro Devices, Inc.: Investors should be bearish about investing in Advanced Micro Devices, Inc. for these reasons: 28 Wall Street research analysts have issued \"buy,\" \"hold,\" and \"sell\" ratings for Advanced Micro Devices in the last twelve months. There are currently 3 hold ratings and 25 buy ratings for the stock. The consensus among Wall Street research analysts is that investors should \"moderate buy\" AMD shares. View AMD analyst ratings or view top-rated stocks. 28 brokers have issued 1-year price objectives for Advanced Micro Devices' stock. Their AMD share price targets range from $110.00 to $270.00. On average, they anticipate the company's share price to reach $181.82 in the next twelve months. This suggests a possible upside of 0.7% from the stock's current price. View analysts price targets for AMD or view top-rated stocks among Wall Street analysts. Advanced Micro Devices' stock was trading at $147.41 on January 1st, 2024. Since then, AMD shares have increased by 22.4% and is now trading at $180.49. View the best growth stocks for 2024 here. Advanced Micro Devices saw a increase in short interest in March. As of March 15th, there was short interest totaling 38,540,000 shares, an increase of 12.1% from the February 29th total of 34,380,000 shares. Based on an average daily volume of 76,110,000 shares, the short-interest ratio is presently 0.5 days. View Advanced Micro Devices' Short Interest. The company is scheduled to release its next quarterly earnings announcement on Tuesday, May 7th 2024. View our AMD earnings forecast. Advanced Micro Devices, Inc. (NASDAQ:AMD) issued its quarterly earnings data on Tuesday, January, 30th. The semiconductor manufacturer reported $0.77 earnings per share for the quarter, beating analysts' consensus estimates of $0.77 by $0.00. The semiconductor manufacturer had revenue of $6.17 billion for the quarter, compared to analyst estimates of $6.13 billion. Advanced Micro Devices had a net margin of 3.77% and a trailing twelve-month return on equity of 5.73%. The business's revenue for the quarter was up 10.2% on a year-over-year basis. During the same quarter in the previous year, the company posted $0.54 earnings per share. Read the conference call transcript. ETFs with the largest weight of Advanced Micro Devices (NASDAQ:AMD) stock in their portfolio include Simplify Volt RoboCar Disruption and Tech ETF (VCAR), AOT Growth & Innovation ETF (AOTG), AXS Esoterica NextG Economy ETF (WUGI), Strive U.S. Semiconductor ETF (SHOC), iShares Semiconductor ETF (SOXX), Invesco PHLX Semiconductor ETF (SOXQ), VanEck Video Gaming and eSports ETF (ESPO) and Direxion Daily Semiconductors Bull 3x Shares (SOXL). Advanced Micro Devices issued an update on its first quarter 2024 earnings guidance on Tuesday, January, 30th. The company provided earnings per share (EPS) guidance of for the period. The company issued revenue guidance of $5.4 billion-$5.4 billion, compared to the consensus revenue estimate of $5.3 billion. 1,032 employees have rated Advanced Micro Devices Chief Executive Officer Dr. Lisa Su on Glassdoor.com. Dr. Lisa Su has an approval rating of 99% among the company's employees. This puts Dr. Lisa Su in the top 10% of approval ratings compared to other CEOs of publicly-traded companies. 89.0% of employees surveyed would recommend working at Advanced Micro Devices to a friend. Based on aggregate information from My MarketBeat watchlists, some companies that other Advanced Micro Devices investors own include NVIDIA (NVDA), Micron Technology (MU), Tesla (TSLA), Alibaba Group (BABA), Netflix (NFLX), Intel (INTC), Block (SQ), Walt Disney (DIS), QUALCOMM (QCOM) and PayPal (PYPL). Shares of AMD stock can be purchased through any online brokerage account. Popular online brokerages with access to the U.S. stock market include Charles Schwab, E*TRADE, Fidelity, and Vanguard Brokerage Services. Compare Top Brokerages Here. You have already added five stocks to your watchlist. Upgrade to MarketBeat All Access to add more stocks to your watchlist. Please log in to your account or sign up in order to add this asset to your watchlist. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}