{
    "title": "AMD Radeon R9 M290X - NotebookCheck.net Tech",
    "date": "3/18/2024",
    "url": "https://www.notebookcheck.net/AMD-Radeon-R9-M290X.108643.0.html",
    "text": "The AMD Radeon R9 M290X is a 28nm DirectX 12 graphics card based on the GCN (Graphics Core Next) architecture. Built primarily for large laptops, the advanced card is positioned near the top of the high-end category as of Q1/2014. Its performance and feature set are identical to the HD 8970M, as the M290X shares the same core and features the same clock rates.\nThe design of the Radeon R9 M290 series has its roots to the Pitcairn chip as found on the desktop Radeon HD 7870. The M290X in particular is similar to its desktop Radeon HD 7870 counterpart with 1280 1D shader cores and 80 texture units, but has a core clock of only 900 MHz (boost) versus the 1000 MHz clock of the HD 7870. Compared to the HD 7970M, the M290X shares the same base clock rate but with a 50 MHz higher Turbo clock for a 6% increase (1.01 TFLOPS vs. 1.07 TFLOPS) in raw SP calculations. As a result, general performance of the M290X is somewhere between the 7850 and 7870 desktop Radeon cards.\nAs mentioned before, the M290X is just a rebrand of the HD 8970M with identical performance. When compared to mobile Nvidia GPUs, the M290X performs a bit below the GeForce GTX 780M and slightly above the Nvidia GeForce GTX 680M. Therefore, almost all demanding games of 2013 will run fluently on very high details and 1080p resolution.\nFeatures of the M290X include the new UVD3 video decoder for decoding MPEG-4 AVC/H.264, VC-1, MPEG-2, Flash, Multi-View Codec (MVC) and MPEG-4 part 2 (DivX, xVid) HD videos directly from the AMD GPU.\nThe M290 series also supports automatic graphics switching between the integrated GPU and discrete GPU. Called Enduro, the technology supersedes AMD's Dynamic Switchable Graphics and is similar to Nvidia's Optimus. Furthermore, the M290X can directly support up to 6 connected monitors using Eyefinity Technology if Enduro is disabled.\nOther features of the M290 series include ZeroCore for reducing power consumption when the display is turned off. Power Gating, however, is not supported according to AMD. PowerTune allows automatic overclocking and underclocking of the graphics card as long as the GPU is within its TDP range. For example, the chip may be underclocked when running FurMark and OCCT, but will overclock in certain games like Lost Planet, Crysis or Resident Evil 5.\nThe integrated HD audio processor is able to transmit HD Audio (TrueHD or DTS Master Audio) over HDMI and DisplayPort (e.g., for Blu-Ray videos). Additionally, it now allows audio to output simultaneously and in parallel to multiple devices with the new Discrete Digital Multipoint Audio (DDMA) feature.\nPower consumption of the M290X is in the same ballpark as the GeForce GTX 780M. The subsequently large heat output suits the GPU as an option only for large laptops or DTRs (desktop replacements) equipped with relatively powerful cooling solutions. The AMD Radeon R9 M290X is a 28nm DirectX 12 graphics card based on the GCN (Graphics Core Next) architecture. Built primarily for large laptops, the advanced card is positioned near the top of the high-end category as of Q1/2014. Its performance and feature set are identical to the HD 8970M, as the M290X shares the same core and features the same clock rates. The design of the Radeon R9 M290 series has its roots to the Pitcairn chip as found on the desktop Radeon HD 7870. The M290X in particular is similar to its desktop Radeon HD 7870 counterpart with 1280 1D shader cores and 80 texture units, but has a core clock of only 900 MHz (boost) versus the 1000 MHz clock of the HD 7870. Compared to the HD 7970M, the M290X shares the same base clock rate but with a 50 MHz higher Turbo clock for a 6% increase (1.01 TFLOPS vs. 1.07 TFLOPS) in raw SP calculations. As a result, general performance of the M290X is somewhere between the 7850 and 7870 desktop Radeon cards. As mentioned before, the M290X is just a rebrand of the HD 8970M with identical performance. When compared to mobile Nvidia GPUs, the M290X performs a bit below the GeForce GTX 780M and slightly above the Nvidia GeForce GTX 680M. Therefore, almost all demanding games of 2013 will run fluently on very high details and 1080p resolution. Features of the M290X include the new UVD3 video decoder for decoding MPEG-4 AVC/H.264, VC-1, MPEG-2, Flash, Multi-View Codec (MVC) and MPEG-4 part 2 (DivX, xVid) HD videos directly from the AMD GPU. The M290 series also supports automatic graphics switching between the integrated GPU and discrete GPU. Called Enduro, the technology supersedes AMD's Dynamic Switchable Graphics and is similar to Nvidia's Optimus. Furthermore, the M290X can directly support up to 6 connected monitors using Eyefinity Technology if Enduro is disabled. Other features of the M290 series include ZeroCore for reducing power consumption when the display is turned off. Power Gating, however, is not supported according to AMD. PowerTune allows automatic overclocking and underclocking of the graphics card as long as the GPU is within its TDP range. For example, the chip may be underclocked when running FurMark and OCCT, but will overclock in certain games like Lost Planet, Crysis or Resident Evil 5. The integrated HD audio processor is able to transmit HD Audio (TrueHD or DTS Master Audio) over HDMI and DisplayPort (e.g., for Blu-Ray videos). Additionally, it now allows audio to output simultaneously and in parallel to multiple devices with the new Discrete Digital Multipoint Audio (DDMA) feature. Power consumption of the M290X is in the same ballpark as the GeForce GTX 780M. The subsequently large heat output suits the GPU as an option only for large laptops or DTRs (desktop replacements) equipped with relatively powerful cooling solutions. The following benchmarks stem from our benchmarks of review laptops. The performance depends on the used graphics memory, clock rate, processor, system settings, drivers, and operating systems. So the results don't have to be representative for all laptops with this GPU. For detailed information on the benchmark results, click on the fps number. For more games that might be playable and a list of all games and graphics cards visit our Gaming List In the following list you can select (and also search for) devices that should be added to the comparison. You can select more than one device. #0 no ids found in url (should be separated by \"_\") +0s ... 0s #1 not redirecting to Ajax server +0s ... 0s #2 did not recreate cache, as it is less than 5 days old! Created at Tue, 19 Mar 2024 05:33:38 +0100 +0.001s ... 0.001s #3 composed specs +0.04s ... 0.041s #4 did output specs +0s ... 0.041s #5 start showIntegratedCPUs +0s ... 0.041s #6 getting avg benchmarks for device 5208 +0.028s ... 0.069s #7 got single benchmarks 5208 +0.011s ... 0.08s #8 got avg benchmarks for devices +0s ... 0.08s #9 min, max, avg, median took s +0.245s ... 0.325s #10 before gaming benchmark output +0s ... 0.325s #11 Got 111 rows for game benchmarks. +0.005s ... 0.33s #12 composed SQL query for gamebenchmarks +0s ... 0.33s #13 got data and put it in $dataArray +0.019s ... 0.349s #14 benchmarks composed for output. +1.049s ... 1.398s #15 return log +0.053s ... 1.451s MSI GX70 3CC-222XPL: AMD A10-5750M, 17.30\", 3.9 kg\n  External Review » MSI GX70 3CC-222XPL MSI GX60-3CC87FD: AMD A10-5750M, 15.60\", 3.5 kg\n  External Review » MSI GX60-3CC87FD Alienware 17, Radeon R9 M290X: Intel Core i7-4710MQ, 17.30\", 4.1 kg\n  External Review » Alienware 17, Radeon R9 M290X » Comparison of GPUsDetailed list of all laptop GPUs sorted by class and performance. » Benchmark ListSort and restrict laptop GPUs based on performance in synthetic benchmarks. » Notebook Gaming ListPlayable games for each graphics card and their average FPS results. * Approximate position of the graphics adapter Top 10 LaptopsMultimedia, Budget Multimedia, Gaming, Budget Gaming, Lightweight Gaming, Business, Budget Office, Workstation, Subnotebooks, Ultrabooks, Chromebooks under 300 USD/Euros, under 500 USD/Euros, 1,000 USD/Euros, for University Students, Best Displays Top 10 SmartphonesSmartphones, Phablets, ≤6-inch, Camera Smartphones "
}