{
    "title": "AMD's upcoming 8000G series APU has better graphics than Nvidia GTX 1060",
    "date": "1/6/2024",
    "url": "https://www.sammobile.com/news/amd-ryzen-5-8600g-apu-spotted-geekbench/",
    "text": "© 2024 SamMobile SamMobile has affiliate and sponsored partnerships. If you buy something through one of these links, we may earn a commission. Last updated: January 6th, 2024 at 21:12 UTC+01:00 According to multiple leaks and rumors, AMD will announce the Ryzen 8000G series APU models at CES 2024. While there are only a few days for the event to kick off, one of the models in the lineup, the AMD Ryzen 5 8600G, has been spotted on Geekbench, which not only reveals its key specifications but also shows that its graphics performance can even beat one of the world’s most popular graphics card. The benchmarking listing reveals that the 8600G has six CPU cores with a base frequency of 4.35GHz and the Radeon 760M GPU. With that, it has scored 30,770 points in Vulkan. In comparison, the Nvidia GTX 1060, which is the third most-used graphics card at the moment globally according to Steam, scored 30,186 points. It means that the Radeon 760M is slightly more powerful than the GTX 1060, at least in this scenario.  In OpenCL, however, the Radeon 760M couldn’t quite match the performance of the GTX 1060. Here, the one from AMD scored 20,358 points and that from Nvidia achieved 34,507 points. Nonetheless, it shows that integrated graphics have come very far and they can now compete with discrete graphics cards, even if it is a seven-year-old mid-range model. It also shows that discrete graphics cards hold their ground very well.  You might also like Samsung launched new OLED TVs at CES 2024 and the time has finally come for it to start selling them to customers. If you were interested in these new products when they were unveiled back in January, now you can finally go ahead and pick one up. The company has started taking pre-orders for the […] Samsung's HBM3E 12H advanced memory chips have received high praise from NVIDIA CEO Jensen Huang recently. He confirmed that the company is testing these new memory models for integration into its GPUs, as unrelenting demand continues for its products. Such is the nature of the close collaboration between these two titans of the industry that […] Some details about Mach-1, Samsung's first in-house AI accelerator chip, emerged earlier this week. Samsung's aim with this product is to break NVIDIA's grip on the AI accelerator market and establish itself as one of the dominant players in this segment. It seems that at least one company has been convinced by what Samsung is […] NVIDIA has emerged as the leading supplier of AI semiconductor solutions across the globe. There's incredible demand for its products as companies jump on the AI bandwagon with new solutions and services. AI semiconductors require advanced memory chips and Samsung finds itself in a good position to cash in on this boom. It has a […] You've heard of TV and music streaming subscriptions, but how about one for high-performance SSD memory solutions for servers? That's apparently what Samsung is going to announce tomorrow at NVIDIA's GTC 2024 conference in San Jose, California. Samsung is reportedly going to introduce several new memory solutions for AI and machine learning applications at the […] In the last few years, one of the biggest developments in video game graphics has been the arrival of AI-powered image-upscaling technologies, such as AMD FidelityFX Super Resolution (FSR), Intel Xe Super Sampling (XeSS), and Nvidia Deep-Learning Super Sampling (DLSS). These technologies upscale the image for sharper picture quality, allowing GPUs to render graphics at […] Reviews Best picks Devices Samsung Galaxy A55 SM-A556E Samsung Galaxy S24 SM-S921B Samsung Galaxy S24 Plus SM-S926U Samsung Galaxy S24 Ultra SM-S928B Samsung Galaxy A14 5G SM-A146B Samsung Galaxy A15 5G SM-A156E Samsung Galaxy A25 SM-A256E Samsung Galaxy S23 FE SM-S711U Opinions Notebook TV Social media © 2024 SamMobile "
}