{
    "title": "GPD shares first AMD Ryzen 7 8840U benchmarks",
    "date": "1/20/2024",
    "url": "https://videocardz.com/newz/gpd-shares-first-amd-ryzen-7-8840u-benchmarks",
    "text": "The company confirms it is a minor update to the console’s performance.  A representative from GPD has provided the first benchmarks of AMD’s upcoming Ryzen 8000U APU for their gaming handheld. Their Win Max 2 handheld, which is basically a small laptop with a physical keyboard, will be receiving a CPU upgrade to AMD’s new “Hawk Point” series. In this case, the upgrade will be a minor one, with Ryzen 7 8840U replacing the 7840U SKU with nearly identical specs.   Ryzen 7 8840U CPU-Z, Source: GPD  As a reminder, Ryzen 7 8840U and 7840U both have 8 Zen4 cores and clocks up to 5.1 GHz. AMD confirms there are no changes to the integrated RDNA3 GPU either, the Radeon 780M ships with 12 Compute Units and a 2.7 GHz clock. AMD has not updated the frequencies for the CPU and GPU cores, but there is a small upgrade to the AMD XDNA core, which is the built-in AI processor. For gaming, this processor has no importance, thus the APU is expected to perform the same during gaming.   Ryzen 7 8840U CPU-Z, Source: GPD  Unsurprisingly, the 8840U APU offers nearly the same performance in the CPU-Z tests that were shared by GPD. The processor scored 865.6/7056.4 points in CPU-Z V19 AVX-512 test and 664.2/5628.3 points in the V17 benchmark. These scores represent single and multi-core performance figures. Respectively, the 7840U scores 880.3/6897.3 and 662/5488.4 points in the same benchmarks, which means -2% to +2% performance difference, which should be within the margin of error, specially for such a short benchmark like CPU-Z. For reference, GPD is also providing 7840U CPU-Z benchmark screenshots.   Ryzen 7 7840U CPU-Z, Source: GPD  The company has not officially disclosed its plans regarding the timing of Ryzen 7 8840U Win Max 2 release. However, it appears that the majority of existing Phoenix systems are expected to undergo updates to Hawk Point during the initial quarter at some point, aligning with AMD’s scheduled plans. Expected high demand for Hawk Point is predictable, considering the widespread use of these chips in notebook and handheld device manufacturers, all planning to upgrade their systems eventually. Worth adding that AMD has not mentioned any potential “AI-upgrade” for Ryzen Z1 series update, a chip designed primarily for handheld gaming systems like ASUS ROG Ally and Lenovo Legion Go. These CPU series are also based on Phoenix silicon. Source: ITHome We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}