{
    "title": "Nvidia GeForce RTX 40 Super pricing leak - expect reinvigorated $599, $799, \nand $999 offerings",
    "date": "1/7/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/nvidia-geforce-rtx-40-super-pricing-leak-expect-reinvigorated-dollar599-dollar799-and-dollar999-offerings",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Pricing tipped a day before the official launch. Prices for Nvidia's three upcoming GeForce RTX 40 Super GPUs have been leaked by X user @Zed__Wang, who has a decent track record with predicting specifications of Nvidia GPUs, like the RTX 4060 Ti for example. This price leak, if true, reveals that not all three RTX 40 Super graphics cards will sport especially attractive price tags. This is particularly true for the RTX 4080 Super, which is apparently going to launch at $999. The GeForce RTX 40 Super series revives the Super brand that was only used previously to refresh the Turing GPU series in 2019. Back then, Super basically meant offering new price points and performance levels with a much better bang for buck than the original RTX 20 / GTX 16 lineup. We'd expect to see the same with the RTX 40 series, and leaked hardware specs indicate that at least the performance side of the equation makes sense. The RTX 4070 Super, RTX 4070 Ti Super, and RTX 4080 Super all are rumored to come with more cores. As with all rumors, there's just one caveat: take it with a grain of salt. You won't even have to wait that long to get all this from the horse's mouth, as Nvidia's CES 2024 presentation and the presumed reveal of the RTX 40 Super series is tomorrow, January 8, at 8 AM Pacific time. *Specifications are unconfirmed. Prices actually haven't changed all that much from the original Nvidia GeForce RTX 40 series cards, with the RTX 4070 Super and 4070 Ti Super staying at $599 and $799 respectively. The GeForce RTX 4080 Super sees a price drop of $200, bringing it down to $999. By contrast, the GeForce RTX 20 Super series actually brought with it a slight increase in MSRPs with the RTX 2060 Super and 2070 Super. The prices put into perspective how substantial these upgrades are. The RTX 4070 Super has the biggest CUDA core boost with a 21% increase, and since the price hasn't changed, in theory that means its value (performance per dollar) should also go up by around 21%. The RTX 4070 Ti Super only has a 10% increase in CUDA core amount, but it also comes with 4GB more VRAM, which is harder to quantify in terms of value. The GeForce RTX 4080 Super also seems like a slam dunk despite its paltry 5% increase in CUDA cores, all thanks to that $200 discount. Though, it's worth considering that the original RTX 4080's $1,199 MSRP was already pretty high, and even higher than AMD's flagship Radeon RX 7900 XTX with 24GB of memory at $999. Retail pricing of the RTX 4080 has dropped to roughly $1,100 while the 7900 XTX has dropped to a little over $900. Slotting in the RTX 4080 Super at $999 isn't earth-shattering, at least on paper. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Like with the original GeForce RTX 20 Super series, it seems the stars of the show in the RTX 40 Super lineup are the cheaper two models. The RTX 4070 Super is nearly on par with the RTX 4070 Ti, while the RTX 4070 Ti Super is like a mini-RTX 4080. AMD will definitely have to revisit its $599 RX 7800 XT and maybe even the RX 7900 XT, which retails for around $800 these days. Matthew Connatser is a freelancing writer for Tom's Hardware US. He writes articles about CPUs, GPUs, SSDs, and computers in general. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 Argon THRML 60-RC Review: $20 Raspberry Pi 5 Super-Cooler By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}