{
    "title": "AMD Ryzen 5 8600G “Hawk Point” APU Spotted: 6 Cores at 5 GHz & Radeon 760M \niGPU With 8 Compute Units",
    "date": "1/2/2024",
    "url": "https://wccftech.com/amd-ryzen-5-8600g-hawk-point-apu-6-cores-5-ghz-radeon-760m-igpu-8-compute-units/",
    "text": "The AMD Ryzen 5 8600G \"Hawk Point\" APU has appeared within Geekbench, sporting 6 cores and a Radeon 760M iGPU with 8 compute units. The leaked AMD Ryzen 5 8600G APU is part of the upcoming Ryzen 8000G \"Hawk Point\" APU family which will be the first APU family for the new AM5 desktop platform. These chips will integrate Zen 4 CPU and RDNA 3 GPUs within a singular monolithic die and offer some great performance & value to budget/mainstream gamers and PC builders. This is evident by the pricing that we have seen so far. The specifications of the AMD Ryzen 5 8600G \"Hawk Point\" APU include 6 cores and 12 threads. These are based on the Zen 4 core architecture and feature up to 16 MB of L3 cache and 6 MB of L2 cache. The chip will feature a default TDP of 65W and can be seen running at base clock speeds of 4.35 GHz and boost clocks of 5.0 GHz which were confirmed in the previous leaks. In terms of iGPU, the chip is listed with the Radeon 5 iGPU or Radeon 760M. The Radeon iGPU has 8 compute units or 4 WGPs and is clocked at 2800 MHz which is 200 MHz faster than the same Radeon 760M iGPU configured on the Ryzen 5 7640HS/8640HS APUs and par with the clocks on the Radeon 780M iGPU on the 7940HS/8945HS. A 200 Mhz clock bump suggests that we might get a 3 GHz iGPU with the top AMD Ryzen 7 8700G configuration with room for improvement in the overclocking department. In terms of performance, the higher clocks along with the higher power limits that the AM5 desktop platform offers can yield much better performance. Here, the AMD Ryzen 5 8600G APU is running on an MSI MEG X670E ACE motherboard with DDR5-6000 memory and scores 24842 points in OpenCL and 30770 points in the Vulkan benchmark within Geekbench 6. This score puts the AMD Ryzen 5 8600G's iGPU around 20% ahead of the Radeon 760M iGPU for mobility platforms. The uplift comes from a +7.5% increase in clock and a 44% increase in power. We can see even better iGPU performance out of the RDNA 3 chips once the AM5 \"Hawk Point\" APUs are launched in late January. Expect more information to be unveiled at AMD's upcoming CES 2024 event. News Source: Benchleaks Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}