{
    "title": "AMD believes it now has the edge over NVIDIA when it comes to \nframe-generation technology",
    "date": "1/15/2024",
    "url": "https://www.tweaktown.com/news/95546/amd-believes-it-now-has-the-edge-over-nvidia-when-comes-to-frame-generation-technology/index.html",
    "text": "AMD and NVIDIA are the two biggest players when it comes to discrete gaming GPUs, but with its dominant market share and recent innovations like DLSS Super Resolution, Reflex latency reduction, and DLSS 3 Frame Generation, the consensus by many is that NVIDIA leads while AMD follows. HYPR-RX is a driver-based solution that brings frame generation to all Radeon RX 6000 and RX 7000 owners. In the case of DLSS, AMD's FSR or FidelityFX Super Resolution took a while to hit the market - with FSR 2 proving to be a success regarding image quality. In the case of FSR 3, which includes frame generation and super-resolution upscaling, it took almost a year after the arrival of DLSS 3 for AMD's equivalent tech to appear in a few select games. Unlike NVIDIA's DLSS 3, FSR 3 works on all GPUs - Radeon and GeForce alike - but still requires per-game implementation by developers. The company's latest endeavor, HYPR-RX, brings upscaling and frame generation versions to drivers - meaning they can be instantly enabled in hundreds of games. And with this, AMD believes it now has the edge over NVIDIA. And maybe it's Team Green's turn to play catch-up. \"I would be curious to know if NVIDIA feels now they have to match what we've done in making some of these solutions driver-based,\" AMD's Aaron Steinman told PC Gamer in a recent interview. DLSS 2 Super Resolution is exclusive to GeForce RTX GPUs, while DLSS 3 Frame Generation is exclusive to the latest GeForce RTX 40 Series due to using new specialized AI hardware. \"DLSS is only available on certain solutions,\" Steinman adds. \"So either NVIDIA will have to benefit from our solution because we did make it open-source and cross-vendor, or they're probably going to need to do something similar.\" Granted, a driver-based solution for upscaling for GeForce owners has existed for a while - NVIDIA Image Scaling is working similarly to AMD's FSR. The driver-based HYPR-RX combo of Radeon Super Resolution (RSR) and AMD Fluid Motion Frames (AFMF) lets these technologies be applied to hundreds of games. Still, image quality and overall stability aren't on par with game-specific integration that uses motion vectors and other data. AFMF is currently in Preview form, with it set to officially launch alongside the new Radeon RX 7600 XT later this month. The reason DLSS is the gold standard for upscaling comes down to its use of AI and being integrated into a game, and the same goes for DLSS 3 Frame Generation. With DLSS 3 adoption on the rise, it's unlikely that the company will release a driver-based version of the technology, as the company has gone all in on leveraging AI hardware and its supercomputers to deliver image quality that is on par with or even superior to native rendering. This is why DLSS has made upscaling and frame generation a hot topic. AMD's non-AI algorithm approach is exciting for being open-vendor, and tech like AMD Fluid Motion Frames (AFMF) has the potential to be a game changer as it improves - so either way, this back-and-forth with new tech is good news for all gamers. Kosta Andreadis Kosta is a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}