{
    "title": "Where Will AMD Stock Be in 3 Years?",
    "date": "1/28/2024",
    "url": "https://finance.yahoo.com/news/where-amd-stock-3-years-191500065.html",
    "text": "The past year has been an incredible one for Advanced Micro Devices (NASDAQ: AMD) investors as shares of the chipmaker have shot up an impressive 130%, outperforming the PHLX Semiconductor Sector index's gains of 57% by a huge margin. Investors have been buying the stock hand over fist in anticipation of a rapid acceleration in the company's growth thanks to artificial intelligence (AI)-driven chip demand. Even Wall Street has been upbeat about AMD's prospects. The stock received three upgrades earlier this month from Barclays, Susquehanna Financial Group, and KeyBanc Capital Markets. Barclays upped its price target on AMD to $200 from the earlier estimate of $120, while KeyBanc and Susquehanna increased their price targets to $195 and $170, respectively. AMD closed Jan. 23 at $168. Analysts aren't always right, but these price targets suggest that AMD stock is set for healthy gains. However, an analyst at Northland Capital Markets think otherwise. The investment banking firm recently downgraded AMD stock from \"outperform\" to \"market perform,\" pointing out that the company's AI business may not grow as fast as investors are expecting. Northland also said that the big jump in AMD over the past year means that its share price already reflects the potential AI-driven revenue gains that the company could log through 2027. Does this mean AMD stock is priced for perfection right now and it may struggle to sustain its red-hot rally over the next three years? AMD is trading at a whopping 1,500 times trailing earnings. That is a result of the stock's terrific surge in the past year and the fact that its earnings have declined at the same time. The decline in AMD's earnings can be attributed to weakness in the personal computer (PC) market. PC sales were down almost 15% in 2023, according to Gartner. More specifically, AMD's revenue from sales of central processing units (CPUs) deployed in desktops and laptops fell nearly 40% year over year in the first nine months of 2023, to $3.2 billion. The segment swung to an operating loss of $101 million during this period from an operating profit of $3.1 billion in the same period a year ago. As a result, AMD's total operating income was down to just $59 million in the first three quarters of 2023, from $1.4 billion in the year-ago period. The company is expected to report $2.65 per share in earnings for 2023, down from $3.50 per share in 2022. However, as the following chart indicates, AMD's earnings are set to grow significantly from this year. This solid uptick in AMD's earnings is the reason why AMD's forward earnings multiples are way cheaper than the trailing ones. There are two reasons why consensus estimates are projecting such a big turnaround at AMD in 2024. First, the PC market is set to grow by 8% in 2024, according to Canalys. More importantly, the market research firm expects PC shipments to grow by 10% annually in 2025, 2026, and 2027. So, the biggest factor that was weighing on AMD's bottom line should be a thing of the past this year, and beyond. The good part is that the potential turnaround in the PC market is already showing up in AMD's financials, as its client segment revenue was up an impressive 42% year over year in the third quarter. It also reported an operating profit of $140 million as compared to an operating loss of $26 million in the year-ago period. Second, AMD's data center business seems set for robust gains. The segment's revenue was down 4% in the first nine months of 2023 to $4.2 billion. At this run rate, AMD may have finished 2023 with $5.6 billion in data center revenue. However, analysts are forecasting a big jump in sales of AMD's AI-focused accelerators this year, which could supercharge the company's data center business. While AMD itself is forecasting $2 billion revenue in 2024 from its AI GPUs (graphics processing units), supply chain checks by KeyBanc indicate that it may generate $8 billion revenue by selling its newly launched MI300 family of AI chips. It is worth noting that AMD's data center revenue in 2023 consisted almost entirely of sales of its server CPUs . So, the $8 billion revenue that AMD is anticipated to generate from sales of its AI chips is going to be almost entirely incremental for its data center business. And AMD is expected to gain more share in the AI chip market, and that could lead to solid long-term growth for the company. Northland Capital Markets analyst Gus Richard estimates that AMD could corner a 13% share of the AI chip market in 2027, generating an estimated $16 billion in revenue. That suggests AMD's AI revenue is expected to double each year from 2024, based on the company's estimate that it will sell $2 billion worth of AI chips this year. However, other estimates -- such as the one from KeyBanc -- indicate that AMD could reach the $16 billion landmark at a faster pace. But even if we use the relatively conservative forecast from Northland, which expects AMD's overall revenue to increase to $45 billion in 2027, investors can expect the stock to deliver more upside over the next three years. AMD has a five-year average sales multiple of 8, which could send its market cap to $360 billion in 2027 based on the $45 billion revenue estimate. That would be a 32% jump from current levels. However, don't be surprised to see AMD delivering more upside as the market may reward it with a higher sales multiple considering that companies benefiting from AI tend to get a premium valuation from Wall Street. Should you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Advanced Micro Devices wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 22, 2024  Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices. The Motley Fool recommends Barclays Plc and Gartner. The Motley Fool has a disclosure policy. Where Will AMD Stock Be in 3 Years? was originally published by The Motley Fool Related Quotes "
}