{
    "title": "AMD brings AI to Ryzen 8000G desktop chips at CES 2024",
    "date": "1/8/2024",
    "url": "https://www.engadget.com/amd-brings-ai-to-ryzen-8000g-desktop-chips-at-ces-2024-153032800.html",
    "text": "AMD was the first company to deliver x86 laptop chips with NPUs for AI acceleration last year — now, at CES 2024 it's doing the same for desktops. The company's new Ryzen 8000G processors, which debuted today in Las Vegas (but have already been leaked by retailers), are once again NPU pioneers among x86 desktop chips. And on top of that, the company claims its built-in Radeon 700M graphics are the fastest ever seen on a desktop chip. While the Ryzen 8000G chips aren't AMD's most powerful desktop offerings — the Ryzen 7700X and above all offer higher clock speeds, core counts and onboard cache — AMD says the new processors could be compelling options for gamers trying to build capable systems on a budget. The fastest model, the $329 Ryzen 7 8700G, is an eight-core chip running between 4.2GHz and 5.1GHz, sporting Radeon 780M graphics. According to AMD, that processor averages 90 fps in Baldur's Gate 3 in 1080p with low detail settings and the company's Hyper-RX and Fluid Motion Frames features turned on. (The latter is a bit controversial, since it can make gameplay look smoother and deliver higher fps counts, but it's also early technology and it's interpolating even more frames than AMD's FidelityFX Super Resolution 3.0.) Without any of those extra features, the 8700G still hits a respectable 58 fps in Baldur's Gate 3. Of course, not many people, especially self-proclaimed gamers, would actually want to play with the lowest graphics settings. But if you're on a budget and building a system piece-by-piece, the 8700G and the rest of the 8000G family could at least let you play something before buying a dedicated GPU. AMD also claims its built-in graphics are significantly faster than Intel's latest offerings. According to the company's benchmarks, the 8700G is four times as fast in Hitman 3 in 1080p compared to the Intel i7-17400K's UHD 770 graphics. Even if you're not intrigued by the Ryzen 8000G Series' graphics potential, its NPU still makes it a unique desktop chip. Much like the NPU's we've seen on AMD's recent mobile chips, as well as Intel's new Core Ultra hardware, it'll let you speed up AI tasks without hitting your CPU or GPU. At the moment, NPUs enable features like Windows Studio Effects, which can blur your background during video chats, as well as media editing in Adobe and DaVinci software. NPUs are more compelling on laptops now, as they can help systems be more efficient and potentially save battery life. But having an NPU on your desktop chip today could be a smart way to future-proof your build. Speaking of those AI accelerators, AMD also teased the performance of its new Ryzen 8040 mobile chips at CES — specifically, by putting them head-to-head with Intel's Core Ultra hardware. AMD says the Ryzen 7 8840U is almost 80 percent faster than the Core Ultra 7 155H while running the Deeplabv3 neural architecture, and it's 43 percent faster while running Yolov8. More useful to consumers, though, are AMD's claims about content creation: the company says the 8840U is 85 percent faster than the Ultra 7 155H while running DaVinci Resolve's HD to UHD enhancement. But AMD didn't just stop there: It also says that new Ryzen chip is 60 percent faster than Intel's while playing Far Cry 6 in 1080p with low graphics settings. Similarly, AMD says the Ryzen 8840U is 52 percent faster than Intel's hardware in both Handbrake and LAME. We'll have to take these numbers with a huge grain of salt, but if they're accurate it means Intel could end up lagging behind AMD for another year. To round things out for entry-level and mid-range buyers, AMD also announced a new batch of Ryzen 5000 chips for its older AM4 architecture. They're spearheaded bv the $249 Ryzen 7 5700X3D, an eight-core chip featuring 100MB of 3D V-Cache, running between 3GHz and 4.1GHz. The most affordable new option is the $125 Ryzen 5 5500GT, a six-core chip that can reach up to 4.4GHz. Update 1/8/24 10:56PM: Updated to reflect that the Ryzen 5 5500GT is a six-core CPU, not a quad-core chip as originally stated in AMD's press materials. We're reporting live from CES 2024 in Las Vegas from January 6-12. Keep up with all the latest news from the show here. "
}