{
    "title": "Like a Dragon: Infinite Wealth - AMD FSR 3.0 vs NVIDIA DLSS 3 Benchmarks & \nImpressions",
    "date": "1/26/2024",
    "url": "https://www.dsogaming.com/pc-performance-analyses/like-a-dragon-infinite-wealth-amd-fsr-3-0-vs-nvidia-dlss-3-benchmarks-impressions/",
    "text": "SEGA has just released Like a Dragon: Infinite Wealth on PC. This new Yakuza/Like a Dragon game supports both NVIDIA DLSS 3 and AMD FSR 3.0, so we’ve decided to benchmark them and share our impressions. For these benchmarks, I’ve used an AMD Ryzen 9 7950X3D, 32GB of DDR5 at 6000Mhz, and NVIDIA’s GeForce RTX 4090. I also used Windows 10 64-bit, and the GeForce 551.23 driver. Moreover, I’ve disabled the second CCD on our 7950X3D.  For our tests, we’ve benchmarked the open-world area at the start of the first chapter. This area should, in theory, give us a pretty good idea of how the rest of the game performs. I’ve also set the game at 4K on Max Settings.  NVIDIA DLSS 3 Frame Generation appears to be broken in this title. As we can see, there is zero performance increase between DLSS 3 Quality and DLSS 3 Quality with Frame Generation. On the other hand, FSR 3.0 gets a nice performance boost with Frame Generation. Sadly, I wasn’t able to capture a video to showcase this. MSI Afterburner was causing major crashes whenever I was changing the game’s graphics settings. So, if you experience any crashes, we highly recommend disabling MSI Afterburner and Rivatunner. I then tried to use NVIDIA’s Performance Overlay but the statistics tab wasn’t showing up in the video. So I gave up and decided to capture the following screenshots. Native 4K is on the left, followed by DLSS 3 Quality, DLSS 3 Quality with Frame Generation and FSR 3.0 with Frame Generation at the bottom.  What’s crucial to note is that I was able to replicate these results multiple times. DLSS 3 Frame Generation is busted in this title, and NVIDIA will have to fix it. Not only that but DLSS 3 FG causes MAJOR stuttering issues whenever you pick up items or open suitcases. These stutters are absent at native resolution or when using FSR 3.0. That’s why I said in my previous article that this game does not suffer from any stuttering issues. I’ve already shared our findings with NVIDIA, so let’s hope that they’ll fix them soon. Let’s now examine the AMD FSR 3.0 FG implementation. As you know, I was very harsh on the early implementations of FSR 3.0. However, it appears that Like a Dragon: Infinite Wealth has the best FSR 3.0 Frame Generation implementation. There are some issues but finally, you can get a smooth camera panning. Let me explain what I mean. On my PC monitor, the LG 32GK850G-B 165hz G-Sync monitor, I had a smooth camera movement with AMD FSR 3.0 FG when not using VSync. The only problem with this was that the game was running with over 200fps. This introduced some tearing issues (as the framerate exceeded my monitor’s refresh rate). So, the solution was obvious. Enable V-Sync. Now when I enabled V-Sync to lock the framerate at 165fps, I got a really stuttery movement. However, when I set the in-game framerate to 60fps (FG made the game run at 120fps), everything felt smooth. The camera panning was smooth without any tearing or judder issues. I could never achieve anything like that in all the previous games that used FSR 3.0. I then set FSR 3.0 to Native AA. This combo also appeared to work wonderfully as the game stayed at around 130fps (below my monitor’s 165hz) and it was still smooth. As for the input lag, it wasn’t that noticeable. So, FSR 3.0 FG is now actually worth enabling, especially for those who want to hit higher framerates. It’s still not ideal and not on par with DLSS 3 Frame Generation though. After all, I had to experiment with lots of framerate settings in order to get a smooth experience. DLSS 3, on the other hand, does not suffer from these issues. Well… that is when DLSS 3 FG works as intended (so don’t judge it based on this game alone. As I said, it’s currently broken in Infinite Wealth). Still, AMD is on the right track so kudos to the red team. Our PC Performance Analysis for this game will go live this weekend, so stay tuned for more! John is the founder and Editor in Chief at DSOGaming. He is a PC gaming fan and highly supports the modding and indie communities. Before creating DSOGaming, John worked on numerous gaming websites. While he is a die-hard PC gamer, his gaming roots can be found on consoles. John loved – and still does – the 16-bit consoles, and considers SNES to be one of the best consoles. Still, the PC platform won him over consoles. That was mainly due to 3DFX and its iconic dedicated 3D accelerator graphics card, Voodoo 2. John has also written a higher degree thesis on the “The Evolution of PC graphics cards.”\nContact: Email "
}