{
    "title": "AMD Strix Point Halo “GFX1151” & Strix Point “GFX1150” APUs Spotted In \nROCm, RDNA 3.5 iGPU Confirmed",
    "date": "1/23/2024",
    "url": "https://wccftech.com/amd-strix-point-halo-gfx1151-strix-point-gfx1150-apus-rocm-rdna-3-5-igpu-confirmed/",
    "text": "AMD's next-gen Strix Point APUs including the Halo variant have been spotted with RDNA 3.5 iGPUs in the ROCm Github repository. Although the listings of the RDNA 3.5 \"GFX1150\" and \"GFX1151\" IDs are nothing new since we have been seeing them in various patches on Linux and the AMDGPU LLVM backend, what's new here is that this is the first time that Strix Point and Strix Point Halo are mentioned along with a respective GPU ID that they would utilize on launch. The latest commit within ROCm Github, titled \"Strix Halo Support and Strix support in staging\", is clear enough that more robust support is being added to the framework. Once again, AMD's Strix Point Halo APUs will be utilizing the GFX1151 IP while the Strix Point 1 APUs will be utilizing a GFX-1150 IP. The difference between the current GFX110X and the upcoming GFX115X IPs is that these new ones feature the refreshed and slightly more optimized RDNA 3.5 GPU architecture which will enable higher clocks and more cores on the premium parts along with some efficiency uplifts. The first AMD Strix Point APUs will appear later this year under the Ryzen 8050 APU branding and are expected to feature a next-gen XDNA 2 NPU \"Ryzen AI\" with up to 3x the performance uplift so that's around 48 TOPs coming from the NPU alone and over 60 TOPs when combined with the GPU and CPU. The AMD Strix Point standard SKUs are expected to feature up to 12 Zen 5 CPU cores and 16 RDNA 3.5 GPU cores while the Strix Point Halo APUs are expected to feature up to 16 Zen 5 CPU cores and up to 40 RDNA 3.5 GPU cores. AMD Ryzen 8050 Strix Point Mono Expected Features: AMD Ryzen 8050 Strix Point Halo Expected Features: The AMD Strix Point APUs are expected to launch in the second half of 2024 with the first APU shipments to OEMs commencing next year. This will be around the same time Intel will be offering its Arrow Lake & Lunar Lake CPUs, the follow-up to Meteor Lake. News Source: @Kepler_L2 Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}