{
    "title": "Why AMD Stock Is Soaring This Week",
    "date": "1/19/2024",
    "url": "https://www.fool.com/investing/2024/01/19/why-amd-stock-is-soaring-this-week/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Advanced Micro Devices (AMD 0.50%) stock is making big gains this week. The company's share price was up 11% from the previous week's market close heading into this Friday's trading, according to data from S&P Global Market Intelligence. AMD stock is soaring thanks to new performance updates and guidance released by Taiwan Semiconductor Manufacturing, the world's leading chip fabricator and the producer of chips. TSMC's commentary suggests that it's seeing very strong demand for AI semiconductor production, and that bodes well for Advanced Micro Devices and other players in the space. Bullish news from Taiwan Semiconductor Manufacturing has helped send AMD stock to the neighborhood of a new record high this week. AMD relies on TSMC to manufacture its chip designs, and the fabrication leader's performance is often viewed as a bellwether for the broader semiconductor industry. TSMC published its fourth-quarter results yesterday and delivered encouraging signals. While the company's Q4 revenue was essentially flat compared to the prior-year period, it came in higher than expected. Sales are trending toward accelerating again, and artificial intelligence (AI) is playing a key role in driving the positive momentum. For the first quarter of its current fiscal year, TSMC's midpoint guidance calls for sales of roughly $18.4 billion -- up roughly 10% compared to last year's sales. Revenue for this year's first quarter looks poised to fall from the roughly $19.6 billion in sales that the business posted in Q4 last year, but TSMC's business typically sees some calendar cyclicality, and it looks like the company will return to posting annual sales growth this year. While Nvidia is the clear-cut leader when it comes to advanced graphics processing units (GPUs) used for artificial intelligence applications and data centers, AMD has a distant second-place position in the category. On the other hand, the smaller GPU player is devoting resources to improving its position in the space and may be able to make inroads in the fast-growing industry segment. If AMD can score performance wins with its GPU designs and gain favor with major customers, its share price could continue to rocket higher from current pricing levels. AMD is also a designer of central processing units (CPUs) and is aiming to continue taking market share away from Intel in PCs and servers. The long-term demand outlook for high-performance semiconductors remains very favorable, and AMD stands out as a sensible portfolio addition for investors seeking to build positions in the space. Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}