{
    "title": "AMD wants you to know about its new automotive chips before it tells you \nabout its new CPUs and GPUs",
    "date": "1/5/2024",
    "url": "https://www.hardwarezone.com.sg/tech-news-amd-automotive-chips-versal-ai-edge-ryzen-v2000a-ces-2024",
    "text": " AMD is expected to unveil new CPUs and GPUs at CES this year. But ahead of its big unveil on 8 January, AMD is announcing its new chips for the automotive industry – the Versal AI Edge XA adaptive SoC and Ryzen Embedded V2000A Series processor. Built on a 7nm process node, the Versal Edge XA adaptive SoCs were designed to power next-generation automotive systems, specifically components and features like forward cameras, in-cabin monitoring, LiDAR, radar, automated parking, and autonomous driving. They feature AI engines that are capable of handling different types of AI models including classification and feature tracking. The SoCs have a range of capabilities ranging from 20,000 to 512,000 lookup tables and are capable of processing between 5 and 171 TOPS. The Ryzen Embedded V2000A series processors were designed to power in-car infotainment systems. These chips are also built on using  7nm process technology and feature Zen 2 cores and Radeon Vega 7 graphics. AMD fans will note that this is pretty old technology, but AMD explains that these chips are required to pass safety and reliability and that takes time. This is not different from NVIDIA's drive solutions, which also take years before they are actually in the market and used by end consumers. AMD says these chips will deliver \"high-definition graphics\" and will support Automotive Grade Linux and Android Automotive. Finally, AMD didn't say which automakers would employ these new chips, but reports say Tesla – a long-time AMD partner – would be among the first. Source: AMD Trending Topics Our Sections  AWARDS & ACCOLADES We thank all our supporters who have helped us garner these prestigious media awards in the industry! "
}