{
    "title": "AMD enables Fluid Motion Frames (AFMF) for integrated \"Radeon 700M\" series \nthrough preview driver",
    "date": "1/9/2024",
    "url": "https://videocardz.com/newz/amd-enables-fluid-motion-frames-afmf-for-integrated-radeon-700m-series-through-preview-driver",
    "text": "There is no unified driver integrated AMD Fluid Motion Frames yet, but there is a new beta that adds a new product.  The Fluid Motion Frames (AFMF) technology, AMD’s attempt to popularize Frame Generation at the driver level, has now been extended to a new product segment. For several months, AMD has been rolling out beta updates featuring AFMF, progressively adding Radeon RX 7000 and later RX 6000 series in the process. The most recent driver version, 23.40.01.10, introduces support for the Radeon 700M, which essentially a name for integrated RDNA3 graphics. The reason behind the delayed inclusion of RDNA3 iGPU support by AMD remains unclear, but it is now available. It’s important to note that this driver is still part of the beta “Preview” branch, and may not be suitable for everyone.   AFMF for Radeon 700M, Source: AMD  The Radeon 700M is a different product category than the discrete RX 6000/7000 GPU series. Here, users may not seek day-1 game optimizations and features like AFMF may not be a priority. The Ryzen 7040 series powered many Mini-PCs, which are not only used for gaming. However, the 700M series can also be found in gaming handhelds like ROG Ally or Legion Go powered by Ryzen Z1 series. Radeon 700M graphics can be found in: In such cases, manufacturers typically provide their own drivers, and using official AMD branches could potentially lead to complications, as observed in the past. With that in mind, this driver should be used for testing, rather than everyday use. The new AFMF driver serves as a demonstration of the upcoming functionality that is expected to be added into the official branch in the near future. Once fully integrated into the official branch, it is expected that the feature will also be included in custom OEM drivers. Source and download: AMD We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}