{
    "title": "How to turn on Eco Mode for AMD CPUs — and why you should",
    "date": "1/14/2024",
    "url": "https://www.digitaltrends.com/computing/how-to-turn-on-amd-eco-mode/",
    "text": "AMD Ryzen 7000 processors are amazing. The 7800X3D and 7950X3D are the best gaming CPUs in the world, and the non-X3D versions offer an amazing mix of gaming performance and productivity. But there's one feature of these CPUs that's often overlooked: Eco Mode. This power limiting command does impact performance, but not as much as you think, and it craters the processors' power draw, making them even more incredibly efficient. Turning on Eco mode is a great way to reduce temperatures while maintaining the majority of your chip's performance. Here's how to enable it. Desktop PC or laptop with a Ryzen 7000 CPU AMD Ryzen Master application The easiest way to enable Eco Mode on your Ryzen 7000 CPU is to use AMD's Ryzen Master overclocking tool. Step 1: Download the Ryzen Master application from the AMD website, and install it like you would any other application. Step 2: Open the app and give admin approval if necessary. If the app doesn't run, for some reason, right-click the launcher and select Run as administrator. Step 3: Once the app has initialized, look to the options in the upper-right corner, and select Eco. Step 4: Select the Apply and Test button at the bottom to have Ryzen Master apply Eco Mode, then run a quick stress test to make sure your CPU is still functioning well. Step 5: You'll be prompted to restart your PC. Do so immediately, or whenever convenient, but the next time your PC starts up your CPU should be in Eco Mode. You can confirm this by running a system monitoring tool like HWMonitor and tracking the package power draw of your CPU. Some AMD Ryzen owners have reported now being able to see the option to toggle Eco Mode in Ryzen Master. Fortunately, there's another way to do it: Through the UEFI/BIOS. Step 1: Reboot your PC or start it up and use your motherboard's bespoke key to enter the BIOS. Step 2: Look through your motherboard's various menus to find the Eco Mode command. This will vary dramatically depending on your motherboard manufacturer, so you may want to consult your manual or the official website to see if any documentation can guide you in the right direction. In some models, it can be found in AMD CBS > SMU common options > Eco Mode, but that's not guaranteed. Sometimes it's in the power options, other times, the overclocking options. Look far and wide if you can't find it as it should be there. If you really can't find it, though, try updating your BIOS to see if that adds the option in. Step 3: When you find the option, toggle it to On or Enabled depending on your motherboard's terminology. When you've done so, save your settings and exit the BIOS. Step 4: The next time your PC starts up your CPU should be in Eco Mode. You can confirm this by running a system monitoring tool like HWMonitor and tracking the package power draw of your CPU. If you're more interested in taking your processor's performance and power draw in the other direction, you could always overclock it. Here's how to overclock your AMD (or Intel) CPU. The rivalry between AMD, Nvidia, and Intel is exciting to watch at times. Which tech giant makes the best processors? What about graphics cards? This discourse is a bit of fun any PC enthusiast can have online, but too often, it devolves into something that can persuade buyers into bad purchases and push loyal fans into branded camps. A little bit of competition between all three chipmakers is a good thing, but frankly, the amount of misinformation that stems from it makes life harder for most users. Here's why I'm sick of the never-ending online battle of AMD versus Intel versus Nvidia, and why you should be, too.\nMisinformation and bias AMD already makes some of the best processors, but it looks like the next generation of Zen CPUs might give us even more to be excited about. According to early benchmarks and estimates, next-gen Zen 5 processors are expected to deliver a huge performance boost, reaching as high as 30%. Even leaving a little room for error, it seems that AMD might be about to deliver its most impressive upgrade in several years. This thrilling bit of speculation comes from RedGamingTech. While it's still very early days, the YouTuber was able to provide some rough benchmarks. While he claims these come from a reputable source, it's a good thing to remember that we're still a long way off from seeing Zen 5 CPUs in the flesh -- most likely a year or more. As such, make sure to not take this information at face value. If you're shopping for a CPU, you might feel tempted by the newer releases, meaning AMD's Ryzen 7000 and Intel's Raptor Lake. But you're often better off going against the current and picking one of the best processors in terms of value for the money instead of overpaying for something you don't need. Both Intel and AMD have released plenty of noteworthy CPUs in the past years and months, but two models stand out from the crowd, and you might be surprised to hear that neither belongs to the latest generation — although one of them is as recent as it gets.\nValue above all else Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}