{
    "title": "Specs and early benchmarks emerge for AMD Ryzen 8600G Hawk Point APU",
    "date": "1/3/2024",
    "url": "https://www.xda-developers.com/specs-early-benchmarks-amd-ryzen-8600g-hawk-point/",
    "text": "As the release date for the AMD Ryzen 8000G range approaches, more and more information is appearing online. In November 2023, details of a range of AMD Ryzen 8000G APUs leaked online. While we didn't have all the specifications available then, more information has surfaced showing us what these chips can do. Now, AMD Ryzen 5 8600G Hawk Point benchmarks have appeared online, and it sheds some light on how this new 8000 range will shape up. The details appeared as benchmarks on the Geekbench Browser website. It lists two different tests: one uses an OpenCL score, where it scored 24,842 points. The other test uses the Vulkan score, and it managed to achieve a rating of 30,770. Both of these tests were performed on the \"Balanced\" power plan on Windows 11 Pro. Alongside the test results, the benchmarking shows off the specifications of the AMD Ryzen 5 8600G. It comes with built-in Radeon 760M graphics, uses six cores, and can clock in at 4996 MHz maximum. We know from a prior leak that the AMD Ryzen 5 8600 Hawk Point will still use Zen 4 cores. Here are all the details: Name AMD Ryzen 5 8600G w/ Radeon 760M Graphics Topology 1 Processor, 6 Cores, 12 Threads Identifier AuthenticAMD Family 25 Model 117 Stepping 2 Base Frequency 4.35 GHz Cluster 1 6 Cores Maximum Frequency 4996 MHz Codename Phoenix L1 Instruction Cache 32.0 KB x 6 L1 Data Cache 32.0 KB x 6 L2 Cache 1.00 MB x 6 L3 Cache 16.0 MB x 1 Interestingly, the specifications are listed from an MSI computer sporting 32GB of DDR5 RAM. And with CES 2024 fast approaching, it will be interesting to see if AMD announces the Ryzen 5 8000 range alongside new MSI PCs. Either way, we'll have to see if the Ryzen 5 8000 range will be enough to become the best AMD CPUs for 2024.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Simon is a Computer Science BSc graduate who has been writing about technology since 2014, and using Windows machines since 3.1. After working for an indie game studio and acting as the family's go-to technician for all computer issues, he found his passion for writing and decided to use his skill set to write about all things tech. I recently reviewed the Ayaneo AM02 mini PC, and I turned it into a home gaming console. Enjoy a top-tier gaming experience with these low-cost PCs. Crucial's 2TB Gen4 M.2 SSD is now down to its lowest price, making it the perfect upgrade your computer or laptop. For when you can't resist checking out all the new Windows features Looking to upgrade? This Keychron mechanical keyboard is going to be a great option and now comes in at just $30. Samsung's latest flagship laptops and 2-in-1s feature Intel Core Ultra CPUs and updated displays. "
}