{
    "title": null,
    "date": "1/1/2024",
    "url": "https://videocardz.com/newz/shipping-manifests-reveal-amd-cuarzo-gpus-as-navi-3x-series-hint-at-navi-32-mobile-rx-7800m",
    "text": "Mysterious Cuarzo Rojo, Verde and Azul codenames hide AMD Navi 3X GPUs during shipment.  Harukze5179, a hardware detective, has uncovered enigmatic AMD codenames being transported from the Canadian headquarters to AMD labs worldwide. After an extensive investigation, we determined that the AMD CUARZO codenames represent AMD Navi 3X GPUs. Examining shipping records reveals the presence of Cuarzo Rojo, Cuarzo Verde, and Cuarzo Azul. These codenames, expressed in Spanish, translate to Red Quartz, Green Quartz, and Blue Quartz, forming an RGB sequence corresponding to Navi 31, 32, and 33 GPUs respectively. A total of 43 shipping manifests have been identified, including some duplicates. Certain manifests provide complete GPU codenames along with their variations. Additionally, a subset of manifests contains AMD product codes, confirming that these refer to both mobile and desktop GPUs. The manifests detail desktop gaming, workstation, and mobile series, including Azul XTM/XTMS, identified as Navi 33 laptop variants. New entries highlighted in red, such as board D716 for Cuarzo Verde (Navi 32) and the “XEM” variant, strongly suggest AMD’s intention to bring the Navi 32 GPU to the mobile form factor. This move follows AMD’s prior releases of the RX 7700/7600 (M/S/XT) series based on Navi 33 and RX 7900M. The possibility of introducing the RX 7800M, based on Cuarzo Verde, is now on the horizon. memo CUARZO ROJOCUARZO VERDECUARZO AZUL pic.twitter.com/A4x8P4uUbE — 포시포시 (@harukaze5719) December 31, 2023  Source: Volza via @harukze5719 We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}