{
    "title": "AMD Radeon RX 7600 XT review – more VRAM but not much else",
    "date": "1/24/2024",
    "url": "https://www.pcgamesn.com/amd/radeon-rx-7600-xt-review",
    "text": "Packing 16GB of VRAM, the Radeon RX 7600 XT should be the de facto budget graphics card to buy if not for frustrations that hamper its value. Samuel Willetts Published: Jan 24, 2024 The Radeon RX 7600 XT does little outside of offering more VRAM to justify its cost versus the cheaper Radeon RX 7600 and competing cards from Nvidia, leaving the otherwise welcome upgrade feeling somewhat limp. Prior to writing this Radeon RX 7600 XT review, the announcement of the graphics card instilled equal parts excitement and disappointment within me. Now, after testing it, I’m unfortunately left feeling no better or worse than I did then. This GPU sadly isn’t quite what the budget space needs, even if it is a step in the right direction. Why you can trust our advice ✔ At PCGamesN, our experts spend hours testing hardware and reviewing games and VPNs. We share honest, unbiased opinions to help you buy the best. Find out how we test. I’ve been using the Radeon RX 7600 XT for the past few days, testing its mettle to see if the AMD GPU is worthy of donning the best graphics card crown for value-oriented builders. Over the course of my testing, it’s proven to be a mixed bag.   There are three things that separate the Radeon RX 7600 XT specs from its non-XT counterpart, namely clock speeds, power consumption, and VRAM. While two of these are improved from the Radeon RX 7600, one is made worse off as a consequence, albeit only slightly. Game clock sees the biggest increase, shifting up to 2,470MHz (2.47GHz) on the Radeon RX 7600 XT from the Radeon RX 7600’s 2,250MHz (2.25GHz), for an increase of 220MHz. Meanwhile, boost clock rises by a smaller 100MHz to 2,755MHz (2.78GHz). Much as this upgrade is welcome, both do little to lift performance past a few extra frames. The headline feature of the Radeon RX 7600 XT, though, is its 16GB of VRAM. It now joins the Intel Arc A770 in being one of just two graphics cards to provide such capacity in the budget space. However, the 128-bit bus from the Radeon RX 7600 remains the same, as does memory bandwidth at 476.9GB/s. Finally, TBP for the Radeon RX 7600 XT increases to 190W to accommodate these improvements. This is only 10W higher than the Radeon RX 7600, though, and isn’t worth losing sleep over.  For our Radeon RX 7600 XT benchmarks, we have captured frame rate data for the three most popular resolutions, 1080p, 1440p, and 4K. These findings are split into sections that cover ray tracing and rasterization performance, as well as the impact of FSR. Each benchmark was run three times to produce an average final result, discarding anomalous entries. The results below for all graphics cards are freshly captured, using the latest available drivers. Pairing the budget-leaning Radeon RX 7600 XT with the AMD Ryzen 7 7800X3D is somewhat egregious, given that it’s a far higher-range CPU than most buyers of this class of graphics card are going to be using. However, keeping our choice of CPU consistent makes comparisons to other graphics cards easier, eliminating any other variables. For a more sensible choice of chip to pair with this card, though, we’d recommend the Ryzen 5 7600X or Core i5 14600K.  Non-ray traced rendering has classically proven to be among the greatest strengths of AMD’s graphics cards, and the Radeon RX 7600 XT is no exception. It joins its cheaper sibling, the Radeon RX 7600, in almost always showing up the GeForce RTX 4060 when it comes to this kind of rendering, and often falls within spitting distance of the more expensive GeForce RTX 4060 Ti 8GB. Examining the Radeon RX 7600 XT in isolation against the GeForce RTX 4060 produces a 13-14% advantage in minimum and average frame rates. Given that it costs just under 10% more ($29), the 7600 XT appears to provide solid value in this respect versus the RTX 4060 from its performance alone, let alone once you account for its larger VRAM pool. It also consistently beats out the Intel Arc A770, making it the de facto 16GB graphics card to grab for under $350, ray tracing isn’t a priority. However, bringing the Radeon RX 7600 into the fold complicates the value of the Radeon RX 7600 XT. For all the technical advantages the 7600 XT boasts, be it clock speeds or VRAM capacity, they sadly don’t amount to any sizable gains. In fact, on average, both minimum and average frame rates are a mere 7-8% improved. This is reduced to just 1-2% when focussing exclusively on 1080p and 1440p results; resolutions the card is best suited to. This minute boost is naturally problematic considering the $60 price difference. The reality is that the Radeon RX 7600 XT’s increased clock speeds and VRAM capacity do nothing to address the underlying limitations of the Navi 33 GPU at its heart and the 128-bit memory bus it rides on. However, as we’ll discuss further into this review, these changes can prove greatly beneficial when it comes to ray tracing. For now, though, let’s dive into the particulars of our rasterized benchmarks.   3DMark provides us with a general estimation of a graphics card’s performance, with Time Spy and Time Spy Extreme testing their capabilities using the DirectX 12 API. The Radeon RX 7600 XT takes the bronze here, falling behind the more expensive Intel Arc A770 and Nvidia GeForce RTX 4060 Ti 8GB. It’s important to note, however, that the Arc A770 will not perform as well in real-world benchmarks, particularly DirectX 11 games, as will be evident. It’s here that we see an unfortunate truth about the Radeon RX 7600 XT first present itself, with its score almost mirroring the Radeon RX 7600. These benchmarks only demand up to 4GB of VRAM, leaving one of the RX 7600 XT’s core advantages to be of no use here.    At 1080p, the Radeon RX 7600 XT pulls ahead of every other graphics card in Cyberpunk 2077 using the Ultra preset (minus FSR), save for the more expensive GeForce RTX 4060 Ti. It pumps out minimum and average frame rates of 67fps and 83fps, respectively, making for a smooth experience. However, the Radeon RX 7600 follows close behind, despite falling 4GB short of the 12GB of VRAM demanded by this resolution and quality preset combo. The performance gaps between the Radeon RX 7600 XT and its competitors narrows significantly at 1440p, with every graphics card falling below the ideal 60fps threshold. The only real loser at this resolution is the GeForce RTX 4060, which falls behind the pack in both average and minimum fps. Much as the Radeon RX 7600 XT has the VRAM capacity to withstand the demands of Cyberpunk 2077 at 4K, the same cannot be said for its GPU. Alongside its competitors, it fails to hit the 30fps threshold and thus leaves native 2160p out of the question here.    F1 23 tends to favor AMD GPUs, and this remains true with the Radeon RX 7600 XT. It comfortably leaves the Intel Arc A770 and GeForce RTX 4060 in the dust with its 77fps average at 1080p. While the Radeon RX 7600 trails by just 3fps, its minimum frame rate is much lower, giving the 7600 XT a decisive edge in the stability of its performance. The lead in average frame rates continues at 1440p and 4K, with the latter resolution also seeing a recurrence of better minimum fps from the Radeon RX 7600 XT compared to the Radeon RX 7600. F1 23 demands 9-12GB of VRAM at this quality preset, depending on output resolution, and the increased frame buffer of 16GB is undoubtedly playing a larger role than clock speeds in creating these differences.    Returnal serves as an equalizer of sorts for the Radeon RX 7600 XT and GeForce RTX 4060, with both graphics cards performing more or less identically across all three resolutions. In fact, the Radeon RX 7600 also mirrors them with margin-of-error differences. While these metrics don’t reveal any cause for alarm in terms of VRAM usage, Returnal calls for a minimum of 11GB of video memory using the Epic preset at 1080p, inherently making the Radeon RX 7600 and GeForce RTX 4060 more prone to performance issues. Conversely, the Radeon RX 7600 XT and Intel Arc A770 with their 16GB capacity are more than equipped for the job.    As a DirectX 11 game, Total War: Warhammer 3 creates performance problems for the Intel Arc A770, whereas the Radeon RX 7600 XT and GeForce RTX 4060 have none. Of the two remaining viable sub-$350 competitors, though, the real-time strategy game ultimately prefers team red’s pixel pusher. Creative Assembly’s RTS is one of the less VRAM hungry games in our test suite, calling for a minimum of 8GB. All the graphics cards in question here are up to that task, but their GPUs are ultimately only powerful enough to withstand the Ultra preset at 1080p anyway.  It is with ray tracing enabled that we see the advantage of the Radeon RX 7600 XT’s larger VRAM pool more obviously present itself. However, this comes with some caveats. Average frame rates remain basically unchanged, save for one result whose impressive-sounding near-200% improvement is altogether less so, given the final frame rate remains unplayable. Looking at minimum frame rates, though, one title that stumbled and stuttered on the Radeon RX 7600 is now far more playable. Comparisons to both the GeForce RTX 4060 and Arc A770 are less favorable for the Radeon RX 7600 XT. Across our suite, the AMD card trails the less-expensive GeForce RTX 4060 by 12-14% at 1080p and 1440p, while its Arc competitor pulls ahead by 3-5% at the same resolutions. As mentioned earlier in this review, given that nothing substantial has changed from the core specs of the same Navi 33 GPU found in the Radeon RX 7600, we find ourselves more often than not experiencing déjà vu. This leaves the Radeon RX 7600 XT in an awkward position, as its 16GB of VRAM is most immediately useful in a type of rendering it still finds itself falling short in compared to the competition. Even with this advantage, the performance gap between the GeForce RTX 4060 remains substantial at the resolutions that matter most to it.   3DMark provides us with a general estimation of a graphics card’s performance, with Speed Way and Port Royal testing their ray tracing capabilities using the DirectX 12 API. As expected, the Radeon RX 7600 XT and Radeon RX 7600 don’t fare as well as their competitors in ray traced rendering. This weakness is true of all Radeon RX 7000 series GPUs, though, and this is, again, an estimation of performance. As we shall see, AMD’s GPUs can trade blows with both Intel and Nvidia in some games.    Unlike the other games in our suite, Avatar: Frontiers of Pandora doesn’t explicitly separate its ray tracing options into separate presets or explicitly described settings. As such, its Ultra preset can catch you unawares if you’re not careful. This is a very demanding game, with the Radeon RX 7600 XT and the majority of its competitors falling shy of even a 50fps average at 1080p. Moving up the resolution ladder proves too difficult for all but the GeForce RTX 4060 Ti, with minimum frame rates below 30fps. The size of Avatar’s performance footprint is matched only by its hunger for VRAM, with a 13GB minimum using the Ultra preset. This would leave even the more expensive 12GB Radeon RX 7700 XT short, and helps make the case all the stronger for the likes of the Radeon RX 7600 XT (even if its GPU is weaker).    Playing Cyberpunk 2077 using the RT Ultra preset, sans performance boosting upscalers, is simply too much to ask of the Radeon RX 7600 XT. Its 16GB of VRAM helps it stay better afloat than the Radeon RX 7600, but this scenario is too demanding for basically the graphics cards in our suite here. Even the GeForce RTX 4060 Ti, with its more powerful ray tracing cores, can’t escape the constraints of its 8GB VRAM capacity, with vastly different minimum and average fps. Demanding 14GB of VRAM out of the gate, Cyberpunk 2077 suffers no would-be 8GB challengers. It isn’t until we employ the likes of DLSS, FSR, and XeSS, that we get a playable experience with minimum frame rates of 30fps.    Where once the Radeon RX 7600 XT enjoyed a comfortable lead in F1 23 with rasterization, it finds itself more closely riding alongside its competition with ray tracing enabled. The Radeon RX 7600 XT is able to drive steadily at 1080p, but buckles slightly at 1440p with minimum frame rates dipping below 30fps. Meanwhile, the Intel Arc A770 and GeForce RTX 4060 just about stay on track. Naturally, 4K proves too much for all involved. In part due to the GPUs simply lacking the power to push so many pixels, but also due to VRAM constraints, as we can see comparing the Radeon RX 7600 XT to the Radeon RX 7600.    In Returnal, the 16GB of VRAM in the Radeon RX 7600 XT proves to be its biggest boon. At 1080p, minimum frame rates jump from an abysmal 18fps on the Radeon RX 7600 to a far better 35fps. However, this victory only serves to bring it in line with its competitors, with the GeForce RTX 4060 even outclassing the Radeon RX 7600 XT with just 8GB of VRAM.  Bringing FidelityFX Super Resolution (FSR) into the picture, alongside competing solutions, essentially compounds the gaps between the Radeon RX 7600 XT and other sub-$400 graphics cards we see in native rendering. However, in terms of image fidelity, FSR leaves the 7600 XT behind both the GeForce RTX 4060 and Intel Arc A770. Launching alongside the Radeon RX 7600 XT is AMD Fluid Motion Frames, a driver-based frame generation solution that aims to bring frame generation to every DirectX 12 and 11 game regardless of whether the developer has implemented native DLSS or FSR Frame Generation. Better still, it’s compatible with both Radeon RX 7000 and 6000 series graphics cards. Sadly, I wasn’t able to spend enough time testing this feature prior to review to give informed impressions, given when our sample arrived, but you can expect a separate feature on the technology soon.    With FSR 2 enabled, the Radeon RX 7600 XT finds itself freed up to provide greater levels of rasterized performance in Cyberpunk 2077. It matches the 1080p minimum frame rate of the GeForce RTX 4060 Ti 8GB, at 80fps, falling just shy of its competitor’s 114fps average by just 5fps. As resolutions increase, the Intel Arc A770 begins to catch up to the Radeon RX 7600 XT, eventually becoming neck and neck with 33fps and 32fps, respectively, at 4K. Meanwhile, the GeForce RTX 4060 can’t manage a playable frame rate at such a high resolution.    Even with FSR, the ray tracing performance of the Radeon RX 7600 XT still leaves much to be desired compared to the GeForce RTX 4060 using DLSS 2. We’re looking at a 50% deficit here in terms of average frame rates at 1080p, and that’s without considering the differences in image quality too. That said, the game is at least playable, if you’re willing to endure a 30fps cap. If, you’ll need to turn your attention away from the Radeon RX 7600 XT.  The Radeon RX 7600 XT price is $329, which is a sum that evokes feelings akin to those I have towards the GeForce RTX 4060 Ti, albeit not quite as negative. The extra $60 AMD is asking for here over the RX 7600 versus the $100 by Nvidia is certainly more palatable, but still feels too expensive for the product you end up with. As with the Radeon RX 7600, I wish that AMD had been more aggressive with its pricing. At $299, matching the GeForce RTX 4060, the Radeon RX 7600 XT would be a much more disruptive force and all the more enticing of a purchase. As things stand, however, there are just too many caveats and nuances required to effectively justify its cost.  It’s frustratingly difficult to outright recommend the Radeon RX 7600 XT to most people, given that this should be the budget graphics card we’ve been clamoring for. It should provide better value than the Radeon RX 7600 in the long run, given its larger VRAM pool, but this feels less pronounced in the here and now. While you will see benefits in some games, others will only see marginal improvements. The problem here is that the Radeon RX 7600 is basically just as good as the Radeon RX 7600 XT in most cases, give or take a few frames, making the latter’s higher cost a reason to pause. Then there’s the uncomfortable gap between it and the cheaper GeForce RTX 4060 in terms of ray tracing and upscaling quality, further hampering the appeal of what should be the budget king of sorts. For those whose primary concern is non-ray traced gaming, however, the Radeon RX 7600 XT is the graphics card to opt for if your budget is limited, don’t plan to upgrade for a while, and couldn’t care less about upscaling. VRAM bottlenecks may not be so apparent yet on 8GB cards outside of ray tracing, but it won’t be long until we see more system requirements demand more memory from our graphics cards. If the Radeon RX 7600 XT isn’t the perfect fit for your system, check out these alternatives: The GeForce RTX 4060 is both cheaper and more performant than the Radeon RX 7600 XT when it comes to ray tracing. It also delivers a more robust feature set for performance improvements, with DLSS Super Resolution and Frame Generation proving to be of a higher quality than FSR 3. Just bear in mind that its 8GB VRAM capacity could prove to be a constraint in years to come. Read our GeForce RTX 4060 review to learn more. If your budget can’t stretch above $300, then the Radeon RX 7600 is the graphics card to opt for. It shares many similarities with the Radeon RX 7600 XT, such as the ability to perform well at 1080p in rasterized rendering. However, it only has 8GB of VRAM, compared to the 16GB found in the XT. Read our Radeon RX 7600 review to learn more. Samuel Willetts                 Sam has spent the past two decades tinkering with computers, a tradition he proudly continues as a Hardware Editor for PCGamesN. For all things systems and components, he's your man. You'll regularly find his hands inside a PC, swapping out components from the likes of AMD, Intel, and Nvidia as fast as you can say Windows. Otherwise, you'll find him on the showfloor of CES and Computex, talking the night away about the latest pieces of shiny silicon. You may also know him from outlets such as Custom PC, PC Gamer, Pocket Tactics, T3, and TopTenReviews. "
}