{
    "title": null,
    "date": "1/25/2024",
    "url": "https://videocardz.com/newz/nvidia-rtx-4070-ti-super-outpaces-amd-rx-7600-xt-sales-on-launch-day-91-at-german-retailer",
    "text": "The RTX 4070 Ti SUPER sold in at least 280 units at one German retailer, while the RX 7600 XT only scores 30 sales, reports 3DCenter.  The RTX 4070 Ti SUPER had some problems at first due to MSI issues with the BIOS, but it seems people who wanted to upgrade didn’t need much convincing regardless. The launch of this NVIDIA GPU was accompanied by AMD’s Radeon RX 7600 XT GPU, an entirely different class of GPU, but also sporting a 16GB storage capacity. Following the lifting of the embargo, both the RTX 4070 Ti SUPER and the RX 7600 XT were quickly available for purchase at the German retailer Mindfactory. What is particularly important is that neither of these SKUs features a reference or Founder’s Edition design; instead, both launches are based on custom designs by board partners. Our database indicates that the RTX 4070 Ti SUPER comes in 60 designs from these partners, significantly outnumbering the 11 variants available for the RX 7600 XT. This directly impacts the variety of options listed by retailers, with a notably greater selection for the RTX 4070 Ti SUPER. As reported by 3DCenter, AMD cards were sold in 30 units on launch date, which is much less than RTX 4070 Ti SUPER estimated at 280 to 300 units (this is an estimated number because some offers were sold out before full data was retrieved). That’s 9 or possibly 10 times more sales, but one must mention that RTX 4060 and RTX 4060 Ti cards were both seeing similar or even worse launches as reported by 3DCenter:   2023/2024 GPU launch and sales, Source: 3DCenter  The limited availability of Radeon GPUs and the fact that certain cards were even priced higher than AMD’s suggested retail value played a role in slow sales. While there has been a shift with some cards now being priced even lower than the recommended value, it hasn’t significantly improved the situation. Gamers are evidently displeased with the NVIDIA and AMD current entry-level segment. Given a choice, many look at previous generation products or second-hand offers. Performance may not be the most important factor, but the price to performance value is. The Radeon RX 7800 XT was a great example of a product that saw success at launch, with 400 units sold. That’s over 13 times more sales than RTX 4060 Ti 8GB on its launch day. The RX 7700 XT which was priced just $50 saw 10 times less interest. Source: 3DCenter We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}