{
    "title": "AMD AFMF and RSR Technologies Challenge NVIDIA in Driver-Based Solutions",
    "date": "1/12/2024",
    "url": "https://www.guru3d.com/story/amds-afmf-and-rsr-technologies-challenge-nvidia-in-driverbased-solutions/",
    "text": "Published 2024-01-12 09:05 by Hilbert Hagedoorn AMD's software engineering team has previously developed the Radeon Super Resolution (RSR) technology, another driver-based solution. Unlike FSR, both AFMF and RSR are integrated into the upcoming HYPR-RX feature set without requiring direct involvement from game developers. Steinman notes the exclusivity of NVIDIA's DLSS technology, limited to specific hardware, and contrasts it with AMD's open-source and cross-vendor approach. The conversation acknowledged the ongoing rivalry between AMD and NVIDIA in upscaling technologies. Steinman emphasized that this competition drives continuous innovation, with both companies expected to introduce new technologies in the future. Steinman highlighted the distinction between AMD's driver-based technologies, AFMF and RSR, and FSR. The former do not need specific support from game developers and are broadly applicable across games. NVIDIA, in contrast, offers Nvidia Image Scaling, a driver-based upscaling solution simpler than DLSS and based on a sharpening filter. However, NVIDIA's Frame Generation technology, tied to DLSS 3, does not have a driver-based equivalent.  The performance of AFMF in various games has shown early promise. Tests on systems using Ryzen 7 7840U processors and FSR 2 Balanced in Baldur's Gate 3 demonstrated notable performance improvements, with frame rates doubling from approximately 30 fps to 60 fps. In conclusion, AMD's introduction of AFMF and RSR as driver-based solutions offers a new dynamic in the competition with NVIDIA's upscaling technologies, underscoring the evolving landscape of the gaming GPU market. Additionally, Steinman recognized the emerging trend of AI acceleration in gaming GPUs, a direction both AMD and NVIDIA are expected to pursue. Share this content\n\n\n Twitter\n                                \n\n\n Facebook\n                                \n\n\n Reddit\n                                \n\n\n WhatsApp\n                                \n\n\n Email\n                                \n\n\n Print Xiaomi WiFi 7 Router BE 3600 2.5G Available for Pre-Order In Asia for just $39 Updated: MSI Claw: Gaming Handheld To Cost 829 euro Copyright ©1997-2024 guru3dPowered by Contentteller® CMS System "
}