{
    "title": "Billionaire Investor Jim Breyer Still 'Pounding The Table' On Nvidia, AMD - \nNVIDIA (NASDAQ:NVDA), Advance",
    "date": "1/22/2024",
    "url": "https://www.benzinga.com/news/24/01/36726755/billionaire-investor-jim-breyer-still-pounding-the-table-on-nvidia-amd",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Breyer Capital founder and CEO Jim Breyer joined CNBC's \"Squawk Box\" last week to discuss the practical applications of artificial intelligence. The venture capitalist named two companies he believes are positioned to reap the benefits of widespread AI adoption. Breyer highlighted healthcare applications, particularly drug discovery and development, as some of the most significant use cases for AI. Breyer noted that advanced healthcare-focused AI applications, including imaging and data optimization, require high-end hardware from Nvidia Corporation NVDA and Advanced Micro Devices, Inc. AMD. Breyer On NVDA: Breyer touted Nvidia as an \"underappreciated AI story\" in early 2023 before the stock went on to gain more than 230% over the course of the year. He told CNBC he expects the company to continue to thrive. \"They have built a software layer around their chip that the companies I invest in just can't get enough of,\" Breyer said. Breyer On AMD: Breyer also \"pounded the table\" on AMD as another chipmaker that will continue to rise on the growth of AI. KeyBanc analyst John Vinh hosted investor meetings with AMD executives last November and noted management’s high confidence in the company's $2 billion outlook for its MI300 compute accelerators in 2024. The analyst also highlighted AMD's ability to compete with Nvidia, particularly in inferencing, due to its high-bandwidth memory content. Related News: Workday Co-CEO Carl Eschenbach Stresses Importance Of Responsible AI Use: ‘Our Data Is Highly Curated‘ AMD shares are up more than 140% over the past year, and Breyer sees the stock continuing to climb as the demand for AI-related hardware increases. He even suggested that its market cap could grow to the size of some of the biggest mega-cap tech names. \"The ‘Magnificent Seven': I would add AMD to that list for sure,\" Breyer said. NVDA, AMD Price Action: According to Benzinga Pro, Nvidia shares closed Monday up 0.27% at $596.54, while AMD shares closed down 3.47% at $168.18. Image Via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}