{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.capacitymedia.com/article/2cuiogqn69qytnzzsl43k/news/samsung-vodafone-complete-first-open-ran-call-with-amd-processors",
    "text": "In what is described a first for the industry, the companies came together to complete the call in Samsung’s R&D lab in Korea. It was done using Samsung’s Open RAN-compliant virtualised RAN software powered by AMD processors. The demonstration aimed to verify the optimised performance, energy efficiency and interoperability among partners’ solutions. Samsung and Vodafone said this represents their ongoing commitment to reinforce their position in the Open RAN market and expand their ecosystem with industry-leading partners. The broader and growing Open RAN ecosystem helps operators build and modernise mobile networks with greater flexibility, faster time-to-market (TTM) and greater performance. “Open RAN represents the forthcoming major transformation in advancing mobile networks for the future,” said Nadia Benabdallah, network strategy and engineering director at Vodafone Group. Reaching this milestone with top industry partners like Samsung and AMD shows Vodafone’s dedication to delivering on the promise of Open RAN innovation. \"Vodafone is continually looking to innovate its network by exploring the potential and diversity of the ecosystem.” The companies will demonstrate its test result exceeding 1Gbps throughput for multi EUE on multi-cell configuration at Mobile World Congress (MWC) 2024. \"This collective effort marks a key milestone for the mobile network industry to steer Open RAN forward, by embracing multiple providers at every layer of the network stack,” said June Moon, executive vice president and head of R&D, networks business at Samsung Electronics. “The demo illustrates Samsung’s commitment to delivering the full potential of mobile networks by embracing openness.” \"Samsung is constantly working with other technology frontrunners to offer operators the means to transform their networks and capitalise on the diversity of the Open RAN ecosystem.\" As a premium subscriber, you can gift this article for free You have reached the limit for gifting for this month There was an error processing the request. Please try again later. "
}