{
    "title": "AMD Ryzen 7 8700G vs Ryzen 7 7700X: Which CPU should you buy",
    "date": "2/24/2024",
    "url": "https://www.xda-developers.com/amd-ryzen-7-8700g-vs-ryzen-7-7700x-which-cpu-should-you-buy/",
    "text": "AMD’s latest and greatest APU is here, but is it a better value than the Ryzen 7 7700X? The Ryzen 7 7700X is still a great mid-range CPU, even after it’s been on the market for a while. With 8 cores and 16 threads, you can expect top-tier desktop performance. While AMD’s AM5 platform is still more expensive than Intel’s, it at least provides you with a clearer upgrade path. The Ryzen 7 7700X is still a great mid-range CPU, even after it’s been on the market for a while. With 8 cores and 16 threads, you can expect top-tier desktop performance. While AMD’s AM5 platform is still more expensive than Intel’s, it at least provides you with a clearer upgrade path. AMD’s 8000G desktop APU lineup proves that APUs are getting hard to ignore. These new processors promise great performance uplifts in gaming thanks to the new integrated Radeon graphics. Leading the pack is the Ryzen 7 8700G, which just might change the APU landscape for good. It’s capable of handling games at 1080p with respectable settings and is a great value considering dedicated the GPU stock and pricing issues persist. While it’s a great value, $329 is still a lot to ask for an APU. That pricing pits it against the likes of the Intel Core i5-14600K, and more importantly, AMD’s own Ryzen 7 7700X. So, how does AMD’s latest and greatest APU compare against their mid-range powerhouse? Let’s take a close look at the specs, performance, and value to answer that question. At CES, AMD unveiled the Ryzen 8700G alongside the rest of the new APU lineup. This Zen 4 processor uses the same AM5 socket as the Ryzen 7000 series. This means it provides a great upgrade path to future Ryzen desktop CPUs. It comes with a stock cooler out of the box and is priced at $329. As for the Ryzen 7 7700X, it’s been on the market since its launch in September 2022. It’s a mid-range CPU priced that originally launched for $399. However, you can often find it discounted to around $300 or below. Both processors give you 8 cores and 16 threads, but the 7700X boosts higher at 5.4GHz compared to the 8700G’s 5.1GHz boost clock. It’s important to note that the 7700X does not come with a cooler. If you’re interested in purchasing this CPU, take a look at our recommendations for the best CPU coolers for the 7700X. Since the Ryzen 7 7700X is often on sale, both of these CPUs more or less cost the same right now. You might be able to find the Ryzen 7 7700 (non-X) for even cheaper. This pricing situation does muddy the water a bit, as both of these CPUs are close in terms of CPU performance. In our review, we noticed that the 8700G had a 5-10% reduction in core performance against the Ryzen 7 7700X. However, gaming performance is the big difference maker here. The Radeon 780M integrated graphics are incredibly powerful, and the 8700G was capable of delivering more than 60fps in games like Elden Ring, Shadow of the Tomb Raider, and GTA V. These tests were done at 1080p with visual settings set to low. The 8700G is also capable of handling certain titles at 1440p, albeit with low settings. However, we recommend 1080p gaming with this CPU for the best possible experience. Still, the fact that you can even play certain games at 1440p without a dedicated GPU is a feat worth noting. Compared to its predecessor, the Ryzen 7 5700G, the 8700G is a big step-up in terms of gaming performance. If you own a Ryzen 5000G-series APU, then the 8700G is a worthy upgrade overall. The 8700G also performed admirably in the Cinebench and 3DMark benchmark tests. During these tests, the stock cooler also worked well. We recommend an aftermarket cooler for better performance overall, but you can certainly get away without buying one. So, what about the 7700X? Simply put, it caters to different needs. If you can afford a separate graphics card or already have one, then the Ryzen 7 7700X is the way to go. It has a higher clock speed at 5.4GHz, and double the L3 cache (32MB vs 16MB). It’s going to perform better at productivity-related tasks, and will definitely deliver better gaming performance even with a mid-range GPU. With that being said, it does tend to run hot at the default power settings. It also doesn’t come with a stock cooler out of the box, so you’ll have to invest in a decent CPU cooler for the best possible performance. When you look at it as a whole, a 7700X build will give you more performance, but will also cost more. On paper, both of these CPUs deliver excellent value at their respective price points. Considering the Ryzen 7 7700X is heavily discounted these days, it’s one of the better mid-range CPUs out there. Compared to the 14700K, it’s cheaper and promises a better upgrade path. The 14700K is faster sure, but it also costs $100 more. Pair the Ryzen 7 7700X with a decent mid-range graphics card, and you won’t hopefully need to upgrade for a while. You’ll have a PC that’s capable of handling demanding tasks like streaming, while also delivering good framerates in the latest and greatest titles. However, if you’re tired of the ridiculous pricing and bad value being offered in the graphics card market, the Ryzen 7 8700G is not a bad choice. Pick up the 8700G with a cheap motherboard, a small form factor case, DDR5 RAM, and you’ll have yourself a very capable and affordable gaming PC without a graphics card at all. Considering budget gamers don’t have a lot of options right now in terms of GPUs, the 8700G might be the better value here. Things are a bit messed up right now, sure, but at least AMD is giving you an alternate option. Another factor that makes the 8700G a better value is the fact that it comes with a cooler out of the box. If you’re a gamer on a tight budget or want to build a small form factor gaming PC, the Ryzen 7 8700G is the better choice. It comes with a stock cooler, performs better in terms of thermal and power efficiency, and manages to deliver very respectable gaming performance. If you want to play E-sport titles like Fortnite, Rocket League, or Counter Strike 2, the 8700G is a great value. The AMD Ryzen 7 8700G is the most powerful APU AMD has released to date, offering the mighty Radeon 780M integrated GPU for butter-smooth 1080p gaming. On the other hand, if you have the budget to buy a graphics card or already own one, then the Ryzen 7 7700X is the better option. It delivers better raw CPU performance, has a higher boost clock, and can often be found for a heavily discounted price. There are more options around the $300-$400 range though, so keep an eye out for discounts. The AMD Ryzen 7 7700X is one of the most powerful processors on the market right now, with 8 cores and 16 threads for top-tier desktop performance.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. With over seven years of experience covering PC hardware content and reviews, Hassam intricately explores the world of technology, from PCBs and VRMs to CPU/GPU overclocking, bringing expert insights to every article he writes. When he's not writing, you'll find him tinkering with tech gadgets, attending racing events, or collecting niche fragrances. AMD made significant improvements to its APU lineup with the Ryzen 5 8600G. But is it good enough to beat the Ryzen 5 7600? If you're looking to add one of AMD's Ryzen 7000 to your system without spending a ton, check out our collection of the best budget AM5 motherboards. Get tinkering for cheap. If you've been thinking about upgrading the storage on your Steam Deck or similar device, now's going to be the perfect time 64-bit processors may be mainstream, but what made the industry ditch 32-bit CPUs in the first place? If you want to use ChatGPT to master your Microsoft Excel or Google Sheets, then we have the perfect guide for you. "
}