{
    "title": "AMD takes market share from Intel in server, desktop, and notebooks — new \nMercury Research data shows Q4 2023 ...",
    "date": "2/7/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/amd-takes-revenue-share-from-intel-in-server-desktop-and-notebooks-new-mercury-research-data-shares-q4-2023-data",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. 4th Gen EPYC and Ryzen 7000 series processors have been a winning combo. Strong green shoots of recovery have been seen in the computing and semiconductor markets, and new data from Mercury Research makes it clear that AMD is going to be one of the major beneficiaries. “AMD gained significant server, desktop, and notebook revenue share year-on-year,” noted AMD in an email that shared data from Mercury Research. AMD’s unit share figures were positive, too. Solid demand for both 4th Gen EPYC and Ryzen 7000 series processors have been behind AMD’s apparent success, asserts the market research outfit.  Starting with the client side of the business, Mercury’s figures show AMD’s revenue share increased 2.0% YoY, and its unit share increased 3.1% YoY to 15.4% and 20.1%, respectively. Those who keep a close eye on the PC market will know that the client PC market was somewhat challenging through most of 2023. However, reports from various segments, such as the once-troubled memory makers, are making it clear that there is a lot of optimism for 2024. Remember, 2024 is said to be the year of the AI PC; among other things happening this year, we could see Windows 12 arrive. If that happens, Microsoft will spur upgraders to buy new systems or processors with NPUs on board, and at least 16GB of RAM may be required for some features. Some of those expected events are not set in stone at the time of writing, but it is looking positive for the PC business. AMD’s server business is doing even better than the client side with its EPYC processors. AMD highlights that its 31.1% revenue share in the server market is a record for the company. It climbed 4.0% in revenue share YoY to reach this point and, consequently, is raking in record earnings from this segment. Server unit share was even better than revenue share for AMD. We see that the red team server unit share grew 5.5% YoY to 23.1% in Q4 2023. This is a big gain in another hotly-contested market. AMD highlights that the small QoQ unit share decline, also evident in the tabulated data, “reflects a larger number of our competitor’s server processors being sold into non-data center applications and higher Atom shipments.” The unnamed major competitor is, of course, Intel. If you want a closer look at Intel’s performance, look at our recent analysis of its Q4 FY2023 figures, published in late January. In brief, Intel experienced a lackluster 2023 on the whole but saw things spring back to life in the last quarter of the year. In contrast with AMD, though, its data center business saw a decline (down 10% YoY), partially blamed on a smaller overall market and inventory corrections. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Mark Tyson is a Freelance News Writer at Tom's Hardware US. He enjoys covering the full breadth of PC tech; from business and semiconductor design to products approaching the edge of reason. Granite Rapids shows up on CPU-Z boasting 80 cores and 672MB of L3 cache Half of Russian-made chips are defective: Baikal struggles to meet Russia's demand Chinese flash memory maker claims breakthrough - QLC NAND matches endurance of TLC NAND By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Roshan Ashraf ShaikhMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Anton ShilovMarch 27, 2024 By Aaron KlotzMarch 27, 2024 By Anton ShilovMarch 27, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}