{
    "title": "RDNA 4 Navi 48 and Navi 44 GPUs leak with details of performance, memory \nspec, and more",
    "date": "2/12/2024",
    "url": "https://www.notebookcheck.net/RDNA-4-Navi-48-and-Navi-44-GPUs-leak-with-details-of-performance-memory-spec-and-more.802603.0.html",
    "text": "AMD’s upcoming RDNA 4 series is expected to bring only entry-level and midrange GPUs as leaks point to a lack of high-end RX 8000 cards. But, even without any flagship products, the performance offered by the top RDNA 4 card could be quite respectable per Moore’s Law Is Dead. MLID alleges that the Navi 48 could bring performance “between the RX 7900 XT and the RX 7900 XTX” with a die size of around 300 to 350 mm2. As a comparison, the Navi 31 inside the RX 7900 XT (Available on Amazon) has a die size of 529 mm2 while the competing RTX 4070 Ti SUPER has a much smaller AD103 die measuring 379 mm2. Moving on, the leaker also reports that the Navi 48 features a 256-bit memory controller and could have 20 Gbps GDDR6 memory for “at least the initial launch”. In other words, AMD could pack different memory modules for different Navi 48 cards down the road. The Navi 44 which should be a lower mid-range chip supposedly ranges from >RX 7600 XT to <RX 7800 XT in performance. This could make the GPU on the levels of an RX 7700 XT (Available on Amazon) while being much better than the RTX 4060 Ti. Additionally, the Navi 44 is said to feature a die size of <210 mm2. If true, this would align the GPU with the Navi 33 (RX 7600 XT), which has a die size of 204 mm2. Finally, MLID also suggests that the RDNA 4 GPUs are fabricated on TSMC N4P and are monolithic. This would be a big departure from Team Red’s current RDNA 3 lineup which has MCM cards at the mid-range/top-end and monolithic dies at the bottom. The leaker also alleges that engineering samples of Strix and RX 8000 desktop cards are “currently boosting between 3 - 3.3 GHz” which is quite a bit higher than the retail RDNA 3 GPUs. For instance, the Navi 31 chip inside the RX 7900 XTX has a boost clock of 2.499 GHz. It is important to mention that the RDNA 4 cards are expected to be released in Q3 2024 at the earliest with a chance that the launch could shift to Q1 2025. This means that there are still months of waiting ahead before we officially hear anything from AMD. So, take the details mentioned here with a grain of salt. Moore's Law is Dead on YouTube "
}