{
    "title": "AMD Radeon RX 7900 XTX price plummets, thanks to RTX 4080 Super",
    "date": "2/2/2024",
    "url": "https://www.pcgamesn.com/amd/msi-radeon-rx-7900-xtx-deal",
    "text": "Join the 4K gaming club with this limited GPU offer, enabling you to get the fastest AMD GPU for just $929 in the US, or £899 in the UK. Ben Hardwidge Published: Feb 2, 2024 The GPU price fight is on, and we all have the launch of Nvidia’s new RTX Super GPUs to thank. The latest price drop is the AMD Radeon RX 7900 XTX, with a current GPU deal on NewEgg enabling you to pick up AMD’s flagship GPU in an MSI graphics card offer for $929.99 in the US, or just £899.99 in the UK. This new price is a good $70 lower than it was when we first wrote our Radeon RX 7900 XTX review, and in reality this top-end AMD GPU usually cost more than the original $999 MSRP when it was launched. It’s one of the best graphics card options around, with its massive 24GB of VRAM and superb rasterization performance giving it the edge over the overpriced Nvidia RTX 4080. That’s all changed with the release of the new RTX 4080 Super, though, and the result is a lower price. This current deal on NewEgg is only up for a day, and it enables you to pick up an MSI Gaming Radeon RX 7900 XTX Trio Classic. To take advantage of this offer in the US, click the link below, which will take you to the card’s landing page, where it’s priced at $949.99, which is already its lowest price in 30 days. You then need to apply the code SSDN2996 to get a further $20 off the price, bringing it down to $929.99. Meanwhile, gamers in the UK can pick up the card from Ebuyer now for just £899.99. The Radeon RX 7900 XTX is the fastest GPU available from AMD’s RDNA 3 stable, and it’s a really strong performer. And yes, it still beats the new RTX 4080 Super when it comes to raw rasterization power in games. In Cyberpunk 2077 at 4K, for example, it averages 61fps, while the RTX 4080 Super Founders Edition, manages 53fps. Its 195fps average in F1 23 is also well in front of the 155fps of the RTX 4080 Super FE. If raw 4K gaming power is your priority, then this is a great card at this price. The more expensive Nvidia GPU is better if ray tracing performance is a priority for you, plus it has the benefit of wide support for Nvidia’s DLSS 3 frame generation tech, while AMD’s equivalent FSR 3 tech is still only supported in a handful of games. However, if you want to get the best 4K gaming card for the cheapest price possible, this MSI Radeon RX 7900 XTX has a great price now. It’s also fantastic to see the knock-on effect of competition in the GPU market again, with new products coming out, and prices dropping – long may it continue. If you can’t afford to spend $929.99 on a GPU, you can also check out our new RTX 4070 Super review, as well as our Radeon RX 7600 XT review, with both these cards coming out at the start of this year. Ben Hardwidge                 A tech journalist since 1999, and a PC hardware enthusiast since 1989, Ben has seen it all, from the horrors of CGA graphics to the amazing ray-tracing GPUs of today. Ben is mainly interested in the latest CPU and graphics tech. "
}