{
    "title": "The Future of Wet AMD Treatments",
    "date": "2/20/2024",
    "url": "https://www.healthcentral.com/slideshow/future-of-wet-amd-treatments",
    "text": "Ophthalmologists share which emerging therapies for vision loss from retina damage excite them most. Slowing vision loss is the goal of treating wet age-related macular degeneration (AMD), a condition where leaky blood vessels damage the retina, sometimes causing blindness. Today, the go-to treatment for wet AMD is anti-VEGF injections, drugs that block vascular endothelial growth factor, the culprit behind abnormal blood vessels developing in the first place. Still, the hunt is on for new treatments that work longer, better protect against eye damage, and perhaps one day stop vision loss entirely. Here, our experts share the emerging wet AMD therapies that excite them most. The biggest challenge with anti-VEGF injection therapy? The “injection” part. Since the medication is delivered through a needle that is inserted directly into your eye, many people with this condition flinch at the idea of getting them, even though it’s their best bet for preserving their vision. What’s more, this method requires monthly visits to your doctor’s office, which can be both daunting and inconvenient. This is “not a one-time treatment,” explains Glenn Yiu, M.D., Ph.D., a professor of ophthalmology at UC Davis in Sacramento, CA. “Someone with wet macular degeneration has to keep getting injections of these drugs.” Medications including Avastin (bevacizumab), Eyelea (aflibercept), and Lucentis (ranibizumab) are used for anti-VEGF shots. When injected via a very thin needle through the white part of your eye (which your eye doctor will numb first so you don’t feel a thing), these drugs stop abnormal blood vessels from both growing and leaking, according to the American Academy of Ophthalmology. The whole process takes just a few seconds, but you need to repeat it regularly because the effects of the medicine wear off—which is why scientists are seeking more long-term solutions for people with wet AMD. The 2023 approval of a higher-dose version of Eyelea, called Eyelea HD, could mean fewer trips to the ophthalmologist’s office. Two clinical trials showed how 8mg doses of Eyelea HD given every four months showed the same safety and efficacy as the original 2mg monthly Eyelea injections, per the BrightFocus Foundation. The goal for eye injections going forward, then, is to develop longer-release dosages that you only need to get once per year. “That’s where we’re headed,” says Vaidehi Dedania, M.D., an associate professor of ophthalmology and director of the Vitreoretinal Surgery Fellowship at NYU Langone Health in New York City. Another, still-experimental approach is to inject a slow-release substance such as a nanoparticle or a gel into the eye. One possibility now being studied is a gel-based implant named (for now) OTX-TKI. This medication is a tyrosine kinase inhibitor (TKI), which works by blocking growth signals in cells. OTX-TKI releases slowly and continues working for six months or longer, according to a study presented at the Association for Research in Vision and Ophthalmology meeting. OTX-TKI is in phase I of clinical trials and must first gain approval by the U.S. Food and Drug Administration (FDA) before it reaches your doctor’s office. Eye drops to stop damage from wet AMD would be easier and less scary than injections—if they worked. “So far, eye drops have not been that effective, because not enough of the medication gets into the back of the eye,” says Ron Adelman, M.D., director of the Retina and Macula Service at Yale School of Medicine in New Haven, CT. One investigational drop, End Binding-3 inhibitor (EBIN), blocks a protein in cells lining blood vessels. It reduced or reversed AMD eye damage in mice and monkeys, per a study in Cell Reports Medicine,. Whether it works in humans is still unknown. Another way to avoid frequent injections is to implant a small device called a port, which slowly releases medication into the eye over time. The FDA already approved a port delivering a drug called Susvimo (ranibizumab) in 2021. One downside is that the port requires surgery to implant and remove. Another is the possibility of potentially serious side effects such as eye infection and retinal detachment. In 2022, the manufacturer voluntarily recalled Susvimo for more testing, per a letter from the company. It’s likely the port will ride again, following a promising 2022 study showing how port-delivered Lucentis worked as well as injections. Still in its infancy, gene therapy aims to be a one-and-done method that delivers the genetic code to give your own eyes the instructions to make the anti-VEGF protein that protects them against damaged blood vessels that cause wet AMD. Scientists are still working out the safest delivery methods before gene therapy will be available as a treatment. If it works, it could “revolutionize” wet AMD treatment, says Dr. Yiu. “Your eye can make the drug on its own, theoretically, forever,” Dr. Yiu says. “This would technically be a cure rather than a treatment.” Wet AMD erodes vision by damaging photoreceptors—cells in the retina that absorb light and turn it into a signal that the brain then processes into an image, per Fighting Blindness Canada. Optogenetics uses gene therapy to convert other types of cells in the retina into photoreceptors. A gene containing the instructions for making a protein called opsin is inserted into retinal cells, which takes over the job of photoreceptors from damaged cells, explains Dr. Liu. If perfected, optogenetics could restore vision to people who’ve lost sight from wet AMD. But researchers still need to find the right delivery route for the gene. As exciting as gene therapy sounds, it’s not without risks, some of them serious—at least using its current approach. Here’s why: At this stage of development, a virus is the most frequently used agent to deliver gene therapy into the eye, so your immune system might regard the virus as a threat. When immune cells go on the attack against this foreign pathogen, trying to kill it, they have the potential to create enough inflammation in your eye to cause vision loss or make the treatment less effective. Researchers at the University of Hawaii (and other institutions) are now looking for ways to control inflammation. Current wet AMD treatments aim to slow or stop vision loss. But in the future, stem cell therapy may actually restore lost vision from this condition by regrowing damaged areas of your retina, says Dr. Adelman. Here’s how it works in theory (if not yet in approved practice): Scientists “grow from stem cells the tissues that you need [for] repair,” he explains, then put them into a solution for your doctor to surgically place under your retina to regrow damaged areas. Or in a slightly different approach, your doctor implants a layer of stem cells beneath your retina to replace the damaged cells. While some companies are already promoting stem cell therapies using cells extracted from a person’s own blood or fat to treat wet AMD and other conditions. Dr. Adelman cautions against wasting your money on these unproven—and potentially dangerous—therapies. The cells these companies inject aren’t programmed to turn into retina cells, which is the goal (and much safer method) currently being researched. They could instead turn into blood or fat cells and cause severe vision loss. “It will take a while before stem cell therapy becomes safe and effective,” Dr. Adelman says. “It’s not ready for prime time.” Wet AMD may not yet have a cure—but there’s reason for optimism. Many possible approaches to gene therapy drugs and delivery methods are under investigation. “At this point, the genes that work on vascular endothelial growth factor look to be most promising,” says Dr. Adelman. In the meantime, anti-VEGF treatments, coupled with a healthy diet, exercising every day, and quitting smoking can help to slow or prevent vision loss. “We’re at a point where, if we can diagnose and treat patients early enough, we can preserve their vision and for some people, even improve it,” adds Dr. Dedania. Anti-VEGF Injections: American Academy of Ophthalmology. (2023.) “What Is Lucentis?” https://www.aao.org/eye-health/drugs/lucentis Eyelea Injections: BrightFocus. (2023.) “FDA Approves New Dose of Existing Drug to Treat Macular Degeneration.” https://www.brightfocus.org/macular/news/fda-approves-new-dose-existing-drug-treat-macular-degeneration Slow-Release Gel: ARVO Annual Meeting. (2023.) “U.S. Phase 1 Study of Intravitreal Axitinib Implant (OTX-TKI) for Neovascular Age-Related Macular Degeneration.” https://iovs.arvojournals.org/article.aspx?articleid=2786043 AMD Eye Drop: Cell Reports Medicine. (2023.) “End Binding-3 Inhibitor Activates Regenerative Program in Age-Related Macular Degeneration.” https://www.cell.com/cell-reports-medicine/fulltext/S2666-3791(23)00397-X Port Implants Recall: Genentech. (2022.) “Voluntary Recall of the SUSVIMO Ocular Implant.” https://www.gene.com/download/pdf/Susvimo_DHCP_Important_Prescribing_Information_2022-10-18.pdf Effectiveness of Port Implants: Ophthalmology. (2022.) “Archway Randomized Phase 3 Trial of the Port Delivery System with Ranibizumab for Neovascular Age-Related Macular Degeneration.” https://www.aaojournal.org/article/S0161-6420(21)00734-X/fulltext Gene Therapy (1): American Academy of Ophthalmology. (2022.) “Gene Therapy for AMD.” https://www.aao.org/eyenet/article/gene-therapy-for-amd Gene Therapy (2): The British Journal of Ophthalmology. (2021.) “Gene Therapy  For Neovascular Age-Related Macular Degeneration: Rationale, Clinical Trials, and Future Directions.” https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7848059/ How Wet AMD Damages the Eye: Fighting Blindness Canada. (n.d.) “Optogenetic Therapy to Treat Vision Loss.” https://www.fightingblindness.ca/optogenetic-therapy-to-treat-vision-loss/ Optogenetics: Biomolecules. (2022.) “Advances in Ophthalmic Optogenetics: Approaches and Applications.” https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8961521/ Controlling Gene Therapy Inflammation (1): American Academy of Ophthalmology. (2022.) “Gene Therapy for AMD.” https://www.aao.org/eyenet/article/gene-therapy-for-amd Controlling Gene Therapy Inflammation (2): Translational Vision Science & Technology. (2021.) “Inflammation in Viral Vector-Mediated Ocular Gene Therapy: A review and Report From a Workshop Hosted by the Foundation Fighting Blindness, 9/2020.” https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8024774/ "
}