{
    "title": "Sony reportedly sticking with AMD CPUs for the PS6",
    "date": "2/8/2024",
    "url": "https://www.pcguide.com/news/sony-reportedly-sticking-with-amd-cpus-for-the-ps6/",
    "text": "PC Guide is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Read More Last Updated on February 8, 2024 Nearly four years after the PS5’s chaotic release, its eventual successor, the as-yet-unnamed-but-will-likely-be-called-PS6, is already being discussed. Though specific details on Sony’s next gaming console remain scarce, industry insiders have revealed a few tidbits – one of these being that the multinational tech conglomerate will stick with AMD CPUs for their upcoming gaming system. Now, this isn’t exactly shocking, considering the PS4 and PS5 were equipped with the AMD Jaguar and Zen 2, respectively. What’s surprising, however, is that Sony apparently wasn’t considering any vendor other than AMD. According to YouTuber RedGamingTech, the only time Sony considered switching suppliers was prior to the PS5’s 2020 release. During that time, there had seemingly been discussions with other vendors, the most prominent of these being, of course, Nvidia. But for several reasons, including ease of backward compatibility and an already dedicated custom solutions team, Sony eventually decided to stick with its original supplier. Of course, we’d still recommend taking this information with a grain of salt. That is, until the PlayStation team arrives with more details and actual confirmation. Now, whether this remains true ahead of the PS6’s alleged 2028 release date remains to be seen. The company’s higher-ups remain tight-lipped on their upcoming gaming console leaving plenty of room for speculation. In the previously linked video, RedGamingTech also stated that “the number of compute units and the amount of RAM had not been nailed down,” indicating that it’s still very much in its early development phase. In addition, the PS5 Pro is reportedly gearing up for a late 2024 launch, though nothing is set in stone. This affords Sony some time to work on their next mainline console, the PS6, which will likely be an even more powerful machine with its next-gen AMD CPU. That said, you may need to remain patient for a long while before more information comes out. While you wait, we recommend reading through our PS5 Slim vs. PS5 comparison page to pass the time. You can also check out the best faceplates for the PS5 to make your console even flashier. Nico is a Tech News Writer for PC Guide. He is also adept at finding a good deal every now and then, stemming from his days penny-pinching as a broke college kid. PCguide.com is part of the BGFG family of websites. Our mission is to provide you with great editorial and essential information to make your PC an integral part of your life. You can also follow PCguide.com on our social channels and interact with the team there. © 2024 PC Guide. All rights reserved. Part of "
}