{
    "title": "AMD and Raytheon team up for advanced chip packaging for military \napplications",
    "date": "2/3/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/amd-and-raytheon-team-up-for-advanced-chip-packaging-for-military-applications",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. AMD and Raytheon will jointly develop technologies for military use. On Friday, AMD and Raytheon said they would work together on a multi-chip package technology that could enable multi-chip solutions based on AMD devices and others. The technology is developed under a $20 million contract through the Spectrum Missions Advanced Resilient Trusted Systems (S2MARTS) consortium, and the multi-chip packages are projected to be used for processing data from 'ground, maritime and airborne sensors,' though this is an ambiguous description. Based on the vague press release, the multi-chip package (or rather multi-chip packages, given three distinct natures of target applications, but we are speculating here) will convert RF data to a digital form and process it. These MCPs will rely on the latest industry-standard die-level interconnect technology, incorporate multiple chiplets to get new system capabilities, and cost-effectively enable high performance. The multi-chip package is set to rely on a Raytheon-designed interposer and is manufactured in Lompoc, California. Meanwhile, given AMD's expertise in 2.5D and 3D direct bonding technologies, we imagine the Red Team will input this know-how into the project. Yet, it should be noted that Raytheon has partnered with Xilinx (now part of AMD) for its field-programmable gate array (FPGA) solutions for decades, so it is not cast in stone that processing will be made on Zen-series general-purpose x86 cores and Ryzen CCDs and not on Xilinx FPGAs. FPGAs are highly suitable for RF signal processing tasks due to their inherent flexibility and parallel processing capability. Being a military initiative, the nature of the technology set to be developed by Raytheon and AMD is not to be disclosed entirely for quite some time, which is why its description is indistinct to put it mildly. \"By teaming with commercial industry, we can incorporate cutting-edge technology into Department of Defense applications on a much faster timescale,\" said Colin Whelan, president of Advanced Technology at Raytheon. \"Together, we will deliver the first multi-chip package that features the latest in interconnect ability – which will provide new system capabilities to our warfighters.\" The press release by Raytheon, a part of RTX, a military contractor, is meant to show U.S. taxpayers how and where their hard-earned money is spent rather than give an idea to the enemy about the devices that AMD and Raytheon can produce. To that end, do not expect it to contain detailed information on how U.S. military devices are set to use technologies jointly developed by AMD and Raytheon. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Anton Shilov is a Freelance News Writer at Tom’s Hardware US. Over the past couple of decades, he has covered everything from CPUs and GPUs to supercomputers and from modern process technologies and latest fab tools to high-tech industry trends. AMD 170W Granite Ridge Zen 5 CPUs and 128W Strix Point APUs revealed in shipping manifest — 16-core 'Fire Range' mobile CPUs also coming AMD says the UCIe universal chiplet interface will create a whole ecosystem — custom multi-chiplet designs are the future Seven-year-old AMD gaming GPU continues to stick around — low-profile RX 550 arrives for SFF PCs By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}