{
    "title": "Storage startup uses your GPU to create virtual super fast SSD — but for \nsome reason, it is not yet compatible with Intel ...",
    "date": "2/4/2024",
    "url": "https://www.techradar.com/pro/storage-startup-uses-your-gpu-to-create-virtual-super-fast-ssd-but-for-some-reason-it-is-not-yet-compatible-with-intel-and-amd-tech",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Graid's SupremeRAID technology only works with Nvidia GPUs Graid's SupremeRAID delivers storage speeds well above what can be achieved with conventional RAID configurations, and optimizes NVMe SSD performance by combining a GPU with a software-defined storage (SDS) stack. RAID cards can only reach speeds of up to 28GB/s with Gen4 SSDs and so to fully utilize one RAID card, you need four Gen4 SSDs. To maximize the use of a 24-bay server, you'll need several RAID cards. However, SupremeRAID is different. It can support up to 32 drives in a single system and isn't restricted by the maximum bandwidth of a PCIe slot. Graid's technology is designed to streamline data flow from the CPU to the NVMe SSDs, bypassing CPU cycle consumption and eliminating throughput bottlenecks. This approach is intended to enhance the performance of NVMe SSDs, which are known for their high speed and low latency, and are crucial in tasks such as CAD, video editing and, IoT. The caveat with the SupremeRAID system is it’s currently only compatible with Nvidia GPUs. Graid’s first card, the SR-1000, has a PCIe gen 3 interface, while the follow up, SR-1010 uses the faster PCIe gen 4. They have now been joined by a third, entry level card, the SR-1001. This is a cut down version of the SR-1000 (with a PCIe gen 3 interface) and tops out at 80GB/s 1M sequential read speeds, versus 220GB/s. It's also limited to a maximum of eight NVMe SSDs, rather than the 32 supported by its more powerful siblings, targeting it squarely at prosumers and the home server market. Leander Yu, President and CEO of Graid Technology, said, \"As NVMe SSDs play a crucial role in cloud, core, and edge infrastructure, the demand for enhanced data protection without compromising performance is evident. SupremeRAID SR-1001 addresses this need by delivering best-in-class performance and airtight data protection while optimizing throughput, parallelism, and latency, ensuring seamless performance at the edge. We are excited to add the SR-1001 to the SupremeRAID suite of products.” The SupremeRAID SR-1001, for 1U towers and edge servers, is apparently available to buy now, but pricing is not currently known - anyone heading to the company's website is directed to a list of suppliers, but clicking on the link opens up a form to request more information. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! TechRadar Pro has contacted Graid asking for more information. Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. This new phishing attack targets iPhone and Android alike via RCS 'Wean itself off Nvidia': Samsung signs $750 million agreement with South Korea's largest online platform — Naver wants to replace Nvidia's super expensive AI GPU with the more affordable Mach-1 chip Tidal's game-changing feature lets your friends open shared songs in Spotify By Marc McLarenMarch 28, 2024 By Alex BlakeMarch 28, 2024 By Rhys WoodMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By James IdeMarch 28, 2024 By Mackenzie FrazierMarch 28, 2024 By Kristina TerechMarch 28, 2024 By Craig HaleMarch 28, 2024 By Darren AllanMarch 28, 2024 By Nigel PowellMarch 28, 2024 By Steve ClarkMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}