{
    "title": "Geographic Atrophy: Using AI to Predict Its Short-Term Progression - \nGeographic Atrophy and Other Aspects of AMD",
    "date": "2/16/2024",
    "url": "https://www.medpagetoday.com/resource-centers/geographic-atrophy-other-aspects-amd/geographic-atrophy-using-ai-predict-its-short-term-progression/5001",
    "text": "By Jonathan D. Agnew, PhD, MBA Geographic atrophy (GA), an advanced form of age-related macular degeneration (AMD), presents a complex challenge in ophthalmology due to its progressive nature and significant impact on central vision. However, despite affecting millions of patients globally, the study of GA prevention is hindered by the relatively low annual progression rate from intermediate AMD (iAMD) to GA, which is around 0.75% to 3.70%. This low rate of progression complicates clinical studies, necessitating long durations and large patient cohorts. To address this issue, researchers from Duke University Medical Center, in Durham, N.C., have tested the possibility of using deep learning for predicting the progression from iAMD to GA.1 The results of their research, led by Eliot Dow, MD, PhD, and recently published in JAMA Ophthalmology, showed how algorithms that require no human annotation or expert-defined features, and are adaptable to various spectral-domain optical coherence tomography (SD-OCT) devices, could enable early identification and intervention for patients at highest risk of progression to GA. This approach promises a more targeted and efficient management of GA, potentially revolutionizing the field of retinal disease treatment. A much larger role for AI? According to Eleonora Lad, MD, PhD, of the Department of Ophthalmology at Duke, and one of the study’s authors, the research “describes the creation and validation of DeepGAze, a fully automated and accurate AI [artificial intelligence] algorithm for predicting progression from intermediate AMD to GA within 1 year based on 1 OCT scan.”1 The study analyzed 3 distinct data sets. The first, sourced from the Age-Related Eye Disease Study 2 (AREDS2) Ancillary Spectral-Domain Optical Coherence Tomography (A2A) study, included scans from 4 institutions. It consisted of 304 SD-OCT scans of eyes with GA, and scans of eyes with iAMD that either did or did not progress to GA within a year. The data collection adhered to specific criteria for GA and iAMD, based on retinal pigment epithelium atrophy, choroid enhancement, and outer plexiform layer changes. The research team employed a multi-view, convolutional neural network architecture, using parameters from the Inception version 3 neural network. This model was initially trained on natural images from ImageNet, which is widely used to develop deep learning algorithms, and further specialized with a domain-specific SD-OCT data set. The analysis involved a position-aware model incorporating a transformation layer and attention weights, facilitating a more precise prediction of GA progression. The model underwent fivefold cross-validation, and its effectiveness was assessed using receiver-operating characteristic curves, confusion matrixes, and attention maps. Ablation studies were conducted to evaluate the contribution of each model component. For validation, the model was applied to 2 independent SD-OCT data sets from Duke University Health System, including Spectralis SD-OCT scans. The model checks all of the boxes The study encompassed 417 patients across 3 data sets, demonstrating high accuracy in predicting GA progression from iAMD using a convolutional neural network model. The model showed strong performance metrics, including high sensitivity, specificity, and positive predictive values in cross-validation and independent validation sets. Additionally, the integration of human-annotated features only marginally improved the model’s predictive accuracy, barely exceeding that of the fully automated model. The model’s capability extended to identifying current GA and predicting progression within a 2-year time frame, with reduced efficacy beyond this period. Attention maps generated by the model revealed key areas influencing GA prediction, supporting its validity. The study also highlighted the model’s potential in selecting participants for clinical trials, showing significant fold enrichment in identifying progressing patients. Based on these results, the authors emphasized the model’s ability to identify the progression from iAMD to GA using a fully automated, deep-learning algorithm. This approach surpasses previous methods in accuracy, automation, and validation, addressing a critical need in ophthalmology. Moreover, the authors assert that the model, trained on a large data set and validated in routine patient care settings, demonstrates strong predictive capabilities and specificity for short-term progression. “This algorithm will facilitate enrollment for clinical trials for iAMD through high-throughput screening of large databases,” Dr. Lad notes. “As it becomes available in the future, it may help physicians decide which patients with GA would greatly derive a benefit. The algorithm can identify patients who should be monitored more frequently so that therapy can be initiated proactively.” Patients with iAMD will be better served The study’s limitations include a relatively small data set for deep learning, evolving definitions of GA, and limited racial diversity in the training data. These factors may impact the generalizability and predictive accuracy of the algorithm, highlighting the need for larger, more-diverse data sets and prospective validation studies. Nonetheless, the authors conclude that their study introduces a novel deep-learning algorithm for detecting GA and predicting its progression from iAMD within a year. Its performance is promising, potentially enhancing clinical trial enrollment, treatment decision-making, and patient monitoring. “The algorithm should be implemented in clinical trials,” Dr. Lad insists, “to identify intermediate AMD patients at risk for conversion to GA in 1 year who would benefit most from therapies in the pipeline.” Published:  February 16, 2024 References The material on this site is for informational purposes only, and is not a substitute for medical advice, diagnosis or treatment provided by a qualified health care provider.\n      © 2005–2024\n      MedPage Today, LLC, a Ziff Davis company. All rights reserved.\n      Medpage Today is among the federally registered trademarks of MedPage Today, LLC and may not be used by third parties without explicit permission. "
}