{
    "title": "AMD: Potential Upside Increases Amidst Strong Growth",
    "date": "2/15/2024",
    "url": "https://seekingalpha.com/article/4670606-amd-potential-upside-increases-amidst-strong-growth",
    "text": "Bloomberg/Bloomberg via Getty Images  Bloomberg/Bloomberg via Getty Images In my second article about Advanced Micro Devices, Inc. (NASDAQ:AMD), released after Q3 2023, I rated the stock as a strong buy, citing that after reevaluating my models, the potential fair price of AMD stock had increased to $273.2, from the $129.9 target set in my first article two months previously. This increase in fair price in the second article was caused by AMD's beat of Q3 2023 estimates as well as a personal error where I didn't correctly average analysts' estimates and therefore made the model excessively conservative. Since my first article, where I explained that even after putting AMD in the most conservative conditions the stock still had a 18% upside, the total rally of AMD has been of around 87.85%. In this article, I will update my models with the new financial information available from Q4 2023 earnings released on January 30th. As you will see, my fair price estimate for AMD has increased to $282.34 and the future price to $653.99. This indicates that AMD can offer a 61.9% upside from the current stock price of $174.36. Finally, as you will see, even if AMD's fails to meet analyst estimates and instead performs as indicated by the conservative second model, the stock would still be undervalued by 45.4%. Therefore, I reiterate my strong buy rating on AMD. AMD reported Q4 2023 earnings where it beat estimates in EPS and revenue. The beat, according to AMD, was driven due to strong embedded and data center growth. Data center finished 42% up YoY. Nevertheless, AMD's stock was weaker because the company lowered forecast for Q1 2024. The main segment affected by the lowered forecast was AMD's gaming segment, which reported a 17% decline due to slower console sales. The segment finished 7% down YoY, and for Q1 2024, the company expects that sales of chips for consoles will decline by a \"significant double-digit percentage.\" The client segment was also severely affected. This segment ended down by 51% in a YoY basis. This is very important to monitor in my opinion, since it's one of AMD's core businesses, and it surprised me that it shrank by such a significant percentage. The company said that this was because the PC market was weak, and that companies hold significant inventories of their chips. AMD Q4 2023 Earnings AMD Q4 2023 Earnings The most important segment right now is the one involving data centers. The Worldwide Data Center Market is expected to grow its revenue at a CAGR of 6.56% throughout 2028. Statista Statista However, inside this market we can find the AI segment, which uses data centers and drives data center revenues. The AI market is expected to expand at a CAGR of 17.30% from 2023 to 2030. However, for the period 2022-2026, the spending on AI-centric systems is expected to grow at a CAGR of 27%. For this reason, in my second valuation model, data center revenue will grow by 27% from 2024 to 2026 and later it will grow at a rate of 17.30%. Statista Statista This segment involves the CPUs and GPUs AMD includes in each of the PCs we purchase as well as in all the gaming consoles. Meanwhile, embedded refers to more simple chips like those used in some appliances. The worldwide PC market is expected to grow at a CAGR of 9.1% throughout 2029. Meanwhile, the global embedded processors market is expected to grow at a CAGR of 8.12% throughout 2031. AMD's revenue has been growing at a 55.3% annual pace since 2017, while net income has being growing by 448%. However, operating income has been decreasing at a 36% annual pace. This is because of a considerable slump that started after 2021. You can see that in the graph below. Since my previous article, released in Q3 2023, revenue has grown by 2.57%, operating income has shoot up by 501%, as well as net income which increased by 310%. Margins have gone further into the positive, with operating margin passing from -0.36% to 1.77% and net income margin going from 0.94% to 3.77%. Author's Calculations Author's Calculations Author's Calculations Author's Calculations AMD's balance sheet continues to be in excellent condition. Cash reserves have stayed almost unchanged, passing from $5.77 billion to $5.78 billion. Short-term debt increased slightly from $1.14 billion to $1.39 billion as well as long-term debt, growing from $1.715 billion to $1.717 billion. Author's Calculations Author's Calculations Lastly, free cash flow has decreased slightly by around $50 million and now stands at $1.57 billion. Because of this, the FCF margin passed from 7.3% to 6.9%. The main cause of the reduction in FCF was a decrease in cash from operations, which passed from $1.85 billion to $1.66 billion. Author's Calculations Author's Calculations Author's Calculations Author's Calculations Author's Calculations Author's Calculations In this valuation, I will create two discounted cash flow, or DCF, models. The first one will be based on available analysts' estimates, and the second one in available market trends for each of AMD's segments. The objective of this is to have an idea of how AMD's stock could perform if they don't meet analysts' estimates. In the table below, you will find all the current financial data for AMD n necessary for the calculation of the WACC. For AMD, the WACC came out at 13.99%. Furthermore, D&A, interest expenses, and CapEx will be calculated with a margin tied to revenue, so they will rise over time. The future price, in both models, will be calculated using the historical growth of each of the equity's elements. Long-term debt will grow at the 4.9% rate displayed since 2027, meanwhile short-term debt will grow at 18.5% annually as displayed in 2021 and 2023. Marketable securities will also grow at the rate displayed since 2021, which is 10%, as well as current assets, which will grow by 47.68% annually. In this first model, I will calculate the potential fair price and future price for AMD, based on the average estimates available at Seeking Alpha. The first aspect is EPS, which as you can see, is expected to grow at double-digits until 2027, and then there will be a slump. This slump may be caused by the semiconductor cycle, which may be expected to start its slowdown period in 2028. Seeking Alpha Seeking Alpha Then, it's revenue, which is also expected to grow at double-digits, and after 2027, there will be a slump in growth. For 2024, average estimates indicate a revenue of $25.82 billion and $32.47 billion for 2025. You can observe the rest of the estimates in the table below. Seeking Alpha Seeking Alpha Author's Calculations Author's Calculations This model, based on average analysts' estimates, suggests a fair price of $311.14, which implies an 78.4% upside from the current stock price of $174.36. The future price suggested for 2029 is $716.04, which translates into annual returns of 51.8% annually throughout 2029. In this second model, I will make each of AMD's segment grow by their respective market CAGR, this means that Data center will grow at a rate of 27% from 2024 to 2026, and from 2027 to 2029 will grow by 17.30%. Meanwhile, client and gaming will grow at a rate of 9.1% and embedded by 8.12% annually. Lastly, net income will be calculated with the same net income margin derived from the previous model. This is because I prefer to manipulate net income through revenue. In the bar graph below this table, you will be able to see a comparison of the EPS estimates suggested by these two models. Author's CalculationsAuthor's Calculations Author's Calculations Author's Calculations As you can see, this second model is far more conservative than the first one; however, it suggests that AMD could still offer a very decent near-term upside of around 45.4%, if it adjusts to its estimated fair price of $253.55. For 2029, the estimated fair price is $591.94, which translates into annual returns of 39.9% throughout 2029. The second model indicates that even if AMD grows at the average market trend, and therefore achieves EPS estimates that are lower than those expected by analysts, the stock would still be around 45.4% undervalued. This is important because it basically assures us that AMD is undervalued, and something severe would need to happen for its stock to go down. Furthermore, even in the second conservative model, the stock can still offer 39.9% annual returns. This means that AMD even after an 87.85% rally since my first article, AMD still has a very decent upside, and if it does meet analysts' estimates, then the stock's upside could be of 78.4% and the potential annual returns would climb up to 51.8% throughout 2029. Taking this into account, the stock continues to be a strong buy and I will set a stock price target of $282.34 and a future price for 2029 of $653.99. Both are the average of the results yielded by both models. AMD seems basically unstoppable right now. However, in the unlikely scenario that the whole market slows down and it stays like that until 2029, then all of the second model would probably be voided, and analysts' estimates would probably also be revised down. This could potentially cause the perceived safety on AMD's stock to disappear. This would void my thesis, and my strong buy rating could potentially be downgraded to a hold. Secondly, there is the risk that AMD's client and gaming segments continue to be in trouble due to high inventories and weakened consumer demand. If a sudden recession occurs because of rate hikes, then the situation could become worse. Finally, I think that market sentiment is very important for AMD right now, since it's trading at very high multiples, as you can see on Seeking Alpha. This means that if AMD continuously issues weak guidance, the stock could take a huge dive, even if it's undervalued. In conclusion, despite an 87.85% rally since my first coverage, AMD still has a very decent upside to offer, which according to my estimates could be around 61.9% upside. After conducting the two DCF models, I arrived at the conclusion that AMD continues to be a strong buy, because the conservative second model suggests than AMD's upside is around 45.4% and annual returns around 39.9%. This indicates that AMD has a huge security margin and that it can miss analysts' estimates by a huge margin and still be undervalued. My new fair price is set at $282.34 and the future price at $653.99, both indicating huge returns in case AMD comes in between the estimates of the first and second DCF models. For Q1 2024, I would monitor the AMD client and gaming segments to observe if gaming consoles chips does not perform as bad as forecasted and if client reverts some of that 51% YoY drop it registered for FY2023. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, but may initiate a beneficial Long position through a purchase of the stock, or the purchase of call options or similar derivatives in AMD over the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}