{
    "title": "Former AMD Radeon boss says NVIDIA is the GPU cartel",
    "date": "2/27/2024",
    "url": "https://videocardz.com/newz/former-amd-radeon-boss-says-nvidia-is-the-gpu-cartel",
    "text": "Scott Herkelman, former AMD Radeon chief, has something to say about NVIDIA practices.   Scott Herkelman & Jensen Huang, Source: AMD/NVIDIA  According to the article on Wall Street Journal (via Tom’s Hardware), NVIDIA might be delaying data center GPU orders if customers start eyeing other options. This was stated by a company called GroQ, a new AI chipmaker. Such customers are cautious about looking for alternative AI accelerated hardware out of fear that NVIDIA may potentially delay the shipment of already ordered products as a form of retaliation. Contrary to NVIDIA’s statements about fair supply practices and offering alternative access to compute hardware during shipment delays, Groq’s CEO, Johnathan Ross, alleges that some customers are now avoiding meetings with rival AI chipmakers. These customers, who often pay in advance, may face up to a year-long wait for new hardware shipments. Despite the delays, some customers prefer to wait for updates from NVIDIA rather than considering alternative options. Former Senior Vice President and General Manager at AMD Radeon, Scott Herkelman, suggests that such situations are more common than some may think. He claims that NVIDIA has been employing similar tactics with data center clients, OEMs, and AIBs, impacting resellers and even the press as well. This happens more than you expect, NVIDIA does this with DC customers, OEMs, AIBs, press, and resellers. They learned from GPP to not put it into writing. They just don’t ship after a customer has ordered. They are the GPU cartel and they control all supply. — Scott Herkelman (@sherkelman) February 27, 2024  Herkelman further noted that, following the controversy surrounding the GeForce Partner Program (GPP), NVIDIA has adopted a more cautious approach by avoiding written agreements. The company faced intense scrutiny from media and graphics enthusiasts when details about the GPP surfaced, leading to its eventual abandonment. Source: Scott Herkelman, Wall Street Journal, Tom’s Hardware We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}