{
    "title": "China blocks use of Intel and AMD chips in government computers, FT reports",
    "date": "3/23/2024",
    "url": "https://theprint.in/tech/china-blocks-use-of-intel-and-amd-chips-in-government-computers-ft-reports/2013573/",
    "text": "(Reuters) –     China has introduced new guidelines that will mean U.S. microprocessors from Intel and AMD are phased out of government personal computers and servers, the Financial Times reported on Sunday. \n\n (Reporting by Akanksha Khushi in Bengaluru; Editing by Christian Schmollinger)\n\n\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content.\n\n\r\n\t\t\t\t\tShow Full Article (Reuters) –     China has introduced new guidelines that will mean U.S. microprocessors from Intel and AMD are phased out of government personal computers and servers, the Financial Times reported on Sunday. (Reporting by Akanksha Khushi in Bengaluru; Editing by Christian Schmollinger)\n\n\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content.\n\n\r\n\t\t\t\t\tShow Full Article  (Reporting by Akanksha Khushi in Bengaluru; Editing by Christian Schmollinger) Disclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content.\n\n\r\n\t\t\t\t\tShow Full Article Disclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content.   Subscribe to our channels on YouTube, Telegram & WhatsApp Support Our Journalism India needs fair, non-hyphenated and questioning journalism, packed with on-ground reporting. ThePrint – with exceptional reporters, columnists and editors – is doing just that. Sustaining this needs support from wonderful readers like you. Whether you live in India or overseas, you can take a paid subscription by clicking here. Support Our Journalism Save my name, email, and website in this browser for the next time I comment.  Δ Required fields are marked *  Name * Email *  Δ Copyright © 2024 Printline Media Pvt. Ltd. All rights reserved. "
}