{
    "title": null,
    "date": "3/5/2024",
    "url": "https://gamingbolt.com/horizon-forbidden-west-pc-requirements-revealed-requires-150-gb-of-ssd-space",
    "text": "  Posted By Shubhankar Parijat | On 05th, Mar. 2024  Horizon Forbidden West is the next big first-party PlayStation exclusive that’s making the jump to PC, and ahead of its launch for the platform later this month, Sony has revealed the port’s system requirements- and they’re quite hefty, as you might expect from a game this technically ambitious. Regardless of which preset you’re choosing to play the game at, you’re going to need 16 GB of RAM, an SSD, and an eye-watering 150 GB of storage. On the lowest settings, which will run the game at 720p and 30 FPS, you’ll need either an i3-8100 or a Ryzen 3 1300X, along with either a GeForce GTX 1650 or a Radeon RX 5500XT. Meanwhile, on the highest settings, to play the game at 4K and 60 FPS, you’ll need either an i7-11700 or a Ryzen 7 5700X, along with either a GeForce RTX 4080 or a Radeon RX 7900XT. You can check out the full system requirements below. Horizon Forbidden West Complete Edition will launch for PC via Steam and Epic Games Store on March 21. Follow us: Publisher:Sony Developer:Guerrilla Games Platforms:PS5, PS4 View More Publisher:Rockstar Games Developer:Rockstar Games Platforms:PS5, Xbox Series X View More Publisher:Sony Developer:Arrowhead Game Studios Platforms:PS5, PC View More In a move that's likely to be controversial, Bandai Namco is set to add a battle pass to the fighter. Embracer Group initiated its restructuring program in June 2023, leading to multiple project cancellations and... Of the five sequels that are in development, only one – Homeworld 3 – has been officially announced thus f... All the boss fights in Dragon's Dogma 2 and how to beat them all. The free demo features the first stage and boss fight, with save data carrying over into the game when it laun... Within hours of news breaking that Gearbox had been sold by Embracer Group, several staff members were informe... View More "
}