{
    "title": null,
    "date": "3/24/2024",
    "url": "https://sg.news.yahoo.com/amds-top-zen-5-motherboards-122831340.html",
    "text": "The sails on the CPU rumour mill are really churning at the moment, with reports that AMD's successor to its Zen 4 chip design will be launched this year. New processors also means new motherboards and it's being reported that the top-of-the-line X870E chipset will go one better than the current X670E by offering full USB4 40Gbps connection. However, this will require an additional chip to be added on the motherboard, rather than being part of the X870E device itself. Take a look at any of the good X670E motherboards on the market right now and you'll see that there are two AMD-stamped chips embedded in the circuit board; one so-called upstream chipset and one downstream chipset. Well, they're usually buried under heatsinks, so they're not always obvious. Some manufacturers will sometimes include another chip, just to expand the connectivity options. For example, the Asus ROG Crosshair X670E Hero has an Intel Thunderbolt chip for its USB4 ports. For its next generation of motherboard chipsets, AMD is apparently requiring that all manufacturers (via ChipHell) do this for any that will use the forthcoming X870E chipset. More specifically, it's being claimed that it has to be an ASMedia ASM4242 USB4 master chip, though its possible that other makes could be permitted at a later date. X670E motherboards are generally quite pricey, with those already sporting a triple-chip chipset configuration being the most expensive. If AMD is going to demand that this becomes the norm for anything using X870E, then the chances of seeing a 'budget' version looks pretty slim. If all of this is true, it does raise a simple question: Why hasn't AMD included a USB4 controller in its own chips? In other words, why does it need a third party solution? Board walk Best gaming motherboard: the best boards around Best AMD motherboard: your new Ryzen's new home It's probably down to good old fashioned cost saving. Designing and implementing a USB4 controller isn't quick nor cheap, and it's far easier to just let motherboard vendors use whatever solution they like to add USB4 support. However, in this case it's no longer optional so it will be interesting to see how many X870E board variants we'll actually see. As to why AMD is apparently insisting on everyone using a specific ASMedia chip, that's probably down to the chipset engineers wanting to design something that will work perfectly, no matter what make or model of X870E motherboard you get. And the easiest way to achieve that is to limit what USB4 chip vendors can use. If you were looking to upgrade your gaming PC to a Zen 5 Ryzen 9000-series configuration this year, you may want to set aside a little more money than you'd originally planned for. One extra USB4 controller shouldn't cost very much, you can bet vendors will hike up their prices anyway. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order.  My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap.  New agile US Marine formations are learning how to battle adversaries like China on remote islands, according to The Washington Post. In this week’s travel roundup we bring you transport trivia, Roman engineering marvels and the world’s tastiest dumpling. Dini von Mueffling is a PR professional in New York City's who's worked with Monica Lewinsky and Virginia Giuffre. If given HK$8 million to spend, Yat says he would invest in digital assets such as non-fungible tokens When Sam* married her husband, she never imagined that 20 years on, she'd have not one, but two affairs... Surveillance footage captures the harrowing moment a wild boar viciously attacks a 70-year-old man in his front yard in Guangyuan, China, on March 24. The man sustains severe spinal injuries while defending himself against the enraged animal's assault. Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp. 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ The post Bites by Ann Chin: Michelin popiah, loaded waffles & local bites in hole-in-wall eatery appeared first on SETHLUI.com. The visibly upset MSNBC anchor was responding to the Trump's attack on Judge Juan Merchan's daughter despite gag orders The post Nicole Wallace Gets Fed Up, Tosses Script While Covering Latest Trump Attack: ‘What Are We Going to Do Different?’ | Video appeared first on TheWrap. City Developments Limited ( SGX:C09 ), is not the largest company out there, but it received a lot of attention from a...  Israel assassinated a Syrian colonel in Damascus and a senior Hezbollah commander in Lebanon in a series of pinpointed strikes amid the largest attacks on neighbouring countries since the start of the war in Gaza. Watch as King Charles III attends church on Easter Sunday in his most significant public appearance since he was diagnosed with cancer.  The Princess of Wales and her family will not be at the service.  Charles, 75, will join the Queen and other members of the royal family at the annual Easter Mattins Service at St George’s Chapel at Windsor Castle on Sunday 31 March. Full-back has become invaluable at Anfield and would surely thrive under Klopp’s possible replacement Roberto De Zerbi  The post Fiie’s Cafe — ‘Mr Grumpy’ fried chicken officially lands in Toa Payoh appeared first on SETHLUI.com. Health officials are alerting doctors to be on the lookout for certain types of rare but serious meningococcal infections that are on the rise in the United States. Princess Eugenie and Princess Beatrice reportedly want to become working royals and are upset about King Charles snubbing them. "
}