{
    "title": "Talking Gazette: Community Service for Sight amd Accessibility",
    "date": "3/3/2024",
    "url": "https://www.bluemountainsgazette.com.au/story/8537886/talking-gazette-community-service-for-sight-amd-accessibility/",
    "text": "For around 20 years, the Talking Gazette has made sure that nobody in the community will miss the news just because they have issues with sight or reading. In that time, locals like Alastair and Sheila Fyfe have sat down each week with a cup of tea and caught up on the Blue Mountains Gazette while reading aloud for a recording. Since 2005, these these recordings (delivered on CD today) have been sent to homes across the Mountains, providing an accessible and relaxed way to keep up with recent happenings. Mr Fyfe, 86, said when they moved to Springwood in 2001 the Talking Gazette seemed like a great way to get involved and make a positive impact on the town. \"The personal commitment to doing something for community is really where the draw came from for us getting involved, and continuing to be involved with it,\" he said. Mrs Fyfe, 85, partly attributes her husband's success over the years to his engaging Scottish accent, a remnant of their home near Fife - along with their last name. She said the pair have made good friends through the Talking Gazette and are part of a very strong group, but are finding that fewer people are getting involved with the program today. \"Basically it seemed a good idea, something nice to do for your community. And that's why it distresses us that we don't have a bigger audience, honestly,\" Mrs Fyfe said. \"I would like it to be circulated more around places like here.\" Today the couple are based in Lyndhurst Retirement Village in Springwood. Mr Fyfe is no longer able to read for the Talking Gazette, but the pair still value receiving it, and are hopeful that more volunteers will get on board. \"The feedback we get is that it's a very useful service, and that [listeners] hope it won't stop,\" Mr Fyfe said. The Talking Gazette began in 2003 when Springwood stalwart Thelma Murphy approached the Springwood Neighbourhood Centre with the idea. It was taken up with gusto by community development officer Morna Colbran with backing from the Western Sydney Area Assistance Scheme, the Ivy Market, The Gazette, Springwood Lions Club, Springwood/ Winmalee Action Group and Springwood Rotary, which donated all the takings from their 2004 Antique Fair. Springwood Neighbourhood Centre Cooperative (SNCC) spokesperson Tonje Akerholt said it all started with \"a small group of proactive locals wanting to make a difference\". \"SNCC's continued involvement and ongoing support has been driven by community need and the hard work of the Talking Gazette's small band of volunteers,\" she said. \"Those who benefit from the Talking Gazette include anyone with vision impairment, dyslexia, Parkinson's disease, dementia or dyspraxia.\" If interested in volunteering to narrate or receive the Talking Gazette, phone 4751 30333 or email reception@sncc.org.au. Narrators need clear diction and to be available to narrate on Wednesdays afternoons (in their own homes). All equipment is provided and volunteers make copies of the material and mail out to their 30 current recipients. Lower Mountains Correspondent Lower Mountains Correspondent Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our Privacy Policy. Advertisement "
}