{
    "title": "This PS5 Pro leak reveals a massive jump in performance",
    "date": "3/19/2024",
    "url": "https://ca.news.yahoo.com/ps5-pro-leak-reveals-massive-202342076.html",
    "text": "Sony is indeed working on a more advanced version of the PlayStation 5 that could feature a more powerful GPU that’s potentially up to three times faster for specific tasks compared to current PS5 models. YouTuber Moore’s Law is Dead claims to have obtained a technical overview document for the PS5 Pro, code-named Trinity, and Insider Gaming’s Tom Henderson has confirmed the leaked specifications’ accuracy, which suggests a holiday 2024 release window for the console. The leaked technical document mentions some of the potential specs, including 67 teraflops of 16-bit floating-point calculations, which translates to around 33.5 teraflops of single-precision compute. This is a 45% rendering performance boost over the standard PS5, which operates at 10.28 teraflops. Now, comparing teraflops between the two consoles doesn’t really make sense due to architectural changes in AMD’s RDNA technology. The PS5 Pro could potentially move from a setup akin to an AMD Radeon RX 6700 to something closer to a Radeon RX 7800 XT, offering improved ray tracing capabilities and up to three times the performance in some cases. Sony PlayStation 5 Pro Sony PlayStation 5 CPU AMD Zen 2 architecture 8-cores, 16 threads at 3.5GHz / 3.85GHz AMD Zen 2 architecture 8-cores, 16 threads at 3.5GHz Compute units 60 CUs, RDNA 3 (unconfirmed) 36 CUs, RDNA 2 TFLOPs 33.5TF 10.23TF GPU clock speeds 2.18GHz (unconfirmed) 2.23GHz Memory 16GB GDDR6 at 18Gbps 16GB GDDR6 at 14Gbps Memory interface 256-bit/576GB/s 256-bit/448GB/s Additional details from Henderson indicate that the PS5 Pro might follow the recent PS5 redesign, with a detachable disc drive and faster system memory running at 576 GB/s, along with improved audio hardware capable of processing more effects. The Pro variant is also rumored to share the same CPU as the base PS5, but could include a “High CPU Frequency Mode” that will boost clocks up to 3.85GHz, resulting in a 10% performance increase. However, activating this mode may slightly throttle the GPU. The leak also suggests the inclusion of PlayStation Spectral Super Resolution (PSSR), a machine learning-based upscaling technology similar to Nvidia’s DLSS or AMD’s FSR that potentially supports upscaling to 8K resolutions and enhancing ray tracing performance on the PS5 Pro hardware. For a comprehensive breakdown of the leaks, we recommend checking out Digital Foundry’s video, which also confirms the validity of the leaks. While initial leaks have raised some skepticism, Henderson’s insights, indicating Sony’s first-party studios testing PS5 Pro dev kits since September and third parties gaining access in January, align with previous reports of a targeted November 2024 release for the PS5 Pro. AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. The post 5 Artificial Intelligence (AI) Stocks That Could Be Millionaire Makers appeared first on The Motley Fool Canada. SAN FRANCISCO (AP) — Google co-founders Larry Page and Sergey Brin loved pulling pranks, so much so they began rolling outlandish ideas every April Fool's Day not long after starting their company more than a quarter century ago. One year, Google posted a job opening for a Copernicus research center on the moon. Another year, the company said it planned to roll out a “scratch and sniff” feature on its search engine. The jokes were so consistently over-the-top that people learned to laugh them of  Fifteen years after it was created, the messaging app runs the world. This week, TC's auto reporter Sean O'Kane revealed how EV startup Fisker temporarily lost track of millions of dollars in customer payments as it scaled up deliveries, leading to an internal audit that started in December and took months to complete.  Mostaque’s departure from Stability AI -- the startup known for its popular image generation tool Stable Diffusion -- comes amid an ongoing struggle for stability (pun intended) at the company, which was reportedly spending ~$8 million a month as of October 2023 with little revenue to show for it.  Fisker suspended: Fisker's bad week continued with a halt in the startup's stock trading. Chinese state-sponsored hackers are targeting critical infrastructure. Here’s what they’re doing, how the US government is responding and how you can help.  ANCHORAGE, Alaska (AP) — A headless robot about the size of a labrador retriever will be camouflaged as a coyote or fox to ward off migratory birds and other wildlife at Alaska's second largest airport, a state agency said. The Alaska Department of Transportation and Public Facilities has named the new robot Aurora and said it will be based at the Fairbanks airport to “enhance and augment safety and operations,\" the Anchorage Daily News reported. The transportation department released a video of Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented.  Rebel Wilson is calling Sacha Baron Cohen’s decision to release behind-the-scenes footage of their sex scene “an a–hole move,” after never-before-seen video from the set of the 2016 film “The Brothers Grimsby” was published Friday by the Daily Mail. “Releasing unauthorized and misleading behind-the-scenes video without my approval is SBC’s latest way of bullying and gaslighting me,” the ... The visibly upset MSNBC anchor was responding to the Trump's attack on Judge Juan Merchan's daughter despite gag orders The post Nicole Wallace Gets Fed Up, Tosses Script While Covering Latest Trump Attack: ‘What Are We Going to Do Different?’ | Video appeared first on TheWrap. Saturday Night Live went with Donald Trump’s hawking of Bibles for its cold open, with James Austin Johnson returning as the former president to make the pitch. It was another case of the show trying to satirize something that hardly needs rewriting. “That’s right, it’s Easter. The time of year when I compare myself to …  Nordegren has moved on and built a life that focuses on her six kids Seven reportedly cost $20 million Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump…  The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. Russian Armed Forces downed their own Sukhoi Su-27 fighter jet over Crimea, according to Ukrainian officials. The monarch was joined by wife Queen Camilla and other royal family members for a church service at St. George's Chapel at Windsor Castle  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup. Buying a car can feel like walking through a minefield of shady sales tactics. Some deceitful dealerships have long employed a bag of tricks to nickel-and-dime consumers out of their hard-earned cash.... "
}