{
    "title": null,
    "date": "3/22/2024",
    "url": "https://www.tomshardware.com/reviews/gpu-hierarchy,4388-2.html",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. We've run hundreds of GPU benchmarks on Nvidia, AMD, and Intel graphics cards and ranked them in our comprehensive hierarchy, with over 80 GPUs tested.  The results below are from our previous version of the GPU benchmarks hierarchy, using a different test suite and test PC (Core i9-9900K) and combining results from nine games with six resolution and setting combinations. All of the scores are combined (via a geometric mean calculation) into a single overall result, which tends to penalize the fastest and slowest GPUs — CPU bottlenecks come into play at 1080p medium, while VRAM limitations can kill performance at 4K ultra.\n\nThese results have not been updated since early 2022, when we added the RTX 3050 and RX 6500 XT to the list. We won't be adding future GPUs to this table, so there's no RTX 40-series, RX 7000-series, Arc, 3090 Ti, 6950 XT, 6750 XT, or 6650 XT, but it does help to provide a look at a slightly less demanding suite of games, where 6GB or more VRAM isn't generally required at 1080p ultra settings. You can use these older results to help inform your purchase decisions, if you don't typically run the latest games at maxed out settings. Below is our legacy desktop GPU hierarchy dating back to the late 1990s. We have not tested most of these cards in many years, driver support has ended on most of these models, and the relative rankings are pretty coarse. Note that we also don't factor in memory bandwidth or features like AMD's Infinity Cache or Nvidia's larger L2 cache on Ada Lovelace. The list below is mostly intended to show relative performance between architectures from a similar time period.\n\nWe sorted the table by the theoretical GFLOPS, though on architectures that don't support unified shaders, we only have data for \"Gops/s\" (giga operations per second). That's GeForce 7 and Radeon X1000 and earlier — basically anything from before 2007. We've put an asterisk (*) next to the GPU names for those cards, and they comprise the latter part of the table. Comparing pre-2007 GPUs against each other should be relatively meaningful, but trying to compare those older GPUs against newer GPUs gets a bit convoluted.\n\nThese results are, at best, merely theoretical and we don't have recent benchmarks for most of the GPUs. As one recent example, AMD's new RX 7900 XTX/XT sit in spots two and three even though the RTX 4080 generally beats the 7900 XT. Take the following with a healthy dose of skepticism and a liberal sprinkling of salt, in other words, but it does contain a list of just about every major desktop GPU from the past 25 years. * - Denotes performance measured in \"GOps\" — gigaoperations per second — as opposed to GFLOPS. Older GPU architectures without unified shader support aren't directly comparable with newer architectures. With all the GPU shortages these days, you're unlikely to see huge sales on a graphics card, but you may find some savings by checking out the latest Newegg promo codes, Best Buy promo codes and Micro Center coupon codes. For even more information, check out our Graphics Card Buyer's Guide. MORE: Best Graphics Cards for Gaming MORE: Graphics Card Power Consumption Tested MORE: How to Stress-Test Graphics Cards (Like We Do) MORE: CPU Benchmarks Want to comment on this story? Let us know what you think in the Tom's Hardware Forums. Current page:\n\n2020-2021 and Legacy GPU Benchmarks Hierarchy Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Jarred Walton is a senior editor at Tom's Hardware focusing on everything GPU. He has been working as a tech journalist since 2004, writing for AnandTech, Maximum PC, and PC Gamer. From the first S3 Virge '3D decelerators' to today's GPUs, Jarred keeps up with all the latest graphics trends and is the one to ask about game performance. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 HP ends ties with Russia, shutting down its Russian website — website redirects to Kazakhstan with no support Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}