{
    "title": "Twelve years after the death of Steve Jobs, the cracks are starting to \nappear at Apple",
    "date": "3/25/2024",
    "url": "https://www.notebookcheck.net/Twelve-years-after-the-death-of-Steve-Jobs-the-cracks-are-starting-to-appear-at-Apple.816597.0.html",
    "text": "It has been 12 years since legendary Apple co-founder Steve Jobs passed away after battling pancreatic cancer for several years. As someone so central to the success of Apple, many had wondered whether the company could be as successful moving forward without him. In the period immediately leading up to Job’s untimely passing at the age of 56, then Apple Chief Operating Officer, Tim Cook, took over as acting CEO during Jobs’ period of medical leave. Having proven himself a “safe pair of hands,” Steve Jobs recommended to the Board on his departure that Tim Cook, although he lamented in doing so in Isaacson's biography that “Tim’s not a product person.” In the period since Job’s passing, Tim Cook has had a phenomenally successful run as the CEO of Apple. In the fiscal year ending September 24, 2011 (not long before Jobs’ passing), Apple’s gross revenue was $108 billion. Apple reached a peak fiscal year revenue of $365.8 billion in 2021, after a decade under Tim Cook’s leadership. In late July 2023, Apple reached a peak market capitalization value of $3.1 trillion dollars and was the first company to crest the $3 trillion milestone in January of 2022. It has become increasingly clear in recent weeks and months that for the first time since Jobs’ passing, that the cracks are starting to appear at Apple.  The bulk of Apple’s success today has been built on Jobs’ era products and technologies When Jobs passed away, he had already set Apple up for success. It was already one of the most valuable companies in the world, and in August of 2011 (a couple of months before Jobs passed away), it briefly edged out ExxonMobil as the world’s most valuable company reaching a market cap of $341 billion. The three key product lines at the time of his death were the iPhone, the Mac and the iPad and these continue to provide the bulk of Apple’s product revenue today. Of its $119B in gross revenue for the most recent fiscal quarter ending 30 December 2023 (pdf), $69.7B came from the iPhone, while the Mac and iPad combined for $14.7B. The combined Wearables, Home and Accessories category which includes the Watch, AirPods and Beats accounts for just $11.9B in comparison. Jobs also set up the custom Apple silicon team and the first Mac prototypes running Apple silicon were reported at the time to be in development in 2011. Jobs also established Apple’s phenomenally successful Apple Stores and retail chain, massively successful App Store, iTunes and Apple TV (the latter already indicating ambitions in film and TV distribution). Cook has built on this successful foundation expertly (if not unlawfully as purported by the recent lawsuit lodged by the US Department of Justice), by incrementally updating Apple’s core product range while increasing the average selling price of its products to reap even greater profit margins from them. The Apple Watch, introduced under Cook’s tenure in April of 2015, has been very successful and is estimated to add around $14-$18 billion a year in revenue. Cook has also seen through Jobs’ original vision of bringing Macs to market powered by Apple silicon. To this, Cook added Beats, which also resulted in the Apple Music and streaming service, and added the highly successful AirPods to complement the Beats acquisition. Cook also oversaw the build out of the Jobs era services empire with the addition of new features like Apple Arcade, Apple News+, and AppleTV+. These were also made available as an Apple One subscription bundle that includes additional iCloud storage. Naturally, the question of what comes next in terms of breakthrough products for Apple akin to the success Apple has seen with the iPhone has been playing on the minds of investors of late. Cook has been talking up AR and VR technologies in the past few years and the launch of the Vision Pro has been an attempt to chart a path towards a future where headsets or glasses might be replacements for Apple’s iPhone, iPad and Mac. The response thus far has, however, been mixed, although the more upbeat takes have suggested this is Cook’s iPhone moment.  Comparisons between the Vision Pro and the iPhone are way off While there are some that share Apple’s belief that AR and VR technologies will become increasingly a part of everyday life, eventually becoming mainstream, there are no guarantees that it will. It has been met with mixed reviews with most praising its technological capabilities, its method of hand-eye UI interaction, but with many criticizing its weight, its poor battery life, and lack of real utility. One thing is clear – the Vision Pro is not akin to the iPhone and any such comparisons are way off. Supporters of the Vision Pro argue that it is a first generation product and that it will evolve into a product that will have much greater appeal. They argue that the iPhone had numerous flaws at launch as well and that it took time to mature into a more well rounded product. While this may be to some extent true, when Steve Jobs launched the iPhone in 2007, it immediately became the must-have smartphone and was very quickly adopted by a wide audience. The Vision Pro has a much narrower audience. Even then, it is not clear that it makes entertainment or getting things done any easier or better than just using an iPhone, an iPad or a Mac – despite costing as much as all three devices combined. At a more fundamental level, however, the iPhone, both in terms of its form and function, has defined how smartphones look and feel, as well as the way we interact with them for the entirety of the 17 years since it launched. According to reports, Apple insiders have revealed that the Vision Pro won’t reach its ideal form for at least four generations, which is at least another decade away. Even if its pinch and glance UI will define how headset operating systems will work moving forward, the market segment has yet to be proven. Meta has lost billions of dollars in trying to make it work and Microsoft - even after witnessing the launch of the Vision Pro - has deprecated Windows Mixed Reality from its Windows operating system. Speaking of Microsoft, and even following Apple’s biggest new product launch in years, Microsoft is now worth over $500 billion more than Apple in terms of market cap. Clearly the market hasn’t been especially impressed by the Vision Pro, but instead sees Microsoft’s headlong tilt at AI as being far more promising – dropping its Windows Mixed Reality efforts right when Apple is getting into that market, contrastingly, hasn’t affected Microsoft’s market prospects. Conversely, it would appear that the market is resoundingly endorsing Microsoft's strategic direction while simultaneously putting a figurative $500B question mark over Apple’s.  Steve Jobs and his fondness of a quote from Wayne Gretsky Jobs was once asked about what helped to set Apple apart from other companies. In response, he spoke of his fondness of a quote from ice hockey legend Wayne Gretzky who once said what set him apart as an ice hockey player is that “I skate to where the puck is going to be, not where it has been.” Yet this is exactly where Apple finds itself right now, especially in relation to generative AI. While it is true Apple has long integrated AI technologies into the iPhone and its other devices in the form of features like computational photography and Siri, it has also trailed in these areas as well. Google, conversely, AI from the start, making it a centerpiece of its Pixel smartphone strategy from the moment the original Pixel device shipped over 8 years ago with Google Assistant its heart coupled with computational photography chops. It has been focused on bringing useful and advanced (non-generative) AI-based features to users on a much broader scale than Apple, such as Call Screening, Google Lens, Top Shot, Smart Compose, among many others. Those that have been defending Apple on its AI presence to date have been arguing that Apple may not always be first with a new technology, but when it does arrive, it is with the best implementation. It is reasonable to expect that iOS 18 will see Apple bring its own implementation of generative AI tools like those we have seen introduced from Google including equivalents of Magic Editor, Summarizer in Recorder, and Night Sight Video processing, for example. These are all well within Apple’s ability to deliver as they are extensions of existing technologies, but it remains to be seen if these implementations will be better than the competition. Less easy for Apple to deliver is a generative AI-based large language model LLM or a large multimodal model (LMM). These technologies are more than mere “chatbots” but capable of developing detailed responses in a wide range of written responses both formal and creative. We’ve already seen Microsoft integrate OpenAI’s ChatGPT 4 models throughout its Office suite of programs, its Edge browser, and Windows operating system where it has been dubbed \"Copilot.\" Generative AI has real utility. But these are not models that can be created overnight. Apple has been rumored to be testing at least one model in house dubbed Ajax, and one or two others that have more recently surfaced for open source development. It has become clear, however, that not only will Apple be late to integrating a generative AI-based LLM at an OS level, it will be relying on one or more third-parties to do so. Bloomberg recently revealed – to the surprise of many – that it is in talks with Google to potentially integrate its Gemini LLM into the iPhone and has held similar talks with OpenAI regarding the integration of its GPT as a potential alternative. In this case, it appears, Apple’s implementation of an LLM will be someone else’s. Although privacy may be a factor in developing an in-house LLM, Apple has the financial wherewithal to pay licensing fees for content to train its own model. This really only leaves one possible explanation for Apple’s decision to opt for a third-party LLM for its iPhone - it didn’t get started on it early enough. If we do indeed see one or more third-party LLMs loaded on the next iPhone when it launches later this year it underscores Apple’s big miss on AI and underlines just why it has slumped in its market value where it now finds itself $500B behind Microsoft in market cap. While Microsoft was busy skating to where the puck was going to be, Apple finds itself skating to where it’s been.  Without its visionary co-founder, the cracks are beginning to show iPhone sales are starting to slow down, with the Chinese smartphone market looking more bearish than bullish for Apple. Tim Cook has been on a charm offensive in China this past week, doing what he can to reinforce and strengthen relationships, but the competition from high-quality home grown Android smartphone makers is strong. Xiaomi, Oppo, Vivo, and OnePlus, among others have all released excellent flagship phones over the past few years. The Chinese are also very conscious of the US trade restrictions that have been applied to Huawei and other segments of the consumer electronics market, which is also undoubtedly a factor at play in Apple’s flagging Chinese iPhone sales. On the subject of Chinese iPhone sales, Tim Cook has just cost Apple shareholders $490 million dollars after the company agreed to settle a class-action lawsuit that had accused the Apple CEO of deliberately misleading shareholders about the strength of the Chinese iPhone market. In a conference call with investors in early November of 2018, Cook advised the market that iPhone sales in China were off to a good start. It was only a couple of months later that Apple cut its revenue guidance for the quarter by $9 billion with a slump in Chinese iPhone sales the largest contributing factor. While Apple continues to deny wrongdoing, it said it wanted to end the matter after several years of legal wrangling as it was becoming “overly burdensome, expensive, and distracting.” The news of the settlement follows an internal memo to staff that Apple was canceling its decade long Apple Car, officially known internally as Project Titan (unofficially known internally as Project Titanic). The aim of the project was to create a fully autonomous electric vehicle, although it vacillated between this and less ambitious goals. In addition to arguments over what direction the project should take, changes of leadership and project teams, it finally came to naught as the technical hurdles proved to be insurmountable. Additionally, the company realized that to make the car, it would cost in the order of $100K and have very slim margins. Why it took over $10 billion and a decade to determine that the automotive sector is a low margin business – the antithesis of Apple’s consumer electronics business model – is anyone’s guess. While $10B may not be a lot of money in terms of Apple’s cash flow, it is still $10B and shareholders will not be happy to see this much time and effort not result in a shipping product. Apple, it is now said, is “all in on AI” with staff from the project reassigned to work accelerating Apple’s AI efforts. In the past couple of weeks we have also learnt that Apple is shuttering its microLED project, which was to result in new display technology for its Watches while also reducing its reliance on companies like Samsung and LG. This was also said to be a costly exercise and even though it was well known in the industry that the cost of producing panels with microLED is prohibitively high, this was ultimately the reason Apple is said to have terminated the project, according to Bloomberg. This has resulted in job losses internally and a requirement to seek alternative suppliers of microLED panels, which may yet find their way into future iterations of its Watch. The failure of the microLED project echoes the failure of Apple’s sapphire glass project which resulted in the messy collapse of its former partner GT Advanced Technologies. Just in the past few days, it has also been revealed that a major new security flaw has been uncovered in Apple’s M1 and M2 chip families. Security researchers have revealed that Apple’s vaunted Mac silicon is vulnerable to a side-channel attack that reveals the security keys in common cryptographic operations. This can allow attackers to decrypt data on any MacBook running Apple’s M1 or M1-based chips leaving user data exposed. What is concerning is that the method of attack is the same that was deployed against x86 and other chips in the Meltdown and Spectre attacks. While Intel and AMD have addressed these vulnerabilities at a silicon level, it appears Apple may not have taken notes. Capping off what has been a very poor period for Apple, the company has now found itself accused of being engaged in monopolistic and anticompetitive practices by the U.S. Department of Justice. Of course, Apple strenuously denies these charges and it may have a good case given how hard it will be to prove some aspects of the DOJ’s case – how does one prove a company has a monopoly position with 65% market share, for example? At the same time, it is also clear that Apple’s management has worked overtime to protect its iron fist like control over its iPhone business, including the App Store. While security and privacy may be core values at Apple, it is arguable they have also been used as a smokescreen to ensure competition is kept off the platform. Apple has also been forced to deal with regulatory action and complaints from regulators in other markets as well, most notably the European Union.  It's past time for a \"product person\" to take the helm once again When Steve Jobs passed away, many wondered how well Apple would cope without its visionary leader. In the intervening years since, it has largely appeared that it was coping very well. However, as outlined here, most of that success has been built on the groundwork and the legacy products that Jobs left behind and which has been expertly iterated upon by Cook in the years since. To this, Cook added the Apple Watch in 2015, which was in many ways a “no brainer”, and has gone on to be an essential way of accessorizing an iPhone. However, with iPhone sales tapering investors have been getting anxious to see that Apple still had the Midas touch and could launch a product that could revolutionize a market segment in the same way the iPhone did – and which might one day replace it. After talking up AR and VR technologies in recent years, even when it seemed average consumers weren’t especially enamored with it, Cook launched the Vision Pro. Its launch served two purposes. The first was to demonstrate that innovation remains alive and well at Apple, and the second was to act as a convenient distraction from Apple’s other woes, its AI miss chief among them. A key problem with the Vision Pro is that for all its technological innovations, it is a long way from being a form factor that average consumers will want to wear or reach a price point that will encourage widespread adoption. If the Vision Pro is indeed Apple’s vision of where technology is headed, it hasn’t been an especially compelling vision, particularly without any real killer apps for it at launch. After an early splash in the media when it recently went on sale, thanks to influencers being seeded with units, the buzz has quickly evaporated. As it turns out, we now know the answer to the question “How will Apple cope without Steve Jobs?” – it coped perfectly well for the first 12 years by leaning heavily on the products Jobs left behind, before the cracks started to show. However, it is becoming increasingly clear that while Cook may have been the right person to lead Apple following Jobs' death, he may not be the right person to lead it forward. Apple is at a cross-roads, and it finds itself in need of someone with a clear vision and broad understanding of consumer technology to take the helm - someone who, like Steve Jobs, was completely comfortable embracing and using its products live on stage. Someone who is, indeed, a “product person.” Own "
}