{
    "title": "AMD A8-7200P vs Intel Core i7-7700T vs Intel Core i5-7287U",
    "date": "3/27/2024",
    "url": "https://www.notebookcheck.net/A8-7200P-vs-i7-7700T-vs-i5-7287U_5991_12579_8452.247596.0.html",
    "text": "The quad-core AMD A8-7200P is a mid-range processor based on the Kaveri architecture. It was revealed in June 2014 for notebooks and is manufactured by GlobalFoundries using a 28 nm SHP process. In addition to having two CPU modules for a total of four integer cores clocked at 2.4 - 3.3 GHz, the AMD chip also integrates a Radeon R5 GPU clocked at up to 626 MHz with 256 GCN shaders and a dual-channel DDR3-1866 memory controller.\nArchitecture \nKaveri is the successor to the 2013 Richland architecture (e.g. A10-5750M). The revised CPU cores, codenamed Steamroller, represent the third generation of the module-based Bulldozer design. A number of major changes include modified decoders (now one per integer core), optimized branch prediction, and increased L1 I-cache from 64 KB to 96 KB per module. These revisions boost the performance per clock slightly over a similarly clocked Richland APU. For more details about the AMD Kaveri architecture, see our detailed analysis here:\nAnalysis of the AMD Kaveri Notebook Platform\nPerformance \nAccording to the clock rates, the A8-7200P should offer a CPU performance level similar to the Sandy Bridge-based Intel Core i3-2310M or 2330M. Overall, the A8-7200P will be sufficient for multitasking daily workloads (Office, Internet browsing, multimedia) as well as more demanding programs.\nGraphics\nThe Radeon R5 (Kaveri) GPU of the A8-7200P features a core clock of up to 626 MHz and 256 shader units. Since the GPU is based on AMD's GCN 1.1 architecture, both DirectX 11.2 \"Tier 2\" and Mantle are supported. Furthermore, the GPU can be used for general purpose computing in various applications, such as Adobe Photoshop via the OpenCL API. \nIn terms of 3D performance, the GPU benefits from its DDR3-1866 memory support. Thus, the Radeon R5 is roughly as fast as a dedicated GeForce GT 720M and can handle many current games at low or medium settings at (W)XGA resolution.\nPower Consumption \nThe power consumption of the entire APU is rated at 35 Watts, which is similar to other competing mid-range models. As a result, the A8-7200P is best suited for 14-inch notebooks or larger. The quad-core AMD A8-7200P is a mid-range processor based on the Kaveri architecture. It was revealed in June 2014 for notebooks and is manufactured by GlobalFoundries using a 28 nm SHP process. In addition to having two CPU modules for a total of four integer cores clocked at 2.4 - 3.3 GHz, the AMD chip also integrates a Radeon R5 GPU clocked at up to 626 MHz with 256 GCN shaders and a dual-channel DDR3-1866 memory controller. Architecture Kaveri is the successor to the 2013 Richland architecture (e.g. A10-5750M). The revised CPU cores, codenamed Steamroller, represent the third generation of the module-based Bulldozer design. A number of major changes include modified decoders (now one per integer core), optimized branch prediction, and increased L1 I-cache from 64 KB to 96 KB per module. These revisions boost the performance per clock slightly over a similarly clocked Richland APU. For more details about the AMD Kaveri architecture, see our detailed analysis here: Analysis of the AMD Kaveri Notebook Platform Performance According to the clock rates, the A8-7200P should offer a CPU performance level similar to the Sandy Bridge-based Intel Core i3-2310M or 2330M. Overall, the A8-7200P will be sufficient for multitasking daily workloads (Office, Internet browsing, multimedia) as well as more demanding programs. Graphics The Radeon R5 (Kaveri) GPU of the A8-7200P features a core clock of up to 626 MHz and 256 shader units. Since the GPU is based on AMD's GCN 1.1 architecture, both DirectX 11.2 \"Tier 2\" and Mantle are supported. Furthermore, the GPU can be used for general purpose computing in various applications, such as Adobe Photoshop via the OpenCL API. In terms of 3D performance, the GPU benefits from its DDR3-1866 memory support. Thus, the Radeon R5 is roughly as fast as a dedicated GeForce GT 720M and can handle many current games at low or medium settings at (W)XGA resolution. Power Consumption The power consumption of the entire APU is rated at 35 Watts, which is similar to other competing mid-range models. As a result, the A8-7200P is best suited for 14-inch notebooks or larger. The Intel Core i7-7700T is a fast quad-core processor for desktops based on the Kaby Lake architecture and was announced in January 2017. It is the top model of the 35 Watt models and significantly slower than the similar named Core i7-7700K. The four Skylake based CPU cores are clocked from 2.9 - 3.8 GHz and support HyperThreading / SMT (8 threads).\nArchitecture\nIntel basically uses the same micro architecture compared to Skylake, so the per-MHz performance does not differ. The manufacturer only reworked the Speed Shift technology for faster dynamic adjustments of voltages and clocks, and the improved 14nm process allows much higher frequencies combined with better efficiency than before.\nPerformance\nThe performance of the i7-7700T is slightly faster than the Core i5-7600K with sufficient cooling and TDP settings. Therefore, the CPU is fine to handle even demanding tasks and apps.\nGraphics\nThe integrated Intel HD Graphics 630 has 24 Execution Units (similar to previous HD Graphics 530) running at 350 - 1150 MHz. The performance depends a lot on the memory configuration; it should be comparable to a dedicated Nvidia GeForce 920M in combination with fast DDR4-2133 dual-channel memory.\nContrary to Skylake, Kaby Lake now supports hardware decoding for H.265/HEVC Main 10 with a 10-bit color depth as well as Google's VP9 codec. The dual-core Kaby Lake processors, which were announced in January, should also support HDCP 2.2. The Intel Core i7-7700T is a fast quad-core processor for desktops based on the Kaby Lake architecture and was announced in January 2017. It is the top model of the 35 Watt models and significantly slower than the similar named Core i7-7700K. The four Skylake based CPU cores are clocked from 2.9 - 3.8 GHz and support HyperThreading / SMT (8 threads). Architecture Intel basically uses the same micro architecture compared to Skylake, so the per-MHz performance does not differ. The manufacturer only reworked the Speed Shift technology for faster dynamic adjustments of voltages and clocks, and the improved 14nm process allows much higher frequencies combined with better efficiency than before. Performance The performance of the i7-7700T is slightly faster than the Core i5-7600K with sufficient cooling and TDP settings. Therefore, the CPU is fine to handle even demanding tasks and apps. Graphics The integrated Intel HD Graphics 630 has 24 Execution Units (similar to previous HD Graphics 530) running at 350 - 1150 MHz. The performance depends a lot on the memory configuration; it should be comparable to a dedicated Nvidia GeForce 920M in combination with fast DDR4-2133 dual-channel memory. Contrary to Skylake, Kaby Lake now supports hardware decoding for H.265/HEVC Main 10 with a 10-bit color depth as well as Google's VP9 codec. The dual-core Kaby Lake processors, which were announced in January, should also support HDCP 2.2. The Intel Core i5-7287U is a fast dual-core SoC for notebooks based on the Kaby Lake architecture and was announced in January 2017. The CPU has two processor cores clocked at 3.3-3.7 GHz (two cores also up to 3.7 GHz). The processor can execute up to four threads simultaneously thanks to Hyper Threading. It is also equipped with an Intel Iris Plus Graphics 650 GPU with 64 MB eDRAM, a dual-channel memory controller (DDR4) as well as VP9 and H.265 video decoding as well as encoding. The chip is still manufactured in a 14nm process with FinFET transistors.\nArchitecture\nIntel basically uses the same micro architecture compared to Skylake, so the per-MHz performance does not differ. The manufacturer only reworked the Speed Shift technology for faster dynamic adjustments of voltages and clocks, and the improved 14nm process allows much higher frequencies combined with better efficiency than before.\nPerformance\nThe performance of the 28-Watt CPU should be on par with the Core i7-7560U (2.4-3.8 GHz, also 64 MB eDRAM, 15 Watts), where the Turbo Boost is usually shorter compared to the 7287U due to the lower TDP. This means the i5 is still one of the faster dual-core processors and should be sufficient for most scenarios. Some games might still require a real quad-core processor and therefore nit run perfectly on the dual-core processor, despite Hyper Threading.\nGraphics\nThe integrated Intel Iris Plus 650 Graphics is the GT3e model of the Kaby Lake GPU (Intel Gen. 9.5). It has 48 Execution Units running at 300-1100 MHz and the performance is comparable to a GeForce 920MX thanks to fast eDRAM cache. However, there aren't any significant improvements compared to the old Iris Pro 550, so modern games can often not be played smoothly or only at the lowest or medium settings, respectively.\nContrary to Skylake, Kaby lake now also supports H.265/HEVC Main 10 with a 10-bit color depth as well as Google's VP9 codec. The dual-core Kaby Lake processors announced in January should also support HDCP 2.2.\nPower Consumption\nThe chip is manufactured in an improved 14nm process with FinFET transistors, which improves the efficiency even further. Intel specifies the TDP with 28 Watts, which can be reduced to 23 Watts (cTDP Down) depending on the usage scenario. The TDP is pretty high compared to the common 15-Watt TDP for dual-core processors, but allows a better utilization of CPU and GPU Turbo. The Intel Core i5-7287U is a fast dual-core SoC for notebooks based on the Kaby Lake architecture and was announced in January 2017. The CPU has two processor cores clocked at 3.3-3.7 GHz (two cores also up to 3.7 GHz). The processor can execute up to four threads simultaneously thanks to Hyper Threading. It is also equipped with an Intel Iris Plus Graphics 650 GPU with 64 MB eDRAM, a dual-channel memory controller (DDR4) as well as VP9 and H.265 video decoding as well as encoding. The chip is still manufactured in a 14nm process with FinFET transistors. Architecture Intel basically uses the same micro architecture compared to Skylake, so the per-MHz performance does not differ. The manufacturer only reworked the Speed Shift technology for faster dynamic adjustments of voltages and clocks, and the improved 14nm process allows much higher frequencies combined with better efficiency than before. Performance The performance of the 28-Watt CPU should be on par with the Core i7-7560U (2.4-3.8 GHz, also 64 MB eDRAM, 15 Watts), where the Turbo Boost is usually shorter compared to the 7287U due to the lower TDP. This means the i5 is still one of the faster dual-core processors and should be sufficient for most scenarios. Some games might still require a real quad-core processor and therefore nit run perfectly on the dual-core processor, despite Hyper Threading. Graphics The integrated Intel Iris Plus 650 Graphics is the GT3e model of the Kaby Lake GPU (Intel Gen. 9.5). It has 48 Execution Units running at 300-1100 MHz and the performance is comparable to a GeForce 920MX thanks to fast eDRAM cache. However, there aren't any significant improvements compared to the old Iris Pro 550, so modern games can often not be played smoothly or only at the lowest or medium settings, respectively. Contrary to Skylake, Kaby lake now also supports H.265/HEVC Main 10 with a 10-bit color depth as well as Google's VP9 codec. The dual-core Kaby Lake processors announced in January should also support HDCP 2.2. Power Consumption The chip is manufactured in an improved 14nm process with FinFET transistors, which improves the efficiency even further. Intel specifies the TDP with 28 Watts, which can be reduced to 23 Watts (cTDP Down) depending on the usage scenario. The TDP is pretty high compared to the common 15-Watt TDP for dual-core processors, but allows a better utilization of CPU and GPU Turbo. #0 checking url part for id 5991 +0s ... 0s #1 checking url part for id 12579 +0s ... 0s #2 checking url part for id 8452 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.047s ... 0.048s #6 did output specs +0s ... 0.048s #7 getting avg benchmarks for device 5991 +0.002s ... 0.051s #8 got single benchmarks 5991 +0s ... 0.051s #9 getting avg benchmarks for device 12579 +0.002s ... 0.053s #10 got single benchmarks 12579 +0.006s ... 0.059s #11 getting avg benchmarks for device 8452 +0.003s ... 0.062s #12 got single benchmarks 8452 +0.006s ... 0.068s #13 got avg benchmarks for devices +0s ... 0.068s #14 min, max, avg, median took s +0.065s ... 0.133s #15 return log +0s ... 0.133s "
}