{
    "title": "AMD to buy cloud startup Pensando for $1.9 billion in data center push",
    "date": "3/29/2024",
    "url": "https://ca.movies.yahoo.com/movies/amd-buy-cloud-startup-pensando-121640878.html",
    "text": "(Reuters) - Chip designer Advanced Micro Devices said on Monday it would acquire cloud startup Pensando for $1.9 billion to bolster its data center products and capitalize on booming demand from cloud and enterprise sectors. AMD said the deal value does not include working capital and other adjustments. Pensando, which was founded in 2017 by a group of four ex-Cisco Systems Inc engineers, counts Goldman Sachs and Microsoft Corp's cloud unit Azure as its customers. The startup makes a fully programmable processor and a software platform, which helps enterprise clients and data center customers to function more like cloud computing data centers like Amazon's Amazon Web Services. In cloud computing, customers can order as much computing power as needed in different parts of the world with a few mouse clicks. The software takes care of the mechanics of shuffling the data to the right physical machines. The lucrative data center chip business is rife with competition, with AMD rivals Intel Corp and Nvidia Corp Only last month, Nvidia had released a new chip to speed up artificial intelligence functions in data centers. The deal, which would enable AMD to add Pensando's platform to its line of processors and graphics chips, is expected to close in the second quarter of this year. Pensando's Chief Executive Officer Prem Jain and the entire team will join AMD's Data Center Solutions Group. (Reporting by Chavi Mehta in Bengaluru and Jane Lanhee Lee; Editing by Amy Caren Daniel) Charles was applauded by crowds as he and the Queen re-emerged from St George’s Chapel at Windsor Castle. North Carolina State is carving its own space with a March Madness run in the shadow of Duke and North Carolina. It's one win away from Final Four. The former Philadelphia Eagles player, 36, and his wife attended a baseball game on Saturday The Rugby Football Union has apologised “to both teams” for an officiating error which saw Irné Herbst serve just seven minutes in the sin bin during Harlequins’ thrilling win over Bath, with the governing body insisting the match result will stand. Danica Priest was canvassing in Bristol ahead of the 2 May local elections when the dog pounced as she tried to post her party’s literature through a door King Charles and Queen Camilla led the royal pack on Sunday at the Easter Mattins service which took place at St. George's Chapel in Windsor Castle. Plan would see nationality, visa and asylum status of every offender convicted in English and Welsh courts published on annual basis Demonstrators join families of hostages in cities across country and vow to persist until he is ousted as PM The struggle is real. But should your kid change instruments or quit music altogether? Here’s how to tell. Sam Taylor-Johnson has explained why furore surrounding project is unwarranted The shaking was to weak to light, a handful of witnesses said. The Bridesmaids actress said that she felt ‘disrespected on set’. The stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be starting a base. Jacquelyn Martin is a staff photojournalist with The Associated Press based in Washington.  An earlier installment featured one of our photographers working in Ghana and her work focusing on the lives of women in her country.  Based in Washington for the AP, I cover a lot of high-stakes politics. The Easter Sunday service marks the King’s first public appearance since he was diagnosed with cancer The angry exchange occurred after Phillips endured another nightmare cameo off the bench in Newcastle implosion David Al-Mudallal, who joined from Sports Direct, was appointed to parent company’s board last month DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike hit a tent camp inside a hospital in central Gaza on Sunday, killing two Palestinians and wounding another 15.  There was no immediate comment from the Israeli military.  Tens of thousands of people have sought shelter in Gaza's hospitals since the start of the war, viewing them as relatively safe from airstrikes. Mauricio Pochettino castigated his players for lacking heart and hunger after Chelsea were booed off for failing to beat 10-man Burnley. Exclusive: Dr Camilla Kingdon has called on Rishi Sunak to appoint a dedicated children’s health minister so young people are not forgotten when major decisions are made "
}