{
    "title": "ROG Ally Z1 promo: Price drop and freebies for a limited time",
    "date": "3/26/2024",
    "url": "https://www.technobaboy.com/2024/03/27/rog-ally-z1-promo-price-drop-and-freebies-for-a-limited-time/",
    "text": "ASUS Philippines unveiled its latest promo for its premier handheld gaming device. The ASUS ROG Ally Z1 is getting a huge 2K discount, bundled with over P6.5K worth of freebies for a limited time. During the promo, which runs from March 21 until April 30, 2024, the ROG Ally Z1 is priced at P32,995, bundled with an ROG Cetra True Wireless worth P4,510, Steam Credits worth P2,000, and a three-month Xbox Game Pass. It is available in ASUS and ROG Concept Stores. The ROG Ally Z1 is powered by an AMD Ryzen Z1 processor with AMD Radeon Graphics, 16GB of RAM, 512GB of storage, and Windows 11 Home. The handheld has a 7-inch Full HD IPS touchscreen with a 120Hz refresh rate and FreeSync Premium. It has a comfortable and ergonomic design, an asymmetrical stick layout, flat face buttons, a dish-shaped D-pad, and two paddles on the back that can be remapped to any function. It also has a gyro sensor for motion controls in supported games. For thermals, the device t uses a Zero Gravity system with a dual fan design. It also has a special edition Armoury Crate that lets you access your games, settings, keymaps, and Aura Sync lighting from one app. The ROG Ally with Ryzen Z1 is priced at P39,995, while the variant with the Ryzen Z1 Extreme is priced at P43,995. Both variants are now available in the Philippines. Bryan is a geek at heart and a tech enthusiast by choice. He has a strong background in corporate communications, marketing services, and customer relations having worked in the telecommunications and banking sectors for over two decades. In his spare time, he enjoys watching clips on YouTube and binge watching shows on Netflix. Save my name, email, and website in this browser for the next time I comment.  Technobaboy is about technology and how it shapes our lives. Founded in 2011, we deliver the latest news and reviews on smartphones, digital life, and more to our Filipino audience, on our site, in video, and on social media. Copyright © 2011-2024 Technobaboy.com. All Rights Reserved. Type above and press Enter to search. Press Esc to cancel. "
}