{
    "title": "AMD Ryzen 5 4500U vs AMD Ryzen 7 4700U",
    "date": "3/18/2024",
    "url": "https://www.notebookcheck.net/R5-4500U-vs-R7-4700U_11687_11683.247596.0.html",
    "text": "The AMD Ryzen 5 4500U is an upper mid-range, hexa-core processor of the Renoir product family. The APU was unveiled in H1 2020; it is designed for use in thinner, lighter laptops. Its six Zen 2 CPU cores run at 2.3 GHz (base clock speed) to 4.0 GHz (highest Boost frequency possible). Ryzen 5 4500U features the Vega 6 iGPU.\nThe sole advantage of Ryzen 5 4600U over Ryzen 5 4500U is the thread-doubling SMT technology support. The former has SMT while the latter does not.\nArchitecture \nZen 2 is a resounding success, delivering massive improvements over outgoing Zen Plus-based processors. Ryzen 5 4500U is manufactured on the cutting-edge 7 nm TSMC process; it is compatible with dual-channel DDR4-3200 or quad-channel LPDDR4-4266 memory. This processor has 8 MB of Level 3 cache.\nWhile the APU uses Zen 2 cores just like the desktop-grade Ryzen 3000-series processors do, Ryzen 7 3800XT included, it does does not have PCI-Express 4.0 support. It does feature several PCI-Express 3.0 lanes for connecting discrete graphics cards, SSDs and other devices. Four PCI-Express 3.0 lanes allow for read/write rates of up to 3.9 GB/s provided a suitably fast NVMe SSD is used.\nRyzen 5 4500U gets soldered permanently on to the motherboard (FP6 socket interface) and is anything but user-replaceable.\nPerformance \nThe average Ryzen 5 4500U in our database nearly matches the Core i5-11300H, the Core i5-11320H and also the AMD Ryzen 3 5300U as far as multi-thread benchmark scores are concerned - thus delivering an undeniably impressive performance jump over the outgoing Ryzen 5 3500U.\nThanks to its decent cooling solution and a long-term power limit of 38 W, the Xiaomi RedmiBook 16 R5 is among the fastest systems powered by the R5 4500U that we know of. It can be about 20% faster in CPU-bound workloads than the slowest system built around the same chip in our database, as of August 2023.\nGraphics \nJust like its name suggests, the Radeon RX Vega 6 graphics adapter has 6 Compute Units (6 x 64 = 384 unified shaders). In the case of Ryzen 5 4500U, this graphics adapter runs at up to 1,500 MHz. The iGPU definitely supports UHD 2160p monitors at 60 Hz; it will have no trouble HW-decoding HEVC, AVC, VP9, MPEG-2 and other widespread video codecs. AV1 is not supported though; such a video will have to be software-decoded for much lower energy efficiency.\nVega 6 will let you play many titles of 2020 and 2021 as long as you stick to low settings and low resolutions. F1 2021 (720p, Low) runs at 32 fps; Outriders (720p, Low) runs at 27 fps, to give you an example or two. As the iGPU has no VRAM of its own, it is paramount that fast system RAM is used.\nPower consumption \nThis Ryzen chip is very energy efficient, as of mid 2022, thanks to the cutting-edge 7 nm TSMC manufacturing process and the mature Zen 2 architecture.\nThe Ryzen 5 4500U has a default TDP (also known as the long-term Power Limit) of 15 W that can be changed to anything between 10 W and 25 W by laptop makers if required, a right they use more often than not. Clock speeds and performance will change accordingly as a result. By going for the lowest value, it will be possible to use the APU as the heart of a passively cooled tablet, laptop, mini-PC. The AMD Ryzen 5 4500U is an upper mid-range, hexa-core processor of the Renoir product family. The APU was unveiled in H1 2020; it is designed for use in thinner, lighter laptops. Its six Zen 2 CPU cores run at 2.3 GHz (base clock speed) to 4.0 GHz (highest Boost frequency possible). Ryzen 5 4500U features the Vega 6 iGPU. The sole advantage of Ryzen 5 4600U over Ryzen 5 4500U is the thread-doubling SMT technology support. The former has SMT while the latter does not. Architecture Zen 2 is a resounding success, delivering massive improvements over outgoing Zen Plus-based processors. Ryzen 5 4500U is manufactured on the cutting-edge 7 nm TSMC process; it is compatible with dual-channel DDR4-3200 or quad-channel LPDDR4-4266 memory. This processor has 8 MB of Level 3 cache. While the APU uses Zen 2 cores just like the desktop-grade Ryzen 3000-series processors do, Ryzen 7 3800XT included, it does does not have PCI-Express 4.0 support. It does feature several PCI-Express 3.0 lanes for connecting discrete graphics cards, SSDs and other devices. Four PCI-Express 3.0 lanes allow for read/write rates of up to 3.9 GB/s provided a suitably fast NVMe SSD is used. Ryzen 5 4500U gets soldered permanently on to the motherboard (FP6 socket interface) and is anything but user-replaceable. Performance The average Ryzen 5 4500U in our database nearly matches the Core i5-11300H, the Core i5-11320H and also the AMD Ryzen 3 5300U as far as multi-thread benchmark scores are concerned - thus delivering an undeniably impressive performance jump over the outgoing Ryzen 5 3500U. Thanks to its decent cooling solution and a long-term power limit of 38 W, the Xiaomi RedmiBook 16 R5 is among the fastest systems powered by the R5 4500U that we know of. It can be about 20% faster in CPU-bound workloads than the slowest system built around the same chip in our database, as of August 2023. Graphics Just like its name suggests, the Radeon RX Vega 6 graphics adapter has 6 Compute Units (6 x 64 = 384 unified shaders). In the case of Ryzen 5 4500U, this graphics adapter runs at up to 1,500 MHz. The iGPU definitely supports UHD 2160p monitors at 60 Hz; it will have no trouble HW-decoding HEVC, AVC, VP9, MPEG-2 and other widespread video codecs. AV1 is not supported though; such a video will have to be software-decoded for much lower energy efficiency. Vega 6 will let you play many titles of 2020 and 2021 as long as you stick to low settings and low resolutions. F1 2021 (720p, Low) runs at 32 fps; Outriders (720p, Low) runs at 27 fps, to give you an example or two. As the iGPU has no VRAM of its own, it is paramount that fast system RAM is used. Power consumption This Ryzen chip is very energy efficient, as of mid 2022, thanks to the cutting-edge 7 nm TSMC manufacturing process and the mature Zen 2 architecture. The Ryzen 5 4500U has a default TDP (also known as the long-term Power Limit) of 15 W that can be changed to anything between 10 W and 25 W by laptop makers if required, a right they use more often than not. Clock speeds and performance will change accordingly as a result. By going for the lowest value, it will be possible to use the APU as the heart of a passively cooled tablet, laptop, mini-PC. The AMD Ryzen 7 4700U is a processor for thin and light laptops based on the Renoir architecture. The 4700U integrates all eight cores based on the Zen 2 microarchitecture. They are clocked at 2 (guaranteed base clock) to 4.1 GHz (Turbo). There is no support for the thread-doubling SMT tech. The chip is manufactured on the modern 7 nm TSMC process and partly thanks to it AMD advertises a 2x improved performance per Watt for the Renoir chips. Compared to the faster R7 4800U, the 4700U offers slightly lower clock speeds and no support for SMT / Hyperthreading. \nIn addition to the eight CPU cores, the APU also integrates a Radeon RX Vega 7 integrated graphics card with 7 CUs and up to 1600 MHz. The dual channel memory controller supports DDR4-3200 and energy efficient LPDDR4-4266 RAM. Furthermore, 8 MB level 3 cache can be found on the chip. See our hub page on the Renoir Processors for more information. \nPerformance \nThe average 4700U in our database proves to be a rather competent little processor. It trades blows with the much more power-hungry Intel Core i7-10750H, as far as multi-thread benchmark scores are concerned. While it fails to get far enough away from the more affordable Ryzen 5 4600U, this Ryzen 7 is still a good CPU for most tasks. \nYour mileage may vary depending on how competent the cooling solution of your laptop is and how high the CPU power limits are. \nPower consumption \nThe Ryzen 7 4700U is a 15 W chip. However, laptop makers are allowed to change that value to anything between 10 W and 25 W, with clock speeds and long-term performance changing accordingly as a result. By going for the lowest value, it is possible to build a passively cooled system around the APU. \nThe fairly modern 7 nm TSMC process this Ryzen is manufactured on makes for above average, as of mid 2022, energy efficiency. The AMD Ryzen 7 4700U is a processor for thin and light laptops based on the Renoir architecture. The 4700U integrates all eight cores based on the Zen 2 microarchitecture. They are clocked at 2 (guaranteed base clock) to 4.1 GHz (Turbo). There is no support for the thread-doubling SMT tech. The chip is manufactured on the modern 7 nm TSMC process and partly thanks to it AMD advertises a 2x improved performance per Watt for the Renoir chips. Compared to the faster R7 4800U, the 4700U offers slightly lower clock speeds and no support for SMT / Hyperthreading. In addition to the eight CPU cores, the APU also integrates a Radeon RX Vega 7 integrated graphics card with 7 CUs and up to 1600 MHz. The dual channel memory controller supports DDR4-3200 and energy efficient LPDDR4-4266 RAM. Furthermore, 8 MB level 3 cache can be found on the chip. See our hub page on the Renoir Processors for more information. Performance The average 4700U in our database proves to be a rather competent little processor. It trades blows with the much more power-hungry Intel Core i7-10750H, as far as multi-thread benchmark scores are concerned. While it fails to get far enough away from the more affordable Ryzen 5 4600U, this Ryzen 7 is still a good CPU for most tasks. Your mileage may vary depending on how competent the cooling solution of your laptop is and how high the CPU power limits are. Power consumption The Ryzen 7 4700U is a 15 W chip. However, laptop makers are allowed to change that value to anything between 10 W and 25 W, with clock speeds and long-term performance changing accordingly as a result. By going for the lowest value, it is possible to build a passively cooled system around the APU. The fairly modern 7 nm TSMC process this Ryzen is manufactured on makes for above average, as of mid 2022, energy efficiency. In the following list you can select (and also search for) devices that should be added to the comparison. You can select more than one device. #0 checking url part for id 11687 +0s ... 0s #1 checking url part for id 11683 +0s ... 0s #2 not redirecting to Ajax server +0s ... 0s #3 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #4 composed specs +0.037s ... 0.038s #5 did output specs +0s ... 0.038s #6 getting avg benchmarks for device 11687 +0.015s ... 0.053s #7 got single benchmarks 11687 +0.054s ... 0.108s #8 getting avg benchmarks for device 11683 +0.013s ... 0.121s #9 got single benchmarks 11683 +0.047s ... 0.168s #10 got avg benchmarks for devices +0s ... 0.168s #11 min, max, avg, median took s +0.342s ... 0.51s #12 return log +0.024s ... 0.534s "
}