{
    "title": "Better AI Stock: AMD vs. Alphabet",
    "date": "3/10/2024",
    "url": "https://www.fool.com/investing/2024/03/10/better-ai-stock-amd-vs-alphabet/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Despite more than a year of seemingly nonstop coverage on the artificial intelligence (AI) market, Wall Street just can't get enough. The industry remains a high-growth area, with plenty of investment opportunities. Data from Grand View Research shows the AI market hit nearly $200 billion last year and is projected to expand at a compound annual growth rate of 37% until at least 2030. That rate would see the segment achieve a valuation nearing $2 trillion by decade's end. So despite the industry's meteoric rise over the last year, it seems to have barely scratched the surface of its potential. As a result, it's not too late to dedicate a portion of your holdings to AI and benefit from its growth for years. Two exciting options are Advanced Micro Devices (AMD 0.50%) and Alphabet (GOOG 0.21%) (GOOGL 0.04%), with one expanding in the hardware side of the industry and the other investing in its AI software offerings. Let's examine these businesses more closely and determine whether you're better off investing in the budding AI market through AMD's or Alphabet's stock. Shares in AMD have climbed 43% year to date. The company rallied investors by pivoting its business to AI as it seeks to claim a slice of the lucrative market. In 2023, Nvidia stole much of the spotlight, as it snapped up an estimated 90% market share in AI graphics processing units (GPUs) while AMD was left playing catch-up. However, AMD shifted its focus over the last year and could make a big splash in the industry in 2024. Last December, the company unveiled its new MI300X AI GPU. The chip was designed to compete directly with Nvidia's offerings and already caught the attention of some of tech's most prominent players, signing on Microsoft and Meta Platforms as clients. AMD's earnings have yet to reflect its heavy investment in AI. However, its financials are moving in a positive direction. In its fourth quarter of 2023, AMD's revenue rose 10% year over year to $6 billion, beating analysts' expectations by about $60 million. The company's AI-focused data center segment posted revenue growth of 38%. Meanwhile, improvements in the PC market boosted AMD's client segment by 65% year over year. In addition to AI chips, AMD is diversifying its role in the market by expanding in AI PCs as it seeks to dominate its own area of the industry. It's impossible to deny Alphabet's top spot in tech, with brands like Android, YouTube, and Google attracting billions of users worldwide. The popularity of these offerings has seen Alphabet snap up a leading 25% market share in the digital advertising market. However, over the last year, all eyes have been on the tech giant's expanding AI efforts. Toward the end of 2023, the company impressed by debuting Gemini, a large language model that looked likely to make Alphabet competitive against cloud rivals Microsoft and Amazon. Yet the Google company's stock is down 7% in the last month after a disappointing launch for Gemini. Alphabet held a presentation for the new AI model recently, and Gemini gave inaccurate depictions of historical figures and failed to recognize key differences between other prominent figures. The blunders forced Alphabet to take its AI image services offline for now. In spite of recent headwinds, Alphabet hit nearly $70 billion in free cash flow last year. The company has a mountain to climb to get its AI tech on track and keep up with competitors, but Alphabet is financially secure and has the funds to keep investing in its business. Despite having a slower start than their respective rivals in AI, AMD and Alphabet have promising prospects in the industry over the long term. However, for now, Alphabet's recent software fumbles make AMD's chip business feel more secure. Meanwhile, earnings per share (EPS) estimates suggest AMD might have more room to run over the next two years.  Data by YCharts The chart shows AMD's earnings could reach just over $7 per share in the next two fiscal years, while Alphabet's may hit nearly $9 per share. On the surface, Alphabet looks like the clear winner. However, multiplying these figures by the companies' recent forward price-to-earnings ratios (AMD's 58 and Alphabet's 20) yields projected stock prices of $418 for AMD and $176 for Alphabet. Based on their current positions, these projections would see AMD's stock rise 98% and Alphabet's 30% by fiscal 2026. Alongside a more reliable role in AI, AMD's stock is a screaming buy over Alphabet this month. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}