{
    "title": null,
    "date": "3/6/2024",
    "url": "https://coingape.com/u-s-prohibits-amds-ai-chip-sales-to-china/",
    "text": "News Markets Cryptoguru Collection Contact Follow us on: TRENDING TODAY As the global race for A.I. paces each day, firms developing and fostering services related to artificial intelligence appear to be encountering new challenges daily. Amid this constant tussle orbiting A.I. development and pioneering this industry, AMD (Advanced Micro Devices), a tech giant, recently faced hurdles orbiting A.I. chip sales to China. According to a report, U.S. officials barred the sale of AMD’s A.I. chip tailored for China, deeming it too powerful to sell without a license. This showcases the ensnaring of another American semiconductor company with Washington’s heightened scrutiny on exports of advanced technologies. Intriguingly, sources familiar with the matter claimed that AMD was optimistic about scoring approval from the U.S. Commerce Department, eyeing the selling of its A.I. processor to Chinese customers since it performs at a lower level than what the company sells outside China. However, the U.S. regulators stated AMD must secure a license from Commerce’s Bureau of Industry and Security if the firm wants to conduct sales of these chips. This decision garnered significant nationwide attention, aligning with the Biden administration’s previously introduced export controls to curb China’s access to advanced semiconductor technologies. Meanwhile, AMD refused to comment on the matter, showcasing an unclear stance on whether the firm promptly plans to seek a license. The Bureau of Industry and Security also declined to comment on the matter. While in the interim, AMD shares noted a drop following the announcement’s surfacing. Also Read: Binance Suspends Solana Withdrawals Temporarily, Here’s Why Following the above-mentioned AI Chip sale prohibition chronicle, AMD appears to be facing a setback in its rivalry with another leading firm, Nvidia. The aforementioned export control brought upon by Biden’s administration for AMD and Nvidia impacted the tech giants’ functioning throughout the industry. However, Nvidia promptly responded to the hurdle it faced, introducing a reduced-performance modified model, whereas AMD has yet to reveal its plans to comply with U.S. officials’ decision. Also Read: Bitstamp Secures MAS Approval for Digital Payment Token Services Cathie Wood’s Ark Invest Sells Coinbase, Nvidia Again; Buys Tesla Shares BlackRock Bitcoin ETF (IBIT) Surges 9% Pre-market After Record Inflows DAILY NEWSLETTER Your daily dose of Crypto news, Prices & other updates.. Top News Cryptocurrency Prices Popular Coingape Academy Blogs Popular Categories Exclusive Contact Exclusive Contact Close "
}