{
    "title": "AMD Ryzen 7 8845HS vs AMD Ryzen 7 PRO 7840U vs AMD Ryzen 7 8840HS",
    "date": "3/21/2024",
    "url": "https://www.notebookcheck.net/R7-8845HS-vs-R7-PRO-7840U-vs-R7-8840HS_16399_15058_16413.247596.0.html",
    "text": "The Ryzen 7 8845HS is a powerful Hawk Point family chip that we believe to be a Ryzen 7 7840HS in disguise. The R7 8845HS was brought to life in H2 2023; it features 8 cores (16 threads thanks to SMT support) running at up to 5.1 GHz. Not only does this APU has full might of the Zen 4 architecture at its disposal, it also boasts the 2nd generation Ryzen AI technology. Last but not the least, the Radeon 780M serves as the integrated GPU. \nArchitecture & Features \nHawk Point family chips are powered by the Zen 4 architecture, much like Phoenix and Dragon Range family chips are. That's not to say that there is no difference between the three. With Hawk Point, AMD uncorks its 2nd generation Ryzen AI technology meaning the new processors are expected to deliver an up to 40% increase in generative AI performance over 7040 series APUs. Dozens of popular apps such as DaVinci Resolve support this technology, as of late 2023. \nUnlike Zen 3, Zen 4 features AVX512 support and, thanks to a plethora of other improvements including larger caches/registers/buffers across the board, is slated to bring a double-digit IPC improvement over the former. \nElsewhere, the 8845HS has 16 MB of L3 cache and a seriously fast RAM controller (up to LPDDR5x-7500 and up to DDR5-5600, ECC-enabled memory included). PCI-Express speeds are capped at 1.97 GB/s per lane which corresponds to the 4.0 spec. \nThis Ryzen 7 series chip is designed to run 64-bit Windows 11, 64-bit Windows 10 or Linux; please note that it isn't overclockable and neither is it user-replaceable. It gets soldered to the motherboard for good instead (FP7, FP7r2, FP8 socket interfaces). \nPerformance \nSince the 8845HS is a 7840HS in disguise, it's safe to expect it to be just slightly faster than the Core i9-13900H and also the Ryzen 9 7940HS, as far as multi-thread performance is concerned. This is a very fast chip, as of Q3 2023. \nYour mileage may vary depending on how high the CPU power limits are and how competent the cooling solution of your system is. \nGraphics \nThe Radeon 780M (12 CUs / 768 shaders, up to 2,700 MHz) is capable of powering 4 monitors simultaneously with resolutions as high as SUHD 4320p. It will also have little issue hardware-encoding and hardware-decoding the most widely used video codecs (AV1, HEVC, AVC). As far as gaming is concerned, the thing will let you play most games at 1080p as long as you are fine with moderate quality settings. Long story short, this is the best iGPU money can buy, as of H2 2023. \nYour mileage may vary depending on how high the CPU power limits are, how competent the cooling solution of your system is, how fast the RAM of your system is (there is no dedicated VRAM here). \nPower consumption \nThis Ryzen 7 series chip has a long-term power limit (default TDP) of 35 W to 54 W, giving system makers a choice between improving battery life and making the system they're designing insanely fast. Either way, an active cooling solution is a must for a laptop or a mini-PC built around this APU. \nThe R7 8845HS is buit with TSMC's 4 nm process for high, as of late 2023, energy efficiency. The Ryzen 7 8845HS is a powerful Hawk Point family chip that we believe to be a Ryzen 7 7840HS in disguise. The R7 8845HS was brought to life in H2 2023; it features 8 cores (16 threads thanks to SMT support) running at up to 5.1 GHz. Not only does this APU has full might of the Zen 4 architecture at its disposal, it also boasts the 2nd generation Ryzen AI technology. Last but not the least, the Radeon 780M serves as the integrated GPU. Architecture & Features Hawk Point family chips are powered by the Zen 4 architecture, much like Phoenix and Dragon Range family chips are. That's not to say that there is no difference between the three. With Hawk Point, AMD uncorks its 2nd generation Ryzen AI technology meaning the new processors are expected to deliver an up to 40% increase in generative AI performance over 7040 series APUs. Dozens of popular apps such as DaVinci Resolve support this technology, as of late 2023. Unlike Zen 3, Zen 4 features AVX512 support and, thanks to a plethora of other improvements including larger caches/registers/buffers across the board, is slated to bring a double-digit IPC improvement over the former. Elsewhere, the 8845HS has 16 MB of L3 cache and a seriously fast RAM controller (up to LPDDR5x-7500 and up to DDR5-5600, ECC-enabled memory included). PCI-Express speeds are capped at 1.97 GB/s per lane which corresponds to the 4.0 spec. This Ryzen 7 series chip is designed to run 64-bit Windows 11, 64-bit Windows 10 or Linux; please note that it isn't overclockable and neither is it user-replaceable. It gets soldered to the motherboard for good instead (FP7, FP7r2, FP8 socket interfaces). Performance Since the 8845HS is a 7840HS in disguise, it's safe to expect it to be just slightly faster than the Core i9-13900H and also the Ryzen 9 7940HS, as far as multi-thread performance is concerned. This is a very fast chip, as of Q3 2023. Your mileage may vary depending on how high the CPU power limits are and how competent the cooling solution of your system is. Graphics The Radeon 780M (12 CUs / 768 shaders, up to 2,700 MHz) is capable of powering 4 monitors simultaneously with resolutions as high as SUHD 4320p. It will also have little issue hardware-encoding and hardware-decoding the most widely used video codecs (AV1, HEVC, AVC). As far as gaming is concerned, the thing will let you play most games at 1080p as long as you are fine with moderate quality settings. Long story short, this is the best iGPU money can buy, as of H2 2023. Your mileage may vary depending on how high the CPU power limits are, how competent the cooling solution of your system is, how fast the RAM of your system is (there is no dedicated VRAM here). Power consumption This Ryzen 7 series chip has a long-term power limit (default TDP) of 35 W to 54 W, giving system makers a choice between improving battery life and making the system they're designing insanely fast. Either way, an active cooling solution is a must for a laptop or a mini-PC built around this APU. The R7 8845HS is buit with TSMC's 4 nm process for high, as of late 2023, energy efficiency. The AMD Ryzen 7 PRO 7840U is a fast high-end laptop processor of the Phoenix series and fastest model of the U-series. It offers 8 cores (octa core) based on the Zen 4 architecture that supports hyperthreading (16 threads). The cores clock from 3.3 (base) up to 5.1 GHz (single core boost). The processor includes 8 MB L2 cache and 16 MB L3 cache. \nCompared to the consumer Ryzen 7 7840U, the PRO models offer additional security, manageability, and reliability features designed for professional users and workstation environments. \nThe performance of the R7 PRO 7840U is, depending on the workload, only slightly below the Ryzen 7 7840HS (higher base clock speed and TDP). Compared to the previous generation Ryzen 7 PRO 6850U, the 7840U is clearly faster thanks to the Zen 4 architecture and higher clock speeds. \nThe chip integrates a modern and fasts RDNA 3 graphics card (iGPU) called Radeon 780M with 12 CUs and up to 2.7 GHz clock speed. Furthermore, the Phoenix series include a video engine with AV1 de- and encoding, a new Xilinx FPGA based XDNA AI accelerator (Ryzen AI) that should be faster than the AI engine in the Apple M2 SOC and a dual-channel DDR5-5600 / LPDDR5x-7500 memory controller (with ECC support). The connectivity features includes 2 possible USB 4 (40 Gbps) ports and 20 PCIe 4.0 lanes for a GPU and SSDs. \nThe Phoenix series uses a single monolithic design (unlike the chiplet design of the 7045HX series) and is manufactured in the modern 4nm process at TSMC. The TDP can be configured between 15 and 30 Watt. The AMD Ryzen 7 PRO 7840U is a fast high-end laptop processor of the Phoenix series and fastest model of the U-series. It offers 8 cores (octa core) based on the Zen 4 architecture that supports hyperthreading (16 threads). The cores clock from 3.3 (base) up to 5.1 GHz (single core boost). The processor includes 8 MB L2 cache and 16 MB L3 cache. Compared to the consumer Ryzen 7 7840U, the PRO models offer additional security, manageability, and reliability features designed for professional users and workstation environments. The performance of the R7 PRO 7840U is, depending on the workload, only slightly below the Ryzen 7 7840HS (higher base clock speed and TDP). Compared to the previous generation Ryzen 7 PRO 6850U, the 7840U is clearly faster thanks to the Zen 4 architecture and higher clock speeds. The chip integrates a modern and fasts RDNA 3 graphics card (iGPU) called Radeon 780M with 12 CUs and up to 2.7 GHz clock speed. Furthermore, the Phoenix series include a video engine with AV1 de- and encoding, a new Xilinx FPGA based XDNA AI accelerator (Ryzen AI) that should be faster than the AI engine in the Apple M2 SOC and a dual-channel DDR5-5600 / LPDDR5x-7500 memory controller (with ECC support). The connectivity features includes 2 possible USB 4 (40 Gbps) ports and 20 PCIe 4.0 lanes for a GPU and SSDs. The Phoenix series uses a single monolithic design (unlike the chiplet design of the 7045HX series) and is manufactured in the modern 4nm process at TSMC. The TDP can be configured between 15 and 30 Watt. The Ryzen 7 8840HS is a powerful processor (APU) of the Hawk Point family. This isn't an entirely new laptop chip; instead, it's a rebadged Ryzen 7 7840U, the slightly higher wattage of the 8840HS being the only meaningful difference between the two. The 8840HS has eight Zen 4 cores running at 3.3 GHz to 5.1 GHz that are SMT-enabled for a total of 16 processing threads, while the great Radeon 780M is responsible for 3D processing and similar duties. The 8840HS also features the Ryzen AI technology, now in its 2nd generation. \nArchitecture & Features \nHawk Point family chips are powered by the Zen 4 architecture, much like Phoenix and Dragon Range family chips are. That's not to say there is no difference between the three. With Hawk Point, AMD is betting big on generative AI; these processors are set to deliver an up to 40% increase in generative AI performance over 7040 series APUs, making apps like DaVinci Resolve and Adobe Photoshop more useful than ever before. \nUnlike Zen 3, Zen 4 features AVX512 support and, thanks to a plethora of other improvements including larger caches/registers/buffers, is slated to bring a double-digit IPC improvement over the former. \nElsewhere, the 8840HS has 16 MB of L3 cache and support for super-fast DDR5-5600 and LPDDR5x-7500 RAM. The chip is compatible with USB 4 and therefore with Thunderbolt. It comes with 20 PCIe 4 lanes, giving NVMe SSDs up to 7.8 GB/s of throughput. \nSystems built around this Ryzen 7 series APU are designed to run 64-bit Windows 11, 64-bit Windows 10, or Linux. Please note that this processor is not overclockable and neither is it user-replaceable. It gets soldered down for good instead (FP7, FP7r2, FP8 socket interfaces). \nPerformance \nSince this is a 7840U in disguise that we are dealing with here, it is safe to expect the 8840HS to be about as fast as the Core i7-12650H, as far as multi-thread performance is concerned. \nYour mileage may vary depending on how high the CPU power limits are, and how competent the cooling solution of your laptop is. \nGraphics \nThe Radeon 780M has 12 CUs (768 shaders) purring away at up to 2,700 MHz. This is exactly the right iGPU for people looking for a bit more horsepower than what Intel's aging Xe options can provide. The Radeon will let you use up to 4 monitors with resolutions as high as SUHD 4320p and it will also HW-decode and HW-encode the most widely used video codecs (including AV1, HEVC and AVC) without breaking a sweat. In terms of gaming, the thing is good enough for 1080p and medium-to-low settings, as of late 2023. \nYour mileage may vary depending on how high the CPU power limits are, how competent the cooling solution of your system is, how fast the RAM of your system is (there is no dedicated VRAM here). \nPower consumption \nThis Ryzen 7 series chip has a long-term power limit (default TDP) of 28 W that laptop makers are free to tune to their liking, with values between 20 W and 30 W greenlighted by AMD. Either way, an active cooling solution is a must for any system powered by this chip. \nThe 8840HS is built with TSMC's 4 nm process for high, as of late 2023, energy efficiency. The Ryzen 7 8840HS is a powerful processor (APU) of the Hawk Point family. This isn't an entirely new laptop chip; instead, it's a rebadged Ryzen 7 7840U, the slightly higher wattage of the 8840HS being the only meaningful difference between the two. The 8840HS has eight Zen 4 cores running at 3.3 GHz to 5.1 GHz that are SMT-enabled for a total of 16 processing threads, while the great Radeon 780M is responsible for 3D processing and similar duties. The 8840HS also features the Ryzen AI technology, now in its 2nd generation. Architecture & Features Hawk Point family chips are powered by the Zen 4 architecture, much like Phoenix and Dragon Range family chips are. That's not to say there is no difference between the three. With Hawk Point, AMD is betting big on generative AI; these processors are set to deliver an up to 40% increase in generative AI performance over 7040 series APUs, making apps like DaVinci Resolve and Adobe Photoshop more useful than ever before. Unlike Zen 3, Zen 4 features AVX512 support and, thanks to a plethora of other improvements including larger caches/registers/buffers, is slated to bring a double-digit IPC improvement over the former. Elsewhere, the 8840HS has 16 MB of L3 cache and support for super-fast DDR5-5600 and LPDDR5x-7500 RAM. The chip is compatible with USB 4 and therefore with Thunderbolt. It comes with 20 PCIe 4 lanes, giving NVMe SSDs up to 7.8 GB/s of throughput. Systems built around this Ryzen 7 series APU are designed to run 64-bit Windows 11, 64-bit Windows 10, or Linux. Please note that this processor is not overclockable and neither is it user-replaceable. It gets soldered down for good instead (FP7, FP7r2, FP8 socket interfaces). Performance Since this is a 7840U in disguise that we are dealing with here, it is safe to expect the 8840HS to be about as fast as the Core i7-12650H, as far as multi-thread performance is concerned. Your mileage may vary depending on how high the CPU power limits are, and how competent the cooling solution of your laptop is. Graphics The Radeon 780M has 12 CUs (768 shaders) purring away at up to 2,700 MHz. This is exactly the right iGPU for people looking for a bit more horsepower than what Intel's aging Xe options can provide. The Radeon will let you use up to 4 monitors with resolutions as high as SUHD 4320p and it will also HW-decode and HW-encode the most widely used video codecs (including AV1, HEVC and AVC) without breaking a sweat. In terms of gaming, the thing is good enough for 1080p and medium-to-low settings, as of late 2023. Your mileage may vary depending on how high the CPU power limits are, how competent the cooling solution of your system is, how fast the RAM of your system is (there is no dedicated VRAM here). Power consumption This Ryzen 7 series chip has a long-term power limit (default TDP) of 28 W that laptop makers are free to tune to their liking, with values between 20 W and 30 W greenlighted by AMD. Either way, an active cooling solution is a must for any system powered by this chip. The 8840HS is built with TSMC's 4 nm process for high, as of late 2023, energy efficiency. #0 checking url part for id 16399 +0s ... 0s #1 checking url part for id 15058 +0s ... 0s #2 checking url part for id 16413 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.036s ... 0.037s #6 did output specs +0s ... 0.037s #7 getting avg benchmarks for device 16399 +0.015s ... 0.052s #8 got single benchmarks 16399 +0.007s ... 0.059s #9 getting avg benchmarks for device 15058 +0.015s ... 0.074s #10 got single benchmarks 15058 +0.012s ... 0.086s #11 getting avg benchmarks for device 16413 +0.003s ... 0.088s #12 got single benchmarks 16413 +0s ... 0.089s #13 got avg benchmarks for devices +0s ... 0.089s #14 min, max, avg, median took s +0.173s ... 0.262s #15 return log +0s ... 0.262s "
}