{
    "title": null,
    "date": "3/17/2024",
    "url": "https://www.defenseworld.net/2024/03/17/diversified-trust-co-buys-3864-shares-of-advanced-micro-devices-inc-nasdaqamd.html",
    "text": "Posted by Defense World Staff on Mar 17th, 2024 Diversified Trust Co lifted its holdings in shares of  Advanced Micro Devices, Inc. (NASDAQ:AMD – Free Report) by 25.4% during the 4th quarter, Holdings Channel.com reports. The firm owned 19,062 shares of the semiconductor manufacturer’s stock after buying an additional 3,864 shares during the quarter. Diversified Trust Co’s holdings in Advanced Micro Devices were worth $2,810,000 at the end of the most recent quarter. Several other institutional investors and hedge funds also recently made changes to their positions in AMD. Norges Bank bought a new position in shares of  Advanced Micro Devices during the 4th quarter valued at $1,252,070,000.  Moneta Group Investment Advisors LLC grew its holdings in shares of  Advanced Micro Devices by 105,415.5% during the 4th quarter. Moneta Group Investment Advisors LLC now owns 8,526,710 shares of the semiconductor manufacturer’s stock valued at $552,275,000 after purchasing an additional 8,518,629 shares during the last quarter.  Renaissance Technologies LLC bought a new stake in  Advanced Micro Devices in the 1st quarter worth $777,111,000.  Northern Trust Corp grew its holdings in  Advanced Micro Devices by 35.5% in the 1st quarter. Northern Trust Corp now owns 17,086,683 shares of the semiconductor manufacturer’s stock worth $1,868,258,000 after acquiring an additional 4,475,368 shares during the last quarter.  Finally, Winslow Capital Management LLC bought a new stake in  Advanced Micro Devices in the 2nd quarter worth $340,539,000. Institutional investors own  68.43% of the company’s stock. NASDAQ:AMD opened at $191.06 on Friday. The firm has a market cap of $305.70 billion, a P/E ratio of 367.42, a P/E/G ratio of 2.93 and a beta of 1.66. The company has a debt-to-equity ratio of 0.03, a quick ratio of 1.86 and a current ratio of 2.51. Advanced Micro Devices, Inc. has a fifty-two week low of $81.02 and a fifty-two week high of $227.30. The firm has a 50-day simple moving average of $176.17 and a two-hundred day simple moving average of $136.89. Advanced Micro Devices (NASDAQ:AMD – Get Free Report) last released its quarterly earnings data on Tuesday, January 30th. The semiconductor manufacturer reported $0.77 earnings per share for the quarter, meeting analysts’ consensus estimates of $0.77. The business had revenue of $6.17 billion during the quarter, compared to analyst estimates of $6.13 billion. Advanced Micro Devices had a net margin of 3.77% and a return on equity of 5.73%. Advanced Micro Devices’s revenue was up 10.2% compared to the same quarter last year. During the same period last year, the business earned $0.54 EPS.  Analysts predict that  Advanced Micro Devices, Inc. will post 2.67 earnings per share for the current fiscal year. A number of equities research analysts have issued reports on the stock. Wells Fargo & Company raised their price target on shares of Advanced Micro Devices from $165.00 to $190.00 and gave the stock an “overweight” rating in a report on Wednesday, January 31st. Susquehanna raised their price target on shares of Advanced Micro Devices from $170.00 to $210.00 and gave the stock a “positive” rating in a report on Monday, January 29th. Rosenblatt Securities  reissued a “buy” rating and issued a $200.00 price target on shares of Advanced Micro Devices in a report on Tuesday, January 30th. UBS Group raised their target price on shares of Advanced Micro Devices from $135.00 to $220.00 and gave the stock a “buy” rating in a research report on Thursday, January 25th. Finally, Northland Securities raised shares of Advanced Micro Devices from a “market perform” rating to an “outperform” rating and set a $195.00 target price for the company in a research report on Wednesday, January 31st. Four investment analysts have rated the stock with a hold rating and twenty-five have assigned  a buy rating to the company’s stock. According to data from MarketBeat, Advanced Micro Devices currently has a consensus rating of “Moderate Buy” and a consensus price target of $181.82. Read Our Latest Report on Advanced Micro Devices In other news, CEO Lisa T. Su sold 125,000 shares of Advanced Micro Devices stock in a transaction that occurred on Wednesday, March 13th. The shares were sold at an average price of $195.13, for a total value of $24,391,250.00. Following the completion of the sale, the chief executive officer now directly owns 3,222,230 shares in the company, valued at $628,753,739.90. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this hyperlink. In other news, insider Victor Peng sold 100,000 shares of Advanced Micro Devices stock in a transaction that occurred on Friday, February 2nd. The shares were sold at an average price of $175.11, for a total value of $17,511,000.00. Following the completion of the sale, the insider now directly owns 241,266 shares in the company, valued at $42,248,089.26. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this hyperlink. Also, CEO Lisa T. Su sold 125,000 shares of Advanced Micro Devices stock in a transaction that occurred on Wednesday, March 13th. The stock was sold at an average price of $195.13, for a total transaction of $24,391,250.00. Following the completion of the sale, the chief executive officer now owns 3,222,230 shares of the company’s stock, valued at $628,753,739.90. The disclosure for this sale can be found here. In the last ninety days, insiders sold 308,743 shares of company stock worth $56,894,968. 0.73% of the stock is owned by corporate insiders. (Free Report) Advanced Micro Devices, Inc operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products.  Want to see what other hedge funds are holding AMD? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Advanced Micro Devices, Inc. (NASDAQ:AMD – Free Report).   Receive News & Ratings for Advanced Micro Devices Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Advanced Micro Devices and related companies with MarketBeat.com's FREE daily email newsletter. Avery Dennison Co. (NYSE:AVY) Shares Acquired by Diversified Trust Co Diversified Trust Co Has $2.79 Million Stock Holdings in NextEra Energy, Inc. (NYSE:NEE) "
}