{
    "title": "EPYC Destroys Xeon: AMD Has Taken Almost A Third Of The Server Processor \nMarket From Intel",
    "date": "3/11/2024",
    "url": "https://technewsspace.com/epyc-destroys-xeon-amd-has-taken-almost-a-third-of-the-server-processor-market-from-intel/",
    "text": "The expansion of EPYC processors in the server segment can hardly be called rapid, but it is irreversibly taking away market positions from Intel products, judging by the chronology of the publication of official statistics. If last summer AMD controlled 25% of the market, then by the end of the same year it came up with a share of 31%, as the company’s CFO explains.  Image Source: AMD Jean Hu made this statement at a technology conference Morgan Stanley, which completed its work last week. She noted that Genoa generation EPYC processors demonstrate the highest expansion rates among all generations of processors of this brand, both in value terms and in quantity. In the last half of the year, AMD’s server revenue turned out to be more than 50% higher than the revenue of the first half of the year, mainly due to high sales volumes of new EPYC processors. The company ended last year with more than 31% of the server CPU market, Jin Hu noted. To understand the pace of AMD’s progress in this area, it is enough to remember that in 2019, the head of the company, Lisa Su, was only counting on EPYC processors to overcome the milestone of 10% of the market by the end of 2020. The company managed to cope with this task, but subsequently AMD management no longer made such forecasts, only occasionally reporting on the actual success of EPYC processors. It turns out that by the beginning of this year they managed to occupy almost a third of the server market, and this is a very worthy result, taking into account its specifics. Dylan Harris is fascinated by tests and reviews of computer hardware. Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  TECH NEWS SPACE The Tech News Space team monitors news from the world of high technology, science, the gaming industry and delivers them to its readers in a timely manner. "
}