{
    "title": "AMD takes AI into the car as it launches new automotive chips",
    "date": "1/5/2024",
    "url": "https://techmonitor.ai/technology/silicon/amd-automotive-ai-car",
    "text": "The pair of processors can power safety and navigation systems, as well as in-vehicle entertainment. By\n                    Matthew Gooding Semiconductor manufacturer AMD has launched two new products for its clients in the automotive sector. The devices, the Versal AI Edge XA adaptive SoC and Ryzen Embedded V2000A are designed to help automakers deliver better infotainment, advanced driver safety and autonomous driving services. AMD will showcase the pair of chips for the first time at the CES 2024 trade show, which kicks off in Las Vegas on Tuesday. Versal AI Edge XA adaptive SoCs feature what AMD describes as an advanced AI engine, enabling the devices to be further optimised for next-generation advanced automotive systems and applications such as forward cameras, in-cabin monitoring, LiDAR, 4D radar, surround-view, automated parking and autonomous driving. Built on a 7nm process node, the vendor also promises enhanced security which meets auto industry standards. The chipset’s AI engines are capable of handling different types of AI models such as classification and feature tracking, AMD said. The first devices in the range will be released in the first part of this year, with further releases planned throughout 2024. New advanced vehicles feature an ever-growing amount of chips, and AMD believes it is addressing a fast-expanding market. “In the future, automakers will leverage autonomous vehicle applications to shape their brand identities,” said James Hodgson, research director at ABI Research. “With these applications relying heavily on artificial intelligence, automakers need compute platforms that deliver powerful and efficient AI compute. “The number of highly automated vehicles shipping each year is set to grow at a rate of 41% between 2024 and 2030, signalling a healthy growth opportunity for suppliers of heterogeneous SoCs with powerful and efficient AI compute.” The new chips build on technology AMD acquired as part of its $60bn purchase of rival Xilinx in 2022. Meanwhile, the Ryzen Embedded V2000A Series processors are built for “the next-generation automotive digital cockpit”, AMD said. This could include a vehicle infotainment console and passenger displays. AMD claims the chip is the first x86 auto-qualified processor family to offer “the same PC-like experience consumers have come to expect from home entertainment” for vehicles. It is apparently to deliver high-definition graphics, with enhanced security features and automotive software enablement through hypervisors and support for the Automotive Grade Linux and Android Automotive operating systems. “Our expanding and highly diversified AMD automotive portfolio presents a significant opportunity to serve this high-growth market while also underscoring the tremendous synergy of our combined automotive teams since the acquisition of Xilinx almost two years ago,” said Salil Raje, senior vice president and general manager in AMD’s adaptive and embedded computing group. “As we look ahead to 2024’s Consumer Electronics Show, we are excited to showcase our achievements working in collaboration with our ecosystem partners that will advance the future of the automotive industry.”  "
}