{
    "title": "[CES 2024] AMD Launches Ryzen 8000G Series and new Ryzen 5000 Series \nDesktop CPUs",
    "date": "1/9/2024",
    "url": "https://www.tech-critter.com/amd-ryzen-8000g-and-new-ryzen-5000-ces-2024/",
    "text": "AMD unveiled a plethora of new desktop products at CES 2024, introducing the AMD Ryzen 8000G Series desktop processors, featuring the Ryzen 7 8700G with powerful built-in graphics and introducing Ryzen AI with a dedicated AI neural processing unit (NPU) for enhanced AI capabilities, productivity, efficiency, and collaboration. Additionally, AMD is introducing new Ryzen 5000 processors, building on the socket AM4 longevity. The lineup includes the Ryzen 7 5700X3D, leveraging 3D V-Cache technology for a significant boost in gaming performance. These processors are part of AMD’s commitment to lead the AI hardware revolution, expanding dedicated AI engines in the x86 market. The AMD Ryzen 8000G Series offers up to eight cores and 16 threads, ensuring powerful performance for gaming and content creation. These processors, built on the “Zen 4” architecture, prioritize energy efficiency while maintaining incredible speed. The Ryzen 7 8700G, with Radeon 780M graphics, stands out with the fastest built-in graphics in its class, providing an affordable 1080p gaming experience.  The entire 8000G Series, equipped with AMD EXPO technology and Precision Boost Overdrive (PBO), is set to be available to DIY customers and SI partners starting January 31, 2024, with OEM systems expected in Q2 2024. For gaming enthusiasts seeking top-notch performance, AMD Ryzen 5000 Series desktop processors, based on the “Zen 3” architecture, introduce four new processors, including the Ryzen 7 5700X3D with 3D V-Cache technology for a substantial on-chip memory boost. These processors will be available to DIY customers and SI partners starting January 31, 2024. Moreover, AMD OEM partners, such as ACER, ASUS, Lenovo, HP, and Razer, are launching additional Ryzen 8040 Series-powered laptops at CES. These laptops, featuring integrated Ryzen AI NPU on select models, deliver exceptional AI-backed gaming experiences, catering to gamers, professionals, and consumers. The partnership with AMD extends to various laptop models, ensuring AI-ready capabilities for content creation and everyday productivity. At GDC 2024 and just about half a year later since the first release of the AMD FidelityFX Super Resolution... Dr. Lisa Su, CEO of Advanced Micro Devices (AMD), made waves at SXSW 2024 with a keynote address outlining her... Enter your email address to subscribe to Tech-Critter and receive notifications of new posts by email. Email Address Subscribe Tech-Critter ©Wavelength.Network PLT(LLP0013243-LGN)wavelength.network "
}