{
    "title": "AMD Zen 5 'Granite Ridge' CPUs Allegedly Already in Production",
    "date": "1/17/2024",
    "url": "https://www.extremetech.com/computing/amd-zen-5-granite-ridge-cpus-allegedly-already-in-production",
    "text": "2024 is going to be a massive year for PC hardware. New architectures for both CPUs and GPUs are expected from all the major players, and AMD's second-generation AM5 CPUs are at the top of the list of the most anticipated products. They're expected in September, roughly two years after it launched its Ryzen 7000 series. According to a reputable industry leaker, AMD has already begun production of these CPUs, meaning they could be teased as early as June at Computex. Word of AMD's progress on its Zen 5 architecture comes via the usual source: a leaker on Twitter. However, this source is usually reliable, and the time frame makes sense. If AMD is launching in Q3, it should have some engineering samples ready for testing. AMD isn't expected to change much for Zen 5 on desktop, as it'll be sticking with the tried-and-true 16-core, 32-thread chiplet design for its flagship part. The only significant change, according to HotHardware, is AMD will likely add a Neural Processing Unit (NPU) for AI tasks like it just did with the 8000G APUs. Plus, it's 2024 and all, so every CPU needs one now. There will be IPC improvements, too. The big questions about Zen 5 are which manufacturing process it'll use and the naming when it arrives. For the process, we're expecting it to be TSMC 3nm, but given the nascent nature of TSMC's most cutting-edge node, we would not be surprised to see AMD go with 4nm instead. It's already cranking its 8000 series mobile and desktop parts, but we can see it being used for Zen 5 due to its maturity and lower cost. That would disappoint many, however, as it will provide only modest gains over the 5nm process used for Zen 4. Then there's the naming scheme, for which AMD has already gotten a lot of flak on its mobile parts. AMD has painted itself into a corner here, as all the chips it launched last year got the number 7 at the beginning to indicate \"2023.\" Now that it's 2024, it's already moved onto the 8000 series for both mobile and desktop. However, since it already has a lineup of 8000-series desktop chips with its new APUs, it would be confusing to have a second family of similarly named CPUs in the Ryzen 9 8950X, for example. Given that, there's a chance they'll be named the 9000 series, which would make no sense, but this is the route AMD has chosen. Regardless, hopes are high for the company's second-generation AM5 offering. Most of the kinks have been worked out of its new platform, and DDR5 memory prices are much more reasonable now. However, the same leaker who says Zen 5 is in production also says AMD won't launch a new chipset and will stick with X670 on the high-end. That would also lower adoption costs for upgraders but disappoint enthusiasts who always appreciate the latest features. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}