{
    "title": "I tested AMD’s RX 7600 XT against the RTX 4060 — and I was shocked by the \nresults",
    "date": "1/24/2024",
    "url": "https://www.digitaltrends.com/computing/nvidia-rtx-4060-vs-amd-rx-7600-xt/",
    "text": "Digital Trends may earn a commission when you buy through links on our site. Why trust us? The market for graphics cards around $300 is getting crowded, and the two frontrunners among the best graphics cards are Nvidia’s RTX 4060 and AMD’s RX 7600 XT. Both cards are around the same price, and they offer similar performance, so choosing between them isn’t easy. I’ve tested both cards extensively — read my RTX 4060 review and RX 7600 XT review for the full breakdown — and they’re remarkably close. It’s hard to go wrong with either GPU, but after comparing them extensively, there’s a clear winner. Perhaps the biggest difference between the RTX 4060 and RX 7600 XT is the price. It doesn’t sound like much, but the RTX 4060 comes in at $300 while the RX 7600 XT costs $330. AMD, traditionally, undercuts Nvidia’s pricing while offering competitive performance, sometimes at a slight cost to features. This time around, though, Nvidia actually comes out ahead on value. Thankfully, we don’t need to go beyond list price for these two GPUs. For the RTX 4060, I found multiple models available at $300, with some overclocked versions reaching to $320. The most expensive model I found was $390, but you can get one for far less. I even spotted some sales, with this  going for $295. The RX 7600 XT is much newer. I found multiple models available at $330, with overclocked versions like the  reaching up to $350. It’s hard to say where prices go from here. On one hand, the RTX 4060 has been on the market longer, so it’s more likely to go on sale. On the other, AMD is typically more generous with its price cuts, so the RX 7600 XT could end up cheaper. For now, AMD’s card is slightly more expensive, and it’s hard to imagine it will drop far below list price any time soon. As usual, you shouldn’t compare the core specs of GPUs from different brands. AMD and Nvidia use different nomenclature for cores, and clock speed interacts with architectures differently. The two main specs we can compare are memory and power, and there are some big differences between the RTX 4060 and RX 7600 XT. First, memory. The RTX 4060 comes with 8GB while the RX 7600 XT doubles that to 16GB. It sounds like a clear win for AMD, but there’s a little more nuance to the conversation. Both cards use GDDR6 memory and a 128-bit memory bus. That means, although the RX 7600 XT has more capacity, both cards have around the same memory bandwidth. There are some games (I’ll get to those next) where higher capacity makes a difference, granting you a larger frame buffer. Others don’t see the benefit of the higher memory capacity on the RX 7600 XT. It’s important to point out this dynamic because it’s easy to see 16GB on the RX 7600 XT and assume the price jump is justified, and that isn’t always the case. AMD still has an edge with memory, but Nvidia comes out ahead with power. Both cards offer similar performance, but Nvidia achieves that performance with a thermal design power (TDP) of just 115 watts. The RX 7600 XT requires 190W. It’s a massive jump, and even more massive considering the RTX 4060 will often run below 100W when you’re using it to play games. On to some hard numbers. Both of these GPUs target 1080p, and at that resolution, the RTX 4060 is 2% faster on average. That includes the 11 games I run for GPU reviews, including titles with ray tracing where Nvidia holds a solid lead. Overall, you should consider the performance identical, but there are a lot of little devils in the details here. If you look across the games I tested, you can see how close things are. The RX 7600 XT and RTX 4060 trade blows in Assassin’s Creed Valhalla, Horizon Zero Dawn, Returnal, and Forza Horizon 5, with a delta of only a few frames. But then there are the outliers. In Resident Evil 4, the the RTX 4060 shoots ahead with a 12% lead, but in Red Dead Redemption 2, the RX 7600 XT leads by close to 17%. The most important benchmark, however, is The Last of Us Part One. In this VRAM-heavy title, the RX 7600 XT posts an 18% lead, showing how extra capacity can make a difference in certain games. As you can scale up the resolution, VRAM should become more important. It does, but the difference isn’t as stark as you might expect. Across my suite of tests, the RTX 4060 and RX 7600 XT posted an identical average. The extra VRAM helped the RX 7600 XT close the gap with the RTX 4060, but it only had to make up 2% of ground. The groupings get much tighter at 1440p, with Assassin’s Creed Valhalla, Returnal, and Forza Horizon 5 showing basically identical performance. The RTX 4060 loses some ground in Resident Evil 4, however, but it’s able to make that up in Red Dead Redemption 2. Once again, The Last of Us Part One is the important benchmark for VRAM, with the RX 7600 XT posting a lead of around 26%. When looking at raw game performance, the RX 7600 XT comes out slightly ahead. It posts basically identical results to the RTX 4060, all while providing a big bump in those VRAM-heavy titles like The Last of Us Part One. Nvidia still has some fight left in it with ray tracing, however. Although overall game performance is still important, ray tracing is becoming increasingly common in PC releases. Today, you should expect that a $300 GPU will be able to handle ray tracing at 1080p, and thankfully, both the RX 7600 XT and RTX 4060 pass that mark. Nvidia certainly passes it more cleanly, however. Although the two cards posted similar results in Returnal, Nvidia shows a dominating lead in Cyberpunk 2077 and Resident Evil 4. The differences matter in these two games, too. Nvidia is able to provide above 60 frames per second (fps) in Resident Evil 4 and above 30 fps in Cyberpunk 2077, hitting crucial marks that the RX 7600 XT fails to reach. Nvidia also wins the feature battle. DLSS 3.5 includes upscaling and frame generation, which is supported in an increasing number of games. AMD has FSR 3, but it’s only available in a total of four games at the time of this writing. In order for FSR 3 to be a true DLSS 3.5 competitor, it needs far more support than it has now. On AMD’s end, it offers the AMD Fluid Motion Frames (AFMF) feature through the driver. This adds frame generation to virtually any DirectX 11 or DirectX 12 game. It doesn’t work as well as DLSS 3.5, and it drops out during fast motion to preserve image quality. But it has much broader support, even compared to the growing lineup of DLSS 3 games. Even with AFMF in play, Nvidia has the win here. Not only do you get better ray tracing, but DLSS 3 is available in a enough games that you shouldn’t struggle getting solid performance in most titles. AMD’s go-wide approach sacrifices some quality and performance in the process, and it’s a feature you likely won’t turn on in every game. It’s a tough choice between the RTX 4060 and RX 7600 XT. The extra VRAM provides nice peace of mind on the RX 7600 XT, but you trade some ray tracing performance and DLSS going with AMD. On the other end, the RTX 4060 definitely loses some battles, but it’s cheaper and has a better set of features overall. Considering how close the GPUs are in terms of price and performance, you’ll have to make the final call depending on prices when you’re shopping. As things sit now, I recommend the RTX 4060 for most people. The 8GB of VRAM can sting, but you’ll only feel the effect of it in a small set of games like The Last of Us Part One. For that sacrifice, you’re getting better ray tracing performance in most titles, DLSS, and crucially, a lower price. AMD has said it's done with new GPU dies, but a filing with the European Economic Commission (EEC) suggests that Team Red could still launch graphics cards in its RX 7000 range. The filing points to AMD releasing an RX 7600 XT sometime in the future, both in 12GB and 10GB variants. AMD's Scott Herkelman says the RDNA 3 lineup is \"complete,\" so what gives? It comes down to the GPU dies. With the release of the Radeon RX 7800 XT and RX 7700 XT, AMD finally set foot in the mainstream gaming sector with its RDNA 3 lineup. Nvidia, its biggest rival, which also makes some of the best graphics cards, was the first to release competing cards with similar performance -- at least on paper. But are Nvidia's options better than AMD's in this generation? The RX 7800 XT was, from the get-go, said to be the competitor to Nvidia's RTX 4070, but in reality, these GPUs differ both in price and performance. We've tested the RX 7800 XT and compared it to the RTX 4070, and we now know which of these two GPUs is the one to pick.\nPricing and availability Nvidia has been taking a beating lately with its graphics cards, at least if you believe the reviews. On the financial side, however, Nvidia is still bringing in the cash with its controversial RTX 4060 family. The company released its earnings for the second quarter of fiscal 2024 (or, in real life, the third quarter of 2023). Unsurprisingly, Nvidia brought in a ton of money overall -- a new record at $13.51 billion, which is 101% higher than a year ago, largely due to the AI boom. What's surprising is that Nvidia's gaming revenue is up, too. Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}