{
    "title": "AMD Ryzen 7 8700G review: Skip that graphics card for now, this CPU is the \nnew meta for budget PC gaming",
    "date": "1/29/2024",
    "url": "https://www.windowscentral.com/hardware/cpu-gpu-components/amd-ryzen-7-8700g-review",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. This processor's unique appeal sets it apart from more powerful options in the same price range. The integrated Radeon 780M graphics are far beyond just a crutch for when your graphics card breaks down; they're a viable option for playing modern titles at around 60 FPS if you can stomach lowering the visual settings. Promises made by AMD's HYPR-PX technology, like Fluid Motion Frames, claim to boost performance with a series of updates following its release, and the boxed Wraith cooler saves you from spending on a brand-new option. Phenomenal integrated graphics. Capable performance for a 65W chip. Perfect for budget-friendly builds. Outperformed by similarly priced CPUs. Locked to AM5 motherboards and DDR5 RAM. Why you can trust Windows Central \n\n\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test. 1. Price & availability\n2. Specs and testing parts\n3. Benchmarking\n4. Internal graphics\n5. The competition\n6. Should you buy? Building a custom gaming PC is arguably the ultimate approach since you get complete control of every component, gearing your rig toward your exact needs. However, some of the most expensive parts you can expect to buy are a dedicated graphics card and CPU cooler. That's where AMD's latest Ryzen 8000G Series processors come in. The Ryzen 7 8700G, in particular, is a Zen4 APU combining a CPU, integrated GPU, and its latest XDNA NPU to handle dedicated AI processes. Its Radeon 780M iGPU has proved itself powerful in the world of portable gaming handhelds and promises to be even better inside a desktop chip with enhanced cooling. Does it live up to the hype or miss the mark? Disclaimer: This review was made possible by a review sample provided by AMD. The company did not see the contents of the review before publishing.  AMD's Ryzen 7 8700G desktop processor will be released on January 31, 2024, with a $329 MSRP. It's the most powerful Zen4 APU in the Ryzen 8000 G-Series range, featuring integrated Radeon 780M graphics and an AMD XDNA NPU as a dedicated AI engine. It's designed for motherboards with an AM5 (LGA 1718) socket and is not backward-compatible with AM4 boards. However, many CPU coolers, including the boxed AMD Wraith air cooler, designed for an AM4 bracket, will fit AM5 equivalents, but check with your chosen manufacturer first.  AMD's Ryzen 7 8700G ranks at the top end of its Ryzen 8000 G-Series desktop processor range, carrying a $329 MSRP. Each CPU in this range features a 65W TDP and integrated Radeon 700 M-Series graphics, though only the 8700G features the same Radeon 780M chip found in AMD's Z1 Extreme mobile APUs used by portable PC gaming handhelds like the ASUS ROG Ally and Lenovo Legion Go. Features supporting AMD Ryzen AI are available in this 8-core/16-thread Ryzen 7 8700G, and the 6c/12t Ryzen 5 8600G (which I also have for review) since both feature the AMD XDNA NPU, whereas the 6c/12t Ryzen 5 8500G and OEM-exclusive 4c/8t Ryzen 3 8300G do not. With 24MB total (L2+L3) cache and a maximum boost clock of 5.1 GHz, the AMD 7 8700G is now the second most powerful desktop CPU with a 65W TDP manufactured by AMD, behind the Ryzen 9 7900. Everything that ranks above the 8700G boasts a much higher TDP, from 105W to 170W. Although the highly-rated Ryzen 7 7800X3D featured twice the base power at 120W and far more total cache at 104MB, it's still an 8-core/16-thread CPU, matching the 8700G. A 65W power limit will undoubtedly prevent the 8700G from reaching phenomenal levels of gaming performance as the 7800X3D. Still, it targets a more budget-conscious PC gamer who might not have the funds to buy a dedicated desktop graphics card best suited to the powerhouse X3D CPUs.  An ASUS ROG STRIX B650-A Gaming WiFi motherboard and 32GB of G.SKILL Trident Z5 Neo RGB DDR5-6400 RAM were provided by AMD, but the rest of the parts were from my benchmarking machine. Although the Ryzen 7 8700G includes an AMD Wraith air cooler inside the box, I opted to stick with a 280mm Corsair H115i Elite Capellix all-in-one liquid cooler since it was already mounted inside the case. The build was a breeze, thanks to the tremendous size shown in my Hyte Y70 Touch PC case hands-on. Updating the motherboard with a preview BIOS came with a small caveat of needing to reset the TPM chip halfway through setup, so Windows 11 Pro was set up with an OOBE (out-of-box experience) to bypass the requirement so I could enable it later, and Windows was entirely updated before any tests were run. Hyper-V was also disabled for benchmarking purposes, known as SVM for AMD CPUs, and the FCLK frequency for RAM was automatically set at 2000 MHz. AMD recommends using 2400 MHz for RAM FCLK post-launch, which should be automatically applied with upcoming motherboard drivers with updated AGESA versions. AMD Ryzen Master and Radeon Adrenaline Edition were the first third-party apps installed after the first boot with no issues from supplied pre-release drivers. Putting the Ryzen 7 8700G through its paces in CPU-centric benchmark tests shows it can hold its own against processors with higher power draws and rank amongst similar options from previous generations. In Cinebench R23, the 8700G lands between the 8-core/16-thread Ryzen 7 5800X, which pulls a higher 105W TDP, and the 8c/16t Ryzen 7 7800X3D with its much higher 120W TDP. Intel pulls ahead with the 14c/20t 14th Gen Core i7-14600K, which also carries a $329 MSRP but can't match the internal graphics capability and would need a dedicated GPU for gaming. Geekbench 6 shows the Ryzen 7 8700G creeping on the heels of the 7800X3D again, with Intel's Core i7-14600K enjoying a more modest lead this time. Considering the 8700G APU contains a revolutionary Radeon 780M internal GPU (more on that soon) and a dedicated NPU AI engine, the 8700G spreads its value in more of a multi-functional way rather than raw CPU processing performance. Still, for a chip limited to 65W, it's putting up an admirable fight against competitors that pull almost double the TDP. Running the CPU-Z benchmark shows the Ryzen 7 8700G pulls slightly ahead of the 7800X3D. However, though the latter didn't perform brilliantly in all productivity tests during its review, notably reserving its power for gaming, it still creeps ahead in a compression/decompression test with 7-Zip. A more significant difference is evident in PCMark 10 results, with several Ryzen 7000 X-Series CPUs scoring higher than the plucky 8700G. Still, it (surprisingly) passes the mighty 14th Gen Intel Core i9-14900K, so that's worth applause. Overall, despite it placing below previous-generation Ryzen desktop processors, these results from the 8700G are impressive due to its lower power draw, superior integrated graphics, and a minor bonus of including an AMD Wraith air cooler. It all aligns with AMD's mission statement for the Ryzen 7 8700G, to offer a powerful Zen4 processor capable of running modern games without spending more cash on a dedicated graphics card. If the Radeon 780M performs similarly in my following tests, these numbers prove that you could build a decent 1080p gaming desktop without a dedicated graphics card.  Dedicated, hardware-based AI accelerators like NPUs (neural processing units) are so new that it's difficult to compare performance against the competition. There aren't many options for genuinely benchmarking NPU performance, but we have access to one of the first: UL Procyon. Running an AI inference test based on Microsoft's Windows ML (machine learning) API shows the Ryzen 7 8700G report a score of 124. What that number means is currently one of many unknowns. AMD is working directly with Microsoft to have NPU utilization graphs appear in the Performance tab of Windows Task Manager, but they're not publicly available yet. For now, the promise of AMD's XDNA architecture to dynamically adjust to upcoming AI models has to be taken with a pinch of salt. As more software is released to monitor NPU performance properly, the 8700G can at least serve as a useful reference for future comparisons. The Ryzen 7 8700G is an AMD APU, fitting a dedicated CPU, GPU, and NPU all onto one chip. With the CPU handling regular processing tasks, the Radeon 780M GPU takes over real-time rendering for gaming and other 3D tasks, and the AMD XDNA NPU powers hardware-driven AI computing tasks. Integrated graphics are nothing new, but for years, they've been underwhelming fallbacks that struggle to run modern games, failing to offer a serious option for those who can't afford a dedicated graphics card. AMD explicitly states that games should always use 'low' settings at 1080p, but even then, an iGPU running Cyberpunk 2077 around 50-60 FPS is a thing of beauty. AMD's 8000 G-Series processors are set to raise the integrated graphics bar with the latest Radeon 700M mobile graphics chips. The Radeon 780M inside the 8700G is the same used by the Ryzen Z1 Extreme APU inside modern portable PC gaming handhelds and even ultrathin laptops like the recently reviewed Acer Swift Edge 16. The difference here is that desktop processors have a superior offering of intense cooling solutions, allowing the iGPU to reach its potential 2.9GHz clock speed without fear of overheating. With that in mind, it gives some context to the phenomenal performances of the Ryzen 7 8700G in modern games like Cyberpunk 2077, Shadow of the Tomb Raider, and Far Cry 6. AMD explicitly states that the recommended graphics settings for any game should always start at the 'low' profile with a 1920 x 1080 resolution, but even then, an iGPU running Cyberpunk 2077 around 50-60 FPS is a thing of beauty. Tomb Raider flies through its benchmark with an average of 64 FPS, and Far Cry 6 hits 62 FPS. For media-centric tests, Handbrake 1.7.2 took 2,033 seconds (just under 34 minutes) to encode Tears of Steel, a 6.27GB 4K video file, with the H.265 MKV 2160p60 profile. It's faster than the Ryzen 7 7840U mobile APU testing in my Acer Swift Edge 16 laptop review, which featured the same Radeon 780M iGPU. Rendering Piotr Krynski's 'Scan Island' scene from the demo files section of the official Blender website in Blender 4.0 took 14m 6s on the Cycles GPU setting, while similar tests in BMW27_GPU took 2m 24s and Classroom took 5m 26s. 3DMark's Time Spy benchmark shows the Radeon 780M score higher with the Ryzen 7 8700G than any other device featuring the same iGPU, including the ASUS ROG Ally and Lenovo Legion Go handheld consoles. I always expected it to beat the Iris Xe from Intel, but to outrank gaming hardware with intricate cooling designs is something to behold. Again, a desktop CPU should consistently outperform a mobile CPU through sheer thermal control superiority alone, but this is a delight to see. Through AMD HYPR-RX technology and Fluid Motion Frames, performance should improve over time, too. It's still somewhat of a crutch for desktop gamers looking to push for 1440p resolutions or framerates over 60 FPS, but the Ryzen 7 8700G could legitimately become the new meta for mini PCs. Building a tiny, cube-like gaming desktop next to your television could offer the same PC gaming convenience as a Steam Deck in a cheap docking station. Whether or not that was AMD's intention, it certainly excites me.  Discussing the closest competitors for a budget-conscious processor like the Ryzen 7 8700G comes down primarily to price. If you're serious about building a custom desktop PC on the most strict budget possible, it can help reduce the painful sting of buying a dedicated graphics card and keep the overall cost down by a significant amount. In that sense, the integrated graphics included with a desktop processor must be up to the task of running modern games at reasonable settings. Options from Intel's 13th and 14th Gen in the same price bracket can match and even outperform in productivity app testing, but their integrated graphics chips are no match for the Radeon 780M. For example, a 14th Gen Intel Core i5-14600K sells for a $319 MSRP, which is $10 cheaper than the 8700G, boasts a higher 14-core/20-thread count and 125W TDP but falls short with Intel UHD Graphics 700 for its integrated solution. Intel also lacks a dedicated NPU on its desktop range, at least until the Arrow Lake chips are released later in 2024. However, it's a more potent choice when paired with a similarly powerful dedicated graphics card. Still, if you're going for all-out gaming performance, I'd recommend the Ryzen 7 7800X3D from AMD's previous generation since it still stands as the current champion in its category. You won't get the same Radeon 780M graphics, settling instead for the same RDNA 2 iGPU as the remaining 7000 Series. To help you build a functional 1080p gaming desktop without a dedicated graphics card, nothing can perfectly match the Ryzen 7 8700G. It's at the top of its category and will remain there until Intel can produce a genuine challenger with its upcoming integrated Arc graphics.  ✅ You're building a gaming PC on a budget In the strictest sense, it's not a full-budget CPU, as it's top of its grade in the 8000 G-Series range. Still, the Ryzen 7 8700G is the only option with the formidable Radeon 780M iGPU that can genuinely play modern games, saving you a dedicated GPU purchase. ✅ You want an affordable NPU At $329, AMD offers one of the first desktop CPUs with a dedicated AI engine. Again, it's not the cheapest, as the Ryzen 5 8600G provides the same XDNA chip, but the 8700G is still wildly affordable and versatile for those interested in artificial intelligence productivity. ❌ You're harvesting older PC parts Anyone upgrading from an AM4 socket motherboard with DDR4 RAM must buy an entirely new setup. Only CPU coolers, cases, and storage will realistically carry over to the new AM5 socket, which requires DDR5 RAM. ❌ You play at 4K resolutions or high FPS While the Radeon 780M integrated graphics exhibit phenomenal performance without a dedicated GPU, it's limited to 1080p and sometimes 1440p with AMD's HYPR-RX tech. You'll need to upgrade parts for 4K gaming. AMD has finally made integrated desktop graphics relevant for gamers. It's no small feat when its predecessors have been little more than temporary backups for when an expensive dedicated GPU accidentally overheats or otherwise breaks down. Genuinely the most powerful results I've seen from the plucky Radeon 780M integrated chip, it outperforms the same offered by the ASUS ROG Ally and Legion Go handhelds thanks to a higher (but not too high) TDP and dominant desktop cooling. Including an AMD Wraith cooler in the box means you're halfway to a complete PC build, requiring a compatible AM5 socket motherboard and DDR5 RAM alongside the usual necessities. The only downside is that you can pick up processors with almost double the TDP wattage for the same price from both Intel and AMD, preventing potential bottlenecks when you inevitably upgrade to a dedicated GPU. Still, it's one of the first to offer a dedicated NPU on desktops for AI acceleration, and you won't find any integrated graphics better than this. It's budget-conscious but not the cheapest around. That space might be reserved for the Ryzen 5 8600G versus the 8700G, but I'd stress the value of stretching your cash for the fantastic 8700G. It's a win from AMD.   Boxed with an AMD Wraith cooler, the Ryzen 7 8700G features revolutionary Radeon 780M integrated graphics capable of running modern titles at modest visual settings. Ben is the channel editor for all things tech-related at Windows Central. That includes PCs, the components inside, and any accessory you can connect to a Windows desktop or Xbox console. Not restricted to one platform, he also has a keen interest in Valve's Steam Deck handheld and the Linux-based operating system inside. Fueling this career with coffee since 2021, you can usually find him behind one screen or another. Find him on Mastodon @trzomb@mastodon.online to ask questions or share opinions. Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}