{
    "title": null,
    "date": "1/25/2024",
    "url": "https://www.marketwatch.com/story/intel-is-struggling-to-gain-traction-in-ai-chips-while-nvidia-and-amd-roar-ahead-37b132ff",
    "text": "It’s a tale of two worlds for Intel \n        INTC,\n        +0.91%\n       these days. At a turbulent time for the silicon industry, the computer-chip giant late Thursday reported that fourth-quarter 2023 revenue rose 10% year over year, with a gross margin increase of 6.5 points. For the 2023 full-year results, however, total revenue was down 14% vs. 2022 and total gross margin slipped to 40% from 42.6%. Compared to companies like Taiwan Semiconductor Manufacturing  \n        TSM,\n        -0.47%\n       or even Nvidia \n        NVDA,\n        +0.12%,\n       with 2023 gross margins of 54% and 73% respectively, Intel continues to struggle to find ways to manage costs. But looking at the overall quarterly or full-year 2023 results doesn’t tell the whole story. Intel’s two most important business units, CCG (client products) and DCAI (data center and AI infrastructure products) could not be on more divergent paths. The client group at Intel is the cash cow, the part of the company that has continuously provided the revenue and dollars to operate and grow new business units and product lines. Looking at client group operations in last year’s fourth quarter, things look amazing. Revenue was up 33% and operating income jumped more than 450%, with operating income increasing from $500 million to $2.9 billion compared to the same quarter a year ago. The company called out “healthier alignment” to the inventory situation that was the cause for concern over the past couple of years as one of the primary reasons for the turnaround. This paints 2024 as a potential growth opportunity for client products, inclusive of laptop and desktop CPU chips. Intel launched its new chips, called Core Ultra, for the AI PC market last month, with some systems from partners including Dell and HP available before the holiday, and many more coming this quarter. Intel’s ability to grow its client group earnings is strongly contingent on momentum and consumer excitement over adopting PCs with this new AI capability. Many industry analysts are calling for a “supercycle” of PC upgrades in the second half of 2024 as more software and interesting consumer use cases move AI computing from the cloud to your local PC. For now, I see AI PC demand as rather soft. Looking at the enthusiast technology audience, one I general consider the leading indicator of technology trends, there is very little interest in “AI for AI’s sake” and instead I see a sense of patience for that “wow” moment to trigger the buying cycle. I’m confident it will happen. Intel isn’t the only player in this AI PC space. Both AMD \n        AMD,\n        +0.50%\n       and Qualcomm \n        QCOM,\n        +0.10%\n       have very good chips with integrated AI accelerators, and interesting startups like MemryX offer add-on AI chips, so Intel will have to compete on performance and flex its channel-influence muscle to create the best software ecosystem for its parts in order to stand out. “We are past the point of simply shrugging it off with a ‘better luck next time’ mentality. ” If this past quarter’s results offer a lot of optimism for the client side of Intel’s house, then they bring an equal amount of questions for the data-center and AI infrastructure business unit. Revenue dropped year over year by 10% and operating income was down 38%, with an operating margin of 2%. The company commented in a press release that the “CPU addressable market” was contracting and that there were significant competitive pressures on earnings. Yet we are past the point of simply shrugging it off with a “better luck next time” mentality. Intel’s Xeon CPU is still the dominant market-share leader in the data-center CPU chip space, even with the likes of AMD and its Epyc line of parts making inroads. But that clearly isn’t enough to grow the business. Intel’s data-center group is having issues executing on a plan to capitalize on the AI computing craze. While Nvidia stock skyrockets to a $1.5 trillion valuation, Intel’s data-center GPU products haven’t gained a foothold. And while the Gaudi line of AI accelerators looks good on paper and in the limited benchmarks available, there’s no significant bellwether design wins or partnerships that indicate a flood of sales will be happening anytime soon. Considering AMD is projecting revenue from its MI300 AI server chip into the billions of dollars for 2024, it’s incredibly concerning that Intel isn’t showing a plan to counter. The company announced a leadership change for this business unit this month, and while a needed move, it is not an instant band-aid to solve the AI issues Intel has. Read: Missed the boat on AMD’s stock surge? Why this analyst says you’re not too late. During Intel’s earnings call Q&A, CEO Pat Gelsinger indicated that Intel’s focus for AI in 2024 will be more on AI inference than training, activating and using the AI models rather than creating or building new ones. If the market is moving that way and needs to adopt a slightly different infrastructure base for that to happen, it will lean more to Intel’s strengths. Additionally, Intel CFO David Zinsner told analysts on Thursday that there is a “$2 billion pipeline” for its “discrete accelerator portfolio” for 2024. This is a positive sign that Intel could still make headway in the data center AI space this year with its Gaudi product. A pipeline is not the same as official revenue projections or a much-needed customer announcement, but it’s a more positive sign than anything that appeared in the company’s earnings statements. The once vaunted network and edge business unit (NEX) at the company saw revenue drop 24% year over year and operating income drop to a rounding error of zero. And the foundry services business (IFS) increases revenue to $291 million (up 63% year over year) but is still bleeding money as the company spends capital in new facilities and partnerships. This year is going to be telling for Intel and how it will move forward into the second half the decade. Can this once-unassailable tech giant get back on its feet with Gelsinger’s help and offer both manufacturing and product excellence? Or will it continue to get beaten down by Nvidia, AMD or even Qualcomm — companies that until recently were just flies buzzing around its head? Ryan Shrout is the President of Signal65 and founder at Shrout Research. Follow him on X @ryanshrout. Shrout has provided consulting services for AMD, Qualcomm, Intel, Arm Holdings, Micron Technology, Nvidia and others. Shrout holds shares of Intel. More: Intel’s earnings forecast comes up well short, and the stock is tanking Plus: Intel’s ‘make-or-break year’ will put stock’s recent surge to the test Terns Pharma is due to release data from an early-stage trial of an obesity treatment in pill form in the second half. Positive data would send the stock higher. Visit a quote page and your recently viewed tickers will be displayed here. "
}