{
    "title": "AMD Unveils AMD Radeon RX 7600 XT Graphics Card – Incredible Gaming at \n1080p and Beyond for Under $350",
    "date": "1/8/2024",
    "url": "https://www.globenewswire.com/en/news-release/2024/01/08/2805619/0/en/AMD-Unveils-AMD-Radeon-RX-7600-XT-Graphics-Card-Incredible-Gaming-at-1080p-and-Beyond-for-Under-350.html",
    "text": "January 08, 2024 10:30 ET\n\n\r\n            | Source:\r\n            \nAdvanced Micro Devices, Inc.\n\n\n\n\n\nAdvanced Micro Devices, Inc. — 16GB of high-speed memory powers today’s and tomorrow’s games; Support for AMD HYPR-RX with AMD Fluid Motion Frames and other key AMD technologies enable highly responsive, fully immersive gaming experiences — — Delivers up to 1.9X faster gaming and raytracing performance in select titles compared to one of the popular competitive offerings based on Steam survey data1 — LAS VEGAS, Jan.  08, 2024  (GLOBE NEWSWIRE) -- Ahead of CES 2024, AMD (NASDAQ: AMD) introduced the AMD Radeon™ RX 7600 XT, a high-performance, feature-rich graphics card designed to power demanding games and content creation applications today and for years to come. The AMD Radeon RX 7600 XT graphics card is an ideal upgrade solution for gamers, offering fast, smooth, and visually stunning gaming and raytracing experiences at 1080p and beyond. Additionally, featuring 16GB of high-speed GDDR6 memory it unleashes users’ creativity in next-gen AI and content creation workloads. In addition, with support for advanced technologies including AMD FidelityFX™ Super Resolution2 3 and AMD HYPR-RX3 with AMD Fluid Motion Frames4, users can crank up their game settings for fully immersive and highly responsive gaming at up to 1440p, delivering up to 1.9X faster gaming and raytracing performance than the NVIDIA GeForce RTX 2060 in select titles at 1080p. “Discerning gamers around the world are looking for a simple goal of smooth lag-free gameplay at affordable prices to enjoy the most of their gaming experience. Today, the Radeon RX 7600 XT graphics card delivers on that goal,” said Jack Huynh, senior vice president and GM, Computing and Graphics Group at AMD. “Surveys show that a large number of gamers play at 1080p, and the new AMD Radeon RX 7600 XT graphics card, with its 16GB frame buffer, delivers future-proofed performance to this sweet spot of the market,” said Dave Altavilla, principal analyst at HotTech Vision And Analysis. “The AMD Radeon RX 7600 XT graphics card also has the ability to hit 1440p resolutions as well with advanced features like FSR 3 AMD Fluid Motion Frames.” Breakthrough Gaming and Content Creation PerformanceFeaturing 32 unified high-performance AMD RDNA™ 3 compute units, advanced AI technology, dedicated raytracing accelerators and high-capacity graphics memory, the AMD Radeon RX 7600 XT graphics card is optimized to render games at max settings, delivering incredible gaming experiences at 1080p and beyond. Alternatively, for professionals and hobbyists looking to push the creative boundaries of their work, the new graphics card delivers blistering-fast content creation performance to power professional video editing, graphic design, and 3D modelling applications, bringing photorealistic worlds to life. Key features and capabilities include: Premium Gaming with Expanded AMD Advantage™ ProgramTo deliver incredible gaming experiences, AMD is expanding the AMD Advantage program, giving OEM and system builders the opportunity to develop high-volume, multi-segment desktops and laptops. AMD Advantage-certified systems are designed to deliver a phenomenal gaming experience with more features and capabilities exclusively with all-AMD systems. They combine AMD Radeon graphics, AMD Ryzen™ processors, AMD smart technologies, AMD Software: Adrenaline Edition application features, and other advanced system design characteristics. AMD will continue to maintain the existing AMD Advantage program – now branded “AMD Advantage Premium.” Based on extensive customer feedback and with over 200 design touchpoints, AMD will continue to work directly with partners to ensure that select, top-tier AMD Advantage Premium systems are designed and tested following a rigorous set of qualifications and standards to deliver the absolute best possible gaming experiences.        Key AMD Radeon RX 7600 XT Specifications  Pricing and AvailabilityThe AMD Radeon RX 7600 XT graphics card is expected to be available beginning January 24, 2024, from leading AMD board partners, including Acer, ASRock, ASUS, Gigabyte, PowerColor, Sapphire and XFX. The AMD Radeon RX 7600 XT graphics card has an SEP of $329 USD. New AMD Advantage-certified systems are expected to be available in the coming months from leading OEM/SIs. Supporting Resources About AMD For more than 50 years AMD has driven innovation in high-performance computing, graphics and visualization technologies. Billions of people, leading Fortune 500 businesses and cutting-edge scientific research institutions around the world rely on AMD technology daily to improve how they live, work and play. AMD employees are focused on building leadership high-performance and adaptive products that push the boundaries of what is possible. For more information about how AMD is enabling today and inspiring tomorrow, visit the AMD (NASDAQ:AMD) website, blog, and LinkedIn  pages. CAUTIONARY STATEMENT  This press release contains forward-looking statements concerning Advanced Micro Devices, Inc. (AMD) such as the features, functionality, performance, availability, timing and expected benefits of the AMD Radeon™ RX 7600 XT graphics card and AMD Advantage-certified systems, which are made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are commonly identified by words such as \"would,\" \"may,\" \"expects,\" \"believes,\" \"plans,\" \"intends,\" \"projects\" and other terms with similar meaning. Investors are cautioned that the forward-looking statements in this press release are based on current beliefs, assumptions and expectations, speak only as of the date of this press release and involve risks and uncertainties that could cause actual results to differ materially from current expectations. Such statements are subject to certain known and unknown risks and uncertainties, many of which are difficult to predict and generally beyond AMD's control, that could cause actual results and other future events to differ materially from those expressed in, or implied or projected by, the forward-looking information and statements. Material factors that could cause actual results to differ materially from current expectations include, without limitation, the following: Intel Corporation’s dominance of the microprocessor market and its aggressive business practices; economic uncertainty; cyclical nature of the semiconductor industry; market conditions of the industries in which AMD products are sold; loss of a significant customer; impact of the COVID-19 pandemic on AMD’s business, financial condition and results of operations; competitive markets in which AMD’s products are sold; quarterly and seasonal sales patterns; AMD's ability to adequately protect its technology or other intellectual property; unfavorable currency exchange rate fluctuations; ability of third party manufacturers to manufacture AMD's products on a timely basis in sufficient quantities and using competitive technologies; availability of essential equipment, materials, substrates or manufacturing processes; ability to achieve expected manufacturing yields for AMD’s products; AMD's ability to introduce products on a timely basis with expected features and performance levels; AMD's ability to generate revenue from its semi-custom SoC products; potential security vulnerabilities; potential security incidents including IT outages, data loss, data breaches and cyber-attacks; potential difficulties in operating AMD’s newly upgraded enterprise resource planning system; uncertainties involving the ordering and shipment of AMD’s products; AMD’s reliance on third-party intellectual property to design and introduce new products in a timely manner; AMD's reliance on third-party companies for design, manufacture and supply of motherboards, software, memory and other computer platform components; AMD's reliance on Microsoft and other software vendors' support to design and develop software to run on AMD’s products; AMD’s reliance on third-party distributors and add-in-board partners; impact of modification or interruption of AMD’s internal business processes and information systems; compatibility of AMD’s products with some or all industry-standard software and hardware; costs related to defective products; efficiency of AMD's supply chain; AMD's ability to rely on third party supply-chain logistics functions; AMD’s ability to effectively control sales of its products on the gray market; impact of government actions and regulations such as export regulations, tariffs and trade protection measures; AMD’s ability to realize its deferred tax assets; potential tax liabilities; current and future claims and litigation; impact of environmental laws, conflict minerals-related provisions and other laws or regulations; impact of acquisitions, joint ventures and/or investments on AMD’s business and AMD’s ability to integrate acquired businesses;  impact of any impairment of the combined company’s assets; restrictions imposed by agreements governing AMD’s notes, the guarantees of Xilinx’s notes and the revolving credit facility; AMD's indebtedness; AMD's ability to generate sufficient cash to meet its working capital requirements or generate sufficient revenue and operating cash flow to make all of its planned R&D or strategic investments; political, legal and economic risks and natural disasters; future impairments of technology license purchases; AMD’s ability to attract and retain qualified personnel; and AMD’s stock price volatility. Investors are urged to review in detail the risks and uncertainties in AMD’s Securities and Exchange Commission filings, including but not limited to AMD’s most recent reports on Forms 10-K and 10-Q. ©2023 Advanced Micro Devices, Inc. All rights reserved. AMD, the AMD Arrow logo, AMD Radiance Display, Radeon, RDNA, and combinations thereof are trademarks of Advanced Micro Devices, Inc. All other product names used in this publication are for identification purposes only and may be trademarks of their respective companies. The information contained herein is for informational purposes only and is subject to change without notice. Timelines, roadmaps, and/or product release dates shown in this Press Release are plans only and subject to change. 1 Testing done by AMD performance labs Dec. 19, 2023, on a test system configured with a Ryzen 5 7600X CPU, 32 GB DDR5-6000 Memory, Windows 11 Pro on a Radeon RX 7600 XT, RX 7600 (Driver 23.40-231107a) graphics cards with AMD Smart Access Memory technology ON, vs. a similarly configured system with an NVIDIA GeForce RTX 2060 (Driver 546.33) graphics cards to measure FPS in the following games and settings at 1080p: Avatar: Frontiers of Pandora™ (Ultra, RT, FSR 3), Starfield (High, FSR 2), Last of Us Part I (Ultra, FSR 2), Forza Horizon 5 (Maxed with RT Extreme, FSR 2 ), Call of Duty: Modern Warfare III (Extreme). “Quality” mode used for FSR and DLSS test runs. System manufacturers may vary configurations, yielding different results. RX-1056.2 AMD FidelityFX Super Resolution (FSR) versions 1, 2, and 3 are available on select games which require game developer integration and are supported on select AMD products. AMD does not provide technical or warranty support for AMD FidelityFX Super Resolution enablement on other vendors' graphics cards. See https://www.amd.com/en/technologies/fidelityfx-super-resolution for additional information. GD-187a.3 AMD HYPR-RX works on the AMD Radeon™️ RX 7000 Series GPUs and newer or the Ryzen 7040 Series APUs with integrated RDNA 3 graphics and newer. AMD HYPR-RX allows various features within AMD Software interoperate, working at the same time, including Radeon Super Resolution, FidelityFX Super Resolution, Radeon Anti-Lag, Radeon Anti-Lag+, and Radeon Boost, where applicable to select titles. GD-225A.4 AMD Fluid Motion Frames, or AFMF, is a frame generation technology designed to increase frame rates and smooth movement for game winning performance with minimal impact to image quality. AFMF is integrated into AMD Software and currently supports the Radeon RX 6000 and 7000 series graphics cards. GD-234.5 AMD Fluid Motion Frames interpolation technology when used with AMD FidelityFX Super Resolution (FSR) 3 inserts 1 frame between existing ones which can therefore enable up to 2x the framerate in supported games. GD-2316 Video codec acceleration (including at least the HEVC (H.265), H.264, VP9, and AV1 codecs) is subject to and not operable without inclusion/installation of compatible media players. GD-176.7 DisplayPort™ 2.1 support is dependent on AIB card designs. 8 Game clock is the expected GPU clock when running typical gaming applications, set to typical TGP (Total Graphics Power). Actual individual game clock results may vary. GD-1479 Boost Clock Frequency is the maximum frequency achievable on the GPU running a bursty workload. Boost clock achievability, frequency, and sustainability will vary based on several factors, including but not limited to: thermal conditions and variation in applications and workloads. GD-151 Contact:George Millington AMD Communications+1 408-547-7481 George.Millington@amd.com Suresh BhaskaranAMD Investor Relations+1 408-749-2845Suresh.Bhaskaran@amd.com A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/cb23ea74-1817-4d49-81f0-a83123827ebc "
}