{
    "title": "AMD's Radeon 780M integrated graphics get close to GTX 1650 in Geekbench 6 \n— Ryzen 7 8700G iGPU benchmark ...",
    "date": "1/3/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/amds-radeon-780m-integrated-graphics-get-close-to-gtx-1650-in-geekbench-6-ryzen-7-8700g-igpu-benchmark-leaked",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Desktop integrated graphics are getting really fast Benchleaks (on X) has unveiled set of Geekbench 6 Vulkan and OpenCL benchmarks showing the performance of AMD's upcoming Ryzen 7 8700G featuring AMD's flagship RDNA 3 iGPU, the Radeon 780M. The 8700G outperformed its mid-range counterpart, the 8600G (whose Geekbench 6 results leaked yesterday), with results approaching those of Nvidia's GTX 1650. The 8700G scored 35,427 points in Geekbench 6.2.2's Vulkan benchmark and 29,244 points in the OpenCL benchmark. That's 13% higher than the 8600G in the Vulkan benchmark and 15% higher in the OpenCL benchmark. The 8700G's score was significantly higher than some of Nvidia's older discrete GPUs, such as the GTX 1060 and the GTX 1630. The GTX 1060's score in the Vulkan benchmark was 17% lower than the 8700G's score, and the GTX 1630's Vulkan score was a whopping 49% lower. The 8700G's score is so high that it's within 5% of the score of Nvidia's GTX 1650 in Geekbench 6. The 8700G's powerful integrated graphics did lose to some mobile Radeon 780M results in Geekbench 6, however. The Radeon 780M we used for the 8600G report actually outperformed the 8700G's OpenCL benchmark by 3.3% (but the 8700G did beat the 780M's Vulkan benchmark by 5%). The 8700G's benchmark scores are pretty impressive. If the chip's GPU results translate to real-world gaming performance, the 8700G would provide a decent 1080p gaming experience virtually equivalent to entry-level discrete GPUs such as the GTX 1650. This would be an impressive accomplishment for integrated graphics. Spec-wise, the Radeon 780M found in the 8700G features AMD's latest RDNA3 graphics architecture, sporting 12 compute units (CUs) with a reported 2.9GHz clock speed, according to the Geekbench 6 OpenCL listing. It's worth noting that the system memory paired to the 8700G was only clocked at 4786 MT/s, which is well below the 6000 MT/s memory kit used in the 8600G Geekbench 6 benchmarks — this is probably why the 8700G lost to the Radeon 780M in the OpenCL test. As with all Geekbench 6 listings, these results should be taken with a grain of salt. Geekbench as a benchmark doesn't accurately depict real-world gaming performance of a GPU. On top of this, there are multiple GTX 1630, 1060, and Radeon 780M results in Geekbench, which muddles performance comparisons. We suspect AMD will unveil the AMD 8700G and the rest of its Ryzen 8000 lineup during CES 2024, so we should know the actual performance of these new iGPUs soon. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Aaron Klotz is a freelance writer for Tom’s Hardware US, covering news topics related to computer hardware such as CPUs, and graphics cards. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 Seven-year-old AMD gaming GPU continues to stick around — low-profile RX 550 arrives for SFF PCs By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}