{
    "title": "Charting the Course for AMD Stock: After a 114% Rise, What's Next in 2024?",
    "date": "1/6/2024",
    "url": "https://investorplace.com/2024/01/charting-the-course-for-amd-stock-after-a-114-rise-whats-next-in-2024/",
    "text": " AMD stock should benefit from its MI300X AI chip rolling out in 2024 Advertisement Source: JHVEPhoto / Shutterstock.com Over the past year, four stocks with a market capitalization of $200 billion or more (out of 44) had a triple-digit return. Advanced Micro Devices (NASDAQ:AMD) stock was one of them, up 114.2% according to Finviz.com. The others are Nvidia (NASDAQ:NVDA), Meta Platforms (NASDAQ:META), and Tesla (NASDAQ:TSLA), up 237.5%, 178.3%, and 122.1%, respectively. That’s some exclusive company. Care to guess how many of the 44 were down over the past year? Just nine. The worst performer of those in negative territory was Chevron (NYSE:CVX), down 13.1%. How will AMD stock do in 2024? As long as artificial intelligence doesn’t go off the rails like cannabis stocks and crypto have over the past year, I think it will do just fine this year. AMD stock may not see a three-digit increase, but at least a 20-30% rise by Dec. 31. These three things ought to keep Advanced Micro Devices moving higher in 2024. In July 2019, I wrote an article entitled Free Cash Flow Is the Key to Whether or Not Nvidia Stock Is a Buy. In it, I argued that Nvidia’s significant advantage over AMD was its free cash flow (FCF) generation. I expected its fiscal 202o free cash flow to be nearly $3 billion at the time. Meanwhile, AMD’s trailing 12-month free cash flow was -$251 million. “I love companies that generate free cash flow. It’s even better if they can grow FCF by double digits over the long haul. Those that can see their stock prices go higher over time; those that can’t see their stock prices go lower. It’s that simple,” I wrote on July 18, 2019. Fast forward to 2024. AMD’s TTM FCF through Q3 2023 was $1.32 billion. While down from $3.12 billion in 2022, it was still very positive, a far cry from the FCF it used in 2019. Of course, it still pales compared to Nvidia’s TTM FCF of $17.52 billion. The company’s FCF has dropped in the past year as AMD has accelerated its AI investments to meet and beat (well, at least try to) Nvidia’s efforts in this area. So far, this hasn’t translated into cash flow like it has for NVDA. That should change in 2024. Don’t get me wrong, I’m a big fan of Nvidia and its CEO, Jensen Huang. At the end of November, I suggested that if investors could swing it, they should buy both AMD and NVDA. My rationale was simple. While Nvidia is the two-ton elephant of AI, AMD has moved incredibly quickly to steal some of its thunder, including hiring a top supercomputing expert to take the competition to Huang and company. Earlier in November, I discussed how AMD’s MI300X GPU (graphics processing unit) is one of the best products ever developed, according to CEO Lisa Su. If it can capture 30% of the AI market (leaving 70% for Nvidia), AMD shareholders will still make out like bandits. Su said last June, when it announced the GPU would start shipping later in 2023 (now early in 2024), that the MI300X has 60% more memory than Nvidia’s H100. “What this performance does is it just directly translates into a better user experience,” CNBC reported Su’s Dec. 6 comments. “When you ask a model something, you’d like it to come back faster, especially as responses get more complicated.” That’s not enough to knock Nvidia off its perch, but it’s a start, especially if it can sell its AI chip for less than $40,000, the price for one Nvidia chip. Meta, OpenAI, and Microsoft (NASDAQ:MSFT) have all said they will use the M1300X as an alternative to Nvidia’s products. It’s early days, but AMD will likely surprise many people in the tech industry with the success of the MI300X GPU. On the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Will Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia. Artificial Intelligence, Semiconductor, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/charting-the-course-for-amd-stock-after-a-114-rise-whats-next-in-2024/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}