{
    "title": "8th Annual AMD Day of Service: Celebrating a Global Impact",
    "date": "1/10/2024",
    "url": "https://www.csrwire.com/press_releases/792356-8th-annual-amd-day-service-celebrating-global-impact-good",
    "text": "Now Reading   Published 01-10-24 Submitted by AMD AMD volunteers in 17 countries came together to make a lasting impact in their communities during the 8th Annual AMD Day of Service, a company-wide celebration of community volunteerism. “At AMD we solve the industry's biggest computing challenges and tough problems every day,” said Mark Fuselier, senior vice president of Technology and Product Engineering and AMD Foundation Board Member. “It is heartwarming to see AMD teams volunteering together to help our communities as a commitment to problem solving at the global humanitarian level.” Activities included assembling STEM learning kits, building and donating computers, packaging meals, cleaning up green spaces and building homes. More than 4,700 AMDers participated by generously donating their time and money to help better the lives of others because together we advance_ For more information on Community Involvement at AMD, please visit: https://www.amd.com/en/corporate/corporate-responsibility/community.html About AMDFor more than 50 years AMD has driven innovation in high-performance computing, graphics and visualization technologies. Billions of people, leading Fortune 500 businesses and cutting-edge scientific research institutions around the world rely on AMD technology daily to improve how they live, work and play. AMD employees are focused on building leadership high-performance and adaptive products that push the boundaries of what is possible. For more information about how AMD is enabling today and inspiring tomorrow, visit the AMD (NASDAQ: AMD) website, blog, LinkedIn and Twitter pages. About AMD For more than 50 years AMD has driven innovation in high-performance computing, graphics and visualization technologies. Billions of people, leading Fortune 500 businesses and cutting-edge scientific research institutions around the world rely on AMD technology daily to improve how they live, work and play. AMD employees are focused on building leadership high-performance and adaptive products that push the boundaries of what is possible. For more information about how AMD is enabling today and inspiring tomorrow, visit the AMD (NASDAQ: AMD) website, blog, LinkedIn and Twitter pages. More from AMD "
}