{
    "title": "AMD RX 7900 XT GPU is a steal thanks to Amazon price drop",
    "date": "1/19/2024",
    "url": "https://www.dexerto.com/tech/amd-rx-7900-xt-gpu-is-a-steal-thanks-to-amazon-price-drop-2485952/",
    "text": " Those looking for a powerful but affordable GPU for their PC gaming rig might be interested in the 12% price cut that Amazon has applied to the AMD Radeon RX 7900 XT When it comes to graphics cards, the major battle is between AMD and Nvidia. While Team Green might be the one currently drawing headlines with the launch of the GeForce RTX 4070 Super, AMD has been holding ground. Now consumers can pick up a fantastic capable GPU that can stand up against some of the best in Nvidia’s product lineup with 12% off the usual price. When it was first released, the AMD Radeon RX 7900 XT was one of the fastest on the market, standing toe-to-toe with the Nvidia RTX 4080 in terms of performance, but at a much cheaper price point. The RX 7900 XT still provides amazing performance at both 1440p and 4K, capable of delivering even the most demanding of modern AAA titles, such as Cyberpunk 2077 and Forza Horizon 5. This is thanks to the impressive specs of the card, which boasts a base clock of 2000 MHz, a boost clock of up to 2450MHz, and 20GB of GDDR6 VRAM with a memory bus width of 320-bit. Despite these beefy specs, the RX 7900 XT uses less power and runs somewhat cooler than its direct competition from Nvidia. For connecting to a monitor, the card offers a range of options to suit many different types of monitors, including 2 HDMI 2.1 ports and 2 DisplayPort 2.1 ports. Thanks to the use of these standards, the GPU is capable of displaying high framerates and can support AMD’s FSR 2 technology, which uses AI-powered supersampling to improve gaming performance. Though a few years old now, the AMD Radeon RX 7900 XT can still deliver and is especially tempting with 12% off. If you click on a product link on this page we may earn a small affiliate commission.   Rebecca is a Tech Writer at Dexerto, specializing in PC components, VR, AMD, Nvidia and Intel. She has previously written for UploadVR and The Escapist, hosts a weekly show on RadioSEGA and has an obsession with retro gaming. Get in touch at rebecca.hillsduty@dexerto.com "
}