{
    "title": "AMD \"Kraken Point\" APU details leak - Zen 5 and RDNA 3.5!",
    "date": "1/26/2024",
    "url": "https://overclock3d.net/news/cpu_mainboard/amd-kraken-point-apu-details-leak-zen-5-zen-5c-and-rdna-3-5/",
    "text": " AMD are gearing up to launch next-generation APUs, with Kraken Point being set to succeed Hawk Point with Zen 5/Zen5c CPU cores and RDNA 3.5 graphics. While it will not be AMD’s fastest next-generation mobile CPU, it will feature all of AMD’s latest architectural enhancements with Zen 5 based CPU cores, RDNA 3.5 graphics, and an XDNA 2 AI processor. With Kraken Point, AMD will be delivering users a premium hybrid CPU for the first time. This processor will reportedly feature four Zen 5 CPU cores and four Zen 5c CPU cores. The CPU will also feature 4 RDNA 3.5 WGPs. This information comes from Everest on Twitter/X. These specifications gives this new APU the same number of GPU compute units as Valve’s Steam Deck, but with AMD’s newer RDNA 3.5 graphics architecture. This should allow this APU to deliver respectable levels of gaming performance. 4 WGP https://t.co/bCXt9hTzh9 — Everest (@Olrak29_) January 26, 2024  On the higher-end of AMD’s Zen 5 APU product stack the company has their Strix Point and Strix Halo products. These CPUs will feature more CPU cores and more powerful RDNA 3.5 GPUs. So far, AMD’s Kraken Point CPUs appear to be a solid offering for the notebook market. With its XDNA 2 NPU, this SOC will be ideal for the emerging AI PC market, especially if XDNA 2 performs as expected. You can join the discussion on AMD’s Kraken Point APU Specifications on the OC3D Forums. A Northern Irish father, husband, and techie that works to turn tea and coffee into articles when he isn’t painting his extensive minis collection or using things to make other things. No crappy Google banners here, only PC related advertising you may actually find interesting. Please disable Ad Blockers in order for us to keep producing the same level of quality, informational reviews and news. Worst case they actually look pretty and fill the empty gaps <3 "
}