{
    "title": null,
    "date": "1/4/2024",
    "url": "https://wccftech.com/amd-reportedly-looks-for-alternate-cowos-suppliers-as-tsmc-reaches-full-capacity/",
    "text": "AMD is reportedly searching for alternate CoWoS suppliers, as Taiwanese giant TSMC reaches full production capacity amid high industry demand. It is reported by the Taiwanese outlet, CTEE, that AMD has decided to find alternatives to TSMC when it comes to acquiring CoWoS supply since the firm has been busy catering industry orders, particularly those from NVIDIA. The Taiwan giant is currently unable to cope with the demand, especially for CoWoS packaging, since the company's facilities haven't reached the \"required\" production yet. However, even if TSMC opts for facility expansion, it would most likely cater to the needs of NVIDIA, hence AMD has decided to opt for other sources, with several candidates lined up. It is said that firms such as ASE Investment Holdings, Power Technologies, KYEC Electronics, and Winbond Electronics could be the next CoWoS suppliers for AMD, as the mentioned firms have opened up facilities and have already started to initiate production. This move by Team Red could prove to be quite beneficial, given that not only can it make its offerings much more competitive by ensuring seamless supply. At the same time, AMD and TSMC are very good partners and will continue to work on building increased production capacities but those take time. AMD hasn't made the success it could've in the AI markets (yet) like its rival NVIDIA, but it looks like the company is prepared to take an aggressive stance. The company has just recently shown how its Instinct GPUs have started to catch up with NVIDIA's product offerings, not only in terms of performance but also in having an optimized AI software stack. The chipmaker does have a golden opportunity to attract client interest given that it is successful in positioning its AI products on par with NVIDIA's, along with ensuring a continuous supply. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}