{
    "title": "AMD's looming Ryzen APUs show big 30% boost over prior-gen models — Ryzen \n8000G benchmarks easily beat ...",
    "date": "1/27/2024",
    "url": "https://www.tomshardware.com/pc-components/cpus/amds-looming-ryzen-apus-show-big-30-boost-over-prior-gen-models",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The transition from Zen 3 to Zen 4 brings 30% performance uplifts. Three of AMD's upcoming Ryzen 8000G APUs, which will vie for a spot on the list of best CPUs, have already been tested in Passmark, and the results show that these new chips are 30% faster than their 5000G predecessors. Arriving on January 31, Ryzen 8000G APUs will be the first new high-end models for the desktop AMD has delivered since 2021's Ryzen 5000G series. The APUs in question were the Ryzen 7 8700G, the Ryzen 5 8600G, and the Ryzen 5 8500G, the only models to come to retail as the Ryzen 3 8300G will be an OEM exclusive. This indicates that upcoming reviews for the APUs will include all three models. However, with their fast integrated graphics, the headliners will almost certainly be the higher-end Ryzen 7 8700G and Ryzen 5 8600G. Compared to their predecessors, the Ryzen 7 8700G and Ryzen 5 8600G are both 30% faster, in line with the expected upgrade of Zen 3 to Zen 4. All three Ryzen 8000G APUs can hit up to 5 GHz, substantially higher than even the Ryzen 7 5700G's 4.6 GHz boost clock speed, and the Zen 4 architecture inside the Ryzen 8000G series also delivers a little extra performance. The benchmarks also clearly indicate how the Phoenix 2-based Ryzen 5 8500G, with its two Zen 4 and four Zen 4c cores, compares to the Ryzen 5 8600G, which uses the regular Phoenix chip and has six regular Zen 4 cores. Despite parity in core count and boost clock speed, the Ryzen 5 8600G is 19% faster, likely down to the Ryzen 5 8500G's slower Zen 4c cores. With only a boost frequency of 3.7 GHz on these more petite Zen 4c cores, the Ryzen 5 8500G undoubtedly has a much lower average frequency than the 8600G while running a multi-threaded benchmark such as Passmark. It's still unclear if the Ryzen 8000G series will be a worthy successor to the Ryzen 5000G series, as the performance of its integrated GPUs is arguably more important than CPU performance. The Ryzen 5 8500G isn't expected to be particularly good with its low-end Radeon 740M graphics. Still, the Radeon 760M and Radeon 780M in the Ryzen 5 8600G and Ryzen 7 8700G, respectively, are expected to deliver at least the same amount of performance we've seen in gaming handhelds utilizing the very same iGPUs. With overclocking, the Ryzen 5 8600G and Ryzen 7 8700G may be able to push the performance of its integrated graphics even further. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Matthew Connatser is a freelancing writer for Tom's Hardware US. He writes articles about CPUs, GPUs, SSDs, and computers in general. AMD says the UCIe universal chiplet interface will create a whole ecosystem — custom multi-chiplet designs are the future Granite Rapids shows up on CPU-Z boasting 80 cores and 672MB of L3 cache AMD 170W Granite Ridge Zen 5 CPUs and 128W Strix Point APUs revealed in shipping manifest — 16-core 'Fire Range' mobile CPUs also coming By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Ash HillMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}