{
    "title": "Better Semiconductor Stock: Nvidia vs. AMD",
    "date": "1/13/2024",
    "url": "https://www.fool.com/investing/2024/01/13/better-semiconductor-stock-nvidia-vs-amd/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Semiconductor stocks have been in fine form on the market in the past year, which is evident from the 61% jump in the PHLX Semiconductor Sector index, and this terrific jump has helped two of the index's constituents -- Nvidia (NVDA 0.12%) and Advanced Micro Devices (AMD 0.50%). While shares of Nvidia are up a terrific 252% in the past year, AMD has gained 128% over the same period. It won't be surprising to see both these semiconductor stocks sustaining their red-hot run in 2024, especially considering that the semiconductor industry is expected to accelerate nicely this year. Market research firm Gartner estimates that global semiconductor revenue could increase 17% in 2024 to $624 billion. That would be a huge improvement over last year's decline of 11%, which was caused by the weakness in the smartphone and personal computer (PC) markets, as well as tepid spending in the enterprise data center market. So, which of these two chipmakers is in a better position to capitalize on the semiconductor industry's growth in 2024? And, more importantly, is Nvidia or AMD is a better bet right now from a valuation perspective following their red-hot run last year? Let's find out. While the semiconductor market was down last year, the demand for chips deployed in artificial intelligence (AI) servers for training large language models (LLMs) remained robust. Nvidia rode this gravy train and is on track to finish the ongoing fiscal 2024 with $59 billion in revenue, which will be more than double the $27 billion revenue it generated in the previous fiscal year. The good news for Nvidia investors is that the demand for AI chips is set to keep growing rapidly in the coming years. According to investment bank UBS, the market for AI graphics cards and chips could grow at an annual rate of 60% through 2027, generating an annual revenue of $165 billion. Nvidia is predicted to maintain a dominant 85% share of this booming AI chip market in 2024, according to Raymond James, which should lead to impressive growth in the company's data center revenue. Raymond James analyst Srini Pajjuri estimates that Nvidia's data center business could deliver $65 billion in revenue in fiscal 2025 (which begins next month). Nvidia has generated $29 billion in revenue from its data center business in the first three quarters of fiscal 2024, which points toward an annual revenue of $39 billion based on the quarterly run rate. According to Raymond James' forecast, Nvidia's data center revenue could increase 66% in the new fiscal year. That won't be surprising, considering the solid demand for AI chips and Nvidia's share of this market. This, however, isn't the only side of the semiconductor market from which Nvidia stands to gain this year. The demand for the company's graphics cards that are deployed in gaming PCs (personal computers) should increase as well, thanks to a turnaround in this market and the adoption of AI-enabled computers. All this indicates why Nvidia's total revenue is expected to jump a healthy 56% in fiscal 2025 to $92 billion. Even better, its earnings are expected to jump 66% in the upcoming fiscal year to $20.44 per share, giving growth-oriented investors a solid reason to keep buying this semiconductor stock. Unlike Nvidia, which gets 80% of its total revenue from selling data center chips, the majority of AMD's revenue comes from selling central processing units (CPUs), graphics cards, and semi-custom chips used in PCs and gaming consoles. For example, in the third quarter of 2023, the company got 51% of its total revenue from selling chips into these markets. This is why the recovery in the PC market is going to be a key catalyst for AMD in 2024. Canalys is forecasting an 8% increase in PC shipments this year, a nice turnaround following last year's drop of 12%. Moreover, AMD has positioned itself to capitalize on the market for AI-enabled PCs with its CPUs that are powering such computers. This should unlock a solid long-term growth opportunity for AMD as sales of AI-powered PCs are expected to post annual growth of 50% through 2030, according to Counterpoint Research. However, AMD's gaming segment could continue to weigh on the company's performance. Its revenue from this segment was down 8% in the third quarter of 2023 due to tepid sales of its semi-custom chips, which are used by Microsoft and Sony in their popular gaming consoles. Given that the sales of gaming consoles are expected to increase by just 1.6% globally in 2024, AMD's gaming business may not get a big lift in 2024. Also, Nvidia is the dominant player in gaming graphics cards with an 80% share, which means AMD isn't the best bet to capitalize on this market's growth. On the other hand, AMD's AI-focused business has yet to take off like that of Nvidia's. AMD is forecasting $2 billion in revenue from AI-related sales in 2024, which pales in comparison to Nvidia's revenue from this market. All this tells us why AMD's growth is expected to be slower than Nvidia's. Analysts forecast its revenue to increase by 16.6% in 2024 to $26.4 billion, while earnings are forecast to increase by 41%. This relatively slower growth, however, isn't the only reason why Nvidia is looking like the better semiconductor stock of the two. The points cited above make it clear that Nvidia is set to clock faster growth. But what makes Nvidia an even better bet over AMD is the valuation. As the following chart indicates, Nvidia is significantly cheaper than AMD as far as the forward and trailing earnings multiples are concerned.  NVDA PE Ratio data by YCharts As such, investors looking to benefit from the semiconductor market's growth this year and capitalize on hot trends such as AI would likely be better off buying Nvidia over AMD. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Microsoft, and Nvidia. The Motley Fool recommends Gartner. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}