{
    "title": "AMD Ryzen 9 7940HX “Dragon Range” 16-Core & 5.2 GHz CPU Spotted Within ASUS \nTUF Gaming A16 Laptop",
    "date": "1/14/2024",
    "url": "https://wccftech.com/amd-ryzen-9-7940hx-dragon-range-16-core-cpu-asus-tuf-gaming-a16-laptop/",
    "text": "AMD is now rolling out its lower-clocked Ryzen 9 7940HX & Ryzen 9 7840HX \"Dragon Range\" CPUs for high-end gaming laptops. Last year, it was reported that AMD was working on lower-clocked SKUs within its Dragon Range-HX CPU lineup. These laptop CPUs retain the high-end Zen 4 core architecture and offer up to 16 cores but come with a slightly lower clock frequency. The aim is to utilize all the Dragon Range CPU dies for gaming laptops and offer slightly more affordable designs. Starting with the specifications, ASUS has listed a new configuration of its TUF Gaming A16 laptop which is now listed with the AMD Ryzen 9 7940HX CPU. This CPU features the same 16-core and 32-thread configuration with 64 MB of L3 cache while the boost clock is now rated at 5.2 GHz. This is a -200 MHz clock speed difference versus the Ryzen 9 7945HX which has been serving the laptop HX segment. A -200 MHz clock speed isn't much of a difference and while the power/thermal limits remain the same, one thing that we can expect from the Ryzen 9 7940HX CPU laptops is slightly lower prices versus the 7945HX variants. This is good for users who want fast 16-cores within a portable system. The other option is to get Intel's 13th Gen or 14th Gen Raptor Lake-HX CPUs but those do run hot and consume more power. AMD's Zen 4 architecture is a proven design when it comes to efficiency leadership so we can expect the same to be the case from the new entrants. The AMD Ryzen 9 7940HX 16-core and the Ryzen 9 7840HX 12-core are expected to show up in more configurations down the road. For the fastest gaming performance, the Ryzen 9 7945HX3D remains the best option in AMD's diverse range of high-performance laptop CPUs. Considering the 3D V-Cache action that we have seen on the AM5 and AM4 platforms, we can expect further 3D V-Cache variants on the laptop segment later this year. News Source: HXL (@9550pro) Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}