{
    "title": "Cross-chain app Wormhole continues zero-knowledge push with AMD collab",
    "date": "2/21/2024",
    "url": "https://blockworks.co/news/wormhole-zero-knowledge-amd-collab",
    "text": "The Wormhole team hopes to minimize trust assumptions in its protocol through zero-knowledge proofs Wormhole and Adobe Stock modified by Blockworks share AMD, one of the world’s biggest semiconductor makers, is providing Wormhole with hardware and advice as the interoperability app seeks to grow its zero-knowledge infrastructure. Wormhole announced the partnership Monday in a blog post. It previously said the AMD hardware accelerators would be sourced for Wormhole contributors, and Wormhole will develop “light-client” integrations that run zk proofs with fewer resources. Wormhole is a protocol for moving assets across more than 30 different blockchains. Last fall, investors valued Wormhole at $2.5 billion in its eye-popping $225 million fundraise. Read more: Wormhole garners whopping $2.5B valuation as new unit emerges Transactions on Wormhole are approved by a mutisig where 13 of 19 signers must agree on the contents of a message before it can be sent. In a Jan. 31 blog post, Wormhole said it hoped to decentralize its verification layer with zk technology. Zk proofs allow the contents of a message to be proven true without revealing the message’s contents. In the context of Wormhole, this could take the form of verifying the amount of crypto moving from one wallet to another without revealing details about the transaction itself. However, zk proofs are highly energy intensive. In a blog post, AMD director of product Hamid Salehi said the firm’s FPGA semiconductors could help Wormhole scale its zero-knowledge infrastructure. It would do so through parallelization, whereby computing processes are carried out simultaneously instead of one by one. Omer Shlomovits, founder of the zk hardware startup Ingonyama, said in a Telegram message that the FPGA accelerator cards being added to Wormhole — U55C and U250 — are well-suited for scaling zk applications cost effectively. Read more: There’s too much trust in zero-knowledge tech “AMD [is] at the forefront of [zk] adoption in the category of hardware providers, so I am sure they will contribute immensely to [Wormhole],” Shlomovits added. AMD is among the ten largest chip companies, boasting roughly $265 billion in market capitalization. Its stock price has more than doubled in the past year, buoyed lately by its push into AI. Don’t miss the next big story – join our free daily newsletter. Newsletter Blockworks Daily  Upcoming Events Day 0x TUES, OCT. 8, 2024 Guided by the expertise of Blockworks Research Analysts team, this one day event will feature senior leaders, entrepreneurs, and developers from across the crypto industry. Attendees will have the opportunity to participate in an immersive experience to explore the latest trends, […] Permissionless III WED - FRI, OCTOBER 9 - 11, 2024 Pack your bags, anon — we’re heading west! Join us in the beautiful Salt Lake City for the third installment of Permissionless. Come for the alpha, stay for the fresh air. Permissionless III promises unforgettable panels, killer networking opportunities, and mountains […] recent research Research We believe crypto market participants overlook Hivemapper’s fundamental potential due to a poor understanding of both the niche map data market and Hivemapper’s positioning relative to incumbents. Hivemapper’s token model catalyzes both a cost and product advantage via unmatched map freshness and near real-time accuracy, which is its wedge into a market characterized by stale data and high data collection costs. Its current and potential future product suite may represent one of the strongest possibilities for PMF in crypto today. by Ryan Connor /  Breaking headlines across our core coverage categories. Finance The Fidelity Ethereum Fund, like other proposed ETH ETFs, seeks to stake a portion of its assets, according to the firm’s Wednesday registration statement DeFi The DAO first voted on enabling SAFE transfers over a year ago Education The final Bitcoin halving, where the mining reward becomes smaller than one satoshi, is expected to occur in 2140 Web3 The Department of Justice and Commodity Futures Trading Commission announced back-to-back lawsuits against KuCoin Tuesday Policy Judge Failla found that Coinbase didn’t operate as an unregistered broker in offering its wallet service Finance A fund by Laser Digital offers investors exposure to the Polygon network, while a new 21Shares ETP focuses on staking rewards from Toncoin newsletter Blockworks Daily Newsletter Get the daily newsletter that helps thousands of investors understand the markets. blockworks research Unlock crypto's most powerful research platform. Our research packs a punch and gives you actionable takeaways for each topic. Blockworks Inc. 133 W 19th St., New York, NY 10011 "
}