{
    "title": "Crucial takes aim for the sweet spot with DDR5 Pro Memory Overclocking \nEdition running at DDR5-6000",
    "date": "2/20/2024",
    "url": "https://www.tomshardware.com/pc-components/ram/crucial-takes-aim-for-the-sweet-spot-with-ddr5-pro-memory-overclocking-edition-running-at-ddr5-6000",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Crucial expands its DDR5 portfolio with the Pro Memory: Overclocking Edition up to DDR5-6000. Announced today, Crucial has launched the its new DDR5 Pro Memory: Overclocking Edition series to compete with the best RAM on the market. The new DDR5 memory kits target the latest generation of AMD and Intel consumer processors. It's been a while since Crucial released enthusiast-grade memory. Micron discontinued the Ballistix brand two years ago, and while we're not looking at a comeback, Crucial has finally put out memory kits that are not JEDEC speeds. The Crucial DDR5 Pro Memory: Overclocking Edition only comes in one flavor: DDR5-6000. The reason is that DDR5-6000 is often considered the sweet spot regarding performance and pricing for AMD and Intel processors. Crucial DDR5 Pro Memory: Overclocking Edition memory modules embrace chips from both teams. There is XMP 3.0 and AMD EXPO support, so you won't have to look for specific SKUs for specific processors. Support starts at the 12th Generation Alder Lake for Intel and Ryzen 7000 for AMD. Crucial DDR5 Pro Memory: Overclocking Edition memory kits enable one-click overclocking on both platforms. Crucial DDR5 Pro Memory: Overclocking Edition memory modules come in 16GB and 24GB capacities. However, only the former is readily available, as the latter won't hit the retail market until late 2024. You can choose between a single module or a kit. There are two options regarding kit capacity: 32GB (2x16GB) or 48GB (2x24GB). Crucial bin the DDR5-6000 memory modules for 36-38-38-80 at 1.35V. The memory timings are more or less in the middle ground of the performance spectrum. With high-performance DDR5-6000 memory kits hitting CL (CAS latency) of 28 or 30, the Crucial DDR5 Pro Memory: Overclocking Edition's timings are hardly impressive on paper.  Marketed toward overclocking, it'll be interesting to see if Micron has developed a new DDR5 integrated circuit (IC). Micron A-die ICs weren't very popular among overclockers as you couldn't overclock the ICs very far, even when pumping loads of voltage into the memory modules. SK hynix's A-die ICs are the current reigning king for pushing high frequencies. Crucial DDR5 Pro Memory: Overclocking Edition memory kits are available as of today. As usual, Crucial backs the memory kits with a limited lifetime warranty. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Zhiye Liu is a Freelance News Writer at Tom’s Hardware US. Although he loves everything that’s hardware, he has a soft spot for CPUs, GPUs, and RAM. SK hynix reportedly planning for a $4 billion chip packaging facility in Indiana — for HBM and other exotic memory types Micron shows massive 256GB DDR5-8800 memory sticks — High-capacity double-height 20-watt MCRDIMM modules come in different flavors PlayStation 5 Pro Enhanced requirements allegedly leaked — upscaled 4K at constant 60 FPS with ray tracing is the new target By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Mark TysonMarch 29, 2024 By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}