{
    "title": "DirectSR is not replacing existing upscalers, it's an API for multi-vendor \nsuper resolution",
    "date": "2/29/2024",
    "url": "https://videocardz.com/newz/directsr-is-not-replacing-existing-upscalers-its-an-api-for-multi-vendor-super-resolution",
    "text": "Microsoft is slowly lifting the lid on the upcoming Super Resolution feature for DirectX.  Perhaps to avoid further confusion before the grand reveal of DirectSR, Microsoft has made clear in a new blog post that DirectSR is not a new super resolution technology. This is an API for game developers that will streamline integration of existing and future super resolution technologies seamlessly. The DirectSR was developed with the help of major GPU vendors like NVIDIA and AMD, who will also be presenting the technology in March at GDC 2024. It looks like these companies have found the common ground on what is actually required for temporal upscaling to work in games. In most cases that involve motion vectors, depth and color buffers, reaction marks and exposure. Those variables (in case of FSR) have to be shared between frames for upscaling to work efficiently. It is assumed that other temporal technologies have similar requirements, and DIrectSR could potentially add more variable for future upscaling techniques. Introducing DirectSR We’re thrilled to announce DirectSR, our new API designed in partnership with GPU hardware vendors to enable seamless integration of Super Resolution (SR) into the next generation of games. Super Resolution is a cutting-edge technique that increases the resolution and visual quality in games. DirectSR is the missing link developers have been waiting for when approaching SR integration, providing a smoother, more efficient experience that scales across hardware. This API enables multi-vendor SR through a common set of inputs and outputs, allowing a single code path to activate a variety of solutions including NVIDIA DLSS Super Resolution, AMD FidelityFX™ Super Resolution, and Intel XeSS. DirectSR will be available soon in the Agility SDK as a public preview, which will enable developers to test it out and provide feedback. Don’t miss our DirectX State of the Union at GDC to catch a sneak peek at how DirectSR can be used with your games! Interestingly, this is not the first attempt to make temporal upscaling easier to implement. NVIDIA already attempted to provide its Streamline framework that would allow game developers to add competing upscalers easily. However, it never really made much of a difference for the most popular titles, as those technologies were integrated closely in collaboration with each game developer. The most popular upscaling technologies include: NVIDIA DLSS2/3 (closed source and hardware locked to GeForce RTX GPUs), AMD FSR2/3 (which are open source) and Intel XeSS (which was never released as open source despite promises from Intel). There is also TSR in Unreal Engine that may also be supported by DirectSR. Source: Microsoft We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}