{
    "title": "AMD Ryzen 7 7800X3D vs Ryzen 9 7950X3D: Is 7800X3D better than 7950X3D?",
    "date": "2/25/2024",
    "url": "https://www.hardwaretimes.com/amd-ryzen-7-7800x3d-vs-ryzen-9-7950x3d-is-the-7800x3d-better/",
    "text": "The Ryzen 7000X3D processors are the best gaming processors on the market. With the Ryzen 7 7800X3D starting at <$400, the V-Cache chips are faster, affordable, and more power-efficient than their Intel rivals. The 7800X3D has been AMD’s bestselling CPU for a year now, with the Ryzen 9 7950X3D also earning its place. The 7900X3D is the middle child, offering a bit of this and a bit of that but enough of neither. The Ryzen 7 7800X3D and Ryzen 9 7950X3D are similar except for one thing. In addition to the Zen 4 3D V-Cache die (rainbow marking) on the former, the latter features a second Zen 4 CCD (without the stacked cache). You’d think that’d make it the better CPU, but that’s not always the case. Table of Contents In gaming workloads, the CPU paints the outline of a scene, leaving instructions for the GPU about the various objects->meshes->polygons that need to be rendered. The GPU does the actual rendering, following the outline or blueprint left by the CPU. In general, the object detail is altered by increasing/decreasing the polygon or pixel count. The polygons affect the actual appearance of the object, making it more or less detailed. The instructions for that are left by the CPU in the outline (known as draw calls). In-game, this is controlled by the terrain/mesh/geometry settings in the graphics menu. The scene geometry has a direct impact on CPU performance. On the other hand, the resolution or pixel count is GPU-controlled as it affects how many samples are used to represent the 3D scene in rasterized form. Therefore to gauge CPU performance, we limit the resolution to 720p (to remove GPU bottlenecks) and turn up the graphics settings to “Ultra.” A Plague Tale performs similarly on the Ryzen 7 7800X3D and the Ryzen 9 7950X3D. The former delivers slightly higher lows, but the difference is too trivial to make a notable impact on the resultant performance. This one’s a tie. Assassins Creed: Valhalla sees the Ryzen 9 7950X3D edge past the Ryzen 7 7800X3D, maintaining a slim but consistent lead over its octa-core sibling. The frametime graphs look the same on the two sides. Cyberpunk 2077 is the ray-tracing heavyweight of our benchmark suite. At 720p Ultra (without ray tracing), the Ryzen 9 7950X3D is slightly faster than the 7800X3D. Barring a spiky patch near the end, the frame time graphs of the two CPUs are very similar. Dying Light 2 loves the extra L3 cache, granting the 7950X3D a lead of nearly 50% over the 7950X. In rasterization, it’s over 20% faster than the 7800X3D while producing worse lows. The Ryzen 7 7800X3D is the better performer overall. F1 2022 exhibits similar behavior, conferring the Ryzen 7 7800X3D with a lead of ~10% over the Ryzen 9 7950X3D. The frametime graph of the octa-core X3D chip is also cleaner than its 16-core sibling. Ghostwire: Tokyo runs faster on the Ryzen 9 7950X3D, granting it a slim but distinguishable lead over the 7800X3D. The frametime graphs look similar, but the 7950X3D produces a relatively cleaner output. Hitman 3 and the Ryzen 7 7800X3D are the best of friends. The octa-core 7800X3D beats the 7950X3D by a massive 60-65% deficit in rasterization. The frametime graph of the former is also much cleaner, indicating a smoother experience. Shadow of the Tomb Raider performs more gracefully on the Ryzen 7 7800X3D. The frametimes, too are smoother on the octa-core X3D CPU compared to the 7950X3D. The Callisto Protocol is the exact opposite. The Ryzen 9 7950X3D is a smidge faster than the 7800X3D, with higher lows and a cleaner frametime graph. Tiny Tina’s Wonderlands prefers the Ryzen 7 7800X3D over the 7950X3D. The 7800X3D is ~12% faster than its Ryzen 9 sibling in this game. In standard rasterization-based gaming workloads, the Ryzen 7 7800X3D is slightly faster than the Ryzen 9 7950X3D. On average, the octa-core CPU holds a 2% lead over the 16-core X3D flagship through our 10-game benchmark suite. Ray tracing benchmarks on the next page… "
}