{
    "title": null,
    "date": "2/5/2024",
    "url": "https://www.itweb.co.za/article/absolute-hosting-announces-sas-first-nvme-cpanel-hosting-powered-by-amd-epyc-genoa-servers/j5alr7QANxr7pYQk",
    "text": "Absolute Hosting is proud to announce it has launched South Africa’s first NVMe-powered cPanel web hosting services. These new cPanel Web Hosting packages are now available on the Absolute Hosting website and offer considerable performance gains in comparison to legacy SSD cPanel hosting. There are three reasons for this – the superior NVMe SSDs, the outstanding AMD EPYC Genoa 9174F high-frequency CPUs, and the intuitive cPanel interface, the company says. NVMe hard drives operate at a substantially faster rate (up to 5 000 MB per second) than legacy SSDs (up to 550 MB per second) and traditional hard drives. This is thanks to the parallelism of modern NAND flash memory, which has exponentially increased what is possible in terms of read and write times. As a website owner, the end result is that your site responds faster to queries – delivering a much better experience for the customers and clients who visit your website. The NVMe SSDs are supported by high-frequency AMD EPYC CPUs, which boast a base clock speed of 4.1Ghz and a burst speed of up to 4.4Ghz. This allows each hosting server to process and compute requests substantially faster than other processors. In combination with the NVMe SSDs, your users benefit from unprecedented website performance speeds. In simple terms, your website will run faster and without lag. The cPanel hosting interface is the industry leader in the management of PHP-driven sites like WordPress, Joomla and Drupal. Through these packages, you will get access to the intuitive web-based cPanel GUI for seamless website, e-mail and DNS management. Absolute Hosting is making history by offering this unrivalled combination of technologies and management systems. It is the industry’s first-to-market in this regard, which is why it is known as a leading South African provider of premium web hosting solutions. Share Editorial contacts ITWeb proudly displays the “FAIR” stamp of the Press Council of South Africa, indicating our commitment to adhere to the Code of Ethics for Print and online media which prescribes that our reportage is truthful, accurate and fair. Should you wish to lodge a complaint about our news coverage, please lodge a complaint on the Press Council’s website, www.presscouncil.org.za or email the complaint to enquiries@ombudsman.org.za. Contact the Press Council on 011 4843612. "
}