{
    "title": null,
    "date": "2/9/2024",
    "url": "https://www.techradar.com/computing/gpu/looking-to-buy-a-mid-range-gpu-thats-good-timing-as-price-cuts-from-amd-and-nvidia-are-becoming-increasingly-ruthless",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Nvidia RTX 4070 Ti is now at an all-time low price – but AMD still has it beat Nvidia’s RTX 4070 Ti is the latest graphics card to witness a price cut among a flurry of discounting activity of late in the mid-range to higher-tier GPU space. VideoCardz was eagle-eyed enough to catch that Newegg in the US has now reduced the price of a couple of MSI versions of the RTX 4070 Ti, one of the older GPUs in the Lovelace line-up – and rumored to be discontinued now that the 4070 Ti Super has been launched (last month). The real bargain here is the MSI Ventus 2X RTX 4070 Ti which is priced at $749.99 but has a promo code at checkout to knock off $50, meaning the actual price you’ll pay is $699.99. This marks the first time the 4070 Ti has fallen under the $700 mark (just – that’s around £550, AU$1,070) in the US. This is marked as a limited offer, so if stock shifts off the shelves at anything like a rate of knots, it may not be active for that long. To illustrate the point, VideoCardz also flags up the MSI Ventus 2X White edition (the same graphics card, but colored white as you might guess) at $704.99, with a $25 off checkout code, but it’s actually $729.99 now (around £580, AU$1,120), having just been notched up a bit evidently. All pricing is correct at the time of writing (as it was when VideoCardz published its article of course), and so you might find different price tags by the time you read this. We’ve previously talked about the great GPU price war of 2024 beginning, and while we’re not there yet, this is yet another piece of evidence – among a good number of recent discounts, as mentioned – that the market is definitely becoming more competitive. At least in this mid-to-upper-range space, anyway, which is clearly great news for consumers looking for a powerful graphics card that doesn’t hit their wallet too hard (but might still wind it somewhat, let’s face it). Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. All this has been sparked off by Nvidia launching new RTX Super graphics cards last month, and as we already touched on, one of those – the middle member of the fresh introductions – was the RTX 4070 Ti Super. Rumor has it that this replaces the RTX 4070 Ti entirely, hence stock is being cleared as theoretically this GPU is discontinued. Given that, and MSI suddenly coming in with much more competitive pricing – as noted, this is the lowest price ever seen in the US, $20 less than the previous drops we reported on only earlier this week – it’s not a stretch to imagine other models of RTX 4070 Ti coming down in price, following in MSI’s footsteps. After all, that 4070 Ti inventory needs shifting. Indeed, Nvidia’s board making partners and the retailers they supply may need to do better than this with the RTX 4070 Ti, as the cheapest 7900 XT is the same price (at Newegg) as this new low for the 4070 Ti. And we’d clearly give the nod to the AMD GPU for pure gaming performance (ray tracing aside, mind you, where Nvidia obviously has the advantage – and with DLSS 3, too). Don’t forget we’ve been seeing plenty of movement with AMD’s mid-range RDNA 3 GPUs, with price cuts on the RX 7800 XT before both 7900 XT and 7700 XT models were reduced. It’s certainly an interesting time when it comes to jostling for position on the best GPU rankings and grabbing the attention of consumers. Darren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013). Samsung officially reveals GDDR7 memory for GPUs, which is great news for gamers Fresh leak is the first we’ve heard about Intel Battlemage in some time – complete with a suggestion that 2nd-gen GPUs will be worryingly late Ricoh GR III gets a dreamy successor, but it's not the GR IV I was hoping for By Kristina TerechMarch 28, 2024 By Lewis MaddisonMarch 28, 2024 By Becky ScarrottMarch 28, 2024 By David NieldMarch 28, 2024 By Craig HaleMarch 28, 2024 By James RogersonMarch 28, 2024 By Dashiell WoodMarch 28, 2024 By Darren AllanMarch 28, 2024 By Rhys WoodMarch 28, 2024 By Tom PowerMarch 28, 2024 By Pieter DanhieuxMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}