{
    "title": "AMD stock has risen to $168. But here's where the share price could be in 5 \nyears",
    "date": "2/1/2024",
    "url": "https://www.fool.co.uk/2024/02/01/amd-stock-has-risen-to-168-but-heres-where-the-share-price-could-be-in-5-years/",
    "text": "AMD appears to have huge potential given its exposure to artificial intelligence. Here, Edward Sheldon looks at where the stock could be in 2029. The content of this article was relevant at the time of publishing. Circumstances change continuously and caution should therefore be exercised when relying upon any content contained within this article. Image source: Getty Images When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More. Advanced Micro Devices (NASDAQ: AMD) stock or ‘AMD’ has been a phenomenal investment recently. Over the last five years, the share price has risen about 600%. Here, I’m going to look at where the chip stock could be in another five years. Let’s crunch some numbers. Before I calculate a future stock price, it’s worth briefly discussing what Advanced Micro Devices does. It’s a semiconductor company that designs chips for a range of industries including cloud computing, data centres, video gaming, electric vehicles, and artificial intelligence (AI). Recently it has been getting attention due to its AI exposure. It has been developing high-powered chips (the MI300X) in an effort to go head to head with AI chip powerhouse Nvidia. It’s worth pointing out, however, that there are key differences between the firms. Nvidia is the dominant player in the high-end chip market. And currently, it has an 80% market share in the AI chip space. By contrast, Advanced Micro Devices is a major player in the mid-range and budget chip markets. Many of its products are used for regular computing. So, even if it was to see strong growth from its AI chips in the years ahead, it may not grow at the same pace as Nvidia. To predict its future price, I’m going to use a sales-multiple approach. This involves trying to predict what the company’s sales will be in the future and then applying a multiple to get a market cap and share price. This approach has its flaws. For example, it’s very simplistic in nature and one needs to make a lot of assumptions. But it’s an easy-to-understand approach that could give us a rough indication of where the stock could get to. For 2024 and 2025, Advanced Micro Devices sales are forecast to come in at $26bn and $32.2bn (let’s assume these forecasts are accurate). These figures would represent annual growth of 15% and 24%. I don’t know if this kind of growth is sustainable all the way out to 2029. After all, the company operates in a cyclical industry. But let’s say that the company was able to generate 15% growth per year between 2026 and 2029. That would take us to revenue of $56.3bn for 2029. Now, the forward-looking price-to-sales ratio is about 10.4 today. But that’s at the higher end of the spectrum (in 2022 it fell to just three). So, let’s apply a sales multiple of eight here. Multiplying $56.3bn by eight gives us a market cap of approximately $450bn, which is around 66% higher than today’s share price. That translates to a share price of $279. I want to stress that there are many variables here and my forecasts could be way off the mark. For example, it could average 10% revenue growth over the next five years. Meanwhile, in five years’ time, it could be trading at a price-to-sales ratio of five. All things considered, though, I’m pretty bullish on the stock taking a long-term view. Having said that, I’m not a buyer right now. In my view, the stock has got a little ahead of itself recently. I wouldn’t be surprised to see a decent pullback in the near future. If we see one, I’ll be buying.  Should you invest, the value of your investment may rise or fall and your capital is at risk. Before investing, your individual circumstances should be assessed. Consider taking independent financial advice. Edward Sheldon has positions in Nvidia. The Motley Fool UK has recommended Nvidia. Views expressed on the companies mentioned in this article are those of the writer and therefore may differ from the official recommendations we make in our subscription services such as Share Advisor, Hidden Winners and Pro. Here at The Motley Fool we believe that considering a diverse range of insights makes us better investors. 31 March, 2024 |\n        Ben McPoland Ben McPoland highlights one US growth stock whose potential over the long term may well be underestimated by the market… Read more » 26 March, 2024 |\n        Ben McPoland Shares of Nike have lagged the market over the last five years. Is it time for me to buy more… Read more » 25 March, 2024 |\n        Ben McPoland Might investing in NIO stock at its current price make this Fool a fortune? Or are shares in this Chinese… Read more » 21 March, 2024 |\n        Oliver Rodzianko With a stable balance sheet, a great track record, and strong earnings estimates, can this growth stock climb up higher… Read more » 20 March, 2024 |\n        Charlie Keough Nvidia stock has soared, but is now a smart time for this Fool to top up? He explores the issue… Read more » 19 March, 2024 |\n        Ben McPoland This investor considers whether buying one increasingly popular AI growth stock today could be like investing in Nvidia back in… Read more » 19 March, 2024 |\n        Mark David Hartley With Tesla rapidly losing ground against Chinese competitors, I'm wondering if the sinking stock can recover. Will an April price… Read more » 19 March, 2024 |\n        Oliver Rodzianko Oliver Rodzianko has been looking for companies with exceptional returns for his Stocks and Shares ISA. Here's one he's considering. Read more » View All When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. Tax treatment depends on your individual circumstances and may be subject to future change. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. Tax Year Ends 5 April 2024 Shelter up to £20,000 from the Taxman this tax year in a Stocks and Shares ISA, and you’ll pay no UK income tax or capital gains on potential profits! We’ve made it easy to compare Stocks and Shares ISAs, so you can find an account that’s a great fit for your needs. Whether you’re shopping for a trading account with all the whistles and bells, or seeking a simple, ready-made portfolio solution, we’ve got it covered. Investments involve various risks, and you may get back less than you put in. Tax benefits depend on individual circumstances and tax rules, which could change. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. Read more about us >  We have taken reasonable steps to ensure that any information provided by The Motley Fool Ltd, is accurate at the time of publishing. Any opinions expressed are the opinions of the authors only. The content provided has not taken into account the particular circumstances of any specific individual or group of individuals and does not constitute personal advice or a personal recommendation. No content should be relied upon as constituting personal advice or a personal recommendation, when making your decisions. If you require any personal advice or recommendations, please speak to an independent qualified financial adviser. No liability is accepted by the author, The Motley Fool Ltd or Richdale Brokers and Financial Services Ltd for any loss or detriment experienced by any individual from any decision, whether consequent to, or in any way related to the content provided by The Motley Fool Ltd; the provision of which is an unregulated activity. The value of stocks, shares and any dividend income may fall as well as rise and is not guaranteed, so you may get back less than you invested. You should not invest any money you cannot afford to lose, and you should not rely on any dividend income to meet your living expenses. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, administrative costs, withholding taxes and different accounting and reporting standards. They may have other tax implications, and may not provide the same, or any, regulatory protection. Exchange rate charges may adversely affect the value of shares in sterling terms, and you could lose money in sterling even if the stock price rises in the currency of origin. Any performance statistics that do not adjust for exchange rate changes are likely to result in an inaccurate portrayal of real returns for sterling-based investors. Fool and The Motley Fool are both trading names of The Motley Fool Ltd. The Motley Fool Ltd is an appointed representative of Richdale Brokers & Financial Services Ltd who are authorised and regulated by the Financial Conduct Authority (FCA) (FRN: 422737). We publish information, opinion and commentary about consumer credit products, loans, mortgages, insurance, savings and investment products and services, including those of our affiliate partners. The Motley Fool Ltd. Registered Office: 5 New Street Square, London EC4A 3TW. | Registered in England & Wales. Company No: 3736872. VAT Number: 188035783. © 1998 – 2024 The Motley Fool. All rights reserved. The Motley Fool, Fool, and the Fool logo are registered trademarks of The Motley Fool Holdings Inc. "
}