{
    "title": "ASUS TUF Gaming A15 (2024) - AMD Ryzen 8000 series processor, NVIDIA \nGeForce RTX 40-Series GPU and more ...",
    "date": "2/8/2024",
    "url": "https://technave.com/gadget/ASUS-TUF-Gaming-A15-2024-AMD-Ryzen-8000-series-processor-NVIDIA-GeForce-RTX-40-Series-GPU-and-more-from-RM6499-37495.html",
    "text": " Previously, we mentioned the Malaysia release for the ASUS ROG Zephyrus G14 (2024). But that is not the end of it, because the ASUS TUF Gaming A15 (2024) was released alongside this model. So, what should you know about it? In case you didn’t know, this variant features up to an AMD Ryzen 8000 series processor alongside DDR5-5600MHz RAM and an NVIDIA GeForce RTX 40-Series Laptop GPU with NVIDIA Advanced Optimus. Interestingly, this model is upgradable. It sports two memory and storage slots available for expansion. As you can expect from a TUF model, this is a very durable laptop - design and battery-wise. In addition, it runs a 16:9 display, 2.5K resolution and up to 165Hz refresh rate. Thanks to the GSYNC support, minimises stuttering and eliminates screen tearing, while the IPS-level panel ensures accurate, true-to-life colours. Additionally, it offers a Dolby Atmos speaker and Hi-Res Audio for a more immersive gaming experience.  Like the ROG variant, the TUF Gaming A15 model also comes in two GPU options. The first setup runs an RTX 4060 GPU-powered GPU with 16GB RAM, 1TB PCIe 4.0 storage and an FHD 144Hz Panel. This variant should cost you RM6499. Meanwhile, the other setup sports an RTX 4070 GPU-powered GPU with 16GB RAM and 1TB PCIe 4.0 storage. If you choose this setup with an FHD 144Hz panel, it will cost you RM6799. Lastly, the same setup with an FHD 165Hz refresh rate will cost you RM6999.  What are your thoughts about this news? Stay tuned for more news and updates like this at TechNave! Rate & Review now via the TechNave APP and win yourself a branded new smartphone weekly. Download the TechNave App Now: http://onelink.to/technave\n\n Follow the latest Tech News and Gadget Reviews\n Compare Gadget Specs\n Get the best Prices from Nearby Retail stores\n Win FREE smartphones from the weekly Giveaway.\n\nDonwload now from: Donwload now from:  Anyone who has used Samsung Notes before would say that it's just fine for shopping lists, doing lecture notes or keeping track of a meeting but traditionally, it's not often used for serious document creation. Recently, Samsung introduced their new Galaxy AI with the Samsung Galaxy S24 series of devices and AI-driven functions like Note assist are taking Samsung Notes to another level. How exactly is it doing this? Read on to find out how you can not only create professional content with Samsung Notes, but also do it quickly and easily with the new Galaxy AI Note assist. Xiaomi recently launched the Xiaomi 14 series in Malaysia, including the latest flagship model - the Xiaomi 14 Ultra. It has a set of four rear cameras, delivering a diverse toolkit to capture every moment with precision and clarity. Here's a quick look at what you can expect! Home\n| Mobile Phone\n| iPad & Tablets\n| Cameras & Camcorders\n| News\n| Reviews\ncopyright © 2023 TechNave.com.   |   About Us  |   Contact Us  |   Advertise Here  |   Privacy Policy  |  Mobile Site "
}