{
    "title": null,
    "date": "2/14/2024",
    "url": "https://seekingalpha.com/article/4670076-amd-i-am-not-ready-to-pay-premium-for-the-gpu-laggard",
    "text": "Bloomberg/Bloomberg via Getty Images  Bloomberg/Bloomberg via Getty Images Advanced Micro Devices (NASDAQ:AMD) stock has enjoyed massive rallies since the company is widely perceived as one of the primary beneficiaries of the artificial intelligence (\"AI\") revolution. According to my valuation analysis, the massive rally of the last twelve months pushed the stock above its fair price. While I could have opted to pay a significant premium for an undisputed leader in the AI chipmaking market, like NVIDIA (NVDA), I am of the opinion that a company trailing behind, such as AMD, does not merit such a premium valuation. Therefore, I believe that AMD is a \"Sell\" at the current share price. According to the latest 10-K report, AMD is a global semiconductor company primarily offering server microprocessors (\"CPUs\"), graphic processing units (\"GPUs\"), accelerated processing units (\"APUs\"), data processing units (\"DPUs\"), AI accelerators and adaptive system-on-chip (\"SoC\") products for data centers. The company also provides chipsets for desktops, notebooks, personal computers (\"PCs\"), and embedded products. AMD emerged as a key beneficiary of the rapidly accelerating digital revolution, driving the stock to appreciate by an impressive 4.5 thousand percent over the past decade, yielding an outstanding annualized return of 45% for investors. While it's tempting to credit AMD's success solely to favorable shifts in the microenvironment, it would be remiss not to highlight the exceptional leadership of Dr. Lisa Su. Appointed as CEO of AMD a decade ago, Dr. Su's visionary guidance ushered in a new era of prosperity for the company. Data by YCharts Under Lisa Su's leadership, AMD experienced remarkable growth, with revenue compounding at 20% and operating margins soaring. However, in recent years, the company faced challenges such as revenue pullback and a sharp decline in operating margin, stemming from unfavorable macroeconomic factors like high inflation, swift monetary policy tightening in developed nations, and significant geopolitical disruptions. Although these challenges may seem transient, it's crucial to acknowledge that despite its notable growth over the past decade, the business remains considerably vulnerable to macroenvironmental shifts, indicating a lack of resilience. Furthermore, the CPU and GPU industries are massively competitive. AMD competes with players like NVIDIA and Intel (INTC), which are much larger in terms of revenue. So far, AMD, under Lisa Su's leadership, has been very successful in gaining market share in CPU at Intel's cost, but in a rapidly evolving environment when cutting-edge products' lifecycles are short, there is no guarantee that AMD will be able to consistently sustain its market share while competing with giants like Intel and NVIDIA. In the table below, you can see that in absolute terms, AMD's gross profit is multiple times lower compared to its primary competitors, meaning it has fewer resources to reinvest in business. SA SA I believe there's significant optimism surrounding AMD, particularly driven by the burgeoning artificial intelligence (\"AI\") industry. However, as investors, it's essential to maintain a level-headed approach and delve deeper into the technological landscape. Historically, AMD has demonstrated strength in CPUs rather than GPUs. Yet, for accelerating computing in AI development, GPUs offer greater capacity and are thus better suited. Unfortunately, in the realm of GPUs, AMD significantly lags behind its competitor, NVDA. Consequently, the company's exposure to the burgeoning AI trend appears to be severely limited, and investors should be aware. tomshardware.com tomshardware.com The extent to which AMD lags behind NVDA is evident in the most recent financial performance. While NVDA is projected by consensus to record a staggering 119% revenue growth for the fiscal year ending in January 2024, AMD demonstrated a revenue decline in such a massive year for semiconductor stocks. The company's revenue in the PC segment dropped massively, and the growth in the Data Center segment, which is supposed to absorb AI tailwinds, was very far from offsetting the loss. AMD's 10-K report FY2023 AMD's 10-K report FY2023 Many AMD bulls might say that the company has a more diverse portfolio of offerings and end markets in comparison with NVDA, but it seems that this diversification approach does not work that well for shareholders. While NVDA consensus estimates project a 57% revenue growth for the year, which will end in January 2025 to reach almost $93 billion, AMD is expected to achieve only half of this revenue within the next five years. SA SA Some might argue that the significant disparity in expected revenue growth is already factored into the market capitalization of both companies, given that NVIDIA's market cap is currently approximately six times higher than AMD's. However, as a long-term investor, I prioritize investing in the underlying business rather than merely the stock as an instrument. In this regard, I favor investing in an undisputed market leader over a laggard struggling to drive revenue growth, especially during a year marked by massive AI enthusiasm. Lib Quotes Lib Quotes AMD showed a strong start in 2024 with a 16.6% stock price increase. The momentum across different timeframes is robust, as the stock price has doubled over the last 12 months and increased by 50% over the last quarter. The stock is currently very close to all-time highs. The current market cap is $278 billion. SA SA To check whether the current share price is attractive, I will conduct the discounted cash flow (\"DCF\") analysis with a 9.8% discount rate. As I usually do, I incorporate consensus revenue estimates for the two upcoming fiscal years. For the years after FY 2025, I expect a steady 300 basis points yearly revenue growth deceleration. I use a 9.72% TTM levered FCF margin with the expected 100 basis points yearly expansion. Due to all the AI industry tailwinds, I give AMD a very optimistic 8% constant growth rate for the terminal value (\"TV\") calculation. Currently, there are about 1.6 billion AMD shares outstanding. Calculated by the author Calculated by the author My DCF analysis gives AMD's fair share price at $162, which is around 6% lower than the current market levels. Therefore, I cannot conclude that the stock is attractively valued. If AMD was the undisputable leader in the GPU market, I would say that the premium is well-deserved, but paying above the fair price for the company, which substantially lags in terms of market share, does not look sound to me. Moreover, it is crucial to highlight that the DCF calculation significantly depends on the terminal value amount, which represents around 90% of the fair share price. That said, decreasing the constant growth rate assumption by a mere 50 basis points decreases AMD's fair share price to $128, which signals a massive 25% overvaluation. Calculated by the author Calculated by the author While I currently hold a bearish outlook on AMD at its present stock price, there are several mitigating factors that could potentially prove me wrong. Firstly, we are currently amidst a period of significant market optimism surrounding the semiconductor industry, largely driven by the rapid expansion of AI technology. As a prominent player in this sector, AMD stands to benefit from this positive sentiment. For instance, the upcoming earnings report from NVDA at the end of February could be a substantial catalyst for all major semiconductor companies, potentially leading to a double-digit increase in AMD's share price within a short timeframe. Secondly, AMD consistently unveils new chips and accelerators, and the market's reaction to these offerings could significantly influence the stock price in the short term. There exists a possibility that AMD might introduce a groundbreaking product that garners widespread acclaim, sparking a notable rally in its stock price. Lastly, the power of momentum cannot be underestimated. With the stock having surged approximately 50% over the last quarter, a significant portion of this rally may have been driven by the fear of missing out (\"FOMO\") effect. In such circumstances, a sell-off in the stock might only occur in the event of a major adverse development for the broader market, such as an unexpectedly weak quarterly report. Given that the next earnings release is still some time away, the momentum behind the stock could persist for the next few months. While AMD has exposure to the booming AI industry, I think that the market overestimates the extent of this exposure. AMD is not a trendsetter in the industry, and its GPU market share is multiple times lower compared to the industry leader. Therefore, I consider the current 6% premium to the stock price as a good selling opportunity and assign AMD a \"Sell\" rating. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}