{
    "title": "AMD CEO, Lisa Su, To Host Opening Keynote of Computex 2024 On 3rd June, \nNext-Gen Ryzen CPUs & More Expected",
    "date": "2/22/2024",
    "url": "https://wccftech.com/amd-ceo-lisa-su-opening-keynote-computex-2024-3rd-june-next-gen-ryzen-cpus-more/",
    "text": "AMD's CEO, Dr. Lisa Su, will deliver the opening keynote of Computex 2024 where we'll get to hear about the upcoming technologies for PC & AI segments. Last year's opening keynote for Computex was presented by NVIDIA's CEO, Jensen Huang, and this year, the opening keynote will be presented by AMD's CEO, Dr. Lisa Su. The central theme of this year's Computex is \"Connecting AI\" which means that just like last year, AI is going to take center stage. The announcement comes from TAITRA, the event organization behind the world's largest tech expo, Computex, which takes place in Taipei, Taiwan, annually. The world of tech has changed a lot over the past few years with everyone jumping on board the AI PC and AI bandwagon and this year, we will see even more emphasis on the AI segment but besides that, AMD will also be forwarding its product portfolio with new and supercharged offerings in the high-performance computing segment. COMPUTEX 2024, a global leading technology exhibition, featuring AIoT applications, generative AI & and startup ecosystems, will take place from June 4th to 7th at the Taipei Nangang Exhibition Center Halls 1 and 2. Themed \" Connecting AI,” this year's exhibition focuses on the latest global AI technologies and industry trends. The show will attract 1,500 international and local exhibitors using 4,500 booths. The Opening Keynote will be delivered by Dr. Lisa Su, Chair and CEO of AMD, on the morning of June 3rd to set the stage for the event. The keynote sessions at COMPUTEX feature top industry leaders. This year, Dr. Lisa Su, Chair and CEO of AMD is invited to deliver the Opening Keynote. She was recognized by the IEEE with its highest semiconductor honor, the Robert N. Noyce Medal, and led the transformation of AMD into the high-performance and adaptive computing leader. Dr.Su will highlight the next generation of AMD products enabling new experiences and breakthrough AI capabilities from the cloud to the edge, PCs, and intelligent end devices. In addition, more keynote speakers from Qualcomm, Intel, MediaTek, NXP, Supermicro, and Delta, will also take the stage to share their visions for the future of the AI ecosystem collectively. Stay tuned for further announcements. Computex Taipei (Taitra) One of the biggest surprises and announcements of this year's Computex 2024 from AMD might be its next-generation Ryzen family based on the Zen 5 core architecture, codenamed Granite Ridge. AMD is seemingly prepping its next-gen chips for production and with a launch scheduled for the 2nd half of 2024, we could expect an unveil during Computex since AMD did the same during Computex 2022 where the Ryzen 7000 \"Zen 4\" CPUs and the subsequent AM5 platforms were revealed to the public. AMD has also finished completing its RDNA 3 GPU lineup so we might get an update on the new RDNA 4 lineup as well. The next-gen Radeon RX series is expected to enter the mainstream and high-end segment with a focus on better perf/$ and architectural-side improvements before the move to RDNA 5. AMD didn't reveal a lot at Computex 2023 besides demos of its Ryzen AI XDNA NPUs but this year, they'll make up for it with a proper product unveiling. We'll be at the Computex show floor like every year so expect live updates from our side when the event kicks off in June '24. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}