{
    "title": "Think You Missed Out on Nvidia? 1 Artificial Intelligence (AI) Stock to Buy \nBefore It Jumps.",
    "date": "2/16/2024",
    "url": "https://www.fool.com/investing/2024/02/16/missed-out-on-nvidia-1-artificial-intelligence-ai/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More There is no doubt that Nvidia (NVDA 0.12%) is a top artificial intelligence (AI) stock you can buy right now, considering its stranglehold over the market for AI semiconductors.Nvidia commands a whopping 92% share of the AI graphics processing unit (GPU) market thanks to the early move it made in this space by supplying chips to OpenAI for training the hugely popular chatbot ChatGPT. What's more, Nvidia has been taking steps to ensure that it remains the apex player in the AI chip market with smart moves such as doubling down on its pace of innovation and there are reports that it could be entering the lucrative market for custom AI chips. These are some of the reasons analysts are predicting Nvidia's earnings to increase at a compound annual growth rate (CAGR) of a whopping 102% over the next five years. Given that the AI chip market is expected to clock a CAGR of 37.5% through 2029 and generate $147 billion in annual revenue, it is not surprising to see that analysts expect Nvidia to grow at a breathtaking pace. This tremendous growth could help Nvidia justify its expensive sales multiple of 40. However, there is another chipmaker -- Advanced Micro Devices (AMD 0.50%) -- that's trading at a relatively cheaper 12.3 times sales right now that you might want to take a closer look at, as it could soar big time in the coming year by giving competition to Nvidia. AMD launched its MI300 Instinct family of data center AI accelerators in December to take on Nvidia, and the good news is that these chips have been gaining solid traction among customers. AMD expects to generate at least $3.5 billion in revenue from sales of its AI chips in 2024, up from its original forecast of $2 billion. However, Citi analyst Christopher Danely (as reported by Tom's Hardware) believes that AMD is underestimating its AI revenue potential. Danely predicts that AMD could sell $5 billion worth of AI chips in 2024, a number that's expected to jump to $8 billion next year. There are a couple of reasons for this optimism. First, CEO Lisa Su remarked on the company's January earnings conference call with analysts that AMD has \"additional capacity to support upside demand.\" For comparison, customers reportedly need to wait for as long as 52 weeks to get their hands on Nvidia's AI GPUs, so it wouldn't be surprising to see them turn to AMD to fill the supply gap. Second, AMD's AI accelerators are reportedly priced very competitively despite offering solid specs when compared to Nvidia's offerings. Though AMD hasn't revealed the official prices of its MI300 processors, Citi estimates that it is selling one unit of its flagship MI300X processor to Microsoft for $10,000. Other customers are reportedly paying $15,000 for this particular chip, which packs 192 gigabytes (GB) of high-bandwidth memory (HBM). For comparison, Nvidia's H100 AI GPU, which is equipped with 80 GB of HBM, is reportedly sold for between $30,000 and $40,000. Also, Nvidia's upcoming H200 AI GPU will be equipped with 141 GB of the latest generation of HBM. So, by offering customers a much larger memory size -- which comes in handy while training large language models -- at a price that's reportedly much lower than that of Nvidia's offerings, AMD is looking to make its presence felt in the AI chip space. A bigger-then-expected boost in revenue could push AMD's stock higher. The consensus analyst estimate is that AMD's revenue will increase 14% in 2024 to $25.8 billion. Assuming that forecast is based on AMD's guidance of $3.5 billion in AI chip revenue, the additional $1.5 billion in sales that Citi expects the chipmaker to generate this year from AI could take its top line to $27.3 billion. That would accelerate AMD's 2024 top-line growth to 20%. We saw earlier that AMD is trading at 12.3 times sales right now. That multiple coupled with $27.3 billion in revenue, would send its market cap to $336 billion, a jump of 20% from current levels. The most optimistic analyst gives AMD a 12-month price target of $270, pointing toward 56% gains from current levels. If the chipmaker manages to generate more AI revenue than what Wall Street is forecasting, which it could do by capturing a good chunk of its foundry partner's production capacity, then don't be surprised to see shares of AMD approach this Street-high price target in the coming year. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}