{
    "title": "Get the solid AMD Ryzen 5 5600 for just £104 from Laptops Direct",
    "date": "3/15/2024",
    "url": "https://www.eurogamer.net/digitalfoundry-2024-get-the-solid-amd-ryzen-5-5600-for-just-104-from-laptops-direct",
    "text": "Long read: The beauty and drama of video games and their clouds \"It's a little bit hard to work out without knowing the altitude of that dragon...\" A lot of CPU for the price. AMD's Ryzen 5 5600 remains an excellent value proposition for both gaming and content creation workloads, and it only seems to be getting cheaper. At the moment, Laptops Direct have got it for one of the lowest prices I've ever seen it at, knocking nearly half off its £200 list price, and giving you the chance to get a nippy processor for less. For generalists looking for an affordable CPU for a new PC build with a fair bit of grunt, the 5600 makes sense for a solid option.  It's got the necessary power for a modern system and has marked itself out over the last few years as one of the best value all-round CPUs that money can buy. A big reason for this is that it's essentially a downclocked 5600X with a 200MHz slower base and boost clock frequencies. Otherwise, it's the same 6 core and 12 thread processor that should be more than up to the task of both general computing, as well as more intensive workloads such as gaming. It's intriguing to note that the non-X variant on offer here makes for an especially close competitor to the more powerful -X version at a much lower cost, making it a fantastic value choice for those wanting a blend of a capable processor for a great price.< You also get the benefit of entering into an ecosystem where well specced parts are becoming more affordable, with feature-packed AM4 motherboards going for good prices in a range of form factors, while DDR4 RAM in good capacities is virtually dime a dozen these days. It's also at the point where NVMe storage prices remain at a sensible level, giving you the chance to get snappy drives in bigger capacities for decent money. You also have a reasonably decent upgrade path here up to the 5800X3D later down the line, too, if you find you need more power than the 5600 can offer. If you are in the market for an amazing value CPU and you'd like a fantastic bang for the buck option, then this deal on the Ryzen 5 5600 from Laptops Direct isn't to be missed. From Assassin's Creed to Zoo Tycoon, we welcome all gamers Eurogamer welcomes videogamers of all types, so sign in and join our community! Jelly Deals |\n\n\nBest Nintendo Switch deals in March 2024 Jelly Deals |\n\n\nThe big PS5 Slim disc console discount expires this weekend Digital Foundry |\n\n\nThe sublime Logitech MX Master 3S is down to a bargain price from Amazon Digital Foundry |\n\n\nThis RTX 4070-powered Dell G16 gaming laptop has received a useful discount from Dell Digital Foundry |\n\n\nCorsair's MP600 Core Mini 1TB SSD is ideal for Steam Deck, and down to a bargain price from Amazon Jelly Deals |\n\n\nBest PS5 deals in March 2024 Jelly Deals |\n\n\nThe best cheap Nintendo Switch game deals in March 2024 Jelly Deals |\n\n\nBest PS4 game deals in March 2024 Bad puns and video games since 1999. Eurogamer.net is owned by Gamer Network Limited, a ReedPop company and subsidiary of Reed Exhibitions Limited. © 2024 Gamer Network Limited, Gateway House, 28 The Quadrant, Richmond, Surrey, TW9 1DN, United Kingdom, registered under company number 03882481. All rights reserved. No part of this website or its content may be reproduced without the copyright owner's permission. "
}