{
    "title": null,
    "date": "3/22/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-amd-percent-decline-2024-03-22/",
    "text": "Advanced Micro Devices, Inc. (NASDAQ:AMD - Get Free Report) shares traded down 1.3% during trading on Friday . The stock traded as low as $175.05 and last traded at $176.33. 19,517,865 shares traded hands during mid-day trading, a decline of 75% from the average session volume of 78,319,641 shares. The stock had previously closed at $178.68. Several analysts have recently commented on the company. Bank of America raised their target price on Advanced Micro Devices from $165.00 to $195.00 and gave the company a \"buy\" rating in a research note on Monday, January 29th. The Goldman Sachs Group raised their price target on shares of Advanced Micro Devices from $157.00 to $180.00 and gave the company a \"buy\" rating in a research report on Wednesday, January 31st. Susquehanna boosted their target price on Advanced Micro Devices from $170.00 to $210.00 and gave the stock a \"positive\" rating in a research note on Monday, January 29th. Northland Securities upgraded Advanced Micro Devices from a \"market perform\" rating to an \"outperform\" rating and set a $195.00 target price on the stock in a research note on Wednesday, January 31st. Finally, Stifel Nicolaus restated a \"buy\" rating and issued a $145.00 target price on shares of Advanced Micro Devices in a research note on Thursday, December 7th. Four equities research analysts have rated the stock with a hold rating and twenty-five have assigned a buy rating to the stock. According to MarketBeat.com, the stock currently has a consensus rating of \"Moderate Buy\" and a consensus target price of $181.82. Read Our Latest Stock Report on Advanced Micro Devices The firm's 50-day simple moving average is $178.94 and its 200-day simple moving average is $138.78. The company has a quick ratio of 1.86, a current ratio of 2.51 and a debt-to-equity ratio of 0.03. The firm has a market capitalization of $287.44 billion, a PE ratio of 345.49, a price-to-earnings-growth ratio of 2.70 and a beta of 1.66. Advanced Micro Devices (NASDAQ:AMD - Get Free Report) last posted its earnings results on Tuesday, January 30th. The semiconductor manufacturer reported $0.77 earnings per share for the quarter, hitting analysts' consensus estimates of $0.77. Advanced Micro Devices had a net margin of 3.77% and a return on equity of 5.73%. The company had revenue of $6.17 billion during the quarter, compared to analyst estimates of $6.13 billion. During the same period in the prior year, the business posted $0.54 earnings per share. Advanced Micro Devices's revenue for the quarter was up 10.2% on a year-over-year basis. Equities analysts expect that Advanced Micro Devices, Inc. will post 2.67 earnings per share for the current year. In other Advanced Micro Devices news, insider Victor Peng sold 100,000 shares of the firm's stock in a transaction that occurred on Friday, February 2nd. The shares were sold at an average price of $175.11, for a total transaction of $17,511,000.00. Following the completion of the transaction, the insider now owns 241,266 shares of the company's stock, valued at $42,248,089.26. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available through the SEC website. In related news, insider Victor Peng sold 100,000 shares of the firm's stock in a transaction that occurred on Friday, February 2nd. The shares were sold at an average price of $175.11, for a total value of $17,511,000.00. Following the sale, the insider now owns 241,266 shares in the company, valued at $42,248,089.26. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available at the SEC website. Also, CEO Lisa T. Su sold 125,000 shares of the firm's stock in a transaction that occurred on Wednesday, March 13th. The stock was sold at an average price of $195.13, for a total transaction of $24,391,250.00. Following the completion of the sale, the chief executive officer now owns 3,222,230 shares in the company, valued at approximately $628,753,739.90. The disclosure for this sale can be found here. Over the last quarter, insiders sold 324,943 shares of company stock valued at $59,919,994. Corporate insiders own 0.73% of the company's stock. Institutional investors and hedge funds have recently modified their holdings of the business. Vanguard Group Inc. increased its holdings in shares of Advanced Micro Devices by 1.7% in the 4th quarter. Vanguard Group Inc. now owns 142,445,378 shares of the semiconductor manufacturer's stock worth $20,997,873,000 after buying an additional 2,390,558 shares during the last quarter. State Street Corp increased its holdings in shares of Advanced Micro Devices by 1.7% in the 1st quarter. State Street Corp now owns 65,045,249 shares of the semiconductor manufacturer's stock worth $6,375,083,000 after buying an additional 1,112,077 shares during the last quarter. Fisher Asset Management LLC increased its holdings in shares of Advanced Micro Devices by 2.2% in the 4th quarter. Fisher Asset Management LLC now owns 28,368,826 shares of the semiconductor manufacturer's stock worth $4,181,849,000 after buying an additional 600,638 shares during the last quarter. Price T Rowe Associates Inc. MD increased its holdings in shares of Advanced Micro Devices by 10.2% in the 4th quarter. Price T Rowe Associates Inc. MD now owns 27,675,684 shares of the semiconductor manufacturer's stock worth $4,079,674,000 after buying an additional 2,553,392 shares during the last quarter. Finally, Jennison Associates LLC increased its holdings in shares of Advanced Micro Devices by 5.9% in the 4th quarter. Jennison Associates LLC now owns 26,886,280 shares of the semiconductor manufacturer's stock worth $3,963,307,000 after buying an additional 1,490,997 shares during the last quarter. Hedge funds and other institutional investors own 68.43% of the company's stock. Advanced Micro Devices, Inc operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products.Featured ArticlesFive stocks we like better than Advanced Micro DevicesInsider Trades May Not Tell You What You ThinkKB Home: Building on Strong Foundations During Volatile TimesUtilities Stocks Explained – How and Why to Invest in UtilitiesNike Stock and the 30% Rally That's ExpectedInvesting In Automotive StocksHeadwinds for Darden Restaurants are an Opportunity For Investors Before you consider Advanced Micro Devices, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Advanced Micro Devices wasn't on the list. While Advanced Micro Devices currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's list of the 10 best stocks to own in 2024 and why they should be in your portfolio. MarketBeat gives you seven stocks that you should be looking at to create your own Magnificent Seven in 2024. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}