{
    "title": "AMD updates FreeSync specifications, FHD monitors will support 144 Hz",
    "date": "3/7/2024",
    "url": "https://itc.ua/en/news/amd-updates-freesync-specifications-fhd-monitors-will-support-144-hz/",
    "text": "Home - News - AMD updates FreeSync specifications, FHD monitors will support 144 Hz Yurii Oros News writer First introduced in 2015, AMD’s FreeSync technology has undergone several changes. The company offered its technology as an alternative to NVIDIA G-Sync and VESA VRR (Variable Refresh Rate) for tierless operation, synchronizing the monitor refresh rate with the capabilities of the GPU. Instead of releasing a new FreeSync specification, AMD is updating existing tiers to provide higher refresh rates. It’s worth noting that FreeSync already had a second version, but AMD changed the naming scheme, transmits Videocardz. When the technology was first announced, monitors with 120Hz refresh rates were rare. Today, a refresh rate of 144Hz or higher is not out of the ordinary for a gaming panel. However, FreeSync specifications needed to be updated accordingly.  AMD is not changing the FreeSync specs for laptop panels, the new changes will only affect monitors and TVs. The update was actually released in September 2023, but AMD is only announcing it now. It looks like AMD has raised the minimum FreeSync specs for 1080p monitors (listed at 3440) to 144Hz. Previously, the base level did not have this requirement. For FreeSync Premium, monitors with resolutions up to 3440 must now provide at least 200Hz, and higher resolution monitors (i.e. mostly 4K panels) will have to support a maximum refresh rate of 120Hz. In both cases, this is more than the 120Hz minimum refresh rate that was previously required for FHD+ resolutions. An unexpected success: «Godzilla and Kong: The New Empire» raised $37 million on its opening day «Skynet» from Microsoft and OpenAI: supercomputer «Stargate» will cost $100 billion X Twitter allows adult communities OpenAI has introduced Voice Engine, a model of voice generation based on the — pattern, which turns out to have already been heard by mass users Down with piracy. Ukraine joins WIPO ALERT and launches blacklist of infringing websites Server support SEO partner Spelling error report The following text will be sent to our editors: "
}