{
    "title": "Intel and AMD could lose billions if China goes through with US processor \nban",
    "date": "3/26/2024",
    "url": "https://www.digitimes.com/news/a20240327PD208/china-processor-ban-amd-intel.html",
    "text": "Credit: DIGITIMES Chinese authorities have issued new regulations for procuring foreign processors and operating systems, and analysts warned that Intel and AMD could suffer revenue losses amounting to billions of dollars if their processors are completely banned. According to a recent report by the Financial Times (FT), China's Ministry of Industry and Information Technology (MIIT) quietly released new PC and server procurement regulations on December 26, 2023, requiring government agencies to procure \"secure and reliable\" processors and operating systems. On the same day, the China Information Technology Security Evaluation Center published a list of \"secure and reliable\" processors and operating systems, and it consisted solely of Chinese suppliers. This can be seen as the largest action taken by China to date to establish a domestic technology alternative supply chain and increase the usage rate of domestic technology products. Analysts believe it will be difficult for Intel and AMD to enter this list of processor suppliers because it would require them to submit complete product R&D documents and code. On top of that, the primary evaluation criteria include how much design, development, and manufacturing are done within China. Intel and AMD's total revenue for the fiscal year 2023 reached US$54.2 billion and US$22.7 billion, with 27% and 15% respectively contributed by the Chinese market. As for Microsoft, although it did not disclose relevant data in its financial reports, company president Brad Smith revealed to the US Congress in 2023 that China contributed 1.5% of its revenue. Reuters, citing an analyst from Bernstein, pointed out that if China completely excludes foreign CPUs in government procurement, it could impact Intel and AMD's revenues by 1-3%. Intel could lose up to US$1.5 billion and AMD could also lose hundreds of millions of dollars in revenue. Considering that Intel relies more on the Chinese market and has a less ideal cost structure, the profit risk that Intel faces is likely higher, with the impact potentially reaching double-digit percentages. Bernstein also pointed out that server processor replacement occurs faster than PCs because the software ecosystem that needs to be replaced is more limited. Tom's Hardware commented that it would be a major challenge for China to achieve its goal of transitioning to domestic processors entirely. For example, Zhaoxin's KaiXian (KX)-7000 processor relies heavily on the x86 architecture and is considered six years behind other manufacturers in terms of technology.  Source: AMD, compiled by DIGITIMES, March 2024  Source: Intel, compiled by DIGITIMES, March 2024 "
}