{
    "title": "AMD Ryzen 9 6980HX vs AMD A10-9620P vs AMD Ryzen 5 6600H",
    "date": "3/27/2024",
    "url": "https://www.notebookcheck.net/R9-6980HX-vs-A10-9620P-vs-R5-6600H_14080_9188_14086.247596.0.html",
    "text": "The AMD Ryzen 9 6980HX is a processor for big (gaming) laptops based on the Rembrandt generation. The R9 6980HX integrates all eight cores based on the Zen 3+ microarchitecture. They are clocked at 3.3 (guaranteed base clock) to 5 GHz (Turbo) and support SMT / Hyperthreading (16 threads). The chip is manufactured on the modern 6 nm TSMC process. The \"X\" in the name indicates the overclocking capabilities of the CPU. \nThe new Zen 3+ is a refresh of the Zen 3 architecture and should not offer a lot of changes. The chip itself however, offers a lot of new features, like support for USB 4 (40 Gbps), PCI-E Gen 4, DDR5-4800MT/s or LPDDR5-6400MT/s, WiFi 6E, Bluetooth LE 5.2, DisplayPort 2, and AV1 decode. \nA big novelty is the integrated GPU Radeon 680M, that is now based on the RDNA2 architecture and offers 12 CUs at up to 2.4 GHz. It should be the fastest iGPU of all at the time of announcement. \nPerformance \nWhile we have not tested a single system built around the 6980HX as of August 2023, we have tested at least one laptop featuring the 6950HS, a chip with very similar specs (8 cores, 16 threads, up to 4.9 GHz, Zen 3+). Based on that, expect the 6980HX to be up to 10% faster than the Ryzen 7 5800H, Ryzen 9 4900H, Ryzen 5 PRO 7640HS and also the Core i7-11800H. In other words, this is an impressive laptop CPU that will handle almost any task with ease, as of mid 2023. \nYour mileage may vary depending on how high the CPU power limits are, and how competent the cooling solution of your system is. \nPower consumption \nThis Ryzen 9 series APU has a default TDP, also known as the long-term power limit, of 45 W, with the letter X indicating that the chip is ready for some healthy bit of overclocking - which will lead to much higher power consumption, naturally. \nThe R9 6980HX is manufactured on a 6 nm process for higher-than-average, as of early 2023, energy efficiency. The AMD Ryzen 9 6980HX is a processor for big (gaming) laptops based on the Rembrandt generation. The R9 6980HX integrates all eight cores based on the Zen 3+ microarchitecture. They are clocked at 3.3 (guaranteed base clock) to 5 GHz (Turbo) and support SMT / Hyperthreading (16 threads). The chip is manufactured on the modern 6 nm TSMC process. The \"X\" in the name indicates the overclocking capabilities of the CPU. The new Zen 3+ is a refresh of the Zen 3 architecture and should not offer a lot of changes. The chip itself however, offers a lot of new features, like support for USB 4 (40 Gbps), PCI-E Gen 4, DDR5-4800MT/s or LPDDR5-6400MT/s, WiFi 6E, Bluetooth LE 5.2, DisplayPort 2, and AV1 decode. A big novelty is the integrated GPU Radeon 680M, that is now based on the RDNA2 architecture and offers 12 CUs at up to 2.4 GHz. It should be the fastest iGPU of all at the time of announcement. Performance While we have not tested a single system built around the 6980HX as of August 2023, we have tested at least one laptop featuring the 6950HS, a chip with very similar specs (8 cores, 16 threads, up to 4.9 GHz, Zen 3+). Based on that, expect the 6980HX to be up to 10% faster than the Ryzen 7 5800H, Ryzen 9 4900H, Ryzen 5 PRO 7640HS and also the Core i7-11800H. In other words, this is an impressive laptop CPU that will handle almost any task with ease, as of mid 2023. Your mileage may vary depending on how high the CPU power limits are, and how competent the cooling solution of your system is. Power consumption This Ryzen 9 series APU has a default TDP, also known as the long-term power limit, of 45 W, with the letter X indicating that the chip is ready for some healthy bit of overclocking - which will lead to much higher power consumption, naturally. The R9 6980HX is manufactured on a 6 nm process for higher-than-average, as of early 2023, energy efficiency. The AMD A10-9620P is a mid-range APU of the Bristol Ridge series (7th generation of APUs) with 4 CPU-cores (two Excavator modules) clocked at 2.5 - 3.4 GHz. In our tests the A10-9620P even hit 3.6 GHz. \n It was announced in 2017 and is based on the same silicon as Carrizo but with more and refined features. It is a ULV-chip with a TDP of 15 Watt and integrates a Radeon R5 graphics card (384 shader cores / 6 compute cores) and a dual-channel DDR4-18600 memory controller. As Carrizo its a full featured SoC that offers all I/O ports on the chip. \nThe A10-9620P is a bit faster than the old 15-Watt top model of Carrizo, the FX-8800P. See our Bristol Ridge article for more information on the architecture and improvements compared to Carrizo. The AMD A10-9620P is a mid-range APU of the Bristol Ridge series (7th generation of APUs) with 4 CPU-cores (two Excavator modules) clocked at 2.5 - 3.4 GHz. In our tests the A10-9620P even hit 3.6 GHz. It was announced in 2017 and is based on the same silicon as Carrizo but with more and refined features. It is a ULV-chip with a TDP of 15 Watt and integrates a Radeon R5 graphics card (384 shader cores / 6 compute cores) and a dual-channel DDR4-18600 memory controller. As Carrizo its a full featured SoC that offers all I/O ports on the chip. The A10-9620P is a bit faster than the old 15-Watt top model of Carrizo, the FX-8800P. See our Bristol Ridge article for more information on the architecture and improvements compared to Carrizo. The AMD Ryzen 5 6600H is a processor for big (gaming) laptops based of the Rembrandt generation. The R5 6600H integrates six of the eight cores based on the Zen 3+ microarchitecture. They are clocked at 3.3 (guaranteed base clock) to 4.5 GHz (Turbo) and support SMT / Hyperthreading (12 threads). The chip is manufactured on the modern 6 nm TSMC process.  \nThe new Zen 3+ is a refresh of the Zen 3 architecture and should not offer a lot of changes. The chip itself however, offers a lot of new features, like support for USB 4 (40 Gbps), PCI-E Gen 4, DDR5-4800MT/s or LPDDR5-6400MT/s, WiFi 6E, Bluetooth LE 5.2, DisplayPort 2, and AV1 decode. \nIn the 6000 series, AMD finally switched to the current RDNA 2 graphics architecture for the iGPU. The 6600H only offers the slower Radeon 660M with 6 of the 12 CUs enabled and 1.9 GHz max. clock speed. \nPerformance \nThe average 6600H in our database is in the same league as the R7 5825U, the R7 6800U and also the Core i5-1340P, as far as multi-thread benchmark scores are concerned. This is a very decent result, as of late 2022. \nYour mileage may vary depending on how high the CPU power limits are, and how competent the cooling solution of your system is. \nPower consumption \nThis Ryzen 5 series APU has a default TDP, also known as the long-term power limit, of 45 W. A high-performance cooling solution is a must for a system built around such a chip. \nThe R5 6600H is built with TSMC's 6 nm process for great, as of early 2023, energy efficiency. The AMD Ryzen 5 6600H is a processor for big (gaming) laptops based of the Rembrandt generation. The R5 6600H integrates six of the eight cores based on the Zen 3+ microarchitecture. They are clocked at 3.3 (guaranteed base clock) to 4.5 GHz (Turbo) and support SMT / Hyperthreading (12 threads). The chip is manufactured on the modern 6 nm TSMC process. The new Zen 3+ is a refresh of the Zen 3 architecture and should not offer a lot of changes. The chip itself however, offers a lot of new features, like support for USB 4 (40 Gbps), PCI-E Gen 4, DDR5-4800MT/s or LPDDR5-6400MT/s, WiFi 6E, Bluetooth LE 5.2, DisplayPort 2, and AV1 decode. In the 6000 series, AMD finally switched to the current RDNA 2 graphics architecture for the iGPU. The 6600H only offers the slower Radeon 660M with 6 of the 12 CUs enabled and 1.9 GHz max. clock speed. Performance The average 6600H in our database is in the same league as the R7 5825U, the R7 6800U and also the Core i5-1340P, as far as multi-thread benchmark scores are concerned. This is a very decent result, as of late 2022. Your mileage may vary depending on how high the CPU power limits are, and how competent the cooling solution of your system is. Power consumption This Ryzen 5 series APU has a default TDP, also known as the long-term power limit, of 45 W. A high-performance cooling solution is a must for a system built around such a chip. The R5 6600H is built with TSMC's 6 nm process for great, as of early 2023, energy efficiency. #0 checking url part for id 14080 +0s ... 0s #1 checking url part for id 9188 +0s ... 0s #2 checking url part for id 14086 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.039s ... 0.04s #6 did output specs +0s ... 0.04s #7 getting avg benchmarks for device 14080 +0.003s ... 0.042s #8 got single benchmarks 14080 +0s ... 0.043s #9 getting avg benchmarks for device 9188 +0.003s ... 0.045s #10 got single benchmarks 9188 +0.009s ... 0.054s #11 getting avg benchmarks for device 14086 +0.016s ... 0.07s #12 got single benchmarks 14086 +0.011s ... 0.081s #13 got avg benchmarks for devices +0s ... 0.081s #14 min, max, avg, median took s +0.144s ... 0.225s #15 return log +0s ... 0.225s "
}