{
    "title": "Dragon's Dogma 2 Crashing on PC: How to Fix",
    "date": "3/28/2024",
    "url": "https://www.drivereasy.com/knowledge/dragons-dogma-2-crashing/",
    "text": "No file downloaded? To install Driver Easy We only recommend products we believe in. Products that work. But, just so you know, we may earn commission in doing so. Home › Knowledge Base › Program Issues  Sophie Luo Want to embark on the epic journey of Dragon’s Dogma 2, but it just keeps crashing on your PC for no apparent reason? Don’t worry, you’re not alone: many players are reporting the same issue on their end. But as luck would have it, we have some proven fixes that have helped many other gamers with the Dragon’s Dogma 2 crashing on PC problem, and you may also want to try them to see if they do wonders for you. You don’t have to try all the following fixes: simply work your way down the list until you find the one that does the trick to fix the Dragon’s Dogma 2 crashing on PC problem for you. Dragon’s Dogma 2 can be rather resource-intensive if you want to ensure a smooth gaming experience. This means that it has rather high requirements for your computer. So if your Dragon’s Dogma 2 crashes easily on your computer, one of the first things you need to check is whether your computer meets the minimum system requirements for the game. If your machine is below or just at the requirements, you may need to upgrade your hardware for Dragon’s Dogma 2 to run smoothly. Here are the requirements for your reference: If you’re not sure how to check your computer specs, you can press the Windows key and the R key on your computer at the same time, then type msinfo32 to check your system specs in detail: To vaguely check if your computer meets the minimum requirements for Dragon’s Dogma 2, you can use the release date of the processor, Intel Core i5 10600, released in April 2020. So if your computer is older than that, it’s pretty likely that your computer is not powerful enough to run Dragon’s Dogma 2. When you’re sure that your machine meets the system requirements to run the game, but Dragon’s Dogma 2 still crashes, please move on to the other fixes below. When Dragon’s Dogma 2 keeps crashing on your computer, you may also want to check the Windows graphics settings to make sure that they’re set correctly. This includes running Dragon’s Dogma 2 with the dedicated graphics card and in the High Performance mode. To do so: Try to run Dragon’s Dogma 2 again to see if it still crashes. If the problem remains still, please move on to the next fix, below. Antivirus programs, or Windows firewall, are also likely the culprit to the crashing problem with Dragon’s Dogma 2. This is usually because these security programs will keep an eye on any unusual behaviors from games, like heavy network traffic or unauthorized uses, and therefore cause problems like crashing or refusing to launch with games like Dragon’s Dogma 2. To see if this is your case, you can add Dragon’s Dogma 2 as an exception in the Windows firewall: Try to relaunch Dragon’s Dogma 2 to see if it still crashes. If the crashing problem remains, please move on. According to some community users, Dragon’s Dogma 2 runs properly on their computers when they run Steam as administrator. This is probably because running the game as admin grants full system rights to it, therefore reducing the possibility of crashing from insufficient system privileges. To see if this also does the trick for you: Now open Dragon’s Dogma 2 from within Steam again to see if it still crashes. If the problem still remains, please move on to the next fix. By default, Windows runs on the Balanced Mode, which strikes a fine balance between PC performance and battery usage, which is the optimal choice for laptop users. But if a graphics-intensive or heavy process game like Dragon’s Dogma 2 is running, and you still stick to the balanced mode, your gaming performance suffers, and therefore with problems like game crashing or not launching problem. Dragon’s Dogma 2 is no exception. When you’re sure that your computer is fully powered and has a strong PSU, you can try the following to see if running it in the Ultimate Performance Mode helps to stop Dragon’s Dogma 2 from crashing further. To do so: When the Ultimate Performance power plan is set, try to launch Dragon’s Dogma 2 again to see if still crashes. If the problem remains, please select Balanced (recommended) as your power plan and then move on to the next fix. Another very common reason for game crashes is an outdated or faulty graphics card driver, and Dragon’s Dogma 2 is no exception. In this case, it’s recommended that you do a clean reinstallation of the display card driver manually. To do so, DDU (Display Driver Uninstaller) is usually recommended, as it can do a pretty good job removing all the older or faulty display driver files on your computer. To do a clean reinstallation of the display card driver with DDU: If you don’t know what driver to download in the very first place, or the time or patience to do all the above, you can do it automatically with Driver Easy. Driver Easy will automatically recognize your system and find the correct drivers for it. You don’t need to know exactly what system your computer is running, you don’t need to be troubled by the wrong driver you would be downloading, and you don’t need to worry about making a mistake when installing. Driver Easy handles it all. You can update your drivers automatically with either the FREE or the Pro version of Driver Easy. But with the Pro version it takes just 2 steps (and you get full support and a 30-day money back guarantee): Launch Dragon’s Dogma 2 again and see if the latest graphics driver helps to stop it from crashing. If this fix doesn’t work for you, try the next fix, below. Game files missing or corrupted could also be the culprit to your Dragon’s Dogma 2 crashing on PC problem. To see if this is the culprit for you, you can verify the game files on Steam in this way: When the verification is done, try to relaunch Dragon’s Dogma 2 and see if it still crashes. If so, please move on. If you are facing persistent issues with Dragon’s Dogma 2 and none of the previous solutions have proven effective, it’s possible that your corrupted system files are to blame. To rectify this, repairing the system files becomes crucial. The System File Checker (SFC) tool can assist you in this process. By executing the “sfc /scannow” command, you can initiate a scan that identifies problems and repairs missing or corrupted system files. However, it is important to note that the SFC tool primarily focuses on scanning major files and may overlook minor issues. In situations where the SFC tool falls short, a more powerful and specialized Windows repair tool is recommended. Fortect is an automated Windows repair tool that excels in identifying problematic files and replacing malfunctioning ones. By scanning your PC comprehensively, Fortect can provide a more comprehensive and effective solution for repairing your Windows system. To fix Dragon’s Dogma 2 crashing on PC problem with Fortect: Thanks for reading the post. If you have any other working suggestions that have helped to fix Dragon’s Dogma 2 crashing on PC problem, please feel free to share with us by leaving a comment below. Sophie Luo I'm a technical writer for Driver Easy. Before finding my love for writing tech posts, I had passion for technology goes back much further. I love tinkering with computers, smartphones, and other tech toys. I write articles to help people solve their problems, whether it's a hardware issue or system error. I'm inspired when my articles are of help, and that's what I have been aiming for. All I do every day is to write articles that are easy to read, and I do hope you find instructions in my posts easy to follow. English / Deutsch / Français / 日本語 Copyright © 2009-2024 Easeware Technology Limited. All rights reserved. "
}