{
    "title": "Forget the \"Magnificent Seven\": 1 Artificial Intelligence (AI) Stock That \nCould Double",
    "date": "3/12/2024",
    "url": "https://finance.yahoo.com/news/forget-magnificent-seven-1-artificial-101500075.html?ref=biztoc.com",
    "text": "The term \"Magnificent Seven\" was coined last year by Bank of America analyst Michael Hartnett to describe the seven most influential tech stocks: Alphabet, Apple, Meta Platforms, Microsoft, Nvidia, Amazon, and Tesla. These businesses have leading positions in crucial markets including cloud computing, artificial intelligence (AI), consumer products, gaming, and more. But there's another stock that's more than keeping up with the Magnificent Seven. Advanced Micro Devices (NASDAQ: AMD) outperformed five of the seven members of that vaunted group over the last year, recording a 152% gain. The chipmaker rallied investors with an expanding position in the budding AI market. It could be a better buy over the Magnificent Seven right now, with potentially more room to run in the coming years. Meanwhile, estimates on earnings per share (EPS) indicate AMD's stock could top $400 over the next two fiscal years, making it worth considering over its tech rivals. So forget the Magnificent Seven. Here is one AI stock that could realistically double over the next 24 months. According to data from Grand View Research, the AI market hit nearly $200 billion last year and is projected to have a compound annual growth rate of 37% through 2030. That trajectory would see the sector reach nearly $2 trillion by the end of the decade, indicating AI is nowhere near hitting its ceiling and still has much to offer new investors. So, despite getting a slightly late start in AI compared to its rival Nvidia, AMD has massive potential. Nvidia snapped up an estimated 90% market share in AI graphics processing units (GPUs) last year, which saw its quarterly revenue soar 207% in 12 months thanks to a spike in chip sales. Even if AMD sees a fraction of that success in AI, it could be in for a major boost to earnings. Last December, the company unveiled its new MI300X AI GPU. This chip is designed to compete directly with Nvidia's offerings and has already caught the attention of some of tech's most prominent players, signing on Microsoft and Meta as clients. However, AMD isn't banking solely on stealing market share in GPUs. The chipmaker wants to lead its own space within AI by doubling down on AI-powered PCs. According to research firm IDC, PC shipments are projected to see a major boost this year, with AI integration serving as a key catalyst. And a Canalys report predicts that 60% of all PCs shipped in 2027 will be AI-enabled. AMD has a bright future in AI. Its market cap of $335 billion shows it still has a long way to go before replacing one of the Magnificent Seven, most of which have market caps above $1 trillion. However, I wouldn't bet against AMD eventually doing just that, with its stock recently outperforming some of the biggest names in tech and its significant potential in AI. Earnings have yet to reflect its heavy investment in AI because it's still transitioning from being primarily a maker of central processing units to GPUs. However, its recent quarterly earnings indicate it's moving in the right direction. In its fourth quarter of 2023, revenue rose 10% year over year to $6 billion, beating analysts' expectations by about $60 million. The company's AI-focused data center segment posted 38% revenue growth. Meanwhile, improvements in the PC market boosted its client segment by 65% year over year. The company is on a promising growth path, and EPS estimates reflect this. Earnings could reach just over $7 per share by fiscal 2026. Multiplying that figure by the company's forward price-to-earnings ratio of 57 yields a share price of $410, projecting stock growth of more than 100% over the next two fiscal years. AMD's massive potential will be hard to beat even by the top Magnificent Seven stocks, making it a no-brainer buy this March. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Advanced Micro Devices made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks *Stock Advisor returns as of March 11, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Forget the \"Magnificent Seven\": 1 Artificial Intelligence (AI) Stock That Could Double was originally published by The Motley Fool Related Quotes "
}