{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.tech-critter.com/amd-fsr-3-1-gdc-2024-announce/",
    "text": "At GDC 2024 and just about half a year later since the first release of the AMD FidelityFX Super Resolution 3 big update, a relatively smaller release but still equally impactful FSR 3.1 has been revealed and showcased. I’ll just cut you short in terms of what will it bring to the table, especially for gamers.  For starters, the upscaling quality has been improved particularly in the aspects of flickering which is now less noticeable and can be said the same for the shimmering and dizziness around objects in motion so generally speaking, there’s better clarity and less “blurriness” overall. Moving objects also needs to address ghosting issues which can be especially annoying but in FSR 3.1, it has been further remedied (although not entirely perfect) while preserving more details across the line.  Team Red also took the chance to introduce a new set of FidelityFX APIs that can (hopefully) help developers to debug stuff easier while ensuring long-term compatibility with FSR versions in the future. For the gang who specialize in Vulkan and Xbox GDK, you may want to keep your eyes open on this one as access to FSR 3.1 will be enabled from Q2 onwards, and for gamers, you may see it starting this year although no specific timeframe was given. Oh there’s another thing you’ll appreciate – The official decoupling of FSR 3 upscaling from Frame Generation so that other upscaling solutions can work directly with FG without any sort of conflict.  AMD closes off with a list of upcoming games that will be getting FSR 3 in the coming days and I suggest you bookmark this URL because they do frequently update the list. Dr. Lisa Su, CEO of Advanced Micro Devices (AMD), made waves at SXSW 2024 with a keynote address outlining her... AMD has finally revealed four of its latest Ryzen 8000G series desktop processors, the Ryzen 7 8700G, Ryzen 5 8600G,... Enter your email address to subscribe to Tech-Critter and receive notifications of new posts by email. Email Address Subscribe Tech-Critter ©Wavelength.Network PLT(LLP0013243-LGN)wavelength.network "
}