{
    "title": "AMD has just announced FSR 3.1 with Improved Upscaling Quality",
    "date": "3/20/2024",
    "url": "https://www.dsogaming.com/news/amd-has-just-announced-fsr-3-1-with-improved-upscaling-quality/",
    "text": "AMD has just announced FSR 3.1 which will come with improved upscaling quality. This new version of FSR promises to improve image stability and reduce ghosting. And below, you can find some examples of these improvements. Let’s start with the comparisons. AMD shared these two GIFs. These comparisons are between FSR 2.2 and FSR 3.1 The top (left) images are with FSR 2.2, whereas the bottom (right) images are with FSR 3.1. In the first one, we get to see AMD FSR 3.1 producing a better and more stable image than before.   AMD says FSR 3.1 will make games more stable when you’re still or moving. That means fewer flickers and shimmers, and less weirdness when things are in motion. Plus, it’ll reduce ghosting and preserve more details than before. AMD FSR 3.1 also has another cool feature. With this new version, Frame Generation will work with all other upscaling techs. Finally, PC gamers will be able to use NVIDIA DLSS 2 or Intel XeSS alongside AMD FSR 3.1 Frame Generation. AMD has also revealed the first game that will support FSR 3.1. This game is Ratchet and Clank. And yes, alongside the visual improvements, Nixxes and AMD will decouple FSR 3.1 Frame Generation from upscaling. So yes, you will be able to use FSR 3.1 Frame Generation with DLSS 3 Super Resolution. This is a huge improvement to FSR. So, kudos to AMD for not only improving its Super Resolution tech but also allowing PC gamers to use Frame Generation with all the other upscaling techs. This is what most of us have been asking for. And at last, we’ll finally get it. Hopefully, the game devs will update their games to support the new FSR version. Starfield, Like a Dragon: Infinite Wealth, Avatar: Frontiers of Pandora, and The Talos Principle 2 could greatly benefit from FSR 3.1. Enjoy and stay tuned for more! John is the founder and Editor in Chief at DSOGaming. He is a PC gaming fan and highly supports the modding and indie communities. Before creating DSOGaming, John worked on numerous gaming websites. While he is a die-hard PC gamer, his gaming roots can be found on consoles. John loved – and still does – the 16-bit consoles, and considers SNES to be one of the best consoles. Still, the PC platform won him over consoles. That was mainly due to 3DFX and its iconic dedicated 3D accelerator graphics card, Voodoo 2. John has also written a higher degree thesis on the “The Evolution of PC graphics cards.”\nContact: Email "
}