{
    "title": "I compared all of AMD’s V-cache CPUs to see which you should buy",
    "date": "3/10/2024",
    "url": "https://www.digitaltrends.com/computing/ryzen-7950x3d-vs-7900x3d-vs-7800x3d-best-vcache-cpu/",
    "text": "AMD’s Zen 4 3D V-Cache CPUs are true marvels of modern CPU performance. They offer exceptional gaming performance on par with the absolute best that Intel has to offer, and yet do it at a fraction of the power draw and heat output. They lose out on productivity performance, but that’s what the non-X3D AMD CPUs are for. And if you want all-rounders, but don’t mind high thermal design power (TDP) ratings, then Intel’s offerings are always an option. But out of the latest generation of X3D CPUs, which is the best? The 7950X3D is the most expensive with more cores, while the 7800X3D is the gaming darling. And what about the option between those two, the 7900X3D? Let’s find out. AMD launched its X3D refresh of the Ryzen 7000 generation in spring 2023, starting with the 7950X3D and 7900X3D on February 28, and following with the 7800X3D on April 6. Their MSRPs were $700, $600, and $450, respectively, although real-world retail pricing has come down a lot since then. You can now find these processors at around $600, $400, and $370, respectively. Availability is widespread for all of them and, due to their popularity, they seem unlikely to sell out any time before the next-generation of Zen 5 processors launch later this year. Despite all three of these processors being from the same generation and all sporting the same additional L3 cache stuck on top of the main CPU die, the configuration of these CPUs is still quite distinct. On the surface, there are the core count differences, with the 7800X3D sporting eight Zen 4 cores, the 7900X3D 12, and the 7950X3D 16 — mirroring their non-X3D counterparts. Cache quantities are quite distinct, too. All of them have more than their non-X3D versions — and much more than the Intel competition — with the 7800X3D at 100MB of total L3 cache, and the 7900X3D and 7950X3D both at 128MB. That’s not a huge difference — and it doesn’t make much of one in the real world, as you’ll see below. But it’s there. Clock speeds are also different, but this metric is a little misleading. Like the last-generation 5800X3D, 3D V-Cache CPUs have to operate at a lower clock speed due to thermal and power constraints. However, in both the 7900X3D and 7950X3D, the additional L3 cache is only connected to one of the core complex dies (CCX), so the second CCX can operate as standard Zen 4 cores at higher clock speeds. That means the 7900X3D has only six cores with 3D V-Cache support, while the 7800X3D and 7950X3D have eight, though the 7800X3D has no higher clocked cores to work with. Despite these differences, TDP is basically the same across the board, highlighting the impressive efficiency of 3D V-Cache CPUs. Real-world performance results are where the rubber really meets the road for CPUs, so how do these three modern, high-powered processors do? While you might assume that the 7950X3D walks away with every comparison, you’d be surprised to learn that, at least in gaming, the 7800X3D is arguably more impressive and the better CPU for anyone interested in pure gaming. Although the 7950X3D holds a significant lead in synthetic tests like 3DMark, where the additional CPU cores can be leveraged, in real-world gaming benchmarks, that lead disappears completely. In our own testing, we found the 7800X3D was competitive, or even slightly better than, the 7950X3D in most games, and TechPowerUp agrees with us. It shows the 7800X3D being faster than the 7950X3D on average in games at 1080p, 1440p, and 4K, despite the added cores of the higher-end chip. While we haven’t tested the 7900X3D directly, MakeUseOf pulled together the results of high-profile YouTube tech channels and found that the 12 core CPU often fell behind both the 7950X3D and 7800X3D in games. In fact, the 7800X3D ends up often being the most capable processor. So, what’s going on? The 7950X3D and 7800X3D are effectively the same processor, but the former just has eight additional cores it can use for other tasks. In the cases where the 7800X3D pulls ahead, it could be a scheduling issue where the 7950X3D’s non-3D V-Cache cores are used instead, but that’s likely to happen less often as these processors mature. As for the 7900X3D, it only has six cores with 3D V-Cache, despite having those extra six cores in total, so its CPU performance suffers and the frame rate drops as a result. Productivity, however, is another matter entirely. There, the 7950X3D absolutely walks away with it, thanks to its greater core count and access to higher clocked cores. The 7900X3D follows along in second place, in some cases offering very credible competition to the 7950X3D in apps where not all 32 threads of the higher-end chip can be leveraged. The 7800X3D comes in last place and often by quite a margin. Eight cores just can’t measure up to 12 or 16 in apps that can use them. It seems we have at least two crowns to give out at this award ceremony. The gaming crown unquestionably belongs to the 7800X3D. It’s the fastest in raw gaming power, has a low price tag, and draws less power than the others. If you’re a pure gamer and only interested in what frames per second you can get, the 7800X3D isn’t just the best CPU here, it’s the best gaming processor of any CPU from either manufacturer. If you want pure productivity performance, you should still opt for the non-X3D 7950X from AMD, or better yet, Intel’s 13900K or 14900K, as their higher core counts (24 in both cases) and higher clock speed means that if you can keep them cool, you’ll get top performance in apps that can use all those cores and threads. But out of these three X3D CPUs, the 7950X3D is by far the fastest if you want to do some video editing or file archiving. The 7900X3D is the second best in productivity, but if you can take advantage of 12 cores, you can probably take advantage of 16, and if you’re buying a CPU for work, it’s probably worth the added expense to get the better chip. It’s the worst at gaming, too. The 7900X3D feels like a CPU without a market. If you’re gamer, get the 7800X3D. If you want to work and play, get the 7950X3D. If you can’t quite afford the 7950X3D, you could get the 7900X3D, but it’s probably better to just save up. It's no secret that AMD's 3D V-Cache CPUs top the list of the best gaming processors, but the new Ryzen 7 7800X3D puts AMD shoppers in a precarious position. As you can read in our Ryzen 7 7800X3D review, it tops the charts in gaming performance even if it takes a backseat in productivity power. Is that gap enough to justify spending more on the Ryzen 9 7950X3D? Even with around $300 separating the Ryzen 7 7800X3D and Ryzen 9 7950X3D, the performance gap between them is much closer than their prices would suggest. I threw them both on my test bench to see if spending up is worth it, and there's a clear answer -- the Ryzen 7 7800X3D is the CPU to buy.\nTwo different tiers AMD launched the Ryzen 7 5800X3D in 2022, bringing the world's first processor with 3D V-Cache to market. It remains one of the best gaming CPUs available in 2023, offering credible competition to AMD's Ryzen 7000 series and Intel's Raptor Lake processors. It's no longer alone, though, with newer Ryzen 7000-series 3D VCache CPUs poised to offer even greater gaming performance. With AMD's latest Ryzen 7000 generation now launched, here's everything you need to know about 3D V-Cache.\nWhat is AMD 3D V-Cache? It turns out that one of AMD's best gaming CPUs, the Ryzen 7 5800X3D, can accidentally be killed if you try to overclock it, and it's all because there are no limitations as to how far you can push the processor. Igor Wallossek of Igor's Lab found that the software used for overclocking and overvolting Ryzen CPUs currently doesn't impose any limits when you try to ramp up the voltage. And that's a recipe for turning a fun performance boost into an overclocking nightmare. Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}