{
    "title": null,
    "date": "3/16/2024",
    "url": "https://www.fool.com/investing/2024/03/16/better-artificial-intelligence-ai-stock-amd-vs-int/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Chip stocks have taken center stage amid a recent boom in the artificial intelligence (AI) market as demand for graphics processing units (GPUs) has skyrocketed. These high-powered chips are critical for training and running AI models. As a leader in GPUs, Nvidia has seen the most success in the sector so far, enjoying soaring earnings and a stock that climbed more than 280% in the last 12 months after a spike in chip sales. However, two other chipmakers are moving to challenge Nvidia's dominance and could see major gains in the coming years as their competing GPUs grow in the market: Advanced Micro Devices (AMD 0.50%) and Intel (INTC 0.91%). These companies are investing heavily in AI and could have more room to run in the market than Nvidia over the long term, as they are at earlier stages in their AI ventures. So let's compare these companies' businesses and determine whether AMD or Intel is the better AI stock this month. AMD is probably Nvidia's biggest threat in AI, with the second largest market share in GPUs.The company was slightly late to the AI party compared to its rival. However, AMD has restructured its business to prioritize the budding industry and could see big gains in the coming years as it aids in meeting soaring demand for GPUs. Last December, the company unveiled its MI300X AI GPU. This new chip is designed to compete directly with Nvidia's offerings and has already caught the attention of some of tech's most prominent players, signing on Microsoft and Meta Platforms as clients. Moreover, AMD isn't banking solely on stealing market share in GPUs. The chipmaker wants to lead its own space within AI by doubling down on AI-powered PCs. According to research firm IDC, PC shipments are projected to see a major boost this year, with AI integration serving as a key catalyst. And a Canalys report predicts that 60% of all PCs shipped in 2027 will be AI-enabled. AMD is likely to have a bright future in AI. Meanwhile, its free cash flow hit just over $1 billion last year, compared to Intel's negative-$14 billion. The figures suggest AMD is in better financial health, with more cash reserves to keep investing in AI. In December, Intel unveiled a range of AI chips, including Gaudi3, a GPU designed to challenge Nvidia's and AMD's hardware. Intel also showcased new Core Ultra processors and Xeon server chips, both of which include neural processing units for running AI programs more efficiently. However, the company has hit some roadblocks since then. Intel's stock has fallen more than 9% since Jan. 25, when it released its fourth-quarter 2023 earnings results. The tech giant posted revenue growth of 10% year over year, beating Wall Street estimates by $230 million as it benefited from an improving PC market. But that wasn't enough to overshadow weak guidance that sent Intel's stock tumbling. The company expects its first-quarter 2024 earnings to come in at $0.13 per share; analysts had forecast $0.42 per share. A shift in the chip market has seen demand for central processing units (CPUs) dwindle while GPU sales have soared. As a leader in CPUs, Intel's business has suffered. Intel has the infrastructure and brand power to eventually succeed in AI, but prospective investors should be prepared to hold for the very long term. AMD and Intel are both attractive buys to buy now and hold indefinitely. And earnings per share (EPS) estimates support their massive growth potential in the coming years.  Data by YCharts This chart shows AMD's earnings could hit just over $7 per share over the next two fiscal years, while Intel's are projected to reach just under $3 per share. Multiplying these figures by the companies' forward price-to-earnings ratios (AMD's 55 and Intel's 33) yields stock prices of $396 for AMD and $99 for Intel. Considering their current positions, these projections would see AMD's stock price rise 97% and Intel's 120% by fiscal 2026. These are lofty goals but based on reasonable financial metrics. While Intel looks like the clear winner here, AMD's potential to nearly double in price alongside its more financially stable business makes it too good to pass up. AMD, so far, has a more reliable position in AI, making its stock the better buy over Intel this month. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short January 2026 $405 calls on Microsoft, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}