{
    "title": "Computer RAM gets biggest upgrade in 25 years but it may be too little, too \nlate — LPCAMM2 won't stop Apple, Intel ...",
    "date": "1/14/2024",
    "url": "https://www.techradar.com/pro/computer-ram-gets-biggest-upgrade-in-25-years-but-it-may-be-too-little-too-late-lpcamm2-wont-stop-apple-intel-and-amd-from-integrating-memory-directly-on-the-cpu",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. LPCAMM2 is a revolution in RAM, but it faces an uphill struggle Today’s computers use either SO-DIMM or Low-power DDR (LPDDR) RAM. LPDDR surpasses DDR5 in terms of speed and comes in a form factor that reduces power and footprint while enhancing performance. However, LPDDR memory isn't modular and must be soldered onto the motherboard, meaning replacing it for repairs or upgrades isn’t practical. CAMM is a new form factor for laptop RAM that has just been adopted by the JEDEC Solid State Technology Association and given the name CAMM2. This technology is thinner and faster than the SO-DIMM standard, promising a speed boost for future laptops. That’s not the only advantage to it though. LPCAMM2 harnesses the benefits of LPDDR5X components but in a modular form. This represents the first-ever access to a modular LPDDR-based memory solution, revolutionizing the field for designers and users. It will also be of particular benefit to data center operators, cutting down on energy consumption. LPCAMM2 allows stacking up to 16 DRAM components within a single package, reducing memory architecture and saving space within laptops (the form factor takes up to 64% less space than a dual-SO-DIMM stack), paving the way for thinner, lighter laptop designs. Despite these advantages, LPCAMM2 requires a new type of socket, which increases cost. However, it serves as a single memory module designed to fill both memory channels (128 bits total), which will ultimately lead to cost savings down the line. In theory, LPCAMM2 is an ideal memory solution but it will take a while to be fully adopted by laptop manufacturers. That's not the only obstacle it faces. Tech giants like Apple are hard-wiring memory into the processor, an approach which removes traditional bottlenecks and makes the RAM much more efficient. LPCAMM2’s arrival is great news, but it seems unlikely that it will halt or reverse this trend. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. Canonical announces Snap Store crackdown after crypto scam apps overload DNA storage is coming, it's just a matter of when not if — SNIA quietly unveils first specifications for storing bytes in DNA medium, an important first step towards almost ultra-cheap, limitless storage ICYMI: the week's 7 biggest tech stories from WWDC 2024 announcements to Disney Plus to the Google Pixel 6a being laid to rest By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Tom PowerMarch 29, 2024 By Mike MooreMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Lance UlanoffMarch 29, 2024 By Craig HaleMarch 29, 2024 By Craig HaleMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}