{
    "title": "Lenovo ThinkPad P16v G1 AMD review - Entry-level workstation with Zen4",
    "date": "1/5/2024",
    "url": "https://www.notebookcheck.net/Lenovo-ThinkPad-P16v-G1-AMD-review-Entry-level-workstation-with-Zen4.789252.0.html",
    "text": "Lenovo has added a new entry-level model to its mobile workstation lineup with the ThinkPad P16v G1. The laptop is available with either AMD or Intel processors, and you can choose between integrated graphics and the Nvidia professional GPUs RTX A500, RTX 1000 and RTX 2000 Ada. The cheapest AMD model starts at around €1,400 (US$1,533) and features a Ryzen 5 PRO 7560HS with integrated Radeon 760M, 8 GB of RAM, a 256 GB SSD and a 1080p panel. The highest-spec AMD variant tops out at €3,200 (US$3,503) and comes with a Ryzen 9 PRO 7940HS, an RTX 2000 Ada, 64 GB of RAM, 4 TB of SSD storage and a 4K display. Our review unit (model number 21FE0004GE) costs €2,099 (US$2,298) and is equipped with a Ryzen 7 PRO 7840HS, an Nvidia RTX A1000, 32 GB of RAM, a 1 TB SSD and a Full HD panel with complete sRGB coverage.  The laptop’s entry-level nature is clearly evident in the choice of material. Lenovo has given the ThinkPad P16v G1 a completely plastic chassis. Nevertheless, both the lid and the top of the base section feel nice and are not particularly susceptible to fingerprints. On the other hand, the bottom case and screen bezel are rougher and also feel cheaper. In terms of fit and finish, the competitor HP ZBook Power definitely has an edge with its metal chassis. Besides the usual red elements, such as the TrackPoint and the red accent lines on the dedicated mouse buttons, Lenovo has gone one step further with the P16v G1 by adding another red accent line across the back of the device. Of course, personal taste is always subjective, but we aren’t quite sure whether this is appropriate for a mobile workstation. The laptop is fundamentally sturdy, but drawbacks are inevitable against more expensive ThinkPad models. The middle of the base section can be pushed in slightly, and the lid also has quite a bit of flex. That said, this doesn’t result in any creaking noises or image distortion. The hinges are tuned pretty well, but there is noticeable wobble when you adjust the display’s angle. The screen also can’t be fully folded back 180 degrees. In terms of size and weight, the new P16v G1 falls almost exactly between the thin ThinkPad P1 G6 workstation and the beefy ThinkPad P16. The 170-watt charger weighs 554 g (1.22 lb) together with the power cable. The AMD-based workstation features two modern USB-C ports with USB4 support, both of which are located on the back of the laptop. The interfaces are distributed across all three sides, though this arrangement isn’t ideal. We would rather have the HDMI output on the rear; it would've also been nice to have at least one USB port on the left. The ThinkPad P16v G1 can be equipped with an optional SmartCard reader. However, users will need to do without a dedicated Ethernet port, which can only be added using a USB-C adapter. The SD card reader on the left has a spring-loaded mechanism. An SD card juts out very slightly when inserted. Using our reference card (Angelbird AV Pro V60), we managed to reach average transfer speeds in the region of 70-90 MB/s. The AMD ThinkPad is fitted with a Qualcomm Wi-Fi 6E module (WCN685x) that supports the current Wi-Fi 6 standard as well as Bluetooth 5.2. It delivered very high and stable transfer speeds when connected to our Asus reference router. The ThinkPad P16v G1 can also be configured with a WWAN module (4G LTE) before ordering, but this can’t be added later on because neither the SIM card reader nor the required antennas are installed as standard. Though Lenovo has installed a 5MP webcam, the image quality isn’t particularly great. Even under good lighting conditions, images look hardly any better than those taken by 1080p webcams. There is also an IR camera on board for Windows Hello facial recognition. The bottom case is secured in place with a few Phillips screws and can be removed completely. Serviceability is good as a whole. Apart from the two SO-DIMM slots for RAM, there are two slots for M.2 2280 SSDs. The fans are easy enough to clean, and the battery is only screwed down. However, the wireless module is soldered on and can’t be replaced. The input devices on the P16v G1 are similar to those on the regular P16 when it comes to layout and mechanism, apart from the fact that the P16v’s keyboard is black rather than dark grey. The key travel measures roughly 1.5 mm and is thus in line with the current ThinkPad standard. That said, it is a shame that Lenovo has stopped using the much superior keyboards with 1.8 mm travel even on large workstations. Overall, the keyboard is by no means awful, but ultimately the P16v G1 no longer has any edge over competing devices like the HP ZBook Power G10 in this regard. The ThinkPad’s keyboard has a white backlight with two brightness levels; the power button (top right) also serves as a fingerprint scanner. Users can move the mouse pointer around using either the ClickPad or TrackPoint. The ClickPad is offset slightly to the left and offers enough space for inputs (11.5 x 6.8 cm, or 4.5 x 2.7 in), but expectedly some space has been set aside for the dedicated TrackPoint buttons. The pad itself works fine and didn’t give us any problems, though the clicking sounds are kind of loud. This is also true of the previously mentioned TrackPoint buttons, which came across as very cheap. But the TrackPoint itself works perfectly well once you get used to it. Lenovo offers a total of four display options for the ThinkPad P16v G1. By default, the laptop comes with a matt IPS panel with a resolution of 1,920 x 1,200, a peak brightness of 300 nits and 45% NTSC coverage. You also have the option to get this display with touchscreen capability. Our review unit is fitted with the optional Full HD model with 100% sRGB coverage. There is also a 4K panel option with 800 nits peak brightness, full DCI-P3 coverage, factory calibration and HDR support. The 60Hz panel on our review unit is made by BOE and offers respectable image quality to our eyes. Colours are adequately vibrant and contents look sharp enough on the 16-inch screen. Bright areas also don’t appear grainy. However, response times are somewhat slow, and you’ll also notice minor monitor ghosting in everyday use, for example when moving the mouse cursor. The panel doesn’t use PWM and exhibits only minimal backlight bleed at full brightness and on a dark background. Our review unit managed to hit an average peak brightness slightly above 340 cd/m², thus exceeding the advertised brightness of 300 cd/m². This, together with the low black level, results in a superb max contrast ratio upwards of 2,000:1. * ... smaller is better We measured the panel using the professional CalMAN software (X-Rite i1 Pro2) and found that there is still room for improvement right out of the box. We identified a slight green-leaning tint and greyscale deviations above our target value of 3. There were also a few outliers when it comes to colours. After performing our calibration (the corresponding profile is available as a free download above), we managed to improve the display’s colour reproduction considerably. Only 100% red was marginally above the target value with a DeltaE 2000 of 3.2. Nonetheless, in combination with the almost full sRGB coverage, it is still possible to edit photos and videos on the display. In comparison: 53 % of all tested devices do not use PWM to dim the display. If PWM was detected, an average of 18015 (minimum: 5 - maximum: 3846000) Hz was measured. Using the matt display outdoors is generally not an issue. The screen’s brightness is only pushed to its limits in very bright environments or in direct sunlight. The IPS panel has a decent viewing angle. Lenovo hasn't provided additional performance modes on their ThinkPads for ages, instead opting to integrate their own settings directly into Windows’ power modes – highly convenient for users. We performed the following measurements and benchmarks with the laptop in Best performance mode. The Ryzen 7 PRO 7840HS offers enhanced security features (comparable with Intel vPro) but is otherwise similar to the regular Ryzen 7 7840HS. This means the CPU features 8 Zen4 cores (max. 16 threads) with a max frequency of 5.1 GHz. Its power limits are set at 64/54 watts, much like the processor in the ZBook Power 15 G10 (likewise a Ryzen 7 PRO 7840HS). Competing Intel CPUs require substantially more power. Overall, the AMD processor delivers excellent performance and is even slightly ahead of the Core i7-12850HX in the Dell Precision 7670. The other devices in our comparison offer more CPU performance as a whole. That said, the P16v G1 saw a whopping 35% increase in performance over the ThinkPad P15v G3 with a Ryzen 7 PRO 6850H. Performance remains stable under load, but the processor only has a meagre 18 watts at its disposal when running on battery power. Performance is thus significantly limited in the multi-core tests (40% drop in CB R23 Multi). More CPU benchmark results are available here. * ... smaller is better Based on our impression, the ThinkPad P16v G1 has fantastic performance as expected and is very responsive to all kinds of inputs. The benchmark results are good as a whole, and we didn’t encounter any system stability issues during our testing. Because our review unit came with one RAM module, the system memory only runs in single-channel configuration. Accordingly, the laptop didn’t produce great results in our memory benchmarks. * ... smaller is better * ... smaller is better In our standardised latency test (web browsing, 4K YouTube playback, CPU load), the review unit didn’t exhibit any issues when running on the existing BIOS version. Only one driver showed a slight deviation, but this shouldn’t be a problem when you are using real-time audio applications. * ... smaller is better The ThinkPad P16v G1 provides two speedy PCIe 4.0 slots for M.2 2280 SSDs. Our review unit is shipped with the 1 TB version of the SK Hynix PC801. There is about 899 GB of usable space left after the initial setup. At over 7 GB/s, the max transfer speeds are superb. Thanks to the additional heatsink, the drive’s performance also remains perfectly stable even under prolonged load. You can find more SSD benchmark results listed here. * ... smaller is better The integrated Radeon 780M on the AMD chip handles graphics processing during simple tasks. For more-demanding work, the system will automatically switch to the dedicated RTX A1000 Laptop. This card is an Nvidia professional GPU that is unfortunately still not based on the current Ada Lovelace architecture. Instead, it uses the same GA107 chip also found on the consumer GPU GeForce RTX 3050. The RTX A1000 in the laptop has 6 GB of VRAM and a TGP of 45 watts, meaning it’s a relatively slow variant (TGP can range from 35-95 watts for the A1000). It has around the same level of performance as the previous RTX A2000 with 4 GB of VRAM and similar TGP (see P15v G3 with 40 watts), but is far slower than the new RTX 2000 Ada (comparable with the GeForce RTX 4060 Laptop). GPU performance stays absolutely stable under sustained load, though the graphics card has to make do with 40 watts of power when the laptop is running on battery. This causes graphics performance to drop by about 7%. More GPU benchmark results are available in our tech section. * ... smaller is better You likewise won’t have any problems gaming on Nvidia’s professional drivers; we encountered zero issues during our testing. The gaming performance of the RTX A1000 is more or less on a par with an RTX 3050 with 6 GB of VRAM or an RTX 3050 Ti. Many older titles can thus run smoothly at 1080p and high to max settings. However, those who also want play more demanding games should go for the optional RTX 2000 Ada. The two fans in the ThinkPad P16v G1 usually remain idle during basic tasks. Fan noise even stays pleasantly quiet (36 dB(A) based on our measurement) when you put only the processor or graphics card under load. We measured about 44 dB(A) of noise during gaming, but the fans tend to start rattling slightly at 40 dB(A) and above. The mobile workstation got very loud during the stress test, hitting around 50 dB(A). Our review unit didn’t produce any other electronic noises. Noise Level * ... smaller is better There are no issues with surface temperatures at low load. However, this changes once you apply load to both the CPU and GPU. Especially on the bottom of the device, we measured temperatures above 55°C (131°F) at some spots, meaning you should definitely avoid direct skin contact with these areas. That said, the topside of the base section remained cooler, and temperatures were kept below the 40°C (104°F) mark almost everywhere on the keyboard. Therefore, it’s possible to type properly on the keyboard even under full load. GPU power maintained at a stable 45 watts during the stress test, whilst the processor ran at 54 watts for roughly 12 minutes before settling down at 45 watts. On battery, the GPU still consumed 40 watts of power, but the processor dropped further to 18 watts. * ... smaller is better The two stereo speakers are pretty awful overall. Though mids and highs sound clean, which is useful for playing back voices, the speaker modules simply lack power and dynamics. Furthermore, bass is practically non-existent. (±) | speaker loudness is average but good (74.9 dB)Bass 100 - 315 Hz(-) | nearly no bass - on average 19.8% lower than median(±) | linearity of bass is average (8.8% delta to prev. frequency)Mids 400 - 2000 Hz(+) | balanced mids - only 3.8% away from median(+) | mids are linear (5.4% delta to prev. frequency)Highs 2 - 16 kHz(+) | balanced highs - only 3.3% away from median(+) | highs are linear (5% delta to prev. frequency)Overall 100 - 16.000 Hz(±) | linearity of overall sound is average (18.6% difference to median)Compared to same class» 56% of all tested devices in this class were better, 9% similar, 35% worse» The best had a delta of 7%, average was 18%, worst was 35%Compared to all devices tested» 36% of all tested devices were better, 8% similar, 56% worse» The best had a delta of 4%, average was 25%, worst was 134% (±) | speaker loudness is average but good (74.4 dB)Bass 100 - 315 Hz(-) | nearly no bass - on average 24.9% lower than median(±) | linearity of bass is average (11.1% delta to prev. frequency)Mids 400 - 2000 Hz(+) | balanced mids - only 1.8% away from median(+) | mids are linear (4.6% delta to prev. frequency)Highs 2 - 16 kHz(+) | balanced highs - only 2.9% away from median(+) | highs are linear (4.3% delta to prev. frequency)Overall 100 - 16.000 Hz(±) | linearity of overall sound is average (19.6% difference to median)Compared to same class» 64% of all tested devices in this class were better, 6% similar, 30% worse» The best had a delta of 7%, average was 18%, worst was 35%Compared to all devices tested» 44% of all tested devices were better, 7% similar, 49% worse» The best had a delta of 4%, average was 25%, worst was 134% Power usage at idle didn't exceed 6.7 watts, which is extremely low for a 16-inch device. By contrast, it is no surprise that the ThinkPad required around 150 watts during the stress test, though this quickly dipped to about 135 watts. The included 170-watt adapter is therefore powerful enough for the laptop. * ... smaller is better The combination of low power consumption and a 90 Wh battery allowed for very long battery life during our testing. The ThinkPad lasted nearly 18 hours in our video test at 150 cd/m² (equivalent to 71% of max brightness on our review unit) and almost 15 hours in our Wi-Fi test. Even with screen brightness turned all the way up, we still managed to get 12 hours out of the device. These are excellent results that competing devices can’t keep up with. Under max load, the battery became fully drained in a little more than an hour. It took around 2 hours to fully recharge the laptop when it was running, with the battery regaining 80% of its charge after 65 minutes. Lenovo launched the ThinkPad P16v G1 to replace the old ThinkPad P15v with a slightly larger 16-inch model. The basic idea behind the entry-level workstation remains the same: it is intended to be a relatively affordable gateway into the professional working world. The necessary CPU performance is provided by a current AMD Zen4 chip, which delivers great performance despite the somewhat low power limits of max 64 watts. But high-end workstations like the ThinkPad P16 with Intel’s HX CPUs offer even more processing power. Another point of criticism is that the CPU’s performance is massively reduced when the laptop is running on battery power. Similarly, the only graphics card options available are low-end models from Nvidia (RTX A500, RTX A1000 or RTX 2000 Ada). But you can also completely forgo a dedicated GPU. The performance of the RTX A1000 with 6 GB of RAM is decent overall, though it is a relatively slow variant with a TGP of 45 watts. Given the laptop’s large 16-inch form factor, more could certainly have been got out of it. The ThinkPad P16v G1 is Lenovo’s new entry-level model in the workstation segment. Its performance is adequate, though, needless to say, you have to put up with compromises in some areas (e.g. chassis quality, cooling performance) compared with the more expensive ThinkPad P16. Being entirely made of plastic, the chassis quite clearly shows that the P16v G1 is an entry-level device. The device has good user-serviceability and features two SO-DIMM slots and space for two M.2 2280 SSDs. However, it is not possible to add a WWAN module because Lenovo hasn't preinstalled the necessary antennas or SIM card reader. The keyboard offers modern ThinkPad quality, and the Full HD display features full sRGB coverage and is a decent choice for normal tasks. There is also a 4K panel option (800 cd/m², P3 & HDR) if you want something better. The biggest competitor to the ThinkPad P16v G1 is undoubtedly the HP ZBook Power G10, which feels more premium due to its metal chassis. Both laptops can be equipped with similar specs but otherwise don’t really differ much. Nevertheless, the HP still uses a 16:9 display and also can’t keep up with the ThinkPad in terms of battery life. Dell offers the Precision 3581 in this price range, but we still haven’t had the opportunity to give this device a go. In Germany, the ThinkPad P16v G1 as spec'd is available from Campuspoint for €2,099 (US$2,298). You can also head on over the Lenovo Germany or Lenovo US to configure your own ThinkPad P16v G1. Student & teacher discount is also available for this laptop. Lenovo ThinkPad P16v G1 AMD\n- 2024-01-03\n01/03/2024  v7\n\nAndreas Osthoff The present review sample was made available to the author as a loan by the manufacturer or a shop for the purposes of review. The lender had no influence on this review, nor did the manufacturer receive a copy of this review before publication. There was no obligation to publish this review.  "
}