{
    "title": "AMD Radeon Preview Driver for Fluid Motion Frames 23.40.01.10",
    "date": "1/17/2024",
    "url": "https://www.techspot.com/drivers/driver/file/information/18303/",
    "text": "Welcome to the latest AMD Software: Adrenalin Edition Preview Driver, containing new features, technologies and updates currently under production, including AMD Fluid Motion Frames – an exciting upcoming feature which boosts FPS with frame generation technology which offers a smoother gaming experience. To learn more about what is contained in this driver, read the blog here. This preview driver is intended to provide users an early first-look into upcoming features within AMD Software; feedback is encouraged and can be submitted through the AMD Bug Report Tool. If issues arise or persist during the usage of the Preview Driver, please use the AMD Auto-Detect and Install Tool to revert the latest recommended AMD Software: Adrenalin Edition driver. New Feature Highlights What to know Fixed Issues Known Issues November 9th Release Notes: October 13th Release Notes: Improvements to frame pacing have been made, resulting in an overall smoother gameplay experience and improved image quality. Additional game support for AMD Radeon Anti-Lag+ October 6th Release Notes: September 29th Release Notes: AMD Fluid Motion Frames (AFMF) AFMF may be enabled for any DirectX 11 and 12 title such as Cyberpunk 2077 using the per-app settings within AMD Software: Adrenalin Edition. AFMF can be automatically enabled using HYPR-RX or using the Global Graphics Settings toggle for these select titles; The AFMF technical preview currently requires the game to be played in fullscreen mode with HDR disabled and VSYNC disabled. AFMF features an activity monitor similar to AMD Radeon Super Resolution to confirm the frame generation status using AMD Software: Adrenalin Edition's in-game overlay (use the default hotkey of Alt-R for the fullscreen overlay, or Alt-Z for the sidebar overlay) AFMF can introduce additional latency in games and is recommended to be combined with AMD Radeon™ Anti-Lag/Anti-Lag+ for the optimal experience. AFMF is recommended to be enabled for games running at a minimum fps of 55 FPS for 1080p displays, and 70 FPS for 1440p or above displays. AFMF adds frame generation technology to boost FPS outside of the game's engine. To see the resulting FPS, use the AMD Software Performance Metrics Overlay. Support for third-party performance monitoring tools is not available at this moment. Known Issues Radeon Product Compatibility AMD Software: Adrenalin Edition Technical Preview Driver for AMD Fluid Motion Frames Version 23.30.01.02 is compatible with the following AMD Radeon products. Compatible Operating Systems AMD Software: Adrenalin Edition Technical Preview Driver for AMD Fluid Motion Frames Version 23.30.01.02 is designed to support the following Microsoft Windows platforms. Operating System support may vary depending on your specific AMD Radeon product. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}