{
    "title": "AMD Has Released A Special Driver For The Game Suicide Squad: Kill The \nJustice League",
    "date": "1/30/2024",
    "url": "https://technewsspace.com/amd-has-released-a-special-driver-for-the-game-suicide-squad-kill-the-justice-league/",
    "text": "AMD has released a special driver AMD Software: Adrenalin Edition 23.40.02.03, which is specifically designed for one game – Suicide Squad: Kill the Justice League. The new Radeon software does not have a WHQL signature, which indicates that it has been verified by Microsoft and therefore does not need to be installed.  Image source: VideoCardz The new AMD driver is not part of the manufacturer’s main driver program. Radeon graphics card owners can safely skip this if they don’t plan on playing Rocksteady Studios’ cooperative action game Suicide Squad: Kill the Justice League. Thus, AMD’s latest significant software release is still Radeon Software Adrenalin 24.1.1 WHQL, which adds support for HYPR-RX technologies, Fluid Motion Frames and the Radeon RX 7600 XT graphics card. The AMD Software Driver: Adrenalin Edition 23.40.02.03 press release states that the company has fixed an issue with image distortion in Suicide Squad: Kill the Justice League when using ray tracing technology. List of known issues: Suicide Squad: Kill the Justice League has hit Early Access, but this event was unsuccessful for the game. An hour after launch, access to the game servers was blocked. The publisher made this decision after some players encountered a bug that resulted in the story campaign already being completed the first time they entered the game. The issue with this bug has already been fixed, but the game was not yet available at the time of publishing this note. The official release of Suicide Squad: Kill the Justice League is expected on February 2nd on PC (Steam, EGS), PS5, Xbox Series X and S. It should be noted that NVIDIA and Intel already released their drivers for this game last week. The AMD driver, in turn, is only intended for Radeon graphics cards on RDNA 1, 2 and 3 architectures. You can download the AMD software driver: Adrenalin Edition 23.40.02.03 from the official AMD website. Robbie Elmers is a staff writer for Tech News Space, covering software, applications and services. Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  TECH NEWS SPACE The Tech News Space team monitors news from the world of high technology, science, the gaming industry and delivers them to its readers in a timely manner. "
}