{
    "title": "Asus ZenBook 14 OLED thin-and-light powerhouse gets AMD Ryzen 7 8840HS and \ncolour-accurate 120 Hz, 600-nit ...",
    "date": "1/10/2024",
    "url": "https://www.notebookcheck.net/Asus-ZenBook-14-OLED-thin-and-light-powerhouse-gets-AMD-Ryzen-7-8840HS-and-colour-accurate-120-Hz-600-nit-3k-display.791499.0.html",
    "text": "In late 2023, Asus refreshed the ZenBook 14 OLED line-up with Intel's Core Ultra CPUs, giving the sub-$1,500 laptop segment a solid, high-performance competitor to Dell's XPS line-up. Now, as part of the company's CES 2024 announcements, Asus has revealed further updates to its thin-and light laptops with the ZenBook 14 OLED UM3406. This time, the compact productivity laptop gets AMD's Ryzen 7 8840HS CPU, paired with up to 16 GB of dual-channel LPDDR5X RAM. The ZenBook 14 OLED features an all-metal design, measuring in at just 14.9 mm thick and weighing in at just 1.2 kg. It has an IR camera for Windows Hello face unlock, and there is a built-in webcam privacy shutter for when you don't want to be seen. As for ports, there are two USB 4 Type-C ports, one USB 3.2 Gen 1 port, as well as an audio combo jack and an HDMI 2.1 port. The updated Asus ZenBook 14 OLED offers up impressive display specifications, considering it's meant to be a thin-and-light productivity machine, rather than a gaming or content creation powerhouse. There are two versions of the ZenBook 14 OLED — one with a touch screen and one with a non-touch panel. The non-touch ZenBook edges out the touch version in display specs. The 3K (2880×1800 pixels), 14-inch, 16:10, 120 Hz OLED panel on the non-touch ZenBook 14 has the low 0.2 ms response times typical of an OLED and reaches a peak brightness of 600 nits in HDR, while SDR is limited to 400 nits — still plenty bright for most situations. As for the touch-enabled ZenBook 14 OLED, it features an FHD (1920×1200 pixels) panel that tops out at 60 Hz and 500 nits in HDR mode, although it has the same 400 nits SDR max brightness. Perhaps more impressive is the display's colour gamut specifications, making claim to 100% coverage of the DCI-P3 colour space, which is something the two displays share. In our review of the Asus ZenBook 14X, which seems to use the same 3K, 120 Hz display as the ZenBook 14 OLED, we found Asus's claims to be fairly accurate, with 99% DCI-P3 coverage and a 376 nit maximum brightness in SDR mode. The average delta-E scores were surprisingly good, too, with it coming in at 2.01, which would make the display usable for colour-sensitive work. The combination of the Radeon 780M graphics in AMD's Ryzen 7 8840HS CPU alongside a stellar display and fast memory make the Asus ZenBook 14 OLED a rather competitive option in the thin-and-light space, even for those looking to game or do light content creation tasks on occasion. The only limiting factors here might be the pedestrian 16 GB of RAM or the lack of a discrete GPU. Buy the Asus ZenBook 14 OLED with Intel Core Ultra 7 CPU at Best Buy. Asus "
}