{
    "title": "Nvidia will have to copy our frame generation approach, says AMD",
    "date": "1/11/2024",
    "url": "https://www.pcgamesn.com/amd/fluid-motion-frames-launch",
    "text": "AMD claims huge boost in frame rates from Fluid Motion Frames at CES 2024, and says it will work in thousands of games. Ben Hardwidge Published: Jan 11, 2024 CPU and GPU maker AMD is about to fire a mighty shot across its bows to Nvidia this month, when AMD Fluid Motion Frames exits the preview phase and becomes an official part of its Adrenalin driver package. According to AMD, you’ll be able to enable the new tech in “thousands of games,” and the company even thinks Nvidia is going to have to “do something similar” in response. Fluid Motion Frames will be competing hard with Nvidia DLSS 3 Frame Generation, which is supported by the company’s Ada GPUs, such as the GeForce RTX 4090, which currently tops our best graphics card guide. The announcement came as AMD launched the Radeon RX 7600 XT at the CES tradeshow in Las Vegas, with the company revealing that AMD Fluid Motion Frames will now become a part of its Hypr-RX suite in its Adrenalin driver software. Speaking to the press for the GPU launch, AMD Senior Manager of Radeon Product, Aaron Steinman, said that “Hypr-RX is a one-click gaming profile solution,” adding that, unlike DLSS 3, it “works across thousands of games.” You basically just need to enable the feature in your game’s profile in the driver, and frame generation should work automatically. Nvidia has had its own frame generation tech in DLSS 3 for over a year now, and it offers a great way to massively increase gaming frame rates with minimal impact on image quality, thanks to its use of AI and Nvidia’s Tensor cores. There are a couple of catches, though. For one, it only works on Nvidia GeForce RTX 4000-series GPUs, such as the GeForce RTX 4070. Secondly, using it requires a game to support it, or for a modder to unofficially add support to a game. AMD was late to respond with its FSR 3 frame generation late last year, and even now it’s only officially supported in a handful of games. However, as Fluid Motion Frames is enabled in the driver, rather than in a game, it should (in theory, at least) basically run on any modern game you throw at it. Not only that, but the driver will support last-gen RDNA 2 GPUs, such as the Radeon RX 6800 XT, as well as the latest RDNA 3 GPUs, such as the Radeon RX 7800 XT. What’s more, while Nvidia’s DLSS tech is a closed eco system that only runs on Nvidia RTX GPUs, AMD has made FSR 3 open source, a strategy that AMD thinks Nvidia will have to emulate at some point. Quoted on PC Gamer, Steinman said: “DLSS is only available on certain solutions, so either Nvidia is going to have to benefit from our solution because we did make it open-source and cross-vendor, or they’re probably going to need to do something similar.”  In its own benchmarks, AMD shows Fluid Motion Frames massively increasing frame rates on the Radeon RX 7600 XT, sometimes nearly doubling. In Baldur’s Gate 3, for example, the Radeon RX 7600 XT usually averages 87fps, but this goes up by a good chunk once you enable FSR resolution scaling in Quality mode, and then goes all the way up to 208fps once you add frame generation to the mix as well. The AMD Fluid Motion Frames release date is January 24, 2024, when it’s officially released as a part of the Radeon RX 7600 XT launch driver, and we’re looking forward to giving it a try. In the meantime, check out all the latest goings on from CES, straight from the show floor. Ben Hardwidge                 A tech journalist since 1999, and a PC hardware enthusiast since 1989, Ben has seen it all, from the horrors of CGA graphics to the amazing ray-tracing GPUs of today. Ben is mainly interested in the latest CPU and graphics tech. "
}