{
    "title": "AMD Ryzen 7 8700G review: The best gaming CPU for those on a budget",
    "date": "1/29/2024",
    "url": "https://www.xda-developers.com/amd-ryzen-7-8700g-review/",
    "text": "Farewell, discrete graphics card AMD has been making Ryzen APUs for years now and while they allowed the playing of PC games without a discrete graphics card, they weren't the best experience for general computing compared to the best CPUs, and gaming performance was limited to lower visual settings to achieve stable frame rates. That's all about to change with the launch of AMD's Ryzen 8000 series of chips. In this review, I'm going to run through my experience playing around with the AMD Ryzen 7 8700G. The combination of AMD's computing cores and the Radeon 780M creates one compelling APU. Designed for 1080p gaming, the AMD Ryzen 7 8700G is ideal for those who don't want or cannot afford a dedicated GPU. It launches at the perfect time with GPU stock and prices remaining out of whack. You can expect to enjoy all the latest games in Full HD with reasonable visual settings. This CPU is not perfect, however. AMD doesn't include support for PCIe 5.0, which is almost understandable as these CPUs are designed for budget-friendly systems. If you can overlook its minor shortcomings, you'll have access to one of the best-integrated gaming platforms available right now. It's so good, that I would consider a PC with the AMD Ryzen 7 8700G if you're eyeing an Apple desktop for its M processors. Using the AM5 platform also allows for future upgrades to full-fledged AMD Ryzen processors such as the AMD Ryzen 9 7900X (as well as future 8000 series chips). About this review: The AMD Ryzen 7 8700G was provided by AMD for this review, and it did not have any input into the contents. The AMD Ryzen 7 8700G is one of the best AMD processors I've played around with in years. It's impressive just how much performance is available with this single chip. The AMD Ryzen 7 8700G is priced at $329. This is a good price for an eight-core processor with powerful integrated graphics. It's about the same cost as an Intel Core i5-14600K and AMD directly compares this Ryzen processor against the Core i7-14700K, so on paper, we're getting a good deal here. This is for performance without a GPU, however. The Intel Core i5-14600K is one of the best CPUs for gaming with a dedicated graphics card and would be a better fit than the 8700G. The AMD Ryzen 7 8700G replaces the outgoing AMD Ryzen 5 5700G, a previous-generation AM4 processor. The newer chip has the same number of cores, though they've got all the same generational improvements the Ryzen 7000 series brought with it. It has higher base and boost clock speeds, and 4MB of additional cache to work with. This may not sound like much, but it's enough to make the 8700G feel snappier with general computing as well as improved performance in games. Then there's the important part of this APU: the integrated GPU. AMD is using its Radeon 780M GPU with 12 cores at 2.9 GHz. The AMD Ryzen 5 5700G only had 8 GPU cores at 2.0 GHz and we can expect to see a considerable uplift in performance for the latest games at 1080p. To adequately test the new processor, we'll use a Gigabyte B650 Aorus Elite AX ICE motherboard with 32GB of G.Skill Trident Z5 Neo RGB DDR5-6400 system memory. Since the AMD Ryzen 7 8700G includes its own AMD Wraith cooler, we will be using that for most of our tests, though we will note how much of an improvement aftermarket cooling makes, if any. To see just how capable this processor is, we employed our usual suite of tests, including Cinebench, 3DMark, and a few select PC games. AMD Ryzen 7 8700G AMD Ryzen 5 8600G Intel Core i7-14700K Cinebench 2024    3DMark Time Spy    3DMark Fire Strike    The AMD Ryzen 7 8700G performs well under load. Whether it's Cinebench 2024, 3DMark, or even Grand Theft Auto V, the Ryzen 7 8700G powers through. Its computing scores are respectable, considering there's a powerful integrated GPU present. This leads to some impressive results in games. AMD touts this APU as a 1080p powerhouse, but I found myself upping the resolution in most cases without losing too many frames. GTA V was able to run its benchmark at 1440p with a stable 60 FPS. Granted, the quality settings were nowhere near max, but it's impressive nonetheless. AMD touts this APU as a 1080p powerhouse, but I found myself upping the resolution. Game AMD Ryzen 7 8700G AMD Ryzen 5 8600G Cyberpunk 2077 48 FPS 40 FPS Elden Ring 63 FPS 58 FPS Far Cry 6 59 FPS 51 FPS GTA V 101 FPS 90 FPS Shadow of the Tomb Raider 69 FPS 62 FPS The above games were tested at 1080p with in-game visual settings set to low. As I touched on already, it's possible to push up to 1440p, but you'll have to keep visual settings low to ensure a stable frame rate. It's important to target 60 frames per second as a minimum for smooth gameplay. Add an aftermarket cooler and you'll be able to get a little more out of the APU, pushing yet more frames to the connected monitor each second. Both AMD and Intel desktop processors draw high amounts of power and thus produce considerable heat, especially when pushing them hard with automated boosts. I was expecting to see a similar story with the 8700G since it not only has to deal with heat from the CPU cores but also the GPU and when playing games, both parts of the chip will work to process as many frames as possible. My experience of testing the AMD Ryzen 7 8700G with its stock cooler was a pleasant one, however. The entire package never hit 81C, even when pushed to its limit with the latest games. Grand Theft Auto V and Elden Ring are heavy titles, but both games failed to see the Ryzen 7 8700G go beyond 76C. Even Cinebench, a renowned benchmark and stress test failed to move the temperatures into uncomfortably warm territory. Taking into account the TDP of 65W, I never saw the package draw more than 85W of power. For general usage, you can expect to see it draw anywhere between 10 and 30W. Competition is an interesting analysis for the AMD Ryzen 7 8700G as the company's main competitor doesn't have anything on offer. Most Intel processors come with Intel UHD Graphics, which are superior to the basic GPU AMD includes on many desktop-class processors, but taking the Intel Core i7-14700K as an example, it's far behind the Ryzen 7 8700G for gaming without a dedicated GPU. This CPU is also a notable upgrade over the Ryzen 7 5700G. If you happen to own one of those chips, it may be worth the upgrade to the new AM5 platform with PCIe 5.0 and DDR5 RAM, though the 8700G fails to support the former. Intel's Core i7-14700K is far behind the Ryzen 7 8700G for gaming without a dedicated GPU. Apple's silicon is another comparison worth considering as both the latest M3 chips and the Ryzen 7 8700G have integrated graphics worth writing home about. They may be two entirely different beasts, but should you be considering an Apple desktop as a compact gaming machine, AMD may just have a Linux or Windows answer with this CPU. Throw into the mix a compact ITX chassis and motherboard, and you'll have a reliable 1080p gaming machine producing little noise. Where the AMD Ryzen 7 8700G will fall short compared to other desktop processors is general computing power. We've experienced a 5-10% reduction in core performance over the Ryzen 7 7800X. It's a trade off an APU must make as the package handles far more than a traditional desktop-class processor such as the 7800X is usually exposed to. You should buy the AMD Ryzen 7 8700G if: You shouldn't buy the AMD Ryzen 7 8700G if: The AMD Ryzen 7 8700G is one of the most impressive processors AMD has launched to date. It's a testament to how far the development of Zen has come to produce one of the best APUs on the market. It's designed for 1080p gaming, but with the right components and settings, you can push the boundaries of what's possible and enjoy smooth 1440p gameplay with this thing. The price of graphics cards continues to borderline on the ridiculous and it's APUs such as the Ryzen 7 8700G that provide an alternative to those who don't have more than $1,000 for a mid-tier Nvidia GPU. The AMD Ryzen 7 8700G is one of the most impressive processors AMD has launched to date. I've come away mightily impressed by the performance of the AMD Ryzen 7 8700G. Even the stock cooler is capable of keeping temperatures in check, but pair this CPU up with an AIO liquid cooler and you'll be able to compete against systems with discrete GPUs. It's also possible to create a super-powerful compact ITX system with the right AMD AM5 motherboard. Intel doesn't have anything in the same league as the 8700G. Sure, it won't win any awards for benchmark results against the Intel Core i7-14700K outside of GPU scores, but as a complete package, you cannot beat AMD here. The AMD Ryzen 7 8700G is the most powerful APU AMD has released to date, offering the mighty Radeon 780M integrated GPU for butter-smooth 1080p gaming.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Richard is a Senior Editor at Valnet and has been covering the technology industry for almost two decades. He's been building PCs since young and when not creating content, you can often find him inside a chassis somewhere. If you're looking to add one of AMD's Ryzen 7000 to your system without spending a ton, check out our collection of the best budget AM5 motherboards. AMD made significant improvements to its APU lineup with the Ryzen 5 8600G. But is it good enough to beat the Ryzen 5 7600? For when you can't resist checking out all the new Windows features Microsoft has granted Windows 11 22H2 users another year of non-security updates. Discover how these ergonomic office chairs can transform your workday comfort and well-being. Microsoft has bigger fish to fry. "
}