{
    "title": "AMD Radeon RX 7600XT 16GB Launch and XFX QICK 309 Review",
    "date": "1/24/2024",
    "url": "https://pcper.com/2024/01/amd-radeon-rx-7600xt-16gb-launch-and-xfx-qick-309-review/",
    "text": "Posted by Josh Walrath | Jan 24, 2024 | Graphics Cards | 3 The past several weeks have seen new CPU and GPU launches from multiple vendors, but this is expected after a rather busy CES this year. AMD is part of that with a handful of new CPUs and APUs, but the one area they have seemingly saved until last is their final RX 7000 series GPU release. Well, we think it is the last. There are no new RX7x00 series of chips that have not been released. All new GPUs will be based on the RDNA 4 architecture and we expect to start hearing about them much later this year. The RX 7600XT is a slightly refreshed version that we saw introduced early last year with the RX 7600. These cards are based on the Navi 33 chip. This particular number is manufactured on TSMC’s 6nm process (cost, size optimized 7nm) rather than the newer, more cutting edge 5 nm process (N5P). This makes a bit more sense for AMD as it is a cost sensitive product that is aimed at the sub-$350 market. When we consider that a cutting edge N5P wafer costs approximately $24,000 to process, it does make far more sense to focus on margins than eke out that last bit of performance. Navi 33 is approximately 204 mm sq. which makes it a mid-sized chip for this market. The Intel Arc A770 is double that size on 6nm at 406 mm sq. On the other hand the NVIDIA AD106 chip which powers the RTX 4060 series is made on a NVIDIA specialized 5nm node which TSMC refers to as 4N and is around 188 mm sq. Once we start talking about transistor counts we get a better feeling where things sit. Navi 33 comes in at 13.3 billion transistors, the A770 is up at 21.7 billion, and the AD106 is a surprising 22.9 billion. AMD most certainly has the least expensive chip of the three due to size, complexity, and finishing costs. As we go through the results keep these numbers in mind. The RX 7600XT is a fully functional Navi 33 with 32 compute units, 2048 shading units, 128 TMUs, 64 ROPS, and 32 RT cores (that are essentially repurposed shading units dedicated to ray tracing). AMD has architected their RDNA3 designs quite differently than NVIDIA and Intel in that they do not feature any tensor cores or dedicated RT cores. Instead they have focused on good overall rendering performance and utilizing the software side to implement advanced features that match what NVIDIA offers. Whether this is a good utilization of resources and transistor budgets can be debated, but for today it is the path that AMD has tread. Originally I had thought the RX 7600XT would be a cut down Navi 32 with more CUs available to it at a lower clock speed, thereby allowing it to underperform the 7700 XT all the while having lower power draw and 16GB of memory (on a 128 bit bus). AMD obviously thought better than that idea and utilized the Navi 33 in a more optimized hardware configuration that allows the chip to stretch its legs a bit and provide 16GB of memory on that same 128 bit bus running at 2250 MHz effective (288 GB/sec, not counting the bandwidth from the large caches that AMD implemented in the design). The base, game, and boost clocks all did receive a nice increase over the stock RX 7600. Power delivery and cooling are improved on these parts to help it achieve performance that matches and exceeds the competition at that price point. AMD is refreshing this particular part to more adequately compete against the Intel A7x0 and the NVIDIA RTX 4060 series. It also is aiming to replace the much more expensive RX 6700 family of parts (Navi 22 is a 7nm part at 335 mm sq). This allows AMD and their partners some flexibility in how they provide a part with reasonable margins to compare positively in performance to those cards around it. In some areas they look to outperform the competition by providing 16GB of memory for the growing number of applications that are pushing through the 8 GB of memory that is common for this price range. This is a logical refresh as there was a large hole between the $269 RX 7600 and the $449 RX 7700XT. While AMD has been filling that particular hole with RX 6700XT, RX 6750XT, and RX 6800 cards, these are not long term solutions for AMD and their partners. These cards based on older chips are much more power hungry and constitute larger die sizes that make it harder on board partners to deliver a product with acceptable margins. The combination of all these choices makes the RX 7600XT an interesting part for those with much older cards who cannot afford the $400+ offerings that are widely available. The extra memory that is essentially being provided at cost (no premium over cost of materials) plus the higher performance makes this a reasonable and desirable product for consumers in the midrange market. XFX was kind enough to provide us with a sample for the RX 7600XT launch, and it follows in the footsteps of their previously well reviewed units. XFX has three levels of trim for their cards; MERC is the highest end units with extreme performance, QICK is the Quicksilver series with enhanced thermal designs and performance, while SWFT are the Swift models aimed at the no-frills budget user. The QICK 309 RX 7600XT is in that middle level which borrows from the top end designs, but does not have the bells and whistles that increase the price. It also will not feature as high of overclocks as those top end units. It is still a well apportioned card with excellent cooling and a reasonable power draw. First of all this card arrives in the overly large and protective box that XFX consistently delivers. I have no complaints as the card is very well protected against shipping damages. It is a more expensive way to do things, but in the end it likely cuts down on RMAs due to incidents during shipping. The design follows the last several years of models from XFX by featuring triple fans, large heatsink, shrouds, and a solid metal backplate. There are 3 x 90 mm fans (hence the 309 name) that adorn the front of the card, which also features the artistically dimpled shroud. Airflow from the fans is routed through vertical fins with openings on the top and bottom of the card. This is not as heavy a card as we have seen with other models. Higher TDP units require denser fins, cold plates, and heat pipes. This particular card is about a third of the weight of the MERC 319 RX 6800XT that I reviewed a few years back. It is still a hefty unit for the price point. It is not nearly as long as the RX 7700XT I also reviewed a few months back. This is not a bad thing as the power draw starts around 190 watts, but partners are given some leeway in how much they juice up their boards. The board does feature 2 x 8 pin PCI-E power connectors, which honestly seems a lot. 2 x 8 pin setups can theoretically draw as much as 375 watts. The rear metal plate is relatively thick and provides a good amount of structural support. It has thermal tape touching the back of the GPU on the PCB, so it also offers a nice amount of cooling for that particular component. The heatsink features four heatpipes bonded with a large nickel-plated copper heatspreader. A vapor chamber may be more effective in removing heat, but for this level of product it is not necessary. Testing will show that this setup cools the GPU more than adequately for the power draw we are seeing. The board has a dual firmware feature. In previous versions this switched between high power or quiet firmware, but in this implementation it is simply a redundant BIOS. Most users will not have a use for this unless they applied a firmware incorrectly and bricked the card. Those looking to perhaps push the card a bit more can utilize one of those firmwares to explore the limits potentially with a firmware editor. This is of course not recommended in the least, but eventually there will be firmware floating out on the internet that is able to increase the power limit of the card and thereby overclocking potential. The back plate features 3 x DP 2.1 and 1 x HDMI 2.1a ports. RDNA 3 chips feature AV1 encoding as well as a host of hardware decoding abilities. The overall design is quite pleasing to the eye and is very effective in staying cool and quiet. It does not feature any RGB lighting on the design, which is of interest to some people out there. It also lowers overall board cost, complexity, and the need for a software component to control the RGB functionality. I consider that a small win for minimalists everywhere. In terms of performance XFX has tweaked the game and boost clocks. Base clock stays at 1720 MHz, game clock goes to 2539 MHz (2250 reference), and boost heads up to 2810 MHz (2655 reference). Officially it is supposed to be a 165 watt card, but XFX and other partners have elected to go well above that. 190 watt will be the nominal running power for this card, but that is before any potential user tweaking is applied. AMD provides driver tools to help explore the upper limits of each chip’s capabilities, but some work will need to be done by the user. I was provided with a new firmware that will be used in the shipping versions of this card, but before that I had a new one which applied quite a bit more power to the card during use. I am sure that this particular firmware will be available to download for those looking to push this chip as far as it can go. There are not very many steps between the stock boost clock and hitting 3 GHz. Memory speed can also be increased and should be, as the 128-bit memory bus is a bit constraining at higher resolutions. This is not a 4K card, but it is very comfortable with many applications at 2560×1440 with high or ultra levels of quality. I recently updated my test setup from the Ryzen 5 5600X to the Ryzen 7 5800X3D. While a lot of results at these resolutions and quality settings will not change dramatically, it will help in corner cases where the CPU was struggling in gaming situations. The latest available drivers were used for the Intel, NVIDIA, and AMD cards. The RX 7600XT was a press release driver that was a few builds newer than the available Adrenaline drivers from AMD. Components: Drivers: No scaling settings were used in testing; this is pure performance without FSR/DLSS/XeSS enabled. Results will vary dramatically with such tech enabled across the board. This is an older DX11 benchmark, but it produces some very consistent results. Ultra settings with 4X MSAA enabled. Intel still needs some work on their drivers when addressing older software. Regardless, the 7600XT outpaces the old and reliable 3060 12GB while lagging behind the higher end cards. The 7600XT does not quite reach the performance of the RX 6700XT in this particular test. This is a DX12 benchmark with some pretty serious shader work going on. The High preset is pretty easy on the cards, but once we get to Extreme they all are hammered. At 1080 High all of the cards are fast with the 7700XT outpacing them all. The 7600XT is competitive with the 6700XT and 3060 Ti. Perhaps what is shocking is how well the A770 does. At 2560 Extreme levels the A770 trounces them all, perhaps hinting at still potential performance gains that this card has with much more mature drivers and realtime compilers. The 7600XT outclasses the 3060 and comes very close to the 6700XT. No review can be without Far Cry 6 numbers. So I included them here. The test was run with HD textures and DXR enabled. This should actually show some real differences between the 8GB cards and those above. The 3060Ti takes a big hit here as compared to the rest of the cards which feature 12GB and above. The 7600XT comes close to the 6700XT again as well as outpacing the old 3060 12GB. At the higher resolution that advantage shrinks as the rendering power of the (underrated for the time) 3060Ti exhibits. We still are seeing very playable rates across the board. This was one of the first titles to embrace DirectX Ray Tracing with a relatively robust implementation. DXR gives a pretty dramatic hit in performance, but really enhances the experience in a wet and rainy London environment. Ultra preset with DRX Max features enabled. ​ Results fall in line as before. The 7700XT is the best performer, but we see the 3060Ti take a serious 1% low drop due to the 8GB of memory. The 7600XT stays above 30 fps in such conditions. At 2560 we see all cards except the 7700XT fall below playable levels. Interestingly enough the A770 fares well due to how much rendering power it has at the chip level. Software makes the world go round… You have to hand it to RSG, RDR2 is still one of the better looking games out there. The art assets are amazing and the very natural looking lighting adds to the overall experience. Max settings were used, though sometimes the engine does some funky things with unfamiliar hardware. I tested this multiple times at this resolution, but the 7600XT had some odd hiccup that pushed its min at 1080P to 46.9. At the higher resolution the min jumped up again consistently. Great title, but sometimes the engine does odd things. In this particular title the 7600XT does very well against all the competition except for the 7700XT. Codemasters refreshes this title yearly to include the latest cars, liveries, and tracks. It also improves the tech behind the title each and every year. This year it implements DXR tech to improve visuals by another layer. Ultra preset was selected with DXR set to High. The Brazil race in Wet was selected as the environment. This particular title really hammers on the compute abilities of the cards tested. Memory size is also not a factor as the 3060Ti takes a good lead. The 7600XT does take a small step above the 6700XT in this particular test, but the 3060 seems to fare a little bit better. Arc does ok against the others. The latest open world racer with advanced rendering techniques! FH5 is a lovely title that embraces all of the new tech in a shiny, pretty package that allows the driver to venture all over Mexico and its vast environs. Ultra preset, 4XMSAA enabled for testing (includes DXR functionality). The 7600XT again outclasses the A770 and RTX 3060, but can not touch the cards above it at 1080P and 1440P. Still, the frame rates at 2560×1440 with these settings are very, very good for the gaming experience. The latest ray tracing enabled benchmark from 3DMark and UL certainly hammers even the latest cards. The default benchmark was run on all cards. This is the least favorable benchmark for the 7600XT card. It gets close to the 3060, but falls short of everything else. Even the A770 (which has pretty robust RT abilities due to its architecture). Well isn’t this just a classic benchmark these days? This is the vanilla benchmark vs. the Extreme that is available. We get a more typical rasterization result as compared to RT based benchmarks. The 7600XT performs well against the 6700XT and 3060Ti. It is interesting to see the A770 score where it does. I guess this is the best theoretical performance that this card can have, and it does well against the units in the same price range. Always an interesting metric to cover when comparing video cards. We can potentially have large swings due to process nodes and transistor counts, as well as the final clock speeds that the partners decide upon. The 7600XT has the lowest idle draw (entire system). The A770 with the latest drivers seems to have taken a step back from their supposed “fix” of idle numbers. The desktop was displayed at 144 Hz monitor, which probably caused the higher idle consumption for that card. At peak the 7600XT was the 2nd lowest result of the group. The 3060 is lower, but its performance is almost always lower than the 7600XT in testing. The cards were tested at load with the shader-heavy Superposition Extreme benchmark. Idle was measured after the system had been at rest for at least 10 minutes. The 7600XT in this case performed very well against the competition, except for the XFX 7700XT which featured a much more robust cooler. The highest result was from the AMD reference 6700XT. The RX 7600XT release is an interesting one. We do need cards with larger memory pools, but can we get the performance uplift we desire with cards that are less than $400? It turns out that the answer is complicated. There are scenarios where the 7600XT is faster than the other cards in its price category and the extra memory has some real world benefits. There are other scenarios where it cannot catch up to the cards that are in its price range that are three years older. It turns out the RX 7600XT is a mixed bag when we look at a generational uplift versus the previous generation. The RX 6700XT essentially matches it in every metric except for power consumption. Theoretically the 16GB 7600XT will outperform the 12GB 6700XT in upcoming applications which will leverage the larger memory pools, but for now that is not the case. AMD has also just added official support for Fluid Motion Frames to their latest drivers (RX 7000 Series and RX 6000 Series). This is the frame generation tech that AMD has recently introduced to compete with DLSS 3 frame generation from NVIDIA. Those comparing and contrasting the performance of the 6700XT vs. the 7600XT will have to consider this feature. Having played Starfield with FMF enabled at 2560×1440 with Ultra details enabled, it is a much smoother experience with the 7600XT. The power consumption of the 7600XT is very good compared to the previous parts, but does not match the overall efficiency of the higher priced RX 7700XT. Sadly, the price of the 7700XT is not that great compared to the $50 higher 7800XT. Not all of us can afford products above the $329 starting point of the 7600XT, which opens up the possibility that this might be a good option for those who are budget constrained. It has 16GB of memory, which has shown to be an advantage in titles which do go above and beyond 8GB/12GB (and there will be more of these). It also leverages the software/hardware advantages with FSR3.0 Native. This certainly is not a perfect release. It will not likely sell in droves until stock of the 6700XT dries out. This does not dilute the value as a product due to its memory size, the ability to outperform the RTX 3060 in a wide variety of cases, and the overall performance and power characteristics that it brings to the table. For those users with a RX 480/580 or below, or a GTX 1070 and below, it is a worthwhile upgrade at a reasonable price. AMD continues to add a lot of value due to software upgrades, and those will continue with RDNA3 based products. It is a very solid midrange offering at a reasonable price with significant feature additions. As for the XFX offering, I really love the design and performance. It is the coolest running product with some serious headroom for overclocking activities. The build quality and components included with the design are outstanding. It is very quiet under load and silent at idle. Cooling is not an issue, and overclocking will allow the user to hit 3 GHz plus on core speed and a few extra MHz with the memory. This is what we consider the responsible disclosure of our review policies and procedures. The product was provided by XFX for the purpose of this review. XFX had no control over the content of the review and was not consulted prior to publication. Neither PC Perspective nor any of its staff were paid or compensated in any way by XFX for this review. XFX has not purchased advertising at PC Perspective during the past twelve months. If this article contains affiliate links to online retailers, PC Perspective may receive compensation for purchases through those links. Share: Josh started writing about the computer field in 1997, opened his own site in 1999 (Penstarsys.com), and joined PC Perspective in 2008.  He handles a lot of the general tech and some of the deep dives into products such as CPUs and GPUs.  He appears on the PC Perspective Podcast live every Wednesday night at 10 PM ET/7 PM PT. February 11, 2013 March 19, 2013 September 30, 2009 June 22, 2012 This XFX version seems like a quality hardware.   But it still sounds like I should try to tell my self to wait another cycle of AMD video cards in the hopes of higher performance @ a lower price point with the 8000 series. Another excellent review Josh just wondering in a GPU such as this with 16GB GDDR6 memory why is the memory bus only running at 128bit I would have thought this GPU would have a 192bit bus or higher. That particular GPU does not feature anything more than a 128 bit memory bus. Something like the RX 6700XT is a cut down version of the 6800 series, so instead of a 256 bit bus it uses only the 192 bits. Your email address will not be published. Required fields are marked * COMMENT Name * Email *    Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Copyright © PC Perspective 2000-2024 "
}