{
    "title": "AMD talks AM5 APUs and AM4 longevity",
    "date": "1/19/2024",
    "url": "https://www.pcworld.com/article/2212653/amd-talks-am5-apus-and-am4-longevity.html",
    "text": "When you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence. CES is where the biggest players in tech strut their stuff and AMD is no exception. But the company had a surprise for us this year: new CPUs for the AM4 socket, still seemingly going strong after an incredible seven years of active support. AMD’s Donny Woligroski, Technical Processing Marketing Manager for Desktop and Laptop Consumer Processors, took some time to talk to PCWorld’s Adam Patrick Murray for our latest YouTube video. On AM4 specifically, Woligroski said that the huge remaining installation base was a big part of the decision to continue supporting the platform with the new Ryzen 7 5700X3D and three other chips. “The AM5 solution is for those who want to tee up for the future,” he said, but AM4 will remain supported at least for the time being. When will the train stop? Possibly when the cost of producing (or even finding) the older DDR4 memory eclipses that of DDR5. As for the AM5 socket, that’s the home of AMD’s latest and greatest consumer desktop chips, he says that market forces delayed the launch of the company’s combined APU designs. That and the fact that Ryzen 7000 CPUs include more robust integrated graphics via the RDNA 2 architecture. But DDR5 “unlocks greater graphics performance,” so the new Ryzen 8000 series gets RDNA 3 integration. The most powerful of these chips, the Ryzen 7 8700 G, has access to a Radeon 780M graphics core. What about the AI-boosting NPUs (Neural Processing Unit) built into some of AMD’s laptop and now desktop chips? Why is it time to bet big on what seems to be a still-emerging use case? “Like everything else in PC hardware it’s the chicken or the egg — if you don’t build the hardware, developers can’t develop it.” For more interviews from CES and coverage of the latest in tech, be sure to subscribe to PCWorld on YouTube. Michael is a former graphic designer who's been building and tweaking desktop computers for longer than he cares to admit. His interests include folk music, football, science fiction, and salsa verde, in no particular order. Business Laptop Mobile PC Hardware Deals Digital Magazine - Subscribe Manage Subscription Gift Subscription Newsletters "
}