{
    "title": "AMD issues official Radeon RX 7900 XT and XTX price drops",
    "date": "1/18/2024",
    "url": "https://overclock3d.net/news/gpu-displays/amd-issues-special-promotional-pricing-for-its-radeon-rx-7900-xt-and-xtx-graphics-cards/",
    "text": " AMD has today confirmed that they have issued a “special promotional pricing program” this quarter for certain Radeon GPUs. Specifically, these promotional prices are for their Radeon RX 7900 XT and Radeon RX 7900 XTX GPUs. This promotion will allow selected retailers of offer reduced prices for AMD’s top RDNA 3 graphics cards. With this promotion, AMD’s Radeon RX 7900 XT will be available for as little as Â£719.99 in the UK, and AMD’s Radeon RX 7900 XTX will be available for Â£899.99. Gamers can expect these prices to roll out across retailers over the coming days. These prices will only be available this quarter. AMD has also noted that their long-awaited Fluid Motion Frames driver update will be launching this month. This update will allow AMD to enable Fluid Motion Frames Frame Generation across all DirectX 11 and DirectX 12 games. This is a feature that is unavailable on competing Intel or Nvidia graphics cards. This driver update is due to launch on January 24th.  Alongside their promotional pricing, AMD are also offering PC gamers free copies of Avatar: Frontiers of Pandora for free with certain Ryzen and Radeon products. This means that until January 30th, Radeon RX 7900 XT and XTX GPUs will be available with reduced pricing and ship with a free game. Below are all the AMD CPUs and GPUs that are available with the company’s Avatar game bundle. More information about this bundle is available here. We expect AMD to launch a new GPU game bundle in early February 2024. Eligible AMD Processors Eligible AMD GPUs  AMD’s newly announced price decreases are Radeon’s direct response to Nvidia’s RTX 4070 Ti SUPER graphics card. This GPU will launch on January 24th with an MSRP of $799 (Â£769 in the UK). With their new pricing, AMD hopes to counter Nvidia’s RTX SUPER launch with lower high-end RDNA 3 GPU prices. While AMD has claimed that these price decreases are temporary, it is likely that these new Radeon GPU prices will become normalised over the next few months. After all, the threat of Nvidia’s RTX 40 SUPER series will not disappear once this financial quarter ends. With this price cut, AMD has stressed that their high-end RDNA 3 based graphics cards offer gamers substantially more VRAM than their Nvidia counterparts. While the RTX 4070 Ti SUPER and RTX 4080 SUPER feature 16GB of VRAM, AMD’s high-end 7900 XT and XTX GPUs feature 20GB and 24GB of memory respectively. You can join the discussion on AMD’s promotional pricing for their Radeon RX 7900 XT and RX 7900 XTX graphics cards on the OC3D Forums. A Northern Irish father, husband, and techie that works to turn tea and coffee into articles when he isn’t painting his extensive minis collection or using things to make other things. No crappy Google banners here, only PC related advertising you may actually find interesting. Please disable Ad Blockers in order for us to keep producing the same level of quality, informational reviews and news. Worst case they actually look pretty and fill the empty gaps <3 "
}