{
    "title": "AMD Next-Gen Kraken Point APU Details Revealed",
    "date": "1/26/2024",
    "url": "https://gamerant.com/amd-kraken-point-apu-details/",
    "text": "Though still a long way away from coming to the market, some initial details about AMD's upcoming Kraken Point APUs have started to surface. Amid a busy 2024 for AMD, some details have emerged that the next-gen APUs, codenamed Kraken Point, will feature both Zen 5 and Zen 5C processing cores and RDNA 3.5 graphics. While these Kraken Point processors are not due out until 2025, sources said that AMD will aim to bring Kraken Point to the mainstream laptop market, which should give PC gamers a new way to play on the go. While not on the market yet, rumors that AMD has already started production of its Zen 5 CPU lineup continued to ramp up. Codenamed Granite Ridge by AMD, these CPUs are speculated to be released sometime in April 2024, and could be sold as the Ryzen 9000 series of desktop processors aimed at both PC gamers and businesses. Currently, the Ryzen 7000 series of desktop CPUs fall under the Zen 4 category, with processors such as the Ryzen 5 7600X and the Ryzen 7 7800X3D chief among them. For laptops, APUs such as the Ryzen 7040 series have filled that niche. But, the laptop market will soon be in for a new addition. According to Wccftech, some details about AMD's upcoming Kraken Point APUs have started to make the rounds on social media. On Twitter, a user named Olrak29_ claimed that the Kraken Point lineup is stated to have 8 cores and 16 threads. These cores would be divided into four Zen 5 cores and four Zen 5C cores, with the latter having a lower clock speed, but higher efficiency compared to the former. In addition to the Zen 5 CPU architecture, Kraken Point's graphics will be based on RDNA 3.5, and not the next generation of AMD graphics technology known as RDNA 4. For a point of comparison, the RDNA 3 graphics architecture is what powers GPUs such as the AMD Radeon RX 7900 XT. In addition to Kraken Point, both the 2024 and 2025 APU lineups for AMD will include processors from the Strix Point and Hawk Point lines. While the Kraken Point APUs will likely be available on desktops, AMD will also focus on bringing them to the laptop market, and compete with Intel's upcoming Arrow Lake processors. With Intel ditching the LGA1700 socket and AMD keeping the AM5 socket well into 2025, it remains to be seen how the new processors will perform on a technical level. Between the upcoming Kraken Point APUs and the imminent release of the Ryzen 7 5700X3D, consumers will have plenty of AMD products to sort through. Only time will tell how the market will react to the Kraken Point APUs once they are released. The Ryzen 9 7945HX3D is an upcoming mobile processor from AMD that will be the first to feature 3D V-Cache in a laptop. The technology was introduced last year with a desktop processor, and it showed a significant performance boost over non-X3D chips. The 7945HX3D is no exception as it is 15% faster than the 7945HX, even though it has a 200MHz lower base clock speed. It packs 16 cores and 32 threads, 55W-75W TGP, 89 degree Celsius maximum operating temperature, and 128MH of L3 cache.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. James Ratcliff joined Game Rant in 2022 as a Gaming News Writer. In 2023, James was offered a chance to become an occasional feature writer. James hails from Texas and has been writing professionally for over a decade. Chrono Trigger director Yoshinori Kitase asks fans what would be the best way to remake the classic JRPG for modern gaming audiences. Some new gameplay details about Assassin's Creed Red leak online, suggesting the game will overhaul many of the series' core systems. Hideo Kojima is one of the most innovative developers in the video game industry, but which of his many titles is considered the hardest? Several new Helldivers 2 weapons leak online ahead of a potential reveal or game update from Arrowhead Game Studios. The Elder Scrolls Online will drop major content on March 11 in anticipation of the Gold Road chapter, which is set to release this June. Want to get the most iconic Pokémon in the entire franchise? If so, here's all the intel on how to obtain a Pikachu Ph.D. in Pokémon Go. "
}