{
    "title": "Hard disk drives are next in line to become mostly enterprise hardware — as \nNvidia (and AMD) could be planning to ...",
    "date": "1/13/2024",
    "url": "https://www.techradar.com/pro/hard-disk-drives-are-next-in-line-to-become-mostly-enterprise-hardware-as-nvidia-and-amd-could-be-planning-to-focus-on-ai-leaving-consumers-as-second-class-citizens",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. With hard drive shipments down, and enterprises keen to get in on the AI action, will the likes of Nvidia and AMD eventually ditch the consumer market altogether? Hard drives may become a technology that’s almost exclusively the preserve of enterprise and businesses over the next few years, and there’s every chance that consumer-grade graphics cards will follow suit. Hard drive shipments declined sharply over the last five consecutive quarters, based on TrendFocus figures, as reported by Blocks and Files, with this trend suggesting the best SSDs are successfully eating into the wider market. This is despite many promising hard drive technologies on the horizon including SMR and HAMR options soon to be among the best hard drives. Something similar might be happening in the GPU market as with the hard drive market – with Nvidia, for example, reported to be pivoting away from making some of the best graphics cards for consumers. Nvidia’s CEO Jensen Huang emailed staff last month to declare the company was pivoting to deep learning, and that the company was “no longer a graphics company”, according to the Guru of 3D. With the company enjoying a huge degree of success in manufacturing the industry-leading GPUs used for AI training and inference, especially with the recent generative AI boom, the company could easily tap into this newfound goldmine moving forwards. Indeed, as we have previously reported, despite both Nvidia and its key rival AMD being a fixture in this particular market, the sales of graphics cards have been poor lately. It could well be that, when it comes to Nvidia at least, the GeForce series is in its final few generations of life. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! This is because, considering the shortage in supply, there’s likely more money to be made from enterprises vying to get in on the AI action than on cash-strapped consumers right now – especially when the improvements between recent generations of GPUs have been incremental at best. The forthcoming RTX 5000 series – and then the RTX 6000 series – could well be it for Nvidia’s consumer-grade graphics lineup, with the company instead spelling out a roadmap for annual releases of enterprise-grade GPUs. Keumars Afifi-Sabet is the Technology Editor for Live Science. He has written for a variety of publications including ITPro, The Week Digital and ComputerActive. He has worked as a technology journalist for more than five years, having previously held the role of features editor with ITPro. In his previous role, he oversaw the commissioning and publishing of long form in areas including AI, cyber security, cloud computing and digital transformation. Cisco alerts users to password-spraying attacks targeting VPN services How AI smart video is powering business excellence PyPI stops signing up new users to try and block malware campaign By Craig HaleMarch 29, 2024 By Craig HaleMarch 29, 2024 By Rowan DaviesMarch 29, 2024 By Chris NortonMarch 29, 2024 By David NieldMarch 29, 2024 By Craig HaleMarch 29, 2024 By David NieldMarch 29, 2024 By Craig HaleMarch 29, 2024 By Darren AllanMarch 29, 2024 By Maxime VermeirMarch 29, 2024 By Lee McClendonMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}