{
    "title": "AMD, Nvidia to Bring AI to Consumer PCs, CES 2024",
    "date": "1/9/2024",
    "url": "https://aibusiness.com/verticals/amd-nvidia-to-bring-ai-to-consumer-pcs-ces-2024",
    "text": "Nvidia unveils three new Super graphics cards while AMD showcases the new Radeon RX 7600 XT January 9, 2024 Chipmakers AMD and Nvidia are trying to woo PC users with AI offerings. Both rivals unveiled lots of new hardware at CES 2024 to bring AI to consumer-grade computers. Nvidia unveiled three new graphics cards – the GeForce RTX 4080 Super, RTX 4070 Ti Super and RTX 4070 Super – designed to enable 4K gaming and power creative workloads. AMD, meanwhile, showcased the Radeon RX 7600 XT graphics card, which is capable of rendering high graphics games and powering professional content creation. AMD also unveiled the new Ryzen 8000G processors for desktop PCs. Here’s how they compare: The new AMD graphics cards contain 64 AI accelerators optimized for AI workloads. It’s capable of powering generative AI solutions and upscaling consumer applications. The RX 7600 XT also has integrated RX 7600 XT to enable better-looking and crisper text when streaming at low bitrates and resolutions. Also included is AI-powered noise suppression technology to reduce ambient noise during streaming. AMD’s new Ryzen 7 8000-series desktop processors come with an XDNA neural processing unit to power AI workloads when using apps like Adobe or Blender. Nvidia’s new hardware is designed to power AI workloads faster. With 836 AI TOPS, the RTX 4080 Super, for example, can generate images with Stable Diffusion XL 1.7 times faster, Nvidia claims. Related:Microsoft Adds AI to PC Keyboard – First Change in 30 Years Each new Nvidia graphics card contains more cores to increase speeds, with the RTX 4070 Ti Super getting an increased frame buffer to 16GB. Jeff Fisher, senior vice president for GeForce at Nvidia, said the company has shipped more than 100 million RTX GPUs, calling them “pivotal in the burgeoning field of generative AI.” The graphics cards can then be used to power Nvidia’s AI software solutions, like the new Chat with RTX playground, which enables users to connect an RTX-accelerated large language model to their own data. Fisher also introduced TensorRT acceleration for Stable Diffusion XL and SDXL Turbo in the popular text-to-image interface Automatic1111, which provides up to a 60% boost in performance. For games, AI-powered Deep Learning Super Sampling (DLSS) is built in to provide improved in-game immersion. With DLSS, seven out of eight pixels can be AI-generated, accelerating full ray tracing by up to four times with better image quality. Nvidia’s new graphics cards are retailing around the same price points as the hardware they’re replacing. The major difference however is the new RTX 4080 Super, which will retail at $999 – some $200 cheaper than the $1,199 RTX 4080. Related:AMD Continues AI Push with New Chips for Data Centers, Laptops The new RTX 4070 Ti Super will retail for $799, while the RTX 4070 Super comes in at $599. AMD, however, is touting the new RX 7600 XT as a more reasonable “upgrade solution” for PC users, with the graphics card coming in at just $329. However, this is just the suggested retail price and could rise depending on supply and demand and regional differences. “Discerning gamers around the world are looking for a simple goal of smooth lag-free gameplay at affordable prices to enjoy the most of their gaming experience”, said Jack Huynh, senior vice president and GM of the computing and graphics group at AMD. “The Radeon RX 7600 XT graphics card delivers on that goal.” As enterprises get to grips with deploying AI to improve their offerings, the generative AI revolution is now trickling down to consumers. AI is nothing new in consumer-grade PCs, with Microsoft’s Cortana among early examples of solutions firmly in the hands of customers. 2024 looks set to be the year that generative truly penetrates the consumer market, however. Microsoft is set to introduce a dedicated Copilot key to Windows PCs – the biggest change since 1994 when it added the Windows key. Users can press the key to bring up generative AI capabilities. AMD and Nvidia are adding to the growing list of hardware makers creating AI-ready chips to power PCs. Intel, Apple and Qualcomm have already made strides, and now AMD and Nvidia, two of the biggest players on the market, want in.AMD is pushing hard to woo AI developers and model builders, having unveiled a series of AI chips for consumer-grade laptops late last year. Looking past these announcements at CES, Omdia analyst Alexander Harrowell expects even more releases of PCs with AI chips in them: “I expect we will see lots of people developing interesting stuff to run in terms of local AI and I think not least because there is the Mac ecosystem, which is right there as a market to start with… I could see a category of AI developer workstation PCs appearing or the existing workstation category getting more acceleration.” Ben Wodecki Jr. Editor Ben Wodecki is the Jr. Editor of AI Business, covering a wide range of AI content. Ben joined the team in March 2021 as assistant editor and was promoted to Jr. Editor. He has written for The New Statesman, Intellectual Property Magazine, and The Telegraph India, among others. He holds an MSc in Digital Journalism from Middlesex University. You May Also Like Mar 6, 2024 Mar 8, 2024 Mar 11, 2024 Mar 11, 2024 Mar 9, 2024 Reshaping Customer Experiences with AI Generative AI Journeys with CDW UK's Chief Technologist Qantm AI CEO on AI Strategy, Governance and Avoiding Pitfalls Deloitte AI Institute Head: 5 Steps to Prepare Enterprises for an AI Future Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG. "
}