{
    "title": null,
    "date": "1/1/2024",
    "url": "https://www.fool.com/investing/2024/01/01/2-reasons-to-buy-amd-and-1-reason-to-sell/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Chipmakers were among Wall Street's favorites in 2023 as their hardware is crucial to countless industries. And as interest in artificial intelligence (AI) soared, so did demand for graphics processing units (GPUs) -- the powerful chips necessary for training and running AI models. That propelled skyrocketing valuations for chip stocks like Advanced Micro Devices (AMD 0.50%), which climbed by 128% over the last 12 months. AMD has ramped up its expansion into AI as it prepares to challenge Nvidia's overwhelming dominance in that market in 2024. Meanwhile, its diverse business gives it solid positions in several other high-growth niches. As a result, there are plenty of reasons to be bullish about AMD's future. However, before you jump into its stock, it would be wise to consider both the positives and potential negatives. So here are two reasons to buy AMD and one reason to sell. AMD's biggest competitor, Nvidia, has seen its business explode in 2023 as it has cornered the market in AI GPUs. The company has an estimated 90% market share in AI chips, and its earnings have skyrocketed. In its fiscal 2024 third quarter, which ended Oct. 29, Nvidia posted revenue growth of 206% year over year while operating income rose 1,600% thanks to surging chip sales. Nvidia's success is promising for its rival, considering that AMD will begin shipping its most powerful GPU ever in 2024. The new chip is designed specifically to compete with Nvidia's offerings. Meanwhile, Microsoft -- a crucial client for AMD -- has already signed on to use the GPU to optimize the AI features in its Azure cloud service. Nvidia's near-total command of the AI chip market will likely be challenging to overcome. However, AMD doesn't need to dethrone the leader to enjoy big gains here. According to a projection from Grand View Research, the AI market will expand at a compound annual rate of 37% through 2030 to a value of more than $1 trillion. With that type of rapid growth, there will be plenty of room for AMD to claim a lucrative slice of the AI pie. The tech industry is advancing quickly, with companies increasingly seeking high-powered chips to take their products to the next level. As a result, AMD has formed partnerships with companies across the market, supplying its hardware to cloud platforms, video game consoles, laptops, custom-built PCs, and more. In fact, AMD is the exclusive chip supplier for Sony's PlayStation 5 and Microsoft's Xbox Series X|S, some of the best-selling game consoles of the last few years. The success of these consoles has boosted AMD's gaming revenue by 30% over the last three years as its operating income has climbed 72%. A position in AMD's stock allows investors to profit from the growth of multiple industries. Its shares have risen nearly 730% since 2019, significantly outperforming the Nasdaq Composite and S&P 500. And the company is only just getting started, with AI likely to propel the stock further along its current trajectory. AMD has a solid long-term outlook. Its chips power an array of devices and systems, and it could see consistent and significant financial growth for decades. However, its stock price soared in 2023 even as it made heavy investments in AI that have yet to start positively impacting its earnings. As a result, its shares are quite expensive by some valuation metrics right now.  Data by YCharts. These charts compare the price-to-earnings ratios (P/E) and price-to-free cash flows of some of the biggest names in AI and tech. AMD has by far the highest figures for both valuation metrics, meaning its stock offers the least value. The company looks likely to make serious headway in the AI segment with its soon-to-be-launched AI GPU. However, it's hard to justify its high price point. It might be worth investing in an alternative AI stock for now, and keeping AMD on your radar to reconsider when its valuation comes down to a more attractive level. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}