{
    "title": "AMD Radeon GPUs Score Huge Ray Tracing Performance Gains With MESA “RADV” \nVulkan Drivers, Reaching Up To 200%",
    "date": "1/6/2024",
    "url": "https://wccftech.com/mesa-radv-vulkan-drivers-scores-big-time-ray-tracing-performance-gains-up-to-200-percent/",
    "text": "AMD's Radeon GPUs are witnessing some huge ray tracing performance gains with the latest MESA RADV Vulkan drivers. The RADV Vulkan driver designed for AMD's graphics cards has started to see big improvements in recent times, especially when it comes to hardware support, constant optimization, and bug fixes. Ray-tracing in Linux is something that has always been held back due to a lack of \"mature\" driver and software resources, but it looks like MESA has your back, as the new Radeon Vulkan driver has been supercharged to show big-time performance improvements with AMD's latest Radeon GPUs. Phoronix reports that the new update to the MESA 24.0 was in the works for almost a month by the developer Friedrich Vock, and while the change isn't that significant in terms of the work put into it, it is disclosed that developers have optimized the conversion of 1D ray launches to 2D so that now more threads in a GPU are utilized, resulting in enhanced performance. The first performance tests using the new MESA \"RADV\" Vulkan driver can be seen below as shared by the MESA community at FreeDesktop.org: AMD Radeon RX 6700 XT \"RDNA 2\" GPU Before/After Gaming Performance: The developer reports that after implementing the new drivers, a 30% performance bump is witnessed in Ghostwhire Tokyo. Moreover, after testing the new drivers with AMD's Radeon RX 6700 XT, a widespread ray-tracing performance improvement of up to 15% was seen in multiple titles such as Hellblade: Senua's Sacrifice and The Witcher 3: Wild Hunt. AMD's Radeon RX 7900 XT showed significant performance gains, with figures boosting up to a 200% margin, credits to the new driver state, and the continuous optimizations it has received over the period. AMD Radeon RX 7900 XT \"RDNA 3\" GPU Before/After Gaming Performance: If we look at the broader scale, MESA's RADV Vulkan driver is shaping up to be a viable alternative to AMD's Vulkan \"AMDVLK\" driver, since not only third-party developers are maintaining support for outdated hardware, but they are also bringing in performance improvements with each update. AMD needs to stay competitive to maintain its dominance, but at least for now, it seems like MESA is ahead of Linux. News Source: Phoronix Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}