{
    "title": "The best graphics card in 2024: top GPUs for all budgets",
    "date": "2/24/2024",
    "url": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. What's the best graphics card for the money right now?  1. The list in brief\n2. Best overall\n3. Best Nvidia\n4. Best cheap AMD\n5. Best Intel\n6. Best performance\n7. Best gaming\n8. Best 'cheap' creative\n9. Best 'cheap' 4K gaming\n10. Best cheap Nvidia\n11. How we test\n12. Today's best graphics card deals The best graphics card will give you blazing-fast gaming, high-end content creation, and even help you develop all kind of AI models using machine learning—no matter your budget. There's a graphics card for everyone and every need, but our top pick, the AMD Radeon RX 7800 XT, strikes the perfect balance between performance, price, and resolution, letting you stretch into 4K content while dominating 1440p gaming for a price that might strain a budget, but isn't likely to break it. On either side of the 7800 XT, you have the best 4K graphics card, the Nvidia GeForce RTX 4090, or you have the best cheap graphics card, the AMD Radeon RX 7600, which offers budget gamers playing at 1080p access to all kinds of incredible tech for well below $300. And there are plenty more cards to choose from in between. Whatever you're looking for, I have tested and retested more than two dozen graphics cards over the past 18 months across the entire GPU market, so I know these cards more intimately than is probably healthy. In fact, I know it's not; but I do this for you, dear reader, because I'm here to help you find the best graphics card for your rig, whatever you mean to use it for. Best overall  The best graphics card overall\nThe AMD Radeon RX 7800 XT is the perfect midrange graphics card, bringing the ideal balance of performance and price. Read more below Best Nvidia GPU  The best Nvidia graphics card\nWhile the RTX 4070 Super doesn't pack the same performance as the best 4K cards, it's 1440p performance is outstanding. Read more below Best cheap AMD  The best cheap AMD graphics card If you want the best graphics card by price, then this is it, matching stellar 1080p performance with value. Read more below Best Intel  The best Intel graphics card Team Blue has finally brought its graphics engine into a graphics card, offering great performance for the price. Read more below Best performance  The best graphics card by performance The Nvidia RTX 4090 is undeniably the most powerful GPU around, but its price makes it prohibitive for most. Read more below Best gaming  The best graphics card for gaming The AMD Radeon RX 7900 XTX is an absolute gaming dynamo with fantastic 4K performance at an acceptable price. Read more below Load the next 3 products... Best 'cheap' creative  The best 'cheap' graphics card for creatives The RTX 3090 is still a premium card years after it launched, but you can often find these card at a substantial discount now. Read more below Best 'cheap' 4K gaming  The best cheap 4K gaming card The 4070 Ti has major gaming chops and can handle 4K very well thanks to faster GDDR6X memory. Read more below Best cheap Nvidia  The best cheap Nvidia graphics card The RTX 4060 is a fantastic card that's easy to find under $300/£300, which is less than some RTX 3060s sell for. Read more below This guide was updated on February 24, 2024 to add the Nvidia RTX 4070 Super to the list. John has been working with computers since he was a teenager, long before he ever started writing about computer hardware or working on his Master's degree in Computer Science. Needless to say, he knows computers inside and out, and he has personally tested (and retested) all of the graphics cards on this page, regardless of whether he wrote our original review, and has validated the results you'll find here. Why you can trust TechRadar \n\n\nWe spend hours testing every product or service we review, so you can be sure you’re buying the best. Find out more about how we test. Below you'll find full write-ups for each of the best graphics cards in our list. We've tested each one extensively, so you can be sure that our recommendations can be trusted.  If you want to learn more about GPUs before you buy, check out our what is a graphics card page for more details. Our expert review: ✅ You want to play at 4K: This card has serious 4K gaming chops, especially at this price.\n\n✅ You don't want to completely sacrifice ray tracing: AMD is finally offering both great rasterization and ray tracing performance.\n\n✅ You're tired of Nvidia's GPU price inflation: The RX 7800 XT isn't cheap, but its price is far more reasonable than Nvidia's RTX 4070. ❌ You are looking for the best creative GPU: The introduction of AI accelerators certainly help this card, but Nvidia still dominates creative workloads.\n\n❌ You want the best ray tracing and upscaling possible: If ray tracing and upscaling are your bag, then the RTX 4070 is going to be the better buy here.\n\n❌ You're on a tight budget: While this card is much cheaper than its direct competition, it's still not close to what anyone would call 'cheap'. The AMD Radeon RX 7800 XT was AWOL for most of 2023, coming nearly a year after the announcement of AMD's flagship RX 7900 XTX and RX 7900 XT cards, but that just made it all that much sweeter when it finally launched and gave gamers everywhere the midrange graphics card they've been waiting for years now. Powered by AMD's RNDA 3 GPU architecture, the RX 7800 XT avoided Nvidia's stubbles this generation and shipped the card with 16GB of GDDR6 VRAM and a wide enough memory bus to allow 4K textures to load quickly and render efficiently. That means that even though AMD is technically marketing the RX 7800 XT as a 1440p graphics card, it is more than capable of gaming at 4K. If our testing, the RX 7800 XT battled the previous graphics card champion, the GeForce RTX 4070, to an effective Rocky-style draw (while coming up about 2% better in overall gaming performance). While the RTX 4070 has better ray tracing, the RX 7800 XT is a very capable ray tracer in its own right, with absolutely outstanding rasterization performance, so you're not missing out on anything like you were in the last generation AMD cards. To top it all off, the RX 7800 XT has a much lower MSRP than Nvidia's rival card, making this card a no brainer when it comes to offering outstanding performance at a great price. If there's a caveat here, it's that the 7800 XT's gen-on-gen performance isn't as good as some might have hoped for, but even with that its performance still makes it Best-in-Class as far as we're concerned. Our expert review: ✅You want the best midrange graphics card overall: Given the strength of this card in all categories, on balance, it's the best you're going to find in the midrange. ✅You want very strong ray tracing performance: With the maturity of its ray tracing cores, the RTX 4070 Super is the best ray tracing GPU in the midrange, for sure. ✅You want some creative performance as well: With its strong CUDA backbone, the RTX 4070 Super is a great option for those looking to get into creative content work, especially 3D modeling. ❌ You don't want to spend a fortune: Given the price of the competition, there are better graphics cards for your money than the RTX 4070 Super\n\n❌ You don't care about ray tracing or compute: The strongest asset this card brings to the table are its ray tracing and tensor cores, but if you don't care about ray tracing or machine learning tasks, the RX 7800 XT will offer a better overall gaming performance. The Nvidia GeForce RTX 4070 Super meets the high expectations we had for this card when it was announced at CES 2024, offering compelling performance at the same price as its predecessor. This newcomer outshines the RTX 4070, offering more SMs for enhanced processing and a swifter base clock speed. However, its 12GB GDDR6X VRAM limits its 4K prowess, so for optimal 4K performance, the upcoming RTX 4070 Ti Super or RTX 4080 Super might be worth the wait. Yet, for top-tier 1440p gaming, the RTX 4070 Super excels, thanks to its robust specs, DLSS 3 with Frame Generation, and Nvidia Reflex technology. And while the RTX 4070 Super generally outperforms the RX 7800 XT, particularly in ray tracing, AMD holds the edge in gaming performance, a gap that could narrow with AMD's imminent frame generation tech for FSR. Gamers must weigh these factors, considering the RX 7800 XT's lower price. Despite stiff competition, the Nvidia GeForce RTX 4070 Super stands out, especially for midrange users seeking a balance of gaming prowess, content creation capabilities, and sheer performance. Our expert review: ✅ You want outstanding 1080p performance: In 1080p gaming, especially straight rasterization performance, this card is absolutely fantastic. ✅ You want to dabble at 1440p: You won't be able to do everything at 1440p, but with tweaks, you can get some great QHD gaming. ✅ You're on a tighter budget: This is definitely one of the best cheap graphics cards you can buy right now. ❌ You want heavy ray tracing in your games: While the ray tracing is better than its predecessor, it's not all that great on this card.\n\n❌ You want a cheap creative graphics card: With 64 AI cores, you might be tempted to use this card for creative workloads, but it's going to struggle. The AMD Radeon RX 7600 is here to bring AMD RDNA 3 to the under-$300/£300 segment, and it's got plenty of performance despite its lower price tag. It's 1080p performance is absolutely fantastic for the price, even giving the Nvidia RTX 3060 Ti 12GB a run for its money. It's 1440p performance is also pretty decent considering that the card only has 8GB VRAM and a 128-bit memory bus. In terms of gaming performance, you can easily get 60 fps on all of the best PC games at 1080p, with most of those running on the highest graphics settings. For more demanding games like Cyberpunk 2077, there might need to be some settings tweaks, but it's still definitely doable, especially with AMD's FidelityFX Super Resolution. Its ray tracing performance is still behind Nvidia's last-gen midrange cards, but RDNA 3 has definitely closed much of the gap between the two, so you don't have to sacrifice ray tracing completely just by going with a cheaper AMD card. Our expert review: ✅ You want great 1440p performance: In 1080p gaming, especially straight rasterization performance, this card is absolutely fantastic. ✅ You're on a budget: For a card with this level of performance, the overall value is its biggest selling point. ✅ You want hardware ray tracing and upscaling: Intel's hardware ray tracing and AI processors are surprisingly powerful for a first-generation graphics card. ❌ You want to play older PC games: Intel's graphics driver has gotten much better, but it still lags behind Nvidia and AMD on older titles. ❌ You want a powerful creative GPU: While Intel's hardware is great, it's not very good for creative work. ❌ You don't want to deal with Intel's growing pains: Intel is constantly improving its drivers and game support for Arc graphics cards, but there are still bumps along the way that you might not want to deal with. The Intel Arc A770 has emerged as a refreshing competitor in the longstanding AMD vs Nvidia duopoly, offering surprisingly competent performance for a first attempt by Intel at a discrete flagship graphics card. Beyond the desire for market variety, the A770 genuinely stands out for its impressive features and competitive pricing. After extensive testing, I found that there was significant improvement over its fellow launch card, the Intel Arc A750, which did not fare too well in my review after encountering some driver-related setbacks. Now, it seems that Intel has made very substantial strides in improving the stability, compatibility, and overall performance of its Arc series, and there is undoubtedly more to come. The A770's performance, while not on par with the best AMD graphics card in the midrange, is actually commendably close to the Nvidia GeForce RTX 4060 Ti, particularly in areas like ray tracing and hardware upscaling. This allows the 16GB Arc A770 card I reviewed to venture into 4K gaming, achieving an average of 35 fps over several PC game benchmarks, with a 1% low average of 26 fps. While not groundbreaking, with some settings adjustments, this performance can be optimized for smoother gameplay at 4K. Its 1440p performance was even more solid, and its 1080p performance is even better still. The card does exhibit some challenges, especially concerning optimization for older DirectX 9 and 10 titles, but after having nailed down a lot of the issues with more modern titles, Intel has said publicly that improving DirectX 9 and DirectX 10 support is a major priority for the Intel discrete graphics team. While all that shakes out, hoever, you've still got a very budget-friendly GPU that can hold its own against many of the best graphics cards on and off this list, making the Arc A770 a great value options for gamers. Our expert review: ✅ You want the best graphics card on the market: There really is no competition here. This is the best there is, plain and simple. ✅ You want native 4K ray-traced gaming: This is literally the only card that can consistently run full ray tracing at native 4K resoluton. ✅ You are a 3D graphics professional: If you work with major 3D rendering tools like Maya, Blender, and others, this is your graphics card. ❌ You're not looking to do native, max-4K gaming: Unless you're looking to game on the bleeding edge of graphical performance, you probably don't need this card. ❌ You're on a budget: This is a very premium graphics card by any measure. ❌ You're concerned about power consumption: With a TGP of 450W, this card has a near bottomless appetite for power, power you'll need to pay for. Yes, the Nvidia GeForce RTX 4090 is expensive. It also requires a 16-pin connector or adapter. And, it’s very, very big. But, the first release from Nvidia’s new 4000-series is an absolute powerhouse that can tackle anything you need it to. It is the most powerful GPU out there, and likely will be for a very long time to come. In our testing, we found it performed significantly better than the Nvidia GeForce RTX 3090 with two to four times the performance in synthetic benchmarks and up to 100% improved framerates with some games. What’s more, DLSS 3 is a revolution in terms of gaming frame rates, and in games that support it, the RTX 4090 with Frame Generation turned on will absolutely push even the best gaming monitors to the limit of what they can do. That said, this is far more GPU than most people will probably ever need this decade, and at the price its selling for, you have to really, really want this card, especially at the prices it is selling for right now. If you simply have to have the most powerful graphics card there is, however, this is the card you want. Our expert review: ✅ You want a premium graphics card for under a grand: While it's MSRP is 'under $1,000', it's only just barely clearing that bar. ✅ You want outstanding 4K gaming performance: The AMD RX 7900 XT delivers outstanding 4K gaming with settings maxed out. ✅ You want to future-proof your rig for fast 8K gaming: The RX 7900 XTX is prepared to tackle 8K gaming when it starts coming into its own over the next few years. ❌ You are a Blender head: Seriously, if you need Blender for work or for hobbyist 3D modeling, you should buy the RTX 4090. ❌ You want the fastest possible fps, no matter the cost: FSR 2.0 on the RX 7900 XTX is fantastic, but DLSS 3 with Frame Generation simply outperforms AMD's tech by a wide margin. ❌ You're on a budget: The AMD Radeon RX 7900 XTX is a premium graphics card with a premium price, and there are great cards that are cheaper. The AMD Radeon RX 7900 XTX had a lot to prove when it hit the scene at the end of 2022. It succeeds brilliantly, coming in as the most powerful gaming GPU on the market for under $1,000, while outperforming Nvidia's RTX 4080 overall despite being substantially cheaper. The new 2nd-gen ray accelerators in the RX 7900 XTX makes 4K gaming on ultra settings with ray tracing a reality on an AMD card, something that the last flagship AMD card, the RX 6950 XT, couldn't quite accomplish. Its rasterization performance is also second only to the goliath that is the RTX 4090, but that is really an industrial strength GPU in consumer hardware's clothing. It's not without faults, including falling behind the Nvidia RTX 4000-series in terms of ray tracing (while still beating out the RT performance of the Nvidia RTX 3090) and some uneven creative workload performance. But overall, this is the one graphics card we would recommend to any gamers out there who are looking to finally upgrade their GPU after years of graphics card shortages and they're willing to pay the relatively cheaper premium for it. Our expert review: ✅ You want to be an 8K gaming pioneer: It's not perfect, but 8K on this card won't give you a grinding slideshow. ✅ You are a creative professional: The massive compute performance and VRAM pool here is great for creative work.\n\n✅ You don't want to ever worry about 4K gaming performance: All the eye candy that's inadvisable for most folks to turn on works like a breeze with the RTX 3090. ❌ You're on a budget: The Nvidia GeForce RTX 3090 is one of the fastest graphics cards in the world, but it's also extremely expensive. ❌ You're playing at any resolution under 4K: The RTX 3090 is a massively powerful graphics card, but it's wasted on less than 4K. ❌ You don't need the very best: If you're fine with solid gaming performance, you don't really need something this powerful. The Nvidia RTX 3090 is still one of the best graphics cards out there, even though it is a last-gen GPU. With a whopping 24GB of RAM, no game or, more importantly, heavy graphics project will suffer performance issues. In fact, we were even able to get some 8K performance at 60 fps out of the 3090. That said, it is an incredibly expensive unit, even three years after its release, and it is quite large too, so it will probably be too much GPU for most users. The Nvidia GeForce RTX 3090 is, in essence, a replacement for the Titan so it’s meant more for the creative user tackling intensive 3D and video rendering than for the avid gamer. Even so, it comes with a massive reduction in price compared to the Titan, making it a bargain for creative professionals used to shelling out a lot of money for the tools of their trade. But with the Nvidia RTX 4090 on the market, there is at least some downward pressure on the price of the RTX 3090, so if you're a creative professional on a tighter budget than you'd like, this card is a great alternative to the RTX 4090 and RTX 4080. Read the full Nvidia GeForce RTX 3090 review Our expert review: ✅ You want an accessibly priced premium card\nAt MSRP, the RTX 4070 Ti is one of the cheapest next-gen premium GPUs on the market. ✅ You want a great value for your buck: The RTX 4070 Ti has some of the best performance for price of any of the newest graphics cards from Nvidia and AMD. ✅ You want next-gen features like DLSS 3: Nvidia's hardware is often on the bleeding edge of the industry, but things like DLSS 3 and Nvidia Reflex are Nvidia's not-so-secret force multiplier here. ❌ You plan on doing a lot of 8K gaming: With just 12GB VRAM and no DisplayPort 2.1, 8K gaming with modern AAA titles on the RTX 4070 Ti is going to be a challenge. ❌ You're on a very tight budget: While the RTX 4070 Ti is the cheapest premium graphics card on the market, it's still close to a grand. The Nvidia RTX 4070 Ti is easily the best cheap 4K graphics card you can buy right now. Thanks to third-generation ray tracing cores, fourth-generation tensor cores, and advanced Nvidia Lovelace architecture, you get most of the best features of Nvidia's flagship GPUs of this generation without a too-exorbitant price tag. That's not to say the Nvidia RTX 4070 Ti is necessarily cheap, because it's not; especially when you factor in the fact that there is no Founder's Edition card selling for Nvidia's MSRP. You'll need to find a third-party card for this SKU, and those can run well above MSRP. In our tests, the RTX 4070 Ti muscled its way through all but the most taxing 4K gaming workloads, scoring a geometric mean minimum frame rate of 54 fps at 4K, which is right at the threshold of the ideal fps for gaming as its minimum performance. You'll likely get even better performance with some tiny settings tweaks, and thanks to DLSS 3 with Frame Generation, there really isn't a game out there that this card can't play at 4K on the highest settings. Our expert review: ✅ You want the best 1080p gaming under $300: This card is a 1080p champ in its weight class, even if it walks right up to the line of the middle midrange. ✅ You want fantastic ray tracing support: Nvidia pioneered real-time ray tracing in games, and it really shows here. ✅ You want next-gen features like DLSS 3: Nvidia's hardware is state-of-the-art in the GPU market, and you get to have it at a great price here. ❌ You want the best value: While the RTX 4060 is very well-priced, the AMD RX 7600 offers a much better price-to-performance ratio. ❌ You don't care about ray tracing or upscaling: Ray tracing is honestly overrated and a lot of games don't offer or even need upscaling, so you might not need this card's best hardware. The Nvidia RTX 4060 has frustrated some folks out there who were looking for the kind of gen-on-gen performance uplift we saw with more expensive Nvidia Lovelace offerings like the RTX 4070, but these demands are misplaced. The RTX 4060 is a fantastic midrange graphics card that's easy to find under $300/£300 right now, which is less than some Nvidia RTX 3060 cards still on the market. It's not the kind of card that will blow you away if you already have an RTX 3060 or better, but if you're coming from older Nvidia or AMD hardware (as most gamers will be), this card will be nothing short of a revelation, all for less than the launch price of the RTX 3060 it replaces. It's not a perfect card, obviously. It's biggest misfire is the 8GB VRAM and 128-bit memory bus, which pretty much limits how much performance you'll be able to squeeze out at 1440p, but it's still doable, especially with the advances that DLSS 3 brings to the table. While the best graphics card isn't always the one with the most raw performance, there's no question that performance matters for potential buyers, and it matters a lot. If what you're looking for is the best performance from a consumer GPU, then the Nvidia RTX 4090 found up above in our list is easily the performance champion. It's not even close either; everyone else is playing for second place, and unless you've got stacks to burn, most people will be fortunate if they can afford even the second and third place finishers. Generally speaking, the best graphics card for gaming is going to depend on several factors. Things like what kind of games you like to play, what resolution you play at and whether or not you care about fancy features like ray tracing and DLSS are incredibly important. For example, if you just want to play all the latest games at 1080p with high settings, you can get by with an Nvidia GeForce RTX 3060 or an AMD Radeon RX 6600 XT. But if you want to play everything totally maxed out with ray tracing at 4K, you're probably going to want to go for something like the RTX 3080 Ti instead. The age-old question of whether Nvidia or AMD is the best brand for graphics cards will likely never go away. Right now, both GPU manufacturers are basically on equal ground, and what will ultimately be right for you probably won't be right for someone else. Generally, if you like ray tracing, Nvidia will probably have the edge for you and in the past AMD was better for people on a budget. When it comes to the best graphics cards, it's incredibly important to make sure we're testing everything on an equal playing field. That's why, whenever a new graphics card comes out, we test it in a suite of around 11-12 games and across several resolutions, all on current drivers. That means that we re-test all current-generation graphics cards whenever a new one comes out. And we make sure that all of the cards are tested on the same hardware, which means the same processor, with the same memory at the same speed, on the same motherboard, with the same SSD. That way, we can be sure that we're measuring how the graphics card itself is performing, and we can more reliably compare it against its rivals. We also make sure to log how much power its consuming and the temperatures it reaches under load, to make sure we can recommend it to people that may be concerned about high temperatures in their PCs. Finally, we take a look at the features that each graphics card offers, though usually these don't really change generation-to-generation. However, the performance while enabling something like ray tracing definitely can change.  Since the best graphics cards are readily available again, you can be more discerning about your choice. Yu would have more options across different price ranges so you must decide how much you're willing to spend. Of course, you also need to consider your graphical demands as well. You shouldn't settle for what you can afford right now if it's not powerful enough to handle your daily needs. You're better putting it off for a bit and saving up until you can afford the GPU that's the right fit. As for which one that is, you need to take a look at the vital specs: GPU memory, GPU size, Thermal Design Power or TDP, and ports and power connectors are all important. As are the number of teraflops (or GFLOPS) it has since that indicates the theoretical performance of that graphics card. If you want the best ray tracing experience, Nvidia is still the king of the castle. However, we're sure that AMD will be upping its ray tracing game in order to compete. If you're into VR games and experiences, you should also make sure that it supports VR as well. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. John (He/Him) is the Components Editor here at TechRadar and he is also a programmer, gamer, activist, and Brooklyn College alum currently living in Brooklyn, NY.  Named by the CTA as a CES 2020 Media Trailblazer for his science and technology reporting, John specializes in all areas of computer science, including industry news, hardware reviews, PC gaming, as well as general science writing and the social impact of the tech industry.  You can find him online on Threads @johnloeffler.  Currently playing: Baldur's Gate 3 (just like everyone else). Intel Battlemage leak gives us hope that maybe there’ll be a more powerful 2nd-gen Arc GPU after all Samsung officially reveals GDDR7 memory for GPUs, which is great news for gamers White House demands all government agencies must appoint an AI officer to help mitigate risks By Barclay BallardFebruary 27, 2024 By Krishi ChowdharyFebruary 26, 2024 By Barclay BallardFebruary 26, 2024 By Barclay BallardFebruary 26, 2024 By Barclay BallardFebruary 24, 2024 By Barclay BallardFebruary 23, 2024 By Barclay BallardFebruary 22, 2024 By Barclay BallardFebruary 21, 2024 By Jess Weatherbed, Dom Reseigh-LincolnFebruary 21, 2024 By Barclay BallardFebruary 21, 2024 By Krishi ChowdharyFebruary 19, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}