{
    "title": "AMD Ryzen 5 8500G: A Surprisingly Fascinating Sub-$200 CPU Review",
    "date": "2/7/2024",
    "url": "https://www.phoronix.com/review/amd-ryzen-5-8500g",
    "text": "After reviewing the Ryzen 7 8700G and the Ryzen 5 8600G as these new Zen 4 processors with RDNA3 integrated graphics, the latest AMD 8000G series CPU in the Linux benchmarking lab at Phoronix is the Ryzen 5 8500G. The Ryzen 5 8500G is a 6-core / 12-thread processor with RDNA3 graphics that retails for just $179 USD. Here's a look at how it's performing against other AMD and Intel processors on Ubuntu Linux. The Ryzen 5 8500G ends up being decent on the GPU side but making me genuinely excited is the Zen 4C prospects in the low-power space for AI workloads at the edge, low power servers, and other different deployments for great low-power performance. Under load this AVX-512 wielding budget desktop processor was typically pulling 50 Watts or less!  Like the 8600G that retails for $229 USD, the Ryzen 5 8500G is also a 6-core / 12-thread part with RDNA3 graphics. However, with the 8500G it has a 3.5GHz base frequency compared to 4.3GHz with the 8600G while both boost up to 5.0GHz. The other big difference is that while the Ryzen 5 8600G is made up of all Zen 4 cores, the 8500G consists of two Zen 4 cores and then four Zen 4C cores. The denser, more power efficient Zen 4C cores are found on the 8500G (and Ryzen 5 8300G) while still maintaining the same 65 Watt TDP rating as the rest of the 8000G series.  The Ryzen 5 8500G also has Radeon 740M RDNA3 integrated graphics with four graphics cores clocking up to 2.8GHz compared to the Radeon 760M graphics on the Ryzen 5 8600G with 8 graphics cores at 2.8GHz. The flagship Ryzen 7 8700G as a reminder has Radeon 780M integrated graphics with 12 graphics cores at 2.9GHz. Another difference with this sub-$200 processor is there is no Ryzen AI support unlike with the 8600G/8700G models. Most though won't be particularly missing out on Ryzen AI right now... The software support for now is limited and it was only very recently that AMD released an XDNA Linux driver that is still to-be-tested at Phoronix. So for the near-term the lack of Ryzen AI with the Ryzen 5 8500G isn't any real loss but over the longer term if the software ecosystem support for it expands and AI continues to be widely embraced by more Linux desktop software, it will be more of a penalty without it.  The Ryzen 5 8500G does still have a 6MB L2 cache and 16MB L3 cache like the 8600G model. While the default TDP is 65 Watts, there is a configurable TDP from 45 to 65 Watts. The cTDP benchmarks of the 8000G series will be part of follow-up benchmarks on Phoronix.  Also as follow-up benchmarks will be looking in close detail at the Zen 4 vs. Zen 4C core performance on the Ryzen 5 8500G among other interesting benchmarks.  Phoronix Premium allows ad-free access to the site, multi-page articles on a single page, and other features while supporting this site's continued operations. The mission at Phoronix since 2004 has centered around enriching the Linux hardware experience. In addition to supporting our site through advertisements, you can help by subscribing to Phoronix Premium. You can also contribute to Phoronix through a PayPal tip or tip via Stripe.  Legal Disclaimer, Privacy Policy, Cookies | Privacy Manager | Contact Copyright © 2004 - 2024 by Phoronix Media. All trademarks used are properties of their respective owners. All rights reserved. "
}