{
    "title": "AMD CEO to keynote at Computex 2024 on June 3rd, Zen5 incoming?",
    "date": "2/22/2024",
    "url": "https://videocardz.com/newz/amd-ceo-to-keynote-at-computex-2024-on-june-3rd-zen5-incoming",
    "text": " TAITRA, the organization behind Computex has announced today that AMD CEO Dr. Lisa Su will deliver the opening keynote on June 3rd this year. AMD’s keynote will be the first, but not the only, keynote. Computex will kick off on June 4th this year and will feature several keynotes from Qualcomm, Intel, MediaTek, NXP, SuperMicro and Delta. The first keynote, however, will be delivered by Dr. Lisa Su. AMD CEO delivered an opening keynote for Computex 2022, but the first keynote in 2023 was delivered by NVIDIA CEO Jensen Huang. The keynote sessions at COMPUTEX feature top industry leaders. This year, Dr. Lisa Su, Chair and CEO of AMD is invited to deliver the Opening Keynote. She was recognized by the IEEE with its highest semiconductor honor, the Robert N. Noyce Medal, and led the transformation of AMD into the high-performance and adaptive computing leader. Dr.Su will highlight the next generation of AMD products enabling new experiences and breakthrough AI capabilities from the cloud to the edge, PCs, and intelligent end devices. — Computex The Computex Keynote is always filled with surprises and is considered to be the best time to announce new products. In 2022, AMD announced Ryzen 6000 PRO series, the low-power APU called Mendocino. The company also announced Smart Access Store technology and several AMD Advantage laptops.   Dr. Lisa Su at Computex 2022 Opening Keynote, Source: AMD  More importantly, at Computex 2022 AMD also introduced their Zen4 architecture along with Ryzen 7000 series. AMD also discussed its new AM5 platform in detail, revealing various new chipsets. It was also the first time AMD demoed the new platform. The new series was not released until September of the same year. Currently, there are no confirmed release dates for Zen5 desktop and mobile chips, but according to official roadmaps those should launch this year. AMD recently reaffirmed its commitment to those plans. According to the announcement, the keynote will be delivered in the morning of June 3rd, but the exact time is yet to be confirmed. Source: Computex We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}