{
    "title": "Lenovo ThinkPad Z13 Gen 2 Review: Sturdy Business Ultraportable Packs a \nPunch",
    "date": "2/4/2024",
    "url": "https://www.cnet.com/tech/computing/lenovo-thinkpad-z13-gen-2-review-sturdy-business-ultraportable-packs-a-punch/",
    "text": "Article updated on February 4, 2024 at 5:00 AM PST The Z13 breaks with the ThinkPad tradition in many ways without abandoning the things that make it a ThinkPad. Its AMD Ryzen Pro CPU delivers strong overall performance. CNET’s expert staff reviews and rates dozens of new products and services each month, building on more than a quarter century of expertise. The Lenovo ThinkPad Z13 Gen 2 is an outlier among ThinkPads. Lenovo introduced the Z13 ultraportable two years ago, and it immediately stood out from the staid ThinkPad pack with its AMD-only offerings inside an incredibly compact chassis that featured a funky webcam module, haptic touchpad and the option for a synthetic leather lid. Gen 2 keeps the same recycled aluminum enclosure and updates the AMD silicon to Ryzen Pro 7000 processors while swapping the leather-like treatment for a woven flax fiber material as an optional lid covering. Our review unit didn't feature the flax fiber lid but did come equipped with the top display option, a spectacular 2.8K OLED touch panel. The ThinkPad Z13 Gen 2 is a marvel for its exceptional build quality and trim dimensions. It feels like a tiny tank of a laptop, and I have no doubts about its ability to withstand the bumps and bruises of business travel. It's unquestionably well crafted and offers strong overall performance, but with a price that can quickly rise to nearly $2,000 with upgrades you'll likely want, it faces stiff competition among premium business ultraportables, including from Lenovo itself. The ThinkPad X1 Carbon Gen 11 and HP Dragonfly G4 are better picks for most business travelers because they offer roomier, 14-inch displays while weighing a few ounces less than the ThinkPad Z13 Gen 2. The ThinkPad Z series is available in 13-inch and 16-inch sizes and is the only ThinkPad line that offers AMD CPUs exclusively. Some lines offer both Intel and AMD, but the Z series is the only all-AMD line. The 13-inch ThinkPad Z13 Gen 2 starts at $1,241 (with the ever-changing Lenovo discount at the time of this review) for a model with an AMD Ryzen 5 Pro 7540U CPU, 16GB of RAM, a 256GB SSD and a 13.3-inch non-touch IPS display with a 1,920x1,200-pixel resolution. Our test system costs $1,874 and upgrades all four of the aforementioned items to a Ryzen 7 Pro 7840U chip, 32GB of RAM, a 1TB SSD and an OLED display with touch support and a 2,880x1,800-pixel resolution. All models are based on integrated Radeon graphics -- Radeon 740M for the Ryzen 5 configs and Radeon 780M for Ryzen 7. The ThinkPad Z13 Gen 2 starts at £1,439 in the UK and AU$1,799 in Australia. The AMD Ryzen 7 Pro 7840U in our test system features eight physical cores and 16 threads. The Pro version of this chip differs from the consumer Ryzen 7 7840U part with the inclusion of on-chip security and remote management features for businesses, including a Microsoft Pluton security chip that offers protection against physical and firmware attacks and receives Microsoft's weekly patches and updates. In testing, the ThinkPad Z13 Gen 2 produced strong scores on our application benchmarks, Geekbench 6 and PCMark 10. It proved to be much faster than models with 13th-gen Intel Core U-series chips and a step ahead of a system with a 13th-gen Core P-series processor (Scroll to the end of this review to see the performance results.) On Geekbench 6, it finished behind the Lenovo Slim Pro 9i 14 (Intel Core i7-13700H and RTX 4050), the HP Spectre x360 14 (Core Ultra 7 155H and Intel Arc graphics) and the M3 Apple MacBook Pro 14. On PCMark 10, it finished in a statistical tie with the Spectre x360 14 and put an even greater distance between it and the 13th-gen Intel Core P- and U-series laptops. Its performance on our graphics tests was so much better than that of laptops with integrated Intel Arc and Iris Xe graphics that I included the Lenovo Slim Pro 9i 14 in our results which has an RTX 4050 GPU to provide another reference point. On Cinebench, the ThinkPad Z13 Gen 2 finished closer to the Slim Pro 9i 14 than any of the integrated Intel graphics competition. On our 3DMark test, the Slim Pro 9i 14 was able to flex its muscles with a much higher score than the ThinkPad Z13 Gen 2, but the Z13 Gen 2 still had a clear advantage over its nearest competitor with an Intel GPU. The ThinkPad Z13 Gen 2 lasted nearly 9 hours on our online streaming battery test, which is merely an average result for an ultraportable that's meant to be used on the go and away from a wall outlet for long stretches of time. The blame for this middling result can't be squarely placed on the Ryzen 7 Pro CPU. Our test system features a high-res OLED display, which is a combination that drains the battery faster than a 1080p LCD panel would. The ThinkPad Z13 Gen 2 doesn't break the ThinkPad mold, but it is a bit out of the ordinary for a laptop brand that prides itself on sticking to the script. Even without the flax fiber lid, our test system offers a fresh take on the standard ThinkPad look. For one, the top panel and side edges are silvery gray (arctic grey in Lenovo's parlance) which adds contrast to the black keyboard deck and bottom panel. Those side edges are squared off as opposed to the tapered edges of most other ThinkPads. In addition to the contrasting gray accents, the webcam is encased in a module that is a brighter silver color and has a brushed finish. It protrudes from the front edge of the laptop to create a convenient handle to lift the lid. The black surfaces have a matte finish that is common to ThinkPads but lacks the soft-touch coating that they usually have. It adds up to a sharp overall look that maintains the ThinkPad DNA while updating it. If you are curious about the flax fiber option, I can only tell you what Lenovo has said about it since we received the standard aluminum lid. Lenovo describes it using \"sustainable woven flax fibers for a unique twist on the typical ThinkPad top cover.\" The flax fiber option also comes with bronze accents in places. The biobased flax fiber is a sustainable material, but that doesn't mean that the all-aluminum option doesn't also have some earth-friendly properties. The lid and keyboard deck are made from 75% recycled aluminum, and the bottom cover uses 55% recycled aluminum. The flax fiber treatment to the lid makes it look like Lenovo put this ThinkPad in a business suit. With the narrowest of screen bezels on all four sides of the display and the squared-off edges, the ThinkPad Z13 Gen 2 is about as compact as a 13-inch laptop can get. It measures just 11.6 inches wide and 7.9 inches deep and is quite thin and just over half an inch thick. While the Z13 is a compact travel companion, it's not the lightest at 2.7 pounds. It actually weighs more than Lenovo's own ThinkPad X1 Carbon and the HP Dragonfly G4, each of which features a larger 14-inch display and weighs only 2.5 pounds. The Z13 Gen 2 weighs the same as the slightly larger 13.6-inch MacBook Air and slightly less than the 2.8-pound Dell XPS 13 Plus. Some ultraportables aim for the lightest weight possible and feature thin aluminum frames that feel flimsy and cheap. The ThinkPad Z13 Gen 2 is the opposite of that. It feels rock solid. I much prefer the sturdy feel of the ThinkPad Z13 Gen 2 even if it means carrying around an extra ounce or two than a superlight ultraportable whose thin metal surfaces flex and creek. That's especially true for a business laptop that makes daily commutes and frequent work trips. The ThinkPad Z13 Gen 2's compact frame makes it a good fit for working on a tray table on an airplane, but the 13.3-inch display can start to feel a bit cramped for a full workday. It's better as a travel computer that you'll connect to an external display when you are in the office. The 13.3-inch display feels noticeably tighter than a 14-inch panel. For example, I'm able to keep multiple windows overlaid on one another on a 14-inch screen so that I can jump back and forth between them by clicking on their edges. That's harder to do on the Z13 Gen 2. I needed all the space the 13.3-inch display afforded for each window I was using, so I found myself needing to use each in full-screen mode, which made multitasking a bit more difficult. Aside from the space constraints you may feel, our test system's 2.8K OLED display is excellent. It's an upgrade over the baseline 1080p IPS panel and worth the $225 upgrade charge (and it's frequently discounted to $179). The text looked inky black and razor-sharp, and my testing confirmed Lenovo's claims that it covers 100% of the sRGB and P3 color spaces. It reached a peak brightness of 372 nits, which fell short of its 400-nit rating but still offers sufficient brightness for most situations. The display might feel cramped by the end of the workday, but the keyboard will feel as comfortable at the end as it did at the start of the day. It's up to the ThinkPad standard and offers a luxurious feel. Key travel is just about perfect with a response that's both lively and quiet. The keyboard is also spill-resistant and offers two-level backlighting. The touchpad represents a departure from the ThinkPad norm of including two mouse buttons above the touchpad for the TrackPoint pointing stick in the center of the keyboard. The ThinkPad Z13 Gen 2 features the little, red nub but jettisons its mouse buttons. Instead of physical buttons, a narrow top portion of the touchpad acts as mouse buttons for the pointing stick. If you don't use the pointing stick, you can disable this functionality and gain a little extra space for the touchpad. Fans of the pointing stick may bemoan the absence of physical mouse buttons, but I like this arrangement as a touchpad user because it allows for a much more spacious touchpad. The pointing stick also has a menu behind it. You can double-tap it to launch a quick menu to adjust settings for the laptop's microphone, camera and battery as well as enable voice typing, which I found to be slower and more difficult than using my fingers. You can select four of seven items to display in the menu, but I doubt it'll be much use to most users. The other noteworthy item for the touchpad is its haptic feedback. Instead of a physical click mechanism, it uses haptics. The implementation is good here -- better than the somewhat flaky haptics, for example, on the Dell XPS 13 Plus. The haptic feedback here felt springy and accurate. If you're familiar with a MacBook's haptic touchpad, then you'll likely find a similar feel with the Z13 Gen 2's touchpad with perhaps a bit more spring-to-the-click response than a MacBook's. The webcam located in the module above the display is a 1080p IR webcam that produces crisp, grain-free and well-balanced images. It has an IR cam, too, so you can use facial recognition for log-ins. You won't find a physical privacy shutter for the camera in the module, but hitting the F9 key acts as an electronic kill switch for the webcam. Meanwhile, the F4 key mutes the mic. A second biometric feature is integrated into the keyboard. There's a fingerprint scanner next to the arrow keys in the lower-right corner that provides another secure method to log in without needing to enter a password. Ports are minimal on the ThinkPad Z13 Gen 2. You'll find a USB-C 4 port on either side of the laptop along with a headphone jack on the right side. That's it. One of the USB-C ports is needed for charging the laptop, which can further limit your external connection options. In the end, the ThinkPad Z13 Gen 2 is a superbly crafted laptop with strong overall performance, but it isn't for everyone. This compact ultraportable is best for professionals who regularly travel for work and have a monitor (or two) to which they can connect the laptop when not on the road but in the office. Larger and lighter models such as the ThinkPad X1 Carbon Gen 11 and HP Dragonfly G4 are better all-purpose business ultraportables. The review process for laptops, desktops, tablets and other computerlike devices consists of two parts: performance testing under controlled conditions in the CNET Labs and extensive hands-on use by our expert reviewers. This includes evaluating a device's aesthetics, ergonomics and features. A final review verdict is a combination of both objective and subjective judgments. The list of benchmarking software we use changes over time as the devices we test evolve. The most important core tests we're currently running on every compatible computer include Primate Labs Geekbench 6, Cinebench R23, PCMark 10 and 3DMark Fire Strike Ultra. A more detailed description of each benchmark and how we use it can be found on our How We Test Computers page. "
}