{
    "title": "Former AMD VP Likens Nvidia to a 'GPU Cartel'",
    "date": "2/29/2024",
    "url": "https://www.extremetech.com/gaming/former-amd-vp-likens-nvidia-to-a-gpu-cartel",
    "text": "Thanks to the surging interest in AI across the tech industry, Nvidia has found itself sitting on a golden throne lately. Its AI accelerators are now coveted, and it could take up to a year for an order to be filled due to intense demand. This situation grants Nvidia a lot of power, as a company could fail to launch if it can't procure enough hardware to meet its demands. One company has come forward to say Nvidia is abusing this power by slowing down shipments of AI hardware if it learns a customer is talking to its competitors. Nvidia would surely deny this is happening, but now a former AMD VP has also stepped forward to confirm it and accuse Nvidia of operating like a \"GPU cartel.\" The brouhaha started this week when the Wall Street Journal ran an in-depth article about Nvidia and its co-founder Jensen Huang titled, \"Nvidia’s Stunning Ascent Has Also Made It a Giant Target.\" The article chronicled the company's meteoric rise and how the long wait times and sky-high prices for its AI hardware have caused the industry to begin to consider alternatives. Along those lines, an Nvidia competitor named Groq was mentioned in the article as saying Nvidia is stifling competition by slowing down shipments of AI hardware if it thinks a company is looking elsewhere for its GPU needs due to the long wait times. Groq CEO Jonathan Ross said he's had customers looking for an alternative chip source tell him that if Nvidia ever asked if they had spoken with Groq, they would deny it ever happened out of fear of retribution. In response to this report, AMD's former VP of the company's GPU business Scott Herkleman has now spoken out, accusing Nvidia of restricting GPU supply to maintain its dominant position in the industry by making its customers fearful of using its competitors. It would be bigger news if Herkelman, who used to be known for presenting the company's GPUs on-stage at press events, were still employed by AMD, but as Tom's Hardware notes, he left the company in 2023. In the WSJ piece, Nvidia's CEO didn't directly address this question but told the Journal the company tries to be fair in its allocation of GPUs but also doesn't prioritize companies that won't put them to use immediately. If a company orders Nvidia hardware and there's a long wait time, Nvidia reportedly refers them to cloud providers to fill their compute needs in the interim. According to the Journal, Nvidia also delivers GPUs to these same providers, so it gets its beak wet either way. We'll have to wait and see if Nvidia responds to the controversy, which seems unlikely. So far, nobody has presented concrete evidence of Nvidia's tactics, and thus, it's all hearsay for now. Perhaps Herkelman has more he wants to share, but this isn't the first time Nvidia has been accused of being a difficult company to do business with. We all recall EVGA abruptly announcing it would no longer sell Nvidia GPUs in 2022, stating it felt \"screwed over\" by the GPU company. In 2018, Nvidia got entangled in a controversy over its GeForce Partner Program, which would have required partners to dedicate their gaming brands (Asus Strix, Gigabyte Auros, etc.) to Nvidia GPUs if they wanted to receive new cards in the future. Nvidia eventually ended up cancelling that program due to widespread outrage, although nobody had accused the company of doing anything illegal with the ill-fated program. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}