{
    "title": "Apple Vision Pro return rates are relatively high, according to new estimate",
    "date": "2/18/2024",
    "url": "https://www.notebookcheck.net/Apple-Vision-Pro-return-rates-are-relatively-high-according-to-new-estimate.804645.0.html",
    "text": "Being an Apple Vision adopter from its first generation is a significant investment, not merely because of its  ~$3,500 price-tag but due to the time and effort involved in being fitted for the headset in person at an Apple Store. Accordingly, one would think the last thing a first-gen Pro owner would consider is ultimately backing out of that deal. However, according to Bloomberg's 'Apple correspondent' Mark Gurman, that is exactly what is happening. Vision Pro returns are not exactly proceeding in droves; however, with such a \"low-volume\", extremely premium product, they may be all the more notable when they do occur - especially in smaller Apple Stores, some of which have seen 1 or 2 a day as of late, according to Gurman. In fact, the journalist claims that 8 Vision Pros were once returned to the same store on the same day. There are a number of reasons why their buyers, some of which can arguably be described as \"die-hard\" Apple fans, have given up on owning the first-gen headset, which range from its being too heavy to causing too much eye-strain. Other grounds for Vision Pro returns have been found to include the current state of visionOS development, most specifically its lack of apps; design issues such as the light seal, which apparently fails to exclude glare (and is a potential point of durability failure); and the reported isolating effect of wearing the headset. On that note, it may indeed be more difficult to share or demonstrate the experience of Vision Pro use compared to that of an iPad, not to mention the original iPhone (so many of us having probably watched their favorite tech vlogger merely commentate on what they can see through the headset by now). With a second-gen Vision Pro an estimated year and a half away at this point, it will be interesting to see how many of these issues Apple can address by then. Buy a Meta Quest 2 on Amazon   Mark Gurman via Bloomberg Reddit via ZDNet "
}