{
    "title": "Screens? Where this new AMD-powered handheld PC is going we don't need \nscreens. Just silly Cyberpunk glasses",
    "date": "2/28/2024",
    "url": "https://www.pcgamer.com/screens-where-this-new-amd-powered-handheld-pc-is-going-we-dont-need-a-screen-just-silly-cyberpunk-glasses/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. You'd never look anyone in the eye again while gaming with this on your face. Tecno may well be a brand you've never heard of but if its newly launched Pocket Go runs as good as it looks, then there'll be a completely new segment for the portable gaming market. Because where every handheld PC you can buy right now has a built-in screen, this one abandons it for a set of AR glasses. Admittedly the launch itself (via Videocardz) is somewhat light on details but the product itself does actually exist, as Tecno has been promoting it at the MWC event in Barcelona. That's all about the mobile phone industry, which is Tecno's primary sector and has been for a long time. But now it wants a slice of the expanding handheld PC market with its Pocket Go. At first glance, it appears to be a very chunky controller with some AR glasses plugged into it, via a standard USB Type-C cable. But inside the hand unit, there's an AMD Ryzen 7 8840HS processor, 16GB of LPDDR5 RAM, and a 1TB PCIe 4.0 SSD. That APU sports eight cores, 16 threads, a max power of 35 W, and a Radeon 780M integrated GPU. It's basically the same chip as the 7840U that powers the likes of the Ayaneo Air 1S. I'm not entirely sold on the controller's design: The right thumbstick looks a little too close to the buttons and as most APUs in handheld PCs tend to get a bit toasty, your mitts are likely to get quite warm too. That's assuming the cooling system is similar to those that the competition uses but the Pocket Go could be using something a lot beefier. However, that would only make it heavier and noisier. We bring together innovators and industry leaders from around the world, showcasing the latest cutting-edge technology and trends. 🚀 🌌 We're excited to explore the limitless possibilities of the future. Let's embrace the unknown, push boundaries, and work together to create a… pic.twitter.com/GhRnTrIJjXFebruary 26, 2024 The compact nature of the controller is all down to the fact that Tecno's eschewed the use of a screen in its pocket PC. Instead, the visual output is handled by a pair of glasses that look pretty nifty and come with claims of being '50% smaller' and '30% lighter. Smaller and lighter than what, you may ask. That's a good question and it's one that Tecno isn't answering right now.  Steam Deck OLED review: Our verdict on Valve's handheld.\nBest Steam Deck accessories: Get decked out.\nSteam Deck battery life: What's the real battery life?\nBest handheld gaming PC: What's the best travel buddy? Apparently, the glasses are equivalent to a 215-inch TV, as viewed from a distance of six feet, but how true that particular statement is will depend heavily on the resolution and refresh rate of the screens in the glasses. At least you'll be able to use them on other devices, though I'm guessing that this will probably be limited to Tecno's phones and laptops. Something else that makes the Pocket Go stand out from the rest of the handheld crowd is the fact that the battery is replaceable, rather than being permanently stuck in place. Good job, as it's only rated to 50 Wh and it powers the glasses as well as the base unit. Sign up to get the best content of the week, and great gaming deals, as picked by the editors. There's no indication of price or retail availability, but I can't imagine that this is going to be cheap. If it's less than the thousand-dollar mark, I'll be very surprised. But even if it turns out to be rather pricey, if the specs, performance, and gaming experience are all good, then the handheld PC market could well have a new star in its midst. Nick, gaming, and computers all first met in 1981, with the love affair starting on a Sinclair ZX81 in kit form and a book on ZX Basic. He ended up becoming a physics and IT teacher, but by the late 1990s decided it was time to cut his teeth writing for a long defunct UK tech site. He went on to do the same at Madonion, helping to write the help files for 3DMark and PCMark. After a short stint working at Beyond3D.com, Nick joined Futuremark (MadOnion rebranded) full-time, as editor-in-chief for its gaming and hardware section, YouGamers. After the site shutdown, he became an engineering and computing lecturer for many years, but missed the writing bug. Cue four years at TechSpot.com and over 100 long articles on anything and everything. He freely admits to being far too obsessed with GPUs and open world grindy RPGs, but who isn't these days? Putin's ordered his government to look into creating Russia's own Steam Deck, SteamOS, and basically Steam itself Phil Spencer, forever the optimist, hints that he's interested in a Microsoft version of Big Picture Mode for handheld gaming PCs: 'I want my Legion Go to feel like an Xbox' Today's Wordle answer for Saturday, March 30 By Rick Lane29 March 2024 By Jeremy Laird29 March 2024 By Kerry Brunskill29 March 2024 By Tyler Colp28 March 2024 By Andy Chalk28 March 2024 By Tyler Colp28 March 2024 By Morgan Park28 March 2024 By Andy Chalk28 March 2024 By Rich Stanton28 March 2024 By Joshua Wolens28 March 2024 By Dave James28 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}