{
    "title": "'AI leads the way:' Nvidia, AMD, Broadcom in focus as Citi says 'stay long'",
    "date": "2/27/2024",
    "url": "https://seekingalpha.com/news/4072254-ai-leads-the-way-nvidia-amd-broadcom-in-focus-as-citi-says-stay-long",
    "text": "da-kuk As fourth-quarter earnings season winds down, Citi is telling semiconductor investors to stick with what's worked. \"While demand is mixed, we remain bullish on the group and expect overall semi revenue growth of at least 11% YoY in 2024 given units declined a whopping 19% in 2023, the biggest decline since 2001,\" analysts Christopher Danely and Atif Malik wrote in a note to clients. \"Our conviction has grown on our top themes for 2024 – AI, DRAM, and semi equipment while we are less convicted on the wireless/foundry spaces and Intel (INTC).\" Amongst artificial intelligence-linked names, Citi is still a believer in Nvidia (NASDAQ:NVDA), AMD (NASDAQ:AMD) and Broadcom (NASDAQ:AVGO), as it sees the AI market growing considerably. \"The AI market continues to grow and our checks indicate [total addressable market] expansion with government agencies, universities, and large/medium businesses all buying AI chips,\" the analysts wrote, adding that Broadcom's upcoming earnings are likely to be \"another positive catalyst.\" Micron (MU) is likely to keep benefiting from positive momentum in the dynamic random access memory space, especially as demand for high-bandwidth memory semiconductors picks up, notably in the AI space. \"The DRAM market continued to improve with beat/raises by Samsung and Hynix and we expect a similar occurrence when Micron reports next month,\" the analysts wrote. Micron is Citi's top pick in the semiconductor sector. Lam Research (LRCX) and Applied Materials (AMAT) are also likely to benefit from increased demand for demand for high-bandwidth memory, as well as higher spending on wafer fab equipment, Danely and Malik said. Despite the conviction in AI, there are pockets of weakness in the chip space, Citi said, including the traditional data center business. The data center space is losing some market to AI and going through an inventory correction, but Citi believes this is likely to end sometime in the first-half of this year, which could impact Intel and AMD, which also compete in the PC space. Citi expects a typical \"seasonal\" first-quarter for the PC space after the recent rebound in the industry. The wireless market, which accounts for roughly 18% of all semiconductor spend, is being driven by a rebound in Android handset demand. However, with China seen as an \"uncertain market,\" any recovery could wind up being muted, the analysts said. Another area of weakness for chips is the industrial market, as the auto end market appears to be \"rolling over.\" Industrial sales are down roughly 28% from their peak and auto sales are down roughly 10% from their peak. There's also concerns that the Philadelphia Semiconductor Index, which is made up of the 30 largest U.S. chip companies, is trading at a 43% premium to the S&P 500 — \"well above the average premium of 6%,\" the analysts said. "
}