{
    "title": "4DMT Presents Positive Interim Data from Randomized Phase 2 PRISM Clinical \nTrial of Intravitreal 4D-150 ...",
    "date": "2/3/2024",
    "url": "https://www.globenewswire.com/en/news-release/2024/02/03/2823166/0/en/4DMT-Presents-Positive-Interim-Data-from-Randomized-Phase-2-PRISM-Clinical-Trial-of-Intravitreal-4D-150-Demonstrating-Favorable-Tolerability-Clinical-Activity-in-Wet-AMD.html",
    "text": "February 03, 2024 17:00 ET\n\n\r\n            | Source:\r\n            \n4D Molecular Therapeutics, Inc.\n\n\n\n\n\n4D Molecular Therapeutics, Inc. EMERYVILLE, Calif., Feb.  03, 2024  (GLOBE NEWSWIRE) -- 4D Molecular Therapeutics (Nasdaq: FDMT, 4DMT or the Company), a leading clinical-stage genetic medicines company focused on unlocking the full potential of genetic medicines to treat large market diseases, today announced positive interim data from the Phase 2 PRISM clinical trial evaluating intravitreal 4D-150 in wet age-related macular degeneration (wet AMD) patients with severe disease activity and a high treatment burden. Data presented at the Angiogenesis, Exudation, and Degeneration 2024 Conference by Arshad M. Khanani, M.D., M.A., FASRS, consisted of 24-week landmark results from the randomized Phase 2 Dose Expansion cohort of the PRISM clinical trial. “We are thrilled today to announce positive interim results that strongly validate 4D-150’s potential as a safe, convenient, durable and transformational intravitreal therapeutic for wet AMD patients, with a goal of preserving vision for the longer term,” said David Kirn, M.D., Co-founder and Chief Executive Officer of 4DMT. “We believe 4D-150 has the potential to disrupt the current treatment paradigm in these patients and that these results continue to highlight the power and value of our intravitreal R100 vector invented at 4DMT. I would like to thank the patients and investigators who are participating in the PRISM trial who helped to achieve this important milestone.” “We are pleased by the robust clinical activity demonstrated in this severe disease activity patient population with high treatment burden. We believe these positive interim Phase 2 results demonstrate a differentiated product profile for the treatment of wet AMD, including in these most difficult to treat patients that have not been studied adequately in prior clinical trials,” said Robert Kim, M.D., Chief Medical Officer. “We look forward to discussions with regulators to align on a Phase 3 development plan expedited by FDA RMAT and EMA PRIME designations to advance 4D-150 with the goal of providing a compelling new treatment option for millions of patients suffering from these blinding VEGF-driven retinal diseases.” “Wet AMD is a chronic disease, and many of our patients require long-term, frequent intravitreal injections. Unfortunately, under-treatment and suboptimal disease control contribute to vision loss in the real world,\" said Arshad M. Khanani, M.D., M.A., FASRS, Director of Clinic Research at Sierra Eye Associates, Reno, Nevada. \"I am encouraged by the potential of a one-time intravitreal injection of 4D-150 for treating wet AMD. Results from the Phase 1 and interim results from Phase 2 cohorts of the PRISM study confirm that 4D-150 is well tolerated and maintains stable visual acuity in previously treated high-need patients. 4D-150 also significantly reduces treatment burden while effectively controlling disease activity without fluid fluctuations. I believe 4D-150 has the potential to revolutionize the treatment approach for our patients with wet AMD, and I am looking forward to participating in the Phase 3 trials.\" Phase 2 PRISM Clinical Trial Dose Expansion Cohort Background & Summary Baseline Characteristics The Dose Expansion cohort of the PRISM study is a randomized, controlled Phase 2 clinical trial evaluating 4D-150 in previously treated wet AMD patients with severe disease activity (≥325 µm central subfield thickness (CST) measured by optical coherence tomography (OCT) and presence of subretinal or intraretinal fluid) and a high treatment burden (≥6 anti-VEGF injections in the prior 12 months). The trial enrolled 51 patients with severe disease activity and treatment burden: Enrolled patients were randomized 2:2:1 to receive a single high (3E10 vg/eye) or low (1E10 vg/eye) intravitreal dose of 4D-150 or intravitreal aflibercept 2 mg every 8 weeks (control). Phase 2 PRISM Topline Interim Results (Data cutoff: January 19, 2024) PRISM Phase 1 Long-Term Follow-Up Update (Data cutoff: January 19, 2024) Additional 4D-150 Program Updates Upcoming 4D-150 Milestones A slide presentation with detailed results can be accessed here. Corporate Webcast Details to Discuss the Results: An archived copy of the webcast will be available for up to one year by visiting the “Investors & Media” section of the 4DMT website at the following link: https://ir.4dmoleculartherapeutics.com/events. About 4D-150 for Wet AMD 4D-150 is comprised of our customized and evolved intravitreal vector, R100, and a transgene cassette that expresses both aflibercept and a VEGF-C inhibitory RNAi. This dual-transgene payload inhibits four members of the VEGF angiogenic family of factors that drive wet AMD and DME: VEGF A, B, C and PlGF. R100 was invented at 4DMT through our proprietary Therapeutic Vector Evolution platform; we developed this platform utilizing principles of directed evolution, a Nobel Prize-winning technology. 4D-150 is designed for single, low-dose intravitreal delivery for transgene expression from the retina without significant inflammation. About Wet AMD Wet AMD is a highly prevalent disease with estimated incidence rate of 200,000 new patients per year in the United States. It is estimated that the total prevalence of wet AMD in certain major markets, including the United States and the European Union (major markets), and Japan, will be greater than 4 million individuals in the next five years. Wet AMD is a type of macular degeneration where abnormal blood vessels (choroidal neovascularization or CNV) grow into the macula, the central area of the retina. As a consequence, CNV causes swelling and edema of the retina, bleeding and scarring, and causes visual distortion and reduced visual acuity. The proliferation and leakage of abnormal blood vessels is stimulated by VEGF. This process distorts and can potentially destroy central vision and may progress to blindness without treatment. About 4DMT 4DMT is a leading clinical-stage genetic medicines company focused on unlocking the full potential of genetic medicines to treat large market diseases in ophthalmology and pulmonology. 4DMT’s proprietary invention platform, Therapeutic Vector Evolution, combines the power of the Nobel Prize-winning technology, directed evolution, with approximately one billion synthetic AAV capsid-derived sequences to invent customized and evolved vectors for use in our wholly owned and partnered product candidates. Our product design, development, and manufacturing engine helps us efficiently create and advance our diverse product pipeline with the goal of revolutionizing medicine with potential curative therapies for millions of patients. Currently, 4DMT is advancing five clinical-stage and two preclinical product candidates, each tailored to address rare and large market diseases in ophthalmology, pulmonology, and cardiology. In addition, 4DMT is also advancing programs in CNS through a gene editing partnership. 4D Molecular Therapeutics™, 4DMT™, Therapeutic Vector Evolution™, and the 4DMT logo are trademarks of 4DMT. All of our product candidates are in clinical or preclinical development and have not yet been approved for marketing by the FDA or any other regulatory authority. No representation is made as to the safety or effectiveness of our product candidates for the therapeutic uses for which they are being studied. Learn more at www.4DMT.com and follow us on LinkedIn. Forward Looking Statements: This press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended, including, without limitation, implied and express statements regarding the therapeutic potential, and clinical benefits of 4DMT’s product candidates, as well as the plans, announcements, and related timing for the clinical development of and regulatory interactions regarding 4D-150. The words \"may,\" “might,” \"will,\" \"could,\" \"would,\" \"should,\" \"expect,\" \"plan,\" \"anticipate,\" \"intend,\" \"believe,\" “expect,” \"estimate,\" “seek,” \"predict,\" “future,” \"project,\" \"potential,\" \"continue,\" \"target\" and similar words or expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. Any forward looking statements in this press release are based on management's current expectations and beliefs and are subject to a number of risks, uncertainties and important factors that may cause actual events or results to differ materially from those expressed or implied by any forward-looking statements contained in this press release, including risks and uncertainties that are described in greater detail in the section entitled \"Risk Factors\" in 4D Molecular Therapeutics’ most recent Quarterly Report on Form 10-Q as well as any subsequent filings with the Securities and Exchange Commission. In addition, any forward-looking statements represent 4D Molecular Therapeutics' views only as of today and should not be relied upon as representing its views as of any subsequent date. 4D Molecular Therapeutics explicitly disclaims any obligation to update any forward-looking statements. No representations or warranties (expressed or implied) are made about the accuracy of any such forward looking statements. Contacts: Media: Katherine SmithInizio Evoke CommsKatherine.Smith@inizioevoke.com Investors: Julian PeiHead of Investor Relations and Corporate CommunicationsInvestor.Relations@4DMT.com267-644-5097  "
}