{
    "title": "CPU Shipments Have Finally Surpassed Pandemic Levels: Analyst",
    "date": "2/8/2024",
    "url": "https://www.extremetech.com/computing/cpu-shipments-have-finally-surpassed-pandemic-levels-analyst",
    "text": "When we were all stuck at home during the pandemic, many people upgraded their PCs or bought new ones (some had to do the latter just to get a GPU). We had no choice, we told our significant other, because we needed a better computer if we would be home for a year or two. This was great for the PC industry, but when the pandemic ended in 2022, the market slumped since nobody needed to buy computer parts. Although this downturn continued through 2023, CPU sales have surpassed pandemic levels in Q4 of 2023, according to Jon Peddie Research (JPR). The latest numbers for CPU shipments show the PC market is well on its way to a full recovery from the post-pandemic slump. According to JPR, CPU sales hit rock bottom in Q4 of 2022, with 54 million units sold. Since then, that number has been climbing 7% every quarter, culminating in 66 million units for Q4 of 2023. It marks an overall increase of 22% in CPU sales year-over-year, according to Peddie's research. Tom's Hardware notes that the 66 million figure is 3.3 million more CPUs than were sold in the doldrums of late 2022. Also, since most CPUs now include integrated graphics, that market has grown by 18% over the past year. The market for integrated GPUs will continue to grow, too, according to Peddie. In the most recent quarter, it reached a market penetration of around 85%, with 60 million units sold. The report predicts that iGPUs will achieve a 98% market share over the next five years, which could be why Intel focused on the integrated GPU in Meteor Lake. AMD also just launched its first APUs for Zen 4 in the 8000G series, which are budget-friendly CPUs with RDNA 3 graphics made for folks who don't have a discrete GPU. Peddie calls the surge in CPU sales a bright spot in an otherwise depressing news cycle, given the ongoing conflicts in the Middle East and Ukraine. Though this doesn't seem particularly relevant, the report notes that the PC market is showing signs of health despite these developments, along with an ongoing reduction in inflation and an increase in US GDP. It all seems to reinforce the notion that many tech executives have espoused recently, which is that 2024 should see a major upgrade cycle for PCs. Unlike 2023, this year should bring new CPUs and GPUs from Intel, AMD, and Nvidia, along with a \"new\" version of Windows, though it might be labeled as an update instead of Windows 12. Plus, the PCs that were purchased in the pandemic period of 2021 are due for an upgrade, and the same goes for CPUs, too. Not to mention that \"AI PCs\" will arrive this year, but the jury is still out on how those will improve our lives. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}