{
    "title": "Best CPU for RTX 4070 Super - our top AMD and Intel processor picks",
    "date": "2/23/2024",
    "url": "https://www.videogamer.com/tech/cpu/best-for-rtx-4070-super/",
    "text": "Posted in Tech Video Gamer is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more With the release of the new Super series graphics cards from Nvidia, your processor might be due an upgrade too. If you’re sizing up your PC from an older generation GPU, it’s probably a good idea to seek out the best CPU for the RTX 4070 Super. To really make a GPU shine, you need the right components around it. It’s a good idea to get best monitor for RTX 4070 Super, and the best case for RTX 4070 Super, but the CPU is perhaps the most important, and the one thing most capable of bottlenecking the potential power of your new graphics card. The RTX 4070 Super has only recently been unveiled by Team Green ahead of CES 2024. Before that, though, you’re probably going to want to find out if your processor is up to the task. You’re going to want a decent processor to wring your RTX 4070 Super for all its worth. You’re going to be targeting 1440p for the most part, while also attacking 4K in a select few games. Maximising performance like this will require a processor that’s really cut out for the job, and you’ll want a top-range set-up stacked with DDR5 RAM compatibility too. Cores 8 Threads 16 Base speed 4.2GHz Boost speed 5.9GHz Cache 104MB TDP 120W BestBuy With an RTX 4070 Super, you’re going to want to focus on a processor that’s not going to be a compromise. While the 4070 Super is slightly more affordable than most of the heavy hitter Lovelace graphics cards, its still powerful enough to compete for mid-range to high-end gaming PC builds. Our first choice targets AMD Ryzen’s processors – slightly more affordable without a compromise on quality. The AMD Ryzen 7 7800X3D is by far one of the best CPUs you’re going to be able to find these days. With 96MB of L3 cache and 8MB L2 cache to make use of the X3D family’s 3D V-Caching, you’re going to be able to crunch through DLSS 3.5 with relative ease to crank up your frame-rates beyond the baseline. Its clock speeds range between 4.2GHz and 5.0GHz, thought the TDP range starts at 120W. This is going to put less strain on your power supply, letting you save a little on energy here and there. Using the AM5 socket, the Ryzen 7 7800X3D is also going to allow you to use DDR5 RAM which is now the memory mainstream. The Ryzen 7 7800X3D is going to let you run 1440p and 4K games with a really respectable level of performance, and should be your first choice processor when considering one for the RTX 4070 Super. Base Clock 3.4 GHz Boost Clock 5.6Ghz TDP 125W Cache 33MB Intel Smart Cache, 28MB L2   The Intel i7-14700K isn’t going sacrifice any performance quality: 20 cores and 28 threads, frequency ranges between 3.4GHz and 5.3GHz. Alongside this, there’s 33MB of Intel Smart Cache and 28MB of L2 Cache. Having only released late last year, the Intel 14th Gen CPUs offer up an extraordinary amount of processing capability. With the rate that game optimisation is going, it’s becoming evermore important to pick up processors that are equipped to handle the demands of DLSS, FSR, and ray tracing. While the graphics card is going to be responsible for handling most of the heavy lifting here, relying on CPU load is becoming more and more prevalent as graphics techniques evolve. The 14700K is going to pair expertly with the RTX 4070 Super here, giving you mastery over 1440p graphics, and letting you dip into 4K with optimised graphics settings. Cores 16 Threads 24 Base speed P-cores 3.4 GHz / E-cores 2.5 GHz Boost speed P-cores 5.4 GHz / E-cores 4.2 GHz Cache 24MB TDP 125 W / 253 W boost Finally, the Intel i7-13700K is the final option to pair with your RTX 4070 Super. Intel’s i7-13700K CPU offers up compatibility with DDR5 RAM, like the others on this list, though is often available at a discounted price thanks to the fact that 13th Gen CPUs have been replaced a new generation. That shouldn’t detract from the fact that the Intel i7-13700K is still a absolute unit of a CPU with frequencies between 4.2 – 5.2GHz. Running at 125W, you’re going to want to consider the best CPU cooler for the Intel Core i7 13700k for whenever your system is pushed by 4K gaming. When choosing a CPU for the RTX 4070 Super, you’re going to want to nail a processor with DDR5 compatibility, alongside frequencies fast enough to support 4K gaming. We’ve listed a few above that are going to compliment the graphics card, though there’s plenty of other valid CPU SKUs from AMD and Intel that will suit the card’s target performance – 1440p. When choosing a processor, you’re also going to want to consider cache. For us, the Ryzen 7 7800X3D’s 3D V-Caching solution is going to be a game-changer when it comes to CPU intensive games and graphics processes. DLSS, in particular. That’s as much as we have on choosing a CPU for the RTX 4070 Super. It’s not a component you’re going to want to skimp out on by any means. There should be options for a range of budgets, and while it’s true that you could choose to spend even more on your processor, it’s not always necessary when you’re choosing a graphics card that generally won’t need absolute premium products. What CPU won’t bottleneck the RTX 4070 Super? The Intel 13600K and AMD Ryzen 5 5600 will be CPUs capable of running an RTX 4070 Super without bottlenecking it. They won’t offer absolute premium performance, though 1440p to 4K gaming at optimised settings will run well. Amaar loves retro hardware and boring games with more words than action. So, he writes about them daily. "
}