{
    "title": "Sapphire Pulse Radeon RX 7900 XT 20GB GPU drops down to $699",
    "date": "2/10/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/sapphire-pulse-radeon-rx-7900-xt-20gb-gpu-drops-down-to-dollar699",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. 20GB of GDDR6 and AMD RDNA 3 in one package. Today, across multiple vendors, you can find the Sapphire Pulse Radeon RX 7900 XT graphics card for one of its lowest prices. This GPU is usually priced around $799, but you can find it for just $699 at Walmart and Newegg. We reviewed the Sapphire Pulse Radeon RX 7900 XT GPU back in 2023, and although we found it to be a bit on the larger side, it has noticeably fast performance and is among one of the quietest graphics card options on the market today. Sapphire Pulse Radeon RX 7900 XT: now $699 at Walmart and Newegg (was $799)\nThis graphics card comes with a whopping 20GB of GDDR6. It's compatible with PCIe 4.0 interfaces and features AMD RDNA 3 architecture. The Sapphire Pulse Radeon RX 7900 XT features AMD RDNA 3 architecture. It has a significant ATX form factor with three fans for cooling. This large size also comes with plenty of performance thanks to the inclusion of 20GB of GDDR6. It can reach speeds as high as 2,450 MHz and output to at most four displays via two HDMI ports and two DisplayPort inputs. Regarding resolution, you can get a maximum of 7680 x 4320. Visit the Sapphire Pulse Radeon RX 7900 XT product page at Walmart or Newegg for more details and purchase options. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Ash Hill is a Freelance News and Features Writer at Tom's Hardware US. She manages the Pi projects of the month and much of our daily Raspberry Pi reporting. Nvidia's sanctions-compliant 4090D gaming GPU for China is overclockable, restoring performance to standard unsanctioned RTX 4090 FE levels GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 Seven-year-old AMD gaming GPU continues to stick around — low-profile RX 550 arrives for SFF PCs By Ash HillMarch 20, 2024 By Ash HillMarch 17, 2024 By Ash HillMarch 16, 2024 By Stewart BendleMarch 13, 2024 By Stewart BendleMarch 12, 2024 By Stewart BendleMarch 11, 2024 By Ash HillMarch 10, 2024 By Ash HillMarch 09, 2024 By Stewart BendleMarch 08, 2024 By Stewart BendleMarch 07, 2024 By Stewart BendleMarch 06, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}