{
    "title": null,
    "date": "2/9/2024",
    "url": "https://www.fudzilla.com/news/58421-amd-breaks-records",
    "text": "Leaves Chipzilla feeling a bit sick AMD, the chip maker behind the mighty EPYC and Ryzen processors, has revealed its stunning results for the last quarter of 2023, showing that it is leaving its rival Intel far behind. According to new data from Mercury Research, AMD has increased its share of the server, desktop, and notebook markets, raking in more cash than ever before. \"AMD gained significant server, desktop, and notebook revenue share year-on-year,\" boasted AMD in an email that shared the figures. AMD's server business was especially impressive, with its EPYC processors powering some of the world's fastest and most powerful computers. AMD's revenue share in the server market hit a record 31.1 per cent, up 4.0 per cent from a year ago. That means AMD made a whopping €2.7 billion from its server chips alone. AMD's server unit share also grew 5.5 per cent year-on-year to 23.1 per cent, showing that it is selling more chips than ever before. AMD said that the small drop from the previous quarter was due to Intel dumping more of its server chips into non data-center applications and selling more of its low-end Atom processors. Intel had a dismal 2023, with its data centre business shrinking 10 per cent year-on-year. Intel blamed a smaller overall market and inventory corrections for its poor performance. Intel also faced delays and defects in its chip production, while AMD was able to deliver its cutting-edge 5nm chips on time. AMD's desktop and notebook businesses also did well, with its Ryzen processors offering superior performance and efficiency to Intel's Core chips. AMD's revenue share in the desktop and notebook markets increased 2.0 per cent and 3.1 per cent year-on-year, respectively, to 15.4 per cent and 20.1 per cent. AMD's fans are looking forward to 2024, which is expected to be the year of the AI PC. AMD's processors are ready to take advantage of the new features and capabilities that AI will bring, such as voice and gesture control, facial recognition, and smart assistants. AMD is also hoping that Windows 12, the next version of Microsoft's operating system, will boost demand for its chips. AMD is clearly on a roll, and it shows no signs of slowing down. AMD is the undisputed king of the chip market, and Intel is struggling to catch up. AMD is the future, and Intel is the past.   "
}