{
    "title": "AMD Ryzen 8500G / 8600G / 8700G Performance @ 35 Watt & 45 Watt cTDP Review",
    "date": "2/15/2024",
    "url": "https://www.phoronix.com/review/ryzen-8000g-35w-45w/5",
    "text": "Show Your Support:  Did you know that the hundreds of articles written on Phoronix each month are mostly authored by one individual? Phoronix.com doesn't have a whole news room with unlimited resources and relies upon people reading our content without blocking ads and alternatively by people subscribing to Phoronix Premium for our ad-free service with other extra features. The Ryzen 8000G series was delivering competitive performance-per-Watt at the 35 and 45 Watt levels. In total I ran more than 150 benchmarks across all of these different Intel and AMD processors. You can see all 150+ results via this OB result page. When looking at the CPU power consumption across the span of all the benchmarks carried out, there was a clear difference for the Ryzen 5 8600G and Ryzen 7 8700G. Out-of-the-box these AM5 Phoenix APUs were consuming around 59 Watts with a peak for the 8600G at 172 Watts and 204 Watts for the 8700G, but those maximum values were extreme outliers. When dropping those cTDP values to 456 Watts both APUs were running with a 43 Watt average and a recorded maximum of 62 Watts. Or in the 35 Watt mode, both had a 34 Watt average and 44 Watt peak. Meanwhile the lower cTDP values didn't make much of a difference for the Ryzen 5 8500G that to begin with was only having a 37 Watt power average. When taking the geometric mean of all the benchmarks carried out successfully on all of the processors, dropping the Ryzen 7 8700G from 65 to 45 Watts yielded a 7% hit to the performance while at 72% the original power consumption. Or the Ryzen 7 8700G at 35 Watts took a 19% hit to the performance compared to the out-of-the-box performance while consuming 57% the CPU power. The Ryzen 5 8600G results were similar to that of the 8700G for really drive up the power efficiency at 35 / 45 Watt levels. It was also interesting to see that with this geo mean, the Ryzen 7 8700G when capped to 45 Watts was still faster overall than the Intel Core i5 14600K... The Core i5 14600K had a 87 Watt average compared to the 8700G @ 45 Watts being 43 Watts: half the power consumption and similar performance to that Intel Core i5 Raptor Lake Refresh CPU! The Ryzen 5 8500G at 35 Watts meanwhile was similar to the geo mean of the Core i5 14500: but at 59% the CPU power consumption and a peak power consumption just 20% that of the Intel CPU. Again, see the OB result page for all the individual data points in full and all of the collected CPU power/efficiency data. Now you have lots of hard data if trying to quantify the power efficiency benefits of a lower cTDP for the Ryzen 8000G series. If you enjoyed this article consider joining Phoronix Premium to view this site ad-free, multi-page articles on a single page, and other benefits. PayPal or Stripe tips are also graciously accepted. Thanks for your support. Michael Larabel is the principal author of Phoronix.com and founded the site in 2004 with a focus on enriching the Linux hardware experience. Michael has written more than 20,000 articles covering the state of Linux hardware support, Linux performance, graphics drivers, and other topics. Michael is also the lead developer of the Phoronix Test Suite, Phoromatic, and OpenBenchmarking.org automated benchmarking software. He can be followed via Twitter, LinkedIn, or contacted via MichaelLarabel.com. Phoronix Premium allows ad-free access to the site, multi-page articles on a single page, and other features while supporting this site's continued operations. The mission at Phoronix since 2004 has centered around enriching the Linux hardware experience. In addition to supporting our site through advertisements, you can help by subscribing to Phoronix Premium. You can also contribute to Phoronix through a PayPal tip or tip via Stripe.  Legal Disclaimer, Privacy Policy, Cookies | Privacy Manager | Contact Copyright © 2004 - 2024 by Phoronix Media. All trademarks used are properties of their respective owners. All rights reserved. "
}