{
    "title": "This $870 RTX 4060 gaming laptop deal proves you don't need to spend big to \nscore modern gaming hardware",
    "date": "2/13/2024",
    "url": "https://www.pcgamer.com/this-dollar870-rtx-4060-gaming-laptop-deal-proves-you-dont-need-to-spend-big-to-score-modern-gaming-hardware/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. A lovely Lenovo gaming laptop with $130 off at Walmart. Lenovo Legion 5 | RTX 4060 | AMD Ryzen 7 7735H | 16GB DDR5 | 512GB SSD | 15-inch | 165Hz | $999.99 $869.99 at Walmart (save $130)\nWe've become big fans of Lenovo laptops here at PC Gamer this generation, and this particular budget machine is ticking a lot of boxes. For an RTX 4060 laptop it has to be under $1,000, and you also get a better than average screen, though I'm a little confused over Walmart's listing of it as 2160 x 1350 when Lenovo itself claims a 1440p panel. That 512GB SSD, however, is disappointing, even in a budget laptop, but is a cheap and easy issue to fix if it becomes annoying down the line. Price check: Newegg $969.99 There's no need to pick sides here, this Lenovo gaming laptop is stuffed with some of the latest technology out of Nvidia and AMD. It's also $130 off over at Walmart. If you're happy to part ways with $870 of your hard-earned cash, Lenovo will hand you a lovely 15-inch machine here for the money. It comes with an RTX 4060 and Ryzen 7 7735H—two chips from impressive architectures, for the right price anyways. An RTX 4060 mobile GPU from Nvidia will keep the frame rate ticking over nicely. With access to features like Frame Generation and DLSS 3.5 upscaling, you should be able to utilise the QHD 165Hz screen to its fullest in some games, too. That said, you may have to play it smarter in some more demanding games to reach higher frame rates—the RTX 4060 is a solid GPU for a laptop but this laptop offers a high resolution and refresh rate for the money. We can't complain about that, can we? For non-gaming activities, the extra pixels across the 15.6-inch panel will be extremely useful. That's more room to breathe if you're trying to get to grips with a large spreadsheet or dual-wielding Chrome tabs for work or school. Walmart has this laptop listed with a 2160 x 1350 panel, though both Lenovo and Antonline (the original seller via Walmart) have it down as a 2560 x 1440. Let's chalk that up to a typo and call it a true 1440p. For both gaming and productivity, the 16GB of DDR5-4800 RAM included on this machine will be a good fit. That's all a great hand in keeping the AMD Ryzen 7 7735H fed for data. This chip is a part of one of AMD's finest generations to date, and has key specs covered including eight cores, 16 threads, and decent power efficiency. The iGPU is the last-gen 680M, as opposed to the 780M, but it's a 12CU GPU that will help keep power demands down when you don't require the RTX 4060. Though, the biggest downside to this laptop has to be the SSD. It's a very slim 512GB model, which will feel even slimmer once Windows 11 is installed on it. A couple of big games will gobble that storage capacity up swiftly. But while I don't have specific confirmation for this exact model, Lenovo Legion 5 machines have previously offered two NVMe SSD slots for easy expansion. I wouldn't be too afraid of opening up the rear of a laptop these days, but I can see why this might put some off. If that's you, I'd opt for one of the other cheap gaming laptop deals today with more storage included from the onset. If that doesn't put you off, there are heaps of cheap SSD deals today. Have at it. More generally, we've been really impressed with the quality and consistency of Lenovo laptops lately. That's a big part why we rate the Lenovo Legion Pro 7i as the best gaming laptop to buy right now. That's by and large a much pricier machine than this Legion 5, but it's going to be tough to beat this laptop on value. It's pretty stellar. Sign up to get the best content of the week, and great gaming deals, as picked by the editors. Jacob earned his first byline writing for his own tech blog. From there, he graduated to professionally breaking things as hardware writer at PCGamesN, and would go on to run the team as hardware editor. Since then he's joined PC Gamer's top staff as senior hardware editor, where he spends his days reporting on the latest developments in the technology and gaming industries and testing the newest PC components. Snapdragon X Elite spotted running Baldur's Gate 3 at around 30fps, supporting claims that Windows games 'just work' on ARM chip Razer's Blade gaming laptops have lost their edge Some of the biggest names in indie games are teaming up to put on a 'no fluff' showcase of new game announcements By Harvey Randall28 March 2024 By Joshua Wolens28 March 2024 By Robert Jones28 March 2024 By Shaun Prescott28 March 2024 By Chris Szewczyk28 March 2024 By Kerry Brunskill28 March 2024 By Chris Szewczyk28 March 2024 By Andy Chalk27 March 2024 By Tyler Wilde27 March 2024 By Tyler Wilde27 March 2024 By Andy Chalk27 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}