{
    "title": "Best AMD Ryzen APU for gaming in 2024 - our 5 top picks for performance",
    "date": "2/21/2024",
    "url": "https://www.wepc.com/reviews/best-apu-gaming/",
    "text": "Home » Reviews » Best AMD Ryzen APU for gaming in 2024 – our 5 top picks for performance AMD Ryzen Integrated Graphics Could Be The Answer For A Budget-Focused Gamer? WePC is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more Looking for the best AMD Ryzen APU for gaming in 2024? We have you covered. With combined CPU and GPU technologies into a single chip, you might just get away with an all-in-one solution for your setup. Be it for work or gaming, they do give a nice budget-friendly option, so what are they and what are the best picks? While an APU isn’t as strong in CPU or GPU performance as standalone components, there are good reasons to put them together. They can still pack a punch, but they won’t replace the separate hardware we’re used to. This article takes into account the Ryzen 7000 series CPUs, whilst we know they have an iGPU within them, it’s not made for gaming therefore we excluded them from this list by choice. But AMD has now brought the 8000G series release and brought a whole new range to pick from. This isn’t the best CPU with an iGPU, it’s the best APU. Shop on Amazon Shop on Amazon Shop on Amazon The Best AMD APU for gaming will feature the new AMD Ryzen 8000 series, as these CPUs are far superior to the 5000G series. The new 8700G comes with a more capable RDNA 3-based 12-core Radeon 780M graphics chip, which could offer around 3x the iGPU performance over the 5700G. The list we have compiled today is ranked from best to worst. Not to say we dislike any of the CPUs on the list today, just some are better suited than others. If you’re wondering why there are no Intel CPUs on the list, particularly the Intel 14900K, then that’s because APUs are technically exclusive to AMD and Intel’s integrated performance doesn’t quite cut it. Speed 4.2-5.1 GHz Core (threads) 8 (16) Socket AM5 Graphics Radeon 780M Now at the top of the pack, you can find the Ryzen 7 8700G as part of the newer generation choice that AMD is bringing to the AM5 platform with integrated graphics. It upgrades to Radeon graphics bringing plenty of features to the processor with the AMD Adrenalin software now accessible to it. It comes with 8 cores and 16 threads for matching with the best abilities of CPUs. While it also boosts to much higher speeds than previous generations. For the cache capacity, L2 provides you with 8MB and L3 goes up to 16MB, so not quite X3D levels but still a good amount. For graphics, you get Radeon version 780M with 12 cores and running at 2.9GHz. That boosts the capabilities but also the processor comes with Ryzen AI with 16 TOPS for some light work capabilities of what it can achieve. Even then the processor only has a 65W TDP and has a great efficiency for what it is capable of, although you can even push that further as it is overclockable if you still desire. Speed 3.5-5.0 GHz Core (threads) 6 (12) Socket AM5 Graphics Radeon 740M For a cheaper choice out of the lot of new 8000Gs, the Ryzen 5 8500G is the option to go for. It drops down the price but also the specs of the processor. Getting rid of the AI processing capabilities of the processor but cutting it to under $200, does make it a strong choice of an APU. The cores fall to 6 and threads down to 12, still giving you a good capability with processing workloads and graphics. These can even boost up to 5GHz, not as far as the 8700G but still a well-capable option. As for the cache you get 6MB of L2 and 16MB of L3 so nothing changes in that, which is also the case for the TDP as that 65W spec stays the same. But the Radeon graphics also drop down a couple of tiers to 740M with only 4 cores, running at a 2,800Mhz frequency. You can only expect 720p true performance and light 1080p work with a good framerate achieved with some help. Speed 3.8GHz – 4.6GHz Core (threads) 8 (16) Socket AM4 Graphics Vega 8 The Ryzen 7 5700G is AMD’s current flagship APU and is widely considered to be the world’s most powerful thanks to the integrated graphics the chip comes paired with. Unlike the previous gen, this features a higher amount of cores, increased speeds, and a more efficient design. The AMD Ryzen 7 5700G comes equipped with 8 cores and 16 threads, respectively. It features impressive clock speeds of 3.8GHz base and 4.6GHz boost, alongside a total of 16MB L3 cache and 4MB L2 cache. TDP will be equivalent to its predecessor at 65W and it brings VEGA 8 integrated graphics, with 8 CUs and 512 stream processors (all running at 2.0GHz). While the 5700G is the most expensive APU from AMD to date, it is also by far the most powerful. With the current GPU climate, the 5700G can provide you with solid processing power and integrated graphics. While the integrated graphics may not be good enough for everyone, basic 1080p performance is there. Furthermore, when you finally get your hands on a dedicated GPU, you can easily slot it in with this APU for a quality overall gaming PC. Speed 3.9GHz – 4.4GHz Core (threads) 6 (12) Socket AM4 Graphics Vega 7 The Ryzen 5 5600G, is an excellent choice for budget-conscious builders, It offers a compelling combination of affordability and performance. It follows in the footsteps of the older 3400G, providing solid gaming capabilities while ushering in significant improvements in core count and design efficiency. In terms of specifications, the Ryzen 5 5600G boasts 6 cores and 12 threads, with base and boost clock speeds of 3.9GHz and 4.4GHz, respectively. Like its sibling, the 5700G, it offers a generous 16MB of L3 cache, albeit with a slightly reduced 3MB of L2 cache. Despite these improvements, the APU maintains an energy-efficient 65W TDP and includes AMD’s VEGA 7 iGPU, clocked at 1.9GHz and equipped with 448 stream processors. While the choice of the Vega 7 iGPU may initially appear to be a step backward, the gains in efficiency more than make up for the reduction in core count, ensuring that the graphical performance remains strong without compromising on power efficiency. Speed 3.7GHz – 4.2GHz Core (threads) 4/8 Socket AM4 TDP 65W The AMD Ryzen 5 3400G, a former flagship APU from AMD, is renowned for its outstanding performance, largely owing to its integrated graphics capabilities. This chip, a significant step up from the 3200G, boasts 4 cores and 8 threads, 6MB of cache, and the impressive VEGA 11 graphics engine. Although it is scraping the bottom of the barrel in 2024, this CPU is not something that will take you very far with AAA titles even in 1080p. With a base clock speed of 3.7GHz and a boost clock of 4.2GHz, the 3400G represents a substantial improvement over its predecessor. AMD has further enhanced its performance with high-quality metal TIM (thermal interface material) and support for AMD’s precision boost overdrive, a feature that intelligently overclocks the chip as needed. The integrated GPU operates at a base clock of 1,400MHz, a notable 150MHz faster than its predecessor, the 2400G. Additionally, like the 3200G, the 3400G includes AMD’s Wraith Spire CPU cooler, ensuring efficient thermal management. What truly sets the 3400G apart is its exceptional value proposition. With a retail price of under $150, it offers tremendous performance for the cost, especially considering that its predecessor, the 2400G, was initially priced at $170. While the Accelerated Processing Unit is a very attractive name, make no mistake: an APU is pretty much just a combination of a CPU and a GPU. Many Intel processors using Integrated graphics, for instance, are essentially the same as APUs. That being said, though, their graphics chips are much less powerful than the ones inside these Ryzen APUs. Note; you can also use these strictly as CPUs by adding a dedicated GPU to your setup. A similar concept in a different sector of the industry is “SoCs.” SoC stands for System on Chip, and these tend to combine all components of the system onto a single, well, chip. This is seen most often in gaming consoles (both the PS4 and Xbox One, for instance, are using AMD SoCs), smartphones, and on rare occasions, laptops. There are many things to consider on the hunt for the best AMD Ryzen APU. Choosing the best AMD APU for your specific needs is important so that you aren’t left with a product that doesn’t meet your requirements. Let’s go over a few key terms. Pairing your Ryzen CPU with a suitable set of RAM is more important than you might think. Ryzen CPU core communication speed is directly correlated to RAM speed, essentially meaning the slower the RAM the slower the CPU without getting overly complicated. Intel CPUs aren’t affected in this manner as their CPUs are constructed a little differently. This is especially true for APUs as the system’s RAM is also used as VRAM for the integrated graphics. Whether this is a Vega iGPU or a Radeon RX iGPU, it’s the same case for both. This is because the integrated graphics portion of the Chip is built directly into the CPU, instead of being on a spacious GPU PCB where VRAM can be built with ease. Because of the spacial limitations being built into a CPU package presents, the iGPU has to get creative and use the already available system RAM as Video RAM. The sweet spot for AM4 Ryzen CPUs is 3600MHz, this speed of DDR4 RAM gives you the best returns, any speed beyond this you’ll receive diminishing returns and as a result, less value for money. If you’re planning on building a PC centered around an APU, it’s a good idea to invest in a higher RAM capacity for reasons we mentioned earlier, to make sure the iGPU RAM requirements do not interfere with the rest of the system requirements. As for AM5 APUs, and the Ryzen 8000G processors, DDR5 is the RAM you want. There you want to look at around 6000MHz. Clock speed is the measurement of how many times per second a CPU can complete what’s called an instruction Cycle, this cycle consists of three main actions. These actions are: fetch, decode, and execute. And it’s these three actions that make up the fundamentals of CPU operation as we know it. This isn’t just for desktop processors, this is the same on the mobile platform and OEM too, although clocked lower for efficiency’s sake because of the power constraints being a mobile platform brings. Generally, when discussing and comparing CPUs in the same architecture, CPUs with the same or greater number of cores and a higher clock speed will perform better. – this is also a single-core performance metric, as cores with higher clock speeds will perform better in single-core workloads. The more CPU cores your CPU has the better at multitasking it will be. However, it all depends on whether the application or software you are using is coded for multiple cores. Some older programs are not and will generally perform no better when given access to more cores. For software that does support multi-core utilization, more cores are better. Core count is a metric for multi-core performance, As CPUs with a higher number of cores will perform better in multicore workloads, due to the abundance of available CPU cores. If you’re interested in seeing how these APUs stack up, then check out our CPU hierarchy. Threads tell a similar story to cores, more threads make for a CPU that’s better at multitasking natively. However, cores and threads are not created equal. All of the APUs on the list support SMT (Simultaneous Multithreading). This is AMD’s version of Intel’s Hyperthreading. This is a technology that allows one CPU core to process and execute two instructions at once. This means that the operating system can see and utilize your CPU as if it had double the number of physical cores. The collection of cores and threads is labeled ‘logical processors’ by operating systems. These threads are known as V-cores and are virtual, so named because they do not physically exist or occupy space on the CPU die. These virtual cores have to share resources with the physical cores and threads suffer slower processing speeds as a result. Again SMT relies on software integration and compatibility but it’s better to have and not need than to need and not have. Most modern software has multithreading integration and support. If you want to know more about SMT you can read our in-depth feature on SMT. Graphics refers to the included “GPU.” In this case, the hierarchy starts with Vega 8 on the budget APU and ends with Vega 11 at the highest end, for now. If you’re interested in seeing how these compare, then check out the comparable graphics cards below and our GPU hierarchy. The iGPUs inside these APUs are very underpowered compared to dedicated graphics powered by your GPU. With that being said, however, you shouldn’t write them off. APUs can be powerful enough for low-end 1080P gaming. Especially with the advancements made in AMD FSR and RSR. There are a few Ryzen APUs available now, but there are only a few that remain relevant in the current climate. Although we recommend the 3400G, we don’t advise buying one new for a brand spanking PC build. There are plenty of APUs available for you to choose from. Although the Ryzen 8000 G series has made major strides over the 5000 series processors, AMD APUs are generally not better than dedicated GPUs, but they will absolutely beat out older GPUs. Ryzen 8000 series APUs are fantastic and can certainly hold their own in gaming performance, since they are based on RDNA3, they have AI enhancements such as FSR to help them along – which can be the difference between 1440P 30FPS and 1440P 60 FPS in some cases. We have a large range of in-depth buyer guides here on WePC and we would hate it if you missed the chance to read them, feel free to check out any of the related guides below. In the ever-evolving landscape of gaming APUs, AMD continues to push the boundaries with its impressive 8000G series chips, offering a harmonious fusion of CPU and GPU technologies. While standalone components may still outshine APUs in specific aspects, the unique advantages they bring to the table are hard to overlook. Now, with the new RDNA3 iGPUs, the possibilities are endless and offer theoretical performance gains of 3x over the 5000G series APUs. For as long as he can remember, Charlie has always been interested in computers and gaming. It all started with the Sega Mega Drive and then evolved into PC gaming in his early teens. Trusted Source WePC’s mission is to be the most trusted site in tech. Our editorial content is 100% independent and we put every product we review through a rigorous testing process before telling you exactly what we think. We won’t recommend anything we wouldn’t use ourselves. Read more Best AM4 Motherboard 2024 – our top, best all round, and budget AM4 motherboard picks Best PC case 2024 – our top 8 picks for your next build Best mini ITX (MITX) cases 2024 – our top picks Best open air PC case 2024 – our top picks The Warehouse, Use Space, Paddock St, Manchester M12 6PN WePC is the essential site for serious PC gamers. We offer everything from high end PC custom builds and advice to the latest hardware and component reviews, as well as the latest breaking gaming news. You take your gaming PC seriously. So do we. WePC. ©2024 WePC. All rights reserved. Part of "
}