{
    "title": "Retinal sensitivity changes in early/intermediate AMD: a systematic review \nand meta-analysis of visual field testing ...",
    "date": "3/18/2024",
    "url": "https://www.nature.com/articles/s41433-024-03033-0",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Eye\n\n                         (2024)Cite this article 291 Accesses 12 Altmetric Metrics details Visual fields under mesopic and scotopic lighting are increasingly being used for macular functional assessment. This review evaluates its statistical significance and clinical relevance, and the optimal testing protocol for early/intermediate age-related macular degeneration (AMD). PubMed and Embase were searched from inception to 14/05/2022. All quality assessments were performed according to GRADE guidelines. The primary outcome was global mean sensitivity (MS), further meta-analysed by: AMD classification scheme, device, test pattern, mesopic/scotopic lighting, stimuli size/chromaticity, pupil dilation, testing radius (area), background luminance, adaptation time, AMD severity, reticular pseudodrusen presence, and follow-up visit. From 1489 studies screened, 42 observational study results contributed to the primary meta-analysis. Supported by moderate GRADE certainty of the evidence, global MS was significantly reduced across all devices under mesopic and scotopic lighting with large effect size (−0.9 [−1.04, −0.75] Hedge’s g, P < 0.0001). The device (P < 0.01) and lighting (P < 0.05) used were the only modifiable factors affecting global MS, whereby the mesopic MP-1 and MAIA produced the largest effect sizes and exceeded test-retest variabilities. Global MS was significantly affected by AMD severity (intermediate versus early AMD; −0.58 [−0.88, −0.29] Hedge’s g or −2.55 [3.62, −1.47] MAIA-dB) and at follow-up visit (versus baseline; −0.62 [−0.84, −0.41] Hedge’s g or −1.61[−2.69, −0.54] MAIA-dB). Magnitudes of retinal sensitivity changes in early/intermediate AMD are clinically relevant for the MP-1 and MAIA devices under mesopic lighting within the central 10° radius. Other factors including pupil dilation and dark adaptation did not significantly affect global MS in early/intermediate AMD. 中明视和暗视照明下的视野越来越多地用于黄斑功能评估。这篇综述评估了其统计学意义和临床相关性, 以及早期/中期年龄相关性黄斑变性 (AMD) 的最佳检测方案。检索PubMed和Embase自建库起至2022年5月14日的文献。所有质量评估均根据GRADE指南进行。主要结局是全局平均敏感性 (MS), 进一步meta分析指标包括: AMD分类方案、设备、测试模式、中位/暗位照明、刺激大小/色度、瞳孔扩张、测试半径 (面积) 、背景亮度、适应时间、AMD严重程度、网状假性玻璃膜疣的存在和随访。我们对筛选的 1489 项中的42 项观察性研究结果进行了meta分析。在中等GRADE质量证据的支持下及在中明视和暗视照明下, 所有设备的全、全视野MS均显著降低 (−0.9 [−1.04, −0.75] Hedge’s g, P < 0.0001) 。所使用的设备 (P < 0.01) 和照明 (P < 0.05) 是影响全视野MS的唯一可改变的变量, 因此中视MP-1和MAIA受影响最大, 并超过了重新测试的可变性。AMD严重程度 (中度 vs 早期AMD;−0.58 [−0.88, −0.29] Hedge’s g或−2.55[3.62, −1.47]MAIA-dB) 和随访 (与基线相比;−0.62[−0.84, −0.41]Hedge’s g或−1.61[−2.69, −0.54]MAIA-dB) 对全视野MS有显著影响。早期/中期AMD的视网膜敏感性变化幅度与MP-1和MAIA装置在中心10°半径内的中明视照明下具有临床相关性。瞳孔扩张和暗适应等其他因素对早期/中期AMD的全视野MS没有显著影响。 Elizabeth J. Johnson, Esther E. Avendano, … Gowri Raman Yaniv Barkana, Susanne G. Pondorfer, … Robert P. Finger Stanley Poh, Yih-Chung Tham, … Ching-Yu Cheng Vision-related, functional changes in age-related macular degeneration (AMD) begin from the early stages [1,2,3,4] and eventually lead to severe functional and quality-of-life (QoL) impairment [5,6,7,8]. Consequently, many studies [9,10,11,12,13,14,15,16,17,18,19,20] including recent interventional trials [18, 21] have proposed using visual fields for functional testing of AMD due to its sensitive, repeatable, and clinically accessible nature [14]. Visual fields have facilitated greater understanding of the vision-related spatial function and QoL impact of AMD [22]. However, its “…role in clinical practice has yet to be specifically defined” [23], and there is a paucity of protocol standardisation across research groups utilising visual field assessment under mesopic or scotopic lighting for AMD. It is essential that the results between individual studies be formally meta-analysed for clear interpretation and future development of standardised guidelines. Regarding the use of visual field testing under mesopic/scotopic lighting for early/intermediate AMD, however, it has not yet been determined whether mean sensitivity changes across studies are statistically significant and clinically relevant. Specifically, statistical significance denotes an arbitrary mean sensitivity difference and sample size between AMD and normal eyes, while the clinical relevance requires effect sizes to at least exceed test-retest variability [24]. It is also unclear how the many aspects of visual field testing such as the device [25,26,27], test pattern [14], stimuli size [28,29,30,31,32] and chromaticity [33, 34], pupil size [35], eccentricity [36,37,38], and background adaptation time [39, 40] used may influence outcomes. Thus, this systematic review and meta-analysis aims to consolidate the literature to facilitate the highest level of evidence [41] to address: 1) whether visual field defects under mesopic and scotopic lighting are statistically significant and clinically relevant for use in early/intermediate AMD [42,43,44], and 2) what the optimal testing protocol is for early/intermediate AMD. This systematic review was registered prospectively via the International Prospective Register of Systematic Reviews (PROSPERO, CRD42022333929) [45] without amendment, and adhered to the reporting guidelines of the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) statement [46]. Included studies performed visual fields (automated perimetry) under mesopic (0.005 to 5 cd/m2) or scotopic ( < 0.005 cd/m2) conditions [47,48,49,50,51] on comparative groups including treatment-naïve early and/or intermediate AMD eyes. Visual field testing was any systematic testing on a device that measured differential light sensitivities across pre-determined spaces in the visual field [52], including but not limited to commercial or modified static perimetry, flicker perimetry, and microperimetry/fundus-controlled perimetry. Early and intermediate AMD were defined according to the Beckman Initiative classification [53], although any study that used a commensurate classification was included [54, 55]. Literature searches were defined a priori [45] and performed via PubMed and Embase (OVID) for all published journal articles in English from inception to 14th May 2022, using the respective search strings: “macular degeneration”[MeSH Terms] AND (“visual field tests”[MeSH Terms] OR “visual fields”[MeSH Terms] OR “contrast sensitivity”[MeSH Terms] OR “flicker fusion”[MeSH Terms]); and (exp age-related macular degeneration/ OR exp retina macula age-related degeneration/) AND (exp visual field/ or exp visual field defect/ OR exp perimeter/ OR exp perimetry/ OR exp contrast sensitivity/ OR exp critical flicker fusion/)). Reference lists of included studies and relevant review studies were searched. Search results were exported into Zotero 6.0.7 (Corporation for Digital Scholarship, VA, USA), duplicates were removed, and unique results exported into Microsoft Excel Version 2107 (Microsoft Corporation, WA, USA). The primary outcome was global mean sensitivity (MS), defined as average sensitivity in decibels (dB) across a total retinal area [52], in early/intermediate AMD versus normal eyes. Alternate labels for global MS with identical definitions, e.g., average threshold, were included. The secondary outcome was any real-world patient outcome such as quality of life and/or activities of daily living indices. Unique search results were screened independently by two authors (MT and LNS) for title/abstract then full text if required. All discrepancies for study selection and assessments were resolved by discussion and consensus. Included studies underwent quality assessment by MT and LNS according to an adaptation of the ‘Users’ Guides to the Medical literature’ [44, 56]. This included consideration of study validity, results, and external validity [44, 56]. The data extracted for assessment is seen in Supplementary Table 1. Risk of bias was assessed unblinded [57] according to the ‘QUADAS-2: A revised Tool for the Quality Assessment of Diagnostic Accuracy Studies’ [58] and ‘Newcastle-Ottawa Scale for Assessing the Quality of Non-randomised Studies in Meta-analyses’ [59]. The overall certainty of the evidence was assessed independently using the GRADE approach for observational studies [60, 61]. Qualitative data synthesis was summarised in tables of relevant study characteristics and outcomes, funding and conflict of interest statements, risk of bias assessment, and GRADE assessment. Quantitative data synthesis and analysis, i.e., meta-analyses, were performed using Meta-Essentials (Erasmus Research Institute of Management, Rotterdam, The Netherlands) [62] and Review Manager (RevMan) version 5.4.1 (The Cochrane Collaboration, 2020) where at least three individual results per group or sub-group were available. Studies with identical data (e.g., from one clinical trial across multiple studies) were used once. Primary meta-analysis was followed by further meta-analyses according to between-study sub-groups, meta-regressions, and within-study sub-groups. Uni-variable (linear) meta-regression was performed when ≥10 studies [63] were pooled [64], and when pooling studies for longitudinal follow-up versus baseline meta-analysis. Time to follow-up visit (years) was used as the moderator in lieu of determining correlation coefficients (r) for dependent data. Sensitivity analyses were then performed to assess the robustness of all meta-analyses [63]: With repeated populations (tested under varying conditions) versus without repeated populations. Within study sub-groups [65, 66], data was selected from conditions expected to produce more conservative measures. Between study sub-groups, data was used from the larger sample to mitigate under-sampling/under-powering [67]. With both eyes sampled versus without both eyes sampled. With no age-adjusted/controlled versus age-adjusted/controlled groups. With no cataract/pseudophakic-adjusted/controlled versus cataract/pseudophakic-adjusted/controlled groups. Effect sizes were calculated using a random-effects model considering studies’ various contexts of data collection (mostly convenience samples) [68] and reported as standardised mean differences (Hedge’s g [95% CI]), where >0.8 Hedge’s g was considered a large effect size [41]. An outline of meta-analysis statistical interpretations is presented in Supplementary Table 2. Sub-groups’ effect sizes and heterogeneity were compared using Cochran’s Q test [69, 70], with P values considered after Bonferroni correction for multiple sub-group comparisons [71]. Publication bias was assessed using a funnel plot with trim and fill method using the linear estimator for missing studies, confirmed via Egger regression (testing significance between effect sizes and standard error) [72, 73] and Begg and Mazumdar rank correlation (testing significance between ranks of effect sizes and ranks of variance) [73, 74]. Statistical significance was defined as P < 0.05. Searches resulted in 1489 studies and 1407 unique studies. Full-text screening was performed for 147 studies, and 36 studies underwent two rounds of discussion before consensus (Fig. 1). A total of 67/147 studies were included from electronic database searches (reasoning for exclusions in Supplementary Table 3). Searches through reference lists of included studies and relevant review studies yielded 10 additional eligible studies [75,76,77,78,79,80,81,82,83,84,85]. Thus, 77 studies were included in this review (Fig. 1). Preferred reporting Items for systematic reviews and meta-analyses (PRISMA) flow diagram for study selection and analyses. A detailed summary of all study characteristics and outcomes is presented in Supplementary Table 4, with reported source(s) of funding (65/77 studies) and potential conflict(s) of interest (67/77 studies) presented verbatim in Supplementary Table 5. All study designs were observational. The most commonly used AMD classification scheme was from the Beckman Initiative [53] (39/77). AMD and normal group sample sizes ranged from three to 319 eyes. Some studies used multiple testing conditions on a single population, i.e., from 77 studies there were 101 different visual field protocols. The most used device was the Macular Integrity Assessment (MAIA; 37/101). Background luminance was more commonly set as mesopic (0.801 to 5 cd/m2, 74/101) than scotopic lighting (0 or 0.0032 cd/m2, 27/101). Most studies (74/77) had at least one domain with a high risk of bias (Supplementary Table 6). For the domain ‘patient selection’, 64/77 studies had a high risk of bias while for the domain ‘comparability of study groups’, 35/77 had a high risk of bias. A summary forest plot of meta-analyses is presented in Fig. 2, with full forest plots available in Supplementary Figs. 1–5. Negative values indicate reduced global MS. Summary data presented as standardised Hedge’s g [CI] and converted to device-specific dB where available. For meta-analysis between lighting conditions, photopic device was depicted in white, mesopic devices in light grey, and scotopic devices in dark grey. Note devices can have more than one background luminance setting. The full forest plots for each meta-analysis are presented in Supplementary Figs. 1–5. Vs versus, i.e., meta-analysis comparison. From 77 eligible studies, 42 provided adequate data for the calculation of global MS between early/intermediate AMD versus normal eyes. Most studies excluded from primary meta-analysis were due to not having a comparative normal group (Supplementary Table 4). Global MS in early/intermediate AMD eyes (n = 2587) was significantly reduced compared to normal eyes (n = 1348) with a large effect size of −0.9 [−1.04, −0.75] Hedge’s g (P < 0.0001), which may have represented substantial heterogeneity (Q(41) 133.04, P < 0.0001, Tau2 0.14, I2 69%; Fig. 2 and Supplementary Fig. 1). Further meta-analyses by within-study sub-groups were performed to identify potential confounding (categorical) factors, including AMD classification scheme, device, test pattern, mesopic/scotopic lighting, stimuli size and chromaticity, and pupil dilation. Only the device used significantly affected outcomes for early/intermediate AMD versus normal (P < 0.01, Supplementary Table 7). All subsequent analyses were then adjusted for the device used, and included conversion from Hedge’s g to device-specific dB for clinical context [32, 86]. Meta-regression was also performed to identify potential confounding (continuous) factors, including testing radius (area), background luminance, and adaptation time. None of these factors significantly affected outcomes for early/intermediate AMD versus normal (P = 0.24 to 0.84, Supplementary Table 7). Meta-analyses by between-study sub-groups were then performed to assess dose-response relationships. This included comparisons of global MS against: AMD severity, reticular pseudodrusen (RPD) presence, and at longitudinal follow-up versus baseline. For AMD severity, a comparison of intermediate AMD versus early AMD (Fig. 2 and Supplementary Fig. 2) demonstrated significantly reduced global MS with a medium effect size of −0.58 [−0.88, −0.29] Hedge’s g. Converted to device-specific dB, this was equivalent to −2.55 [−3.62, −1.47] MAIA-dB, P < 0.001 (Q(5) 10.43, P = 0.06, Tau2 0.07, I2 52.88%; n = 465 intermediate AMD versus 247 early AMD). Only one device sub-group could be formed using the MAIA. For RPD presence versus absence, a meta-analysis could not be formed due to an insufficient number of results per device sub-group. The five individual results using the Medmont DACP, MAIA, and MP-1 devices showed generally reduced global MS in the presence of RPD (−0.58 [−1.1, −0.07] to −1.55 [−2.43, −0.68] Hedge’s g; Supplementary Fig. 3). For longitudinal follow-up versus baseline (Fig. 2 and Supplementary Fig. 4), global MS was significant reduced with a medium effect size of −0.62 [−0.84, −0.41] Hedge’s g or −1.61 [−2.69, −0.54] MAIA-dB, P < 0.0001 (Q(3) 4.5, P = 0.21, Tau2 0.02, I2 33%; n = 260 follow-up versus 426 baseline) though only one device sub-group could be formed using the MAIA. Additional adjustment for follow-up time via meta-regression showed the rate of change to be −0.09 [−0.28, 0.1] Hedge’s g or −0.23 [−0.9, 0.13] MAIA-dB per year, without statistical significance (P = 0.12). To explore the modulating effect of lighting against current clinical visual field devices which operate under photopic lighting, external meta-analysis data from photopic visual field testing was included [87] with adjustments for the device used. There were significant sub-group differences between photopic (n = 234 AMD and 221 normal) versus mesopic (n = 1777 AMD and 922 normal) versus scotopic (n = 353 AMD and 341 normal) results (P < 0.05, Fig. 2 and Supplementary Fig. 5). The greatest effect sizes (with varying heterogeneities) were observed from the mesopic MP-1 (−1.72 [−2.34, −1.1] Hedge’s g; −5.25 [−6.03, −4.48] MP-1 dB) and MAIA devices ((−0.99 [−1.26, −0.72] Hedge’s g; −2.9 [−3.88, −1.93] MAIA dB). Sensitivity analysis revealed robust meta-analyses results, whereby inclusion versus exclusion of meta-data with repeated populations (tested under varying conditions), both eyes (rather than single eyes) sampled, no age-adjusted/controlled (versus age-adjusted/controlled) groups, and no cataract/pseudophakic-adjusted/controlled (versus cataract/pseudophakic-adjusted/controlled) groups, did not alter any effect sizes (P = 0.38 to 1). The funnel plot of the primary outcome demonstrated slight asymmetry to the left, implying that effect sizes were borderline biased towards being over-estimated (Egger regression P = 0.17, Begg and Mazumdar rank correlation P = 0.03; Supplementary Fig. 6). Four theoretical individual results were imputed to the right from trim and fill analysis, resulting in a medium adjusted effect size of −0.57 [−0.75, −0.4] Hedge’s g, rather than a large observed effect size of −0.9 [−1.04, −0.75] Hedge’s g for primary meta-analysis. Studies included in primary meta-analysis demonstrated an overall moderate level of certainty of evidence, that global MS was significantly reduced across all devices under mesopic and scotopic lighting with large effect size (Supplementary Table 8) [60, 61]. Eight studies (one with identical data) [88, 89] reported a linkage between the mesopic global MS in early/intermediate AMD and any real-world patient outcome (Supplementary Table 9), the latter of which was derived from three unique questionnaires [90,91,92] and two series of computerised visual tasks [93, 94]. Generally, correlations ranged from non-significant to moderate, and results were unclear whether microperimetry reflected these outcomes better, worse, or similar to other diagnostic modalities. This systematic review and meta-analysis found that with moderate GRADE certainty of the evidence, global retinal sensitivity changes under mesopic and scotopic lighting are statistically significant in early/intermediate AMD. Specifically, the magnitudes of changes are clinically relevant for the mesopic MP-1 and MAIA devices within the central 10° radius. The device and adapting light levels used were the only modifiable factors affecting outcomes, with other commonly considered factors such as pupil dilation and dark adaptation time insignificantly affecting global MS. Further research is needed to understand how mesopic and scotopic testing may link to real-world patient outcomes. Our results highlighted that most visual field devices under mesopic lighting were statistically valid for the assessment of early/intermediate AMD [42, 95]. Specifically, eyes with intermediate AMD demonstrated reduced global MS that was statistically significant and large effect sized (>0.8 Hedge’s g) [96,97,98] for the MP-1, MAIA, Medmont flicker, and S-MAIA devices under mesopic lighting. This was strengthened by dose-dependent relationships, however, a significant yearly rate of change could not be established due to a paucity of studies with longer (than mostly 12month) follow-up times. More longitudinal studies are required to extrapolate the optimal frequency with which visual fields under mesopic lighting may need to be performed in patients with AMD. It is well established that effect sizes are a statistical concept and regardless of the large magnitudes we observed, findings should be further interpreted in a clinical context [99]. For visual fields, minimal clinical significance is commonly defined as sensitivities exceeding visual field device/protocol test-retest variability [100]. From this review, the mean sensitivity losses detected by the MP-1 (−1.72 Hedge’s g or −5.25 dB) and MAIA (−0.99 Hedge’s g or −2.9 dB) exceeded intra-session and inter-session test-retest variabilities of corresponding populations of 1.1 to 1.56 dB (Supplementary Table 10) [101, 102]. Whilst other devices such as the Medmont flicker and S-MAIA also demonstrated large effect sizes, direct interpretation of their clinical relevance was limited by a lack of relevant test-retest variability data in normal and early/intermediate AMD populations. The validation of a ‘new diagnostic’ test requires methodological standardisation [103, 104] to ensure consistent quality of output and efficient use of resources (especially time) [105,106,107]. This review assessed if the selected device [25,26,27], test pattern [14], stimuli size [28,29,30,31,32] and chromaticity [33, 34], pupil size [35], light levels [108, 109], eccentricity [36,37,38], and background adaptation time [39, 40] may affect global MS in the early/intermediate AMD population, to determine the optimal testing protocol. At the summary level, we found that almost all the above modifiable factors were insignificant, as validated in other studies [14, 110, 111]. This is particularly relevant for research groups seeking to validate functional endpoints for AMD (e.g., the ALSTAR2 [20] and MACUSTAR groups) [112], whereby the time saved from not performing protracted dark adaptation for mesopic testing, in particular, could be redirected elsewhere. Consistent application of testing protocol at the individual patient level (within populations) is likely still important [14, 25,26,27,28,29,30, 32,33,34,35,36,37,38,39,40, 108, 109]. The only modifiable factors that significantly altered effect sizes were the device and lighting used between studies. These effects ranged from very large in the MP-1 to medium in the MP-1S, despite very similar testing properties (see Pfau et al. [14] for a detailed summary of inter-device differences). This has been corroborated within study populations showing inter-device differences in measured outcomes [25,26,27]. This may reflect effects from other parameters such as test pattern design [113], eye/image tracking frequency and software, ambient screen lighting, calibration and precision, etc., or simply be due to the under-sampling of meta-analysis sub-groups [67]. Nevertheless, caution is recommended when comparing results between devices in practice. Continued development of visual field technology and processes including time-saving threshold estimation strategies [114], test grid density [115], and frontloading tests [116, 117] will also need to be considered for further optimisation of visual field testing in AMD. We confirmed that visual field defects were generally greater under mesopic lighting than photopic lighting, supporting the concept that photoreceptor diseases such as AMD are light-adaptation dependent. That is, functional defects can be more greatly appreciated under lower (mesopic or scotopic versus photopic) light levels, previously modelled as the threshold-versus-intensity curve (Supplementary Fig. 7) [50, 108, 118, 119]. Greater threshold changes under mesopic versus photopic lighting may also have related to changes in spatial summation, which alters with differing background luminances [120, 121]. Interestingly, rod susceptibility in AMD [122,123,124] implied that differences in retinal sensitivity should have also been greater when probing rod (scotopic) versus cone (mesopic) function. However, there were no differences in global MS when comparing scotopic versus mesopic lighting [125, 126], nor when comparing cyan versus red stimuli [127,128,129], even when repeating analyses using within-study sub-groups to eliminate between-study differences in the testing protocol (data not shown). Effect sizes were also, surprisingly, generally greater under mesopic than scotopic lighting. These findings were likely influenced by the visual field testing patterns in this review which did not capture areas of peak rod density beyond the macula [123, 124]. Whilst we could not draw definitive conclusions regarding whether mesopic testing was superior to scotopic testing due to potential under-powering of our sub-group and post hoc analyses [67], the evidence supports the need for testing under lower (than photopic, standard automated perimetry [10 cd/m2]) light levels, which can be accessed through most microperimeters (1.27 cd/m2 and below) [14], the Octopus perimeter (1.27 cd/m2) [35], the Medmont perimeter (3.2 cd/m2) [35], and virtual reality-based perimetry (1 cd/m2) [130]. The main limitation of this review lies in the argument that there are several other less onerous measures of low-light function such as low-luminance visual acuity and deficit which may produce similar sensitivity/specificity regarding AMD [131]. However, these measures are yet to be systematically reviewed and are spatially indiscriminate. Visual fields can map functional changes in concordance with spatial patterns of AMD structural changes [132,133,134], providing spatial structure-function context as to which neuronal/synaptic, vascular, and/or physiological mechanisms may be impacted. As aforementioned, visual fields have not necessarily been propositioned to replace other diagnostic tools (such as colour fundus photography) for early/intermediate AMD, but rather as a supplementary tool to enhance diagnostic confidence and provide prognostic information in consideration of patients’ visual function and QoL [42, 95]. Additionally, there was a dearth of data regarding downstream effects of performing visual fields on patient-relevant outcomes [42, 44, 135]. The data suggested that current measures of patient-relevant outcomes in the early stages of AMD may be insensitive to the magnitude and/or scope of changes, though this does not preclude patient relevance, particularly as the disease progresses in severity. Research that explores the advantage of performing a spatially delineated functional test in association with more practical scenarios, e.g., whether visual fields can predict orientation and mobility [136] or driving capabilities [137,138,139,140], could be more beneficial in future. This systematic review highlighted with moderate certainty of the evidence, that global retinal sensitivity changes under mesopic and scotopic lighting are statistically significant in early/intermediate AMD. Specifically, the magnitudes of changes are clinically relevant for the mesopic MP-1 and MAIA devices within the central 10° radius. Other factors such as pupil dilation and dark adaptation did not significantly affect global MS and may be unnecessary to consider in future testing protocol of early/intermediate AMD eyes. Future research should explore how testing may link to real-world patient outcomes. Specific meta-analyses data is available upon reasonable request to the authors. Supplementary Material is available at Eye’s website. Karadeniz Ugurlu S, Kocakaya Altundal AE, Altin Ekin M. Comparison of vision-related quality of life in primary open-angle glaucoma and dry-type age-related macular degeneration. Eye. 2017;31:395–405. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Choudhury F, Varma R, Klein R, Gauderman WJ, Azen SP, McKean-Cowdin R, et al. Age-related macular degeneration and quality of life in latinos: the los angeles latino eye study. JAMA Ophthalmol. 2016;134:683–90. Article \n    PubMed \n    \n                    Google Scholar Hassell JB, Lamoureux EL, Keeffe JE. Impact of age related macular degeneration on quality of life. Br J Ophthalmol. 2006;90:593–6. Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Roque AB, da Silva Borges GF, Abe RY, de Souza OF, Machado MC, Ferreira T, et al. The effects of age-related macular degeneration on quality of life in a Brazilian population. Int J Retin Vitr. 2021;7:20. Article \n    \n                    Google Scholar Hogg RE, Chakravarthy U. Visual function and dysfunction in early and late age-related maculopathy. Prog Retin Eye Res. 2006;25:249–76. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Taylor DJ, Hobby AE, Binns AM, Crabb DP. How does age-related macular degeneration affect real-world visual ability and quality of life? A systematic review. BMJ Open. 2016;6:e011504. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Mitchell J, Bradley C. Quality of life in age-related macular degeneration: a review of the literature. Health Qual Life Outcomes. 2006;4:97. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Slakter JS, Stur M. Quality of life in patients with age-related macular degeneration: impact of the condition and benefits of treatment. Surv Ophthalmol. 2005;50:263–73. Article \n    PubMed \n    \n                    Google Scholar Acton JH, Greenstein VC. Fundus-driven perimetry (microperimetry) compared to conventional static automated perimetry: similarities, differences, and clinical applications. Can J Ophthalmol. 2013;48:358–63. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Cassels NK, Wild JM, Margrain TH, Chong V, Acton JH. The use of microperimetry in assessing visual function in age-related macular degeneration. Surv Ophthalmol. 2018;63:40–55. Article \n    PubMed \n    \n                    Google Scholar Madheswaran G, Nasim P, Ballae Ganeshrao S, Raman R, Ve RS. Role of microperimetry in evaluating disease progression in age-related macular degeneration: a scoping review. Int Ophthalmol. 2022;42:1975–86. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Midena E, Pilotto E. Microperimetry in age-related macular degeneration. Eye. 2017;31:985–94. Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Neelam K, Nolan J, Chakravarthy U, Beatty S. Psychophysical function in age-related maculopathy. Surv Ophthalmol. 2009;54:167–210. Article \n    PubMed \n    \n                    Google Scholar Pfau M, Jolly JK, Wu Z, Denniss J, Lad EM, Guymer RH, et al. Fundus-controlled perimetry (microperimetry): application as outcome measure in clinical trials. Prog Retin Eye Res. 2021;82:100907. Article \n    PubMed \n    \n                    Google Scholar Rohrschneider K, Bültmann S, Springer C. Use of fundus perimetry (microperimetry) to quantify macular sensitivity. Prog Retin Eye Res. 2008;27:536–48. Article \n    PubMed \n    \n                    Google Scholar von der Emde L, Pfau M, Holz FG, Fleckenstein M, Kortuem K, Keane PA, et al. Ai-based structure-function correlation in age-related macular degeneration. Eye 2021;35:2110–8. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Wong EN, Chew AL, Morgan WH, Patel PJ, Chen FK. The use of microperimetry to detect functional progression in non-neovascular age-related macular degeneration: a systematic review. Asia Pac J Ophthalmol. 2017;6:70–9. Google Scholar Yang Y, Dunbar H. Clinical perspectives and trends: microperimetry as a trial endpoint in retinal disease. Ophthalmologica. 2021;244:418–50. Article \n    PubMed \n    \n                    Google Scholar Finger RP, Schmitz-Valckenberg S, Schmid M, Rubin GS, Dunbar H, Tufail A, et al. Macustar: development and clinical validation of functional, structural, and patient-reported endpoints in intermediate age-related macular degeneration. Ophthalmologica. 2019;241:61–72. Article \n    PubMed \n    \n                    Google Scholar Curcio CA, McGwin G, Sadda SR, Hu Z, Clark ME, Sloan KR, et al. Functionally validated imaging endpoints in the alabama study on early age-related macular degeneration 2 (alstar2): design and methods. BMC Ophthalmol. 2020;20:196. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Liao DS, Grossi FV, El Mehdi D, Gerber MR, Brown DM, Heier JS, et al. Complement c3 inhibitor Pegcetacoplan for geographic atrophy secondary to age-related macular degeneration: a randomized phase 2 trial. Ophthalmology. 2020;127:186–95. Article \n    PubMed \n    \n                    Google Scholar Donabedian A. Evaluating the quality of medical care. Milbank Q. 2005;83:691–729. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Flaxel CJ, Adelman RA, Bailey ST, Fawzi A, Lim JI, Vemulakonda GA, et al. Age-related macular degeneration preferred practice pattern®. Ophthalmology. 2020;127:P1–65. Article \n    PubMed \n    \n                    Google Scholar Velentgas P, Dreyer NA, Wu AW. Outcome Definition and Measurement. In: Developing a Protocol for Observational Comparative Effectiveness Research: A User’s Guide. Agency for Healthcare Research and Quality (US); 2013. Available from: https://www.ncbi.nlm.nih.gov/books/NBK126186/. Balasubramanian S, Uji A, Lei J, Velaga S, Nittala M, Sadda S. Inter-device comparison of retinal sensitivity assessments in a healthy population: the centervue MAIA and the nidek MP-3 microperimeters. Br J Ophthalmol. 2018;102:109–13. Article \n    PubMed \n    \n                    Google Scholar Steinberg JS, Saßmannshausen M, Pfau M, Fleckenstein M, Finger RP, Holz FG, et al. Evaluation of two systems for fundus-controlled scotopic and mesopic perimetry in eye with age-related macular degeneration. Transl Vis Sci Technol. 2017;6:7. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Wong EN, Mackey DA, Morgan WH, Chen FK. Inter-device comparison of retinal sensitivity measurements: the centervue MAIA and the nidek MP-1. Clin Exp Ophthalmol. 2016;44:15–23. Article \n    PubMed \n    \n                    Google Scholar Choi AYJ, Nivison-Smith L, Khuu SK, Kalloniatis M. Determining spatial summation and its effect on contrast sensitivity across the central 20 degrees of visual field. PLOS ONE. 2016;11:e0158263. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Phu J, Khuu SK, Zangerl B, Kalloniatis M. A comparison of Goldmann III, V and spatially equated test stimuli in visual field testing: the importance of complete and partial spatial summation. Ophthalmic Physiol Opt. 2017;37:160–76. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Kalloniatis M, Khuu SK. Equating spatial summation in visual field testing reveals greater loss in optic nerve disease. Ophthalmic Physiol Opt. 2016;36:439–52. Article \n    PubMed \n    \n                    Google Scholar Khuu SK, Kalloniatis M. Spatial summation across the central visual field: implications for visual field testing. J Vis. 2015;15:15.1.6. Article \n    PubMed \n    \n                    Google Scholar Khuu SK, Kalloniatis M. Standard automated perimetry: determining spatial summation and its effect on contrast sensitivity across the visual field. Invest Ophthalmol Vis Sci. 2015;56:3565–76. Article \n    PubMed \n    \n                    Google Scholar Pfau M, Lindner M, Steinberg JS, Thiele S, Brinkmann CK, Fleckenstein M, et al. Visual field indices and patterns of visual field deficits in mesopic and dark-adapted two-colour fundus-controlled perimetry in macular diseases. Br J Ophthalmol. 2018;102:1054–9. Article \n    PubMed \n    \n                    Google Scholar Hansen T, Pracejus L, Gegenfurtner KR. Color perception in the intermediate periphery of the visual field. J Vis. 2009;9:26.1–12. Article \n    PubMed \n    \n                    Google Scholar Phu J, Khuu SK, Yapp M, Assaad N, Hennessy MP, Kalloniatis M. The value of visual field testing in the era of advanced imaging: clinical and psychophysical perspectives. Clin Exp Optom. 2017;100:313–32. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Wright MJ, Johnston A. Spatiotemporal contrast sensitivity and visual field locus. Vis Res. 1983;23:983–9. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Fraser RG, Tan R, Ayton LN, Caruso E, Guymer RH, Luu CD. Assessment of retinotopic rod photoreceptor function using a dark-adapted chromatic perimeter in intermediate age-related macular degeneration. Invest Ophthalmol Vis Sci. 2016;57:5436–42. Article \n    PubMed \n    \n                    Google Scholar Tahir HJ, Rodrigo-Diaz E, Parry NRA, Kelly JMF, Carden D, Aslam TM, et al. Slowed dark adaptation in early AMD: dual stimulus reveals scotopic and photopic abnormalities. Invest Ophthalmol Vis Sci. 2018;59:AMD202–10. Article \n    PubMed \n    \n                    Google Scholar Normann RA, Werblin FS. Control of retinal sensitivity. i. light and dark adaptation of vertebrate rods and cones. J Gen Physiol. 1974;63:37–61. Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Kalloniatis M, Luu C. Light and dark adaptation. In: Kolb H, Fernandez E, Nelson R, editors. Webvision: The Organization of the Retina and Visual System [Internet]. Salt Lake City (UT): University of Utah Health Sciences Center; 1995. Available from: http://www.ncbi.nlm.nih.gov/books/NBK11525/. Lakens D. Calculating and reporting effect sizes to facilitate cumulative science: a practical primer for t-tests and anovas. Front Psychol. 2013;4:863. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Schünemann HJ, Mustafa RA, Brozek J, Santesso N, Bossuyt PM, Steingart KR, et al. Grade guidelines: 22. the grade approach for tests and strategies-from test accuracy to patient-important outcomes and recommendations. J Clin Epidemiol. 2019;111:69–82. Article \n    PubMed \n    \n                    Google Scholar Schünemann HJ, Mustafa RA, Brozek J, Steingart KR, Leeflang M, Murad MH, et al. Grade guidelines: 21 part 1. study design, risk of bias, and indirectness in rating the certainty across a body of evidence for test accuracy. J Clin Epidemiol. 2020;122:129–41. Article \n    PubMed \n    \n                    Google Scholar Jaeschke R, Guyatt GH, Sackett DL. Users’ guides to the medical literature. iii. how to use an article about a diagnostic test. b. what are the results and will they help me in caring for my patients? The evidence-based medicine working group. JAMA. 1994;271:703–7. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Nivison-Smith L, Trinh M, Kalloniatis M, Khuu S. PROSPERO 2022 CRD42022333929 does automated perimetry conducted under mesopic or scotopic conditions detect clinically significant visual field defects in patients with early to intermediate age-related macular degeneration (AMD)? A systematic review and meta-analysis. NIHR; 2022. Available from: https://www.crd.york.ac.uk/prospero/display_record.php?ID=CRD42022333929. Moher D, Liberati A, Tetzlaff J, Altman DG. Preferred reporting items for systematic reviews and meta-analyses: the prisma statement. BMJ. 2009;339:b2535. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Ikeda M, Kinney J, Palmer D, Sagawa K, Trezona P. Mesopic photometry: History, special problems and practical solutions | CIE [Internet]. Commission Internationale de l’Eclairage; 1989. Available from: https://cie.co.at/publications/mesopic-photometry-history-special-problems-and-practical-solutions. Zele AJ, Cao D. Vision under mesopic and scotopic illumination. Front Psychol. 2014;5:1594. PubMed \n    \n                    Google Scholar AGi32 LA Inc. Photopic, mesopic, scotopic - concepts. 2021. Available from: https://docs.agi32.com/AGi32/Content/references/Photopic_Mesopic_Scotopic_-_Concepts.htm. Kalloniatis M, Harwerth RS. Spectral sensitivity and adaptation characteristics of cone mechanisms under white-light adaptation. J Opt Soc Am. 1990;7:1912–28. Article \n    ADS \n    CAS \n    \n                    Google Scholar Halonen L, Puolakka M, Ayama M, Bodrogi P, Bullough J, Burini E, et al. Recommended system for mesopic photometry based on visual performance | CIE. 2010. Available from: https://cie.co.at/publications/recommended-system-mesopic-photometry-based-visual-performance. Sample PA, Dannheim F, Artes PH, Dietzsch J, Henson D, Johnson CA, et al. Imaging and perimetry society standards and guidelines. Optom Vis Sci. 2011;88:4–7. Article \n    PubMed \n    \n                    Google Scholar Ferris FL, Wilkinson CP, Bird A, Chakravarthy U, Chew E, Csaky K, et al. Clinical classification of age-related macular degeneration. Ophthalmology. 2013;120:844–51. Article \n    PubMed \n    \n                    Google Scholar Age-Related Eye Disease Study Research Group. The age-related eye disease study system for classifying age-related macular degeneration from stereoscopic color fundus photographs: the age-related eye disease study report number 6. Am J Ophthalmol. 2001;132:668–81. Article \n    \n                    Google Scholar Bird AC, Bressler NM, Bressler SB, Chisholm IH, Coscas G, Davis MD, et al. An international classification and grading system for age-related maculopathy and age-related macular degeneration. Surv Ophthalmol. 1995;39:367–74. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Levine M, Walter S, Lee H, Haines T, Holbrook A, Moyer V. Users’ guides to the medical literature. iv. how to use an article about harm. evidence-based medicine working group. JAMA. 1994;271:1615–9. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Morissette K, Tricco AC, Horsley T, Chen MH, Moher D. Blinded versus unblinded assessments of risk of bias in studies included in a systematic review. Cochrane Database Syst Rev. 2011;2011:MR000025. PubMed \n    PubMed Central \n    \n                    Google Scholar Whiting P, Rutjes AWS, Reitsma JB, Bossuyt PMM, Kleijnen J. The development of quadas: a tool for the quality assessment of studies of diagnostic accuracy included in systematic reviews. BMC Med Res Methodol. 2003;3:25. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Wells G, Shea B, O’Connell D, Peterson J, Welch V, Losos M, et al. The Newcastle-Ottawa Scale (NOS) for assessing the quality of nonrandomised studies in meta-analyses. The Ottawa Hospital Research Institute; 2013. Available from: http://www.ohri.ca/programs/clinical_epidemiology/oxford.asp. Schünemann H, Brożek J, Guyatt G, Oxman A. GRADE handbook for grading quality of evidence and strength of recommendations. The GRADE Working Group; 2013. Available from: https://guidelinedevelopment.org/handbook. Guyatt G, Oxman AD, Akl EA, Kunz R, Vist G, Brozek J, et al. Grade guidelines: 1. introduction-grade evidence profiles and summary of findings tables. J Clin Epidemiol. 2011;64:383–94. Article \n    PubMed \n    \n                    Google Scholar Suurmond R, van Rhee H, Hak T. Introduction, comparison, and validation of meta-essentials: a free and simple tool for meta-analysis. Res Synth Methods. 2017;8:537–53. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Higgins J, Thomas J, Chandler J, Cumpston M, Li T, Page M, et al. Cochrane handbook for systematic reviews of interventions version 6.3 (updated February 2022). 6.3. Cochrane; 2022. Available from: www.training.cochrane.org/handbook. Morton SC, Adams JL, Suttorp MJ, Shekelle PG. Meta-regression approaches: What, why, when, and how? [Internet]. Rockville (MD): Agency for Healthcare Research and Quality (US); 2004. (AHRQ Technical Reviews). Available from: http://www.ncbi.nlm.nih.gov/books/NBK43894/. Borenstein M, Hedges LV, Higgins JPT, Rothstein HR. Introduction to meta-analysis. John Wiley and Sons; 2009. Available from: http://www.scopus.com/inward/record.url?scp=84889351499&partnerID=8YFLogxK. Tendal B, Nüesch E, Higgins JPT, Jüni P, Gøtzsche PC. Multiplicity of data in trial reports and the reliability of meta-analyses: empirical study. BMJ. 2011 ;343:d4829. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Burke JF, Sussman JB, Kent DM, Hayward RA. Three simple rules to ensure reasonably credible subgroup analyses. BMJ. 2015;351:h5651. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Borenstein M, Hedges LV, Higgins JPT, Rothstein HR. A basic introduction to fixed-effect and random-effects models for meta-analysis. Res Synth Methods. 2010;1:97–111. Article \n    PubMed \n    \n                    Google Scholar Liu P, Ioannidis JPA, Ross JS, Dhruva SS, Luxkaranayagam AT, Vasiliou V, et al. Age-treatment subgroup analyses in cochrane intervention reviews: a meta-epidemiological study. BMC Med. 2019;17:188. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Richardson M, Garner P, Donegan S. Interpretation of subgroup analyses in systematic reviews: a tutorial. Clin Epidemiol Glob Health. 2019;7:192–8. Article \n    \n                    Google Scholar Armstrong RA. When to use the bonferroni correction. Ophthalmic Physiol Opt. 2014;34:502–8. Article \n    PubMed \n    \n                    Google Scholar Egger M, Smith GD, Schneider M, Minder C. Bias in meta-analysis detected by a simple, graphical test. BMJ. 1997;315:629–34. Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar van Enst WA, Ochodo E, Scholten RJ, Hooft L, Leeflang MM. Investigation of publication bias in meta-analyses of diagnostic test accuracy: a meta-epidemiological study. BMC Med Res Methodol. 2014;14:70. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Begg CB, Mazumdar M. Operating characteristics of a rank correlation test for publication bias. Biometrics. 1994;50:1088–101. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Chandramohan A, Stinnett SS, Petrowski JT, Schuman SG, Toth CA, Cousins SW, et al. Visual function measures in early and intermediate age-related macular degeneration. Retina. 2016;36:1021–31. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Echols BS, Clark ME, Swain TA, Chen L, Kar D, Zhang Y, et al. Hyperreflective foci and specks are associated with delayed rod-mediated dark adaptation in nonneovascular age-related macular degeneration. Ophthalmol Retin. 2020;4:1059–68. Article \n    \n                    Google Scholar Forshaw TRJ, Parpounas AK, Sørensen TL. Correlation of macular sensitivity measures and visual acuity to vision-related quality of life in patients with age-related macular degeneration. BMC Ophthalmol. 2021;21:149. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Fragiotta S, Carnevale C, Cutini A, Vingolo EM. Correlation between retinal function and microstructural foveal changes in intermediate age-related macular degeneration. Int J Retin Vitr. 2017;3:8. Article \n    \n                    Google Scholar Goh KL, Abbott CJ, Hadoux X, Jannaud M, Hodgson LAB, van Wijngaarden P, et al. Hyporeflective cores within drusen: association with progression of age-related macular degeneration and impact on visual sensitivity. Ophthalmol Retin. 2022;6:284–90. Article \n    \n                    Google Scholar Phipps JA, Guymer RH, Vingrys AJ. Temporal sensitivity deficits in patients with high-risk drusen. Aust N. Z J Ophthalmol. 1999;27:265–7. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Pondorfer SG, Terheyden JH, Heinemann M, Wintergerst MWM, Holz FG, Finger RP. Association of vision-related quality of life with visual function in age-related macular degeneration. Sci Rep. 2019;9:15326. Article \n    ADS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Sassmannshausen M, Steinberg JS, Fimmers R, Pfau M, Thiele S, Fleckenstein M, et al. Structure-function analysis in patients with intermediate age-related macular degeneration. Invest Ophthalmol Vis Sci. 2018;59:1599–608. Article \n    PubMed \n    \n                    Google Scholar Sassmannshausen M, Zhou J, Pfau M, Thiele S, Steinberg J, Fleckenstein M, et al. Longitudinal analysis of retinal thickness and retinal function in eyes with large drusen secondary to intermediate age-related macular degeneration. Ophthalmol Retin. 2021;5:241–50. Article \n    \n                    Google Scholar Steinmetz RL, Haimovici R, Jubb C, Fitzke FW, Bird AC. Symptomatic abnormalities of dark adaptation in patients with age-related Bruch’s membrane change. Br J Ophthalmol. 1993;77:549–54. Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Wu Z, Luu CD, Hodgson LAB, Caruso E, Brassington KH, Tindill N, et al. Secondary and exploratory outcomes of the subthreshold nanosecond laser intervention randomized trial in age-related macular degeneration: a lead study report. Ophthalmol Retin. 2019;3:1026–34. Article \n    \n                    Google Scholar Parodi MB, Triolo G, Morales M, Borrelli E, Cicinelli MV, Cascavilla ML, et al. MP1 and MAIA fundus perimetry in healthy subjects and patients affected by retinal dystrophies. Retin Philos Pa. 2015;35:1662–9. Google Scholar Trinh M, Kalloniatis M, Nivison-Smith L. Should clinical automated perimetry be considered for routine functional assessment of early/intermediate age-related macular degeneration (AMD)? A systematic review of current literature. Ophthalmic Physiol Opt. 2022;42:161–77. Article \n    PubMed \n    \n                    Google Scholar McGuinness MB, Finger RP, Wu Z, Luu CD, Chen FK, Arnold JJ, et al. Properties of the impact of vision impairment and night vision questionnaires among people with intermediate age-related macular degeneration. Transl Vis Sci Technol. 2019;8:3. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar McGuinness MB, Finger RP, Wu Z, Luu CD, Chen FK, Arnold JJ, et al. Association between patient-reported outcomes and time to late age-related macular degeneration in the laser intervention in early stages of age-related macular degeneration study. Ophthalmol Retin. 2020;4:881–8. Article \n    \n                    Google Scholar Lamoureux EL, Pallant JF, Pesudovs K, Rees G, Hassell JB, Keeffe JE. The impact of vision impairment questionnaire: an assessment of its domain structure using confirmatory factor analysis and rasch analysis. Invest Ophthalmol Vis Sci. 2007;48:1001–6. Article \n    PubMed \n    \n                    Google Scholar Mangione CM, Lee PP, Gutierrez PR, Spritzer K, Berry S, Hays RD, et al. Development of the 25-item national eye institute visual function questionnaire. Arch Ophthalmol. 2001;119:1050–8. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Ying Gshuang, Maguire MG, Liu C, Antoszyk AN. Night vision symptoms and progression of age-related macular degeneration in the complications of age-related macular degeneration prevention trial. Ophthalmology. 2008;115:1876–.e4. Article \n    PubMed \n    \n                    Google Scholar Taylor DJ, Smith ND, Jones PR, Binns AM, Crabb DP. Measuring dynamic levels of self-perceived anxiety and concern during simulated mobility tasks in people with non-neovascular age-related macular degeneration. Br J Ophthalmol. 2020;104:529–34. Article \n    PubMed \n    \n                    Google Scholar Higgins BE, Taylor DJ, Bi W, Binns AM, Crabb DP. Novel computer-based assessments of everyday visual function in people with age-related macular degeneration. PLOS ONE. 2020;15:e0243578. Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Bossuyt PM, Reitsma JB, Linnet K, Moons KG. Beyond diagnostic accuracy: the clinical utility of diagnostic tests. Clin Chem. 2012;58:1636–43. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Brydges CR. Effect size guidelines, sample size calculations, and statistical power in gerontology. Innov Aging. 2019;3:igz036. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Sullivan GM, Feinn R. Using effect size—or why the p value is not enough. J Grad Med Educ. 2012;4:279–82. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Cohen J. Statistical power analysis for the behavioural sciences. 2nd ed. New York: Lawrence Erlbaum Associates; 1988. Available from: https://www.taylorfrancis.com/books/mono/10.4324/9780203771587/statistical-power-analysis-behavioral-sciences-jacob-cohen. Cuijpers P. Has the time come to stop using the ‘standardised mean difference’? Clin Psychol Eur. 2021;3:e6835. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Chauhan BC, Garway-Heath DF, Goñi FJ, Rossetti L, Bengtsson B, Viswanathan AC, et al. Practical recommendations for measuring rates of visual field change in glaucoma. Br J Ophthalmol. 2008;92:569–73. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Vaz S, Falkmer T, Passmore AE, Parsons R, Andreou P. The case for using the repeatability coefficient when calculating test–retest reliability. PLOS ONE. 2013;8:e73990. Article \n    ADS \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Beckerman H, Roebroeck ME, Lankhorst GJ, Becher JG, Bezemer PD, Verbeek AL. Smallest real difference, a link between reproducibility and responsiveness. Qual Life Res Int J Qual Life Asp Treat Care Rehabil. 2001;10:571–8. Article \n    CAS \n    \n                    Google Scholar Reid MC, Lachs MS, Feinstein AR. Use of methodological standards in diagnostic test research. getting better but still not good. JAMA. 1995;274:645–51. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Twa MD. A call for standardized outcome measures. Optom Vis Sci. 2022;99:735–6. Article \n    PubMed \n    \n                    Google Scholar Guyatt GH, Tugwell PX, Feeny DH, Haynes RB, Drummond M. A framework for clinical evaluation of diagnostic technologies. CMAJ Can Med Assoc J. 1986;134:587–94. CAS \n    \n                    Google Scholar Greenes RA, Begg CB. Assessment of diagnostic technologies. methodology for unbiased estimation from samples of selectively verified patients. Invest Radio. 1985;20:751–6. Article \n    CAS \n    \n                    Google Scholar Fineberg HV, Hiatt HH. Evaluation of medical practices. the case for technology assessment. N. Engl J Med. 1979;301:1086–91. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Kalloniatis M, Harwerth RS. Modelling sensitivity losses in ocular disorders: colour vision anomalies following intense blue-light exposure in monkeys. Ophthalmic Physiol Opt. 1993;13:155–67. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Herse P. An application of threshold-versus-intensity functions in automated static perimetry. Vis Res. 2005;45:461–8. Article \n    ADS \n    PubMed \n    \n                    Google Scholar Han RC, Jolly JK, Xue K, MacLaren RE. Effects of pupil dilation on MAIA microperimetry. Clin Exp Ophthalmol. 2017;45:489–95. Article \n    PubMed \n    \n                    Google Scholar Han RC, Gray JM, Han J, Maclaren RE, Jolly JK. Optimisation of dark adaptation time required for mesopic microperimetry. Br J Ophthalmol. 2019;103:1092–8. Article \n    PubMed \n    \n                    Google Scholar Higgins BE, Montesano G, Dunbar HMP, Binns AM, Taylor DJ, Behning C, et al. Test-retest variability and discriminatory power of measurements from microperimetry and dark adaptation assessment in people with intermediate age-related macular degeneration – a MACUSTAR study report. Transl Vis Sci Technol. 2023;12:19. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Taylor LJ, Josan AS, Pfau M, Simunovic MP, Jolly JK. Scotopic microperimetry: evolution, applications and future directions. Clin Exp Optom. 2022;105:1–8. Article \n    \n                    Google Scholar Turpin A, McKendrick AM, Johnson CA, Vingrys AJ. Properties of perimetric threshold estimates from full threshold, zest, and sita-like strategies, as determined by computer simulation. Invest Ophthalmol Vis Sci. 2003;44:4787–95. Article \n    PubMed \n    \n                    Google Scholar Phu J, Kalloniatis M. Comparison of 10-2 and 24-2c test grids for identifying central visual field defects in glaucoma and suspect patients. Ophthalmology. 2021;128:1405–16. Article \n    PubMed \n    \n                    Google Scholar Phu J, Kalloniatis M. Viability of performing multiple 24-2 visual field examinations at the same clinical visit: the frontloading fields study (ffs). Am J Ophthalmol. 2021;230:48–59. Article \n    PubMed \n    \n                    Google Scholar Phu J, Kalloniatis M. The frontloading fields study (ffs): detecting changes in mean deviation in glaucoma using multiple visual field tests per clinical visit. Transl Vis Sci Technol. 2021;10:21. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Hood DC, Greenstein V. Models of the normal and abnormal rod system. Vis Res. 1990;30:51–68. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Kalloniatis M, Harwerth RS. Differential adaptation of cone mechanisms explains the preferential loss of short-wavelength cone sensitivity in retinal disease. In: Drum B, Verriest G, editors. Colour Vision Deficiencies IX [Internet]. Dordrecht: Springer Netherlands; 1989. 353–64. (Documenta Ophthalmologica Proceedings Series). Available from: https://doi.org/10.1007/978-94-009-2695-0_41. Barlow HB. Temporal and spatial summation in human vision at different background intensities. J Physiol. 1958;141:337–50. Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Redmond T, Zlatkova MB, Vassilev A, Garway-Heath DF, Anderson RS. Changes in ricco’s area with background luminance in the s-cone pathway. Optom Vis Sci. 2013;90:66–74. Article \n    PubMed \n    \n                    Google Scholar Lee SCS, Martin PR, Grünert U. Topography of neurons in the rod pathway of human retina. Invest Ophthalmol Vis Sci. 2019;60:2848–59. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Ahnelt PK. The photoreceptor mosaic. Eye. 1998;12:531–40. Article \n    PubMed \n    \n                    Google Scholar Curcio CA, Sloan KR, Kalina RE, Hendrickson AE. Human photoreceptor topography. J Comp Neurol. 1990;292:497–523. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Simunovic MP, Moore AT, MacLaren RE. Selective automated perimetry under photopic, mesopic, and scotopic conditions: detection mechanisms and testing strategies. Transl Vis Sci Technol. 2016;5:10–10. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Kalloniatis M, Harwerth RS. Effects of chromatic adaptation on opponent interactions in monkey increment-threshold spectral-sensitivity functions. J Opt Soc Am. 1991;8:1818–31. Article \n    ADS \n    CAS \n    \n                    Google Scholar Bennett LD, Klein M, Locke KG, Kiser K, Birch DG. Dark-adapted chromatic perimetry for measuring rod visual fields in patients with retinitis pigmentosa. Transl Vis Sci Technol. 2017;6:15. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar McGuigan DB III, Roman AJ, Cideciyan AV, Matsui R, Gruzensky ML, Sheplock R, et al. Automated light- and dark-adapted perimetry for evaluating retinitis pigmentosa: filling a need to accommodate multicenter clinical trials. Invest Ophthalmol Vis Sci. 2016;57:3118–28. Article \n    PubMed \n    \n                    Google Scholar Wald G. Human vision and the spectrum. Science. 1945;101:653–8. Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Montelongo M, Gonzalez A, Morgenstern F, Donahue SP, Groth SL. A virtual reality-based automated perimeter, device, and pilot study. Transl Vis Sci Technol. 2021;10:20. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Wu Z, Luu CD, Hodgson LA, Caruso E, Chen FK, Chakravarthy U, et al. Examining the added value of microperimetry and low luminance deficit for predicting progression in age-related macular degeneration. Br J Ophthalmol. 2021;105:711–5. Article \n    PubMed \n    \n                    Google Scholar Trinh M, Kalloniatis M, Alonso-Caneiro D, Nivison-Smith L. Spatial Cluster Patterns of Retinal Sensitivity Loss in Intermediate Age-Related Macular Degeneration Features. Transl Vis Sci Technol. 2023;12:6. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Trinh M, Khou V, Kalloniatis M, Nivison-Smith L. Location-specific thickness patterns in intermediate age-related macular degeneration reveals anatomical differences in multiple retinal layers. Invest Ophthalmol Vis Sci. 2021;62:13. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Trinh M, Kalloniatis M, Nivison-Smith L. Radial peripapillary capillary plexus sparing and underlying retinal vascular impairment in intermediate age-related macular degeneration. Invest Ophthalmol Vis Sci. 2021;62:2. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Tuut MK, Burgers JS, van der Weijden T, Langendam MW. Do clinical practice guidelines consider evidence about diagnostic test consequences on patient-relevant outcomes? A critical document analysis. J Eval Clin Pr. 2022;28:278–87. Article \n    \n                    Google Scholar Aleman TS, Miller AJ, Maguire KH, Aleman EM, Serrano LW, O’Connor KB, et al. A virtual reality orientation and mobility test for inherited retinal degenerations: testing a proof-of-concept after gene therapy. Clin Ophthalmol Auckl NZ. 2021;15:939–52. Article \n    \n                    Google Scholar Owsley C, Ball K, McGwin G, Sloane ME, Roenker DL, White MF, et al. Visual processing impairment and risk of motor vehicle crash among older adults. JAMA. 1998;279:1083–8. Article \n    CAS \n    PubMed \n    \n                    Google Scholar McGwin G, Xie A, Mays A, Joiner W, DeCarlo DK, Hall TA, et al. Visual field defects and the risk of motor vehicle collisions among patients with glaucoma. Invest Ophthalmol Vis Sci. 2005;46:4437–41. Article \n    PubMed \n    \n                    Google Scholar Wood JM, Black AA, Dingle K, Rutter C, DiStefano M, Koppel S, et al. Impact of vision disorders and vision impairment on motor vehicle crash risk and on-road driving performance: a systematic review. Acta Ophthalmol. 2022;100:e339–67. Article \n    PubMed \n    \n                    Google Scholar Huisingh C, McGwin G, Wood J, Owsley C. The driving visual field and a history of motor vehicle collision involvement in older drivers: a population-based examination. Invest Ophthalmol Vis Sci. 2014;56:132–8. Article \n    PubMed \n    \n                    Google Scholar Download references This work has been presented as an abstract at the International Society for Eye Research 2023 meeting and an earlier version will be later published as a PhD thesis chapter. The authors especially thank the researchers who generously provided further data for meta-analyses. This work was supported, in part, by National Health and Medical Research Council of Australia (NHMRC) grant #1186915 to MK and SKK and NHMRC grant #1174385 to LNS. MT was supported by the Australian Research Training Program scholarship. The funding bodies had no influence on any aspect of study design, data collection, analysis, or interpretation. Open Access funding enabled and organized by CAUL and its Member Institutions. School of Optometry and Vision Science, University of New South Wales, Sydney, NSW, Australia Matt Trinh, Michael Kalloniatis, Sieu K. Khuu & Lisa Nivison-Smith School of Medicine (Optometry), Deakin University, Geelong, VIC, Australia Michael Kalloniatis You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar Matt Trinh: Conceptualisation, Methodology, Software, Validation, Formal Analysis, Investigation, Data Curation, Writing, Visualisation. Michael Kalloniatis: Conceptualisation, Resources, Writing, Supervision, Project Administration, Funding Acquisition. Sieu Khuu: Software, Formal Analysis, Writing, Supervision. Lisa Nivison-Smith: Conceptualisation, Methodology, Validation, Formal Analysis, Investigation, Resources, Data Curation, Writing, Supervision, Project Administration, Funding Acquisition. Correspondence to\n                Lisa Nivison-Smith. The authors declare no competing interests. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Open Access  This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article’s Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article’s Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http://creativecommons.org/licenses/by/4.0/. Reprints and permissions Trinh, M., Kalloniatis, M., Khuu, S.K. et al. Retinal sensitivity changes in early/intermediate AMD: a systematic review and meta-analysis of visual field testing under mesopic and scotopic lighting.\n                    Eye  (2024). https://doi.org/10.1038/s41433-024-03033-0 Download citation Received: 22 August 2023 Revised: 22 January 2024 Accepted: 08 March 2024 Published: 18 March 2024 DOI: https://doi.org/10.1038/s41433-024-03033-0 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Advertisement Eye (Eye)\n                \n\nISSN 1476-5454 (online)\n    \n\nISSN 0950-222X (print) © 2024 Springer Nature Limited "
}