{
    "title": "AMD A9-9410 vs AMD Ryzen 7 2800H vs AMD E2-9000",
    "date": "3/27/2024",
    "url": "https://www.notebookcheck.net/A9-9410-vs-R7-2800H-vs-E2-9000_8181_10144_9294.247596.0.html",
    "text": "The AMD A9-9410 is an entry-level chip from the Stoney-Ridge APU series for notebooks (7th APU generation), which was announced mid 2016. At its launch, the A9-9410 is the fastest Stoney Ridge processor (dual-core version of Bristol Ridge) and integrates two CPU cores (one Excavator module with 2 integer and on FP unit) clocked between 2.9-3.5 GHz. It also includes a Radeon R5 GPU with 192 shaders at 800 MHz as well as a single-channel DDR4-2133 memory controller, H.265 video engine and chipset with all I/O ports. \nArchitecture \nStoney Ridge is the successor of the Carrizo architecture and the design is almost identical. Thanks to optimized manufacturing processes and more aggressive Boost behavior, however, the clocks are a bit higher at the same power consumption. The memory controller now also supports DDR4-RAM, in this case up to 2133 MHz. Stoney Ridge is the designation for the smaller dual-core and single-core chip, while Bristol Ridge is the bigger quad-core chip with dual-channel memory controller. More technical details are available in the following articles:AMD's Bristol Ridge and Stoney Ridge ArchitectureAMD: Bristol Ridge APUs announcedPerformance \nThanks to the high maximum clock of up to 3.5 GHz, the single-core performance should be pretty good. The multi-core performance on the other hand is much lower compared to the Bristol Ridge models. Compared to older Carrizo-L/Beema quad-cores, the APU should still perform pretty well. The level of performance should be similar to a Core-m3 and therefore also be sufficient for more demanding applications. \nThe TDP can be configured between 10-25 Watts, so there can be big performance differences under sustained workloads. \nGraphics Card \nThe integrated Radeon R5 (Stoney Ridge) GPU has 192 active shader units (3 compute cores) clocked at up to 800 MHz. More details about the GPU are available in the linked articles above.  \nPower Consumption \nAMD specifies the TDP of the A9-9410 with 15 Watts, but it can be configured between 10-25 Watts. This means the CPU is a good choice for thin and light notebooks, but also 15-inch devices with better cooling capabilities. The AMD A9-9410 is an entry-level chip from the Stoney-Ridge APU series for notebooks (7th APU generation), which was announced mid 2016. At its launch, the A9-9410 is the fastest Stoney Ridge processor (dual-core version of Bristol Ridge) and integrates two CPU cores (one Excavator module with 2 integer and on FP unit) clocked between 2.9-3.5 GHz. It also includes a Radeon R5 GPU with 192 shaders at 800 MHz as well as a single-channel DDR4-2133 memory controller, H.265 video engine and chipset with all I/O ports. Architecture Stoney Ridge is the successor of the Carrizo architecture and the design is almost identical. Thanks to optimized manufacturing processes and more aggressive Boost behavior, however, the clocks are a bit higher at the same power consumption. The memory controller now also supports DDR4-RAM, in this case up to 2133 MHz. Stoney Ridge is the designation for the smaller dual-core and single-core chip, while Bristol Ridge is the bigger quad-core chip with dual-channel memory controller. More technical details are available in the following articles: Performance Thanks to the high maximum clock of up to 3.5 GHz, the single-core performance should be pretty good. The multi-core performance on the other hand is much lower compared to the Bristol Ridge models. Compared to older Carrizo-L/Beema quad-cores, the APU should still perform pretty well. The level of performance should be similar to a Core-m3 and therefore also be sufficient for more demanding applications. The TDP can be configured between 10-25 Watts, so there can be big performance differences under sustained workloads. Graphics Card The integrated Radeon R5 (Stoney Ridge) GPU has 192 active shader units (3 compute cores) clocked at up to 800 MHz. More details about the GPU are available in the linked articles above. Power Consumption AMD specifies the TDP of the A9-9410 with 15 Watts, but it can be configured between 10-25 Watts. This means the CPU is a good choice for thin and light notebooks, but also 15-inch devices with better cooling capabilities. The AMD Ryzen 7 2800H is a mobile SoC that was announced late 2018. It is intended for mid-sized to big laptops and combines four Zen cores (8 threads) clocked at 3.3 (base) - 3.8 GHz (boost) with a Radeon RX Vega 11 Mobile graphics card with 11 CUs (704 Shaders). The integrated dual-channel memory controller supports up to DDR4-3200 memory. \nCompared to the older Ryzen 7 2700U for slim and light laptops, the 2800H offers a higher TDP (45 Watt versus 15 Watt), higher clocked memory, a higher base clock (3.4 versus 2.2 GHz), and a faster integrated GPU. \nMore information on Raven Ridge can be found in our launch article. \nPerformance \nWhile we have not tested a single system built around the 2800H as of August 2023, it's safe to expect the chip to be 10% to 15% faster than Ryzen 3 1200, as far as multi-thread performance is concerned. \nYour mileage may vary depending on how high the CPU power limits are, and how competent the cooling solution of your system is. \nPower consumption \nThis Ryzen 7 has a default TDP (also known as the long-term power limit) of 45 W, a value that laptop manufacturers are free to change to anything between 35 W and 54 W with clock speeds and performance changing correspondingly. All the values are rather high, making a high-performance cooling solution with two or three fans pretty much a necessity. \nThe CPU is built on an old, as of late 2022, 14 nm process for subpar energy efficiency. The AMD Ryzen 7 2800H is a mobile SoC that was announced late 2018. It is intended for mid-sized to big laptops and combines four Zen cores (8 threads) clocked at 3.3 (base) - 3.8 GHz (boost) with a Radeon RX Vega 11 Mobile graphics card with 11 CUs (704 Shaders). The integrated dual-channel memory controller supports up to DDR4-3200 memory. Compared to the older Ryzen 7 2700U for slim and light laptops, the 2800H offers a higher TDP (45 Watt versus 15 Watt), higher clocked memory, a higher base clock (3.4 versus 2.2 GHz), and a faster integrated GPU. More information on Raven Ridge can be found in our launch article. Performance While we have not tested a single system built around the 2800H as of August 2023, it's safe to expect the chip to be 10% to 15% faster than Ryzen 3 1200, as far as multi-thread performance is concerned. Your mileage may vary depending on how high the CPU power limits are, and how competent the cooling solution of your system is. Power consumption This Ryzen 7 has a default TDP (also known as the long-term power limit) of 45 W, a value that laptop manufacturers are free to change to anything between 35 W and 54 W with clock speeds and performance changing correspondingly. All the values are rather high, making a high-performance cooling solution with two or three fans pretty much a necessity. The CPU is built on an old, as of late 2022, 14 nm process for subpar energy efficiency. The AMD E2-9000 is the least powerful chip from the Stoney-Ridge APU series for notebooks (7th APU generation) at the time of announcement in 2017. The SoC integrates two CPU cores (one Excavator module with 2 integer and on FP unit) clocked between 1.8-2.2 GHz. It also includes a Radeon R2 GPU clocked at 600 MHz as well as a single-channel DDR4-1866 memory controller, H.265 video engine and chipset with all I/O ports. Compared to the older E2-9010, the E2-9000 offers a lower base speed (1.8 versus 2 GHz). \nArchitecture \nStoney Ridge is the successor of the Carrizo architecture and the design is almost identical. Thanks to optimized manufacturing processes and more aggressive Boost behavior, however, the clocks are a bit higher at the same power consumption. The memory controller now also supports DDR4-RAM, in this case up to 1866 MHz. Stoney Ridge is the designation for the smaller dual-core and single-core chip, while Bristol Ridge is the bigger quad-core chip with dual-channel memory controller. More technical details are available in the following articles:AMD's Bristol Ridge and Stoney Ridge ArchitectureAMD: Bristol Ridge APUs announcedPower Consumption \nAMD specifies the TDP of the E2-9000 with 10 Watts (compared to the 9010 at 15W). This means the APU is intended for thin and light notebooks. The AMD E2-9000 is the least powerful chip from the Stoney-Ridge APU series for notebooks (7th APU generation) at the time of announcement in 2017. The SoC integrates two CPU cores (one Excavator module with 2 integer and on FP unit) clocked between 1.8-2.2 GHz. It also includes a Radeon R2 GPU clocked at 600 MHz as well as a single-channel DDR4-1866 memory controller, H.265 video engine and chipset with all I/O ports. Compared to the older E2-9010, the E2-9000 offers a lower base speed (1.8 versus 2 GHz). Architecture Stoney Ridge is the successor of the Carrizo architecture and the design is almost identical. Thanks to optimized manufacturing processes and more aggressive Boost behavior, however, the clocks are a bit higher at the same power consumption. The memory controller now also supports DDR4-RAM, in this case up to 1866 MHz. Stoney Ridge is the designation for the smaller dual-core and single-core chip, while Bristol Ridge is the bigger quad-core chip with dual-channel memory controller. More technical details are available in the following articles: Power Consumption AMD specifies the TDP of the E2-9000 with 10 Watts (compared to the 9010 at 15W). This means the APU is intended for thin and light notebooks. #0 checking url part for id 8181 +0s ... 0s #1 checking url part for id 10144 +0s ... 0s #2 checking url part for id 9294 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.034s ... 0.035s #6 did output specs +0s ... 0.035s #7 getting avg benchmarks for device 8181 +0.003s ... 0.038s #8 got single benchmarks 8181 +0.01s ... 0.048s #9 getting avg benchmarks for device 10144 +0.002s ... 0.05s #10 got single benchmarks 10144 +0s ... 0.051s #11 getting avg benchmarks for device 9294 +0.002s ... 0.053s #12 got single benchmarks 9294 +0.01s ... 0.063s #13 got avg benchmarks for devices +0s ... 0.063s #14 min, max, avg, median took s +0.236s ... 0.299s #15 return log +0s ... 0.299s "
}