{
    "title": null,
    "date": "3/24/2024",
    "url": "https://technosports.co.in/amds-5th-gen-epyc-turin-lineup-leak/",
    "text": "Yuuki_AnS has shared information about the CPU lineup of the AMD 5th Gen EPYC Turin series. This new lineup will feature a combination of Zen 5 and Zen 5C cores with a maximum of 160 cores. The processors in this family are expected to offer around 20 models utilizing the Zen 5 “Nirvana”, and Zen 5C “Prometheus” core designs. Notably these EPYC Turin processors are designed to work with the existing SP5 (LGA 6096) socket used by the Gen EPYC family and will support DDR5 memory running at speeds of up to 6000 MT/s. Table of Contents Although specific details on which SKUs will be based on Zen 5 or Zen 5C architecture have not been disclosed we can make educated guesses based on the anticipated core counts within each model. The top SKUs are expected to include models like EPYC 9845, 9825, 9745, and others like the EPYC9655, 9645, and 95655. These models will vary in core/thread counts, cache sizes, and power consumption levels ranging from 320/400W up to 500W. The EPYC Turin series is set to offer a variety of CPU configurations that span from setups featuring 16 CCD +1 IOD to those with 2 CCD +1 IOD configurations. Cache sizes for these setups are expected to range between 256 MB and 384 MB. The specifications of the cache differ depending on the architecture, with the Zen 5C models expected to have a maximum of 192 cores and 384 MB of L3 cache and the Zen 5 models predicted to offer up to 128 cores and 512 MB of L3 cache. The clock speeds across the range vary from 2.0 GHz to 4 GHz (base) with associated TDPs ranging from 155W to over 300W.  Additionally, leaked platform charts indicate support for DDR5-6000 MT/s memory DIMMs in capacities of up to 4 TB on motherboards with up to 8 DIMM slots along with up to 128 PCIe Gen5 lanes. While the leaked lineup is incomplete and preliminary clock speeds are provided without boost clock information, further details are anticipated closer to the official launch. The 5th Gen EPYC Turin family is expected to debut later this year, following the formal introduction of Zen 5 and Zen 5C architectures for desktop and client PC platforms such as Granite Ridge and Strix Point, positioning itself against Intel’s Xeon Granite Rapids P-Core and Sierra Forest E-Core (288 Core) CPUs. AMD has not announced an official release date for the 5th Gen EPYC Turin lineup, but it is expected to debut later this year, following the introduction of Zen 5 and Zen 5C architectures for desktop and client PC platforms. Zen 5C cores are anticipated to offer up to 192 cores and 384 MB L3 cache, while Zen 5 cores may provide up to 128 cores and 512 MB L3 cache. Additionally, Zen 5C cores are expected to have a lower TDP compared to Zen 5 cores. Save my name, email, and website in this browser for the next time I comment.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Made by Enthusiasts, Read by geeks and passionates. We serve the best Tech & Sports news for our global readers every day. Catch all the latest news at TechnoSports, join our family now!\nContact us: [email protected] © 2024 TechnoSports Media Group, Made in India "
}