{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.tradingview.com/news/benzinga:d41a5c30d094b:0-amd-launches-spartan-fpga-family-boosts-ai-team-as-us-sanctions-challenge-china-operations/",
    "text": "Advanced Micro Devices, Inc AMD stock traded above 2% on Wednesday despite reports of U.S. sanctions taking a toll on its China ambitions. AMD initially held a smaller portion of the Chinese AI chip market compared to Nvidia, which dominated the space before the imposition of U.S. restrictions in 2022. However, AMD is now pursuing the AI chip market with greater ambition. In December, it unveiled its new MI300 series, aimed at competing with Nvidia Corp’s NVDA processors. The product tailored for China has been dubbed the MI309. The identity of the Chinese client interested in purchasing AMD’s AI chips remains unknown, which could affect AMD’s ability to obtain a license if it decides to proceed, SCMP reports. Previously, Nvidia voiced a lack of significant impact from the China ban despite U.S. chipmakers canvassed the U.S. government to go softer on the ban. Major Chinese technology firms, including Tencent Holdings Ltd TCEHY and Baidu Inc BIDU, have reportedly accumulated sufficient stockpiles of advanced chips from Nvidia—now under U.S. restrictions—to support their chatbot developments for an additional one to two years. In response to the U.S. ban, Huawei Technologies, based in Shenzhen, is working on developing its AI semiconductors and chip-manufacturing capabilities. The U.S. Department of Commerce has imposed export restrictions on advanced AI processors. To serve its customers in China, AMD designed a chip that aligns with U.S. export regulations, possessing lower performance capabilities compared to its global offerings. AMD also tapped Thomas Zacharia as the new Senior Vice President of Strategic Technology Partnerships and Public Policy. Zacharia will help to drive the global expansion of AMD’s relationships with governments, non-governmental organizations (NGOs), and other entities. His role focuses on accelerating the adoption of customized AMD-powered AI solutions for various global projects aiming to utilize AI for public benefit. Zacharia previously served as the Director of the U.S.’s largest multi-program science and energy research laboratory. Meanwhile, AMD launched its latest Spartan UltraScale+ FPGA family, broadening its diverse range of cost-optimized FPGAs and adaptive SoCs on Tuesday. These new devices are designed for various I/O-intensive applications at the edge, showcasing the best I/O to logic cell ratio among FPGAs made with 28nm and finer process technologies. They achieve up to 30% less total power consumption than prior models and feature the most comprehensive security capabilities in the AMD Cost-Optimized Portfolio. Investors can gain exposure to AMD via AOT Growth And Innovation ETF AOTG and Invesco PHLX Semiconductor ETF SOXQ. Price Actions: AMD shares traded higher by 2.86% at $211.01 premarket on the last check Wednesday. Also Read: Nvidia’s Key Market China Wants To Beat US Embargo, Boosts Chipmaking Machinery Imports by 14% Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. AMD logo. Photo via Shutterstock. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @dehandreh @yo44ge4real @stvmcg @Arcanebear.eth @retirewithforex @sethsickness @aliams_david_trading_gram @mytradingsetup @fx_bitcoin_expert11 @tradingfrance @mytradingsetup @jordan_fx_ @nav.fx @itzi71 @laptopmoneygang @heinrich_j96 @johndollery @aggressivecalculator Whatever the trade "
}