{
    "title": "Intel Core i7-4950HQ vs AMD Ryzen 5 PRO 6650U vs Intel Core i7-4900MQ",
    "date": "3/21/2024",
    "url": "https://www.notebookcheck.net/4950HQ-vs-R5-PRO-6650U-vs-4900MQ_3954_14384_3665.247596.0.html",
    "text": "The Intel Core i7-4950HQ is a high-end quad-core processor for laptops launched in Q2 2013. It is based on the Haswell architecture and manufactured in 22nm. Due to Hyperthreading, the four cores can handle up to eight threads in parallel, leading to better utilization of the CPU. Each core offers a base speed of 2.4 GHz, but can dynamically increase clock rates with Turbo Boost up to 3.4 GHz (for 4 active cores), 3.5 GHz (for 2 active cores) and 3.6 GHz (for 1 active core). A noteworthy feature is the fast integrated graphics unit (GT3e) with eDRAM memory (128 MB, 77 mm², on-package, 102 GB/s).\nHaswell is the successor to the Ivy Bridge architecture with improvements on both GPU and CPU performance. The CPUs are produced in 22nm and offer an optimized branch prediction as well as additional execution ports, improving especially the Hyper-Threading performance. Furthermore, new features like AVX2 and FMA should increase the performance in future applications.Due to these changes, the performance per clock has been improved by about 10 percent compared to Ivy Bridge. Therefore, the performance of the i7-4950HQ is similar to the slightly faster clocked i7-3840QM (Ivy Bridge based).The integrated Iris Pro Graphics 5200 GPU offers 40 Execution Units (EUs) clocked at 200 - 1300 MHz (with Turbo Boost), making it significantly faster than the HD 4000 or HD 4600. The additional eDRAM memory further improves performance. As a result, the HD 5200 competes with dedicated mid-range graphics cards.The i7-4950HQ is rated at a TDP of 47 W including the integrated graphics card, memory controller and VRMs.  Therefore, the CPU is best suited for laptops 15-inches or greater. The Intel Core i7-4950HQ is a high-end quad-core processor for laptops launched in Q2 2013. It is based on the Haswell architecture and manufactured in 22nm. Due to Hyperthreading, the four cores can handle up to eight threads in parallel, leading to better utilization of the CPU. Each core offers a base speed of 2.4 GHz, but can dynamically increase clock rates with Turbo Boost up to 3.4 GHz (for 4 active cores), 3.5 GHz (for 2 active cores) and 3.6 GHz (for 1 active core). A noteworthy feature is the fast integrated graphics unit (GT3e) with eDRAM memory (128 MB, 77 mm², on-package, 102 GB/s). Haswell is the successor to the Ivy Bridge architecture with improvements on both GPU and CPU performance. The CPUs are produced in 22nm and offer an optimized branch prediction as well as additional execution ports, improving especially the Hyper-Threading performance. Furthermore, new features like AVX2 and FMA should increase the performance in future applications. Due to these changes, the performance per clock has been improved by about 10 percent compared to Ivy Bridge. Therefore, the performance of the i7-4950HQ is similar to the slightly faster clocked i7-3840QM (Ivy Bridge based). The integrated Iris Pro Graphics 5200 GPU offers 40 Execution Units (EUs) clocked at 200 - 1300 MHz (with Turbo Boost), making it significantly faster than the HD 4000 or HD 4600. The additional eDRAM memory further improves performance. As a result, the HD 5200 competes with dedicated mid-range graphics cards. The i7-4950HQ is rated at a TDP of 47 W including the integrated graphics card, memory controller and VRMs.  Therefore, the CPU is best suited for laptops 15-inches or greater. The AMD Ryzen 5 PRO 6650U is a processor for thin and light laptops based of the Rembrandt generation. The Ryzen has six out of a possible eight cores based on the Zen 3+ microarchitecture. They are clocked at 2.9 (guaranteed base clock) to 4.5 GHz (Turbo) and support SMT / Hyperthreading (12 threads). The chip is manufactured on the modern 6 nm TSMC process. The Ryzen 5 PRO 6650U is the professional version of the consumer R5 6600U with additional management features and the Microsoft Pluton Security processor. Compared to the similar R5 6650H, the 6850U offers a lower base clock speed and a lower TDP. \nThe new Zen 3+ is a refresh of the Zen 3 architecture and should not offer a lot of changes. The chip itself however, offers a lot of new features, like support for USB 4 (40 Gbps), PCI-E Gen 4, DDR5-4800MT/s or LPDDR5-6400MT/s, WiFi 6E, Bluetooth LE 5.2, DisplayPort 2, and AV1 decode. \nPerformance \nThe average 6650U in our database is very close to the Core i7-1260P and the Core i7-10870H, as far as multi-thread benchmark scores are concerned. This is a really good result, as of late 2022. \nThanks to its decent cooling solution and a long-term CPU power limit of 32 W, the ThinkPad T16 G1 is among the fastest laptops built around the 6650U that we know of. It can be about 20% faster in CPU-bound workloads than the slowest system featuring the same chip in our database, as of August 2023. \nIn the 6000 series, AMD finally switched to the current RDNA 2 graphics architecture for the iGPU. The 6650U only offers the small Radeon 660M with 6 of the 12 CUs enabled and 1.9 GHz max. clock rate. \nThe TDP of the APU is specified at 15 - 28 Watts (default). The power efficiency should be very good, thanks to the improved 6nm process and additional power saving features in the 6000 series. The AMD Ryzen 5 PRO 6650U is a processor for thin and light laptops based of the Rembrandt generation. The Ryzen has six out of a possible eight cores based on the Zen 3+ microarchitecture. They are clocked at 2.9 (guaranteed base clock) to 4.5 GHz (Turbo) and support SMT / Hyperthreading (12 threads). The chip is manufactured on the modern 6 nm TSMC process. The Ryzen 5 PRO 6650U is the professional version of the consumer R5 6600U with additional management features and the Microsoft Pluton Security processor. Compared to the similar R5 6650H, the 6850U offers a lower base clock speed and a lower TDP. The new Zen 3+ is a refresh of the Zen 3 architecture and should not offer a lot of changes. The chip itself however, offers a lot of new features, like support for USB 4 (40 Gbps), PCI-E Gen 4, DDR5-4800MT/s or LPDDR5-6400MT/s, WiFi 6E, Bluetooth LE 5.2, DisplayPort 2, and AV1 decode. Performance The average 6650U in our database is very close to the Core i7-1260P and the Core i7-10870H, as far as multi-thread benchmark scores are concerned. This is a really good result, as of late 2022. Thanks to its decent cooling solution and a long-term CPU power limit of 32 W, the ThinkPad T16 G1 is among the fastest laptops built around the 6650U that we know of. It can be about 20% faster in CPU-bound workloads than the slowest system featuring the same chip in our database, as of August 2023. In the 6000 series, AMD finally switched to the current RDNA 2 graphics architecture for the iGPU. The 6650U only offers the small Radeon 660M with 6 of the 12 CUs enabled and 1.9 GHz max. clock rate. The TDP of the APU is specified at 15 - 28 Watts (default). The power efficiency should be very good, thanks to the improved 6nm process and additional power saving features in the 6000 series. The Intel Core i7-4900MQ is a high-end quad-core processor for laptops which has been launched in Q2/2013. It is based on the Haswell architecture and manufactured in 22nm. Due to Hyperthreading, the four cores can handle up to eight threads in parallel leading to better utilization of the CPU. Each core offers a base speed of 2.8 GHz but can dynamically increase clock rates with Turbo Boost up to 3.6 GHz (for 4 active cores), 3.7 GHz (for 2 active cores) and 3.8 GHz (for 1 active core).\nHaswell is the successor to the Ivy Bridge architecture with improvements on both GPU and CPU performance. The CPUs are produced in 22nm and offer an optimized branch prediction as well as additional execution ports, improving the performance per clock by almost 10 percent. Furthermore, new features like AVX2 and FMA should increase the performance in future applications.Due to these changes, the overall performance has been improved slightly compared to Ivy Bridge. Therefore, the 4900MQ is about 10 % faster than the former i7-3840QM.The integrated Intel HD Graphics 4600 offers 20 Execution Units (EUs) clocked at 400 MHz up to 1300 MHz with Turbo Boost, making it about 30 % faster than the HD 4000.The i7-4900MQ is rated at a TDP of 47 W including graphics card, memory controller and VRMs.  Therefore, the CPU is only suited for laptops 15-inches or greater. The Intel Core i7-4900MQ is a high-end quad-core processor for laptops which has been launched in Q2/2013. It is based on the Haswell architecture and manufactured in 22nm. Due to Hyperthreading, the four cores can handle up to eight threads in parallel leading to better utilization of the CPU. Each core offers a base speed of 2.8 GHz but can dynamically increase clock rates with Turbo Boost up to 3.6 GHz (for 4 active cores), 3.7 GHz (for 2 active cores) and 3.8 GHz (for 1 active core). Haswell is the successor to the Ivy Bridge architecture with improvements on both GPU and CPU performance. The CPUs are produced in 22nm and offer an optimized branch prediction as well as additional execution ports, improving the performance per clock by almost 10 percent. Furthermore, new features like AVX2 and FMA should increase the performance in future applications. Due to these changes, the overall performance has been improved slightly compared to Ivy Bridge. Therefore, the 4900MQ is about 10 % faster than the former i7-3840QM. The integrated Intel HD Graphics 4600 offers 20 Execution Units (EUs) clocked at 400 MHz up to 1300 MHz with Turbo Boost, making it about 30 % faster than the HD 4000. The i7-4900MQ is rated at a TDP of 47 W including graphics card, memory controller and VRMs.  Therefore, the CPU is only suited for laptops 15-inches or greater. #0 checking url part for id 3954 +0s ... 0s #1 checking url part for id 14384 +0s ... 0s #2 checking url part for id 3665 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.049s ... 0.049s #6 did output specs +0s ... 0.05s #7 getting avg benchmarks for device 3954 +0.003s ... 0.052s #8 got single benchmarks 3954 +0.006s ... 0.058s #9 getting avg benchmarks for device 14384 +0.016s ... 0.074s #10 got single benchmarks 14384 +0.015s ... 0.089s #11 getting avg benchmarks for device 3665 +0.003s ... 0.091s #12 got single benchmarks 3665 +0.027s ... 0.118s #13 got avg benchmarks for devices +0s ... 0.119s #14 min, max, avg, median took s +0.238s ... 0.357s #15 return log +0s ... 0.357s "
}