{
    "title": "ASUS enables 256GB DDR5 support on Intel/AMD motherboards",
    "date": "3/14/2024",
    "url": "https://overclock3d.net/news/memory/asus-enables-256gb-ddr5-memory-support-on-intel-and-amd-motherboards/",
    "text": " How much DDR5 memory is enough? Well, ASUS didn’t think that 192GB was enough. Now, all of ASUS’ Intel 600/700 series and AMD AM5 series motherboards support up to 256GB of DDR5 memory. The only exceptions to this are motherboards with only two DIMM slots. These boards can now support 128GB of memory. With 64GB DDR5 modules becoming more readily available, it makes sense for ASUS to update its motherboard lineup to enable support for these modules. Users of Intel motherboards will need to update their motherboard BIOS’ to support these new modules. For AMD users, BIOS updates may not be necessary (though it is worth checking if a newer BIOS is available). Below is what ASUS had to say about the enhanced memory support on their mainstream DDR5 motherboards. ASUS today announced BIOS updates that enable support for up to 256 GB of memory on its Intel 700 and 600 series motherboards that use DDR5 modules. Such models with four DIMM slots can now support up to 256 GB of memory, while such models with two DIMM slots can now support up to 128 GB. These enhancements significantly improve multitasking potential, ensuring smooth and seamless computing.Â AMD AM5 motherboards from ASUS do not require a BIOS update to enable support for up to 256 GB of DDR5 memory modules.  (Image from ASUS) While not many PC users will need 256GB of memory, it is good to see that ASUS has enabled this level of memory support on their DDR5 motherboard platforms. Having access to a lot of memory can be incredibly useful for productivity workloads. That makes having the option to install more DRAM a welcome one. Let’s just hope that DDR5 memory pricing can drop further to help make larger memory configs more common amongst PC users. You can join the discussion on ASUS enabling support for 256GB of DDR5 memory on modern motherboards on the OC3D Forums. A Northern Irish father, husband, and techie that works to turn tea and coffee into articles when he isn’t painting his extensive minis collection or using things to make other things. No crappy Google banners here, only PC related advertising you may actually find interesting. Please disable Ad Blockers in order for us to keep producing the same level of quality, informational reviews and news. Worst case they actually look pretty and fill the empty gaps <3 "
}