{
    "title": "AMD’s Next-Gen Sound Wave APUs Spotted – Strix, Sarlak & Kracken \nPossibility Utilize Chiplet Design",
    "date": "3/2/2024",
    "url": "https://wccftech.com/amd-next-gen-sound-wave-apus-spotted-strix-sarlak-kracken-utilize-chiplet-design/",
    "text": "Details regarding AMD's next-gen APUs such as Strix, Sarlak, Kraken & Sound Wave have been exposed & give us an insight into the red team's plan for future mobility and desktop platforms. AMD is working on a range of APUs for future mobility platforms that might also roll down to desktops. The most imminent next-generation lineup is going to be Strix (or Strix Point) which features the upcoming Zen 5 core architecture along with a refreshed RDNA 3.5 architecture to power the graphics side. The AMD Strix APUs will fall under the Ryzen 8050 family and will deliver a brand new NPU known as XDNA 2 \"Ryzen AI\" which will offer a 3x improvement in AI compute performance (up to 48 TOPS). These APUs are expected to replace the current Hawk Point APU \"Ryzen 8040\" family in the second half of 2024. Following Strix Point will be next year's Kracken Point which will utilize the same Zen 5 cores with RDNA 3.5 GPUs. These chips were previously designed to feature RDNA 4 cores but that plan was dropped. The current information suggests that the Kracken APUs will utilize up to 8 cores in Zen 5 and Zen 5C flavors and offer up to 8 compute units so we are looking at a very mainstream lineup of chips. Now the most interesting thing mentioned in the information is that Sarlak and Strix will have different IO die configurations which suggests a chiplet design. AMD's Strix APUs will come in two configurations, a standard monolithic with up to 12 CPU cores & 16 CUs and a premium chiplet design that will offer up to 16 CPU cores & 40 CUs. There are rumors that Sarlak is the internal codename for the premium Strix offering but that doesn't seem to be the case looking at the info available here since it lists both Strix and Sarlak IO dies separately. Lastly, there's a mention of Sound Wave which could be AMD's next-gen APUs based on an advanced process node with the latest technologies such as Zen 6 and RDNA 5. Little is known about Sound Wave but it is listed after Kracken which means we can see it launch in 2026. One should also note that the process node technologies listed for each AMD APU aren't accurate & could mask their true process technologies. Strix is listed in both A0 & B0 stepping. AMD's Zen 5 core architecture is likely to be unveiled at this year's Computex so we will know for sure in just a few months of the future of APUs. News Source: gamma0burst Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}