{
    "title": null,
    "date": "3/5/2024",
    "url": "https://technewsspace.com/v-color-introduced-ddr5-memory-kits-up-to-768-gb-with-overclocking-support-for-ryzen-threadripper-7000/",
    "text": "V-Color has announced a new OC R-DIMM Octo-Kit DDR5 memory kit for the AMD WRX90 platform, designed for Ryzen Threadripper 7000 high-performance desktop (HEDT) processors, as well as Ryzen Threadripper PRO 7000 workstation processors. A notable feature of the new kit is its capacity of 768 GB.  Image source: V-Color As part of the OC R-DIMM Octo-Kit DDR5, V-Color is ready to offer 8 RAM modules ranging from 16 GB to 96 GB. Thus, the total volume of one set of memory can range from 128 to 768 GB. The manufacturer offers memory modules with speeds from 5600 to 7200 MHz. All support AMD EXPO overclocking profiles since the AMD WRX90 platform is designed for overclocking.  The memory is not equipped with cooling radiators. However, for RCD & PMIC battery components, the manufacturer has provided a compact thermal shield.  The manufacturer notes that OC R-DIMM Octo-Kit DDR5 kits have been tested on ASRock WRX90 WS EVO, ASUS Pro WS WRX90E-SAGE SE motherboards and Super Micron solutions, where they have shown their high efficiency. The new RAM kit is designed specifically for use with AMD Ryzen Threadripper PRO 7000 processors.  Pre-orders for the OC R-DIMM Octo-Kit DDR5 memory kit will begin on March 5 on the official V-Color website. The full start of sales will take place in the middle of this month. Prices range from $1,049.99 for a 128GB (8x16GB) DDR5-5600 memory kit to $4,919.99 for a 768GB (8x96GB) eight-pack of DDR5-6000 memory modules. Dylan Harris is fascinated by tests and reviews of computer hardware. Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  TECH NEWS SPACE The Tech News Space team monitors news from the world of high technology, science, the gaming industry and delivers them to its readers in a timely manner. "
}