{
    "title": "New Radeon 7700 XT price drop puts pressure on Nvidia RTX 4060 Ti",
    "date": "3/11/2024",
    "url": "https://www.pcgamesn.com/amd/new-radeon-7700-xt-price-drop",
    "text": "With benchmarks showing an advantage for the AMD Radeon 7700 XT at 1080p and 1440p, this price drop could force a retaliation from Nvidia. Niall Walsh Published: Mar 11, 2024 Graphics card prices are far from predictable right now, with yet another AMD Radeon RX 7700 XT price drop coming less than two weeks after the most recent example. Dropping to $410, this Newegg deal may be ringing in a new and very attractive MSRP for the GPU. Should this prove to be the 7700 XT’s new asking price, it is going to require a retaliation from Nvidia and its similarly priced GeForce RTX 4060 Ti. AMD is no stranger to our list of the best graphics cards that money can buy, and if this new $409.99 MSRP sticks, the Radeon RX 7700 XT may be the de facto cheap graphics card, depending on your budget, especially when you consider the 1080p and 1440p performance it manages over its Nvidia counterpart. Our Radeon RX 7700 XT review found there to be a huge performance difference between it and the Nvidia GeForce RTX 4060 Ti 8GB, in favor of AMD. At $410 then, just $10 more than the RTX 4060 Ti 8GB, grabbing a 7700 XT at this price feels like a no brainer. It should be noted that even in ray tracing performance, where we would expect the Nvidia card to dominate, we typically saw very minor performance leads for team green, further solidifying the value of the RX 7700 XT. The 7700 XT offers 12GB of VRAM too in comparison to the 4060 Ti’s 8GB, making it a stronger pick for 1080p and 1440p gaming. There has been no shortage of deals on the Radeon RX 7700 XT recently, with a limited-time deal seeing the price drop to $399, and the most recent deal we mentioned earlier which dropped the price to $419. Our current pick for the best cheap graphics card is the AMD Radeon RX 7600, and this can also be found on Newegg for as low as $259.99. Recent price drops have brought down the near $200 price difference between the graphics cards to just $150 in this case, making it easier to pick up more performance with the 7700 XT. Planning to make some gaming rig improvements but not sure where to start? Check out our guide on how to build a gaming PC in 2024 for a comprehensive look at everything you’ll need to get the job done. Niall Walsh                 As one of PCGN’s Hardware Editors, Niall is an expert in all things peripherals, meaning if you need to know what the best PC gaming headsets, controllers, keyboards, mice, or monitors are, he has you covered. Even if you just want to know which peripheral brand is better, Razer, Corsair, Logitech, or any other he can help there too. You will also find his words on sites such as; The Loadout, Wargamer, USA Today, MTG Rocks, GGRecon, and RealSport101. "
}