{
    "title": "NVIDIA and AMD enter a price war on mid-range graphics",
    "date": "3/7/2024",
    "url": "https://www.gearrice.com/update/nvidia-and-amd-enter-a-price-war-on-mid-range-graphics/",
    "text": "The two largest companies dedicated to the sale of graphics cards are always locked in a battle to know which can take the lead, and one of the ways to achieve this is for sellers to offer the GPU as cheap as possible.  In this case it was the turn of mid-range graphics, which can be found at historic lows, and which could have even more affordable prices. The prices offered by video cards can be excessive depending on the model we opt for, even with those of a medium or low range it is normal that a large part of the budget for a PC will be spent solely on this component.  We are currently seeing how in many countries the versions that offer both amd as NVIDIA of mid-range graphics are below the recommended price, being practically at minimums, so it is possible that they will continue to decline.  When we talk about this type of graphics we are obviously referring to the latest generation, and both the RTX 4060 Ti as the RX 7700 XT They are at a fairly considerable price drop, taking into account that they can be found for less than the price recommended by the companies.  Currently, these price drops generally affect sales in the United States to a greater extent, since in the rest of the world, such as Europe, we see how prices are lower but still remain at a higher value than we can found in the North American country.  Some stores in this country offer these video cards with great discounts, which if we add it to the coupons and offers they may have make getting a mid-range GPU really cheap.  In the case of one of the stores we can see how the prices of the RTX 4060 Ti They are at $449, a price already low compared to other countries, but which can go down to $419 with the use of various coupons, just like the RX 7700 XTwhose base price is $419, but can be had for $409. Even so, this mid-range is getting closer to becoming what it really proposes, a solution with good performance for a relatively low price, which will surely be affected by new launches that we will have in the coming years, if it does not happen. no more catastrophe worldwide.  In this way, we can take advantage of the discounts in certain stores when the price is at the lowest possible to be able to get these graphics without spending too much.  One of the first questions that comes to mind when we think about a mid-range product is clearly knowing if the features and price are really equivalent to what we are looking for in these models.  In the case of the GPU There is a problem, and that is that an “average” product currently in Spain costs between €500 and €600, which is a really high price compared to the income that a person can have. But on the other hand, in terms of the technologies and specifications they include, a mid-range graphics card can perform for several years with great power in really demanding titles, making the doubt grow bigger and bigger.  In this case, if we see a price drop in the models that we have mentioned of graphs of amd and NVIDIAthere will be a time when it can really be considered at the mid-range price.      Save my name, email, and website in this browser for the next time I comment.   Δ Type above and press Enter to search. Press Esc to cancel. "
}