{
    "title": "TSMC gets 3nm orders from Apple, Intel and AMD: for iPhone 16, Lunar Lake \nCPUs and Zen 5 CPUs",
    "date": "3/26/2024",
    "url": "https://www.tweaktown.com/news/97114/tsmc-gets-3nm-orders-from-apple-intel-and-amd-for-iphone-16-lunar-lake-cpus-zen-5/index.html",
    "text": "TSMC is enjoying an increasing number of orders as chip giants trip over themselves to get 3nm process node manufacturing for their upcoming designs. Customers include Apple, AMD, Intel, and more. In a new report from Economic Daily News, we hear that TSMC's new 3nm process node orders are set to see huge growth throughout the year and to \"remain robust until the end of the year.\" Q4 2023 saw TSMC (Taiwan Semiconductor Manufacturing Company) see 15% of its revenue derived from 3nm orders, but that's expected to pass 20% this year. Apple will use TSMC's new 3nm process node for its upcoming A18 series processor, which will power its next-gen iPhone 16 family of smartphones later this year. Apple will also use the N3 node from TSMC for its upcoming next-gen M4 processor, which will power upcoming MacBook laptops. Intel will use the TSMC N3 process node for its next-gen Lunar Lake CPUs, which will have the CPU, GPU, and high-speed I/O tiles all made on N3 and enter mass production in Q2 2024. This will be the first time in Intel history that the company will outsource its entire mainstream consumer platform processor series to TSMC, which sees a huge injection of revenue (and work) for TSMC this year and into 2025. Lastly, we've got AMD's next-generation Zen 5 processors being made on TSMC's new N3 process node, with AMD's new processors codenamed \"Nirvana\". AMD will continue to rely on TSMC's advanced wafer foundry services, with Zen 5 chips launching in the second half of 2024. TSMC is preparing to expand its production capacity for its N3 process node, with advanced packaging advancements required to meet huge orders from AMD, Apple, and Intel. Anthony Garreffa Anthony joined the TweakTown team in 2010 and has since reviewed 100s of graphics cards. Anthony is a long time PC enthusiast with a passion of hate for games built around consoles. FPS gaming since the pre-Quake days, where you were insulted if you used a mouse to aim, he has been addicted to gaming and hardware ever since. Working in IT retail for 10 years gave him great experience with custom-built PCs. His addiction to GPU tech is unwavering and has recently taken a keen interest in artificial intelligence (AI) hardware. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}