{
    "title": null,
    "date": "3/16/2024",
    "url": "https://wccftech.com/zotac-expands-server-workstation-portfolio-amd-epyc-intel-xeon-up-to-10-pcie-gpus/",
    "text": "ZOTAC has introduced its latest AMD EPYC & Intel Xeon CPU-powered server and workstation portfolio with up to 10 PCIe GPU support. Press Release: ZOTAC Technology Limited expands its product portfolio with the GPU Server Series. The first series of products in ZOTAC’s Enterprise lineup offers organizations affordable and high-performance computing solutions for a wide range of demanding applications, from core-to-edge inferencing and data visualization to model training, HPC modeling, and simulation. The ZOTAC series of GPU Servers comes in a diverse range of form factors and configurations, featuring both Tower Workstations and Rack Mount Servers, as well as both Intel and AMD processor configurations. With support for up to 10 GPUs, modular design for easier access to internal hardware, a high space-to-performance ratio, and industry-standard features like redundant power supplies and extensive cooling options, ZOTAC’s enterprise solutions can ensure optimal performance and durability, even under sustained intense workloads. ZOTAC GPU Server Lineup Essential Series – optimized for cost-effectiveness and flexibility offered in BOLT Tower Workstation and 4U rack server form factors. Ideal for system integrators and businesses seeking a good price/performance ratio with Intel 3rd and 4th Gen Processor support for Generative AI inference, data science, 3D content creation, and game development applications. Advanced Series – represented by a wider selection of 4U rack servers, the series is a step up from the Essential Series, and leverages PCIe Gen 5 slots for increased throughput, giving the series the high performance to take on more demanding tasks and extended operational capabilities. Premier Series – available in both 4U and 8U Rack Mount servers, the Premier Series is tailored for the most challenging workloads such as large language model (LLM) and Cloud AI model training, with the ability to leverage up to eight Server PCI Express Module (SXM) or OCP Accelerator Module (OAM) GPUs from all major vendors. The Premier series offers top-tier performance and reliability, as well as up to two 10Gb/s LAN Ports and increased storage capacity among other upgrades from the Advanced Series. Affordable, Powerful High-Performance Computing Selections of the lineup include the ZRS-3220M4 4U Intel Rack-Mounted GPU Server, an affordable HPC server option that can accommodate up to 10 GPUs with its 10 PCIe x16 slots, two 5th and 4th Gen. Intel Xeon Scalable Processors for intense workloads, and 4+1 2000W (240V) 80+ Platinum redundant power supplies to ensure minimal downtime and reliable performance. All of ZOTAC’s server offerings will be in barebone or chassis-motherboard bundle configurations depending on the form factor, giving organizations full control and freedom to integrate components as needed. The ZOTAC GPU Server lineup is also fully modular with an optimized cable management design for streamlined maintenance and an easier system integration process, with ample airflow for heat dissipation even in the most demanding configurations. The GPU Server Series will become available for order by March 25, 2024, with a phased rollout of all three Series across global markets starting in China and followed by international availability. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}