{
    "title": "AMD processors are efficient for cryptocurrency mining, and this may lead \nto their shortage",
    "date": "3/15/2024",
    "url": "https://mezha.media/en/2024/03/15/amd-processors-are-efficient-for-cryptocurrency-mining-and-this-may-lead-to-their-shortage/",
    "text": "In 2024, the tech industry may face a new crisis reminiscent of the graphics card shortage that occurred from 2020 to 2022. Back then, graphics chips were in high demand, largely due to their effectiveness in mining the cryptocurrency Ethereum, which was exacerbated by supply chain issues related to the pandemic. The situation with the supply of graphics processors began to improve in September 2022, but now there are new signs of a shortage, not of graphics cards, but of processors, in particular, AMD’s Ryzen series, PC Mag reports. A recent analysis by Wccftech shed light on the growing interest in CPU-based cryptocurrency mining. This surge is attributed to the growing profitability of mining various coins on the Proof-of-Work (POW) principle, especially after the record price peaks of Bitcoin. This trend is causing an increased demand for powerful computer hardware, despite the dubious value of some mined altcoins. In particular, there is currently a shortage of stocks of the AMD Ryzen 9 7950X processor, and its price already exceeds the initial launch price. This is an unusual situation, especially considering the time that has passed since the release of the processor. Demand for mining is now the main factor driving the price of Ryzen 9 7950X up.  The Ryzen series, with its large number of cores and impressive L3 cache, has proven to be particularly effective for mining with algorithms such as RandomX used in Monero and other PoW currencies. Benchmarks such as XMRig also illustrate the dominance of AMD chips in mining, especially with a large number of cores. Although regular processors such as the 7950X are ranked lower than specialized mining systems, their performance still promises potential profitability. This trend raises concerns about the affordability of high-end processors for other consumers, especially gamers. While stocks of low-cost Zen 4 chips remain quite large, the future availability of the upcoming AMD Zen 5 models could be at risk, especially if mining continues to be a profitable business and AVX-512 instruction sets become more widely available, potentially further increasing mining efficiency on AMD processors. There are rumors that AMD may release versions of its Zen 5 processors with low hashing speeds, which is similar to NVIDIA’s mining strategy for GPUs. However, the likelihood of AMD adopting this approach remains a matter of debate. Loading comments … "
}