{
    "title": null,
    "date": "1/4/2024",
    "url": "https://videocardz.com/newz/amd-confirms-january-8th-ces-2024-event-focusing-on-ai",
    "text": "Last week, we shared an update on the official CES 2024 event schedule, and prominently absent from the list was AMD. However, it has now been revealed that AMD will indeed be hosting an event titled ‚Äútogether we advance_AI.‚Äù  The event will be led by CEO Dr. Lisa Su and Jack Huynh, the Senior Vice President and General Manager of Computing and Graphics. The primary focus of their presentation will be on the ‚Äòfuture of AI in personal computers.‚Äô Huynh took charge of the Computing and Graphics group at AMD in April, succeeding Rick Bergman upon his retirement. This business unit concentrates on integrating AMD IP for CPUs and GPUs and exploring their applications. The presentation is expected to delve into the APU segment, with a probable emphasis on the semi-custom business. The AMD CES booths will also feature presentations and live demonstrations featuring the Ryzen Z1 series.   CES 2024 event, Source: AMD  There is increasing anticipation for potential updates to the Ryzen 8000G, AMD‚Äôs latest desktop APU series. While AMD has introduced the Ryzen 8040 series for laptops, it‚Äôs logical to expect concurrent developments for the desktop counterpart, given that they share the silicon. Updates to the Radeon RX 7600 XT are also expected, although this product may not align perfectly with the ‚ÄòAI‚Äô theme of the event. Mark your calendars for January 8th at 7 AM PST, as this event is scheduled just an hour before NVIDIA‚Äôs presentation. Source: AMD We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright ¬© 2024 ¬∑ VideoCardz.com "
}