{
    "title": null,
    "date": "1/1/2024",
    "url": "https://wccftech.com/amd-ryzen-7-7800x3d-drops-lowest-price-china-317-usd-asus-b650-cpu-combo-466/",
    "text": "AMD's best gaming CPU, the Ryzen 7 7800X3D, is currently discounted to $317 in China with an AM5 combo deal going for just $466 US. It seems like AMD plans to offer a \"wave of discounts\" on its product portfolio, especially targeted towards the AM5 platform. For now, the price reductions might be confined to Chinese retailers only, since the start has been taken on JD.com, as AMD's Ryzen 7 7800X3D CPU coupled up with ASUS's TUF GAMING B650M-PLUS WIFI motherboard is now retailing at 3,299 yuan (USD 466), which is an astonishing price judging by the value it brings onboard. If we separate individual prices, the ASUS TUF GAMING B650M-PLUS WIFI motherboard is going for 1,049 yuan, which means that in this deal, the Ryzen 7 7800X3D is available for only 2,250 yuan (USD $317), dropping down to its lowest ever in the country. A few weeks ago, the Ryzen 7 7800X3D was available for $339 US with the Avatars: Frontiers of Pandora bundle, but it looks like the processor has dropped down to its new lowest. Now we have seen the same chip being available for $299 US but this combo deals Chinese gamers a lot of value for their money as the motherboard is practically on par with some high-end X670 offerings plus you are still eligible to get a free copy of Avatar: Frontiers of Pandora which is worth at least $60 US. In terms of specifications, the AMD Ryzen 7 7800X3D CPU offers 8 cores, 16 threads, and the same 104 MB of cache (32 MB CCD, 64 MB V-Cache + 8 MB L2). The CPU comes with a base clock of 4 GHz and a boost clock of 5 GHz. The CPU maintains a TDP of just 120W and has an official MSRP of $449 US, hence it is almost $130 off from its initial retail price, making it a bargain at this point. However, the only complication here is that this pricing is confined to the Chinese marketplace for now, but if this trend continues, it won't take too long before this price drop translates into global retail chains. If we look at the US marketplaces right now, Microcenter offers the AMD Ryzen 7 7800X3D for $349 US but you can also find a combo package that gets you a Gigabyte B650 Gaming X AX board and 32 GB of DDR5-6000 from G.Skill for just $499.99 US. These are amazing deals considering the raw gaming performance that this chip has an offer and in our review, we also measured an insane amount of efficiency versus other AMD and Intel chips. News Source: MyDrivers Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}