{
    "title": "AMD Zen 6 Ryzen Medusa Desktop CPUs feature a major redesign",
    "date": "1/6/2024",
    "url": "https://overclock3d.net/news/cpu_mainboard/amd-zen-6-ryzen-medusa-desktop-cpus-will-feature-a-major-chiplet-redesign/",
    "text": " New information about AMD’s Zen 6 Ryzen Desktop CPUs have leaked. Thanks to @Olrak29_, we now know that AMD “Medusa” (Zen 6 Ryzen Codename) processors will feature a major redesign to AMD’s chiplet-based design. This change will boost inter-chiplet bandwidth for AMD’s future processors, and likely reduce inter-die latencies. Today’s AMD Ryzen processors are based on the company’s Zen 4 CPU architecture. This means that AMD “Medusa” Zen 6 processors are two generations ahead of what we have today. AMD are likely to launch their first Zen 5 processors later this year. That means that we will likely see Zen 6 CPUs in mid-late 2025. Medusa is the codename of Zen 6 client — Everest (@Olrak29_) January 4, 2024  In a sense, AMD’s Zen 6 processors will become more similar to the company’s chiplet-based RDNA 3 graphics cards. AMD will be moving from their existing CPU chiplet interconnects to a 2.5D connection that offers users more bandwidth and likely features lower chiplet latencies. This is a similar setup to what we see today between RDNA 3’s Compute chiplets and Memory Controller chiplets. This change in interconnect will enable AMD to create faster and larger CPUs. A superior interconnect lets data be transferred between chiplets faster and at lower latencies. This allows CPU chiplets to communicate with each other at a faster rate and likely reduces the latency (waiting times) for data transfers. It may also allow AMD to decrease their memory latencies, which could have an notable impact on Zen 6’s gaming performance. On the high-end, AMD’s new interconnect technology could open the door to larger EPYC or Threadripper processors. A faster interconnect could allow AMD to create higher core count CPUs, as more CPU Core Dies will be able to communicate with each other without any bottlenecks. Yes, I have teased this before… Medusa will use 2.5D interconnect with a much higher bandwidth https://t.co/G8Ep211iBr — Everest (@Olrak29_) January 5, 2024  Chiplet technology is incredibly important for AMD and their competitors. Separating larger processors into chiplets helps to make high-end computing products cost effective. That said, chiplets need to be backed up by strong interconnect technologies to maintain high performance levels, and energy efficiency levels. AMD, Nvidia, and Intel are all working on chiplet-based products. The connections between these chiplets will be vital aspect of all future high-end computing products. Zen 6’s set to change the way AMD does chiplets in the desktop CPU market. This is a good thing for consumers. But will it have the impact we expect? You can join the discussion on AMD’s 2.5D plans for Zen 6 on the OC3D Forums.   A Northern Irish father, husband, and techie that works to turn tea and coffee into articles when he isn’t painting his extensive minis collection or using things to make other things. No crappy Google banners here, only PC related advertising you may actually find interesting. Please disable Ad Blockers in order for us to keep producing the same level of quality, informational reviews and news. Worst case they actually look pretty and fill the empty gaps <3 "
}