{
    "title": "AMD Fluid Motion Frames tech officially launching on January 24th, no more \npreview drivers",
    "date": "1/11/2024",
    "url": "https://videocardz.com/newz/amd-fluid-motion-frames-tech-officially-launching-on-january-24th-no-more-preview-drivers",
    "text": "AMD is finally giving its Frame Generation technology a launch date.  The January 24th will be an important date for AMD fans. Not only will the company release its Radeon RX 7600 XT with 16GB memory, but it will also mark the moment when Fluid Motion Frames, aka AMD Frame Generation technology, goes public. This technology will be part of the HYPR-RX enablement and should also be available as a separate option in the drivers. The drivers are the key word here as AFMF (AMD Fluid Motion Frames) technology does not require game developer support, it works seamlessly without any implementation required. Naturally, this means this frame generation feature will only work with Radeon GPUs, and not every card can support it. AMD provided its preview drivers featuring AFMF support for quite some time; the most recent update enabled Frame Generation for the Radeon 700M integrated RDNA3 GPU series. Previously, AMD added support for Radeon RX 6000 series. There is no support for Radeon 600M (RDNA2-based iGPUs) yet.   AMD HYPR-RX, Source: AMD  Together with Radeon Super Resolution (RSR) gamers will be able to enable both the upscaling and frame generation as an option in the drivers. This should work for all DirectX11 and DirectX12 games. Interestingly, AMD knows that their solution has a clear advantage over NVIDIA’s, it works in ‘all’ games while DLSS3 with Frame Generation needs to be implemented into the game. Moreover, NVIDIA’s frame generation only works on RTX 40 GPUs. “I think what we’re gonna start seeing, DLSS is only available on certain solutions, so either Nvidia is going to have to benefit from our solution because we did make it open-source and cross-vendor, or they’re probably going to need to do something similar.” — Aaron Steinman, Senior Manager, Radeon Product at AMD NVIDIA does, in fact, have an upscaling technology called NIS (NVIDIA Image Scaling), which is a simple spatial upscaler without any AI-driver technology. Should NVIDIA launch its RSR competitor, that would already be big news, but once AFMF goes public, NVIDIA will be two steps behind AMD. Source: PCGamer We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}