{
    "title": "AMD Brings AI Engine To Desktop PCs With Ryzen 8000G CPUs",
    "date": "1/8/2024",
    "url": "https://www.crn.com/news/components-peripherals/2024/amd-brings-ai-engine-to-desktop-pcs-with-ryzen-8000g-chips",
    "text": "In addition to revealing the ‘ultimate all-in-one desktop processor’ at CES 2024, the chip designer claims in new tests that its recently launched Ryzen 8040 laptop CPUs provide faster AI processing capabilities than Intel’s new Core Ultra processors.  AMD said it’s beating Intel to market with the first dedicated AI engine for desktop PCs by way of its forthcoming Ryzen 8000G processors among other chips revealed at CES 2024. The Santa Clara, Calif.-based company said that two of the four Ryzen 8000G processors will feature a neural processing unit (NPU) to “accelerate AI software capabilities” as part of a wider effort by chip designers, OEMs, ISVs and operating system vendors to enable a new category of computers called AI PCs, as CRN reported for AI PC Week in December. [Related: AMD’s David McAfee On Why AI PCs Are ‘Here To Stay’ And Why ISVs Will Flock To The NPU] This is the same kind of NPU that goes inside AMD’s Ryzen 7040 and Ryzen 8040 laptop processors, the latter of which launched last month and will go inside upcoming notebooks from HP Inc., Lenovo, Acer, Razer and Asus, the company said at CES Monday. The company said the Ryzen 8040 series provides faster AI processing capabilities than Intel’s new Core Ultra processors, which also feature an NPU, based on internal tests. Intel’s x86 CPU rival also revealed four new desktop processors in its four-year-old Ryzen 5000 series, which the company said extends the “unprecedented longevity” of the AM4 platform that debuted in 2016, a year before the Ryzen brand arrived. In addition to each processor featuring an NPU for AI workloads, the Ryzen 8000G CPUs come with the “world’s most powerful built-in graphics,” according to AMD. The inclusion of a dedicated AI engine and powerful integrated graphics, combined with up to eight cores and a 5.1GHz boost frequency, is why the chip designer is calling the Ryzen 8000G series the “ultimate all-in-one desktop processor.” The CPU in the Ryzen 8000G series is based on AMD’s Zen 4 architecture while the GPU is based on its RDNA 3 architecture and the NPU is based on the XDNA architecture. Combined, they provide a total of up 39 teraflops of processing power for AI workloads, AMD said. With each processor sporting a 65-watt thermal design power, the series is “optimized for efficiency with lower power draw but doesn’t sacrifice performance or responsiveness,” AMD said. The chips are geared toward gamers and content creators, particularly those who don’t want to pay for a discrete graphics card at first, saving them a few hundred dollars on a PC. Across several popular games, including “Cyberpunk 2077” and “Grand Theft Auto 5,” AMD showed that the flagship Ryzen 8700G can provide more than 60 frames per second on average at a 1,080p resolution with low settings. The company said the Ryzen 8700G can provide similar or better gaming performance than an Intel Core i5-13400F paired with an Nvidia GeForce 1650, which, as of Jan. 3, cost roughly $70 more than the recommended pricing for AMD’s new processor. AMD said that the Ryzen 8700G can also outperform an Intel Core i5-13400F paired with an Nvidia GeForce 1650 across several productivity benchmarks, ranging from a 10 percent boost for the 3dMark Phyics test to a 4.6X boost for the LAME MP3 encoding test. The company is also releasing four new desktop processors that will extend the life of the Ryzen 5000 series as well as the AM4 platform that debuted in 2016. The extended lineup includes the Ryzen 7 5700X3D, which uses AMD’s 3-D chip packaging technology to increase its cache by five times to 100 MB. The company said this major cache expansion over a regular chip can provide a “massive boost in gaming performance.” Like other chips in the lineup, the new Ryzen 5000 processors are based on the Zen 3 architecture, which the company debuted in 2020. They also support motherboards based on the same AM4 platform, giving channel partners with customers of older AM4-based computers an opportunity to upgrade their CPU. Unlike the Ryzen 8000G processors, the new Ryzen 5000 chips do not include an NPU. AMD said its recently launched Ryzen 8040 processors run AI workloads with their NPU and GPU faster than Intel’s Core Ultra chips, which also arrived last month. In the realm of computer vision models that benefit from the NPU, AMD said its Ryzen 7 8840U processor is 4 percent faster on the MobileNetv3 model, 17 percent faster on the ESRGAN model, 43 percent faster on the Yolov8 model and 79 percent faster on the Deeplabv3 in comparison to Intel’s Core Ultra 7 155H. As for AI-powered content creation workloads that benefit from the GPU, AMD said the same chip is 6 percent faster on the Stable Diffusion 1.5 model, 44 percent faster on the Procyon AI Bench test using the Float32 numerical format, 61 percent faster on Procyon AI Bench using Float16 and 85 percent faster on DaVinci Resolve HD to UHD video upscaling feature. AMD said the Ryzen 7 8840U is also faster than the Core Ultra 7 155H across several popular games, from a 2 percent boost for “League of Legends” to a 60 percent boost for “Far Cry 6,” as well as several standard benchmarks, from a 14 percent boost for the Puget Premiere Pro video editing benchmark to a 52 percent boost for the LAME MP3 encoding benchmark. For the Procyon Office Productivity benchmark suite, the processor is 76 percent faster than the competition while providing 81 percent higher performance per watt, the company added. "
}