{
    "title": "AMD stock reaches almost unprecedented value thanks to AI chip demand",
    "date": "1/17/2024",
    "url": "https://www.techspot.com/news/101554-amd-stock-reaches-almost-unprecedented-value-thanks-ai.html",
    "text": "Bullish AI: Analysts have expressed highly positive sentiments about AMD, the fabless chipmaker that has successfully reversed its fortunes in just a few years. AMD's stock evaluations have seen an increase, and the introduction of new products for AI and HPC applications could potentially propel the Santa Clara-based corporation to unprecedented levels of growth. Analysts from major financial institutions have increased their price targets for AMD stock, which reached a 52-week high of $158.74 on Tuesday. Reports from Barclays, KeyBanc Capital Markets, and Susquehanna Financial Group have propelled the stock value by eight percent in a single day, bringing AMD very close to its all-time record of $164.46 achieved in November 2021. Wall Street analysts are optimistic about the sustained demand for AI chips, which has proven lucrative for Nvidia. AMD recently introduced the Instinct MI300X and Instinct MI300A, two specialized AI accelerators that, according to AMD's latest benchmarks, can outperform Nvidia's H100 GPUs. Analysts predict that AMD could benefit from the same AI trend that tripled Nvidia's stock value in 2023. Barclays confidently set the target price for AMD stock at $200, while KeyBanc Capital Markets established a new target of $195. Susquehanna Financial Group revised its target from $130 to $170.  AMD has made remarkable strides in just a few years. Its stock, valued at an all-time high of $50 in 2020, gained confidence from the new Zen CPU architectures and their positive impact on the company's future business prospects. The advent of generative AI algorithms disrupted the entire tech market shortly afterward, making any promise of a growing influx of AI hardware accelerators an attractive prospect for Wall Street investors. Financial analysts also saw an increase in the value of Nvidia stock. The company, led by Jensen Huang, experienced a 3.1 percent stock increase, reaching $563.82 and claiming a record high of $568.35 in intraday trading. Reuters reported that the average Nvidia price target across 53 analyst ratings actually decreased from $627.50 to $625. Nevertheless, the company remains a \"must-buy\" for tech investors. While AI stocks are thriving, the semiconductor industry is currently facing challenges. Despite promising future prospects, KeyBanc analyst John Vinh highlighted weak demand for automotive and industrial chips. Additionally, markets for servers, PCs, and smartphones are either weak or lackluster, according to Vinh. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}