{
    "title": "AMD, Micron Name New Legal Chiefs as AI Demand Sees Shares Soar",
    "date": "1/22/2024",
    "url": "https://news.bloomberglaw.com/business-and-practice/amd-micron-name-new-legal-chiefs-as-ai-demand-sees-shares-soar",
    "text": "Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 By Brian Baxter Advanced Micro Devices Inc. and Micron Technology Inc. announced Monday their hires of Ava Hahn and Michael Ray, respectively, to be their top lawyers. Hahn joins AMD after spending the past four years as the top lawyer for chipmaker Lam Research Corp. Michael Ray lands at Micron after stepping down earlier this month as the longtime chief legal officer and corporate secretary for San Jose, Calif.-based Western Digital Corp. AMD’s stock price has surged in recent weeks, even surpassing Nvidia Corp., as chipmakers see demand soar for products that power generative artificial intelligence technologies. Boise, Idaho-based Micron is the largest US maker of computer memory semiconductors. Hahn has previously been the top lawyer for telecommunications vendor ShoreTel Inc. and semiconductor maker Genesis Microchip Inc., as well as CA Technologies Inc. and Aruba Networks Inc., all of which were subsequently acquired by other technology companies. Hahn, who began her career as a corporate and securities associate at Silicon Valley stalwart Wilson Sonsini Goodrich & Rosati, has also spent time as legal chief for venture capital firms Kleiner Perkins and Felicis Ventures. She succeeds retiring general counsel Harry Wolin, who joined AMD in 2000 and was named its general counsel in 2003. He owns AMD stock valued at almost $250 million, according to Bloomberg data. Securities filings show that within the past year Wolin has sold off nearly $9.4 million in AMD shares. Wolin said in an email that Hahn started today and that he will stick around for a short time during a transition. “My retirement plan is wide open,” Wolin said. “I am making very few commitments the first year.” AMD is expanding into artificial intelligence processors as part of a partnership it unveiled last year with Microsoft Corp. AMD’s chief executive, Lisa Su, spoke with Bloomberg in December about an increase in demand for those products. Morrison & Foerster had a role representing Santa Clara, Calif.-based AMD on roughly 20% of cases involving the company in US federal courts within the past five years, according to Bloomberg Law data, followed by O’Melveny & Myers at 13% and intellectual property-focused Fish & Richardson at nearly 10%. Orrick, Herrington & Sutcliffe and Winston & Strawn have collectively handled more than 50% of the Micron’s US federal litigation caseload during that same time period, according to Bloomberg Law data. At Micron, Ray replaces former general counsel Robert Beard, who departed last year for the top legal and policy job at Mastercard Inc. Ray spent the past 13 years at Western Digital, which is planning to divide itself into two publicly traded companies. Western Digital’s former chief compliance officer, Tiffany Scurry, joined AMD in the same role late last year. To contact the reporter on this story: Brian Baxter in New York at bbaxter@bloomberglaw.com To contact the editors responsible for this story: John Hughes at jhughes@bloombergindustry.com AI-powered legal analytics, workflow tools and premium legal & business news. Log in to keep reading or access research tools. "
}