{
    "title": "Suicide Squad: Kill the Justice League PC Requirements Revealed, AMD Ryzen \n7 7800X3D and RX 7900 XT or Equivalent for 4K 60 FPS Ultra",
    "date": "1/13/2024",
    "url": "https://www.hardwaretimes.com/suicide-squad-kill-the-justice-league-pc-requirements-revealed-amd-ryzen-7-7800x3d-and-rx-7900-xt-or-equivalent-for-4k-60-fps-ultra/",
    "text": "Rocksteady Studios of Batman Arkham series fame have been hard at work on their newest entry, Suicide Squad: Kill the Justice League for a few years now, having gone through a massive delay as well. Currently scheduled for a February 2nd release, recent previews haven’t been met with the best of impressions, with the live-service nature of the game being called into question among other unfavorable gameplay elements such as its clunky UI. Regardless, the list of requirements for PC has been released and the game doesn’t look very optimized from the looks of it, especially on the AMD GPU front. To get just a 30 fps experience on the lowest settings, you’ll still need an Intel i5-8500K or the AMD Ryzen 5 1600, both 6-core CPUs, paired with a relatively powerful GPU the likes of NVIDIA GTX 1070 or the AMD RX Vega 56. Joining a bunch of other recent games, an SSD is mandatory even at the lowest settings paired with 16 GB memory. Minimum requirements (1080p/30FPS, “Minimum” Preset) The recommended requirements for 1440p at medium push the CPU requirements to an Intel i7-10700K or the AMD Ryzen 7 5800X3D, paired with an NVIDIA RTX 2080 or the AMD RX 6800 XT. Recommended requirements (1440p/60FPS, “Medium” Preset) Interestingly, the “Ultra” recommendation mentions the preset set to “high” and not ultra, which means this isn’t even the highest requirement. To get a 4K “high” preset at 60 FPS, you’ll need at least an Intel i7-12700K or the AMD Ryzen 7 7800X3D, paired with the NVIDIA RTX 3080 or the AMD RX 7900 XT. Ultra requirements (4K/60FPS, “High” Preset) The developers haven’t specified the exact storage necessary, although this is probably due to the live service nature of the game meaning a constant increase in the size over time. Epic Store however shows a minimum 65 GB storage necessary, so that’s a good reference point. The game is supposed to have ray tracing support as well, as per reports from the Alpha tests. NVIDIA DLSS 2 (Super Resolution) and AMD FidelityFX Super Resolution 2 are also supported, albeit no frame generation tech is present. Suicide Squad: Kill the Justice League is scheduled to release on February 2nd for Steam, Epic Games Store, PS5 and Xbox Series S/X. "
}