{
    "title": "AMD Zen 5 'Granite Ridge' CPUs enter mass production, will arrive in late \n2024",
    "date": "1/18/2024",
    "url": "https://www.techspot.com/news/101562-amd-zen-5-granite-ridge-cpus-reportedly-enter.html",
    "text": "What just happened? AMD has already revealed that its next-gen Ryzen CPUs featuring Zen 5 cores will launch in 2024, confirming that the new chips will use the AM5 socket and be compatible with existing 600-series motherboards. A new report has now seemingly revealed that the upcoming processors have entered mass production, and are on track to be released later this year. The news comes from well-known tipster @Kepler_L2, who claimed that AMD has already started mass-producing its next-gen CPU lineup, codenamed \"Granite Ridge.\" The new chips will feature Zen 5 cores as an upgrade over the Zen 4 and Zen 4c cores found in the company's existing processors. Some reports indicate that they could be announced as early as April 2024, while others suggest that the launch could be delayed to Q4. AMD first announced Zen 5 back in 2022, promising faster performance and lower power consumption compared to Zen 4. The new architecture is also expected to offer a 20-30 percent IPC gain over Zen 4, which could translate to a whopping 15-20 percent improvement in single-threaded performance in select applications, including some games. This could make it an attractive option for gamers looking to upgrade from their older AMD rigs. Yeah Not much is known about Zen 5, but rumors suggest that it will use a hybrid architecture with a mixture of standard and dense \"C\" cores. The mainstream Zen 5 processors are said to offer between six and sixteen cores, and come with a Ryzen AI NPU like Hawk Point. However, all that's still speculation, as AMD is yet to confirm Zen 5 specs. The Granite Ridge processors could be marketed under the Ryzen 9000 branding and offer integrated AI and machine learning optimizations. They are expected to compete with Intel's Arrow Lake-S desktop CPUs that are also said to be released later this year. However, before Zen 5 can make an appearance, AMD will launch the Ryzen 8000G \"Hawk Point\" APUs. These will arrive later this month with Zen 4 CPU cores and RDNA 3 iGPUs, and will be compatible with existing AM5 motherboards. The lineup is expected to initially include at least four SKUs, including the Ryzen 7 8700G, Ryzen 5 8600G, Ryzen 5 8500G, and Ryzen 3 8300G. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}