{
    "title": "AMD Ryzen 8000 Hawk Point APUs could natively support USB4 80Gbps on some \nAM5 motherboards",
    "date": "1/15/2024",
    "url": "https://www.techspot.com/news/101520-amd-ryzen-8000-hawk-point-apus-could-natively.html",
    "text": "What just happened? AMD Hawk Point APUs are expected to go official on January 31, and a slew of leaks over the past few months have already revealed several key details. The latest reports claim that the components will offer additional I/O capabilities on select AM5 motherboards. Some AM5 motherboards designed for Ryzen 8000 \"Hawk Point\" processors might come with support for USB4 transmission, writes Benchlife. Gigabyte is said to be one of the companies looking to implement the new feature in some of its next-gen AM5 boards, like the AORUS B650E series, making these the first AMD motherboards to ship with USB4 support. It is worth noting that while AMD is expected to implement support for USB4 transmission with its upcoming APU lineup, Intel implemented the functionality years ago with its 11th-gen Core processors. While some existing AMD boards can already support USB4 functions through add-in cards from companies like MSI, this is the first time that Team Red is implementing native support for the feature.  Staying with USB4 news, Microsoft is finally testing support for USB4 Version 2.0 standard on Windows 11. The company last week rolled out Windows 11 Insider Preview Build 23615 to the Dev Channel with support for the new USB standard that supports blazing fast speeds of up to 80Gbps. It is the first major upgrade to the USB4 standard and doubles the performance of the previous generation, which supported only up to 40Gbps data transfer. As explained by Microsoft, USB 80Gbps support will initially only be available on select PCs powered by Intel's latest 14th-gen Core HX-series mobile processors, which were announced at CES 2024 last week. The new Razer Blade 18, which was unveiled ahead of CES earlier this month, will be among the first devices to get the super-fast transfer speed. Another major new feature in the Insider Preview Build is the option to launch Copilot automatically every time on Windows startup, although it could face massive protests from Windows 11 users if it makes it through to the stable build. The latest Insider Preview build also allows users to share URLs directly with apps like Gmail, WhatsApp, X (formerly Twitter), Facebook, and LinkedIn. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}