{
    "title": null,
    "date": "1/25/2024",
    "url": "https://www.gamereactor.eu/amd-radeon-rx-7600-xt-has-just-launched-1351323/",
    "text": "The AMD Radeon RX 7600 XT features 16GB of VRAM and has the same high-performance AMD RDNA 3 platform, the same compute units, AI technology, and dedicated raytracing accelerators as its more powerful siblings \"The Radeon RX 7600 XT graphics card offers smooth, fast, and visually stunning gaming and raytracing experiences at 1080p and unleashes users' creativity in next-gen AI and content creation workloads\" official AMD sources say. Key features:\n-Higher FPS In thousands of games - AMD Fluid Motion Frames (AFMF) frame generation technology increases FPS to deliver a massive performance improvement and smooth gameplay. - AMD HYPR-RX technology simplifies and manages the simultaneous interoperation of AMD Fluid Motion Frames, AMD Radeon Super Resolution, and AMD Radeon Boost technologies to achieve a performance-stacking effect. - Ultra-High Definition Encoding - The encode/decode media engine unlocks full AV1 encode/decode support, wide color gamut and high-dynamic range enhancements. - AMD Radiance Display Engine provides support for next-gen DisplayPort 2.1 and HDMI 2.1a-based displays for ultra-high resolutions and high refresh rates. AMD has also released Adrenalin Edition 24.1.1. \"The new driver features AMD Fluid Motion Frames Technology, which boosts FPS up to 97% for a smoother gaming experience by adding frame generation technology to any DirectX 11 and 12 game. Today's release also offers new Video Upscaling technology, Content Adaptive ML text detection support for 4K streaming, and AV1, HEVC, AVC and OBS encode quality improvements, and more.\" Radeon RX 7600 XT is only available as 3rd party products, meaning there is no AMD version of the card, only board partners such as Acer, ASRock, ASUS, Gigabyte, PowerColor, Sapphire and XFX, and the MSRP is $329. You must be logged in to comment. If you are not yet a member - join now! Loading next content "
}