{
    "title": "AMD’s stock soars, narrowing in on record close as AI optimism swells",
    "date": "1/16/2024",
    "url": "https://www.marketwatch.com/story/amds-stock-soars-narrowing-in-on-record-close-as-ai-optimism-swells-7e4882e1",
    "text": "Advanced Micro Devices Inc.’s stock is closing in on its record closing high amid a sharp Tuesday surge that reflects growing optimism for the company’s opportunities in artificial intelligence. The stock \n        AMD,\n        +0.50%\n       is up more than 7% in midday action to a recent $157.67. That puts it less than 3% away from its all-time closing high of $161.91 achieved Nov. 29, 2021. AMD’s Tuesday stock rally comes amid a broader gains for chip stocks, with the PHLX Semiconductor Index \n        SOX\n       up 1% despite a slightly negative day so far for the Nasdaq Composite Index. Shares of Nvidia Corp. \n        NVDA,\n        +0.12%\n       are up 2.8%, while shares of Micron Technology Inc. \n        MU,\n        -1.05%\n       are up 2.3%. Opinion: How Nvidia and AI changed the landscape of the chip industry, as rivals must now play catch-up KeyBanc Capital Markets analyst John Vinh recently chimed in with upbeat commentary on AMD’s server business, dramatically boosting his expectations for the company’s MI300X accelerator for AI applications. “We are seeing a pretty significant increase in demand for AMD’s MI300X suggesting that the software performance issues late last year have largely been resolved,” he wrote in a Tuesday note to clients. Vinh thinks that Microsoft Corp. \n        MSFT,\n        -0.17%\n       will ramp its use of the MI300X graphics processing unit in the first quarter, while other customers such as Meta Platforms Inc. \n        META,\n        -1.68%\n       and Oracle Corp. \n        ORCL,\n        +0.27%\n       could follow. “Currently, we believe there’s demand for [500,000] MI300X GPUs, which would represent ~$8B in data center GPU revenues in 2024, which is significantly higher than our prior expectations of $3B-$4B,” he wrote. “Additionally, supply chain partners indicate that AMD has increased its CoWoS [Chip-on-Wafer-on-Substrate packaging] capacity and has the ability to support further upside if additional demand materializes.” See also: If Nvidia looked more like Salesforce, it might unlock billions more in cash, analyst says Vinh sees 24% upside for AMD shares, having raised his price target to $195 from $170. Elsewhere in the chip sector, Taiwan Semiconductor Manufacturing Co. Ltd. shares \n        TSM,\n        -0.47%\n       are advancing 0.5% in Tuesday’s session, gains that come on the heels of ruling-party candidate Lai Ching-te’s victory in Taiwan’s presidential election. “While this year’s Taiwan election has been closely watched by global financial markets amid elevated geopolitical concerns, the outcome for [Democratic Progressive Party’s] victory is in line with general expectations,” JPMorgan analyst Grace Ng wrote in a note to clients. Walgreens’ stock seesawed around the flatline Thursday, after the drugstore chain swung to a large quarterly net loss and trimmed its full-year outlook, but also reported the biggest beat for quarterly adjusted profit in at least five years. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}