{
    "title": "Fresh AMD Zen 5 CPU details leak suggesting a likely launch date between \nApril and June of this year",
    "date": "1/29/2024",
    "url": "https://www.pcgamer.com/fresh-amd-zen-5-cpu-details-leak-suggesting-a-likely-launch-date-between-april-and-june-of-this-year/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The next AMD CPUs are well on their way it seems, as Intel's Arrow Lake follows behind. Further details are beginning to leak for AMD's next generation of desktop processors built on the Zen 5 architecture. These new \"Granite Ridge\" CPUs are currently expected for release in the first half of this year, and we're now starting to see information that looks to add some credence to the earlier rumours referencing the new chips. These most recent leaks come from a tweet from known AMD leaker High Yield YT (via TechPowerUp), and seem to give weight to some of the previously rumoured details that have already been doing the rounds for AMD's next desktop CPUs. AMD will reportedly be using the Ryzen 9000 series model numbering scheme, which was to be expected as the 8000 series moniker is already being used for the new AM5 APUs based on \"Hawk Point\". Granite Ridge is said be a chiplet-based processor like the previous 7000 series, and is expected to feature one or two \"Eldora\" CCDs, each containing eight Zen 5 CPU cores, each with 1 MB of L2 cache, with no word yet on how much L3 cache we're likely to see. The chips are said to be built on TSMC's 4nm process, with similar clock speeds to the existing generation and a predicted double-digit uplift in performance, which would align with similar predicted performance figures from Moore's Law is Dead, who predicted between 10-15% IPC gains in September of last year. This would put the new CPUs on a performance level similar to the current generation of Ryzen 7000X3D processors without the use of 3D cache. Those gains would track with the previous uplift in performance between the Zen 3 and Zen 4 series of AMD CPUs, with the 7000 series chips running on average 13% faster than the previous generation. The new chips are quoted as retaining the same I/O die as the Zen 4 CPUs, however the DDR5 memory frequency is referenced as DDR5-6400. The previous chips had native support for DDR5-5200 with DDR5-6000 quoted as the \"sweet spot\", so it's unclear if this is referring to natively supported RAM speed or the optimal speed for the new CPUs.  Best CPU for gaming: The top chips from Intel and AMD.\nBest gaming motherboard: The right boards.\nBest graphics card: Your perfect pixel-pusher awaits.\nBest SSD for gaming: Get into the game ahead of the rest. The tweet also references a likely launch between April and June of this year, which would mean that the new chips would almost certainly beat Intel's Arrow Lake desktop chips to market. Sign up to get the best content of the week, and great gaming deals, as picked by the editors. Intel's Pat Gelsinger recently confirmed that the new Intel CPUs would be coming this year, but given that laptops using Meteor Lake CPUs are only just beginning to ship, the current predictions are that we're likely to see them launch some time in the second half of this year. If this turns out to be the case then this would be something of a boon for AMD, as it would have the next-gen desktop processor market all to itself while Intel plays catch up. The new Zen 5 chips are rumoured to be in mass production already, so it looks like AMD is pushing hard to make sure it beats Intel to the punch. While there are no great surprises in this recent batch of leaks it does add some reinforcement to what we'd heard already about AMDs next-generation silicon, and although those potential performance gains are not likely to get anyone too excited, we'll be very curious to pit Zen 5 and Arrow Lake against each other when we have our hands on them for testing. And if those launch dates are to be believed, when it comes to the AMD chips, it doesn't look like we'll have to wait too long to benchmark them for ourselves. Andy built his first gaming PC at the tender age of 12, when IDE cables were a thing and high resolution wasn't. After spending over 15 years in the production industry overseeing a variety of live and recorded projects, he started writing his own PC hardware blog for a year in the hope that people might send him things. Sometimes they did.  Now working as a hardware writer for PC Gamer, Andy can be found quietly muttering to himself and drawing diagrams with his hands in thin air. It's best to leave him to it.  Intel's future multi billion dollar mega-fab is set smack-bang on top of multiple neolithic burial sites Elon Musk claims Tesla could build a silicon foundry and make its own chips, but says 'I sure hope we don’t have to' I really enjoyed running around as a tiny ant in this upcoming RTS By Phil Savage28 March 2024 By Joshua Wolens28 March 2024 By Harvey Randall28 March 2024 By Lauren Morton28 March 2024 By Harvey Randall28 March 2024 By Elie Gould28 March 2024 By Harvey Randall28 March 2024 By Joshua Wolens28 March 2024 By Robert Jones28 March 2024 By Shaun Prescott28 March 2024 By Chris Szewczyk28 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}