{
    "title": "AMD Ryzen 9000 Zen 5 CPU specs and launch timeframe revealed in latest leak",
    "date": "1/26/2024",
    "url": "https://www.techspot.com/news/101657-amd-ryzen-9000-zen-5-cpu-specs-launch.html",
    "text": "Rumor mill: AMD had already confirmed that its Ryzen 9000-series \"Granite Ridge\" desktop CPUs will feature Zen 5 cores, use the AM5 socket, and be compatible with existing 600-series motherboards. A tipster has now seemingly revealed many other details about the upcoming processors, including their possible launch timeframe. In a recent report, we had already revealed that the Ryzen 9000 'Granite Ridge' series had entered mass production, and is on course to hit the market later this year. A new leak from tech YouTuber @highyieldYT now claims that the upcoming processors will debut in the second quarter of this year. The post also reveals that the new chips will feature the same on-package chiplet design as Zen 2/3/4 and the same IO-die as Zen 4. Next-gen CPUs are reportedly being fabricated using TSMC 4nm (\"N4\") process technology, and should bring at least a 10 percent improvement in IPC (instructions per cycle). This should result in better performance than the Ryzen 7000 series, despite similar clock speeds. The new processors should support DDR5 memory with speeds up to 6,400 MT/s. Zen 5 is closing in, a launch between April-June is very likely, AMD could dominate until Arrow Lake.\n\n- Ryzen 9000\n- AM5\n- same on-package chiplet design as Zen2/3/4\n- same IO-die as Zen4\n- same core count\n- TSMC N4 variant\n- double-digit IPC uplift\n- similar clks\n- DDR5-6400 The Ryzen 9000 CPUs are said to offer between 6 and 16 cores, and include either RDNA 2 or RDNA 3.5 integrated graphics. The TDP (thermal design power) of these chips will range between 65 and 170 watts as AMD aims to balance performance and power efficiency. The Granite Ridge processors are believed to come with up to 64MB of L3 cache and 16MB of L2 cache. Also read: How CPU Cores & Cache Impact Gaming Performance It's not immediately clear if AMD will also introduce 9000X3D variants of the new chips with additional 3D V-Cache technology, but such a move could further strengthen the company's standing against Intel, especially in the DIY market. AMD first launched a 3D V-Cache processor (Ryzen 7 5800X3D) for desktops in 2022 and followed that up with the launch of the Ryzen 9 7945HX3D for laptops last year. Not much else is known about Zen 5, but it is rumored to use a hybrid architecture with a mixture of standard and dense \"C\" cores. It could also include a Ryzen NPU for AI processing like Hawk Point, bringing machine learning optimizations. The Ryzen 9000 series is expected to compete with Intel's Arrow Lake-S desktop CPUs that are expected to be released around September-October 2024. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}