{
    "title": "AMD receives UK Government DASA funding - JEC",
    "date": "1/30/2024",
    "url": "https://www.jeccomposites.com/news/spotted-by-jec/amd-receives-uk-government-dasa-funding/",
    "text": "Explore the world of composites through JEC Group’s multi-channel knowledge-sharing resources: JEC Composites Magazine & e-newsletters, in-depth analysis & market reports, technical & business conferences, video & social media platforms      Connect with the global composites community with JEC Group’s portfolio of international events & networking solutions, on and off-line: the world’s premier composites exhibition JEC World, specialist region & market-focused Forums & Summits, & one-to-one Business Meetings program    Discover the composites technologies, people and organisations shaping the future through JEC Group’s showcases of creativity & collaboration: the renowned JEC Composites Innovation Awards, Startup Booster challenge, & industry-themed Innovation Planets.    Advanced Composite Materials Aramid Fibre Reinforced Polymer Bladder Inflation Moulding 2K Compression Explore the world of composites through JEC Group’s multi-channel knowledge-sharing resources: JEC Composites Magazine & e-newsletters, in-depth analysis & market reports, technical & business conferences, video & social media platforms      Connect with the global composites community with JEC Group’s portfolio of international events & networking solutions, on and off-line: the world’s premier composites exhibition JEC World, specialist region & market-focused Forums & Summits, & one-to-one Business Meetings program    Discover the composites technologies, people and organisations shaping the future through JEC Group’s showcases of creativity & collaboration: the renowned JEC Composites Innovation Awards, Startup Booster challenge, & industry-themed Innovation Planets.    Advanced Composite Materials Aramid Fibre Reinforced Polymer Bladder Inflation Moulding 2K Compression AMD announces that it has received UK Government Defence and Security Accelerator (DASA) funding within the new “Affordable and Adaptable Unmanned Air Systems” competition. AMD announces that it has received UK Government Defence and Security Accelerator (DASA) funding within the new “Affordable and Adaptable Unmanned Air Systems” competition. 30 secondes Funded by the Army Research Innovation and Exploitation Laboratory (ARIEL), a part of the Army’s Futures Directorate, the competition seeks novel low-cost and adaptable autonomous air systems to give the UK an advantage. The challenge for AMD is to use its existing low-cost radar absorbing technologies to help such autonomous air systems survive against evolving counter-air and counter-uncrewed air system threats. John Lee CEO of AMD says: “We are excited to be working within this program offering the UK Government an opportunity to exploit the existing AMD Radar absorbing technologies that have been developed over the last five years. We fully expect to be able to demonstrate that AMD materials will, without any other negative impact, provide a significant broadband reduction in the radar cross section of the platform.”  Announcement Business Defence, Security & Ballistics Read this next Stay up to date with the latest composites news directly in your inbox. Subscribe for free to the JEC Composites International and French e-Letters. Copyright © 1996-2024 JEC. All rights reserved. "
}