{
    "title": "SolidRun unveils AMD Zen 3-based Ryzen V3000 computer-on-module for \nnetworking and edge computing",
    "date": "2/27/2024",
    "url": "https://www.tomshardware.com/networking/solidrun-unveils-amd-zen-3-based-ryzen-v3000-computer-on-module-for-networking-and-edge-computing",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. SolidRun's first x86 CoM. SolidRun has launched its first x86-based computer on module (CoM) for networking using AMD's Zen 3-powered V3000 embedded APUs. The new CX7 CoM comes equipped with one of AMD's eight-core V3000 chips, and features up to 96GB of DDR5 memory, three slots for PCIe 4.0 SSDs, and a plethora of connectivity. \nFor SolidRun, CX7 represents a big performance upgrade compared to its prior Arm-based CoMs, which used older stock Cortex cores. The CX7 is remarkably dense in computing power and connectivity. It features an 8-core Zen 3 APU from the V3000 embedded series (the same as the Ryzen 6000 series). There are two SKUs, the 15-watt V3C18I model or the 45-watt V3C48 chip. The APU can be paired with up to two 48GB sticks of DDR5 for a total of 96GB, and 12 of the chip's 20 PCIe 4.0 lanes can be used for NVMe storage. Additionally, the CX7 might have support for Zen 4-based Ryzen 7000 Phoenix and Ryzen 8000 Hawk Point APUs. SolidRun doesn't say this in its press release, but the specification sheet explicitly mentions \"optional R7000 7840HS and R8000 8845HS headless with iGPU for compute only\" which isn't exactly ambiguous. The spec sheet also goes on to say that CX7 boards using V3000 chips will have 4,800MHz DDR5, while models using the Zen 4-based APUs will have 5,600MHz memory. We've followed up with SolidRun to confirm whether this accurate. Regardless of the choice of processor, the board is decked out with impressive connectivity options. It has two 10-gigabit ethernet ports, four more 2.5 gigabit ethernet ports , WiFi 6E, and 5G. SolidRun's adoption of the V3000 series (and potentially Zen 4 APUs) isn't totally out of left field; it makes industrial PCs with Ryzen 7000 Phoenix APUs, so this isn't even the company's first AMD product. However, it is the first time SolidRun has used an x86 processor for a networking-focused CoM, all of which up until now have used multi-core Arm CPUs using the stock Cortex A72 core that debuted all the way back in 2015. Needless to say, switching even to Zen 3 would be a massive upgrade. Of course, as a higher performance solution, it's entirely possible the new CX7 CoM isn't as low power as its Arm-based predecessors. At the very least, CX7 is probably SolidRun's most expensive CoM now given it also has the most memory and connectivity options of any of its predecessors. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Matthew Connatser is a freelancing writer for Tom's Hardware US. He writes articles about CPUs, GPUs, SSDs, and computers in general. Banana Pi launches $30 OpenWRT Wi-Fi 6 Router with WPA3 protection, optional PoE Intel has a new driver for Wi-Fi 7 adapters but they may still not work on AMD systems — Intel BE200/BE202 incompatibility on AMD platforms remains uncertain Chinese flash memory maker claims breakthrough - QLC NAND matches endurance of TLC NAND By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Roshan Ashraf ShaikhMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Anton ShilovMarch 27, 2024 By Aaron KlotzMarch 27, 2024 By Anton ShilovMarch 27, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}