{
    "title": "AMD Ryzen 7 7800X3D Review",
    "date": "2/28/2024",
    "url": "https://www.trustedreviews.com/reviews/amd-ryzen-7-7800x3d",
    "text": "Trusted Reviews is supported by its audience. If you purchase through links on our site, we may earn a commission. Learn more. One of the best value gaming CPUs you can buy The AMD Ryzen 7 7800X3D is nothing short of impressive. Ok, the Ryzen 9 might be the flagship of the range, but this 8-core, 16-thread budget alternative is no slouch either. Packing in some seriously impressive CPU and gaming performance, it’s a solid, efficient and reliable pick for anyone looking to build an AMD gaming PC.  The AMD Ryzen 7 7800X3D may well be the lowest denominator in the X3D CPU family, but don’t let that fool you into thinking it’s the worst. It’s absolutely not. In fact, given how low a price you can pick one of these up for, it might actually be the most interesting one of the bunch. Based on the TSMC N5 Zen 4 architecture, it packs in some truly impressive hardware for the price, while giving you access to DDR5, PCIe 5.0, and some solid performance to boot, particularly when it comes to gaming. AMD has, at least for the last two generations, had two series of chips per architecture. On the one side, you have the more traditional, multi-core bound, X series processors (think your 7950Xs your 7600Xs and so forth), and on the other the X3D lineup, the more gaming-oriented chips (the 7800X3D, 7900X3D, and 7950X3D respectively). Ryzen’s architecture is unique in the fact that it’s a modular design, and not a traditional monolithic design. Each Ryzen CPU features a number of chiplets called Core Complexes (CCXs). Those CCXs house a number of physical CPU cores and storage cache on them. Now, to fully process information, the CCX’s have to communicate with one another, and they do this via an interconnect on the CPU, what AMD calls its Infinity Fabric. This acts like a PCIe lane does between your graphics card and your system, but on the CPU itself. That naturally stymies latency, single-core performance, and to some degree clock speed as well, compared to a traditional design. But by following this route it allows AMD to quite easily add more cores to its CPU designs if there’s enough space to do so fairly easily. With the X3D chips, AMD set out to offset that loss in single-core performance (which negatively impacts gaming), through some inventive engineering. Namely, as the local CPU cache has such a large bearing on in-game performance for certain titles, it stacked additional cache chips on top of one of its core complexes, in a 3D manner. This does increase heat for that CCX, meaning that clock speeds and wattage has to drop as a result compared to its non-X3D counterpart, but it can vastly improve performance in-game and reduce latency in the process. Despite the nomenclature, the Ryzen 7 7800X3D actually has no non-3D equivalent. Instead, you really have to compare this against the 7700X. Both feature 8 cores, 16 threads, a single CCX, and at launch were fairly similar in price, with the X3D coming in at just $50 more (although those prices have since dropped dramatically).  The Ryzen 7 7700X has higher clock speeds as standard, tapping out at 5.4 GHz under boost with a 105W TDP, whereas the 7800X3D hits a svelte 5.0 GHz with a 120W TDP. The big difference is the cache size, and that’s exactly what we’d expect, with L3 cache on the 7700X dialled in at 32MB whereas the 7800X3D features a staggering 96 MB total. You can quite clearly see the trade-offs between the two. The more expensive 7900X3D and 7950X3D chips feature substantially more cores, and 32MB of additional cache, along with a higher TDP. To really understand these chips, you need to benchmark them and get some good test results from them. Ideally, you want a broad swathe of benchmarks, across a multitude of different professions, and as many CPU comparison products as you can. I’ve spent the last week running the AMD Ryzen 7 7800X3D through our array of tried-and-true benchmarks, utilising as stable and consistent a test bed as I can. It’s important you keep your test bed as consistent as possible to minimise bottlenecks and ensure you’re seeing only what the processor can do, and nothing else. For gaming, I’ve tested the AMD Ryzen 7 7800X3D and its sister chips from both AMD and Intel at 1080p. Although 4K and 1440p gaming might sound tempting, these resolutions typically leverage more of the load onto the GPU, as it renders a greater number of pixels. In the case of 1080p, my GPU of choice – the RTX 4080 – can produce many 100s of fps, in pretty much all of our titles on test. What that means is that how fast the Ryzen 7 7800X3D can process those frames, and deliver it to your monitor, will become the bottleneck, not the GPU itself. Jumping up to 1440p and 4K, not only reduces the number of fps minimising the size of the performance difference, but it also reduces that high frame rate bottleneck substantially. Our gaming tests include Borderlands 3, Total War: Warhammer III, Cyberpunk 2077, along with Horizon Zero Dawn, Dirt Rally, and a few others as well. Some of these titles are optimised for Intel, and some for AMD respectively. Some prefer single-core, some multi-core, so it should give us a good array overall. I also keep a watchful eye on the average frame rates across all of the titles on test as well, for direct comparison. For the computational side, we’re utilising Cinebench, Geekbench, PCMark 10, and 3DMark, as well as monitoring all temperature and power metrics via HWMonitor and a plug-in power meter (reporting power-drawn directly from the wall for the entire system under load). If I can say one thing about my time testing the AMD Ryzen 7 7800X3D it’s that this thing is an impressive processor. It initially retailed at around $450 or thereabouts, nowadays you can pick one up for around $360, and I’ve seen it drop even lower than that. That’s a $90 drop though on average, no doubt in response to Intel’s 14th-generation processors, particularly the Intel Core i5-14600K. Nonetheless, this makes it one of the best value AMD gaming processors money can buy, with some serious performance to back up the investment too. Across all of our synthetic tests, it performed remarkably well. Scoring 13,656 points in PCMark 10, 14,791 in Geekbench, and a comfortable 17,938 in Cinebench R23 in multi-core mode. The Intel Core i5-14600K did, on average, score around 10% higher than that in those computational tests, but in gaming it’s a remarkably different story. On average the 7800X3D netted an impressive 203 fps across all 7 of our test titles. Intel’s 14600K on the other hand, scored 211 fps. That’s a 3.79% performance difference between the two. But bearing in mind that the 14600K pulls a whopping 517.6W from the wall, the 7800X3D’s 465.3W (11.2% difference) result proves the AMD to be the more power-efficient chip of the two, making its performance figures even more impressive. Compared to the other chips in AMD’s arsenal shows off some pretty stellar numbers too. Gaming once again leads the way, with only its bigger brother – the Ryzen 9 7950X3D – beating it by any margin, and even then that was 206 fps versus that 203 avg fps. The rest of the Ryzen stack averaged around 192-194 in comparison. If you want one of the best value AMD gaming CPUs At the low prices we’ve seen it at, the Ryzen 7 7800X3D provides incredibly well rounded gaming performance, and is by far the best value AMD processor you can get for gaming right now. If you want a well rounded CPU that’s even better value The 7800X3D is impressive no doubt, but sadly it still doesn’t hold a candle to the likes of the Intel Core i5-14600K, particularly at its current pricing. The AMD Ryzen 7 7800X3D is an intriguing proposition. It houses some seriously impressive performance for the price, particularly for Team Red. If you’re not interested in streaming or rendering, or any other computational task it represents a truly awesome AMD gaming solution, making it ideal for any mid-range or budget build. It’s not the best CPU in the world, but it’s still worth considering if you’re looking to get the most bang for your buck, and would rather stick with AMD. If you’re happy to switch over to Intel instead, check out the Intel Core i5-14600K as an alternative. All of our CPUs are run through a vast array of synthetic and real world benchmarks to really put them to the test. Results are recorded over multiple runs and then averaged out. Power and temperature readings are monitored by a power meter and HWMonitor respectively. Use identical components for each CPU test bed A combination of synthetic and real world tests power draw and cpu temperatures tested Unfortunately AMD’s Zen 4 processors don’t currently support the DDR4 standard, so you’ll have to upgrade to a new motherboard and DDR5 if you’d like to use them. Yes, but not quite as competitive as some of the non X3D chips, or some of Intel’s 14th-generation offerings. Still, it’s more than capable of streaming or rendering video to a high standard.   Zak grew up obsessed with PC gaming. Getting his first PC at the age of 6, working with his dad he was soon building rigs left right and center. Based in the UK, Zak studied journalism at the Universi… Founded in 2003, Trusted Reviews exists to give our readers thorough, unbiased and independent advice on what to buy. Today, we have millions of users a month from around the world, and assess more than 1,000 products a year. Editorial independence means being able to give an unbiased verdict about a product or company, with the avoidance of conflicts of interest. To ensure this is possible, every member of the editorial staff follows a clear code of conduct. We also expect our journalists to follow clear ethical standards in their work. Our staff members must strive for honesty and accuracy in everything they do. We follow the IPSO Editors’ code of practice to underpin these standards. Founded in 2003, Trusted Reviews exists to give our readers thorough, unbiased\n                        and independent advice on what to buy. Today, we have millions of users a month from around the world, and assess more than 1,000 products a year. Editorial independence means being able to give an unbiased verdict about a product or company, with the avoidance of conflicts of interest. To ensure this is possible, every member of the editorial staff follows a clear code of conduct. We also expect our journalists to follow clear ethical standards in their work. Our staff members must strive for honesty and accuracy in everything they do. We follow the IPSO Editors’ code of practice to underpin these standards. Get the best of Trusted Reviews delivered right to your inbox. Products tested and reviewed since 2003 "
}