{
    "title": "Protocol Village: Research Paper Details 'Snarktor,' Featuring 'Recursive \nProof Aggregation'",
    "date": "2/22/2024",
    "url": "https://ca.finance.yahoo.com/news/protocol-village-wormhole-collaborates-amd-233749524.html",
    "text": "Feb. 22: Researchers at Telos Foundation, supporting the Telos blockchain, and Input Output Global, known for its work on the Cardano blockchain, have teamed up to publish a white paper revealing a new protocol, \"Snarktor,\" that developers can leverage to scale blockchains more efficiently and securely across millions of use cases via the integration of zk-SNARK technology. According to the abstract for the paper, published in Cryptology ePrint Archive: \"We present a new protocol for decentralized recursive proof aggregation allowing one unique proof to aggregate many input proofs to be efficiently verified on-chain, increasing the throughput and cost efficiency of SNARK-based blockchains. The protocol is designed for decentralized environments where independent actors (provers) can join and contribute to the proof generation process.\" Feb. 22: Vault, an assisted self-custody wallet by the global Web3 financial platform Uphold, is exiting the two-month beta phase on Thursday. According to the team: \"The previous beta phase has seen a significant volume of $33M in assets traded amongst the select group of beta users. Following a diligent community feedback session, the Uphold team saw roughly 80% of surveyed users found Vault easy to understand and simple to use when moving and managing funds.\" Feb. 22: Helius on Thursday announced the successful closing of a $9.5 million Series A round, according to the team: \"Helius, founded by former Coinbase and Amazon Web Services software engineers, has built a suite of tools designed to enhance the developer experience on Solana. The round was led by Foundation Capital, with participation from Reciprocal Ventures, 6th Man Ventures and Solana ecosystem founders, among other funds and investors.\" CoinDesk 20 asset: {{SOL}} Feb. 22: Alchemy just launched Modular Account, \"a bold step forward in making the Web3 ecosystem more broadly accessible to non-technical users through dramatically improved UX,\" according to the team. \"Imagine trying to onboard the layman with no prior blockchain exposure and describing the various nuances of cold wallets, private keys, gas, nonces, etc. Modular Account is a new contract account implementation designed from the ground up for ERC-4337 and ERC-6900 compatibility. Modular Account provides enterprise-grade security, best in class cost, and robust account extensibility to developers building on Ethereum L2s.\" Feb. 22: Astar Network developer, Startale Labs, a developer of Japanese Web3 products, Aiming to accelerate the mass adoption of Web3, has raised an additional $3.5 million from UOB Venture Management and Samsung Next, according to the team: \"This brings the total seed round funding to $7 million, combined with a $3.5 million investment from Sony Network Communications in June 2023.\" Feb. 22: DWallet Labs announced the testnet launch of dWallet Network, a first-of-its-kind composable modular signature network. According to the team: \"The dWallet Network introduces a new primitive for multi-chain collaboration in Web3 – dWallets – a noncollusive and massively decentralized signing mechanism that can be used as a building block on L1s and L2s to sign native transactions to all chains. With assets always staying on their native chains, eliminating the cross-chain risks of wrapping, bridging or messaging. It’s the first-of-its-kind composable modular signature network built on dWallet's new protocol 2PC-MPC.\" Feb. 22: Binance Labs, the venture capital and incubation arm of Binance, has invested in Renzo, a Liquid Restaking Token (LRT) and strategy manager for EigenLayer, built to promote the widespread adoption of EigenLayer. \"Renzo Protocol, an EigenLayer restaking hub, consists of Ethereum smart contracts that facilitate trustless collaboration between stakers, node operators, and Actively Validated Services (AVSs),\" according to the team. Feb. 22 (EXCLUSIVE): Clave, a fintech dApp start-up aiming to provide an easy user experience for everyone to accelerate their on-chain journey, has raised $1.6M in a pre-seed funding round led by Matter Labs, the developer behind the layer-2 network zkSync. \"The round also saw participation from Safe, Lambda Class and Mirana Ventures, as well as angel investors Sandy Peng of Scroll, Raj Parekh of Portal, Anurag Arjun of Avail, and many more industry leaders.\" Feb. 22: Arbitrum Foundation, supporting the Ethereum layer-2 network Arbitrum, announced a partnership with OpenZeppelin, a smart-contracts code auditor, \"to enable next-generation development on Arbitrum Stylus,\" according to the team: \"What is Arbitrum Stylus? Stylus is an upgrade to Arbitrum Nitro, the tech stack powering Arbitrum One, Arbitrum Nova and Arbitrum Orbit chains. It opens the door for developers to write smart contracts in various languages, such as Rust, C, and C++, that compile to WebAssembly (WASM). OpenZeppelin Contracts and Defender will be getting expanded to Arbitrum Stylus while supporting builders in the ecosystem with best-in-class security services.\" {{ARB}} Feb. 22: Aave, the largest DeFi money market protocol, \"with strong governance support from the community, is coming to BNB Chain,\" according to the BNB team. - \"This move further expands the BNB Chain DeFi ecosystem, joining other industry heavyweights like Uniswap, Ambit Finance, PancakeSwap and Lista DAO.\" - \"BNB Chain users will now have access to an industry leading lending platform and with strong liquidity on FDUSD, will be able to engage in more DeFi related activities.\" - \"Aave users will benefit from being integrated with one of the largest DeFi ecosystems and have access to BNB Chain’s low fees.\" Feb. 22: Wormhole, a blockchain interoperability platform, announced a collaboration with microprocessor maker AMD that will make enterprise grade AMD FPGA hardware accelerators available to the Wormhole ecosystem, including the AMD Alveo™ U55C and U250 adaptable accelerator cards. AMD will also lend its deep hardware acceleration expertise to help deliver speed and scalability to multichain applications being built with Wormhole. \"AMD offers enterprise-grade FPGAs that are based on the most advanced architectures for scalable compute and flexibility for a breadth of applications. FPGAs can parallelize massive workloads, such as processing millions of multichain messages on Wormhole,\" according to a blog post on AMD's website. Feb. 22: Inco, leading developer of a universal confidentiality layer for Ethereum and other networks, has secured $4.5 million in a seed round led by 1kx, and launched its testnet Gentry. According to the team: \"The testnet addresses Web3's confidentiality challenges, blending EVM with FHE and secured by Ethereum via EigenLayer. With native on-chain confidentiality and randomness, Inco empowers diverse dApps including gaming, DeFi, private lending and blind auctions.\" Feb. 22: Meso, a payment platform connecting banks and blockchains, announced it has raised $9.5 million in a seed round, co-led by Solana Ventures and Ribbit Capital, with participation from 6th Man Ventures, Canonical Crypto, Phantom Co-Founder Chris Kalani, Pinterest CEO Bill Ready and Archie Puri of Bodhi Labs. According to the team, \"the network was launched by veterans from PayPal, Venmo and Braintree. Apps can integrate Meso to onboard users without first sending them off to a centralized exchange to fund their wallets.\" Meso currently supports Ethereum, Solana and Polygon, and will add Arbitrum, Optimism and Base by the end of Q1. Protocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Trade 24 hours a day on the world's most popular platform. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. Rebel Wilson is calling Sacha Baron Cohen’s decision to release behind-the-scenes footage of their sex scene “an a–hole move,” after never-before-seen video from the set of the 2016 film “The Brothers Grimsby” was published Friday by the Daily Mail. “Releasing unauthorized and misleading behind-the-scenes video without my approval is SBC’s latest way of bullying and gaslighting me,” the ... Saturday Night Live went with Donald Trump’s hawking of Bibles for its cold open, with James Austin Johnson returning as the former president to make the pitch. It was another case of the show trying to satirize something that hardly needs rewriting. “That’s right, it’s Easter. The time of year when I compare myself to … 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 Nordegren has moved on and built a life that focuses on her six kids Seven reportedly cost $20 million Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump…  Russian Armed Forces downed their own Sukhoi Su-27 fighter jet over Crimea, according to Ukrainian officials. The defenestration of Ronna McDaniel, threatened disbarment of John Eastman and capitulation of Kari Lake in a defamation lawsuit suggest a welcome reckoning is upon us. The monarch was joined by wife Queen Camilla and other royal family members for a church service at St. George's Chapel at Windsor Castle  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" Illustration by Elizabeth Brockway/The Daily BeastI have vivid memories of then-President Donald Trump standing in front of St. John’s Episcopal Church, right across from the White House, using the Bible as a prop. Ironically and revealingly, Trump looked uncomfortable handling the Holy Scriptures and ended up holding the Bible upside down. Had he actually read the Bible, it might have turned his worldview upside down.And now he is hawking his new Bible—the Bless the USA Bible—for $59.99 (more t  Prince George appears to have inherited a very impressive skill from the likes of King Charles, Kate Middleton and Prince Philip. Discover more... Buying a car can feel like walking through a minefield of shady sales tactics. Some deceitful dealerships have long employed a bag of tricks to nickel-and-dime consumers out of their hard-earned cash.... They soft-launched their relationship at the supermodel's cookbook event in Miami. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Owning clothes with buttons, at least when they were first invented, was a sign of wealth. Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. "
}