{
    "title": "DDR4 vs DDR5 RAM: What's different and which one should you buy?",
    "date": "2/18/2024",
    "url": "https://www.xda-developers.com/ddr4-vs-ddr5/",
    "text": "DDR4 vs DDR5 RAM remains one of the most discussed topics in the PC computing space. The latest CPUs from both Intel and AMD support DDR5, and we've already started some solid DDR5 memory kits on the market. The arrival of these DDR5 memory kits, however, is yet to fully phase out DDR4, as both Intel 13th-gen and 14th-gen CPUs as well as AMD's more affordable 5000-series CPUs still support it. DDR4 RAM essentially remains a popular choice for anyone on a budget that's looking for good value. Deciding between DDR4 and DDR5 memory could be one of the most important choices you'll have to make as long as both standards remain viable options. It's not just a question of value and performance, but also determines the kinds of motherboards and CPUs you can use. The DDR5 RAM modules are physically identical to the existing DDR4 sticks. That's not necessarily a surprise, though. Unlike the DDR3 to DDR4 transition, the new DDR5 doesn't have a new or additional number of pins than the predecessor. It retains the arrangement of 288 pins, but the pinouts are slightly different. The real difference, however, resides at an architectural design level. While the DDR4 modules have a single 64-bit channel, DDR5 DIMMs come with two independent 32-bit channels. The burst length has also been doubled from 8 bytes to 16 bytes. Below is a detailed look at some of the key differences between the two memory standards. One of the biggest advantages of DDR5 memory modules is that they bring a higher level of bandwidth. This is more important now than ever as we continue to get new processors with a lot of cores. The Intel Core i9-14900K, for instance, has 24 cores in total. Even the relatively low-powered mainstream parts like the Core i5-14400 have ten cores. The mainstream PC market is only going to get better CPUs with higher core counts in the future, so increasing bandwidth is a necessity. The JEDEC (Joint Electron Device Engineering Council) specifies DDR4 data rates (or frequencies) spanning from DDR4-1600 to DDR4-3200, though there are a number of kits that are rated for even higher speeds. For DDR5, it's specified as DDR5-3200 to DDR5-6400, but it's safe to say that you'll see DDR5-4800 serving as the baseline while the latter number keeps increasing as the standard matures over time. DDR5's higher frequency is what gives it superior bandwidth to DDR4. Another thing that the DDR5 standard brings to the table is denser memory modules for high capacity. While the DDR4 modules topped out at 16Gb memory chips, DDR5 quadruples that number to use up to 64Gb memory chips. In theory, we can have as much as 128GB of memory per module, which is significantly more than what any DDR4 memory stick has to offer. There's still some time before we start seeing 128GB capacity DDR5 modules, but we already have 64GB kits with 2x32GB sticks on the market, as well as new 2x24GB kits. Power efficiency is also one of the major talking points of DDR5 memory modules. On the surface, DDR5 memory modules have an operating voltage of 1.1V, down from DDR4's 1.2V. This is bound to be different for each kit as they're overclocked or have higher binned memory with tighter timings. We've seen DDR4 modules scale up to 1.6V, and it's safe to say that DDR5 will further increase to hit higher values. We already have DDR5 modules on the market that go as far as 1.35V for DDR5-6800. As faster memory speeds take priority, DDR5's operating voltage will also climb alongside it to hit new highs. It's also worth pointing out that motherboards are not responsible for voltage regulation for DDR5 modules. These new modules have power management IC (PMIC) — 5V for mainstream modules and 12V for server-grade DIMMs. PMIC, in case you don't know, uses 5V input from the motherboard and converts it to usable volts. The PMIC has a lot of advantages, including improved voltage regulation, strong signals, and low noise. It's definitely a good change, but it makes the RAM modules expensive and is currently one of the main reasons behind the DDR5 supply being short. Now have we've covered some of the major differences between the standards of memory, let's take a look at the key differences to summarize the transition from DDR4 to DDR5 (baseline specs): Features DDR4 RAM DDR5 RAM Memory Speed 1600MHz - 3200Mhz 4800Mhz - 6400Mhz Die Density 16Gb SDP -> 64GB DIMMs 64Gb SDP -> 256GB DIMMs Voltage 1.2V 1.1V Power Management On motherboard On DIMM PMIC With that out of the way now, it's time to compare modules from each standard to see exactly how these changes reflect in real-world usage. For this particular comparison, we'll be using Kingston's Fury Beast DDR5 memory alongside an Intel Core i9-12900K. Intel's Alder Lake-S desktop CPUs were the first consumer-grade processors to arrive on the market with support for DDR5 memory, but they also support DDR4 memory, which means a direct comparison of DDR4 and DDR5 is possible. Our motherboard of choice for this test will be the Gigabyte Z690 Aorus Pro DDR5 motherboard. You can also grab a version of this motherboard that's compatible with DDR4 kits, which is what we used for this particular comparison while keeping the rest of the hardware the same. By default, the Kingston Fury Beast DDR5 memory modules operate at DDR4-4800 at 1.1V. It runs at JEDEC specified timings of 38-38-38. However, a quick visit to the Intel XMP 3.0 will boost the Fury Beast up to DDR5-5200 with CL40 and 1.35V. It goes without saying that both DDR4 and DDR5 modules must operate in a similar system configuration. We compared the 32GB (2X16GB) DDR5 memory with an equivalent 32GB (2X16GB) DDR4 kit on a similar test bench. Here's a quick look at some of the benchmarks that we were able to run for this particular test: Benchmark Kingston Fury Beast 32GB(2X16) DDR5-5200 CL40 ADATA XPG GAMMIX D30 32GB(2X16) DDR4-3600 CL18 PCMark 10 (Higher is better) 12,145 11,628 Cinebench R23 - Multi (Higher is better) 27,086 27,140 Blender - BMW (Lower is better) 87 88 Corona 1.3 - RT(Lower is better) 54 54 Handbrake x264, .mkv to .mp4 (Lower is better) 123 131 Handbrake x265, .mkv to .mp4(Lower is better) 283 291 The benchmark numbers revealed some unsurprising results, and we observed little to no performance difference between the two. The CPU-bound benchmarks that we ran mostly relied on the raw power of the CPU cores, making other factors like memory relatively less important. The performance difference in games, however, would be more apparent since the CPU takes on a different role. While the transfer speeds of the new DDR5 memory modules are excellent, there's still plenty of room for improvement when it comes to price, frequency, and latency. There are affordable DDR5 kits on the market, but you'll still be paying more compared to their DDR4 counterparts. The cost adds up further when you consider the compatible motherboards. Compatibility is probably the most crucial difference between DDR4 and DDR5. DDR4 has surprisingly good compatibility thanks to Intel continuing to support it with 13th and 14th-generation CPUs; it's also compatible with older Ryzen 5000 CPUs, many of which are still in demand today. Intel's 12th, 13th and 14th-generation, plus AMD Ryzen 7000 are the only desktop CPUs that currently support DDR5, and Ryzen 7000 is the only one that absolutely requires it. One important thing to note is that while Intel's current and previous-gen CPUs support both DDR4 and DDR5, LGA 1700 motherboards can only support one or the other. This is because DDR4 and DDR5 are physically and electronically different, and it's impossible (or at least extremely challenging) for a motherboard to support both at the same time. The motherboard determines the kind of memory that is compatible, which is important to double-check if you're building a new PC. We've seen the major differences between DDR4 and DDR5 memory modules along with some benchmark numbers, showing some real-world performance tests. Now for the most important question — which one should you buy for your next PC build? The answer to that question depends on your budget for the PC build, what kind of CPU you want, and what you're going to be doing on your PC. Corsair's Vengeance Pro RGB DDR5 memory kit offers some of the highest frequencies and lowest latencies of any DDR5 kit, and features a stylish strip of RGB lighting. Since LGA 1700 motherboards only support one memory standard, ditching DDR4 for DDR5 only makes sense if you have the budget for it and actually need the extra performance. Keep in mind that you'll be bearing a significant price difference between the two, and you'll also have to consider the platform entry cost with motherboard expenses. You can easily find DDR5 memory kits on the market now, but it'll burn a bigger hole in your wallet compared to the DDR4 options. Corsair's Vengeance LPX DDR4 memory is affordable, reliable, has one of the lowest profile designs around, and XMP has a one-click setup. There are two different versions: one optimized for AMD and another optimized for Intel. So if you're looking at a tight budget for a 13th or 14th-generation Intel build, then we recommend picking up a decent DDR4 memory kit with relatively high speeds. It can definitely keep up with the current crop of DDR5 modules on the market. However, if you're assembling a higher-end build for high-framerate gaming, the extra price for DDR5 kits is probably worth it and can help get the framerate a little higher. DDR4 also has a strong argument because it's compatible with older Ryzen 5000 chips, which means you're not just saving money on the memory but also the CPU and motherboard. It's pretty expensive to build a Ryzen 7000 PC, and DDR5 RAM being a required component is one of the primary reasons why. That being said, Ryzen 7000 is really fast, and the extra price for DDR5 isn't that bad on the higher-end models. Generally speaking, DDR5 is going to be worth it to the kind of user that primarily games at a high framerate and has a big budget. For everyone else, DDR4 is perfectly fine or even desirable since it's much cheaper. Of course, choosing DDR4 or DDR5 will come down to what motherboard you choose, since a motherboard either only has one or the other.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. A senior evergreen writer at XDA Developers serving up reviews, buying guides, deals, and more on laptops, PC hardware, and smartphones that you care about. He's been covering the computing and smartphone industry for over seven years now and has worked with various brands to establish an authority in the technology space. Before joining XDA Developers, Karthik was a senior reviewer at Digit, a popular tech magazine in India. You will likely find him yelling at his monitors while playing an online shooter in his free time. Matthew is a PC Hardware Writer at XDA, having previously written for Digital Trends, Tom's Hardware, and other publications since 2018. He's mainly interested in the three way fight between AMD, Intel, and Nvidia in PCs and servers. He also has a degree in history and linguistics. Dell puts all the pieces together with the UltraSharp 34 Thunderbolt, making a \"super monitor\" for productivity. Seven new Precision devices, including mobile workstations and desktop PCs, are headed our way March 2024. The Ayaneo Retro Mini PC AM02 is another mini PC from Ayaneo, and it's capable of quite a bit more than the first. Microsoft has bigger fish to fry. If you don't want to use ChatGPT but still want to use a chatbot, then these are the best ChatGPT alternatives out there. Discover how these ergonomic office chairs can transform your workday comfort and well-being. "
}