{
    "title": "PlayStation 6 Is Planned to Be the Most Powerful Console of Its Generation; \nSony Is Only Considering AMD",
    "date": "2/8/2024",
    "url": "https://wccftech.com/playstation-6-most-powerful-generation-amd/",
    "text": "Sony is planning to make the PlayStation 6 the most powerful console of its generation and, as such, is not afraid to take as much time as needed to achieve this goal. A new video shared by RedGaming Tech this week provides some updates not only on Sony's next-generation system but also on the PlayStation 5 Pro. While Sony has yet to announce its mid-generation refresh system, it seems more and more likely the console is indeed releasing, as third-party studios started receiving dev kits recently. While this isn't a confirmation that the system is coming 100%, as hardware is canceled all the time, the fact that dev kits are getting shipped out suggests that Sony is going through with its PlayStation 5 upgrade, which should be released later this year. As for the PlayStation 6, the system has been in the works for around one year, and its specs, like CPU and RAM, haven't been finalized yet. Sony is talking with development studios as of now to tweak the system, which is almost assuredly going to be powered by AMD technology, as AMD is the only vendor Sony is considering, according to RedGaming Tech. This is somewhat new, as Sony was talking with multiple vendors, including NVIDIA, for the PlayStation 5, before settling on AMD. While the system specifications have yet to be decided, Sony is set on making the PlayStation 6 the most powerful console of its generation and is thus ready to take things slowly, as the console's release window is said to be 2028. How this goal will be achieved remains unknown, but it is being said the Japanese company is tripling down on ray tracing and path tracing, the latter not universally supported due to its massive performance costs, machine learning and AI, especially in regards to NPCs' interactions to offer innovative and advanced gaming experiences.  As the PlayStation 6 is still far from release, and the PlayStation 5 Pro is still unannounced, we have to take everything revealed in the video with a grain of salt. Still, there are definitely some exciting times ahead, and it will be interesting to see how both Sony and Microsoft will handle their next-generation hardware. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}