{
    "title": "How long will AMD support its AM5 platform?",
    "date": "2/24/2024",
    "url": "https://www.xda-developers.com/how-long-am5-support/",
    "text": "Will AM5 platform have similar longevity as AM4? Platform longevity is one of the biggest factors to consider while building a PC. I say that because constantly having to upgrade your hardware to be on the cutting edge of tech, gets expensive very fast, especially in the ever-evolving computing space. Putting together a PC can already leave you stretching your budget, and the last thing you want to do is spend more money on platform upgrades, just to have a powerful system. The longevity of the AM4 platform was one of the biggest reasons for its success, but what about AMD's current-gen AM5 platform? Is AMD planning to support AM5 for a long time, or will it end up replacing it with something new sooner rather than later? In an updated roadmap released last year in June, while unveiling some of its plans surrounding the Zen 5 microarchitecture, AMD confirmed that its AM5 platform for motherboards will support the upcoming Zen 5-based processors, and that the socket will also scale into 2026. As of February 2024, AMD's original commitment to support AM5 through 2025 still stands, and the same was confirmed by AMD's VP and GM of Client Channel Business, David McAfee, in a video interview with OverclockersUK in December 2023. In fact, he even left the door open for a longer support by saying, \"We are firmly committed to 2025 and beyond, and we’ll see how long that promise lasts beyond 2025\". Choosing a long-lasting platform for your PC is crucial, as it allows you to mitigate your upgrade expenses by a huge margin. There is a significant difference between having to upgrade your entire PC every couple of years versus upgrading a single component like the CPU on that platform, after all. Just to put things into perspective, it'll be cheaper for you to stay on the same AM5 platform and just upgrade to, say, a better processor or a faster memory module, verus having to replace the entire motherboard in the name of upgrades and pick compatible parts accordingly for that. AM4 was — and it still largely is — popular in the community for its successful run from 2017 to 2022. During its run, it saw 5 architectures, 4 process nodes, and over 100 processor SKUs, and it stuck around to see through Ryzen 5000 series processors too, before getting replaced by the AM5 platform for the Ryzen 7000 series in September 2022. That made it incredibly upgrade-friendly, as the folks wanting to upgrade from an older Ryzen processor to a Ryzen 5000 series chip simply had to swap them out without having to make bigger changes. Yes, the motherboard would need a BIOS revision, but that's pretty much it. AM5 looks to be no different in this regard, at least for now, as users with Ryzen 7000 chip and an AM5 motherboard with X670 or B650 could simply swap out the processor for a new one from the Ryzen 8000 series. You may need a firmware update, but you won't have to go hunting for a fresh set of parts. AMD has always been committed to offer more from a longevity standpoint, and it shows if/when you turn back the hands of time. It's tough to tell exactly how long AMD plans to support the AM5 socket, but it will at least be here through 2025. We'll update this space with more info if we hear on this from AMD at Computex later this year.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. A senior evergreen writer at XDA Developers serving up reviews, buying guides, deals, and more on laptops, PC hardware, and smartphones that you care about. He's been covering the computing and smartphone industry for over seven years now and has worked with various brands to establish an authority in the technology space. Before joining XDA Developers, Karthik was a senior reviewer at Digit, a popular tech magazine in India. You will likely find him yelling at his monitors while playing an online shooter in his free time. It was an exciting month for new releases and thorough reviews, and you'll find the best ones here. Thermal paste is a vital component of any CPU cooling solution, but here's how long you can expect it to last Save on Anker's impressive 150W charger that can really do it all. If you're looking for tons of storage space, this deal's going to be right up your alley. Nvidia, in collaboration with HuggingFace and ServiceNow, has released StarCoder2, and it will help you generate code. The Start menu has been a staple of Windows for nearly 30 years. Here's how it's evolved in that time. "
}