{
    "title": "Forget AMD in 2024: 2 AI Stocks to Buy Instead",
    "date": "2/3/2024",
    "url": "https://www.fool.com/investing/2024/02/03/forget-amd-in-2024-2-ai-stocks-to-buy-instead/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Shares in Advanced Micro Devices (AMD 0.50%) are up more than 130% year over year, fueled by a stellar growth year for artificial intelligence (AI). The launch of OpenAI's ChatGPT in November 2022 sent countless chip stocks soaring as Wall Street grew bullish over the companies developing the hardware necessary to run and train AI models. With the second-largest market share in graphics processing units (GPUs) and plans to begin shipping a new AI chip this year, AMD has significant potential in the industry over the long term. However, just because a company has a leading position in an industry doesn't necessarily mean it's trading at the right price. AMD's earnings have yet to reflect its heavy investment in the market, which has seen its forward price-to-earnings ratio (P/E) rise 58% since last January to a pricey 45. Meanwhile, its free cash flow has plunged 47% to just over $1 billion in the same period. As a result, shares in AMD are potentially riskier than AI stocks trading at a better value or in better financial standing.  Data by YCharts This chart shows AMD has the second-highest forward P/E among some of the most prominent AI firms, indicating its stock offers far less value than companies like Microsoft (MSFT -0.17%) and Intel (INTC 0.91%). Consequently, it could be worth considering alternative stocks while you wait for AMD's shares to come down to a more attractive price point. So, forget AMD in 2024. Here are two AI stocks to buy instead. Microsoft emerged as one of the biggest threats in AI last year when heavy investment in OpenAI gave it access to some of the start-up's most advanced AI models. The Windows company has used OpenAI's technology to carve out a lucrative role in the industry, introducing AI features across its product lineup. In 2023, Microsoft added new AI tools to its cloud platform Azure, integrated aspects of ChatGPT into its search engine Bing, and boosted productivity in its Office software suite with the help of AI. Meanwhile, the company is taking early steps to monetize its new offerings, launching an AI assistant called Copilot through its Microsoft 365 subscription service. The company describes the assistant as \"your everyday AI companion.\" Some of its generative capabilities include creating a first draft in Word, generating a full PowerPoint presentation based on a simple prompt, and producing data visualizations in seconds in Excel. Copilot has debuted as a $30 per month add-on to a 365 membership, which could lead to significant earnings boosts for Microsoft. Microsoft's AI potential has seen its stock soar 64% year over year, with 8% of that since the start of 2024. Its impressive rise allowed it to overtake Apple's market cap and become the most valuable company in the world. Microsoft has shown no signs of slowing and could be in for a stellar 2024. Moreover, Microsoft hit over $62 billion in free cash flow in 2023, indicating it has the funds to continue investing in AI and stay ahead of the competition. Alongside a significantly lower forward P/E than AMD, Microsoft is a no-brainer to invest in AI this year. Shares in Intel are down nearly 13% since Jan. 25, when it released its fourth quarter of 2023 earnings. The company posted revenue growth of 10% year over year, beating Wall Street estimates by $230 million. During the quarter, Intel enjoyed significant gains from a recovering PC market. However, that wasn't enough to overshadow weak guidance that sent its stock tumbling. Intel expects Q1 2024 earnings to reach $0.13 per share when analysts forecasted $0.42 per share. Meanwhile, the company projects revenue to come in between $12 billion and $13 billion, considerably below the $14 billion that Wall Street expected. A boom in AI has seen a shift in the chip market, with server demand for GPUs soaring as demand for central processing units (CPUs) has faltered. Intel has dominated the CPU market for years, with its weak guidance reflecting this change. The weak guidance demonstrates why keeping a long-term perspective is crucial when investing in tech stocks and budding industries like AI. Intel is heavily investing in the generative technology that could help the company come back strong over the next decade. Last December, Intel unveiled a range of AI chips, including Gaudi3, a GPU designed to challenge similar offerings from Nvidia and AMD. The tech giant also showed off new Core Ultra processors and Xeon server chips, which both include neural processing units for running AI programs more efficiently. The chipmaker's recent challenges make Intel a long-term play. However, its forward P/E of 32 makes it one of the cheapest AI stocks among AMD, Nvidia, and Amazon. The company could offer major gains over the long term as it continues expanding in AI and restructures its business to prioritize GPU production and profit growth. Intel is an exciting option in 2024 and a far better value than AMD. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}