{
    "title": null,
    "date": "2/11/2024",
    "url": "https://www.notebookcheck.net/Ethiopia-becomes-first-country-to-ban-internal-combustion-engines-Only-EVs-allowed.802396.0.html",
    "text": "While in the past less affluent countries have been the dumping ground for second-hand cars from other nations, Ethiopia is now the first country in the world to ban the import of all cars that are not electrically powered. In contrast to the European Union, which has a ban on the sale of cars with internal combustion engines from 2035, Ethiopia is about ten years ahead of schedule: A decision has been made that automobiles cannot enter Ethiopia unless they are electric ones. - Minister Alemu Sime Having spent around $6 billion last year importing fossil fuels, Ethiopia's Ministry of Transport and Logistics has just decided to allow only electric vehicles to enter the country. One of the reasons for this drastic decision, according to Minister Alemu Sime, is the country's lack of access to cheap foreign currency. This makes it difficult to import petrol and diesel due to economic pressures: One of the reasons behind this decision is Ethiopia’s inability to afford importing gasoline due to limited foreign exchange resources. - Alemu Sime according to APA News At the same time, Ethiopia has been a major investor in its energy infrastructure in recent years. For example, Africa's largest hydroelectric power plant is due to be inaugurated soon, having already been partially commissioned on 20 February 2022 with the commissioning of the first two turbines with a total capacity of 750 megawatts. However, full activation of the Grand Ethiopian Renaissance Dam (GERD) is not yet complete. The hydropower plant will not reach its full design capacity of 6,000 megawatts, and experts estimate that the capacity will be around 3,000 megawatts. Nevertheless, by taking advantage of seasonal fluctuations and other energy sources, it can make an important contribution to the country's electricity supply. The next challenges are the improvement of the charging infrastructure and the reliability of the country's electricity supply. It is not yet known exactly when the new regulation will come into force and whether or not it will also apply to second-hand cars. Electrek | Clean Technica | DW | Image: Unsplash / Kaleab "
}