{
    "title": "AMD CPUs and Windows 11 reach their highest user share ever in latest Steam \nsurvey",
    "date": "2/2/2024",
    "url": "https://www.techspot.com/news/101736-amd-cpus-windows-11-reach-their-highest-user.html",
    "text": "In brief: January's Steam Hardware and Software results have arrived. The month after Christmas isn't a popular one for buying graphics cards, but it seems a few people have moved to AMD processors, which have reached their highest user-share ever against Intel. Windows 11, meanwhile, is getting closer to being found on half of all participants' PCs. Despite Intel releasing new 14th-gen chips during CES, Team Blue lost more of its user share to AMD in the Steam survey last month. AMD was up 0.59% to 34.25%, its highest share ever. The company has just launched its Ryzen 8000G series desktop processors, so it'll be interesting to see how that affects things; we weren't very impressed with the Ryzen 7 8700G.  In the graphics card section of Valve's survey, the RTX 3060 continues to hold the top spot despite losing a 0.31% share last month. Nearly all of the top ten saw declines in January. Most of these are older cards, so it could be a result of people upgrading to newer models.  Most popular GPUs among Steam survey participants January certainly illustrated the increasing popularity of gaming laptops. The RTX 4060 laptop GPU was the top performer, up 0.58%, followed by the RTX 3060 laptop GPU (up 0.38%). The RTX 4080 laptop GPU was fifth, while the RTX 4050 laptop GPU was ninth. The RTX 4060 was the best-performing Lovelace desktop card, with the RTX 4060 Ti not far behind. All the RTX 4000-series saw gains, apart from the RTX 4070 (down 0.03%), though it remains the most popular of the desktop series among participants.  January's best-performing GPUs among Steam survey participants Microsoft will be pleased to see that the Steam survey is at least one place where Windows 11 is performing well. The newest version of the OS has reached a record 44.2% user share in the survey as Windows 10 falls another 2% to 51.4%. It looks as if it won't be long before half of all participants are on Windows 11. That's a far cry from the global results: Windows 11's worldwide share is 26.5% compared to Windows 10's 67.4%.  Elsewhere on the survey, 16GB is now the preferred amount of RAM for almost 50% of participants, followed by 32GB (23%) in second. And despite more monitors being released with resolutions above FullHD, 1920 x 1080 is still used by most respondents (59.7%). Second-place 1440p is used by just 16%. Finally, increasing game-install sizes could be why the majority of people have between 100GB and 249GB of free drive space left; most participants' total space is above 1TB. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}