{
    "title": "Jump on these Ryzen deals if you're building a PC",
    "date": "2/12/2024",
    "url": "https://www.pcworld.com/article/2233576/id-jump-on-these-ryzen-x3d-cpu-deals-if-i-was-building-a-gaming-pc.html",
    "text": "When you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence. AMD’s Ryzen X3D series of CPUs, which packs extra V-cache for running high-powered games or other media applications, has been a hot ticket for PC gaming ever since it was introduced. Today, Newegg is offering two of the most popular entries in the series, the Ryzen 7 5800X3D for the AM4 socket with a free motherboard or its next-gen Ryzen 7 7800X3D upgrade for the AM5 at a significant discount. You can get the older processor + mobo for just $319 or the newer one for $364. That’s a discount of $120 and $86 off the retail price, respectively, though street prices for both chips have been running a little lower recently. Note that you’ll need to use the coupon code YPCMDP629 to get an extra $5 off the 7800X3D deal. Despite the less dramatic discount, I’d be a lot more excited for the 7800X3D AM5 chip upgrade, as Newegg’s combo pricing with various X670E motherboards and DDR5 RAM can stack up the savings on a full desktop upgrade. As it happens, I did just that a few weeks ago, upgrading my old Intel i5 9600K to a 7800X3D with a new motherboard and memory. Now I wish I’d waited and saved myself about a hundred bucks with the combo. And AMD has committed to supporting the AM5 socket for at least another couple of CPU cycles, so if you combine it with a motherboard capable of PCIe 5 graphics and storage, you’re in for a long-haul system at a big discount. Get the AMD Ryzen 7 7800X3D CPU for $364 (use coupon code YPCMDP629) Not that that 5800X3D is anything to sneeze at. The AM4 socket and its inexpensive DDR4 memory has been holding strong for an unprecedented seven years, making the 5000-series X3D chips (with a new model released just this month) an amazing value for upgrades on older AMD-based systems. The free included MicroATX motherboard (the MSI B450M-A Pro Max II) is a bit of a wash, as it only supports two DDR4 RAM slots and PCI Express 3.0. I’d save it for a project build or throw it on eBay. Combine the 5800X3D with any recent mid-level or better graphics card, and you can expect to run AAA games with ray tracing at a decent framerate, or completely blow out your monitor’s refresh rate with more conservative graphics. And remember, motherboards with AMD sockets are perfectly capable of using Nvidia-branded graphics cards for a fantastic cross-compatible one-two punch. You can read our review of 5the 5800X3D here. Get the AMD Ryzen 7 5800X3D For $319 with a free motherboard Michael is a former graphic designer who's been building and tweaking desktop computers for longer than he cares to admit. His interests include folk music, football, science fiction, and salsa verde, in no particular order. Business Laptop Mobile PC Hardware Deals Digital Magazine - Subscribe Manage Subscription Gift Subscription Newsletters "
}