{
    "title": "AMD Radeon RX 7900 GRE to launch globally on February 27th at $549",
    "date": "2/25/2024",
    "url": "https://videocardz.com/newz/amd-radeon-rx-7900-gre-to-launch-globally-on-february-27th-at-549",
    "text": "The Golden Rabbit Edition officially launches on February 27th.¬†  AMD RX 7900 GRE will no longer be limited to the Chinese DIY market. The company has decided to bring its cheaper Navi 31-based on model to compete with RTX 4070 on a global market. The new launch date is confirmed through slides that we obtained recently. The RX 7900 GRE is advertised as a capable desktop GPU for high FPS at 2560√ó1440 gaming. It offers Navi 31 XL GPU with 80 Compute Units (5120 Stream Processors) and 16GB GDDR6 memory. AMD is promoting its new card with recently launched HYPR-RX technology, which enables frame generation as well as upscaling technology on a driver level.   Radeon RX 7900 GRE, Source: AMD  Officially, the RX 7900 GRE will target GeForce RTX 4070 non-SUPER, which received a $50 price cut to $549 last month when NVIDIA brought their SUPER variant to the market. The AMD card has more memory and should perform 1% to 32% faster across all listed games, claims the company. On average, it should deliver 14% more FPS per dollar, as both cards are priced at the same level.   GeForce RTX 4070 vs. Radeon RX 7900 GRE, Source: AMD  AMD announced that the GRE SKU will launch at a $100 lower price than what was announced in August. At the time, the model was exclusively available only in China, which is why the card this called GRE (Golden Rabbit Edition celebrating the Chinese Year of the Rabbit). However, the SKU was never limited to China, and it was easily available through system integrators, OEMs, and retailers who were selling those cards individually as well. Now AMD is making a formal launch globally and there are more custom variants coming. We have recently shared the pictures of some of these cards:   Radeon RX 7900 GRE, Source: VideoCardz  The RX 7900 GRE will slide between RX 7900 XT and 7800 XT in the AMD desktop RDNA3 lineup, both models currently retail at $699 and $489 (lowest prices on the US market) respectively. The RX 7900 GRE‚Äôs biggest weakness is limited 260W board power, a known bottleneck that puts it closer to the RX 7800XT despite featuring over 33% more cores. We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright ¬© 2024 ¬∑ VideoCardz.com "
}