{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.wepc.com/cpu/faq/does-the-ryzen-7-7800x3d-have-an-igpu/",
    "text": "Home » CPU » CPU FAQ » Does the Ryzen 7 7800X3D have an iGPU? Does the Ryzen 7 7800X3D have an iGPU? Let's find out WePC is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more An integrated graphics processing unit, or iGPU for short, gives a CPU the ability to render graphics and generate a display in the absence of a discrete graphics card. In this article, we’re answering the question: Does the Ryzen 7 7800X3D have an iGPU? It’s certainly one of the best CPUs for gaming right now, but does it have the luxury of integrated graphics? While an iGPU is not essential because most systems are equipped with discrete graphics cards, it can certainly be nice to have as a backup. Intel in particular has been a proponent of this, so what about AMD? Cores: 8 Thread: 16 Boost speed: 5.0GHz Cache: 96MB TDP: 120W To tell you right off the bat – yes, the Ryzen 7 7800X3D does have an iGPU. All Ryzen 7000 series processors have the same one. Before the release of the 7000 series, only Ryzen processors with a “G” suffix featured an iGPU. Some examples are the Ryzen 5 5600G, the Ryzen 5 3400G, and the Ryzen 3 3200G. Things have now changed. There have been no “G” edition Ryzen 7000 processors released yet, but the current ones all have an iGPU to begin with. All Ryzen 7000 processors, including the upcoming Ryzen 7 7800X3D, feature a 2-core GPU built on AMD’s RDNA 2 graphics architecture. This iGPU has a total of 128 steam processors. Both cores have a base graphics frequency of 400MHz and a maximum frequency of 2.2GHz. Of course, when discussing how powerful a GPU is, you rarely go by specs such as processor count and clock frequency. Performance in realistic use cases is what matters. The RDNA 2 GPU is fair in its processing capabilities and provides you with about the level of performance you would expect from a modern iGPU. Like all other iGPUs before it, it can’t compete with a discrete graphics card in raw performance. Tests conducted on the Ryzen 7000 processors show us that the RDNA 2 iGPU is somewhat weaker than the GT 1030, an entry-level desktop graphics card released in 2017 with a mere 30-watt TDP. The Intel UHD 770, the iGPU powering the 13th generation Core processors, is stronger than RDNA 2 and much closer to matching the GT 1030 in performance. Like most iGPUs, the RDNA 2 is really only serviceable for browsing, office work, watching videos in medium resolutions, and other everyday computer activities. Gaming is possible to some extent, but expect nothing more than a 30FPS experience at 1080p resolution and cut-down settings. The RDNA 2 iGPU can deliver 60FPS in some modern titles at 720p. Of course, playing at 720p on the desktop is hardly any fun. The Vega iGPU included in previous “G’ series processors is stronger than both RDNA 2 and Intel UHD 770. If you’re looking for a decent APU that can game at 1080p with playable framerates, your best bet is the Ryzen 7 5700G, which features the much stronger Vega 8 Graphics. Before you go, we should mention here that some early reports suggested the RDNA 2 iGPU on the Ryzen 7000 X3D processors would offer over twice the performance of 7000X and non-X iGPUs, because of the extra V-cache on the X3D die. However, this is not the case. The 7000X3D iGPU cannot access the extra L3 cache and sees a very unremarkable performance increase over X and non-X. This slight performance increase is only because the V-cache-enhanced CPU cores can extract more performance out of the iGPU. Yes – as per our Ryzen 7000 series iGPU benchmarks, it is possible to play games on this chip’s integrated graphics. Nothing too demanding, but it’s possible. We tested the likes of Grand Theft Auto V on low settings at 1080p, where it managed around 56 FPS. For optimized or competitive titles like Valorant, you can expect to hit triple-digit framerates. Since the Ryzen 7 7800X3D has integrated graphics, you don’t strictly need a discrete graphics card to operate. If you’re simply using your PC for web browsing or lightweight gaming, the iGPU is good enough for this. However, we’d recommend investing in a graphics card if you want much better performance. Jack is a Tech and News Writer who has a vast and proficient knowledge of CPUs, Motherboards, and Computer technology. Trusted Source WePC’s mission is to be the most trusted site in tech. Our editorial content is 100% independent and we put every product we review through a rigorous testing process before telling you exactly what we think. We won’t recommend anything we wouldn’t use ourselves. Read more Intel Arrow Lake CPU release date speculation and latest on 15th Gen Intel 13th gen power consumption – what PSU do you need? What CPU won’t bottleneck the RTX 4090? Ryzen 7 5700X3D release date and specs The Warehouse, Use Space, Paddock St, Manchester M12 6PN WePC is the essential site for serious PC gamers. We offer everything from high end PC custom builds and advice to the latest hardware and component reviews, as well as the latest breaking gaming news. You take your gaming PC seriously. So do we. WePC. ©2024 WePC. All rights reserved. Part of "
}