{
    "title": "5 Crypto Stocks Riding on the Hot Bitcoin Rally This Year",
    "date": "2/16/2024",
    "url": "https://finance.yahoo.com/news/5-crypto-stocks-riding-hot-144400491.html",
    "text": "Bitcoin, the world's largest cryptocurrency, has reclaimed its market cap to more than $1 trillion for the first time in two years. The crypto has surged past $52,000, gaining nearly 25% so far this year on the back of a fresh wave of investors’ interest in tokens.With the digital asset rally, cryptocurrency stocks also surged. We have presented five top-performing stocks that have been leading the rally in the cryptocurrency space this year. These are CleanSpark CLSK, Nvidia NVDA, Advanced Micro Devices AMD, Marathon Digital Holdings MARA and Iris Energy IREN. The launch of Spot Bitcoin ETFs in January has been acting as the major catalyst for the bitcoin surge as it has made it easier for investors to gain exposure to Bitcoin without directly owning the asset, thereby underscoring growth of cryptocurrency in mainstream investment platforms.In a milestone, data from CryptoQuant revealed that spot Bitcoin ETFs have accumulated $10 billion in assets under management (AUM) since their inception on Jan 10 this year, reflecting a strong investor interest. Outflows from the Grayscale Bitcoin Trust (GBTC), which previously dampened market sentiment, have significantly reduced, further fueling the upward trajectory. Notably, spot Bitcoin ETFs are a game changer for cryptocurrency investors.ARK Invest, renowned for its optimistic outlook, envisions Bitcoin as a successor to gold as a secure asset, forecasting continued value growth, driven by its increasing integration into the financial ecosystem. It argues that Bitcoin's resilience to economic uncertainties like inflation and interest rate hikes positions it favorably in the current economic environment.The anticipation of bitcoin's upcoming halving event in April is also influencing the cryptocurrency market. Halving, which reduces the reward for mining new blocks, has historically been seen as a catalyst for bitcoin's price. Moreover, the Lunar New Year holidays are contributing to a generally positive sentiment toward bitcoin, according to Fundstrat Global Advisors. CleanSpark is engaged in the mining of cryptocurrencies. It owns and operates data centers that primarily run on low-carbon power. The stock has gained about 56% this year and has an estimated earnings growth rate of 81.4% for the fiscal year ending September 2024.CLSK currently has a Zacks Rank #2 (Buy) and a Momentum Score of B. You can see the complete list of today’s Zacks #1 (Strong Buy) Rank stocks here.Nvidia is the world leader in visual computing technologies and the inventor of graphic processing unit or GPU. The stock has jumped about 47% this year. It has an estimated growth of 64.4% for the fiscal year ending January 2025.Nvidia has a Zacks Rank #2 and a Growth Score of A at present.Advanced Micro Devices offers the industry’s broadest portfolio of leadership high-performance and adaptive processor technologies. Its products are used for Bitcoin mining and other cryptocurrencies. AMD has also participated in cryptocurrency development. The stock has risen 20% so far this year.AMD currently has an estimated earnings growth rate of 30.9% for this year and a Zacks Rank #3 (Hold).Marathon Digital is a digital asset technology company, which mines cryptocurrencies, with a focus on the blockchain ecosystem and the generation of digital assets. The stock jumped 15% and has an estimated earnings growth rate of 457.4% for this year.Marathon Digital has a Zacks Rank #3 and a Momentum Score of B at present.Iris Energy is a Bitcoin mining company. It builds, owns and operates data center infrastructure with a focus on entry into regions, wherein it can access abundant and/or under-utilized renewable energy to power its operations. The stock has gained 8% so far this year.Iris Energy has an estimated earnings growth rate of 100.3% for the fiscal year ending June 2024. It currently has a Zacks Rank #2 and a Momentum Score of B. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Advanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Marathon Digital Holdings, Inc. (MARA) : Free Stock Analysis Report Cleanspark, Inc. (CLSK) : Free Stock Analysis Report Iris Energy Limited (IREN) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}