{
    "title": "AMD CEO Lisa Su reportedly hits $1 billion net worth on back of AI boom",
    "date": "2/10/2024",
    "url": "https://www.tomshardware.com/tech-industry/semiconductors/amd-ceo-lisa-su-reportedly-hits-dollar1-billion-net-worth-on-back-of-ai-boom",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Well, behind Nvidia's CEO, though. With AMD's stock price crossing the $170 mark, the company's CEO, Lisa Su, has now seen her net worth increase to over $1 billion, according to Forbes. She is now the 26th woman in the U.S. to become a self-made billionaire, largely thanks to her copious holdings of AMD stock. Though AI has made Su pretty rich, she still has quite a ways to go before reaching the net worth of arch-rival CEO Jensen Huang of Nvidia. Su's estimated net worth is $1.1 billion, and about three-fourths of that is made up of shares in AMD that total roughly four million with a total value of approximately $700 million. AMD's stock price has been on a record-breaking streak since January, first hitting a new 52-week high, then beating the previous record of $164.46 in November 2021, and finally peaking at $184.92 to then settle in at just above $170 in the past couple of weeks. Since Su has sold about $400 million of AMD stock since 2016, her net worth is (at minimum) $1.1 billion. That over a billion dollars worth of AMD stock has passed through Su's hands is notable, especially now that it is so valuable. As AMD's CEO, Su is paid in hard cash and stock, which isn't unusual except for the part where Su's billion-dollar fortune is almost entirely propped up by AMD stock. She owns and has owned millions upon millions of shares. However, Su's circumstances are unique; she became AMD's CEO in 2014 when the company was rumored to be nearly bankrupt. She was paid a lower salary than outgoing CEO Rory Read, and to make up for it, she was paid in stock, which hovered around $2 to $4 before 2016. Su was paid so much in stock in her first year as CEO that AMD paid her too much according to stock awarding rules, resulting in an award of 1.76 million shares being canceled. Since her pay was and still is primarily tied to the performance of AMD's stock, Su has been strongly incentivized to make the stock price go up. She turned the company around essentially thanks to the Zen CPU architecture, which has resulted in record CPU revenue and market share for AMD. AMD's market capitalization surpassed Intel's for the first time after the acquisition of Xilinx, which provides the technology crucial for AMD's AI ambitions. Of course, Su is probably worth considerably more than just $1.1 billion; it's hard to imagine that her $400 million from selling AMD stock is just sitting around. The CEO likely has other investments and assets that buoy her net worth, and she has been on the board of companies like Cisco during her time at AMD. It's unclear when Su became a billionaire, but she certainly is one at this point, at least because of her AMD holdings. Though being a billionaire is pretty great, being a multi-billionaire is even better, which is the situation in which Nvidia CEO Jensen Huang finds himself. He was worth a little over $40 billion in November of last year, and that has since ramped to over $60 billion today. Like Su, Huang also owns lots of shares of the company he's in charge of. Huang's much higher net worth is likely due to his tenure at Nvidia stretching back to its founding, the company's much more prosperous position in 2014, and the stock price's meteoric rise, especially since 2023. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Matthew Connatser is a freelancing writer for Tom's Hardware US. He writes articles about CPUs, GPUs, SSDs, and computers in general. TSMC is on a hiring spree to recruit 23,000 employees  — comes amid explosive multi-continent expansion China's president says it doesn't need ASML — tells Dutch PM it will continue with advanced technological progress regardless EVGA replaces customer's destroyed hard drives after power supply RMA blunder By Anton ShilovMarch 29, 2024 By Aaron KlotzMarch 29, 2024 By Christopher HarperMarch 29, 2024 By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Ash HillMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}