{
    "title": "AMD Radeon RX 7900 GRE spotted in UK, could be coming to the US",
    "date": "2/19/2024",
    "url": "https://www.pcgamesn.com/amd/radeon-rx-7900-gre-release",
    "text": "Sat between the Radeon RX 7900 XT and RX 7800 XT for performance, the RX 7900 GRE takes the RTX 4070 Super head on. Edward Chester Published: Feb 19, 2024 A few months ago, AMD introduced the AMD Radeon RX 7900 GRE (Golden Rabbit Edition) as a China-exclusive GPU that also then found its way to system integrators in a few regions too. However, the likes of the US and UK have resolutely not had access to the card, until now. The AMD Radeon RX 7900 GRE recently appeared for sale as an individual card on UK retailer AWD-it. The company mostly makes gaming PCs and laptops but also sells components too, and the GRE was briefly available to buy there for £659.99 inc VAT, which is around $832 after tax. That doesn’t immediately make the 7900 GRE standout as a best graphics card contender, when compared to prices for the RX 7800 and RX 7900 XT, but there is potential for this to be a card that would suit some buyers. The AMD Radeon RX 7900 GRE specs are intriguing as the GPU has significantly more compute units than the RX 7800 XT, at 80 CUs compared to 60CUs. That’s also just 4 CUs fewer than the RX 7900 XT. However, it has only the same VRAM configuration as the RX 7800 XT and is limited to an even lower total board power or 260W compared to 263W for the RX 7800 XT and 315W for the RX 7900 XT. That all boils down to the RX 7900 GRE sitting somewhere between those two existing GPUs when it comes to overall performance, with reviews of the card noting that it’s around 5% faster than the RX 7800 XT and around 19% slower than the RX 7900 XT. Meanwhile, it stacks up at around the same performance as the Nvidia RTX 3080 and AMD Radeon RX 6800 XT from last generation and is similar in performance to the current RTX 4070 Super. Notably, the card is reasonably power efficient, consuming roughly 70W less than the RX 7900 XT and only 40W more than the RTX 4070. Ultimately, until we’ve tested the card for ourselves, we can’t fully summarise its benefits or downsides, but it’s a card that would appear to have a lot of potential, if available for the right price. That briefly-available UK price (discovered by TechPowerUp) isn’t super competitive, but if the card becomes more widely available and matches up with the general trend of recent GPU price drops, it could be one to watch. In the mean time, our current recommendations for the best graphics card in this general price range are the RTX 4070 Super and Radeon RX 7800 XT. Both will make for a ideal additions if you’re looking to build a gaming PC right now. Edward Chester                 Edward Chester writes hardware reviews and news for PCGamesN. He has reviewed every bit of PC gaming hardware you can think of, and many you probably can't, during his 16 years in the industry. He has been a PC gamer since the mid-90s and still just about manages to find time to indulge in his decades-long passion. Away from playing Apex Legends, Counter-Strike, or Quake, he's an avid cook, musician, gardener, and woodworker. "
}