{
    "title": null,
    "date": "3/17/2024",
    "url": "https://www.defenseworld.net/2024/03/17/pure-financial-advisors-llc-acquires-212-shares-of-advanced-micro-devices-inc-nasdaqamd.html",
    "text": "Posted by Defense World Staff on Mar 17th, 2024 Pure Financial Advisors LLC lifted its position in shares of  Advanced Micro Devices, Inc. (NASDAQ:AMD – Free Report) by 9.2% during the fourth quarter, according to its most recent disclosure with the Securities and Exchange Commission (SEC). The institutional investor  owned 2,523 shares of the semiconductor manufacturer’s stock after purchasing an additional 212 shares during the period. Pure Financial Advisors LLC’s holdings in Advanced Micro Devices were worth $372,000 at the end of the most recent quarter. A number of other large investors also recently made changes to their positions in the company. Left Brain Wealth Management LLC lifted its position in shares of  Advanced Micro Devices by 1.2% during the third quarter. Left Brain Wealth Management LLC now owns 7,501 shares of the semiconductor manufacturer’s stock valued at $771,000 after purchasing an additional 90 shares in the last quarter.  Castleview Partners LLC lifted its position in shares of  Advanced Micro Devices by 62.5% during the second quarter. Castleview Partners LLC now owns 234 shares of the semiconductor manufacturer’s stock valued at $27,000 after purchasing an additional 90 shares in the last quarter.  Insight Advisors LLC PA lifted its position in shares of  Advanced Micro Devices by 0.5% during the third quarter. Insight Advisors LLC PA now owns 17,563 shares of the semiconductor manufacturer’s stock valued at $1,806,000 after purchasing an additional 94 shares in the last quarter.  CVA Family Office LLC lifted its position in shares of  Advanced Micro Devices by 3.9% during the third quarter. CVA Family Office LLC now owns 2,582 shares of the semiconductor manufacturer’s stock valued at $265,000 after purchasing an additional 98 shares in the last quarter.  Finally, ZRC Wealth Management LLC lifted its position in shares of  Advanced Micro Devices by 16.8% during the third quarter. ZRC Wealth Management LLC now owns 694 shares of the semiconductor manufacturer’s stock valued at $71,000 after purchasing an additional 100 shares in the last quarter. 68.43% of the stock is owned by institutional investors. Several analysts have commented on AMD shares. Citigroup lifted their price objective on shares of Advanced Micro Devices from $136.00 to $192.00 and gave the stock a “buy” rating in a research report on Wednesday, January 31st. StockNews.com raised shares of Advanced Micro Devices from a “sell” rating to a “hold” rating in a research report on Thursday, February 29th. Wells Fargo & Company lifted their price objective on shares of Advanced Micro Devices from $165.00 to $190.00 and gave the stock an “overweight” rating in a research report on Wednesday, January 31st. JPMorgan Chase & Co. lifted their price objective on shares of Advanced Micro Devices from $115.00 to $180.00 and gave the stock a “neutral” rating in a research report on Wednesday, January 31st. Finally, Wedbush  reaffirmed an “outperform” rating and issued a $200.00 price objective on shares of Advanced Micro Devices in a research report on Wednesday, January 31st. Four investment analysts have rated the stock with a hold rating and twenty-five have issued  a buy rating to the company’s stock. Based on data from MarketBeat, the stock currently has a consensus rating of “Moderate Buy” and an average price target of $181.82. Check Out Our Latest Research Report on Advanced Micro Devices AMD stock opened at $191.06 on Friday. The company has a debt-to-equity ratio of 0.03, a current ratio of 2.51 and a quick ratio of 1.86. Advanced Micro Devices, Inc. has a one year low of $81.02 and a one year high of $227.30. The stock has a market cap of $305.70 billion, a PE ratio of 367.42, a P/E/G ratio of 2.93 and a beta of 1.66. The firm has a 50 day simple moving average of $176.17 and a two-hundred day simple moving average of $136.89. Advanced Micro Devices (NASDAQ:AMD – Get Free Report) last released its quarterly earnings results on Tuesday, January 30th. The semiconductor manufacturer reported $0.77 EPS for the quarter, hitting analysts’ consensus estimates of $0.77. Advanced Micro Devices had a net margin of 3.77% and a return on equity of 5.73%. The business had revenue of $6.17 billion during the quarter, compared to analysts’ expectations of $6.13 billion. During the same quarter in the previous year, the company earned $0.54 EPS. The business’s quarterly revenue was up 10.2% compared to the same quarter last year.  On average, analysts predict that  Advanced Micro Devices, Inc. will post 2.67 EPS for the current fiscal year. In other news, CAO Darla M. Smith sold 1,678 shares of the company’s stock in a transaction on Thursday, February 29th. The shares were sold at an average price of $188.66, for a total value of $316,571.48. Following the completion of the sale, the chief accounting officer now owns 4,209 shares of the company’s stock, valued at approximately $794,069.94. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through the SEC website. In other Advanced Micro Devices news, insider Victor Peng sold 100,000 shares of the stock in a transaction on Friday, February 2nd. The shares were sold at an average price of $175.11, for a total transaction of $17,511,000.00. Following the completion of the sale, the insider now owns 241,266 shares of the company’s stock, valued at approximately $42,248,089.26. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available at this link. Also, CAO Darla M. Smith sold 1,678 shares of the stock in a transaction on Thursday, February 29th. The shares were sold at an average price of $188.66, for a total transaction of $316,571.48. Following the sale, the chief accounting officer now directly owns 4,209 shares of the company’s stock, valued at approximately $794,069.94. The disclosure for this sale can be found here. In the last 90 days, insiders sold 308,743 shares of company stock valued at $56,894,968. Corporate insiders own  0.73% of the company’s stock. (Free Report) Advanced Micro Devices, Inc operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products.  Want to see what other hedge funds are holding AMD? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Advanced Micro Devices, Inc. (NASDAQ:AMD – Free Report).   Receive News & Ratings for Advanced Micro Devices Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Advanced Micro Devices and related companies with MarketBeat.com's FREE daily email newsletter. Baldwin Brothers LLC MA Has $35,000 Position in Exact Sciences Co. (NASDAQ:EXAS) Vanguard Information Technology ETF (NYSEARCA:VGT) Shares Bought by Pure Financial Advisors LLC "
}