{
    "title": "Arrow Lake could offer huge performance gains, but AMD's Zen 5 might still \ndefeat Intel's mighty next-gen CPUs",
    "date": "3/9/2024",
    "url": "https://www.techradar.com/computing/cpu/arrow-lake-could-offer-huge-performance-gains-but-amds-zen-5-might-still-defeat-intels-mighty-next-gen-cpus",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Intel should win for raw performance, at least initially – but there’s more to consider here We’ve been hearing more about Intel’s Arrow Lake processors – and Lunar Lake – from leaker Moore’s Law is Dead, and while there are a lot of positives to take from all this, don’t get carried away with the notion that Team Blue is going to romp home with an easy win against AMD in the battle of the next-gen CPUs. According to one of the YouTuber’s top Intel sources, Arrow Lake is set to be a 25% to 35% performance boost over Meteor Lake, as MLID has been saying for some time now – and that’s a minimum (so it could turn out better – we recall one leak suggesting 40%, though that was a good way back now). This is comparing chips with the same core count, and on top of that, Arrow Lake won’t have hyper-threading (as has been widely rumored for some time), so this is even more impressive in that respect. In short, Arrow Lake is going to be a huge generational leap, and one that will best Zen 5 for raw CPU performance. (AMD’s next-gen Ryzen processors are thought to be more in the order of a 20% gen-on-gen uplift, maybe slightly less even – be cautious around all these rumored figures, as ever). Where Arrow Lake might disappoint is on the AI front, with the NPU (Neural Processing Unit) not being much of a step on from what we have with Meteor Lake already. Where Intel will push forward accelerating AI much more meaningfully is with Lunar Lake, its chips aimed at premium thin-and-light laptops, where the NPU is expected to achieve 40+ TOPS (a measure of AI performance). In contrast, Arrow Lake is thought to hit more like around 13 TOPS. MLID believes that Arrow Lake desktop CPUs (to succeed Raptor Lake Refresh) are still on course for a late 2024 launch, again as rumored for a long time now – but the catch is the YouTuber suggests that this could be a paper launch. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. In other words, real production volume and lots of stock on shelves may not happen until early 2025 – which is when Arrow Lake laptop CPUs will launch to take the baton from Meteor Lake.  Meanwhile Lunar Lake, for notebooks only as mentioned, is going to be out in Q4 2024, and that’s a firmer prospect now, we’re told. MLID also spills some details on the integrated graphics for both families of processors, and they’ll use (up to) 8 Xe Cores in both cases. However, the crucial difference is that Arrow Lake will be Alchemist+, and Lunar Lake will be Battlemage. Arrow Lake will still offer a good deal more performance than Meteor Lake with integrated graphics, but Lunar Lake has the advantage here, of course, in theory using that 2nd-gen architecture from Intel. Lunar Lake will also be faster than Meteor Lake’s integrated graphics, but crucially, will look to cut power usage in half as well, majoring in efficiency rather than driving all-out for performance. Do note, though, that there are Lunar Lake designs that unleash higher power usages for a big performance gain for integrated graphics, but MLID seems skeptical that these will see the light of day. The focus is very much on power-efficiency here, and beefier mobile chips will come elsewhere (like Arrow Lake, or so previous speculation has suggested – though it’ll have low-power chips too, or that’s the theory). The likelihood is that we’ll see both Arrow Lake desktop and Lunar Lake before this year is out, at roughly the same time, late in 2024, in Q4. The key question for those looking at a next-gen CPU is – will Zen 5 be out first, and obviously how might these rival ranges stack up? More recent word from the grapevine has suggested that AMD’s Zen 5 desktop chips might arrive in Q4 (also Team Red itself has confirmed a launch for this year). So, we could see all these families of processors land at around the same time, in Q4. However, MLID also touches on the potential release date for Zen 5 here, and floats a Q3 timeframe (across multiple arenas, not just desktop CPUs). What does all this mean? Well, while Arrow Lake could be a much bigger leap for performance (35% versus 15-20%, so perhaps double the gains AMD provides), Zen 5 might be first to market by a clear couple of months. Zen 5 may also (apply seasoning) be a fair bit cheaper, as Arrow Lake is built on a more advanced (and expensive) process (3nm, versus 4nm for AMD). And if Intel can’t get the power usage side, and efficiency, a lot better tamed than with Raptor Lake Refresh, Zen 5 could be a winner there, too. MLID also points out that while Arrow Lake is expected to be in pole position for overall raw performance at launch, AMD will soon have X3D spins for Zen 5 desktop processors on the case – and these will level out any advantage that Team Blue has. All of this is in theory, of course, but the upshot is Intel may have something special with Arrow Lake, as has been rumored all along – but AMD may not be overly worried thanks to what it has as a next-gen reply to Team Blue’s inbound CPUs. As a final note on Lunar Lake, with Battlemage graphics providing faster frame rates than Meteor Lake, at a lot less power, this could be a fantastic chip for the increasingly popular gaming handhelds (the just-launched MSI Claw uses a Meteor Lake processor, remember). Assuming Intel can get the drivers for Battlemage right, and therein lies the rub – if finalizing the 2nd-gen Arc GPUs takes longer than thought (another recent suggestion), this might delay Lunar Lake to 2025. Darren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013). AMD could release faster versions of last-gen Ryzen CPUs that are perfect for budget builds and upgrades An excellent AMD budget gaming CPU is now on sale for less than $200 at Walmart Samsung archrival plans construction of world's largest chip factory — at more than $90 billion, it will take more than 20 years to finish, so one wonders what other exciting tech will it produce By Sead FadilpašićMarch 29, 2024 By Al GriffinMarch 29, 2024 By Cesar CadenasMarch 29, 2024 By Alex WhitelockMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}