{
    "title": "AMD Will Switch to AI-Powered Upscaling for Gaming in 2024: Exec",
    "date": "3/4/2024",
    "url": "https://www.extremetech.com/gaming/amd-will-switch-to-ai-powered-upscaling-for-gaming-in-2024-exec",
    "text": "The current upscaling landscape includes Nvidia, AMD, and Intel, each with its own solution: DLSS, FSR, and XeSS, respectively. Although Nvidia and Intel use dedicated \"AI\" hardware in their GPUs to provide upscaling, AMD has notably taken a different approach with FSR, as it doesn't require specific hardware like Nvidia's Tensor Cores. The benefit to AMD customers is that FSR works on older GPUs and more games because it doesn't need custom code. However, AMD is now looking to change that, according to the company's CTO, as he says the company will finally join its rivals with an AI-based approach to upscaling. AMD CTO Mark Papermaster recently held an interview where he was asked what the company is focusing on in 2024. To the surprise of nobody, he said the company is laser-targeting two letters: AI. Papermaster says the company has spent a lot of time recently laying the groundwork for the addition of AI to its entire portfolio of products and has now completed the process. In the future, Papermaster said, \"We are enabling our gaming devices to upscale using AI, and 2024 is really a huge deployment year for us.\" He elaborated that AMD is currently not associated with AI in the same way as its competitor (Nvidia), so it wants to change that perception. Papermaster says that AMD wants people to know that it, too, can deliver AI (like Nvidia) and can deliver it across its entire suite of products. That includes a top-to-bottom approach from Edge to data center to PC, he said. Since Nvidia is getting all the attention right now with its H100 products, which were used to train ChatGPT, AMD also wants to be known for training large language models for generative AI with its MI300 Instinct accelerators, as well as using AI in its client products as well. In other words, our translation is AMD wants the halo effect Nvidia has in the AI hardware world, where it's seen as the undisputed leader. In 2024, Papermaster wants people to see AMD's hardware and software offerings as rivaling Nvidia's. Regarding when we might see AMD's AI upscaling arrive, it certainly sounds like it would launch with RDNA 4, due this year. However, previous reports suggested that AMD was not planning to challenge Nvidia on the high-end for its next architecture, opting instead for only midrange GPUs as it did with Polaris. As Videocardz notes, it's also possible this technology might not apply to its existing FSR upscaling, so it could be something new that is only available on a new GPU due to dedicated hardware. That would surely piss off a lot of AMD GPU owners, as it would be copying Nvidia's approach where older GPUs don't support the company's latest technologies like DLSS 3 and frame generation. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}