{
    "title": "3 Semiconductor Stocks to Buy Now (That Aren't Nvidia or AMD)",
    "date": "3/10/2024",
    "url": "https://investorplace.com/2024/03/3-semiconductor-stocks-to-buy-now-that-arent-nvidia-or-amd/",
    "text": " Avoid the crowd for the real opportunities Advertisement Source: Shutterstock When it comes to semiconductor stocks to buy, the mind immediately goes to Nvidia (NASDAQ:NVDA) or Advanced Micro Devices (NASDAQ:AMD). At this point, it almost seems like they’re printing money. Still, with the greed machine in full swing, it may be time to consider less-crowded ideas. Don’t get me wrong – Nvidia and AMD are both stellar enterprises. I use their products on a daily basis and you probably do as well. However, there’s a certain point when valuations get excessive. Since these enterprises aren’t exactly known for their robust passive income, investors are paying through the nose for the underlying growth narrative. Nevertheless, at some point, all companies fail to meet ever-rising expectations. That’s why you may want to consider these less-appreciated semiconductor stocks to buy. They’re not generating headlines but they could spark surprising profitability. As a specialist in photomask manufacturing, Photronics (NASDAQ:PLAB) is one of the most important semiconductor stocks to buy. It just doesn’t seem like it. However, under the hood, photomasks are critical because they serve as templates for transferring complex circuit patterns onto silicon wafers during the fabrication process. Stated differently, the final performance of the semiconductors depends on photomask accuracy and precision. Over the past year, PLAB stock gained over 73% so it’s obvious that it carries much interest. However, since the start of this year, shares slipped 3%. I think this is a temporary blip, a digestion of last year’s strong rise. After all, analysts project slow-and-steady growth in the next two years. By the end of this fiscal year, experts anticipate revenue to land at $932.3 million, up 4.5% from last year. And in 2025, projected sales is $1 billion, up 7.3% against 2024’s forecasted top line. As a bonus, PLAB stock appears undervalued, trading at only 13X trailing-year earnings. That’s below the sector median stat of 29.52X. A fabless semiconductor firm, Himax Technologies (NASDAQ:HIMX) designs and manufactures chips for various applications. These include display drivers, touch controllers, CMOS image sensors and timing controllers used in consumer electronics and display devices. Himax enjoys wide integration, its chips being utilized in smartphones, tablets and televisions among other devices. Stated differently, unless you anticipate an obsolescence of the consumer technology industry, HIMX likely represents one of the top semiconductor stocks to buy. Enticingly, HIMX is undervalued. Right now, shares trade at 19.55X trailing-year earnings, below the sector median 29.52X. Also, its price-to-sales (PS) ratio sits at 1.04X. To be fair, analysts anticipate slowing growth on average for this fiscal year, with a target of $901.25 million. If so, that would imply almost 5% downside from last year. However, it’s also true that the most optimistic expert sees sales of $964 million. If so, we could get revenue expansion instead. Robert W. Baird calls for HIMX to hit $7, which implies more than 19% upside. A prior assessment by Credit Suisse called for an $8 target. A semiconductor engineering and fabrication foundtry, SkyWater Technology (NASDAQ:SKYT) provides manufacturing services for integrated circuits (ICs) on a contract basis, serving a wide range of customers across different industries. The company specializes in the fabrication of custom-designed semiconductor chips, including analog, mixed signal and radio frequency (RF). As an important “background” player in the broader tech ecosystem, the enterprise has garnered attention from those in the know. Since the start of this year, SKYT stock returned more than 36%. In the past five sessions, it’s up 6%, suggesting that the positive momentum is far from over. At the end of the current fiscal year, SkyWater may print revenue of $322.33 million. If so, that would be up 12.4% against last year’s haul of $286.68 million. In 2025, the company’s revenue is expected to reach $350.73 million, up nearly 9% against 2024’s projected top line. Finally, analysts view SKYT as a unanimous strong buy with an average price target of $15. That implies 23% upside, making SkyWater one of the semiconductor stocks to buy. On the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. A former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia. Semiconductor, Technology Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/3-semiconductor-stocks-to-buy-now-that-arent-nvidia-or-amd/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}