{
    "title": "Intel and AMD processors have been banned from China » YugaTech | \nPhilippines Tech News & Reviews",
    "date": "3/25/2024",
    "url": "https://www.yugatech.com/news/intel-and-amd-processors-have-been-banned-from-china/",
    "text": " Smartphone Price List Philippines 2024 Written by  Duane VillanuevaPublished • March 26, 2024 China has banned Intel and AMD processors from China amid new guidelines to favor ‘domestic solutions’ for technology.  The new rules prevent usage of Western-made processors in China’s government computers and servers. Microsoft Windows is also banned with other foreign databases, with China favoring domestic solutions. The new guidelines were introduced in December last year, and have been quietly implemented. Government agencies are now mandating ‘safe and reliable’ domestic replacements. A list was released which approves 18 processors, inclusive of chips from Huawei and Phytium. It should be noted that both of these companies are currently banned in the US. Intel and AMD shares recently fell following the news of the new guidelines. Intel was down 2.9%, and AMD fell less than 1%  China accounted for 27% of Intel’s sales in 2023, as 15% also made up AMD’s revenue for the year. This has to be China’s most aggressive move in terms of US technology restriction. However, China wasn’t the first to pull the trigger. The US has banned a number of Chinese companies as well, ranging from chip manufacturers to aerospace firms. The Biden Administration also banned US companies such as NVIDIA from selling their AI models and chips to China. Meanwhile, Chinese companies like Baidu, Huawei, and OPPO have already begun designing semiconductors. This suggests that the country’s preparing for a future where they can’t import from other countries. Enter your email address to subscribe to this blog and receive notifications of new posts by email. Email Address Subscribe Article Under:amd Baidu China Huawei intel Microsoft microsoft windows nvidia oppo phytium windows Your email address will not be published. Required fields are marked * Comment * Name * Email * Notify me of new posts by email.   Δ Nothing Phone (2a) Review vivo V30 Pro 5G Review vivo V30 5G Review ASUS Zenbook Duo 2024 (UX8406) Review Samsung Galaxy A55 5G Review: Still a Bestseller? Watch: Philippines Colleges, Universities offering Game Development Courses Watch: Top Gaming Websites you need to try! Qualcomm Snapdragon vs MediaTek Dimensity in 2024: What’s Your Pick? 33 List of Smartphones, Tablets, Laptops and Gadgets Launched in the Philippines (February 2024) TVs: QLED vs OLED vs mini-LED Compared YugaTech.com is the largest and longest-running technology site in the Philippines. Originally established in October 2002, the site has been transformed into a full-fledged technology site in 2005. How to Transfer, Withdraw Money from PayPal to GCash\nPrices of Starlink Satellite in the Philippines\nInstall Google GBox to Huawei Smartphones\nPAG-IBIG MP2 Online Application\nHow to Check PhilHealth Contributions Online\nHow to find your SIM Card Serial Number\nHow to Check BIR TIN Online\nGlobe, PLDT, Converge, SKY: Unli Fiber Internet Plans Compared\n10 Biggest Games in the Google Play Store\nLTO Periodic Medical Exam for 10 Year Licenses\nNetflix Codes to Unlock Hidden TV Shows, Movies\nBest Selling Phones of All Time\nNew Metro Manila Telephone Prefix Numbers Apple, Asus, Cherry Mobile, Huawei, LG, Nokia, OPPO, Samsung, Sony, vivo, Xiaomi, Lenovo, Sony, Infinix Mobile, Pocophone, Honor, iPhone, OnePlus, TECNO, realme, HTC, Gionee, Kata, Iqoo, Redmi, Razer, Cloudfone, Motorola, Panasonic, TCL,wiko Best Android Smartphones between PHP 20,000 – 25,000\nSmartphones under Php 10,000 in the Philippines\nSmartphones under Php 12K Philippines\nBest Smartphones for Kids under PHP 7,000 \nSmartphones under Php 15,000 in the Philippines\nBest Android Smartphones between PHP 15,000 – 20,000\nSmartphones under Php 20,000 in the Philippines\nMost affordable 5G phones in the Philippines under Php 20k\n5G Smartphones in the Philippines Under PHP 16K\nCheap Phones under PHP 1,000 in the Philippines\nBudget Phones under Php 2,000 in the Philippines Laptops under PHP 25K in the Philippines\nTop 10 Laptops under Php 50,000\nLaptops you can buy under PHP 60K\nTop 10 Laptops under 40K in the Philippines\nTop 10 Gaming Laptops under Php30,000\nBudget Laptops under Php25,000\nTop 10 Laptops under PHP 50K in the Philippines\nTop 10 Laptops under Php30,000\nTop 10 Laptops under Php 40,000 (40K) in the Philippines YugaTech Smartphone and Tablet Database\nSmartphones and Tablets of 2023\nSmartphones and Tablets of 2022\nSmartphones and Tablets of 2021\nSmartphones and Tablets of 2020\nSmartphones and Tablets of 2019\nSmartphones and Tablets of 2018 Add email address to subscribe to this site and receive notifications of new posts by email. Email Address Subscribe YugaTech | Philippines Tech News & Reviews  © 2024. All Rights Reserved. "
}