{
    "title": null,
    "date": "3/1/2024",
    "url": "https://www.tradingview.com/news/investorplace:c30b429bd094b:0-amd-stock-alert-why-advanced-micro-devices-just-hit-a-new-record-high/",
    "text": "Advanced Micro Devices AMD stock is rising higher on Friday as shares of the semiconductor company continue to rise alongside artificial intelligence (AI) related names. This latest surge in price has resulted in AMD stock reaching a market valuation of $300 billion. That’s a new record for the company and is furthering investor interest in Advanced Micro Devices. Stocks are also getting a boost on Friday from the latest personal consumption expenditures (PCE) price index. This showed inflation increased by 0.4% for January and 2.8% year-over-year (YOY). This matches what Wall Street was expecting for the period. It’s also worth mentioning that Nvidia NVDA has seen gains recently alongside other AI stocks. Considering it and AMD are both in the semiconductor space, it makes sense that the shares would rise in tandem with each other. AMD Stock Movement on Friday AMD shares are seeing a decent amount of trading on Friday morning with roughly 50 million units on the move as of this writing. To put that number in perspective, AMD stock’s daily average trading volume is still higher at 74.5 million shares. AMD stock is up 3.3% as of Friday morning and NVDA shares are up 3.2% at that same time. Investors who want to learn even more about the biggest stock market stories today will want to stick around! We are offering up insight into all of the hottest stock market news that traders need to know about on Friday! A few examples include why BioVie BIVI stock is rocketing higher, Xpeng XPEV reporting electric vehicle (EV) deliveries for February and the CEO of New York Community Bancorp NYCB departing. You can find out even more about these stories by checking out the links below! On the date of publication, William White did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @dehandreh @yo44ge4real @stvmcg @Arcanebear.eth @retirewithforex @sethsickness @aliams_david_trading_gram @mytradingsetup @fx_bitcoin_expert11 @tradingfrance @mytradingsetup @jordan_fx_ @nav.fx @itzi71 @laptopmoneygang @heinrich_j96 @johndollery @aggressivecalculator Whatever the trade "
}