{
    "title": "AMD E1-7010 vs Intel Core i5-1030G7 vs Intel Core i3-1000G1",
    "date": "3/21/2024",
    "url": "https://www.notebookcheck.net/E1-7010-vs-i5-1030G7-vs-i3-1000G1_6866_11448_11452.247596.0.html",
    "text": "The AMD E1-7010 is a mobile quad-core SoC (codenamed \"Carrizo-L\") for entry-level devices and subnotebooks, which has been presented in May 2015. In addition to 2 CPU cores clocked at up to 1.5 GHz (boost clock), the 28 nanometer chip also integrates a Radeon GPU, a single-channel DDR3L-1333 memory controller and the southbridge with various I/O-ports. \nThe predecessor AMD E1-6010 features similar specifications except the slower clock speed (at least boost, as the 6010 clocks at 1.35 GHz without boost), and the new FP4 package (compatible to the mainstream Carrizo SoCs). The faster Carrizo-L SoCs (like the E2-7110) offer 4 CPU cores and a configurable TDP.\nArchitecture\nCarrizo-L, Beema (for notebooks) and Mullins (for tablets and compact subnotebooks, same die) are based on AMD's Puma+ architecture, which is the successor to the previous Jaguar design (Kabini and Temash APUs). Neither the performance per clock nor the feature set (including SSE up to 4.2, AVX and AES) have been modified. However, AMD managed to reduce the leakage current, enabling significantly higher (boost) clock speeds. This leads to a more responsive system and better overall performance. As its predecessor, the chip is manufactured in 28 nm.\nPerformance\nDue to the higher core frequency, the 7010 should be faster than the old E1-6010. Still, the SoC is only suited for very basic tasks like web surfing (not many tabs), word processing and video playback.\nGraphics\nThe integrated Radeon should be similar to the Beema based Radeon R2 GPU with 128 shaders. Only a few current games (as of 2014) are thus playable in low settings (see above link for gaming benchmarks). Some games may also be limited by the 2 cores at low frequency.\nPower Consumption\nThe power consumption of the entire SoC is rated at 10 watts. Thus, the APU is also suitable for small subnotebooks and can be used without an active fan. The AMD E1-7010 is a mobile quad-core SoC (codenamed \"Carrizo-L\") for entry-level devices and subnotebooks, which has been presented in May 2015. In addition to 2 CPU cores clocked at up to 1.5 GHz (boost clock), the 28 nanometer chip also integrates a Radeon GPU, a single-channel DDR3L-1333 memory controller and the southbridge with various I/O-ports. The predecessor AMD E1-6010 features similar specifications except the slower clock speed (at least boost, as the 6010 clocks at 1.35 GHz without boost), and the new FP4 package (compatible to the mainstream Carrizo SoCs). The faster Carrizo-L SoCs (like the E2-7110) offer 4 CPU cores and a configurable TDP. Architecture Carrizo-L, Beema (for notebooks) and Mullins (for tablets and compact subnotebooks, same die) are based on AMD's Puma+ architecture, which is the successor to the previous Jaguar design (Kabini and Temash APUs). Neither the performance per clock nor the feature set (including SSE up to 4.2, AVX and AES) have been modified. However, AMD managed to reduce the leakage current, enabling significantly higher (boost) clock speeds. This leads to a more responsive system and better overall performance. As its predecessor, the chip is manufactured in 28 nm. Performance Due to the higher core frequency, the 7010 should be faster than the old E1-6010. Still, the SoC is only suited for very basic tasks like web surfing (not many tabs), word processing and video playback. Graphics The integrated Radeon should be similar to the Beema based Radeon R2 GPU with 128 shaders. Only a few current games (as of 2014) are thus playable in low settings (see above link for gaming benchmarks). Some games may also be limited by the 2 cores at low frequency. Power Consumption The power consumption of the entire SoC is rated at 10 watts. Thus, the APU is also suitable for small subnotebooks and can be used without an active fan. The Intel Core i5-1030G7 is a power efficient quad-core SoC for laptops and Ultrabooks based on the Ice -Lake-Y generation that was announced in Mai 2019 (Computex). It integrates four Sunnycove processor cores (8 threads thanks to HyperThreading) clocked at 0.8 (base) - 3.8 (single core Turbo) GHz. All four cores can turbo up to 3.2 GHz using Turbo Boost. According to Intel the Sunnycove cores achieve 18% more IPCs (Instructions per Clock). \nThe biggest improvement for Ice-Lake is the integrated Gen 11 graphics card called Iris Plus Graphics. The Core i5-1030G7 integrates the biggest G7 variant with 64 CUs clocked at 300 - 1050 MHz. The Iris Plus G7 should be twice as fast as the predecessors and best the AMD Vega 10 GPU in current Ryzen APUs. However, in the Y-series the gaming performance will be again depending on the cooling solution and may degrade clearly over time (compared to the Core i7-1065G7 with 15 - 25 Watt e.g.).\nOther improvements for Ice Lake are the AI hardware acceleration and the partial integration of Thunderbolt and WiFi 6 in the chip. The integrated DDR4 memory controller supports modules with up to 3200 MHz (and LPDDDR4 3733).\nPerformance \nWhile we have not tested a single system built around the 1030G7 as of August 2023, it's safe to expect the chip to be about half as fast as the Core i5-1035G7, as far as multi-thread performance is concerned. Which is fairly poor as of mid 2023.\nYour mileage may vary depending on how high the CPU power limits are and how competent the cooling solution of your system is.\nPower consumption \nThis Core i5 has a default TDP (also known as the long-term power limit) of 9 W, a value that laptop manufacturers are allowed to increase just slightly (12 W being the upper limit) resulting in higher clock speeds and higher performance. The processor is built with Intel's 1st gen 10 nm process for OK, as of late 2022, energy efficiency. The Intel Core i5-1030G7 is a power efficient quad-core SoC for laptops and Ultrabooks based on the Ice -Lake-Y generation that was announced in Mai 2019 (Computex). It integrates four Sunnycove processor cores (8 threads thanks to HyperThreading) clocked at 0.8 (base) - 3.8 (single core Turbo) GHz. All four cores can turbo up to 3.2 GHz using Turbo Boost. According to Intel the Sunnycove cores achieve 18% more IPCs (Instructions per Clock). The biggest improvement for Ice-Lake is the integrated Gen 11 graphics card called Iris Plus Graphics. The Core i5-1030G7 integrates the biggest G7 variant with 64 CUs clocked at 300 - 1050 MHz. The Iris Plus G7 should be twice as fast as the predecessors and best the AMD Vega 10 GPU in current Ryzen APUs. However, in the Y-series the gaming performance will be again depending on the cooling solution and may degrade clearly over time (compared to the Core i7-1065G7 with 15 - 25 Watt e.g.). Other improvements for Ice Lake are the AI hardware acceleration and the partial integration of Thunderbolt and WiFi 6 in the chip. The integrated DDR4 memory controller supports modules with up to 3200 MHz (and LPDDDR4 3733). Performance While we have not tested a single system built around the 1030G7 as of August 2023, it's safe to expect the chip to be about half as fast as the Core i5-1035G7, as far as multi-thread performance is concerned. Which is fairly poor as of mid 2023. Your mileage may vary depending on how high the CPU power limits are and how competent the cooling solution of your system is. Power consumption This Core i5 has a default TDP (also known as the long-term power limit) of 9 W, a value that laptop manufacturers are allowed to increase just slightly (12 W being the upper limit) resulting in higher clock speeds and higher performance. The processor is built with Intel's 1st gen 10 nm process for OK, as of late 2022, energy efficiency. The Intel Core i3-1000G1 is a power efficient dual-core SoC for laptops and Ultrabooks based on the Ice -Lake-U generation that was announced in Mai 2019 (Computex). It integrates two Sunnycove processor cores (4 threads thanks to HyperThreading) clocked at 1.1 (base) - 3.2 GHz (single and dual core Turbo). According to Intel the Sunnycove cores achieve 18% more IPCs (Instructions per Clock).\nThe biggest improvement for Ice-Lake is the integrated Gen 11 architecture graphics adapter called UHD Graphics G1. The Core i3-1000G1 integrates the smallest GPU, the UHD Graphics that features 32 of the 64 CUs and clocks at 300 - 900 MHz. The faster variants offer higher clock speeds (up to 1100 MHz) and include Iris Plus G4 (e.g. in the similar named Core i3-1000G4) and G7.\nOther improvements for Ice Lake are the AI hardware acceleration and the partial integration of Thunderbolt and WiFi 6 in the chip. The integrated DDR4 memory controller supports modules with up to 3200 MHz (and LPDDDR4 3733).\nPerformance \nWe have not tested a single system built around the 1000G1 as of August 2023. Expect the chip to be at least as fast as the Pentium 6500Y (two Amber Lakes cores, 4 threads, up to 3.4 GHz). In other words, not fast at all.\nPower consumption \nThis Core i3 has a default TDP (also known as the long-term power limit) of 9 W, a value that laptop manufacturers are allowed to reduce just slightly to 8 W resulting in lower clock speeds and lower performance. TDP values that low are typical for affordable laptops, tablets and mini-PCs, mostly with no active cooling solution.\nThe processor is built with Intel's 2nd generation 10 nm process for decent, as of late 2022, energy efficiency. The Intel Core i3-1000G1 is a power efficient dual-core SoC for laptops and Ultrabooks based on the Ice -Lake-U generation that was announced in Mai 2019 (Computex). It integrates two Sunnycove processor cores (4 threads thanks to HyperThreading) clocked at 1.1 (base) - 3.2 GHz (single and dual core Turbo). According to Intel the Sunnycove cores achieve 18% more IPCs (Instructions per Clock). The biggest improvement for Ice-Lake is the integrated Gen 11 architecture graphics adapter called UHD Graphics G1. The Core i3-1000G1 integrates the smallest GPU, the UHD Graphics that features 32 of the 64 CUs and clocks at 300 - 900 MHz. The faster variants offer higher clock speeds (up to 1100 MHz) and include Iris Plus G4 (e.g. in the similar named Core i3-1000G4) and G7. Other improvements for Ice Lake are the AI hardware acceleration and the partial integration of Thunderbolt and WiFi 6 in the chip. The integrated DDR4 memory controller supports modules with up to 3200 MHz (and LPDDDR4 3733). Performance We have not tested a single system built around the 1000G1 as of August 2023. Expect the chip to be at least as fast as the Pentium 6500Y (two Amber Lakes cores, 4 threads, up to 3.4 GHz). In other words, not fast at all. Power consumption This Core i3 has a default TDP (also known as the long-term power limit) of 9 W, a value that laptop manufacturers are allowed to reduce just slightly to 8 W resulting in lower clock speeds and lower performance. TDP values that low are typical for affordable laptops, tablets and mini-PCs, mostly with no active cooling solution. The processor is built with Intel's 2nd generation 10 nm process for decent, as of late 2022, energy efficiency. #0 checking url part for id 6866 +0s ... 0s #1 checking url part for id 11448 +0s ... 0s #2 checking url part for id 11452 +0s ... 0s #3 not redirecting to Ajax server +0s ... 0s #4 did not recreate cache, as it is less than 5 days old! Created at Sun, 31 Mar 2024 05:37:32 +0200 +0.001s ... 0.001s #5 composed specs +0.044s ... 0.045s #6 did output specs +0s ... 0.045s #7 getting avg benchmarks for device 6866 +0.002s ... 0.048s #8 got single benchmarks 6866 +0.007s ... 0.055s #9 getting avg benchmarks for device 11448 +0.003s ... 0.057s #10 got single benchmarks 11448 +0s ... 0.057s #11 getting avg benchmarks for device 11452 +0.002s ... 0.06s #12 got single benchmarks 11452 +0s ... 0.06s #13 got avg benchmarks for devices +0s ... 0.06s #14 min, max, avg, median took s +0s ... 0.06s #15 return log +0s ... 0.06s "
}