{
    "title": null,
    "date": "3/6/2024",
    "url": "https://markets.businessinsider.com/news/stocks/nvidia-tops-in-popularity-among-s-p-500-semiconductor-stocks-analyst-sees-room-for-growth-1033139465",
    "text": "Based on Bank of America Equity Strategy data, the analysis of semiconductor and Electronic Design Automation (EDA) stocks in the S&P 500 index reveals several trends as of the end of January 2024. The relative weighting of semiconductors, which indicates how much they are in portfolios relative to their weight in the S&P 500 index, has declined month-over-month from July 2023’s 1.18x to 1.09x, marking a 4% quarter-over-quarter reduction. This level remains below its peak of 1.36x in March 2017. Nvidia Corp (NASDAQ:NVDA) maintains the broadest ownership among fund managers, with 67% holding the stock, continuing its growth in ownership since June 2023. However, its relative weighting 1.01x is still below the average of the top 16 owned information technology and communication services peers despite Nvidia having significantly faster sales growth prospects. The quarter saw notable ownership expansions in Broadcom Inc (NASDAQ:AVGO), Micron Technology, Inc (NASDAQ:MU), Applied Materials, Inc (NASDAQ:AMAT), Intel Corp (NASDAQ:INTC), Nvidia, and Cadence Design Systems Inc (NASDAQ:CDNS).  Conversely, Microchip Technology Inc (NASDAQ:MCHP), First Solar Inc (NASDAQ:FSLR), Enphase Energy Inc (NASDAQ:ENPH), NXP Semiconductors NV (NASDAQ:NXPI), Advanced Micro Devices, Inc (NASDAQ:AMD), Qualcomm Inc (NASDAQ:QCOM), and KLA Corp (NASDAQ:KLAC) experienced the most significant ownership declines. The most significant increases in depth or overweighting were seen in Intel, ON Semiconductor Corp (NASDAQ:ON), and AMD, while First Solar, Qorvo Inc (NASDAQ:QRVO), Teradyne Inc (NASDAQ:TER), Applied Materials Inc (NASDAQ:AMAT), and Qualcomm observed the most substantial decreases in weighting. Long-only investors were most overweight in Microchip Technology, ON Semiconductor, Enphase Energy Inc (NASDAQ:ENPH), Monolithic Power Systems Inc (NASDAQ:MPWR), Broadcom, Texas Instruments Inc (NASDAQ:TXN), and NXP Semiconductors. In contrast, hedge funds favored AMD, Teradyne, Skyworks Solutions Inc (NASDAQ:SWKS), Micron, Cadence, and Qorvo the most. Despite high ownership, the top six widely owned semiconductor stocks in the S&P 500, including Nvidia, Broadcom, AMD, Applied Materials, Lam Research Corp (NASDAQ:LRCX), and Texas Instruments, remain relatively underweighted when compared to their potential growth and market impact.  Price Action: NVDA shares closed higher by 3.18% at $887.00 on Wednesday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via Shutterstock Indices Commodities Currencies Stocks "
}