{
    "title": "AMD's previous-gen Vega GPU reborn: Chinese company uses Intel CPU with \nVega GPU for NAS mobo",
    "date": "3/26/2024",
    "url": "https://www.tweaktown.com/news/97135/amds-previous-gen-vega-gpu-reborn-chinese-company-uses-intel-cpu-with-for-nas-mobo/index.html",
    "text": "A new NAS motherboard has appeared on AliExpress, powered by an Intel Kaby Lake-G processor and integrated AMD Vega graphics. Yeah, Vega is back, baby. Topton's new N9 NAS motherboard (source: AliExpress) The new Topton N9 NAS motherboard features an Intel Core i7-8705G \"Kaby Lake-G\" processor, with 4 cores and 8 cores at up to 4.1GHz. The CPU is designed on the 14nm node process, with a 65W TGP. Topton's new N9 NAS motherboard features an AMD Radeon RX Vega M GL GPU as a separate tile, with 20 Compute Units and 4GB of HBM2 memory. Topton's new N9 NAS motherboard also features an integrated Intel HD Graphics 630 GPU with 24 Execution Units that uses shared memory. But the bigger deal here is not one or two, but 8 x 2.5GbE ethernet ports (this is a NAS motherboard, remember), so plenty of storage + networking options are required. The company has designed its new Topton N9 NAS motherboard for NAS use, with a 17 x 17mm ITX form factor, ready for NAS, home firewalls, routers, and more. On the storage side of things, we've got 2 x M.2 2280 slots and 1 x SATA 6Gbps interface that can be loaded up with SSDs and pumped through the 8 x 2.5GbE ethernet ports. Topton's new N9 NAS motherboard features 8 x Intel i226V controllers that when combined, offer 20GbE of networking performance in total. There's HDMI 2.0 for some 4K 60Hz display output, while pricing falls down to $289 as a barebone system without the fan. If you want that fan, it'll cost you an additional $20. Topton N9 NAS motherboard features: Anthony Garreffa Anthony joined the TweakTown team in 2010 and has since reviewed 100s of graphics cards. Anthony is a long time PC enthusiast with a passion of hate for games built around consoles. FPS gaming since the pre-Quake days, where you were insulted if you used a mouse to aim, he has been addicted to gaming and hardware ever since. Working in IT retail for 10 years gave him great experience with custom-built PCs. His addiction to GPU tech is unwavering and has recently taken a keen interest in artificial intelligence (AI) hardware. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}