{
    "title": "AMD Stock Forecast: Why This AI Winner Is Just Getting Warmed Up",
    "date": "3/11/2024",
    "url": "https://www.tradingview.com/news/investorplace:8b0221fd9094b:0-amd-stock-forecast-why-this-ai-winner-is-just-getting-warmed-up/",
    "text": "Advanced Micro Devices AMD stock has been on a tear in recent months following the release of its first major product for generative AI end-users. AMD stock is up over 80%, but the rally may not be over given that there are even stronger catalysts ahead. AMD’s MI300 processor will boost the company’s performance. These additional hardware products could lead to even more significant growth, driving yet another strong run for this already-winning AI stock. AMD Stock: Why MI300 Launch Justifies the Initial Surge Ask those critical about Advanced Micro Devices’ AI rally, and they’ll argue that AMD has surged too far, too fast. In their view, after the aforementioned rally, and the stock’s total increase in price over the past year (157.5%), valuation more than takes the AI catalyst into account. However, I take the opposite view. Not only does the current AMD stock not fully factor all the likely impact from this growth trend. Today’s prices may just barely encompass likely upside from MI300, both this year and in the coming years. Even as the company has guided for the MI300 processor sales to total $3.5 billion this year, this forecast may be conservative. This level of sales will boost Advanced Micro Devices’ fiscal results this year. For instance, analysts at Citigroup estimate that MI300 sales could come in at $5 billion this year, increasing to $8 billion in 2025. Better yet, as hinted above, alongside the MI300, the company next year could generate billions more from the sale of other AI chip products. Big Opportunity for This Second Mover Nvidia NVDA, which currently earns an “A” in Portfolio Grader, is of course the “first mover” among the AI chip stocks. With an 80% share of the high-end AI chip market, this key competitor is set to continue dominating the space. However, what’s good news for AMD stock investors is that even in this environment, this so-called “second mover” can still thrive. For one, as discussed in a recent Wall Street Journal article, there’s great opportunity for “second movers” to grab market share, as AI chip sales shift primarily from chips used for training artificial intelligence models, to chips used for inference, or the deployment of AI systems. AMD itself has claimed that its AI chips beat out Nvidia’s when it comes to their use in inference. In addition, Advanced Micro Devices is targeting the nascent AI-PC market as an area where it can gain significant share. As we have pointed out previously, 54.5 million PCs with AI capability are set to this ship this year. That figure could hit 167 million by 2027. There is also a massive market emerging for AI-compatible chips for mobile devices. These burgeoning markets represent another massive opportunity for AMD. Still a Top-Shelf Pairing for Full-On AI Exposure Admittedly, analysts are erring on the side of caution when it comes to long-term earnings forecasts for AI chip stocks. In the case of AMD, sell-side estimates for 2025 are all over the place. The low end of this range comes in at $3.52 per share. The highest estimates call for earnings of $9.05 per share next year, a massive leap from 2024 consensus ($3.65 per share) to say the least. I wouldn’t assume that earnings will hit this top end. However, based on the factors, at the same time I wouldn’t discount AMD’s ability to experience a Nvidia-like dramatic jump in earnings this year and the next. Hence, AMD stock remains a top-shelf pairing with NVDA stock for full-on AI exposure. Hold existing positions and feel free to enter or add to one. AMD stock earns an A rating in Portfolio Grader. On the date of publication, Louis Navellier had a long position in NVDA. Louis Navellier did not have (either directly or indirectly) any other positions in the securities mentioned in this article. The InvestorPlace Research Staff member primarily responsible for this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @dehandreh @yo44ge4real @stvmcg @Arcanebear.eth @retirewithforex @sethsickness @aliams_david_trading_gram @mytradingsetup @fx_bitcoin_expert11 @tradingfrance @mytradingsetup @jordan_fx_ @nav.fx @itzi71 @laptopmoneygang @heinrich_j96 @johndollery @aggressivecalculator Whatever the trade "
}