{
    "title": "Graphics Card Buyer’s Guide 2024: What to Look for When Buying a GPU",
    "date": "3/2/2024",
    "url": "https://www.maketecheasier.com/graphics-card-gpu-buying-guide/",
    "text": "Sign up for our daily newsletter If you’re looking to build or buy a powerful gaming rig, you will need to pay close attention to the graphics card. Buying a GPU can be challenging, as there is much to consider: budget, PC requirements, and performance goals. Our graphics card buyer’s guide will help you discover what to look for when buying a GPU. Have you chosen a graphics card? Read through these other considerations for building a gaming PC. The GPU market is saturated with dozens of viable graphics card options, but only three companies make the GPU chips that power these cards: NVIDIA, AMD, and Intel. While Intel has managed to release some entry-level cards, saying an Intel Arc GPU is good for gaming comes with huge asterisks. Intel’s next-gen Battlemage GPUs may finally change things for the better for Team Blue. Despite offering improvements, AMD’s ray tracing and upscaling tech is still lagging behind NVIDIA’s. For gamers who are okay with letting go of ray tracing-enhanced visuals in exchange for retaining more performance, AMD is the better choice, as it offers more value for the money, strictly in terms of rasterized performance. AMD’s cards also offer significantly more VRAM than NVIDIA’s. Modern games are increasingly becoming VRAM-dependent, and AMD’s cards are likely to fare better in the long run, compared to those of Team Green. But, due to the superior ray tracing, more recent path tracing performance, and DLSS upscaling of NVIDIA, fans of next-gen visuals still prefer it. The traditional definitions of “budget” and “mid-range” no longer apply in the current market and are unlikely to ever return. Graphics cards, especially at the high end, have become luxury commodities. Buying any GPU worth less than $550-$600 comes with gaming compromises. Yet, you can still get decent gaming performance if you temper expectations and are willing to turn down game settings or work with a lower resolution. This GPU performance guide classifies current-gen and various previous-gen graphics cards according to price and performance. If you’re looking for a single recommendation that works as a sweet spot between performance and price, the NVIDIA RTX 4070 Super is currently the GPU. It offers 4K 60+ FPS gaming and leverages NVIDIA’s latest DLSS 3.0 tech to boost frame rates further. AMD’s RX 7900 XT at $700 is a great flagship card if you ignore ray tracing and focus only on rasterized performance. Tip:  having trouble with your graphics card? Check out the causes and fixes of your graphics card not working. Choosing the best graphics card based on your budget is only half the story. You also need to consider other factors, like form factor, VRAM, monitor resolution, and TDP. They’re essential to potential upgrade decisions. Nothing can be more frustrating than unboxing your shiny new graphics card, only to realize it’s an inch too big for your PC case. Before you drop the big bucks, do your homework and discover how much physical space your case can offer. Compare your case’s GPU clearance value against the graphics card dimensions. If your case isn’t compatible, consider buying a new PC case. Good to know: want more performance from your graphics card, learn how to safely overclock your GPU. Your system dictates the kind of graphics card you should buy. Knowing your system’s limitations can save you money and headaches. For example, if you’re rocking a 1080p (Full HD) monitor and don’t plan on upgrading it anytime soon, it’s pointless spending your money on a high-end graphics card. But if you already have a 1440p (2560 x 1440) monitor and your current GPU is holding you back, a GPU upgrade makes much more sense. A high-refresh 4K (3820 x 2160) monitor needs serious GPU horsepower. You’ll have to spend upwards of $800 if you want the absolute best 4K gaming experience. The best gaming monitors, and even multiple or ultrawide monitors, need a powerful graphics card to drive the higher pixel count. Although more VRAM on your graphics card doesn’t guarantee more performance, it’s fast becoming a crucial factor as games become more demanding, especially at higher resolutions. The RTX 3070 Ti only shipped with 8GB of VRAM. Even though the card is still powerful, its longevity is hampered by the relatively small VRAM buffer. Today’s GPUs should have a minimum of 12GB of VRAM, with 16GB being ideal. Memory bandwidth is as equally important as the amount of memory on your graphics card. Data ready to be processed by the GPU is usually stored on the card’s dedicated memory, which can be GDDR3, GDDR5, GDDR6, or GDDR6X. Note that GDDR6 memory provides twice the bandwidth of GDDR5 clocked at the same rate. Most of the recent-gen graphics cards ship with GDDR6 memory, with some getting even faster GDDR6X memory. You should always choose faster memory for better performance. FYI: curious about your PS5’s GPU? Check out the GPUs that can match or outperform the PS5. CUDA cores or Stream processors can be your rough guide to comparing gaming performance across GPUs of the same family. CUDA (Compute Unified Device Architecture) is NVIDIA’s computing language that leverages the GPU in specific ways to perform tasks with greater accuracy. A CUDA core is NVIDIA’s equivalent to an AMD or Intel stream processor. Be careful when comparing CUDA cores or Stream processors across different GPU generations, as architectural improvements generally overcome any CUDA core deficiency at comparable performance tiers. Like the CPU, the GPU produces heat when powering demanding games and running production workloads. The TDP value of the graphics card indicates the power consumption at the maximum theoretical load. The higher the TDP, the more heat is produced. Therefore, you should always opt for the more power-efficient GPU, i.e., the one offering better FPS per watt. The power consumption of the latest RTX 4000 series saw a considerable jump from the previous generation cards, with the flagship RTX 4090 requiring at least an 850W power supply. Similarly, AMD’s RX 7900 XTX requires at least an 800W power supply to support the flagship GPU’s performance adequately. On the Intel side, the first-gen Arc GPUs are quite power-hungry for the performance they offer, hurting their FPS-per-watt. Tip: facing high GPU power consumption? Undervolt your GPU to save power. G-SYNC, FreeSync, and XeSS are adaptive synchronization technologies developed by NVIDIA, AMD, and Intel respectively. Buying a monitor that supports one of these features will help adjust your monitor’s refresh rate with the FPS generated by your graphics card, reducing issues like screen tearing and input latency. FreeSync is an open-source standard on far more monitors than NVIDIA’s G-SYNC. You don’t always need to spend more on a display with hardware-supported G-SYNC tech. You can instead opt for displays certified as “G-SYNC compatible” or get a FreeSync display. Buying a FreeSync or FreeSync Premium monitor will help you cut costs while not sacrificing performance, as NVIDIA, AMD, and Intel cards can work with FreeSync, similar to FSR upscaling that’s available for all GPUs. Good to know: using an NVIDIA card? You’ll want to learn how NVIDIA’s GeForce software suite works. Upgrades depend on what trade-offs you’re comfortable with. If you want the latest standard in high-end performance, opt for the latest and greatest flagship GPU every generation. But if you want great value, target Nvidia’s 70-class GPUs or equivalent, then upgrade every other generation. Some GPUs will be powerful enough to allow you to skip more than one generation before needing an upgrade. Ray tracing has quickly become a major feature in modern games, to the point that a huge section of the market prefers Nvidia’s GPUs for their superior ray tracing performance. If you like to play the latest single-player games at the highest settings, ray tracing will be a deciding factor. If you’re only concerned with raw power and prefer multiplayer games over others. Opt for AMD’s GPUs. While video editing is a demanding workload that will benefit from more powerful GPUs, buying mid-range cards will be sufficient for most users. Even when editing 4K videos, a card like the RTX 3060 Ti can power your workload. The performance benefit that you’ll gain by moving to a card like RTX 3090 or RTX 4080 will not justify the associated price increase. It’s worth noting that NVIDIA GPUs have traditionally offered better support for video editing, 3D modeling, and rendering software than AMD’s cards. Image credit: Unsplash Our latest tutorials delivered straight to your inbox After a 7-year corporate stint, Tanveer found his love for writing and tech too much to resist. An MBA in Marketing and the owner of a PC building business, he writes on PC hardware, technology, video games, and Windows. When not scouring the web for ideas, he can be found building PCs, watching anime, or playing Smash Karts on his RTX 3080 (sigh). Graphics Card Not Working? Here Are the Causes and Fixes What Is VRAM, How to Check It, and Can You Increase It? 7 GPUs That Match or Outperform PS5 9 Ways to Optimize Mouse Settings for Gaming How to Get Wayland to Work on Nvidia Graphics Cards Affiliate Disclosure: Make Tech Easier may earn commission on products purchased through our links, which supports the work we do for our readers. © 2024 Uqnic Network Pte Ltd.All rights reserved. "
}