{
    "title": "Leak sheds light on AMD's \"Hawk Point\" APU successors, including Strix \nPoint, Sarlak, Kraken and Sound Wave",
    "date": "3/3/2024",
    "url": "https://www.notebookcheck.net/Leak-sheds-light-on-AMD-s-Hawk-Point-APU-successors-including-Strix-Point-Sarlak-Kraken-and-Sound-Wave.809357.0.html",
    "text": "Gamma0burst's recent findings shed light on AMD's forthcoming APUs, revealing details about Strix Point, Sarlak, Kraken, as well as a newcomer: Sound Wave. The Strix Point APU is anticipated to sport AMD's Zen 5 architecture for the CPU and RDNA 3.5 architecture for the GPU. Expected to be branded as the Ryzen 8050 series, it is rumored to incorporate an NPU based on XDNA 2, promising signficantly improved performance, up to 48 TOPS. Set to hit the market in the latter half of the year, it is primed to succeed AMD's existing \"Hawk Point\" series. Looking forward to 2025, AMD is expected to introduce the Kraken APUs, leveraging the same Zen 5 and RDNA 3.5 architectures as Strix Point. Initial information suggests an 8-core setup with a mix of Zen 5 and Zen 5C cores, alongside 8 CUs for the RDNA 3.5-based GPU. Both Strix and Karken are rumored to be based on a 4nm node, but the article itself states the reliability of this specific detail to be rather low. Additionally, the report clarifies the distinction between Strix and Sarlak, falsifying recent rumors linking Strix Halo (listed as the B0 stepping) with Sarlak. The Strix APU lineup is expected to include a monolithic variant with 12 CPU cores and 16 CUs, as well as a premium chiplet-based design offering up to 16 CPU cores and a whopping 40 CUs. The report also mentions the existence of Sound Wave, expected to be AMD's next-gen lineup of APUs following Sarlak. However, it does not give out any other information apart from claiming it to be based on a 3 nm manufacturing process. Given the novelty of this future lineup, very little is known about it at this stage. Buy a new Sony PlayStation 5 on Amazon.com Gamma0burst "
}