{
    "title": "Forget Nvidia: 2 Fantastic Artificial Intelligence (AI) Stocks to Buy \nInstead",
    "date": "3/3/2024",
    "url": "https://finance.yahoo.com/news/forget-nvidia-2-fantastic-artificial-120000182.html?ref=upstract.com",
    "text": "Putting aside Nvidia is practically impossible, considering nearly every large technology company in America seems to be racing to buy its data center chips designed to process artificial intelligence (AI) workloads. Plus, Nvidia stock was the best performer in the S&P 500 index in 2023 with a 239% gain, and it's already up another 61% in 2024. But the AI industry is expanding quickly, and a number of other opportunities warrant attention, so let's forget Nvidia for a moment. Palo Alto Networks (NASDAQ: PANW) is the world's largest cybersecurity company, and it's applying AI across its product portfolio to deliver advanced protection against modern threats. DigitalOcean (NYSE: DOCN), on the other hand, is an under-the-radar cloud services provider emerging as an on-ramp to the AI revolution for small and mid-size businesses. Here's why investors might do well to buy both stocks right now. Cyberthreats are a growing concern in the corporate world. Data breaches not only have severe financial consequences, but they also shatter the trust between companies and their customers. Attacks are increasing in sophistication with each passing year, and malicious actors are even using tools like generative AI to trick employees into handing over sensitive information through realistic phishing emails and phone calls. Automation has never been more important to cybersecurity, because it's impossible to train every employee within an organization to be an expert. Palo Alto Networks says 93% of security operations centers still rely on manual, human-led processes, and the workload is so heavy that 23% of security incidents are left uninvestigated. That creates enormous vulnerabilities. Palo Alto offers three cybersecurity platforms addressing cloud security, network security, and security operations. It's weaving AI into all of them, including its new Cortex XSIAM security operations product. For one customer, it resolves up to 90% of security incidents autonomously, with no human input required. XSIAM was released a little over one year ago, and it has already amassed a sales pipeline worth $1 billion. Palo Alto is the world's largest cybersecurity company, and it plans to use that scale to crush its competitors. Many large organizations use cybersecurity tools from multiple providers based on their needs, but Palo Alto wants its customers to ditch competing products in favor of using its products exclusively. To achieve this, Palo Alto will offer customers lengthy fee-free periods so they can integrate its software at no cost, which should encourage them to make the switch once their contracts are up with competing providers. A customer who uses all three of Palo Alto's platforms gets a lifetime value 40 times greater than a customer using just one, so this could drive significant long-term growth. On the other hand, this strategy will lead to a short-term dip in Palo Alto's revenue and billings growth, which is why its stock suffered a sharp fall recently and now trades 16% below its all-time high. Nevertheless, the company still forecasts record revenue of up to $8 billion in fiscal 2024 (ending July 31). Therefore, the dip in its stock price might be a great entry point for long-term investors. Once Palo Alto begins reaping the rewards of its strategy, it could unlock a new phase of growth. The world's largest cloud platforms, like Amazon Web Services and Microsoft Azure, are spending billions of dollars to build data centers for AI development, mainly using chips from Nvidia. While they are focused on serving large organizations and cashed-up AI developers, DigitalOcean is making sure small and medium-sized businesses aren't left behind. DigitalOcean is a provider of cloud services that help these businesses store data, host websites, and develop software. It offers cheap and transparent pricing, highly personalized service, and mountains of educational material to help customers maximize their output. It's an ideal platform for start-ups and businesses with less than 500 employees that can't afford in-house technical teams to manage their cloud infrastructure. Last year, DigitalOcean spent $111 million to acquire Paperspace, a data center operator focused on delivering AI infrastructure at affordable prices. It offers the latest graphics processing units (GPUs) -- including the industry-leading H100 from Nvidia -- up to 70% cheaper than Microsoft Azure. Paperspace charges customers by the second with no lock-in contracts, and its narrow business model allows it to maintain a slim cost structure compared to the cloud giants. Those features lead to lower prices for the end user. DigitalOcean estimates its opportunity in the small and medium-sized business cloud services industry will be worth $114 billion in 2024, which could swell to $213 billion by 2027. However, AI could dramatically expand that addressable market into the trillions of dollars, considering Wall Street predicts the technology could add somewhere between $7 trillion and $200 trillion to the global economy in the coming decade. DigitalOcean could soon become the go-to platform for these businesses who want to access AI. At the end of 2023, the company had only $730 million in annual recurring revenue, so it has barely scratched the surface of its addressable market, let alone the AI opportunity. DigitalOcean stock remains 71% below its all-time high, which was set during the tech frenzy of 2021. Its valuation was a little unrealistic back then, but the steep drop may give investors a great long-term entry point. Should you invest $1,000 in Palo Alto Networks right now? Before you buy stock in Palo Alto Networks, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Palo Alto Networks wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, DigitalOcean, Microsoft, Nvidia, and Palo Alto Networks. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Forget Nvidia: 2 Fantastic Artificial Intelligence (AI) Stocks to Buy Instead was originally published by The Motley Fool Related Quotes "
}