{
    "title": "Nvidia Bound For A Drop Like Tesla? Investors Draw Parallels Between AI And \nEV Frenzy",
    "date": "3/3/2024",
    "url": "https://www.tradingview.com/news/benzinga:d8dc97c25094b:0-nvidia-bound-for-a-drop-like-tesla-investors-draw-parallels-between-ai-and-ev-frenzy/",
    "text": "The meteoric rise of Nvidia Corp. NVDA in the stock market is drawing parallels with the historic surge of Tesla Inc. TSLA, sparking concerns about the sustainability of the AI frenzy. What Happened: As Nvidia’s stock continues to soar, some investors are drawing parallels with Tesla’s rise to the top, as reported by Bloomberg on Sunday. In 2017, Tesla’s stock skyrocketed as investors anticipated the global domination of electric vehicles, propelling the company to the top of the U.S. auto industry. However, Tesla’s shares have since plummeted by over 50% from their 2021 peak, and other EV stocks that surged alongside it have also seen significant declines. This serves as a cautionary tale for investors betting on Nvidia’s stock as a limitless AI future. \"If you really believe in this AI frenzy, you can visualize a future 10 years from now where AI is embedded in a lot of places, and you need these massive systems running chips that can only be delivered by Nvidia,\" said Sameer Bhasin, principal at Value Point Capital. \"But just because the general macro wave is real, it doesn't mean that all of these ventures are going to turn out to be good investments. You will have to be able to separate the winners from the losers,” cautioned Cole Wilcox, CEO of Longboard Asset Management. See Also: As Dogecoin Jumps 18%, Founder Billy Markus Cracks Joke About Crypto Community: ‘If You Take Offense To This ...’ Despite the differences between the two companies, such as their products and leadership, the parallels are hard to ignore. Nvidia’s remarkable growth is based on the belief that its exceptional sales growth is sustainable, much like the assumption that EVs would be rapidly and widely adopted, with Tesla leading the market. However, the reality has disrupted this narrative, with EV demand slowing down and more price-conscious consumers taking longer to adopt the new technology. Tesla’s stock has dropped by 31% from its recent high in July, making it one of the biggest percentage decliners in the Nasdaq 100 Index this year. Why It Matters: Retail investors have been favoring Nvidia over Tesla, with the former’s stock purchases exceeding $1 billion over ten days, while Tesla’s retail stock purchases amounted to just under $500 million during the same period. In February, Tesla investor Ross Gerber expressed his belief that Nvidia is significantly “undervalued” after the AI giant’s record quarter. Gerber commended Nvidia for returning a substantial amount of capital to its shareholders. Read Next: Welcome To The ‘Memecoin Supercycle:’ Mad Crypto Money With Ivan Photo by rafapress on Shutterstock. Engineered by Benzinga Neuro, Edited by Pooja Rajkumari The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @santa_fx @neo_inversion @nasdaq.forex @maurice.method @forex.alex @carlosvalenciafx1_ GMS @globalsignals_ @eagle_chart @andyoh6666 @tradingview @trading_tools.ir @tradingfrance @mytradingsetup @inancsalman @twobrokeboystrading @imdrcruz @jasmineeevn @reubenblameyfx Whatever the trade "
}