{
    "title": "NVIDIA H20 AI GPU For China To Be Mass Produced In Q2 2024, Full Compliance \nWith US Policies",
    "date": "1 Jan 2024",
    "url": "https://wccftech.com/nvidia-h20-ai-gpu-china-mass-produced-q2-2024-full-compliance-us-policies/",
    "text": "NVIDIA is reportedly planning to commence mass production of its H20 AI GPU, designed for China, in the second quarter of 2024. Last year, in November, It was reported that NVIDIA was preparing a range of new AI GPUs for the Chinese region as an alternative to the H100, L40, and L4 chips that had been restricted due to US policies. Now, The newest chips were to be made in full accordance with US trade/export policies. In terms of specifications, the H20 AI GPU is a cut-down variant of the H100 GPU that features 96 GB memory capacities operating at up to 4.0 Tb/s, 296 TFLOPs Compute power, & using the GH100 die with a performance density of 2.9 TFLOPs/die versus H100's 19.4. The H100 SXM is 6.68x faster than the H20 SXM as per the listed table but those are FP16 Tensor Core FLOPs (with Sparsity) and not the INT8 or FP8 FLOPs. The GPU has a 400W TDP and features 8-way configurations in an HGX solution. It retains the 900 GB/s NVLINK connection & also offers 7-Way MIG (Multi-Instance GPU) functionality. These chips were planned for launch in late 2023 but were delayed to early 2024 as the US-China chip war heated up. Since then, the US government has taken a softer approach to commercial sales within China, and NVIDIA has assured that their chips will meet the full compliance and guidance set by US trade and commerce authorities which has already led to the launch of the GeForce RTX 4090D in the region. The company is now looking forward to commencing the mass production of its H20 and the rest of the AI GPUs in Q2 2024 which will be handled by Wistron, a major substrate supplier for the green team. Chinese AI companies have been repurposing the last remaining stock of GeForce RTX 4090 GPUs for their use while others are looking into alternatives such as Huawei who offer very attractive price/performance value in the AI segment. Huawei is expected to gain major market share in the country from restrictions on US-based tech companies. It looks like we will see the first chips handed over to AI customers in China around mid or late Q2 2024. News Source: MyDrivers Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}