{
    "title": "3 Stocks to Sell Before 2023 Momentum Cools off Completely",
    "date": "1 Jan 2024",
    "url": "https://investorplace.com/2023/12/3-stocks-to-sell-before-2023-momentum-cools-off-completely/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. These overvalued stocks belong on your stocks-to-sell list Advertisement Source: chanpipat / Shutterstock.com In 2024, the U.S. economy faces the unexpected threat of a recession, according to Morgan Stanley (NYSE:MS) strategists. The bank predicts a hard landing for the economy, challenging the belief in a sustained soft landing. Factors such as increased policy restraint worldwide, the waning support of U.S. federal government fiscal policies and heightened uncertainty surrounding the general election could contribute to this economic downturn. The probability of a recession indicates the markets will depress, meaning now is the time to cut loose stocks pumped up over the past year. You need to take advantage of those massive gains and get rid of these stocks to sell. Wingstop (NASDAQ:WING) is a chain of restaurants specializing in various flavors of chicken wings and sides and operates nearly 2,000 restaurants worldwide. Wingstop’s stock has demonstrated remarkable performance in 2023, soaring almost 93.26% year-to-date (YTD), as of December 28. Additionally, it has exceeded market expectations, beating its past three projected quarterly earnings. Its recent report regarding the third quarter of fiscal year 2023 indicated a 26.4% increase in revenue to $117.1 million and a 46.0% increase in net income to $19.5 million year-over-year (YoY). Nevertheless, despite its growth in 2023, WING’s stock, priced at $257.88, is currently considered overvalued. Analysts predict a median price target of $236.18, with prices ranging as low as $191.00 to as high as $285.00. Reasons for its overvaluation include the company operating in the highly competitive food industry, contending with established franchises such as McDonald’s (NYSE:MCD), Chipotle Mexican Grill (NYSE:CMG) and Yum! Brands (NYSE:YUM) — the owner of KFC. Respectively, these companies have a current P/E ratio of 26.16, 54.09 and 24.84, while all operate a market cap of over $36 billion. Meanwhile, Wingstop’s current P/E ratio is a staggering 111.86, and operates at a low market cap of $7.586 billion. Its basic EPS of 2.30 is considered low compared to the rest of these companies. Perhaps WING is worth its high valuation, but as the world moves towards healthier food options, Wingstop and its current menu may lose momentum. As a result, this stock is very compelling to sell. Nvidia (NASDAQ:NVDA) is an American semiconductor company and a leading global manufacturer of high-end GPUs for gaming, cryptocurrency mining and professional applications, as well as chip systems for use in vehicles, robotics and other tools. NVDA stock is up 245.94% YTD and has maintained its historical growth. “The global technology market size was valued at $802.07 million in 2021 and is expected to expand at a CAGR of 25.73% during the forecast period, reaching $3,168.13 million by 2027.” NVDA’s revenue of $18.12 billion grew 205.51% YoY, and its diluted EPS of $3.71 grew 1,274.07% YoY — both beating expectations by strong margins. Strong financial growth is further evident in a 51.01% net profit margin, which grew 344.73% YoY, and an income of $9.24 billion, up 1,259.26% YoY. Although NVDA stock was one of the stocks with the best growth in 2023, it must address several challenges to maintain the momentum. Nvidia’s pricing power will likely decline, mainly due to next year’s expected GPU scarcity in AI-accelerated data centers. In addition to that, U.S. regulators placed limitations on high-powered GPU exports to China, potentially resulting in billions in lost revenue per quarter. Yahoo! Finance reported that 46 analysts predicted a mean 1-year price target of $641.23, spanning from as low as $439.00 to as high as $1,100.00. It wouldn’t be surprising if demand for Nvidia’s GPUs failed to meet lofty expectations. Investors should make their decisions before it’s too late. IonQ (NYSE:IONQ) is a quantum computing hardware and software company. It is an early mover into the quantum computing market and is working with Amazon Web Services, Google Cloud and Microsoft Azure to provide cloud-based access to its servers. However, there are many underlying issues with this partnership. IonQ is up 283% YTD and has been one of the best-performing stocks this year. However, its financials aren’t that strong. The company has consistently missed earnings estimates for the past three quarters and has a current operating margin of -687.65%. That indicates a lack of profitability and earning potential. On paper, IonQ is promising, having partnered with industry heavyweights in this sector. However, it is important to note that other companies, too, are in direct competition. Azure hosts four other companies, along with itself, as quantum computing providers. Other competitors include the PASQAL group, founded and led by Nobel Prize laureate Dr. Alain Aspect. When coupled with industry leaders IBM (NYSE:IBM) and Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL), IonQ’s outlook is bleak. IonQ is competing with companies with decades of experience, greater financial strength and intellectual firepower. While it is certainly possible its early entrance may be an advantage, competition will only increase over the next few years. Impressive YTD growth and bearish prospects for the upcoming years make IonQ a stock that investors should consider selling, especially as the quantum-computing market gets saturated. On the date of publication, Michael Que did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. The researchers contributing to this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article. Michael Que is a financial writer with extensive experience in the technology industry, with his work featured on Seeking Alpha, Benzinga and MSN Money. He is the owner of Que Capital, a research firm that combines fundamental analysis with ESG factors to pick the best sustainable long-term investments.   Article printed from InvestorPlace Media, https://investorplace.com/2023/12/3-stocks-to-sell-before-2023-momentum-cools-off-completely/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Market Analysis Crypto & Blockchain Hot Stocks Stocks to Buy Today's Market Crypto & Blockchain Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}