{
    "title": "1 Super Semiconductor Stock (Besides Nvidia) to Buy Hand Over Fist in 2024",
    "date": "2/3/2024",
    "url": "https://www.fool.com/investing/2024/02/03/1-semiconductor-stock-nvidia-to-buy-hand-fist-2024/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 1.18%) is the undisputed leader in artificial intelligence (AI) semiconductor hardware. Its H100 and upcoming H200 data-center graphics chips (GPUs) set the standard for processing AI workloads, giving the company a market share as high as 90% in 2023. But Advanced Micro Devices (AMD -0.58%) has emerged as a worthy competitor. Its new MI300 series of AI data center chips is now widely available, and some of the world's largest technology companies and leading AI developers are lining up to buy them. AI is about to expand beyond the data center, and AMD has a fresh lineup of AI chips for personal computers and devices that will help developers place AI at the fingertips of billions of people worldwide. Here's why AMD stock is a great place for investors to park their money in 2024 (and beyond). AMD just released its financial data for the fourth quarter and full-year 2023 (ended Dec. 31), and the company provided several updates on its slate of AI products. The MI300 was top of mind for investors, as AMD is looking to snatch data-center market share away from Nvidia. The MI300 comes in two configurations. The MI300X is a pure GPU, whereas the MI300A combines GPU and central processing unit (CPU) chips to create the world's first accelerated processing unit (APU) for data centers. The MI300A is the configuration of choice for the new El Capitan supercomputer at the Lawrence Livermore National Laboratory (LLNL), which will be the fastest in the world when it comes online later this year. AMD shipped the majority of El Capitan's MI300A chips in the fourth quarter, with the remaining chips going out in the current quarter. The MI300 is attracting a number of high-profile customers, not only because of its performance, but also because data center operators are trying to diversify their infrastructure as Nvidia continues to suffer supply constraints. Microsoft, Oracle, and Meta Platforms are just a few of the tech leaders that have become MI300 customers. While AMD is admittedly chasing Nvidia in the data center segment, AMD has a 90% market share in AI-enabled personal computers. Its Ryzen 7000 series -- otherwise known as Ryzen AI -- CPUs for computers are designed to handle AI workloads on-device, meaning the user won't have to rely on a cloud or external data center to run advanced generative AI applications, which leads to a faster, more seamless experience. To date, millions of personal computers have shipped with Ryzen AI chips, but AMD is about to launch a new processor that could be more than three times faster. That will likely extend the company's advantage in this space even further. Investors were slightly disappointed with AMD's latest financial report. The company's fourth-quarter revenue came in at $6.17 billion, which beat expectations, but it forecast $5.4 billion in revenue for the upcoming first quarter of 2024, which fell short of the $5.7 billion Wall Street predicted. AMD stock dropped 7% following the report, but I think that's an opportunity for investors to swoop in and buy. That's because the fourth quarter revealed a significant growth acceleration in some of AMD's core segments. Its data center revenue came in at a record-high $2.3 billion, a 38% increase year over year. The same line item was flat in the third quarter (ended Sept. 30). The acceleration was attributed in part to significant growth in demand for data center GPUs -- in other words, AI. But it gets better. AMD had previously forecast that the new MI300 series GPUs would contribute $2 billion to the company's total data center revenue in 2024, but it just revised that guidance significantly higher, to $3.5 billion. A strong customer pool with expanding engagements was the reason, and given the feverish demand for AI processing power, I wouldn't be surprised if that number was revised higher again during 2024. Furthermore, AMD's Client segment (home to the Ryzen AI series of chips) delivered $1.5 billion in revenue, a 62% year-over-year increase. The company expects the strength in that segment to continue following the launch of its next generation of hardware this year. AI is offsetting some of the weakness in other parts of AMD's business. The company saw a drop in its gaming revenue during the fourth quarter, for example, mainly because we have moved past the launch phase of flagship consoles like Sony's PlayStation 5, which means sales will gradually continue to slow. Image source: Getty Images. AMD went through a challenging period during 2022 as inflation and interest rates soared, leading to a slowdown in demand from consumers for big-ticket electronics. It caused a supply glut for the chip sector, which also carried into 2023, and heavily affected AMD's bottom line. The company delivered $2.65 in adjusted earnings per share for the year, down 24% compared to 2022. That places AMD stock at a price-to-earnings (P/E) ratio of 63.3. For context, the iShares Semiconductor ETF trades at a P/E of just 31.9, which means AMD stock is almost twice as expensive as its industry peers. However, Wall Street's consensus estimate suggests AMD will return to growth in 2024 and deliver $3.67 in earnings per share, which would shrink its P/E to 45.5. Then, looking out to 2025, AMD could deliver $5.50 in earnings, which would shrink its P/E to just 30.3 (assuming its stock price remained constant). The high estimate for that year is $9.05, which would result in a P/E of just 18.5. The point I'm making is that AMD stock looks cheaper the further into the future you look, and the company might even obliterate Wall Street's estimates with the help of AI. Investors need only examine Nvidia's performance lately: That company is wrapping up its fiscal 2024 year right now, and its revenue and earnings are expected to have soared by 118% and 368%, respectively. I'm not suggesting AMD will replicate Nvidia's remarkable results (particularly the tripling of its stock price last year), but the strength in demand for AI is unmistakable, and many of Nvidia's top clients are already exploring AMD's MI300 series. Plus, AMD appears to have most of the AI-enabled personal computing market to itself right now. Regardless of AMD's currently elevated valuation, I think investors would do well to buy the stock as long as they can hold for three years or more. The longer the better. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Meta Platforms, Microsoft, Nvidia, and Oracle. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}