{
    "title": "Abercrombie's 285% Surge in 2023 Beats Even Sizzling Nvidia",
    "date": "1 Jan 2024",
    "url": "https://www.businessoffashion.com/news/retail/abercrombie-and-fitch-earnings-beat-expectations/",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. One retail stock has been a clear winner this year as fashion trends revisited the late 90s and early 2000s. Abercrombie & Fitch Co. has gained 285 percent this year, its best annual performance since going public in 1996. The rally has made the company the best performer in the S&P 1500 Index, even managing to beat out artificial intelligence darling Nvidia Corp.’s 239 percent gain. The retailer has also handily outperformed its peers — the S&P Retail Select Industry Index rose 20 percent this year. The strong showing is a sharp pivot from 2022, when the retailer’s shares fell 34 percent as the broader stock market was dragged down by an uncertain economic backdrop and cautious consumers. Heading into this year, however, Abercrombie cleared extra inventory and focused on its target audience, young Millennial and Gen-Z shoppers heading back to work, school and social lives after the pandemic. “The work that’s been done to right-size the store base, reduce occupancy costs, remodel the stores, improve and make investments in the digital channel and the store channel is what’s allowing them to drive both margin growth and improve profitability,” said Telsey Advisory group chief executive officer Dana Telsey, who has an outperform rating and $95 price target on shares. She added that the Hollister turnaround and potential for international growth are bright spots going forward. “They’ve done a very good job which has shown up in the stock price.” Abercrombie has also expanded its offerings to include work-wear, special-occasion and active apparel, according to Argus Research analyst Kristina Ruggeri. “The strategy has helped the company target its messaging and expand its addressable market beyond jeans and other casual clothing,” she wrote in a Dec. 19 note. Ruggeri, who has the highest price target on Wall Street at $97, said she expects Abercrombie to continue its momentum of higher sales and margins through the holiday season, helped by higher pricing, lower freight costs and a return to a stable supply chain. In addition, solid quarterly results have lifted Abercrombie shares this year. In its latest earnings release, the retailer not only reported stronger-than-anticipated third-quarter sales but boosted its full-year net sales outlook again. Some investors are taking profits now as the year comes to a close. Shares of Abercrombie fell 4.7 percent this week as Friday capped a five-session losing streak, the stock’s longest since April. Wall Street is also largely neutral on Abercrombie shares, with only about a third of the analysts covering the company giving it a buy-equivalent rating, according to data compiled by Bloomberg. The average price target is $78, implying a roughly 12 percent decrease from where shares currently trade. Still, there’s optimism that Abercrombie can continue to deliver on its strong year — analysts have boosted fourth-quarter adjusted earnings-per-share expectations by more than 30 percent in the past month, data compiled by Bloomberg shows. Citigroup Inc.’s Paul Lejuez, who has a neutral rating and $82 price target on the shares, thinks the company could deliver another earnings beat. “Abercrombie’s momentum can continue, though it will be tougher to deliver upside against already high expectations,” he wrote in a note after its November earnings release. By Carmen Reinicke Learn more: Abercrombie & Fitch Lifts Annual Sales Forecast After Upbeat Quarter Abercrombie & Fitch Co. on Tuesday raised its annual net sales growth forecast, signalling strong demand for its lifestyle brands heading into the crucial holiday shopping season. © 2024 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions While the Nordstrom family is pushing for private ownership, Macy’s faces an unsolicited hostile bid. Both scenarios could dramatically change the retail landscape in the United States. Spending data shows millions of consumers are shopping on the Chinese app after seeing its ubiquitous marketing. Worryingly for competitors, customers appear to like what they’re seeing. When the American sportswear retailer announced the return of its controversial founder as CEO Wednesday, investors were perplexed. BoF unpacks why Plank may be back — and the challenges that lie ahead in his bid to transform its fortunes. The category’s biggest brands by market capitalisation report results this week, and will need to show they have a plan to fend off fast-growing competition. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   "
}