{
    "title": "Investors Bought This Hyper-Growth Artificial Intelligence (AI) Stock Hand \nOver Fist in 2023. Will It Split Its Shares in ...",
    "date": "1 Jan 2024",
    "url": "https://finance.yahoo.com/news/investors-bought-hyper-growth-artificial-190500249.html",
    "text": "It would be difficult to not mention Nvidia (NASDAQ: NVDA) when recapping the stock market's 2023. The rise of artificial intelligence (AI) and Nvidia's triple-digit surge are arguably among 2023's leading headlines. By the end of December, Nvidia had rocketed to roughly $500 per share, a steep price for many investors who want to buy whole shares. Will the stock split in 2024 and bring down the price of a full share? Should that affect whether investors should continue buying shares? Here is what you need to know. Predicting a stock split isn't rocket science, and some clues point to it happening soon with Nvidia. The company has a history of splitting its stock, which is when a company multiplies or divides its share count without changing overall market capitalization. So, if the number of shares goes up, the value per share goes down. Nvidia's most recent split came in 2021. Shares were trading at $744 before the split. Nvidia isn't yet at such a high share price, but it's getting within shouting distance at $500. Before 2021, Nvidia split its stock four other times between 2000 and 2007. Shares rose 334% over those seven years. I think management likes to keep the share price palatable for most investors. The rapid growth of AI in 2023 has also established a growth narrative around Nvidia that could stretch well into the future. In other words, Nvidia's fundamentals seem destined to carry the stock higher over the coming years, and that makes me think a Nvidia stock split is a matter of when and not if. Investors must understand what stock splits do and don't do. Splits reduce the trading price of a share of stock. This makes it cheaper to own a piece of that business, but a split doesn't fundamentally affect a stock's value. It creates a lower share price by splitting the stock into more pieces (shares). For example, suppose you want some pie. You go to the store and see a pie worth $40 selling as two halves for $20 each. You don't want to pay $20 for pie, so you ask the store to cut the halves to divide the pie into four quarters selling for $10 each. In that case, you're paying $10 for pie but getting a smaller piece. Stock splits work the same way. The company is worth the same, but investors are paying a smaller share price for a smaller piece of the business the stock represents. That's not necessarily bad, but remember that stock splits don't change fundamental value, only the share price. Investors who can't afford a full share could also check out buying fractional shares. Investors should buy Nvidia if they like where it's business is going, not because of anything management does with share count. The good news is that Nvidia looks like a great long-term buy. It is the overwhelming market leader in AI chips, which are being put in massive data centers to process intense computing workloads. Revenue in the company's most recent quarter was up 200% from the year-ago quarter. Analysts are predicting long-term earnings growth averaging 42% annually. Despite its massive run in 2023, the stock trades at a forward P/E of just 40. The resulting price/earnings-to-growth (PEG) ratio of just 1 signals that the stock is a bargain, assuming long-term growth estimates materialize. No stock is risk-free. Competition will surely come for Nvidia and hitting growth estimates isn't a sure thing. But if investors intend to hold for the long term, they should be rewarded. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of the S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of December 18, 2023  Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Investors Bought This Hyper-Growth Artificial Intelligence (AI) Stock Hand Over Fist in 2023. Will It Split Its Shares in 2024? was originally published by The Motley Fool Related Quotes "
}