{
    "title": "Dow Jones Dives 300 Points Ahead Of Today's Fed Minutes; Coinbase, Nvidia, \nTesla Sell Off",
    "date": "1/3/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-fall-ahead-of-fed-minutes-coindesk-nvidia-tesla-slide/",
    "text": "BREAKING: Futures Steady; FedEx Soars, Apparel Giants Tumble     The Dow Jones Industrial Average dropped 300 points Wednesday morning ahead of minutes from the Federal Reserve's latest policy meeting. Meanwhile, stock market leaders Coinbase Global (COIN) and Nvidia (NVDA), along with Tesla stock, fell sharply in early morning trading. After the opening bell, the Dow Jones Industrial Average dropped 0.8%, while the S&P 500 fell 0.75%. The tech-heavy Nasdaq composite declined 1% in morning action. Among U.S. exchange traded funds, the Nasdaq 100 tracker Invesco QQQ Trust (QQQ) was down 0.9%, while the SPDR S&P 500 ETF (SPY) fell 0.7%. Oil prices looked to rebound after a four-day losing streak, as West Texas Intermediate futures gained nearly 2% Wednesday morning. WTI futures moved above $71 a barrel. Magnificent Seven stocks Nvidia and Tesla (TSLA) lost 1.5% and 4%, respectively, Wednesday morning. Nvidia ended Tuesday's session down 2.7%, holding just above a double-bottom base's 476.09 entry. Nvidia, an IBD Leaderboard stock, also is now forming a flat base that has a 505.48 buy point. A test of the 50-day line seems likely after the recent weakness. Electric-vehicle giant Tesla edged lower Tuesday after the company's stronger-than-expected fourth-quarter deliveries. Tesla stock has a big double-bottom pattern with conventional buy point of 278.98. Early Wednesday, data from the China Passenger Car Association showed that Tesla sold 94,139 China-made electric vehicles in December, a 68% increase from a year earlier, according to Reuters. Meanwhile, Coinbase tumbled another 4.5% in morning trade Wednesday, threatening to extend a losing streak to three sessions. On Wednesday morning, the manufacturing index from the Institute of Supply Management edged higher to 47.4 in December, up from November's 46.7 reading. Further, the Labor Department's Job Openings and Labor Turnover Survey (JOLTS) report showed job openings of 8.79 million in November, above estimates for 8.75 million and up from October's 8.733 million. Later on Wednesday, Fed minutes are expected at 2 p.m. The minutes are expected to provide insight into the Federal Reserve's thinking on future interest rate moves. Stock Market Forecast 2024: A Soft Landing May Not Bring The Gains You Expect The Nasdaq composite slumped 1.6% but held support at its 21-day exponential moving average. At one point Tuesday, the Nasdaq composite was down 2.2%, on pace for its worst first trading day of the year since 2001, when it fell 7.2%. Meanwhile, the Dow Jones rose modestly Tuesday, holding at its recent highs. Tuesday's Big Picture column commented, \"If you haven't done so already, now is the time to be raising some cash by taking partial or full profits in some of your big winners.\" Now is an important time to read IBD's The Big Picture column amid the continuing stock market rally. Be sure to read how to invest during the ongoing uptrend. Learn How To Time The Stock Market With IBD's ETF Market Strategy Magnificent Seven player Alphabet (GOOGL), Celsius (CELH), Netflix (NFLX) and Snowflake (SNOW) — along with Dow Jones components Amgen (AMGN), Caterpillar (CAT) and Visa (V) — are among the best stocks to buy and watch in the current market rally. Caterpillar and Nvidia are featured in this Stocks Near A Buy Zone column. Get Real-time Buy And Sell Alerts On Stock Market Leaders With IBD Leaderboard Drug leader Amgen is breaking out past a 288.46 official buy point in a flat base, with a 3.25% breakout move Tuesday. AMGN stock rose another 1.3% early Wednesday. Heavy machinery giant Caterpillar gave up its 293.88 buy trigger, amid a 1% drop Tuesday. CAT stock was off 1.5% Wednesday morning. Payments leader Visa remains in buy range above a 250.06 entry in a cup base, according to IBD MarketSmith pattern recognition. V stock was down 0.1% Wednesday. 4 Top Growth Stocks To Watch In The Stock Market Rally Alphabet gave up its 139.42 buy point in a cup with handle following a 1.1% drop Tuesday, according to IBD MarketSmith. GOOGL stock inched lower early Wednesday. Netflix declined 3.8% Tuesday, ending squarely below a 482.70 buy point out of a cup with handle. NFLX stock gained 0.7% Wednesday morning. Fitness drink leader Celsius raced higher Tuesday, rebounding bullishly from the 50-day line. Investors could view the recent strength as an aggressive entry. The official buy point is 68.95. Investors could use 62.99 or a downward-sloping trendline as other early entries. CELH stock fell 0.9% Wednesday morning. Artificial intelligence leader Snowflake tumbled nearly 5% Tuesday, falling below a cup-with-handle's 192.66 buy point. SNOW stock declined 1.9% early Wednesday. IBD's latest newsletter MarketDiem gives you actionable ideas for stocks, options and crypto right in your inbox These are four best stocks to watch in today's stock market, including a Dow Jones leader. Join IBD experts as they analyze leading stocks in the current stock market rally on IBD Live Among the Dow Jones stocks in the Magnificent Seven, Apple (AAPL) and Microsoft (MSFT), traded mixed after Wednesday's stock market open. Apple sold off 3.6% Tuesday after Barclays downgraded the stock to underweight from equal weight. AAPL stock dropped 0.8% early Wednesday, further below a 192.93 buy point. Microsoft stock declined 1.4% Tuesday, still modestly above a 366.78 cup-base buy point. And the software giant was up 0.2% Wednesday morning. Be sure to follow Scott Lehtonen on X, formerly known as Twitter, at @IBD_SLehtonen for more on growth stocks and the Dow Jones Industrial Average. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders Nvidia, Tesla, Meta Reveal Rules For Santa Claus Rally And Beyond Spot Buy Points And Sell Signals With MarketSmith Pattern Recognition 3/21/2024\nThe major indexes faded from record highs as Apple fell on a DOJ lawsuit. But many stocks flashed buy signals.... 3/21/2024\nThe major indexes faded from record highs as Apple fell... Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}