{
    "title": "Nvidia, US National Science Foundation team up to improve AI innovation",
    "date": "2/3/2024",
    "url": "https://coingeek.com/nvidia-us-national-science-foundation-team-up-to-improve-ai-innovation/",
    "text": " Home » Tech » Nvidia, US National Science Foundation team up to improve AI innovation Tech   3 February 2024 As generative artificial intelligence (AI) adoption reaches new levels, Nvidia (NASDAQ: NVDA) has confirmed a partnership with the U.S. National Science Foundation (NSF) for a pilot program establishing uniform research infrastructure for the technology. The National Artificial Intelligence Research Resource (NAIRR) pilot program sees Nvidia team up with federal agencies and a string of private-sector organizations to provide researchers access to tools supporting AI innovation. Nvidia pledged $30 million in technology contributions for the next two years, saying that the pilot program with the NSF will play a significant role in fueling new AI innovation across the U.S. amid a global AI race. “The breadth of partners that have come together for this pilot underscores the urgency of developing a National AI Research Resource for the future of AI in America,” NSF Director Sethuraman Panchnathan remarked. “By investing in AI research through the NAIRR pilot, the United States unleashes discovery and impact and bolsters its global competitiveness.” Firms and research institutions involved in AI studies will be provided with computing power, advanced software, AI chips, and models to power their research. Going forward, the pilot will focus on domain-specific AI research while paying keen attention to startups outside the AI innovation ecosystem. A key part of Nvidia’s mission statement is supporting small-scale institutions and underrepresented populations exploring AI. For starters, the program will help researchers build safe AI systems before expanding to back studies on healthcare and environmental sustainability. Nvidia is expected to provide NAIRR and selected research institutions with its state-of-the-art supercomputing and AI capabilities. In particular, Nvidia will bring its DGX Cloud AI supercomputing resource and its AI Enterprise software. US government eyes AI supremacy While critics have poked holes in its handling of the Web3 sector, the U.S. is keen on leading global AI innovation. Currently, China, the U.K., and the European Union (EU) are providing stiff competition, with the U.S. holding on to a slender lead. NAIRR’s launch follows an executive order from U.S. President Joe Biden in 2023 to roll out a pilot to support AI innovation. Alongside the race for innovation, the U.S. is also pursuing safety standards for the technology, urging developers to label AI-generated content and ensure proper data handling and copyright standards. In order for artificial intelligence (AI) to work right within the law and thrive in the face of growing challenges, it needs to integrate an enterprise blockchain system that ensures data input quality and ownership—allowing it to keep data safe while also guaranteeing the immutability of data. Check out CoinGeek’s coverage on this emerging tech to learn more why Enterprise blockchain will be the backbone of AI. Watch: What does blockchain and AI have in common? It’s data width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"> New to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology. The sCrypt Hackathon will officially take place on March 25, but an introductory presentation was held at San Francisco's Fairmont Hotel on March 17 with Xiaohui Liu, David Case, and more. Baichuan Inc. and the Chinese Information Processing Laboratory Institute of Software, Chinese Academy of Sciences researchers present a new LLMs pruning system that builds upon previous techniques. Working as a cryptographic protocol, the Threshold Signature Scheme enhances security and trust in distributed systems by ensuring that no single party can unilaterally generate a signature. Join the official Bitcoin SV Discord channel: www.discord.gg/bsv "
}