{
    "title": "Nvidia stock is a 'best idea' for 2024: Stifel",
    "date": "1/3/2024",
    "url": "https://finance.yahoo.com/video/nvidia-stock-best-idea-2024-155145161.html",
    "text": "Nvidia (NVDA) was the S&P 500's top performer in 2023 with shares rallying 239%, and analysts at Stifel think the chipmaker still has room to run. Analyst Ruben Roy named Nvidia a 'best idea' for 2024, telling Yahoo Finance Live the chipmaker is 'well positioned' given the shift from general purpose compute to accelerated compute. \"There are different layers of Nvidia's AI strategy,\" Roy said. \"There’s chips and hardware, but there's also networking behind it, and probably the most important piece that investors will start thinking about this year is software.” Roy noted the move to accelerated compute represents Nvidia's \"most significant revenue and profitability growth opportunity\" over the next several years. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino [AUDIO LOGO] SEANA SMITH: Analysts are still feeling bullish on NVIDIA after the stock climbed over 200% last year. Stifel, one of those names, and doesn't expect the AI momentum to slow down anytime soon, calling the chip stock a quote, \"best idea\" for 2024. We want to bring in the analyst behind that call, Reuben Roy, he's a Stifel Applied Technology analyst there. Reuben, it's great to have you here. So I think a lot of people are asking what exactly the gains could look like here for NVIDIA, at least over the next 12 months, given that massive rally that we saw last year. So what's the catalyst here for that upside to continue? REUBEN ROY: Yeah, it's a great question. And thanks for having me. So we put out our trends report-- the tech team at Stifel yesterday. And top 10 trends-- we do this every year. And really, it was about AI, not surprisingly. But it was more about the broadening of AI. Last year, it was a lot about NVIDIA and GPU clusters, and this massive dollars being spent by the cloud service providers on building out training networks. But when you look past that-- AI servers, AI PCs-- there's a lot of AI innovation and applications coming behind, right? And when we looked at all the companies that could potentially benefit, guess what. NVIDIA ticks all the boxes, right? So NVIDIA is still playing in the clusters, we think. There's still going to be an investment cycle continuing for AI training clusters. But when you look beyond that, we do think that if you think about AI servers that are going to be doing the next step of AI-- so we're training last year, training this year, then inference. Where are we going to make the money? Where are the ROIs going to come from? And NVIDIA ticks those boxes. So we think it's going to be a good year. Numbers went up massively last year. But there are different layers of NVIDIA's AI strategy. You've got the chips, the hardware, which is the biggest piece, but then there's networking behind it that networks all of these clusters together. And probably, the most important piece that I think investors really will start thinking about this year is software. And NVIDIA came up with a software stack, CUDA, that is the ecosystem of AI right now. And if you look at Apple and iOS, the way we're thinking about it is if you can win the developer, you're going to win the hardware. And so I think that's what the next stage of the NVIDIA story for this year is going to be. Related Quotes "
}