{
    "title": "Nvidia could spike another 23% with AI demand still in its infancy, BofA \nsays",
    "date": "2/3/2024",
    "url": "https://www.businessinsider.in/stock-market/news/nvidia-could-spike-another-23-with-ai-demand-still-in-its-infancy-bofa-says/articleshow/107371168.cms",
    "text": "Liked the article? Share it with your friends... or copy link Even after a 350% rally since the start of 2023, Nvidia stock still offers investors a \"compelling valuation\" with AI demand in its infancy, according to Bank of America. The bank increased its Nvidia price target to $800 from $700 on Thursday, representing potential upside of 23% from current levels. Shares of Nvidia surged 5% to a new record high of $661.19 on Friday. \"Early days, but results from top US cloud customers suggest solid motivation for spending in GenAI,\" Bank of America analyst Vivek Arya said. This week's earnings results from Meta Platforms, Microsoft, Amazon, and Alphabet revealed that AI spending is top of mind for the mega-cap tech giants as they seek to solidify their standing in the fast-growing industry. And that's great news for Nvidia, who develops and sells the GPU chips that enable most AI technologies. It's worth noting that the mega-cap tech giants are leading the pack in AI spend, but there are plenty of other companies that are just starting to map out and implement their AI roadmap, and that should generate demand for Nvidia's AI offerings for years to come. \"Enterprise genAI adoption has yet to kick off and become more material in CY25, with Nvidia benefitting from its widespread availability on public clouds, and unique partnerships with ServiceNow, SAP, VMWare, Dell, HPE and others,\" Arya said. Arya said he expects Nvidia to deliver a measured revenue beat when it reports earnings later this month, as well as solid earnings growth. Longer-term, Arya sees Nvidia generating more than $40 in earnings per share power. \"Nvidia is one of the rare large-cap tech stocks trading at 31x/25x CY24/25 PE, below its 45% CY23-25 [estimated] EPS CAGR. We see a path to $40 in EPS power in CY27E at $160 billion+ in accelerator TAM and much higher (maybe 2x or $80/share) if the TAM were to hit AMD's (likely very optimistic) $400 billion level,\" Arya said. Nvidia's earnings power comes from its domination of the market, with Arya estimating that the company will maintain a 90% share of the AI training market and a more than 50% share of the AI inference market. \"Nvidia's diversity of SKUs between ~$1.2k to over $30k, and hence will not leave any part of the compute market uncovered,\" Arya said. Advertisement "
}