{
    "title": "Cathie Wood's Ark Invest Is Selling Nvidia Stock and Buying This Artificial \nIntelligence (AI) Stock",
    "date": "3/3/2024",
    "url": "https://finance.yahoo.com/news/cathie-woods-ark-invest-selling-195800197.html?ref=mc.news",
    "text": "Cathie Wood is the founder and chief investment officer at Ark Invest, an asset management company focused on disruptive innovation. Ark manages several thematic index funds built around burgeoning technologies like artificial intelligence (AI), but the firm continued to sell down its position in Nvidia (NASDAQ: NVDA) throughout February. That may strike readers as strange given that Nvidia graphics processing units are synonymous with AI infrastructure. But the stock has advanced 236% over the past year, so Ark is taking profits and reinvesting capital into other AI companies. For instance, the firm bought shares of Pinterest (NYSE: PINS) throughout February. The social media company now accounts for a little more than 1% of Ark's $14 billion portfolio. Here's what investors should know. Pinterest reported mixed financial results for the fourth quarter. Global monthly active users (MAUs) increased 11% to 498 million and average revenue per user (ARPU) increased 2% to $2.00. Wall Street analysts anticipated slightly slower MAU growth, but slightly faster ARPU growth. As a result, Pinterest missed top-line estimates. Revenue increased 12% to $981 million, but Wall Street was looking for $991 million. Despite that shortfall, the company beat bottom-line estimates due to effective expense management. GAAP net income reached $201 million in the fourth quarter, up from $17 million in the prior year. Pinterest shares declined about 10% following the release of the report, and the stock is still 60% below the record high it reached in early 2021. But the company is executing on a sensible growth strategy by investing in artificial intelligence (AI) and partnering with third-party advertisers. Those moves could create value for patient shareholders in the years ahead. Pinterest operates a social media platform that lets users explore and curate visual content to discover new products and ideas. Its monthly user base trails that of Meta Platforms' Facebook and Instagram, ByteDance's TikTok, and Snap's Snapchat, but Pinterest still ranks among the 15 largest ad tech companies in the world. That positioning is a product of its ability to collect consumer data and influence shopping decisions, and ongoing investments in AI help make that possible. In the first quarter, Pinterest CEO Bill Ready said: Nearly a year ago, we began moving to next-gen AI capabilities, enabling us to use recommender models that were 100x larger than before. We combined our first-party proprietary data with our AI-based computer vision and search technologies to improve perceived relevance for recommendations on related pins, driving perceived relevance up by nearly 10 points from a year ago to 94%. In the fourth quarter, Pinterest added generative AI search guides to help users refine queries and take action (make purchases) more easily. It also debuted an AI-powered organization feature that automates content curation for users. Management says those innovations create a powerful flywheel. Specifically, Pinterest's ability to make relevant recommendations improves as user engagement improves, simply because engagement creates data the company can feed into its machine learning models. In addition to AI innovation, Pinterest has partnered with Amazon and Alphabet's Google to bring third-party advertising to its platform. Specifically, Amazon ads are live in the U.S. on Pinterest search and the home feed, and Google ads are live in international markets. Those partnerships let Pinterest tap advertising demand beyond its own ecosystem, and its partnership with Amazon in particular makes it easier for users to buy products they see on the platform. Going forward, digital ad spending is projected to grow at 15% annually through 2030, according to Grand View Research. How quickly Pinterest grows depends on its ability to generate demand among advertisers, which itself depends on its ability to engage users with relevant content and drive desirable outcomes for brands. On that front, management is making sensible decisions that could lead to market share gains. Wall Street expects Pinterest to grow sales at 15% annually over the next five years, so that consensus estimate leaves room for upside if the company does indeed gain share. In either case, its current valuation of 8.2 times sales seem reasonable. As a caveat, Pinterest faces tough competition from larger, more popular social networks that could siphon advertising dollars away from its platform. But unlike Pinterest, those competing platforms are not purpose-built for product discovery. In other words, Pinterest is undoubtedly an underdog, but it also has unique strengths that could make it more effective in driving social commerce. If the company harnesses that potential, it could create substantial value for patient shareholders. Investors comfortable with that risk should consider buying a small position in Pinterest today. Personally, I like Ark's decision to allocate about 1% of its portfolio to the stock. Should you invest $1,000 in Pinterest right now? Before you buy stock in Pinterest, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Pinterest wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Trevor Jennewine has positions in Amazon, Nvidia, and Pinterest. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, Nvidia, and Pinterest. The Motley Fool has a disclosure policy. Cathie Wood's Ark Invest Is Selling Nvidia Stock and Buying This Artificial Intelligence (AI) Stock was originally published by The Motley Fool Related Quotes "
}