{
    "title": "1 Solid Artificial Intelligence (AI) Stock Not Named Nvidia to Buy Right \nNow Before It Soars",
    "date": "1/3/2024",
    "url": "https://www.fool.com/investing/2024/01/03/1-solid-artificial-intelligence-ai-stock-not-named/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More There is no doubt that Nvidia (NVDA 1.18%) has been one of the hottest stocks on the market over the past year thanks to huge demand for artificial intelligence (AI) chips the company sells. But this is precisely the reason why investors may be looking for other ways to tap the AI boom. After all, Nvidia stock's 239% surge in 2023 made the stock expensive. It now sports a price-to-sales ratio of about 27 and a trailing earnings multiple of 65. Nvidia seems capable of justifying those multiples with impressive growth. The company is expected to finish the current fiscal year with a 118% jump in revenue to $59 billion, followed by another jump of 56% in the next one. It may even grow at a faster pace than what consensus estimates are projecting. But still, some investors may be on the hunt for cheaper alternatives. This is where Taiwan Semiconductor Manufacturing (TSM 1.97%), popularly known as TSMC, steps in. The chip stock is expected to deliver solid growth in 2024, and is trading at significantly cheaper multiples than Nvidia. Let's look at the reasons why investors might want to consider buying TSMC right now. The AI chips that Nvidia sells are manufactured by its foundry partner TSMC, which is why TSMC seems a solid bet for investors seeking an alternative AI chip play. Shares of the Taiwan-based company jumped 40% in 2023, underperforming the PHLX Semiconductor Sector index, which clocked much stronger growth of 66%. However, that's good news for opportunistic investors, as TSMC stock is trading at a much cheaper valuation than Nvidia's. TSMC sports a price-to-earnings (P/E) ratio of 19, which is lower than the company's five-year average P/E ratio of 22. Investors can consider buying TSMC stock hand over fist at its current valuation, as revenue and earnings growth are expected to pick up impressively in 2024. More specifically, TSMC's revenue was predicted to decline almost 9% in 2023 to $69 billion thanks to the weak demand for smartphones and personal computers (PCs). AI, however, is likely to change the picture this year.  TSM Revenue Estimates for Next Fiscal Year data by YCharts As the chart above shows, TSMC is expected to post 20%-plus revenue growth rates over the next couple of years. A key reason why TSMC's growth is likely to accelerate is that the company's advanced chips, which are manufactured using 5-nanometer (nm) and 3-nm process nodes, are in strong demand from the likes of Nvidia. These advanced chips are manufactured using TSMC's advanced packaging technology, known as chip-on-wafer-on-substrate (CoWoS). Market research firm IDC estimates that CoWoS packaging capacity is expected to jump a whopping 130% in the second half of 2024. In other words, sales of TSMC's AI chips are likely to take off, as the company will be in a position to boost shipments this year and bridge the 20% demand-supply gap that currently exists in CoWoS packaging. It is also worth noting that TSMC could win big from the growing adoption of its 3nm chips in the long run, as this process node is expected to help chipmakers create $1.5 trillion worth of chips over the next five years. All this explains why TSMC's bottom-line growth is set to accelerate as well.  TSM EPS Estimates for Current Fiscal Year data by YCharts Assuming TSMC does hit $7.72 per share in earnings in 2025, as the chart above indicates, and trades at its five-year average forward earnings multiple of 21.3 at that time, its stock price could reach $165 in two years. That would represent a 58% jump from current levels. However, TSMC stock could jump higher if the market rewards it with a higher earnings multiple. It is worth noting that TSMC's forward earnings multiple is cheaper than the 29 average forward P/E of the Nasdaq-100 index, which can serve as a proxy for tech stocks considering that it is mostly made up of tech stocks. If TSMC trades at 29 times forward earnings in a couple of years, the company's stock could jump to $224 based on projected 2025 earnings. That points toward an even bigger upside of 115% from current levels. All this shows why investors would do well to buy TSMC stock while it is still cheap since it could soar impressively in the long run. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}