{
    "title": null,
    "date": "1/15/2024",
    "url": "https://seekingalpha.com/article/4662675-apple-buffett-likes-them-but-i-dont-and-heres-why",
    "text": "designer491  designer491 Apple (NASDAQ:AAPL) is a stock that is loved by many. Although I don't care much for the stock, I do like the company itself. I often use their products & services, and I'm actually using an Apple Mac to type this article as we speak. And every day I use their products like Apple TV, Apple Music, and their AirPods and iPhone. But I've never owned their stock and probably never will; although I think they are a fine business and will likely continue to be for the foreseeable future. In this article I get into why the stock is loved by many but is not the apple of my eye. Apple is frequently covered here on Seeking Alpha. There are tons of articles published on the platform every day, so there's no shortage of coverage when it comes to the company. One reason I think it gets a lot of coverage is because Warren Buffett owns it. Like myself, Buffett also enjoys dividends, and he's one of the reasons I started investing in dividend stocks. I last covered AAPL stock back in August of last year (an Editor's pick) which you can read here.  I talked about the things I liked about the company, such as their products & services, but I also mentioned how the company wasn't my type of dividend stock. Many in the comments argued that AAPL is not considered a dividend stock and that most invest in the business because of the growth it offers. While I do agree Apple is a growth company, it is indeed a dividend stock. But that further proves my point that no one invests in the company for the dividend because it's too low! And it's not because they can't afford to pay a larger one; they could literally 4X the dividend, and it would still be well-covered with cash flow. Since my last article, Apple has reported its latest Q4 quarterly earnings this past November. During their Q4, the company did what they normally do. They beat on both the top & bottom line, bringing in revenue of $89.50 billion and earnings per share of $1.46. This was up from $81.8 billion in the third quarter. EPS was also up from $1.26 in the prior quarter, a growth rate of roughly 9.4% and 16% respectively quarter-over-quarter. Despite the challenging macro environment, Apple continued its impressive growth. Additionally, the company also posted an all-time high in revenue in large, populous countries like India, Brazil, Canada, Mexico, and Saudi Arabia to name a few. iPhone revenue was up 3% year-over-year, while services revenue was also at an all-time high of $22.3 billion, a 16% increase from the year prior. However, Mac revenue continued trending downward for the second straight quarter, down 34% year-over-year. Despite this, both gross margins & (gross) product margins were up 70 & 40 basis points respectively. Although the company faced some foreign exchange headwinds, supply chain disruptions and subsequent demand issues, they had an overall strong year. So, with that being said, here's my quarrel with the company. Since the split in 2020, AAPL has raised their dividend by $0.01 and is a dividend contender with more than 10 years of increases under its belt. They currently have an annual payout of $0.96 and if I was a betting man I'd say the annual payout for 2024 is going to be a $1.00, or $0.25 a share. Now some might say an increase is more than you had before and that is true. But penny increases from a company like Apple are a slap in the face to shareholders. Some companies will increase their dividend by a small percentage to keep their streaks going to make it to Aristocrat or King status, but I don't think AAPL prioritizes their dividend streak at all. I do think they will continue increasing the dividend, but just by a penny or two for the foreseeable future. For the last two years, AAPL brought in roughly $100 billion in net income and free cash flow. And over the same period they've paid out roughly $15 billion in dividends. This gives them a very low payout ratio in the teens, showing the company has ample room to increase the dividend if they desired. Furthermore, the company is not very CAPEX intensive, averaging roughly $11 billion in capital expenditures over the same period. Author creation Author creation Below are the cash from operations & free cash flow projections for AAPL over the next three years. Free cash flow is expected to grow nearly 19% from the end of fiscal year 2024 to 2026 while cash from operations is expected to grow roughly the same at 19% as well. No one can predict how much Apple will grow their dividend, but if history repeats itself, I say the annual payout will be no more than $1.06. Author creation Author creation According to Seeking Alpha, they expect AAPL's annual dividend payout to be $1.09 with a high of $1.22. I doubt it will be that high, but you never know what the future may hold. The company definitely has the free cash flow to afford it. Seeking Alpha Seeking Alpha Some may argue against this as AAPL is known for buying back shares, which is a way of returning cash to its shareholders. In Q4 the tech giant returned $25 billion to shareholders including, $3.8 billion in dividends, and $15.5 billion through share repurchases. Furthermore, they began their accelerated repurchase program for $5 billion, retiring 22 million shares. The company currently has 15.5 billion shares outstanding according to their 10-K. And I expect this to continue to decrease over the next few years as the company takes a substantial amount of shares off the market. That's why I prefer companies like Costco (COST) over AAPL. Not only does the company have better dividend growth, but they also rewarded their shareholders with a $15 special dividend recently, the 5th time since 2012 that they have paid a special. And the company elected to pay this from the available cash on its balance sheet. This ended up costing COST an additional $6.7 billion. Both are cash cows, but one prioritizes rewarding its shareholders, while the other prefers to be more conservative. I discuss this in my Costco article, which you can read here. Similarly to Costco, Apple has a strong balance sheet with ample liquidity available. So, if the company decided to reward shareholders with a special like COST, they would be able to pay this from either the free cash flow, or the $30 billion the company had on its balance sheet at the end of Q4. They also don't have much debt maturing this year with $9.9 billion, and $10.7 billion in 2025. With their A credit rating, AAPL doesn't have much to worry about in the debt department. They've also been decreasing their debt over the last two years, further signifying their financial strength. One risk the company could face is a share price decline. Over the last year the stock is up 41% climbing from $133 to the current price of $186 at the time of writing. While many companies have experienced volatility due to the recent macro environment, AAPL's share price seems to have been the exception. This could be a huge risk, as stocks that experience a great run up in price usually experience some type of price correction. Then again, some continue to trend even higher, i.e. Costco. But like the old saying goes, \"What goes up must come down\" and AAPL's share price could see this happen. Many are also calling for a recession sometime in the near future. If the economy does experience a recession, then AAPL could definitely not only see a share price decline, but a decline in revenues & earnings. With high unemployment, the business would likely suffer a decline in their products. Wearables & accessories would also likely see a fall in revenue as consumer spending becomes even tighter. Mac revenue is already down 34% year-over-year, and this would likely continue if we enter a recession. Furthermore, the company still faces a pending lawsuit which caused AAPL to halt the sales of its smartwatch due to a patent dispute. Although they were able to sell their apple watches again, the return to stores is only temporary. This could also have a negative effect on Apple Watch sales if they are not allowed to sell these in the future. Apple is a great company for growth investors, but as a dividend investor the stock heavily disappoints. The company is a cash cow with a strong balance sheet, and could easily afford increasing their dividend by a substantial amount. Although they do conduct buybacks returning cash to its shareholders, I prefer companies like Costco who not only has better dividend growth, but rewards shareholders with special dividends as well. Since my last article in August, the stock has traded sideways and trades only $6 above the share price then. AAPL has an immense following and is beloved by many, but as a dividend investor, they are not my choice when searching for buy and hold dividend companies. Although their dividend yield and growth are both subpar, I would maybe consider owning the stock if they experienced a huge price correction or a stock split. Because of their valuation, low dividend growth, and the possibility of a recession, I continue to rate the stock a sell. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}