{
    "title": "Tech earnings due out this week: Amazon, Microsoft in focus",
    "date": "1/29/2024",
    "url": "https://finance.yahoo.com/video/tech-earnings-due-week-amazon-164345039.html",
    "text": "A majority of the Magnificent Seven component stocks — Alphabet (GOOG, GOOGL), Amazon (AMZN), Apple (AAPL), Meta Platforms (META), Microsoft (MSFT) — are set to report fourth-quarter earnings this week. Yahoo Finance Live co-hosts Rachelle Akuffo and Akiko Fujita examine expectations on Amazon's business segments and AI tech drivers after Microsoft surpassed a $3 trillion market cap. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. RACHELLE AKUFFO: All right, time now for today's trending ticker. We're watching the big tech stocks. Amazon, Alphabet, Meta, Microsoft, and Apple all set to report results this week. Akiko, I'm zoning in on Amazon, so they're reporting on Thursday. I think it'll give us a really good look at a mix of things. You have the consumer demand that we're seeing, especially after Amazon touted its record-breaking holiday sales. Of course, you have streaming, you have sports, you have cloud in relation to AI, as well that I'll be looking at. And, of course, the new rollout of its ad-supported tier that MoffettNathanson lead analyst Michael Morton called the 500-pound gorilla entering the room. And he's looking at its active user subscriber base on par with Netflix, releasing some upside for this year and next year as well, Akiko. AKIKO FUJITA: Yeah, of course, AWS, the big driver for Amazon always. That's the number we're going to be watching closely. But some interesting headlines today, Rachelle, coming ahead of those results with that acquisition of iRobot, really coming to a halt here. Essentially, not going through because of regulatory concerns on that front. So some headlines there as well. As you pointed out with Amazon, it's always interesting to get the consumer pulse as well, at least on the e-commerce side. So we'll be watching that one closely. I'm watching Microsoft really closely for very obvious reasons when you think about the big tech rally that we have seen. It has come on the back of this optimism around AI. And you could argue, Microsoft, a big driver of that, hitting that $3 trillion market cap. Of course, when you think about where Microsoft is in its AI rollout, you've got that Copilot key already integrated into PCs that are coming out, as well. Microsoft has said that's just the beginning in terms of the user experience. So we'll be looking for some hints on what additional measures that are likely, one additional features that Microsoft is hinting at. And, of course, the bottom line here, investors are going to be asking, well, what does that revenue look like that's coming in from AI? So certainly, a lot going across the board. But just given the run up that we have seen in Microsoft, as well as other mega-cap stocks, certainly, going to be a consequential week here with all those big tech companies' results reporting this week. RACHELLE AKUFFO: I mean, and when you look at where valuations are, and then you look at where Microsoft is now, I mean, a year from now, we wouldn't have thought that generative AI would have really pushed it past Apple, where we think of-- when we think of market cap and the potential for it to overtake it. But when I think of Apple. you think it has that nice, secure moat. But then we saw that slowdown in demand. We saw people not buying as many devices. And as we've been talking about, we have that upgrade cycle that's also coming up, which could also be an additional boon for Microsoft, as well. So interesting positioning here. Definitely, be an earnings call I'll be excited to listen in on. AKIKO FUJITA: Yeah. I mean, you mentioned Apple reporting later this week. And there's still questions about what the gen AI play is for Apple, right? I mean, they are obviously working on that in-house, but we'll be looking for some additional hints on that front, as well. Related Quotes "
}