{
    "title": "Spotify plans to launch in-app purchases, if Apple gets out of the way",
    "date": "1/24/2024",
    "url": "https://www.theverge.com/2024/1/24/24048561/spotify-dma-eu-apple-app-store-epic",
    "text": "By  Ariel Shapiro, lead reporter of Hot Pod, a newsletter covering podcasting and the audio industry. She previously worked at Forbes, where she covered media and entertainment. At first glance, the mockups Spotify has created of its dream app don’t look like much of anything: a card that says how much a subscription costs, the list price of an audiobook, and a button that lets you enter your payment information. Isn’t that how the app already works? Much to Spotify’s consternation, none of that is there today. Because Apple takes a 30 percent fee on in-app purchases for digital goods and services, companies like Spotify have decided it is simply not worth it to allow such transactions inside their apps. It’s led to a bad experience for users — how do we even buy these things? — and fewer sales for Spotify, which has to hope its users are motivated enough to go somewhere else to sign up for a subscription or purchase an audiobook. But that could all change soon, at least in Europe. In the next few months, we will start to see the effects of the Digital Markets Act, a 2022 EU law that clamps down on anticompetitive practices by tech giants it has deemed gatekeepers, Apple included. The law prohibits gatekeeper services like Apple’s App Store from charging a fee for apps to promote their own products and subscriptions or requiring apps to use a specific payments processor, something that gets at the core of Spotify’s fury with Apple and attacks the heart of Apple’s app business. With enforcement of the law coming up, Spotify is sharing how it hopes to revamp its app in response. But how exactly Apple complies with the law could have major implications for both companies — including how much of these app mockups turn into reality. Spotify, which has aggressively pursued Apple’s App Store practices in public communications and in court, is preparing for the dream scenario. The company is hoping to implement full in-app payment functionality that will allow users to upgrade their subscription or buy an audiobook with a tap. Parts of the new user experience will begin to roll out in Europe on March 7th. But how much of it comes to fruition depends on Apple’s compliance. It is not clear whether Apple will have to freely allow developers to offer their own in-app purchases under the law. Apple has not yet shared how its policies will change. But in other countries where regulators have forced open exceptions in the App Store, Apple has found ways to limit them as much as possible. If in-app purchases are freely allowed, the most obvious benefit would be for Spotify’s core business: its premium subscription, since it’ll be much easier for free users to upgrade. Gustav Gyllenhammar, Spotify’s vice president of markets and subscriber growth, says the new App Store rules could be game-changing for the company’s audiobook and podcasting verticals, too, since right now it’s too difficult for users to make purchases from either. “We’ve seen that the à la carte audiobooks business has not taken off materially yet. And we think that this is a key reason for that, because it’s just impossible when you want to purchase the item where you consume it and where you discover it,” Gyllenhammar told The Verge. Gyllenhammar says that people are listening to audiobooks on Spotify when they’re bundled into the app subscription. The problem is the “friction of the purchase” is stopping users from buying one-off books. Podcasts, which Spotify has struggled to monetize beyond advertising (a fickle business, at best), could also operate differently under more relaxed rules. “The way that podcasting as we know it really started growing on iOS has always had these restrictions … You haven’t been able inside of the app to upsell to gated content, exclusive content, and enhanced content,” Gyllenhammar said. He thinks that, with in-app purchase options available, creators are more likely to “evolve” beyond the traditional ad-supported model. The effect on podcasting and audiobooks for Spotify is not marginal. The ability of those two verticals to thrive is key to Spotify’s long-term growth. Spotify CEO Daniel Ek has justified the billion-dollar-plus investment in the spoken word business so the company can be less dependent on the music industry, which siphons off a good chunk of Spotify’s revenue through licensing fees. Europe is far and away Spotify’s biggest market — 39 percent of its premium subscribers are in Europe, followed by 27 percent in North America, 21 percent in Latin America, and 12 percent across the rest of the world. And the Digital Markets Act contributes to what appears to be a global reckoning with Big Tech. For the first time, large-scale regulation has tailwinds. The fact that such regulation is happening in Europe first is no surprise — the EU has a much stronger regulatory tradition than in the US. But you are also seeing crackdowns in countries such as South Korea, Japan, and Australia. Even in the US, which is pretty weak on antitrust, the Justice Department is reported to be opening an investigation into Apple specifically. After decades of fruitless chatter about tech giants’ unchecked power, governments all at once are finally doing something about it. According to Anu Bradford, law professor at Columbia University and author of Digital Empires: The Global Battle to Regulate Technology, this global shift is due to an escalating loss of trust in Big Tech companies. “There is this kind of a cumulative effect of resentment across a number of the leading companies across a number of grounds. There are privacy concerns, there are content moderation concerns, and there are market power concerns. Now there’s this momentum around AI, the idea that these shifts are really just tremendous, and it’s the same big players that are now going to control the AI future,” Bradford told The Verge. “Their dominance is palpable; you can’t anymore kind of close your eyes to it.” Spotify has been among the most visible tech opponents to Apple’s dominance because it is in a unique position. It is a large tech company with a massively popular product, but it is substantially at the mercy of the platforms on which it operates. Epic Games, which makes Fortnite, also fought against Apple by suing the company in US federal court over its App Store policies. It won a minor victory: The court ruled that Apple needed to make it easier for app developers to at least provide a pathway to off-app payments. Apple’s compliance with the ruling elicited even more rage from Epic, Spotify, and other developers. Instead of charging 30 percent for in-app purchases, the company said it would charge a mere 27 percent of revenue from digital products and services if an app so much as linked to an off-app payment portal. The move signaled to the tech industry that Apple would not comply easily or quietly with the Digital Markets Act. The reason why Apple is being so fussy, even compared to its fellow tech giants, according to Bradford, is that this law takes aim at the core of their app business. And if compliance means that it cannot charge for in-app purchases, it stands to lose a lot of money. “This is not a casual obligation for them. This is a really major issue and they’d be much more comfortable continuing to pay fines,” said Bradford. “But to me kind of the momentum is pretty clear that regulators are not comfortable with this model. Apple has heard the message loud and clear, and the question becomes whether there will be a point at which they just decide that this is the reality and they need to deal with it.” If this all plays out as the non-gatekeepers hope, it will make for a more competitive space. Spotify has a lot to benefit from that, but it could also gain new nemeses in the process. “The idea is that if the regulation works, there will not be others that grow into being gatekeepers, because the market is contestable,” Bradford said. “The ideal is that Spotify would face competition from many other players that have been able to take advantage of the opening of the marketplace.” / News and analysis on the biggest events in audio. Subscribe to Hot Pod Insider for full access and three editions each week. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}