{
    "title": "US Supreme Court declines to wade into Apple's dispute with Epic Games",
    "date": "1/16/2024",
    "url": "https://finance.yahoo.com/news/us-supreme-court-declines-to-wade-into-apples-dispute-with-epic-games-181753055.html",
    "text": "The US Supreme Court declined to take up dueling appeals from Apple (AAPL) and “Fortnite” developer Epic Games. In an order issued Tuesday, the court announced it would not grant either of the two appeals that asked the justices to reconsider a ruling that impacts Apple’s control over its lucrative App Store. As a result, an appellate court ruling mostly favoring Apple, though requiring it to make some changes, will stand. In the appeals case, the Ninth Circuit upheld a California trial court's ruling, holding that while the trial court erred in its analysis, Epic nonetheless failed to show that Apple held an illegal monopoly in a relevant market. Consequently, the court said, the tech giant did not violate federal antitrust law — a result that spared Apple from having to break up or divest its closely guarded App Store. The decision isn't all upside for Apple, however. The Ninth Circuit's ruling revives an injunction that requires the smart phone behemoth to allow developers to include links and buttons in their apps that direct users to pay for app purchases outside the App Store. The injunction puts billions in revenue in jeopardy for Apple. The company, which holds roughly 15% of the global smartphone market, earns fees on in-app purchases created by more than 30 million iOS app developers. The Ninth Circuit said at the time of Epic's trial against Apple that the number of video games on Apple's operating mobile system had grown from 131 in the early days of the iPhone to over 300,000. These gaming apps, the court said, generated an estimated $100 billion in annual revenue. The appeals court said Epic failed in its case by not adequately showing that Apple's App Store qualified as a relevant app market. The court went on to say that Epic also failed to introduce some substantially less restrictive means by which Apple could maintain its iOS ecosystem. In a minor win for Epic, the Ninth Circuit also let stand US District Court Judge Gonzalez Rogers’s determination that Apple had violated California’s Unfair Competition law. To remedy the violation, the court ordered Apple to allow Epic and other app developers offer alternative in-app payment methods. Epic had hoped the Supreme Court would take up its broader claim that developers should be able to get their apps onto iPhones through third-party app stores in addition to Apple's App Store. While the Supreme Court's decision not to hear Epic's appeal helps Apple by ensuring it keeps its App Store intact, the court's decision not to hear Apple's appeal could seriously bruise the tech giant. Apple benefits handsomely from the 15% and 30% fees it charges app developers on the sale of products through its App Store when using Apple's payment service. If app developers can offer their own payment options in apps, they can bypass Apple's fees, cutting into the company's App Store revenue. Developers could sweeten the deal for consumers by selling apps and in-app products at a discount, since they won't have to make up for Apple's fees any longer. Apple doesn't break out its App Store revenue numbers, but rather includes them as part of the company's overall services business. That segment, which also includes subscriptions for products like Apple TV+ and Apple Care, generated $85.2 billion of Apple's $383.3 billion in total revenue in 2023. The Epic-Apple dispute began more than two years ago when “Fortnite,” with about 350 million registered players, was booted from Apple’s and Google’s (GOOG, GOOGL) app stores and banned from their operating systems. The bans were a response to Epic’s gaming program, which circumvented the platforms by offering direct in-game purchases at a 20% discount. Apple and Google both said the move violated their terms of service, justifying removal from the stores. Epic then filed separate lawsuits against Google and Apple with nearly identical allegations that the removals violated federal and California antitrust laws. While the two cases center on what level of control tech giants should have over the third-party developers, a jury came to an opposite conclusion in the case that went forward against Google. In a jury trial, jurors sided with Epic, finding that Google had abused the dominance of its Android operating system app distribution and in-app billing markets by extracting exorbitant fees from Epic and other third-party app makers. A separate portion of the trial to determine a remedy for the violation is scheduled to take place later in January. A final outcome, however, is likely years away, as Google is expected to appeal the case. While Apple prohibits users from installing apps on their iPhones from outside the App Store, Google's Android lets users install apps from third-party app stores, albeit after forcing them to make changes in their device's settings menu and read a warning about doing so. Apple's App Store is facing pressure from governments around the globe. Regulators from South Korea and Japan to the UK and EU have or are looking into ways to make the iPhone maker open up its devices to allow third-party app stores on its devices or provide alternative payment options in apps. The Supreme Court’s decision to not take up the Epic and Apple appeals could also impact the US Justice Department’s ongoing investigation into Apple’s App Store and other business lines. Alexis Keenan is a legal reporter for Yahoo Finance. Follow Alexis on Twitter @alexiskweed. Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}