{
    "title": "Apple's Mac turns 40: How it transformed mass-market computing",
    "date": "1/23/2024",
    "url": "https://www.thenationalnews.com/business/technology/2024/01/23/apples-mac-turns-40-how-it-transformed-the-mass-market-computing-landscape/",
    "text": "Part of an early model central processing unit is seen on display at the Computer History Museum on January 19, 2024 in Mountain View, California, as the museum celebrates Mac's 40th birthday.  Forty years after igniting a PC revolution, Apple's Mac is stronger than ever and could reach new glory due to AI computing - or be left behind.  (Photo by Loren Elliott  /  AFP) On January 22, 1984, Apple unveiled its first Macintosh computer through a George Orwell-themed Super Bowl commercial titled “1984”, which aired just once. The machine went on sale two days later. The advertisement, which was directed by filmmaker Ridley Scott, bore a closer resemblance to a movie premiere than a typical technology launch. This approach stemmed from co-founder Steve Jobs' vision that he wasn't merely launching a computing power, but he aimed to sell a product designed for use in the decades to come. The computer Steve Jobs famously described as “insanely great” is marking its 40th anniversary on Wednesday. Macintosh – an intuitive personal computer – transformed the landscape of mass-market computing with its revolutionary graphical user interface (GUI), catchy icons to represent objects and actions, and a mouse. The Macintosh's user-friendly design quickly gained a devoted following, establishing the Cupertino-based company’s commitment to sophisticated design, effective marketing and cutting-edge engineering over the span of four decades. The Apple Lisa, the precursor to the Macintosh, shared a similar interface and operating system. However, with a hefty price tag of about $10,000, the Lisa was beyond the budget of many potential customers. Additionally, its large and heavy design did not make it an ideal candidate for a desktop computer platform and the Macintosh ultimately surpassed and outperformed the Lisa. The Macintosh operated on the company’s proprietary operating system, initially named System Software. It underwent a rebranding in 1996, becoming known as Mac OS and, in 2001 it evolved into the Unix-based Mac OS X. Subsequently, it was rebranded as OS X and is presently identified as macOS. Originally powered by Motorola 68000 series microprocessors, the Macintosh later transitioned to the PowerPC central processing unit through the Apple, IBM, and Motorola (AIM) Alliance, before adopting Intel x86 processors. In contemporary Macs, Apple’s in-house M series processors are used. 1984 - Apple unveiled the Macintosh on January 241985 - Steve Jobs departed from Apple and established NeXT1986 - Apple introduced the Macintosh Plus, featuring enhanced memory1987 - Apple launched the Macintosh II, equipped with colour capabilities1989 - The widely acclaimed Macintosh SE/30 made its debut1994 - Apple presented the Power Macintosh1996 - The Macintosh System Software OS underwent a rebranding as Mac OS2001 - Apple introduced Mac OS X, marrying Unix stability with a user-friendly interface2006 - Apple adopted Intel processors in MacBook Pro laptops2008 - Apple introduced the MacBook Air, a lightweight laptop2012 - Apple launched the MacBook Pro with a retina display2016 - The Mac operating system underwent rebranding as macOS2020 - Apple introduced the M1 chip for Macs, combining high performance and energy efficiency2022 - The M2 chip was announced2023 -The M3 line-up of chip was announced to improve performance and add new capabilities for Mac. During its initial years, the Macintosh garnered a loyal user base, primarily of creative and academic individuals that undisputedly laid the groundwork for an array of desktop, laptop and wireless computing devices, including the iMac, MacBook, iPod, iPad and iPhone. Over the years, it underwent various transformations enabling it to effectively cater to business needs as well. The diverse Macintosh models, including laptops, desktop systems, and robust creative production systems, consistently contributed to its enduring popularity. The Mac revolutionised the way users work with computers by bringing the GUI capabilities at an affordable price, Dubai-based Abbas Ali, managing editor of Tbreak Media, told The National. “Apple took work it had done on its previous computer Lisa that was launched just a year earlier and made it into a personal computer that was not designed for offices, but for your home. It was truly the start of the home PC era,” he said. Tbreak covers the latest in the fields of technology, video games and entertainment in the UAE with hyper local product guides. The original Macintosh marked a “pivot moment” in the computer industry, Manish Pravinkumar, a Dubai-based senior consultant at Singapore-headquartered researcher Canalys, told The National. “It was the first time consumers were given a user-friendly means of interacting with a computer, introducing the first GUI … [it] established a new industry standard for user interfaces. Its skeuomorphic design leveraged people's knowledge of the real world, creating digital metaphors,” Mr Pravinkumar said. “At the time, people often used file folders to store documents. The Macintosh took this familiarity into a new realm, allowing users to drag and drop their files into folders.” The Mac turned Apple into a “household name” and though the iPhone overshadowed the Mac in terms of units that Apple sells, as a computer, the Mac is still loved and used by millions, Mr Ali said. “With the recent switch to Apple silicon [M series chips], we have seen renewed love for the Mac with the exceptional speed and battery life it offers,” he said. “The switch has also further allowed Apple to align its ecosystem of devices with the software sharing features between all its devices. Apple released its first in-house M1 chips in November 2020 to reduce its reliance on other chip makers such as Intel. It launched its latest line-up of chips in October last year. It announced the M3, M3 Pro and M3 Max chips featuring technology that aims to improve performance and add new capabilities for Mac. “Its [Mac] sleek design, powerful performance, and seamless integration with the Apple ecosystem have attracted a dedicated user base,” Mr Pravinkumar said. “As part of the broader ecosystem, the Mac enhances the synergy between Apple's hardware, software, and services, creating a seamless user experience across all devices. “This interconnectedness has only increased over the years. The introduction of Apple's own silicon into the Mac line-up was a pivotal moment for the Mac portfolio. Users could now use iPhone and iPad apps on Macs with Apple silicon.” Mr Ali, who purchased his first Apple laptop (the iBook G4) from Taiwan in 2004, said it was “pretty much love at first sight”. “Even though the Mac was introduced in 1984, my first experience with it wasn’t until almost two decades later. By the time I was able to afford a computer, it was the mid-90s and Windows was everywhere,” Mr Ali said. “Apple was going through a rough time with its market share continuously declining. It wasn’t until Steve Jobs came back to Apple in 1997 and brought the new OS X with him that Macs started to matter again.” However, software incompatibilities made it difficult for him to use it as his primary machine and he sold that machine to a friend – a decision that he still regrets. “It was when Apple announced the switch to Intel CPUs in 2006 that I fully converted and haven’t looked back. That does not mean that I don’t use [Microsoft’s] Windows – I frequently do, but my primary machines are Macs.” Apple’s 1984 ad said, “On January 24th, Apple computer will introduce Macintosh. And you will see why 1984 won’t be like ‘1984'.\" The reference is to George Orwell's book 1984, which highlights the perils of totalitarianism and aims to illustrate the profound extent of control and authority. Apple's ad, meanwhile, was targeted at the monopoly exercised by IBM. “There is a lot of irony going back and watching the Macintosh ad that started it all 40 years ago,” said Rolf Illenberger, founder and managing director of Munich-based software development company VRdirect. “The ‘1984’ concept was all about individual freedom from ‘Big Brother’ and the beginning of the personal computer revolution. “But Apple’s major successes of late have been providing the connectivity to keep humans always close to their technology – whether it be on a VR [virtual reality] device, watch, smartphone, or headphones. “The Macintosh may have been the device that started it all, but four decades later, Apple isn’t a computer company … it’s a connectivity company.” In the 2023 financial year, the Macs contributed nearly $29.4 billion to Apple’s overall sales of more than $383.2 billion. However, it dropped almost 27 per cent on a yearly basis from the previous fiscal year’s contribution of over $40 billion. But analysts said Apple has “significantly grown” its market share in commercial PC deployments in the last several years, catalysed by the transition to its own chips. “Furthermore, a wave of PC refreshes from the Windows version transition is often seen by Apple as an opportunity to make further share gains, especially among businesses,” Mr Pravinkumar said. “The Mac’s value proposition has been highly powerful computers, an increased return on investment and, most importantly, how it fits within a company’s existing IT ecosystem.” Global shipments of PCs dropped 14 per cent on an annual basis in 2023 as a result of a slowdown in demand from commercial and consumer sectors, a new report by Counterpoint Research said. Although there were several product launches in the second half of last year, they did not contribute to sales because most of them will not start shipping until 2024. Chinese manufacturer Lenovo and its US counterpart Hewlett-Packard led the market with 24 per cent and 21 per cent market shares, respectively, said the Hong Kong-based researcher. It did not reveal exact shipment numbers for 2023. They were followed by Dell (16 per cent market share) and Apple (9 per cent). 1984 - Apple unveiled the Macintosh on January 241985 - Steve Jobs departed from Apple and established NeXT1986 - Apple introduced the Macintosh Plus, featuring enhanced memory1987 - Apple launched the Macintosh II, equipped with colour capabilities1989 - The widely acclaimed Macintosh SE/30 made its debut1994 - Apple presented the Power Macintosh1996 - The Macintosh System Software OS underwent a rebranding as Mac OS2001 - Apple introduced Mac OS X, marrying Unix stability with a user-friendly interface2006 - Apple adopted Intel processors in MacBook Pro laptops2008 - Apple introduced the MacBook Air, a lightweight laptop2012 - Apple launched the MacBook Pro with a retina display2016 - The Mac operating system underwent rebranding as macOS2020 - Apple introduced the M1 chip for Macs, combining high performance and energy efficiency2022 - The M2 chip was announced2023 -The M3 line-up of chip was announced to improve performance and add new capabilities for Mac. Future Beat Your round-up of the stories shaping tomorrow’s world "
}