{
    "title": "Barclays Is Souring on Apple (AAPL) Stock",
    "date": "1/2/2024",
    "url": "https://investorplace.com/2024/01/barclays-is-souring-on-apple-aapl-stock/",
    "text": " Apple's revenue has dropped in recent quarters, while the valuation of AAPL stock has surged in the last year Advertisement Source: Eric Broder Van Dyke / Shutterstock.com British bank Barclays hit Apple (NASDAQ:AAPL) stock with a downgrade this morning, lowering its rating on the iPhone maker to “underweight” from “equal weight.” Barclays noted that the sales of Apple’s flagship device have been weak, and the bank does not expect that situation to change anytime soon. AAPL stock is down about 3% in early morning trading. Calling the demand for Apple’s most advanced iPhone model “lackluster,” Barclays analyst Tim Long does not expect the situation to change when the tech giant introduces an upgraded version of the device later this year. “We see no features or upgrades that are likely to make the (upcoming iPhone) more compelling.” Long wrote. What’s more, the sales of Apple’s other hardware offerings have not grown a great deal, and Long does not expect the company’s revenue from its Services category to rise more than 10% in 2024. As a result of these points, the analyst expects AAPL stock to sink sharply this year, as he placed a $160 price target on the shares versus their current level of $188. Apple’s last two quarterly reports have featured small top-line declines versus the same periods a year earlier. Specifically, in the quarter that ended in September, Apple’s top line came in at $89.5 billion, down from $90.15 billion in the quarter that ended in September 2022. And in the quarter that ended in July, its sales came in at $81.8 billion, versus nearly $83 billion in the same quarter in 2022. Nonetheless, the forward price-earnings ratio of AAPL stock has jumped from 21.28 a year ago to 29.15 now. On the date of publication, Larry Ramer did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Larry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer. 5G, Communications, Consumer Discretionary, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/barclays-is-souring-on-apple-aapl-stock/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}