{
    "title": "Is Apple Stock a Buy Now?",
    "date": "1/6/2024",
    "url": "https://www.fool.com/investing/2024/01/06/is-apple-stock-a-buy-now/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Apple (AAPL -1.06%) has been the world's most valuable public company since 2011 when it had a market capitalization of just under $340 billion. Fast forward to today, and Apple's market cap is just under $3 trillion. Needless to say, it has made some happy and wealthy investors along the way. Regardless of Apple's generational success, that doesn't automatically make the stock a buy right now; it's all about the future. However, I believe Apple is well-positioned to continue returning good shareholder value. Here are three reasons why. The smartphone market has been in a slump for the past couple of years. It wasn't until October 2023, when the global smartphone market grew 5% year over year, that it reversed course from the previous 27 months. Apple has felt the effect of the slump, too. Bringing in $89.5 billion in revenue in its fiscal 2023's fourth quarter (ended Sept. 30, 2023), Apple is still a cash cow, but its revenue growth has slowed. This past quarter's revenue was even down on a year-over-year basis.  AAPL Revenue (Quarterly YOY Growth) data by YCharts The iPhone accounted for 52% of Apple's revenue in its fiscal 2023, so as it goes, so does Apple -- for the most part. Luckily, brighter days should be ahead, as Morgan Stanley and Goldman Sachs both predict that smartphone sales will bounce back in 2024. Morgan Stanley predicts smartphone shipments will increase by close to 4%, and Goldman Sachs predicts 3%. It might not seem like much of a jump, but when you consider that over 1.1 billion smartphones are projected to have shipped in 2023 -- and it was the lowest amount in close to a decade -- then it can really add up for Apple. There's no denying that the iPhone is Apple's financial foundation. It's been that way for more than a decade now. However, Apple is slowly but surely becoming less reliant on the iPhone and other hardware as its services segment continues to grow. Here is the breakdown of its revenue by products and services from the past five fiscal years: Data source: Apple's quarterly financial statements. Hardware will be Apple's bread and butter for the foreseeable future, but it's encouraging to see its services segment begin to pull more of its own weight. Unlike hardware, which costs Apple for each product it sells, services are generally higher-margin businesses because they don't require much investment beyond initial development and updates. Services also provide more reliable and recurring revenue through subscriptions. From Apple Music to iCloud to Fitness+ to Apple Card and more, Apple is forming a nice ecosystem of subscription-based and pay-as-you-go services. Some investors look at Apple's stock and argue that it's overvalued. Are they wrong? Well, that depends on what metrics you're considering. Looking at its price-to-earnings and price-to-sales ratios, Apple doesn't strike me as overvalued, especially compared to other big tech companies like Nvidia and Microsoft.  AAPL PE Ratio data by YCharts Even if Apple's current valuation seems high, it shouldn't deter long-term investors. If you're waiting for the perfect time to invest in Apple (or any stock, for that matter), you may never invest in it. A decade from now, you may not even remember whether or not Apple was overvalued. If you have reservations but are interested in investing in Apple, I recommend dollar-cost averaging your way into a stake. Dollar-cost averaging can help reduce the impact of volatility and hedge against any sudden drops that may happen. Apple has been one of the premier companies of our generation and still has plenty of growth opportunities in front of it. It's a stock you can feel comfortable holding onto for a long time. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Stefon Walters has positions in Apple and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Goldman Sachs Group, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}