{
    "title": "Piper Sandler downgrades Apple over inventories and demand uncertainty",
    "date": "1/4/2024",
    "url": "https://www.xtb.com/en/market-analysis/piper-sandler-downgrades-apple-over-inventories-and-demand-uncertainty",
    "text": " Apple (AAPL.US) shares have recently come under pressure after analysts at several Wall Street funds saw a threat to the company's further expansion. On Tuesday, Barclays and today Piper Sandler decided to change their rating from 'overweight' to 'neutral', lowering their target price by $15, to $205 per share. The giant's shares are losing 1% before the open. Will Apple be a company highly sensitive to a possible 'recession'? Apple will report Q4 2023 results on February 1, 2024. Looking at the chart of Apple shares, we see a bearish double peak formation above $200 per share, previous price reactions, the 23.6 Fibonacci retracement and the dynamics of the SMA200 moving average as well as the extent of the previous correction in the uptrend suggest that the stock may seek to test the $170 level. On the other hand, the RSI indicator at 33 points suggests an oversold condition. Source: xStation5 This content has been created by XTB S.A. This service is provided by XTB S.A., with its registered office in Warsaw, at Prosta 67, 00-838 Warsaw, Poland, entered in the register of entrepreneurs of the National Court Register (Krajowy Rejestr Sądowy) conducted by District Court for the Capital City of Warsaw, XII Commercial Division of the National Court Register under KRS number 0000217580, REGON number 015803782 and Tax Identification Number (NIP) 527-24-43-955, with the fully paid up share capital in the amount of PLN 5.869.181,75. XTB S.A. conducts brokerage activities on the basis of the license granted by Polish Securities and Exchange Commission on 8th November 2005 No. DDM-M-4021-57-1/2005 and is supervised by Polish Supervision Authority. The final trading day of the week has been rather uneventful. As the majority of the markets was already closed for Easter holidays, liquidity conditions... Fed Chair Powell took part in moderate discussion at event organized by San Francisco Fed. Powell spoke on the monetary policy, but his remarks included... The week following an Easter break on the markets is packed with top-tier releases from Europe and the United States. Traders will be offered jobs data... Already an XTB client? Login to trade Opening an account is quick and easy. Simply choose between a real and demo account and you could be trading within minutes.  CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 77% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money. XTB Limited is authorised and regulated by the UK Financial Conduct Authority (FRN 522157) with its registered and trading office at Level 9, One Canada Square, Canary Wharf, E14 5AA, London, United Kingdom (company number 07227848). Copyright 2024 © XTB\n•\n\n                            Cookies settings This page uses cookies. Cookies are files stored in your browser and are used by most websites to help personalise your web experience. For more information see our Privacy Policy By clicking “Accept All”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. This group contains cookies that are necessary for our websites to work. They take part in functionalities like language preferences, traffic distribution or keeping user session. They cannot be disabled. We use tools that let us analyze the usage of our page. Such data lets us improve the user experience of our web service. This group of cookies is used to show you ads of topics that you are interested in. It also lets us monitor our marketing activities, it helps to measure the performance of our ads. Cookies from this group store your preferences you gave while using the site, so that they will already be here when you visit the page after some time. This page uses cookies. Cookies are files stored in your browser and are used by most websites to help personalise your web experience. For more information see our Privacy Policy You can manage cookies by clicking \"Settings\". If you agree to our use of cookies, click \"Accept all\".  Changing the language affects the change of regulator "
}