{
    "title": "Apple CEO Tim Cook earns $63.21 million as total salary in 2023, it drops \nby almost $36 million | Mint",
    "date": "1/13/2024",
    "url": "https://www.livemint.com/companies/people/apple-ceo-tim-cook-earns-63-21-million-as-total-salary-in-2023-it-drops-by-almost-36-million-11705151658845.html",
    "text": "Apple chief executive officer Tim Cook earned $63.21 million as compensation in 2023, which is less than what he got in 2022, the iPhone maker stated in its proxy filing with the US Securities Exchange Commission. Apple in its proxy filing said that Cook earned $3 million – equivalent to  ₹25 crore – as a salary in 2023, which was the same salary as in 2022 and 2021. Jobs, who took over the affairs of the company after its founder Steve Jobs' demise, was awarded stocks worth $46,970,283 ( ₹389.25 crore) in the past year. According to details, Cook was paid non-equity incentive plan compensation to the tune of $10,713,450 ( ₹88.78 crore) while the other compensation totaled $2,526,112 ( ₹20.93 crore). Hence, the Apple CEO's total salary in 2023 stood at $63,209,845 ( ₹523.83 crore). It was less than his 2022 salary of $99,420,097 ( ₹823.91 crore). ALSO READ: Apple Vision Pro to be available in United States from 2 Feb: CEO Tim Cook says ‘works like your mind’ Meanwhile, Reuters reported Apple is gearing up for the launch of its mixed reality headset, the Apple Vision Pro, which goes on sale in the United States on February 2. The headset has been priced at $3,499 ( ₹2.89 lakh). The Cupertino-based technology giant said the Apple Vision Pro is designed for more immersive FaceTime chats, gaming, video, and productivity apps. The Vision Pro, first unveiled in June, marks the first new hardware category for Apple since the company introduced its smartwatch in 2015. “It’s been a remarkable year. In 2023, we made history by introducing the world to Apple’s first spatial computer, Apple Vision Pro — a revolutionary product that seamlessly blends digital content with the physical world, opening a whole new dimension for our users,\" Cook said in the regulatory filing. Apple enters into competition with Meta Platforms Inc. and other makers of augmented and virtual reality headsets with the launch of Vision Pro. With agency inputs. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}