{
    "title": "Apple Gives Up on Apple Car, Moves Team to Generative AI",
    "date": "2/27/2024",
    "url": "https://futurism.com/the-byte/apple-cancels-car-ai",
    "text": "After around a decade of extremely secretive development, Apple is officially giving up on building an electric car. Sources with insider knowledge told Bloomberg's Mark Gurman that the tech giant was canceling the project codenamed Titan, affecting almost 2,000 employees. According to the report, COO Jeff Williams and the project's VP Kevin Lynch informed the workers that the project will start winding down, and that many of them will be shifted to the company's AI division — which shouldn't come as a surprise, given the current hype surrounding the tech. However, it's still unclear how many engineers or designers will end up being laid off. While it sounds like an unexpected move on behalf of the tech giant, investors met the news with optimism, sending Apple shares climbing. Even Tesla CEO Elon Musk chimed in, tweeting a saluting and a cigarette emoji in response — though we'll leave it to readers to decode what he meant. Project Titan had already gone through plenty of rough times, with leadership changing several times over the years. In 2021, Doug Field, the project's lead at the time, left to join Ford as its chief advanced technology and embedded systems officer. Apple also repeatedly reined in its ambitions, downscaling from a steering wheel-less car to a Tesla-style Level 2 autonomy vehicle. Then there's a notable decline in interest in the EV space, with US automakers indicating they're facing considerable headwinds in selling fully battery-powered vehicles. Musk himself warned of \"notably lower\" growth during last month's fourth-quarter earnings call. According to Gurman, even at a whopping $100,000 price point, executives had concerns around keeping profit margins high enough. In short, moving those existing resources to generative AI is likely wise — and in many ways, would've been wiser years ago. More on the project: Apple Gives Up on Making Its Upcoming Car Fully Autonomous Share This Article DISCLAIMER(S) Articles may contain affiliate links which enable us to share in the revenue of any purchases made. Registration on or use of this site constitutes acceptance of our Terms of Service. © Recurrent Ventures Inc, All Rights Reserved. "
}