{
    "title": "Is Apple's $3,500 Vision Pro An Early Prototype Or A Revolutionary 'Pimple' \nMaker? Mixed Reviews Pour In",
    "date": "2/12/2024",
    "url": "https://www.benzinga.com/news/24/02/37067256/is-apples-3-500-vision-pro-an-early-prototype-or-a-revolutionary-pimple-maker-mixed-reviews-pour-in",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Apple Vision Pro's detailed reviews are pouring in and while early impressions were mostly positive, the more important nuances of Apple Inc.'s AAPL ambitious $3,500 headset are beginning to surface. What Happened: From calling Apple Vision Pro experience \"magic\" to revealing real-life issues like having a \"massive pimple\" at the end of a long session, detailed reviews and long-term experience stories of Apple's mixed reality headset are clearing up the picture. One of the criticisms of Apple Vision Pro is the lack of apps, or even a \"killer\" app, as New York Magazine's David Pogue put it. The ability to set up infinite screens and windows, navigating them using your eyes as the cursor and finger pinches as the click, that experience can be \"thrilling,\" according to Pogue. See Also: Apple Vision Pro Could Cannibalize iPad Down The Line, Says Mark Gurman: Tim Cook Has His Work Cut Out However, he underscores a problem that many others have highlighted – the price tag. While Apple CEO Tim Cook defended it, it's still a major expense if you are considering buying it. Bloomberg's Mark Gurman put it succinctly. \"The Vision Pro is essentially a prototype — just one where you have to pay Apple for the privilege of testing it out.\" The overarching theme of both early impressions as well as detailed Apple Vision Pro reviews is that the experience is like \"magic.\" \"There is so much technology in this thing that feels like magic when it works,\" The Verge's Nilay Patel said, before adding that when it doesn't work, it can be a \"frustrating\" experience. \"There are a lot of ideas in the Vision Pro, and they're all executed with the kind of thoughtful intention that few other companies can ever deliver at all, let alone on the first iteration.\" According to Patel, the challenge here is that some of these ideas could prove to be dead ends with no utility for the end consumer. If more people come to the same conclusion, then Apple and other players in the mixed reality segment might have a bigger problem on their hands than simply ironing out the issues in existing products. Gurman already thinks that it could take four generations for Apple Vision Pro to become an \"ideal\" Apple product. Engadget's Davindra Hardawar echoed Patel's sentiments on Apple Vision Pro being \"magical.\" \"It’s magical, almost telepathic. The Vision Pro’s eye tracking makes it feel like you’re discovering the power of the Force, a sensation that’s buoyed by the intuitive hand gestures used to interact with whatever your eyes are focused on.\" But he maintains that when it doesn't work how it's supposed to, it can be \"exhausting.\" Jon Rettinger even pointed out an important problem with Apple Vision Pro – prolonged use can give you a \"massive pimple.\" Why It Matters: Apple has made a big beg with the Vision Pro. Like it has worked to turn most of its products – even the seemingly insignificant AirPods – into billion-dollar revenue streams, the company seems intent on turning Apple Vision Pro into an important part of its portfolio. Analysts have compared Apple Vision Pro's launch to that of the iPhone in 2007 by Steve Jobs. Deepwater’s Andrew Murphy anticipates that within the next decade, the Vision Pro product segment will surpass the Apple Watch, which currently contributes to 5% of Apple's revenue. OpenAI CEO Sam Altman called it \"the second most impressive tech since the iPhone.\" Wedbush even upgraded the Apple Vision Pro sales prediction for 2024 by over 30%, from 460,000 to 600,000 units. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Gamified Chores, F1 In Your Living Room: Wild Videos Of Early Apple Vision Pro Users Are Out Photo courtesy: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}