{
    "title": "Apple Shares Vision Pro User Guide and Dozens of Support Documents With \nUseful Tips",
    "date": "2/3/2024",
    "url": "https://www.macrumors.com/2024/02/03/apple-vision-pro-support-documents/",
    "text": "Apple on Friday shared a wealth of information about its new Vision Pro headset, including a detailed user guide and dozens of support documents. We have already highlighted many topics separately, such as Optic ID, Guest User, Travel Mode, Personas, supported gestures, compatible Bluetooth accessories, charging and battery management details, cleaning instructions, the lack of Find My tracking, using the Vision Pro as an external display for a Mac, and more. With assistance from MacRumors contributor Aaron Perris, we have created a list with nearly every Apple support document related to the Vision Pro. Apple also shared video overviews of the Settings app, Control Center, Guest User, accessibility features, and more on visionOS. Get weekly top MacRumors stories in your inbox. Our comprehensive guide highlighting every major new addition in iOS 17, plus how-tos that walk you through using the new features. App Store changes for the EU, new emoji, Podcasts transcripts, and more. Get the most out your iPhone 15 with our complete guide to all the new features. A deep dive into new features in macOS Sonoma, big and small. Revamped models with OLED displays, M3 chip, and redesigned Magic Keyboard accessory. Updated 10.9-inch model and new 12.9-inch model, M2 chip expected. Apple's annual Worldwide Developers Conference will kick off with a keynote on June 10. Expected to see new AI-focused features and more. Preview coming at WWDC in June with public release in September. 22 hours ago by Tim Hardwick 23 hours ago by Tim Hardwick 1 day ago by Juli Clover 2 days ago by MacRumors Staff 3 days ago by MacRumors Staff  MacRumors attracts a broad audience of both consumers and professionals interested in the latest technologies and products. We also boast an active community focused on purchasing decisions and technical aspects of the iPhone, iPad, Mac, and other Apple platforms. "
}