{
    "title": "Spotify’s spat with Apple, its new deal with Joe Rogan and further \ncost-cutting: 3 things we learned on the company’s ...",
    "date": "2/6/2024",
    "url": "https://www.musicbusinessworldwide.com/spotifys-spat-with-apple-its-new-deal-with-joe-rogan-and-further-cost-cutting-3-things-we-learned-on-the-companys-latest-earnings-call/",
    "text": "Spotify would be experimenting with a variety of payment models, were it not for the Apple Store’s so-called “app tax,” Spotify co-founder and CEO Daniel Ek said on the company’s latest earnings call. Asked whether Spotify was looking to move beyond its “all-you-can-eat” pricing model – i.e., a monthly flat fee for access to the service – Ek said the company is already doing just that, but on a small scale in certain limited markets, for instance “day passes” and “weekly passes”, and physical gift cards, that are available in some areas. “We are very much adapting our pricing models in favor of what consumers want. And that’s something that you should expect us to continue to do,” Ek said on Tuesday (February 6).  But launching ideas such as a-la-carte purchases, special premium offers to superfans, and other things that could mean “meaningful” new revenue for Spotify are facing “a significant hindrance today because Apple insists on taking a 30% cut, which in many cases exceeds even our own cuts that we’re able to take inside of the app,” Ek said. Especially in more developed countries, Spotify is “precluded” from moving forward with pricing innovations in “a way… which could be profitable and good for consumers and creators, because of Apple’s stance,” he added. The fees charged by Apple have been a bone of contention for many app developers for years. Recently, Apple’s fee model has faced challenges in both the US, where it has been the subject of a closely-watched court case, and in the European Union, where a new law – the Digital Markets Act – is meant to prevent large tech companies from acting as gatekeepers of digital commerce. “We are very much adapting our pricing models in favor of what consumers want. And that’s something that you should expect us to continue to do.” Daniel Ek, Spotify Spotify has argued that Apple is trying to circumvent the goals of the EU’s Digital Markets Act. Under Apple’s new terms, “if we stay in the App Store and want to offer our own in-app payment, we will pay a 17% commission and a 0.50 cent Euro Core Technology Fee per install [per] year,” Spotify explained in a blog post. “This equates for us to being the same or worse as under the old rules.” Spotify added: “And if we managed to remove our app from the App Store and only existed in the Alternative App Store, that would still not work. With our EU Apple install base in the 100 million user range, this new tax on downloads and updates could skyrocket our customer acquisition costs, potentially increasing them tenfold.”  On the earnings call on Tuesday, Ek said Spotify doesn’t know yet how the DMA will be enforced, and whether Apple’s new 17% commission 50-cent fee per user, per year, will be allowed under the EU’s new rules. Ek noted that Spotify doesn’t have to accept Apple’s new terms, and keep going with the existing model. But that would limit certain future “upsides,” such as creating superfan clubs, because it “simply would mean that all of Spotify would be unprofitable if we took these new terms.” “All of Spotify would be unprofitable if we took these new terms [from Apple].” Daniel Ek, Spotify Ek’s comments came following the release of the company’s Q4 earnings, which showed that Spotify’s paying subscriber count rose to 236 million during the quarter, a 15% YoY increase. Monthly active users rose 23% YoY to 602 million. Both numbers exceeded the company’s guidance by about 1 million. Spotify’s subscriber revenues came in at €3.170 billion (USD $3.40 billion) in Q4, up 21% YoY on a constant currency basis. Ad-supported revenue came in at €501 million ($538.62 million), up 17% YoY at constant currency. The company’s €75 million quarterly operating loss was smaller than guidance. Indeed, Spotify would have been comfortably profitable in the quarter if it hadn’t been on the hook for charges of €143 million ($153.73 million) “related to the efficiency actions we announced in December,” Spotify’s outgoing CFO, Paul Vogel, said on the call. Those costs were associated with a reduction in headcount of 1,500, which reduced the company’s workforce by 17%. Here are a few other things we learned on the company’s earnings call… Ek and Vogel made it clear on the call that the company’s push for efficiency – which, among other things, resulted in 2,300 job cuts last year, as well as the shutting down of some Spotify programming – will continue in 2024. “Looking to 2024, you should expect a continuation of what you saw in 2023 – strong product development which leads to strong growth, but with an increased focus on monetization and efficiency, which in turn drives profitability,” Ek said. Asked to comment on further efficiencies, Ek said that “we don’t know how far that will go,” but “there’s still some” ahead. However, he noted that “the most important thing for us… is long-term growth, still, for the company. So that’s what we will optimize for.” “I think you’re going to see us be more diligent in shutting down things that perhaps have sort of worked, but may not work as well going forward into the future.” Daniel Ek, Spotify However, in a follow-up later in the call, Ek said that when it comes efficiencies, “we have actually gone through all the hard stuff this past year,” perhaps indicating that any future cost-cutting measures won’t be as jarring as the ones seen in 2023. Ek added that Spotify has “by no means” fully switched to an efficiency-first mindset. “This is [the] notion of being relentlessly resourceful. For me that means to think constantly about the resources [we have] and not just think about getting more of them, but thinking about how we reallocate, constantly, everything we’re doing to the highest-impact use case and… I don’t think we are [there] yet.” He added that “the hurdle rates for any new type of investments will be much higher than what [they have] been. And more importantly, I think you’re going to see us be more diligent in shutting down things that perhaps have sort of worked, but may not work as well going forward into the future.” Spotify recently renewed its deal for the world’s most popular podcast – The Joe Rogan Experience. However, that new deal – reported to be worth $250 million – differs from the original one Spotify signed with Rogan in 2020, in that it no longer gives Spotify exclusivity. Under the new agreement, Spotify will be in charge of distribution and ad sales for Rogan’s show, and Rogan will receive a guaranteed minimum fee as well as a share of ad revenue. While the exclusive deals Spotify signed with podcasters were “net positive,” they were “not driving as much [revenue] as the opportunity that we see on the ad side,” Ek said on the call. Additionally, broadening distribution of podcasts allows Spotify to be better aligned with creators, who “obviously [want] to be on many different platforms and [want] to have as big of an audience as possible,” Ek said. He added: “I feel like with these new deals that we’ve been making, for most of 2023, we are in a position where we’re actually better aligned with [creators], we can both deliver the growth rate and we are equally incentivized to drive audience growth, and of course, then also drive revenue growth because [Spotify and creators] both share in that upside.” “We have doubled down on the deals that worked, and we have got really throughout 2023, gotten out of a lot of the deals that didn’t work,” said Ek. He added: “When we walked into podcasting, we went in with multiple strategies at once. We did exclusives… but we also did our own and original programming, and we also did licensed nonexclusive deals, too… I think many people [thought] that this was an all-out exclusive effort similar to that of Netflix. But we said we take much more of an ‘opportunity’ approach to the strategy and we’re going to try many different things.”Music Business Worldwide The best of MBW, plus the most important music biz stories on the web. Delivered for FREE, direct to your inbox each day. "
}