{
    "title": "WION Business Wrap | EU fines Apple €500 million, Lufthansa’s ground staff \nstrike and more",
    "date": "2/19/2024",
    "url": "https://www.wionews.com/business-economy/wion-business-wrap-eu-fines-apple-eu500-million-lufthansas-ground-staff-strike-and-more-691618",
    "text": "WION's Business Desk brings you this daily round up of global stories from the world of business and economy. WION's Business Desk brings you this daily round up of global stories from the world of business and economy. EU set to fine Apple €500 million in music streaming penalty: Report Brussels is gearing up to administer its first-ever fine against Apple, reportedly amounting to approximately €500 million (approximately $539 million), marking a significant milestone in the European Commission's efforts to regulate big tech, the Financial Times (FT) reported on Sunday. Read more here Lufthansa ground staff set to strike amid wage dispute: Report Ground staff at Lufthansa, are ready to start a strike on Tuesday, as stated by the Verdi union on Sunday, adding to numerous industrial actions unsettling Germany's transport sector. Read more here France cuts down on expected 2024 growth amid global uncertainties In reaction to rising uncertainties on a worldwide scale due to conflicts in Ukraine and Gaza, coupled with economic slowdowns in crucial trading partners like Germany and China, France has reduced its 2024 GDP growth forecast to 1 per cent, lower than the initially anticipated 1.4 per cent. Read more here UAE achieves record non-oil trade of $953 billion in 2023 The United Arab Emirates (UAE) has reported a record-high non-oil trade volume of $952.93 billion in 2023, which marked a 12.6 per cent increase from the previous year. Read more here Argentina's poverty reaches 20-year peak during economic crisis, UCA study says A recent study conducted by the Catholic University of Argentina (UCA) has revealed alarming statistics, indicating that poverty levels in Argentina have surged to 57.4 per cent, marking the highest recorded figure in at least two decades. Read more here Major fire at French recycling plant engulfs 900 tonnes of lithium batteries A fire erupted at a battery recycling facility in southern France on Sunday, engulfing approximately 900 tonnes of lithium batteries and releasing thick black smoke into the sky. Read more here China's C919 airliner makes historic international debut at Singapore Airshow China's aviation industry marked a significant milestone as its domestically developed C919 airliner, designed to rival Airbus and Boeing's passenger jets, made its maiden international appearance at the Singapore Airshow. Read more here Nintendo stocks plummet as reports suggest delayed launch of switch successor Nintendo shares plummeted by 6 per cent on Monday following reports from gaming media outlets and Bloomberg indicating a potential delay in the release of its next-generation console. Read more here China's Lunar New Year tourism revenues surge, but sustainability concerns linger Tourism revenues in China surged significantly during the Lunar New Year holidays, marking a remarkable rebound from previous years, according to official data released on Sunday. Read more here China’s Central Bank maintains policy stability while economic uncertainties persist China's central bank, the People's Bank of China (PBOC), has opted to maintain stability in its monetary policy by leaving a key policy rate unchanged on Sunday. Read more here Seven Group Holdings makes a $1.24 billion bid for full control of Boral Australian conglomerate Seven Group Holdings has made a substantial bid of $1.24 billion to acquire full control of Boral, a leading building products group, signalling a confident wager on the sustained growth of Australia's infrastructure sector. Read more here "
}