{
    "title": null,
    "date": "2/13/2024",
    "url": "https://nypost.com/2024/02/13/business/fcc-should-probe-apple-over-beeper-mini-shutdown-gop-commissioner-carr/",
    "text": "Thanks for contacting us. We've received your submission. Thanks for contacting us. We've received your submission. Republican FCC Commission Brendan Carr said the agency should investigate Apple over its move to block the “Beeper Mini” app that allowed Android users to access iMessage. Carr – a frequent critic of Apple and other Big Tech firms – expressed concern that the Cupertino, Calif.-based company had violated the Federal Communications Commission’s Part 14 rules.” The rules require that “advanced communications services” must be accessible to people with disabilities. “Beeper bridged the “blue bubble-green bubble” divide that Apple maintains as part of a broader set of walled garden practices that inhibit competition,” Carr said Monday. “Apple’s wider set of exclusionary practices warrant scrutiny by antitrust and competition agencies, but the FCC should also examine this particular incident through the lens of our Part 14 rules on accessibility, usability, and compatibility,” the commissioner added. Apple has long limited access to its encrypted iMessage service to its own devices, with Android users appearing as a dreaded “green bubble” when they text iPhone users. Beeper Mini briefly allowed Android users to seamlessly interface with iMessage and gain access to in-app features such as emojis. Today, I called for the @FCC to investigate whether Apple violated our Part 14 rules by blocking Beeper Mini – an app that enabled interoperability between iOS & Android messaging.Beeper bridged the “blue bubble – green bubble” divide that Apple maintains as part of a broader… pic.twitter.com/vxefQZKDXb Apple changed iMessage’s settings to block Beeper Mini’s access in December. The company has argued that enabling third-party access would create user privacy and device security risks. Carr pointed to FCC rules which state that covered providers “shall not install network features, functions, or capabilities that impede accessibility or usability.” Apple and the FCC did not immediately return requests for comment. If it were to proceed, an FCC probe would mark yet another headache for Apple at a time of increased scrutiny over its business practices. Late last year, the US International Trade Commission forced Apple to stop selling some of its smartwatches after determining it had infringed on a patent for testing blood oxygen levels. Apple is appealing the decision. Carr is one of many policymakers who have expressed concern about Apple’s conduct toward Beeper Mini. In December, a bipartisan group of four lawmakers — Sens. Amy Klobuchar (D-Minn.) and Mike Lee (R-Utah) and US Reps. Jerry Nadler (D-NY) and Ken Buck (R-Colo.) – asked the Justice Department to investigate whether Apple broke antitrust laws by blocking Beeper. “We also fear these types of tactics may more broadly chill future investment,” the lawmakers said. The DOJ could file an antitrust lawsuit against Apple by as soon as March, Bloomberg reported last month. The feds are reportedly set to argue that Apple engages in anticompetitive practices to ensure the continued dominance of its iPhone ecosystem. Advertisement "
}