{
    "title": "Don't dry your iPhone in rice – do this instead, says Apple",
    "date": "2/20/2024",
    "url": "https://www.telegraph.co.uk/business/2024/02/20/drying-iphone-in-rice-could-cause-more-damage-apple/",
    "text": "Tech giant offers an alternative solution to save your waterlogged device Drying out a wet phone in a bowl of uncooked rice is a time-tested hack that has seemingly rescued many a device. But Apple has now told iPhone users to stop using the method to fix waterlogged phones, warning that it could actually cause more damage. A guide to fixing soaked phones newly published on Apple’s website warns users: “Don’t put your iPhone in a bag of rice. Doing so could allow small particles of rice to damage your iPhone.” While the guidance flies in the face of folk wisdom, it appears to confirm tests that suggest rice is a poor way of absorbing moisture from a stricken phone. Apple’s guidance also states that users should not try to dry out iPhones using a hairdryer, or by inserting absorbent items into ports. Instead, it says people should tap their phones with the charging port facing down to allow water to trickle out and wait. Using rice as a way to dry out phones is believed to have originated from advice given to photographers seeking to keep exposed film dry in humid climates. Tea leaves and brown paper are also recommended as alternatives. However, rice is widely understood to be a poor desiccant – a substance that absorbs moisture from other sources – compared to alternatives such as silica gel packets, which are often packaged with electronic devices. One test by a US phone retailer in 2014 found that porridge oats, couscous and cat litter all absorbed more water from a waterlogged phone than rice. Ultimately, the test concluded that the most effective way to dry a phone was to leave it in the open air. Use of the rice trick is believed to have persisted, and appeared to work, because covering a phone in rice means owners are not attempting to charge or turn on their devices, which is more likely to cause permanent damage. Experts have previously warned that the starch in rice could mean components in wet phones may become damaged more quickly. iPhones and other smartphones have become more water resistant in recent years as materials improve and as weak points such as the headphone connector have been removed. Apple has certified its phones as water resistant since 2017, the year it removed the headphone port from its phones. The latest iPhones can survive for up to 30 minutes in up to six metres of water, according to the company, as well as surviving spills from drinks including coffee and wine. Water damage typically comes through the phone’s charging port, although iPhones now prevent charging cables from working if they detect liquids in the area. Any attempt to charge a wet phone will trigger an alert warning owners to wait for the device to dry out. People’s attachment to their phones at all hours has led to growing numbers of phones being accidentally submerged in water. The insurer Direct Line found four years ago that half of Britons take their phones to the toilet. It said that 40pc had dropped an item down the toilet or sink and 1.8 million had dropped their phone down the toilet in the last year alone. In 2020, the Italian competition regulator fined Apple €10m (£8.6m) for what it said were misleading claims about how water resistant the latest iPhones are. It said the company’s claims that its iPhones were water resistant for 30 minutes only stood up under laboratory conditions involving pure water, and not in the real world. "
}