{
    "title": "What is FaceTime, how to use it on your device?",
    "date": "2/29/2024",
    "url": "https://www.businessinsider.com/facetime",
    "text": "       FaceTime is Apple's platform for video and audio calls. The iconic app that made mobile video-calling ubiquitous was first launched in 2010, and has since allowed millions of Apple users to spend time face-to-face with their loved ones, even while apart. Recent versions of FaceTime also include a host of popular videoconferencing features, including screen sharing, Portrait Mode to blur your background, and SharePlay to watch videos or listen to music in sync during a FaceTime call. Here's everything you need to know about using FaceTime: To start a FaceTime call, you simply need an iOS device that supports FaceTime. This includes: iPhone 4s and later versions iPad 2s and later versions All versions of the iPad Pro and iPad mini Mac computers that run Mac OS X Mavericks or later FaceTime comes pre-installed on Apple devices including iPhones, iPads, iPod Touches, and Mac computers. But if you can't find it, FaceTime is also available on the App Store for iPhones and iPads. Related stories To start a FaceTime call, you'll also need the phone number or email address of the person you're trying to call. While Android and Windows users are unable to start FaceTime calls or download the FaceTime app, they can join existing FaceTime calls if they're invited via a link from an Apple device. There are several ways to start a FaceTime call. One way is by launching the FaceTime app on your mobile device or Mac computer, signing in with your Apple ID, and tapping New FaceTime. From there, you can select one or more of your existing contacts, or type out one or more phone numbers or email addresses. Then, you can opt for an audio or video FaceTime call. You can also start a FaceTime call with an Android or Windows user by opening the FaceTime app, tapping Create Link, and sending it to a recipient through an app like Messages or Mail. The recipient can then open the link in any up-to-date browser and join the FaceTime call. Another way to start a FaceTime call is through your contacts list. Launch the Contacts app on your device, and select the person you want to call. You can make an audio or video FaceTime call through the contact card. FaceTime is free to use, even when calling internationally. FaceTime simply requires an internet connection to work, and can make calls using Wi-Fi if you're connected to a Wi-Fi network, or using data if you're connected to cellular internet. FaceTime can potentially use a lot of data — particularly if your calls are long, involve multiple people, and use video instead of audio only. But users can avoid hefty data usage by connecting to a Wi-Fi network before making calls. You can also prevent your device from using cellular data for FaceTime calls by opening Settings, tapping Cellular, and scrolling to FaceTime and toggling the green switch to the off position. This will ensure you can only make FaceTime calls if your device is connected to Wi-Fi. Some newer Apple devices allow gesture-based video reactions as part of FaceTime's videoconferencing features. You can trigger 3D animations like hearts, thumbs up, and thumbs down effects by using the corresponding hand gestures on your call. FaceTime gestures are only available on iPhone 12s or later, or on Macs with Apple silicon running macOS Sonoma. To use FaceTime gestures on an iPhone, open Settings, and click on Control Center. Hit Video Effects and make sure Reactions is turned on. You can then start using gestures during FaceTime calls — just make sure to keep your hands away from your face and hold the gesture long enough to trigger the 3D effects. To use FaceTime gestures on a Mac, ensure the Reactions feature is on by clicking the green icon on your Mac's menu bar while the FaceTime app is open. You can then turn the Reactions feature on or off. Read next Jump to "
}