{
    "title": null,
    "date": "3/20/2024",
    "url": "https://www.channelnews.com.au/us-doj-to-go-after-apple-as-oz-judge-demands-a-please-explain/",
    "text": "Their share value is falling, and they have already been fined over $3 billion dollars this year for questionable business practises now Apple is set to be hit with a US Justice Department investigation after being accused violating antitrust laws by blocking rivals from accessing hardware and software features of its iPhone. The investigation is tipped to be announced early next week via a filing in the US Federal Court. In Australia Apple’s questionable business methods appears to have also upset Federal Court judge Justice Jonathan Beach who is now demanding an explanation for allegedly “misusing a submission in this court to put pressure on Epic”. Epic Games, one of the world’s most successful games developers, has sued both Apple and Google in Australia, alleging the two tech giants illegally misuse their considerable market power to force developers like Epic to use the iPhone and Android app stores and payments systems. Recently Apple revoked a licence that would have allowed Epic Games to make an iPhone app store. Justice Jonathan Beach wants to know why and has called on Apple to explain their actions. The AFR claims that agitated exchange yesterday, between Justice Beach and Apple’s Australian lawyers came after he was shown a letter written to Epic by Apple’s law firm in the US, in which Apple appeared to exercise the very power Epic is complaining about. The EU recently tore up Epic’s developer licence in Europe, in part because of something Epic said in its pleadings in the Australian case. Informing Epic on March 2 that it was unilaterally terminating a software licensing agreement that would have allowed Epic to develop its own app store for iPhones in Europe (a decision Apple later regretted, and reversed), Apple’s lawyers wrote: “Moreover, a recent submission in the Australian litigation suggests that Epic Games Sweden AB is part of a global effort to undermine or evade Apple’s rules.” The case is ongoing. The US lawsuit tipped to be filed next week comes as Apple is coming under increasing scrutiny in Europe and Australia over alleged anticompetitive behaviour. The company was hit with $3 billion fine this month for shutting out music streaming rivals from offering cheaper deals. As they do, Apple’s appealing the penalty. Under investigation on several continents Apple is also facing a full-blown investigation under the EU’s new rules for Big Tech — the Digital Markets Act — which went into force earlier this month. Rivals have slammed new App Store rules that came into force in Europe, complaining that changes are likely to result in higher prices for developers. Penalties for failing to comply with the EU’s new rules can be severe – as much as 10% of a company’s annual worldwide revenue or up to 20% for repeat offenders. In addition to the new US legal action, Meta Platforms, Microsoft, Elon Musk’s X (formerly Twitter) and Match Group have filed a legal petition protesting Apple’s app store policies. They are objecting to how Apple has complied with a federal court ruling that ordered it to allow alternative payment methods. The four companies, which have some of the most popular apps on the app store, join Fortnite-maker Epic Games in protesting Apple’s plan to charge a commission for payments made outside the app store. The briefing underscores the extent to which Apple’s rivals and other technology players intend to continue fighting to force the iPhone maker to loosen its tight controls over third-party software. Apple charges up to a 30 per cent commission for purchases in the app store for services or one-time fees, a rate that developers say is too high.  With sales under pressure Apple chief executive Tim Cook has moved to try and shore up falling sales in China a key market for the US Company. Yesterday he met with Chinese officials ahead of the company’s new store opening in Shanghai. Cook, who is keen to cuddle up to Chinese demands is expected to take part in a state-organised China Development Forum in Beijing over the weekend. Cook also had a meeting with Wang Chuanfu, the founder, chairman and chief executive of the world’s largest electric vehicle maker BYD, at the Apple office in Shanghai, according to a report by China Daily.   02 9002 5900 [email protected] Level 1, 275 Alfred Street\nNorth Sydney\nNSW 2060\nAustralia  "
}