{
    "title": null,
    "date": "3/23/2024",
    "url": "https://thebharatexpressnews.com/analysis-the-breakup-of-google-and-apple-is-on-the-agenda-as-global-regulators-focus-on-technology/",
    "text": " By Foo Yun Chee and Supantha Mukherjee BRUSSELS/STOCKHOLM (Reuters) – Big Tech is facing its biggest challenge in decades as antitrust regulators on both sides of the Atlantic crack down on alleged anti-competitive practices that could lead to termination orders on Apple and Alphabet’s Google, a first for the industry. That in turn could inspire watchdogs around the world to go further, as evidenced by the growing number of antitrust investigations in several countries following the opening of cases in the EU and the US.  Since AT&T was split up exactly four decades ago, no company has yet faced the possibility of a regulator-led breakup in the United States. Google has said it disagrees with the EU’s allegations, while Apple said the US lawsuit is both factually and legally incorrect. In 1984, AT&T, also known as Ma Bell, was split into seven independent companies called “Baby Bells” to open one of the most powerful monopolies of the 20th century.  AT&T, Verizon and Lumen are currently the only remaining entities. Regulators now claim that companies like Apple and Google have built impenetrable ecosystems around their products, making it difficult for customers to switch to competing services, leading to the coining of the term walled gardens. The U.S. Department of Justice warned Apple, a $2.7 trillion company, on Wednesday that a breakup order could not be ruled out as a remedy to restore competition after it joined 15 states in suing the iPhone maker for monopolizing the smartphone market and antagonizing rivals and inflating prices. Still, it will likely take years before a decision is reached in the case, which Apple has vowed to fight. The US actions follow other growing threats across Europe this week. Big Tech will soon come under increased scrutiny, with Apple, Meta Platforms and Alphabet likely to be investigated for potential violations of the Digital Markets Act (DMA) that could lead to hefty fines and even termination orders for repeat breaches, people with direct knowledge of the case told Reuters on Thursday, on condition of anonymity. The story continues EU antitrust chief Margrethe Vestager helped pave the way for drastic action last year when she accused Google of anticompetitive practices in its money-grubbing adtech business and that the company may have to divest its sales tools. She said requiring Google to sell some of its assets seemed the only way to avoid conflicts of interest, as this would prevent Google from favoring its own online digital advertising technology services over advertisers and online publishers. Vestager is expected to make a final decision by the end of this year. European Parliament MEP Andreas Schwab, who was deeply involved in drafting groundbreaking EU DMA technology rules that came into force this month, said lawmakers want bold action against Big Tech that flouts rules. “If they don’t comply with the DMA, you can imagine what Parliament will ask for.  Splits.  The ultimate goal is to make markets open and fair and enable more innovation,” he said on Friday. BREAKUP IS HARD It is far from certain that regulators will issue a dissolution order as they consider options and any action could only lead to a fine.  Legal experts also suggested that the case against Apple, based on the 1998 case against Microsoft, could be more difficult this time. “In the European Union there is less tradition where splitting a company is seen as a last resort.  That has never happened before,” said a Commission official, speaking on condition of anonymity. Apple’s highly integrated system would also make a break with Google difficult, says lawyer Damien Geradin of Geradin Partners, who advises several app developers in other cases against Apple. “It seems much more complicated to me. You’re talking about something that is integrated, for example you can’t force Apple to divest its App Store. That doesn’t make sense,” he said. He said it would be better to impose behavioral measures on Apple that require the company to do certain things, while in Google’s case a breakup order could simply target acquisitions made to strengthen its core services. “What is more likely is that they (DOJ) will go for solutions such as opening up hardware functionality, or ensuring that developers are not discriminated against in terms of pricing,” said Max von Thun, director of advocacy group Open Markets. “I think they want to say everything is on the table, but that doesn’t necessarily mean they’re going to choose that path,” he said. Apple gets the bulk of its revenue of nearly $400 billion a year from selling hardware – iPhones, Macs, iPads and watches – followed by its Services business, which will bring in about $100 billion a year. Structural solutions such as divorces will ultimately be tested in court, said Assimakis Komninos, partner at law firm White & Case. “I would say that there are not many experiences with imposed structural measures, such as divorces, but the small experiences from the past show that this is very difficult, apart from the enormous legal challenges,” he said. (Reporting by Foo Yun Chee in Brussels and Supantha Mukherjee in Stockholm, additional reporting by Martin Coulter in London; Editing by Ken Li and Anna Driver) Save my name, email, and website in this browser for the next time I comment.   Δ "
}