{
    "title": "Nvidia on cusp of overtaking Apple as second-most-valuable company",
    "date": "3/8/2024",
    "url": "https://www.moneycontrol.com/news/business/nvidia-on-cusp-of-overtaking-apple-as-second-most-valuable-company-12427481.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Nvidia is nipping at the heels of Apple to become the world's second-most-valuable company, as investors cannot get enough of the semiconductor maker whose chips power popular artificial intelligence tools such as ChatGPT. An AI-induced jaw-dropping rally in Nvidia shares has taken the company's valuation from $1 trillion to more than $2 trillion in just nine months, overtaking Amazon.com, Google-parent Alphabet and Saudi Aramco on the way. Nvidia's market capitalization currently hovers around $2.38 trillion, lagging Apple by just about $230 billion and Microsoft by about $645 billion. The relentless rise in shares of Nvidia, which controls 80% of the high-end AI chip market, has been instrumental in pushing Wall Street to record levels this year, while giving the company a more than 5% weightage on the benchmark S&P 500 index. Nvidia, which is up 95%, and Meta Platforms, which is up 46.6% so far this year, have also outperformed shares of other members of the so-called Magnificient 7, highlighting investors' insatiable appetite for everything AI. \"Nvidia's rally reflects the incredibly strong fundamentals underlying its current business model,\" said Richard Meckler, partner at Cherry Lane Investments, a family investment office in New Vernon, New Jersey. \"It is also finding strong speculative support as a favorite among long option buyers who have seen almost a straight upward climb throughout 2024.\" Meanwhile, Apple, which is grappling with slowing iPhone sales, ceded its position as the most valuable U.S. company to Microsoft for the first time since 2021 in January. In recent weeks, Nvidia also replaced Tesla as Wall Street's most traded stock by value. The stock's 12-month forward price-to-earnings ratio of 36.6 is lower than where it was a year ago despite the stock's strong run as analysts raised its profit estimates. \"Nvidia is in fact the cheapest of the \"AI narrative\" stocks out there,\" said David Wagner, portfolio manager at Aptus Capital Advisors. \"We continue to believe that in five years or 10 years we will all be talking about an industry that is far larger than the numbers being bandied about today.\" However, there are signs Nvidia stock is nearing a peak. Over the next 12 months, Wall Street analysts' median target price implies Nvidia would trade at $850 per share, below the last closing price of $926, LSEG data showed. \"Of course, it is very difficult for any mega-cap stock's price to continue to grow at this pace as the law of large numbers eventually comes into play. But the stock price could remain at these levels if the company can continue to meet or exceed the high expectations of analysts,\" Cherry Lane's Meckler said. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}