{
    "title": "EU slaps Apple with 1.8-bln-euro antitrust fine",
    "date": "3/4/2024",
    "url": "https://www.capitalfm.co.ke/business/2024/03/eu-slaps-apple-with-1-8-bln-euro-antitrust-fine/",
    "text": "Hi, what are you looking for? Ghana distributes 1.3 mln free tablets to boost digital literacy in schools Kenyan fintechs head to Ghana to lure investors Florida passes law limiting children’s access to social media 4 out of 5 New Zealand businesses offer employees work-style choices Innovators offer solar drying solutions for farm produce Gov’t to earn Sh5bn from its stake in Kenya Pipeline Company Kenya to resume tea exports to Tanzania after trade dispute resolves Driving Kenya’s Digital Future: Insights from the DTPS Forum and Awards President Ruto launches medium-term economic plan State starts process of licensing more digital certification service providers Introvert DJ Joe Mfalme on his journey to success in the music industry The Evolution of e-commerce as told by Ronald Kaleu Wowzi! You Want To Be An Influencer? Going Full-Time: Julia Gaitho’s Move from Employment to Full-Time Content Creator Digital Marketing and The Transformative Power of The Internet Craft beer maker, Big Five, transfers a portion of its plant, equipment to Wananchi Kenya’s monthly inflation drops to 5.7pc on falling fuel, electricity prices Davis and Shirtliff calls for increased investment in water projects for food security Partnerships crucial in elevating Kenya’s film industry to global standards Britam’s gross profit up 65 percent to Sh4 billion Indian gov’t orders mandatory declaration of wheat stock position from April Ukraine’s GDP grows 5.3 pct in 2023 China’s Xiaomi releases its first self-developed NEV Japan’s February jobless rate climbs to 2.6 pct UK economy falls by 0.3 pct in Q4 2023 The Importance of Attitude and Life Experiences in Career Growth Introvert DJ Joe Mfalme on his journey to success in the music industry The Evolution of e-commerce as told by Ronald Kaleu Wowzi! You Want To Be An Influencer? Going Full-Time: Julia Gaitho’s Move from Employment to Full-Time Content Creator Capital FM commemorates anniversary of Chris Kirubi’s death Finding Opportunity in the midst of the pandemic: AskKirubi COVID-19: Lessons Learned and Future Direction for Entrepreneurs Kirubi set to acquire half of Centum Plc following nod by CMA Kirubi warns investors against fake cryptocurrency platform using his name By Published BRUSSELS, March 4 (Xinhua) — The European Union (EU) on Monday slapped tech giant Apple with 1.8 billion euros (about 1.95 billion U.S. dollars) of antitrust fine. Apple was fined for the alleged abuse of its dominant market position in the distribution of music streaming apps to iPhone and iPad users via its App Store, according to a statement from the European Commission. SAN FRANCISCO– Apple will be banned from selling watches with blood oxygen sensors beginning Thursday in the United States, the US Court of Appeals... KUALA LUMPUR, Sept. 29 (Xinhua) — Malaysia has imposed anti-dumping duties on Japanese cold rolled coils following the completion of its investigations, which began... NAIROBI, Kenya, Sep 17 – Telecommunication giant, Safaricom, will be developing a partnership with Apple Inc. to integrate MPESA and its Paypal platform. This... SAN FRANCISCO, United States, Sep 17 – President William Ruto has invited American technology companies to set up manufacturing operations and regional offices in... SAN FRANCISCO, Sept. 13 (Xinhua) — Apple on Wednesday disputed the findings of France’s regulator claiming iPhone 12 emits electromagnetic radiation above standard for... BEIJING, China, Aug 18 – Apple megafans flocked to Beijing’s swish flagship store on Friday as the tech giant kicked off its fourth decade... SAN FRANCISCO, United States, Aug 4 – Amazon and Apple on Thursday reported earnings that topped market expectations, aiming for even better days ahead... CUPERTINO, United States, June 6 – Apple on Monday unveiled its first mixed reality headset, challenging Facebook-owner Meta in a market that has yet... © 2024 Capital Digital Media. Capital Group Limited. All Rights Reserved "
}