{
    "title": "The Apple case: Why is US Department of Justice suing iPhone maker",
    "date": "3/21/2024",
    "url": "https://www.businesstoday.in/technology/news/story/the-apple-case-why-is-us-department-of-justice-suing-iphone-maker-422496-2024-03-22",
    "text": "Feedback The US Department of Justice (DOJ) has taken legal action against tech giant Apple, alleging that the company is monopolising the smartphone market to maintain the dominance of its iPhone devices. The lawsuit, filed on March 21st, implicates Apple's practices as detrimental to both consumers and third-party developers, and it covers a broad spectrum of issues ranging from messaging services to app distribution. \"Apple exercises its monopoly power to extract more money from consumers, developers, content creators, artists, publishers, small businesses, and merchants, among others,\" wrote the DOJ in its complaint. Central to the DOJ's argument is the claim that Apple is employing various tactics to ensure the continued success of the iPhone, even at the expense of fair competition. These tactics allegedly include imposing restrictive contracts on developers, limiting access to essential phone functionalities, and blocking the development of rival technologies. \"For years, Apple responded to competitive threats by imposing a series of ‘Whac-A-Mole’ contractual rules and restrictions that have allowed Apple to extract higher prices from consumers, impose higher fees on developers and creators, and to throttle competitive alternatives from rival technologies,\" said DOJ Antitrust Division Chief Jonathan Kanter. DOJ Concerns and Grievances One of the key grievances highlighted by the government is Apple's control over its messaging platform, iMessage, which is not interoperable with other platforms like Android. This exclusivity, according to the DOJ, contributes to the perception that rival smartphones are inferior and further entrenches iPhone users in Apple's ecosystem. US Attorney General Merrick Garland emphasised concerns over Apple's messaging strategy, noting the disparity between iMessage and other platforms in terms of features and encryption. The DOJ contends that such disparities contribute to the \"lock-in\" effect, whereby users are discouraged from switching to competing devices. Another aspect of the lawsuit focuses on the App Store and the fees and guidelines imposed on developers. The government alleges that Apple's policies hinder the development of \"super apps\" and cloud gaming services, thereby stifling competition and innovation. Apple's Strong Response In response to the lawsuit, Apple has strongly defended its practices, arguing that the legal action threatens innovation and sets a dangerous precedent for government intervention in technology design. \"This lawsuit threatens who we are and the principles that set Apple products apart in fiercely competitive markets,\" said Apple spokesperson Fred Sainz. \"We believe this lawsuit is wrong on the facts and the law, and we will vigorously defend against it.\" The outcome of the legal battle is expected to have significant implications for Apple and the broader tech industry. While Apple has announced plans to make changes to its App Store framework in the European Union, the DOJ remains steadfast in its pursuit of accountability for what it perceives as anti-competitive behaviour. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}