{
    "title": "Apple's stock pressure could continue for months, this bull concedes",
    "date": "3/9/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240309295/apples-stock-pressure-could-continue-for-months-this-bull-concedes",
    "text": "By Emily Bary Smartphone demand has been sluggish, though the June WWDC event could show how Apple plans to capitalize on AI Apple Inc.'s stock is coming off a seven-session losing streak, and it's down 12% so far this year. The bad news? Apple shares (AAPL) could remain under pressure through the company's WWDC developer event in June, according to a Citi Research analyst. Smartphone demand has been sluggish, though that event could become the \"AI catalyst to drive upside to 2025 AI smartphone demand,\" Citi's Atif Malik wrote Friday. See also: Apple's stock is in a 'funk.' Could Warren Buffett be selling more shares? While Malik kept his buy rating on Apple shares, he narrowly reduced his price target to $220 from $225 in his latest note to clients. He's concerned about a few data points related to China. For one, third-party data from Counterpoint Research suggested that iPhone unit sales plunged 24% in China during the first six weeks of the year. And Apple appears to be getting more aggressive with its discounting in order to drive sales. \"We note that Apple started to offer up to $180 discount on the iPhone 15 series as part of the International Women's Day sale, which is a higher discount than the $120 discount last year on the iPhone 14 series,\" Malik wrote, in discussing the China market. Meanwhile, his analysis of U.S. third-party data found that foot traffic to a sampling of U.S. Apple Stores was off 6% in the first two months of 2024 relative to the same period a year before. Don't miss: Apple's stock has had a sour 2024. This bull sees 'a host of tailwinds' ahead. In light of all that, why does Malik continue to hold a positive view of the stock? He cheered \"structural gross-margin expansion due to premiumization supported by AI smartphones and services growth\" in his latest note to clients. In other words, \"AI smartphones will be the next battle ground for smartphone makers,\" and Apple's WWDC event could hold clues about the company's plan to keep its grip on the market for expensive handsets. \"Apple currently holds 75% market share in the premium phone market...and we expect Apple to release [generative AI] features to maintain its position in the high-end market,\" Malik said. Those features could include AI tools that make coding easier. -Emily Bary This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 03-09-24 0805ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}