{
    "title": "Norfolk County Council beats Apple in £385m iPhone row",
    "date": "3/17/2024",
    "url": "https://ca.movies.yahoo.com/norfolk-county-council-leads-385m-165028041.html",
    "text": "Apple has agreed to pay $490m (£385m) to settle a lawsuit led by Norfolk County Council. The class action alleged the tech giant's boss, Tim Cook, defrauded shareholders by covering up lower demand for iPhones in China. The council said a pension fund it administered lost money as a result of Mr Cook's actions. In a statement, the Norfolk Pension Fund said it was \"very proud of this recovery for investors\". The statement continued: \"We are mindful that we are stewards of pensions relied upon by thousands of families and individuals. \"When and where it's warranted, we will take decisive action to recover losses when our participants' investments are harmed by fraud.\" The BBC has approached Apple for comment. The class action lawsuit - meaning it is on behalf of a group of claimants - centred around comments made by Apple's chief executive Tim Cook. He told investors on 1 November 2018 that there was \"sales pressure\" in some countries but he \"would not put China in that category\". However, two months later, on 2 January 2019, Apple downgraded its quarterly revenue forecast, citing tensions between China and the US - leading to a sharp drop in Apple's share price. Within that two-month window, reports emerged that Apple had told its top smartphone assemblers to \"halt plans for additional production lines\" for the recently released iPhone XR. The claimants in this case were all investors who had bought shares between November 2018 and January 2019. They said they lost money because they had been falsely reassured by Mr Cook's comments in November. The case was originally brought against Apple and Mr Cook by the US city of Roseville. Norfolk County Council, which administers the £4.9bn Norfolk Pension Fund, took over the lawsuit as lead plaintiff in 2020. Apple had fought the litigation, and a trial was scheduled for later this year. This preliminary settlement - filed on Friday with the U.S. District Court in Oakland, California - should mean that will no longer happen, however it still requires approval by a judge. It is not known what portion of the settlement Norfolk County Council will receive. Apple posted $97 billion of net income in the last fiscal year. The pay-out equals a little under two days of profit for what is one of the world's wealthiest companies. Key Insights The considerable ownership by private companies in Paramount Resources indicates that they collectively... Shareholders might have noticed that Jefferies Financial Group Inc. ( NYSE:JEF ) filed its first-quarter result this... Local Bounti Corporation (NYSE:LOCL) Q4 2023 Earnings Call Transcript March 27, 2024 Local Bounti Corporation misses on earnings expectations. Reported EPS is $-8.1 EPS, expectations were $-3.18. LOCL isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning, and welcome […] The actress celebrated her daughter Matilda's first birthday on Saturday There's no doubt that money can be made by owning shares of unprofitable businesses. For example, biotech and mining... Police in southern Russia have arrested three men from Central Asia for allegedly plotting a bomb attack, a week after Islamic State terrorists from Tajikistan killed 144 people at a rock concert in Moscow. Women working for the Office for National Statistics face disciplinary action if they object to male-born colleagues using single-sex lavatories and changing rooms, documents leaked to The Sunday Telegraph reveal. Spurs welcome the Hatters to town looking to get back on track Molina Healthcare (NYSE:MOH) has had a great run on the share market with its stock up by a significant 14% over the... Bunnyville at the Detroit Zoo A few scattered snow showers are possible in Colorado's higher elevations, but it will remain dry across the metro and plains. Passive investing in index funds can generate returns that roughly match the overall market. But you can significantly... Scrub Daddy, pimple patches and an awesome upholstery cleaner: The 'net is gaga over these picks. Iran International journalist Pouria Zeraati is recovering in hospital after being attacked on Friday. Cuts to central funding leaves lower tier of local government left to look after libraries, street cleaning and other facilities The French actress (\"The English Patient\") will succeed Polish director Agnieszka Holland (\"Europa\") in the honorary role. Key Insights Given the large stake in the stock by institutions, Wynn Resorts' stock price might be vulnerable to their... ProSomnus, Inc. Common Stock (NASDAQ:OSA) Q4 2023 Earnings Call Transcript March 27, 2024 ProSomnus, Inc. Common Stock misses on earnings expectations. Reported EPS is $-0.42 EPS, expectations were $-0.31. OSA isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good day, […] COMMENT: Why is it that, in 2024, age-gap relationships still cause such brouhaha? There is no escaping the whispers and judgement if you choose to date someone much older or younger – but when it comes to love, we’ve all got skin in the game, writes Olivia Petter Photo Illustration by Luis G. Rendon/The Daily Bast/Getty Images/Courtesy of Keianna MillerThe family of a Black 4-year-old boy who was shot dead by police responding to a bloody domestic violence incident are considering taking legal action. Lawyers representing Keianna Miller, whose son Terrell was killed by Macomb Police two weeks ago, told The Daily Beast she may file a civil lawsuit.“Police would lead a criminal investigation. The civil would be by a personal injury law firm like ours for a "
}