{
    "title": "Jamf announces same-day support for visionOS 1.1",
    "date": "3/7/2024",
    "url": "https://au.finance.yahoo.com/news/jamf-announces-same-day-support-211500760.html",
    "text": "Jamf customers will also be able to safely navigate the changes introduced in iOS 17.4 as a result of the Digital Markets Act MINNEAPOLIS, March 07, 2024 (GLOBE NEWSWIRE) -- Jamf (NASDAQ: JAMF), the standard in managing and securing Apple at work, today announced its same-day support for Apple Vision Pro’s visionOS 1.1 release, which became generally available today. Jamf’s same-day support for visionOS 1.1 comes shortly after its support for iOS 17.4 which introduced significant changes necessitated by the Digital Markets Act (DMA), which went into effect on March 5. Same-day support to help organizations re-imagine how work gets doneToday’s release of visionOS 1.1 introduces mobile device management (MDM) support, making Apple Vision Pro enterprise-ready with the key foundations for deploying and leveraging the device at scale. In lock-step with Apple, Jamf is supporting Apple Vision Pro today, enabling device management and secure access to company resources while protecting the device from threats. This follows Jamf’s recently announced support for Apple Vision Pro within its Jamf Protect and Jamf Connect products. Now management for this powerful new endpoint is available in Jamf Pro, allowing Apple Vision Pro users within an organization to achieve Trusted Access, where only authorized users on enrolled and safe devices can access company data. Learn more here or register for the upcoming webinar here. \"Jamf has a long history of offering same day support for Apple OS releases, and visionOS 1.1 is no exception,” said Henry Patel, Chief Strategy Officer at Jamf. “We’re excited to continue working with our customers as they explore the possibilities of Apple Vision Pro at work, with the confidence that their data is protected and secured by the full Jamf platform, from day one.” Same-day support for sweeping regulatory requirementsThe changes Apple introduced in iOS 17.4 in order to enable it to comply with the Digital Markets Act mean users in European countries can now gain access to alternative app marketplaces and apps procured outside of the official Apple App Store on iOS. Jamf has always been in the business of helping its customers seamlessly manage and secure their Apple technology and it continues that trend with the changes introduced in iOS 17.4. With Jamf Pro, customers can manage these changes with a new restrictions-based configuration profile which gives customers the option to restrict the installation and use of third-party apps and app marketplaces. Learn more here. About JamfJamf’s purpose is to simplify work by helping organizations manage and secure an Apple experience that end users love and organizations trust. Jamf is the only company in the world that provides a complete management and security solution for an Apple-first environment that is enterprise secure, consumer simple and protects personal privacy. To learn more, visit www.jamf.com. Media Contact:Liarna La Porta | media@jamf.com Investor Contact:Jennifer Gaumond | ir@jamf.com  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  This update would represent Apple's first overhaul to that lineup since 2018. ANALYSIS: The US and EU argue that Apple is abusing its power to crush competition and blight users’ experience. The iPhone maker says the proceedings threaten the company. Andrew Griffin examines what the row could mean for the technology in your pocket Trade 24 hours a day on the world's most popular platform. Apple will finally launch new iPads in early May, according to Bloomberg’s Mark Gurman. Expected are a new iPad Pro with an OLED display and a faster iPad Air, including a 12.9-inch model for the first time in that lineup. (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b This food habit is linked to a specific type of dementia.  The dreaded pest also displaces wildlife and can blind pets. Find out more. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show.  The \"Late Night\" comedian brutally summed up the former president's media company. King Edward VIII’s proposal to Wallis Simpson marked a constitutional crisis in Britain almost 90 years ago MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president.  The concerned shopper raised the alarm with staff at the store. Now, a 'full product inspection' is underway. The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. The person who wrote on the road has been called a \"top bloke\" by motorists.  Jacqui Lambie has responded after Senator Tammy Tyrrell announced she was leaving the Jacqui Lambie Network to sit as an independent. ‘Once I saw the payment screen, I would have called and cancelled my RSVP’ Footage shows Dylan Edwards moved out of the way. Find out more here.  The \"Daily Show\" contributor reminded viewers of Trump's most controversial moments, and ripped him as a “terrible f**king president.\" Despite referee Gerard Sutton labelling the collision \"incidental\", Souths superstar Latrell Mitchell has been charged for dangerous contact on Josh Addo-Carr. The ugly incident involving the AFL veteran has sparked debate. More here. "
}