{
    "title": "Apple stock downgraded as Barclays warns on cooling iPhone demand",
    "date": "1/2/2024",
    "url": "https://www.moneycontrol.com/news/business/stocks/apple-stock-downgraded-as-barclays-warns-on-cooling-iphone-demand-11988701.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Apple Inc. got itself a new bear as expectations of soft demand for its latest iPhone prompted analysts at Barclays Plc to downgrade the stock. Barclays analysts led by Tim Long cut their rating on Apple to underweight and price target to $160 from $161, implying a 17% decline over the next year. The stock dropped as much as 1.4% in US premarket trading on Tuesday. “We expect reversion after a year when most quarters were missed and the stock outperformed,” the analysts wrote in a note on Tuesday. “Our checks remain negative on volumes and mix for iPhone 15, and we see no features or upgrades that are likely to make the iPhone 16 more compelling.”  Apple’s shares rose around 50% to a record last year and saw its market value hit $3 trillion as investors bet that its flagship device will withstand a sluggish economy. However, doubts have emerged whether the stock will be able to repeat such hefty gains given rising competition from the likes of Huawei Technologies Co. and a Chinese government crackdown on foreign-made devices. Barclays’s new underweight means Apple has five sell or equivalent ratings, according to data compiled by Bloomberg, in contrast to 34 buys and 14 holds. The stock’s consensus price target predicts a return of just 3.6% over the next year.  DAILY-EVENING DAILY-EVENING Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}