{
    "title": "ETFs in Focus Ahead of \"Magnificent Seven\" Q4 Earnings",
    "date": "1/19/2024",
    "url": "https://finance.yahoo.com/news/etfs-focus-ahead-magnificent-seven-150000712.html",
    "text": "The so-called \"Magnificent Seven\" stocks — Apple AAPL, Microsoft MSFT, Alphabet GOOGL, Amazon AMZN, Nvidia NVDA, Tesla TSLA and Meta Platforms META — had a stellar 2023. The solid trend has continued with the start of 2024 on the ongoing artificial intelligence (AI) craze, with the exception of Apple and Tesla.Apple has been struggling, with shares plunging 2% on concerns about iPhone sales, particularly in China. Meanwhile, Tesla dropped nearly 12%, driven by price cuts of its electric vehicles in China and Europe as well as supply chain delays due to a crisis in the Red Sea (read: Microsoft & Apple in Tug-Of-War: ETFs in Focus).However, fourth-quarter earnings are expected to drive the whole group higher. Overall, fourth-quarter earnings for \"Magnificent Seven\" are expected to grow 38.4% from the same period last year on 12.4% higher revenues. This would follow the 54.2% earnings growth for the group in the third quarter on 12.9% higher revenues.Among the group of companies, Tesla is set to report first on Jan 24, followed by Microsoft on Jan 30. Alphabet, Apple, Amazon and Meta Platforms are expected to release their results on Feb 1. Nvidia is expected to come up with earnings on Feb 28 (see: all the Technology ETFs here).TeslaTesla has an Earnings ESP of -1.04% and a Zacks Rank #3 (Hold). According to our methodology, the combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 increases the chances of an earnings beat. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.The electric carmaker saw positive earnings estimate revision of a penny over the past 30 days for the to-be-reported quarter. Analysts increasing estimates right before earnings — with the most up-to-date information possible — is a good indicator for the stock. The Zacks Consensus Estimate for the fourth quarter indicates a substantial year-over-year earnings decline of 37.8% and revenue growth of 6.9%. The earnings track record of the company is robust. It delivered a four-quarter average earnings surprise of 3.22%. Tesla has a solid Growth Score of B but falls under a bottom-ranked Zacks industry (bottom 31%). The electric carmaker is up 1.5% in the last three months (read: ETFs to Ride on Tesla's Record Q4 Delivery Numbers).MicrosoftMicrosoft has an Earnings ESP of -2.93% and a Zacks Rank #3. Microsoft saw no earnings estimate revision over the past 30 days for the to-be-reported quarter. Its earnings track record is impressive, with the four-quarter earnings surprise being 7.83%, on average. The Zacks Consensus Estimate indicates earnings growth of 18.5% and modest revenue growth of 15.7% from the year-ago quarter. Microsoft belongs to a top-ranked Zacks industry (top 41%) and has gained 14% over the past three months. It has a solid Growth Score of A.AlphabetAlphabet has an Earnings ESP of +8.17% and Zacks Rank #3. It saw positive earnings estimate revision of a penny over the past 30 days for the to-be-reported quarter. The company’s earnings surprise track record over the past four quarters is good, with the earnings surprise being 4.62%, on average. Earnings are expected to increase 54.3%, while revenues are expected to grow 12% from the year-ago quarter. Alphabet has a solid Growth Score of A and falls under a top-ranked Zacks industry (top 30%). The Internet behemoth has climbed 12.6% in the last three months.Meta PlatformsMeta Platforms has an Earnings ESP of +1.46% and Zacks Rank #2. The social media giant saw positive earnings estimate revision of 3 cents for the to-be-reported quarter over the past 30 days. The current Zacks Consensus Estimate for the yet-to-be-reported quarter indicates massive year-over-year earnings growth of 60%. Revenues are expected to increase 20.6%. Meta Platforms delivered an earnings surprise of 27.50%, on average, in the last four quarters. The stock has a solid Growth Score of A and belongs to a top-ranked Zacks industry (top 22%). Shares of META have surged about 23% over the past three months.AmazonAmazon has an Earnings ESP of +10.48% and a Zacks Rank #2. The stock saw a positive earnings estimate revision of a penny over the past 30 days for the fourth quarter. The Zacks Consensus Estimate indicates a whopping year-over-year earnings increase of 276.2% and substantial revenue growth of 11.3% for the to-be-reported quarter. Additionally, Amazon’s earnings surprise history is impressive, with the four-quarter average surprise being 54.87%. The stock has a solid Growth Score of A but falls under a top-ranked Zacks industry (top 44%). Amazon shares have returned 25% in the past three months.AppleApple has an Earnings ESP of +3.65% and a Zacks Rank #2. Apple saw no earnings estimate revision over the past 30 days for the fiscal fourth quarter. The iPhone maker has a strong track record of positive earnings surprise. It delivered an average earnings surprise of 1.23% in the trailing four quarters. The Zacks Consensus Estimate indicates a modest year-over-year increase of 10.6% for earnings and 0.3% for revenues. Apple belongs to a top-ranked Zacks Industry (top 7%) and has a solid Momentum Score of B. The stock is up 6.8% over the past three months.NvidiaNvidia currently has an Earnings ESP of +3.68% and a Zacks Rank #2. This videogame-gear specialist saw a positive earnings estimate revision of a penny over the past 30 days for the fourth quarter of fiscal 2024. Nvidia’s earnings surprise history is good as it delivered an earnings surprise of 18.99%, on average, in the last four quarters. Nvidia is expected to post earnings and revenue growth of 410.2% and 232.2%, respectively, for the to-be-reported quarter. The stock belongs to a bottom-ranked Zacks Industry (bottom 8%) and has a solid Growth Score of A. Nvidia soared about 34% in the past three months. Given this, investors may want to play these stocks with the help of ETFs. Below, we have highlighted some ETFs having the largest exposure to Magnificent Seven.The Roundhill Magnificent Seven ETF (MAGS)Roundhill Magnificent Seven ETF offers investors concentrated exposure to the “Magnificent Seven” stocks. It has amassed $55.4 million in its asset base and charges 29 bps in fees per year (read: Magnify Gains in 2024 With \"Magnificent Seven\" ETFs).MicroSectors FANG+ ETN (FNGS)This ETN is linked to the performance of the NYSE FANG+ Index, which is equal-dollar weighted and designed to provide exposure to a group of highly traded growth stocks of next-generation technology and tech-enabled companies. The note accounts for a 10% share in each of these seven stocks. MicroSectors FANG+ ETN has accumulated $189.1 million in its asset base and charges 58 bps in annual fees. It trades in a moderate volume of 211,000 shares a day on average and has a Zacks ETF Rank #3 (Hold).Vanguard Mega Cap Growth ETF (MGK)Vanguard Mega Cap Growth ETF tracks the CRSP US Mega Cap Growth Index. It holds 82 securities in its basket, with the Magnificent Seven collectively accounting for 57% of the total assets. Vanguard Mega Cap Growth ETF charges 7 bps in annual fees and trades in a good volume of around 321,000 shares a day on average. The fund has AUM of $16.6 billion and a Zacks ETF Rank #2 (read: 5 Best Top-Ranked ETFs of 2023 Set to Soar in 2024).Invesco S&P 500 Top 50 ETF (XLG)Invesco S&P 500 Top 50 ETF follows the S&P 500 Top 50 ETF Index, which measures the cap-weighted performance of the largest companies on the S&P 500 Index, reflecting the performance of the U.S. mega-cap stocks. It holds 55 stocks in its basket and Magnificent Seven accounts for a combined 50% share. Invesco S&P 500 Top 50 ETF has been able to manage assets worth $3.2 billion but trades in a good volume of about 792,000 shares a day on average. XLG charges 20 bps in annual fees and has a Zacks ETF Rank #3.iShares S&P 100 ETF (OEF)iShares S&P 100 ETF offers exposure to 101 largest U.S. companies. Magnificent Seven accounts for a combined 41.7% share. iShares S&P 100 ETF has amassed $12.6 million in its asset base and charges 20 bps in annual fees. It trades in average daily volume of 271,000 shares and has a Zacks ETF Rank #3. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Tesla, Inc. (TSLA) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Roundhill Magnificent Seven ETF (MAGS): ETF Research Reports MicroSectors FANG+ ETN (FNGS): ETF Research Reports Meta Platforms, Inc. (META) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}