{
    "title": "Apple Discounts iPhones In China Amid Weak Demand",
    "date": "1/16/2024",
    "url": "https://www.investors.com/news/technology/apple-discounts-iphones-in-china-amid-weak-demand/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Apple (AAPL) is offering discounts on its newer iPhones in China for the first time in years, amid mounting concerns of weak demand there due to new competition and a sluggish economy. AAPL stock fell modestly Tuesday, losing its market cap crown to Microsoft. The Dow Jones tech titan is cutting retail prices by RMB 500 ($70), discounting some iPhones by 5%, according to Apple's China website. It's a Jan. 18-21 promotion ahead of the Lunar New Year, which is in February. Apple often discounts various products for Lunar New Year, but hasn't done so for new iPhones in years. Discounts on some Apple gadgets are as high as RMB 800. Chinese e-commerce sites such as Pinduoduo, a unit of PDD Holdings (PDD), have discounted iPhone 15 variants by as much as 16%, Reuters reported. Several analysts have downgraded Apple stock already this year, often focused on China iPhone concerns. Jefferies estimated that Apple iPhone sales plunged 30% in China in the first week of 2024. Last August, Chinese technology giant Huawei surprised with its new advanced phone, the Mate 60 Pro, fueling massive orders. Meanwhile, a growing number of Chinese government agencies and state-owned firms have banned the Apple iPhone and other foreign handsets at work. That's also amid the backdrop of a sluggish Chinese economy. Apple will remove a blood-oxygen feature from its Series 9 and Ultra 2 watches if its court appeal fails over a patent dispute with Masimo (MASI). That will keep those high-end Apple Watch variants on the market. Apple stock fell 2.5% early Tuesday, while Microsoft edged higher. Apple stock rose 2.6% last week to 185.92, but it's in danger of losing its market cap crown to fellow Dow Jones giant Microsoft (MSFT) for the first time since late 2021. AAPL stock, which got back above a $3 trillion valuation in December, ended last week at $2.892 trillion. MSFT stock climbed to $2.887 trillion. Microsoft is up 3.3% in 2024, hitting a record high. Microsoft now has a higher market cap intraday Tuesday. Please follow Ed Carson on Threads at @edcarson1971, X/Twitter at @IBD_ECarson and Bluesky at @edcarson.bsky.social for stock market updates and more. YOU MIGHT ALSO LIKE: Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Tesla Vs. BYD: Tesla Breaks Lower; Big Week For China Rival Looms 9 Stocks Running To Start 2024; Last Year's Winner Is Leading Again Futures Fall; Elon Musk Makes This Tesla Threat 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}