{
    "title": "Bull of the Day: Apple (AAPL)",
    "date": "1/25/2024",
    "url": "https://www.zacks.com/commentary/2215260/bull-of-the-day-apple-aapl",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Benjamin Rains\nJanuary 25, 2024 AAPL Quick QuoteAAPL MSFT Quick QuoteMSFT TSM Quick QuoteTSM Better trading starts here. You follow Bull of the Day - edit You follow Benjamin Rains - edit Benjamin Rains Bull of the Day Apple ((AAPL Quick QuoteAAPL  -  Free Report)    ) stock ended 2023 and started 2024 on a downbeat note as some analysts raced to outsmart themselves with various downgrades of the iPhone maker based on concerns about slowing growth in China and other headwinds. Yet, Apple is up around 8% since January 5 and approaching its mid-December records heading into its Q1 FY24 earnings release on February 1. Apple’s recent wave of upward earnings revisions help AAPL earn a Zacks Rank #1 (Strong Buy). Apple is certainly no hidden gem, but who cares? The moral of our story today is that it pays to keep it simple and buy shares of one of the true Wall Street titans as part of a healthy, well-rounded portfolio. Apple is far more than an iPhone maker these days. Plus, AAPL is trading above all of its key short-term and long-term moving averages. Recent Negativity A few notable analysts downgraded Apple stock over the last month or so. Their concerns focused on slowing iPhone sales, with a particular focus on China, among wider fears about an increasingly saturated high-end smartphone market. There are also constant worries about legal battles regarding its App Store and more. Apple is facing mounting competition from rival Huawei Technologies in the world’s second largest economy. AAPL is also suffering setbacks in the Chinese market, as are many other companies across various industries, due to the broad-based economic slowdown in China. Geopolitical fears play their part as well. Image Source: Zacks Investment Research AAPL’s overall sales declined YoY during the trailing four quarters, with total FY23 revenue down 2.8% (its third YoY decline in the last eight years). Despite the mounting concerns about Apple’s business in China and its economy more broadly, AAPL’s revenue in China only slipped by roughly 2.2% in fiscal 2023 (vs. Apple’s wider 2.8% drop). Apple’s total iPhone revenue fell by over 2% last year, and smartphone sales climbed by 2.8% in the fourth quarter. The iPhone and Beyond Apple’s branding power remains nearly unmatched and its constant cycles of new phones and devices keep people wanting more. Many consumers upgrade to new iPhones and other devices habitually, even if there isn’t a game-changing difference, and would never think of leaving the Apple universe. Apple sold $200 billion worth of iPhones in FY23 up from $142 billion in FY19. Apple’s long-term growth case is not difficult to make in a world full of smartphone addicts, especially as its subscriptions grow within its key services unit. Chief executive Tim Cook has focused on transforming Apple beyond an iPhone maker by continually making money from its loyal and growing customer base. Apple’s services segment climbed by 9% in FY23 to account for 22% of sales, making it by far the biggest segment outside of iPhone. Image Source: Zacks Investment Research Apple said last quarter that it had an installed base of “over 2 billion active devices,” which “continues to grow at a nice pace.” AAPL’s services efforts go beyond its App Store and include Netflix and Spotify competitors, a subscription news offering, Apple Wallet, a video game platform, digital workout classes, and more. AAPL finished its most recent period with “over 1 billion paid subscriptions across” its services, marking nearly double the number it had three years ago. On top of that, Apple has brought more of its chips in-house and it is quietly spending heavily on rolling out AI features in its smartphones and other devices. Near-Term Outlook Taiwan Semiconductor Manufacturing Company ((TSM Quick QuoteTSM  -  Free Report)    ) reported upbeat results on January 18 and provided strong guidance that signals a return to growth for the smartphone market. Apple’s revenue is projected to climb by 3% in FY24 and jump 6% higher in FY25 to reach $418.36 billion vs. $383.29 billion in FY23. Meanwhile, its adjusted earnings are projected to grow by 8% in FY24 and another 9% higher next year to come in at $7.19 per share. This would come on top of marginal EPS growth last year. Image Source: Zacks Investment Research Apple has topped earnings every period over the last five years outside of a small miss in the first quarter of FY23. Better yet, Apple’s earnings revisions have trended higher over the last month for FY24 and FY25, with its most accurate/most recent estimates solidly above the already-improved consensus. The bottom line positivity helps it capture a Zacks Rank #1 (Strong Buy) right now. Performance, Technical Levels & Valuation AAPL stock is up around 8% since January 5 and it trades 6% below its average Zacks price target and around 2% under its mid-December records. The rebound took Apple back above its 50-day and 21-day moving averages and from oversold RSI levels to above neutral. Apple shares have climbed by roughly 1,000% in the last 10 years to top Microsoft ((MSFT Quick QuoteMSFT  -  Free Report)    ) and blow away the Zacks Tech sector’s 275% run. Apple is only up 36% in the past three years vs. Microsoft’s 75%. AAPL has also underperformed Tech during the last 12 months, which means it might be less overheated than some might assume. Image Source: Zacks Investment Research Apple is currently trading above its very long-term 21-month moving average and it appears far from overheated by historical RSI standards. Valuation-wise, Apple trades at a roughly 20% discount to its five-year highs at 28.8X forward 12-month earnings and not too far above its median or Tech. Bottom Line Apple returned $25 billion to shareholders last quarter via buybacks and dividends. The firm is also still investing heavily in future growth endeavors such as artificial intelligence, EVs, and beyond. Some investors might decide they would rather attempt to find the next Apple. But sometimes betting on the favorite works better than going with the underdog. Apple Inc. (AAPL) - free report >> Microsoft Corporation (MSFT) - free report >> Taiwan Semiconductor Manufacturing Company Ltd. (TSM) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}