{
    "title": "Three years after Apple's iOS 14 changes, brands find Meta advertising has \nstabilized",
    "date": "2/15/2024",
    "url": "https://www.modernretail.co/marketing/three-years-after-apples-ios-14-changes-brands-find-meta-advertising-has-stabilized/",
    "text": "In 2021, Apple’s iOS 14 update wreaked havoc on digital advertising, with Meta being one of its biggest victims. The update required apps to ask for people’s permission before tracking their activity across the web. In turn, the update limited Meta’s ability to use a person’s browsing history to inform what ads to serve them. In the aftermath, Meta reported its first revenue decline since its IPO, while some brands saw CPMs spike in the double digits. Some brands responded by drastically slashing their Meta advertising budget — men’s personal care brand Bravo Sierra, for example, successfully weaned itself off of Facebook and Instagram ad spending altogether in 2022. Prior to the iOS changes, direct-to-consumer brands spent about 35% of their ad budget on Facebook. By the first quarter of 2022, that number had dropped to 27%, per Rockerbox data cited by eMarketer. But several years later, the shift of advertising dollars away from Meta looks more like a trickle, rather than a mass exodus. Meta’s latest numbers show that appetite for Meta ads is still high, despite platforms like TikTok attempting to lure away brands. In its most recent earnings report, earlier this month Meta posted a 23% year-over-year increase in ad revenue, from $31.25 billion to $38.71 billion. With Meta’s latest investment in advertising tools, such as AI-based Advantage+ suite, the company has e-commerce brands continuously running campaigns on its platforms. “It’s definitely a flip in the story that ‘Meta no longer works’ and has gotten too expensive,” said Calla Murphy, vp of digital strategy & integrated marketing at Belardi Wong – which works with over 300 DTC brands, including Title Nine and Mille. In January 2023, Meta CPMs dropped 20% year-over-year across the e-commerce brands Belardi Wong works with. By the end of 2023, CPMs decreased by 22% year-over-year, with ROAS increasing by 32%, Murphy said. Currently, CPMs across brands in the lifestyle, apparel and homeware categories average about $15. Murphy did note that Belardi’s client spend on Meta is currently down 8% year-over-year, indicating that they are spending some of their marketing dollars in other places. But, brands by and large aren’t abandoning Meta en masse. Anaud Plas, CEO of beauty brand Prose, told Modern Retail the company has seen its Meta CPMs hold steady over the past six to 12 months. Like many DTC brands, Prose saw its cost of customer acquisition skyrocket at the onset of the iOS 14 changes. “I would say that Meta has adapted, so kudos for the job they’re doing,” he said. “They’re more focused on e-commerce and serving their advertisers in the past year.” As such, Meta remains a “significant part” of Prose’s digital advertising budget, Plas said, along with Google. He did not specify the exact percentage Meta advertising accounts for. A few culprits helped push Meta’s ad costs down, encouraging brands to continue spending on Meta. “The year [Meta] seemed to swing back to advertising and away from the metaverse,” Murphy said, “Obviously they [Meta] don’t like hearing their ads ‘don’t work’ anymore,'” she said. Murphy credits much of these welcome changes to Meta calling 2023 its “year of efficiency.” The plan, as outlined by CEO Mark Zuckerberg, included Meta going back to basics, including reducing its workforce. Another potential contributing factor to CPMs decreasing is an overall drop in demand for ad space, Murphy explained, as many brands have figured out more places to market outside Meta – whether it’s out-of-home, direct mail and CTV. One of the brands Belardi Wong works with is Natural Life, whose campaigns have seen an increase in efficiency over the past 12 months. Carolyn Grana, director of digital experience at Natural Life, told Modern Retail this time last year the brand began seeing its Meta ad costs drop by 30% year-over-year. In turn, Grana said “that led to a ton of efficiency on our side, and we were able to lean into that spend.” One of the biggest contributors to the brand’s effective advertising was the use of Meta’s Advantage+ suite versus running manual ads, which helped increase ROAS. Advantage+ began rolling out at the end of 2022 as one of Meta’s new algorithmic advertising tools, which the company says uses AI to help “eliminate the manual steps of ad creation and automates up to 150 creative combinations at once.” “It was a more powerful version of the previous dynamic ads we previously tried to run,” Grana said, saying that at first there was some apprehension about leaving creatives up to machine learning. “And now it’s 30% of our overall budget.” Meta and Google currently make up the majority of Natural Life’s primary prospecting channels. With many brands cutting back on inefficient marketing costs, Meta is poised to stay top-of-mind in the coming year. Murphy said the past year proved Facebook and Instagram are still the gold standard for digital advertising. Murphy doesn’t expect CMPs to drop at the same rate they did last year, “I am expecting these CPMs to hold through 2024,” she added. “But 2023 proved that Facebook still works for many brands.” Sunday first launched in 2019 with lawn care products, but has since expanded to pest control and garden products. Founder and CEO Coulter Lewis joined this week's Modern Retail Podcast. C4 is switching up the packaging, ingredients and flavors of its pre-workout powders, signaling a new direction for its active nutrition business. It will roll out the revamped products over the next few months online and in partners including The Vitamin Shoppe and Target. NIL deals — which allow athletes to receive financial compensation for their name, image and likeness — has opened a new lower-cost opportunity for brands to be involved with big college sporting events like March Madness outside of traditional corporate sponsorships. Join now to gain access to exclusive content, unlimited articles and more. Visit your account page to modify or renew your subscription. Get Modern Retail's top stories every morning in your email inbox Follow @ModernRetail for the latest news, insider access to events and more. "
}