{
    "title": "Everything we know about the Apple Car",
    "date": "2/27/2024",
    "url": "https://www.tomsguide.com/news/apple-car-everything-we-know-so-far",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Don't expect to see an Apple Car after Apple reportedly spiked its decade-long project The idea of owning an Apple Car probably sounded pretty appealing — but it's going to have to remain a pipe dream. While an Apple Car had been in development for a long time, Apple had little to show for its efforts, with reports that a possible launch date kept getting pushed back. And now there will be no launch date at all, as reports have emerged that the Apple Car project is over. Here's a timeline of the Apple Car project along with the latest on why Apple pulled the plug on developing its own car and where it plans to reallocate the resources it had been putting into its automotive effort. Throughout the Apple Car's emergence as a persistently rumored product in development, Apple never commented on the project or when we might be able to drive one — If you can call using an autonomous car driving, that is. Prior to the project's end, a report from Bloomberg's Mark Gurman in 2023 claimed that Apple had pushed back the debut of the Apple Car until 2026. Previously, the company had reportedly been gunning for a 2025 launch, speeding up development on the project after several delays. At the time, Apple reportedly planned to handle the Apple Car's development by itself instead of partnering with an experienced automaker. Now, of course, there won't be a release date in 2026 or beyond, as Bloomberg reports that Apple has told the 2,000 employees working on the Apple Car that the project has been scrapped. If we never got a firm grasp on when the Apple Car was supposed to come out, a price for a self-driving car was even more elusive. That same Bloomberg report that talked up the possibility of a 2026 release suggested the car might cost below $100K, putting it on par with the most expensive Tesla vehicles. Upgrade your life with a daily dose of the biggest tech news, lifestyle hacks and our curated analysis. Be the first to know about cutting-edge gadgets and the hottest deals. Of course, while electric vehicle remain popular, car makers have had to adjust pricing to reflect lagging demand for vehicles. That may be one of the factors that convinced Apple it was time to drop the Apple Car once and for all. Ah, what could have been. The Apple Car wasn't supposed to be your typical electric car. Toward the end of the project, the car's self-driving capabilities sounded like they were going to be limited to freeway driving. But even with the scope of autonomous driving scaled back, Apple's car was rumored to feature LiDAR sensors that would have helped it \"see\" the world around it. Apple is no stranger to LiDAR, having included it on certain high-end iPhones and iPad Pros. LiDAR is short for \"Light Detection and Ranging\", and the system works by sending out pulsed lasers. Those lasers would have been reflected back to the car's sensors as they hit objects, with that information forming a picture of what objects are in the surrounding area and how far away they are. LiDAR is used by almost every self-driving car out there. In fact only Tesla has sworn off LiDAR in favor of a computational vision system.  Rumors had suggested Apple was developing its most advanced chips for use in the Apple Car, with neural processors making up most of the silicon to power all the AI algorithms a car would need if it really will drive itself. It's unclear how those development efforts might be reallocated to other parts of Apple's product line. Back when the Apple Car was still in development, reports claimed Apple would focus on the interior design, since the car was supposed to be largely \"hands-off.\" That work would have included both an infotainment system and integration with Apple's existing suite of services. What really was going to set the Apple Car apart was its rumored monocell battery technology. According to reports, this would have maximized the size of the cells inside the Apple Car's battery pack, which means it theoretically gets a longer range out of a single charge. Reports also claimed Apple was set to use lithium iron phosphate in its batteries, rather than the usual lithium-ion solution, which is less likely to overheat. That should have made the car much safer.  A patent revealed the first piece of information of a possible design. The Apple Car could have come with a system offering \"variable opacity,\" which, like Mercedes' Magic Sky, let the driver control how much light comes through the roof. The patent also mentions that this roof is retractable, which Mercedes' is not, and can retract as the side windows are opened. We were never blessed with a lot of images out there to reveal what an Apple-designed car might look like. Soconcept designers stepped up to fill in the gap between imagination and reality.  One of the boldest designs we saw came from designer Leasefecher, which released a series of renders that imagine Apple Cars based on famous Apple products. Our favorite example takes a Nissan GT-R and combines it with an iPhone 12 Pro, but there are other concepts from Leasefetcher that draw on the original iMac and iPod for inspiration. The history of the Apple car goes all the way back to 2014 under the name \"Project Titan,\" purportedly with the goal of releasing it to the public in 2020. Obviously that never happened. We had glimpses of some sort of Apple affiliated vehicle, supposedly testing self-driving tech, throughout California. Apple has always kept those details close to its chest, like it does with everything else, so we don't have any official statements on what these cars were up to.  What we do know for sure is that these cars weren't the same vehicles the company used to collect data for Apple Maps. That said, hiring engineers from the likes of Mercedes, Tesla, and other big car companies seemingly confirmed that Cupertino some sort of automotive ambitions. Reportedly, Apple will layoff some employees involved in the car project now that it's been scrapped, though some hardware developers are reportedly being encouraged to apply for jobs elsewhere in the company. Bloomberg says that many employees working on the Apple Car will be shifted over to the company's efforts to incorporate more AI into its products. Apple is almost always mum about unreleased products, and the Apple Car was no exception. However, Tim Cook had confirmed that the automotive sector has piqued Apple's interest, hinting at his company's car plans during an appearance on Kara Swisher's Sway podcast. “We investigate so many things internally,” Cook said. \"Many of them never see the light of day. I’m not saying that one will not.\" Cook also seemed to suggest that should Apple get involved with cars, it would not be content to merely design a software setup and hand it over to a car manufacturer. “We love to integrate hardware, software, and services, and find the intersection points of those because we think that’s where the magic occurs,\" Cook said. \"And so that’s what we love to do. And we love to own the primary technology that’s around that.” Apple has yet to confirm Bloomberg's report on the end of the Apple Car project, and we wouldn't expect any statement out of Cupertino any time soon. The Apple Car project reached the end of the road because Apple's board reportedly concluded that it was unlikely to hit profit targets. Recently, Apple has rolled out its first spatial computing product, the Apple Vision Pro, and that headset figures to be only the first step in the company's push into mixed reality. Artificial intelligence is also a growing area of interest for Apple, as it's perceived to be lagging behind rivals like Google, Microsoft and others when it comes to integrating AI into its products. That apparently ends this year, as the upcoming iOS 18 update is said to focus heavily on AI features that will be part of future iPhones. You'd figure that with Apple's AI division absorbing recourses from the Apple Car project, we're going to see a lot more progress in that area. Tom is the Tom's Guide's UK Phones Editor, tackling the latest smartphone news and vocally expressing his opinions about upcoming features or changes. It's long way from his days as editor of Gizmodo UK, when pretty much everything was on the table. He’s usually found trying to squeeze another giant Lego set onto the shelf, draining very large cups of coffee, or complaining about how terrible his Smart TV is. 5 coolest cars we saw at the New York Auto Show 2024 My favorite thing at CES 2024 is the eVTOL Flying Car — you've got to see this thing transform WhatsApp’s swipeable navigation bar has arrived on Android — here's how to use it By Kelly WooMarch 29, 2024 By Hunter FenollolMarch 29, 2024 By Kate KozuchMarch 29, 2024 By Mike ProsperoMarch 29, 2024 By Philip MichaelsMarch 29, 2024 By Jessica DowneyMarch 29, 2024 By Brittany VincentMarch 29, 2024 By Bill BorrowsMarch 29, 2024 By Bill BorrowsMarch 29, 2024 By Nick PinoMarch 28, 2024 By Dave LeClairMarch 28, 2024 Tom's Guide is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}