{
    "title": "iOS 18 Will Offer A ‘Slew Of New New AI Features’ For Siri, As Apple Trains \nThe Assistant Using Large Language Models",
    "date": "2/17/2024",
    "url": "https://wccftech.com/ios-18-will-improve-siri-using-ai-integration/",
    "text": "OpenAI is far ahead in the AI race as it recently introduced Sora, its new video generation tool, which is taking the industry by storm. However, Apple has just started exploring AI and developing proper use cases for the technology. Despite Apple's late entry into the AI world, it is reported that iOS 18 will be the company's biggest update for the iPhone, considering the number of features it will bring to the table. According to a new report, Apple is training Siri and Spotlight Search with its large language models, which will be part of Apple's big iOS 18 announcement at WWDC. It was recently reported that the company is working to integrate AI into its Xcode for developers, allowing the platform to predict and test code for apps. Additionally, the report also suggested that Apple's Spotlight Search will also be able to handle local tasks with third-party app integration. The report also mentions that Apple is training Siri with its large language models to improve its integration with apps. Siri has been at the bottom of the queue as far as the digital assistance is concerned. The Google Assistant and Amazon's Alexa are leading the way on Android and various Home-based devices, allowing users to do a lot more than Siri. With Apple's forthcoming AI integration, Siri could offer a 'slew of new AI features, according to Mark Gurman from Bloomberg. AI is potentially one of the reasons why iOS 18 will be the company's biggest update for the iPhone. The company is testing AI integration on a system level. We have previously heard that the company is developing proper tools for various segments of the operating system. For instance, it was reported that iOS 18 would use AI to generate playlists on Apple Music automatically. The productivity suite will also use AI for apps like Keynote and Pages. The company will follow the same approach for its Health, Messages, Shortcuts, and other apps. Apple's work on AI is gradually advancing towards many breakthroughs in different segments. The company developed AI tools to edit, manipulate, and animate still images, which could be part of the company's Photos app. Apple is planning to introduce these major changes in iOS 18, which will be available later this year. iPhone 16 could be one of the early adopters of Apple's AI technology as it will be powered by the A18 chip and an upgraded Neural Engine. However, we could get a glimpse of some of the above-mentioned features at the company's annual WWDC event in June. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}