{
    "title": "Peloton is not getting rid of Apple Watch GymKit support",
    "date": "2/12/2024",
    "url": "https://www.theverge.com/2024/2/12/24071405/peloton-apple-watch-gymkit-fitness-data-tracking-one-tap",
    "text": "By  Amrita Khalid, one of the authors of audio industry newsletter Hot Pod. Khalid has covered tech, surveillance policy, consumer gadgets, and online communities for more than a decade. Update, Thursday, February 15th, 2024, 1:07PM ET: Now Peloton says it’s heard the feedback “loud and clear” and has canceled its plan to drop GymKit support. The title of this post has been updated to reflect that the original article continues below. In an email sent to users Monday evening, Peloton revealed that starting February 27th, it will start transitioning Apple Watch users from GymKit to Peloton One-Tap tracking. GymKit integration was once marketed by Peloton as an exclusive perk of its more expensive Bike Plus, but it’s become less of a draw in recent years. The company launched an Apple Watch integration in 2022 that brought Apple Watch calorie and heart-rate tracking to any Peloton machine, similar to many other fitness apps. As a result, if you linked your Peloton to an Apple Watch more recently, you may not even notice the change. The company has been directing users to only use GymKit if they haven’t installed the latest software updates on their machines. Like GymKit, Peloton’s app integrates data from each workout to Apple’s Health app. As with GymKit, you can still track distance and pace and see your heart rate metrics on screen. It’s just not using Apple’s proprietary fitness equipment API, so if you have the latest updates installed, things shouldn’t change much. However, it’s still understandable that people who bought the more expensive Bike Plus for GymKit integration that’s now disappearing will feel upset about the change. As Victoria Song explains here, metrics like calorie burn can vary widely depending on the user and the type of exercise, so changes to the accuracy of the data provided may not be significant. Even though users can input their weight, gender, activity level, and other variables that affect the number of calories burned, wearables like the Apple Watch are providing an educated guess, at best. But some fitness enthusiasts still enjoy tracking their workouts over time and seeing their aggregated health data on Apple’s Health app — and now the only way to do that will be through Peloton’s app. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}