{
    "title": "Charted: Apple's Product Revenue (2007-2023)",
    "date": "2/6/2024",
    "url": "https://www.visualcapitalist.com/charted-apples-product-revenue-2007-2023/",
    "text": "The Most Popular TV Brands in the U.S. The Fastest Rising U.S. Housing Markets in 2024 Swiss Watches: Market Share by Brand in 2023 Charted: Luxury Goods Investments vs. S&P 500 in the Last 10 Years Visualizing the World’s Largest Sovereign Wealth Fund Visualizing Internet Usage by Global Region Mapped: Internet Download Speeds by Region The World’s Biggest Cloud Computing Service Providers The World’s Largest Corporate Holders of Bitcoin Charted: The Jobs Most Impacted by AI How Small Investments Make a Big Impact Over Time Who Expects to Get Richer in 2024, by Both Generation and Gender Chart: The Declining Value of the U.S. Federal Minimum Wage Who are the World’s Richest People in Finance? The World’s Top 50 Largest Banks by Consolidated Assets The Cost of an EpiPen in Major Markets Charted: Global Tobacco Use by Country and Sex Visualized: What Lives in Your Gut Microbiome? Charted: Average Years Left to Live by Age Charted: The Average Cost of Insulin By Country The World’s Biggest Oil Producers in 2023 How Much Does the U.S. Depend on Russian Uranium? Charted: Global Uranium Reserves, by Country Visualizing the Rise of the U.S. as Top Crude Oil Producer 2024 U.S. Clean Electricity Outlook Mapped: Asia’s Population Patterns by Density A Map of Global Happiness By Country in 2024 Mapped: Population Growth by Region (1900-2050F) Mapped: Breaking Down the $3 Trillion African Economy by Country Mapping Credit Card Delinquency Rates in the U.S. by State Charted: Global Uranium Reserves, by Country The Periodic Table of Commodity Returns (2014-2023) China Dominates the Supply of U.S. Critical Minerals List The Critical Minerals to China, EU, and U.S. National Security All the Metals We Mined in One Visualization The World’s Top Cocoa Producing Countries Charted: Share of World Forests by Country 2024 U.S. Clean Electricity Outlook Chart: Is ESG Investing in Decline? Which Countries Have the Largest Forests? Published on By See this visualization first on the Voronoi app.  This was originally posted on our Voronoi app. Download the app for free on iOS or Android and discover incredible data-driven charts from a variety of trusted sources. Since the iPhone’s launch in 2007, Apple’s product launches have continuously diversified the company’s revenue sources. This infographic illustrates Apple’s revenue by product between 2007 and 2023, based on the company’s 10-K filings for the period. When Apple introduced the iPhone in 2007, Steve Jobs labeled it a “revolutionary product”. That same year, the phone represented just 0.5% of the company’s total revenue. Today, it corresponds to over half of it. Initially sold exclusively through AT&T for $499, it has since become the company’s most profitable product and one of the world’s most popular phones, with over 2.3 billion units sold and a user base of over 1.5 billion active users. In 2015, the iPhone’s share of Apple product revenue peaked at 66%, coinciding with the release of the iPhone 6. Apple has also experienced a shift in the share of revenue originating from its Mac division. In 2007, Macs represented 43% of the company’s revenue, while iPods accounted for 35%. Since 2015, however, services and accessories/wearables (such as the Apple Watch and AirPods) have contributed increasingly to the company’s revenue shares. Mac revenue declined by 27% year over year in 2023, making up only 8% of Apple’s total revenue.  More recently, the growth of services and accessories/wearables has started to slow down, mirroring trends seen in other product lines. Perhaps the next question for the company is whether the Apple Vision Pro, a wearable computer that projects output directly into the eyes and is primarily controlled through eye tracking and gestures, will become a consistent source of revenue and product line. Ranked: America’s Best Places to Work in 2024 Charted: Social Media Usage by U.S. Teenagers Visualizing Internet Usage by Global Region The World’s Biggest Cloud Computing Service Providers Visualizing the Biggest Companies on Major Stock Exchanges Charted: The Jobs Most Impacted by AI Will Tesla Lose Its Spot in the Magnificent Seven? Ranked: The 20 Top Chinese Stocks by Market Cap, and Performance YTD In this infographic, we map out internet usage by global region based on the latest data from the World Bank. Published on By This was originally posted on our Voronoi app. Download the app for free on iOS or Android and discover incredible data-driven charts from a variety of trusted sources. Digital technologies have become an integral part of our daily lives, transforming communications, business, health, education, and more. Yet, billions of people around the world are still offline, and digital advancement has been uneven. Here, we map internet usage by region based on data from the World Bank’s Digital Progress and Trends Report 2023. According to the World Bank, between 2018 and 2022, the world gained 1.5 billion new internet users. In 2020 alone, the share of the global population using the internet increased by 6% (500 million people), marking the highest jump in history. India, in particular, has seen high rates of adoption. For example, in 2018, only 20% of Indians used the internet. By 2022, this percentage had grown to more than 50%. However, the progress of digitalization has been uneven both within and across countries. In 2022, one-third of the global population remained offline, with parts of Asia and Africa still experiencing very low rates of internet usage. For instance, more than half of businesses in Burkina Faso, Ethiopia, Ghana, and Senegal reportedly lack internet connection. According to the World Bank’s report, when fast internet becomes available, the probability of an individual being employed increases by up to 13%, and total employment per firm increases by up to 22%. Moreover, firm exports nearly quadruple with the availability of fast internet. Across Africa, 3G coverage has been associated with a reduction in extreme poverty, with reductions of 10% seen in Senegal and 4.3% in Nigeria. Curious to learn more about the internet? Check out this animated chart that shows the most popular web browsers since 1994. Charted: Car Brand Loyalty in 2024 The World’s Top 50 Largest Banks by Consolidated Assets Visualizing the Declining Birth Rate in Japan The World’s Largest Corporate Holders of Bitcoin A Map of Global Happiness By Country in 2024 The 12 Worst Investment Funds Over the Past Decade Which Global Brands Are Most Associated With Ramadan? Visualizing the World’s Largest Sovereign Wealth Fund Copyright © 2024 Visual Capitalist "
}