{
    "title": "Apple Boosts iMessage Security to Fend Off Quantum Computing Attacks",
    "date": "2/21/2024",
    "url": "https://au.finance.yahoo.com/news/apple-boosts-imessage-security-fend-140000003.html",
    "text": "(Bloomberg) -- Apple Inc. is upgrading the security of its iMessage app, aiming to fend off a looming future threat: advanced quantum computing attacks. Most Read from Bloomberg BYD’s New $233,450 EV Supercar to Rival Ferrari, Lamborghini Jack Ma-Backed Ant Outbids Citadel Securities for Credit Suisse’s China JV Norwegian Cruise Ship Halted at Mauritius Due to Outbreak Zelenskiy Says 31,000 Troops Killed as Ukraine Seeks US Aid Decision Within Month The changes will be part of a new system called PQ3, Apple said on Wednesday. It’s a more advanced type of encryption that could thwart attacks from quantum computers — still-nascent technology that can perform calculations exponentially faster than traditional machines. The fear is that these computers could someday have the power and mathematical capabilities to break through today’s tools for encrypting messages. The new security protocol has already been added to beta versions of iOS 17.4, iPadOS 17.4, macOS 17.4 and watchOS 10.4, which will roll out to all users in the coming weeks. It will replace the current security protocols for all iMessage chats by the end of the year. Though hackers don’t currently have quantum computers, they could conduct what’s known as a “harvest now, decrypt later” attack. That means they steal messaging data today and then use a more advanced computer in the future to break the encryption. Apple said its new system is designed to prevent that. The warnings about quantum computing attacks have been dire. International Business Machines Corp. executive Ana Paula Assis has said that they’ll cause a “cybersecurity Armageddon.” SandboxAQ Chief Executive Officer Jack Hidary said that such computers will be available by the end of the decade and cause a “train wreck” for security. Governments are also getting involved, with the US Senate passing a bill two years ago to address the threat. Apple said that PQ3 “has the strongest security properties of any at-scale messaging protocol in the world.” The company sees the defenses as more powerful than those of messaging app Signal, which has long been known as the gold standard for encrypted communications. Apple considers its new system to be at a Level 3 of security, while it puts Signal at Level 2. The prior protocol for iMessage ranked as a Level 1, in Apple’s view, the same level as Meta Platforms Inc.’s WhatsApp. Other popular messaging apps — like Telegram, Skype, QQ and WeChat — sit below that, according to Apple’s analysis of messaging app security. The company also said its current Contact Key Verification system, which allows users to verify that they’re actually communicating with the intended person, is coming to its Vision Pro headset. The change will be included with the visionOS 1.1 software update. Users with the feature enabled on their Apple devices previously had to disable it to send messages on the Vision Pro. Most Read from Bloomberg Businessweek Elon Musk’s Vegas Tunnel Project Has Been Racking Up Safety Violations The High Cost of Eating Out in America Why Elon Musk Bought Twitter in the First Place Can the Masters of Hipster Cringe Conquer Hollywood With Wall Street Cash? How Capital One’s $35 Billion Discover Merger Could Affect Consumers ©2024 Bloomberg L.P. This food habit is linked to a specific type of dementia. Abby Hensel officially tied the knot in 2021, it has been revealed  The dreaded pest also displaces wildlife and can blind pets. Find out more. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Harry Enten ran the numbers on Trump's dismal fundraising so far.  Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. Benny Larkin and daughter Taylor Larkin, 14, were boating down Dora Creek, New South Wales, Australia, when they broke down and were approached by a fuming kayaker. Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show.  King Edward VIII’s proposal to Wallis Simpson marked a constitutional crisis in Britain almost 90 years ago MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president. The not-so-happy campers were stunned by the unexpected guest at their beachside campsite.  The concerned shopper raised the alarm with staff at the store. Now, a 'full product inspection' is underway. The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. The person who wrote on the road has been called a \"top bloke\" by motorists.  King Charles and Queen Camilla will sit apart from the main congregation at St. George’s Chapel’s Easter service \"I mean, is there no depth to which he will not descend?\" asked Andrew Weissmann. ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says  Jacqui Lambie has responded after Senator Tammy Tyrrell announced she was leaving the Jacqui Lambie Network to sit as an independent. ‘Once I saw the payment screen, I would have called and cancelled my RSVP’ Footage shows Dylan Edwards moved out of the way. Find out more here. "
}