{
    "title": "Alphabet is the bargain stock among the 'Magnificent Seven'",
    "date": "3/11/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240311100/alphabet-is-the-bargain-stock-among-the-magnificent-seven",
    "text": "By Philip van Doorn Investors may have an opportunity similar to the one presented by Meta after that stock sank in 2022 You might be tired of seeing so much coverage of the group of tech stocks known as the Magnificent Seven, but their valuations and expected growth rates highlight Alphabet - Google's holding company - as a compelling play at its current price. It even appears to be a bargain when compared with the entire S&P 500. Sorted by market capitalization, the Magnificent Seven include Microsoft Corp. (MSFT), Apple Inc. (AAPL), Nvidia Corp. (NVDA), Amazon.com Inc. (AMZN), Alphabet Inc. (GOOGL) (GOOG), Meta Platforms Inc. (META) and Tesla Inc. (TSLA). Combined, these seven companies (eight stocks with Alphabet's Class A and Class C shares) make up 28.7% of the SPDR S&P 500 ETF Trust SPY, the largest exchange-traded fund tracking the S&P 500 SPX. The most commonly cited stock valuation is the forward price-to-earnings ratio. This is the current price of a stock divided by the average earnings estimate for the next 12 months among analysts who work for brokerage firms. FactSet tracks forward P/E ratios historically, based on rolling consensus estimates among analysts polled by the data provider. With the Magnificent Seven sorted by market capitalization, here are current forward P/E ratios along with historical averages, with weighted ratios for the S&P 500 at the bottom: And this is how the current valuations compare with the averages: Microsoft, Apple and the S&P 500 trade well above their average 10-year forward P/E valuations. Alphabet is among five companies trading below their 10-year averages. But only Alphabet trades below all the averages while having a current forward P/E below that of the index. Now let's take a look at expected compound annual growth rates for sales and earnings per share through 2025. The estimates driving the expected growth rates are based on calendar years, because Nvidia, Microsoft and Apple have fiscal years that don't match the calendar. Some notes about this data: Alphabet is by far the cheapest of the Magnificent Seven stocks on a forward P/E basis, and it is the only one of these companies whose shares trade at a lower P/E than the S&P 500 as a whole.Alphabet ranks third from the bottom for expected sales CAGR through 2025. But its expected sales CAGR of 11.2% is more than twice that of the index. That's compared with an expected sales CAGR of only 4.1% for Apple, which trades at a forward P/E of 25.4. Apple's expected sales CAGR even trails that of the index. Investors shouldn't be overly fixated on a low P/E, of course. The point with Alphabet is that it is expected to grow sales and earnings at considerably higher paces than the S&P 500, while its shares trade at a lower valuation than that of the index as a whole. Nvidia has a relatively high P/E of 34.1, but that valuation has come down considerably over the past year. Nvidia tops this list of 25 of the best-performing stocks in the S&P 500 whose EPS estimates have risen more quickly than the share prices. Related: Nvidia's stock could hit $1,200, this bull says. Here's the key to that rally. Getting back to Alphabet, the stock is down 5% from where it was at the end of 2021. It is useful to look at performance from that date, because the S&P 500 fell 18.2% in 2022, only to rise 26.3% in 2023. (All returns in this article include reinvested dividends.) So the S&P 500 is up only 3.4% since the end of 2021, while Alphabet is down 5% and Nividia's stock has tripled in price. On Monday, Michael Nathanson, a senior research analyst at MoffettNathanson, wrote in a note to clients that Alphabet's stock had been \"de-rated\" relative to the S&P 500, reflecting investors' concern over artificial intelligence and its possible effect on Google's search business. He also pointed to a recent misstep, when Google botched the rollout of its Gemini AI tool for generating images. \"Ironically, Alphabet's long-term reluctance to ship AI products that were not yet safe, reliable, and responsible did not compute with what just happened here,\" Nathanson wrote. The analyst also cited a ceding of advertising market share to Meta and Amazon \"for much of the past decade.\" But then he pointed to Meta, another company that had disappointed investors: CEO Mark Zuckerberg's initial vision of the metaverse didn't work out very well, and it was followed by a \"year of efficiency\" for the company in 2023, which helped reverse its share-price slide. Nathanson rates Alphabet's Class A shares a buy, with a $175 price target, which is 29% higher than the stock's closing price of $135.41 on Friday. Summing up, the analyst wrote that \"the basic question is about Alphabet's ability to harness their deep pool of world-class engineers and their long-term embrace [of] machine learning to build products thatconsumers want to use.\" He concluded: \"Judging by past accomplishments, despite current headlines, that seems like a bet that investors should be willing to make akin to buying Meta in the 4th quarter of 2022.\" (MORE TO FOLLOW) Dow Jones Newswires 03-11-24 1309ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}