{
    "title": "Apple-Fortnite battle is 'matter of priority,' EU Commissioner says (AAPL)",
    "date": "3/7/2024",
    "url": "https://seekingalpha.com/news/4077312-apple-fortnite-battle-matter-of-priority-eu-commissioner",
    "text": "ymgerman Thierry Breton, the European Commissioner for Internal Market, said the battle between Apple (NASDAQ:AAPL) and Fortnite maker Epic Games has become a \"matter of priority\" after Apple terminated Epic's developer account. \"Under the #DMA, there is no room for threats by gatekeepers to silence developers,\" Breton wrote on the social media platform X, formerly known as Twitter. \"I have asked our services to look into Apple’s termination of Epic’s developer account as a matter of priority.\" Breton was referring to the Digital Markets Act, which went into effect on Thursday in the European Union. The European Commission has also requested comment from Apple on the matter. Apple (AAPL) terminated Epic Games' developer account this week after lawyers for the iPhone maker called Epic \"verifiably untrustworthy\" and stated that Apple (AAPL) doesn't believe Epic will adhere to its contractual commitments. Apple said its decision was based on a right granted to it by European courts that would allow it to terminate \"any or all of Epic Games\" wholly owned subsidiaries at Apple's sole discretion. Epic said it planned to use its developer account to bring its hit video game Fortnite and online marketplace Epic Games Store to iOS devices in the European Union. The landmark Digital Markets Act, which is designed to reign in the power of big tech companies, has classified Apple and several other organizations as \"gatekeepers.\" The list is comprised of 22 services owned and operated by six tech conglomerates and includes Apple's App Store, iOS, Google's (GOOG) (GOOGL) Android and social networks such as TikTok, Facebook, Instagram and LinkedIn. If the companies do not comply with the rules laid down by the DMA, they can be fined up to 10% of global annual turnover or 20% for repeated violations, the EC said previously. Additional steps can be taken by the EC, including requiring a gatekeeper to sell a business or parts of it or banning the respective gatekeeper from acquiring additional services related to the non-compliance. Cupertino, Calif.-based Apple made the decision in January to allow alternative app stores on iOS in order to comply with the EU's Digital Markets Act. Epic quickly followed with plans to launch its own app store and Fortnite on iOS in the EU. In 2020, Apple removed Fortnite from the App Store after Epic implemented its own in-app payment system to bypass Apple's (AAPL) 30% cut. Epic accused Apple of monopolistic behavior and followed with a lawsuit. "
}