{
    "title": "Evercore ISI Removes Apple (AAPL) from Tactical Outperform List, 'we think \niPhone units are largely flat'",
    "date": "3/4/2024",
    "url": "https://www.streetinsider.com/dr/news.php?id=22875029",
    "text": "Evercore ISI analyst Amit Daryanani reiterated an Outperform rating and $220.00 price target on Apple (NASDAQ: AAPL). The analyst comments \"AAPL reported upside to Dec-qtr with a print of $119.6B/$2.18 vs. street at $118B/$2.10, overall sales were up 2% y/y (adjusted for extra week LY was up +4%) – driven by strength across iPhones (+6%) and services (+11%) that was partially offset by weakness in iPad (-25%) and wearables (-10%). One of the concerns here is the softer Mar-qtr guide – that implies sales will be ~$90B (down 5% y/y) vs. street at $96B and EPS should be ~$1.50 (vs. street at 1.58). Worth noting for March-qtr, expectation is for iPhone revenues to be flat y/y (adjusted for $5B benefit they had last year, ~$46B range). Services should grow double digits (we think there could be upside here given price increases implemented). Rest of the hardware products (iPad, Wearables) should decline high single digits y/y in march. China revenues were down 12% y/y – though iPhone sales were down mid single digits in China (in constant currency). Weakness in China was more around wearables and iPads – reflecting a weaker consumer spending environment. Positively, AAPL continues to see gross-margins work higher and expects Mar-qtr gross-margins in the range of 46- 47% (street was at 45.5%) this is clearly dampening the impact of revenue miss to the bottom-line in March-qtr. In addition, we would note – a) Vision pro commentary is incrementally better with 600 new apps at launch and sizable interest from enterprises. b) Generative AI – AAPL expects to launch and discuss their Gen AI products ‘later this year’ and c) 2.2B iOS install base was up an impressive 10%. Net/Net: While we understand the disappointment around Mar-qtr guide we think iPhone units are largely flat excluding some 1x dynamics. More importantly, we see a host of tailwinds stacking up in AAPL’s favor ranging from Gen AI product launches to Vision Pro adoption to sustained FCF generation/uptick to capital allocation.\" For an analyst ratings summary and ratings history on Apple click here. For more ratings news on Apple click here. Shares of Apple closed at $179.66 yesterday. "
}