{
    "title": "Apple Settles $490 Million Lawsuit Over Tim Cook's China Sales Remarks • \niPhone in Canada Blog",
    "date": "3/15/2024",
    "url": "https://www.iphoneincanada.ca/2024/03/15/apple-settles-tim-cook-china-remarks-lawsuit/",
    "text": "Apple has agreed to a $490 million settlement to resolve a class-action lawsuit alleging that CEO Tim Cook concealed declining iPhone demand in China, thereby defrauding shareholders, Reuters is reporting.  The settlement, filed on Friday in the U.S. District Court in Oakland, California, awaits approval from Judge Yvonne Gonzalez Rogers. The lawsuit stemmed from Apple’s surprise announcement on January 2, 2019, slashing its quarterly revenue forecast by up to $9 billion, citing trade tensions between the U.S. and China. Cook’s reassurance to investors on a November 1, 2018, analyst call, stating that China did not face similar sales pressure, came under scrutiny. Subsequently, Apple instructed suppliers to scale back production, marking the first revenue forecast reduction since the iPhone’s 2007 launch, causing Apple’s shares to plummet by 10%, erasing $74 billion in market value the following day. While Apple denied liability, court documents reveal the company opted for settlement to avoid prolonged litigation costs and distractions. Shawn Williams from Robbins Geller Rudman & Dowd, representing the shareholders, hailed the settlement as a favorable outcome.  Judge Rogers’ refusal to dismiss the lawsuit in June underlines the plausibility of Cook discussing sales outlook rather than currency fluctuations, noting Apple’s awareness of China’s slowing economy. The lead plaintiff in the case is the Norfolk County Council, representing the Norfolk Pension Fund in Norwich, England. Lawyers for the shareholders may also seek fees of up to 25% of the settlement amount. The settlement encompasses investors who acquired Apple shares in the two months following Cook’s remarks and preceding the revenue forecast. Considering Apple’s $97 billion net income in the last fiscal year, the settlement amounts to nearly two days of profit for the tech giant. Since January 2019, Apple’s share price has surged more than fourfold, propelling the company to a market value exceeding $2.6 trillion. "
}