{
    "title": "Tim Cook says Apple will 'break new ground' in GenAI this year",
    "date": "3/18/2024",
    "url": "https://ca.news.yahoo.com/tim-cook-says-apple-break-204521117.html",
    "text": " Apple CEO Tim Cook is promising that Apple will \"break new ground\" on GenAI this year. Cook made the pronouncement during the company's annual shareholders meeting today, which came in the same week the company reportedly scuttled its multibillion-dollar, decade-long plan to build an EV. Some of the staff on the EV project were reassigned to work on various GenAI initiatives, according to multiple publications. $AAPL COOK: APPLE WILL \"BREAK NEW GROUND\" IN GENERATIVE AI THIS YEAR — *Walter Bloomberg (@DeItaone) February 28, 2024 https://platform.twitter.com/widgets.js Apple, unlike many of its Big Tech rivals, has been slow to invest in -- and ramp up -- GenAI. During the company's Q1 earnings call, Cook said Apple was working internally with GenAI but that it was taking a slower, more deliberate approach to customer-facing incarnations of the technology. Indeed, Apple's only briefly mentioned GenAI in its recent press conferences and announcements, such as when it introduced new autocorrect and text prediction features in iOS last fall. Bloomberg's Mark Gurman has reported that Apple is planning to upgrade Siri and iOS' built-in search tool, Spotlight, with GenAI models, with the goal of enabling both to answer more complex queries and handle sophisticated multi-turn conversations. Apple is also said to be exploring AI-powered features to allow users to automatically generate presentation slides in Keynote and playlists in Apple Music, as well as GenAI-powered coding suggestions in Xcode, the company's app development platform. Some of these -- or none -- could arrive in the next versions of iOS, macOS and iPadOS, which are expected to be demoed at Apple's Worldwide Developer Conference this summer. Perhaps telegraphing Apple's intensifying GenAI focus, engineers at the company have co-authored an increasing number of GenAI-related academic and technical papers. One describes a system that can generate animated 3D avatars from short videos. Another details Keyframer, a tool capable of animating still images. Conspicuously, Apple's also published a slew of open source models and tools for developing GenAI-powered software in recent months. Ferret, released in October, is a chatbot built on top of an existing open source model, Vicuna, while MGIE, released earlier this year, is a model that can modify images based on natural language commands. Bloomberg reported in October that Apple was investing $1 billion a year to catch up on GenAI, including efforts like a proprietary large language model called Ajax and an internal chatbot known as Apple GPT -- and potentially even new hardware. The upcoming iPhone 16 models are rumored to be in line for a \"significantly\" upgraded Neural Engine, Apple's brand of custom on-device chip for accelerating AI processing. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. IBKR EventTrader - Trade on where daily CME futures prices will close Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million If given HK$8 million to spend, Yat says he would invest in digital assets such as non-fungible tokens TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story.  The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone They soft-launched their relationship at the supermodel's cookbook event in Miami. 連續13日的閃購活動，產品低至 HK$11，記住準時搶購！友和同時提供豐富支付優惠，Mastercard、BoC Pay、AlipayHK、X Pay用戶享折上折優惠高達HK$500，閃購都用得！ The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company.  Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. "
}