{
    "title": "Apple sues a former employee for allegedly leaking info about the Vision \nPro and more",
    "date": "3/28/2024",
    "url": "https://www.neowin.net/amp/apple-sues-a-former-employee-for-allegedly-leaking-info-about-the-vision-pro-and-more/",
    "text": "By\n                                                                                    John Callaham\n\nNeowin\n@JCalNEO                                                                                ·\n                                    \nMar 28, 2024 23:40 EDT\nView full version Leaks about upcoming and unconfirmed software and hardware products from Apple are to be expected these days. However, the company is taking a very public action against a former employee who Apple said leaked confidential info about a number of its products. MacRumors reports that earlier in March, Apple filed a lawsuit in California state court against a former employee, Andrew Aude. The lawsuit (in PDF format) claims Aude violated his company confidentiality agreement by sending info about unannounced Apple products, and other info about the business, to members of the media and other tech companies. Aude was hired by Apple in 2016, but later began leaking info about the company and its products over a five year period. The lawsuit offers several examples of Aude\"s alleged activity. In one case in April 2023, Apple claimed Aude contacted a Wall Street Journal reporter by phone to send them info about the company\"s Journal app, which was unannounced at the time. Apple also claimed that in October 2020, Aude leaked info about the still-secret Apple Vision Pro mixed reality headset to a \"non-Apple employee\". The Vision Pro headset would not be officially revealed by Apple until June 2023, and would go on sale in February 2024. The lawsuit claims that Apple finally learned of Aude\"s actions in 2023 and fired him in December. What\"s more interesting is that Apple claims Aude leaked info about its products because he wanted to shut them down, due to Aude\"s own issues with those products. Apple said it tried to resolve its issues with Aude before it filed its lawsuit, but that he was uncooperative. Apple maintains that he is still an \"ongoing threat\" to the company. The lawsuit says Apple wants both compensatory and punitive damages, but a specified amount has yet to be determined. Aditya Tiwari\n                                                ·\n                    \nMar 22, 2024\n\nwith\n30\n                            comment\n                                s Aditya Tiwari\n                                                ·\n                    \nMar 12, 2024\n\nwith\n0\n                            comment\n                                s Aditya Tiwari\n                                                ·\n                    \nMar 11, 2024\n\nwith\n6\n                            comment\n                                s John Callaham\n                                                ·\n                    \nFeb 26, 2024\n\nwith\n1\n                            comment © Since 2000 Neowin LLC.\n                                    All trademarks mentioned are the property of their respective owners. "
}