{
    "title": "Apple Agrees to Pay $490 Million to Settle Lawsuit on Misleading \nShareholders About Its Business in China",
    "date": "3/16/2024",
    "url": "https://www.techtimes.com/articles/302636/20240316/apple-pay-490-million-settle-lawsuit-misleading-shareholders-business-china.htm",
    "text": " Apple has agreed to a $490 million settlement with shareholders who accused the tech giant of issuing misleading statements regarding its business operations in China in 2018. AFP reported that the out-of-court settlement came after shareholders criticized Apple, particularly its CEO Tim Cook, for allegedly downplaying the company's challenges in the Chinese market at the time. According to the shareholders, Apple's executives asserted in November 2018 that their operations in China remained robust despite indications of a slowdown. WUHAN, CHINA - MAY 21: （CHINA OUT) A large digital screen showing Apple logos are seen at Wuhan International Plaza on May 21, 2022 in Wuhan, Hubei Province, China.(Photo : Getty Images) Apple encountered challenges not only due to the slowing Chinese economy but also amid escalating tensions between China and the United States. During a conference call to discuss earnings, Cook noted that China was not among the emerging economies where Apple faced significant sales pressure and then mentioned Turkey, India, Brazil, and Russia instead. Nonetheless, the subsequent quarter witnessed Apple reporting earnings that failed to meet expectations for the first time during Cook's tenure. This discrepancy prompted shareholders, led by Norfolk County Council in Britain, to launch a class-action lawsuit against Apple, Cook, and CFO Luca Maestri. The settlement, filed nearly five years after the lawsuit was initiated, is subject to approval by a federal judge in Oakland. The hearing to validate the agreement is scheduled for April 30. The settlement terms and the specifics of how the $490 million will be distributed among the shareholders have not been disclosed publicly. Read Also: Apple is Now Allowing EU Users Download Apps from Websites, Bypassing App Marketplaces In a separate development, retail giant Walmart has made a surprising announcement regarding the sale of Apple's M1 MacBook Air. For the first time, Walmart offers customers the opportunity to purchase the M1 MacBook Air directly from its online store at a discounted price of $699. This move represents a departure from Walmart's usual offerings and marks the first time the M1 MacBook Air is being sold directly by the retailer. Walmart's discounted price is significantly lower than the laptop's retail price of $999, making it an attractive option for customers looking to purchase the laptop. The listing on Walmart's website features brand-new units of the M1 MacBook Air, albeit with the base configuration of 8GB of RAM and 256GB of storage. Despite concerns about the relatively modest RAM capacity, the discounted price of $699 makes it a compelling choice for prospective buyers, especially considering the latest discounts that decreased the laptop's price to $749. \"Our mission at Walmart is to help customers save money so they can live better - it's not an either/or proposition. The very heart of that mission is the belief that customers should not have to sacrifice quality because of price,\" Julie Barber, executive vice president of merchandising at Walmart, said in a statement. We're working hard to bring premium brands to our physical and virtual shelves, and we're excited to work with Apple to do just that,\" she added. Learn more about this story here. Related Article: Apple Facing More EU Scrutiny Over Epic Games App Store Clash  Sign up for our free newsletter for the Latest coverage!   "
}