{
    "title": "Google and Apple's rumored partnership could upend the AI industry",
    "date": "3/19/2024",
    "url": "https://ca.style.yahoo.com/google-apples-rumored-partnership-could-133715106.html",
    "text": "We've rounded up the best deals from Amazon, Walmart, Best Buy, Coach Outlet & more. This post originally appeared in the Insider Today newsletter. You can sign up for Business Insider's daily newsletter here. Good morning! A controversial new study suggests intermittent fasting increases your chance of dying of cardiovascular illness. But critics of the research, which hasn't been published in a peer-reviewed journal, are skeptical of the findings. In today's big story, we're looking at what a potential partnership between Google and Apple over AI features would mean for both companies and the wider industry. What's on deck: Markets: Longtime Goldman exec Stephanie Cohen details her decision to depart for Cloudflare. Tech: Instagram isn't losing the social-media wars after all. Business: New research suggests a recession has at least one benefit: increasing our lifespan. But first, a tech dream team. If this was forwarded to you, sign up here. Two of the world's biggest tech companies are reportedly discussing a partnership that would upend the AI industry. Apple is considering integrating Google's AI model, Gemini, into the iPhone. Nothing is finalized, so the potential deal terms aren't clear. But the broad strokes of the arrangement could see Apple license Gemini to power new features on iPhone software as soon as this year, according to a report from Bloomberg's Mark Gurman. The rumors come at the perfect time for both sides. For weeks, Google has been publicly trashed over Gemini being too \"woke.\" The criticism was so loud CEO Sundar Pichai acknowledged the company \"got it wrong\" in a memo. More broadly, insiders have questioned if Google can still be considered the tech world's vanguard of \"cool.\" Meanwhile, Apple has drawn attention for what it's not doing in AI. The company has been noticeably quiet around its AI plans compared to peers like Google, Microsoft, Meta, and Amazon. CEO Tim Cook alluded to a bigger announcement about the tech later this year at Apple's annual shareholder meeting. But the company seems to be playing catch up, as it reallocated resources from its scrapped electric vehicle to focus on generative AI. By teaming up, Google's Gemini gets a much-needed vote of confidence and access to the iPhone's sizable user base. And Apple keeps pace in the AI race by outsourcing some of the messy bits of the business, Business Insider's Hasan Chowdhury writes. Wall Street seems to agree. Both companies' shares rallied off the back of the report, BI's Phil Rosen writes. Apple and Google have a history of successful partnerships. Google has paid Apple to be the default search provider on the iPhone for years. Apple gets a nice chunk of change — reportedly $18 billion in 2021. Google maintains its place as the go-to search engine on the internet. It's a win-win. The tie-up isn't without its critics, though. It's a key piece of the Department of Justice's lawsuit against Google for \"anticompetitive and exclusionary\" behavior in a landmark trial for Big Tech that kicked off last year. So even if Apple and Google come to an agreement, they could still face some serious regulatory pushback.(And to be clear, Bloomberg's report mentioned Apple had discussions with OpenAI, the creator of ChatGPT, about a similar arrangement, so there's still a long way to go.) But if the history of Apple-Google deals has taught us anything, their combined power is almost unmatched. A Goldman goodbye from one of the top women on Wall Street. Stephanie Cohen is departing the bank to join Cloudflare as its first-ever chief strategy officer. She reflected on her 20-plus year career at Goldman, her advice to the bank's executives, and why she's jumping headfirst into tech. Wall Street is feeling optimistic about a soft landing. It's \"risk-on\" for many investors, who are betting the economy will be fine. The Street is mostly bullish thanks to strong economic growth and the prospect of interest rate cuts being in the pipeline. Japan's central bank raised interest rates for the first time in 17 years. The last time the Bank of Japan hiked borrowing costs was in February 2007. The market's response to its move was muted, with Tokyo's benchmark Nikkei 225 index closing 0.7% higher on Tuesday. Instagram is beating TikTok. Instagram far outpaced TikTok in global downloads last year, using its core photo feature and reels to win over consumers. Still, people are spending more time on TikTok than on Instagram. Here's what creators were talking about at SXSW. While AI was a popular topic of discussion, many panels failed to talk about its downsides. Meanwhile, some creators and employees said they were \"bored\" of talking about a potential TikTok ban. Nvidia unveiled its next-generation chip. CEO Jensen Huang revealed the Blackwell B200 GPU at the semiconductor giant's \"Woodstock of AI\" event on Monday. The chips \"are the engine to power this new industrial revolution,\" he said. Recessions have a weird benefit: They help us live longer. New research found the worse the economy is, the longer we live. That's because it cuts down on pollution — with less activity (fewer people driving to work, factories and offices slowing down), the air gets cleaner. 5-Hour Energy's billionaire owner elbowed his way into publishing Sports Illustrated — now he's lost it. Late last year, Manoj Bhargava took control of Sports Illustrated publisher Arena Group, swiftly laying off dozens of employees. His erratic behavior and failure to pay a licensing fee, however, resulted in him losing SI. Reddit's CEO defended his massive pay package. Steve Huffman said in a video Q&A that his $193 million compensation package was based on both salary and stock. Some Quora, Reddit, and X users feel the amount is too high for a platform that doesn't pay its moderators and hasn't been profitable thus far. Drake Bell knows life is not a Disney movie. Trump, in 5,000-page NY fraud case filing, says he can't foot $464M appeal bond. TikTok's new creator rewards program is all about boosting search and competing with YouTube. Elon Musk says he takes a small amount of ketamine every other week. A 'server anomaly' that made it look like some advertisers were bidding billions of dollars sent the adtech industry into chaos. A Lady Gaga Google Search shows how AI is upending the world's most profitable online business. 'Site owners are terrified.' US presidential primary elections will be held in Arizona, Florida, Illinois, Kansas, and Ohio. NCAA March Madness kicks off today. The Insider Today team: Dan DeFrancesco, deputy editor and anchor, in New York. Hallam Bullock, editor, in London. Jordan Parker Erb, editor, in New York. George Glover, reporter, in London. Read the original article on Business Insider Three million dollars sounds like the kind of money that lets you spend retirement sitting on the dock of your own boat, sipping mai tais (or coffee, if that's more of your thing). But a $3 million... BEIJING (AP) — At 53, Guan Junling is too old to get hired at factories anymore. But for migrant workers like her, not working is not an option. For decades, they have come from farming villages to find work in the cities. Toiling in sweatshops and building apartment complexes they could never afford to live in, they played a vital role in China's transformation into an economic powerhouse. As they grow older, the first generation of migrant workers is struggling to find jobs in a slowing econom IBKR EventTrader - Trade on where daily CME futures prices will close ATLANTA (AP) — Former President Donald Trump and other defendants accused of illegally trying to interfere in the 2020 election in Georgia on Friday submitted a formal application to appeal a judge's ruling allowing Fulton County District Attorney Fani Willis to remain on the case. Trump and other defendants had tried to get Willis and her office tossed off the case, saying her romantic relationship with special prosecutor Nathan Wade created a conflict of interest. Superior Court Judge Scott Mc In 2019, Aurora and its peers in Canada’s cannabis sector were under immense pressure to reassure investors as stocks crashed from dizzying highs. SAO PAULO (Reuters) -Nutrien Ltd., the world's largest producer of potash fertilizer, is mulling divestments in South America, replacing management and halting an acquisition spree in Brazil after steep losses in the region, according to sources with direct knowledge of the matter.  Nutrien this year separated Brazil from the rest of its Latin American operations as it mulls the sale of Argentina, Chile and Uruguay assets in order to streamline operations in the region, two sources said.  Since April 2023, at least eight senior executives or managers were fired or quit the company, including Brazil's entire supply management team, and the former Latin America CEO and CFO, according to three sources, who spoke on condition of anonymity because details of the changes have not been publicly announced.  Some fast food joints, like Jack in the Box, are even testing out robots in place of staff. Government jobs have been trending on social media as employees seek stability amid mass layoffs and an uncertain economy. The amended lawsuit names rapper Yung Miami, as well as several other women alleged to be on Combs' payroll.  Wells Fargo, Wedbush Securities, and Bernstein have all cut Tesla's price target this month, and expect low growth through this year. Retiring to Florida has been the dream for generations of Americans, thanks to the state's beautiful beaches, tropical weather, cultural diversity and endless variations of unique regional cultures... In this article, we will look at the 15 most advanced countries in blockchain technology. We have also discussed the global blockchain market along with key players. If you want to skip our detailed analysis, head straight to the 5 Most Advanced Countries in Blockchain Technology. According to Fortune Business Insights, the global blockchain technology […]  Private equity firm Blackstone will invest an additional $25 billion in private equity assets in India over the next five years, its Asia executive told Bloomberg News in an interview.  Blackstone already manages assets, ranging from warehouses and data centres to healthcare firms, worth $50 billion in the South Asian country.  The New York-based firm will hire 20 investment professionals in the country and double its office space in Mumbai, Blackstone's head of private equity in Asia, Amit Dixit, told the publication. In this article, we will discuss the 15 biggest Swiss companies. If you want to skip our analysis, you can proceed to the section highlighting the 5 Biggest Swiss Companies. Economy of Switzerland According to a report by the Federal Council of Switzerland, the Swiss GDP growth is projected to remain sluggish at 1.1% in […] If you're planning a summer road trip, you may want to leave a little more money in your budget than expected for fuel at the pump. Gas prices have already begun to crawl up in advance of Spring...  If you want to enjoy your retirement and not have to stress about working into your 70s, it's essential to sidestep the pitfalls that loom during your working years. Ill-advised decisions can shrink... Nelson Peltz claims Disney’s board, not CEO Bob Iger, is the problem. But his investment firm, Trian Group, withheld its votes for Iger’s reelection to the Disney board. With just over a week before Disney’s annual shareholder meeting on April 3, Peltz’s Trian — which has been aggressively campaigning to get two seats on the … In this article, we will look at the 10 best remote jobs that pay at least $100 an hour. We have also discussed the state of remote work. If you want to skip our detailed analysis, head straight to the 5 Best Remote Jobs That Pay at Least $100 an Hour. A decade ago, remote […]  Cheri Bentz, the office manager at The Marion County Record, filed the federal lawsuit Friday, claiming she was unlawfully detained and interrogated, and had her cell phone seized. If you’ve been the victim of workplace harassment, it can be difficult to feel you’re not alone — and even more difficult to know where to go with a complaint. However, experts say there are a number of recourses for employees, regardless of where they are located and the size of the company they work for. Workplace harassment legislation The most important place to start when it comes to exercising your rights as an employee? Knowing which law applies, said Jon Pinkus, an employment lawyer and Early retirement sounds like a dream come true, but it's not all rainbows and roses for most people. Find Out: I Retired at 65: Here's My Monthly BudgetLearn More: 7 Unusual Ways To Make Extra Money... "
}