{
    "title": "EU launches probe into Apple, Google, Meta",
    "date": "3/25/2024",
    "url": "https://www.newindianexpress.com/business/2024/Mar/26/eu-launches-probe-into-apple-google-meta",
    "text": "The European Commission, the European Union’s executive arm, on Monday said it was opening investigations into Apple, Google, and Meta for potential breaches of the newly enacted anti-trust law. The stringent Digital Markets Act (DMA), which came into effect on March 7, seeks to rein in the big-tech firms by making it easier for people to move between competing online services such as social media platforms, internet browsers, and app stores. This, EU regulators believe, will ensure a fair business atmosphere. The DMA has designated six big tech firms — Alphabet, Amazon, Apple, ByteDance, Meta, and Microsoft — as gatekeepers, making them comply with certain provisions to allow more competition in digital markets, such as allowing third-party app stores. The European Commission said it will open five non-compliance investigations into how Apple, Google, and Meta are complying with the DMA. The investigations will be completed in 12 months. The Commission will peruse the ‘steering’ rules of Alphabet and Apple to check if they allow app developers to migrate consumers to third-party app stores free of charge. It is also looking into whether Alphabet’s display of Google search results is self-preferencing — that is, preferencing its own services such as Google Flights and Google Hotels over similar ones offered by others. The probe will also check if Apple allows end users to easily uninstall any applications, change default settings, and select an alternative default service such as a browser on iPhones. Meta’s controversial ‘pay or consent’ model will also be subject to scrutiny. Under this, users need to pay a monthly fee to keep their data protected and avail an ad-free version of Facebook and Instagram. The Commission is also looking into Amazon’s ranking practices on its marketplace. “We have been in discussions with gatekeepers to help them adapt, and we can already see changes happening. But we are not convinced that the solutions by Alphabet, Apple and Meta respect their obligations for a fairer and more open digital space for European citizens and businesses,” said EU industry chief Thierry Breton. EU’s antitrust chief Margrethe Vestager said the Commission suspects that the suggested solutions put forward by the three companies do not fully comply with the DMA. Back-breaking penalties EU regulators are known to slap large sums of money as fines on multi-national companies, which could break the financial muscles of violators. In the current case, the tech giants could face hefty fines of up to 10% of their worldwide turnover if found guilty. The fines can go up to 20% in case of repeated violations. Apple was recently fined over 1.8 billion Euros for abusing its dominant position in the market for the distribution of music streaming apps to iPhone and iPad users. The European Commission said Apple prevented app developers from informing iOS users about alternative and cheaper music subscription services available outside the app Follow The New Indian Express channel on WhatsApp Download the TNIE app to stay with us and follow the latest  Copyright - newindianexpress.com 2024. All rights reserved.  "
}