{
    "title": "Will Apple Stock Rebound and Go Back Up Amid the AI Pivot?",
    "date": "3/13/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/indices/TXEI/pressreleases/24761081/will-apple-stock-rebound-and-go-back-up-amid-the-ai-pivot/",
    "text": "Apple (AAPL) investors have had very little to celebrate this year. AAPL was the worst-performing FAANG stock last year, even as it gained 49% in 2023 - which was better than the 44% returns delivered by the Nasdaq Composite ($NASX). AAPL stock is down 11% YTD so far in 2024, making it the worst-performing FAANG stock again this year. Broadening our view to the “Magnificent 7,” only Tesla (TSLA) has fared worse than Apple, down 31% on the year. Apple also lost its $3 trillion market cap – along with the crown of the world’s most valuable company – to Microsoft (MSFT). And while no one might have realistically considered this outcome a couple of years back, there is now a chance that even Nvidia’s (NVDA)market cap might surpass that of Apple. Why is Apple stock underperforming its mega-cap peers, and when will AAPL stock recover and go back up? Let's take a closer look. Apple stock is going down for multiple reasons. First, the company’s growth has faltered, and revenues fell YoY in all four quarters during the last fiscal year. The company’s China business has been under particular pressure; apart from a wider slowdown in the world’s second-largest economy, Apple is also battling intense competition from Chinese smartphone makers, especially Huawei. Second, the company’s regulatory woes continue to deepen. Earlier this month, the European Commission imposed a nearly $2 billion fine on the iPhone maker over antitrust issues. Alphabet (GOOG) - which is the worst-performing Magnificent 7 stock over the last decade - has faced similar issues over its Play Store policies. Third, Apple currently lacks its “next iPhone-sized opportunity” to drive growth. The company’s Vision Pro headset, despite being an incremental revenue opportunity, might not move the needle too much for Apple, which generates nearly $400 billion in revenues annually. Incidentally, Apple has also reportedly given up on its electric vehicle (EV) ambitions. While the current EV industry turmoil might have influenced the decision, a foray into mobility could have at least theoretically increased the company’s total addressable market significantly. Finally, amid slowing growth, it's tough to justify Apple's current valuations. The stock's next 12-months price-to-earnings multiple is 26x - in line with the average multiple over the last five years, but a significant premium to longer-term averages. During Q4 2023, Berkshire Hathway (BRK.B), led by investing legend Warren Buffett, sold 10 million Apple shares. While the company trimmed its AAPL holdings by only about 1%, it was the first time since 2020 that the conglomerate sold Apple shares. Wall Street sentiment toward Apple have also grown relatively tepid, and the stock was hit with three downgrades in January, which is a rarity for the Cupertino-based company. Apple has a consensus rating of “Moderate Buy” from analysts, with roughly two in three rating it as a “Strong Buy” or “Moderate Buy.” AAPL’s mean target price of $207.56 is almost 20% higher than yesterday’s closing price. I believe Apple stock is now quite near its bottom, and has limited downside from these levels. The company has largely missed the rally in AI stocks, but as it pivots to artificial intelligence, it should see some re-rating. However, Apple still needs to convince markets that it is not lagging behind its tech peers in incorporating AI across its different products. While AAPL still might not see an Nvidia-caliber rally, this would at least help it play catchup in terms of the “AI boom.” Currently, Apple stock is out of favor with markets, with fears over its China business being among the key factors spooking investors. At the same time, names like Tesla and Nike (NKE), which also generate a significant share of revenues from China, have also been under pressure amid a slowdown in that market. To make things even more complicated, the prospect of Donald Trump retaking the White House has raised the stakes further. Investors may recall that Apple shares cratered in Q4 2018, as Trump ratcheted up the trade war with China. Back then, Trump imposed a 25% tariff on imports from China; this time around, he’s talking about raising them to over 60%. To sum it up, Apple needs a lot to go right – both on the macro level and from a company-specific perspective – for the stock to recover and go back up. During the fiscal Q1 2024 earnings call, Apple CEO Tim Cook teased more details on its AI initiatives coming “later” in the year, and any real progress in that space could be just the trigger  needed to charge up AAPL bulls. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Futures and Forex: at least 10 minutes delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}