{
    "title": null,
    "date": "3/23/2024",
    "url": "https://voi.id/fr/teknologi/193431",
    "text": " Partager: JAKARTA - Wall Street is bracing for the slowest growth in global advertising revenue in the history of the social media sector. This is due to intensifying competition from TikTok and Apple in advertising that threatens to add to the economic woes in the second quarter. Gloomy hopes emerged after a boom in 2021, when social media ad sales in the United States grew 36 percent to reach $58 billion as brands ramped up marketing budgets to recover from the pandemic and reach customers online. But social media platforms have since warned investors and employees that the tide is turning as inflation persists and is the highest in 40 years, prompting brands to tighten advertising budgets even more. Meta Platform chief executive Mark Zuckerberg told employees last month that the company was cutting hiring plans and that \"this is probably one of the worst downturns ever seen in recent history.\" Snap Inc, which owns Snapchat and will report earnings, previously said it expected to miss its own quarterly earnings forecast due to deteriorating economic conditions. Global social media ad sales are now forecast to grow by 11%, the slowest pace in their history, according to media intelligence firm MAGNA, which lowered its ad growth forecast from 18%. Analysts expect some growth rates to slow after 2021. However, increasing competition from viral short video app TikTok and Apple has created a \"perfect storm\" and \"investors are rightfully wary\" about digital ad growth this year, Barclays analysts wrote in a research note this month. Reported by Reuters, Apple changed the digital advertising industry when it introduced new iPhone privacy controls last year that hurt the ability of companies like Meta and Snap to target and measure ads in their apps. Apple's own advertising business, which consists mostly of developers paying to promote their apps on the App Store, is expected to grow 36 percent this year to $6.9 billion, Barclays wrote. They added that Apple and TikTok together will take 34% of every new advertising dollar spent outside of China this year. Lior Eldan, chief operating officer of mobile app marketing agency Moburst, who has worked with brands like Uber and Reddit, said clients are now spending about two to three times as much on Apple ads, in part because the effectiveness of ads on other platforms has increased, relegated by changes. Apple privacy. \"We've seen a dramatic increase in the budget on Apple search advertising following the privacy changes,\" Eldan said. According to Barclays, while still much smaller than giants like Facebook and YouTube, TikTok is poised to grow by more than 200% into a $12 billion business. “TikTok remains critical to many clients' advertising strategies,” said Yvonne Williams, vice president of media at ad agency Code3, who has worked with brands such as Gap and Dior. Alphabet's Google, which reported second-quarter earnings on Tuesday, was the company most likely to be shielded from the negative effects. According to analysts from RBC Capital Markets, the article Google Search is \"mission important\" for many advertisers. \"Meta, Snap, and Pinterest are more open to Apple's privacy changes and competition than TikTok,\" added Barclays. The English, Chinese, Japanese, Arabic, and French versions are automatically generated by the AI. So there may still be inaccuracies in translating, please always see Indonesian as our main language. \n                                    (system supported by DigitalSiber.id) Tag:\n                                                                                                    media sosial\ntiktok\niklan\nakun medsos\napple © 2024 VOI - Waktunya Merevolusi Pemberitaan  "
}