{
    "title": "Apple Card tops 12 million users, $1bn in cashback paid out last year",
    "date": "1/30/2024",
    "url": "https://9to5mac.com/2024/01/30/apple-card-tops-12-million-users/",
    "text": "For the first time, Apple is sharing active user numbers for the Apple Card, which is exclusively available in the United States. The company announced today that the Apple Card credit card has more than 12 million customers. 30 percent of those people are actively using the card, making two or more payments per month. Apple Card Family has also seen strong uptake, with more than 1 million users sharing the card via Family Sharing, and 600,000 are set up as co-owners, building credit equally. Apple Card first debuted in 2019, in partnership with Goldman Sachs. It offers a simple credit card experience with no hidden fees and a Daily Cash cashback reward system. In the last year alone, customers earned more than $1 billion in Daily Cash rewards. Apple VP Jennifer Bailey said in a statement that Apple is “excited to continue to innovate and invest in Apple Card’s award-winning experience”, with 12 million customers using the Apple Card to make healthier financial decisions. In the same press release, Goldman Sachs said “we are committed to continuing to deliver an excellent experience for Apple Card customers”. However, behind the scenes, the partnership seems less rosy. Apple is believed to be pursuing a proposal that will replace Goldman Sachs in the next year or so, as Goldman Sachs exists all of its consumer businesses after incurring significant losses. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: A new kind of credit card. Created by Apple, no… Benjamin develops iOS apps professionally and covers Apple news and rumors for 9to5Mac. Listen to Benjamin, every week, on the Happy Hour podcast. Check out his personal blog. Message Benjamin over email or Twitter. The easiest way to get into HomeKit and Apple smart home tech. Great for gifts. Inexpensive, fast, wireless charger for iPhone. "
}