{
    "title": null,
    "date": "1/12/2024",
    "url": "https://invezz.com/news/2024/01/12/apple-aapl-stock-forecast-good-company-in-a-bad-shape/",
    "text": "Follow Invezz on Telegram, Twitter, and Google News for instant updates > Apple (NASDAQ: AAPL) stock price is hovering near its all-time high even as it faces substantial challenges. The stock was trading at $185.9 on Friday, a few points below its all-time high of almost $200. This price gives it a market cap of over $2.9 trillion, making it the biggest company in the world. Apple, the biggest Warren Buffett holding, has become the biggest company in the world for building the best devices. Its iPhone, Mac, iPad, AirPods, and watches are the best in their categories. It also controls its ecosystem by running its software across its brands.   Over the years, the company’s revenue and profitability have grown exponentially. Total revenue jumped from $260 billion in 2019 to over $383 million in the trailing twelve months (TTM). Its annual profit is approaching $100 billion. However, I believe that Apple is overvalued and that it is actually in bad shape. For example, Apple has a trailing PE ratio of 30.33, higher than the sector median of 21. Its forward PE multiple is 28 compared to the sector median of 23. The S&P 500 index has a PE ratio of 22. For a company trading at a premium, you’d expect it to have strong revenue and profitability growth. Apple is no longer growing as fast. In the most recent quarter, the company’s revenue dropped by 2.8% while the sector median was a 6.26% growth. Its forward revenue of 2.08% is lower than the sector median of 7.71%.  Invest and trade CFD stocks, ETFs, digital assets & commodities in minutes with our highest-rated broker. It is unclear where Apple will get its growth from. For one, unlike in the past, people are no longer buying iPhones every year. Also, the stronger US dollar has made the iPhone unaffordable to most people in emerging markets. This explains why the iPhone revenue retreated in the last quarter. Are you looking for fast-news, hot-tips and market analysis? \n\n  \n    Sign-up for the Invezz newsletter, today. There is also a concern about the future of the iPad. While the product was highly popular in the past, many people are no longer buying it. Like the iPhone, many customers are staying longer with their old iPads. Most importantly, Apple has been betting on its services segment which includes the likes of Apple Pay, Apple TV, Arcade, iCloud, and App Store. In the most recent quarter, the segment generated a 16% YoY revenue growth to $22.3 billion. I expect that the segment’s growth will continue soon but at a slower pace. Apple is also betting its future on Vision Pro, the virtual headset that will start selling on February 2nd. Because of its price, I suspect that this will be a niche product that will not achieve the success of key products like the Apple Watch and AirPods. The other challenge for Apple is its exposure to China, a country that is in a cold war with the US. A new war in Taiwan exposes China to major risks since it manufactures most of its products there. AAPL chart by TradingView To be clear. Apple is still a great company with quality products, a good reputation, and one of the best balance sheets in the market. The challenge is that the company faces some growth challenges to justify a $3 trillion valuation. Turning to the daily chart, we see that the AAPL stock price has formed a double-top pattern. In most cases, this is one of the most bearish patterns. The neckline of this pattern is at $165. Therefore, we can’t rule a situation where Apple retreats and retests this support in the coming months. This explains why analysts at Barclays recently downgraded Apple stock. Copy expert traders easily with Plus500. Invest in stocks like Tesla & Apple. Instantly trade ETFs like FTSE 100 & S&P 500. Sign-up in minutes. Buy or sell stock CFDs with Plus500. 82% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money.  Should you buy Bitcoin before the halving? Should you buy Bitcoin before the halving?  Use Invezz APP Get a better user experience Allow notifications? Allow us to send you updates You must agree to the privacy policy. "
}