{
    "title": "Dow Jones Falls 195 Points As Apple Dives On Downgrade; Tesla Slides On Q4 \nDeliveries",
    "date": "1/2/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-apple-stock-slides-on-downgrade-tesla-deliveries/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     The Dow Jones Industrial Average greeted the new year by briefly dropping 195 points Tuesday, as investors digested reports on manufacturing and construction spending. Meanwhile, Tesla (TSLA) rallied on better-than-expected fourth-quarter deliveries, while Apple (AAPL) stock sold off on an analyst's downgrade. After the opening bell, the Dow Jones Industrial Average dropped 0.1%, while the S&P 500 fell 0.6%. The tech-heavy Nasdaq composite declined 1.5% in morning action. Among U.S. exchange traded funds, the Nasdaq 100 tracker Invesco QQQ Trust (QQQ) was down 1.4%, while the SPDR S&P 500 ETF (SPY) fell 0.6%. Oil prices looked to rebound after a three-day losing streak, as West Texas Intermediate futures climbed more than 1% Tuesday morning, going past $72 a barrel. Early Tuesday, the S&P Global Purchasing Managers' Manufacturing Index for December fell to 47.9 vs. 49.4 in November. Also, the Labor Department said that construction spending rose 0.4% in November, slightly below estimates for a 0.6% rise. On the earnings front this week, Cal-Maine Foods (CALM), Conagra (CAG) and Dow Jones member Walgreens Boots Alliance (WBA) will report their quarterly results. Apple declined 3.1% Tuesday morning after Barclays downgraded the stock  to underweight from equal weight, with a new price target of 160 that is down from 161. Barclays analysts noted weakness in sales of iPhones and Mac computers. Meanwhile, electric-vehicle giant Tesla reported fourth-quarter deliveries of 484,507 vehicles, above Wall Street's estimate for deliveries between 475,000 and 480,000, according to Barron's. TSLA stock reversed up 0.5% in morning trading. The EV giant skidded another 1.9% Friday, falling back below its latest entry at 252.75. Tesla stock has a big double-bottom pattern with conventional buy point of 278.98. Stock Market Forecast 2024: A Soft Landing May Not Bring The Gains You Expect The Nasdaq composite ended Friday down 0.6%, booking a yearly gain of 43.4%. This was its best annual lift since 2003. The S&P 500 also gave up ground, falling 0.3% in the year's final session. The benchmark index climbed 24.2% during 2023. Finally, the Dow Jones Industrial Average held up the best out of the major indexes on Friday despite a 0.1% dip. The Dow 30 blue chip stocks rallied 13.7% for the year. Friday's Big Picture column commented, \"A notable feature of 2023's outperformance was the tremendous returns of stocks in the so-called Magnificent Seven group. Investors undoubtedly would like to see the stock market rally broaden out in the coming year. Key to this will be the Fed cutting interest rates. Investors undoubtedly will scour Fed minutes due in the coming week as they look for clues to future policy direction. The data is set to be released on Wednesday.\" Now is an important time to read IBD's The Big Picture column amid the continuing stock market gains. Be sure to read how to invest during the ongoing uptrend. Learn How To Time The Stock Market With IBD's ETF Market Strategy Magnificent Seven player Alphabet (GOOGL), Celsius (CELH), Monday.com (MNDY), Netflix (NFLX) and Snowflake (SNOW) — along with Dow Jones components Amgen (AMGN), Caterpillar (CAT) and Visa (V) — are among the best stocks to buy and watch in the current market rally. Microsoft and Netflix are featured in this Stocks Near A Buy Zone column. Get Real-time Buy And Sell Alerts On Stock Market Leaders With IBD Leaderboard Drug leader Amgen is trying to break out past a 288.46 official buy point in a flat base amid a 0.15% fall Friday. AMGN stock rose 0.3% early Tuesday. Heavy machinery giant Caterpillar remains above a 293.88 buy trigger, despite a 0.4% drop Friday. CAT stock was off 0.5% Tuesday morning. Payments leader Visa remains in buy range above a 250.06 entry in a cup base, according to IBD MarketSmith pattern recognition. V stock was down 0.4% Tuesday. 4 Top Growth Stocks To Watch In The Stock Market Rally Alphabet is testing a 139.42 buy point in a cup with handle following a Dec. 20 breakout move. GOOGL stock dropped 1.6% early Tuesday. Netflix ranks among the best stocks to buy and watch, even as it fell 0.7% Friday. The streaming giant broke past a 482.70 buy point out of a cup with handle in recent weeks. NFLX stock lost 2.6% Tuesday morning. Fitness drink leader Celsius raced higher last week, bullishly retaking the 50-day line for the first time since early November. Investors could view the recent strength as an aggressive entry. The official buy point is 68.95. Investors could use 62.99 or a downward-sloping trendline as other early entries. CELH stock fell 2% Tuesday morning. Monday.com continues to hold just above a 185.81 buy point in a cup with handle after a 1.6% loss Friday, according to IBD MarketSmith. MNDY stock was down 4% Tuesday. Artificial intelligence leader Snowflake remains squarely in its buy range past a cup-with-handle's 192.66 buy point, with a 1.1% fall Friday. SNOW stock declined 3.2% early Tuesday. IBD's latest newsletter MarketDiem gives you actionable ideas for stocks, options and crypto right in your inbox These are four best stocks to watch in today's stock market, including a Dow Jones leader. Join IBD experts as they analyze leading stocks in the current stock market rally on IBD Live Magnificent Seven stock Nvidia (NVDA) lost 3.5% Tuesday morning. Nvidia ended Friday's session unchanged, holding just shy of a flat base's 505.48 buy point. An IBD Leaderboard stock, Nvidia still is considered to be in a buy zone off a double-bottom base with a 476.09 entry that formed prior to the flat base. Among the Dow Jones stocks in the Magnificent Seven, Microsoft (MSFT), traded lower after Tuesday's stock market open. Microsoft stock gained 0.2% Friday, still modestly above a 366.78 cup-base buy point. And the software giant was down 2.1% Tuesday morning. Be sure to follow Scott Lehtonen on X, formerly known as Twitter, at @IBD_SLehtonen for more on growth stocks and the Dow Jones Industrial Average. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders Nvidia, Tesla, Meta Reveal Rules For Santa Claus Rally And Beyond Spot Buy Points And Sell Signals With MarketSmith Pattern Recognition 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}