{
    "title": "Is Everyone Sleeping On Apple's Real Potential In 2024? (Rating Upgrade) \n(NASDAQ:AAPL)",
    "date": "1/18/2024",
    "url": "https://seekingalpha.com/article/4663595-is-everyone-sleeping-on-apple-real-potential-in-2024-rating-upgrade",
    "text": "Justin Sullivan/Getty Images News Justin Sullivan/Getty Images News We are upgrading our recommendation on Apple Inc. (NASDAQ:AAPL) stock from a Sell to a Buy. As we get further away from those weak earnings back in June 2023, we're feeling better about Apple's sales and profits going forward. The company seems to have worked through that rough patch successfully. Looking ahead to 2024, we see a few things that should drive growth for Apple: the new iPhone 15 coming out later this year, and their augmented reality glasses Vision Pro that are launching soon. In our view, analysts are being too cautious with their single-digit growth estimates for Apple's revenue and earnings in 2024. We see several reasons why growth could exceed those modest expectations: First, Apple's new AI-powered products should provide a nice boost to sales in 2024 as they roll out innovations like AI Phone/ PC/ Smartwatch and augmented reality. Second, Apple just reclaimed the top spot in smartphone shipments. That larger installed base, along with their services business that grew 15% last quarter, gives them stable recurring revenues that can support ongoing top line growth. Third, these new products and services should generate operating leverage that can drive EPS growth faster than revenues. And fourth, Apple's massive share buyback program - currently reducing shares outstanding by around 3% per year - is already set to deliver a nice lift to EPS just from that financial engineering. So between the AI product tailwinds, the services momentum, operating leverage, and capital allocation, we believe Apple has upside potential from the single-digit growth rates currently modeled by analysts. The story is stronger than the modest consensus suggests. We see room for positive surprises as 2024 unfolds. In this article, we'll also take a look at the potential for Apple's upcoming Vision augmented reality headset. Analyst estimates don't seem to be factoring in much impact from Vision Pro yet. But it's slated to be announced on January 19th and available for shipment starting February 2nd. Getting a sense of Vision Pro's possibilities can help investors be prepared for its launch and impact. We want to give you a heads-up on what this futuristic product might mean for Apple's business as the launch date fast approaches. The market may not be pricing it in yet, but we think Vision could be a bigger deal than people expect once it hits the market. We think Apple's Vision Pro headset will avoid comfort issues and dizziness by separating batteries and using augmented reality's natural focus on real and virtual objects. This extended wearability expands use cases beyond gaming into productivity apps. In addition, Apple also has an edge on content over Meta Platforms, Inc. (META) thanks to visionOS allowing users to access tons of existing 2D iOS apps until AR versions are available. It's pretty exciting that Apple just passed Samsung Electronics Co., Ltd. (OTCPK:SSNLF) as the top-selling smartphone brand in 2023 according to IDC. IDC IDC We're not too shocked by the news. There were a lot of signs pointing to huge demand for the iPhone 15 that just came out. For example, Google Trends showing way higher search interest for the iPhone 15 compared to last year's iPhone 14. Google Google With Apple now shipping the most smartphones, it gives them even more leverage over suppliers. They already had plenty of bargaining power before when negotiating deals. But being number one in sales makes Apple's position stronger. Since Tim Cook took over as CEO, Apple's culture has changed. It's no longer the pioneering innovator it was under Steve Jobs. Today's Apple, despite the mocking it still gets at each iPhone launch, has turned into a profit-focused machine that iteratively improves existing tech. So securing the best parts and manufacturing has become a priority for Apple. Apple's advantage in shipments helps it maintain its standing and ensures it keeps getting the best components from suppliers. 2024 is looking like a big year for consumer electronics like AI-powered phones and computers. Even though Alphabet Inc. (GOOG, GOOGL) and Samsung got their AI gadgets to market first, the field is so competitive now that Apple can still make a wave with a late entrance. The key for Apple is using its relationships to get the most advanced chips before rivals, like the cutting-edge 3nm processors they've lined up from Taiwan Semiconductor Manufacturing Company Limited (TSM) for the iPhone 15. That should give them a performance edge even if their AI phone launches after competitors in 2024. We think these AI phones and PCs are kicking off a whole new consumer tech cycle, which will keep fueling Apple's growth in 2024. Also, while we aren't expecting any sci-fi magic from Apple's rumored augmented reality headset, they have a talent for perfecting emerging tech in a slick, usable way people love. AR may start as a niche plaything, but Apple could turn it into a mainstream computing platform. That's the big leap to watch for. Importantly, we don't think the Vision Pro will cannibalize iPhone or Mac sales since it serves different use cases. It should be incremental revenue strengthening the ecosystem. We don't think the market has fully accounted for the potential of the Vision Pro yet for two reasons: (1) it hasn't launched yet, and (2) the current VR/AR market isn't very active right now. However, we believe Apple's Vision Pro could really shake up and revive the AR/VR/MR market in 2024. It seems focused on solving some of the issues with current headsets and improving the overall customer experience. Apple has a history of coming into emerging tech markets late, but then completely changing the game. The Vision Pro launch could spark a lot more mainstream interest and adoption of AR/VR tech. To demonstrate how we believe Apple's strategy can impact the AR/VR/MR market in 2024, we will utilize Meta's Quest 3 as an example. We'll also chat about Apple's competitive edge in this market. Later, we want to talk about which types of users and scenarios seem the best fit for Apple's product. And how the launch could impact Apple's stock price. VR headsets can offer a really convenient and visually engaging experience compared to current consumer electronics, especially for more passive activities like browsing, watching videos, and reading articles online. However, issues like dizziness and heavy weight have prevented VR from going fully mainstream so far. Doing these more \"passive\" activities in the Quest 3 is easier and better than staring at a computer screen, phone, or even a 4K TV. The Quest's screen size and resolution either match or blows those other devices out of the water. And you can adjust the virtual screen size and distance to customize it perfectly for you. What we love is the transparent mode that lets you see the real world while using the headset. We can be watching a YouTube video then get up and walk to the kitchen for coffee, stop on the couch, or even use the bathroom without taking the headset off or pausing what we're doing. That's huge for multitasking and avoiding interruptions if you're deep into research or focused work. The virtual keyboard works surprisingly well too for light typing needs. You can also use hand-tracking gestures to navigate. Overall, the typing and input experience feels slightly inferior to using a real keyboard or touchscreen. But it's good enough for casual use. We think the Quest 3 really nails convenience and flexibility for productive at-home use cases. Once you free yourself from a fixed screen and can move around freely, it's hard to go back. We're excited to see how Apple pushes the envelope further with the Vision Pro glasses. So let's chat about Apple and the new Vision Pro glasses. This is a new product for Apple, but it utilizes existing mature AR/VR technologies. To provide some perspective, let's look at Meta CEO Mark Zuckerberg's recent comments on the Vision Pro: \"There's no kind of magical solutions that they have to any of the constraints on laws of physics that our teams haven't already explored and thought of.\" He's right that companies like Meta, Samsung, Microsoft, and Sony have been leading in AR/VR, steadily advancing the core technologies over the years. Apple wasn't first - they've never been shy about being late adopters when it comes to the latest tech, whether it's photography, charging, or other innovations. But what Apple excels at is refinement and fine-tuning. Rather than inventing brand-new tech, they focus intensely on performance, stability, and polish. We've seen this movie before. Tom's Hardware Tom's Hardware Additionally, by controlling both the hardware and software, Apple faces far fewer compatibility issues compared to the fragmented Android landscape. Quote from Bill Gates: \"Your most unhappy customers are your greatest source of learning.\" So what lessons acquired from Meta can Apple apply to the improvement of MR headsets? Let's look at a couple of areas: After using the Quest 3 for about an hour, we definitely felt the weight on our necks and shoulders even while changing positions. Early reviews suggest it's around 453g, including 200-300g for the separate battery pack. Compared to Quest 3, the experience is enhanced by moving the battery off the head. Thus, in theory, it may partially resolve the weight problem. XR Today XR Today Mark Zuckerberg seemed to dismiss the benefits of higher-resolution displays: \"They went with a higher resolution display, and between that and all the technology they put in there to power it, it costs seven times more and now requires so much energy that now you need a battery and a wire attached to it to use it. They made that design trade-off and it might make sense for the cases that they're going for.\" We agree that Quest 3's resolution is good enough for media viewing. But the see-through VR mode is pixelated and blurry. That's because it's not true transparency - the cameras capture your surroundings and project it on the screens. While you're focused on the virtual content most of the time, the low VR visual quality causes eye strain and dizziness with prolonged use. It seems like Mark Zuckerberg and Meta have been laser-focused on building a virtual world that connects everyone. That's why their VR technology prioritizes creating a completely immersive and visually stunning alternate reality you can share with others. But in Meta's rush to build this virtual universe, they may have neglected some fundamentals around integrating that digital experience seamlessly with the real world. Aline tech Aline tech Quest 3 lacks the excellent resolution of Vision Pro. It is anticipated to have reduced motion sickness and improved see-through vision over Quest 3. LEL LEL The advantage of Apple's approach is it provides a more natural experience since you maintain a visual connection to the real world around you. This reduces the possibility of lag and allows for a more precise blending of real and virtual objects. Apple Apple Apple has a big advantage over other companies in building augmented reality headsets because of its huge community of app developers. Even though Meta's Oculus Quest is currently the top-selling headset, its app store doesn't have that many productivity tools for users - most of the apps are games and entertainment. Apple's new Vision OS will allow users to download existing iPhone and iPad apps in a 2D version on the headset, even if those apps haven't been updated for a 3D interface yet. This gives Apple a huge advantage in terms of the selection of apps available for the headset since there are way more apps on the App Store for iOS compared to what's available on the Quest store. So even though the Oculus Quest costs less than Apple's rumored Vision headsets and launched earlier, we think Apple's Vision Pro headset will end up having a much larger total addressable market and more long-term success than the Quest given its software edge. So who will be the first target audience for the Vision Pro, and what value will it create for them? We think the superior media viewing and reading experience should appeal most to knowledge workers and creatives. For office workers doing lots of typing and writing, like coders or report writers, it may not replace their main workstation yet. But for senior managers who read more than write, the Pro could boost productivity when working remotely. If Apple solves the weight and dizziness issues, it's a huge upgrade for focused reading and thinking work. Some critics mock the separate battery pack design as clumsy and inconvenient. But in our experience using headsets, you tune out the real world anyway when absorbed in virtual content. The battery pack fades away. Further, Mark Zuckerberg questioned the premium pricing strategy: \"We innovate to make sure that our products are as accessible and affordable to everyone as possible.\" But new tech often debuts expensive, targeting early adopters first. Premium pricing is sustainable if it creates exclusive appeal for affluent users. The demand and buzz this generates can kickstart the viral, aspirational effect needed for mainstream adoption. The original iPhone followed this model. The Vision Pro's steep $3,500 price limits the addressable market initially. But we think the unique use cases like premium airline travel have a high social status value that will drive an influencer halo effect. Imagine the TikTok potential when wealthy execs don their futuristic Apple AR headsets in first-class cabins. This buzz is key to building the brand. So how much could the Vision Pro contribute to Apple's bottom line? We see three key market opportunities: First, if we assume affluent business managers/travelers are a core target, there are 460 million business travelers in the U.S. If just 1% buy the Vision Pro, that's $16 billion in potential revenue. Currently, the Pro is only launching in the U.S., but longer term it could expand globally if successful. Business travelers worldwide spend $740 billion annually. If 5% of that budget went towards Vision Pros to boost productivity, it could drive $37 billion in sales. Additionally, we expect wealthy consumers will purchase Vision Pros for home entertainment and status, buying multiple units for family members. If the top 0.25% of the 2.2 billion households worldwide opt for the immersive experience, averaging 4 headsets each, that's 22 million units moved and $77 billion in revenue. A massive 20% growth catalyst for Apple from this product alone. At first glance, Apple's valuation looks steep - its P/E and P/S ratios sit well above 5-year averages. SA SA Analysts seem to be taking a cautious view on Apple for 2024 - currently estimating low-to-mid-single digit growth for revenue and earnings per share. That puts Apple's forward P/E ratio around 27x. SA SA But we think those estimates are too conservative for a few reasons: First, 2024 should see the launch of exciting new AI consumer electronics from Apple. For example, Canalys predicts decent growth in smartphones, PCs, and smartwatches of 4,8, and 17%. CanalysCanalysCanalys Canalys Canalys Canalys We expect Apple's AI products, except maybe the Vision augmented reality headset, to hit in the second half of 2024. As a premium brand, Apple could grow as fast or faster than the overall market trends. Second, Apple's services revenue grew 15% last quarter in 2023 - that's a stable, recurring revenue stream tied to their huge installed base of users. With Apple regaining the top spot in shipments, we don't see service revenue slowing down much. And third, estimates seem to discount the potential boost from the rumored Vision headset and related services. That could be big. So we believe revenue growth assumptions are too low. If Apple can accelerate the top line, operating leverage should boost earnings growth even faster. The aggressive share buybacks, reducing shares outstanding by around 3% annually, are already set to deliver half the baseline EPS growth analysts have modeled. SA SA Also, we need to factor in the company's profitability, which has also expanded significantly versus historical levels. Gross margins are 350 basis points higher, and return on equity hit 171% compared to a 106% 5-year average. SA SA Apple's ROE is top-tier even among large tech peers we track. With many concerns around rich valuations in tech, ROE is an important metric to watch. According to our CAPM model, the required return threshold to hold a stock is around 11% - a test that broader market proxies like SPY and QQQ pass. With Apple delivering an ROE of over 170%, the premium pricing appears more justified by performance. SA SA However, risks do remain if Apple's revenue growth stalls or declines. SA SA Specifically, we turned cautious on Apple back in early June 2023 when profitability indicators like gross margin, operating income, and dividends per share were declining year-over-year despite cost cuts and buybacks. This drag resulted from lower product sales in the April quarter. AAPL AAPL But after observing the last two quarters, Apple seems to have returned to bottom line expansion - gross margin, operating income, and dividends per share are all growing again. AAPL AAPL Apple has built strong defenses to protect investors seeking stock price growth. They have stable service revenue streams alongside device sales. Their brand loyalty and closed ecosystem lock in high product margins. Diverse developers, gaming revenues, and payment systems secure high-margin services income. Moreover, Apple vigilantly controls operating costs and buys back shares to grow EPS. With diversified revenue streams and disciplined spending, Apple is well-positioned to deliver EPS growth despite singular headwinds. So we're not surprised to see the stock rebound to new highs as the market is less concerned with earnings contraction now. SA SA Looking ahead, we think Apple's top line is also poised to return to growth for a couple of reasons: The risks are real if execution falters, but current trends appear positive. The Vision Pro offers a significant new growth avenue, and core smartphone sales seem ready to re-accelerate. As long as Apple can deliver on these two fronts, the fundamentals should improve from here. But we'll continue monitoring the data closely for any cracks. For now, the growth trajectory looks increasingly compelling. We are upgrading our rating on Apple stock to a Buy as the company's growth trajectory appears to be improving. It seems like Apple has made it through those worrying profit declines they faced last year. We think analysts are underestimating how much Apple could grow in 2024. Several things should drive their revenues and earnings higher than the cautious estimates: Apple has a few ways they could deliver upside surprises, between AI innovation, services momentum, operating leverage, and capital allocation. Their 2024 growth should handily beat conservative projections. Looking ahead, the upcoming Vision Pro AR glasses launch provides a big new revenue source, while iPhone sales are poised to reaccelerate with the iPhone 15 release and easing consumer inflation pressures. We'll be watching closely for any issues, but things are looking increasingly bullish. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of AAPL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}