{
    "title": "Apple Shares Climb After Vision Pro Launch Date Is Set for Feb. 2",
    "date": "1/8/2024",
    "url": "https://www.investopedia.com/apple-shares-climb-after-launch-date-set-for-vision-pro-8423509",
    "text": " Justin Sullivan / Getty Images Apple Inc. (AAPL) shares climbed during intraday trading on Monday after the iPhone maker announced a launch date early next month for its Vision Pro virtual reality (VR) headset. The spatial computer headset will launch in the U.S. on Feb. 2, with preorders opening on Jan. 19. It will cost $3,499, with prescription lens add-ons costing $149. “Apple Vision Pro is the most advanced consumer electronics device ever created. Its revolutionary and magical user interface will redefine how we connect, create, and explore,\" Tim Cook, Apple's chief executive officer (CEO), said. The headset \"seamlessly blends digital content with the physical world and unlocks powerful spatial experiences in visionOS, controlled by the most natural and intuitive inputs possible—a user’s eyes, hands, and voice,\" Apple said. The Vision Pro could allow Apple to compete with Meta's (META) Quest 3 headset, which held 55% market share for VR headsets in the third quarter of 2023, according to IT market intelligence firm International Data Corp. Jefferies Group securities analysts project that Apple will capture just 4% of VR headset market share, with around 400,000 units shipped in 2024. The firm noted that Vision Pro is to be sold at a higher price point than other comparable headsets like the Meta Quest 3, which starts at about $500. Apple is said to already be working on a cheaper version and a second-generation Vision Pro, according to UBS analysts, which could help address pricing concerns. Apple shares were up roughly 1.8% at $184.37 at 2:00 p.m. ET Monday. Apple Inc. \"Apple Vision Pro Available in the U.S. on Feb. 2.\" International Data Corp. \"AR/VR Headset Market Forecast To Decline 8.3% in 2023 But Remains on Track To Rebound in 2024, According to IDC.\" Jefferies Group. \"Apple Vision Pro Available in 1Q24.\" Meta Platforms Inc. \"Meta Quest 3.\" UBS. \"Level-Setting Vision Pro Expectations Ahead of a Launch in Early 2024.\" "
}