{
    "title": "Apple Car Launch Date Reportedly Pushed Back To 2028—What We Know About The \nElectric Vehicle Project",
    "date": "1/23/2024",
    "url": "https://www.forbes.com/sites/antoniopequenoiv/2024/01/23/apple-car-launch-date-reportedly-pushed-back-to-2028-what-we-know-about-the-electric-vehicle-project/",
    "text": "Apple is simplifying the design and pushing back the potential launch date of its in-development electric vehicle, Bloomberg reported, another delay made from the tech giant in its long-running quest to bring a partially autonomous EV to consumers. Apple once planned to release the vehicle as early as 2019. (Photo by Costfoto/NurPhoto via Getty ... [+] Images) The vehicle’s release date has been delayed to 2028 at the earliest, according to Bloomberg, which reported the company’s previous 2026 release target was also the product of a delay. Apple is now working on the EV with more limited features, further dialing back on plans that once included an autonomous vehicle without pedals or a steering wheel. The vehicle will operate with a “Level 2+” system capable of autonomous lane centering and adaptive cruise control at the same time, according to Bloomberg, which added the tier was a few steps below the previously planned Level 4 technology capable of autonomously driving the car under limited circumstances. Apple’s pivots on the project, codenamed Titan, were made after meetings including the company’s board, CEO Tim Cook and project head Kevin Lynch, Bloomberg reported, noting the board pressed company leadership about the project throughout 2023. The vehicle has reportedly been in development since 2014, though official details about the car’s name, specifications and development have been scant in the last decade. Apple didn’t immediately respond to Forbes’ request for comment. Some of the earliest reported estimates in the mid-2010s suggested Apple initially eyed a release date for its car in 2019. Apple shares are trading up at a fraction of a percent to $194.96 as of 3:20 p.m. The company’s stock has climbed more than 38% in the last year after trading around $140 a share last January. Apple has sunk a substantial amount of company resources into the car project, according to Bloomberg, which reported Apple has spent hundreds of millions of dollars a year on it amid multiple rounds of layoffs, strategy changes and delays. The car’s design was in the pre-prototype stage as of late 2022. A successful EV launch would put Apple in direct competition with automakers like Tesla, Ford, GMC and Rivian, the latter of which Amazon has invested more than $1.3 billion into. Vehicle maker executives like Ford CEO Jim Farley and Tesla CEO Elon Musk have recently casted doubt on the profitability and safe application of fully autonomous vehicles. The self-driving features currently offered by Tesla vehicles feature autosteer on city streets and the ability to come to stops with driver supervision. Full vehicle autonomy, according to Tesla, depends on “achieving reliability far in excess of human drivers” and regulatory approval. Apple Dials Back Car’s Self-Driving Features and Delays Launch to 2028 (Bloomberg) Apple Scraps Plans For Car Without Steering Wheel Or Pedals, Report Says (Forbes)  "
}