{
    "title": null,
    "date": "1/17/2024",
    "url": "https://investorplace.com/2024/01/apple-stock-is-a-dark-horse-bet-on-ai/",
    "text": " AAPL stock will reward patient investors Advertisement Source: Yalcin Sonat / Shutterstock.com Before buying Apple (NASDAQ:AAPL) stock, which is already worth nearly $3 trillion, you need to know how it plans to grow. The easy answer is AI, but what does that even mean in the context of the iPhone, iPad and Apple Watch? Apple has already spent a year considering that question. The introduction of the answers is still months away. Until then, investors should expect a bumpy ride. But if you’re there for it, if you buy the dips, I think you’ll make money down the road. Apple’s AI vision is based on the two areas where it made its reputation, client devices and safety. A recent paper by Apple scientists explains it. Apple plans to install its large language model onto its devices by using flash memory and reading the data in large chunks. These chunks are defined as “neurons,” taken out of memory as new questions are posed. Apple thinks this technique can let it run LLMs that are twice the size of the Dynamic memory available, increasing inference speed up to 500%. Current LLMs also have a huge Garbage In, Garbage Out problem. When you “train” software on bad data, you get bad answers. Apple is working to license legitimate data to solve this problem. This is in contrast to ChatGPT, backed by Microsoft (NASDAQ:MSFT). ChatGPT wants to take copyrighted data for free and run Generative AI through its Azure cloud. Apple’s view is a big risk, but it could result in big rewards for APPL stock. Apple plans to tie its AI to the iPhone through the Siri spoken interface. Contrast this with Alphabet (NASDAQ:GOOG)(NASDAQ:GOOGL), which just laid off people from its speaking interface and device units. Like Microsoft, Google wants to run AI through its cloud. Apple is also consolidating its AI work in Texas, telling 121 workers in San Diego to move or leave the company. This could send some talent to rivals. But the move means Apple is past the point of thinking about how its AI will work. Implementation is usually the work of a single unified team. All will be revealed in early June when Apple holds its Worldwide Developers Conference. The event will be held at its Cupertino headquarters and be fully available online. It may be the most important Apple event since the 2007 launch of the iPhone. A host of new tools are due to be launched. While working on its next revolution, Apple must maintain excitement for its current offerings. Judging from the crowds I saw at an Atlanta Apple store over the holidays, there’s little to fear. Apple has enormous customer loyalty, even for older models. Apple also has more control over its supply chain and distribution than any company this side of Lululemon (NASDAQ:LULU). It’s this control that let Apple earn gross margins of 44% in its most recent quarter. Those margins aren’t going down. The risk is in the volume of iPhone sales. That’s still half of the business. But remember that higher-margin services are now one-quarter of revenue. Apple is considered a dark horse in AI because it’s focused on the broad consumer market, which will take time to develop. For the next year, the biggest gains will come from businesses. Enterprises will be spending billions building their own LLM models, loading them with databases built over the last two decades. That’s why Microsoft is now worth slightly more than Apple, having nearly doubled its stock gains in the last year. The spread accelerated over the last few months. But that’s also why a smart investor will buy more Apple than Microsoft stock over the next few months. It’s cheaper, and by this time next year your patience will be rewarded. As of this writing, Dana Blankenhorn had LONG positions in MSFT, GOOGL, and AAPL. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Dana Blankenhorn has been a financial and technology journalist since 1978. He is the author of Technology’s Big Bang: Yesterday, Today and Tomorrow with Moore’s Law, available at the Amazon Kindle store. Tweet him at @danablankenhorn, connect with him on  Mastodon or subscribe to his Substack. Artificial Intelligence, Cloud, Consumer Discretionary, Retail, Software, Technology Blue-Chip Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/apple-stock-is-a-dark-horse-bet-on-ai/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}