{
    "title": "These VCs think the Vision Pro has a shot in the enterprise",
    "date": "2/6/2024",
    "url": "https://techcrunch.com/2024/02/06/these-vcs-think-the-vision-pro-has-a-shot-in-the-enterprise/",
    "text": "The Vision Pro, Apple’s first mixed-reality headset, is undeniably impressive from a technical perspective. It reflects a carefully considered, thoughtful (albeit pricey) approach to AR/VR, while its operating system — visionOS — delivers genuine innovations in the areas of input and interactions. But apps make or break hardware, regardless of how compelling the base experience is. And that’s where the Vision Pro appears to be struggling. At launch, around 600 apps had been developed specifically for the Vision Pro. To be sure, that’s no small feat. But this initial library is a small fraction of the apps available for Apple’s other platforms and — more significantly — contains glaring omissions like Netflix, YouTube and Spotify. Now, apps needn’t be natively developed for the Vision Pro; the headset is backward compatible with both iPadOS and iOS apps. But existing apps don’t tap into the Vision Pro’s more powerful, immersive features, and developers can opt out of Vision Pro compatibility at will. In a recent survey of 500 consumers, 81% said that they were concerned that the absence of apps from major developers would undermine the Vision Pro content experience. Of those who said that they didn’t have plans to purchase a Vision Pro this year, 39% cited a lack of interesting content and apps to use as their main reason. Image Credits: Apple Image Credits: Apple Partly to blame for the app austerity is a steep decline in funding for AR, VR and “metaverse” software startups. Investment around these themes — AR, VR and the metaverse — hit a multiyear low in 2023, according to Crunchbase, driven by plummeting sales of AR and VR headsets. After peaking in 2022 at ~$6 billion in funding across ~600 deals, the AR, VR and metaverse market dipped to $2 billion across just 200 rounds. Can Apple lead a turnaround? Some VCs think so — and they’re putting their money where their mouth is. Brad Harrison, the founder and manager partner at Scout Ventures, an early-stage VC firm, recently invested in Taqtile, a Seattle-based company that works with enterprise customers to create AR-augmented job training programs. While Taqtile is hardware agnostic, they’re a partner in Apple’s enterprise program and Taqtile’s platform, Manifest, works with the Vision Pro. “While the Vision Pro is a gen-one product and expensive, the fact that it’s on the Apple platform gives it an amazing distribution network for both sales and support through Apple stores,” Harrison told TechCrunch in an email interview. “I think the fact that a user can immediately derive value because it’s within the Apple [ecosystem] is the biggest potential opportunity for adoption and real integration into the workplace.” Indeed, the workplace — not the homes of average consumers — might be where the Vision Pro ends up carving a niche. In a note to analysts this week (via Apple Insider), Morgan Stanley declared that the Vision Pro is “ripe for enterprise adoption,” particularly uses cases like virtual simulations, digital showrooms, remote training virtual marketing and “in-field remote break/fix.” Writing in the note that the enterprise opportunity “could become much larger than is currently expected,” Morgan Stanley forecasts that Apple’s headset business will “conservatively” ramp up to $4 billion per year in revenue after four years. Apple’s certainly cognizant of the enterprise applications, this month incorporating the Vision Pro into the Apple Device management process to allow IT teams to manage headsets in the same way that they’re used to handling iPhones, iPads, watches and Macs. My colleague Ron Miller reports that the Vision Pro will soon get business-friendly features like single sign-on, identity management and security, sweetening the pot for firms considering widespread deployment. “We believe that we’re finally at an inflection point where the availability of the hardware, ease of use, integration to existing platforms and . . . demand will result in growth of real AR-based businesses,” Harrison continued. “Scout has been very bullish on the adoption of AR/VR because of the confluence of affordable and accessible hardware combined with AI presenting a massive opportunity to improve employee efficiency . . . We finally see real customer demand [across] multiple use case scenarios across training, maintenance and education.” Image Credits: Apple Image Credits: Apple Charlie Ill, the chief investment officer at Asia-Pacific-focused VC fund Investible, agrees with that assessment. In 2019, Investible backed JigSpace, an interactive 3D presentation platform for creating AR demonstrations and product stories. JigSpace came to the Vision Pro last week — a decision Ill wholeheartedly supported. “After multiple false starts with [extended reality], we think this time is different,” Ill told TechCrunch. “Near-eye display and spatial video technology has advanced toward more widespread adoption. A version-one device may not find massive commercial success, but it could cement Apple’s position as in the next generation of hardware platforms atop which developer ecosystems can thrive . . . Embedded in Apple’s DNA is corralling developers around new products to offer the consumer infinite choice of applications. And over time, we think the Vision Pro use cases, and relevancy to consumers, will become more obvious.” This writer wasn’t necessarily expecting critical takes on the Vision Pro from VCs whose portfolios are closely tied to it. But I was surprised by just how bullish they seemed on the headset — and on AR, VR and metaverse tech more broadly. Me, I’m not so sure I’m swayed by the rosiest projections — some analysts expect that Apple will sell nearly half a million Vision Pro units this year. But buy-in from the enterprise isn’t an unreasonable bet considering the trajectory of AR/VR headsets historically. Microsoft eventually pivoted HoloLens — which costs the same as the entry-level Vision Pro, coincidentally — to the enterprise, chasing after a mammoth contract with the U.S. Army. Years before, Google followed the same playbook with Google Glass, moving away from the consumer version to bring the tech to a decidedly more corporate audience. It’s the earliest of days, of course — the Vision Pro came out last week. And it’s hard to know what its future might hold. But Ill, for one, has high confidence in Apple — and the wider AR, VR and metaverse field. “As early-stage VCs, we’re in the business of making bold bets on founders who are thinking and building at the cutting edge,” he said. “Investing early is essential to a healthy innovation ecosystem, and we have high conviction in spatial computing’s future.” "
}