{
    "title": "Apple launches free sports app",
    "date": "2/22/2024",
    "url": "https://finance.yahoo.com/video/apple-launches-free-sports-app-221058699.html",
    "text": "Apple (AAPL) launches its first sports app offering updates to real-time scores and stats. Yahoo Finance Reporters Josh Schafer, Brooke DiPalma, and Pras Subramanian discuss the content prospects for this app amid recent sports bundling trends among streaming providers. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. JOSH SCHAFER: And today, we are starting off with a new app from Apple-- the Apple Sports app. This is an attempt from Apple to probably drive more users to their streaming service. We know Apple's gotten into streaming sports, namely the MLS, right? And they've also got into documentaries that involve sports. There's a Patriots documentary that recently came out. So they're sort of getting more involved in the sports space. You can see the app here on your screen. One of the key features of it, really, is just live scores. It has live scores. When you click on Upcoming Games, you can see the standings. There's some gambling lines that go on there. Honestly, Pas, it seems like a pretty surface-level app right now, the app that's just launched, but it doesn't quite have some of the features from some of my favorite sports apps. I'm thinking of maybe ESPN where you click and there's news that comes up with the app and other videos that come up with the app and sort of more content that it brings you. I favorited my favorite team here, the Boston Bruins. They've played in the NHL. And it just isn't really giving me a lot on the Bruins was sort of my service-level takeaway. Again, the app just launched. Maybe there'll be more sort of features to come with it. PRAS SUBRAMANIAN: Yeah. I mean, it's like almost an alpha stage right now, right? Because basically, you can either add leagues, which the NFL is not part of. Like, you notice the NFL is not part of it for some reason. I guess because the season's over. Or you can add your favorite teams. And then just the scores or upcoming games come up, you can't click in, you can't get any news. There's no video component yet. But I think you're right. Maybe it's a way to drive users to maybe the Apple TV app, where it has a pretty cool way-- I have it and it has a pretty cool way of notifying you when certain games are close or how to watch them and stuff. So, maybe that integration is coming later. But right now, I think the Yahoo Sports app is better, right? I think the-- I think ESPN app is better for both scores and kind of like maybe some video, too. BROOKE DIPALMA: Yes. I mean, the old Google to see how your team's doing just isn't the thing anymore. All of that. JOSH SCHAFER: You get an app. There's always an app for that, right, Brooke? BROOKE DIPALMA: I do that. But I truly do think that app, this has been a long time coming, as Apple really try to make their mark in the sports arena. I mean, we saw them do the halftime show with Usher. Now they've had the halftime show for quite a few years. It formerly was PepsiCo. It just goes to show that Apple is really doubling down trying to get in the space. Of course, Tim Cook is super excited about this, tweeting that he can't wait to use it during the 2024 MLS season, which kicks off tonight, right? JOSH SCHAFER: Mm-hmm. BROOKE DIPALMA: Or last night? JOSH SCHAFER: Sure. BROOKE DIPALMA: Between Inter Miami CF and Real Salt Lake on Apple TV. So it really just trying to see returns from this MLS partnership that they did. Don't know if they're quite seeing the returns that they had initially hoped for. JOSH SCHAFER: Yeah, it seems like at the surface right now, the best use case is for the MLS, right? Because that's where Apple has the content. One of my favorite things about, say, the ESPN app is that ESPN has so many sports rights. So when you click on a game, you're able to watch the game inside that app and it sort of creates more content for you inside the app, and with push notifications, too, as Pras mentioned. So I think it'll be interesting to see sort of where it goes for Apple as they get deeper into sports, maybe even get more sports rights, how they're able to leverage the app. BROOKE DIPALMA: I think sports right will be a game changer for this Apple TV. In addition to that, they're also getting-- these stats are supplied by DraftKings, right? JOSH SCHAFER: Mm-hmm. BROOKE DIPALMA: So in that case, you know, where does that partnership evolve to? And how do they work together to ultimately grow this? JOSH SCHAFER: All about the betting lines always, Brooke. BROOKE DIPALMA: Always about the betting lines. PRAS SUBRAMANIAN: And Tim Cook noted Auburn fan, right? I think alum, too. So maybe that's-- he is a sports guy, so we'll see. JOSH SCHAFER: Go Tigers. PRAS SUBRAMANIAN: Go Tigers, yeah. JOSH SCHAFER: That applies to like half of the colleges in the country. PRAS SUBRAMANIAN: Yes. Related Quotes "
}