{
    "title": null,
    "date": "2/4/2024",
    "url": "https://ca.news.yahoo.com/mark-zuckerbergs-meta-wants-burst-105701442.html",
    "text": "WhatsApp has conquered the world — except for America. Because most people use iPhones, Apple's iMessage is the dominant messaging platform in America. Mark Zuckerberg hopes to change that by making the Meta-owned WhatsApp more popular in the US. Apple's blue-bubble texts have made messaging a tribal affair for many Americans. iPhone users have come to feel a degree of comfort — or superiority, depending on your perspective — when using iMessage because of the blue bubbles containing their texts when interacting with fellow iPhone users. Green bubbles that appear when iPhone users text anyone else, on the other hand, tell them they're dealing with someone who isn't Team Apple. That's an oddity in the US, where almost 80% of Gen Z consumers prefer iPhones over Android devices, Bloomberg Intelligence found last year. As superficial as this color-coded system may seem, it's meant a lot to Apple. The company has aggressively defended the blue-green split, going as far as shooting down an app in December that allowed Android users to disguise their messages in blue bubbles. Mark Zuckerberg may have a plan to burst those bubbles. The Meta CEO reigns over an empire of social-media apps familiar to many Americans. Facebook and Instagram are, after all, common screen-time gobblers. But there is one Meta app that isn't as popular yet in the US: WhatsApp. Facebook bought the instant-messaging app for $19 billion in 2014 and has been able to turn it into a worldwide megahit ever since. About 2 billion people are thought to use the app globally, though most are outside the US. Zuckerberg hopes to change that. In an interview last year, he described WhatsApp as Meta's \"next chapter\" — a bold statement to make in a year that AI, efficiency strategies, and the metaverse dominated. What can Americans expect from this \"next chapter?\" Zuckerberg has offered a few clues. WhatsApp is aiming to be business-friendly. The company said a person running a business account can link multiple devices together, enabling more employees to \"respond to customer messages from anywhere.\" Meta also offers tools for brands such as Chevrolet and Samsung to reach customers, including those that allow them to address queries without engaging \"live support\" and ways of placing orders on the app. Such features seem to interest businesses: The number of WhatsApp's daily business users jumped by 80% in the US last year, data from Apptopia first reported by the Big Technology newsletter shows. WhatsApp is also trying to be an app everyone can use. As internet users increasingly sour on social media, the need for private spaces to interact with friends and family — such as WhatsApp group chats — has only grown. WhatsApp is trying to offer the perks of social media without the publicity. For users who may miss certain social-media features — such as the ability to follow people — WhatsApp introduced a \"Channels\" feature last year that allows anyone to follow their favorite influencers and get updates from a \"broadcast.\" Think of it as an Instagram story update. WhatsApp is trying to build a better group-chat experience, too. Though Apple offers a group-chat feature on iMessage, users are limited to adding up to 32 extra people. On WhatsApp, a group can have more than 1,000 users. Is this enough to pry people away from their blue bubbles? Zuckerberg hopes so. In late 2022, the Meta chief acknowledged that while there is still some time before bets on the metaverse can prove successful, \"business messaging is probably going to be the next major pillar of our business as we work to monetize WhatsApp and Messenger more.\" Expect him to push that hard in the US. Read the original article on Business Insider \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th “你聽說過這種極端的名人‘肌肉泵’趨勢嗎？一位增肌專家正在揭開所謂的‘健身影響者’行業的面紗。” 這個簡單的一步「泵法」為健身房各處的男士帶來了驚人的效果。 “任何想要增強肌肉的人都應該看看這個......” \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million  TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story.  The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone They soft-launched their relationship at the supermodel's cookbook event in Miami.  The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company.  Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. "
}