{
    "title": "Hon Hai will forge deeper, wider cooperation with Apple: Chair",
    "date": "2/20/2024",
    "url": "https://focustaiwan.tw/business/202402200025",
    "text": "Taipei, Feb. 20 (CNA) Hon Hai Precision Industry Co., the world's largest contract electronics maker, is expected to forge deeper and more comprehensive collaborations with its main customer Apple Inc., the company's chairman said Tuesday. Speaking before a dinner banquet on Tuesday to mark Hon Hai's 50th anniversary, the company's Chairman Young Liu (劉揚偉) said that the two companies will forge a deeper and more extensive partnership. \"Everything that should be there will be there and nothing will be missed,\" Liu added. Liu made the remarks when asked about the progress made in Hon Hai's collaborations with Apple in the artificial intelligence (AI) and electric vehicle (EV) fields. Hon Hai is the largest assembler for Apple. In addition to iPhone, it also makes other Apple products, such as iPads, MacBooks, AirPods, and Apple Watches. It gets more than half of its business from Apple. Liu said that in addition to Apple, several of Hon Hai's international partners also dispatched representatives to the banquet, including its other main customers HP, Dell, Cisco, processor and chip makers Intel, NVIDIA, AMD, and Arm and automotive chipmaker NXP. Asked to comment on Hon Hai's plans to expand its footprint overseas, Liu indicated that it is continuing its collaboration with India's HCL Group in semiconductor outsourced assembly and testing (OSAT) development in the South Asian nation and is keeping negotiations with the local government on issues regarding subsidizing semiconductor manufacturing. Also, Liu said that construction on an electric vehicle factory in Thailand has almost been completed and Hon Hai will determine when to begin taking orders depending on the future market development. Asked about Hon Hai's plan to set up a joint venture company to build and operate a new 12-inch wafer fabrication plant in Malaysia, Liu said that a worldwide chip shortage has prompted chipmakers in many countries to accelerate building new factories to increase manufacturing capacity. However, noting that the upstream supply relies heavily on downstream demand, Liu said Hon Hai will decide whether to go ahead with a Malaysia wafer fab plant plan by observing the downstream demand situation. \"Does the world need so many fabs?\" Liu said. Liu added that Hon Hai was not sure yet and would continue to pay attention to the issue. Founded in 1974, Hon Hai specializes in electronics manufacturing services (EMS). Its market share in EMS exceeds 40 percent and covers four major product segments: smart consumer electronics; cloud and networking; computing; and components and others. Hon Hai employs more than one million people worldwide during seasonal peaks. Its consolidated sales for 2023 were nearly NT$6.16 trillion (US$195.91 billion). (By Chung Jung-feng and Evleyn Kao) Enditem/ASG "
}