{
    "title": "How Much Longer Will Apple Underperform the Nasdaq Composite?",
    "date": "2/26/2024",
    "url": "https://www.fool.com/investing/2024/02/26/how-much-longer-will-apple-underperform-the-nasdaq/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Apple (AAPL -1.06%) has long been king of the stock market. It is Warren-Buffett-led Berkshire Hathaway's largest public equity holding. And until recently, it was the most valuable company in the world. But Apple has lost its crown to Microsoft, and some even fear it will slip into third place if Nvidia keeps up its scorching-hot valuation expansion. Apple stock is down 5.3% so far in 2024 compared to a 5.1% gain in the Nasdaq Composite. Over the last year, Apple is up 18.6% compared to the Nasdaq's 33.1% gain. Apple underperformed the Nasdaq over the past year, whereas Microsoft, Nvidia, Amazon, Alphabet, and Meta Platforms have all crushed the Nasdaq. Here's why Apple is out of favor on Wall Street, and what the tech stock needs to do to regain investor optimism. Image source: Getty Images. When talking about a company as relevant and influential as Apple, it's easy to focus too much on the numbers and miss the big picture. The big picture is that Apple's bread-and-butter business, which is selling phones, computers, and other devices, is under pressure. Apple's product sales stagnated, while its services continue to put up record quarter after record quarter. The problem is that products make up over 80% of revenue and 69% of gross profit. Services include Apple TV+, Apple Music, Apple Podcasts, Apple Books, and more. The services rollout has been a major success and is a core reason why many investors continue to see Apple as a growth stock. Apple is struggling to grow its product business. If you zoom out, it's easy to see why. Each new iPhone, MacBook, etc. must justify a higher price tag. Part of that justification is new features, but another aspect is longevity. Consumers with older models have less incentive to upgrade because the older models have gotten progressively better and the next-generation device improvements are less impactful than they used to be. In other words, Apple is a victim of its own success, and it is showing in its performance. Apple has overcome marginal product improvements for some time. Apple operates a vertically integrated hardware model featuring different devices, from phones, computers, wearables, tablets, headphones, and more. But it also has a vertically integrated services model that builds upon those hardware options, like Apple Pay and iCloud. Apple is one of the best companies in the world at blending hardware and software to add value for consumers. There's no phone or laptop pairing with Amazon Prime Video. And Microsoft's devices don't hold a candle to the level of vertical integration that Apple has achieved. Plus, Apple has several brick-and-mortar stores that add a service element consumers expect if they pay top dollar for multiple devices. Apple's vertically integrated model fosters lifetime customers. Apple is having no problem keeping folks engaged within its system. Rather, the issue is that it is struggling to generate those big-ticket sales that come with new product purchases. The good news is that some of this may be due to the product upgrade cycle. Apple's sales and earnings soared during 2020 and 2021 because many consumers shifted their buying toward goods purchases rather than services. This artificially pulled future Apple product sales forward.  AAPL Revenue (TTM) data by YCharts It stands to reason that many consumers who bought new Apple products in 2020 and 2021 haven't upgraded since then. That lag factor is weighing on Apple's performance. The COVID-19-induced spike in sales is partially to blame for Apple's slowing growth. The beauty of Apple's business is that it doesn't bank on one-off transactions, but rather, keeping customers within its ecosystem and building products and services around that system to grow the lifetime spending of the buyer. The Apple Vision Pro is yet another product that could further expand this ecosystem. But it's too early to tell if it will have a measurable impact on Apple's bottom line. The glaring issue with Apple is that it has already pulled out all the stops, and yet it is still struggling to sustain a high growth rate. The vertical integration and harmony between products and services is increasing, but Apple's results just aren't delivering at the pace that investors have grown accustomed to. The short-term slowdown in Apple's performance shows its dependence on iPhone and Mac performance. We can talk about services and potential all day. But when the chips are down, this company needs to sell new phones and computers -- plain and simple. Perhaps the greatest red flag from Apple's recent report was slowing growth in China. China is Apple's second-largest market. In Q1 fiscal 2024, China made up 17.4% of total sales compared to 42.1% for the Americas and 25.4% for Europe. But China sales fell 12.9% compared to Q1 fiscal 2023. Reasons for the slowdown include pressure on Chinese consumers, a shaky Chinese real estate market, and fierce competition from Huawei's new 5G phone. China has been a key part of Apple's growth story, but it doesn't have to play the same role going forward. The iPhone saw all-time record revenue in India, South Korea, Indonesia, Latin America, Western Europe, and the Middle East. These markets could more than makeup for a slowdown in China. To quote Apple's CEO, Tim Cook, from the Q1 fiscal 2023 earnings call: Looking at the business in India, we set a quarterly revenue record and grew very strong double digits year over year. And so we feel very good about how we performed, and that was -- that's despite the headwinds that we've talked about. Taking a step back, India is hugely exciting market for us and is a major focus. We brought the online store there in 2020. We will soon bring Apple retail there. So we're putting a lot of emphasis on the market. There's been a lot done from a financing options and trade-ins to make products more affordable and give people more options to buy. And so there's a lot going on there. We are, in essence, taking what we learned in China years ago and how we scale to China and bringing that to bear. If the slowdown in China accelerates, then Apple's short-term results will suffer, and the stock could fall under pressure. But the bigger story is Apple's growth in emerging markets long term. It's ultimately better for Apple's sales to be more geographically diversified and less dependent on China. Given the uncertainty, it's understandable that investors aren't piling into Apple stock right now. But the company has so much going for it that overlooking its potential would be a grave mistake. Apple has essential qualities that make it the perfect long-term investment. Apple's greatest red flag is the lack of innovation regarding the iPhone and Mac. That flaw is exposed on the public markets right now. Apple is still a great company despite this pressing issue. What I like about Apple stock right now is that it has every reason to underperform in the short term and every reason to outperform over the long term. I could see Apple continue to underperform the Nasdaq until one of three things happens. Either the market shifts from a growth mindset to a value mindset, in which case Apple may look more attractive than more expensive than its big tech peers. Or Apple proves resilient against challenges in China and growth returns. Or China continues to grow in emerging markets and makes up for a slowdown in China that way. It's hard to get excited about Apple right now, but it has the qualities that can unlock growth for decades to come. Apple also has the cash needed to make a sizable acquisition if it needs to unlock growth that way. Apple is a sleeping giant because it has yet to make a splash in artificial intelligence, but it has the means to do so. For Apple to begin outperforming the Nasdaq, it needs to show Wall Street that it can grow at a rate deserving of a premium valuation. After all, Apple has a 28.3 price to earnings ratio. That valuation is supported by its brand and the other qualities discussed, not its growth. If growth ticks up, then that valuation will start to look much more reasonable. Fundamentals have and will continue to drive Apple stock. But even when they are lacking in the short term, investors can always fall back on the qualities discussed. For that reason, Apple is the perfect stock to buy and hold over time, as well as buy the dip when it becomes out of favor on Wall Street. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Berkshire Hathaway, Meta Platforms, and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}