{
    "title": "Apple Samsung Battle Goes To A New Level – channelnews",
    "date": "2/14/2024",
    "url": "https://www.channelnews.com.au/apples-market-share-in-korea-exceeds-25/",
    "text": "Apple saw its domestic market share for iPhones exceed 25% for the first time in 2023, in all markets of South Korea, the home of Samsung and LG. According to the Korea Herald and market research firm Counterpoint, Apple’s shares rose three percentage points on-year to reach 25% in South Korea last year, while maintaining the No. 2 spot in the Korean smartphone market behind Samsung. This has sent a scare through Samsung mobile management who are fighting to take Apple customers over to what is seen as a superior premium smartphone manufactured by Apple who still don’t have a foldable device. The data revealed that Samsung kept the No. 1 title in the smartphone market on its home turf, but its market share decreased more than 2 percentage points on-year to mark 73%. Yet, Apple has recorded a market share surpassing 30% in the October-December period and the January-March period each year when it releases a new smartphone lineup. Apple has been gaining market share in Korea by 1 percentage point annually from 2020 to 2022. Apple Store in South Korea The iPhone maker saw a threefold increase in the share figure in 2023, due to the growing popularity of iPhones among young smartphone users who favour them over the Samsung Galaxy. Preorders placed by people in their 20s for the iPhone 15 series, which was launched in October 2023, accounted for around 45%, with those in their 30s taking up about 34%. The latest iPhone 15’s first-week sales surged by 49.5% in comparison to its predecessor, the iPhone 14 series. Solid sales records were posted by Samsung’s flagship Galaxy S23 series and the new Galaxy Z Flip 5 and Fold 5 foldable smartphones which received 1.09 million units and 1.02 million units, respectively, in preorders alone. The Counterpoint Research report showed that domestic smartphone sales last year were estimated at 14 million units, down 8% from a year ago. This is attributed to the pent-up demand for the replacement of new devices, particularly among mid-priced phone users.  02 9002 5900 [email protected] Level 1, 275 Alfred Street\nNorth Sydney\nNSW 2060\nAustralia  "
}