{
    "title": "Apple reportedly facing €500m EU fine over music streaming",
    "date": "2/19/2024",
    "url": "https://www.siliconrepublic.com/business/apple-eu-fine-music-streaming-anticompetitive-spotify",
    "text": "by Leigh Mc Gowran 19 Feb 2024 Image: © nikkimeel/Stock.adobe.com Spotify issued a complaint in 2019 that claimed Apple’s App Store practices give Apple Music an unfair advantage over its rivals. The EU is planning to hit Apple with a fine of around €500m for alleged anticompetitive practices in the music streaming market, according to the Financial Times. Sources told FT that the fine relates to an antitrust investigation into whether Apple restricted its music streaming competitors from telling users about cheaper ways to subscribe to services outside of the Apple App Store. The EU fine is expected to be issued to Apple next month. The antitrust investigation was launched after Spotify issued a formal complaint to the European Commission in 2019. Spotify claimed that Apple engaged in practices such as limiting the streaming service’s communications with customers and preventing Spotify from sending emails to customers who use Apple. The company called for a level playing field for apps on the App Store and claimed that Apple gave its own music streaming service an advantage over its rivals. In January 2023, Spotify and several other organisations issued a renewed call for action in the form of a letter to the EU. This letter claimed that little had changed since the 2019 complaint and that Apple’s practices were being “enabled by the lack of decisive action by regulators”. In February 2023, the European Commission gave a preliminary view that Apple engaged in “unfair trading conditions” by conducting anti-steering obligations. The Commission said Apple’s practices restrict app developers from telling iPhone and iPad users about how to subscribe to streaming services at lower prices. The European Commission claimed that these practices are “detrimental” to music streaming customers on Apple devices as they may end up paying more and that it limits effective consumer choice. Spotify’s complaint also claimed that a 30pc fee on in-app purchases levied by Apple in the first year pushes rivals to increase  the price of premium membership above what Apple charges. However, the European Commission said last year that its investigation would not take a position on the legality of Apple’s in-app purchases practices. Find out how emerging tech trends are transforming tomorrow with our new podcast, Future Human: The Series. Listen now on Spotify, on Apple or wherever you get your podcasts. Related:\n                    streaming,             EU,             music,             iOS,             legal,             Spotify,             Apple Leigh Mc Gowran is a journalist with Silicon Republic editorial@siliconrepublic.com 1 Mar 2024 7 Mar 2024 8 Mar 2024 6 Mar 2024 30 Jan 2024 4 days ago 6 hours ago 7 hours ago 8 hours ago 9 hours ago 10 hours ago 11 hours ago 11 hours ago 12 hours ago 14 hours ago 14 hours ago 14 hours ago 15 hours ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago All content copyright 2002-2024 Silicon Republic Knowledge & Events Management Ltd. Reproduction without explicit permission is prohibited. All rights reserved.\n            Website by Square1.io "
}