{
    "title": null,
    "date": "2/9/2024",
    "url": "https://www.thebvnewspaper.com/2024/02/09/apple-musics-unethical-pay-plan-hurts-indie-artists/",
    "text": "BY: JOSEPH DEBELL, OPINION EDITOR Photo Courtesy of Wikimedia Commons Amid the media attention that arrives with the Grammy Awards, it’s important to remember that the capitalistic system through which artists get paid is still broken and unfair. While we usually talk about this “unfairness” in the context of Spotify because of its questionable and unethical business decisions, its primary competitor, Apple Music, seems to have taken a page out of Spotify’s playbook. Spatial audio, the Dolby-Atmos-supported feature on Apple Music, allows users to play popular albums with surround sound. Spatial audio takes up a substantial chunk of Apple Music’s streaming model. Music Business Worldwide reports, “In 2022, the service reported that 80% of its worldwide subscribers had used the feature.” Given how popular the feature is, it’s logical for artists to record or re-record an album in spatial audio. However, producing a record in spatial audio comes with a cost — a cost that many indie labels cannot afford. Financial Times reports that “Producing music in spatial audio costs an extra $1,000 per song, or roughly $10,000 per album, executives say. Going back and reproducing an older song with spatial audio can double the costs.” To re-record an album in spatial audio is cited as greater than $30 million — according to the Financial Times. Even for larger indie labels, such as the London-based Beggars Group. Apple Music employs this feature to benefit the sought-after and spatial audio-streamed artists while hurting artists who don’t have the resources to fund an album in spatial audio. A Financial Times article details how this punishes non-spatial-audio-streamed artists. “Apple last month told music companies that it would pay up to 10 per cent more in royalties for songs produced in spatial audio. But the tech group is not paying more money in total: rather, that extra 10 percent will come out of a fixed pot of money. As a result, songs that are not ‘spatial’ will receive less money.” The Apple Music pay plan is basically taking money away from independent labels and artists to reward the sought-after and most likely Universal Music Group-backed artists for already being able to afford recording in spatial audio. Examples of some Universal Music Group artists are Taylor Swift, Bad Bunny, Drake and Harry Styles. Many albums from those spatial sound-affording artists include dense and layered instrumentals. Therefore, utilizing spatial audio for those records is amazing. However, it’s unfair and unethical to force indie or independent artists who cannot access the same feature without jumping through hoops to compete with Universal Music Group artists. Especially when some of those experimental and independent artists — who wouldn’t be as likely to net as many streams — could have their music take off if given a fair chance to use spatial audio. debelljb22@bonaventure.edu Mike (Archer) Occhiogrosso Class of 1972 Giving up is something you never want to do in BY COLIN BISH, STAFF WRITER Photo Courtesy of Wikimedia Commons Before I begin, I want to BY: MORGAN KILGER, NEWS EDITOR Photo Courtesy of Wikimedia Commons March is National Women’s History Month. All rights reserved. Designed by Withemes Mike (Archer) Occhiogrosso Class of 1972 Giving up is something BY COLIN BISH, STAFF WRITER Photo Courtesy of Wikimedia Commons "
}