{
    "title": "Apple Sues Ex-Employee For Leaking Confidential Information About Vision \nPro To Journalists - Alphabet (N",
    "date": "3/28/2024",
    "url": "https://www.benzinga.com/news/24/03/38000043/apple-sues-ex-employee-for-leaking-confidential-information-about-vision-pro-to-journalists",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Apple Inc. AAPL has filed a lawsuit against a former employee, Andrew Aude, for allegedly leaking sensitive information about the company’s first-generation mixed-reality headset, Vision Pro and Journal app. What Happened: The lawsuit, filed in a California state court last week, accuses Aude of disclosing undisclosed details about Apple’s Journal app, the development of the VisionOS headset, and other confidential information to journalists and employees of other companies, reported The Verge. It also alleges that Aude leaked regulatory compliance strategies, employee headcounts, and other product hardware characteristics. Apple claims that Aude’s leaks were not discovered until late 2023, despite him joining the company in 2016 as an iOS engineer with access to sensitive product information. See Also: Elon Musk Reacts As TikTokers Report Random Attacks By Strangers While Walking In NYC Apple’s lawsuit references Aude’s communications with journalists, including a Wall Street Journal reporter whom Aude code-named “Homeboy.” The lawsuit states that Aude connected with the WSJ journalist over 1,400 times using an encrypted messaging app and read them a final feature list for an unannounced Apple product over the phone. The Cupertino, California-based tech giant also accused the former iOS engineer of leaking a list of finalized features for Apple's Journal app in a phone call that occurred in April 2023 to the same reporter. A story about the unreleased app's features appeared that same month in The Wall Street Journal. Subscribe to the Benzinga Tech Trends newsletter to get all the latest tech developments delivered to your inbox. The tech giant is seeking a jury trial, damages, restitution and/or disgorgement of bonuses and stock options, and “An order directing Mr. Aude not to disclose Apple's confidential and proprietary, information to third parties without its written consent.” Why It Matters: This lawsuit is the latest in a series of legal actions taken by tech giants against former employees for alleged theft of confidential information. Earlier in March, Meta Platforms Inc. filed a lawsuit against its former vice president, Dipinder Singh Khurana, for allegedly stealing confidential documents before joining a “stealth” AI cloud computing startup. Similarly, a former Alphabet Inc. engineer, Linwei Ding, was indicted for allegedly stealing AI trade secrets from Google. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Apple Poured $1B A Year Into Car Project Concocted By Steve Jobs For A Decade Before Realizing It ‘Needed To Be Put Out Of Its Misery,' Report Reveals Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo by Jimmy Jin on Unsplash © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}