{
    "title": "Tesla Stock Just Reached Its Lowest Level Since May 17 of Last Year. Should \nInvestors Be Worried?",
    "date": "3/16/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/AAPL/pressreleases/24838350/tesla-stock-just-reached-its-lowest-level-since-may-17-of-last-year-should-investors-be-worried/",
    "text": "Tesla(NASDAQ: TSLA) stock closed at $175.34 a share on March 8 -- the lowest since May 17, 2023, when Tesla closed at $173.86 per share. Tesla is down nearly 30% year to date, but it more than doubled in 2023. Even with last year's monster gain, it may surprise investors to learn that Tesla is actually lower today than it was three years ago, significantly underperforming the S&P 500 during that time period. Here's a look at where Tesla stands today, why the growth narrative is being challenged, and if the electric car stock is worth buying now. Image source: Getty Images. Most companies with exposure to China are getting hit hard right now. Tesla and Apple are the two big ones, and both stocks are down double-digit percentages this year. Electric vehicle (EV) demand has undergone a multiyear growth period but has been slow to start 2024. In the first 10 months of 2023, Tesla grew its China EV market share to 12%, but BYD takes the cake with a 27% market share. Other notable Chinese EV automakers include Li Auto, Nio, and XPeng. Tesla simply doesn't have the pricing power it used to. And now, it is in a full-blown price war. Last week, Tesla cut prices even further. Tesla is taking the competition in China seriously. To quote CEO Elon Musk from the fourth-quarter 2023 earnings call: Our observation is generally that the Chinese car companies are the most competitive car companies in the world. So, I think they will have significant success outside of China depending on what kind of tariffs or trade barriers are established. Frankly, I think if there are not trade barriers established, they will pretty much demolish most other companies in the world. Competition is heating up around the world. Legacy automakers like Toyota Motors(NYSE: TM) are having success with hybrids and are investing heavily in battery EVs. The full impact of those investments won't be felt for a few years. Virtually every major automaker has some sort of EV or hybrid program. Tesla has long depended on its first-mover advantage. Over the last few years, Tesla has experienced extraordinary growth and proven that this advantage still has value. But the first-mover advantage is starting to erode. It remains to be seen if, five years from now, Tesla will be able to stay ahead of the competition and, even more concerning, if the market will be willing to give the stock a premium valuation. Tesla's strategy centers around volume growth paired with strong margins to justify expanding manufacturing capacity. The narrative made sense when Tesla's margins were higher. But now, Tesla's trailing-12-month operating margin has fallen below 10% and is at its lowest level in over two years. The stock price, like Tesla's margins, has also retraced.  TSLA data by YCharts In its Q4 2023 investor presentation, Tesla said, \"In 2024, our vehicle volume growth rate may be notably lower than the growth rate achieved in 2023, as our teams work on the launch of the next-generation vehicle at Gigafactory Texas.\" 2023 was easier to stomach because Tesla's volume growth was incredible. But in 2024, it's looking like production growth will stall and margins could fall even further from more price cuts. 2024 is shaping up to be the first year of true decelerated growth since Tesla began mass producing the Model 3. This setup is going to put a lot of pressure on Tesla stock in the short term. Despite this pressure, Tesla's long-term investment thesis remains intact. The auto industry is cyclical, and juggling factory expansions and new product innovations on top of this inherent cyclicality is no easy task. Tesla's ability to hold its own in the face of mounting competition is the true test over the next few years. The biggest problem with Tesla isn't its slowdown but its valuation. Analyst consensus estimates for 2024 earnings are $3.05 per share and $4.16 per share in 2025. For context, Tesla earned a record high $4.31 in earnings per diluted share in 2023. At a 40.8 price-to-earnings ratio, Tesla is priced like a growth stock. It's also worth understanding that the P/E is based on Tesla's trailing 12 months of earnings, which are currently its record 2023 earnings. However, because Tesla's earnings are expected to fall this year, the P/E ratio will go up even if the stock price stays the same. Which is why Tesla has a forward P/E ratio of 55.7 -- much higher than its trailing ratio. That gives Tesla the highest forward P/E ratio of the \"Magnificent Seven\" -- even higher than Nvidia!  TSLA PE Ratio (Forward) data by YCharts Tesla no longer deserves a valuation this high. Maybe a 30 to 35 P/E ratio, and definitely a premium to the S&P 500's 27.8 P/E. But with so much competition, Tesla simply doesn't look like it has as good of a risk/potential reward compared to other faster-growing names. Tesla isn't necessarily worth selling, but there are just so many challenges right now that it could get a lot worse before it gets better. However, there is a clear way for Tesla to turn things around. It has the balance sheet to endure an industrywide downturn. It can absorb margin compression better than its peers. If a downturn gets really nasty, other companies may cut their EV spending and Tesla can take more market share. Tesla could also prove far more resilient against the competition over time. And finally, it could begin to monetize some of its long-term robotics and artificial intelligence projects, achieve a breakthrough in full autonomous driving, or undergo some other unexpected development. Right now, Tesla looks more like a hold than a buy. But if the valuation comes down or the business unexpectedly improves, then Tesla could be worth a closer look. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Tesla made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks  *Stock Advisor returns as of March 11, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, BYD, Meta Platforms, Microsoft, Nio, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Apple Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}