{
    "title": "Apple's Tim Cook, Other Foreign Executives Vow to Go On Investing in China",
    "date": "3/24/2024",
    "url": "https://www.yicaiglobal.com/news/tim-cook-other-execs-at-foreign-firms-say-they-will-keep-investing-in-china-at-cdf",
    "text": " (Yicai) March 25 -- The global executives of multinational companies attending the China Development Forum in Beijing have expressed their intentions to continuously invest in China as the country is further optimizing the business environment for overseas investors. Apple will continue investment in the Chinese market, especially in research and development, Chief Executive Officer Tim Cook told reporters before a subforum at the CDF’s annual symposium yesterday. He also said he was thrilled to be back in China. Cook arrived in China on March 20 to visit Apple’s headquarters in Shanghai and meet suppliers before the opening of the company’s second-largest store in the world in the eastern Chinese city. Apple’s Chinese suppliers have made significant contributions to carbon emission reductions, Cook noted, adding that they have not only been receptive to Apple’s goals but also welcomed such challenges. The US tech giant plans to achieve carbon neutrality by 2030. Cook also announced that Apple’s extended-reality headset Apple Vision Pro will hit the Chinese market later this year. The increasing attention China is paying to innovation and sustainable development has provided a world-class business environment for multinational corporations’ growth in the country, which makes AstraZeneca feel confident about the future, the European pharmaceutical giant’s CEO Pascal Soriot said at the CDF. AstraZeneca inked memorandums of understanding on strategic cooperation with the government of Beijing’s Daxing district and high-quality local companies during the CDF to explore the collaborative business models on vaccines, Soriot noted. The firm recently announced it would build its fifth global strategic center in Shanghai. China’s gross domestic product growth target of 5 percent is achievable, Roland Busch, president and CEO of German conglomerate Siemens, told reporters during the forum. China is not only Siemens’ largest market in terms of application of industrial technologies but also one of its most innovative frontier markets, he added. Over the past few years, China has made great accomplishments in the protection of intellectual property rights, said Albert Bourla, chairman and CEO of US pharma giant Pfizer. This will not only do good to the development of the healthcare industry but also prominently boost the overall economic growth, he added. China is building a modern industrial system supported by the advanced manufacturing sector, Zheng Shanjie, chairman of the country’s National Development and Reform Commission, said during a keynote speech at the CDF. Large new market demand, investment opportunities, and collaborative projects are emerging in China, providing mutual benefits and win-win results to various market entities, including foreign companies, he added. China will accelerate the issuance of this year’s negative list for foreign investment access to support the construction of major foreign-invested projects and expand the market admission scope of digital products, thus promoting the development, openness, circulation, and use of data, Zheng noted. If the Chinese market is more open, there will be more development opportunities for various market entities in different sectors, including foreign firms, to play a more significant role in the fields China encourages, such as industrial upgrading, urbanization, digitization, and trade-in schemes, Samantha Zhu, global vice president of Accenture and chairwoman of the US professional services company’s China business, told Yicai. Editor: Tang Shihua, Futura Costaglione "
}