{
    "title": "Apple, Meta and Google parent company investigated by EU",
    "date": "3/27/2024",
    "url": "https://au.news.yahoo.com/apple-meta-google-parent-company-115900894.html",
    "text": "Apple, Meta and Google's parent company are being investigated by the European Union under new laws designed to clamp down on the market power of the world's tech giants. The Digital Markets Act (DMA) came into force at the beginning of March and aims to tackle \"gatekeeping\" behaviour among tech giants. If the companies are found guilty of non-compliance, they face fines of up to 10% of their global turnover. Under the new rules, companies are expected to allow app developers to steer users to products outside their own platforms for no extra charge. Also, platforms that rank search results must treat all listings fairly and in a way that does not discriminate against services offered by third parties. The European Commission, the executive arm of the EU, said it was concerned that Apple and Alphabet, which owns Google, had imposed restrictions that made it difficult for developers to promote services by other companies on Google or the app store. It is looking into search results for services such as Google Shopping and Google Flights. Regulators are also considering whether Apple is allowing users to easily uninstall software applications and change default settings, browsers and search engines on its iOS operating systems. The commission's main issue with Meta, the owner of Facebook, Whatsapp and Instagram, surrounds the firm's new \"pay or consent\" subscription model for EU users, and whether this complies with its new requirement over the use of personal data. Read more:Meta and Amazon values surgeUS justice department sues Apple Thierry Breton, the EU commissioner for internal market, said the commission had been in talks with the companies for months. \"We can already see changes happening on the market,\" he said. \"But we are not convinced that the solutions by Alphabet, Apple and Meta respect their obligations for a fairer and more open digital space for European citizens and businesses. \"Should our investigation conclude that there is lack of full compliance with the DMA, gatekeepers could face heavy fines.\" The investigation is the latest in a series of clampdowns against tech giants, which are increasingly wrangling with regulators over anti-competitiveness concerns and the use of personal data, particularly in Europe. Apple was ordered to pay a bigger-than-expected fine of €1.8bn at the start of the month, after the company was accused by the commission of \"abusing its dominant position in the market\" for the distribution of music streaming apps to iOS users through its app store. A spokesperson for Apple said it was confident it was complying with the DMA and that it would engage with the European Commission in its investigation. Google, which has made significant changes to its services, said it would \"continue to defend its approach\" in the coming months. A Meta spokesperson said the company was working to comply with the EU rules. \"Subscriptions as an alternative to advertising are a well-established business model across many industries, and we designed 'subscription for no ads' to address several overlapping regulatory obligations, including the DMA,\" they said. Three million dollars sounds like the kind of money that lets you spend retirement sitting on the dock of your own boat, sipping mai tais (or coffee, if that's more of your thing). But a $3 million... A court in Minnesota has ordered MyPillow to be evicted from the warehouse it formerly used. MyPillow founder, Mike Lindell, a prominent election denier, told The Associated Press that the eviction is a formality because the landlord wants to take the property back. The Minneapolis warehouse is approximately 125,000 square feet and has been leased…  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  This update would represent Apple's first overhaul to that lineup since 2018. At 53, Guan Junling is too old to get hired at factories anymore.  Toiling in sweatshops and building apartment complexes they could never afford to live in, they played a vital role in China's transformation into an economic powerhouse.  As they grow older, the first generation of migrant workers is struggling to find jobs in a slowing economy. An expert warned these types of mergers can sometimes see customers pay more at the checkout.  ANALYSIS: The US and EU argue that Apple is abusing its power to crush competition and blight users’ experience. The iPhone maker says the proceedings threaten the company. Andrew Griffin examines what the row could mean for the technology in your pocket (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b Apple will finally launch new iPads in early May, according to Bloomberg’s Mark Gurman. Expected are a new iPad Pro with an OLED display and a faster iPad Air, including a 12.9-inch model for the first time in that lineup.  Kim Kardashian is being sued by late artist Donald Judd’s foundation over claims her minimalist office furniture was designed by Judd In this piece, we will take a look at the 25 largest automotive companies and suppliers in the world. If you want to skip our overview of the global automotive industry, then you can take a look at the 5 Largest Automotive Companies and Suppliers in the World. The global automotive industry is one of the […] (Bloomberg) -- This year’s crypto rally has been so strong that a software maker, largely viewed as a Bitcoin hedge fund of sorts, now has a stock market capitalization that’s higher than nearly half of the companies in the S&P 500 Index. Most Read from BloombergBankman-Fried Is Sentenced to 25 Years in Prison Over FTX CollapseTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineDubai Is Losing Its Allure for Wealthy RussiansLondon Insurers Face Baltimore Bridge Payouts Worth Bill  In this article, we will take a look at the top 15 3D printing companies in the US. If you want to skip our detailed analysis, you can go directly to Top 5 3D Printing Companies in the US. Recent Trends in 3D Printing According to a report by Grand View Research, the global 3D […] Early retirement sounds like a dream come true, but it's not all rainbows and roses for most people. Find Out: I Retired at 65: Here's My Monthly BudgetLearn More: 7 Unusual Ways To Make Extra Money... (Bloomberg) -- Oil scored a 16% quarterly gain in the latest sign that export curbs by OPEC and its allies are reining in global supplies.Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentWest Texas Intermediate  The SA government has unveiled a package to help winemakers return to China's huge market with the lifting of punitive tariffs. Making wise financial plans for retirement is essential if you want to enjoy your golden years without having to worry about making ends meet. Be Aware: Cutting Expenses in Retirement: 6 Stores To... If you're thinking about retirement, even if it's still quite a ways away, it's important to start planning. One way to do this is to look at your paycheck and see if there are new or more ways to...  If you want to enjoy your retirement and not have to stress about working into your 70s, it's essential to sidestep the pitfalls that loom during your working years. Ill-advised decisions can shrink... The IRS allows workers to put aside pre-tax earnings in traditional Individual Retirement Accounts, 401(k) and similar workplace accounts, and for all the money to grow – tax-deferred – to give you cash for retirement. But the national tax collector only waits so long to collect, and once you turn 73, the law forces retirees […] The post I Turn 73 This Year. How Do I Avoid RMD Taxes? appeared first on SmartReads by SmartAsset. This food habit is linked to a specific type of dementia. "
}