{
    "title": "VisionPoint Advisory Group LLC Boosts Holdings in Apple Inc. (NASDAQ:AAPL)",
    "date": "3/17/2024",
    "url": "https://www.defenseworld.net/2024/03/17/visionpoint-advisory-group-llc-boosts-holdings-in-apple-inc-nasdaqaapl.html",
    "text": "Posted by Defense World Staff on Mar 17th, 2024 VisionPoint Advisory Group LLC grew its position in shares of  Apple Inc. (NASDAQ:AAPL – Free Report) by 123.8% during the third quarter, HoldingsChannel reports. The firm owned 12,517 shares of the iPhone maker’s stock after buying an additional 6,923 shares during the period. Apple accounts for approximately  0.9% of VisionPoint Advisory Group LLC’s holdings, making the stock its 24th largest holding. VisionPoint Advisory Group LLC’s holdings in Apple were worth $2,143,000 at the end of the most recent reporting period. A number of other hedge funds also recently made changes to their positions in the company. Vanguard Group Inc. raised its stake in shares of  Apple by 0.7% during the first quarter. Vanguard Group Inc. now owns 1,269,995,750 shares of the iPhone maker’s stock valued at $221,753,959,000 after purchasing an additional 8,734,393 shares during the period.  State Street Corp increased its stake in shares of  Apple by 0.5% in the second quarter. State Street Corp now owns 578,897,858 shares of the iPhone maker’s stock worth $112,288,818,000 after buying an additional 2,616,084 shares during the last quarter.  Moneta Group Investment Advisors LLC increased its stake in shares of  Apple by 116,483.5% in the fourth quarter. Moneta Group Investment Advisors LLC now owns 569,554,722 shares of the iPhone maker’s stock worth $74,002,245,000 after buying an additional 569,066,184 shares during the last quarter.  Geode Capital Management LLC increased its stake in shares of  Apple by 2.2% in the second quarter. Geode Capital Management LLC now owns 291,538,165 shares of the iPhone maker’s stock worth $56,396,763,000 after buying an additional 6,367,053 shares during the last quarter.  Finally, Price T Rowe Associates Inc. MD increased its stake in shares of  Apple by 3.4% in the first quarter. Price T Rowe Associates Inc. MD now owns 234,017,381 shares of the iPhone maker’s stock worth $38,589,468,000 after buying an additional 7,736,013 shares during the last quarter. Hedge funds and other institutional investors own  58.51% of the company’s stock. A number of brokerages recently issued reports on AAPL. Piper Sandler dropped their price target on shares of Apple from $205.00 to $190.00 and set a “neutral” rating for the company in a research note on Friday, February 2nd. Monness Crespi & Hardt lifted their price target on shares of Apple from $189.00 to $200.00 and gave the stock a “buy” rating in a research note on Friday, February 2nd. The Goldman Sachs Group lifted their price target on shares of Apple from $223.00 to $232.00 and gave the stock a “buy” rating in a research note on Friday, February 2nd. Bank of America upgraded shares of Apple from a “neutral” rating to a “buy” rating and boosted their target price for the company from $208.00 to $225.00 in a research note on Thursday, January 18th. Finally, Citigroup  reiterated a “buy” rating and set a $225.00 target price on shares of Apple in a research note on Friday, February 16th. One research analyst  has rated the stock with a sell rating, eleven have issued  a hold rating, twenty-one have given a buy rating and one  has assigned  a strong buy rating to the stock. Based on data from MarketBeat.com, the company  has a consensus rating of “Moderate Buy” and an average price target of $205.27. Read Our Latest Report on Apple In other news, Director Arthur D. Levinson sold 100,000 shares of the company’s stock in a transaction dated Thursday, February 29th. The stock was sold at an average price of $180.94, for a total value of $18,094,000.00. Following the transaction, the director now owns 4,434,576 shares in the company, valued at approximately $802,392,181.44. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through the SEC website. 0.06% of the stock is owned by corporate insiders. NASDAQ AAPL opened at $172.62 on Friday. The stock’s 50-day moving average price is $183.39 and its two-hundred day moving average price is $183.34. The company has a current ratio of 1.07, a quick ratio of 1.02 and a debt-to-equity ratio of 1.28. The company has a market cap of $2.67 trillion, a PE ratio of 26.89, a PEG ratio of 2.06 and a beta of 1.29. Apple Inc. has a 1 year low of $151.64 and a 1 year high of $199.62. Apple (NASDAQ:AAPL – Get Free Report) last posted its quarterly earnings data on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share (EPS) for the quarter, topping the consensus estimate of $2.09 by $0.09. The firm had revenue of $119.60 billion for the quarter, compared to the consensus estimate of $117.99 billion. Apple had a return on equity of 156.04% and a net margin of 26.16%. The business’s revenue for the quarter was up 2.1% compared to the same quarter last year. During the same quarter in the previous year, the company earned $1.88 EPS.  On average, analysts predict that  Apple Inc. will post 6.55 EPS for the current year. The business also recently disclosed a quarterly dividend, which was paid on Thursday, February 15th. Shareholders of record on Monday, February 12th were issued a dividend of $0.24 per share. The ex-dividend date  was Friday, February 9th. This represents a $0.96 annualized dividend and a yield of 0.56%. Apple’s payout ratio is presently 14.95%. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Brown & Brown, Inc. (NYSE:BRO) Shares Acquired by Czech National Bank David R. Rahn & Associates Inc. Sells 3,070 Shares of Apple Inc. (NASDAQ:AAPL) "
}