{
    "title": "Stock Breaking News: Nvidia, BYD, Apple AI, and Alphabet",
    "date": "3/19/2024",
    "url": "https://www.baystreet.ca/stockstowatch/17445/Stock-Breaking-News-Nvidia-BYD-Apple-AI-and-Alphabet",
    "text": " Nvidia’s (NVDA) AI hardware announcement is the only thing that interests tech enthusiasts the most. Investors in the automotive will take note of the firm’s expanded collaboration with BYD and other Chinese automakers. BYD will use Nvidia’s next generation of Drive Thor chips. This raises the level of autonomous driving in their vehicles. BYD overtook Tesla (TSLA) as the world’s biggest electric vehicle manufacturer. This deal with Nvidia would widen its technological lead. Naysayers who doubted Apple’s (AAPL) positioning in AI may embrace its rumored deal with Alphabet. The firm is in discussions to include Google’s AI model, Gemini, in its iPhones. AAPL and GOOG stock soared in response yesterday. Google must win this partnership. If it fails to, Apple would include Microsoft (MSFT) ChatGPT, named CoPilot, in the devices. That would lead to Bing search replacing Google in Apple’s browser. Apple would save billions in development costs either way. It evaluated the use of an internally created large language model, dubbed Ajax.Apple’s potential vote of confidence might undo the negative publicity around Gemini. When users asked Google AI to create images of people, its users accused the firm of racial bias and historical inaccuracies. Investors should not count Microsoft out. It invested heavily in its ChatGPT and AI image creation. Winning the iPhone user base would undermine Google’s dominance. Copyright 1998 - 2024 Baystreet.ca Media Corp. All rights reserved. Nasdaq Stocks: Information delayed 15 minutes. Non-Nasdaq Stocks: Information delayed 20 minutes. Bid and Ask quotation information for NYSE and AMEX securities is only available on a real time basis. Market Data is provided by QuoteMedia.com. Earnings by Zacks. Analyst Ratings by Zacks "
}