{
    "title": "Currys shares sign-up warning ahead of new Apple MacBook Air sale",
    "date": "3/7/2024",
    "url": "https://www.mirror.co.uk/tech/currys-new-macbook-air-sale-32293369",
    "text": "Apple fans will be able to buy the newest MacBook Air model from Currys too, as the retailer launches sign up page for eager buyers Earlier this week Apple unveiled its MacBook Air range with new 13-inch and 15-inch models fitted with a much speedier M3 processor. This upgrade offers a whopping 60% performance boost over the original M1 version as well as improving battery life and Wi-Fi speeds. As eager fans await its official sale date, Currys has confirmed it will sell the swanky new device. The new devices are currently available to pre-order from the Apple Store, where you can pick from several memory models and two different screen sizes. Pre-ordering has become a popular way to guarantee getting hands-on with new tech launches amid increased demand. Want to know more? Read our full MacBook Air review here. Apple deals on MacBook models: And ahead of tomorrow's Friday, March 8 sale date when the new devices will be available to buy on UK shelves, Currys has confirmed that it will stock the new devices. A teaser on its site says: \"Lean. Mean. M3 Machine. \"MacBook Air sails through work and play — and the M3 chip brings even greater capabilities and advanced AI features to this super‑portable laptop. With up to 18 hours of battery life, you can blaze through whatever you’re into all day long.\" By clicking on the 'Coming Soon' button keen shoppers will be taken to a sign-up page to register their interest. On the page, you can enter all of your details to hear about the latest Apple news, so as soon as the new range of MacBook Air M3 is listed for sale you'll be able to head straight to the checkout. And here's how much it'll cost. The 256GB M3 MacBook Air costs the lowest £1,099 price, next up is the 512GB device at £1,299, while there is also an upgraded model of the 512GB device with a bigger 16GB of Unified Memory which costs £1,499. READ MORE: Apple 2024 launches: New MacBook Air M3, hints at new iPhone 15 colourway and iPad upgrades READ MORE: Currys cuts £500 off Samsung TVs but rival deal will get you Galaxy Watch 5Pro for free As with any new tech launch, we're now seeing huge price drops on the older MacBook models, both the older M2 MacBook Air and the rival MacBook Pro. So, it's a good chance for eager fans to grab onto an existing deal, and we've highlighted our favourites below. Save £129 on the 15-inch MacBook Air M2 over at Very - BUY HERE Although still pricey, John Lewis has taken a huge £530 off the 2023 MacBook Pro M2 processor model which its reduced from £2,699 to £2,169. This bigger model comes with a 14-inch screen, 16GB of RAM, and a huge 1TB of storage, and it's one of the cheapest prices we've seen. Retailer Very also has money-off models including 15-inch M2 Macbook Air. Over at Very you'll save £129 on the model as the online retailers drops the price from £1,399 down to its current £1,270. "
}