{
    "title": "Apple tests new AI capabilities to boost $7bn advertising business",
    "date": "3/12/2024",
    "url": "https://www.warc.com/content/feed/apple-tests-new-ai-capabilities-to-boost-7bn-advertising-business/en-GB/9263",
    "text": "Read daily effectiveness insights and the latest marketing news, curated by WARC’s editors. You didn’t return any results. Please clear your filters. Reports suggest that Apple will emulate some of Google’s advertiser-focused AI efforts by testing new tools to help customers buy App Store ads – as the iPhone-maker seeks to prove it has the AI chops to keep up with its big tech rivals while also underscoring its seriousness about the business opportunity from advertising. Apple is a big-deal brand, but it now also has its eye on becoming a big-deal advertising destination by boosting the targeting capabilities of its quietly successful App Store advertising products (this year it is expected to make $7bn from ads alone). Its ambitions are bigger and its increasing media properties – from its News, Maps, and Stocks apps to its Apple TV+ product featuring the Messi-hosting MLS – offer extensive opportunities it is now exploring. With content to advertise around, and an extensive user base, it’s likely that an automated targeting product will unlock value across its properties. Apple is testing a tool, according to a report by Business Insider, to help a select group of advertisers automate the placement of ads on Apple’s App Store. An enhanced ad placement system would build on the already considerable (but quiet) advertising business that Apple has established selling search ads in the App Store experience. Sources familiar with the testing tell BI that they expect the company to announce the product officially in the next few months. The new product is said to be similar to tools like Google’s Performance Max and Meta’s Advantage+, both of which use machine learning to optimise campaigns. Two placements are available: Advertisers can then automate placements based on the budget, cost-per-acquisition target, audiences and territories they enter. The news comes as Apple will be keen to attach the term AI to anything investors hear about the company. It follows recent questions about the company’s plans in the space and Apple’s own ambition to “break new ground” with AI this year. It will be aware of the emerging shape of advertising in 2024: non-endemic players developing huge advertising businesses, while artificial intelligence techniques are helping ad businesses like Meta to make up shortfalls in their targeting capabilities. Sourced from Business Insider, TechCrunch and WARC Send colleagues a link to this content.\r\n                        To send to more than one recipient, put a comma between email addresses. Welcome back to WARC! We’ve made some exciting changes since your last visit, bringing you: © 2024 Copyright and Database Rights owned by Ascential Events (Europe) Limited "
}