{
    "title": "Apple Has Spent $175 Billion on R&D Since the Start of 2013 -- but It's the \n$651 Billion Spent on Something Else That's ...",
    "date": "3/8/2024",
    "url": "https://www.fool.com/investing/2024/03/08/apple-spent-175-billion-rd-since-2013-651-billion/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Although it's been surpassed by Microsoft as the largest publicly traded company by market cap, few tech giants have delivered for investors quite like Apple (AAPL -1.06%). Despite its ebbs and flows, shares of Apple have scurried higher by 790% over the trailing-10-year period and have skyrocketed by almost 132,000% since its initial public offering in December 1980. Investors who simply purchased shares of Apple and did nothing else have historically done pretty well. While there's a laundry list of catalysts that have lifted Apple's valuation over time, the company's success ultimately boils down to two factors: innovation and a surprising \"investment\" that's been highly beneficial to its shareholders. Image source: Getty Images. To become one of the largest publicly traded companies, a business will generally have to grow at a sustained high rate and remain on the cutting edge of the innovation curve within its respective sector or industry. Peering back through more than 11 years of annual and quarterly filings, it's clear that Apple and its management team, led by CEO Tim Cook, aren't afraid to invest for the future. Research and development (R&D) expenses have grown every year since the start of 2013 and total just over $175 billion through the end of the fiscal first quarter of 2024 (Dec. 30, 2023): Some of these growing R&D expenses are undoubtedly directed at keeping the company in the lead in the smartphone arena. Since Apple integrated 5G wireless technology into its flagship iPhone during the fourth quarter of 2020, it's seen its domestic market share in smartphones surge above 50%. Consumers tend to be exceptionally loyal to Apple's physical products, which include iPhone, Mac, iPad, and Apple Watch, among other accessories. However, Apple's R&D spending goes beyond the physical products that brought the company fame. For years, Tim Cook has been overseeing the evolution of Apple's operations. Although it's still producing and improving its popular physical products, Apple is aiming to be a platforms company that's ultimately driven by subscriptions. The advantage of the company's services focus is threefold: What's even more eye-popping than the $175.19 billion Apple has spent on R&D since the beginning of 2013 is its \"investment\" that's nearly quadrupled R&D in size over the same period. Image source: Getty Images. With Apple generating boatloads of operating cash flow, it has the ability to take chances that most companies can't match. It can also reward shareholders in a way that no other business can. On a nominal-dollar basis, Apple's dividend is one of the largest in the world. Last year, the company doled out just a hair over $15 billion to its shareholders as a dividend. But its share repurchase program is many multiples larger. Since initiating a share buyback program in 2013, Apple has overseen the repurchase of $650.88 billion worth of its common stock, which is tops among publicly traded companies: The beauty of share buybacks is twofold. To start with, a declining share count incrementally increases the ownership stakes of existing investors.  AAPL Shares Outstanding data by YCharts. But the second and arguably more important catalyst is that stock repurchases can increase a company's earnings per share (EPS). Businesses with steady or growing net income will see their EPS grow over time as their outstanding share count declines. This can make a company's stock appear more attractive to fundamentally focused investors. As an example, Apple's net income declined from $99.8 billion in fiscal 2022 (Apple's fiscal year ends in late September) to roughly $97 billion in fiscal 2023. But thanks to Apple spending $77.55 billion on buybacks last year, which retired more than 513 million shares, the company's adjusted EPS actually increased by $0.02 to $6.13 per share in 2023, despite the $2.8 billion drop in net income. Since the start of 2013, Apple has repurchased nearly 11 billion shares of common stock, or roughly 41% of its outstanding shares. While buybacks have played a key role in lifting Apple's share price over the past 11 years and change, Wall Street and investors are likely eager to see one of the world's largest tech companies reignite its growth engine after it stalled out in 2023. But as long as Apple continues to aggressively put its money to work via buybacks, it's reasonable to expect modest EPS expansion. Sean Williams has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}