{
    "title": "Proposed class action lawsuit accuses Apple of monopolizing cloud storage \nfor its devices",
    "date": "3/3/2024",
    "url": "https://finance.yahoo.com/news/proposed-class-action-lawsuit-accuses-apple-of-monopolizing-cloud-storage-for-its-devices-190822242.html",
    "text": "A class action complaint filed against Apple on Friday in the northern California court has accused the company of creating unfair conditions to ensure iCloud remains the dominant cloud storage choice for its devices, according to Bloomberg Law. By placing “surgical technological restraints” on the types of files other cloud providers can host, Apple has made it so only iCloud can offer Apple device users full-service storage, the complaint argues. According to the complaint, this has also allowed Apple to charge higher fees in the absence of “any real threat to iCloud’s dominance.” The proposed class, represented by Hagens Berman, would cover tens of millions of customers in the US, Bloomberg Law notes. While iPhone and iPad users do have the option to store certain types of files with non-Apple cloud storage providers, there are some things — including app data and device settings — that only iCloud has permission to host. This leaves users to choose either the “unattractive” option of juggling multiple cloud storage accounts to fully cover their backup needs, or iCloud’s full-service convenience. The complaint argues that Apple’s restrictions are arbitrary and work to stifle competition. Apple “does not dominate because it built a superior cloud-storage product,” the complaint states. “From a security and functionality standpoint, iCloud is no better (and often inferior) to other cloud storage platforms. Instead, Apple has achieved market dominance by rigging the competitive playing field so that only iCloud can win.” The case was only just filed and hasn’t yet been granted class action status, but anyone who thinks they may be eligible to get in on it can fill out a form on the Hagens Berman website to find out more information. "
}