{
    "title": "Morgan Stanley sees AAPL earnings as clearing event to refocus investors",
    "date": "1/24/2024",
    "url": "https://appleinsider.com/articles/24/01/24/morgan-stanley-sees-aapl-earnings-as-clearing-event-to-refocus-investors",
    "text": "Copyright © 2024, Quiller Media, Inc. Contact Us | Privacy Policy An Apple Store sign Investment bank Morgan Stanley says Apple's forthcoming earnings call will be \"a clearing event,\" that stops short term concerns and gets investors looking at the company's signs of future growth.\r  Ahead of Apple's holiday quarter earnings report on February 1, 2024, Morgan Stanley has maintained its $220 price target, but continues to expect growth overall in the longer term.\r\"[Near-term] Product demand remains uneven, while Services is outperforming,\" says Morgan Stanley, \"which we believe will result in a healthy December quarter beat, but March quarter guide down.\"\rMorgan Stanley analysts now forecast around $119 billion revenue for the December 2023 quarter, which is 1% to 2% ahead of the market's consensus. For the March 2024 quarter, however, it predicts revenue of $93.4 billion, which is between 0% and 3% below consensus.\rThe analysts believe that the FY24 consensus is too high, but that therefore, \"we see earnings next Thursday as a \"clearing event\" that will help to 1) reset NTM [Next Twelve Months] estimates lower and 2) allow investors to turn their attention towards what we believe will be a positive inflection in fundamentals in FY25...\"\rFor 2025, Morgan Stanley believes growth will be \"driven by an underappreciated Edge AI refresh cycle... and sustained gross margin and Services strength. \r\"We believe Apple's business model is shifting from maximizing unit growth to maximizing installed base monetization,\" say the analysts, \"with 1) installed base growth, and 2) spend per user (Product/ Services) the two most important metrics underlying this shift.\"\r Installed base of iPhone useres (Source: Morgan Stanley) \"We'd argue this shift [to a more positive market expectation' has already begun,\" continue the analysts, \"as Apple shares have outperformed the market by 5 points in the last 5 trading days, and sit just 2% off their all-time highs. Ahead of Apple's holiday quarter earnings report on February 1, 2024, Morgan Stanley has maintained its $220 price target, but continues to expect growth overall in the longer term. \"[Near-term] Product demand remains uneven, while Services is outperforming,\" says Morgan Stanley, \"which we believe will result in a healthy December quarter beat, but March quarter guide down.\" Morgan Stanley analysts now forecast around $119 billion revenue for the December 2023 quarter, which is 1% to 2% ahead of the market's consensus. For the March 2024 quarter, however, it predicts revenue of $93.4 billion, which is between 0% and 3% below consensus. The analysts believe that the FY24 consensus is too high, but that therefore, \"we see earnings next Thursday as a \"clearing event\" that will help to 1) reset NTM [Next Twelve Months] estimates lower and 2) allow investors to turn their attention towards what we believe will be a positive inflection in fundamentals in FY25...\" For 2025, Morgan Stanley believes growth will be \"driven by an underappreciated Edge AI refresh cycle... and sustained gross margin and Services strength. \"We believe Apple's business model is shifting from maximizing unit growth to maximizing installed base monetization,\" say the analysts, \"with 1) installed base growth, and 2) spend per user (Product/ Services) the two most important metrics underlying this shift.\" \"We'd argue this shift [to a more positive market expectation' has already begun,\" continue the analysts, \"as Apple shares have outperformed the market by 5 points in the last 5 trading days, and sit just 2% off their all-time highs. William Gallagher has 30 years of experience between the BBC and AppleInsider discussing Apple technology. Outside of AppleInsider, he's best known for writing Doctor Who radio dramas for BBC/Big Finish, and is the De... One thing I haven’t seen mentioned much is the potential upside from iPad updates in the last weeks of the current quarter. This is the longest Apple has ever gone without an iPad update, and the current user base is probably the largest it’s ever been, so the pent up demand could be significant. I know I’ll be getting one ASAP. I don’t have any inside knowledge of the timing of the next update, but I’m hoping for and expecting an early/mid-March announcement and a mid/late-March release. One thing I haven’t seen mentioned much is the potential upside from iPad updates in the last weeks of the current quarter. This is the longest Apple has ever gone without an iPad update, and the current user base is probably the largest it’s ever been, so the pent up demand could be significant. I know I’ll be getting one ASAP. I don’t have any inside knowledge of the timing of the next update, but I’m hoping for and expecting an early/mid-March announcement and a mid/late-March release. $93.4B for Q2 would be VERY poor results.   It would be mean Apple showing, yet again, another Y/Y decline, albeit small.  FY24 was suppose to be the year of turning the corner - not FY25 It is hard to see how he mathematically even gets to $93B.  Especially given probability of new iPad and Mac releases hitting 2H of March and $400-$500M of Vision Pro revenue.   Something has to materially turn negative  - either iPhone or Services growth evaporates I think Wall Street would hate this result and narrative $93.4B for Q2 would be VERY poor results.   It would be mean Apple showing, yet again, another Y/Y decline, albeit small.  FY24 was suppose to be the year of turning the corner - not FY25 It is hard to see how he mathematically even gets to $93B.  Especially given probability of new iPad and Mac releases hitting 2H of March and $400-$500M of Vision Pro revenue.   Something has to materially turn negative  - either iPhone or Services growth evaporates I think Wall Street would hate this result and narrative Apple will be holding WWDC 2024 from June 10, showing off its future operating system updates and maybe even new hardware. This is what has been rumored so far. Time Machine is Apple's backup system that automatically saves your Mac's files. Here's how to use the macOS file protection feature. Sponsored Content As streaming becomes more unreliable, having a backup copy is becoming a greater priority, leaving more internet users turning to a YouTube video downloader for various reasons. We checked out the 4K Video Downloader app on Mac to learn how to download YouTube videos for free. Canada's complex car theft ring, which often involves stealing and shipping expensive cars and SUVs around the world, just got even creepier thanks to AirTag. We now have a date for WWDC 2024, we have perhaps more idea than ever of just what it will cover, and we have ever increasing rumors of a smart Apple Ring. All we need now is the release of new iPads. B&H has dropped MacBook Pro prices further as March comes to a close. Pick up an M3 MacBook Pro with 16GB RAM for just $1,549 — or opt for the M3 Pro MacBook Pro 14-inch for $1,699. Both are record-breaking deals. Fake iPhones, AirPods and iPhone cases were among counterfeit goods seized in police raids in Northern Ireland. A photograph of cases intended for the iPhone 16 indicates at least one accessory producer is leaning in on rumors of a new vertical camera arrangement in the new models. With the earliest possible trial date start likely in late 2026, analysts are generally nonplussed by the Department of Justice omnibus antitrust suit and are telling investors to stick with Apple. Aiming to show that its carbon reduction efforts are not mere \"climate-washing,\" Apple has spotlighted how its Restore Fund is contributing to the restoration of a Brazilian rainforest, and attempts to save over 3,000 types of tree from extinction. Investment firm Evercore says Apple is facing weakening demand and strong competition from AI rivals, but investors should stick with it for the long term.  "
}