{
    "title": "RIVN Stock Alert: Rivian Nabs Second Apple Exec",
    "date": "1/29/2024",
    "url": "https://investorplace.com/2024/01/rivn-stock-alert-rivian-nabs-second-apple-exec/",
    "text": " Cloud Czars are retreating from the car company and Rivian is snapping some up. Advertisement Source: Roschetzky Photography / Shutterstock.com Rivian Automotive‘s (NASDAQ:RIVN) stock is benefitting from delays in the Apple (NASDAQ:AAPL) Car. D.J. Novotney, still listed on LinkedIn as vice president-engineering at Apple, will become senior vice president of vehicle programs at Rivian, reporting to CEO RJ Scaringe. Rivian stock is up 4% in early trading this morning after rising 1% over the weekend. Its market capitalization is about $14.5 billion. In a memo released as he left, Novotney said, “Apple has been my life.” He worked on a variety of products at the company, including the iPod, iPhone, iPad, and Watch. Novotney is the second Apple Car executive this month to leave for Rivian, a start-up with ties to Amazon (NASDAQ:AMZN). Earlier, Jonas Reinke, who had been with Apple for four years, joined Rivian as vice president of product management. Reinke will now work on Rivian’s in-car software. Rivian bought a Swedish route-planning company, Iternio, last year. The executive moves may say more about Apple than Rivian. The Apple Car was originally expected to be released this year. Then, it was 2026. Now, that date has recently been moved back to 2028. Apple is the second Cloud Czar to move away from the auto sector. Alphabet (NASDAQ:GOOGL, NASDAQ:GOOG) went through three layoffs at its Waymo division last year. The movement toward self-driving cars has taken numerous hits lately. Accidents have led to General Motors’ (NYSE:GM) Cruise unit being investigated by several federal agencies. Rivian is best known for its high-end R1T truck and 100,000-unit Amazon delivery van contract. Scaringe said last week he is trying to expand the product line. The company is focusing that effort on a Georgia factory that is due for completion in 2026. Drivers should keep both hands on the wheel. Investors might want to keep both hands in their pockets as the electric vehicle (EV) shakeout continues. When you’re shedding Cloud Czars from a market, hard times are ahead. As of this writing, Dana Blankenhorn had LONG positions in AMZN, GOOGL, and AAPL. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Dana Blankenhorn has been a financial and technology journalist since 1978. He is the author of Technology’s Big Bang: Yesterday, Today and Tomorrow with Moore’s Law, available at the Amazon Kindle store. Tweet him at @danablankenhorn, connect with him on  Mastodon or subscribe to his Substack. Consumer Discretionary, Automotive, Electric Vehicles Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/rivn-stock-alert-rivian-nabs-second-apple-exec/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}