{
    "title": "Apple to Shutter 121-Person San Diego AI Team in Reorganization",
    "date": "1/13/2024",
    "url": "https://finance.yahoo.com/news/apple-shutter-121-person-san-040305007.html",
    "text": "(Bloomberg) -- Apple Inc. is shutting a 121-person team related to artificial intelligence operations in San Diego, leaving many employees at risk of termination, according to people familiar with the matter. Most Read from Bloomberg Blinken Stranded After Boeing 737 Breaks Down on Davos Trip Stocks Drop as Solid Data Fuel Fed-Pivot Repricing: Markets Wrap Apple to Sell Watches Without Oxygen Feature After Legal Setback JPMorgan Says Hacker Attempts Have Increased This Year Dimon Says China Risk-Reward Equation Has ‘Changed Dramatically’ The group, known as Data Operations Annotations, was told Wednesday that they would be relocating to Austin to merge with the Texas portion of the same team, said the people, who asked not to be identified because the plans haven’t been announced. Apple told employees that they have until the end of February to decide if they will relocate, according to the people. If they don’t, the workers will be terminated on April 26. The group, which also has offices in China, India, Ireland and Spain, is responsible for improving Siri by listening to queries to the voice service and determining if it heard and handled questions accurately. The announcement to close the San Diego group was made by Christine DeFilippo, a top deputy to Apple AI chief John Giannandrea, the people said. An Apple spokeswoman confirmed the relocation decision, saying the company is bringing its “Data Operations Annotations teams in the US together at our campus in Austin, where a majority of the team is already based.” She added that “everyone currently employed will have the opportunity to continue their role with Apple in Austin.” The company also said it’s “deeply committed to San Diego,” where it has “grown significantly,” and that it is continuing to hire as Apple expands its engineering teams. In other countries where the affected team operates, Apple keeps all the employees in one office. For the San Diego staff, the move came as a surprise. The AI team had been working from an office that Apple is renting, according to the people. But the company had told staff recently that they would be relocated to a new Apple campus in the area at the end of January. Earlier this month, Apple distributed packing boxes to employees to prepare for a relocation within the city. Instead, they’ll now have to move to Texas. People familiar with the matter told Bloomberg that the majority of affected workers have indicated that they’re unwilling to relocate to Austin. Apple told employees that they could apply for other jobs, but some don’t think they’ll be eligible for many roles because they don’t have engineering backgrounds, the people said. The San Diego employees focused on Siri use in Hebrew, English, multiple dialects of Spanish, Portuguese, Arabic and French. The move has the potential to result in several dozen workers leaving the company. Apple, which had 161,000 employees as of September, has mostly managed to avoid layoffs since the pandemic — in contrast with most of its tech peers. It did, however, cut some corporate retail jobs last April, as well as recruiters. Employees who are willing to relocate to Austin by the end of June will be able keep their roles, Apple said. The company is offering $7,000 relocation stipends. Those who choose to leave Apple will see their roles eliminated and get four weeks of severance — plus an additional week for every year worked. They’ll also get six months of health insurance. The team has a notable history within Apple. Years ago, the group was mostly made up of contractors who listened to Siri queries to ensure their accuracy. That practice raised privacy concerns and was made optional for customers in 2019. The contractors ended up being fired and replaced with full-time employees. A small number of employees in the group have begun assisting Apple with a move to AI products based on large language models, or LLMs. These employees are now reviewing potential queries to Siri and choosing among a handful of answers. They then have to explain their decision. Apple is planning to announce its LLM plans in June, Bloomberg News has reported. Most Read from Bloomberg Businessweek Japan’s Market Roars Back to Life—With Old-Timers Leading the Way Elon Moves Further Right; Hertz Ditches Tesla There’s a Toxic Employee—and the CEO Is Ignoring the Issue Chinese Tycoon on the Rebound After $10 Billion Debt Deal ©2024 Bloomberg L.P. Related Quotes "
}