{
    "title": "Apple’s second-user smartphone business is booming",
    "date": "1/23/2024",
    "url": "https://www.computerworld.com/article/3712520/apples-second-user-smartphone-business-is-booming.html",
    "text": "By Jonny Evans, \n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\nComputerworld\n| Appleholic, (noun), æp·əl-hɑl·ɪk: An imaginative person who thinks about what Apple is doing, why and where it is going. Delivering popular Apple-related news, advice and entertainment since 1999. The used smartphone market is booming, with around 309.4 million units sold in 2023, according to IDC. (That's up almost 10% on the preceding year.) While most of this market comprises consumers trying to get the best smartphone they can for the money they’ve got, there is a lesson for enterprise professionals — and another for Apple itself. Digging into the smartphone data a little, IDC expects the market for used smartphones to continue to grow at a compound annual growth rate (CAGR) of 8.8%, reaching 431.1 million units in 2027. Combine the new (1.3 billion) and used smartphone markets for 2023 and around one in five smartphones sold was a second user device. No surprises who leads in this market. “Although we do not break out vendors in our forecast, Apple and Samsung are the two most popular, as you can imagine,” IDC analyst and report author Anthony Scarsella said in an interview. “We believe the business segment remains small (but growing), as most of the demand is from consumers.” On the basis of previous reports, it’s reasonable to believe Apple actually dominates the second-user market. After all, that in part is what drove Apple to introduce its long-awaited Stolen Device Protection feature in iOS 17.3 this week and why Counterpoint in 2023 claimed 49% of second-user smartphones sold worldwide are iPhones. CCS Insights claims Apple holds 82% of that market. Whatever the actual figure, Apple is popular. One reason this side of the market isn’t growing faster is a lack of devices as we all now hang onto our phones longer. Demand for used smartphones has outstripped supply for some time, and most inventory is coming in via take-back and recycling schemes, IDC said. “Refresh rates for new phones in most developed markets have extended past 40 months, which has caused a shortage of available inventory for the secondary market,” the research firm explained. “With refresh rates extending in most mature markets, acquiring inventory remains the biggest challenge for resellers,” said Scarsella. “Secondary phone retailers are hungry for inventory as the high end of the market continues to be scarce due to customers just holding on to their devices. This lengthening can also be witnessed in the new market where shipments declined 3.5% for 2023.\" We all know the smartphone industry has skewed toward the high end over the last couple of years. Among other reasons for consumers to gravitate toward Pro Max iPhones is a desire to get the best device available so it remains useful for longer. Apple has helped here, as making devices that remain good to use for longer is part of what makes its products so appealing. These changing habits are also changing what employees expect from IT. Sure, they still want the best, and don’t want to be forced to use slow, useless devices for work. But they are more prepared to continue using systems that do actually work for longer. For smartphones, at least, this will likely translate into lengthier replacement cycles in. Rather than upgrading devices every two years, most enterprises managing large Apple smartphone fleets will shift to three- or perhaps four-year cycles. Why would they not? But this won’t stop at smartphones. It’s going to happen to (some) PCs. Well, it is happening to Macs. Apocryphally, I’ve heard that many IT leaders managing larger Mac fleets have been astonished at Apple Silicon because even three years later those first generation M1 machines remain capable of handling anything thrown at them, even while the annual macOS refresh means those older Macs still feel like new. In a pyrrhic victory for Apple, this likely also means business and consumer users will use their Macs for longer. They already do this to some extent, which is why Macs have always held a lot of value on the second user markets. So, the lesson here is that despite what may seem higher initial cost, the TCO advantage of Mac ownership as described by IBM, Cisco, and Forrester doesn’t just remain in place, it is actually improving. Apple has crafted this position. A few years ago, as it recognized the need to make its devices more resilient, it invested in growing its services business to generate more predictable revenue. It also began working toward circular manufacturing processes and made public statements to the effect that it wanted us to use our iPhones for longer. But Apple seems to be leaving a little money on the table. All those second-user devices come from somewhere. Some likely come from Apple, including older inventory, recycled, or returned devices. Apple also sells these directly via its Refurbished store online — but it could generate even more business at relatively low risk and low cost by simply extending its existing iPhone Upgrade Program to include second user devices. The existing scheme could become the Upgrade Plus program, offering state-of-the art devices. The standard scheme might provide older devices for a lower subscription fee (including Apple Care). In the current consumer business environment, this should be popular and would help Apple grab a bigger slice of the buoyant second-user market — even as sales of new devices decline. There really has never been a better time for Apple as a Service; the market is ripe for transformation. And not just for iPhone. Please follow me on Mastodon, or join me in the AppleHolic’s bar & grill and Apple Discussions groups on MeWe. Jonny is a freelance writer who has been writing (mainly about Apple and technology) since 1999. Copyright © 2024 IDG Communications, Inc. Copyright © 2024 IDG Communications, Inc. "
}