{
    "title": "China cracks Apple AirDrop security to identify users who share \ninappropriate data using it",
    "date": "1/9/2024",
    "url": "https://www.indiatoday.in/technology/news/story/china-cracks-apple-airdrop-security-to-identify-users-who-share-inappropriate-data-using-it-2486549-2024-01-09",
    "text": "Listen to Story A Chinese organization, supported by the government, has found a way to break through the security of Apple's AirDrop, according to a report by Bloomberg. This means that authorities can now figure out who is sharing content they don't like using this wireless feature. AirDrop is a service from Apple that lets you easily send files between nearby Macs and iPhones using Wi-Fi and Bluetooth. Even though Apple says AirDrop is secure with encryption, the Beijing Municipal Bureau of Justice claims they've found a way around that. They say they looked at logs from iPhones to figure out who sent what over AirDrop. They call this method a \"technological breakthrough\" and say it has helped them identify people who are using AirDrop to share illegal stuff. The Bureau of Justice says that by doing this, they can solve cases more quickly and accurately and stop inappropriate content from spreading. It's not clear if any government agency used this security flaw before. But this isn't the first time AirDrop had a problem. In April 2021, German researchers found an issue, and even though they told Apple about it in May 2019, Apple didn't fix it. “It improves the efficiency and accuracy of case-solving and prevents the spread of inappropriate remarks as well as potential bad influences,” the bureau said. Apple made changes to how AirDrop works in China in November 2022 because some people were using it to share political messages against the government. Now, by default, AirDrop only works with people in your contacts, and if you want to let everyone use AirDrop, you can only do that for 10 minutes. Later, when Apple released iOS 16.2 worldwide, they expanded these changes globally. Apple said this was to reduce unwanted content being sent in busy places like malls and airports. The news about AirDrop being cracked in China is a big deal because it questions Apple's promise that this wireless transfer method is safe. This situation highlights the ongoing challenges in keeping digital systems secure and how authorities are adapting to handle potential threats in the online world.Published By: Ankita GargPublished On: Jan 9, 2024 "
}