{
    "title": null,
    "date": "1/22/2024",
    "url": "https://news.yahoo.com/tech/vision-pro-demand-may-quickly-190736578.html",
    "text": "Apple's Vision Pro became available for pre-order on Friday. Shipping times slipped from February to March, but one analyst is unsure if demand will last. Ming-Chi Kuo believes the Vision Pro is \"still a very niche product\" for now. Apple fans scooped up enough Vision Pro headsets to push back delivery times for new orders, but one analyst isn't so sure the initial hype will last. The Apple Vision Pro headset became available for preorder on Friday, and shipping times quickly extended from early February to March. Ming-Chi Kuo, an analyst at TF International Securities who specializes in Apple's supply chain, estimated Apple sold between 160,000 and 180,000 units during the Vision Pro's preorder weekend. But launch supply was always expected to be fairly limited, and Kuo noted in a blog post that after shipping times slipped in the first couple of hours, those delivery times largely remained consistent for the rest of the weekend — which could mean the flurry of initial orders isn't snowballing into massive demand. \"It indicates that demand may quickly taper off after the core fans and heavy users place their orders,\" Kuo wrote. Kuo said the Vision Pro is \"still a very niche product.\" By his math, selling out during the preorder weekend was possible if only a fraction of a percent — 0.007% to be specific — of Apple's 1.2 billion active users decided to spend nearly the $3,500-plus for the gadget. Meanwhile, the more budget-conscious have other, far cheaper, headsets on the market to choose from, such as the $500 Quest 3 launched by Meta in October. If Kuo's estimate is correct and Apple sold 160,000 to 180,000 Vision Pro units over the weekend, the company has generated at least $560 to $630 million in revenue so far. To help put that more into perspective, Apple said it sold around 270,000 iPhones in the first 30 hours when the device launched back in 2007 with a starting price of $499. More than 15 years later, Apple sells hundreds of millions of iPhones a year, bringing in more than $200 billion in annual revenue from the device. If you're on the fence about spending $3,500 for a headset, you can always sign up to test out the Vision Pro at your local Apple store starting February 2. And with an employee assisting you through the demo, you won't have to worry about any accidental damage. Read the original article on Business Insider "
}