{
    "title": "Apple tops India smartphone revenue in 2023, nears $10 bn mark | Mint",
    "date": "1/31/2024",
    "url": "https://www.livemint.com/technology/apple-tops-india-smartphone-revenue-in-2023-nears-10-bn-mark-11706708396436.html",
    "text": "iPhone-maker Apple marked 2023 as the first year when it topped the smartphone market revenue chart in India, said a report by market researcher Counterpoint India on Wednesday. Two industry officials who consult multiple smartphone brands said that Apple’s India revenue from iPhones fell just short of the $10 billion mark, but was enough to topple Korean electronics brand Samsung’s long-duration stronghold on being the leader in terms of revenue from smartphone sales in India. Apple’s record smartphone revenue comes in a year of continued lack of enthusiasm among consumers towards smartphones. Counterpoint’s report said that shipments of smartphones in India remained flat through 2023 at 152 million units. Apple, in comparison, shipped more than 10 million iPhones for the first time, growing at over 50% year-on-year (YoY). Mint had reported on 30 October that Apple had led India’s smartphone market by revenue in the first half of 2023, and after strong festive period sales, was on track to top the smartphone market revenue by approaching the $10 billion mark in 2023. “Apple continues to see strong consumer demand, and is likely to maintain a strong double-digit shipment growth in CY24 as well. In comparison, the overall smartphone market could see a small 5% YoY growth through this calendar year—although much of this will depend on how global macroeconomic conditions play out through the rest of this year,\" said Tarun Pathak, research director at Counterpoint. This market share for Apple comes off the back of multiple consecutive quarterly revenue records from its iPhone sales in India. On 4 November, Mint reported that Apple, in its September quarter earnings, disclosed its sixth consecutive quarterly revenue record—with its volume-wise market share crossing 6% for the very first time. Pathak said that Apple is likely to be the sixth most popular brand in India, with a 6.6% market share in terms of shipments at the end of 2023. Interestingly, Apple is projected to have pipped Samsung for the top spot in terms of revenue with almost one-third of Samsung’s total shipment volume—while Apple is said to have shipped just over 10 million iPhones last year, Samsung shipped over 27.3 million to capture 18% of the market. However, Apple’s average selling price (ASP) is 3x that of market leader Samsung—in comparison to a $950 ( ₹78,000) per-device price for Apple, Samsung’s ASP is around $350 ( ₹29,000). Samsung, on its part, is also pushing for more premium devices in the market. However, Pathak said that Samsung’s bulk market share in the sub- ₹20,000 budget price ranges has considerably declined, which has contributed to Apple overtaking it in terms of annual revenue. The rise of demand for iPhones in India is likely to continue in the short-term, as multiple financing options, bank-linked discounts and strong resale programmes offered by organized refurbished smartphone sellers are boosting sales of premium smartphones in India. Industry experts expect this growth to sustain for three calendar years, before Apple’s double-digit growth tapers off. Navkendar Singh, associate vice-president at market researcher IDC India, told Mint in October last year that due to its high ASP, Apple is likely to hit a glass ceiling—beyond which it may struggle to continue selling incrementally higher iPhones every year in a value-conscious market. The iPhone, however, has been more significant for India than just consumer-end sales. A 21 January report by industry body, India Cellular and Electronics Association (ICEA) said exports of Apple’s made-in-India iPhones crossed $7 billion in value at the end of December 2023—contributing nearly 70% of all mobile phone exports, and around 35% of all electronics exports from India at the end of last year. On Tuesday, the Centre further slashed import duty on mobile phone spare parts from 15% to 10%—a move that experts said could further boost the local smartphone component ecosystem. Such moves may further generate increased value addition for India’s assembly ecosystem, which would gain from more localized device assembling going forward. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}