{
    "title": "Perspective | Apple's no-good week was great for the company and bad for you",
    "date": "1/18/2024",
    "url": "https://www.washingtonpost.com/technology/2024/01/18/apple-watch-ban-app-store/",
    "text": "This article is a preview of The Tech Friend newsletter. Sign up here to get it in your inbox every Tuesday and Friday. One reason so many people love Apple’s products is that they’re high quality and the company mostly deserves your trust. This week, though, Apple displayed its worst instincts for jerking you around for the company’s gain. Apple was on the wrong end of two fights that the company picked — over a supposed “ban” on the latest Apple watches and over its control of the apps on your iPhone. But Apple came out of the messes with more attention, more power and probably more money. You lost. Here’s what this week’s Apple developments mean for you: Masimo, a medical technology company, has been saying for years that the Apple Watch ripped off Masimo’s technology to measure blood-oxygen levels. Masimo asked courts to stop what it said was Apple’s theft. Facing what could have been a ban on Apple Watch sales in the United States, Apple briefly paused selling new models right before Christmas. Apple has said it disagreed with the court decision and is appealing it. This week, a court ordered Apple to stop selling watch devices as long as they infringed on Masimo’s patented technology. To comply, Apple, starting Thursday, disabled the blood-oxygen feature in new Apple Watch devices. Straight talk: There was no chance that Apple would have stopped selling the Apple Watch. No matter what courts ruled, Apple had the fallback option to remove the blood-oxygen feature. And that’s what the company did. The crummy part for you is that Apple encouraged the “will-they-or-won’t-they” idea of a potential ban on the Apple Watch. That was confusing for people who were considering buying an Apple Watch over the Christmas holiday, and it generated the kind of publicity for Apple that’s hard to buy. The fight with Masimo did not do anything useful for you. Apple essentially goaded Masimo into a legal fight, generated attention for itself and defended to the hilt a smartwatch feature that most people wouldn’t use regularly. Ask yourself, why does a smartwatch need to have a blood oxygen sensor? It’s a niche health feature that can be useful, but unnecessary for most of us to have on a wrist 24/7. You can buy a separate blood oxygen checker, also called a pulse oximeter, to use as needed. I own a Walgreens model that was recently selling online for about $35. Apple also this week announced changes to how it handles your purchases from apps after the U.S. Supreme Court declined to intervene in a 2021 legal ruling that went partly against Apple. And again, Apple turned the lemon into lemonade for itself. The company gave itself more control over purchases that you make from iPhone apps. Buying stuff from iPhone apps will probably get more confusing and maybe more expensive. For the first time, Apple is now required by law to let apps point you to their websites to buy a digital news subscription, an e-book or another digital purchase. But Apple imposed onerous conditions. For example, if you click a web link in Peloton’s iPhone app and buy a digital fitness subscription from Peloton’s website with your credit card, Apple now says it’s entitled to a 27 percent cut of what you spent. Apple will keep collecting a chunk of your Peloton subscription fee forever — all because you followed a link from an iPhone app once. Apple also said it would need to look at Peloton’s subscriber records regularly to make sure Peloton isn’t welching on what it owes Apple. Apple and Google already are app dictators and collect fees when you buy most digital products in apps. But never before has Apple given itself domain over what you buy anywhere on the internet with your own credit card. It’s a good bet that some companies will raise their prices for digital purchases to offset Apple’s commissions. (Some companies already charge higher prices for digital purchases made in their apps compared with the company’s website. Apple hasn’t let companies tell you about lower prices available online.) [Buying stuff in apps is broken. Try this instead.] Some app makers are furious over Apple’s power grab. John Gruber, a longtime technology blogger who often sides with Apple, wrote that the company’s move “reeks of greed and avarice” and risks angering regulators and politicians. Apple’s app changes show the company is trying to position itself to blunt a new law in Europe intended to loosen Apple and Google’s power over apps. Regulators could force Apple to water down the app changes it announced this week. But for now, Apple twice lost legal fights this week — and still came out ahead at your expense. "
}