{
    "title": "Midday Movers: Moderna Rises After an Upgrade, While Apple Falls Following \nDowngrade",
    "date": "1/2/2024",
    "url": "https://www.investopedia.com/midday-movers-moderna-rises-after-an-upgrade-while-apple-falls-following-downgrade-8421249",
    "text": " Bill McColl has 25+ years of experience as a senior producer and writer for TV, radio, and digital media leading teams of anchors, reporters, and editors in creating news broadcasts, covering some of the most notable news stories of the time. NurPhoto / Contributor / Getty Images U.S. equities began the first day of trading in 2024 mixed at midday, amid concerns over tech exports to China and naval military action in the Middle East. The Dow rose slightly, while the S&P 500 and Nasdaq slid. Shares of Advanced Micro Devices (AMD) and other semiconductor firms fell after the Dutch government curbed exports of some chipmaking equipment by ASML Holding N.V. (ASML) to China. Apple (AAPL) shares also slumped after Barclays downgraded the stock and cut the price target, pointing to concerns about iPhone demand and the company’s overall hardware sales. Shares of Norwegian Cruise Line Holdings (NCLH) and rival cruise lines dropped as naval military action in the Middle East region raised worries about sea travel. Moderna (MRNA) shares soared as CEO Stephane Bancel indicated the vaccine maker expects sales to grow in 2025, and as Oppenheimer analysts upgraded the stock, saying its mRNA technique used in COVID-19 vaccines could be used to fight other diseases over the next few years. An upgrade and price target increase from Wells Fargo sent Centene (CNC) shares higher. Tapestry (TPR) shares increased when JP Morgan raised the price target, arguing earnings growth for the owner of Coach and Kate Spade brands will accelerate. Oil futures gave up early gains and sank. The price of gold moved up and the yield on the U.S. Treasury note jumped. The U.S. dollar climbed versus the euro, pound, and yen. The 2023 cryptocurrency rally continued, with most major digital coins trading higher. TradingView "
}