{
    "title": null,
    "date": "2/9/2024",
    "url": "https://finance.yahoo.com/news/apple-settling-chip-secrets-theft-213740421.html",
    "text": "(Bloomberg) -- Apple Inc. said it’s reached an agreement that potentially settles its 2022 lawsuit accusing startup Rivos Inc. of poaching engineers to steal trade secrets. Most Read from Bloomberg Japan Loses Its Spot as World's Third-Largest Economy as It Slips Into Recession Putin Steps Into US Race to Back ‘Old-Style’ Biden Over Trump Israel Quits Ceasefire Talks Over ‘Delusional’ Hamas Demands Trump Eyes NATO Makeover, Hurried Peace in Ukraine If Elected The Brutal Reality of Plunging Office Values Is Here In a joint court filing Friday, the companies told a judge they’re aiming to finalize an accord that resolves their claims against each other by March 15. “The agreement provides for remediation of Apple confidential information based on a forensic examination of Rivos systems and other activities,” according to the filing in federal court in San Jose, California. “The parties currently are working through that process.” Read More: Apple Eyes Detente With Startup It Accused of ‘Stealth’ Theft The dispute started when Apple sued former employees who went to Rivos, accusing them of working with the “stealth-mode” startup to take proprietary information about chip designs that make iPhones more powerful — which the tech giant said cost it billions of dollars to develop. Rivos in September fired back at Apple for allegedly using illegal measures to intimidate employees “who might dare to leave.” Representatives for Apple and Rivos didn’t immediately respond to requests for comment. The case is Apple Inc. v. Rivos Inc., 22-cv-2637, U.S. District Court, Northern District of California (San Jose). Most Read from Bloomberg Businessweek ‘Playing God’: This Labor Activist’s Relentless Emails Force Companies to Change What’s Really Behind Tesla’s Slowdown The US Will Face Blowback in the Middle East, No Matter What It’s Not Love Generating Those Dating Reality Shows. It’s Money Adobe’s Very Cautious Gambit to Inject AI Into Everything ©2024 Bloomberg L.P. Related Quotes "
}