{
    "title": "Apple ditches its car plans: Three things it should focus on now",
    "date": "2/28/2024",
    "url": "https://finance.yahoo.com/video/apple-ditches-car-plans-three-153105278.html",
    "text": "Apple (AAPL) is scrapping its plans to build an electric car, according to a report from Bloomberg. The tech giant is reportedly moving many of the team members working on the car project to a team focused on artificial intelligence instead. Yahoo Finance Tech Editor Dan Howley says that generative AI is one of the three things Apple should spend its time and money on now. Watch the video above to find out what the other two are. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Stephanie Mikulich. BRAD SMITH: Apple's long-rumored entry into the EV space has reportedly been scrapped, according to Bloomberg. The tech giant and its electric vehicle division, that it spent a decade of time building billions of dollars and put over 2,000 workers on, is being sunset or at least reallocated. So, what should the company with almost $40 billion in operating cash flow be spending its money on now? We've got our very own Dan Howley here with more. So Dan, where should they put this money to work? DANIEL HOWLEY: They should give it to me, and that's the end of the segment and I'll seal it. BRAD SMITH: Done. DANIEL HOWLEY: No. So they should-- there's a few things here, right? And I think, you know, obviously, the car idea was pretty pie in the sky, I think, for a lot of people. Apple getting into the car business would have been massive, but you've seen the struggles that Tesla has obviously gone through, Rivian and the like. And so, with EV sales kind of falling off, it makes sense. So, the three things that I think they should start to focus more on is, obviously, innovating more on the iPhone. This is something that they're going to have to continue to ride as their primary device. It's still the one that gets everybody in stores. And then there's the add-ons that get people to stick around, the Apple Watch, the AirPods, all of those things. The other is, obviously, and this is something that was in the report, generative AI. Generative AI is not the end-all, be-all panacea for all tech's problems, but it is a way that they can innovate for themselves, perhaps provide better services, a better experience on the iPhone. We don't know what that's going to look like yet, though Tim Cook did say that they are looking closely at generative AI and investing there. And the other is growing their services business. Right now services is a bright spot for them. Whenever you buy AppleCare, whenever you sign up for Apple TV+, Apple Music+-- I'm on Spotify-- it is something that feeds into that area. And so they can continue to build that out. They're working with sports, obviously, with MLS. We'll see if they can expand their MLB partnership. Maybe they'll start showing the Mets because YouTube TV canceled SNY, which I have a bone to pick with Google about. But I think that's really where they need to focus. I mean, look, the iPhone is a great device, but how many people are stoked every year that it comes out? It's the hype gets less and less and less. BRAD SMITH: It's more begrudgingly that you have to actually update your iPhone because-- DANIEL HOWLEY: It's less. Yeah, it's no longer like, man, I can't wait to get it. It's like, oh, a new one's coming out. Cool. What is this one do? I'll hold off for two years. BRAD SMITH: Yeah. SEANA SMITH: Dan, I think the question, though, for analysts, at least, is now that they are not any longer spending money on the EV business, they're reallocating those funds, what does that, though, tell us about potential competition and Apple's ability then to compete with the companies that are very much viewed as the leader within the AI space? DANIEL HOWLEY: Well, I think, look, obviously, it's Microsoft, it's Google, Meta, Amazon. Amazon doesn't advertise their AI as much, but I mean, they've been in this space for quite a while with AWS. But I think, you know, Apple with their huge chest of treasure, otherwise known as a treasure chest, they'll be able to go ahead and hire the right people and start working this out in a way that brings some form of generative AI to everybody's iPhones, iPads, Macs, you know, what have you. What it looks like though, I think, is still up in the air. We've seen Google and Samsung roll out some features for smartphones. It's largely with photos. There's some where you can change the tone of your text messages. BRAD SMITH: Right. DANIEL HOWLEY: That's not a killer app to me. It's also not really important. So I think, you know, it remains to be seen where that is. And I think we talk so much about generative AI, but I think that's part of the problem, is we don't-- ChatGPT blew everyone away. BRAD SMITH: Right. DANIEL HOWLEY: OK, cool. What are you going to do now? What's going to be the product that gets me to want to buy a new iPhone because of generative AI? I haven't seen anyone really do that yet. Related Quotes "
}