{
    "title": "Apple’s AI startup shopping spree outpaces Google and Meta",
    "date": "2/11/2024",
    "url": "https://indianexpress.com/article/technology/artificial-intelligence/apple-2023-ai-acquisitions-outpace-google-meta-9155872/",
    "text": "Apple has long been quietly acquiring artificial intelligence startups to bolster its AI capabilities across its products and services. This strategy continued strongly in 2023, with Apple purchasing up to 32 AI companies last year according to estimates from Stocklytics which sourced their data from a Statista report. This figure puts Apple well ahead of other major tech giants in terms of AI startup acquisitions. Google acquired 21 AI startups in 2023, Facebook-owner Meta purchased 18, while Microsoft trailed with 17 acquisitions according to the report. Commenting on Apple’s acquisition strategy, Stocklytics financial analyst Edith Reads said: “In the ongoing AI arms race, Apple is making sizeable deals with many AI startups, putting it in a good spot for future tech developments even as its competitors, Microsoft and Google, make considerable investments in already established AI companies.” She added: “By acquiring promising AI startups, Apple gains access to top-tier talent and innovative technologies and consolidates its foothold in crucial AI domains, ensuring a competitive edge in the rapidly evolving tech landscape.” Apple has so far remained fairly quiet about how it plans to utilise the AI technology and expertise gained through its acquisition strategy. However, the approach reflects a multi-pronged push to advance Apple’s AI capabilities through talent acquisition, technology integration and intellectual property expansion. Some of Apple’s notable AI startup purchases over the past few years include Voysis, WaveOne, Emotient, Laserlike and more. Voysis, acquired in 2020, specialised in voice assistants that can understand natural language. This technology likely helped advance Apple’s own Siri virtual assistant. WaveOne, purchased in March 2023, developed video compression tech that could find its way into Apple products like iPhones and Apple Watches. Other acquisitions focused on expression recognition, app recommendations and music AI. An interesting aspect of Apple’s strategy is its focus on early-stage startups. This suggests the company is aiming to identify and invest in emerging AI trends before competitors, the report points out. It remains to be seen exactly how Apple will implement these startup technologies into its consumer products. Competitors like Samsung and Google have rapidly developed their own AI capabilities in recent years, with highly advanced AI features in smartphones like the Galaxy S24 Ultra. However, Apple’s huge lead in AI startup acquisitions over the past 6 years points to ambitious plans for its future devices and services. While exact figures are hard to confirm due to Apple’s secretive approach, analysts estimate the company has been acquiring startups at a rapid pace of 2-3 per week in recent years. Apple rarely comments on reasons for specific acquisitions. But its relentless pursuit of promising young AI startups demonstrates that Apple aims to lead the AI race in the years ahead, even as competitors like Google and Microsoft snap up more established AI companies and technologies.  Delhi Chief Minister Arvind Kejriwal's uncle, Girdhar Lal Bansal, speaks about his nephew's rise to power and his recent arrest. Locals in Kejriwal's ancestral village express disappointment with his lack of visits and the AAP's failure to make an impact in Haryana.    "
}