{
    "title": "Apple has been buying AI startups faster than Google, Facebook, likely to \nshakeup global AI soon",
    "date": "2/12/2024",
    "url": "https://www.firstpost.com/tech/apple-has-been-buying-ai-startups-faster-than-google-facebook-likely-to-shakeup-global-ai-soon-13716542.html",
    "text": "Apple has been buying several AI companies, beating Google and Meta. Estimates suggest that the tech giant acquired up to 32 AI companies during the year. This is a strategic effort to identify and invest in emerging AI trends ahead of competitors Apple’s strategic pursuit of artificial intelligence (AI) excellence through a flurry of startup acquisitions surged in 2023, with estimates suggesting the tech giant acquired up to 32 AI companies during the year. This aggressive approach places Apple significantly ahead of its major rivals in the AI arena, including Google, Meta, and Microsoft. According to insights from Stocklytics, which referenced data from a Statista report, Apple’s acquisition spree underscores its commitment to bolstering AI capabilities across its diverse product portfolio. Financial analyst Edith Reads highlighted Apple’s proactive stance in the AI arms race, positioning the company favourably for future technological advancements. “By forging significant deals with numerous AI startups, Apple is strategically positioning itself for forthcoming tech innovations, even as competitors like Microsoft and Google make substantial investments in established AI enterprises,” remarked Reads. She emphasized that Apple’s acquisitions provide access to top-tier talent and cutting-edge technologies, consolidating its presence in critical AI domains and ensuring a competitive edge in the swiftly evolving tech landscape. Although Apple has remained tight-lipped about its specific plans for integrating acquired AI expertise and technology, its acquisition strategy reflects a comprehensive approach encompassing talent acquisition, technology integration, and intellectual property expansion. In recent years, Apple has completed notable acquisitions of AI startups such as Voysis, WaveOne, Emotient, and Laserlike. For instance, the purchase of Voysis in 2020, renowned for its voice assistant capabilities, likely contributed to advancements in Apple’s Siri virtual assistant. WaveOne, acquired in March 2023, specialized in video compression technology, potentially enhancing Apple products like iPhones and Apple Watches. Other acquisitions focused on areas like expression recognition, app recommendations, and music AI. Apple’s emphasis on early-stage startups indicates a strategic effort to identify and invest in emerging AI trends ahead of competitors, positioning the company at the forefront of AI innovation. While Apple’s plans for implementing these technologies into consumer products remain undisclosed, competitors like Samsung and Google have showcased advanced AI features in their smartphones, such as the Galaxy S24 Ultra. Despite Apple’s secretive nature, analysts estimate a rapid pace of startup acquisitions, averaging 2-3 per week in recent years. This relentless pursuit underscores Apple’s ambition to lead the AI race in the coming years, even as competitors vie for dominance through acquisitions of established AI companies and technologies. (With inputs from agencies) Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}