{
    "title": "Apple says don't put wet phone in rice. We asked Samsung - here's what they \nsaid",
    "date": "2/23/2024",
    "url": "https://au.finance.yahoo.com/apple-says-dont-put-wet-phone-in-rice-we-asked-samsung---heres-what-they-said-060120634.html",
    "text": "A popular hack for saving your water-logged phone was debunked by Apple this week, but there’s a billion Samsung users out there and this is what the tech giant thinks. \"I wouldn't recommend putting a wet phone in dry rice,” Samsung Australia’s Nathan Rigger told Yahoo Finance. Some of Samsung’s smart phone offerings are water resistant and Rigger said your approach should depend on that. Do you have a story to tell? Contact yahoo.finance.au@yahooinc.com If a water-resistant device is exposed to liquid, follow these instructions: Wipe with a soft, clean cloth to dry thoroughly. Do not connect the charger or accessories until the product is completely dry. Connecting the charger or accessories while the external connection jack is not completely dry may damage the product. If the microphone, speaker or receiver is not completely dry, the quality of voice calls or audio may be affected. Pay rises revealed: The Aussie jobs getting the most (and the least) The day that feels ‘infinitely better’ to take off than Friday ANZ among 6 banks upping interest rates. Experts warn they won't come down If a product that is not water resistant is exposed liquid, try this: Quickly remove the SIM, SD card, etc. from the product. Dry with a dry towel and visit Samsung Electronics Service Centre. If it is difficult to visit the prompt service centre, please dry it in a well-ventilated, low-light place with a cool breeze. Even after drying moisture may remain inside the product, so do not turn it on, and have it checked by a service centre as soon as possible. Apple warned users this week that if they put an iPhone in a bag of rice they are actually at risk of creating more problems. “Doing so could allow small particles of rice to damage your iPhone,\" the company said. It also recommended against using a cord to charge the phone (wireless is OK) if you’ve received the ‘liquid detected’ alert on your screen. Unplug the phone from its power adapter. Gently tap the phone against your hand, with the charging port facing down to let excess liquid drain from the device. Leave the iPhone in a dry area with airflow. After 30 minutes, you can try to reconnect the device to a power adapter. An alert will indicate if liquid remains in the phone. It can take up to 24 hours to completely dry out DO NOT: Try to dry with external heat source or compressed air, like a hair dryer or insert cotton swabs to try to absorb liquid. Follow Yahoo Finance on Facebook, LinkedIn, Instagram and Twitter, and subscribe to our free daily newsletter. This food habit is linked to a specific type of dementia. Abby Hensel officially tied the knot in 2021, it has been revealed Trade 24 hours a day on the world's most popular platform. The dreaded pest also displaces wildlife and can blind pets. Find out more. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Harry Enten ran the numbers on Trump's dismal fundraising so far. 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. Benny Larkin and daughter Taylor Larkin, 14, were boating down Dora Creek, New South Wales, Australia, when they broke down and were approached by a fuming kayaker. Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” King Edward VIII’s proposal to Wallis Simpson marked a constitutional crisis in Britain almost 90 years ago MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president. The not-so-happy campers were stunned by the unexpected guest at their beachside campsite.  The concerned shopper raised the alarm with staff at the store. Now, a 'full product inspection' is underway. The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. The person who wrote on the road has been called a \"top bloke\" by motorists.  King Charles and Queen Camilla will sit apart from the main congregation at St. George’s Chapel’s Easter service \"I mean, is there no depth to which he will not descend?\" asked Andrew Weissmann. ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says  Jacqui Lambie has responded after Senator Tammy Tyrrell announced she was leaving the Jacqui Lambie Network to sit as an independent. ‘Once I saw the payment screen, I would have called and cancelled my RSVP’ Footage shows Dylan Edwards moved out of the way. Find out more here. "
}