{
    "title": "What to Expect at Apple's Annual Meeting",
    "date": "2/26/2024",
    "url": "https://www.morningstar.com/sustainable-investing/what-expect-apples-annual-meeting",
    "text": "A look at the 8 proposals under consideration at the unofficial proxy-voting season kickoff. The annual meeting for Apple AAPL informally kicks off the proxy-voting season. If Apple’s proxy is any indication, expect investors to be looking closely at artificial intelligence, pay equity, and compensation. Apple’s proxy contains eight proposals. Three are from management, asking investors to elect Apple’s directors, to ratify its accounting firm appointment, and to approve executive compensation. You can read the Apple proxy here. You might expect some pushback on Apple’s high compensation. Morningstar Sustainalytics rates Apple as an “outperformer” on corporate governance, yet notes: “The long service of all members of the remuneration committee together with Apple CEO Timothy Cook’s long tenure may raise concerns over the committee’s ability to independently fulfill its role in the oversight of executive compensation.” This year, investors will focus more heavily on compensation, particularly after a Delaware court voided Tesla CEO Elon Musk’s large pay package, predicts Jackie Cook, director of Morningstar Sustainalytics’ Stewardship Services team. The remaining five proposals are from shareholders. Apple advises investors to vote against the proposal, claiming the report is extremely broad and could hurt its competitive position by forcing it to disclose strategic plans. The proposal is important because of the rapid adoption of generative AI technologies across workplaces, says Cook of Morningstar Sustainalytics. “Cybersecurity risk is amplified by AI technologies,” says Cook, who notes that new SEC cybersecurity risk disclosure rules specifically ask for reporting on board oversight. Apple recommends that shareholders vote against the proposal, asserting that “we already have a comprehensive approach to promoting pay equity and diverse representation at every level of the company” and that it has achieved different kinds of pay equity. The proposal could receive strong support, says Morningstar Sustainalytics’ Cook. Last year, shareholders at Nike NKE and Oracle ORCL asked both companies for gender and racial pay-gap reporting. These proposals earned majority support from independent shareholders, meaning nonfamily and noninsider shareholders. The three proposals are “anti-ESG,” which are typically opposed to sustainability measures by companies. Often, these proposals “look very similar” to pro-sustainability ballot items, says Morningstar’s Cook. Such proposals, however, get low support. In 2023, support ranged between 1% and 4%. “Most investors recognize that so-called ‘anti-ESG’ proponents—individuals and opaquely funded grassroots organizations—do not share their vision for sustainable business and have become suspicious of their motives,” Cook added. “While the resolution itself may seem reasonable, the proponent’s supporting statement may contain subtle, or not-so-subtle, attacks on companies’ sustainability efforts.” Lindsey Stewart, Morningstar’s director of investment stewardship research, adds, “Investors need to be careful, read the resolution properly, read the supporting statement properly, and find out the proponents.” The author or authors do not own shares in any securities mentioned in this article.\n\n\t\t\t\t\t\tFind out about Morningstar’s editorial policies. Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}