{
    "title": "Apple 'Missed Their Big Opportunity To Invest In Tesla,' Says Ross Gerber: \n'About Time They Throw In The",
    "date": "2/27/2024",
    "url": "https://www.benzinga.com/news/24/02/37354950/apple-missed-their-big-opportunity-to-invest-in-tesla-says-ross-gerber-says-about-time-they-throw-in",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Renowned investment figure, Ross Gerber has commented on Apple Inc‘s AAPL decision to halt its electric vehicle (EV) development, shifting its focus onto Artificial Intelligence (AI). What Happened: Ross Gerber, the CEO of Gerber Kawasaki Wealth and Investment Management took to social media platform X on Wednesday to share his thoughts on Apple’s recent move. Gerber expressed his relief at Apple finally admitting defeat in the EV race, while Ives acknowledged the changed landscape of the EV industry. Gerber opined on X that Apple had “missed their big opportunity to invest in Tesla…” He further stated, “About time they throw in the towel on this mess.” Apple has reportedly put the brakes on its EV project, codenamed Titan, and informed nearly 2,000 employees working on the project about this decision. The company plans to reassign many of these employees to its generative AI division, with layoffs expected but the exact number of affected workers still unclear. The decision to abandon the project was reportedly finalized internally among top executives in recent weeks, following ongoing pressure from the company’s board. See Also: Elon Musk Responds After Bakery Owner Says Tesla Ordered 4,000 Mini Pies And Then Cancelled The Order Without Paying, Causing $16K Loss Why It Matters: Despite several leadership and strategy changes, the project has faced repeated delays due to development issues. Last month, Apple reportedly shifted to a less ambitious design for its EV, similar to Tesla’s offerings. However, the project has now been scrapped entirely. However, with the decision to abandon the EV project, dubbed Titan, Apple is now focusing its efforts on generative AI. Given Gerber’s recent bet on whether Apple’s Vision Pros would outperform Tesla’s Cybertrucks, the recent developments have certainly added a new twist to the tale. Moreover, CNBC’s Jim Cramer suggested that Alphabet should also follow Apple’s lead and cut projects that are no longer effective. Cramer cited Apple’s recent decision to cancel its electric car project as an example of “embracing efficiency.” Read Next: Carvana Stock Trades Like ‘An AI Darling,’ Short Seller Says: But ‘Paint Will Eventually Peel Off’ Photo via Shutterstock Engineered by Benzinga Neuro, Edited by \nKaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}