{
    "title": "Ex-Apple engineer sentenced to 4 months in prison. Here's why",
    "date": "2/10/2024",
    "url": "https://www.hindustantimes.com/technology/exapple-engineer-sentenced-to-4-months-in-prison-heres-why-101707544156638.html",
    "text": "Subscribe Now! Get features like Former Apple engineer Xiaolang Zhang, who pleaded guilty to stealing information related to the company's ‘Project Titan’ autonomous car efforts, has been sentenced to 120 days in prison, and fined $146,984, court documents of his sentencing show. Additionally, after completing his jail term, Zhang, who originally faced up to 10 years in prison and a $250,000 fine, must serve a three-year supervised release, the court ruled. He is expected to surrender by June 19; after this, he will be sent to a minimum-security facility as close as possible to his home in San Jose, California. The ex-Apple engineer was arrested in July 2018 at the San Jose International Airport just as he was about to board a flight to China. He initially pleaded not guilty, though he changed his mind and pleaded guilty in August 2022. Zhang, who was a hardware engineer on Project Titan, transferred a 25-page document containing engineering schematics of the proposed vehicle's circuit board, to his wife's laptop. He also saved a copy of technical manuals that described the vehicle's prototype to that laptop. He also stole circuit boards and Linux servers from the tech giant's development labs. Following a paternity leave and a trip to China, the engineer resigned from the iPhone maker; his resignation letter informed the Cupertino, California-based firm that he was going to China to work for XPeng Motors. As Xpeng too was working on self-driving technology, Apple conducted an investigation, and caught Zhang on CCTV taking hardware from the company's labs, and transferring data to his wife's computer, leading to the lawsuit.        Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}