{
    "title": "Apple, Google and Meta set to face probes under new law: source",
    "date": "3/25/2024",
    "url": "https://www.iol.co.za/business-report/economy/apple-google-and-meta-set-to-face-probes-under-new-law-source-7812a50c-af06-4881-a874-a7b33a1c39a5",
    "text": "Saturday, March 30, 2024 European Commissioner for the Internal Market Thierry Breton. Photo: AFP Published Mar 25, 2024 | Published Mar 25, 2024 Share Apple, Google and Meta are set to face the EU's wrath next week as Brussels prepares to hit the tech giants with probes into potential violations of a landmark law, sources close to the matter said Friday. The European Commission, the EU's powerful antitrust regulator, has been in talks in the past months with the titans about complying with the Digital Markets Act (DMA), which came into force in early March. The DMA demands online platforms open up digital markets to greater competition and the commission has vowed its impact would be far-reaching. “Apple has done more with the DMA in 10 days than in 10 years with antitrust,” the EU’s internal market commissioner, Thierry Breton, told CNN last week. For example, Apple has been forced to allow developers to create their own rival marketplaces to the US giant’s App Store. But the company still faces accusations that the changes are complicated and come with unfair fees -- and has not done enough to avoid European regulators’ scrutiny. The investigation into Apple is expected to look into how the company prevents application developers from communicating for free with iPhone users, a source said. A similar violation led the EU to slap Apple with a €1.8 billion (R36bn) fine earlier this month, which the company is appealing. Apple is also in the crosshairs of regulators on the other side of the Atlantic. Last week the US Department of Justice sued Apple, accusing it of illegally maintaining a monopoly for its iPhone ecosystem by stifling competition. The EU has named six companies as “gatekeepers” facing the tougher rules: Google parent Alphabet, Amazon, Apple, TikTok owner ByteDance, Meta and Microsoft. The EU probe into Meta will likely focus on how the US company uses Facebook and Instagram users' data. Under the rules, platforms can only share data across the companies' services if they have user consent to do so, which they must now ask for. The investigation into Google will focus on claims of “self-preferencing”, where digital platforms favour their own services above others, the source said, for example when users search for hotels. Brussels hit Google with a €2.4bn fine in 2017 over a similar breach. The commission can slap fines of up to 10% on a company's worldwide turnover for a violation. That can rise to 20% for repeat offenders. Apple, Google and Meta did not immediately respond to AFP’s requests for comment. AFP Related Topics: Independent Online, popularly known as IOL, is one of South Africa’s leading news and information websites bringing millions of readers breaking news and updates on Politics, Current Affairs, Business, Lifestyle, Entertainment, Travel, Sport, Motoring and Technology. Read more © 2024 Independent Online and affiliated companies. All rights reserved. "
}