{
    "title": "Apple escalates Epic Games feud by blocking Fortnite app in EU",
    "date": "3/6/2024",
    "url": "https://www.foxbusiness.com/markets/apple-escalates-epic-games-feud-blocking-fortnite-app-eu",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Money Map Press chief investment strategist Shah Gilani argues that the markets are already ‘anticipating’ Trump’s victory in the 2024 election during an appearance on ‘Varney & Co.’ Apple escalated its feud with Epic Games on Wednesday, blocking the Fortnite video-game maker from launching its own online marketplace on iPhones and iPads in Europe. The two companies have been in a legal battle since 2020, when the gaming firm alleged that Apple's practice of charging up to 30% commissions on in-app payments on its iPhone Operating System (iOS) devices violated U.S. antitrust rules. Apple is ramping up its battle with Fortnite-maker Epic Games. ( REUTERS/Dado Ruvic/Illustration / Reuters Photos) The latest challenge from Epic comes as Apple struggles with concerns about tepid demand for its iPhones in China, and its stock has tumbled 12% so far this year, underperforming its big tech peers in the U.S. Its shares were largely unchanged on Wednesday. Attempts by regulators and competitors such as Epic to pave the way for rival marketplaces on Apple's devices are a major threat to the Silicon Valley heavyweight's profits and control of its own ecosystem. APPLE'S NEW MACBOOK AIR MODELS ROLLING OUT THIS WEEK European lawmakers are forcing Apple to allow those third-party marketplaces with a law called the Digital Markets Act (DMA) that takes effect this week. Separately, Brussels antitrust regulators on Monday fined Apple 1.84 billion euros ($2 billion) for thwarting competition from music streaming rivals via restrictions on its App Store, Apple's first ever penalty for breaching EU rules. Epic was working to take advantage of the DMA, but Apple blocked those efforts on Wednesday, citing Epic's past breaches of contract in the long-running legal dispute. Apple terminated a new developer account that Epic had created in Sweden. Epic had created the account in an effort to put Fornite and other games back on iPhones in Europe by running its own game store on Apple's devices. Apple must allow third-party stores on its devices, under the new European law. Apple and Epic Games have been feuding since 2020. (CHRIS DELMAS/AFP via Getty Images / Getty Images) The developer accounts are important because software creators cannot distribute apps to iPhones and iPads without one. Apple had previously terminated some of Epic's developer accounts in 2020, after Epic purposely broke Apple's in-app payment rules, using its violation of the rules and subsequent banishment from the App Store as the core of public relations and legal campaign against Apple. APPLE PRODUCTS, INCLUDING VISION PRO, STILL AVAILABLE IN RUSSIA DESPITE COMPANY'S EXPORT BAN: REPORT Apple said on Wednesday the court rulings have made clear that it has \"sole discretion\" to terminate any Epic Games developer account in light of its \"egregious\" breaches of the company's developer agreements. \"In light of Epic’s past and ongoing behavior, Apple chose to exercise that right\" to terminate Epic Games' account, Apple said. Epic alleged that by terminating its account, Apple was removing one of the largest potential competitors to the Apple App Store. Apple, Inc. \"This is a serious violation of the DMA and shows Apple has no intention of allowing true competition on iOS devices,\" Epic Games said. The European Commission, the executive body of the EU, did not immediately respond to a request for comment. Apple in January proposed certain changes ahead of a March 7 deadline to comply with certain conditions of the DMA, a legislation meant to make it easier for European users to move between competing services. GET FOX BUSINESS ON THE GO BY CLICKING HERE The company said it would allow alternative app stores on iPhones and an opt-out from using the in-app payments system, but set a \"core technology fee\" of 50 euro cents per user account per year for developers who sign up for the new regime. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}