{
    "title": "Intel's Lunar Lake Could Be a Threat to Apple's MacBooks",
    "date": "3/30/2024",
    "url": "https://www.fool.com/investing/2024/03/30/intels-lunar-lake-could-be-a-threat-to-apples-macb/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Apple (AAPL -1.06%), by virtue of controlling both the hardware and software for its MacBooks, can eke out performance and efficiency that Windows laptops generally cannot. Apple's switch from Intel (INTC 0.91%) CPUs to its own homegrown CPUs has given it even more firepower to widen the gap between its products and the competition. Intel made progress closing that gap with its Meteor Lake laptop chips, which launched in December. Meteor Lake, a disaggregated chip that links together multiple tiles, uses the company's Intel 4 process node for its compute tile and includes capable graphics and an AI accelerator. Performance is solid, and while battery life isn't quite as good as Apple's MacBook Air, it's a step in the right direction. Later this year, Intel is expected to launch two lines of CPUs. Arrow Lake will focus on the desktop and performance, while Lunar Lake will succeed Meteor Lake in laptops. Intel is reportedly doing a few interesting things with Lunar Lake. While the company hasn't disclosed much information, various reports and rumors suggest that Lunar Lake is aimed at bringing Apple-like performance and efficiency to Windows laptops. Lunar Lake will reportedly include integrated memory, just like Apple's chips. In a standard Windows laptop, the CPU and memory are separate. The need to move data from memory to the CPU can create performance bottlenecks, increase power consumption, and boost heat. By putting the CPU and memory together, significant performance and efficiency gains can be achieved. The downside is that laptops with memory integrated into the CPU can't be upgraded. One reason why Apple's MacBooks generally beat Windows laptops in performance and efficiency is this integrated memory design. Of course, Apple has gotten pretty good at designing chips as well. On top of Lunar Lake's integrated memory, reports indicate that Intel is working closely with Microsoft to optimize Lunar Lake for Windows 11. Lunar Lake will also reportedly feature upgraded integrated graphics using Intel's next-generation Battlemage architecture, as well as an upgraded AI accelerator. While Meteor Lake used Intel's manufacturing for the compute tile and TSMC for the other tiles, rumors suggest that Intel is opting for TSMC for everything this time around. This could be an issue of timing. The Intel 18A process won't be ready in time, and with Arrow Lake set to use the Intel 20A process, Intel may not have enough capacity to use its own advanced processes for both chip families. The company will reportedly be using TSMC's N3B process node for the compute tile. Demand for PCs plunged after the pandemic-era boom sputtered out. Global unit shipments dropped by a double-digit percentage in both 2022 and 2023, a miserable result that caused Intel's revenue and profit to tumble. The market is expected to recover this year, which bodes well for Intel's 2024 CPU launches. With Lunar Lake, Intel will have the opportunity to steal back some market share it's lost to rival AMD, as well as help Windows laptops gain ground on Apple. AMD now has a roughly 20% unit share of the laptop CPU market, a percentage that has more than doubled since mid-2018. There are still a lot of unknowns about Lunar Lake, as most of the information available hasn't been confirmed by Intel. But if the company can truly close the performance and efficiency gap with Apple, Lunar Lake could be a big winner for Intel as it rides the PC recovery. Timothy Green has positions in Intel. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Microsoft, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short January 2026 $405 calls on Microsoft, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}