{
    "title": "Apple Stock: Vision Pro Could Be A Major Threat To Profitability \n(NASDAQ:AAPL)",
    "date": "3/28/2024",
    "url": "https://seekingalpha.com/article/4681128-apple-stock-vision-pro-could-major-threat-to-profitability-reiterate-sell",
    "text": "Nikada/iStock Unreleased via Getty Images  Nikada/iStock Unreleased via Getty Images Apple’s (NASDAQ:AAPL) management has announced that they will be launching Vision Pro in China this year. The company is facing significant challenges in China and has reported a major dip in revenue in this region. While a lot of media attention has been given to Vision Pro, it is unlikely that this device will move the needle in terms of revenue in the near term. On the other hand, massive R&D investment is required to build this device which is already affecting the margins of the company. CNBC reported the bill of materials of Vision Pro is equal to $1,542 making it difficult for Apple to give price cuts. Apple is already facing margin headwinds due to other low-margin businesses like TV+ as mentioned in the previous article. If the investments in Vision Pro reach a level similar to its competitor Meta's (META) Reality Labs, we could see a significant decline in Apple's profitability in the next few quarters. We need to look at some of the products and services of Apple which have not performed well when they are in direct competition with other domestic Big Tech companies. This will give an indication of the challenge faced by Apple's Vision Pro in its competition with Meta. Apple has not performed well in the smart speaker segment where it is in direct competition with Amazon (AMZN) and Google (GOOG). Apple’s smart speakers have not been able to gain a meaningful market share despite the best efforts of the company. Apple has also not been able to show good subscriber growth in its video streaming TV+ segment. Google's YouTube Music has recently announced reaching 100 million subscribers which has likely overtaken Apple Music despite Apple having a big head start. Meta has reported losses of $42 billion in Reality Labs segment since 2020 when it started reporting the data. If Apple needs to compete with Meta, it would likely be investing a similar amount in this segment which would negatively affect the bottom line by more than 15%. Webdush analyst Dan Ives has estimated that Apple will sell 1 million units of Vision Pro in 2025. This would equate to an additional $3.5 billion in revenue contribution for Apple. The revenue contribution of Vision Pro in 2025 would be less than 1% of the overall revenue and less than 10% of the Wearables segment where Apple is reporting double-digit YoY decline in revenue. Vision Pro segment can become a massive money pit if the adoption rate does not increase dramatically. While a lot of attention is given to Vision Pro, Apple’s core business is also facing headwinds due to antitrust issues, falling revenue, and challenges in China. The most talked about aspect of Vision Pro is its price. At $3,499, it is out of the range of most customers. Apple could have decided on this price in order to signal the premium quality of the device. However, the bill of materials of Vision Pro is also quite high. Third-party estimates have suggested that the bill of materials is $1,542 per set which is higher than the retail price of Quest Pro. The displays of Vision Pro have been praised a lot, including by Mark Zuckerberg, however they cost $228 for each eye. It is highly likely that Apple will launch a lower-priced version of this device in the next few quarters. But even at a lower price point, it could cost a bit for customers. Company Filings Company Filings Figure: Decline in Apple’s sales in China. Source: Company Filings Apple’s management has recently announced that they will launch Vision Pro in China this year. This should help the declining sales numbers in this important region. However, Chinese customers have recently been pulling back from making luxury purchases as the economy continues to feel new headwinds. Even luxury brand Gucci has announced a big decline in its business in China which can be a warning sign for Apple. I believe that mass adoption of these devices will not start at a price above $1,500 and Apple will need to cut on many important features of Vision Pro to reach this price range. Apple’s previous record in competing head-on with other Big Tech companies has been mixed. I believe, one of the biggest recent failures for Apple has been its inability to increase the market share of smart speakers. Both Amazon and Google have been able to retain their market share in the smart speaker and smart home devices segment despite price cuts offered with Apple’s HomePod. Even a lower-priced HomePod Mini did not change the market share a lot for Apple. Company Filings Company Filings Figure: Apple reported double-digit decline in Wearables in recent earnings. Source: Company Filings Apple's Wearables has declined by double-digit in the recent earnings on the back of another 8% decline in the year-ago quarter. Prior to the pandemic, in Q1 2020, Apple announced $10 billion revenue in the Wearables segment. Over the last four years, the CAGR growth in this segment has been less than 5%. At one point, Apple's management touted the Wearables as the next major revenue driver within the Products category for the company. It now hopes that Vision Pro will be the next big thing for the company but Vision Pro faces a big challenge from Meta. Meta has gone all-in with its Reality Labs. It has invested tens of billions of dollars in this segment and has had a big head start. Quest series has cumulatively shipped over 20 million units and Apple will find it difficult to get close to this number in the near term. It is unlikely that Meta will give up its market share easily. If Apple’s market share in this segment remains in single-digit or low double-digit, it could increase the bearish sentiment towards the stock. The R&D expense behind this device should not be underestimated. Meta has reported $42 billion in cumulative losses since 2020 in Reality Labs. This shows the staggering level of research effort required to build the device and its ecosystem. Apple would likely be investing a similar amount to build its own ecosystem. Apple does not break down the expense but Tim Cook mentioned about the scale of investments during the launch of the product. There’s 5,000 patents in the product, and it’s built on many innovations that Apple has spent multiple years on from silicon to displays and significant AI and machine learning. Investors can also gauge the expenses by the massive increase in R&D bill over the last few years. The ttm R&D expense for Apple has increased from less than $5 billion in 2014 to $30 billion in the recent quarter. This has also increased the R&D to revenue percent from less than 3% to close to 8%. Ycharts Ycharts Figure: Increase in research expense over the last decade. Source: Ycharts Meta has announced that the investment scale in Reality Labs will continue in the near future. We could expect the same from Apple for the next few years. The worst-case scenario for Apple would be if the company continues to sell a few million units of Vision Pro every year while it has to invest tens of billions of dollars in building the ecosystem for this device. In this scenario, it would be difficult for Apple to cancel the project similar to what it did with the autonomous driving Project Titan. Apple faced a similar dilemma in the smart speaker segment where the small customer base does not provide enough revenue stream to justify the investments. However, the smart speaker segment did not require the massive investments of Vision Pro. Apple could monetize Vision Pro ecosystem similar to what it does on iOS but it would require a massive customer base in order to recover the investment. Apple is already facing a number of headwinds including slowdown in revenue, decline in China sales, and lawsuits by US and international regulators. If the customer base and monetization of Vision Pro does not increase significantly, we could see Apple report declining margins which would be a big negative for the sentiment around the stock. A contrary argument can be made that Vision Pro is a big technological leap and it could change the way we compute and interact with devices. Apple sells close to 200 million units of iPhone every year and if Vision Pro is successful, we could see massive unit shipments by 2030. Apple is certainly investing a massive amount in building the technology and the ecosystem around Vision Pro. It is also highly likely that the price will come down as the economies of scale are achieved over the next few years. In the past, Apple has been able to corner big market share in major devices despite being a latecomer. If this trend continues, Vision Pro could have the ability to build a decent market share in the next few iterations. Many analysts have been very bullish about Vision Pro's future. The monetization of this device should not be a hurdle for Apple as it already has a massive subscriber base through other products. The jury is still out about the direction of Vision Pro, but I believe it will be a big negative for the margins in the next few years until the user base increases. The competition from Meta needs to be taken into account because Meta has the social network, resources, and tech skills to challenge Apple in this segment. The Vision Pro sales will unlikely move the revenue needle in the next few quarters. Even if Apple is able to cumulatively sell 10 million units of Vision Pro by the end of 2027, it would add $35 billion in net sales which is a fraction of the iPhone segment. The future iterations are likely to be cheaper which will also reduce the revenue contribution of this segment. On the other hand, the research expense on this project is likely to be tens of billions of dollars, similar to Meta. Apple stock has declined by over 10% in YTD but it is still more expensive than Meta and Alphabet when we look at forward PE multiple. The future revenue growth estimates of Apple are also quite modest as headwinds in China increase. I believe, Apple will continue to show a stagnant or declining revenue base for the next few quarters. This will put pressure on the PE multiple of the company. In the few years prior to the pandemic, Apple's PE multiple rarely went above 20. Most of the pandemic bump has gone and Apple does not have any near term business which can drive revenue and margins higher. On the other hand, segments like TV+ and Vision Pro require massive resource allocation in order to build a strong customer base. This should be a big negative for margins in the next few quarters. We could see another 25% correction in Apple stock which should allow the PE to return closer to the pre-pandemic level. Any entry into Apple stock should be delayed till the PE declines below 20 which is possible if the company continues to show revenue headwinds in the next few quarters. Ycharts Ycharts Figure: Forward pe and revenue growth of Apple, Meta and Alphabet. Source: Ycharts The next few quarters will be particularly tough for Apple as the company faces regulatory challenges for its highly profitable revenue stream of App Store and the licensing revenue from Google. Apple is also increasing investment in TV+ where the margins are wafer-thin. The Vision Pro’s unit shipment will be closely watched by Wall Street. Apple is facing tough competition with Meta which has a head start and has gone all-in with investment in Reality Labs. It is likely that Vision Pro's unit shipment will not excite Wall Street in the next few quarters while the company will need to ramp up R&D investments to build an ecosystem. This trend will hurt Apple's margin and EPS projections for the next few years making it difficult for the stock to outperform the broader S&P500. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}