{
    "title": "Apple faces 24 pc dip in China iPhone sales amid Huawei`s 64 pc surge",
    "date": "3/7/2024",
    "url": "https://www.wionews.com/business-economy/apple-faces-24-pc-dip-in-china-iphone-sales-amid-huaweis-64-pc-surge-697527",
    "text": "This contrast raises concerns about Apple's market standing and potential demand slowdown, with its share in the Chinese smartphone market slipping to 15.7 per cent, securing the fourth position. Apple encountered a significant setback in China as its iPhone sales plummeted by 24 per cent in the initial six weeks of 2024, as revealed by a report by research firm Counterpoint. Huawei, Apple's staunch competitor, witnessed a contrasting surge, with unit sales skyrocketing by 64 per cent during the same period. This contrast raises concerns about Apple's market standing and potential demand slowdown, with its share in the Chinese smartphone market slipping to 15.7 per cent, securing the fourth position. Counterpoint's report highlights a challenging landscape for Apple, attributing its decline to heightened competition from domestic rivals, particularly Huawei, which now claims the second spot in the Chinese market with a market share of 16.5 per cent. Apple's response to the competition includes recent subsidies for certain iPhone models and prior discounts, reflecting aggressive strategies while the overall smartphone market in China, shrank by 7 per cent. Counterpoint's Senior Analyst, Mengmeng Zhang, emphasises that Apple is grappling with a challenging scenario, squeezed in the middle due to aggressive pricing from competitors like Oppo, Vivo, and Xiaomi. The report notes that Huawei's resurgence in premium smartphone sales, especially with the Mate 60 series, has contributed to its remarkable growth despite previous struggles under US sanctions. Honor, Huawei's spin-off, is the only other brand in the top five to witness sales growth during the first six weeks of the year, rising by 2 per cent. The report indicates Apple's market share drop from 19 per cent to 15.7 per cent, slipping to the fourth position from second place a year ago. Meanwhile, Huawei's ascent to the second position underlines its successful rebound. Vivo, despite a 15 per cent sales decrease, retains its position as China's top-selling smartphone maker. Apple's proactive measures, including discounts and subsidies, aimed to counter the decline and boost sales amid the challenging market conditions in China. Apple's struggle in the Chinese market is evident in its share prices, which went down by 1.6 per cent in premarket trading, and an overall 10 per cent loss in value this year. The report underscores Huawei's resilience and unexpected success in overcoming challenges, including US sanctions, to dominate the Chinese premium smartphone market. The outcome of Apple's aggressive strategies and competition in China will likely impact its revenue performance, potentially influencing investor confidence. Apple shares saw a decline of 2.8 per cent in New York trade following reports of its falling revenue. (With inputs from Reuters) "
}