{
    "title": "Antitrust crackdown looms over Big Tech: How Apple, Google are likely \nstaring at break-up orders in US and EU | Mint",
    "date": "3/24/2024",
    "url": "https://www.livemint.com/companies/news/antitrust-crackdown-looms-over-big-tech-apple-google-break-up-orders-likely-11711340412817.html",
    "text": "Antitrust regulators on both sides of the Atlantic are tightening their grip on Big Tech, raising the spectre of potential break-up orders for industry titans such as Apple and Alphabet's Google, as per a Reuters report. Antitrust probes are proliferating worldwide following the initiation of cases by the European Union and the United States. This crackdown marks the most significant challenge for Big Tech since the breakup of AT&T forty years ago. The cases echo AT&T's break-up in 1984, when the company, then known as Ma Bell, was divided into seven independent companies, known as \"Baby Bells,\" to dismantle one of the most dominant monopolies of the 20th century. Presently, AT&T, Verizon, and Lumen stand as the surviving entities. Google and Apple Defend Against AllegationsGoogle has contested the EU's allegations, while Apple has refuted the US lawsuit's claims, asserting they are incorrect both factually and legally.\n    Regulators have accused companies like Apple and Google of erecting insurmountable barriers around their products, creating what is termed as \"walled gardens,\" thus hindering consumers from switching to alternative services.\n   The US Department of Justice issued a warning to Apple, a company valued at $2.7 trillion, indicating that a break-up order remains a possible remedy to restore competition. This comes after the DOJ collaborated with 15 states to sue Apple for monopolising the smartphone market, impeding competition, and inflating prices.\n   Meanwhile, amid mounting threats in Europe, Big Tech faces further scrutiny, with Apple, Meta Platforms, and Alphabet likely to face investigations for potential violations of the Digital Markets Act, possibly leading to substantial fines or break-up orders.\n Antitrust Chief Signals Drastic MeasuresEU antitrust chief Margrethe Vestager has suggested drastic measures, including potentially forcing Google to divest its ad tech business, to address anti-competitive practices. A final decision is expected by the end of the year.\n   European Parliament lawmaker Andreas Schwab advocates for robust action against Big Tech to ensure open markets, fairness, and foster innovation.\n   Despite the looming threat of break-up orders, it remains uncertain whether regulators will pursue such drastic measures. Legal experts suggest that the case against Apple may be more complex than past cases, such as the 1998 case against Microsoft.\n Experts Weigh In on Potential RemediesLegal experts highlight the challenges of breaking up highly integrated systems such as Apple's, suggesting alternative behavioural remedies. Structural remedies like break-ups would likely face rigorous legal scrutiny.\n   Apple derives the majority of its revenue from hardware sales, followed by its Services business. Any structural remedies would undoubtedly impact its revenue streams.\n   Legal experts also anticipate protracted legal battles if structural remedies are pursued, cautioning against the complexities and challenges involved.\n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         The pandemic broke co-living’s back. Startups need a reset          CarDekho in talks to raise $100-150 million          Brookfield's big sale has many investors interested          Bankruptcy rescues have soared this year. Here is why          When Cupid stepped up to Tourism Finance, and walked back          It's going to get harder to swing a promotion          Vedanta plans a demerger; banks are thinking of debt          Accenture secures $1.1 billion GenAI projects in Sep-Feb          Healthify maps a global run amid profit chase          At Flipkart, merit-based payouts push out salary hikes in increment season       Explore Premium  \n\n\n            Catch all the Corporate news and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 25 Mar 2024, 10:34 AM IST\n\t\nTopics You May Be Interested In \n business \n technology \n tech companies \n United States \n US regulators \n Google \n Apple \n big tech \n Alphabet \n AT&T Google has contested the EU's allegations, while Apple has refuted the US lawsuit's claims, asserting they are incorrect both factually and legally. Regulators have accused companies like Apple and Google of erecting insurmountable barriers around their products, creating what is termed as \"walled gardens,\" thus hindering consumers from switching to alternative services. The US Department of Justice issued a warning to Apple, a company valued at $2.7 trillion, indicating that a break-up order remains a possible remedy to restore competition. This comes after the DOJ collaborated with 15 states to sue Apple for monopolising the smartphone market, impeding competition, and inflating prices. Meanwhile, amid mounting threats in Europe, Big Tech faces further scrutiny, with Apple, Meta Platforms, and Alphabet likely to face investigations for potential violations of the Digital Markets Act, possibly leading to substantial fines or break-up orders. Antitrust Chief Signals Drastic MeasuresEU antitrust chief Margrethe Vestager has suggested drastic measures, including potentially forcing Google to divest its ad tech business, to address anti-competitive practices. A final decision is expected by the end of the year.\n   European Parliament lawmaker Andreas Schwab advocates for robust action against Big Tech to ensure open markets, fairness, and foster innovation.\n   Despite the looming threat of break-up orders, it remains uncertain whether regulators will pursue such drastic measures. Legal experts suggest that the case against Apple may be more complex than past cases, such as the 1998 case against Microsoft.\n Experts Weigh In on Potential RemediesLegal experts highlight the challenges of breaking up highly integrated systems such as Apple's, suggesting alternative behavioural remedies. Structural remedies like break-ups would likely face rigorous legal scrutiny.\n   Apple derives the majority of its revenue from hardware sales, followed by its Services business. Any structural remedies would undoubtedly impact its revenue streams.\n   Legal experts also anticipate protracted legal battles if structural remedies are pursued, cautioning against the complexities and challenges involved.\n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         The pandemic broke co-living’s back. Startups need a reset          CarDekho in talks to raise $100-150 million          Brookfield's big sale has many investors interested          Bankruptcy rescues have soared this year. Here is why          When Cupid stepped up to Tourism Finance, and walked back          It's going to get harder to swing a promotion          Vedanta plans a demerger; banks are thinking of debt          Accenture secures $1.1 billion GenAI projects in Sep-Feb          Healthify maps a global run amid profit chase          At Flipkart, merit-based payouts push out salary hikes in increment season       Explore Premium  \n\n\n            Catch all the Corporate news and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 25 Mar 2024, 10:34 AM IST\n\t\nTopics You May Be Interested In \n business \n technology \n tech companies \n United States \n US regulators \n Google \n Apple \n big tech \n Alphabet \n AT&T EU antitrust chief Margrethe Vestager has suggested drastic measures, including potentially forcing Google to divest its ad tech business, to address anti-competitive practices. A final decision is expected by the end of the year. European Parliament lawmaker Andreas Schwab advocates for robust action against Big Tech to ensure open markets, fairness, and foster innovation. Despite the looming threat of break-up orders, it remains uncertain whether regulators will pursue such drastic measures. Legal experts suggest that the case against Apple may be more complex than past cases, such as the 1998 case against Microsoft. Experts Weigh In on Potential RemediesLegal experts highlight the challenges of breaking up highly integrated systems such as Apple's, suggesting alternative behavioural remedies. Structural remedies like break-ups would likely face rigorous legal scrutiny.\n   Apple derives the majority of its revenue from hardware sales, followed by its Services business. Any structural remedies would undoubtedly impact its revenue streams.\n   Legal experts also anticipate protracted legal battles if structural remedies are pursued, cautioning against the complexities and challenges involved.\n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         The pandemic broke co-living’s back. Startups need a reset          CarDekho in talks to raise $100-150 million          Brookfield's big sale has many investors interested          Bankruptcy rescues have soared this year. Here is why          When Cupid stepped up to Tourism Finance, and walked back          It's going to get harder to swing a promotion          Vedanta plans a demerger; banks are thinking of debt          Accenture secures $1.1 billion GenAI projects in Sep-Feb          Healthify maps a global run amid profit chase          At Flipkart, merit-based payouts push out salary hikes in increment season       Explore Premium  \n\n\n            Catch all the Corporate news and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 25 Mar 2024, 10:34 AM IST\n\t\nTopics You May Be Interested In \n business \n technology \n tech companies \n United States \n US regulators \n Google \n Apple \n big tech \n Alphabet \n AT&T Legal experts highlight the challenges of breaking up highly integrated systems such as Apple's, suggesting alternative behavioural remedies. Structural remedies like break-ups would likely face rigorous legal scrutiny. Apple derives the majority of its revenue from hardware sales, followed by its Services business. Any structural remedies would undoubtedly impact its revenue streams. Legal experts also anticipate protracted legal battles if structural remedies are pursued, cautioning against the complexities and challenges involved. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}