{
    "title": "Business Card Signed by Steve Jobs Goes for Over $180,000 at Auction",
    "date": "3/22/2024",
    "url": "https://www.mactrast.com/2024/03/business-card-signed-by-steve-jobs-goes-for-over-180000-at-auction/",
    "text": "A rare Steve Jobs signed Apple Computer business card circa 1983 that went up for auction earlier this month for $181,183 at auction, according to Boston-based RR Auction. The business card has been authenticated by well-known memorabilia grading service PSA, according to the auction listing. The card features Apple’s old six-color rainbow apple logo, and it carries the company’s former address of 10495 Bandley Drive, in Cupertino, California. Jobs title is listed as the Chairman, Board of Directors. RR Auction says the sale set a new record-high price for a signed business card. Also included in the auction was an Apple Computer Company check signed by Steve Jobs, payable to Pacific Telephone, dated July 8, 1976. The check for $201.41, which was written by Jobs to pay the company’s Pacific Telephone bill, carries the address “770 Welch Rd., Ste. 154, Palo Alto,” which marks the first official address of Apple. It sold for $66,069. The check carries the highest grade of “GEM Mint 10” by PSA/DNA, which means the check is in pristine condition and carries significant historical value, signifying a crucial point in the development of personal computing. Other items in the auction included: The items were part of an auction from RR Auctions, called the “Steve Jobs and the Apple Computer Revolution” collection. It concluded on March 21, 2024. Steve Jobs’ autographed memorabilia makes for popular memorabilia auctions. In December 2023, a $4.01 Apple Computer Company check made out to Radio Shack, written and signed by Apple co-founder Steve Jobs in 1976 sold for $46,063 at auction. The check had been expected to fetch at least $25,000. Steve Jobs, who passed away in 2011 at the age of 56. Jobs was reluctant to sign autographs, meaning items carrying his signature often sell for large sums of money. "
}