{
    "title": "Apple Stock: I Would Not Buy It Despite The Recent Correction (NASDAQ:AAPL)",
    "date": "3/18/2024",
    "url": "https://seekingalpha.com/article/4678961-apple-stock-i-would-not-buy-it-despite-the-recent-correction",
    "text": "Nikada Nikada Apple Inc. (NASDAQ:AAPL), one of Wall Street's darlings, has no need to be introduced. It is highly popular among investors. However, the AAPL stock price recently corrected somewhat due to lower sales in China and regulatory pressures. Although Apple's shares are trading off their all-time highs, I still would not acquire the stock, even though the company is a stable cash cow business. Here is why. I have been quite conservative in my forecasts of the iPhone maker for a while. In my previous article, I wrote that the business is well-established, has a very strong brand name, is highly diversified, and operates in the high-tech industry. However, it seems like its brilliant growth has stalled somewhat, while its stock is still trading very high. Well, in spite of the recent correction, my opinion on the stock is still unchanged, namely that the company is overvalued according to various valuation methods and indicators. In my view, the stock price correction was warranted. It happened for several reasons. But AAPL is still not cheap enough for me just yet. There are various explanations for the stock's correction. For example, my fellow Seeking Alpha analyst, Yuval Rotem, has written a brilliant article explaining Apple's rather disappointing news and the possible reasons for the stock's actual correction. Among these are lower sales in China and regulatory pressures. These explanations are valid, but in my view, AAPL stock should trade lower for other reasons. The Chinese government banned Apple's devices for use in several government agencies. Then, in the first six weeks of 2024, Apple's sales dropped by 24%. This is mainly due to the fact that Huawei returned to the market while price-conscious Chinese consumers switched to Huawei's smartphones from premium-priced iPhones. I personally disagree that China is so important for Apple in terms of its sales, although these announcements made investors more cautious. Main Street Data Main Street Data First of all, the Americas is still the biggest region, generating a lion's share of Apple's revenues. The second region that is accountable for the company's sales is Europe, while Greater China and the rest of Asia Pacific are only accountable for small proportions of the company's revenues. So, China's demand slowdown does not have a very big effect on Apple's sales and earnings in my opinion. High-tech giants face that type of pressure. As concerns Apple, the EU slapped the corporation with a $2 billion fine. The problem with AAPL is that this accelerated from a couple hundred million to a whopping $2 billion fine, representing more than 2% of Apple's net income. Obviously, this is not only typical of the EU. Many countries' legislation aims to protect consumers from monopolies. So, Apple does not only face risks from the European Commission but also from other countries where it operates. However, as I have mentioned before, this is typical of other companies operating in the high-tech sector. In other words, it is a general risk, but again, it is a piece of bad news for Apple's stockholders. Many big tech names, most notably Nvidia, have recently shown brilliant growth thanks to their active adoption of artificial intelligence. I wrote quite a big article about NVDA commenting on its 2023 earnings. Apple, it seems, has disappointed investors on that front. In spite of the corporation being one of the top high-tech companies, it was not one of the main players in the initial stages of the AI revolution. Indeed, I believe positive AI news would have supported investors' enthusiasm and Apple's stock price. But the main problem for AAPL, in my view, is the fact that the company's income and sales growth have stalled. Aswath Damodoran, also known as the dean of valuation, named a number of criteria as relevant when judging a firm's attractiveness. Among these are the following: I would like to compare and contrast Apple's key profitability measures to those of its peers operating in the US high-tech industry. I decided to take American companies, including Dell Technologies Inc. (DELL) and Hewlett Packard Enterprise Company (HPE), producing personal computers and computer equipment. Seeking Alpha Seeking Alpha We can clearly see that Apple is a very profitable company with much higher margins than those of its rivals. As concerns Apple's riskiness, it is much lower than its rivals. The Altman Z Score, which takes into account profitability, leverage, liquidity, solvency, and activity ratios, sees the company as low-risk. Seeking Alpha Seeking Alpha As I have mentioned above, Apple's profitability is very high, and its net profit has been rising for a while as well. But the company's ROE is not high just because of that. Apple heavily relies on debt, and this means it can boast a very high ROE. At the end of 2022, Apple had almost 6 times as much debt as it did equity. Therefore, it is logical why the company is able to earn high profits compared to its equity because its equity was not that high. I will present the company's debt-to-equity history below. However, we can clearly see that Apple's ROE has stopped rising. In 2022, it reached its peak because the company's profit growth stalled, while the D/E ratio decreased in 2023. ROE 2015 2016 2017 2018 2019 2020 2021 2022 2023 ROE 44.7% 35.6% 36.1% 55.6% 61.1% 87.9% 150.0% 197.0% 156.0% Source: Prepared by the author based on Seeking Alpha's data But let us have a look at the corporation's revenues and profit as well as D/E ratio history. From the diagram below, you can clearly see that sales growth also reached its peak in 2022. Prepared by the author based on Seeking Alpha's data Prepared by the author based on Seeking Alpha's data And the same is true of Apple's net income growth. In fact, in 2023, the corporation's net income even decreased slightly compared to 2022. Prepared by the author based on Seeking Alpha's data Prepared by the author based on Seeking Alpha's data How about the company's debt and liquidity positions? Well, the debt-to-equity (D/E) ratio reported for 2023 is 3.77, while a good D/E is usually between 1 and 1.5. In my view, this indicator is far too high for a large and profitable corporation like Apple. 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 D/E 1.08 1.43 1.51 1.80 2.41 2.74 3.96 4.56 5.96 3.77 Source: Prepared by the author based on Seeking Alpha's data Apple's current ratio is 0.99. This is rather worrying because Apple's current assets are not even enough to meet its short-term debt if it were all due at once. 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 Current ratio 1.08 1.11 1.35 1.27 1.13 1.54 1.36 1.07 0.88 0.99 Source: Prepared by the author based on Seeking Alpha's data Apple's ROE, net income, and EBITDA margins are substantially higher than its competitors. However, it seems that the company's income and sales growth rates have all slowed down, reaching their highs in 2022. The D/E and current ratios are not great for a large and profitable corporation like Apple. As I have mentioned before, Apple's stock is far too overvalued. If we look at the table below, we will see that only the corporation's P/E indicators are reasonable, thanks to Apple's exceptional profitability. Other valuation ratios, especially the company's P/B ratio of more than 35, are extremely high compared to the sector's medians. Seeking Alpha Seeking Alpha But let me compare Apple's main valuation ratios to where they were historically. Apple's P/E all-time high was just over 40 in 2021. Right now, Apple's P/E is off its highs but still significantly above the 2015-2019 levels. In some instances, Apple's P/E was about 10. So, Apple's P/E does not suggest the stock's undervaluation, it seems. Data by YCharts The same goes for the company's P/FCF ratio. It is off its all-time high of 32, but substantially above the 8-level mark reached in 2016. Data by YCharts As the table above suggests, the sector's median price-to-book (TTM) ratio is just above 3. Apple's P/B is now almost 36. It is still below the 48 mark reached in 2022 but substantially above the 6-7 mark reached in 2015-2016. Data by YCharts Overall, we can safely say that AAPL stock is not good value for money if we compare the stock's valuation ratios to the sector's median ratios and Apple's historical valuation multiples. Apple's key upside risks are the following: In spite of Apple's stability and popularity among investors, some key risks remain, namely: I would not be surprised if AAPL rises after the recent correction, thanks to the company's profitability and the stock's popularity among investors. But this is not my base-case scenario. The company's growth has stalled, it seems, even though the economy has not entered a full-scale recession. But the company's stock is still richly valued according to the key valuation ratios. So, there is no margin of safety in my opinion. My rating is \"Hold\" This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}