{
    "title": "NameDrop on Apple Watch: What to Know About the Contact Sharing Feature",
    "date": "3/8/2024",
    "url": "https://www.cnet.com/tech/mobile/name-drop-on-apple-watch-what-to-know-about-the-contact-sharing-feature/",
    "text": "Our expert, award-winning staff selects the products we cover and rigorously researches and tests our top picks. If you buy through our links, we may get a commission. Reviews ethics statement NameDrop lets Apple Watch users share contact information with the flick of their wrist (or the tap of their Apple Watch). NameDrop lets you instantly share contact info. The Apple Watch Series 9 and the Apple Watch Ultra 2 hit shelves this past September, and the new additions to the Apple Watch family brought all sorts of exciting features. The company seems to have been focusing on connectivity with its updates from last year, bringing features designed to let you better connect with your health, better connect with your other Apple devices, and better connect with folks around you. NameDrop is designed for the latter, since it lets you share contact information almost instantly. Here's what you need to know about NameDrop for the Apple Watch. For more, here's how to download Watch OS 10 and how to download iOS 17. NameDrop is a new way for Apple Watch users to share contact information, with a simple and subtle movement of the wrist. NameDrop works much like AirDrop does to quickly share a file or send a photo. Gone are the days of typing phone numbers or handing over your phone so someone can put their number into your contacts. During its event, Apple showed two people placing their Apple Watches near each other to swap contact info. Apple says this is enabled by the brand-new S9 chip. Watch OS 10.1 dropped last fall, which gives those who have updated their watch a chance to make use of NameDrop on their Apple Watch. If you want to take advantage of NameDrop on your Apple Watch, all you'll need to do is download Watch OS 10.1 onto your watch, and you should be good to go! You'll just need to make sure you're trying to share info with others who have also upgraded their watch or iPhone. If you're an iPhone user and you want to get in on all the NameDrop action, you're in luck. Apple's iOS 17, which has finally arrived, comes with NameDrop capabilities. If you're an iPhone user running iOS 17, you'll be able to use NameDrop to immediately swap contacts with another iPhone user running iOS 17, in addition to Apple Watch users running Watch OS 10.1. NameDrop also works on the iPhone. Apple calls NameDrop a \"new AirDrop experience\" where \"a user can hold their iPhone near another to share their contact information with only their intended recipient.\" Apple also said that users will be able to pick and choose what information gets shared over NameDrop. According to MacRumors, all you need to do is navigate to the Contacts app, select your contact and then Share. After that, your watch should direct you to place your watch near another Apple Watch or iPhone to share your contact information. Apple has also said that watch users will be able to use NameDrop by tapping the My Card watch face complication and then bringing their Apple Watch face-to-face with someone else's Apple Watch or iPhone. It's important to note that NameDrop can only be used between two devices if they are either running Watch OS 10.1 or iOS 17. For more, here's everything on the Apple Watch Series 9 and Apple Watch Ultra 2. And here's how to turn off NameDrop on your iPhone. "
}