{
    "title": "Apple Googles for AI boost in iPhones",
    "date": "3/21/2024",
    "url": "https://www.newindianexpress.com/xplore/2024/Mar/22/apple-googles-for-ai-boost-in-iphones",
    "text": "NEW DELHI: In an interesting development, rival big tech firms Apple and Google are looking to collaborate on the latest innovation in the artificial intelligence space. According to reports, the iPhone maker is in talks to integrate Google’s Gemini artificial intelligence engine into iPhones, potentially making the upcoming iPhone 16 the first device to witness this development. Notably, Apple had recently held discussions with OpenAI as well. Tim Cook, Apple’s chief executive, has promised investors that the company will introduce new generative A.I. capabilities this year. Moreover, other mobile makers such as Samsung have already added AI to their latest devices. Apple uses Google search For recall, Apple has been using Google's search engine as the default option in the Safari web browser on the iPhone. For this, Google has been paying a hefty amount (36% of search advertising revenue generated via Safari) to Apple. Also, when Apple introduced the iPhone in 2007, Google initially provided Google Maps for navigation and later struck a deal to become the default search engine on the iPhone’s Safari browser. The two parties haven’t decided on the terms or branding of an AI agreement or finalized how it would be implemented. Win-win deal The search giant Google has been lagging in the race to develop AI compared to OpenAI ChatGPT. The advantage of ChatGPT was that it was the first mover and attracted users from all over the world. However, Google, which first came up with the A.I. chatbot Bard, debuted to middling reviews last March and struggled to attract as many users as ChatGPT. Then in February 2024, Google debuted a new chatbot, Gemini. It also faced criticism as users found that its image generator produced illustrations of historical figures that were not racially accurate and refused in most instances to generate images of white people, leading to accusations of bias. Subsequently, Google had to disable the ability to create images of people and vowed to fix the problem. Meanwhile, ChatGPT was gaining subscribers day by day. Therefore, Apple’s selection of Google as an A.I. supplier will bring confidence to Google and increase its user base too. The advantage is not less for Apple either. For the past few launches, Apple, known for innovation, failed to make any worthy innovation in its iPhones. Therefore, incorporating AI features in its upcoming devices will give a big boost to its devices and innovation. The company this time doesn’t want to be left behind by its rival Samsung, as they have already included AI features to edit videos and summarise audio recording in their latest flagship Samsung Galaxy S24 Ultra. Follow The New Indian Express channel on WhatsApp Download the TNIE app to stay with us and follow the latest  Copyright - newindianexpress.com 2024. All rights reserved.  "
}