{
    "title": "Apple set to unveil AI strategy at June 10 worldwide developers conference",
    "date": "3/26/2024",
    "url": "https://emeatribune.com/apple-set-to-unveil-ai-strategy-at-june-10-worldwide-developers-conference/",
    "text": "The iPhone maker announced the timing on Tuesday, saying the event will run through June 14. Though Apple did not say what it plans to unveil – in usual fashion – people familiar with the matter have said that the presentation will focus heavily on AI. Continuing an approach used since the beginning of the Covid-19 pandemic, the conference will be hosted for free on Apple’s website and app for developers. The opening-day announcements will take place in-person at the company’s campus in Cupertino, California. Apple is expected to unveil its next major software updates for the iPhone, iPad, Mac, Vision Pro headset and smartwatch – and its new AI strategy will be front and centre for the planned iOS 18 upgrade. In announcing the event, Apple marketing executive Greg Joswiak said, “It’s going to be Absolutely Incredible” – a clear nod to AI. Apple’s artificial intelligence strategy will include a slew of new proactive features to assist users in their daily lives. The company is not planning to debut its own generative AI chatbot, though. Instead, Apple is holding talks with potential partners like Alphabet’s Google and OpenAI to supply generative AI services, Bloomberg News has reported. The iOS 18 update is expected to be the most ambitious overhaul of the iPhone’s software in its history, according to people working on the upgrade. The company is also planning a minor refresh of the Apple Watch’s software and the first major update to the operating system running on the Vision Pro headset. The news is published by EMEA Tribune & SCMPFollow our WhatsApp verified Channel Nvidia (NASDAQ: NVDA) is the world’s largest semiconductor company, and considering it just surpassed a $2 trillion valuation, it’s also one of America’s most valuable […] Alibaba‘s (NYSE: BABA) stock price sank 6% on Feb. 7 after the Chinese e-commerce and cloud leader posted its latest earnings report. For the third […] Shares of Qualcomm (NASDAQ: QCOM) fell 5% on Thursday despite stronger-than-expected quarterly results and solid forward guidance from the semiconductor giant. On Qualcomm’s strong start […] The EMEA Tribune was founded in March 2020  by DJ Kamal Mustafa. Our aim is to be the primary portal for the Middle East, Africa, Europe, and Pakistan news, and our target audience is all those communities of readers living in and around the region that care deeply for its fate. EMEA TRIBUNE is known for its “Investigative Journalism” where we publish exclusive stories from investigative to trending and that’s how we make it viral for everyone. We have been featured in News Blogs and International Media is also quoting us and publishing our report. A video has recently surfaced from the Dangar Algar region of Afghanistan. It shows members… The recent Gwadar attack exposes a troubling pattern: so-called \"missing persons\" turning up as terrorists.… On March 24, 2023, Lieutenant General Babar Iftikhar, the Corps Commander of Karachi, visited the… Donald Lu, the Assistant Secretary of State for South Asia, has categorically refuted claims that… "
}