{
    "title": "Xiaomi profits surge as Apple iPhone sales slip",
    "date": "3/19/2024",
    "url": "https://qz.com/xiaomi-profits-earnings-apple-iphone-sales-china-1851347752",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Chinese smartphone maker Xiaomi is having a high time in its home market. The consumer electronics company on Tuesday reported a net profit in its fourth quarter of 4.73 billion yuan, or $657.1 million. That was higher than the previous year, The Wall Street Journal reports, but lower than its net profit of CNY4.87 billion, or $676.5 million, in the third quarter. Still, its fourth-quarter results beat analysts’ expectations. The company’s quarterly revenue increased 11% from the previous year to CNY73.24 billion, or $10.2 billion. Xiaomi saw a full-year net profit of CNY17.48 billion, or $2.4 billion — a seven-fold increase from 2022 — although annual revenue fell to CNY270.97 billion or $37.6 billion, still beating analysts’ expectations. Overall, the Chinese smartphone market was down 7% year-over-year during the first six weeks of the year. Xiaomi’s sales fell 7% year-over-year during this period, while its American competitor Apple saw iPhone sales fall 24% year-over-year, according to a report from Counterpoint Research. Apple’s steep drop was partly due to “abnormally high” iPhone sales the year before, analysts said in the report. Meanwhile, Xiaomi’s homegrown competitor, Huawei, saw a resurgence in the country after releasing a new series of smartphones. Read more: A Chinese tech giant’s first electric vehicle is coming — and Xiaomi says it’s faster than a Tesla In addition to competing with Huawei, Apple  was “getting squeezed in the middle on aggressive pricing from the likes of Oppo, Vivo, and Xiaomi,” Mengmeng Zhang, a senior analyst at Counterpoint Research, said in a statement. Analysts said growth in China’s smartphone market is likely to remain  negative during the first quarter of the year, as consumers spend less and companies offer less new products. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}