{
    "title": "Apple-Shareholder Settlement | Business | timesdaily.com",
    "date": "3/15/2024",
    "url": "https://www.timesdaily.com/business/apple-shareholder-settlement/image_3bcc5213-e893-5b0d-a8c7-a796a84589b9.html",
    "text": " FILE - A trade-in for iPhone XR promotion board is displayed as an Apple employee waits for customers at its retail store in Beijing, Thursday, Jan. 3, 2019. Apple has agreed to pay $490 million to settle a class-action lawsuit alleging CEO Tim Cook misled investors about a steep downturn in the iPhone's sales in China that culminated in a jarring revision to the company's revenue forecast. The preliminary settlement was filed Friday, March 15, 2024, in Oakland, Calif., federal court. Apple has agreed to pay $490 million to settle a class-action lawsuit alleging CEO Tim Cook misled investors about a steep downturn in iPhone’s sales in China. The slowdown in China sales culminated in a jarring revision to the company’s revenue forecast. The preliminary settlement filed in federal court Friday stems from a shareholder lawsuit focused on how Apple relayed information about how iPhone models released in September 2018 were performing in China. The complaint contended Cook signaled the iPhone was off to a decent start in an investor conference call in early November 2018, only to then warn in early January 2019 of a significant drop in sales. Apple has agreed to pay $490 million to settle a class-action lawsuit alleging CEO Tim Cook misled investors about a steep downturn in iPhone’s sales in China. The slowdown in China sales culminated in a jarring revision to the company’s revenue forecast. The preliminary settlement filed in federal court Friday stems from a shareholder lawsuit focused on how Apple relayed information about how iPhone models released in September 2018 were performing in China. The complaint contended Cook signaled the iPhone was off to a decent start in an investor conference call in early November 2018, only to then warn in early January 2019 of a significant drop in sales.     Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language.\nPLEASE TURN OFF YOUR CAPS LOCK.\nDon't Threaten. Threats of harming another\nperson will not be tolerated.\nBe Truthful. Don't knowingly lie about anyone\nor anything.\nBe Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person.\nBe Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts.\nShare with Us. We'd love to hear eyewitness\naccounts, the history behind an article.    Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       Account processing issue - the email address may already exist As it develops, sent straight to your inbox. Would you like to receive our daily news? Sign up today! Receive a daily newsletter containing a list of the day's funerals and obituaries. Receive a weekly newsletter every Thursday about restaurant reviews and health ratings in the TimesDaily area. Shoals marketing email for local businesses. Sign up to receive links to the Saturday and Monday comics and puzzles pages. Help Select Player of the Week and get results Thursday & Saturday. Imported List: Living 50 Plus Shoals - Marketing Imported List: Living 50 Plus Shoals E-Edition  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.   Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. A receipt was sent to your email. "
}