{
    "title": "Apple class action claims company limits third-party storage services",
    "date": "3/12/2024",
    "url": "https://topclassactions.com/lawsuit-settlements/lawsuit-news/apple-class-action-lawsuit-and-settlement-news/apple-class-action-claims-company-limits-third-party-storage-services/",
    "text": "Apple is accused of placing limitations on cloud storage competitors that make iCloud a monopoly. A new Apple class action claims the tech giant unfairly prevents competitors from entering the market for cloud storage on its devices by placing limitations on iCloud competitors. The restrictions include preventing other cloud storage providers from saving restricted files that are needed to restore a device when it is replaced, the class action claims. This disadvantages programs from Google and Microsoft, along with cloud storage specialists such as Dropbox, Sync.com and IDrive, preventing these services from competing on an even playing field with iCloud, the lawsuit argues. ICloud holds more than 70% of the marketplace on storage for Apple mobile devices but that is not a reflection of the quality of the service or its security, the lawsuit says. More than 100 million Americans have an iPhone or iPad and Apple’s gross margins on iCloud are nearly 80%, substantially higher than Apple’s already high gross margins, which are estimated at 40%, according to the lawsuit. “From a security and functionality standpoint, iCloud is no better (and often inferior) to other cloud storage platforms,” the class action says. “Instead, Apple has achieved market dominance by rigging the competitive playing field so that only iCloud can win.” Apple users who select a competing cloud storage service still need iCloud to back up the restricted files needed to restore a device, forcing the users to split cloud services, according to the plaintiff. “There is no plausible technological or security justification for Apple granting iCloud exclusive access to restricted files,” the lawsuit says. Apple is able to charge above-market prices for the iPhone due to agreements it put in place to block web-based apps outside the App Store, according to a class action lawsuit filed earlier this year. Do you use Apple’s iCloud storage? Let us know in the comments. The plaintiff is represented by Ben M. Harrington, Benjamin J. Siegel and Gayne A. Kalustian-Carrier of Hagens Berman Sobol Shapiro LLP. The Apple storage class action lawsuit is Gamboa v. Apple Inc., Case No. 5:24-cv-01270, in the U.S. District Court for the Northern District of California. Check out our list of Class Action Lawsuits and Class Action Settlements you may qualify to join! Read About More Class Action Lawsuits & Class Action Settlements: Δ add me I have had iCloud storage from Apple for 5  years now …  I was sent something g from them that’s stated I need more storage… just got more about 6 months ago … please add me … thank you I have iCloud storage and hardly anything goes there!!!  It’s infuriating.  And I know how to use it.  Then my phone fills up and I’m forced to delete things that I don’t want to.  Please add. I pay monthly and still constantly get notices saying I need more storage. Yes I do and was recently forced to upgrade. Add me please. I am always getting notifications that I need to pay for more storage Please add me I am always send notices to pay for extra space in my cloud Add me. Add me pls Add me; I pay monthly for iCloud storage & still need more. Your email address will not be published. By submitting your comment and contact information, you agree to receive marketing emails from Top Class Actions regarding this and/or similar lawsuits or settlements, and/or to be contacted by an attorney or law firm to discuss the details of your potential case at no charge to you if you qualify. Required fields are marked * Comment * Name * Email *   Δ Δ add me I have had iCloud storage from Apple for 5  years now …  I was sent something g from them that’s stated I need more storage… just got more about 6 months ago … please add me … thank you I have iCloud storage and hardly anything goes there!!!  It’s infuriating.  And I know how to use it.  Then my phone fills up and I’m forced to delete things that I don’t want to.  Please add. I pay monthly and still constantly get notices saying I need more storage. Yes I do and was recently forced to upgrade. Add me please. I am always getting notifications that I need to pay for more storage Please add me I am always send notices to pay for extra space in my cloud Add me. Add me pls Add me; I pay monthly for iCloud storage & still need more. Your email address will not be published. By submitting your comment and contact information, you agree to receive marketing emails from Top Class Actions regarding this and/or similar lawsuits or settlements, and/or to be contacted by an attorney or law firm to discuss the details of your potential case at no charge to you if you qualify. Required fields are marked * Comment * Name * Email *   Δ Please note: Top Class Actions is not a settlement\n\t\tadministrator or law firm. Top Class Actions is a legal news source\n\t\tthat reports on class action lawsuits, class action settlements,\n\t\tdrug injury lawsuits and product liability lawsuits. Top Class\n\t\tActions does not process claims and we cannot advise you on the\n\t\tstatus of any class action settlement claim. You must contact the\n\t\tsettlement administrator or your attorney for any updates regarding\n\t\tyour claim status, claim form or questions about when payments are\n\t\texpected to be mailed out.  Δ @2024 Top Class Actions. All Rights Reserved.\n                    \n                        Privacy Policy                     |\n                    \n                        Terms and Conditions "
}