{
    "title": "LinkedIn wants a piece of Wordle's success",
    "date": "3/17/2024",
    "url": "https://sg.news.yahoo.com/linkedin-wants-piece-wordles-success-144216626.html",
    "text": "Hello, and welcome back to Equity, the podcast about the business of startups, where we unpack the numbers and nuance behind the headlines. This is our Monday show, in which we take a look back at the weekend and what’s ahead in the week. We're coming to the end of earnings season, which means that there are just a few weeks left in the first quarter. With spring in the air, here's what we got into this morning: Apple may tap Google for AI: Sure, Apple is working on its own AI tech, but Google's Gemini model could be headed for an iPhone near you. Bloomberg broke the news. Grok goes open source: As promised, xAI's LLM Grok is out for people to play with. Most importantly, startup founders seem excited. Reddit's IPO makes progress: Oversubscription is always a good signal, but is also no promise of IPO riches to come. Gumroad says 'no thanks' to NSFW content: Another year, another platform booting adult creators. It's a tale as old as time! Gaming is coming to LinkedIn: Look I don't know what to tell you other than that all platforms eventually become one. For episode transcripts and more, head to Equity’s Simplecast website. Equity drops at 7 a.m. PT every Monday, Wednesday and Friday, so subscribe to us on Apple Podcasts, Overcast, Spotify and all the casts. TechCrunch also has a great show on crypto, a show that interviews founders and more! The siblings, 34, posted several videos on TikTok Friday I always get my five a day. Not fruit and vegetables. I mean the “Big Five” technology companies – Alphabet (Google), Amazon, Microsoft, Meta (Facebook) and Apple – which have their fingerprints over almost every aspect of my day-to-day life. And probably yours, too, as their digital infrastructure underpins a significant portion of the internet. The platform, formerly Twitter, is working on an addition to its Communities feature that would let X users create groups for X-rated material, according to app researchers.  Researcher Daniel Buchuk of Watchful, which analyzes app development and performance, spotted the feature in development.  An independent researcher, Nima Owji, also spotted the feature in development last month. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. Five people who took a Japanese health supplement have died and more than 100 have been hospitalized as of Friday, a week after a pharmaceutical company issued a recall of the products, officials said.  Osaka-based Kobayashi Pharmaceutical Co. came under fire for not going public quickly with problems known internally as early as January.  The first public announcement came March 22. Devastating glide bombs have been a major threat to Ukraine's forces, and they can only be beaten by shooting down planes before they're released. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The two perpetrators claimed that they were \"dissatisfied\" with Jacky Wu's \"hosting style\" A Russian fighter jet crashed into the sea off the Crimean port of Sevastopol on Thursday, the regional governor has said. The post Lian Hup Heng: Underrated atas cafe-style tarts & cake loaves for $3.80, hidden within a hawker centre appeared first on SETHLUI.com. \"We have witnessed the end of the effectiveness of towed artillery,\" the four-star general said, arguing the Army needs something different. Princess Eugenie and Princess Beatrice reportedly want to become working royals and are upset about King Charles snubbing them. The post New in town: Yappari Steak — Famous Okinawa steakhouse chain to open 1st SG outlet in VivoCity appeared first on SETHLUI.com. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone The post Nasi Ayam Sungai Buloh: Killer Hainanese chicken rice & crunchy juicy bean sprouts draws lunch crowd appeared first on SETHLUI.com. She mentioned her husband in her video, but he was notably absent. The suspected target constructed at a military training site in the desert could highlight China's willingness to use force. "
}