{
    "title": "Warren Buffett Sold His Apple Stock - Here's Why",
    "date": "3/3/2024",
    "url": "https://www.gobankingrates.com/investing/stocks/warren-buffett-sold-his-apple-stock-heres-why/",
    "text": "SEE BEST BANK OFFERS RETIRE ANYWHERE Search SEE BEST BANK OFFERS Banking Learn Savings Accounts Checking Accounts Certificate of Deposit Money Market Accounts Credit Unions Interest Rates Reviews Get Started Best Banks Best High Yield Savings Accounts Best Checking Accounts Best CD Rates Best Online Banks Best National Banks Best Money Market Accounts Best Premium Checking Accounts Best Regional Banks Best Neobanks SECURE YOUR FINANCIAL FUTURE Featured Best Banks  Latest on Mortgage  Top Money Experts  How To Retire Anywhere  Investing Learn Stocks Bonds Cryptocurrency Brokerages Funds Investing Strategy Reviews Get Started Best Investments Best Mutual Funds Best Stocks for Beginners Cheap Stocks to Buy Now Best Cryptocurrency to Invest In Next Big Cryptocurrency SECURE YOUR FINANCIAL FUTURE Featured Real Estate  Crypto on the GO  Top Money Experts  Best Banks  Credit Cards Learn News & Advice Rewards Retail Balance Transfer Reviews Get Started Best Credit Cards 2023 Best Reward Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Critics' Choice Credit Cards Best Travel Credit Cards Best Airline Credit Cards Credit Check Credit Build Credit Repair Credit Build Credit Fast FIND THE BEST CARD FOR YOU Featured Financially Savvy Female  GEN Z:The Future of Finance  Best Banks  Top Money Experts  Taxes Tax Filing Expert Tax Advice Tax Brackets and Rates Tax Deadline and Tax Due Dates Step-by-Step Guide to Filing Taxes I'm a Tax Expert: 8 Mistakes Filers Often Make Do I Have To File Taxes? Tax Deductions & Refunds What Can I Write Off on My Taxes? What Tax Credits Can I Qualify For? Homeowner Tax Breaks What Is the EV Tax Credit? Ways To Lower Your Tax Bill When Will I Get My Tax Refund? Average Tax Refund Check in Every State What Americans Do With Their Tax Refund Biggest Mistake People Make With Their Tax Refund Are Bonuses Taxed Higher? TAKE THE STRESS OUT OF TAXES Featured Financially Savvy Female  Tax Guide  Best Banks  How To Retire Anywhere  Loans Learn Home Loans Student Loans Personal Loans Auto Loans Get Started Best Student Loan Refinance Options Best Personal Loans Best Auto Loans SECURE YOUR FINANCIAL FUTURE Featured Financially Savvy Female  GEN Z:The Future of Finance  Best Banks  How To Retire Anywhere  Retirement Learn 401(k)s IRAs Social Security Retirement Planning Get Started 401(k)s for Beginners IRAs for Beginners IRAs vs. 401(k)s Retirement Savings Retire Early Retirement at Every Budget SECURE YOUR FINANCIAL FUTURE Featured Tax Guide  Best Banks  Financially Savvy Female  Top Money Experts  Saving & Spending Learn Saving Money Money Shopping Budgeting Home Tips Net Worth Financial Planning Travel Get Started Create a Budget Manage Debt Apply for a Mortgage Live Richer Podcast Create a Financial Plan SECURE YOUR FINANCIAL FUTURE Featured Tax Guide  How To Retire Anywhere  Best Banks  Top Money Experts  Trending Trending Topics News & Events Crypto on the Go Travel Rich Tax Guide Best Banks 2024 GEN Z: The Future of Finances Small Business Spotlight Financially Savvy Female\nEconomy Explained\nTop Money Experts\nRetirement at Every Budget \nJobs and Side Gigs\nWhat's the State of US Real Estate Financially Savvy Female Economy Explained Top Money Experts Retirement at Every Budget Jobs and Side Gigs What's the State of US Real Estate Trending Articles Top CD Rates Today: March 29 — Earn 5.30% APY Warren Buffett: 3 Investments He Won’t Waste Money On 2 Biggest Social Security Risks To Be Aware of if You Have Student Loan Debt SECURE YOUR FINANCIAL FUTURE Featured Tax Guide  Best Banks  Financially Savvy Female  Live Richer Podcast  Calculators Retirement Calculator  Gas Calculator  Mortgage Calculator  Tax Calculator  Categories Banking Learn Savings Accounts Checking Accounts Certificate of Deposit Money Market Accounts Credit Unions Interest Rates Reviews Get Started Best Banks Best High Yield Savings Accounts Best Checking Accounts Best CD Rates Best Online Banks Best National Banks Best Money Market Accounts Best Premium Checking Accounts Best Regional Banks Best Neobanks SECURE YOUR FINANCIAL FUTURE Featured Best Banks Latest on Mortgage Top Money Experts How To Retire Anywhere Investing Learn Stocks Bonds Cryptocurrency Brokerages Funds Investing Strategy Reviews Get Started Best Investments Best Mutual Funds Best Stocks for Beginners Cheap Stocks to Buy Now Best Cryptocurrency to Invest In Next Big Cryptocurrency SECURE YOUR FINANCIAL FUTURE Featured Real Estate  Crypto on the GO  Top Money Experts  Best Banks  Credit Cards Learn News & Advice Rewards Retail Balance Transfer Reviews Get Started Best Credit Cards 2023 Best Reward Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Critics' Choice Credit Cards Best Travel Credit Cards Best Airline Credit Cards Credit Check Credit Build Credit Repair Credit Build Credit Fast FIND THE BEST CARD FOR YOU Featured Financially Savvy Female  GEN Z:The Future of Finance  Best Banks  Top Money Experts  Taxes Tax Filing Expert Tax Advice Tax Brackets and Rates Tax Deadline and Tax Due Dates Step-by-Step Guide to Filing Taxes I'm a Tax Expert: 8 Mistakes Filers Often Make Do I Have To File Taxes? Tax Deductions & Refunds What Can I Write Off on My Taxes? What Tax Credits Can I Qualify For? Homeowner Tax Breaks What Is the EV Tax Credit? Ways To Lower Your Tax Bill When Will I Get My Tax Refund? Average Tax Refund Check in Every State What Americans Do With Their Tax Refund Biggest Mistake People Make With Their Tax Refund Are Bonuses Taxed Higher? TAKE THE STRESS OUT OF TAXES Featured Financially Savvy Female  Tax Guide  Best Banks  How To Retire Anywhere  Loans Learn Home Loans Student Loans Personal Loans Auto Loans Get Started Best Student Loan Refinance Options Best Personal Loans Best Auto Loans SECURE YOUR FINANCIAL FUTURE Featured Financially Savvy Female  GEN Z:The Future of Finance  Best Banks  How To Retire Anywhere  Retirement Learn 401(k)s IRAs Social Security Retirement Planning Get Started 401(k)s for Beginners IRAs for Beginners IRAs vs. 401(k)s Retirement Savings Retire Early Retirement at Every Budget SECURE YOUR FINANCIAL FUTURE Featured Tax Guide  Best Banks  Financially Savvy Female  Top Money Experts  Saving & Spending Learn Saving Money Money Shopping Budgeting Home Tips Net Worth Financial Planning Travel Get Started Create a Budget Manage Debt Apply for a Mortgage Live Richer Podcast Create a Financial Plan SECURE YOUR FINANCIAL FUTURE Featured Tax Guide  How To Retire Anywhere  Best Banks  Top Money Experts  Series Financially Savvy Female GEN Z: The Future of Finance Best Banks Retirement at Any Age Calculators Calculators Retirement Calculator Gas Calculator Mortgage Calculator Tax Calculator Trending Trending Trending Topics News & Events Crypto on the Go Travel Rich Tax Guide Best Banks 2024 GEN Z: The Future of Finances Small Business Spotlight  Financially Savvy Female Economy Explained Top Money Experts Retirement at Every Budget Jobs and Side Gigs What's the State of US Real Estate Trending Articles Top CD Rates Today: March 29 — Earn 5.30% APY Warren Buffett: 3 Investments He Won’t Waste Money On 2 Biggest Social Security Risks To Be Aware of if You Have Student Loan Debt SECURE YOUR FINANCIAL FUTURE Featured Tax Guide Best Banks Financially Savvy Female Live Richer Podcast Careers Our Mission Many of the offers appearing on this site are from advertisers from which this website receives compensation for being listed here. This compensation may impact how and where products appear on this site (including, for example, the order in which they appear). These offers do not represent all available deposit, investment, loan or credit products. Many of the offers appearing on this site are from advertisers from which this website receives compensation for being listed here. This compensation may impact how and where products appear on this site (including, for example, the order in which they appear). These offers do not represent all available deposit, investment, loan or credit products. Warren Buffett’s Berkshire Hathaway has made headlines once again, this time for selling off a portion of its Apple stock. The move has sparked interest and speculation among investors and market watchers alike. Here’s a closer look at the details and potential reasons behind this decision. In the last quarter of 2023, Berkshire Hathaway sold 10 million shares of Apple, which constitutes about 1% of its total holdings in the tech giant. Despite this sell-off, Berkshire still retains a significant stake in Apple, with more than 905 million shares valued at approximately $174 billion. This massive holding represents 6% of all Apple shares and accounts for one-fifth of Berkshire’s entire portfolio. Warren Buffett is renowned for his long-term investment strategy, famously stating, “If you aren’t willing to own a stock for 10 years, don’t even think about owning it for 10 minutes.” The recent sale is notable as it deviates from Buffett’s typical buy-and-hold approach. However, it’s important to note that Berkshire’s overall investment in Apple remains substantial. This isn’t the first time Berkshire Hathaway has adjusted its position in Apple. In 2020, the company sold off about $11 billion worth of Apple stock, a decision Buffett later described as “probably a mistake.” Despite this, Berkshire continued to show confidence in Apple, purchasing an additional $31 billion in shares in 2022. Apple has faced challenges in recent quarters, with four consecutive periods of revenue declines due to slower device sales amid economic uncertainties. However, the company reported year-on-year sales growth in the December quarter of 2023. Despite this, revenue from the crucial China region has declined, indicating growing competition for the iPhone maker. In addition to the Apple sell-off, Berkshire Hathaway also reduced its holdings in other companies. The conglomerate sold 80 million shares of HP, cutting its stake by 78%, and pared off 32% of its holdings in media company Paramount. Warren Buffett’s decision to sell a portion of Berkshire Hathaway’s Apple stock has generated significant interest. While the move might seem at odds with his long-term investment philosophy, it’s worth noting that Berkshire still maintains a substantial stake in the tech giant. As always, Buffett’s actions and insights will continue to be closely watched by the investment community. Editor's note: This article was produced via automated technology and then fine-tuned and verified for accuracy by a member of GOBankingRates' editorial team. More From GOBankingRates   Share This Article:  Stocks March 26, 2024 3 min Read Read more Stocks March 25, 2024 3 min Read Read more Stocks March 27, 2024 3 min Read Read more Stocks March 22, 2024 3 min Read Read more Stocks March 21, 2024 3 min Read Read more Stocks March 25, 2024 3 min Read Read more Stocks March 22, 2024 3 min Read Read more Stocks March 22, 2024 3 min Read Read more Stocks March 20, 2024 3 min Read Read more Stocks March 21, 2024 3 min Read Read more Stocks March 20, 2024 3 min Read Read more Stocks March 19, 2024 3 min Read Read more Stocks March 19, 2024 3 min Read Read more Stocks March 19, 2024 3 min Read Read more Stocks March 19, 2024 3 min Read Read more Stocks March 19, 2024 3 min Read Read more Get advice on achieving your financial goals and stay up to date on the day's top financial stories. By clicking the 'Subscribe Now' button, you agree to our Terms of Use and Privacy Policy. You can click on the 'unsubscribe' link in the email at anytime. Advertiser Disclosure: Many of the offers appearing on this site are from advertisers from which this website receives compensation for being listed here. This compensation may impact how and where products appear on this site (including, for example, the order in which they appear). These offers do not represent all deposit accounts available. © 2024 GOBankingRates. All Right Reserved. Sign up for our daily newsletter for the latest financial news and trending topics. For our full Privacy Policy, click here. "
}