{
    "title": "Apple Leads In India Smartphone Revenue In 2023",
    "date": "1/31/2024",
    "url": "https://www.rttnews.com/3420786/apple-leads-in-india-smartphone-revenue-in-2023.aspx",
    "text": "According to Counterpoint's report, Apple (AAPL) secured the top position in the smartphone market revenue chart in India for the first time, overthrowing longtime leader Samsung (SMSN.L). The report by the market researcher stated that Apple's share accounted for 23 percent of the net market revenue share, whereas Samsung's share stood at 21 percent. Last year, Samsung had topped the chart with a 22 percent smartphone revenue share, compared to Apple's 17 percent. \"Apple continues to see strong consumer demand, and is likely to maintain a strong double-digit shipment growth in CY24 as well. In comparison, the overall smartphone market could see a small 5% YoY growth through this calendar year—although much of this will depend on how global macroeconomic conditions play out through the rest of this year,\" said Tarun Pathak, research director at Counterpoint said. Last year, the iPhone maker's shipment totaled more than 10 million, growing at over 50 percent year-on-year, whereas Samsung shipped over 27.3 million smartphones. Vivo secured the third position with 17 percent of shipment volume. In the fourth quarter alone, Apple's shipment had grown 7 percent in India, while overall growth in the premium segment was 25 percent which was aided by the availability of steep discounts, easy financing schemes and lucrative promotions during the festive season. \"Apple's focus on India is also aiding the trend, with the brand surpassing the 10-million-unit mark in shipments and capturing the top position in revenue in a calendar year for the first time, propelled by robust demand for both its latest and older iPhones. The opening of own retail stores and increasing focus on large-format retail through regular promotions contributed to increased offline shipments,\" Shubham Singh, Research Analyst at Counterpoint Research said.  The made-in-India iPhones crossed $7 billion mark in value by the end of 2023, accounting for about 70 percent of all mobile phone exports and approximately 35 percent of all electronics exports from India, according to India Cellular and Electronics Association report. The average selling prices or ASP for Apple stood at $981 in 2023, which was the highest in the market, compared to Samsung's $350 ASP. The analysts at Counterpoint Research further claim that the increasing demand of iPhone will continue in the short-term due to multiple financing options, bank-linked discounts and strong resale programs offered by organized refurbished smartphone sellers in India. On Tuesday, the Indian government had further slashed the import duty on mobile spare parts from 15 percent to 10 percent, to boost the local smartphone component market. \"We believe the market will grow by 5% YoY next year driven by premiumization, diffusion of 5G in lower price bands and better macroeconomic conditions,\" Shilpi Jain, senior research analyst at Counterpoint concluded. For comments and feedback contact: editorial@rttnews.com Business News  Biotech Stocks Facing FDA Decision In April 2024 Biotech Stocks Facing FDA Decision in March 2024 Biotech Stocks Facing FDA Decision In November 2023 Major central banks, led by the U.S. Fed, dominated the economics scene this week with some delivering histroic shifts. In the U.S., the Fed was in focus as Chair Jerome Powell announced the latest policy decision and forward guidance. In Asia, all eyes were on the Bank of Japan as markets waited to see if the central bank would exit its ultra loose monetary policy. Find out how the Swiss central bank gave a surprise in Europe and learn what is the path ahead for U.K. interest rates. "
}