{
    "title": "Will Apple's Siri to get a makeover with Generative AI in iOS 18? Here's \nwhat report suggests | Mint",
    "date": "1/25/2024",
    "url": "https://www.livemint.com/technology/will-apples-siri-to-get-a-makeover-with-generative-ai-in-ios-18-heres-what-report-suggests-11706172732420.html",
    "text": "In a highly anticipated move, Apple is rumored to unveil a new update at this year's Worldwide Developer Conference (WWDC) with the launch of iOS 18 for iPhone. According to a recent report from the Financial Times, Apple is set to make a significant foray into the realm of artificial intelligence (AI) with a focus on generative AI, marking a departure from its traditional approach. Speculations suggest that the highlight of iOS 18 will be a revamped Siri, powered by Apple's proprietary Large Language Models (LLMs), possibly named AppleGPT. While competitors like Google and Samsung have already integrated AI heavily into their smartphones, Apple has taken a more cautious approach, diligently perfecting its AI technology behind the scenes. As per the report, Morgan Stanley analysts predict that the upcoming Siri update will be fueled by generative AI. Reportedly, Igor Jablokov, CEO of AI Pryon and founder of Yap, told the publication, \"They tend to hang back and wait until there is a confluence of technology, and they can offer one of the finest representations of that technology.\" Moreover, the report adds that Apple has been dropping hints about its AI ambitions, with analyst Jeff Pu stating that generative AI will start making its way to iPhones and iPads in late 2024. To support this initiative, Apple is reportedly in the process of building approximately 100 AI servers this year, with plans for more in 2024, signaling a move towards cloud-based AI. Additionally, Apple is said to be developing on-device AI technology known as 'edge AI.' The company aims to integrate AI into various applications, with potential enhancements across its ecosystem. Apple Music may see the introduction of auto-generated playlists, while productivity apps like Keynote and Pages could feature an automatic slide deck generation feature. Apple is also reportedly exploring ways to incorporate generative AI into AppleCare, enhancing customer support services.   Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}