{
    "title": "Apple Stock Could Jump 23% As AI Will Drive iPhone Upgrade Cycle: BofA",
    "date": "1/18/2024",
    "url": "https://markets.businessinsider.com/news/stocks/apple-stock-price-upside-outlook-ai-iphone-cycle-bofa-upgrade-2024-1",
    "text": "       Apple stock is poised to surge 23% as the company sees a surge in iPhone upgrades thanks to AI technologies, according to Bank of America. The bank upgraded Apple on Thursday to \"Buy\" from \"Neutral\" and increased its price target to $225 from $208. Bank of America had downgraded Apple to \"Neutral\" in September 2022. The biggest reason for the upgrade comes from Bank of America's belief that new AI technologies embedded in the iPhone will drive a strong upgrade cycle for iPhone users who are still using older phones. \"Apple should continue to see upgrade demand from older device owners, especially as AI enabled Apps will require higher processor power,\" Bank of America analyst Wasmi Mohan said. The bank estimates that more than 70% of iPhone users are currently using the iPhone 13 or an older model, according to internal surveys of iPhone users. \"The top three most popular iPhones, amongst our survey respondents in the US, are iPhone 13, iPhone 11, and iPhone 12, respectively,\" Mohan said. Potential AI features that could be incorporated into new iPhone models include live voice translations, enhanced zoom functions for the camera, better editing tools for texts and e-mails, and a fully integrated large language model. \"Apple has already been using AI in several photo and video applications, but with better hardware we think Apple could incorporate on-device AI with some of the features above and over the next few years starting with iPhone 16,\" Mohan said. Other reasons for Mohan's bullish call on Apple include higher growth in the company's Services division, increased profit margins, continued capital returns via stock buybacks and dividends, and solid sales of the upcoming Vision Pro device. \"Vision Pro could surpass iPad revs over time as spatial computing takes hold offering differentiated use cases driving services upside,\" Mohan said. The bank estimates that Apple will sell \"several hundred thousand\" units of the Vision Pro to Apple enthusiasts in 2024, and that the company could sell millions of units once the price point drops from $3,500 to a range of $1,500 to $2,000. Apple stock jumped more than 3% on Thursday following the upgrade. Read next Indices Commodities Currencies Stocks Jump to "
}