{
    "title": "Xbox Cloud Gaming Isn’t Coming to iOS due to Apple’s Restrictions; Spencer \nSays Game Pass Isn’t Discrete Focus",
    "date": "2/16/2024",
    "url": "https://wccftech.com/xbox-cloud-gaming-isnt-coming-to-ios-due-to-apples-restrictions-spencer-says-game-pass-isnt-discrete-focus/",
    "text": "Following yesterday's Xbox Business update, Microsoft Gaming CEO Phil Spencer provided extra details on what gamers can expect in an interview with The Verge. Journalist Tom Warren asked whether Microsoft would try to bring a proper Xbox Cloud Gaming app to iOS now that Apple has been forced to open up the store in Europe following the arrival of the Digital Markets Act. Apple had also recently eased the requirements for game streaming apps on iOS. Whereas developers had to submit individual apps for each game included, that's no longer the case. Still, Spencer replied that's not happening due to Apple's heavily criticized compliance plan. There’s not room for us to monetize Xbox Cloud Gaming on iOS. I think the proposal that Apple put forward — and I thought Sarah Bond’s comments on this were right on — doesn’t go far enough to open up. In fact, you might even say they go the opposite direction in some way, but they definitely don’t go far enough to open up competition on the world’s largest gaming platform. On the other hand, Spencer reiterated Microsoft's interest in opening an Xbox store on mobile as soon as possible, adding that it would drive engagement thanks to hits like Candy Crush, Call of Duty, Diablo Immortal, and Minecraft. The Microsoft executive then explained Game Pass (now at 34 million subscribers) is not at all a 'discrete focus', as the company is perfectly happy with people who just want to keep buying games regularly within the Xbox ecosystem (and elsewhere, too). Our goal is not to make everybody a Game Pass subscriber. I’ve said many times that maybe 10-15 percent of our content and service revenue is subscriber revenue. It’s a good business for us today, Game Pass, but in no way is there a plan that says ‘Okay, everybody needs to become a Game Pass subscriber.’ We don’t have to have a discrete focus just on Game Pass, we should really just think about the health of the overall business on Xbox. What did you think of the Xbox business update overall? Vote in the poll below! Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}