{
    "title": "Apple risks PR fiasco as morons 'drive' with Vision Pro",
    "date": "2/11/2024",
    "url": "https://finance.yahoo.com/news/apple-risks-pr-fiasco-morons-133000523.html",
    "text": " Car pile-ups are often the result of drivers following one another too closely in low-visibility conditions. Apple seems to be tempting one by being too tolerant of customers using its devices while in the drivers’ seat, and lacking the foresight to anticipate where this could lead. Footage of people using Apple’s new Vision Pro from behind the wheel within days of the headset going on sale drew the attention of US Transportation Secretary Pete Buttigieg this week, along with the agency within his department that regulates traffic safety. To be clear, as Buttigieg himself reiterated, all vehicles for sale in the United States require human drivers to be fully engaged at all times and ready to take control of the wheel. There is no such things as a \"self-driving car\" at this point, including those equipped with Tesla's Autopilot. The National Highway Traffic Safety Administration followed up with a statement deeming driving with headsets “reckless” and in disregard of everyone on the road. Reminder—ALL advanced driver assistance systems available today require the human driver to be in control and fully engaged in the driving task at all times. pic.twitter.com/OpPy36mOgC — Secretary Pete Buttigieg (@SecretaryPete) February 5, 2024 Apple, for its part, declined to comment on the videos and referred to safety guidance on its website that discourages use of its device while operating a moving vehicle. Pointing to a single bullet point buried more than 700 words into a support page that most of its users will never read is an insufficient response to customers misusing the Vision Pro. One doesn’t need spatial computing goggles to envision a deadly accident setting off a firestorm in Washington and drawing more attention to the broader issue of distracted driving. That’s a big risk for Apple and its most critical product, the iPhone, as mobile phone use is all but certainly a factor in rising roadway deaths. When Apple introduced the iPhone in 2007, over 4,600 pedestrians were killed on US roadways, Cambridge Mobile Telematics noted in its latest report on distracted driving. By 2021, 85% of Americans owned a smartphone and almost 7,500 pedestrians were killed, the most in 40 years. “Drivers are spending more time using their phones while driving and doing it on more trips,” the telematic services provider said in the report. According to its data, drivers interacted with their phones on almost 58% of trips in 2022, up from 54% in 2020. In perhaps the most alarming statistic of all, 34% of phone motion distraction happens above 50 miles per hour. Apple has taken some action, enabling iPhone users to activate a setting aimed at keeping users focused on driving when they’re in a moving car. But the company itself says on its support page about the feature that it “is not a substitute for following all the rules that prohibit distracted driving.” Apple surely didn’t want these viral videos to distract from the merits of its hot new product. But now that it has, it ought to do more about it. If the iPhone can automatically activate a focus setting when it detects that a user might be driving, Apple ought to equip the Vision Pro with similar capability, at a minimum. While it’s at it, the company should make that automatic activation a standard setting in the iPhone. Buttigieg and NHTSA undoubtedly would welcome Apple and its mobile-device rivals competing to keep drivers’ eyes on the road. You Might Also Like GM and F1, the return of hybrids, and a Scout Motors sneak peek | Autoblog Podcast #820 The 10 most deeply discounted electric cars right now Buick shows off Wildcat EV in gold, debuts new brand tagline Related Quotes "
}