{
    "title": null,
    "date": "2/13/2024",
    "url": "https://finance.yahoo.com/news/eu-says-several-apple-microsoft-114738422.html",
    "text": "By Foo Yun Chee, Bart H. Meijer and Martin Coulter BRUSSELS (Reuters) -Apple has won an exemption for its iMessage and Microsoft for its Bing search engine from new EU tech rules after the companies convinced antitrust regulators their services are not gateways for businesses to reach end-users. The European Union's Digital Markets Act (DMA), which takes effect in three weeks' time, requires Microsoft, Apple, Alphabet's Google, Amazon, Meta Platforms and ByteDance to allow third-party apps or app stores on their platforms and make it easier for people to switch to rivals. The companies are also prohibited from favouring their services over rivals. Following a five-month investigation, the European Commission found iMessage, Bing, Edge and Microsoft Advertising \"did not qualify as gatekeeper services,\" the EU executive said in a statement. The Commission said Apple's App Store, iOS operating system and Safari browser will continue to be classified as gatekeepers as will Microsoft's Linkedin social network and Windows operating system. It made \"a thorough assessment of all arguments, taking into account input by relevant stakeholders\", the Commission said without providing details of the companies' arguments. Apple had said iMessage usage is negligible, even on its devices, compared to rival messaging services in the EU and that iMessage is not an important channel for businesses to reach users in the bloc. \"Consumers today have access to a wide variety of messaging apps, and often use many at once, which reflects how easy it is to switch between them,\" an Apple spokesperson said. Microsoft said that Bing, Edge and Microsoft Advertising operate as challengers in the market and are of relatively small scale, meaning they are not important gateways for business users. \"We will continue to engage with the Commission and industry at large to ensure Microsoft's other designated platforms comply fully with the DMA,\" a Microsoft spokesperson said. Lazar Radic, an antitrust expert at the International Center for Law and Economics, said: \"It is a good sign that the Commission has considered market realities, instead of just slapping the 'gatekeeper' label on iMessage because it fulfills certain quantitative thresholds. \"This suggests the Commission is capable of avoiding the temptation to over-regulate.\" However, the Coalition for Open Digital Ecosystems (CODE), whose members include Google, Meta Platforms and Qualcomm, disagreed with the Commission's decision to exempt services such as iMessage. \"Today’s surprising decision undermines the objectives of the DMA, as well as its potential to improve choice and contestability for all Europeans,\" it said in a statement. (Reporting by Bart Meijer and Foo Yun Chee; Editing by Barbara Lewis and Keith Weir) Related Quotes "
}