{
    "title": "Beond Introduces Apple Vision Pro for Inflight Entertainment to the Maldives",
    "date": "2/20/2024",
    "url": "https://businesstravelerusa.com/news/beond-introduces-apple-vision-pro/",
    "text": "Travel news, reviews and intel for high-flyers The new luxury airline is debuting Apple Vision Pro headsets as inflight entertainment. This will be the first airline to offer Apple’s latest product onboard by Rachel Dube February 20, 2024 News share Photo: Courtesy of Apple Beond, the world’s first premium leisure airline, will offer Apple Vision Pro to select passengers onboard its flights to the Maldives. The experience will let passengers take the onboard entertainment experience to the next level and provide immersive experiences showcasing the Maldives. \n\nhttps://businesstravelerusa.com/wp-content/uploads/2024/02/Apple-Vision-Pro-availability-Environments.mp4\n \n“The Apple Vision Pro will transform the inflight entertainment experience, and we will be first to offer it to select passengers,” says Beond’s Chairman and CEO, Tero Taskila. “In addition to our existing and ever-growing library of inflight content such as movies and games, Beond will showcase stunning resort destinations and activities in the Maldives. We are working now with partners in the Maldives to prepare truly amazing footage.”\n“The inflight experience will build anticipation for passengers before they arrive in the Maldives. Offering the Apple Vision Pro is another step in our vision of delivering a premium travel experience to our customers, from the start to finish of their journey. We’re proud to be the first airline to deploy the technology.”\nPhoto: Courtesy of Apple\nBeond will stock its aircraft with Apple’s newest headsets for inflight entertainment beginning in July. The devices will have the airline’s existing onboard entertainment and the immersive Maldives experience. However, not all passengers will get to use the devices as they’ll only be available to those who pay for the Opulence class. \nAbout The Onboard Experience \nThe new Maldives-based airline debuted in November with an all-lie-flat Airbus A319. It features an all-business class cabin with 44 seats arranged in a 2-2 configuration. The aircraft has a light gray livery with gold trimmings that make it feel ultra-luxe. \nBeond successfully launched commercial services from Munich (MUC), Zurich (ZRH), and Riyadh (RUH) to Malé, the capital of the Maldives. The airline plans to debut flight services from Milan (MXP), Dubai (DWC), and Bangkok (BKK) to the archipelago at some point this year. \nPhoto: Courtesy of BEOND\n“It’s targeting people seeking luxury experiences in travel,” said Tero Taskila, founder and chief executive of Beond in a press release. “We have, really, a niche where the product has been designed with the luxury, leisure traveler in mind.”\nBeond intends to target luxury leisure travelers and has plans to fly from various destinations to the Maldives. The airline launched three routes with its launch but plans to continue adding routes. Eventually, Beond wants to expand its fleet to 32 aircraft that fly to more than 60 destinations to and from the Maldives. \nPhoto: Airbus A319. Courtesy of BEOND\n“Our aim is simple: to fly our customers to the most unique and unspoiled destinations where they can release their inner explorer on the most memorable vacation of their lives,” said Taskila in a press release. \nWhen Beond inaugurated its first flight, the leisure airline had one aircraft in its fleet. It recently acquired its second and has plans to continue adding more planes to its fleet in 2024. After launching its first commercial flight, Beond plans to rapidly expand. The airline is based in the Maldives but has headquarters in Dubai. Beond, the world’s first premium leisure airline, will offer Apple Vision Pro to select passengers onboard its flights to the Maldives. The experience will let passengers take the onboard entertainment experience to the next level and provide immersive experiences showcasing the Maldives.  “The Apple Vision Pro will transform the inflight entertainment experience, and we will be first to offer it to select passengers,” says Beond’s Chairman and CEO, Tero Taskila. “In addition to our existing and ever-growing library of inflight content such as movies and games, Beond will showcase stunning resort destinations and activities in the Maldives. We are working now with partners in the Maldives to prepare truly amazing footage.” “The inflight experience will build anticipation for passengers before they arrive in the Maldives. Offering the Apple Vision Pro is another step in our vision of delivering a premium travel experience to our customers, from the start to finish of their journey. We’re proud to be the first airline to deploy the technology.” Photo: Courtesy of Apple Beond will stock its aircraft with Apple’s newest headsets for inflight entertainment beginning in July. The devices will have the airline’s existing onboard entertainment and the immersive Maldives experience. However, not all passengers will get to use the devices as they’ll only be available to those who pay for the Opulence class. The new Maldives-based airline debuted in November with an all-lie-flat Airbus A319. It features an all-business class cabin with 44 seats arranged in a 2-2 configuration. The aircraft has a light gray livery with gold trimmings that make it feel ultra-luxe. Beond successfully launched commercial services from Munich (MUC), Zurich (ZRH), and Riyadh (RUH) to Malé, the capital of the Maldives. The airline plans to debut flight services from Milan (MXP), Dubai (DWC), and Bangkok (BKK) to the archipelago at some point this year. Photo: Courtesy of BEOND “It’s targeting people seeking luxury experiences in travel,” said Tero Taskila, founder and chief executive of Beond in a press release. “We have, really, a niche where the product has been designed with the luxury, leisure traveler in mind.” Beond intends to target luxury leisure travelers and has plans to fly from various destinations to the Maldives. The airline launched three routes with its launch but plans to continue adding routes. Eventually, Beond wants to expand its fleet to 32 aircraft that fly to more than 60 destinations to and from the Maldives. Photo: Airbus A319. Courtesy of BEOND “Our aim is simple: to fly our customers to the most unique and unspoiled destinations where they can release their inner explorer on the most memorable vacation of their lives,” said Taskila in a press release. When Beond inaugurated its first flight, the leisure airline had one aircraft in its fleet. It recently acquired its second and has plans to continue adding more planes to its fleet in 2024. After launching its first commercial flight, Beond plans to rapidly expand. The airline is based in the Maldives but has headquarters in Dubai. Website created by Ink Studio "
}