{
    "title": "Apple's ambitious leap: Plans for 'iRing,' 'iGlasses,' and \ncamera-integrated AirPods suggested | Mint",
    "date": "2/26/2024",
    "url": "https://www.livemint.com/technology/gadgets/apples-ambitious-leap-plans-for-iring-iglasses-and-camera-integrated-airpods-suggested-11708948389348.html",
    "text": "In a bid to continue its trajectory of groundbreaking innovation, Apple is reportedly venturing into the realm of wearable technology with plans for an 'iRing' and 'iGlasses', according to a recent report by Bloomberg columnist Mark Gurman. Despite the company's existing success with the Apple Watch and the recent launch of the Vision Pro headset, Apple seems poised to explore new frontiers in the wearables market. Gurman's report suggests that Apple's foray into smart glasses aims to rival products like Amazon Echo Frames and Meta Ray-Bans, but with a futuristic twist. The envisioned Apple smart glasses are expected to integrate smart audio and artificial intelligence (AI) features, providing users with an advanced and immersive experience. Furthermore, there are indications that Apple is also working on AirPods equipped with cameras, paving the way for a unique perspective on wearable technology by embedding cameras directly into users' ears. While Gurman describes the concept of a smart ring as \"hypothetical,\" there's speculation that such a device could focus on health and fitness, potentially competing with Samsung's anticipated release at the MWC 2024. Nevertheless, Gurman emphasizes that these projects are still in their early planning stages and may take some time before hitting the market. One notable project in the works is the development of camera-integrated AirPods under the codename B798. These innovative products align with Apple's broader strategy of incorporating AI seamlessly into their ecosystem, with the smart glasses and camera-equipped earbuds potentially offering users a unique blend of visual and voice-assisted AI capabilities to enhance their daily tasks. In addition to these exciting developments in wearable tech, Gurman highlights Apple's plans for a user interface (UI) overhaul with the upcoming iOS 18 update. While the redesign is expected to be evident in both iOS and macOS, Gurman suggests that it might not be a total overhaul akin to visionOS. The speculated timeline for the iOS redesign points to a potential showcase later this year, possibly in the summer. However, the revamped macOS is not anticipated until 2025 or 2026.  Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}