{
    "title": "Buy And Sell Stocks On Apple Vision Pro, Meta Quest? eToro Is Trying To \nMake It A Reality",
    "date": "2/27/2024",
    "url": "https://www.benzinga.com/news/24/02/37328688/etoro-explores-virtual-reality-to-let-traders-buy-and-sell-stocks-using-apple-meta-vr-headsets",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW In a recent interview, eToro CEO Yoni Assia disclosed the company’s intention to introduce its retail trading app to Apple and Meta Platforms‘ VR headsets. What Happened: Assia revealed that eToro is exploring the possibility of launching its trading platform on the Apple Vision Pro and Meta Quest VR devices. This move would make eToro one of the first financial service firms to establish a virtual reality storefront, reported CNBC on Tuesday. \"We are planning to look at how we think about eToro with natural language, with voice, but actually also in the realm of AR VR, during 2024,\" Assia said. Assia also highlighted the company’s focus on artificial intelligence and its plans to integrate voice interaction features into the app. He emphasized that AR and VR are key priorities for the firm in 2024. See Also: Microsoft Almost Sold Bing To Apple Back In 2018, But Google’s Court Documents Reveal Why Deal Didn’t Go Through Despite not providing a specific timeline for the AR launch, Assia indicated that it will be a significant focus for eToro in 2024. He also suggested that the AR experience would be primarily used by advanced traders. eToro is exploring virtual reality and augmented reality experiences for users to engage with its trading platform, allowing them to buy and sell stocks through digital screens within VR headsets. While still in the early stages, eToro’s CEO believes this technology could become more mainstream in the future. The company is experimenting with integrating artificial intelligence into the experience and aims to showcase a prototype in the near future. Why It Matters: The move by eToro to bring its trading app to AR/VR headsets is a significant step for the financial services industry. This development aligns with the growing interest in AR/VR technologies, as seen in the recent endorsement of the Apple Vision Pro by tech leaders like Sam Altman. Earlier this month, Elon Musk suggested that the best way to experience his social media platform, X, was by using a premium plan and pairing it with the Apple Vision Pro. This endorsement from Musk further underlines the potential of the Apple VR headset as a platform for innovative and immersive experiences. Despite the initial excitement surrounding the Apple Vision Pro, users have reported unexplained cracks in the front glass of the device, raising concerns about the product’s durability and quality control. The successful integration of eToro’s trading app into the Apple Vision Pro could help bolster confidence in the headset’s capabilities and potential applications. Read Next: ‘It’s Coming:’ Elon Musk Hints At Launching ‘XMail’ As Alternative To Gmail Even As Google’s Service Says It’s ‘Here To Say’ Image Via Shutterstock Engineered by Benzinga Neuro, Edited by \nKaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}