{
    "title": "Jeff Bezos sells Amazon stock, Warren Buffett sells Apple",
    "date": "2/17/2024",
    "url": "https://qz.com/jeff-bezos-warren-buffett-amazon-apple-disney-stock-1851264728",
    "text": "Jeff Bezos keeps selling Amazon stock. Warren Buffett is selling Apple stock — but buying others. Amazon got sued over a button you’ve surely pressed many times. And Disney+ has a piracy problem. Those were just some of the most popular stories this week on Quartz. Check out the slideshow above for more. 2 / 11 Perhaps for Amazon’s founder, the third time’s a charm. Jeff Bezos has been on an Amazon stock-selling spree — and this week he offloaded shares for the third time in a month. Read More 3 / 11 Warren Buffett’s holding company Berkshire Hathaway, which owns GEICO and Dairy Queen, sold off about 1% of its stake in Apple in the last quarter of 2023, the company revealed in new SEC filings. Read More 4 / 11 Amazon allegedly tricked users into buying more expensive products through the use of its “Buy Box,” according to a class action lawsuit filed last week. The Buy Box, which features a “Buy Now” and “Add to Cart” button next to eligible items, funnels users into terrible deals through the ease of one-click shopping according to the complaint, Ars Technica reports on Monday. Read More 5 / 11 Streaming was supposed to kill media piracy. When services like Netflix and Spotify first popped up, they offered subscribers access to thousands of movies, films, TV shows, and songs all ad-free for a relatively low monthly fee. Read More 6 / 11 At the University of Pennsylvania, undergraduate students in its school of engineering will soon be able to study for a bachelor of science degree in artificial intelligence. Read More 7 / 11 After Taco Bell dropped its entire 2024 menu plan like it was a new iPhone release, you’d think the chain wouldn’t be too worried about being upstaged by its competition. But  there’s an underdog in the fast food taco space ready to challenge Taco Bell’s nationwide footprint: Del Taco has announced major expansion plans and has its sights set on supremacy. Read More 8 / 11 An unspecified defect in early model Starlink satellites has prompted SpaceX to preemptively deorbit the units before they potentially fail and become hazards in low Earth orbit. While the company remains confident that the deorbiting of these problematic units will prevent any issues, this incident underscores the challenges and uncertainties in navigating the realm of gigantic satellite networks. Read More 9 / 11 Just seven years after being founded, OpenAI’s annual run rate — a measure of one month’s revenue multiplied by 12 — hit the $2 billion revenue mark. That puts the AI startup among a handful of companies, including Google and Meta, to have made billions in revenue within just a decade of existence. Read More 10 / 11 The Kansas City Chiefs won Super Bowl LVIII on Sunday night, in a 25-22 thriller against the San Francisco 49ers that made them the first team in two decades to win back-to-back NFL championships. And in between the action of the very long overtime game, some of the biggest brands in the US shelled out some of the biggest bucks for advertising airtime that cost $7 million for a 30-second spot. Read More 11 / 11 "
}