{
    "title": "Apple investors’ focus shifting to artificial intelligence",
    "date": "2/14/2024",
    "url": "https://macdailynews.com/2024/02/14/apple-investors-focus-shifting-to-artificial-intelligence/",
    "text": "Update font size. Reset  Wall Street analysts say now that Apple has launched its spatial computing headset, Apple Vision Pro, investor focus is shifting to the company’s upcoming announcements on artificial intelligence, especially generative AI. Patrick Seitz for Investor’s Business Daily:\n ‎ That news could be a major catalyst for Apple stock. On a conference call with analysts on Feb. 1, Chief Executive Tim Cook said Apple will share its exciting work in the AI space later this year. Wedbush Securities analyst Daniel Ives thinks Apple will detail its AI innovations at its Worldwide Developers Conference, or WWDC, in June. “We believe the ‘Super Bowl moment for Apple’ will be when Cook & Co. finally take the covers off the generative AI technology being worked on in the labs of Apple Park and introduce it to developers and consumers at WWDC,” Ives said in a note to clients this week. Apple is likely to add AI features to its iPhone 16 smartphone lineup this fall, Ives said. That will kick off a new cycle of growth for Apple, he said. ‎\nMacDailyNews Note: Ives currently has an “Outperform” rating on Apple stock with a 12-month target price of $250.\n ‎\nPlease help support MacDailyNews. Click or tap here to support our independent tech blog. Thank you! Support MacDailyNews at no extra cost to you by using this link to shop at Amazon. As the focus shifts to artificial intelligence, businesses are seeking innovative solutions to leverage AI capabilities. Stay ahead of the curve with software development team augmentation, empowering your organization to harness the potential of AI technologies for growth and innovation. This site uses Akismet to reduce spam. Learn how your comment data is processed. “Ted Lasso” star and writer Brett Goldstein is set to appear in a guest star role in “Shrinking” Season 2 at Apple TV+… Apple’s M3 Ultra chip may be designed as a unique standalone chip, rather than two M3 Max chips joined together as in the M1 Ultra and… Alphabet subsidiary Google’s Android website has added a new landing page for Google Messages which touts that RCS on Apple’s iPhone… Sunshine is launching a new AI product, Shine. The product offers a photo-sharing app and an events website. Co-founder Marissa Mayer tells… Apple filed a lawsuit earlier this month against former software engineer Andrew Aude, alleging he leaked info about products he hated… Enter your email address to follow MacDailyNews and receive notifications of new posts by email. Email Address Follow :-) "
}