{
    "title": "Apple Sports: Tech Giant Unveils New Live Sports App",
    "date": "2/23/2024",
    "url": "https://manofmany.com/tech/apple/apple-sports",
    "text": "Every product is carefully selected by our editors and experts. If you buy from a link, we may earn a commission. Learn more.\nFor more information on how we test products, click here. Published: 23 Feb 2024  Technology company Apple has strengthened its ties to the sporting world, unveiling ‘Apple Sports’; a new unrestricted app that delivers live score updates and betting odds. The platform, which launched in the U.S., the U.K., and Canada on Wednesday, supports statistics for the NBA, NHL, NCAA, Premier League, Bundesliga and the MLS, to which Apple already owns the exclusive streaming rights. The announcement continues Apple’s recent push into the world of live sports entertainment, following the successful launch of its MLS Season Pass in 2023. Eddy Cue, senior vice president of services, said the new Apple Sports app was just another way the company is helping fans engage with their favourite teams. “We created Apple Sports to give sports fans what they want — an app that delivers incredibly fast access to scores and stats,” Cue said. “Apple Sports is available for free in the App Store, and makes it easy for users to stay up to date with their favourite teams and leagues.” Apple Sports is a new free app created by technology company Apple that provides live up-to-date scores, betting odds, statistics and more on several international sporting leagues. According to the technology company, users customise their scoreboards on Apple Sports by following their favourite teams, tournaments, and leagues. “Fans can easily navigate between scores and upcoming games; explore play-by-play information, team stats, lineup details, and live betting odds; and tap to go to the Apple TV app to watch live games from Apple and connected streaming apps,” Apple said in a press release. “Apple Sports will also seamlessly sync with favourites selected within the My Sports experience including in the Apple TV app and Apple News.” Apple Sports works by tapping into existing streaming services, allowing you to utilise Apple TV+ or other supported platforms to view live games. Interestingly, while the app does show betting odds, Apple has confirmed that the app does not support betting. Instead, users can disable betting odds if they choose. At launch, Apple has made several sports available, including those that it has exclusive rights for. According to the technology company, Apple Sports keeps fans up to date on the following leagues currently in season: Additional leagues will become available on Apple Sports over time, including MLB, NFL, NCAAF, NWSL, and WNBA for their upcoming seasons. Apple Sports officially launched in the U.S., the U.K. and Canada on February 22, with support for English, as well as French and Spanish where available. The app is free to download through the App Store and is compatible with all iPhone models running iOS 17.2 or later. Apple has not confirmed if or when the app will launch in Australia, however, it is worth noting that international streaming, licensing and distribution rights for sports vary from region to region, meaning Apple may have to negotiate with Australian rights holders prior to launch. Apple Sports is free to download through the App Store and is compatible with all iPhone models running iOS 17.2 or later Keep up with the latest trends, best stories, and crucial updates from Man of Many direct to your inbox. Apple Sports provides statistics, lives scores and betting odds on the NBA, however, it does not live broadcast the footage. Editor-in-Chief Nick Hall is an award-winning journalist and the current Editor-in-Chief of Man of Many. With an extensive background in the media industry, he specialises in feature writing, lifestyle and entertainment content. Nick is a former Mumbrella Publish Awards ‘Editor of the Year’ and B&T's ‘Best of the Best – Journalist’ category winner. Prior to working at the men’s lifestyle publication, Nick spent two years as a journalist with Inside Franchise Business, focusing on small business, finance and legal reporting. Featured Post Featured Post Keep up with the latest trends, best stories, and crucial updates from Man of Many direct to your inbox. Man of Many provides content of a general nature that is designed for informational purposes only. The content is not intended to be a substitute for professional medical advice, diagnosis, or treatment or for professional financial advice. Click here for additional information. © 2024 Man of Many Pty Ltd – Sydney, Australia ABN 73 163 331 280MAN OF MANY® and its Logos are registered trademarks of Man of Many Pty Ltd. "
}