{
    "title": "Big Tech In Trouble: Apple To Receive Hefty Fine For Alleged EU Law Breach \n- Apple (NASDAQ:AAPL)",
    "date": "2/18/2024",
    "url": "https://www.benzinga.com/news/24/02/37195770/big-tech-in-trouble-apple-to-receive-hefty-fine-for-alleged-eu-law-breach",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW In a first, tech giant Apple Inc. AAPL is set to be fined by Brussels over accusations of violating EU law related to its music streaming services, according to insiders familiar with the ongoing investigation as reported by the Financial Times. The fine, expected to be around €500 million and likely to be made public early next month, is the result of a European Commission antitrust probe. The investigation has been examining whether Apple has utilized its platform to give preference to its services over its competitors'.  The investigation began following a formal complaint filed by music-streaming app Spotify in 2019. Spotify alleged that Apple was restricting apps from informing iPhone users about more cost-effective options for accessing music subscriptions outside of the App Store. The commission is expected to declare Apple's actions as illegal and a violation of the bloc's rules that ensure competition in the single market. The tech giant is expected to face accusations of leveraging its position and enforcing anti-competitive practices against its competitors. See Also: Elon Musk Taunts OpenAI, Apple's Animation, Nvidia's Triumph, Ark's Strategy Revamp And More: This Week In AI  This fine will rank among the most substantial financial penalties levied by the EU against major tech firms.The commission previously fined Google over several years, amounting to about €8 billion, a decision that is currently being contested in court. Although Apple was fined €1.1 billion in France for alleged anti-competitive behavior in 2020, this will be the first time that Brussels has imposed such a penalty on the company for antitrust breaches. This EU action against Apple is set to reignite tensions between Brussels and Big Tech, as companies are under pressure to demonstrate compliance with new rules aimed at promoting competition and enabling smaller tech rivals to thrive. Apple, which can appeal the ruling in EU courts, has not yet commented on the impending ruling but had previously expressed satisfaction with the narrowing of the charges and pledged to tackle concerns while promoting competition. Read Next: Magnificent 7 Stocks Trigger Concerns Of Market Overheat: Bubble Trouble? This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}