{
    "title": "Warren Buffett’s Berkshire Hathaway Trims Its Massive Stake in Apple | Mint",
    "date": "2/15/2024",
    "url": "https://www.livemint.com/companies/news/warren-buffett-s-berkshire-hathaway-trims-its-massive-stake-in-apple-11707968911092.html",
    "text": "Warren Buffett’s Berkshire Hathaway trimmed its flagship position in Apple in the fourth quarter. Berkshire sold about 1% of its Apple shares in the final three months of 2023, leaving it with a 5.9% stake in the iPhone maker worth about $167 billion on Wednesday, according to Dow Jones Market Data. The Apple position held by the famed investor’s Omaha, Neb., company has grown to an outsize share of its stock portfolio. As the tailwinds of the tech trade pushed Apple shares higher, investors who follow the company have wondered how much bigger Buffett and his deputies would allow the position to grow. Apple shares haven’t kept pace with some of its Big Tech peers in recent months. The iPhone-maker recently lost its crown as the U.S.’s most valuable company to Microsoft. It has faced a slew of challenges, including regulatory scrutiny of its App Store policies, declining sales in China and investor worries about its growth prospects. Several analysts have downgraded the stock. Berkshire also reduced its position in HP, while adding to its stakes in Chevron and Occidental Petroleum in the fourth quarter. Berkshire revealed the moves Wednesday afternoon in a filing with the Securities and Exchange Commission. Institutional investors who manage at least $100 million in U.S. stocks and other types of equities are required to disclose their positions at the end of each quarter. Investors have 45 days after the quarter ends to submit the Form 13F filings, so the lists provide a dated look at portfolios. Still, many investors study Berkshire’s filing for a read on how Buffett and his investing deputies may have been thinking about the markets in recent months. Followers of Berkshire are looking ahead to Buffett’s annual letter, which is expected to be released Feb. 24, along with the company’s annual report. It will be Buffett’s first letter to shareholders since his long-time partner, Charlie Munger, died Nov. 28. Write to Karen Langley at karen.langley@wsj.com Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}