{
    "title": null,
    "date": "2/9/2024",
    "url": "https://fortune.com/2024/02/09/top-exec-turned-down-apple-ceo/",
    "text": "Angela Ahrendts may have played one of the toughest games of hard-to-get ever with Apple CEO Tim Cook. In 2014 when Ahrendts was CEO of London-based luxury retail brand Burberry, Cook tried to persuade her several times to head up retail at the Cupertino, Calif.–based tech giant. Ahrendts was steadfast in convincing Cook that she wasn’t the right fit for the job. “I’m absolutely not a techie,” she told Cook, according to a 2016 interview at the Fortune Most Powerful Women Summit. “I’m actually not even a great retailer.” But Cook didn’t take the bait, telling her that the company had plenty of tech-focused employees and had “the most productive stores in the world.” What Apple didn’t have, though, was Ahrendts’s attention to community and ability to humanize a company that had become one of the world’s most profitable. It was a 2011 TED Talk that Ahrendts had given that really caught Cook’s attention—one that was focused on the idea of human energy. Her thesis was that the more technologically advanced our society becomes, the more we need to go back to the basic fundamentals of human communication. “Trust just takes all the barriers away,” Ahrendts said. “I think it’s the same in a personal relationship or in a small business or a huge business.” This wisdom that Ahrendts has preached since 2011 is what got her noticed by leaders and celebrities alike. It’s what got her from a small town in Indiana to heading up Apple retail as a senior vice president—and now serving as a senior operating adviser at Kim Kardashian’s new private equity fund, SKKY Partners. It’s those soft skills—like earnest communication and building trust—that can make non-techies attractive to the biggest players in the industry and encourage leaders to look beyond just a résumé. For Ahrendts, it wasn’t the clout of the position or even the brand name of the company that made her eventually give in to Cook. It was the promise of being able to build something new and community-focused for a brand that she saw as having a major impact on the world. Ahrendts comes from humble beginnings. She was born and raised in New Palestine, Ind., with a population of just over 2,000, and was one of six children in her family. She played tennis, swam, and did gymnastics—and had her first job as a server. She studied at Ball State University before stints at Donna Karan International (DKNY), Liz Claiborne, and Burberry. After Ahrendts became CEO of Burberry in 2006, she was featured on Fortune’s magazine cover holding an iPad—a symbol showing the company’s commitment to equipping sales representatives with the technology they needed when working with consumers. Little did she know, though, that she’d eventually become one of the top executives at the company that created the very device that made Burberry so successful. “We turned the company around because of Apple—because of all that their technology enabled us to do all over the world,” Ahrendts said. At the time, Ahrendts said that she had “the greatest job in the world,” even to Cook when he first started trying to recruit her to join Apple. She also couldn’t imagine leaving London, where she and her family had been living for almost a decade. But that started to change during a visit back to the States for the holidays. Apple caught wind that Ahrendts would be home for the holidays and offered to fly her out and meet with her again. “I again admired everything he was doing at Apple, so I did [go], but my mission was to talk him out of me,” Ahrendts said. At the time, Ahrendts still turned Cook down, but an email exchange later on is what locked her into a future with the company. After receiving an email from Cook following her visit, Ahrendts sent a “gracious” and “humble” email letting him down—but with one caveat. If Apple would ever consider integrating its retail stores with its online business model, then she’d consider it. “At Burberry, we did everything digital first,” she said. “I wanted to make sure that they did something even greater [where the company] played a more important role in the community.” That alone sparked Cook’s interest, and led to Apple’s great retail redesign after she finally took the job in 2014. With a focus on community, Apple introduced more programming at its stores for adults and children alike, educating them in things like photography and tech features they wouldn’t otherwise be able to learn. She heralded change at Apple retail stores, which she refers to as “town squares” where the consumer experience is less about selling them a product and more about helping the customer discover all of the potential that they—and their devices—have. She was also behind the brand’s illustrious gold watch launch and can be thanked for shorter lines at the Apple store owing to her focus on online retail. After a successful run with Apple, Ahrendts stepped down in 2019 and served on the boards of Airbnb, Ralph Lauren, and WPP. But in October 2023, she took on her new role as a senior operating adviser at Kardashian’s private equity firm SKKY Partners, which was formed with PE industry veteran Jay Sammons. SKKY, which started in early 2023, landed its first deal in November when it acquired a minority stake in truffle-infused hot sauce and condiment brand Truff. In terms of advice for young women pursuing a path to leadership, her biggest advice is to be confident in what you know—and what you don’t know. “It’s so easy along the way to become incredibly insecure about everything you don’t know,” she said in the 2016 interview. “Be your best self.” © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}