{
    "title": null,
    "date": "3/5/2024",
    "url": "https://www.proactiveinvestors.com.au/companies/news/1042399/nasdaq-to-lead-losses-as-markets-face-jittery-tuesday-1042399.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. After graduating from the University of Kent in the summer of 2022 with a degree in History, Josh joined Proactive later that year as a journalist in the UK editorial team.\r\n\r\nJosh has reported on a range of areas whilst at Proactive, including energy companies during a time of global crisis, aviation and airlines as the sector recovers from the pandemic, as well as covering economic, social and governance issues.\r\n Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Last updated: 08:05 06 Mar 2024 AEDT, First published: 23:29 05 Mar 2024 AEDT The Nasdaq closed 1.7% lower on Tuesday at 15,939 points as investors pulled back on tech stocks, specifically Apple and Tesla. The Dow Jones and S&P 500 both finished the day 1% lower at 38,585 and 5,078 points respectively. After hitting a new record high near $69,000 earlier today, Bitcoin finished the day almost 8% lower at about $62,385. Gold, on the other hand, was up 0.6% at $2,138 per ounce. Some commentary on the market movements today, which attributes worries about China to some of the jitters being experienced by investors on Tuesday. After almost two hours of trading the Nasdaq index is down 26 points or 1.6% at 15,946.39, while the S&P 500 has slipped 0.85% to 5,088 and the Dow Jones 0.7% to 38,742. Market analyst Axel Rudolph at IG said the rally in both gold and bitcoin kicked off last week when Fed Governor Waller talked of a strategy shift towards reducing central bank's mortgage-backed securities holdings to zero, gathered momentum as investors bought gold and US-listed Bitcoin ETFs. China worries have also led to the surge in gold purchases, he said. \"The National People's Congress of China's growth target for 2024 of 5% and the decision to increase defence spending by 7.2%, the same amount as last year despite its economic woes, while leaving a 'peaceful reunification' reference to Taiwan out of its communication, led to flight-to-safety purchases of gold,\" Rudolph said. The Chinese yuan, US dollar and oil price were little changed on the day. US stocks opened in the red for the second day, with tech stocks crashing lower as gold and bitcoin reached new all-time highs. Economic data on the services sector and factory orders both fell more than expected, while Federal Reserve plans and China risks were also on investors' minds. The Nasdaq led the Wall Street retreat, as expected, losing 175 points in early trading, with all of the 'Magnificent 7' tech megacaps sliding lower, led by Tesla Inc (NASDAQ:TSLA, ETR:TL0) for the second day. Looking at the largest stocks on the tech-dominated index, Microsoft was down 29%, Apple 2.7%, Nvidia 1.2%. Alphabet 1.8%, Meta Platforms 1.7%, Broadcom 2.9% Tesla 4.8% and ASML 2.4%. US factory orders fell 3.6% in January, versus a forecast 2.9% decline, while the ISM services purchasing managers' index (PMI) dropped to 52.6 from 53.4, worse than the 53 consensus estimate. The Nasdaq is expected to lead US markets lower on Tuesday’s opening bell, as investors remain focussed on a score of economic news this week. Futures had the Nasdaq down 111 points at 18,150 pre-market, while the Dow Jones and S&P 500 sat 52 points and 15 points off at 38,970 and 5,123 respectively. Reports of China’s “ambitious” 5% GDP growth target for the year overnight already underwhelmed the market on Tuesday, XTB analyst Kathleen Brooks noted. Coupled with “key event risk this week,” Brooks added equity markets were “jittery” on Tuesday. Tuesday’s key data includes the release of factory orders and the ISM services PMI for February, after the figure hit an 11-month high of 64 in January. “Services sector inflation remains a thorn in the side of the Fed, and thus traders should keep a particular eye out for the ISM services prices metric,” Scope Markets’ Joshua Mahony commented. Later in the week brings an interest rate call in Europe, a budget in the UK and jobs data in the US, meanwhile, as Federal Reserve chair Jerome Powell offers a congressional testimony between Wednesday and Thursday, with markets awaiting any clues on when base rate cuts may come. Among equities, Apple Inc (NASDAQ:AAPL, ETR:APC) fell over 2% in pre-market trading, as a hefty fine in Europe was then followed by news that its iPhone had been overtaken as China’s bestseller, also prompting tech firms Broadcom Inc (NASDAQ:AVGO, ETR:1YD), Micron Technology Inc (NASDAQ:MU) and Qualcomm Inc (NASDAQ:QCOM, ETR:QCI) to fall. Sign up to receive alerts and news direct to your inbox Rowena Smith, CEO and managing director of Australian Strategic Materials Ltd (ASX:ASM, OTC:ASMMF), joins Jonathan Jackson in the Proactive studio to discuss the company’ s Dubbo Project, in Central West New South Wales. This project aims to extract and process critical minerals and rare earth... Copyright © Proactive Group Holdings Inc, 2024 All Rights Reserved - Proactive Australia PTY LTD ACN:132787654 ABN:19132787654. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}