{
    "title": "Epic Games says Apple retaliated over lawsuits by banning company's \ndeveloper account",
    "date": "3/6/2024",
    "url": "https://www.cnbc.com/2024/03/06/epic-games-says-apple-retaliated-over-lawsuits-by-banning-companys-developer-account.html",
    "text": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article Apple has rejected Epic Games' application for a developer account it would use to launch an app store for iPhones in Europe, Epic CEO Tim Sweeney said Wednesday. Sweeney said Apple's decision was in retaliation over the gaming company's antitrust lobbying, its lawsuit against Apple, and some of Sweeney's social media posts, citing emails from Apple App Store chief Phil Schiller and Apple lawyers. \"The manner in which Apple is going about killing Epic here as a competitor to the App Store is super egregious,\" Sweeney said on a call with reporters. \"This is the medieval feudal lord, mounting the skulls of their former enemies on their castle walls.\" It's the first public example of Apple denying competing app stores in Europe, a move that could raise scrutiny of the iPhone maker's plans to comply with a new antitrust law. The relationship between Apple and Epic Games has been confrontational since Epic sued Apple in 2020 over whether Fortnite could evade Apple's App Store rules and bypass its 30% cut of game sales. Epic mostly lost but forced some changes to Apple's policies under California law. The spat highlights global regulatory threats to Apple's App Store sales, a profitable division for Apple reported under its services business. An Apple spokesperson said that Apple had the right to terminate the account, especially because Epic continues to litigate against the company. \"Epic's egregious breach of its contractual obligations to Apple led courts to determine that Apple has the right to terminate 'any or all of Epic Games' wholly owned subsidiaries, affiliates, and/or other entities under Epic Games' control at any time and at Apple's sole discretion.' In light of Epic's past and ongoing behavior, Apple chose to exercise that right,\" the spokesperson said in a statement. Apple has started to comply with the Digital Markets Act, a new law in Europe going into effect this week that forces big tech companies to open their platforms to competitors. For Apple, it means it will have to allow companies to offer third-party app stores in Europe to compete with the iPhone App Store. Apple opposed the law, citing user security. Apple's plan to introduce new fees, software warnings, and a rudimentary approval process for third-party app stores has drawn criticism from companies like Spotify, which say Apple isn't complying with the spirit of the new EU law, including by adding a 50-euro-cent (55 cent) fee to downloads. Sweeney said Wednesday that Epic planned to introduce a new app store in Europe to distribute Fortnite and other games. It applied for a developer account in Sweden but was denied by Apple after Schiller emailed Sweeney, citing his statements around the 2020 lawsuit and Epic Games' decision to bypass App Store billing at the time. \"We invite you to provide us with written assurance that you are also acting in good faith, and that Epic Games Sweden, despite your public actions and rhetoric, honor all of its commitments,\" Schiller wrote in the email provided by Epic Games. Sweeney said he told Schiller that he would comply with all current and future agreements with Apple and that he was acting in good faith. Apple terminated the account a week later through an email from a lawyer, citing Sweeney's \"litany of public attacks on Apple\" and social media posts. Apple also said it suspected Epic would use the account to lobby and \"manipulate proceedings in other jurisdictions.\" \"This is an open-ended invitation for Apple to tell us exactly what they want us to commit to, and how they want us to commit to it in order to not lock us as a competitor,\" Sweeney said. \"Based on my interactions with Apple, they want two things,\" he continued. \"They want some sort of essay expressing fealty to Apple, a creative writing project, and they want us to shut up.\" Don't miss these stories from CNBC PRO: WATCH: Epic Games lawsuit Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by "
}