{
    "title": null,
    "date": "3/29/2024",
    "url": "https://qz.com/apple-doj-antitrust-lawsuit-iphone-apps-imessage-1851375442?utm_source=google-news",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Apple will not apologize for its little blue bubbles. The company told Quartz this week that the Department of Justice’s big antitrust lawsuit — which guns for basically everything about Apple’s ubiquitous iPhone — is misleading. The DOJ said in its lawsuit filed last week that Apple created a monopoly in the smartphone market and hindered both its direct competitors and developers of apps and super apps, smartwatches, and digital wallets. The complaint laid out 210 allegations against the tech behemoth. It said Apple “repeatedly chooses to make its products worse for consumers to prevent competition from emerging,” all to protect its smartphone monopoly “and the extraordinary profits that monopoly generates.” But Apple told Quartz on Thursday that some of the facts as laid out by the DOJ simply aren’t true. Here’s a rundown of the company’s rebuttals. A big part of the DOJ’s argument is the claim that Apple has a 70% share in the “performance” smartphone market, which it defines as “a more expensive segment of the broader smartphone market.” The complaint said Apple has a 65% market share in the overall U.S. smartphone market. Read more: A timeline of Apple’s rough 2024 (so far) But Apple said the DOJ is flawed in using market share by revenue — even though that’s usually how market share is calculated. Apple said its market share by units is less than half of the U.S. market. Apple said it doesn’t know what “performance” smartphones are and that the DOJ used the term to inflate the company’s market share. The DOJ lawsuit pointed to Apple charging a 30% commission as a way to limit developers’ applications beyond the company’s influential App Store. “Apple keenly understands that while a community of developers and accessory makers is indispensable to the success of the iPhone,” the lawsuit said, “they also pose an existential threat to its extraordinary profits by empowering consumers to ‘think different’ and choose perfectly functional, less-expensive alternative smartphones.” Apple said that because it only charges the commission on paid apps, 85% of developers pay no fee to the company. It also noted the majority of developers who do pay a commission are eligible for a discount. The DOJ argued that Apple’s decision not to make iMessage available on other smartphones is an example of its monopoly. The DOJ said Apple suppresses rival messaging apps on its operating system by not allowing access to SMS (a more universal text messaging protocol). “Apple limits the reach of third-party messaging apps and reinforces network effects that benefit Apple,” the lawsuit said. The result is a dynamic in which blue bubbles carry some cultural capital. In group text-message chats that include both iPhone users and Android users, for example, texts from the Android users show up in green bubbles instead of the iPhone blue bubbles — something that comes with stigma, especially for young users. Apple responded in a statement to Quartz that other messaging apps such as WhatsApp are very successful on iOS, proof of its openness to other companies’ products. Apple also pointed out that WhatsApp and Signal don’t support SMS even on Android phones. Google uses RCS, the progeny of SMS, and Apple has said it will adopt RCS starting this fall. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}