{
    "title": "H|T: The Healthtech Times – Apple Vision Pro goes to the hospital",
    "date": "3/1/2024",
    "url": "https://betakit.com/ht-the-healthtech-times-apple-vision-pro-goes-to-the-hospital/",
    "text": "The Healthtech Times is a weekly newsletter covering healthtech news from Canada and around the globe. Subscribe to H|T using this form to ensure you don’t miss out on the most important healthtech news every week! VRx Health, founded by researchers from Cedars-Sinai in Los Angeles, is today launching Xaia, a mental health chatbot app that uses an artificial intelligence model to generate human-like responses to users’ statements. A therapeutic chatbot isn’t a new idea, but Xaia takes advantage of Vision Pro’s ability to convincingly blend digital content with an image of the world around users. (STAT) The TSX Venture Exchange has released its yearly list of the 50 best-performing companies for 2024, ranking companies based on performance on the exchange for the past year. AI-based health screening platform Diagnos ranked ninth, tracking a share price growth of 35 percent. (BetaKit) Investors continue to pour money into generative AI startups, and Abridge is riding this wave as it rapidly scales its technology across U.S. health systems. The Pittsburgh-based startup banked a hefty $150 million series C funding round to invest in more research and development to build bedrock foundation models to power both improvements to the company’s existing technology and new products, CEO Shivdev Rao, M.D., told Fierce Healthcare. The latest funding comes just four months after Abridge raised $30 million in a series B round. (Fierce Healthcare) For the second consecutive year, venture capital investment in Canada fell as investors remained cautious, according to new data from the Canadian Venture Capital and Private Equity Association. The CVCA tracked $6.9 billion invested across 660 deals during the year. Investment fell by 34 percent compared to 2022, whereas deal volume remained relatively flat year-over-year, declining by six percent. (BetaKit) Despite its revenue plunge to $38 million in 2023 from $485 million the previous year (and layoffs in November), AbCellera said it had more partners, more research contracts and more drug candidates in clinical trials at the end of 2023. CEO Carl Hansen said in the earnings release that the company is executing on its plan to add manufacturing to its research capabilities, and turning from building capacity to using it. (The Logic) Tribe Network has partnered with Atlantic Canada accelerator Volta to launch a new residency program for Black founders, while the Black Entrepreneurship Knowledge Hub (BEKH) is developing a new ecosystem mapping tool for Black entrepreneurs. The new joint program between Tribe and Volta, called Accelerate Black Tech, will combine Volta’s startup mentorship model with Tribe’s network to support Black tech entrepreneurs and their startups. Meanwhile, BEKH is developing an ecosystem mapping tool meant to help users tap into a network of resources, support, and opportunities. (BetaKit) Seven months after it won United States Food and Drug Administration approval, St. John’s-based Sparrow Bioacoustics has launched its stethoscope app for smartphones in the United States. The app, called Stethophone, uses a phone’s internal microphones, along with software processing, to allow the device to function as an ad hoc stethoscope when it is held against a patient’s chest. So far, the app is only available for Apple devices, and not yet in Canada. South of the border, though, it is approved for use by both doctors and the general public, with both approvals representing industry firsts for smartphone stethoscope products. (Entrevestor) Toronto-based Golden Ventures has secured about $103 million USD ($139 million CAD) for its fifth venture capital (VC) fund focused on seed-stage technology startups across North America. Golden will focus on leading or co-leading rounds across the seed spectrum, companies in Toronto, Kitchener-Waterloo, Montréal, and Vancouver, with initial cheques of $500,000 to $3 million. (BetaKit) DarioHealth, which makes apps for managing chronic diseases, today announced it will acquire digital mental health company Twill for $10 million in cash plus stock valued at over $20 million at the end of Tuesday trading. The move is a bet that a consolidated offering can attract a critical mass of large customers in a market where profits have been elusive. (STAT) U.S. health insurance giant UnitedHealth Group (UHG) said Thursday in a filing with government regulators that its subsidiary Change Healthcare was compromised, likely by government-backed hackers. Pharmacies across the U.S. are reporting that they are unable to fulfill prescriptions through patients’ insurance due to the ongoing outage at Change Healthcare, which handles much of the billing process. Several people who work in the healthcare space and whose work is affected by the outage tell TechCrunch that they are experiencing downtime because of the ongoing cyberattack. (TechCrunch) Alex Riehl is a staff writer and newsletter curator at BetaKit with a Bachelor of Journalism from Carleton University. He's interested in tech, gaming, and sports. You can find out more about him at alexriehl.com or @RiehlAlex99 on Twitter.  "
}