{
    "title": "Apple's worst quarter reveals financial woes: Today in Apple history",
    "date": "3/28/2024",
    "url": "https://www.cultofmac.com/473471/today-in-apple-history-worst-quarter-ever/",
    "text": "By Luke Dormehl • 7:47 am, March 28, 2024 March 28, 1996: In a dire message to Wall Street, Apple warns that it will report a $700 million after-tax loss for its most recent quarter. Apple’s biggest quarterly loss in history, the shocking news reveals a company in far more financial trouble than previously thought. More than half the loss comes from $1 billion of unsold products. The $700 million loss more than tripled Apple’s previous low-water mark, which occurred during the third quarter of 1993. (At that time, the company recorded a $188 million deficit.) In addition to unsold products, Cupertino faced two other key challenges: clone Macs and the company’s decision to slash its prices to remain competitive. As I’ve noted before, the clone Macs — while making perfect sense in theory — turned out to be a disaster for Apple. Third-party manufacturers only paid Apple $50 as a licensing fee for each machine produced. This might have been good for Apple if clone Mac sales exploded overnight. However, the end result of the clones was not more Macs, but cheaper Macs. The decision to slash Mac prices also proved dangerous, since Apple sustained much higher costs than most computer manufacturers due to its development of both hardware and software. As one final boot in the teeth, Apple underestimated the popularity of some of its new products. As a result, Cupertino simply could not deliver them in the quantities demanded. While things certainly looked bad for Apple in the early days of 1996, reasons for optimism remained despite the company’s worst quarter ever. New Apple CEO Gil Amelio took the reins from previous CEO Michael Spindler, who got dumped following a failed merger attempt between Apple and Sun Microsystems. Amelio previously built a reputation as a turnaround artist at National Semiconductor. As CEO there, he took a company that lost $320 million over four years and made it profitable. Amelio also possessed a strong engineering background, which made him one of the strongest technical people ever to run Apple. “I’m confident at this point that I know what the problems are and that they are fixable,” Amelio said in a statement concerning Apple’s $700 million loss. “The strategic and operating plans we are currently developing will enable us to build upon Apple’s fundamental strengths and competitive position.” On the ground, Apple products continued to do well. But being an Apple fan in the 1990s often proved frustrating. The picture seemed very different from how it looked at the top. Many local Mac retailers reported that the computers sold well. Even post-Windows 95, a gulf in quality existed between the seamless experience Apple delivered and what Windows users endured. Ultimately, Amelio oversaw more money-losing quarters before making his best (but most personally destructive) decision at Apple: buying Steve Jobs’ NeXT Inc. and bringing Jobs back to the company he co-founded. Before too long, Jobs started running Apple. Amelio got the boot, and one of the most famous turnarounds in tech history got underway. Do you remember when Apple reported its worst quarter ever? Were you a fan, an Apple employee or someone who relied on Apple in some other capacity? Leave your comments below.   Daily round-ups or a weekly refresher, straight from Cult of Mac to your inbox. Our daily roundup of Apple news, reviews and how-tos. Plus the best Apple tweets, fun polls and inspiring Steve Jobs bons mots. Our readers say: \"Love what you do\" -- Christi Cardenas. \"Absolutely love the content!\" -- Harshita Arora. \"Genuinely one of the highlights of my inbox\" -- Lee Barnett. The week's best Apple news, reviews and how-tos from Cult of Mac, every Saturday morning. Our readers say: \"Thank you guys for always posting cool stuff\" -- Vaughn Nevins. \"Very informative\" -- Kenly Xavier. "
}