{
    "title": "Apple Inc. (NASDAQ:AAPL) Position Lowered by Canandaigua National Bank & \nTrust Co.",
    "date": "3/19/2024",
    "url": "https://www.defenseworld.net/2024/03/19/apple-inc-nasdaqaapl-position-lowered-by-canandaigua-national-bank-trust-co.html",
    "text": "Posted by Defense World Staff on Mar 19th, 2024 Canandaigua National Bank & Trust Co. lowered its position in  Apple Inc. (NASDAQ:AAPL – Free Report) by 2.2% in the fourth quarter, according to its most recent Form 13F filing with the Securities and Exchange Commission. The firm owned 140,887 shares of the iPhone maker’s stock after selling 3,131 shares during the quarter. Apple comprises about  4.2% of Canandaigua National Bank & Trust Co.’s holdings, making the stock its 3rd biggest holding. Canandaigua National Bank & Trust Co.’s holdings in Apple were worth $27,125,000 at the end of the most recent reporting period. Other hedge funds and other institutional investors have also recently bought and sold shares of the company. Atlantic Private Wealth LLC acquired a new stake in shares of  Apple during the 1st quarter worth about $30,000.  Wyrmwood Management LLC increased its position in shares of  Apple by 69.0% during the fourth quarter. Wyrmwood Management LLC now owns 169 shares of the iPhone maker’s stock valued at $33,000 after acquiring an additional 69 shares during the last quarter.  Summit Wealth Group LLC raised its stake in shares of  Apple by 16,252.3% in the 1st quarter. Summit Wealth Group LLC now owns 6,992,420 shares of the iPhone maker’s stock valued at $42,000 after acquiring an additional 6,949,659 shares during the period.  HBC Financial Services PLLC lifted its holdings in shares of  Apple by 21.7% in the 1st quarter. HBC Financial Services PLLC now owns 448 shares of the iPhone maker’s stock worth $49,000 after acquiring an additional 80 shares during the last quarter.  Finally, West Tower Group LLC purchased a new position in shares of  Apple during the 2nd quarter worth approximately $64,000. 58.51% of the stock is currently owned by institutional investors and hedge funds. In other news, Director Arthur D. Levinson sold 100,000 shares of Apple stock in a transaction dated Thursday, February 29th. The shares were sold at an average price of $180.94, for a total value of $18,094,000.00. Following the sale, the director now owns 4,434,576 shares of the company’s stock, valued at $802,392,181.44. The sale was disclosed in a legal filing with the SEC, which can be accessed through this hyperlink. 0.06% of the stock is owned by insiders. A number of research analysts have commented on AAPL shares. Wedbush  restated an “outperform” rating and set a $250.00 price target on shares of Apple in a research note on Wednesday, February 28th. Bank of America upgraded Apple from a “neutral” rating to a “buy” rating and raised their target price for the company from $208.00 to $225.00 in a report on Thursday, January 18th. Barclays reduced their price target on shares of Apple from $160.00 to $158.00 and set an “underweight” rating on the stock in a research report on Friday, February 2nd. Piper Sandler dropped their price objective on shares of Apple from $205.00 to $190.00 and set a “neutral” rating for the company in a report on Friday, February 2nd. Finally, The Goldman Sachs Group increased their target price on shares of Apple from $223.00 to $232.00 and gave the stock a “buy” rating in a report on Friday, February 2nd. One research analyst  has rated the stock with a sell rating, eleven have issued  a hold rating, twenty-one have given a buy rating and one  has issued  a strong buy rating to the company. According to MarketBeat, the stock presently has an average rating of “Moderate Buy” and a consensus target price of $205.27. Get Our Latest Research Report on Apple Shares of Apple stock opened at $173.72 on Tuesday. The company’s fifty day moving average is $183.15 and its two-hundred day moving average is $183.21. Apple Inc. has a 1 year low of $154.15 and a 1 year high of $199.62. The company has a debt-to-equity ratio of 1.28, a quick ratio of 1.02 and a current ratio of 1.07. The company has a market capitalization of $2.68 trillion, a P/E ratio of 27.06, a PEG ratio of 2.09 and a beta of 1.29. Apple (NASDAQ:AAPL – Get Free Report) last issued its quarterly earnings results on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share (EPS) for the quarter, beating the consensus estimate of $2.09 by $0.09. Apple had a return on equity of 156.04% and a net margin of 26.16%. The firm had revenue of $119.60 billion for the quarter, compared to analysts’ expectations of $117.99 billion. During the same quarter in the previous year, the firm posted $1.88 EPS. The firm’s revenue for the quarter was up 2.1% on a year-over-year basis.  Analysts forecast that  Apple Inc. will post 6.55 earnings per share for the current year. The company also recently disclosed a quarterly dividend, which was paid on Thursday, February 15th. Shareholders of record on Monday, February 12th were paid a $0.24 dividend. The ex-dividend date of this dividend  was Friday, February 9th. This represents a $0.96 annualized dividend and a yield of 0.55%. Apple’s dividend payout ratio  is currently 14.95%. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Apple Inc. (NASDAQ:AAPL) Stock Holdings Lessened by McAlister Sweet & Associates Inc. DNB Asset Management AS Has $2.72 Million Holdings in Entegris, Inc. (NASDAQ:ENTG) "
}