{
    "title": null,
    "date": "3/20/2024",
    "url": "https://finance.yahoo.com/news/apple-aapl-surpasses-market-returns-214518604.html",
    "text": "The most recent trading session ended with Apple (AAPL) standing at $178.66, reflecting a +1.46% shift from the previouse trading day's closing. This change outpaced the S&P 500's 0.89% gain on the day. Meanwhile, the Dow gained 1.03%, and the Nasdaq, a tech-heavy index, added 1.25%. Shares of the maker of iPhones, iPads and other products witnessed a loss of 3.02% over the previous month, trailing the performance of the Computer and Technology sector with its gain of 3.77% and the S&P 500's gain of 3.56%. The upcoming earnings release of Apple will be of great interest to investors. The company is forecasted to report an EPS of $1.50, showcasing a 1.32% downward movement from the corresponding quarter of the prior year. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $90.38 billion, down 4.7% from the year-ago period. For the annual period, the Zacks Consensus Estimates anticipate earnings of $6.55 per share and a revenue of $385.52 billion, signifying shifts of +6.85% and +0.58%, respectively, from the last year. It is also important to note the recent changes to analyst estimates for Apple. These recent revisions tend to reflect the evolving nature of short-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook. Our research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. The Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. Right now, Apple possesses a Zacks Rank of #3 (Hold). In the context of valuation, Apple is at present trading with a Forward P/E ratio of 26.89. Its industry sports an average Forward P/E of 14.67, so one might conclude that Apple is trading at a premium comparatively. We can also see that AAPL currently has a PEG ratio of 2.12. The PEG ratio is akin to the commonly utilized P/E ratio, but this measure also incorporates the company's anticipated earnings growth rate. The Computer - Mini computers industry had an average PEG ratio of 2.5 as trading concluded yesterday. The Computer - Mini computers industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 210, this industry ranks in the bottom 17% of all industries, numbering over 250. The Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. You can find more information on all of these metrics, and much more, on Zacks.com. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}