{
    "title": "Apple’s stock pressure could continue for months, this bull concedes",
    "date": "3/8/2024",
    "url": "https://www.marketwatch.com/story/apples-stock-pressure-could-continue-for-months-this-bull-concedes-47810926",
    "text": "Apple Inc.’s stock is coming off a seven-session losing streak, and it’s down 12% so far this year. The bad news? Apple shares \n        AAPL,\n        -1.06%\n       could remain under pressure through the company’s WWDC developer event in June, according to a Citi Research analyst. Smartphone demand has been sluggish, though that event could become the “AI catalyst to drive upside to 2025 AI smartphone demand,” Citi’s Atif Malik wrote Friday. See also: Apple’s stock is in a ‘funk.’ Could Warren Buffett be selling more shares? While Malik kept his buy rating on Apple shares, he narrowly reduced his price target to $220 from $225 in his latest note to clients. He’s concerned about a few data points related to China. For one, third-party data from Counterpoint Research suggested that iPhone unit sales plunged 24% in China during the first six weeks of the year. And Apple appears to be getting more aggressive with its discounting in order to drive sales. “We note that Apple started to offer up to ~$180 discount on the iPhone 15 series as part of the International Women’s Day sale, which is a higher discount than the ~$120 discount last year on the iPhone 14 series,” Malik wrote, in discussing the China market. Meanwhile, his analysis of U.S. third-party data found that foot traffic to a sampling of U.S. Apple Stores was off 6% in the first two months of 2024 relative to the same period a year before. Don’t miss: Apple’s stock has had a sour 2024. This bull sees ‘a host of tailwinds’ ahead. In light of all that, why does Malik continue to hold a positive view of the stock? He cheered “structural gross-margin expansion due to premiumization supported by AI smartphones and services growth” in his latest note to clients. In other words, “AI smartphones will be the next battle ground for smartphone makers,” and Apple’s WWDC event could hold clues about the company’s plan to keep its grip on the market for expensive handsets. “Apple currently holds 75% market share in the premium phone market…and we expect Apple to release [generative AI] features to maintain its position in the high-end market,” Malik said. Those features could include AI tools that make coding easier. Carnival Corp.’s stock dropped Wednesday after the cruise operator reported an narrower-than-expected fiscal first-quarter loss but also provided an estimate for what the collapse of the Francis Scott Key Bridge in Baltimore would cost it this year. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}