{
    "title": "Apple Fined $1.9 Billion For 'Abusive' App Store Rules",
    "date": "3/4/2024",
    "url": "https://www.pymnts.com/apple/2024/apple-fined-1-9-billion-for-abusive-app-store-rules/",
    "text": "The European Commission has fined Apple 1.8 billion euros ($1.95 billion) for abusing its place in the music streaming market. The record fine, announced by the commission (EC) Monday (Mar. 4), is the European Union’s first antitrust levy against Apple and comes as the tech giant is dealing with competition issues on both sides of the Atlantic. Writing in a news release, the EC said it found that Apple had restricted app developers from telling iOS users about alternative and cheaper music subscription services — such as rival Spotify — something that is illegal under Europe’s antitrust regulations. “Apple’s conduct, which lasted for almost ten years, may have led many iOS users to pay significantly higher prices for music streaming subscriptions because of the high commission fee imposed by Apple on developers and passed on to consumers in the form of higher subscription prices for the same service on the Apple App Store,” the EC said in a news release. In addition, Apple’s “anti-steering provisions” caused “non-monetary harm” by degrading the iOS user experience, forcing them to engage in a “cumbersome search” before coming across relevant offers outside the app. In a statement on its website, Apple said it would appeal the decision, while criticizing what it said was the EC’s “failure to uncover any credible evidence of consumer harm.” The iPhone maker also took aim at Spotify — whose complaints prompted the EC probe — saying that the company had met with the commission 65 times during the investigation. “Today, Spotify has a 56 percent share of Europe’s music streaming market — more than double their closest competitors — and pays Apple nothing for the services that have helped make them one of the most recognizable brands in the world,” Apple said. “A large part of their success is due to the App Store, along with all the tools and technology that Spotify uses to build, update, and share their app with Apple users around the world,” the company added. For its part, Spotify said that it was pleased with the outcome of the case, but argued that the EC’s fine “does not solve Apple’s bad behavior towards developers beyond music streaming in other markets around the world.” Among those other markets is the U.S., where the Justice Department is preparing an antitrust suit against Apple, which it accuses of placing software and hardware limitations on its devices to hamstring competition. Monday’s fine puts Apple in the same company as Google, which was fined $2.8 billion in 2017 after the EC found that the company had abused its dominant position in the online ad space. We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}