{
    "title": "Apple Lets AI Decide Where And To Whom To Show Ads In The App Store - Tech \nNews Space",
    "date": "3/12/2024",
    "url": "https://technewsspace.com/apple-lets-ai-decide-where-and-to-whom-to-show-ads-in-the-app-store/",
    "text": "Apple, known for being cautious when it comes to advertising, has begun testing an artificial intelligence (AI)-based advertising platform. AI now determines where advertisements will be placed in the App Store, which will undoubtedly generate interest among both the professional community and users.  Image source: Mohamed_hassan / Pixabay Testing of the new product is carried out with a limited number of Apple partners. Currently, the technology is used to improve the effectiveness of advertising campaigns in search in the App Store. However, as Business Insider suggests, in the future this technology may find application in other Apple services, which will gradually expand the range of the company’s ad-supported services. AI-powered advertising technology is not new to the advertising market. Similar systems have already been implemented by Google and Facebook, but for Apple, which has a limited range of advertising formats, the development of such a tool seems a somewhat unexpected step. On the App Store, app developers can pay to appear in the Today tab, the Search tab, at the top of search results, and at the bottom of other app pages. The company also offers advertising campaigns for its News and Stocks apps, although most of these services are through intermediaries such as NBCUniversal. Over time, Apple will likely offer even more ad slots in App Store search and may expand ad placement to other mobile apps. In this context, an AI-based advertising tool becomes much more relevant. A few years ago, Bloomberg’s Mark Gurman reported on Apple’s plans to expand its advertising business into other apps like Apple Maps, as well as services including Books and Podcasts. However, at the moment there have been no official statements from the company. Apple’s initiative to incorporate AI into advertising strategies raises questions about the future of mobile app advertising and how it will impact the user experience. The company, which has long followed a strategy of minimal advertising, may now reconsider its approach, which will certainly have an impact on the mobile advertising market as a whole. Robbie Elmers is a staff writer for Tech News Space, covering software, applications and services. Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  TECH NEWS SPACE The Tech News Space team monitors news from the world of high technology, science, the gaming industry and delivers them to its readers in a timely manner. "
}