{
    "title": null,
    "date": "3/23/2024",
    "url": "https://today.thefinancialexpress.com.bd/stock-corporate/us-lawsuit-against-apple-could-make-iphone-experience-1711210237",
    "text": " / STOCK & CORPORATE March 24, 2024 00:00:00 WASHINGTON, Mar 23 (Reuters): The US has filed a lawsuit against Apple with the aim of increasing competition for the iPhone and giving a leg up to smaller companies whose apps work with the ubiquitous device. In the lawsuit against the $2.7 trillion company, the US argues the iPhone maker hurt smaller rivals and drove up prices, and the Justice Department is asking the court \"to restore competitive conditions in the markets affected by Apple's unlawful conduct\". Apple said the lawsuit threatens the company and the principles that set its products apart in a competitive market. In Europe, consumers have already benefited after a slew of rules and regulations compelled Apple to make a number of user-friendly changes to its popular smartphone, suggesting similar changes could occur in the US if the Justice Department lawsuit is successful. Below are several areas where EU competition authorities have changed the rules and Apple has altered its product. Apple's switch to USB-C chargers - the standard for Android-based devices - may be the most obvious change for users. In 2022, the EU passed a law making the charging port the compulsory standard across the 27-nation bloc by the end of 2024. This made it easier for consumers to power up their devices using chargers they already owned, or to borrow those belonging to others. In Europe, new rules have created alternatives to Apple's App Store, meaning users can download applications from rival sources, including websites and rival app stores. This allows developers to avoid the tech giant's 30 per cent commission fee which, in theory, could mean apps becoming cheaper. Once fully implemented, users should also enjoy access to a wider range of apps. In both the EU and the US, app developers can direct users to their own websites to buy items, rather than having to use Apple's in-app purchasing system, which also takes a 30 per cent cut. The change was made in the EU in line with the recently enacted Digital Markets Act. In the US, Apple's hand was forced following a lawsuit from Fortnite-maker Epic Games, a longstanding critic of the tech giant's business practices. Another change in Europe introduced to comply with the EU digital markets law concerns default web browsers. Safari has been the default browser on iPhones since the device was first released in 2007. While iPhone users could already change their default to a competitor like Google Chrome or Opera, they will now be automatically be given the choice to switch when opening Safari in the latest Apple software update, iOS 17.4. Pushing back against the EU changes, Apple said users would be presented with a list of options without the chance to learn about them, and warned it would interrupt their browsing experience. Share if you like Editor : Shamsul Huq Zahid Published by Syed Manzur Elahi for International Publications Limited from Tropicana Tower (4th\nfloor), 45, Topkhana Road, GPO Box : 2526 Dhaka- 1000 and printed by him from The Transcraft Limited, 229, Tejgaon Industrial Area, Dhaka-1208. Phone: 02223388153, 02223388154 and 02223380377 PABX : 9553550 (Hunting) Fax : 880-2-02223387049 E-mail : [email protected], [email protected] © 2024 - All Rights with The Financial Express "
}