{
    "title": "Apple to pay $490 million to settle allegations that it misled investors \nabout iPhone sales in China",
    "date": "3/15/2024",
    "url": "https://nz.news.yahoo.com/apple-pay-490-million-settle-181649138.html",
    "text": "Apple has agreed to pay $490 million to settle a class-action lawsuit alleging CEO Tim Cook misled investors about a steep downturn in iPhone's sales in China that culminated in a jarring revision to the company's revenue forecast. The preliminary settlement filed Friday in Oakland, California, federal court stems from a shareholder lawsuit focused on the way Apple relayed information about how iPhone models released in September 2018 were performing in China, one of the company's biggest markets. Cook signaled that the new iPhones were off to a good start during an investor conference call in early November 2018, according to the complaint. That reassurance dissolved into a huge letdown on Jan. 2, 2019 when the Cook issued a warning that Apple's revenue for the just-completed quarter would fall $9 billion below management's forecast for the period. What's more, virtually all of the sales drop was traced to weak demand in China. It marked the first time Apple had cut its revenue guidance since the iPhone's release in 2007 and triggered its stock price to plunge 10% in the next day of frenetic trading, wiping out more than $70 billion in shareholder wealth. Apple vehemently denied Cook deceived investors about the iPhone's sales in China between early November and early January. The Cupertino, California, company maintained that stance in the settlement documents, but said it decided to make the payment after more than four years of legal wrangling to avoid an “overly burdensome, expensive, and distracting” hassle. The settlement was reached through a mediator after U.S. District Judge Yvonne Gonzalez Rogers rejected Apple's request to dismiss the case and set a Sept. 9 trial date. Gonzalez Rogers is now being asked to approve the settlement in a hearing scheduled for April 30. Thousands of shareholders who bought Apple stock in late 2018 could be eligible for a piece of the settlement, which will be distributed from of a pool that will be less than $490 million after lawyers involved in the case are paid. The attorneys plan to seek up to one-fourth, or about $122 million, of the settlement. The $490 million payment represents less than 1% of the $97 billion profit that Apple pocketed during its last fiscal year ended in September. Apple shareholders who have held on to their shares have become wealthier too. Apple's stock price has more than quadrupled from where it stood after Cook's China warning, creating an additional $2 trillion in shareholder wealth. Dutch police have detained a man who walked out of a nightclub where hostages were being held after a tense hours-long stand-off. Melbourne's Ben Brown has kicked three goals as the Demons scored a seven-point away victory against Port Adelaide. IBKR EventTrader - A new, straightforward way to trade CME futures markets Lachlan Lonergan has suffered a serious ankle injury as the ACT Brumbies overcame a nine-point deficit to beat the Queensland Reds 20-19 at Suncorp Stadium. The Dolphins have gone top of the NRL ladder with a 30-14 win over Gold Coast as their big-name off-season recruits Thomas Flegler and Herbie Farnworth shone. Goalkeeper Ryan Scott was the hero for the Newcastle Jets as they hung on to deny A-League Men finals hopefuls Melbourne City in a scoreless draw.  Goals from Anthony Caceres and Joel King have sealed a 2-0 win for Sydney FC over the Central Coast Mariners in the A-League Men. The Hurricanes and Blues have both recorded huge Super Rugby Pacific wins, thumping the Highlanders and Moana Pasifika, respectively. Police are investigating racial abuse yelled at the children of an AFL legend while they were playing in their yard as support floods in for the family. 網上或實體課專業教師團隊，適合所有程度報讀，定期免費文化活動，體驗不同國家風俗，太子屯門元朗天水圍沙田荃灣均有分校！ St George Illawarra fullback Tyrell Sloan has scored two tries to help the Dragons bounce back to winning ways with a 20-12 NRL victory over a poor Manly side. Essendon star Jake Stringer has kicked the match-winning goal to pull the Bombers over the line against a tired St Kilda at Marvel Stadium. The great Kelly Slater has been beaten at Bells Beach as Australians Morgan Cibilic and Ethan Ewing advanced to the quarter-finals of the Rip Curl Pro. 全日/兼讀制英國課程，最快1年完成，可申請NMTSS/CEF資助，全日制更設政府獎學金! The Western Force's unbeaten start to the Super Rugby Women season has come to an end, losing to Fijian Drua, while the Brumbies saw off the Reds. Wellington have dealt a blow to Western Sydney's finals hopes, while Michelle Heyman equalled an ALW record as Canberra staged a late comeback in Brisbane. Liam Wilson has been told by ring rival Oscar Valdez he must not give up on a promise he made to his dying dad, despite losing his latest world-title fight. If given HK$8 million to spend, Yat says he would invest in digital assets such as non-fungible tokens Melbourne United will have home-court advantage for the deciding game of the best-of-five NBL championship series against the Tasmania JackJumpers. Endale Mekonnen and Chloe Mannix-Power have set the pace in the heats for the 2024 Stawell Gifts. The Western Force were up a man for 30 minutes against the Drua, but still suffered a 31-13 loss in wet and slippery conditions in Fiji. Play this game for 1 minute and see why everyone is addicted. Australian star Josh Giddey scored a team-high 23 points to help the Oklahoma City Thunder roll past the Phoenix Suns in the NBA. The SA government has unveiled a package to help winemakers return to China's huge market with the lifting of punitive tariffs. One woman has died and a second is in a critical condition after overdosing in Queensland's southeast. "
}