{
    "title": "Smartphone Use: Samsung Losing, Apple Gaining",
    "date": "1/19/2024",
    "url": "https://www.statista.com/chart/31609/share-of-global-respondents-whose-primarily-used-smartphone-is-from-the-following-brands/",
    "text": "Industry Overview Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Insights on consumer attitudes and behavior worldwide Business information on 100m+ public and private companies Explore Company Insights Detailed information for 39,000+ online stores and marketplaces Directly accessible data for 170 industries from 150+ countries\n                    and over 1 Mio. facts. Customized Research & Analysis projects: Get quick analyses with our professional research service The best of the best: the portal for top lists & rankings: Transforming data into design: Statista Content & Design Strategy and business building for the data-driven economy: Apple becoming the biggest global seller of smartphones in 2023 after overtaking Samsung is mirrored in Statista Consumer Insights survey data. According to tens of thousands of respondents from around 20 countries, having an Apple smartphone became more prevalent recently. While in 2021, 26.9 percent said they primarily used an Apple device, this was up to 35.3 percent in 2023 as the American manufacturer seems to be delivering the right combination of user experience and status symbol appeal.Samsung's user numbers meanwhile decrease somewhat, slipping below 30 percent in 2023. Chinese manufacturers Huawei and Xiaomi only reached a combined 13 percent of respondents from mostly developed nations in the 20-country sample. Especially Huawei has seen its market share shrink over the past three years. In a truly global perspective and looking only at 2023 shipments, two more Chinese manufacturers - Oppo and Transsion - have actually become the most successful from the country. The latter has a large focus on the African continent with brands like Itel and Tecno. Apple becoming the biggest global seller of smartphones in 2023 after overtaking Samsung is mirrored in Statista Consumer Insights survey data. According to tens of thousands of respondents from around 20 countries, having an Apple smartphone became more prevalent recently. While in 2021, 26.9 percent said they primarily used an Apple device, this was up to 35.3 percent in 2023 as the American manufacturer seems to be delivering the right combination of user experience and status symbol appeal. Samsung's user numbers meanwhile decrease somewhat, slipping below 30 percent in 2023. Chinese manufacturers Huawei and Xiaomi only reached a combined 13 percent of respondents from mostly developed nations in the 20-country sample. Especially Huawei has seen its market share shrink over the past three years. In a truly global perspective and looking only at 2023 shipments, two more Chinese manufacturers - Oppo and Transsion - have actually become the most successful from the country. The latter has a large focus on the African continent with brands like Itel and Tecno.  Description This chart shows the share of global respondents whose primarily-used smartphone is from the following brands (in percent). Report Can I integrate infographics into my blog or website? Yes, Statista allows the easy integration of many infographics on other websites. Simply copy the HTML code that is shown for the relevant statistic in order to integrate it. Our standard is 660 pixels, but you can customize how the statistic is displayed to suit your site by setting the width and the display size. Please note that the code must be integrated into the HTML code (not only the text) for WordPress pages and other CMS sites. Statista offers daily infographics about trending topics, covering:Economy & Finance, Politics & Society, Tech & Media, Health & Environment, Consumer, Sports and many more. Feel free to contact us anytime using our contact form or visit our FAQ page.  Need infographics, animated videos, presentations, data research or social media charts? More Information "
}