{
    "title": "Tesla, Apple, Synopsis: Trending tickers",
    "date": "1/16/2024",
    "url": "https://finance.yahoo.com/video/tesla-apple-synopsis-trending-tickers-165412763.html",
    "text": "Tesla (TSLA) is a top trending ticker on Yahoo Finance after CEO Elon Musk posted on his social media platform X that he is \"uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control.\" Apple (AAPL) is reportedly removing the blood-oxygen sensor from some of its watches in order to avoid a ban on the devices. It's part of an ongoing patent dispute between the tech giant and medical technology company Masimo (MASI). Chip software company Synopsys (SNPS) is buying Ansys (ANSS), an engineering software firm, in a $35 billion deal. The cash and stock deal is set to close in the first half of 2025, pending shareholder and regulatory approval. Yahoo Finance's Rachelle Akuffo and Akiko Fujita break down some of Tuesday's top trending tickers. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Stephanie Mikulich RACHELLE AKUFFO: All right, now let's take a look at some trending tickers. Tesla shares in focus this morning. CEO Elon Musk saying he wants more voting power at the EV giant. Writing in a post on X He says he's, quote, \"uncomfortable growing Tesla to be a leader in AI and robots without having around 25% of voting control.\" So Akiko, he does mention in this tweet in this X that he wants enough to be influential, but not so much that he can't be overturned. But it does seem to be the case that he's hinting at potentially, building some of these products outside of Tesla. Looking at some big Tesla Bulls, here we saw commentary from Dan Ives saying, the board and Musk will be able to resolve this. He's estimating in the next three to six months-- really thinks that the shareholders will be fine. And Musk did praise the Tesla board in a following tweet as well and said that he couldn't do it through a compensation package because he still has an outstanding trial in Delaware that's still being resolved. But a bit of a power move here considering some of the issues that Tesla has already been facing with its stock price. AKIKO FUJITA: Yeah, I mean, a few things to note here. He's looking for 25% control. He has roughly 13% control right now. Also, the fact that he's talking about Tesla becoming a leader in the AI and robotics space seems to be an admission that it's not exactly where it needs to be despite past Musk comments. But this is certainly going to be a really tricky decision for the board if it does come to that because this comes at a really, really delicate time for Tesla when you think about the concerns that shareholders have expressed about Elon Musk splitting time between the company's Tesla, SpaceX, and Twitter, or X, I should mention. Also, at a time when we have seen EV sales soften, there's been a massive move to price cuts because Tesla certainly isn't the only player as well. It's not just a US story. It's also in the biggest EV market over in China. So it's going to be a tricky balance for the board to make that decision if it does come to that because there are concerns about where Tesla is moving, which direction it's moving at a time of increased competition at its core business, which is really still autos. Well, another tech giant in the news this morning, Apple. Reports suggest the company will remove the blood oxygen sensor from its smartwatches to get around a patent dispute with medical technology company Masimo. They cite a court filing from the health tech company, a story, Rachelle, that we've been following very closely since that deadline passed back in December for Apple to have to take those specific watches off the market as a result of this patent dispute. I will point out, by the way, though, we're talking about their wearables. There's another headline that crossed today that to me is kind of interesting on Apple-- Apple topping Samsung in global smartphone shipments for the first time in 2023. If you look at the revenue breakdown for Apple, it still is about those iPhones, certainly a big win for Apple. Yes, backwards looking but we're still talking about those handsets that are key to the revenue for Apple. RACHELLE AKUFFO: It's true. I mean, you raised a good point because as much headlines as we're seeing about the watch, the iPhone really is their hero product here. So still making that progress there, and I think Apple really considering, is it really worth us to keep going down this road with Massimo? They've tried to make some of the changes. The courts are looking at that and saying, perhaps this might not be enough as they're looking at some of the changes they're trying to make saying, it's not just a software issue. It's a hardware issue as well. We'll have to wonder if, perhaps, they partner with another company on this because health still at the forefront of Apple's ecosystem here and some of the developments that they want to make not just with their phones and tracking as well. But they want to push more in this health space. So perhaps they'll find a different avenue to go down. But it appears that this route-- the blood oxygen sensor involving Masimo seems a bit of a non-starter here. And finally, also taking a look at Synopsys shares jumping as the software company is set to buy Ansys for $35 billion in the biggest tech deal of the year so far. Now this will be a cass-and-stock deal that values Ansys at over $390 a share, which is a 35% premium on the company's 60 day volume-weighted average price as of December 21. Now the deal is expected to close in the first half of 2025. Of course, it is still very early in 2024 as we say this is the biggest tech deal. So it's still very early in the gates here, and a lot of people wondering what is going to be happening with M&A activity. So interesting to see this here. I mean, the company deals in a lot of different products and services, including tennis rackets. So it'll be interesting to see how this benefits them, how this plays out for them, but at least a hint of some positive M&A activity ahead. AKIKO FUJITA: Yeah, not just the largest M&A deal so far in the year, which is just a few weeks old, but really the largest deal in recent years, certainly, a good harbinger of things to come when you think about it. This does create a design software giant as you described, Rachelle. So if anything, this really is about, is this a sign of that thaw that's coming with M&A deals potentially picking up some momentum here? You see Synopsis shares up more than 3.5% on this deal. So we'll continue to watch that to see where things go. Related Quotes "
}