{
    "title": null,
    "date": "1/22/2024",
    "url": "https://finance.yahoo.com/news/samsung-races-apple-develop-blood-233037141.html",
    "text": "(Bloomberg) — Samsung Electronics Co. is exploring the development of noninvasive glucose monitoring and continuous blood pressure checking, setting its sights on ambitious health-care goals in a race with Apple Inc. and other tech giants. Most Read from Bloomberg China Weighs Stock Market Rescue Package Backed by $278 Billion Florida Governor DeSantis Drops Out of 2024 Race, Endorses Trump Hong Kong Stocks at 36% Discount Show True Depth of China Gloom India Tops Hong Kong as World’s Fourth-Largest Stock Market Morgan Stanley, JPMorgan Say Buy the Dip After Treasury Rout The work is part of a broader push to put health features in a range of devices, including its just-announced Galaxy Ring, said Samsung executive Hon Pak, who is overseeing the effort. The company aims to eventually give consumers a complete picture of their well-being via sensors on different parts of the body and around the home. Health tracking is already a key selling point of smartphones and watches, with Samsung, Apple and Alphabet Inc.’s Google using the features to attract and retain customers. Creating sensors for continuous blood pressure tracking and glucose monitoring would be particularly valuable breakthroughs. Apple has been working for years on a glucose reader that wouldn’t require users to prick their skin for blood — a potential boon for millions of diabetics. “If we can do continuous blood pressure and glucose, we’re in a whole different ballgame,” Pak, Samsung’s mobile digital health chief, said during a wide-ranging interview. “I think that’s where everyone is trying to get to. We’re putting significant investment toward that.” He wouldn’t comment on a timeline for either feature, but said he hopes noninvasive glucose monitoring could come to the market in some form within five years. “We are looking at everything from miniaturization to the various different technology platforms that can do some type of glucose monitoring or anything in between,” Pak said. The remarks follow Samsung’s announcement last week that it’s working on a ring with health sensors. The Galaxy Ring product is scheduled to be released before the end of 2024 and will come in a range of colors and sizes, Pak said. The company is eyeing activity and sleep tracking for the ring, with more health features to come later. Smart rings from companies like Oura offer an alternative for people who don’t like to wear a watch but still want to track their health metrics and sleep patterns. “The ring represents that community of people who want health tracking that is more comfortable and less obtrusive,” Pak said. “It’s meeting a need of a specific population of people who want to track and measure, but in a different way.” Pak said Samsung hasn’t finalized pricing on the Galaxy Ring, but — like the company’s Galaxy Watches — it probably won’t be compatible with Apple’s iPhone. Developing a blood sugar monitor would be a more challenging task, but one that could have major rewards. Current products on the market typically require a blood draw or a prick in the skin — an obtrusive process. Apple has been working on a noninvasive approach since around 2010 and has since made major progress, Bloomberg News has reported. Even so, a product remains years away. Read More: Apple Has Plans to Eventually, Maybe Revolutionize Health-Care The two companies also are working to improve blood pressure monitoring. Samsung smartwatches have long offered the ability to determine a user’s blood pressure, but the monitoring isn’t constant throughout the day and requires calibration against a standalone blood pressure checker. Pak said Samsung is “evaluating all options” to improve its blood pressure features. The aim is to go longer without needing calibration. “We’ve been thinking long and hard about this,” he said. Apple, meanwhile, is planning to add hypertension detection to its smartwatch later this year in a way that doesn’t require calibration but also doesn’t provide exact readings. Instead, the watch will inform users that they may have elevated blood pressure. Apple’s expansion into health technology hasn’t gone entirely smoothly. It recently pulled a blood oxygen feature from the Apple Watch after a legal setback in its patent dispute with Masimo Corp. Pak said traditional blood pressure readings aren’t “really that meaningful” other than showing a range of normal and abnormal. “Whether it’s Apple or others, I think we are trying to redefine blood pressure in a way that it was originally intended, which is: How much cardiovascular risk do you have?” he said. Samsung also is exploring a range of different sensors for future versions of its earbuds. The company is studying new ways to measure body temperature and heart rates, adding that the ear is a closer pathway to the heart than the wrist. Data from the ear could be combined with wrist and ambient data to provide users with a more comprehensive picture of their health. Mixed-reality headsets could be a new frontier for health as well, Pak said. Apple is poised to release its first product in that market next week when the Vision Pro goes on sale for $3,499. Meditation and mental health could be key areas for such devices, he said. “We are right now looking at partnerships to address that,” Pak said. Most Read from Bloomberg Businessweek The Downfall of Diddy Inc. How Sweden Quit Smoking Without Quitting Nicotine The Bitcoin Hype Is Back and About Just as Hollow as Before Japan’s Market Roars Back to Life—With Old-Timers Leading the Way ©2024 Bloomberg L.P. Related Quotes "
}