{
    "title": "Stock market today: Nasdaq surges as chipmakers shine, Apple pops",
    "date": "1/18/2024",
    "url": "https://finance.yahoo.com/news/stock-market-today-nasdaq-surges-as-chipmakers-shine-apple-pops-210312922.html",
    "text": "Big tech led a stock market rally on Tuesday as Apple (AAPL) had its best day since May 2023. The S&P 500 (^GSPC) popped 0.9%, while the tech-heavy Nasdaq Composite (^IXIC) led gains, rising more than 1.3%. The Dow Jones Industrial Average (^DJI) rose about 0.5%. The S&P 500 is now nearing its record closing high of 4,796.56. Big tech stocks led the market higher after a bullish AI-fueled revenue outlook from TSMC (TSM), a key supplier to Apple and Nvidia (NVDA). The Taiwanese contract chipmaker's profit fell but beat Wall Street estimates. Shares of AMD (AMD) and other chipmakers stepped higher as TSMC put on more than 9%. Meanwhile, an upgrade from to Buy from Neutral by Bank of America sent Apple stock more than 3% higher on hopes the tech giant's new Vision Pro headset could drive increased hardware sales. Also on Thursday, Atlanta Fed President Raphael Bostic said he doesn't see the Federal Reserve cutting interest rates until the third quarter, later than the market's current projection for March, unless there is \"convincing\" evidence of inflation's decline. The odds of a rate cut in March as seen by traders have dropped more than 10 percentage points from a week ago, per the CME FedWatch Tool. Read more: What the Fed rate-hike pause means for bank accounts, CDs, loans, and credit cards Big Tech led a stock market rally on Tuesday as Apple (AAPL) had its best day since May 2023. The S&P 500 (^GSPC) popped 0.9%, while the tech-heavy Nasdaq Composite (^IXIC) led gains, rising more than 1.3%. The Dow Jones Industrial Average (^DJI) rose about 0.5%. The S&P 500 is now nearing its record closing high of 4,796.56. Small caps have had a rough run in January. The Russell 2000 index is down about 5% in the month of January and is back around levels last seen before the December Federal Reserve meeting sent the markets into soft-landing euphoria. But while investors have been more tepid on the interest rate sensitive sector as skepticism builds on when the first interest rate cut will come, Goldman Sachs still sees 15% upside in the index over the next 12 months. Goldman Sachs equity strategist Ben Snider told Yahoo Finance his team sees opportunity with the index about 20% off its 2021 highs and a trajectory for strong economic growth to power small-cap companies. \"From a macro economic perspective, generally speaking, the US economy is the most important driver of equity performance broadly, and especially with small-cap equity performance,\" Snider said. And while Snider believes much of the positive economic news expected could have been priced in during the November and December rally for the index, the recent pullback in small caps reflects further potential upside. \"There is substantial lingering risk premium embedded in parts of the market, including small caps, because investors are still unsure that we're moving away from this higher-for-longer interest rate environment,\" Snider said. \"As the Fed begins to cut, we expect that to start at the March meeting, but whenever it is, as the Fed begins to cut, we should see that risk premium decline. We should see valuations normalize to average levels, if not above-average levels. \"And that is the reason why investors should be pretty optimistic about small gains.\" Apple stock was up nearly 3% on Thursday an upgrade from Bank of America. Yahoo Finance's Dan Howley reports: After a string of downgrades from Wall Street analysts, Apple’s (AAPL) stock received a much-needed vote of confidence on Thursday as Bank of America (BAC) analyst Wamsi Mohan upgraded the bank’s position on the company and raised its price target. Shares of Apple were up nearly 3% as of midday Thursday. In a research note, Mohan upgraded Apple to Buy from Neutral and increased its price objective from $208 to $225. Mohan said the company stands to benefit from a number of industry trends, as well as a glut of users who are using older iPhones and will need to upgrade to newer models in the coming years. Specifically, Mohan says that he expects a “stronger multi-year iPhone upgrade cycle driven by need for the latest hardware to enable Generative AI features to be introduced in 2024/2025.” He also expects to see better growth in the company’s services business and said risks around potential legal issues Apple could face are “manageable.” Apple is also preparing to launch its most ambitious product yet: the Vision Pro headset. The first new product category for the company since it launched the Apple Watch, the $3,499 Vision Pro will serve as a test for Apple’s ability to produce a new kind of device for what could be the next generation of computing. Taiwan Semiconductor (TSM) led the Yahoo Finance trending tickers pages on Thursday afternoon following its latest quarterly earnings release. The company topped Wall Street's estimates for earnings per share and projected revenue will grow 20% in 2024 driven by artificial intelligence demand. Shares of Apple (AAPL) increased nearly 3% after Bank of America upgraded the stock to Buy from Neutral. Analyst Wamsi Mohan bumped his price target to $225 from $208 citing artificial intelligence and the new Vision Pro headset as key drivers. Humana (HUM) stock tumbled roughly 10% after the US health insurer said an increase in older patients seeking care would hurt its fourth quarter results. Plug Power (PLUG) shares tumbled about 15% on Thursday after the hydrogen fuel cell developer announced a potential $1 billion stock offering plan. The vast training sets that gobble up troves of data from the open web to inspire AI models may become smaller and more curated, bypassing copyright issues at the center of the legal debate over tools like ChatGPT. OpenAI CEO Sam Altman says he believes future AI models will use less training data but of higher quality. \"One thing that I expect to start changing is these models will be able to take small amounts of higher-quality data during their training process and think harder about it and learn more,\" Altman said on a panel interview at the World Economic Forum in Davos on Thursday. Current generative AI models rely on huge datasets to train their tools. And since the data comes from the internet, the material includes copyrighted works from creators who never consented for their content to be part of the training set. Some major publishers have agreed to license their content to AI companies. But others, including the New York Times, have sued AI companies for copyright infringement. How courts will apply legacy copyright law to new AI technologies is perhaps the biggest challenge facing businesses like OpenAI. Altman said during the interview that \"any one particular training source doesn't move the needle for us that much.\" For OpenAI and others, a model where publishers opt out of the training process, excluding their content from the development process, is one way for creators to protect themselves. But Altman also envisions a new paradigm of smaller pools of data and one in which creators are compensated for helping to inspire AI tools. \"We wont need the same massive amounts of training data,\" he said. \"But what we want in any case is to find new economic models that work for the whole world including content owners.\" He added: \"If you teach our models, if you help provide the human feedback, I'd love to find new models for you to get paid based off the success of that.\" Mortgage rates' recent decline continued in data released on Thursday. Yahoo Finance's Rebecca Chen reports: The average rate for a 30-year loan dropped to 6.60% from 6.66% a week prior, according to Freddie Mac on Thursday. The latest average is the lowest level in seven months, since May 2023 when rates were around 6.57%. Homebuyers are returning to the market as borrowing costs retreated nearly 120 basis points from their October high, when rates nearly broke the 8% mark. Aiding homebuyers is the uptick in listings from homeowners finally selling after a year of gridlock. However, experts said the rise in inventory may still not be enough to supply underlying demand. “Mortgage rates decreased this week, reaching their lowest level since May of 2023,” Sam Khater, Freddie Mac’s chief economist, said in a statement. “This is an encouraging development for the housing market and in particular first-time homebuyers who are sensitive to changes in housing affordability. However, as purchase demand continues to thaw, it will put more pressure on already depleted inventory for sale.” Plug Power (PLUG) shares tumbled as much as 16% on Thursday after the hydrogen fuel cell developer announced a potential $1 billion stock offering plan. The capital raise comes about two months after the Latham, N.Y.-based company issued a \"going concern\" notice regarding its potential inability to fund operations over the next year. On Thursday Morningstar analysts noted, \"This hints that the company may be experiencing difficulty in arranging other financing solutions at reasonable terms.\" During the company's third quarter earnings call last November, Plug Power CEO Andy Marsh said, \"This was a difficult quarter.\" He added, \"Over the past several months, there have been enormous challenges associated with the availability of hydrogen, primarily due to downed plants, including our Tennessee facility, and temporary plant outages across the entire hydrogen network.\" Plug Power shares were down 12%, trading at around $2.40 each at 11:30 a.m. Eastern. The stock is down roughly 48% year to date. Homebuilders pulled back less than expected on the start of construction for new homes in December while permits issued to build rose, signaling a continued recovery in the housing market. New residential construction, including single family and multifamily homes, fell 4.3% in December from the month prior to an annualized rate of 1.460 million units, according to data from the Census Bureau released Thursday. The results were higher than the forecast of 1.425 million units from economists surveyed by Bloomberg. Authorized residential permits — an indicator of future activity — rose 1.9% to a rate of 1.495 million units in December, up from November's revised rate of 1.467 million units. This beat forecasts for a rate of 1.477 million units, according to data from Bloomberg. \"Most of the drop in housing starts reflects the partial reversal of the spike in November single-family starts, but the less-volatile permits numbers suggest that the steady uptrend in single-family construction will continue,\" Kieran Clancy, senior US economist at Pantheon Macroeconomics, wrote following the release. Starts on multifamily structures with five or more units landed at 417,000 for December, slightly higher than the previous month's 404,000 units. Permits to start construction on multiple properties with five or more units reached 449,000 units in December, a 3.2% increase from the previous month. \"The fall on the month [for housing starts] was something of a surprise to us given that November’s strength was caused by it being an unseasonably warm and dry month, and last month was the warmest December on record,\" wrote Thomas Ryan, property economist at Capital Economics. \"Looking ahead to this year, we don’t think mortgage rates will fall enough to unwind mortgage rate 'lock-in' and cause a meaningful recovery in supply,\" Ryan added. \"Against that backdrop, demand will continue to get diverted to newbuilds, which will also encourage stronger construction activity.\" Markets had been in search of a catalyst that wasn't macroeconomic data, and it appears the tech sector has once again stepped in with good news to lift the broader averages. Taiwan Semiconductor (TSM) took the lead role on Thursday as the chipmaker, which supplies to the likes of Apple (APPL) and Nvidia (NVDA), reported quarterly results before the opening bell that beat estimates. The company's adjusted earnings per share of $1.48 came in higher than Wall Street's expectations for $1.38. And, perhaps more importantly, the chipmaker said artificial intelligence is fueling its success. Taiwan Semiconductor said it expects revenue to grow 20% in 2024 due in part to AI demand. The news sent the semiconductor index (^SOX) nearly 3% higher while market bellwether Nvidia shot up over 2%. This came as an upgrade on Apple (AAPL) stock from Bank of America sent shares of the iPhone maker nearly 3% higher. To Keith Lerner, the co-chief investment officer at Truist, news like Thursday's is still key to driving the market higher given tech's outsized weight in the major averages. \"With the concentration that you still have, I think, tech showing the earnings and the ability to grow earnings at a good pace, even if we have a step down in growth, is very important to keep this market moving forward,\" Lerner told Yahoo Finance on Wednesday ahead of tech earnings. The S&P 500 (^GSPC) added around 0.4%, while the tech-heavy Nasdaq Composite (^IXIC) led gains, rising 1% in morning trade. US stocks tipped higher on Thursday, eyeing a rebound from recent losses as investors looked to fresh quarterly earnings for inspiration amid dwindling hopes for an early 2024 interest rate cut. The S&P 500 (^GSPC) added around 0.4%, and the tech-heavy Nasdaq Composite (^IXIC) led gains, rising 1%. The Dow Jones Industrial Average (^DJI) dropped about 0.3%. Techs led stocks higher after a bullish AI-fueled revenue outlook from TSMC (TSM), a key supplier to Apple (APPL) and Nvidia (NVDA). The Taiwanese contract chipmaker's profit fell but beat Wall Street estimates. Shares of AMD (AMD) and other chipmakers stepped higher as TSMC put on almost 7%. Weekly jobless claims hit their lowest level in more than a year last week despite concerns over slowing in the labor market to start 2024. Fresh data from the Department of Labor showed 187,000 unemployment claims were filed last week. Economists surveyed by Bloomberg had expected 208,000 claims. \"Most labor market indicators show progress toward a rebalancing in supply and demand, but that is happening without a rise in layoffs, with initial jobless claims falling to their lowest level since September 2022,\" Oxford Economics US economist Matthew Martin wrote in a note to clients. \"Though seasonal factors overstate the drop, the low levels of claims suggest vacancies rather than employment continue to bear the burden of softening labor demand.\" Click here for in-depth analysis of the latest stock market news and events moving stock prices. Read the latest financial and business news from Yahoo Finance Related Quotes "
}