{
    "title": null,
    "date": "1/3/2024",
    "url": "https://www.marketwatch.com/story/tech-stocks-lead-european-bourses-lower-following-apple-downgrade-9678ce9b",
    "text": "European bourses faltered Wednesday in the wake of Wall Street’s new-year sell-off with the region’s technology plays under notable pressure after a downgrade for Apple led the sector lower. The DAX index \n        DX:DAX\n       in Frankfurt fell 1% and the FTSE 100 \n        UK:UKX\n       in London celebrated its 40th birthday with a 0.8% drop as miners struggled on concerns about waning economic growth. The CAC 40 \n        FR:PX1\n       in Paris lost 1.4% as train-maker Alstom \n        ALO,\n        +2.58%\n       fell  7% in response to Barclays cutting its price target for the train-maker from €8.5 to €8. Luxury-goods groups were also under pressure, with LVMH \n        MC,\n        +0.41%\n       and Kering \n        KER,\n        -0.07%\n       off about 3% after UBS analysts warned of a “weak earnings season” for the sector. Amsterdam’s AEX index \n        NL:AEX\n       retreated 0.6% as chip-equipment makers ASML \n        ASML,\n        -0.34%\n       and ASM International \n        ASM,\n        -1.39%\n       fell 2% and nearly 3% respectively in sympathy with a pullback for the sector in Asia, and previously in the U.S. In addition, Franco-Italian chipmaker STMicroelectronics \n        STMPA,\n        -1.26%\n       was down 2.4% and its German peer Infineon Technologies \n        IFX,\n        +0.13%\n       lost nearly 3%. The sector, which has had a good run of late  — with ASML up 16.5% over the last three months and ASM International up 82% over the last 12 months — was deemed ripe for some profit taking.  And this was sparked by a downgrade of Apple \n        AAPL,\n        -1.06%\n       by Barclays on Tuesday from neutral to underweight, in a note which triggered a broad tech sell-off. ASML had already found its shares under the cosh on Tuesday following a report from Bloomberg that the U.S. had pressured the company to cancel the shipment of some of its machines to China. “Tech stocks, with their rich valuations, are susceptible to the slightest economic wobble or shift higher in yields, and it’s not like everyone was participating in this narrow market high driven by A.I. hype,” said Stephen Innes, managing partner at SPI asset Management. Elsewhere, shares in Airbus \n        AIR,\n        -0.51%\n       fell 2% after the airplane manufacturer said it was in talks to buy Atos’s \n        ATO,\n        +6.81%\n       cybersecurity unit  that values the business at up to €1.8 billion ($1.97 billion) including debt. A notable top performer was U.K. minnow C4X Discovery \n        C4XD,\n        -3.60%,\n       whose shares soared nearly 50% after the biotech group received an $11 million milestone payment from AstraZeneca \n        AZN,\n        -0.60%. The possibility that U.S. inflation won’t trend much lower from here is raising concerns that Federal Reserve policymakers are mistakenly clinging to prospects for three interest-rate cuts this year and may lose their credibility, which could trigger cross-asset volatility. Jamie Chisholm is a markets reporter based in London. Jamie Chisholm is a markets reporter based in London. Visit a quote page and your recently viewed tickers will be displayed here. "
}