{
    "title": "Microsoft gets closer to overtaking Apple as most valuable U.S. company",
    "date": "1/4/2024",
    "url": "https://www.marketwatch.com/story/microsoft-gets-closer-to-overtaking-apple-as-most-valuable-u-s-company-c3d9b639",
    "text": "Microsoft Corp. is getting closer to retaking the title of most valuable U.S. company as it narrows in on Apple Inc. Now valued at $2.73 trillion, Microsoft \n        MSFT,\n        -0.17%\n       is worth about $100 billion less than Apple \n        AAPL,\n        -1.06%,\n       which is valued at $2.83 trillion. Apple hasn’t been worth less than Microsoft since a 14-session stretch that ended Nov. 17, 2021, and the market-cap gap hasn’t been this small since Nov. 22, 2021. Microsoft’s stock is coming off a slightly stronger year than Apple’s, having risen 57% in 2023 as compared with 48% for Apple. Microsoft shares have also seen slimmer losses to start 2024. The rally in Microsoft shares comes as enterprise spending has held up, aiding the company’s Azure cloud-computing business. Azure has also benefited from the artificial-intelligence frenzy, with analysts noting that AI seems to be helping the company outperform rival Alphabet Inc. \n        GOOG,\n        +0.21%\nGOOGL,\n        +0.04%\n       in the cloud. Read: Microsoft ‘has taken the AI mantel from Google’—and now it’s coming for Amazon in the cloud Microsoft’s business is levered to AI in other ways, and a key test in the year ahead is whether customers will pay up for AI enhancements to the company’s productivity and other software offerings. Also see: Microsoft adds AI button to keyboards to summon chatbots Apple, meanwhile, has seen its business stagnate in recent quarters as the company deals with heightened competition in China and general macroeconomic pressure that is weighing on consumer spending. The company has posted four consecutive quarters of year-over-year revenue declines, and two analysts have downgraded the stock so far in 2024, warning of the potential for continued pressure in the smartphone market. Read: Apple’s stock gets another downgrade as iPhone doldrums could continue The deal could expand Home Depot’s market by $50 billion. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}