{
    "title": "Apple's holiday quarter earnings call & report scheduled for February 1",
    "date": "1/8/2024",
    "url": "https://appleinsider.com/articles/24/01/08/apples-holiday-quarter-earnings-call-report-scheduled-for-february-1",
    "text": "Copyright © 2024, Quiller Media, Inc. Contact Us | Privacy Policy Apple Park Apple has officially announced that its first quarter 2024 earnings call, covering the holiday period, will be held February 1, 2024.\r  The holiday quarter is Apple's most lucrative, with new iPhone sales amplified by the gift-giving season. The financial results for the period from October to December 2023 will be published, followed by a conference call with CEO Tim Cook and CFO Luca Maestri.\rApple shared the earnings call will occur on February 1, at 5 p.m. Eastern via its Investor Relations portal. The earnings call will discuss information from the earnings report, forward looking statements, and include a short question and answer segment with analysts.\rThe fiscal first quarter is Apple's best based on historical trends. It is the first with a full quarter of new iPhone sales, plus other device releases.\rThe iPhone 15 and iPhone 15 Pro lineups launched in September to immediate success, as Tim Cook commented it was the best September quarter ever for iPhone. Apple's \"Scary Fast\" October event revealed three M3 processors used in an updated 24-inch iMac, 14-inch MacBook Pro, and 16-inch MacBook Pro.\rNew Mac availability through November and December should provide a favorable compare to Q1 2023, as Apple didn't announce any new Macs in the second half of 2022. The M2 processor arrived in June 2022 in the MacBook Air, then M2 Pro/Max came to the MacBook Pro lineup in January 2023 —  thus missing the fiscal Q1 2023 entirely.\r\"We have great confidence in our Mac lineup and are excited about the recently announced iMac and MacBook Pro powered by our M3 chips,\" Luca Maestri said on the Q4 earnings call. \"Our install base is at an all-time high, and half of Mac buyers during the quarter were new to the product, driven by MacBook Air. Also, we saw reported customer satisfaction of 97% for Mac in the U.S.\"\r Apple Watches banned from import by the ITC Apple's previous year of earnings hasn't been a bright spot for the company, as it saw four consecutive quarters of revenue decline. Services continues to be a growth area for Apple, but the post-pandemic market has been a decline for most hardware.\rWearables will be a tough compare, however, since 2022 supply chain conditions pushed demand into Q1 2023. Apple Watch Series 9 and Apple Watch Ultra 2 launched without supply issues, thus allowing demand to concentrate on Q4 2023, likely lowering the available demand for Q1 2024.\rThe ongoing Masimo case against Apple and potential for an Apple Watch import ban will likely be the focus of analysts. The initial ban didn't occur until December 25 and lasted only two days before a short stay, but if the ban begins again in January, it will mean significant impact to Q2. The holiday quarter is Apple's most lucrative, with new iPhone sales amplified by the gift-giving season. The financial results for the period from October to December 2023 will be published, followed by a conference call with CEO Tim Cook and CFO Luca Maestri. Apple shared the earnings call will occur on February 1, at 5 p.m. Eastern via its Investor Relations portal. The earnings call will discuss information from the earnings report, forward looking statements, and include a short question and answer segment with analysts. The fiscal first quarter is Apple's best based on historical trends. It is the first with a full quarter of new iPhone sales, plus other device releases. The iPhone 15 and iPhone 15 Pro lineups launched in September to immediate success, as Tim Cook commented it was the best September quarter ever for iPhone. Apple's \"Scary Fast\" October event revealed three M3 processors used in an updated 24-inch iMac, 14-inch MacBook Pro, and 16-inch MacBook Pro. New Mac availability through November and December should provide a favorable compare to Q1 2023, as Apple didn't announce any new Macs in the second half of 2022. The M2 processor arrived in June 2022 in the MacBook Air, then M2 Pro/Max came to the MacBook Pro lineup in January 2023 —  thus missing the fiscal Q1 2023 entirely. \"We have great confidence in our Mac lineup and are excited about the recently announced iMac and MacBook Pro powered by our M3 chips,\" Luca Maestri said on the Q4 earnings call. \"Our install base is at an all-time high, and half of Mac buyers during the quarter were new to the product, driven by MacBook Air. Also, we saw reported customer satisfaction of 97% for Mac in the U.S.\" Apple's previous year of earnings hasn't been a bright spot for the company, as it saw four consecutive quarters of revenue decline. Services continues to be a growth area for Apple, but the post-pandemic market has been a decline for most hardware. Wearables will be a tough compare, however, since 2022 supply chain conditions pushed demand into Q1 2023. Apple Watch Series 9 and Apple Watch Ultra 2 launched without supply issues, thus allowing demand to concentrate on Q4 2023, likely lowering the available demand for Q1 2024. The ongoing Masimo case against Apple and potential for an Apple Watch import ban will likely be the focus of analysts. The initial ban didn't occur until December 25 and lasted only two days before a short stay, but if the ban begins again in January, it will mean significant impact to Q2. Wesley Hilliard served ten years as a Nuclear Power Electrician in the US Navy, then jumped careers in 2019. Today, he is Assistant Editor, Podcast Cohost, SEO Specialist, and Social Media Manager for AppleInsider. Apple will be holding WWDC 2024 from June 10, showing off its future operating system updates and maybe even new hardware. This is what has been rumored so far. Time Machine is Apple's backup system that automatically saves your Mac's files. Here's how to use the macOS file protection feature. Sponsored Content As streaming becomes more unreliable, having a backup copy is becoming a greater priority, leaving more internet users turning to a YouTube video downloader for various reasons. We checked out the 4K Video Downloader app on Mac to learn how to download YouTube videos for free. Canada's complex car theft ring, which often involves stealing and shipping expensive cars and SUVs around the world, just got even creepier thanks to AirTag. We now have a date for WWDC 2024, we have perhaps more idea than ever of just what it will cover, and we have ever increasing rumors of a smart Apple Ring. All we need now is the release of new iPads. B&H has dropped MacBook Pro prices further as March comes to a close. Pick up an M3 MacBook Pro with 16GB RAM for just $1,549 — or opt for the M3 Pro MacBook Pro 14-inch for $1,699. Both are record-breaking deals. Fake iPhones, AirPods and iPhone cases were among counterfeit goods seized in police raids in Northern Ireland. A photograph of cases intended for the iPhone 16 indicates at least one accessory producer is leaning in on rumors of a new vertical camera arrangement in the new models. With the earliest possible trial date start likely in late 2026, analysts are generally nonplussed by the Department of Justice omnibus antitrust suit and are telling investors to stick with Apple. Aiming to show that its carbon reduction efforts are not mere \"climate-washing,\" Apple has spotlighted how its Restore Fund is contributing to the restoration of a Brazilian rainforest, and attempts to save over 3,000 types of tree from extinction. Investment firm Evercore says Apple is facing weakening demand and strong competition from AI rivals, but investors should stick with it for the long term.  "
}