{
    "title": "Apple (AAPL) to Report Q1 Earnings: What's in the Offing?",
    "date": "1/29/2024",
    "url": "https://finance.yahoo.com/news/apple-aapl-report-q1-earnings-162000992.html",
    "text": "Apple AAPL is set to report its first-quarter fiscal 2024 results on Feb 1.The company expects the December quarter’s (first-quarter fiscal 2024) revenues to be similar to that of the year-ago quarter’s figure. In first-quarter fiscal 2023, net sales declined 5.5% year over year to $117.15 billion.The Zacks Consensus Estimate for fiscal first-quarter revenues is currently pegged at $117.62 billion, indicating growth of 0.40% year over year.The consensus mark for earnings is currently pegged at $2.09 per share, up by a penny over the past 30 days, indicating an 11.17% increase from the figure reported in the year-ago quarter.Apple’s earnings beat the Zacks Consensus Estimate in three of the trailing four quarters, missing once, the earnings surprise being 3.47% on average. Apple Inc. price-eps-surprise | Apple Inc. Quote Let’s see how things have shaped up for the upcoming announcement. Apple’s fortunes are heavily reliant on the iPhone, which is by far its biggest revenue contributor. The device accounted for 48.9% of net sales in the last reported quarter, wherein sales decreased 0.7% year over year to $43.805 billion.Apple expects iPhone’s year-over-year revenues to grow on an absolute basis. Our model estimates for fiscal first-quarter iPhone net sales are pegged at $66.68 billion, up 1.4% year over year.Apple is expected to have shipped roughly 72.3 million iPhones in the first quarter of fiscal 2024, per our model.Per the latest Canalys report on worldwide smartphone shipments, Apple’s market share was 24% in the fourth quarter of calendar 2023, beating Samsung’s 17%, driven by new iPhone launches - iPhone 15, iPhone 15 Plus, iPhone 15 Pro and iPhone 15 Pro Max.However, iPhone sales are expected to have suffered from weak demand in the Chinese market due to lower demand amid stiff competition from Huawei and a ban on usage by government officials. For the fiscal first quarter, Apple expects average revenues per week to grow at a similar strong double-digit rate as it did during the September quarter.In the fiscal fourth quarter, Services revenues grew 16.3% from the year-ago quarter to $22.31 billion and accounted for 24.9% of sales.An expanding paid subscriber base has been a key catalyst for the Services business, which is riding on the increasing popularity of the App Store and an expanding installed base of devices.Apple has more than 1 billion paid subscribers across its Services portfolio. App Store continues to grab the attention of prominent developers from around the world, helping the company to offer exciting new apps that drive traffic.Services like Apple TV+, Apple Arcade, Apple News+, Apple Card, Apple Fitness+ and Apple One bundle are expected to have contributed to overall growth.Apple TV+ has been gaining recognition due to its strong content. Apple’s impressive run at the award shows has been instrumental in driving recognition of Apple TV+ in the saturated streaming market currently dominated by the likes of Amazon AMZN Prime Video, Netflix NFLX and Disney’s DIS Disney+.Consumption of Apple TV+ doubled in 2023, per a report from Deadline cited by 9TO5 Mac. Total viewership surged 42% year over year.Movies and shows like The Family Plan, The Morning Show, Lessons in Chemistry, Messi Meets America, Slow Horses, For All Mankind, Silo, Hijack, Bad Sisters and Ted Lasso drove consumption.However, higher viewership has not essentially turned into a market share leadership for Apple TV+. According to 9TO5Mac, which cited a JustWatch report, Amazon Prime Video was #1 in terms of market share (22%) in the United States, trailed by Netflix (21%). Max, Disney+ and Hulu had 15%,12% and 11% market share, respectively. Apple TV+’s market share increased from 6% to 7%.Our estimate for fiscal first-quarter Services net sales is pegged at $22.65 billion, indicating 9.1% year-over-year growth.Currently, Apple carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Stay on top of upcoming earnings announcements with the Zacks Earnings Calendar. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Netflix, Inc. (NFLX) : Free Stock Analysis Report The Walt Disney Company (DIS) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}