{
    "title": "Apple announces changes to iOS, Safari and the App Store in the European \nUnion",
    "date": "1/26/2024",
    "url": "https://www.apple.com/au/newsroom/2024/01/apple-announces-changes-to-ios-safari-and-the-app-store-in-the-european-union/",
    "text": "Text of this article 26 January 2024 PRESS RELEASE Apple announces changes to iOS, Safari and the App Store in the European Union For developers, the changes include new options for app distribution and payment processing For users, the changes include new controls and disclosures, and expanded protections to reduce privacy and security risks the DMA creates CUPERTINO, CALIFORNIA Apple today announced changes to iOS, Safari and the App Store impacting developers’ apps in the European Union (EU) to comply with the Digital Markets Act (DMA). The changes include more than 600 new APIs, expanded app analytics, functionality for alternative browser engines, and options for processing app payments and distributing iOS apps. Across every change, Apple is introducing new safeguards that reduce — but don’t eliminate — new risks the DMA poses to EU users. With these steps, Apple will continue to deliver the best, most secure experience possible for EU users. The new options for processing payments and downloading apps on iOS open new avenues for malware, fraud and scams, illicit and harmful content, and other privacy and security threats. That’s why Apple is introducing protections — including Notarization for iOS apps, an authorisation for marketplace developers and disclosures on alternative payments — to reduce risks and deliver the best, most secure experience possible for users in the EU. Even with these safeguards in place, many risks remain. Developers can learn about these changes on the Apple Developer Support page and can begin testing new capabilities today in the iOS 17.4 beta. The new capabilities will become available to users in the 27 EU countries beginning in March 2024. “The changes we’re announcing today comply with the Digital Markets Act’s requirements in the European Union, while helping to protect EU users from the unavoidable increased privacy and security threats this regulation brings. Our priority remains creating the best, most secure possible experience for our users in the EU and around the world,” said Phil Schiller, Apple Fellow. “Developers can now learn about the new tools and terms available for alternative app distribution and alternative payment processing, new capabilities for alternative browser engines and contactless payments, and more. Importantly, developers can choose to remain on the same business terms in place today if they prefer.” The changes for EU apps reflect the European Commission’s designation of iOS, Safari and the App Store as “core platform services” under the Digital Markets Act. In March, Apple will share new resources to help EU users understand the changes they can expect. That includes guidance to help EU users navigate complexities the DMA’s changes bring — including a less intuitive user experience — and best practices for approaching new risks associated with downloading apps and processing payments outside of the App Store. Available for developers’ apps around the world, Apple also announced new options for streaming games, along with more than 50 forthcoming reports in areas like engagement, commerce, app usage and more. Changes to iOS In the EU, Apple is making a number of changes to iOS to comply with the DMA. For developers, those changes include new options for distributing apps. The coming changes to iOS in the EU include: As announced by the European Commission, Apple is also sharing DMA-compliant changes impacting contactless payments. That includes new APIs enabling developers to use NFC technology in their banking and wallet apps throughout the European Economic Area. And in the EU, Apple is introducing new controls that allow users to select a third-party contactless payment app — or an alternative app marketplace — as their default. Inevitably, the new options for developers’ EU apps create new risks to Apple users and their devices. Apple can’t eliminate those risks, but within the DMA’s constraints, the company will take steps to reduce them. These safeguards will be in place when users download iOS 17.4 or later, beginning in March, and include: These protections — including Notarization for iOS apps, and authorisation for marketplace developers — help reduce some of the privacy and security risks to iOS users in the EU. That includes threats like malware or malicious code, and risks of installing apps that misrepresent their functionality or the responsible developer. However, Apple has less ability to address other risks — including apps that contain scams, fraud and abuse, or that expose users to illicit, objectionable or harmful content. In addition, apps that use alternative browser engines — other than Apple’s WebKit — may negatively affect the user experience, including impacts to system performance and battery life. Within the DMA’s constraints, Apple is committed to protecting the privacy, security and quality of the iOS user experience in the EU as much as possible. For instance, App Tracking Transparency will continue to work with apps distributed outside of the App Store — asking a user’s permission before a developer tracks their data across apps or websites. However, the DMA’s requirements mean that App Store features — including Family Purchase Sharing and Ask to Buy — will not be compatible with apps downloaded from outside of the App Store. When these changes come into effect in March, Apple will share more detailed resources explaining the options available to users — including best practices for protecting their privacy and security. Changes to Safari Today, iOS users already have the ability to set a third-party web browser — other than Safari — as their default. Reflecting the DMA’s requirements, Apple is also introducing a new choice screen that will surface when users first open Safari in iOS 17.4 or later. That screen will prompt EU users to choose a default browser from a list of options. This change is a result of the DMA’s requirements, and means that EU users will be confronted with a list of default browsers before they have the opportunity to understand the options available to them. The screen also interrupts EU users’ experience the first time they open Safari intending to navigate to a webpage. Changes to the App Store On the App Store, Apple is sharing a number of changes for developers with apps in the EU, affecting apps across Apple’s operating systems — including iOS, iPadOS, macOS, watchOS and tvOS. The changes also include new disclosures informing EU users of the risks associated with using alternatives to the App Store’s secure payment processing. The changes also include new steps to protect and inform EU users, including: For apps that use alternative payment processing, Apple will not be able to issue refunds, and will have less ability to support customers encountering issues, scams or fraud. Helpful App Store features — like Report a Problem, Family Sharing and Ask to Buy — will also not reflect these transactions. Users may have to share their payment information with additional parties, creating more opportunities for bad actors to steal sensitive financial information. And on the App Store, users’ purchase history and subscription management will only reflect transactions made using the App Store’s In-App Purchase system. New Business Terms for Apps in the EU Also today, Apple is sharing new business terms available for developers’ apps in the European Union. Developers can choose to adopt these new business terms, or stay on Apple’s existing terms. Developers must adopt the new business terms for EU apps to use the new capabilities for alternative distribution or alternative payment processing. The new business terms for apps in the EU are necessary to support the DMA’s requirements for alternative distribution and payment processing. That includes a fee structure that reflects the many ways Apple creates value for developers’ businesses — including distribution and discovery on the App Store, the App Store’s secure payment processing, Apple’s trusted and secure mobile platform, and all the tools and technology to build and share innovative apps with users around the world. Developers operating under either set of business terms can continue to use the App Store’s secure payment processing and share their apps on the App Store in the EU. And both sets of business terms reflect Apple’s long-standing work to make the app ecosystem the best opportunity for all developers. Developers operating under the new business terms will have the option to distribute their iOS apps from the App Store and/or alternative app marketplaces. These developers can also choose to use alternative payment processors in their EU apps on the App Store, across Apple’s operating systems. The new business terms for iOS apps in the EU have three elements: For apps on iPadOS, macOS, watchOS and tvOS in the EU, developers who process payments using a PSP or by linking out to their website will get a 3 per cent discount on the commission they owe to Apple. Apple is also sharing a fee calculator tool and new reports to help developers estimate the potential impact of the new business terms on their app businesses. Developers can learn more about the changes for EU apps on a new Apple Developer Support page and can begin testing these capabilities today in the iOS 17.4 beta. Press Contacts Elizabeth Cave Apple lcave@apple.com +61 418 445 940 Nelly Assayag Apple nassayag@apple.com +61 410 213 869 Images in this article About Apple Apple revolutionised personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch and Apple TV. Apple’s five software platforms — iOS, iPadOS, macOS, watchOS and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it. Elizabeth Cave  Apple lcave@apple.com +61 418 445 940 Nelly Assayag Apple  nassayag@apple.com +61 410 213 869 The latest news and updates,  direct from Apple. Read more "
}