{
    "title": "Apple “took Revenge” On The European Union For The New Law. The Company Has \nDisabled Support For PWA Web ...",
    "date": "2/17/2024",
    "url": "https://gadgettendency.com/apple-took-revenge-on-the-european-union-for-the-new-law-the-company-has-disabled-support-for-pwa-web-applications-for-eu-residents/",
    "text": "Published on By Apple, as you know, under pressure from a new EU law, will allow iPhone users in the EU to install applications from third-party sources.  It turned out that in “retaliation” for this, Apple began to disable support for web applications (Progressive Web Apps; PWA) for EU residents. Photo: Vjeran Pavic / The Verge The apps no longer work in the iOS 17.4 beta, and Apple has confirmed that this is a deliberate decision.  The reason for this decision lies precisely in the new legislation of the European Union.  Bringing PWA apps into compliance with the Digital Markets Act (DMA) will require an entirely new integration architecture that is impractical to implement, the company says.  One of these changes in particular requires Apple to allow third-party browsers to use their own engines in iOS, which is a problem because web apps are built directly on the Webkit engine that powers the Safari browser. \nAs a result, now in iOS 17.4, sites added to the home screen do not act as PWAs, but only as bookmarks that open a new tab in the browser. The apps no longer work in the iOS 17.4 beta, and Apple has confirmed that this is a deliberate decision.  The reason for this decision lies precisely in the new legislation of the European Union.  Bringing PWA apps into compliance with the Digital Markets Act (DMA) will require an entirely new integration architecture that is impractical to implement, the company says.  One of these changes in particular requires Apple to allow third-party browsers to use their own engines in iOS, which is a problem because web apps are built directly on the Webkit engine that powers the Safari browser. As a result, now in iOS 17.4, sites added to the home screen do not act as PWAs, but only as bookmarks that open a new tab in the browser. First AMD and Qualcomm, then Intel, and Apple will be the last.  A roadmap has appeared describing the release schedule of new processors from all companies New Apple magic: Presto allows you to update your iPhone without opening the box iPhone 16 Pro will receive an Apple A18 Pro chip, improved specifically for artificial intelligence Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  Published on By Microsoft has made a major update to the Windows 11 operating system, also known as Moment 5, available to all users as an optional update KB5035942. Users can optionally install KB5035942 through Windows Update.  Previously, the company allowed enthusiasts to manually activate new features from an update.  Moment 5 is now available to everyone directly from Windows Update. \nWindows 11 Moment 5 brings quite a lot of innovations.  Among them are an improved Copilot AI assistant function with new plugins and skills, improved “Photos” with a smart “eraser”, an improved Clipchamp video editor (possibly removing “awkward pauses”), closer integration with Android smartphones (can now be used in as a webcam), and much more. Users can optionally install KB5035942 through Windows Update.  Previously, the company allowed enthusiasts to manually activate new features from an update.  Moment 5 is now available to everyone directly from Windows Update. Windows 11 Moment 5 brings quite a lot of innovations.  Among them are an improved Copilot AI assistant function with new plugins and skills, improved “Photos” with a smart “eraser”, an improved Clipchamp video editor (possibly removing “awkward pauses”), closer integration with Android smartphones (can now be used in as a webcam), and much more. Published on By The official Xiaomi Auto app is currently available on the Apple App Store. This application allows you to prepare for the release of the Xiaomi SU7 car.  It contains the characteristics and technical parameters of the Xiaomi car. Users of the application can book a time for a test drive, select and order their Xiaomi car, and track the status of the order.\nIn addition, the application turns the smartphone into a remote control for most car functions and allows you to receive prompt information about battery charging and other parameters.\nThe application requires an iPhone with iOS 13.0 or a newer operating system.\nSales of Xiaomi SU7 will begin on March 28. Users of the application can book a time for a test drive, select and order their Xiaomi car, and track the status of the order. In addition, the application turns the smartphone into a remote control for most car functions and allows you to receive prompt information about battery charging and other parameters. The application requires an iPhone with iOS 13.0 or a newer operating system. Sales of Xiaomi SU7 will begin on March 28. Sales of Xiaomi SU7 will begin on March 28. Published on By On Friday, a Spanish court ruled to block the Telegram messenger in the country, and today the same court suspended its own ban. created by DALL-E Spain’s High Court has suspended its own order to block Telegram in the country.  The reason is waiting for a police report on the impact of the temporary ban on users.  Let us remember that the original resolution was supposed to be temporary. Thus, for now Telegram in Spain continues to operate without breaking the law, and then, as is now clear, the situation will depend, among other things, on the police report. Microsoft has made a major update to the Windows 11 operating system, also known as Moment 5, available to all... Space meteorologists have issued a forecast for this week warning of a possible geomagnetic storm caused by the release of... BYD is going to beat Toyota and Volkswagen by offering modern cars at very low prices. According to Bloomberg, the... Samsung promised to release the latest One UI 6.1 firmware for Galaxy S23 series smartphones at the end of March,... Toyota Corolla lost the title of best-selling car in the world for the first time in 20 years.  Tesla Model Y is the new king Scientists have created a quantum tornado in superfluid helium: a new step towards understanding the physics of black hole accretion Just four big cores, no Hyper-Threading, and this is Intel’s new flagship.  The top processor of the Lunar Lake generation appeared on the Internet Mitsubishi Fuso turned into an unusual motorhome © 2024 Gadget Tendency. All Rights Reserved "
}