{
    "title": "Apple bought 30+ AI startups last year, more than other tech giants",
    "date": "2/8/2024",
    "url": "https://9to5mac.com/2024/02/08/apple-bought-ai-startups/",
    "text": "A new report says that Apple bought “up to” 32 AI startups in 2023, more artificial intelligence acquisitions than any other tech giant. Apple is also said to have bought companies at an earlier stage in their development … The paywalled Statista report is summarised by Stocklytics. Apple’s pursuit of AI innovation has been evident in recent years. The tech giant has made a series of strategic acquisitions, including staff hires from AI startups to bolster its AI capabilities across various product lines […] Apple purchased up to 32 AI startups by 2023, the highest number among tech giants. In the overall AI startup acquisition, Google trails Apple with 21, Meta with 18, and Microsoft lags with 17. It goes on to say that, compared to other tech companies, Apple tends to recognize the value of startups at an earlier point than its rivals. One notable aspect of Apple’s acquisition spree is its emphasis on acquiring early-stage startups, indicating a proactive strategy to identify and invest in emerging AI trends and technologies before they reach mainstream adoption. The source data is an estimate, as Apple often makes quiet acquisitions without any announcement. CEO Tim Cook said back in 2021 that the company bought a startup every 3-4 weeks on average, and by the following year he said it was every 2-3 weeks. The Cupertino company says that it usually buys companies for their technology and their people, but almost never comments on its reasons for any particular purchase, instead issuing a boilerplate response to media enquiries: Apple buys smaller technology companies from time to time, and we generally do not discuss our purpose or plans. Photo by BoliviaInteligente on Unsplash FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Ben Lovejoy is a British technology writer and EU Editor for 9to5Mac. He’s known for his op-eds and diary pieces, exploring his experience of Apple products over time, for a more rounded review. He also writes fiction, with two technothriller novels, a couple of SF shorts and a rom-com! "
}