{
    "title": "Warren Buffett's Berkshire Hathaway reduces its stake in Apple",
    "date": "2/15/2024",
    "url": "https://www.irishtimes.com/business/2024/02/15/warren-buffetts-berkshire-hathaway-reduces-its-stake-in-apple/",
    "text": "Warren Buffett’s Berkshire Hathaway has reported figures for the third quarter. Photograph: AP Warren Buffett’s Berkshire Hathaway sold 10 million Apple shares in the last three months of 2023, cutting into a position that the so-called Oracle of Omaha has called one of the “four giants” that account for most of his group’s value. The sale, representing about 1.1 per cent of Berkshire’s holding in the technology company, was notable as Buffett had said as recently as 2021 that an earlier decision to cut its Apple stake was “probably a mistake”. Apple has become a critical holding for Berkshire and now accounts for roughly a fifth of its market value. Buffett’s sprawling conglomerate, which owns the BNSF railroad and Geico insurer, first invested in the iPhone maker in 2016 at the direction of one of his two investment deputies: Todd Combs and Ted Weschler. Buffett later supercharged the investment as he warmed to the technology company, and he spent tens of billions of dollars buying its stock. In 2022, he disclosed the cost of that stake was just over $31 billion. The bet has paid off handsomely. Even after the share sales, Berkshire’s 5.9 per cent position in Apple was worth $174 billion at year-end, according to a filing with the Securities and Exchange Commission on Wednesday. That dwarfs its second-largest publicly traded investment: Bank of America. Berkshire’s filing showed it had also slashed its holdings of printer and PC maker HP by 78 per cent, selling nearly 80 million shares in the fourth quarter, and had dumped 32 per cent of its stake in media company Paramount Global, offloading 30.4 million shares. The wager on Paramount in 2022 has been closely watched by the media industry, and was seen as an endorsement of the company’s investment in its Paramount+ streaming platform, as well as its ability to compete with deeper pocketed rivals such as Netflix, Disney and Warner Bros Discovery. However, it has been unclear from its inception whether Buffett himself had bet on the company, or if the trade had been directed by Combs or Weschler. Paramount’s controlling shareholder, Shari Redstone, has held early talks with possible suitors for the company as it works to cut losses after an expensive streaming war weighed on its stock price. Berkshire also exited its investments in payments business StoneCo, insurers Globe Life and Markel Corporation, and home builder DR Horton. The sale of DR Horton marked a sudden shift by an investor typically billed as a long-term holder; Berkshire disclosed it had invested in the largest US home builder just six months ago. The stock sales meant that the number of securities Berkshire held in its multibillion-dollar stock portfolio fell to 41 at the end of 2023. That was down from 49 a year earlier, as it exited stakes in companies including General Motors, UPS and Procter & Gamble earlier in the year. Berkshire did not disclose any new investments in the fourth quarter of 2023, although it increased its holdings in satellite radio operator SiriusXM and in oil majors Chevron and Occidental Petroleum. Berkshire did not immediately respond to a request for comment. – Copyright The Financial Times Limited 2024 © 2024 The Irish Times DAC © 2024 The Irish Times DAC "
}