{
    "title": "Apple rolls out iOS 17.4 Beta, introduces Alternative App Stores and \npayment methods | Mint",
    "date": "2/1/2024",
    "url": "https://www.livemint.com/technology/tech-news/apple-rolls-out-ios-17-4-beta-introduces-alternative-app-stores-and-payment-methods-11706764512944.html",
    "text": "Apple has rolled out the first beta update for iOS 17.4, bringing significant changes primarily focused on users in the European Union (EU). According to the official changelog, these updates align with the European Union's Digital Markets Act (DMA), which became effective on November 1, 2022. One notable change is the introduction of alternative app stores on iPhones, providing users with more choices beyond the traditional App Store. Additionally, app developers are no longer restricted to offering in-app purchases exclusively through the App Store, as alternative payment methods are now supported. For EU users, a new feature allows them to select a default browser when opening Safari, giving more control over their browsing experience. Furthermore, third-party apps in the EU now have access to NFC services with the iOS 17.4 beta update. This enhancement enables these apps to facilitate contactless payments without relying on Wallet or Apple Pay. While the iOS 17.4 beta 1 update will be available globally, it is important to note that these features are specifically designed for users within the European Union. In addition to the iOS 17.4 beta for iPhones, Apple has also released the beta version of iPadOS 17.4. Alongside these software updates, a new firmware labeled 6A324 has been introduced for AirPods Max. However, users are cautioned about the nature of beta updates. These releases are intended for testing purposes and may come with bugs and glitches that could impact iPhone performance. Potential issues include poor battery performance, malfunctioning apps, or temporary unresponsiveness. Therefore, users are advised to approach beta updates with caution, understanding that they offer access to new features but may come with certain trade-offs during the testing phase. Meanwhile, Mark Gurman from Bloomberg, has recently dropped some interesting news about the upcoming iOS 18. He hinted that the iOS 18 update could be the biggest update in the history of iPhones so far.   Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}