{
    "title": "India's quiet push to steal more of China's iPhone business",
    "date": "2/10/2024",
    "url": "https://www.businesstimes.com.sg/international/global/indias-quiet-push-steal-more-chinas-iphone-business",
    "text": "Hello, your email is unverified. Please confirm  for access to all your SPH accounts. Create a free account with Business Times  for seamless access across SPH Media products. Welcome,  Create a free account with Business Times  for seamless access across SPH Media products. Welcome,    \"India’s quiet push to steal more of China’s iPhone business\" Already have an account? Log in The Business Times Personal Edition at$9.90/month*\nSUBSCRIBE NOW\nFind out more about subscription packages here. Find out more about subscription packages here. The Business Times Personal Edition at $9.90/month*\n*Terms and conditions apply.\nSUBSCRIBE NOW\nFind out more about subscription packages here. *Terms and conditions apply. Find out more about subscription packages here. Subscribe to The Business Times Personal Edition at $9.90/month*\n*Terms and conditions apply.\nSUBSCRIBE NOW\nFind out more about subscription packages here. *Terms and conditions apply. Find out more about subscription packages here. INDIA is quietly grabbing from China more manufacturing of Apple’s iPhones and other electronics gear. It is happening in south Indian industrial areas on muddy plots that were once farmland. In Sriperumbudur, people call Apple “the customer”, not daring to say the name of a company that prizes its secrets. But some things are too big to hide. Two gigantic dormitory complexes are springing up from the earth. Once finished, each will be a tight block of 13 buildings with 24 rooms per floor around an L-shaped hallway. Every one of those pink-painted rooms will have beds for six workers, all women. The two blocks will house 18,720 workers apiece. It’s a ready-made scene from Shenzhen or Zhengzhou, the Chinese cities famous for their iPhone production prowess. And it’s no wonder. Sriperumbudur, in the state of Tamil Nadu, is the home of the expanding Indian fortress of Foxconn, the Taiwanese-based company that has long played the largest role in producing iPhones. And as recently as 2019, about 99 per cent of them were made in China. Start and end each day with the latest news stories and analyses delivered straight to your inbox. India, as part of a national manufacturing drive, is chipping away at that dominance, when many companies are looking to spread their work to countries other than China. An estimated 13 per cent of the world’s iPhones were assembled in India last year, and about three-quarters of those were made in Tamil Nadu. By next year, the volume produced in India is expected to double. But despite almost 10 years of a “Make in India” initiative promoted by the country’s powerful prime minister, Narendra Modi, manufacturing as a share of the economy has stalled out. At about 16 per cent, it is a shade lower than when Modi took office in 2014, and far lower than that of China, or of Japan, Taiwan and South Korea when those Asian tigers took off. India desperately needs more skilled jobs, and factory work creates them like nothing else. Last year, India overtook China to become the world’s most populous country, and its working-age population is speeding ahead. But turning that demographic bulge into an actual advantage means making India’s workers more productive. Half of them still depend on small farming. Tamil Nadu might point the way forward. The state of 72 million people is now succeeding in ways that have eluded India as a whole. The national government started subsidising electronics manufacturing across the country in 2021, setting off a gold rush in places such as Noida, next to New Delhi. But for Tamil Nadu, that incentive is not an essential lure. TRB Rajaa, Tamil Nadu’s minister of industries, can rattle off the state’s inbuilt advantages: schools, transport, engineering graduates. “We never compare our growth with other Indian states,” he said. “We chart ourselves to the growth of Scandinavian countries and how we can beat that.” Rajaa and other boosters of Tamil Nadu are proud of the human capital their state has built up, and especially of its women. Many of them work in formal jobs, while few women in other states do: 43 per cent of all Indian female factory employees work in Tamil Nadu, which is home to 5 per cent of the national population. Parts of Tamil Nadu are already working as industrial champions. A long belt of car and car-part manufacturers stretches down the coast from its capital, Chennai. In the western Coimbatore valley, factories specialise in die-casting and pump manufacturing. There is a knitwear cluster in Tiruppur, and the country’s biggest maker of matchsticks is in Sivakasi. It is striking that India is plunging into such high-end goods as the iPhone. India has never become internationally competitive making things such as T-shirts or sneakers, getting its clock cleaned by smaller and formerly less developed countries such as Bangladesh and Vietnam. This is not the first time this century that India was expected to move up the ranks of high-value electronics manufacturing. Nor the first time that Tamil Nadu seemed like the best launch pad for it. In 2006, Finland’s Nokia, then a cellphone colossus, built a big factory at the centre of Sriperumbudur’s government-planned industrial estate. It was supposed to make millions of phones a year, for India and the rest of the world. The smartphone, and the global financial crisis in 2009, knocked down those dreams. But the roots never died. Sriperumbudur was initially attractive because of its experience in auto manufacturing. Hyundai had set up shop in 1996, soon after India opened up its economy to more foreign investment and Tamil Nadu formed its first state development agency. Glassmaking and basic electrical goods followed. After a lull, the old Nokia site was built over by Salcomp, a local company that makes high-end power chargers, now for companies such as Apple. The plants of a dozen other known and rumoured Apple suppliers have sprouted around it, along with Samsung, Dell and most other big multinational electronics companies. On Friday (Feb 9), India’s Republic Day, Young Liu, CEO of Foxconn, was in New Delhi to be awarded the Padma Bhushan, the country’s third-highest civilian honour. “Let’s do our part,” he said, “for manufacturing in India and for the betterment of society”. In India and abroad, there is no shortage of excitement about the prospect of India’s supplanting China in at least some part of global supply chains. By last year, Tim Cook, Apple’s CEO, was in India with his palms pressed in namaste, inaugurating the country’s first Apple stores. All told, more than 130 Fortune 500 companies are doing business in Tamil Nadu. Rajaa, the state industry minister, isn’t stopping at US$1,000 smartphones, either. He and other officials in Tamil Nadu are trying to attract more businesses making cheaper things, too, in greater volume. If the rest of the country could follow Tamil Nadu, India might be able to produce enough of the less-skilled jobs its young and growing population needs. Rajaa spent the first week of January regaling foreign investors with plans that included a budding new industrial cluster, focused on non-leather footwear. About 140 miles south of Sriperumbudur, Nikes, Adidas and Crocs are just starting to roll off the lines in Perambalur. NYTIMES BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to t.me/BizTimes Now that you have experienced myBT with just a few keywords, subscribe to BT Premium to get full-access. You have reached your limit of 30 keywords.\nTo follow new keywords, edit your myBT settings. By signing up, you agree to our Privacy policy and Terms and Conditions.  Everything you need to know about Global Enterprise and the people behind them. Powered by  SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}