{
    "title": "Apple Is Playing It Cool In AI Race, But Top Fund Manager Says It May Be \nPriming To Lead Another 'Revolut",
    "date": "2/7/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/36981414/apple-is-playing-it-cool-in-ai-race-but-top-fund-manager-says-it-may-be-priming-to-",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Despite Apple, Inc. AAPL trailing its Magnificent Seven peers on the artificial intelligence technology front, the company could still make up for the early sluggishness by taking the lead in personalized AI, a fund manager said on Tuesday. What Happened: “Personalized AI will transform our lives and $AAPL is going to lead the way,” said Deepwater Asset Management’s Gene Munster in a post on X, formerly Twitter. The tech venture capitalist and fund manager premised his deduction on Apple CEO Tim Cook’s statement on the earnings call last week. “We continue to spend a tremendous amount of time and effort, and we’re excited to share the details of our ongoing work in that space later this year,” Cook had said. According to Munster, Apple has the scope for employing AI across its products and services. “I believe the biggest opportunity for Apple is to overlay AI across Messages, iCloud, Safari, Maps, Mail, Music, Apple TV, Fitness, and Calendar, and automate our lives,” he said. The fund manager expects Apple to announce an AI bot some time this year. “About 20% of the world is locked into Apple’s ecosystem and would welcome the product with open arms,” he said. Why It’s Important: Leadership in AI has propelled the shares of companies such as Nvidia Corp. NVDA and Microsoft Corp. MSFT to dizzying heights. The AI revolution began to take hold in early 2023 with the popularity of OpenAI’s GPT-powered AI chatbot, ChatGPT. Sensing the opportunity, Microsoft expanded its prior relationship with OpenAI with a $10 billion investment. As the software giant began deploying AI in several of its businesses, its stock price pushed ahead with verve, catapulting the company as the most valued global corporation. Incidentally, Microsoft dethroned Apple as the leader on that front. Apple, for one, hasn't committed to anything yet regarding its AI plans. In mid-July, Bloomberg reported that Cupertino has built its own framework to create large language models known as \"Ajax\" and created a chatbot service that some engineers call “Apple GPT.” In premarket trading on Wednesday, Apple rose 0.50% to $190.25, according to Benzinga Pro data. Read Next: Apple Q1 Earnings Beat Estimates As Cupertino Snaps 4-Quarter Revenue Decline Streak; Stock Slides On China Weakness © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}