{
    "title": null,
    "date": "2/9/2024",
    "url": "https://tech.hindustantimes.com/tech/news/apple-goes-to-war-over-ai-snaps-up-over-30-startups-in-2023-more-than-any-other-tech-titan-71707468495840.html",
    "text": "Copyright © HT Media Limited  All rights reserved. Apple has always been quiet about its plans and new innovations and the same applies to artificial intelligence (AI). However, it looks like Apple was caught on the backfoot when most of the other big tech companies like Microsoft, Google, Meta and even OpenAI stole all the AI thunder over the last year. Now, Apple is looking, not just to catch up, but overtake everyone else and for that, it has gone on a warpath - an acquisition spree in order to ensure it conquers this new technology in every way. So, even as it's working on its AI initiatives in-house, it is being reported that Apple has gone on the warpath and gobbled up more than 30 AI startups last year, which is shockingly higher than any other tech giant's investment. Over the last year, Apple built its base with AI technology and empowered its innovations and devices for future releases in many ways, but the start has been slow and now, it is expected to pick up phenomenally. Also, earlier it was rumored that the company is developing its own GPT or a conversational AI for its devices which also showcases its efforts to bring the technology to the market. So, what has Apple been up to on the AI battlefield? Know what the recent Statista study revealed about Apple's AI plans. We are on WhatsApp Channels. Click to join. A new study revealed that Apple has bought more than 30 new AI startups in 2023. The data was revealed by Statista. The number is greater than any tech giant investing in the new AI startups. The report said, “Apple purchased up to 32 AI startups by 2023, the highest number among tech giants. In the overall AI startup acquisition, Google trails Apple with 21, Meta with 18, and Microsoft lags with 17.” It was stated that Apple has been focusing on developing its own AI innovations and technology for its devices. Apple also hired staff from the startups to enhance its AI capabilities. 9To5Mac reported that most of these AI startups are in the early stages of development and that Apple acknowledges the potential of these startups early on. This strategy also works for the company in acquiring “emerging AI trends and technologies” before they are released for public use. Note that the data compiled by Statista is based on estimation as Tim Cook revealed that they acquire companies every 3 to 4 weeks and that it has been fast-paced in recent years. Apple also does not like to share the purpose and plan for their investment in building startups. Now in 2024, it is expected that Apple will make big AI announcements including the integration of technology in their upcoming iPhone 16 models. Social media scam alert! Most scams reported to the finance app Revolut started their journey on Facebook, Instagram and WhatsApp. Most money was lost to “get-rich-quick” schemes. Some interesting details in this article. Check it out here. AI opportunities in India! Microsoft CEO Satya Nadella urged more than a thousand Indian computer code developers they use the company's artificial intelligence tools being deployed across its products. Find out more details here. Voice cloning becomes illegal! US regulators have declared scam \"robocalls\" made using voices created with AI as illegal. This move comes after an impersonation of POTUS surfaced last month, requesting people not to cast ballots in the New Hampshire primary. Dive in here. Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71707468495840 "
}