{
    "title": "iOS 18: AI Server Industry Aiming to Win Business From Apple",
    "date": "2/29/2024",
    "url": "https://www.macrumors.com/2024/02/29/ios-18-ai-server-industry-aiming-to-win-business/",
    "text": "AI server makers are hoping to obtain orders from Apple ahead of its highly anticipated unveiling of new AI features later this year, according to Taiwanese research firm TrendForce. Server manufacturer Supermicro is reportedly \"aggressively expanding\" its efforts to secure AI-related orders from Apple. The company has the potential to double its shipments of AI servers this year, supported by orders from existing clients including CoreWeave and Tesla. Late last year, Apple analyst Ming-Chi Kuo reported that Apple is expected to spend around $4.75 billion on servers to support its AI technology in 2024, up from $620 million in 2023. The company could purchase up to 20,000 servers this year. Apple is widely expected to announce a range of new AI features at WWDC later this year as part of the preview of iOS 18 and its other software updates. At its annual shareholder meeting yesterday, Apple CEO Tim Cook said that the company will \"break new ground\" in generative AI in 2024. \"We believe it will unlock transformative opportunities for our users,\" he added. Get weekly top MacRumors stories in your inbox. Our comprehensive guide highlighting every major new addition in iOS 17, plus how-tos that walk you through using the new features. App Store changes for the EU, new emoji, Podcasts transcripts, and more. Get the most out your iPhone 15 with our complete guide to all the new features. A deep dive into new features in macOS Sonoma, big and small. Revamped models with OLED displays, M3 chip, and redesigned Magic Keyboard accessory. Updated 10.9-inch model and new 12.9-inch model, M2 chip expected. Apple's annual Worldwide Developers Conference will kick off with a keynote on June 10. Expected to see new AI-focused features and more. Preview coming at WWDC in June with public release in September. 22 hours ago by Tim Hardwick 23 hours ago by Tim Hardwick 1 day ago by Juli Clover 2 days ago by MacRumors Staff 3 days ago by MacRumors Staff  MacRumors attracts a broad audience of both consumers and professionals interested in the latest technologies and products. We also boast an active community focused on purchasing decisions and technical aspects of the iPhone, iPad, Mac, and other Apple platforms. "
}