{
    "title": "2 (More) Artificial Intelligence (AI) Growth Stocks Set to Hurtle Past \nApple Into the $3 Trillion Club, According to 1 Wall ...",
    "date": "2/3/2024",
    "url": "https://www.fool.com/investing/2024/02/03/artificial-intelligence-ai-growth-stock-trillion/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More It wasn't all that long ago that Apple seemed invincible. The iPhone maker was the first publicly traded company in the U.S. to surpass a $1 trillion market cap and has continued to check off succeeding benchmarks seemingly with ease: the first to sail past $2 trillion and $3 trillion, respectively. Over the past year or so, however, competition for the crown has stiffened, and Apple has traded places numerous times with Microsoft (MSFT -0.17%), which currently holds the market cap crown, with a market cap of more than $3.01 trillion, ahead of Apple's $2.87 trillion. One analyst believes that could be the new order of things, with two more stocks poised to hurtle past Apple's valuation in the years to come. Image source: Getty Images. Late in 2022, a sudden leap forward in the ability of artificial intelligence (AI) caught many off guard. To be clear, these sophisticated algorithms have been around in one form or another for decades, but 2023 seemed to mark a turning point in interest for the technology. The advent of generative AI took the technology to the next level, with the ability to not only search data for patterns, but create entirely new content from scratch with only minor prompts from the user. Perhaps more importantly, these AI models can automate menial tasks and improve processes, thereby freeing up workers to be more productive. The resulting gold rush to adopt AI has caused a paradigm shift, particularly among those companies that are best positioned to provide AI to the masses. Microsoft was first off the blocks, with a $13 billion stake in OpenAI, the creator of ChatGPT. The company quickly developed AI tools for its own software-as-a-service (SaaS) offerings, including Microsoft Office and 365. The headliner is Copilot, the company's AI-fueled digital assistant, which offers more than 150 new features designed to save time and increase productivity. These features include summarizing email messages and drafting potential responses, creating presentations from existing data, and writing and debugging computer code, among many other functions. Alphabet (GOOGL 0.04%) (GOOG 0.21%) was also quick off the mark. Its Pathways Language Model (PaLM) gave way to Gemini, which the company describes as \"Google's most capable AI model yet.\" The company said that its high-end Gemini Ultra model outperformed ChatGPT and \"exceeds current state-of-the-art results on 30 of the 32 widely used academic benchmarks used in large language model (LLM) research and development.\" Not to be outdone, Amazon (AMZN 0.31%) introduced Q, a business-focused AI assistant designed to help its Amazon Web Services (AWS) cloud infrastructure users streamline many of the same mundane tasks as its rivals, including searching the internet and corporate databases, summarizing emails and documents, and completing internal support requests, among other mundane tasks. Amazon also made a $4 billion investment and announced a strategic collaboration with Open AI competitor Anthropic AI. Savvy investors will note the common thread here: Microsoft, Google, and Amazon are collectively referred to as the \"Big Three\" cloud computing providers. Late last year, Needham analyst Laura Martin reiterated her view that the trio of cloud infrastructure providers -- Microsoft Azure, AWS, and Google Cloud -- have the most to gain from generative AI as the gatekeepers of the LLMs, suggesting they could capture a percentage of every new generative AI app created. \"Generative AI will redefine the basis of competition for media and internet companies,\" she wrote in a note to clients. Martin thinks AI is a natural fit for the cloud providers: Not only do [Microsoft, AWS, and Google Cloud's] LLMs have the lowest cost structures and first-mover advantages, but their average lifetime value per cloud customer is about to skyrocket, owing to the stickiness of apps built on their LLMs. There's evidence that seems to support her conclusion. By some estimates, 60% of all corporate data lives in the cloud, according to online data provider Statista. The practice is widespread, as an estimated 98% of corporations worldwide store at least some of their data in the cloud, according to cybersecurity solutions provider Check Point. Given the extensive reach of the trio, it's reasonable to conclude they are in the best position to benefit from the ongoing adoption of AI. The news isn't all bad for Apple shareholders. The company is reportedly working on AI of its own, including generative AI models. However, the technology is expected to focus on \"protecting their installed base\" of iPhones, according to Martin. This makes sense, given that 52% of Apple's $383 billion in fiscal 2023 revenue came from sales of the iPhone. Estimates regarding the market opportunity for AI vary wildly, but even the most conservative estimates place the impact at $1 trillion over the coming decade -- and some estimates are much higher. The benefits of generative AI are twofold for Amazon, Microsoft, and Alphabet. Not only do they have the opportunity to improve their existing businesses with the help of AI, but they will also benefit by using their extensive cloud infrastructure reach to sell AI services to the masses. There's also the matter of valuation to consider. Amazon, Microsoft, and Alphabet are currently selling for 33 times, 31 times, and 20 times forward earnings, as of this writing, making them relatively inexpensive in terms of the vast opportunity ahead. Don't expect this sale to last long. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet, Amazon, Apple, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Check Point Software Technologies, and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}