{
    "title": "YouTube Is Reportedly Building an Apple Vision Pro App",
    "date": "2/5/2024",
    "url": "https://hypebeast.com/2024/2/youtube-apple-vision-pro-app-report",
    "text": "  Google has plans to create a YouTube app that will live on Apple Vision Pro, according to a new report from The Verge. A spokesperson for the company stated that its roadmap includes an app native to Vision Pro’s operating system, per an email via the outlet. “We’re excited to see Vision Pro launch and we’re supporting it by ensuring YouTube users have a great experience in Safari,” YouTube’s Jessica Gibby told The Verge in an email. “We do not have any specific plans to share at this time, but can confirm that a Vision Pro app is on our roadmap.” Last month, YouTube stated that it did not have plans to immediately create an app for Vision Pro, and the company told Engadget that it would not make its iPad app available via visionOS. The company’s reported decision to move forward with its creation comes after developer Christian Selig created an unofficial YouTube app for the Apple headset called Juno, which was available at launch.\n“YouTube is probably one of the parts of the internet I consume the most, so I was more than a little sad when YouTube announced that they don’t have plans to build a visionOS app, and disabled the option to load the iPad app,” Selig, a former Apple developer, wrote in his blog post. He noted that users are still be able to use YouTube through Safari, but the website “definitely doesn’t feel like a visionOS app.”\nYouTube has yet to make an official announcement about the launch of its own app on visionOS.\n\n                                                \n                                                                                                    \n\n                                                            Read Full Article “YouTube is probably one of the parts of the internet I consume the most, so I was more than a little sad when YouTube announced that they don’t have plans to build a visionOS app, and disabled the option to load the iPad app,” Selig, a former Apple developer, wrote in his blog post. He noted that users are still be able to use YouTube through Safari, but the website “definitely doesn’t feel like a visionOS app.”\nYouTube has yet to make an official announcement about the launch of its own app on visionOS.\n\n                                                \n                                                                                                    \n\n                                                            Read Full Article YouTube has yet to make an official announcement about the launch of its own app on visionOS.\n\n                                                \n                                                                                                    \n\n                                                            Read Full Article    "
}