{
    "title": "Financial Times: Apple nejspíš potlačuje konkurenci. Evropská komise chystá \nmiliardovou pokutu",
    "date": "2/20/2024",
    "url": "https://archiv.hn.cz/c1-67296110-evropska-komise-da-applu-pokutu-asi-500-milionu-eur-kvuli-streamovani-hudby",
    "text": "Poslechněte si článek v audio podobě. Během poslechu se nepřeklikávejte pryč z článku. Evropská komise (EK) vyměří americké technologické společnosti Apple pokutu kolem 500 milionů eur (téměř 13 miliard korun) za porušování antimonopolních pravidel Evropské unie v souvislosti se streamováním hudby. V neděli o tom informoval britský list Financial Times (FT), který se odvolává na zdroje obeznámené s vyšetřováním. Podle listu se předpokládá, že EK pokutu oznámí začátkem příštího měsíce. Komise už delší dobu vyšetřuje, zda Apple nezvýhodňuje svou vlastní streamovací službu Apple Music na úkor konkurentů. Vyšetřování odstartovala stížnost, kterou v roce 2019 podala na Apple švédská streamovací služba Spotify. Komise podle zdrojů oznámí, že praktiky Applu jsou nezákonné a v rozporu s pravidly EU na ochranu hospodářské soutěže. Obviní firmu ze zneužívání silné pozice na trhu a z potlačování konkurence, píše britský list. Evropská komise doposud firmě Apple žádnou pokutu za porušování hospodářské soutěže nevyměřila. Americký konkurent Google dostal od EK v uplynulých letech už tři antimonopolní pokuty v celkové výši přes osm miliard eur. Společnost Apple v lednu oznámila změny u svého operačního systému iOS, obchodu s aplikacemi App Store a také u internetového prohlížeče Safari ve snaze rozptýlit obavy EK ohledně porušování hospodářské soutěže. Firma Spotify tehdy nicméně ústupky Applu označila za „naprostou frašku“. Společnost Apple se odmítla k blížícímu se rozhodnutí EK v kauze kolem streamování hudby vyjádřit. Poukázala nicméně na své starší prohlášení, ve kterém označila stížnost Spotify za neopodstatněnou. „App Store pomohl Spotify stát se nejrozšířenější streamovací službou v Evropě a my doufáme, že Evropská komise přestane řešit stížnost, která nemá žádné opodstatnění,“ cituje Financial Times ze zhruba rok starého prohlášení Applu. Chcete vědět, co se děje v české a světové ekonomice? Co si o aktuálních trendech myslí lidé z byznysu, majitelé firem a jejich šéfové? Každý týden v pátek vám naši top autoři přinášejí výběr toho nejlepšího a pohled z byznysové strany. Odebírejte Byznys newsletter. © 1996-2024 Economia, a.s. Hospodářské noviny (print)   ISSN 0862-9587\n\t\t\t\t\t\t\tHospodářské noviny (online) ISSN 2787-950X "
}