{
    "title": "Apple just gave us a big hint that AI is taking over more than just the \niPhone",
    "date": "2/12/2024",
    "url": "https://bgr.com/tech/apple-just-gave-us-a-big-hint-that-ai-is-taking-over-more-than-just-the-iphone/",
    "text": "Sign up for our daily newsletter If you buy through a BGR link, we may earn an affiliate commission, helping support our expert product labs. iOS 18 is already expected to rely heavily on AI. Still, the iPhone operating system won’t be the only software to use this technology. According to BuyAiDomains, Apple just secured the iWork.ai domain, teasing that its iWork suit might get a revival with an Artificial Intelligence focus soon. The publication highlights that the iWork.ai domain was recently made available, and Apple acquired it. Still, trying to open the webpage goes nowhere. In addition, it’s always possible that the company bought the domain to prevent bad actors from using this page for phishing once it unveiled some of its new AI capabilities during WWDC 2024. In the early 2000s and the beginning of 2010s, Apple used to promote its two big suites: iLife and iWork. Over time, the company abandoned these names and focused on the iCloud brand. Even though the iWork suite apps are still updated, the company has yet to bring a revamp to them. Among the new iWork AI features are auto-summarizing and auto-complete. These were first reported by Bloomberg‘s Mark Gurman. The journalist thinks Apple is bringing these capabilities for core apps and productivity software. In addition, iOS 18 will focus on AI in the following topics: Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. What could corroborate the iWork AI coming is Apple’s CEO himself. During Apple’s first earnings call of the year, Tim Cook did not mention any software by name. But he did address AI twice, teasing the upcoming announcements. He did it once during his remarks, right after reminding those on the call about the Vision Pro launch. Cook said Apple will spend a “tremendous amount of time and effort” on AI, with details coming later this year. Circle to Search is one of the AI features I hope Apple adds to the iPhone and other products. I already wrote how Google could implement this Samsung Galaxy feature for iPhone users. Still, I think Apple could use some of its built-in features to make an even better application. In addition, I love how fast the Apple Watch Ultra 2 is in some Siri queries since it relies a lot on on-device processing. Ultimately, I believe AI is all about context and understanding. If Apple’s assistant can get a huge boost on these matters – and everything points out that it is –Cupertino could compete against OpenAI, Google, and Microsoft for the perfect experience. My top feature requests are summarizing stories, getting relevant information from queries, and improving my workflow with on-device processing. Also, a new iOS 18 concept basically described what I want for this next operating system update. As you can see, it’s not just iWork that is getting an AI revamp, but iOS 18 and several other Apple products will likely get the Artificial Intelligence boost we expect. BGR will keep reporting on Apple’s AI efforts. Below, you can learn more about iOS 18. José is a Tech News Reporter at BGR. He has previously covered Apple and iPhone news for 9to5Mac, and was a producer and web editor for Latin America broadcaster TV Globo. He is based out of Brazil. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. BGR’s audience craves our industry-leading insights on the latest in tech and entertainment, as well as our authoritative and expansive reviews. We guide our loyal readers to some of the best products, latest trends, and most engaging stories with non-stop coverage, available across all major news platforms. Founded in 2006 Over 2 billion visitors 100K+ articles published Millions of readers helped Honest news coverage, reviews, and opinions since 2006. -\n\t\t\t\t\t\tJonathan S. Geller, Founder BGR is a part of Penske Media Corporation.\n© 2024 BGR Media, LLC. All Rights Reserved. "
}