{
    "title": "Fmr LLC Trims Stock Position in Apple Inc. (NASDAQ:AAPL)",
    "date": "3/10/2024",
    "url": "https://www.defenseworld.net/2024/03/10/fmr-llc-trims-stock-position-in-apple-inc-nasdaqaapl.html",
    "text": "Posted by Defense World Staff on Mar 10th, 2024 Fmr LLC lessened its position in shares of  Apple Inc. (NASDAQ:AAPL – Free Report) by 2.8% during the third quarter, HoldingsChannel reports. The institutional investor  owned 298,321,726 shares of the iPhone maker’s stock after selling 8,744,912 shares during the quarter. Apple comprises about  4.4% of Fmr LLC’s investment portfolio, making the stock its 3rd largest position. Fmr LLC’s holdings in Apple were worth $51,075,663,000 at the end of the most recent reporting period. A number of other large investors also recently bought and sold shares of AAPL. Atlantic Private Wealth LLC acquired a new stake in shares of  Apple during the 1st quarter worth approximately $30,000.  Summit Wealth Group LLC raised its position in shares of  Apple by 16,252.3% during the 1st quarter. Summit Wealth Group LLC now owns 6,992,420 shares of the iPhone maker’s stock worth $42,000 after purchasing an additional 6,949,659 shares during the period.  HBC Financial Services PLLC raised its position in shares of  Apple by 21.7% during the 1st quarter. HBC Financial Services PLLC now owns 448 shares of the iPhone maker’s stock worth $49,000 after purchasing an additional 80 shares during the period.  West Tower Group LLC acquired a new stake in shares of  Apple during the 2nd quarter worth approximately $64,000.  Finally, PayPay Securities Corp raised its position in shares of  Apple by 70.2% during the 3rd quarter. PayPay Securities Corp now owns 509 shares of the iPhone maker’s stock worth $87,000 after purchasing an additional 210 shares during the period. Institutional investors own  58.51% of the company’s stock. In related news, Director Arthur D. Levinson sold 100,000 shares of the business’s stock in a transaction dated Thursday, February 29th. The stock was sold at an average price of $180.94, for a total transaction of $18,094,000.00. Following the completion of the transaction, the director now owns 4,434,576 shares of the company’s stock, valued at approximately $802,392,181.44. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through the SEC website. Insiders own  0.06% of the company’s stock. Shares of AAPL stock opened at $170.73 on Friday. Apple Inc. has a 1-year low of $147.61 and a 1-year high of $199.62. The company has a current ratio of 1.07, a quick ratio of 1.02 and a debt-to-equity ratio of 1.28. The company has a market capitalization of $2.64 trillion, a price-to-earnings ratio of 26.59, a P/E/G ratio of 2.04 and a beta of 1.29. The stock’s fifty day simple moving average is $184.64 and its 200-day simple moving average is $183.60. Apple (NASDAQ:AAPL – Get Free Report) last released its quarterly earnings data on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share (EPS) for the quarter, beating analysts’ consensus estimates of $2.09 by $0.09. The firm had revenue of $119.60 billion during the quarter, compared to analysts’ expectations of $117.99 billion. Apple had a return on equity of 156.04% and a net margin of 26.16%. The business’s revenue for the quarter was up 2.1% on a year-over-year basis. During the same quarter last year, the firm earned $1.88 earnings per share.  On average, sell-side analysts predict that  Apple Inc. will post 6.55 earnings per share for the current fiscal year. The business also recently declared a quarterly dividend, which was paid on Thursday, February 15th. Shareholders of record on Monday, February 12th were given a $0.24 dividend. The ex-dividend date of this dividend  was Friday, February 9th. This represents a $0.96 dividend on an annualized basis and a dividend yield of 0.56%. Apple’s dividend payout ratio  is currently 14.95%. A number of analysts have recently weighed in on the company. Tigress Financial increased their price target on Apple from $225.00 to $240.00 and gave the stock a “strong-buy” rating in a research report on Thursday, November 16th. Bank of America upgraded Apple from a “neutral” rating to a “buy” rating and raised their target price for the company from $208.00 to $225.00 in a research report on Thursday, January 18th. Citigroup  restated a “buy” rating and issued a $225.00 target price on shares of Apple in a research report on Friday, February 16th. Rosenblatt Securities  restated a “neutral” rating and issued a $189.00 target price on shares of Apple in a research report on Tuesday, March 5th. Finally, Wedbush  restated an “outperform” rating and issued a $250.00 target price on shares of Apple in a research report on Wednesday, February 28th. One analyst  has rated the stock with a sell rating, eleven have assigned  a hold rating, twenty-one have issued  a buy rating and one  has issued  a strong buy rating to the company. According to data from MarketBeat.com, the stock presently has a consensus rating of “Moderate Buy” and a consensus target price of $205.27. Get Our Latest Report on AAPL (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Allegro MicroSystems, Inc. (NASDAQ:ALGM) Shares Purchased by Envestnet Asset Management Inc. Encap Partners Gp, Llc Sells 9,000,000 Shares of Permian Resources Co. (NASDAQ:PR) Stock "
}