{
    "title": "Apple Inc. (NASDAQ:AAPL) Shares Acquired by Beaird Harris Wealth Management \nLLC",
    "date": "3/14/2024",
    "url": "https://www.americanbankingnews.com/2024/03/14/apple-inc-nasdaqaapl-shares-acquired-by-beaird-harris-wealth-management-llc.html",
    "text": "Posted by ABMN Staff on Mar 14th, 2024 Beaird Harris Wealth Management LLC increased its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 1.9% during the 3rd quarter, according to its most recent filing with the Securities and Exchange Commission (SEC). The institutional investor owned 20,478 shares of the iPhone maker’s stock after acquiring an additional 375 shares during the quarter. Beaird Harris Wealth Management LLC’s holdings in Apple were worth $3,506,000 at the end of the most recent quarter. Other institutional investors and hedge funds have also recently bought and sold shares of the company. Atlantic Private Wealth LLC purchased a new position in Apple during the 1st quarter worth $30,000. Cheyne Capital Management UK LLP grew its holdings in shares of Apple by 200.0% during the third quarter. Cheyne Capital Management UK LLP now owns 275 shares of the iPhone maker’s stock worth $212,000 after buying an additional 550 shares during the last quarter. West Tower Group LLC acquired a new position in Apple in the 2nd quarter valued at about $64,000. HBC Financial Services PLLC raised its stake in Apple by 21.7% during the 1st quarter. HBC Financial Services PLLC now owns 448 shares of the iPhone maker’s stock valued at $49,000 after acquiring an additional 80 shares during the last quarter. Finally, PayPay Securities Corp raised its stake in shares of Apple by 70.2% during the third quarter. PayPay Securities Corp now owns 509 shares of the iPhone maker’s stock worth $87,000 after purchasing an additional 210 shares during the last quarter. 58.51% of the stock is owned by hedge funds and other institutional investors. Shares of NASDAQ AAPL opened at $171.13 on Thursday. The company has a debt-to-equity ratio of 1.28, a current ratio of 1.07 and a quick ratio of 1.02. The company has a market cap of $2.64 trillion, a PE ratio of 26.66, a price-to-earnings-growth ratio of 2.08 and a beta of 1.29. The company has a 50-day simple moving average of $183.74 and a 200-day simple moving average of $183.47. Apple Inc. has a 12 month low of $149.92 and a 12 month high of $199.62. Apple (NASDAQ:AAPL – Get Free Report) last issued its quarterly earnings results on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share for the quarter, beating the consensus estimate of $2.09 by $0.09. The company had revenue of $119.60 billion during the quarter, compared to the consensus estimate of $117.99 billion. Apple had a return on equity of 156.04% and a net margin of 26.16%. Apple’s revenue was up 2.1% on a year-over-year basis. During the same period in the previous year, the firm posted $1.88 EPS. On average, equities analysts anticipate that Apple Inc. will post 6.55 earnings per share for the current year. The firm also recently declared a quarterly dividend, which was paid on Thursday, February 15th. Shareholders of record on Monday, February 12th were paid a $0.24 dividend. This represents a $0.96 dividend on an annualized basis and a yield of 0.56%. The ex-dividend date was Friday, February 9th. Apple’s payout ratio is 14.95%. AAPL has been the topic of several recent research reports. Piper Sandler dropped their price objective on shares of Apple from $205.00 to $190.00 and set a “neutral” rating on the stock in a research note on Friday, February 2nd. Barclays cut their price target on shares of Apple from $160.00 to $158.00 and set an “underweight” rating for the company in a report on Friday, February 2nd. Rosenblatt Securities reaffirmed a “neutral” rating and issued a $189.00 price objective on shares of Apple in a report on Tuesday, March 5th. Monness Crespi & Hardt increased their target price on Apple from $189.00 to $200.00 and gave the stock a “buy” rating in a research note on Friday, February 2nd. Finally, Wedbush restated an “outperform” rating and issued a $250.00 price target on shares of Apple in a research note on Wednesday, February 28th. One investment analyst has rated the stock with a sell rating, eleven have issued a hold rating, twenty-one have given a buy rating and one has assigned a strong buy rating to the company’s stock. According to data from MarketBeat.com, Apple currently has a consensus rating of “Moderate Buy” and a consensus price target of $205.27. View Our Latest Research Report on AAPL In related news, Director Arthur D. Levinson sold 100,000 shares of the firm’s stock in a transaction that occurred on Thursday, February 29th. The shares were sold at an average price of $180.94, for a total value of $18,094,000.00. Following the sale, the director now directly owns 4,434,576 shares of the company’s stock, valued at $802,392,181.44. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available through this hyperlink. 0.06% of the stock is owned by company insiders. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.    Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Neo Ivy Capital Management Acquires 2,884 Shares of Lear Co. (NYSE:LEA) Essential Properties Realty Trust (NYSE:EPRT) Sees Large Volume Increase "
}