{
    "title": "Apple reinstates Epic Games' app store account in Europe after regulator \nscrutiny",
    "date": "3/8/2024",
    "url": "https://nypost.com/2024/03/08/business/apple-reinstates-epic-games-app-store-account-in-europe-after-regulator-scrutiny/",
    "text": "Thanks for contacting us. We've received your submission. Thanks for contacting us. We've received your submission. Apple restored “Fortnite” maker Epic Games’ permissions to offer its own app store to iPhone customers in Europe on Friday — just one day after European Union regulators suggested its brazen move to block Epic may have violated a sweeping new antitrust law. Apple faced scrutiny under European Union’s Digital Markets Act — a law that took effect this week and placed restrictions on six “gatekeeper” Big Tech firms. The law requires Apple to allow developers to run their own app stores — something Epic sought to do until Apple terminated its account in response to CEO Tim Sweeney’s public criticism of its tough business tactics. Epic Games — which has engaged in a years-long legal battle with Apple over its App Store policies — said it would move forward with its plans to offer Fortnite and its Epic Games Store. “This sends a strong signal to developers that the European Commission will act swiftly to enforce the Digital Markets Act and hold gatekeepers accountable,” Epic Games said in a statement. Elsewhere, Sweeney — who had previously referred to Apple’s proposed compliance plan with the law as “hot garbage” — lauded the company’s decision as “a big win for European rule of law, for the European Commission, and for the freedom of developers worldwide to speak up.” The abrupt change of heart came one day after the European Commission — the EU’s competition agency — said it had “requested further explanations on this from Apple under the DMA.” EU competition chief Margrethe Vestager snarkilly said gamers will “be able to play @FortniteGame once it will be back on iOS” alongside a winking-face emoji. “Following conversations with Epic, they have committed to follow the rules, including our DMA policies,” Apple said in a statement. “As a result, Epic Sweden AB has been permitted to re-sign the developer agreement and accepted into the Apple Developer Program.” Epic had initially described Apple’s move to terminate its developer account in Europe as a “serious violation” of the DMA. The North Carolina-based video game giant published a letter from the head of Apple’s App Store, Phil Schiller, who slammed Epic for publicly bashing its tactics. “Your colorful criticism of our DMA compliance plan, coupled with Epic’s past practice of intentionally violating contractual provisions with which it disagrees, strongly suggest that Epic Sweden does not intend to follow the rules,” Schiller said in the letter. Schiller asked Epic Games to provide “written assurance” that it is acting in “good faith” and to explain “why we should trust Epic this time.” Meanwhile, Apple asserted in previous statements that it court rulings had affirmed it had the “sole discretion” to terminate deals with developers if they were found to have violated the terms of their contract. The spat marked the latest twist in a long-running feud between the corporate giants that began in 2020, when Fortnite was banned from Apple’s App Store in the US after Epic tried to bypass its system for in-app purchases. An ensuing lawsuit resulted in a split verdict that mostly favored Apple. The European Commission has taken a hardline stance toward Apple on antitrust matters. Earlier this month, it hit Apple with a massive $2 billion fine after investigators found it had illegally restricted music app developers from advertising cheaper ways to subscribe to their streaming services outside the App Store Advertisement "
}