{
    "title": null,
    "date": "3/20/2024",
    "url": "https://ca.style.yahoo.com/tim-cook-flexes-shanghai-trip-164543498.html",
    "text": "We've rounded up the best deals from Amazon, Walmart, Best Buy, Coach Outlet & more. Tim Cook is flexing his latest trip to Shanghai on Chinese social media. The Apple boss is in the city to celebrate the opening of a new store. Cook's visit comes as iPhone sales in China slide amid the popularity of Huawei's latest smartphone. Tim Cook is back in China again. This time, he's chowing down steamed buns on Chinese social media. The Apple CEO is in Shanghai ahead of the opening of a new Apple store this week — but is making sure he takes the time to share select highlights of his trip to his 1.6 million-plus \"fans\" on the Chinese app Weibo. In a 22-second clip posted to his Weibo account on Wednesday, Cook said he'd been for a stroll along the Bund waterfront with Chinese actor Zheng Kai, before \"enjoying a classic Shanghai breakfast.\" He followed that up with several more posts. In one, Cook shared that he stopped by a studio of a local director who was \"finishing production on a short film about girls following their dreams to be lion dancers.\" In another post, Cook put the spotlight on Chinese games developer Papergames. There was also time to share a photo of himself from an Apple store with models Wang Shiqing and Ji Huanbo. Though Cook is in Shanghai to open a new store, a city where Apple already has seven, the timing of his trip coincides with a tough moment for his company in China. Apple has been battling falling iPhone sales in China in recent months amid growing competition from domestic smartphone makers and rising nationalist sentiment in Beijing. In the first six weeks of this year, for instance, iPhone sales in China dropped 24%, per Counterpoint Research data. That slide is partly due to the huge popularity of local rival Huawei's latest smartphone, the Mate 60 Pro. Given that the Greater China region contributed $20.8 billion of Apple's overall $119.6 billion in revenue in its latest quarter, it's clearly a market Cook won't want to lose ground in. The Apple CEO's last trip to China came unannounced in October, just as signs were starting to emerge of a weakening market for iPhones. So promoting Apple products and engaging Chinese consumers directly is a key strategy. Cook's post about the local director commented that \"her crew used Apple products in every stage of the creative process, from storyboarding with iPad to shooting on iPhone 15 Pro Max, to editing with Macbook Pro.\" His post about the developers at Papergames also noted that the graphics and performance of their games \"show the power of Apple silicon chips in iPhone and iPad.\" Cook knows what he has to do. Read the original article on Business Insider AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. The post 5 Artificial Intelligence (AI) Stocks That Could Be Millionaire Makers appeared first on The Motley Fool Canada. Some iPhone owners have received a series of notifications about resetting their Apple ID password, followed by a spoofed phone call. IBKR EventTrader - A new, straightforward way to trade CME futures markets While it's easy to draw comparisons to the Microsoft - OpenAI alliance, Wednesday's move by AWS actually signals just how vulnerable Amazon's cloud empire has become. Apple's overseas suppliers have increased production of the company's new iPad models and plans to launch them in early May, Bloomberg News reported on Thursday citing people with knowledge of the matter.  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said. Spot, a robotic dog created by tech company Boston Dynamics, is being used across the nation to help assist law enforcement in the field.  Taiwan's Foxconn hit a record closing high on Thursday as it is set to benefit from growth in AI servers. Elsewhere, CEOs of U.S. chip makers met Chinese leader Xi Jinping. ANCHORAGE, Alaska (AP) — A headless robot about the size of a labrador retriever will be camouflaged as a coyote or fox to ward off migratory birds and other wildlife at Alaska's second largest airport, a state agency said. The Alaska Department of Transportation and Public Facilities has named the new robot Aurora and said it will be based at the Fairbanks airport to “enhance and augment safety and operations,\" the Anchorage Daily News reported. The transportation department released a video of The company is among the fastest-growing cybersecurity players based on my peer analysis  Caution is needed even with this famous tech behemoth and its fast-growing services business \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. Check out the new Crossout 2.0 for free. Discover PvP and PvE in our upgraded Action MMO. Countless unique Vehicles, PvE and PvP, Trading. Are you... Nordegren has moved on and built a life that focuses on her six kids Trump's former national security adviser shut down a comparison between the ex-president and Julius Caesar. Seven reportedly cost $20 million  Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap.  \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida The \"Late Night\" comedian brutally summed up the former president's media company. "
}