{
    "title": "Apple was removed from Goldman Sachs' list of top stocks",
    "date": "3/3/2024",
    "url": "https://qz.com/emails/daily-brief/1851304134/goldman-sachs-snubs-apple",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Good morning, Quartz readers! Waymo is about to make L.A. traffic much more robotic. The Alphabet-owned robotaxi service got approval to operate in the city and more of the San Francisco Bay Area. The lawyers who quashed Elon Musk’s huge pay package want $6 billion. It would be by far the largest sum ever awarded in legal fees. Apple backtracked on removing iPhone web apps after EU scrutiny. The turnaround comes after regulators said they had taken initial steps to investigate Apple’s motives. Boeing may buy the supplier behind its Alaska Airlines door plug blowout. Wichita, Kansas-based Spirit AeroSystems used to be part of Boeing until being spun out in 2005. Apple was removed from Goldman Sachs’ list of top stocks Friday after a turbulent week. The investment banker is of the mind that companies involved in rocks and biotech will be better performers this year. Apple stock fell as much as 2% following the snub, and its market cap fell behind Microsoft by $314 billion during Friday trading. It’s the largest gain Microsoft has had on Apple since 2003. In April, bitcoin is going to experience a halving event. What that means, technically: Halving refers to an event that happens about every four years. As part of bitcoin’s code, after every 210,000 blocks are added to the chain, the mining reward is cut in half. This was done to slow down the pace at which supply of bitcoin can be added to circulation, with the number of bitcoins that will ever be created being capped at 21 million as a way to mimic finite resources like gold. What that really means:  Already surging bitcoin prices are probably about to get even higher after the halving. Austin, Texas, and San Francisco may be leading the race to become the U.S.’s destination for AI startups, but New York City is a hot competitor — and it just keeps getting hotter. Not only is Canada’s leading AI company interested in the Big Apple, so is OpenAI, as well as AI video-editing startup Captions. Here’s what they plan on bringing to NYC. 👍 Hyundai, BMW, and more of the safest cars of 2024 🫵 Atlanta to Microsoft: Give us the 15,000 jobs you promised or give us back our land 🫰 Boeing will pay a $51 million fine for fighter jet file leaks to China 💪 The biggest AI debuts and gadgets announced at this year’s Mobile World Congress 🤝 Disney is getting a few nepo-allies in its battle against activist investors 👋 Meta is distancing itself even further from the news Last-chance tourism is becoming a thing. The rate at which places like the French Alps are melting is prompting travelers to book trips with climate change in mind — and yes, there’s some murky arguments around whether the trips will just exacerbate the change. Driving barefoot is not illegal in the U.S. That’s just one myth that people believe about cars. AI models are better at math when they’re told to think in the vein of Star Trek. Researchers were stumped and irritated by that discovery. Two satellites almost collided above Earth. They came within 66 feet (20 meters) of each other. A single killer whale killed a great white shark. The unprecedented moment was caught on camera. Did you know we have two premium weekend emails, too? One gives you analysis on the week’s news, and one provides the best reads from Quartz and elsewhere to get your week started right. Become a member or give membership as a gift! Our best wishes for a productive day. Send any news, comments, barefoot activities, and Star Trek math problems to talk@qz.com. Today’s Daily Brief was brought to you by Morgan Haefner. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}