{
    "title": "Apple is reportedly exploring a partnership with Google for Gemini-powered \nfeature on iPhones",
    "date": "3/17/2024",
    "url": "https://techcrunch.com/2024/03/17/apple-is-reportedly-exploring-a-partnership-with-google-for-gemini-powered-feature-on-iphones/",
    "text": "Apple is looking to team up with Google for a mega-deal to leverage the Gemini AI model for features on iPhone, Bloomberg reported. This will put Google in a commanding position as the company already has a deal with Apple as the preferred search engine provider on iPhones for the Safari browser. The publication cited people familiar with the matter saying that Apple is looking to license Google’s AI tech to introduce AI-powered features with iOS updates later this year. Additionally, the company also held discussions with OpenAI to potentially use GPT models, Bloomberg said. There is surmounting pressure on Apple to catch up with competitors in the AI field such as OpenAI, Microsoft, Anthropic and even Google. In February, Apple CEO Tim Cook said that the company will introduce GenAI features “later this year.” The company’s job listings over the last year have suggested that Apple is working on multiple internal and external tools powered by generative AI. However, talks of leveraging third-party AI tech means Apple hasn’t progressed as expected in its own AI efforts. Apple’s own models might power some of the on-device features on the upcoming iOS 18 software update — expected to be announced at the Worldwide Developer Conference (WWDC) historically held in June. However, the company is exploring partnering with an external provider for generative AI use cases such as image creation and helping users with writing. Google has had its own set of problems with Gemini. Last month, the company had to pause its image-generation feature after the model created images with historical inaccuracies. Later, Google CEO Sundar Pichai said that Gemini’s responses were “completely unacceptable.” Last week, Google said that it is blocking election-related queries on Gemini across the globe. But TechCrunch found that users could get around those restrictions by introducing typos to some queries. Despite these fallbacks, Google has an advantage in launching smartphone-related features. Earlier this year, the company partnered with Samsung to introduce Gemini-powered AI features on the Galaxy S24 series of devices. The search giant has also launched these features on its own Pixel series of phones. We have reached out to Apple and Google for a comment, and we will update the story if we hear back from them. "
}