{
    "title": "Apple’s WWDC 2024 set for June 10: iOS 18, AI and more; here’s what to \nexpect",
    "date": "3/26/2024",
    "url": "https://www.businesstoday.in/technology/news/story/apples-wwdc-2024-set-for-june-10-ios-18-ai-and-more-heres-what-to-expect-422975-2024-03-27",
    "text": "Feedback Apple enthusiasts worldwide eagerly anticipate the commencement of the Worldwide Developers Conference (WWDC), set to kick off with its keynote address on June 10th and extend until June 14th. As customary, the tech giant is poised to unveil its upcoming fall software updates and possibly introduce new hardware. However, this year, all eyes are on Apple's stance regarding generative artificial intelligence (AI), which is shrouded in mystery. Multiple reports suggest that Apple has allocated significant resources, reportedly millions daily, towards training its own AI models. Rumours abound regarding potential partnerships with major players such as Google, OpenAI, or Anthropic (or Baidu in China) for cloud-based AI features, while maintaining its proprietary generative features on-device. Speculation is rife that Apple might even extend its ecosystem to encompass all AI developers for seamless integration into its devices, as per a recent Bloomberg report. While Apple has long championed on-device machine learning, the burgeoning prominence of generative AI prompts the company to amplify its prowess in this domain. Notably, the anticipation is heightened with references to products like the M3 MacBook Air, dubbed \"the world’s best consumer laptop for AI.\" Beyond AI, WWDC attendees anticipate a slew of announcements concerning updates across iOS, iPadOS, macOS, watchOS, and other operating systems. Speculated enhancements include the ability to customise app icons on iPhones, introduction of \"scenes\" in Freeform, and new accessibility shortcuts. Moreover, rumours hint at the potential launch of two new AirPods models—an entry-level successor to the second-gen AirPods and a noise-cancelling iteration to replace the mid-tier AirPods 3. Additionally, expectations loom over the prospect of updated AirPods Max headphones featuring USB-C connectivity. Recalling last year's WWDC highlights, Apple captivated audiences with the unveiling of the long-awaited Vision Pro headset. Alongside, the company showcased significant updates such as a widget-centric overhaul of WatchOS, iOS 17's StandBy Mode, desktop widgets for macOS, and initiatives targeting the gaming sector. Apple also marked a pivotal moment last year with the completion of its Apple silicon transition, exemplified by the introduction of a revamped Mac Pro featuring the M2 Ultra chip, subsequently integrated into the new Mac Studio. Additionally, the MacBook Air received a notable boost with the debut of the 15-inch variant, delighting users and industry observers alike. “We’re so excited to connect with developers from around the world for an extraordinary week of technology and community at WWDC24,” said Susan Prescott, Apple’s vice president of Worldwide Developer Relations. “WWDC is all about sharing new ideas and providing our amazing developers with innovative tools and resources to help them make something even more wonderful.” Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}