{
    "title": "Apple is reportedly exploring a partnership with Google for Gemini-powered \nfeature on iPhones",
    "date": "3/19/2024",
    "url": "https://ca.movies.yahoo.com/apple-reportedly-exploring-partnership-google-061906127.html",
    "text": "Apple is looking to team up with Google for a mega-deal to leverage the Gemini AI model for features on iPhone, Bloomberg reported. This will put Google in a commanding position as the company already has a deal with Apple as the preferred search engine provider on iPhones for the Safari browser. The publication cited people familiar with the matter saying that Apple is looking to license Google's AI tech to introduce AI-powered features with iOS updates later this year. Additionally, the company also held discussions with OpenAI to potentially use GPT models, Bloomberg said. There is surmounting pressure on Apple to catch up with competitors in the AI field such as OpenAI, Microsoft, Anthropic and even Google. In February, Apple CEO Tim Cook said that the company will introduce GenAI features \"later this year.\" The company's job listings over the last year have suggested that Apple is working on multiple internal and external tools powered by generative AI. However, talks of leveraging third-party AI tech means Apple hasn't progressed as expected in its own AI efforts. Apple's own models might power some of the on-device features on the upcoming iOS 18 software update — expected to be announced at the Worldwide Developer Conference (WWDC) historically held in June. However, the company is exploring partnering with an external provider for generative AI use cases such as image creation and helping users with writing. Google has had its own set of problems with Gemini. Last month, the company had to pause its image-generation feature after the model created images with historical inaccuracies. Later, Google CEO Sundar Pichai said that Gemini's responses were \"completely unacceptable.\" Last week, Google said that it is blocking election-related queries on Gemini across the globe. But TechCrunch found that users could get around those restrictions by introducing typos to some queries. Despite these fallbacks, Google has an advantage in launching smartphone-related features. Earlier this year, the company partnered with Samsung to introduce Gemini-powered AI features on the Galaxy S24 series of devices. The search giant has also launched these features on its own Pixel series of phones. We have reached out to Apple and Google for a comment, and we will update the story if we hear back from them. Key Insights The considerable ownership by private companies in Paramount Resources indicates that they collectively... Shareholders might have noticed that Jefferies Financial Group Inc. ( NYSE:JEF ) filed its first-quarter result this... IBKR EventTrader - A new, straightforward way to trade CME futures markets Local Bounti Corporation (NYSE:LOCL) Q4 2023 Earnings Call Transcript March 27, 2024 Local Bounti Corporation misses on earnings expectations. Reported EPS is $-8.1 EPS, expectations were $-3.18. LOCL isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning, and welcome […] The actress celebrated her daughter Matilda's first birthday on Saturday There's no doubt that money can be made by owning shares of unprofitable businesses. For example, biotech and mining...  Police in southern Russia have arrested three men from Central Asia for allegedly plotting a bomb attack, a week after Islamic State terrorists from Tajikistan killed 144 people at a rock concert in Moscow. Women working for the Office for National Statistics face disciplinary action if they object to male-born colleagues using single-sex lavatories and changing rooms, documents leaked to The Sunday Telegraph reveal. Spurs welcome the Hatters to town looking to get back on track  Molina Healthcare (NYSE:MOH) has had a great run on the share market with its stock up by a significant 14% over the... Bunnyville at the Detroit Zoo A few scattered snow showers are possible in Colorado's higher elevations, but it will remain dry across the metro and plains.  Passive investing in index funds can generate returns that roughly match the overall market. But you can significantly... Scrub Daddy, pimple patches and an awesome upholstery cleaner: The 'net is gaga over these picks. Iran International journalist Pouria Zeraati is recovering in hospital after being attacked on Friday. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Cuts to central funding leaves lower tier of local government left to look after libraries, street cleaning and other facilities The French actress (\"The English Patient\") will succeed Polish director Agnieszka Holland (\"Europa\") in the honorary role. Key Insights Given the large stake in the stock by institutions, Wynn Resorts' stock price might be vulnerable to their...  ProSomnus, Inc. Common Stock (NASDAQ:OSA) Q4 2023 Earnings Call Transcript March 27, 2024 ProSomnus, Inc. Common Stock misses on earnings expectations. Reported EPS is $-0.42 EPS, expectations were $-0.31. OSA isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good day, […] COMMENT: Why is it that, in 2024, age-gap relationships still cause such brouhaha? There is no escaping the whispers and judgement if you choose to date someone much older or younger – but when it comes to love, we’ve all got skin in the game, writes Olivia Petter Photo Illustration by Luis G. Rendon/The Daily Bast/Getty Images/Courtesy of Keianna MillerThe family of a Black 4-year-old boy who was shot dead by police responding to a bloody domestic violence incident are considering taking legal action. Lawyers representing Keianna Miller, whose son Terrell was killed by Macomb Police two weeks ago, told The Daily Beast she may file a civil lawsuit.“Police would lead a criminal investigation. The civil would be by a personal injury law firm like ours for a "
}