{
    "title": "The US is suing Apple for anti-competitive behaviour. But the company's \nwalled-off tech ecosystem has driven its bold ...",
    "date": "3/27/2024",
    "url": "https://theconversation.com/the-us-is-suing-apple-for-anti-competitive-behaviour-but-the-companys-walled-off-tech-ecosystem-has-driven-its-bold-innovation-226512",
    "text": "Senior Lecturer, Digital, Political, Media, Deakin University Luke Heemsbergen does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.  Deakin University provides funding as a member of The Conversation AU. View all partners With an impressive 60% of the US smartphone market, Apple is undeniably big, but not a clear monopoly. Yet, years of innovation by Apple have effectively given the company its own exclusive tech ecosystem. Now, the US Department of Justice (DOJ) has alleged this ecosystem is harming competition and innovation through Apple’s unique market power. The department’s lawsuit will face a few big hurdles. Perhaps chief among them: many of the “anti-competitive” systems Apple has built are the very things that enable the bold innovation they’re famous for. Apple is the latest modern major US tech firm to face investigation into alleged anti-competitive behaviour by the US government. The DOJ explains its lawsuit through five consumer-relatable examples of where Apple’s iPhone ecosystem stifles competition: the inability to give “super apps” like WeChat full functionality on iPhone restrictions on game streaming apps a functionality divide between “blue bubble” and “green bubble” friends on iMessage poor connectivity between non-Apple smartwatches and iPhones digital wallet technology that locks out third parties. Read more:\n      Why are Apple, Amazon, Google and Meta facing antitrust lawsuits and huge fines? And will it protect consumers? In the US and other jurisdictions, the tech giant has already taken steps to address some of these concerns. However, the DOJ stresses these complaints aren’t exclusive or exhaustive. They’re examples to show where Apple’s “closed” ecosystem locks customers into what Apple has built. One problem for the DOJ is that the tech world has been left to private design for 30 years. Enjoying strong growth and innovation has meant relying on private infrastructure. Having the most disruptive ideas might draw consumer attention, but vast infrastructures keep them as customers (for example, OpenAI’s partnership with Microsoft). Our research group considers how digital innovations come to shape the “infrastructures” that guide our increasingly digital lives. Consider Apple’s influence on the mundane and technical, such as USB-C technology. Or surprising cultural shifts, such as Airpods. And even how iPhone technology effectively launched Instagram culture. The DOJ’s core argument is that Apple’s business model has now shifted from leading innovation to gatekeeping its cultural-technical infrastructures. Such shifts are not necessarily planned evils. Infrastructure can lead to further infrastructure with novel benefits: it is no accident internet fibre cables follow old rail lines on land and telegraph cables undersea. Over time, though, a combination of cultural-technical infrastructures built up by a powerful company can monopolise a market. To know that story’s end game, think Boeing. Another problem for the DOJ is it will be hard to define the market that Apple allegedly monopolises or attempts to. Use of the 1890 Sherman Anti-Trust Act on firms requires such a definition.  It makes sense the department is using this act against Google, which controls more than 90% of the search market. But Apple’s market share is far lower – not even a majority of mobile phone sales worldwide. To get around this, the department argues the market that Apple does have is unique. Apple is famously good at creating its own markets – rehashing familiar things (hard drives and MP3 files) to make novel products (iPods) that “just work” for consumers and suppliers. Apple’s competitive edge is creating the exclusive platforms it’s now being pursued for. As many will remember, before the iPhone, browsing the internet on a phone wasn’t a thing. Before iTunes, digital music was a pain or illegal. For millions of Apple fans across the US, the DOJ’s logic is a hard sell. Notably repeated in this lawsuit is the need for “disintermediation”, which means removing the “middlemen” who take a cut between customers and suppliers. The DOJ alleges Apple acts as such a middleman by imposing on consumer choice – whether by restricting Apple’s interoperability with other products, or charging a 30% fee (the so-called Apple Tax) to do business on Apple’s platforms. The challenge is that in a world of bad actors on the internet (evil or incompetent), people actually seem to love Apple’s capacity to intermediate. The company’s strict control of its apps, products and services enables growth across its platforms and has given it a reputation for being an exceptional “middleman” for privacy, usability and other consumer concerns. For example, Apple’s wallet launched to not transmit credit card numbers to merchants, who regularly suffer data breaches and leaks. It offered an intermediary solution where evil (and incompetent) actors abound. The department’s claim this practice creates an “additional point of failure for privacy and security” is incoherent. An extensive history of cybercrime incidents around the world shows that for consumers, credit card companies and merchants, holding customer data becomes a liability, as well as an asset. During the pandemic, Apple’s trusted ability to intermediate also fostered the success of “Exposure Notification”, a privacy-preserving contact tracing system that kept personal exposure data away from governments and other parties. But in other areas, the department argues that Apple has leveraged this reputation in self-serving ways. Fortnite developer Epic Games’ ongoing stoush with Apple over policies to charge 30% on in-app purchases is one key example. Many developers would likely have followed Epic in trying to get their customers cash out of Apple’s grasp, if not for fear of retribution from Apple. Yet, Epic Games largely lost to Apple in US courts, and this year the Supreme Court refused to hear the appeals. This loss may have compelled the DOJ to act. Read more:\n      Apple, Google and Fortnite's stoush is a classic case of how far big tech will go to retain power Even the success of this lawsuit won’t necessarily bring about useful change at Apple or for the consumer. In Europe, the tech giant has already demonstrated an expert capacity for “malicious compliance” – after meeting the European Union’s new Digital Markets Act policy in such bad faith that its solution barely works and is now being re-investigated. Overall, it’s not that Apple is necessarily, well, a “bad apple”, but that “Apple vs USA” allows us to think different about what really drives innovation in modern tech. Copyright © 2010–2024, The Conversation "
}