{
    "title": "EU opens investigations into 3 American Big Tech giants",
    "date": "3/25/2024",
    "url": "http://www.china.org.cn/business/2024-03/26/content_117085090.htm",
    "text": " A woman talks through an iPhone at the Berlaymont building, headquarters of the European Commission, in Brussels, Belgium, on March 4, 2024. [Photo/Xinhua] The European Commission revealed on Monday the opening of non-compliance investigations targeting three major American tech giants - Alphabet, Apple and Meta. The probe, conducted under the European Union (EU)'s Digital Markets Act (DMA), focuses on alleged breaches by these companies. \"Today we open first investigations under the DMA. We are concerned Alphabet, Apple and Meta are not meeting their obligations,\" said Margrethe Vestager, executive vice president of the European Commission in charge of competition policy. These three tech giants are among the so-called \"gatekeepers,\" a group of six companies (also including Amazon, ByteDance and Microsoft) providing 22 core platform services. They were designated as such in September 2023 and had six months to comply with the DMA. Alphabet, Google's parent company, is under scrutiny for purported breaches concerning steering practices within its Google Play application store and self-preferencing on Google Search. Likewise, Apple's policies regarding steering within the App Store and implementing choice screens for the Safari browser are under investigation. The design of the web browser choice screen could be preventing users from freely choosing services within the Apple ecosystem, said the European Commission in a statement. Meta's \"pay or consent model,\" offering a binary choice regarding user consent, is also under examination. The Commission worries that this model lacks a genuine alternative for users who do not consent, potentially enabling the \"gatekeepers\" to accumulate personal data. The EU is also looking into other possible issues but has yet to open further cases. Facts are being gathered about how Amazon may prioritize its brand products, and about how Apple's new fee structure might be undermining the company's obligations under the DMA. While investigations into Amazon and Apple's new fee structure are pending, leading experts have been quick to react to these announcements. Daniel Friedlander, senior vice president of the Computer and Communications Industry Association Europe, criticized the European Commission's decision to launch investigations shortly after the DMA came into force on March 7. \"Launching the first preliminary investigations under the DMA just days after the compliance deadline throws a wrench into the idea of companies and the European Commission working together to implement the DMA successfully,\" said Friedlander. He stressed that the timing of these announcements \"makes it look like the Commission could be jumping the gun,\" cautioning the action risks validating industry concerns that the DMA compliance process could become politicized. Google announced \"significant changes\" in early March to its European operations, including alterations to search results, search engine choice screens, and transparency and data sharing practices. Rory O'Donoghue, a spokesperson for Google, highlighted in an email to Xinhua that the company would comply with the DMA, and underscored that \"there would be impacts for users and businesses in Europe\" due to this compliance. He added that Google will \"defend\" its approach in the coming months while engaging with the European Commission. \"We have been in discussions with gatekeepers for months to help them adapt, and we can already see changes happening on the market. But we are not convinced that the solutions by Alphabet, Apple and Meta respect their obligations for a fairer and more open digital space for European citizens and businesses,\" said Thierry Breton, European Commissioner for the Internal Market. The commission should conclude its investigation within the next 12 months. If found guilty, the tech giants could face fines of up to 10 percent of global turnover. "
}