{
    "title": "Apple loses $113 billion in market value after US launches antitrust \ninvestigation",
    "date": "3/21/2024",
    "url": "https://www.hindustantimes.com/business/apple-sued-in-us-for-monopolizing-smartphone-markets-may-face-probe-in-europe-company-loses-113-billion-in-value-101711073917243.html",
    "text": "Subscribe Now! Get features like Apple has been sued by the US Department of Justice and 15 states as it was alleged that the iPhone maker monopolized smartphone market, hurt smaller rivals and drove up prices. With this, Apple joins competitors sued by regulators, including Alphabet's, Google, Meta Platforms and Amazon.com. Attorney General Merrick Garland said in a statement, “Consumers should not have to pay higher prices because companies violate the antitrust laws. If left unchallenged, Apple will only continue to strengthen its smartphone monopoly.” The company is also said to be facing probes in Europe related to whether it is complying with the Digital Markets Act. Shares of the company slid 4.1%, erasing about $113 billion in market value and taking their year-to-date loss back to 11%. The company- which was once the world’s most valuable firm at more than $3 trillion-has underperformed both the Nasdaq 100 and the S&P 500 in 2024. The US suit accuses Apple of blocking rivals from accessing hardware and software features on its popular devices while the possible investigations in Europe will focus on the firm’s new fees, terms and conditions for app store developers. Apple fired back at the US lawsuit by calling it “wrong on the facts and the law.” and said that the action would “set a dangerous precedent, empowering government to take a heavy hand in designing people’s technology”. The company also vowed to “vigorously defend against it\" but did not respond to potential probes in Europe. “At Apple, we innovate every day to make technology people love — designing products that work seamlessly together, protect people’s privacy and security, and create a magical experience for our users,” the company said, adding, “This lawsuit threatens who we are and the principles that set Apple products apart in fiercely competitive markets.” Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}