{
    "title": "Apple made plans to integrate Google's Gemini engine into its smartphones",
    "date": "3/18/2024",
    "url": "https://finimize.com/content/smart-phone",
    "text": "Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Sponsored IG - The ISA with more flex than the rest 12 days ago  •  2 mins What’s going on here? Apple made plans to integrate Google’s Gemini AI engine into its smartphones, a deal that could make iPhones sharper than ever before. What does this mean? Apple’s investors have been hoping for an AI breakthrough worthy of the company’s signature launch events. So far, though, the firm hasn’t revealed anything worth lining up for – and now, it’s considering fitting out iPhones with Gemini. Apple will be hoping investors respect the innovation, no matter whose name is on the patent: the stock’s down over 6% this year, its worst performance against the Nasdaq 100 index at this time of year in over a decade. Google’s investors won’t mind the collaboration, of course. The deal would be Gemini’s highest-profile partnership to date – so long as Apple doesn’t sidle up to another competitor like OpenAI before signing the dotted line. Why should I care? For markets: Stick to the status quo. David Ricardo’s “comparative advantage” theory argues that firms should focus on what they do best and delegate the rest. If you buy that, Apple’s move is more shrewd than sluggish. So sure, Apple has problems: iPhone sales are losing their pace, electric vehicle blueprints are essentially in the trash, and regulators are donning their reading glasses. But with a spotless record of keeping profit in check and innovating when it’s least expected, it’ll probably take a lot more bad news for top investors to ditch their Apple a day. The bigger picture: Forget the headlines. AI-obsessed investors have sent Magnificent Seven stocks to the front of the pack. So now that the obvious picks have quite the price tags, Goldman Sachs’ best advice is to check out companies that are expected to use AI to better their books, rather than the ones churning out new high-tech products. That means pulling your eyes away from the likes of Nvidia and Meta, and taking a look at less flashy options like Walmart, Kohl’s, or Accenture. ai alphabet apple information technology magnificent seven tech stocks us adobe ads dividends stocks Disclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. /3 • Your free quarterly content is about to expire. Uncover the biggest trends and opportunities. Subscribe now for 50% off. Cancel anytime. "
}