{
    "title": "European regulators want to question Apple after it blocks Epic Games app \nstore",
    "date": "3/7/2024",
    "url": "https://apnews.com/article/apple-epic-games-european-union-rules-3e3dc8d4d3f34d9ef3d18dcf8e8a0fdc",
    "text": "Copyright 2024 The Associated Press. All Rights Reserved. Easter 2024 FILE - An Apple logo adorns the facade of the downtown Brooklyn Apple store in New York, Saturday, March 14, 2020. European Union regulators said they want to question Apple over accusations that it blocked video game company Epic Games from setting up its own app store, in a possible violation of digital rules that took effect in the 27-nation bloc Thursday, March 7, 2024. (AP Photo/Kathy Willens, File) LONDON (AP) — European Union regulators said they want to question Apple over accusations that it blocked video game company Epic Games from setting up its own app store, in a possible violation of digital rules that took effect in the 27-nation bloc Thursday. It’s a fresh escalation of the high-stakes battle between the two companies. Epic, maker of the popular game Fortnite, has spent years fighting Apple’s exclusive control over the distribution of iPhone apps. Epic asserted Wednesday that Apple thwarted its attempt to set up its own iOS app marketplace to compete with Apple’s App Store, calling it a breach of the EU’s new Digital Markets Act. The sweeping set of rules, designed to stop big tech companies from cornering digital markets, have forced Apple to allow people in Europe to download iPhone apps from stores not operated by the U.S. tech giant — a move it’s long resisted. The European Commission, the EU’s top antitrust watchdog, said in a statement Thursday that it has “requested further explanations on this from Apple under the DMA.” The rules threaten penalties that could reach into the billions for violations. Apple has already been hit this week with a $2 billion EU antitrust fine for thwarting music streaming competition. The commission said it’s “also evaluating whether Apple’s actions raise doubts on their compliance” with other EU regulations including the Digital Services Act, a second set of regulations in the bloc’s digital rulebook that prohibit tech companies from ”arbitrary application” of their terms and conditions.  Epic contended that Apple was brazenly violating the DMA by rejecting an alternative iPhone app store that it planned to set up in Sweden to serve European Union users. It accused Apple of retaliating for scathing critiques posted by CEO Tim Sweeney, who spearheaded a mostly unsuccessful antitrust case against the iPhone App Store in the U.S. Apple said its action was justified because of Epic’s previous unlawful actions and litigation that resulted in the U.S. court decision in 2021. Apple ousted Epic from its App Store after it tried to get around restrictions that Apple says protect the security and privacy of iPhone users, while also helping recoup some of the investment that powers one of the world’s most ubiquitous devices. “Epic’s egregious breach of its contractual obligations to Apple led courts to determine that Apple has the right to terminate ‘any or all of Epic Games’ wholly owned subsidiaries, affiliates, and/or other entities under Epic Games’ control at any time and at Apple’s sole discretion,’” Apple said in a statement. “In light of Epic’s past and ongoing behavior, Apple chose to exercise that right.” Copyright 2024 The Associated Press. All Rights Reserved. "
}