{
    "title": null,
    "date": "1/12/2024",
    "url": "https://www.thenationalnews.com/business/technology/2024/01/12/microsoft-overtakes-apple-as-most-valuable-stock-in-the-world/",
    "text": "Microsoft chairman and chief executive Satya Nadella speaks during CES 2024 in Las Vegas, Nevada. AFP Microsoft chairman and chief executive Satya Nadella speaks during CES 2024 in Las Vegas, Nevada. AFP Microsoft overtook Apple to become the world’s most valuable publicly traded company for the first time in more than two years, as worries over smartphone demand have weighed on the iPhone maker’s stock in recent weeks. The Redmond, Washington-based software company rose 1 per cent to $388.47 on Friday, ending with a market valuation of $2.89 trillion. Meanwhile, Apple gained 0.2 per cent and closed with a market capitalisation of $2.87 trillion. It is the first time since November 2021 that Microsoft has closed with a higher value than Apple. “When you compare and contrast the two, the growth Apple is showing is nothing special, whereas Microsoft has done a better job of executing and demonstrating earnings growth,” said David Katz, chief investment officer at Matrix Asset Advisors, which has positions in both. “Microsoft also has a much clearer road map with AI, and it has done a great job articulating how that will accelerate growth to make its long-term prospects even more compelling.” While both were part of the so-called Magnificent 7’s powerful rally in 2023, their fortunes have diverged this year. Microsoft has risen 3.3 per cent, supported by ongoing optimism over artificial intelligence, while Apple has dropped 3.4 per cent amid rising concerns over its growth. It has been hit by at least three analyst ratings downgrades, according to data compiled by Bloomberg. Wall Street’s less-favourable view on Apple suggests it would not be surprising if Microsoft maintained or even built on its newfound size advantage. The average analyst price target for Microsoft equates to upside of about 8 per cent over the coming 12 months, slightly above Apple’s return potential. Such a gain would result in Microsoft topping $3 trillion in market valuation, joining Apple as one of only two companies to hit such a threshold. Microsoft and Apple remain the biggest weights in the S&P 500 by far, together accounting for roughly 14 per cent of the overall index. Few other companies approach them in size: oil giant Saudi Aramco’s value sits at a little more than $2 trillion, while Alphabet, Amazon and Nvidia are all valued above $1 trillion. Meta Platforms, which jumped nearly 200 per cent last year, is the next closest, sitting right below the trillion-dollar threshold. Future Beat Your round-up of the stories shaping tomorrow’s world "
}