{
    "title": "Microsoft passes $3T market cap to take over Apple again",
    "date": "1/26/2024",
    "url": "https://www.aa.com.tr/en/economy/microsoft-passes-3t-market-cap-to-take-over-apple-again/3120151",
    "text": "Türkiye World Middle East Americas Europe Africa Asia - Pacific Economy Politics Energy Sports Infographics Analysis Photo Video Environment Education Life Culture Analysis Health Science-Technology Company News Finance Terminal Anadolu Images Energy Terminal AA Academy Green Line Discrimination Line Fact Check Line Career AA Corporate News  ISTANBUL Microsoft saw its market value surpass $3 trillion again on Friday and took over Apple as the world's most valuable public company by market capitalization. The Washington state-based company's stock price was trading at $405.97 per share for a 0.27% daily gain at 12.05 p.m. EDT on the New York Stock Exchange when the firm's market cap stood at $3.02 trillion. Apple's stock price was at $193.94 a share at the time for a daily loss of 0.12%, while its market value was at $3 trillion. This is the third time Microsoft's value surpassed Apple after Wednesday and on Jan. 12, but both instances occurred very briefly. At 12.15 p.m. EDT, Apple's stock price fell further down to $193.74 per share, extending its daily loss to 0.22%. Microsoft stocks were trading at $405.89 a share with a gain of 0.25% at that time. In less than a month, Microsoft saw its stock price rising almost 8% since the beginning of this year as investors see its generative artificial intelligence initiatives and investments as promising. Apple, meanwhile, gained the top spot in China's smartphone market for the first time ever in 2023, according to a report on Thursday. The California-based firm had a record-high market share of 17.3% last year in the world's biggest smartphone market, said the International Data Corporation. History Editorial Guidelines Social Media Policies Executive Team Domestic Offices International Offices Media Center Communication RSS Subscription Requests Announcement Service Quality Management Privacy and Cookies Policy Information Policy Diary Company News Finance Terminal Anadolu Images Energy Terminal AA Academy Green Line Discrimination Line Fact Check Line IPhone Application IPad Application Android Application "
}