{
    "title": "iPhone 17 said to get huge camera upgrade as sales concerns continue: \nanalyst",
    "date": "1/4/2024",
    "url": "https://seekingalpha.com/news/4052257-iphone-17-huge-camera-upgrade-sales-concerns-continue-analyst",
    "text": "yalcinsonat1 Amid some concerns about sales of the iPhone 15, a widely watched analyst said on Thursday that Apple (NASDAQ:AAPL) is likely to give the 2025 edition a huge upgrade to its camera. In a blog post, TF International Securities analyst Ming-Chi Kuo said the iPhone 17 line will come with a 24-megapixel front-facing camera and a six-element lens, compared to the 12-megapixel camera on the iPhone 14 and iPhone 15. The upgrade is expected to \"significantly improve the image quality,\" Kuo said in the post. Kuo noted that the 2024 edition of the iPhone — expected to be called the iPhone 16 — is likely to have the same 12-megapixel front-facing camera as seen on the iPhone 14 and iPhone 15. While the front-facing camera for the iPhone 16 is expected to remain the same, Kuo said the high-end model, the iPhone 16 Pro, is likely to have a periscope lens, manufactured by Apple supplier Genius. Genius is likely to benefit from the upgrade to the iPhone 17 front-facing camera, the high-unit pancake for the Vision Pro and the ultra-wide lens for Huawei's P70 line of smartphones, Kuo explained. Apple shares fell slightly in premarket trading on Thursday. The report of a significant upgrade to the iPhone comes days after a pair of Wall Street firms downgraded Apple, due in part to perceived worries about iPhone sales. Piper Sandler analyst Harsh Kumar lowered his rating to neutral from overweight, citing concerns over iPhone inventory levels, due in part to worries over China, difficult comparisons and continued currency headwinds. Earlier this week, Barclays analyst Timothy Long cut his rating on the tech giant, stating sales for the iPhone 15 line, unveiled in September, have been uninspired. Long, who also trimmed his price target, said he does not expect much from the iPhone 16 line, widely expected to be released in the fall of this year. "
}