{
    "title": "Apple cuts China iPhone prices: Why one analyst isn't worried",
    "date": "1/16/2024",
    "url": "https://finance.yahoo.com/video/apple-cuts-china-iphone-prices-231940913.html",
    "text": "Apple is (AAPL) reportedly cutting the price of its iPhone in China. Creative Strategies Principal Analyst Ben Bajarin notes that the price cuts coms as China enters into Chinese New Year which he says is a normal time for promotions. Bajarin says that, overall, that the smartphone markets is \"in a period of recovery.\" Though replacement cycles now run longer across smartphones, he views iPhone demand trends in China rebounding off lows. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith - A busy few days for Apple shares down on news that the company is offering discounts on its newer iPhones in China amid slow demand, as well as news that Apple Watches may be losing the blood oxygen feature to avoid a US import ban. Joining us now to break this all down is Ben Bajarin, creative strategies, CEO, and principal analyst. Ben, it is always great to have you on the program. It's a few places I could start, Ben. A few different headlines. But maybe I'll begin Ben with these reports we're seeing that Apple is offering these discounts in China, Ben, including on its latest and greatest iPhones. You know Apple backwards and forwards, Ben. How rare is it for Apple to do that in China? And why do you think Tim Cook is doing that? Is that signaling weakening demand over there, increasing local competition? What do you think? BEN BAJARIN: Yeah, I think there's a mix of things. This is obviously always been a strong quarter. Thanks to Chinese New Year for iPhone in China. I know there's been some-- because of those promotions and because of Chinese New Year, there's been some not necessarily discounts, but promotions that have been happening as well. We're not seeing a tremendous amount of demand softness, if you will. But I do think there's variations between all of those models. For example, China is continuing to be strong in the upper end of that price band. So higher ASP, more Pro Max has definitely been part of that mix shift. So I think part of that sort of rebalancing of the portfolio could be part of it. And where carriers are looking to do some of those promotions. But I think, again, just on the back of what we typically see in Chinese New Year, this has typically been a relatively strong quarter. But that mix shift is going to be one of the bigger questions is how much volume versus how much is the ASP rise in that region. - Ben, does this tell you that Tim Cook is worried about sales in China? BEN BAJARIN: I don't think so. I've seen pockets of this before. I think, again, we're in a period of recovery for the smartphone market in general. China had some signals of that last year. So I think there was some optimism going into this quarter. But, again, one of the biggest dynamics that I think is impacting the industry as a whole is that it's been evident now for six to eight months that the smartphone replacement cycle is lengthening in every region, which includes China. China typically has had the shortest refreshment cycle of anyone. And that's now expanding to anywhere between 3 and six months based on price span. That in itself is having different implications on the market as a whole. And so I think there's some rebalancing again of that strategy of how carriers are going to start to move some of those promotions trying to keep some of those sales afloat. - And, Ben, there's a lot of investor interest in Huawei as well. I'm just interested to get your take. How much of a real competitive threat do you think Huawei actually poses to Apple in China? BEN BAJARIN: It still remains to be unseen. That's a big part of the debate. Obviously, they were amongst one of the biggest competitors, especially in premium for Apple prior to some of the sanctions that got hit on them from the US. It feels like that's starting to grow again in momentum. But, again, it's still relatively small. They're also trying to do this with some of their own silicon, which is raising a little bit of questions in terms of the product quality there. I think the next few quarters will probably be much more telling as to the strength of Huawei. But there is a lot of increasing competition there. Obviously, Xiaomi continues to be strong. And you see a range of products from the BBK group like Oppo and Vivo continuing to be strong there. So, yes, increased competition, lengthening smartphone cycles, all those things adding to dynamic. That's really hitting everybody in the region. Related Quotes "
}