{
    "title": null,
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/video/apple-faces-another-legal-setback-221657227.html",
    "text": "Apple (AAPL) has another hill to climb after a federal appeals court refused to grant a longer pause on the sale of its Series 9 and Ultra 2 Apple watches, forcing the company to pull the watches that have a blood oxygen measuring sensor feature from its US store shelves for a second time. The ban stems from its patent dispute with Masimo (MASI) which alleges Apple was infringing on Masimo’s patents for blood oxygen monitoring in their watches. Separately, according to a report from Bloomberg, Apple may face an antitrust lawsuit from the US Department of Justice, alleging the company leveraged software and hardware to assure iPhone dominance, as soon as March. Yahoo Finance Tech Editor Dan Howley joins the Live show to break down the latest developments with Apple. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino MADISON MILLS: Apple facing another legal setback over its patent dispute with Masimo over its watch. The federal appeals court refusing to grant Apple a longer pause on the watch import ban. Dan Howley has the latest for us as always. And Dan, thanks for joining us on this what does this mean for Apple? What do you anticipate the response from the company here? DAN HOWLEY: Yeah it looks like they're going to have to pull the Apple Watch again from store shelves and its online store in the US, at least as far as the Apple series 9 goes and the Apple Watch Ultra go. The Apple Watch SE will continue to be on sale. They had to do this originally just ahead of the holidays because of the issues that they're having with Masimo and the blood oxygen sensor. Then there was a chance for them to continue selling it. But now it looks like that appeal for them to extend that hold on the ban is now denied. So they'll have to once again pull them. Overall for Apple, it means that they're going to have to somehow come up with a way to remove the blood oxygen sensor. Apparently, they have something in the works. But it just isn't available right this moment. And so if they do have to pull them tomorrow or when they do pull them tomorrow, they're not going to have any new Apple Watches on the market. And that doesn't mean that you can't go to a Best Buy or Amazon or any of those places and buy. One you sure can. The issue is the import then at that point. You know, what happens if Apple tries to import more or if other companies try to import more? So this is going to continue to be a problem for Apple until this whole blood oxygen sensor issue is sorted out. And we'll have to see if eventually they do start selling the Series 9 and Ultra without the feature completely. JOSH LIPTON: And, Dan, that's one issue facing Apple. And then another is we're hearing these reports that Apple could be facing an antitrust trial perhaps as soon as March. What are you hearing on that front? DAN HOWLEY: Yeah. This is kind of a continuation of a earlier story that we had heard about Apple kind of facing this potential showdown with the DOJ. This one report is coming from Bloomberg about the March date. But really what's happening is the DOJ has been looking at Apple, their App Store practices, their software and hardware practices for some time, whether or not they exclude competitors from using their products and if that hurts competition in a way that would kind of rise to illegal in terms of antitrust laws. So, you know, there's the concerns over whether or not they block the ability for companies to use for instance services like Apple Pay or the ability to access Apple Pay, hardware, the same with Find My. These are things that have come up quite regularly. There's also critics like Spotify and Tile, who complain about Apple blocking them out or making things harder for them. So this is something that's been going on for quite some time. And it looks like now the DOJ may end up filing suit. Although, they haven't-- according to this report, they haven't finalized any decision yet. MADISON MILLS: Dan, thanks so much for walking us through that. And I should mention Apple down about half a percent after the close heading into tomorrow's market. Really appreciate you joining us on all things Apple always. Related Quotes "
}