{
    "title": "Sideloaded app stores are coming to iOS in the EU: Here's how they'll work",
    "date": "1/9/2024",
    "url": "https://thenextweb.com/news/sideloaded-app-stores-ios-eu-how-work",
    "text": "This article was published on January 9, 2024 The bloc's regulatory crusade against big tech is about to make consumer choice a whole lot easier Readers, it’s happening: Apple will soon allow iOS users to sideload app stores in the European Union (EU). This will enable consumers to access software through other means than Apple’s App Store — and this move could have huge implications not only for the company, but also for Europe’s consumer and business markets. While the specific date for sideloading is unconfirmed, the rumours predict this will happen at some point in the first half of 2024. All this raises some interesting questions: why is this happening? Should you care about sideloading? And how will it impact the European market? TNW Conference 2024, June 20-21 - Hurry, price increase on March 29! Register now to get the best deal and save hundreds on all passes. You know what? We’re going to find out. I put this question to Ivan Lam, senior analyst at Counterpoint Research. He directed me towards the The Digital Markets Act (DMA), a set of regulatory criteria introduced by the European Union in 2022. “The legislation, designed to foster competition and empower users, mandates that gatekeepers like Apple allow the installation of apps from sources outside the official App Store,” Lam explains. The broad idea of the DMA is to hamper the power of these huge businesses. “Apple’s control over iOS app distribution through its exclusive App Store has been a cornerstone of its market dominance and revenue generation,” Lam says. The Cupertino-based company generates huge amounts of cash through its marketplace monopoly. Only approved apps are allowed on Apple’s App Store and it gets a 15-30% cut on sales, for both purchases and subscriptions. It’s a cash cow. It’s a way that Apple is making up for plateauing iPhone sales. And the only reason the company is opening the App Store up is because the EU is forcing it to. This isn’t an easy thing to predict. I put the question to Riley Testut, an independent iOS developer who created AltStore, an alternative iOS app store that doesn’t require jailbreaking to access. He tells me that the impact sideloading will have on Apple depends entirely on how it intends to implement it. “Apple (for better or worse) wants complete control over the iOS experience, and [sideloading] will fundamentally take some of that away,” Testut says. There are also big financial implications for the company. “Apple makes a lot of money from the App Store, and that will absolutely be impacted by these changes.” Lam from Counterpoint broadly agrees, saying that “the potential threat to Apple’s revenue lies in the possibility that users may choose non-Apple channels for app payments, affecting the company’s earnings.” Although, he hastens to add, getting consumers to make this switch “poses a substantial challenge for any potential disruptors.” In other words, most Apple users won’t be rushing to sideload alternative app stores and use different payment methods. There’s a comfort in the familiar, after all. Regarding this level of impact, Testut — the AltStore developer — doesn’t believe Apple has too much to worry about either. His view is the company will be broadly fine, unless other nations start passing similar laws to the EU’s DMA. What we’ve discovered is, if it plays its cards right, sideloading in the EU won’t bring Apple to its knees. It’ll be a roadbump, but not much more. This is where things get more exciting. There’s huge potential in sideloading for the regular person living in the EU. “The main benefit of sideloading,” Testut tells me, “is that users will be able to download entirely new apps that have never been possible due to App Store restrictions, such as video game emulators, virtual machines, cloud-gaming services, [and] non-WebKit web browsers.” This means that iPhones and iPads will have the ability to become more flexible and computer-like than ever before. I chatted with another developer about this: Andrew Hill. He works in Amsterdam for a design studio with international clients. Hill agrees with Testut, saying he “[doesn’t] see any genuine downside for consumers.” Yes, he thinks there’s a raised risk of downloading spyware or malware through sideloaded stores, but Hill expects that “all apps will still need to go through some form of Apple’s (kafkaesque) approval process.” There’s no way that Apple is simply going to open the doors and let developers do whatever they want. There will be strict rules around sideloading. The key part of all this is Hill believes that “very few consumers will genuinely take advantage of third party app stores.” One key reason for this is that Apple will do all it can to dissuade users from sideloading. For example, they could be shown a selection of popups warning them of risky behaviour. Furthermore, the iOS user base veers towards people who just want a device that works. A lot of people who really want to tweak their phones are already using Android. “When was the last time you heard someone talking about jailbreaks?” Hill asks. During my conversations, there were two main threads that people mentioned about sideloading’s impact on businesses: revenue and security. “For businesses, the primary benefit will be financial,” Testut the creator of AltStore tells me, “they’ll have the option to distribute their apps through a competing store for (presumably) lower fees than Apple’s 30%.” Certain companies (think of Epic Games and its battle with Apple, for example) are bound to sideload their own store to compete with Apple’s. Of course, it’s only the largest businesses that will want to do this — but they’re unlikely to see huge numbers of users switch over. It wouldn’t make much sense for, say, Amazon to launch its own iOS app store and then remove all its software from Apple’s marketplace. Users are unlikely to follow in big enough numbers to make that approach worthwhile. What will make sense though is smaller companies offering their services on as many sideloaded app stores as possible. With Apple taking 30% of subscription revenue, lowering that commission elsewhere could be crucial. To find out more about the security aspect, I spoke with Alan Bavosa, VP security products at Appdome, a cyber defence automation platform for Android and iOS developers. Bavosa points towards the “increased risk and proliferation of malware, Trojans, and fake apps” sideloading could bring. Beyond that, he explains, these third-party stories could make it easier to obtain a wide variety of hacking tools to commit mobile app piracy with. This, of course, impacts everyone, but where sideloading could be a real bother for European companies is the effect it could have on security updates. A variety of different apps from a range of stores on iOS will make timely updates across all platforms a nightmare. This, Bavosa posits, could “potentially [leave] devices vulnerable to known exploits” and mean “mobile app users may be exposed to wider attack surface.” In other words, weak user security could open up new attack vectors for people looking to exploit companies. For European businesses, there’s potential to earn more money, but there’s also an increased risk of security concerns. Sideloading giveth, and sideloading taketh away. Although this piece has focused on a lot of potential downsides, let’s not forget that Apple isn’t the most valuable company in the world out of luck. It’s a ruthless and savvy operator that will do everything in its power to ensure the DMA impacts it as little as possible. As Lam from Counterpoint says, “Apple will likely continue to adapt its strategies to maintain a balance between user empowerment and the preservation of its revenue streams in the long term.” To put that another way: Apple will do all it can to keep making money. Whenever sideloading is rolled out in Europe, expect it to be slow, controlled, and, most importantly, clever. The App Store is a goldmine, and Apple isn’t going to let other people start taking value from it willy-nilly. Saying this, it’s good to take a step back and actually enjoy what’s happening. The EU forcing Apple to adhere to the DMA legislation is a brilliant thing. Just because, as Hill says, “very few consumers will genuinely take advantage of third party app stores,” doesn’t mean this isn’t a victory for all of us. Sideloading app stores will give us more control over our devices and who we pay money to. Even if we don’t want to use this capability, it feels great that we can. Long live the DMA, long live consumer choice. Callum is the Managing Editor of TNW. He covers the full spectrum of technology, looks after editorial newsletters, and makes the occasional\n\n                                                                                            \n                                                    (show all)\n                                                \n\n\n                                            Callum is the Managing Editor of TNW. He covers the full spectrum of technology, looks after editorial newsletters, and makes the occasional odd video. Get the most important tech news in your inbox each week. The heart of tech Copyright © 2006—2024, The Next Web B.V.\n                    Made with <3 in Amsterdam. "
}