{
    "title": "Apple hasn't complied with a court order to open its App Store to allow \noutside payment options, Fortnite maker Epic ...",
    "date": "1/31/2024",
    "url": "https://fortune.com/2024/01/31/apple-not-complied-court-order-open-app-store-allow-outside-payment-options-fortnite-maker-epic-games-tells-judge/",
    "text": "Apple Inc. hasn’t properly complied with a court order to open its App Store to allow outside payment options weeks after its bid to resist those changes hit a dead end, Epic Games Inc. told a judge. After the US Supreme Court refused Jan. 16 to wade into a three-year feud between the maker of the popular Fortnite game and the technology giant, Apple said it would let all third-party apps sold in the US include an outside link to a developer website to process payments for in-app purchases. Apple has followed through with that but is still asking developers to reimburse the company with a commission of up to 27% for purchases made outside the App Store. Epic said in a filing Tuesday that it “disputes Apple’s compliance” with previously ordered changes and said it will explain the “non-compliance” in a forthcoming filing. Apple didn’t immediately respond to a request for comment. The high court decision left in place a 2023 appeals court ruling that found Apple’s business model didn’t violate federal antitrust laws, but did flout California’s Unfair Competition Law by limiting the ability of developers to communicate about alternate payment systems that may cost less. Apple has been making changes to the way the App Store operates to address developer concerns since Epic sued the company in 2020. The dispute began after Apple expelled the Fortnite game from the App Store because Epic created a workaround to paying a 30% fee on customers’ in-app purchases. Epic Chief Executive Officer Tim Sweeney complained about Apple’s “bad-faith ‘compliance’” in a Jan. 16 post on the social network X. Meanwhile, the iPhone maker is seeking a court order that Epic reimburse it for $73 million in legal expenses for breaching their developer agreement. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}