{
    "title": null,
    "date": "1/22/2024",
    "url": "https://www.musicbusinessworldwide.com/apple-music-to-pay-artists-up-to-10-higher-royalties-for-music-available-in-spatial-audio/",
    "text": "Starting this month, music available in Spatial Audio on Apple Music will receive a greater share of royalties from the platform. In an update sent to its label partners on Monday (January 22), and seen by MBW, Apple Music confirmed that Spatial-available content will receive a royalty rate up to 10% higher than content not available in Spatial. According to Apple Music’s update to its label partners, starting with the January 2024 month-end royalty payments, “pro-rata shares for Spatial Available plays will be calculated using a factor of 1.1 while Non-Spatial Available plays will continue to use a factor of 1”.  The news follows a report from Bloomberg in December that Apple Music was planning “to give added weighting to streams of songs” mixed in Dolby Atmos. Apple Music said on Monday (January 2022) that the upcoming “change is not only meant to reward higher quality content, but also to ensure that artists are being compensated for the time and investment they put into mixing in Spatial”. The platform also said that it is seeing “wide adoption of Spatial from the biggest hitmakers worldwide” with 80% of the songs to reach Apple Music’s Global Daily Top 100 in the past year available in Spatial.  9to5Mac reports that Apple Music subscribers ‘do not necessarily have to listen’ to music in the Spatial Audio format ‘for the artist to be rewarded with the bonus payout’. According to 9to5Mac, ‘the metric is calculated based on the proportion of Spatial Available to Non-Spatial Available plays’. In other words, if all of an artist’s music is offered in Spatial Audio, that artist will ‘see the 10% royalty bonus even if no one actually listened to the spatial version’. Apple Music also revealed on Monday that over 90% of the platform’s listeners have experienced music in Spatial Audio, and plays for music available in Spatial Audio have more than tripled in the last two years. The platform reported that the number of songs available in Spatial Audio on Apple Music has increased nearly 5,000% since launch, and more than doubled in the last year alone. Apple Music rolled out Spatial Audio with support for Dolby Atmos in June 2021, free for all subscribers. Apple said on Monday that it has “a zero-tolerance policy against deceptive or manipulative content and this also applies to Spatial Audio content”. The streaming service added that its teams have implemented “a quality control process that includes flagging content not delivered in accordance with Apple Music’s Spatial Audio specifications and standards of quality”. Bloomberg suggested in December that one of the reasons behind Apple Music’s decision to incentivize artists and labels to produce music in spatial Audio is to encourage its users to purchase Apple hardware. Apple devices including iPhones, AirPods, Homepods, Macbooks, and more come with support for Dolby Atmos and Spatial Audio. Elsewhere in the music streaming business, Spatial Audio is also included with Amazon Music Unlimited. Amazon Music Unlimited says that it has a growing catalog of Spatial Audio songs mastered in Dolby Atmos and 360 Reality Audio from some of the world’s biggest artists. The 360 Reality Audio format was launched by Sony Corp with Amazon Music, Deezer, nugs.net and TIDAL in January 2019. Amazon Music Unlimited customers can listen to Spatial Audio through the Fire Tablet (with Fire OS 6 and above), iOS, or Android Amazon Music app with any headphones. Apple Music rival Spotify does not currently offer Spatial Audio on its platform. Spotify is rumored, however, to be preparing a ‘Supremium’ tier that offers 24-bit Lossless music and the ability to make playlists with artificial intelligence at a monthly subscription price of $19.99 per month.Music Business Worldwide The best of MBW, plus the most important music biz stories on the web. Delivered for FREE, direct to your inbox each day. "
}