{
    "title": "Traders Cautious Ahead of Fed Meeting, Big Tech Earnings, Driving Muted \nPremarket Action for US Equity Futures",
    "date": "1/29/2024",
    "url": "https://www.tradingview.com/news/mtnewswires.com:20240129:A3065837:0-traders-cautious-ahead-of-fed-meeting-big-tech-earnings-driving-muted-premarket-action-for-us-equity-futures/",
    "text": "US equity futures were struggling for a direction before Monday's opening bell as traders turned cautious ahead of the Federal Reserve's first policy setting meeting of the year and earnings from major technology companies later in the week. Dow Jones Industrial Average futures slipped 0.07%, S&P 500 futures fell 0.03%, and Nasdaq futures inched up 0.1%. The Federal Open Market Committee is set to start its two-day meeting Tuesday. Alphabet GOOG, Amazon AMZN, Apple AAPL, Meta Platforms META, and Microsoft MSFT are all scheduled to report quarterly earnings this week. Oil prices were lower, with front-month global benchmarks North Sea Brent crude and US West Texas Intermediate crude both down around 0.6%, as traders monitored the escalating tensions in the Middle East after a drone strike on US forces in Jordan. The Dallas Fed's Manufacturing Business index, scheduled for release at 10:30 am ET, is seen coming at minus 9.3 for January. In other world markets, Japan's Nikkei closed 0.8% higher, Hong Kong's Hang Seng ended 0.8% higher, and China's Shanghai Composite finished 0.9% lower. Meanwhile, UK's FTSE 100 gained 0.1%, and Germany's DAX index declined 0.5% in Europe's early afternoon session. In equities, shares of McGrath RentCorp MGRC were more than 7% higher pre-bell after the company agreed to be acquired by WillScot Mobile Mini Holdings WSC in a $3.8 billion deal. On the losing side, Panbela Therapeutics PPBLA shares fell 63% after the company priced a $9 million public offering of common stock and warrants. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @bradfairbridge @rajbuzzz @Kevin Trinh @Cenobar @arcanebear @udcovers @fx.today @_dalton16 @TradingView @mytradingsetup @ftmocom @chartfeed @olka_gadzieva @mytradingsetup @satoshi_empire @MidasPls @Zeiierman Trading @Onlnternet Whatever the trade "
}