{
    "title": "Apple and Cenovus Energy have been highlighted as Zacks Bull and Bear of \nthe Day",
    "date": "1/25/2024",
    "url": "https://finance.yahoo.com/news/apple-cenovus-energy-highlighted-zacks-134000115.html",
    "text": "Chicago, IL – January 25, 2024 – Zacks Equity Research shares Apple AAPL as the Bull of the Day and Cenovus Energy Inc. CVE as the Bear of the Day. In addition, Zacks Equity Research provides analysis on AT&T Inc. T, Verizon Communications Inc. VZ and T-Mobile US Inc. TMUS. Here is a synopsis of all five stocks. Apple stock ended 2023 and started 2024 on a downbeat note as some analysts raced to outsmart themselves with various downgrades of the iPhone maker based on concerns about slowing growth in China and other headwinds. Yet, Apple is up around 8% since January 5 and approaching its mid-December records heading into its Q1 FY24 earnings release on February 1. Apple’s recent wave of upward earnings revisions help AAPL earn a Zacks Rank #1 (Strong Buy). Apple is certainly no hidden gem, but who cares? The moral of our story today is that it pays to keep it simple and buy shares of one of the true Wall Street titans as part of a healthy, well-rounded portfolio. Apple is far more than an iPhone maker these days. Plus, AAPL is trading above all of its key short-term and long-term moving averages. A few notable analysts downgraded Apple stock over the last month or so. Their concerns focused on slowing iPhone sales, with a particular focus on China, among wider fears about an increasingly saturated high-end smartphone market. There are also constant worries about legal battles regarding its App Store and more. Apple is facing mounting competition from rival Huawei Technologies in the world’s second largest economy. AAPL is also suffering setbacks in the Chinese market, as are many other companies across various industries, due to the broad-based economic slowdown in China. Geopolitical fears play their part as well. AAPL’s overall sales declined YoY during the trailing four quarters, with total FY23 revenue down 2.8% (its third YoY decline in the last eight years). Despite the mounting concerns about Apple’s business in China and its economy more broadly, AAPL’s revenue in China only slipped by roughly 2.2% in fiscal 2023 (vs. Apple’s wider 2.8% drop). Apple’s total iPhone revenue fell by over 2% last year, and smartphone sales climbed by 2.8% in the fourth quarter. Apple’s branding power remains nearly unmatched and its constant cycles of new phones and devices keeps people wanting more. Many consumers upgrade to new iPhones and other devices habitually, even if there isn’t a game-changing difference, and would never think of leaving the Apple universe. Apple sold $200 billion worth of iPhones in FY23 up from $142 billion in FY19. Apple’s long-term growth case is not difficult to make in a world full of smartphone addicts, especially as its subscriptions grow within its key services unit. Chief executive Tim Cook has focused on transforming Apple beyond an iPhone maker by continually making money from its loyal and growing customer base. Apple’s services segment climbed by 9% in FY23 to account for 22% of sales, making it by far the biggest segment outside of iPhone. Apple said last quarter that it had an installed base of “over 2 billion active devices,” which “continues to grow at a nice pace.” AAPL’s services efforts go beyond its App Store and include Netflix and Spotify competitors, a subscription news offering, Apple Wallet, a video game platform, digital workout classes, and more. AAPL finished its most recent period with “over 1 billion paid subscriptions across” its services, marking nearly double the number it had three years ago. On top of that, Apple has brought more of its chips in-house and it is quietly spending heavily on rolling out AI features in its smartphones and other devices. Taiwan Semiconductor Manufacturing Company (TSM) reported upbeat results on January 18 and provided strong guidance that signals a return to growth for the smartphone market. Apple’s revenue is projected to climb by 3% in FY24 and jump 6% higher in FY25 to reach $418.36 billion vs. $383.29 billion in FY23. Meanwhile, its adjusted earnings are projected to grow by 8% in FY24 and another 9% higher next year to come in at $7.19 per share. This would come on top of marginal EPS growth last year. Apple has topped earnings every period over the last five years outside of a small miss in the first quarter in FY23. Better yet, Apple’s earnings revisions have trended higher over the last month for FY24 and FY25, with its most accurate/most recent estimates solidly above the already-improved consensus. The bottom line positivity helps it capture a Zacks Rank #1 (Strong Buy) right now. AAPL stock is up around 8% since January 5 and it trades 6% below its average Zacks price target and around 2% under its mid-December records. The rebound took Apple back above its 50-day and 21-day moving averages and from oversold RSI levels to above neutral. Apple shares have climbed by roughly 1,000% in the last 10 years to top Microsoft (MSFT) and blow away the Zacks Tech sector’s 275% run. Apple is only up 36% in the past three years vs. Microsoft’s 75%. AAPL has also underperformed Tech during the last 12 months, which means it might be less overheated than some might assume. Apple is currently trading above its very long-term 21-month moving average and it appears far from overheated by historical RSI standards. Valuation-wise, Apple trades at a roughly 20% discount to its five-year highs at 28.8X forward 12-month earnings and not too far above its median or Tech. Apple returned $25 billion to shareholders last quarter via buybacks and dividends. The firm is also still investing heavily in future growth endeavors such as artificial intelligence, EVs, and beyond. Some investors might decide they would rather attempt to find the next Apple. But sometimes betting on the favorite works better than going with the underdog. Cenovus Energy Inc. is an integrated oil and energy firm that experienced a wave of downward earnings revisions recently. Cenovus Energy is also part of a low-ranked Zacks industry, and energy is the only one of 11 S&P 500 sectors still in the red over the trailing three months. Cenovus Energy is a Canadian-based integrated energy company headquartered in Calgary. The firm runs oil and natural gas production operations in Canada and the Asia Pacific region. Meanwhile, its upgrading, refining, and marketing operations are based in Canada and the U.S. Cenovus Energy has been on a wild ride alongside oil and energy prices since the initial Covid-19 selloff. CVE is coming off an impressive stretch of top and bottom-line growth along with nearly all of its peers. But CVE, like the entire industry, faces off against a hard to compete against stretch and a slowing global economy. Zacks estimates call for Cenovus Energy’s adjusted earnings to fall roughly 33% in FY23 on 28% lower sales. The company is currently projected to bounce back on both the top and bottom lines in 2024. However, CVE’s earnings revisions have started to trend in the wrong direction again recently. Cenovus Energy’s FY23 earnings estimate is down around 6% in the last 60 days, with its FY24 estimates 5% lower. The company’s fourth quarter earnings figure is currently 33% lower than it was several months ago. Worse yet, CVE’s most recent/most accurate estimates came in far below the already beaten-down consensus. Cenovus Energy lands a Zacks Rank #5 (Strong Sell) at the moment because of its negative revisions trend. Therefore, investors might want to stay away from the stock for now, or at least until after it reports on February 15. CVE shares are down -40% in the last 10 years vs. the Zacks Oil and Energy sector’s -20% downturn and the S&P 500’s +180% climb. Cenovus Energy stock is also trading below its 21-day, 50-day, and 200-day moving averages. All that said, some investors might want to circle CVE on their watchlists since fossil fuels are poised to play a huge role in the global economy for a long time. The Fiber Broadband Association recently unveiled the findings of its 2023 Fiber Deployment Cost Study, conducted by Cartesian. This study serves as a pivotal benchmark for fiber broadband service providers, offering insights into cost profiles and areas of inefficiency. The implications of this study extend beyond statistical figures, providing a roadmap for industry participants navigating the complex terrain of fiber deployment. The study underscores the significant role of labor in deployment costs, contributing to 73% of underground build costs and 67% of aerial costs. Understanding these proportions is crucial for broadband providers seeking to optimize their cost structures, especially when leveraging public and private funding to connect communities. The study not only highlights labor costs but also unveils regional variations and cost differentials between deployment methods. These nuances are essential for industry players to tailor their strategies based on geographical considerations and the most efficient deployment methods. The survey, spanning diverse industry participants, revealed common themes that will be explored in an upcoming webinar. Labor emerges as a consistent factor, accounting for more than two-thirds of build costs. The initial cost disparity between aerial and underground deployment is notable, but the study suggests that higher operational expenditures of aerial deployment balance this out in the long run. In 2024, respondents anticipate an overall increase in deployment costs. However, several categories are expected to show improvement. While 76% of respondents noted material cost increases in 2023, only 58% anticipate the same for 2024. Additionally, a majority expects engineering and permit costs to decrease in the coming year, signaling potential efficiency gains. As the industry grapples with the dynamics of fiber deployment, the insights from the 2023 Fiber Deployment Cost Study provide a valuable compass. Industry participants like AT&T Inc., Verizon Communications Inc. and T-Mobile US Inc. are likely to use this information to refine their cost management strategies, optimize deployment methods and make informed decisions in a landscape where reliable broadband connectivity is a paramount goal. The findings particularly gain significance as the industry players are increasingly focusing on fiber densification for a more connected future. Fiber networks are essential for the growing deployment of small cells that bring the network closer to the user and supplement macro networks to provide extensive coverage. Telecom service providers are increasingly leaning toward fiber optic cable to meet the burgeoning demand for cloud-based business data and video streaming services by individuals. Moreover, the fiber-optic cable network is vital for backhaul and last-mile local loop, which are required by wireless service providers to deploy the 5G network. The companies are expanding their fiber optic networks to support 4G LTE and 5G wireless standards as well as wireline connections. Disclaimer: This article has been written with the assistance of Generative AI. However, the author has reviewed, revised, supplemented, and rewritten parts of this content to ensure its originality and the precision of the incorporated information. Since 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 https://www.zacks.com Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer. Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index.Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report AT&T Inc. (T) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Verizon Communications Inc. (VZ) : Free Stock Analysis Report Cenovus Energy Inc (CVE) : Free Stock Analysis Report T-Mobile US, Inc. (TMUS) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}