{
    "title": null,
    "date": "1/3/2024",
    "url": "https://247wallst.com/investing/2024/01/03/4-red-hot-stocks-top-wednesdays-biggest-wall-street-upgrades-and-downgrades/",
    "text": "What a difference a year makes, even if it’s just a few trading days. Investors opened up 2024 with selling almost across the board. Two of the three major indices finished lower in what will be another holiday-shortened trading week. The Nasdaq was the big loser Tuesday, dropping 1.6% for its worst day since October to close the session at 14,765.94. Barclay’s downgrade of Apple Inc. (NASDAQ: AAPL) sent the shares tumbling almost 4%, as the firm cited weakening iPhone 15 sales as a potentially ominous sign for the iPhone 16 and overall hardware assumptions. Treasury yields also contributed to the sour mood across Wall Street as yields soared across the curve, especially on the longer maturities. The benchmark 10-year note took one of the biggest hits Tuesday, with the yield climbing eight basis points to finish at 3.94%; the shorter two-year paper closed at 4.32%. While the inversion between the two has narrowed, history says that it still signals the potential for a recession. Brent and West Texas Intermediate crude both started the year lower even though the cargo has been starting to move again through the Red Sea. Both benchmarks initially surged higher on the day. Analysts cited the possibility of China increasing purchases in the energy complex as a positive as well. Brent was last seen at $76.01, while WTI closed at $70.52. Natural gas closed up over 2% at $2.57. After some early session buying, the February gold contract closed modestly lower at $2,067.50. The dollar index and lower crude price put a kibosh on the buying by noon. Bitcoin has another big day, closing up 1.37% at $44,827.70. The hopes for a Bitcoin exchange-traded fund have been the wind in the cryptocurrency sales since mid-October. Here are the top Wall Street upgrades and downgrades for Wednesday, January 3, 2024. American Express Inc. (NYSE: AXP) from Underweight to Overweight, with the $148 price target increased to $193, at Stephens. Citigroup Inc. (NYSE: C) from Peer Perform to Outperform with a price target of $58 at Wolfe Research. GSK PLC (NYSE: GSK) from Hold to Buy with a price target of $48 at Jefferies. Moderna Inc. (NASDAQ: MRNA) from Perform to Outperform with a price target of $142 at Oppenheimer.  AstraZeneca PLC (NASDAQ: AZN) from Buy to Hold, and the price target reduced from $78.50 to $70, at Jefferies. Blackstone Inc. (NYSE: BX) from Buy to Neutral at Goldman Sachs, though it raised its $115 price target to $128. Occidental Petroleum Corp. (NYSE: OXY) from Buy to Neutral with a price target of $63 at Mizuho.  Amazon.com Inc. (NASDAQ: AMZN) was resumed with a Buy rating and a price target increase from $157 to $195 at D.A. Davidson. Apple Inc. (NASDAQ: AAPL) was resumed with a Neutral rating and a price target of $166 at D.A. Davidson. Li Auto Inc. (NASDAQ: LI) was initiated with a Buy rating at Goldman Sachs; no price target was given. Nio Inc. (NYSE: NIO) initiated with a Neutral rating at Goldman Sachs, with no price target given. ALERT: 5.25% Yield Is 8x National Average (Sponsored) Robinhood Gold just rolled out a wild 5.25% APY yield for members, a whopping 8x the national average and way better than treasuries. Earn an eye watering amount of money while you sleep. Sign up using the link below or click here to start earning today.  Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}