{
    "title": "Apple Fights to Block Masimo's New Watch on Heels of Import Ban",
    "date": "1/23/2024",
    "url": "https://news.bloomberglaw.com/ip-law/apple-fights-to-block-masimos-new-watch-on-heels-of-import-ban",
    "text": "Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 By Christopher Yasiejko While Apple Inc. pulled every available lever to fight an import ban of its flagship Apple Watch models, the company also has been working to stymie Masimo Corp.’s looming launch of its Freedom watch. Masimo, a maker of medical technologies, calls the Freedom “a more elegant smartwatch” that includes the patented blood-oxygen measurement technology at the heart of the long-running patent and trade secrets fight between the companies. Apple ramped up the rhetoric in its own pending patent-infringement suits against its smaller rival before the Federal Circuit denied Apple’s bid to pause enforcement of the US International Trade Commission’s late-October orders banning imports of Apple Watches that infringe Masimo patents while an appeal plays out. “With the Freedom, Masimo is directly targeting Apple’s customers,” the Cupertino, Calif-based company said in its Jan. 3 opposition to Masimo’s bid to pause a case that Apple filed in October 2022 in the US District Court for the District of Delaware. A redacted version was filed a week later. Masimo plans to broadly release the Freedom by this summer. Apple’s “tactical” two-pronged approach is evidence it’s “simultaneously trying to mitigate the impact of the ITC’s decision and subtly undermining Masimo’s market presence,” said Stacey Lee, a professor of practice in law and ethics at Johns Hopkins Carey Business School with a joint appointment at Johns Hopkins Bloomberg School of Public Health. The tech giant’s opposition to pausing the lawsuit “lays bare Apple’s unease about the Apple Watch facing a true competitor,” Lee said. The Freedom has the same medical-grade pulse oximeter as Masimo’s W1 watch, which the US Food and Drug Administration cleared last November for both prescription and over-the-counter use. The Freedom has already been released in a pre-market release program where users provide feedback in exchange for a discount. Masimo’s CEO, Joe Kiani, said the Freedom, “more elegant” than the W1, should be available under a limited-market release program this quarter, with a full-market release in the first half of 2024. The Freedom also has other typical smartwatch features, such as cell phone connectivity, messaging, music, and a hardware privacy switch. Angela McIntyre, executive director of Stanford University’s Wearable Electronics Initiative, said the legal actions “seem typical of tech companies” but “have little to do with the market for wearables.” Apple noted that Kiani said in an August 2022 earnings call that the Freedom “should command 100% market share.” That’s reason enough for the court to deny Masimo’s request to pause Apple’s lawsuit while administrative challenges to several patents’ validity proceed, Apple argued. “Delaying resolution of Apple’s infringement claims will allow Masimo an opportunity to gain customers and build brand awareness on the back of Apple’s patented technology,” the filing said. At trial, Apple said, it would show that Masimo is the true culprit and “should not be permitted to publicly pitch its unfounded, one-sided narrative while delaying adjudication of Apple’s claims showing that the opposite is true.” Apple’s emphasis on the accolades its devices’ health-related features have received from the medical community, Lee said, shows it isn’t just defending its products, but rather is “underscoring the strategic importance of these innovations in maintaining market supremacy.” “This narrative isn’t just a defensive legal maneuver,” Lee said. It’s “a reflection of Apple’s deeper concerns about preserving its edge in a health-tech market that’s evolving at a breakneck pace.” She called Masimo’s entry as a potential Apple Watch challenger “significant.” Apple’s filing “isn’t out of left field; it’s a consistent part” of Apple’s “playbook—aggressively protecting their market territory” through legal means. Apple brought two patent infringement suits against Masimo in Delaware federal court: one centered on design patents and one on utility patents. Masimo denied the allegations and lodged counterclaims in both cases, accusing Apple of antitrust violations, false advertising, deceptive trade practices, unfair competition, and patent infringement by the Apple Watch. The counterclaims in the utility patents case, which Apple denies, were put on hold in January 2023 because they involve five patents Masimo also asserted in its ITC case. Masimo’s request to lift the stay as to three of the patents that weren’t part of the ITC’s decision and aren’t at issue in Apple’s appeal is pending. The two companies are also dueling at the US Patent and Trademark Office’s Patent Trial and Appeal Board, where Masimo challenged the validity of four of Apple’s six utility patents. On Dec. 20, Masimo asked the Delaware court to pause that suit until the PTAB issues its decisions. Apple responded earlier this month, urging the district court to “reject Masimo’s attempt to create separate tracks for overlapping claims.” A trial would likely occur “months before” the PTAB rules on the patents’ validity, Apple said—the board’s first decision isn’t due until Sept. 20, and the last on Oct. 16. Those dates don’t account for potentially lengthy appeals. The utility-patents case, Apple argued, is at a late stage, so it would be harmed by a stay “because of the unique circumstances of this case.” Apple said “allowing Masimo to gain a foothold in the marketplace with an infringing product while Apple’s claims are potentially stayed for years through appeals will irreparably harm Apple.” Masimo, it said, “is already engaging in a negative public relations campaign against Apple to promote the Freedom.” “This case is not at ‘an efficient stopping point,’ as Masimo asserts,” Apple said. “This case will not stop. Rather, the case, including potentially claims that Masimo told the court ‘arise from the same transaction or occurrence’ as Apple’s utility patent claims, will proceed.” Apple “made false claims that Masimo somehow copied Apple’s technology,” Kiani, the Masimo CEO, said in supporting his company’s opposition to Apple’s emergency motion to stay enforcement of the ITC’s import ban. “Masimo would never copy Apple’s poorly performing product or release such a product to the public.” Kiani said he “essentially bet the company” on the Apple dispute, which he said has cost Masimo about $100 million. The sprawling legal fight is largely centered on pulse-oximetry technology, and the rivals have clashed at the ITC, the PTAB, the US Court of Appeals for the Federal Circuit, and in Delaware and California federal courts. Apple’s efforts to mitigate damage from the ITC ban also pulled a US customs agency into the mix. “Apple—even though they took my people, they took our property, they took our patents—their product is horrible,” Kiani said during a Jan. 17 videoconference hosted by an inventors’ advocacy group hours after the Federal Circuit rejected Apple’s request to halt the import ban while the appeal is ongoing. He also said that although he doesn’t want to work with Apple at this point, “it may be better for everybody if we could help them improve their product.” The olive branches he said he’s offered haven’t resolved the dispute. Three of Apple’s asserted utility patents cover a wearable electronic device and expire in September 2035, Bloomberg Law estimates. Another is related to an embedded heart-rate monitor and also is at issue in Apple’s California federal case against AliveCor—claims regarding that patent, estimated to expire in April 2029, were stayed pending a PTAB validity review. A fifth covers “devices, methods, and graphical user interfaces for accessing notifications” and is estimated to expire in September 2037. The case’s other patent covers a wearable device “for sensing biological parameters” and has the latest estimated expiration of the six: August 2038. “I don’t see it as mere legal posturing or brinkmanship,” Lee, the Johns Hopkins professor, said of Apple’s arguments. “I think it’s a calculated strategy by Apple to shield its market share and uphold its reputation in a sector where they’ve not only participated but have been trailblazers.” The Johns Hopkins Bloomberg School of Public Health is supported by Michael Bloomberg. Bloomberg Law is operated by entities controlled by Michael Bloomberg. Potter Anderson & Corroon LLP, Desmarais LLP, and Wilmer Cutler Pickering Hale & Dorr LLP represent Apple. Phillips, McLaughlin & Hall PA and Knobbe Martens represents Masimo, codefendant Sound United, and counterclaimant Cercacor Laboratories. The cases are Apple Inc. v. Masimo Corp., D. Del., No. 22-cv-1377; and Apple Inc. v. Masimo Corp., D. Del., No. 22-cv-1378, redacted version of Apple opposition to Masimo stay request filed 1/10/24. To contact the reporter on this story: Christopher Yasiejko in Philadelphia at cyasiejko@bloombergindustry.com To contact the editors responsible for this story: Adam M. Taylor at ataylor@bloombergindustry.com; James Arkin at jarkin@bloombergindustry.com AI-powered legal analytics, workflow tools and premium legal & business news. Log in to keep reading or access research tools. "
}