{
    "title": null,
    "date": "2/9/2024",
    "url": "https://wccftech.com/ex-apple-engineer-stole-car-secrets-get-jailed-and-fined/",
    "text": "Apple has been working on its autonomous car dubbed ‘Project Titan’ for several years, and to date, there is little information on what the company’s true motives are for its continued work in this area. However, given the extremely secretive nature of the project, we continue to hear varying reports, suggesting that concrete information has yet to be divulged. Unfortunately, employees who were also working on this project needed to exercise caution, with one former engineer completely missing the memo and ending up stealing trade secrets. Well, the law caught up to him, and according to the latest report, he will be spending a small amount of time in prison while also being forced to pay a hefty fine. Xiaolang Zhang had previously stolen a 25-page schematic of a circuit board belonging to an unnamed autonomous vehicle back in 2018. Initially, the ex-Apple engineer pled not guilty but ultimately made a plea agreement with the U.S. government in 2022. With Zhang’s sentence now completed, he will be serving 120 days in prison and will be placed on probation for three years. In addition, he has to pay an agreed restitution sum of $146,984. “Defendant is sentenced to 120 days as to Count One of the Indictment (ECF No. 5, filed July 12, 2018). Defendant is committed to the Bureau of Prisons to be imprisoned for said term. Upon release from imprisonment, the Defendant shall serve a term of 3 years supervised release as to Count One of the Indictment. The Court adopts the Probation Officer’s recommendations as to the standard and special conditions of supervised release. A special assessment fee of $100.00 is imposed. The Court imposes no fine. The Court Orders restitution in the agreed amount of $146,984.00. The Court further adopts the restitution payment schedules as recommended by the Probation Officer.” Initially, AppleInsider reported that Zhang was facing 10 years in prison, along with a $250,000 fine. Fortunately for him, his sentence was reduced. After working on ‘Project Titan,’ Zhang informed Apple that we would be relocating to China to take care of his sick mother and work for a car maker called XMotors. His plan did not bear fruit as authorities intercepted him at the San Jose International Airport while attempting to board a flight to Beijing. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}