{
    "title": "EU regulators questioned Apple on its web app change",
    "date": "2/27/2024",
    "url": "https://qz.com/emails/daily-brief/1851288088/apple-vexes-eu-regulators",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Good morning, Quartz readers! EU regulators questioned Apple on its web app change. The European Commission is investigating why the iPhone maker dropped these apps, which allow developers to bypass Apple’s App store and associated fees, from the homescreen. Ant outbid Citadel Securities for Credit Suisse’s China venture. The move will most certainly draw close regulatory scrutiny because China wants a foreign buyer. The U.S. Federal Aviation Administration handed down a blistering Boeing report. The agency said the airplane maker doesn’t live up to its own safety promises. A revamped Google Gemini AI generator is a few weeks away. The service was partially suspended last week for historically inaccurate photos the company called “embarrassing and wrong.” Kroger irked the Feds with its bid for Albertsons. U.S. regulators sued to block the mega $24.6 billion grocery chain merger on antitrust concerns. “The top 10 companies in the S&P 500 today are more overvalued than the top 10 companies were during the tech bubble in the mid-1990s.” — Torsten Sløk, chief economist at Apollo Global Management, wrote in a Feb. 25 blog post. Sløk’s warning comes after chipmaking powerhouse Nvidia became the first company in the semiconductor industry to reach a $2 trillion market valuation last Friday. But not all analysts agree that we’re going to relive Y2K except in our questionable fashion choices. Here’s what they’re saying. Intuitive Machines made history last week when it became the first private company in the U.S. to land on the Moon. Investors gleefully responded, launching the company’s stock up 33%. But everything changed when Intuitive said that its lander Odysseus had fallen on its side — one small tip for a lunar lander, one big dip for all of its parent company’s market gains. But why is the company’s stock so vulnerable to ups and downs in the first place? It comes down to how many shares are available to trade, and it’s not that much! It’s unfortunate when a company drives shareholder value — in reverse. That’s what Avis Budget Group, the umbrella for both Avis and Budget car rental companies, has done to the stake of its largest investor, the hedge fund SRS Investment Management. What happened? Quartz’s Melvin Backman explains. 🛏️ A BP exec’s husband eavesdropped and made almost $2 million on insider trading 🐭 Disney should get in on AI and double its stock price, activist investor says 🇫🇷 Microsoft is partnering with OpenAI’s French rival 🤖 Taiwan’s premier AI chipmaker is heading to Japan amid the U.S.-China chip wars 💉 There might be a weight loss drug competitor to Ozempic — and the company’s stock is soaring 🤔 Tesla’s Chinese rival BYD wants to corner the EV market with a new $230,000 supercar Last year was an abysmal one for women in film. Barbie was an anomaly among 2023’s top-grossing films, which featured as many women in leading roles as there were in 2010. A key element of life was likely around even when Earth was young. The chemical, pantetheine, is found in every organism. More songs were released on floppy disks in 2020 than those documented in the 80s, 90s, and 00s combined. The format’s limit (only short songs can fit) excites artists. Vanilla chocolate chip ice cream is losing fans. It’s not even in the top 10 flavors that U.S. shoppers reach for. A Trader Joe’s announcement got the wrong Springfield really amped. The Missouri city has been asking for a TJs for years, but the chain chose its twin in Virginia instead. Did you know we have two premium weekend emails, too? One gives you analysis on the week’s news, and one provides the best reads from Quartz and elsewhere to get your week started right. Become a member or give membership as a gift! Our best wishes for a productive day. Send any news, comments, prehistoric pantetheine, and vanilla chocolate chip ice cream to talk@qz.com. Today’s Daily Brief was brought to you by Morgan Haefner. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}