{
    "title": "Apple Vision Pro on sale in Russia despite the company no longer exporting \nto the country — third-party resale store ...",
    "date": "2/22/2024",
    "url": "https://www.imore.com/vision-pro/apple-vision-pro-on-sale-in-russia-despite-the-company-no-longer-exporting-to-the-country-third-party-resale-store-offers-demos-and-purchases-on-apples-most-exclusive-product",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Apple Vision Pro's Russian holiday. The Apple Vision Pro is the hottest tech product in the world right now and is only available officially in the U.S. However, at least one third-party store in Russia is offering the mixed-reality headset for over $6,000, despite Apple no longer exporting to the country following the invasion of Ukraine. Apple hasn’t sold in Russia since the conflict broke out in March 2022, now, almost two years later, shops located near the Kremlin are selling Apple Vision Pro. The Apple Vision Pro isn’t available in Europe yet, but a former official Apple reseller has got its hands on the headset and is offering the product for huge amounts over the retail price. CNBC surveyed Russian websites and tech blogs which showed that Apple products are still readily available in the country despite Apple’s strict stance on removing all products from sale. According to CNBC, on the ground in Moscow, Apple products including its best MacBooks, iPhones, and iPads are available in stores, although prices may be higher than they were pre-invasion. The Russian version of Apple’s tech support website is still active, but the official Apple Store website is offline, displaying a message in Russian saying, “The Apple Store is currently closed.” In Moscow, a retail store called re:Store is offering the Vision Pro for around $6,307, which is over 50% higher than Apple’s $3,499 retail price in the U.S. That said, we’d expect any store that has imported Apple Vision Pro anywhere in Europe to offer the product at ridiculous prices. Russian blogger “Romance768” has already unboxed the Vision Pro to his 1 million followers online and has spoken with CNBC to give a clearer indication of Apple’s availability in the country. He explains that one of his team placed an order in New York and brought the headset back to Moscow within a day. Importing Apple Vision Pro was the cheapest and quickest way for the blogger to bring the product back to get a timely unboxing online. That said, he explains that all Apple products are still available in Russia, even if not officially, “Officially, Apple does not sell anything in Russia. Russian companies buy equipment in other countries and bring it to their stores. This has led to a huge increase in prices. So Vision Pro in Moscow costs not $3,500 but $5,000.” iMore offers spot-on advice and guidance from our team of experts, with decades of Apple device experience to lean on. Learn more with iMore! As for the rest of us in Europe, we’re waiting with bated breath to receive Apple Vision Pro, hopefully, Apple’s official pricing across the Atlantic isn’t as outlandish as these Russian third-party sellers. John-Anthony Disotto is the How To Editor of iMore, ensuring you can get the most from your Apple products and helping fix things when your technology isn’t behaving itself.\n\nLiving in Scotland, where he worked for Apple as a technician focused on iOS and iPhone repairs at the Genius Bar, John-Anthony has used the Apple ecosystem for over a decade and prides himself in his ability to complete his Apple Watch activity rings.\n\nJohn-Anthony has previously worked in editorial for collectable TCG websites and graduated from The University of Strathclyde where he won the Scottish Student Journalism Award for Website of the Year as Editor-in-Chief of his university paper. He is also an avid film geek, having previously written film reviews and received the Edinburgh International Film Festival Student Critics award in 2019. \n\nJohn-Anthony also loves to tinker with other non-Apple technology and enjoys playing around with game emulation and Linux on his Steam Deck. In his spare time, John-Anthony can be found watching any sport under the sun from football to darts, taking the term “Lego house” far too literally as he runs out of space to display any more plastic bricks, or chilling on the couch with his French Bulldog, Kermit. Six things we want from Apple’s visionOS 2 and what we know about it so far Apple Vision Pro support for the Apple Pencil is reportedly in testing ahead of WWDC's visionOS 2 preview Here's your first look at installing apps in the EU on iPhone without the App Store — prolific emulator developer reveals AltStore interface By Oliver HaslamMarch 27, 2024 By Daryl BaxterMarch 27, 2024 By Oliver HaslamMarch 27, 2024 By Oliver HaslamMarch 27, 2024 By Stephen WarwickMarch 27, 2024 By James BentleyMarch 27, 2024 By Daryl BaxterMarch 27, 2024 By Oliver HaslamMarch 27, 2024 By Stephen WarwickMarch 27, 2024 By James BentleyMarch 27, 2024 By Stephen WarwickMarch 27, 2024 iMore is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}