{
    "title": "Apple Divides OLED Display Production Between LG And Samsung For 13-Inch \nAnd 11-Inch iPad Pro Models, Respectively",
    "date": "2/23/2024",
    "url": "https://wccftech.com/apple-oled-ipad-pro-display-production-division-between-lg-and-samsung/",
    "text": "Apple is expected to launch the new iPad Pro models by the end of next month, with a boatload of front-facing changes. The company is reported to bring notable improvements in design and form factor as the devices are slated to get slightly bigger but thinner. However, the OLED display will potentially be the highlight of the upgrade. It is now being reported that the OLED display production for the forthcoming iPad Pro models will be divided between LG and Samsung for the 13-inch and 11-inch models, respectively. According to a new report shared by The Elec, Apple will rely on two suppliers to produce OLED displays for the upcoming iPad Pro models. While Samsung will exclusively produce 11-inch panels, LG will be responsible for providing 13-inch panels to Apple. The report also mentions that Samsung has secured initial orders of the 11-inch OLED display for the iPad Pro. At this time, each company will cater to a different OLED size for the iPad Pro, despite LG's ambition to begin production of 11-inch displays as well. Apple's decision to divide OLED panel production for the iPad Pro between two suppliers could be to tackle potential yield issues and production capacity constraints. If Apple does not divide the display production of the OLED panels, the suppliers will not be able to meet the company's quality requirements. Henceforth, both suppliers can now focus on their share with a streamlined method to deliver the best yield. It was recently rumored that Apple plans to make the iPad Pro models a lot thinner than the current models. With that said, the company aims to shave off a few millimeters with the help of slimmer OLED panels. This is an additional benefit of the OLED displays, besides an unparalleled image quality compared to the competition. The 11-inch iPad Pro will reportedly be 5.1mm thin, while the bigger 13-inch variant will be 5mm thin. Note that Apple's division could change in the future depending on the production capacity, quality, and yield of the OLED panels from Samsung and LG. Henceforth, how the company adjusts orders after the first batch remains to be seen. The iPad Pro is facing an annual decline in sales, and the company has potentially cut down its orders to 8 million from 10 million for this year. As mentioned, Apple is expected to launch the OLED iPad Pro models by the end of next month. Other than the display, the company could offer slimmer bezels on the device and potential new use cases. For instance, it was previously rumored that the devices will be equipped with MagSafe technology. The company could also surprise us at launch with new additions as well. We will share additional details on the product as soon as further information is available. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}