{
    "title": "Apple iPhone revenue reaches $69.7 billion in December quarter, up 6%",
    "date": "2/2/2024",
    "url": "https://www.zeebiz.com/companies/news-Apple-iPhone-revenue-reaches-%2469.7-billion-in-December-quarter-up-6-%25-274561",
    "text": "Apple has registered $69.7 billion revenue for iPhones in the December quarter of 2023, a 6 per cent growth year-over-year. The company set all-time records in several countries and regions, including Latin America, Western Europe, the Middle East, and Korea, as well as December quarter records in India and Indonesia. “Our iPhone active install base grew to a new all-time high, and we had an all-time record number of iPhone upgraders during the quarter,” said Luca Maestri, Apple CFO. According to a survey from Kantar, iPhones were four out of the top five models in the U.S. and Japan, four out of the top six models in urban China and the UK, and all top five models in Australia. Apple services revenue also set an all-time record of $23.1 billion, up 11 per cent year-over-year. “We're very pleased with our services performance in both developed and emerging markets, with all-time revenue records in the Americas, Europe, and rest of Asia-Pacific,” said Maestri. Mac generated revenue of $7.8 billion and returned to growth, despite one less week of sales this year. “Customer response to our latest iMac and MacBook Pro models powered by the M3 chips has been great and our Mac install base reached an all-time high, with almost half of Mac buyers during the quarter being new to the product,” said the company. iPad was $7 billion in revenue, down 25 per cent year over year. “iPad faced a difficult compare, because during the December quarter last year, we launched the new iPad Pro and iPad 10th generation, and we had an extra week of sales,” said Maestri. Wearables, Home and Accessories revenue was $12 billion, down 11 per cent year over year due to a challenging launch compare and the extra week a year ago. With the upcoming launch of Apple Vision Pro, the company is seeing strong excitement in enterprise. “Leading organisations across many industries, such as Walmart, Nike, Vanguard, Striker, Bloomberg and SAP have started leveraging and investing in Apple Vision Pro as the new platform to bring innovative spatial computing experiences to their customers and employees,” said the company. LATEST NEWS "
}