{
    "title": "SoftBank AI Fund?; Currys Bidding War; Apple Fined",
    "date": "2/20/2024",
    "url": "https://www.cmcmarkets.com/en-au/opto/softbank-ai-fund-currys-bidding-war-apple-fined",
    "text": "5 Top Stories By OPTO  20 Feb 2024, 03:45 Every day, we handpick the 5 Top Stories stock market investors need to know. In 5 minutes, you’ll learn the stocks, CEOs, and money managers moving markets. Shares in Tokyo’s SoftBank Group [9984:T] hopped as much as 3.2% after Bloomberg reported that founder Masayoshi Son is weighing a $100bn artificial intelligence (AI) chip venture. Code-named Izanagi, it would work alongside Arm [ARM], which is majority-owned by SoftBank, and compete with Nvidia [NVDA]. An investment of that scale would represent some 20% of the global semiconductor market. E-commerce titan JD.com [JD] has confirmed that it is in the early stages of a possible cash bid for UK firm Currys [CURY:L]; the UK electronics retailer rejected a £700m offer from Elliott Investment Management over the weekend. Currys has attracted interest of late, following a three-year bad spell that saw the firm lose 60% of its value. Its share price jumped as much as 38% on the news. The Cupertino company [AAPL] is facing a fine of some €500m from the EU, over allegations that it supressed other music-streaming services, including Spotify [SPOT], across its platforms. Elsewhere, Apple’s Vision Pro has met with a mixed response, with some customers returning their $3,500 headsets, citing complaints about its size and weight, as well as issues with the interface, Bloomberg reported. Having hit an all-time high last week, Nintendo [7974:T] fell by up to 8.8% — its biggest intraday drop since October 2021 — on news the Kyoto-based game maker is to push back the release of the next generation of its Switch console until the start of 2025. It had initially been slated for release in the Q4 of this year. The share price eventually pared its losses to a 5.8% decline for the day Monday. The Chinese electric vehicle (EV) leader [1211:HK] has launched a new, cheaper version of its plug-in hybrid sedan, the Qin Plus DM-i. The company has also said it is going to launch several “high-end luxury” models this year. Elsewhere, Chinese EV maker Human Horizons Group, manufacturer of the premium HiPhi brand, has suspended operations for at least six months. Continue reading for FREE Error! Please try submitting again. Success! You have successfully signed up. Latest articles 5 Top Stories TSMC Record High; Nvidia AI Investments; Microsoft AI Boost Chipmaker Taiwan Semiconductor Manufacturing Co. added some $42bn to its market value on Thursday. 15 Feb 2024 Analysis “A Real Dangerous Cocktail” — Adam Taggart on AI Adam Taggart, CEO and Founder of Thoughtful Money, discusses the societal dangers associated with artificial intelligence. 15 Feb 2024 5 Top Stories PS5 in Decline; Nvidia Trumps Amazon; Waymo Recall “Looking ahead, PS5 will enter the latter stage of its life cycle,” said Senior Vice President Naomi Matsuoka during Sony’s earnings call on Wednesday. 14 Feb 2024 5 Top Stories Temu Splashes Out; SoftBank Soars; Paytm On the Brink? PDD-owned e-commerce app Temu splashed some serious cash on advertisements during Sunday’s Super Bowl in the US. 13 Feb 2024 © 2024 CMC Markets Investing in CMC Markets derivative products carries significant risks and is not suitable for all investors. You do not own, or have any interest in, the underlying assets. We recommend that you seek independent advice and ensure you fully understand the risks involved before trading. Spreads may widen dependent on liquidity and market volatility. The information on this website is prepared without considering your objectives, financial situation or needs. Consequently, you should consider the information in light of your objectives, financial situation and needs. CMC Markets Asia Pacific Pty Ltd ABN 11 100 058 213, AFSL No. 238054 (the derivative product issuer), CMC Markets Stockbroking Limited, Participant of the ASX Group (Australian Securities Exchange) and SSX (Sydney Stock Exchange) and Chi-X (Chi-X Australia), ABN 69 081 002 851, AFSL No. 246381 (the stockbroking services provider) provides the financial products and/or services. It's important for you to consider the relevant Terms and Conditions, Product Disclosure Statement ('PDS') and any other relevant CMC Markets Documents before you decide whether or not to acquire any of the financial products. Our Financial Services Guide contains details of our fees and charges. All of these documents are available at cmcmarkets.com.au or you can call us on 1300 303 888. Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. Android is a trademark of Google Inc. "
}