{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.statista.com/statistics/654450/annual-apple-app-store-ios-developer-payout/",
    "text": "Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Insights on consumer attitudes and behavior worldwide Business information on 100m+ public and private companies Explore Company Insights Detailed information for 39,000+ online stores and marketplaces Directly accessible data for 170 industries from 150+ countries\n                    and over 1 Mio. facts. Customized Research & Analysis projects: Get quick analyses with our professional research service The best of the best: the portal for top lists & rankings: Transforming data into design: Statista Content & Design Strategy and business building for the data-driven economy: Additional Information Show sources information\n                            \n                                Show publisher information\n                            \n                                Use Ask Statista Research Service January 2023 Worldwide 2015 to 2022 2019¹ Estimate, 2019 data was calculated by Statista on the basis of a January 2020 Apple press release: \"Since the App Store launched in 2008, developers have earned over $155 billion, with a quarter of those earnings coming from the past year alone.\"\r\n\r\n2020² Estimate, 2020 data data was calculated by Statista on the basis of a January 2020 Apple press release: \"Since the App Store launched in 2008, developers have earned over $155 billion\"; and on the basis of a January 2021 Apple press release: \" [...]developers selling digital goods and services [...] have now earned more than $200 billion since the App Store launched in 2008.\"\r\n\r\n2021³ Estimate, 2021 data data was calculated by Statista on the basis of a January 2021 Apple press release: \"[...]developers selling digital goods and services [...] have now earned more than $200 billion since the App Store launched in 2008.\"; and on the basis of a January 2022 Apple press release: \" [...]developers selling digital goods and services earning more than $260 billion since the App Store launched in 2008\"\r\n\r\n2022⁴ Estimate, 2022 data data was calculated by Statista on the basis of a January 2022 Apple press release: \" [...]developers selling digital goods and services earning more than $260 billion since the App Store launched in 2008\",   and on the basis of a January 2023 Apple press release: \"Developers selling digital goods and services on the App Store have earned more than $320 billion since the platform’s 2008 launch.\" Mobile Internet & Apps Apple App Store: average app price 2024 Video Gaming & eSports Google Play: number of available gaming apps as of Q3 2022 Mobile Internet & Apps Distribution of free and paid Android apps 2019-2024 Mobile Internet & Apps Average price of paid Android apps 2024 You only have access to basic statistics.  Business Solutions including all features.  Overview User acquisition, retention, and conversion App monetization App stores App publishers Mobile gaming Spotlight: subscription apps Further related statistics "
}