{
    "title": "iOS design startup Play lets devs share app prototypes easily via App Clips",
    "date": "2/14/2024",
    "url": "https://techcrunch.com/2024/02/14/ios-design-startup-play-lets-devs-share-app-prototypes-easily-via-app-clips/",
    "text": "Apple introduced App Clips in 2020 with iOS 14. The idea was to let developers share a part of their app with users, who can experience the functionality of an app without installing a full version. Native iOS design app Play has launched an interesting new feature — it lets developers share prototypes of their apps easily through App Clips (like this one). The company’s co-founder and co-CEO Dan LaCivita told TechCrunch over a call that designers and developers face a problem when it comes to sharing prototypes with their team or users. “If I am developing an app, and I want to share a prototype that someone can experience on their phone, they either need to see a video, try a web simulation or install another app. Because we are a native design tool, we can leverage all of Apple’s system elements to give a full experience of using an app through a prototype,” LaCivita said about including App Clip functionality in Play. Its finally here—a breakthrough way to share native iOS prototypes. You can now share native prototypes with Apple App Clips—the easiest, fastest, highest quality way for people to experience your work instantly on their iPhone. No web simulations. No app installs. No friction.… pic.twitter.com/Uw2alpngRo — Play (@createwithplay) February 6, 2024  He said that some of the above-mentioned methods might not communicate the developer’s intent behind a feature or a function properly. But App Clip does a much better job. LaCivita thinks that this will make the feedback loop quicker for app makers. Users can scan a QR code of an App Clip, tap on an NFC-enabled surface or click on a link to experience App Clip on their iPhones. Apple has made some changes to the App Clips as a medium over the year after first introducing them in 2020. The company has gradually increased the App Clip size limit from 10MB to 15MB and now 50MB. Last year, at WWDC, the company also introduced a way for developers to invoke App Clips from within another app. For instance, someone can place a food order directly from a message or a map app through an App Clip. Despite these feature additions, it’s not clear how developers are adopting App Clips for testing or demos. In June 2022, during a podcast, former Apple marketing exec Wiley Hodges said that App Clips didn’t take off initially because they were launched in the middle of the pandemic. “We had the misfortune to launch App Clips in the middle of the pandemic which drove more people indoor. And these kinds of in-the-moment and on-the-go experiences were not on top of mind for a lot of people. Developers told us that we are waiting a little while [to adopt App Clips] because everyone is inside,” he said. As AppleInsider pointed out in December 2022, App Clips also faces the problem of discoverability as developers need to work hard to make them apparent to users. Play last announced $9.1 million in funding led by First Round Capital and Oceans Ventures in 2021. The company said it has picked up $5.5 million in a seed extension at the beginning of 2023. M13 led the round with participation from First Round Capital, Cursor Capital (run by former Figma exec Badrul Farooqi) and Irregular Expressions. Since raising its last round, the company has launched a Mac client, so designers can work with iOS elements on a desktop and the data is synced across the devices. Developers can also generate SwiftUI code to lay out views in Xcode. Image Credits: Play Image Credits: Play The company has also launched team and individual tiers, with thousands of active users across all levels, with plans to launch an enterprise-specific tier soon. This year, the startup is going to launch the ability to design more complex interactions for developers. Additionally, Play is planning to launch a community library where users can share what they have worked on. LaCivita said that Play might explore design tools for surfaces like Apple Watch or Mac in the future, but it is currently focusing on iOS development. "
}