{
    "title": "Tablet Sales Decline by 10% in 2023, Apple Remains the Leader",
    "date": "2/6/2024",
    "url": "https://www.gizchina.com/2024/02/06/tablet-sales/",
    "text": "The tablet market experienced a 10% decline in sales during 2023 compared to the previous year, as revealed by the latest data from Canalys. The total tablet sales for the year amounted to 135.3 million units. Despite this downturn, Apple maintained its leadership position with an impressive 40% market share, driven by the shipment of 54 million tablets.  Apple‘s market share remained relatively stable, standing at 40% in 2023, compared to 40.4% in 2022. Similarly, Samsung, holding the second position, recorded 25.6 million shipments, securing a 19% market share, a marginal decrease from the 19.3% it held in the previous year. Lenovo claimed the third spot with 9.3 million sales. Representing a 6.9% market share, a slight decline from its 7.7% share in 2022. Following closely, Huawei achieved 8.3 million shipments, securing a 6.1% market share. Amazon, with 7.7 million tablets sold, held a 5.8% share. Notably, Amazon witnessed the most significant decline in market share, dropping from 9.1% in 2022, while Huawei was the only brand in the top five to experience growth, rising from 4.2% market share in 2022.  In the fourth quarter of 2023, Huawei surpassed Lenovo to claim the third position. While Apple continued to dominate with 14.8 million devices sold, capturing a 39.2% market share. Samsung followed with 6.8 million shipments, holding an 18% market share. Huawei sold 2.8 million units, Lenovo managed 2.6 million, and Amazon rounded up the top five with 2 million units. Comparing Q4 2023 to the same period in 2022, only Huawei and Lenovo exhibited growth. With increases of 95.4% and 14.9%, respectively. Apple’s sales declined by 24%, Samsung’s by 10%, and Amazon’s by 43.9%. Overall, the tablet market in Q4 witnessed an 11% decrease in sales, totaling 37.8 million units.  Canalys researchers attribute the sales growth in China and India, countering the prevailing stagnation in other regions. Notably, they anticipate a rebound in the tablet market in the coming year. Driven by healthier inventory levels and increased government and commercial deployments. Furthermore, the analysts predict a greater focus on foldable tablets in 2024. Despite their expected premium pricing, as the market explores new avenues for innovation. “The latest holiday season saw a significant surge in tablet promotions and bundled offers, but this wasn’t enough to reverse the market’s fortunes, “said Himani Mukka, Research Manager at Canalys. “Aggressive promotional strategies have been implemented globally to address longstanding elevated tablet inventories. In certain markets in Asia Pacific, for example, there have been instances of old tablet models being bundled with newly launched smartphones to expedite inventory clearance. With healthier inventory levels and further scope for government and commercial deployments, tablet sell-in is expected to rebound in 2024. New models announced by TCL and Lenovo at CES 2024 and anticipated updates to Apple’s iPad portfolio early this year will help provide a boost to the tablet refresh opportunity.” “The innovation gap between tablets and other personal computing devices is something for key tablet vendors to pay attention to”, said Kieren Jessop Analyst at Canalys. “Plans around on-device AI integration in tablets trail behind those in PCs and smartphones. Bringing this functionality across devices will be crucial for vendors aiming to deliver a unified and seamless experience on ecosystems. Elsewhere, this year will see a greater focus on foldable tablet form factors. Although shipment volumes will likely remain restricted due to the premium pricing of these models, they will provide an opportunity for vendors to showcase user-experiences benefits for content consumption, learning and productivity.” I'm the ANDROID & CUSTOM ROMs EXPERT of GizChina for the past 5 years. With an unwavering passion for all things tech and a love for exploring the limitless possibilities of Android devices, I'm thrilled to be part of this incredible community.     GizChina Follow @gizchina  Accredited technology blog dedicated to providing breaking news, expert reviews and original content related to mobile tech and EV industry, smartphones, gadgets and IoT. Keep up to date with the latest Android phone news and reviews on our social media channels: "
}