{
    "title": "Apple Vision Pro Launches with Blockchain-Based Metaverse Game – Next Big \nThing?",
    "date": "2/3/2024",
    "url": "https://cryptonews.com/news/apple-vision-pro-launches-with-blockchain-based-metaverse-game-next-big-thing.htm",
    "text": "Apple’s highly anticipated headset Vision Pro has an upcoming metaverse app from a blockchain-related company. Victoria VR, a crypto-meets-virtual reality (VR) developer, aims to offer an immersive metaverse experience with ultra-realistic graphics, complementing the advanced technologies of the Apple headset. The app is scheduled for release in the second quarter of this year. The Victoria VR metaverse app will showcase the capabilities of the Apple Vision Pro while demonstrating the power of Web3 technology, according to a statement released by the company. The move marks Apple’s entry into the virtual reality ecosystem and positions Vision Pro as a competitor to Meta’s (formerly Facebook) Meta Quest headset. The Victoria VR metaverse is powered by the VR token, an Ethereum-based cryptocurrency following the ERC-20 standard. Active users and stakers of the VR token will be rewarded, with half of the revenue generated from in-game asset sales being redistributed to these participants. The VR token’s market cap stands at $103 million, and its value has surged by nearly 60% in the last 24 hours, as per data from CoinMarketCap. Victoria VR aims to create an inclusive environment accessible to all participants. The project emphasizes a “pay-to-speed” approach rather than a “pay-to-win” model, ensuring that users can earn VR tokens simply by participating in the metaverse. This launch comes at a time when interest in the metaverse has been gaining momentum, with tech companies exploring opportunities in the space. By combining blockchain technology with virtual reality, Victoria VR aims to offer a unique and engaging metaverse experience on the Apple Vision Pro headset. As the metaverse continues to evolve and attract attention, the release of the Victoria VR metaverse app on Apple Vision Pro could be a significant development in the intersection of blockchain and VR. Meta subsidiary Reality Labs, which focuses on the development of the metaverse, recorded a significant operating loss of over $4.6 billion in the fourth quarter of 2023. In its fourth-quarter report, released on February 1, Meta revealed that Reality Labs reported a loss of $4.65 billion during Q4, while generating nearly $1.1 billion in revenue. This operating loss marks the largest quarterly loss for Reality Labs since Meta began including the division’s financials in its reporting during the fourth quarter of 2020. In 2023, Reality Labs’ total revenues amounted to just under $1.9 billion, with more than half of the annual revenue generated in the fourth quarter, primarily driven by the release of the Meta Quest 3. The total operating loss for 2023 reached $16.1 billion, representing a 17.5% year-on-year increase from 2022. The metaverse has been a topic of intense debate in the tech world, with some industry leaders like Bill Gates expressing a tepid outlook. The gloomy outlook regarding the metaverse is not entirely out of the norm, particularly since many big supporters of the idea have recently backed down from their ambitions. For one, entertainment giant Disney announced last year that it is eliminating its metaverse division as part of broader layoffs that will impact as many as 7,000 employees. A quick 3min read about today's crypto news! A quick 3min read about today's crypto news! The information on this website is for educational purposes only, and investing carries risks. Always do your research before investing, and be prepared for potential losses. 18+ and Gambling: Online gambling rules vary by country; please follow them. This website provides entertainment content, and using it means you accept out terms. We may include partnership links, but they don't affect our ratings or recommendations. Crypto promotions on this site do not comply with the UK Financial Promotions Regime and are not intended for UK consumers. "
}