{
    "title": "Meta platforms imposes apple service fee on boosted posts",
    "date": "2/16/2024",
    "url": "https://minutemirror.com.pk/meta-platforms-imposes-apple-service-fee-on-boosted-posts-188979/",
    "text": "Sign up to be the first to hear about latest news & updates!   Meta Platforms, the parent company of Facebook and Instagram announced that users opting to boost their posts on the iOS versions of these social media apps will now face an additional 30% service charge imposed by Apple. This decision comes in line with Apple’s updated App Store guidelines introduced in 2022 indicating a shift in how advertising fees are handled within iOS apps. Meta Platforms clarified that advertisers can still boost content on Instagram and Facebook through a browser without incurring the Apple service charges. Starting this month, Meta will implement the changes in the United States with plans to extend the fee to other markets later in the year. The move raises questions about the potential impact on businesses and whether this additional charge will affect their advertising strategies. A Meta spokesperson refrained from commenting on the potential material impact of this change but emphasized the company’s commitment to complying with Apple’s guidelines. In a statement, Meta acknowledged the dilemma stating, “We do not want to remove the ability to boost posts, as this would hurt small businesses by making the feature less discoverable and potentially deprive them of a valuable way to promote their business.” Under the revised system, advertisers boosting posts on iOS will now be billed directly by Apple bypassing Meta’s billing system. Additionally, payment will be required in advance altering the previous practice of settling payments after the ads have run. Boosted posts are a popular product offered by Meta allowing businesses to enhance the visibility of their content on Facebook or Instagram without the need for a full-fledged campaign through Ads Manager, Meta’s comprehensive advertising tool. In response to these changes, Apple defended the imposition of the service fee stating that boosting is a digital service making In-App Purchase necessary. However, Apple clarified that Meta customers can still use a separate standalone app named “Meta Ads Manager” to pay for their ad campaigns without incurring commissions to Apple as this app falls under an exemption for advertising campaign management apps. As businesses navigate this shift in the advertising landscape, it remains to be seen how this new fee structure will influence marketing strategies and whether advertisers will explore alternative avenues to minimize costs in the evolving digital advertising space. Minute Mirror is providing news, investigative reports, articles and blogs at a faster speed, through its print and digital editions.  Mr Ali Sajjad founded Minute Mirror as an independent newspaper with the belief that journalism must be fact-based, and readers needed efficient and reliable coverage of topics shaping the fast-changing world around us. Sign up to be the first to hear about latest news & updates!    © Minutemirror | minutemirror.com.pk is a registered trademark. All rights reserved. Created by Clicktraces "
}