{
    "title": "The DOJ's blockbuster lawsuit against Apple boils down to long-running \nargument within tech",
    "date": "3/21/2024",
    "url": "https://finance.yahoo.com/news/doj-blockbuster-lawsuit-against-apple-022303481.html",
    "text": "The legal showdown between the U.S. Department of Justice and Apple, which kicked off on Thursday morning, puts the spotlight on a thorny question that’s as old as the tech industry itself: How much control should a company have over its own creation? From the early days of personal computers to later debates over open source versus proprietary software, walled garden social networks versus open platforms, and even the recent push for so-called right to repair laws, it’s an issue that has come up—in some form or another—time and time again. To hear the DOJ tell it, Apple has exercised excessive control over the iPhone, thereby limiting choices for consumers and protecting its profits. “This case is about freeing the smartphone market from Apple’s anticompetitive and exclusionary conduct and restoring competition to lower smartphone prices for consumers, reducing fees for developers, and preserving innovation for the future,” reads the introduction to the 88-page complaint filed by the DOJ. Apple, of course, sees things differently. A spokesperson for the tech giant told the Verge that it sets “a dangerous precedent, empowering government to take a heavy hand in designing people’s technology.” Indeed, the idea that Apple’s products “just work” has long been a central pillar of the company’s branding — consumers don’t need to know what a software driver is, or spend hours on the phone with tech support, to use an Apple product; just plug it in and have fun. The tightly scripted experience is the selling point. And the tight control that Apple exerts on the platform—in terms of the third-party apps it allows in its App store and the ability for third-party apps to access some of the iPhone's key functionality—has meant greater security and privacy for users in its castle. In Apple's last fiscal year, that approach helped the company generate $383 billion in revenue, inspiring Wall Street investors to bid Apple’s stock market value to $2.65 trillion. The iPhone, a product that will celebrate its 17th birthday in June, brought in $200 billion in revenue last year. “Apple's obsession with its customer experience leads it to control the experience tightly, make decisions on its customers' behalf, and maintain an ecosystem that consistently delivers on the experience the brand promises,” Dipanjan Chatterjee, an analyst at industry research firm Forrester, told Fortune. In essence, Chatterjee said, it’s a debate between whether users are better off with choice or curation. To show that the market is craving more choice, instead of Apple’s tightly chaperoned model, the DOJ and the 15 U.S. states and the District of Columbia that joined it in the lawsuit, will have to demonstrate that consumers have been harmed. That won’t be easy—not just because of the existence of an alternative, less rigidly controlled smartphone ecosystem based on Google’s Android software. “This is not timid litigation,” New York University law professor and antitrust expert Harry First said, noting that the government is “going after the heart of Apple's ecosystem and how Apple maintains control.” Among the elements of the iPhone that the government says Apple stifles consumer choice on are the cloud-based gaming apps, messaging apps, and digital wallets. Wisconsin Attorney General Josh Kaul, one of the states involved in the lawsuit, told Fortune in an interview that the Apple Wallet is a prime example of limited choice. “If consumers prefer it against other digital payment systems that’s fine, but what shouldn’t be happening is Apple preventing the use of alternatives that consumers may want to use but can’t.” Still, the idea that the government understands what consumers want better than a company like Apple is inherently tricky. And there’s no shortage of examples of government heavy handedness leading to inferior products. Steve Sinfosky, a former senior executive at Microsoft, pointed to the constraints imposed on the PC software giant following the DOJ’s antitrust case against it in the late 1990s and early 2000s. The biggest impact of the antitrust litigation, Sinosky tweeted Thursday, was to make Windows “worse for consumers.” Proving that Apple’s control harmed other companies might be easier. But here, antitrust experts like Northwestern University’s Kellogg School of Management professor Mark McCareins say, the government will need to come with the goods, like internal communications between Apple executives that show that the company’s conduct was exclusionary — that is, done without a legitimate business purpose such as improving the customer experience. “What documents and emails are unearthed in discovery by the DOJ will be critical,” said McCareins, who teaches courses on Antitrust and Competition. Sinofsky, the former Microsoft executive, echoed this sentiment in his tweet thread on Thursday: “If this ever goes to trial you can bet that this case will distill down to a single-digit number of emails (there were 3 memorable ones in the MS case, IMO) or worse internal chat posts or Messages.” So far, the internal emails highlighted in the complaint, while revealing, are not damning, according to many observers. As the case moves forward however and the government gets deeper access to Apple documents, it’s difficult to know what might emerge. While a “smoking gun” document would of course be a huge boon to the government’s case, the DOJ may see a benefit even if it only manages to expose a trove of less dispositive documents, according to the opinion of some observers. “They must know this case will be hard to win. Maybe they feel their best path to victory is creating a strong public atmosphere that Apple is not some noble, pro-consumer actor,” said Geoffrey Manne, president and founder of the International Center for Law and Economics, a Portland-based nonprofit research center. “A lot of these cases are about changing the public perception of these companies, which in turn deters the behavior.” This story was originally featured on Fortune.com Related Quotes "
}