{
    "title": null,
    "date": "3/29/2024",
    "url": "https://www.brownstoneresearch.com/bleeding-edge/the-decline-of-apple-in-the-age-of-ai/",
    "text": "Colin’s Note: At the beginning of this year, I published some bold predictions for 2024… Including the fall of Apple from its place as the world’s most valuable company. Back then, I warned that flagging sales and an inability to outpace its competitors in the age of artificial intelligence spelled trouble for the tech giant. The landscape of AI is changing. Over the past year and change, we’ve seen every company that even hinted that it might integrate AI into its operations get a boost thanks to the frenzy surrounding AI thanks to the success of industry heavy-hitters like Nvidia and Microsoft… But that isn’t the case anymore. It’s like I’ve been telling you, in the world of artificial intelligence… innovation is now the name of the game. And while that might’ve been what Apple was known for in 2007, it might be bad news for the Apple of today. Simply click below to access today’s video. Or, if you prefer to read, as usual, my team and I have provided a transcript, edited for flow. “Apple is beginning to look and feel like a tired giant rather than the innovator we’ve known for the past 30 years.” That was from our January 3 issue of The Bleeding Edge. At the time, Apple was still the most valuable company in the world. But things have gotten worse since then for the iPhone maker. Shares have fallen more than 10% this year alone. And the company could soon be worth less than Microsoft, Nvidia, Google, and Amazon. It’s beginning to feel like Apple has permanently lost its ability to innovate in a tech landscape that is constantly changing thanks to artificial intelligence (AI). What happened to Apple? And can the company regain its throne as the world’s most valuable company? Or will Apple end up like Blackberry as a once-dominant handset maker… only to be passed by? Let’s examine today on The Bleeding Edge. Since the iPhone launched in 2007, Apple shares have been steadily climbing, rewarding shareholders every step of the way. But over the past several years, each new iPhone release has been met with memes and jokes online about how it’s almost exactly the same as the year before. And the public is beginning to notice. Global shipments of smartphones have been steadily declining for many years. This has caused Apple’s sales to stagnate. As iPhone sales have fallen, Apple has aggressively moved into subscription and service revenue. This has brought in some high-margin sales and revenue, but it’s coming at a price… One that can dismantle Apple permanently. The company has relied on taxing every single dollar that flows through its ecosystem. From dating apps to video games, Apple collects as much as a 30% fee from these developers. And that has caused many application makers to strike back. Netflix, for example, doesn’t allow you to pay through its app to avoid paying this fee to Apple. Epic Games – the company behind the popular video game Fortnite – successfully took Apple to court. It is looking to permanently change the way Apple can collect these fees from app makers. I expect a positive impact for dating companies like Match Group and Bumble. Both could see meaningful increases in their revenue with Apple’s fees potentially being slashed. With stalling iPhone tablet and computer sales, a loss of high-margin service revenue could bring shares of Apple down even further. Potentially more alarming to Apple than the loss of this App Store taxation is the fact that AI is going to change how we interact with our devices forever. Just like how Apple changed the game in 2007 with the iPhone, AI is set to do the same with communication devices going forward. We’re already seeing early devices gain traction. The Rabbit R1 has pre-sold about 100,000 units and they are set to ship later this month. The device relies exclusively on AI to handle tasks such as hailing an Uber or listening to music. Other similar devices will come to market as well, and one in particular could be a game changer. For months there have been rumors that a former Apple superstar designer responsible for virtually every Apple product over the past two decades has been working with OpenAI on a communications device… That’s right, Johnny Ives’ design firm in San Francisco is rumored to be working with OpenAI on a device that could operate similarly to the Rabbit R1. One would think Apple could respond with its own AI device. It remains to be seen if it can. But last week, we received some disturbing rumors that Apple is considering partnering with Google or OpenAI to power some of its AI features in a forthcoming iPhone. That would be the nail in Apple’s ecosystem – which is already under fire from app makers and regulators – both here in the United States and in Europe. Much like when the Blackberry had to turn to Android to power its handset, if Apple can’t develop its own proprietary AI software, the potential for a new device to arrive and take market share from Apple remains very high. In the changing landscape of this technology, it’s important to remember that innovation is always paramount. Taxing application makers and small tweaks to the iPhone isn’t going to get the job done for Apple. And I expect shares to continue to underperform the broader tech sector. That was The Bleeding Edge for today. I hope you all have a wonderful weekend and I’ll see you again next week. The Bleeding Edge is the only free newsletter that features investing insights from editor Colin Tedards. Here, Colin will share what he's watching in the market and which stocks you'll want on your radar.  The Bleeding Edge is the only free newsletter that features investing insights from editor Colin Tedards. Here, Colin will share what he's watching in the market and which stocks you'll want on your radar. Protected by copyright laws of the United States and international treaties. This website may only be used pursuant\nto the subscription agreement and any reproduction, copying, or redistribution (electronic or otherwise, including\non the World Wide Web), in whole or in part, is strictly prohibited without the express written permission\nof Brownstone Research. "
}