{
    "title": "Nvidia primed to overtake Apple as world’s second-most-valuable company",
    "date": "3/8/2024",
    "url": "https://macdailynews.com/2024/03/08/nvidia-primed-to-overtake-apple-as-worlds-second-most-valuable-company/",
    "text": "Update font size. Reset Nvidia is primed to overtake Apple as the world’s second-most-valuable company, trailing behind Apple-rival Microsoft, as investors cannot get enough of the semiconductor maker whose chips power popular generative AI tools such as ChatGPT. Medha Singh for Reuters:\n ‎ An AI-induced jaw-dropping rally in Nvidia shares has taken the company’s valuation from $1 trillion to more than $2 trillion in just nine months… Nvidia’s market capitalization currently hovers around $2.38 trillion, lagging Apple by just about $230 billion and Microsoft by about $645 billion. The relentless rise in shares of Nvidia, which controls 80% of the high-end AI chip market, has been instrumental in pushing Wall Street to record levels this year, while giving the company a more than 5% weightage on the benchmark S&P 500 index. Meanwhile, Apple, which is grappling with slowing iPhone sales, ceded its position as the most valuable U.S. company to Microsoft for the first time since 2021 in January. ‎\nMacDailyNews Take: Again, Apple was once led by a visionary who set the agenda for entire industries, now led by a reactive caretaker who heard somewhere that VR headsets and electric cars were the next big things (probably read it in Wired), so those are the tasks he directed the company to tackle, while completely missing artificial intelligence, especially generative AI, and now is scrambling to catch up to something Steve Jobs would have focused on long before anyone ever even heard of OpenAI. Steve Jobs bought Siri in April 2010. Steve Jobs would never have ignored Siri, basically let it rot, for well over a decade and counting. Steve Jobs would have made Siri the first conversational generative AI assistant years before anyone else. And the company would today be worth at least a trillion dollars more than it is currently. (Yes, we’re lowballing that estimate.) Tim’s not a product person, per se. – Steve Jobs See also:\n• Apple said to be spending ‘millions of dollars a day’ on generative AI to supercharge Siri – September 7, 2023\n• Apple’s Siri turns ten, still acts like a two-year-old – October 4, 2021\n• Former Apple employees reflect on Siri’s ‘squandered lead’ over Amazon Alexa and Google Assistant – March 14, 2018 Clearly, Apple is not as innovative as it was under Steve Jobs, but the company — thanks to Jobs’ work and Cook’s subsequent management of iterations of products and services conceived during Jobs’ tenure — now has more than enough money to make up for the myopic Cook’s lack of vision. When, not if, Apple catches up and has at least “good enough” generative AI to tout, the bleeding will stop. Until it gets another visionary leader (fingers crossed; Apple’s history has shown – cough, Sculley, Spindler, cough – that the next CEO could be far, far worse than the very competent caretaker Cook), Apple can afford to miss things like generative AI – which they clearly did – and then use its huge war chest to catch up – which they’re doing right now (fun times and 80-hour weeks inside Apple Park!) – and, hopefully, surpass rivals (or at least be as good). Apple will very likely unveil their catch-up work within months (this June at WWDC 2024) in iPhones (and iPads, Apple Watches, etc.) with built-in on-device generative AI and other new AI-driven features. – MacDailyNews, February 14, 2024\n ‎\nPlease help support MacDailyNews. Click or tap here to support our independent tech blog. Thank you! Support MacDailyNews at no extra cost to you by using this link to shop at Amazon. Scot Forstall ought to be brought back… Cook, Schiller, most of the board, Jackson and other DEI hires shown the door Scott Fourskin? Nah. you clearly know nothing John Snow Scott was seen by many as mini Steve and we need exactly that right the fck now Yes, been advocating for Scott to return going on a decade. Elon Musk another heavy contender who kicked Cook’s ass in green vehicles… Agreed 1000%. Scott Forstall kicked butt and demanded excellence, which is why he was booted from this current regime. Ohhhh YES! He scared the bejesus out of timid Timmy, same as Elon Musk threatened Cook and ran from NEGOTIATIONS. Also SF bested Jony Ive in meeting arguments, so they ALL got rid of him to save their mediocre arses. Now it’s clear who is mediocre and creatively BRAIN DEAD CURRENT Apple execs playing it safe. Not the same Apple as under Jobs and it’s just a matter of time before the big broom comes in the room… Just wait for the revolutionary self-folding iPad. NVIDIA WAS primed to take over Apple as #2 – until the stock fell off the cliff this morning!   Was down close to $60, it’s rebounded a little now, but still down close to $50.   I was this close to finally being a millionaire today! IF they overtake Apple it will last a day or two until their stock is unloaded in an unprecedented cash out. Then the Game(will)Stop… The present regime milked the innovations achieved under Steve Jobs, over a decade now. Which was enough time for the competitors to improve and improve over Apple. Their decision over the last few years specifically after Steve Jobs passed with respect to Mac Laptops and soldering memory and storage to the motherboard and making user upgrades next to impossible was idiotic. They should have had a good market share in desktop computing in the last decade, instead they just milked on their achievement under Steve Jobs. At this rate the tide will turn against Apple, its just a matter of time. so, the three main thrust here are- Cook\nmilked\nJobs got it…. This site uses Akismet to reduce spam. Learn how your comment data is processed. “Ted Lasso” star and writer Brett Goldstein is set to appear in a guest star role in “Shrinking” Season 2 at Apple TV+… Apple’s M3 Ultra chip may be designed as a unique standalone chip, rather than two M3 Max chips joined together as in the M1 Ultra and… Alphabet subsidiary Google’s Android website has added a new landing page for Google Messages which touts that RCS on Apple’s iPhone… Sunshine is launching a new AI product, Shine. The product offers a photo-sharing app and an events website. Co-founder Marissa Mayer tells… Apple filed a lawsuit earlier this month against former software engineer Andrew Aude, alleging he leaked info about products he hated… Enter your email address to follow MacDailyNews and receive notifications of new posts by email. Email Address Follow :-) "
}