{
    "title": "Amid Rumors of a Deal With Rivian, Apple Acquired This Artificial \nIntelligence (AI) Start-Up Instead",
    "date": "3/19/2024",
    "url": "https://finance.yahoo.com/news/amid-rumors-deal-rivian-apple-113000766.html?prefer_reader_view=1&prefer_safari=1",
    "text": "From time to time, companies pursue mergers or acquisitions to help fund growth. These deals can help source product innovation or spearhead entering a new market. One company that has historically chosen to build in-house over pursuing acquisitions is Apple (NASDAQ: AAPL). Most of the company's deals have been under-the-radar transactions, with very few making the headlines. But earlier this month news broke that Apple was abandoning its ambitions in electric vehicles (EV). Shortly thereafter, rumors started to spread that Apple might be interested in acquiring Rivian. While this was an intriguing postulation, I see it as unlikely. Why? Because Apple just acquired an artificial intelligence (AI) start-up called DarwinAI instead. Although Apple is notoriously secretive, I think this move sheds some light on where the company wants to go. Let's dig into the deal and assess the breadcrumbs Apple has dropped as it pertains to its AI vision. Last year marked the start of the AI revolution. Microsoft kicked things off with its investment in OpenAI, the developer of ChatGPT. Amazon and Alphabet both swiftly followed, with each investing in a competing platform called Anthropic. For these tech behemoths, the aggressive moves within the AI realm were obvious. Each of these companies offer leading cloud-computing platforms, and integrating AI with those applications should help foster new growth. On the hardware side of the AI race lies Nvidia. The company's high-performance graphics processing units (GPUs) are fueling breakthroughs in generative AI -- from large language models (LLMs) to accelerated computing. Apple stands out among its \"Magnificent Seven\" cohorts, as the company operates across both the software and hardware industries. I'd argue that Microsoft is the biggest threat to Apple in this regard, with Nvidia showing signs of making inroads as well. But with all of this said, Apple remained pretty quiet last year as it relates to AI. Over the last couple of years, inflation played a major role influencing consumer spending habits. As such, demand for Apple's luxury hardware devices stalled. This dynamic has taken a major toll on Apple's growth, as revenue has been on the decline for several consecutive quarters. But with over $70 billion of cash and equivalents on the balance sheet, coupled with a budding services business, it was only a matter of time before Apple made a public splash in AI. DarwinAI develops technology which aims to help production quality. Its visual AI inspection technology can identify defects in products during the manufacturing cycle. Unlike its cohorts above, Apple is heavily reliant on devices -- not on the cloud. Given that the company has already released a new line of MacBook Air this year and very well could be planning on releasing additional enhancements to its software operating system, Apple's interest in DarwinAI's technology becomes more clear. Apple's forward price-to-earnings (P/E) multiple is 26, materially higher than that of the S&P 500. Considering the company isn't growing, and it clearly moved much slower than its peers in the AI space, I think Apple stock might be too expensive at the moment. For now, DarwinAI presents an intriguing new part of Apple's ecosystem. And while DarwinAI's technology has the potential to help Apple hone its production quality, the bigger question is whether it will serve as a way to help integrate AI across the hardware line more efficiently. It's simply too hard to know what kind of impact DarwinAI will have on Apple until the company starts to roll out specific AI features. Given Apple's premium valuation, I'd pass right now in favor of other opportunities in the AI space that have already established a clear vision. Should you invest $1,000 in Apple right now? Before you buy stock in Apple, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of March 18, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Adam Spatacco has positions in Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Amid Rumors of a Deal With Rivian, Apple Acquired This Artificial Intelligence (AI) Start-Up Instead was originally published by The Motley Fool Related Quotes "
}