{
    "title": "EU Launches Non-Compliance Investigation into Apple, Google, and Meta Under \nDigital Markets Act",
    "date": "3/25/2024",
    "url": "https://www.btimesonline.com/articles/165050/20240325/eu-launches-non-compliance-investigation-into-apple-google-and-meta-under-digital-markets-act.htm",
    "text": "The European Union has launched a non-compliance investigation into the practices of Apple, Meta, Amazon, and Alphabet-the parent company of Google-under its Digital Markets Act (DMA). The European Commission announced on Monday that it suspects these \"gatekeepers\" have failed to effectively comply with their obligations under the new tech legislation. The probes, which mark the first under the sweeping DMA, focus on various aspects of the companies' operations. The Commission is investigating Alphabet's rules on \"steering\" in its Google Play store and self-preferencing on Google Search, Apple's rules on steering in the App Store and the choice screen for Safari, and Meta's \"pay or consent model.\" \"The way that Apple and Alphabet's implemented the DMA rules on anti-steering seems to be at odds with the letter of the law. Apple and Alphabet will still charge various recurring fees, and still limit steering,\" said Margrethe Vestager, the EU's competition chief, during a news conference on Monday. In addition to the formal investigations, the Commission is also looking into steps relating to Apple's new fee structure for alternative app stores and Amazon's ranking practices on its marketplace. It has ordered the companies to keep particular documents to monitor the \"effective implementation and compliance\" with their obligations. The DMA, which came into effect on March 7, aims to create \"contestable\" and fair markets in the digital sector by regulating \"gatekeepers\"-large digital platforms that provide an important gateway between business users and consumers. The Commission has designated Alphabet, Amazon, Apple, ByteDance (TikTok's parent company), Meta, and Microsoft as the six gatekeepers under the DMA. If any company is found to have infringed the DMA, the Commission can impose fines of up to 10% of the tech firm's total worldwide turnover. These penalties can increase to 20% in case of repeated infringement. The Commission said systematic infringement may oblige the \"gatekeeper\" to sell off parts of the company or be banned from acquiring additional services. The launch of the investigation follows a lawsuit filed by the United States Department of Justice (DOJ) on Mar. 21 against Apple, claiming that its app market rules and \"monopoly\" illegally throttled competition and suffocated innovation. The DOJ also alleges that Apple has a monopoly in the smartphone market and \"'forces' developers to use its payment system to lock in both developers and users on its platform.\" In response to the EU investigation, Apple said it believes it is in compliance with the DMA. \"We're confident our plan complies with the DMA, and we'll continue to constructively engage with the European Commission as they conduct their investigations. Teams across Apple have created a wide range of new developer capabilities, features, and tools to comply with the regulation,\" an Apple spokesperson told CNBC on Monday. Oliver Bethell, director of competition at Alphabet, said in a statement, \"To comply with the Digital Markets Act, we have made significant changes to the way our services operate in Europe. We have engaged with the European Commission, stakeholders and third parties in dozens of events over the past year to receive and respond to feedback, and to balance conflicting needs within the ecosystem. We will continue to defend our approach in the coming months.\" Meta, meanwhile, said subscriptions are a common business model across various industries. \"Subscriptions as an alternative to advertising are a well-established business model across many industries, and we designed Subscription for No Ads to address several overlapping regulatory obligations, including the DMA. We will continue to engage constructively with the Commission,\" a Meta spokesperson said on Monday, as reported by CNBC. The Commission said it intends to conclude its probes within 12 months, but stressed that the DMA does not dictate a hard deadline for the timeline of the inquiry. As the investigations unfold, the tech giants will need to demonstrate their compliance with the DMA to avoid potential fines and other consequences, while the EU continues its efforts to create a more level playing field in the digital sector. © 2023 Business Times All rights reserved. Do not reproduce without permission.   "
}