{
    "title": "Apple will allow iOS apps to be distributed on websites in the EU",
    "date": "3/12/2024",
    "url": "https://ca.style.yahoo.com/apple-will-allow-ios-apps-to-be-distributed-on-websites-in-the-eu-141526111.html",
    "text": "We've rounded up the best deals from Amazon, Walmart, Best Buy, Coach Outlet & more. Days after Apple started allowing iOS users in the EU to use third-party app stores, the company has announced more changes related to how developers can distribute their apps. Most significantly, those who meet certain criteria will be able to let users download apps from their websites. The Web Distribution option, which will be available this spring, will effectively let developers bypass the app ecosystem entirely for their own apps. To be eligible, devs will need to opt in to new App Store rules that see them pay a fee for each user install after certain thresholds and be an Apple Developer Program member that’s been in good standing for at least two years. They’ll need to “have an app that had more than one million first annual installs on iOS in the EU in the prior calendar year” among other criteria, per a support document. By setting certain rules for supporting downloads from the web, Apple will be hoping to minimize the risk that users will be installing sketchy apps, such as ones containing malware or those that support piracy. Still, given the criticism levied against the company for seemingly only sticking to the letter of the EU’s Digital Markets Act and not its spirit, the fact that the company is exerting control over app downloads from the web may come under scrutiny too. In addition, as 9to5Mac notes, Apple is now allowing developers to run app marketplaces that solely contain their own apps. Previously, they were required to offer apps from other devs. As such, this means the likes of Epic Games, Xbox and Meta can have iOS app marketplaces that only include their own apps and games. Last but not least, developers will have more flexibility over how they can direct users to an external webpage to complete a transaction for digital goods and services. Apple had provided design templates for in-app promotions, discounts and deals, but those are now optional as of today. That means the likes of Spotify and Netflix can now design links out to their websites (and potentially avoid the 30 percent cut Apple takes of subscriptions from app-based signups). AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. The post 5 Artificial Intelligence (AI) Stocks That Could Be Millionaire Makers appeared first on The Motley Fool Canada. Some iPhone owners have received a series of notifications about resetting their Apple ID password, followed by a spoofed phone call. IBKR EventTrader - A new, straightforward way to trade CME futures markets Ping Ping Ping A Boston Dynamics SPOT robot that was sent inside a home by Massachusetts state police was shot three times by a person barricaded inside. As the Associated Press reports, the robotics company believes it's the first time one of its robotic dogs has been shot. The remotely-controlled quadruped was deployed earlier this […] While it's easy to draw comparisons to the Microsoft - OpenAI alliance, Wednesday's move by AWS actually signals just how vulnerable Amazon's cloud empire has become. HONG KONG (AP) — Chinese telecoms gear company Huawei Technologies has reported its profit more than doubled last year as its cloud and digital businesses thrived in spite of U.S. sanctions. The Shenzhen-based company reported a net profit of 87 billion yuan ($12 billion), helped by strong sales and an improved product portfolio. Revenue jumped nearly 10% from a year earlier, to 704.2 billion yuan ($97.4 billion). Huawei’s rotating chairman Ken Hu said the company’s figures were in line with for  Elon Musk has announced new changes to X (formerly Twitter) that will allow certain accounts to unlock premium features. Apple's overseas suppliers have increased production of the company's new iPad models and plans to launch them in early May, Bloomberg News reported on Thursday citing people with knowledge of the matter.  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said. Spot, a robotic dog created by tech company Boston Dynamics, is being used across the nation to help assist law enforcement in the field. 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ ANCHORAGE, Alaska (AP) — A headless robot about the size of a labrador retriever will be camouflaged as a coyote or fox to ward off migratory birds and other wildlife at Alaska's second largest airport, a state agency said. The Alaska Department of Transportation and Public Facilities has named the new robot Aurora and said it will be based at the Fairbanks airport to “enhance and augment safety and operations,\" the Anchorage Daily News reported. The transportation department released a video of The company is among the fastest-growing cybersecurity players based on my peer analysis Caution is needed even with this famous tech behemoth and its fast-growing services business You will never turn off your computer again. \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. Nordegren has moved on and built a life that focuses on her six kids Play this game for 1 minute and see why everyone is addicted. Seven reportedly cost $20 million TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Sweden became the newest member of NATO earlier this month, joining 31 nations in the security alliance, including the United States. Well, make that 49 of the United States.  Victoria’s Secret's wedding-inspired collection includes corsets, bras, thongs and more sexy apparel Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. "
}