{
    "title": "Apple's WWDC 2024 Event To Be 'Generative AI Launch Party,' Predicts Gene \nMunster",
    "date": "3/26/2024",
    "url": "https://www.tradingview.com/news/benzinga:469dbc2db094b:0-apple-s-wwdc-2024-event-to-be-generative-ai-launch-party-predicts-gene-munster/",
    "text": "Deepwater Asset Management’s managing partner Gene Munster has made a bold prediction about Apple Inc.’s AAPL upcoming Worldwide Developers Conference. What Happened: On Tuesday, Apple announced that its annual developers conference, WWDC 2024, will be held from June 10 to June 14 this year. The conference will be streamed live on Apple’s website. However, the tech giant has extended invitations to select software developers to attend a celebratory event in person on the first day. Mark your calendars for #WWDC24, June 10-14. It's going to be Absolutely Incredible! pic.twitter.com/YIln5972ZD After this announcement, Munster took to X, formerly Twitter, and said that he believes this event will mark the launch of Apple’s generative AI strategy. “$AAPL just put out their invite for WWDC, starting on June 10. While the press release made no mention of the topic, the event will likely be Apple's generative AI launch party,” Munster said. Munster anticipates that Apple CEO Tim Cook will not delve into AI during the company’s March quarter report; instead, he will direct investors to WWDC. He said that the event could feature Apple’s most significant announcement since 2007, focusing on the evolution of their operating systems. Deepwater’s managing partner also predicted that Cupertino will follow in the footsteps of Microsoft Corporation and Alphabet Inc.’s Google by integrating generative AI into its operating system interface. See Also: Mark Zuckerberg’s Shiny New $300M Diesel-Powered Mega Yacht Casts A Big Question Mark On His Climate Hero Status He also expects Apple to incorporate generative AI into iOS, MacOS, apps, and Siri and make additional AI announcements for developers, including access to foundation models. “Apple's AI announcements this year will follow announcements made by Google and Microsoft in May of 2023 related to integrating AI into product interfaces,” Munster said. He also predicted, “I expect generative AI will be added into iMessage, Mail, Calendar, Notes, Pages, and Numbers,” adding, “As for Siri, I'm optimistic that they will announce an AI powered version that will be available sometime in 2024. Currently, while Siri uses some AI for recommendations, it lacks a generative, conversational experience that catapulted Chat GPT into our lives.” Subscribe to the Benzinga Tech Trends newsletter to get all the latest tech developments delivered to your inbox. $AAPL just put out their invite for WWDC, starting on June 10. While the press release made no mention of the topic, the event will likely be Apple's generative AI launch party. When Apple reports their Mar-24 quarter in late April, I don't expect Cook to say much on AI and... Why It Matters: Earlier this month, it was reported that Apple was in talks with Google to license Gemini AI models for future iPhones. Munster previously commented on the report, stating that this deal could position Apple as a leader in personalized AI. Last month, it was reported that the Cupertino, California-based tech giant has halted its pursuit of the Apple Car and ceased its Electric Vehicle (EV) development initiative known as Titan. According to sources, Apple plans to redirect numerous staff members from EV development to its generative AI division. Check out more of Benzinga’s Future Of Consumer Tech by following this link. Read Next: 5 Technologies That Could Be Worth $220 Trillion By 2030, Cathie Wood’s ARK Predicts: ‘The Time Is Now’ Photo courtesy: Shutterstock Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @bradfairbridge @rajbuzzz @Kevin Trinh @Cenobar @arcanebear @udcovers @fx.today @_dalton16 @TradingView @mytradingsetup @ftmocom @chartfeed @olka_gadzieva @mytradingsetup @satoshi_empire @MidasPls @Zeiierman Trading @Onlnternet Whatever the trade "
}