{
    "title": "An Apple First? Tech Watcher Says New Mac, iPad And More Coming But Without \nLaunch Event",
    "date": "3/3/2024",
    "url": "https://www.tradingview.com/news/benzinga:41a5ab66e094b:0-an-apple-first-tech-watcher-says-new-mac-ipad-and-more-coming-but-without-launch-event/",
    "text": "Apple Inc. AAPL is reportedly set to release a series of new hardware, including Mac, iPad, Apple Pencil, and Magic Keyboard updates. However, the tech giant does not plan to host a launch event for these releases. What Happened: In his latest weekly \"Power On\" newsletter, Bloomberg columnist Mark Gurman said that Apple’s new hardware, which is currently in production overseas, will be announced through the company’s website, with a series of online videos and marketing campaigns. The new products are expected to be released in March or April, following the launch of a special version of iOS 17.4 with support for the new hardware at the end of the month. See Also: Apple Set Out To Make An EV Much More Than A ‘Tesla Clone’ And Let Slip Of ‘Multibillion-Dollar Moneymaker,’ Says Gurman The new products include revamped iPad Pro models, an updated iPad Air with a 12.9-inch screen option, and new Apple Pencils and Magic Keyboards for high-end iPads. The Mac lineup will also see the introduction of 13-inch and 15-inch MacBook Airs with the faster M3 chip. Apple’s marketing teams are reportedly preparing to announce these new products soon, with no full-blown event planned. All the attention, according to Gurman, will shift to the Worldwide Developers Conference, where Apple is expected to showcase its generative AI advances. In a separate post on X, formerly Twitter, Gurman also noted that Apple’s retail stores are running low on MacBook Airs and iPad Pros, with plans for a minor refresh this week and a larger refresh early next week. A few additional points: retail stores are low on MacBook Airs and iPad Pros; Stores are planning a minor refresh for this week (I think it's a new accessory rather than a new product); Stores are planning a larger refresh early next week (which sounds more product-related). https://t.co/kUkeYjT4rK Check out more of Benzinga's Future Of Consumer Tech by following this link. Read Next: Apple Sinks After Wall Street Titan Pulls Magnificent 7 Stock From Conviction List Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @bradfairbridge @rajbuzzz @Kevin Trinh @Cenobar @arcanebear @udcovers @fx.today @_dalton16 @TradingView @mytradingsetup @ftmocom @chartfeed @olka_gadzieva @mytradingsetup @satoshi_empire @MidasPls @Zeiierman Trading @Onlnternet Whatever the trade "
}