{
    "title": "EU Slaps Apple with $2B Fine: Strategic Setback or Minor Speed Bump?",
    "date": "3/6/2024",
    "url": "https://investorplace.com/2024/03/eu-slaps-apple-with-2b-fine-strategic-setback-or-minor-speed-bump/",
    "text": " Can Apple regain its throne as the most valuable company in the world? Advertisement Source: Yalcin Sonat / Shutterstock.com On Monday, Brussels fined Apple (NASDAQ:AAPL) 1.84 billion euros ($2 billion) for hindering competition among music streaming rivals through App Store restrictions. The penalty included a basic fine of 40 million euros and a substantial lump sum as a deterrent, marking the EU’s first action and dinging AAPL stock. The European Commission accused Apple in response to a 2019 complaint by Spotify, alleging it prevented the streaming service and others from informing users of alternative payment options outside the App Store. On Monday, Apple faced EU penalties for unfair trading conditions, mirroring a Dutch antitrust ruling. Apple plans to appeal the decision. Currently, AAPL stock is trading substantially lower, with some calling for even more downside on the horizon. With this sort of backdrop, let’s dive into whether Apple is a mega-cap stock worth buying at current levels. The EU competition authority fined Apple nearly $2B for monopolizing music app distribution, leading to a drop in AAPL stock. Following a probe triggered by Spotify, the European Commission penalized Apple €1.8B for breaching antitrust rules with its App Store policies, prohibiting app developers from promoting cheaper alternatives outside the platform. Apple plans to appeal, stating the decision lacks evidence of consumer harm and disregards the competitive market landscape. In Monday trading, AAPL fell over 2% to $174.98. The company also acknowledged how Spotify is the main beneficiary of the released ruling, putting emphasis on its 56% shares in Europe’s music streaming platforms. Spotify reciprocated, stating Apple’s restrictions benefited its own service, Apple Music. Despite the drop, Evercore ISI analyst Amit Daryanani maintained a buy rating on Apple stock, adjusting it off his “tactical outperform” list, with a price target of $220. At a press conference, European Competition Commissioner Margarethe Vestager highlighted that millions of European music streaming users lacked access to all options because of Apple’s anti-steering rules. Spotify welcomed the EU decision but noted broader concerns about Apple’s conduct toward developers in other markets. Analyst Ryan Reith from IDC noted that while the fine wouldn’t immediately impact Apple’s finances, it signals a broader trend of dismantling Apple’s ecosystem barriers. Over the past decade, the EU has fined Google billions, and Vestager’s directive to Apple aligns with the upcoming Digital Markets Act. In other Apple news, the giant tech unveiled its most recent MacBook Air model, powered by its latest M3 chip. This laptop prides itself with its boosted performance, which is 60% faster than previous models. With improved Neural Engine capabilities, it remains a top choice for AI tasks. Like older models, the M3 chip Macbook Airs are available in 13- and 15-inch sizes. One of its best features is 18 hours of battery life, a sleeker design, and an impressive Liquid Retina display. On top of that, the laptop also boasts dual external displays, and buyers can choose from four colors. Not only that, the computer also accommodates MagSafe charging and the news macOS. Orders started today, March 4, with availability on March 8. Greg Joswiak from Apple praised the upgraded MacBook Air with the M3 chip, highlighting its remarkable speed and extended battery life. Now that it runs on the latest M3 chip, the laptop guarantees 60% faster speed, which makes it far better for gaming or work. Individuals will also love the sleek design it offers which is thinner and lighter than most laptops we have in the market today. The issue with the EU case is just one of the littlest challenges Apple has to face. Its augmented reality ventures in the workplace may expedite Apple’s reputation, with Vision Pro headsets already selling 200,000 units at $3,499 each. While this boosts sales and lowers production costs, it raises concerns about cannibalizing other Apple products, notably tablets. Apple faces a pivotal moment as it gauges Vision Pro’s sustained success and AR’s long-term viability, offering investors a chance to enter the burgeoning AR market. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective. Consumer Discretionary, Retail, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/eu-slaps-apple-with-2b-fine-strategic-setback-or-minor-speed-bump/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}