{
    "title": "Apple Watch Could Have Worked With Android Phones But The Company Decided \nAgainst It: Here’s The Reason",
    "date": "3/24/2024",
    "url": "https://www.news18.com/tech/apple-watch-could-have-worked-with-android-phones-but-the-company-decided-against-it-heres-the-reason-8827298.html",
    "text": "Curated By:  S Aadeetya News18.com Last Updated: March 25, 2024, 10:00 IST Apple confirmed it was working on Apple Watch to support Android phones Apple confirms the reports that the company wanted its Apple Watch to work with Android phones but then decided against making it official. The company is facing a major lawsuit from the US government, accusing Apple of its anti-competitive nature, and now we’re hearing more unheard stuff from the horse’s mouth. Apple has admitted in its response to the Department of Justice (DOJ) claims that it had tried to make Apple Watch work with Android phones, but for multiple reasons, that never happened. In fact, a report by Bloomberg recently suggested the same, claiming that Apple had pulled the plug on this support at the last minute. Bringing Apple Watch to Android would have opened up a whole new market for the company where you have billions of smartphones. Apple has more or less confirmed those rumours, which has got people thinking about what could have been. So, why did Apple cancel this development? The response talks about Apple’s concerns with the technological limitations and possibly the security risks that Apple Watch could have entertained if it was opened up to Android. Like we have said umpteen times before, Apple might have dreaded the experience that the user would have got on the Apple Watch because Apple didn’t have as much control with Android as it has with iOS. History doesn’t repeat itself and we are now left to wonder about what  Apple could have gained by allowing Apple Watch to work on non-iPhones. Having said that, it is quite obvious now that Apple faces these tough questions from regulators across the globe, and it should be ready for more of the same. "
}