{
    "title": "Apple to pay $490M to settle class-action lawsuit over iPhone fraud: report \n(AAPL)",
    "date": "3/15/2024",
    "url": "https://seekingalpha.com/news/4080062-apple-to-pay-490m-to-settle-class-action-lawsuit-over-iphone-fraud-report",
    "text": "Shahid Jamil/iStock Editorial via Getty Images Apple (NASDAQ:AAPL) is paying $490M to settle a class action lawsuit brought forth by shareholders against the tech giant after they alleged Chief Executive Tim Cook defrauded them over iPhone weakness, Reuters reported. A preliminary settlement was filed in U.S. District Court in Oakland, California, the news outlet said. It is awaiting approval from U.S. District Judge Yvonne Gonzalez Rogers. The lawsuit is the result of comments Apple and Cook made to investors on Jan. 2, 2019 that it was cutting its revenue forecast as a result of Sino-American tensions. \"We believe the economic environment in China has been further impacted by rising trade tensions with the United States,\" Cook wrote in a letter to shareholders at the time. \"As the climate of mounting uncertainty weighed on financial markets, the effects appeared to reach consumers as well, with traffic to our retail stores and our channel partners in China declining as the quarter progressed. And market data has shown that the contraction in Greater China’s smartphone market has been particularly sharp.\" Sixty days prior, Apple provided guidance for the first-quarter to show \"slight revenue growth year-over-year.\" At the time, Cook said he did not think China would cause Apple to see sales pressure. A few days after the guidance was provided, Apple told suppliers to cut production. Cupertino, Calif.-based Apple denied liability but settled the matter to avoid litigation, Reuters reported, citing court papers. The payment will go to investors who purchased Apple shares in the two months between Cook's November 2018 statement and the Jan. 2, 2019 updated forecast. Apple shares fell 1.2% in mid-afternoon trading on Friday. "
}