{
    "title": "Colony Family Offices LLC Lowers Stock Holdings in Apple Inc. (NASDAQ:AAPL)",
    "date": "3/10/2024",
    "url": "https://www.americanbankingnews.com/2024/03/10/colony-family-offices-llc-lowers-stock-holdings-in-apple-inc-nasdaqaapl.html",
    "text": "Posted by ABMN Staff on Mar 10th, 2024 Colony Family Offices LLC reduced its position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 1.5% in the 3rd quarter, according to the company in its most recent disclosure with the Securities & Exchange Commission. The firm owned 18,948 shares of the iPhone maker’s stock after selling 296 shares during the period. Apple comprises about 1.4% of Colony Family Offices LLC’s holdings, making the stock its 13th largest holding. Colony Family Offices LLC’s holdings in Apple were worth $3,244,000 at the end of the most recent reporting period. Other hedge funds and other institutional investors have also modified their holdings of the company. Conservest Capital Advisors Inc. boosted its stake in shares of Apple by 0.3% during the 3rd quarter. Conservest Capital Advisors Inc. now owns 16,802 shares of the iPhone maker’s stock worth $2,877,000 after acquiring an additional 55 shares in the last quarter. Mokosak Advisory Group LLC boosted its stake in shares of Apple by 1.1% during the 2nd quarter. Mokosak Advisory Group LLC now owns 5,562 shares of the iPhone maker’s stock worth $1,079,000 after acquiring an additional 59 shares in the last quarter. Kraft Davis & Associates LLC boosted its stake in shares of Apple by 0.9% during the 3rd quarter. Kraft Davis & Associates LLC now owns 6,716 shares of the iPhone maker’s stock worth $1,155,000 after acquiring an additional 59 shares in the last quarter. MKT Advisors LLC boosted its stake in shares of Apple by 0.5% during the 2nd quarter. MKT Advisors LLC now owns 12,269 shares of the iPhone maker’s stock worth $1,777,000 after acquiring an additional 60 shares in the last quarter. Finally, Cassia Capital Partners LLC boosted its stake in shares of Apple by 1.2% during the 3rd quarter. Cassia Capital Partners LLC now owns 5,209 shares of the iPhone maker’s stock worth $892,000 after acquiring an additional 60 shares in the last quarter. 58.51% of the stock is currently owned by hedge funds and other institutional investors. Shares of NASDAQ:AAPL opened at $170.73 on Friday. The firm’s 50 day moving average is $184.64 and its two-hundred day moving average is $183.60. Apple Inc. has a 52 week low of $147.61 and a 52 week high of $199.62. The firm has a market capitalization of $2.64 trillion, a P/E ratio of 26.59, a PEG ratio of 2.04 and a beta of 1.29. The company has a current ratio of 1.07, a quick ratio of 1.02 and a debt-to-equity ratio of 1.28. Apple (NASDAQ:AAPL – Get Free Report) last announced its quarterly earnings results on Thursday, February 1st. The iPhone maker reported $2.18 EPS for the quarter, beating the consensus estimate of $2.09 by $0.09. The company had revenue of $119.60 billion for the quarter, compared to analyst estimates of $117.99 billion. Apple had a net margin of 26.16% and a return on equity of 156.04%. Apple’s revenue was up 2.1% compared to the same quarter last year. During the same quarter last year, the business earned $1.88 earnings per share. Analysts anticipate that Apple Inc. will post 6.55 earnings per share for the current year. The business also recently disclosed a quarterly dividend, which was paid on Thursday, February 15th. Stockholders of record on Monday, February 12th were issued a $0.24 dividend. This represents a $0.96 annualized dividend and a dividend yield of 0.56%. The ex-dividend date of this dividend was Friday, February 9th. Apple’s dividend payout ratio (DPR) is presently 14.95%. Several brokerages have recently commented on AAPL. Morgan Stanley boosted their price target on Apple from $210.00 to $220.00 and gave the stock an “overweight” rating in a research note on Friday, December 8th. The Goldman Sachs Group lifted their price objective on Apple from $223.00 to $232.00 and gave the stock a “buy” rating in a research report on Friday, February 2nd. Bank of America upgraded Apple from a “neutral” rating to a “buy” rating and lifted their price objective for the stock from $208.00 to $225.00 in a research report on Thursday, January 18th. Wedbush restated an “outperform” rating and set a $250.00 price objective on shares of Apple in a research report on Wednesday, February 28th. Finally, DA Davidson assumed coverage on Apple in a research report on Wednesday, January 3rd. They set a “neutral” rating and a $166.00 price objective for the company. One equities research analyst has rated the stock with a sell rating, eleven have assigned a hold rating, twenty-one have given a buy rating and one has issued a strong buy rating to the company’s stock. According to MarketBeat.com, Apple has a consensus rating of “Moderate Buy” and an average target price of $205.27. View Our Latest Analysis on AAPL In other news, Director Arthur D. Levinson sold 100,000 shares of the stock in a transaction that occurred on Thursday, February 29th. The shares were sold at an average price of $180.94, for a total value of $18,094,000.00. Following the completion of the transaction, the director now directly owns 4,434,576 shares in the company, valued at $802,392,181.44. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available at this hyperlink. Insiders own 0.06% of the company’s stock. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.    Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Apple Inc. (NASDAQ:AAPL) Shares Bought by Alcosta Capital Management Inc. Apple Inc. (NASDAQ:AAPL) Shares Purchased by WINTON GROUP Ltd "
}