{
    "title": "Apple fined almost $2B by the EU in music streaming antitrust probe",
    "date": "3/4/2024",
    "url": "https://www.cbc.ca/news/business/apple-fined-2b-european-union-music-streaming-1.7132896",
    "text": "The European Union levelled its first antitrust penalty against Apple on Monday, fining the U.S. tech giant nearly $2 billion US for breaking the bloc's competition laws by unfairly favouring its own music streaming service over rivals. Apple muzzled app developers from telling users where they could go to pay for cheaper music subscriptions instead of paying through iOS apps, said the European Commission, the 27-nation bloc's executive arm and top antitrust enforcer. \"This is illegal. And it has impacted millions of European consumers who were not able to make a free choice as to where, how and at what price to buy music streaming subscriptions,\" Margrethe Vestager, the EU's competition commissioner, said at a news conference in Brussels. Apple — which said it contests the decision — behaved this way for a decade, resulting in \"millions of people who have paid two, three euros more per month for their music streaming service than they would otherwise have had to pay,\" she said. The 1.8 billion-euro fine follows an investigation triggered by a complaint from Swedish streaming service Spotify five years ago. Since then, the EU has drawn up new regulations taking effect this week to prevent tech giants from cornering digital markets. The EU has led global efforts to crack down on Big Tech companies, including three fines for Google totalling more than 8 billion euros and charging Meta with distorting the online classified ad market. Apple, meanwhile, also is trying to resolve a separate EU antitrust investigation into its mobile payments service by promising to open up its tap-and-go mobile payment system to rivals. The fine for the music streaming investigation is so high because it includes a big extra lump sum to deter Apple from offending again and to act as a deterrent to other tech companies from carrying out similar offences, the commission said. Apple hit back at both the commission and Spotify, saying it would appeal the penalty. \"The decision was reached despite the Commission's failure to uncover any credible evidence of consumer harm, and ignores the realities of a market that is thriving, competitive, and growing fast,\" the company said in a statement. It said Spotify stood to benefit from the EU's move, asserting that the Swedish streaming giant that holds a 56 per cent share of Europe's music streaming market and that doesn't pay Apple for using its App Store met over 65 times with the commission during the investigation. \"Ironically, in the name of competition, today's decision just cements the dominant position of a successful European company that is the digital music market's runaway leader,\" Apple said. Spotify said it welcomed the EU fine, without addressing Apple's accusations. \"This decision sends a powerful message — no company, not even a monopoly like Apple, can wield power abusively to control how other companies interact with their customers,\" Spotify said in a blog post. The commission's investigation initially centered on two concerns. One was the iPhone maker's practice of forcing app developers that are selling digital content to use its in-house payment system, which charges a 30 per cent commission on all subscriptions. But the EU later dropped that to focus on how Apple prevents app makers from telling their users about cheaper ways to pay for subscriptions that don't involve going through an app. The investigation found that Apple banned streaming services from telling users about how much subscription offers cost outside of their apps, including links in their apps to pay for alternative subscriptions or even emailing users to tell them about different pricing options. \"As a result, millions of European music streaming users were left in the dark about all available options,\" Vestager said, adding that the commission's investigation found that just over 20 per cent of consumers who would have signed up to Spotify's premium service didn't do so because of the restrictions. The fine comes just before new EU rules are set to kick in that are aimed at preventing tech companies from dominating digital markets. The Digital Markets Act, due to take effect Thursday, imposes a set of do's and don'ts on \"gatekeeper\" companies including Apple, Meta, Google parent Alphabet, and TikTok parent ByteDance — under threat of hefty fines. The DMA's provisions are designed to prevent tech giants from the sort of behaviour that's at the heart of the Apple investigation. Apple has already revealed how it will comply, including allowing iPhone users in Europe to use app stores other than its own and enabling developers to offer alternative payment systems. Vestager warned that the commission would be carefully scrutinizing how Apple follows the new rules. \"Apple will have to open its gates to its ecosystem to allow users to easily find the apps they want, pay for them in any way they want and use them on any device that they want,\" she said. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  "
}