{
    "title": null,
    "date": "3/23/2024",
    "url": "https://ca.news.yahoo.com/apple-reverses-decision-ban-epic-224826606.html",
    "text": "Epic Games will be allowed to have its own app store on IOS in Europe. Apple reversed its decision not to allow the Epic Games Store following the passage of the Digital Markets Act in the EU. Epic, which makes Fortnite, has been battling Apple and Google over in-app purchases for years. Apple is backing down after saying it would not allow Epic Games to have its own app store on IOS in Europe. Apple decided to reverse its decision following a claim by European Union officials that they would investigate the ban, according to CNN. Epic Games, which makes Fortnite, has been battling Google and Apple to get around their hold on in-app purchases on their platforms in recent years. Both Google and Apple removed Fortnite from their online stores in 2020 after Epic created a way to purchase in-game currency that didn't use the in-app purchasing system. In a blog post, Epic said that Fortnite will be available again on IOS following the decision. \"This sends a strong signal to developers that the European Commission will act swiftly to enforce the Digital Markets Act and hold gatekeepers accountable,\" the company said. The Digital Markets Act officially became law on Thursday in the European Union, which is designed to reign in Big Tech companies' hold on competition. The law requires app store developers to allow app downloads and purchases from third-party vendors. In a previous post, Epic said in the blog post that Apple had removed its \"Epic Games Sweden AB\" account, which it planned to use to put the Epic Games Store on IOS. \"This is a serious violation of the DMA and shows Apple has no intention of allowing true competition on iOS devices,\" the company said. Apple told CNN that it reinstated the account after talking with Epic and having Epic agree to new EU-focused policies. An Epic lawsuit against Google went to trial in November 2023 in San Francisco federal court over the digital payment processing system in the Google Play store. A jury sided with Epic and agreed that Google maintained an illegal monopoly with the Google Play store. Google plans to appeal the case, but if higher courts uphold the verdict, Epic plans to build its own app store and run its own billing systems on Android, BI previously reported. Epic lost a similar lawsuit against Apple in 2021. Although a federal judge sided with Apple on most points in that case, the judge did rule that Apple should allow apps to provide links to other payment options. Read the original article on Business Insider AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. The post 5 Artificial Intelligence (AI) Stocks That Could Be Millionaire Makers appeared first on The Motley Fool Canada. Some iPhone owners have received a series of notifications about resetting their Apple ID password, followed by a spoofed phone call. 網上或實體課專業教師團隊，適合所有程度報讀，定期免費文化活動，體驗不同國家風俗，太子屯門元朗天水圍沙田荃灣均有分校！ Ping Ping Ping A Boston Dynamics SPOT robot that was sent inside a home by Massachusetts state police was shot three times by a person barricaded inside. As the Associated Press reports, the robotics company believes it's the first time one of its robotic dogs has been shot. The remotely-controlled quadruped was deployed earlier this […] While it's easy to draw comparisons to the Microsoft - OpenAI alliance, Wednesday's move by AWS actually signals just how vulnerable Amazon's cloud empire has become. HONG KONG (AP) — Chinese telecoms gear company Huawei Technologies has reported its profit more than doubled last year as its cloud and digital businesses thrived in spite of U.S. sanctions. The Shenzhen-based company reported a net profit of 87 billion yuan ($12 billion), helped by strong sales and an improved product portfolio. Revenue jumped nearly 10% from a year earlier, to 704.2 billion yuan ($97.4 billion). Huawei’s rotating chairman Ken Hu said the company’s figures were in line with for  Apple's overseas suppliers have increased production of the company's new iPad models and plans to launch them in early May, Bloomberg News reported on Thursday citing people with knowledge of the matter.  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said. Spot, a robotic dog created by tech company Boston Dynamics, is being used across the nation to help assist law enforcement in the field. (Bloomberg) -- Huawei Technologies Co. sustained its run of strong quarterly profit growth, building on the resurgence of its consumer business against Apple Inc.’s iPhone and the rise of its cloud division against incumbent Alibaba Group Holding Ltd.Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the Play this game for 1 minute and see why everyone is addicted. Taiwan's Foxconn hit a record closing high on Thursday as it is set to benefit from growth in AI servers. Elsewhere, CEOs of U.S. chip makers met Chinese leader Xi Jinping. ANCHORAGE, Alaska (AP) — A headless robot about the size of a labrador retriever will be camouflaged as a coyote or fox to ward off migratory birds and other wildlife at Alaska's second largest airport, a state agency said. The Alaska Department of Transportation and Public Facilities has named the new robot Aurora and said it will be based at the Fairbanks airport to “enhance and augment safety and operations,\" the Anchorage Daily News reported. The transportation department released a video of The company is among the fastest-growing cybersecurity players based on my peer analysis 為本地學士及研究院課程學生提供保險公司或專業中介公司的中後勤職位實習，體驗行業實況，了解發展前景並累積工作經驗。實習期為6月至8月，實習生可獲僱主發放每月酬金，立即報名！ Caution is needed even with this famous tech behemoth and its fast-growing services business \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia.  Trump's former national security adviser shut down a comparison between the ex-president and Julius Caesar. Seven reportedly cost $20 million TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt  Sweden became the newest member of NATO earlier this month, joining 31 nations in the security alliance, including the United States. Well, make that 49 of the United States. Victoria’s Secret's wedding-inspired collection includes corsets, bras, thongs and more sexy apparel Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con "
}