{
    "title": "Apple Inc. (NASDAQ:AAPL) Shares Sold by First Foundation Advisors",
    "date": "3/14/2024",
    "url": "https://www.americanbankingnews.com/2024/03/14/apple-inc-nasdaqaapl-shares-sold-by-first-foundation-advisors.html",
    "text": "Posted by ABMN Staff on Mar 14th, 2024 First Foundation Advisors decreased its position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 7.2% during the 3rd quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission. The fund owned 318,155 shares of the iPhone maker’s stock after selling 24,773 shares during the quarter. Apple makes up about 2.5% of First Foundation Advisors’ portfolio, making the stock its 7th biggest holding. First Foundation Advisors’ holdings in Apple were worth $54,471,000 at the end of the most recent reporting period. Other hedge funds have also recently modified their holdings of the company. Conservest Capital Advisors Inc. increased its holdings in shares of Apple by 0.3% in the third quarter. Conservest Capital Advisors Inc. now owns 16,802 shares of the iPhone maker’s stock valued at $2,877,000 after purchasing an additional 55 shares during the period. Mokosak Advisory Group LLC increased its stake in Apple by 1.1% in the 2nd quarter. Mokosak Advisory Group LLC now owns 5,562 shares of the iPhone maker’s stock valued at $1,079,000 after buying an additional 59 shares during the period. Kraft Davis & Associates LLC raised its position in Apple by 0.9% during the 3rd quarter. Kraft Davis & Associates LLC now owns 6,716 shares of the iPhone maker’s stock worth $1,155,000 after buying an additional 59 shares during the last quarter. MKT Advisors LLC lifted its stake in shares of Apple by 0.5% in the 2nd quarter. MKT Advisors LLC now owns 12,269 shares of the iPhone maker’s stock worth $1,777,000 after acquiring an additional 60 shares during the period. Finally, Cassia Capital Partners LLC boosted its holdings in shares of Apple by 1.2% in the third quarter. Cassia Capital Partners LLC now owns 5,209 shares of the iPhone maker’s stock valued at $892,000 after acquiring an additional 60 shares in the last quarter. Hedge funds and other institutional investors own 58.51% of the company’s stock. AAPL stock opened at $171.13 on Thursday. The company has a market cap of $2.64 trillion, a PE ratio of 26.66, a price-to-earnings-growth ratio of 2.08 and a beta of 1.29. The company has a current ratio of 1.07, a quick ratio of 1.02 and a debt-to-equity ratio of 1.28. The stock has a 50-day moving average price of $183.74 and a two-hundred day moving average price of $183.47. Apple Inc. has a 12-month low of $149.92 and a 12-month high of $199.62. Apple (NASDAQ:AAPL – Get Free Report) last posted its earnings results on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share (EPS) for the quarter, topping analysts’ consensus estimates of $2.09 by $0.09. The firm had revenue of $119.60 billion during the quarter, compared to the consensus estimate of $117.99 billion. Apple had a net margin of 26.16% and a return on equity of 156.04%. The company’s revenue was up 2.1% on a year-over-year basis. During the same quarter in the prior year, the company earned $1.88 EPS. As a group, research analysts predict that Apple Inc. will post 6.55 EPS for the current year. The firm also recently announced a quarterly dividend, which was paid on Thursday, February 15th. Investors of record on Monday, February 12th were issued a dividend of $0.24 per share. The ex-dividend date was Friday, February 9th. This represents a $0.96 annualized dividend and a dividend yield of 0.56%. Apple’s payout ratio is 14.95%. In other Apple news, Director Arthur D. Levinson sold 100,000 shares of the firm’s stock in a transaction dated Thursday, February 29th. The stock was sold at an average price of $180.94, for a total value of $18,094,000.00. Following the transaction, the director now directly owns 4,434,576 shares of the company’s stock, valued at $802,392,181.44. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available at the SEC website. 0.06% of the stock is owned by corporate insiders. Several research analysts recently issued reports on the stock. Wedbush reissued an “outperform” rating and set a $250.00 price target on shares of Apple in a report on Wednesday, February 28th. Tigress Financial increased their target price on Apple from $225.00 to $240.00 and gave the stock a “strong-buy” rating in a research note on Thursday, November 16th. Redburn Atlantic downgraded Apple from a “buy” rating to a “neutral” rating and set a $200.00 price target on the stock. in a research note on Wednesday, January 10th. Citigroup reiterated a “buy” rating and issued a $225.00 price objective on shares of Apple in a research report on Friday, February 16th. Finally, Rosenblatt Securities restated a “neutral” rating and set a $189.00 target price on shares of Apple in a research report on Tuesday, March 5th. One investment analyst has rated the stock with a sell rating, eleven have issued a hold rating, twenty-one have issued a buy rating and one has given a strong buy rating to the company. Based on data from MarketBeat, the company has a consensus rating of “Moderate Buy” and an average target price of $205.27. View Our Latest Stock Report on Apple (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.    Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Vanguard Mega Cap Value ETF (NYSEARCA:MGV) Shares Bought by Harbour Investments Inc. Altria Group, Inc. (NYSE:MO) Shares Sold by Diversified Trust Co "
}