{
    "title": "Apple TV+ is the streaming platform with the highest rated content on IMDb",
    "date": "3/27/2024",
    "url": "https://9to5mac.com/2024/03/27/apple-tv-highest-rated-content-imdb/",
    "text": "It’s been five years since Apple TV+ was announced. Although its content library is not as vast as that of its competitors, Apple TV+ movies and shows have won multiple awards since then. Interestingly, a study by Self Financial found that Apple TV+ is the streaming platform with the highest rated content on IMDb. Self Financial’s study analyzed IMDb ratings for content available on the main US streaming platforms, which include Amazon Prime Video, Netflix, Disney+, Hulu, Peacock, HBO Max, Paramount+, and Apple TV+. When it comes to having a huge library of content, Amazon Prime Video now leads the segment with 13,827 movies and shows rated – more than double that of Netflix, which comes in second. Apple TV+, on the other hand, is the streaming service with the smallest catalog with only 271 titles available. However, despite having the smallest catalog, Apple’s streaming platform stands out as having the best average rating for content, at least according to IMDb. Apple TV+ has an average score of 7.01 out of 10. Unsurprisingly, the study notes that the Emmy-winning series Ted Lasso is one of the highest-rated programs. The study also looked at many other aspects of streaming platforms, such as the best for children – which is also Apple TV+ despite its limited catalog. Another interesting fact is that Netflix has the highest-rated sports and technology shows and movies, despite Apple’s efforts to bring sports content to its platform. Be sure to check out the full study, which also highlights the average IMDb rating by genre, as well as revealing that people spend an average of $52.97 per month on streaming services in the US. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Apple TV is Apple's streaming device that access… Filipe Espósito is a Brazilian tech Journalist who started covering Apple news on iHelp BR with some exclusive scoops — including the reveal of the new Apple Watch Series 5 models in titanium and ceramic. He joined 9to5Mac to share even more tech news around the world. "
}