{
    "title": "A TikTok ban could be terrible news for Apple and Tesla",
    "date": "3/16/2024",
    "url": "https://www.businessinsider.in/tech/news/a-tiktok-ban-could-be-terrible-news-for-apple-and-tesla/articleshow/108533118.cms",
    "text": "Liked the article? Share it with your friends... or copy link A potential TikTok ban in the US could spell trouble for Apple, Tesla, and other American companies operating in China. The House of Representatives passed legislation Wednesday that would require ByteDance to sell TikTok to a non-Chinese entity within about six months or face a ban from US app stores. It's unclear if the bill will pass the Senate or withstand any legal challenges TikTok would likely bring. And even as would-be buyers throw their hats in the ring, a TikTok spokesperson suggested a sale wasn't likely, saying the bill had a \"predetermined outcome: a total ban of TikTok in the United States.\" But if the bill were to pass, China could retaliate, analysts told Business Insider. US tech firms are already facing increasing challenges in China amid strong local competition and a climate of uber-nationalism. And on Wednesday, China's foreign ministry warned TikTok ban attempts would \"eventually backfire on the US.\" Deepwater Asset Management managing partner Gene Munster told Business Insider he believes a TikTok ban has a 25% chance of materializing. But if it does, \"it would be bad for the China portion of US business revenue\" for a number of companies, with Apple and Tesla \"near the top of the list.\" The Chinese government could retaliate by launching \"propaganda brand damage campaigns,\" Munster said — which is precisely what China thinks is happening with TikTok. It could also stifle operations by capping work hours, creating shipping strikes, or impeding permits for new projects, he said. Wedbush Securities managing director and senior equity analyst Dan Ives told BI that a ban could also add \"agita to the tensions between US and China\" in what he called a \"Cold Tech War.\" While Apple and Tesla stand to lose the most in terms of total dollars, other American companies who drive a significant percentage of their revenues in China include Wynn Resorts, Las Vegas Sands, Qualcomm, Texas Instruments, and IPG Photonics, Munster noted. Adding fuel to the situation: Chinese consumers are increasingly buying with patriotism in mind, the Financial Times reports, with the government moving to reduce iPhone usage among state employees — citing security concerns — and instead encouraging devices from local purveyor Huawei. In a world where there is a TikTok ban, Munster said, \"Chinese leadership could expand its anti-iPhone campaign beyond the government.\" He added it would be an \"easy response\" for the Chinese government to mirror the accusations of spying against TikTok back at Apple. \"China's about 18% of overall business,\" he added of Apple. \"That number could decline to 12% to 15% in a TikTok-inspired trade war.\" Tesla is also feeling the pain in China, BI previously reported, with shipments slumping as Chinese manufacturer BYD dominates — becoming the best-selling EV maker in the world last year. But Munster said it might be impacted to a lesser extent than Apple in the event of a ban. In the past, China has suggested Teslas, too, pose security risks, reportedly restricting their use by military and government workers and banning them from parking at government offices. \"China was about 23% of Tesla revenue in 2023,\" Munster said. If the TikTok legislation were to pass and China retaliated, \"I could see that number decline to 20%.\" Apple and Tesla did not immediately respond to requests for comment from Business Insider. Advertisement "
}