{
    "title": "Going Into Earnings, Is Apple Stock a Buy, a Sell, or Fairly Valued?",
    "date": "1/25/2024",
    "url": "https://www.morningstar.com/stocks/going-into-earnings-is-apple-stock-buy-sell-or-fairly-valued-3",
    "text": "With the release of the new iPhone, here’s what we think of Apple’s stock Apple AAPL is set to release its fiscal first-quarter earnings report on Feb. 1, 2024, after the close of trading. Here’s Morningstar’s take on what to look for in Apple’s earnings and stock. With its 2-star rating, we believe Apple’s stock is overvalued compared with our long-term fair value estimate. Our fair value estimate for Apple is $160 per share. Our valuation implies a fiscal 2024 adjusted price/earnings multiple of 24 times, a fiscal 2024 enterprise value/sales multiple of 6 times, and a fiscal 2024 free cash flow yield of 5%. We project 6% compound annual revenue growth for Apple through fiscal 2028. The iPhone will be the greatest contributor to revenue over our forecast, and we project 4% growth for iPhone revenue over the next five years. We expect this to be driven primarily by unit sales growth, with modest pricing increases. We think pricing increases will be driven primarily by higher features and a mix shift toward the more premium Pro models. Services are Apple’s next-biggest revenue contributor over our forecast, and we predict 7% services revenue growth. Services are driven in large part by revenue from Google, thanks to its status as the default search engine on the Safari browser, as well as Apple’s cut of App Store sales. We expect solid growth in Google revenue, but we see a more mixed outlook for the App Store, where we forecast growth in overall app revenue but progressively lower cuts going toward Apple as the result of regulatory pressures. Elsewhere, we see roughly high-single-digit growth across revenue from Apple Music, Apple TV+, Apple Pay, AppleCare, and other services. Read more about Apple’s fair value estimate. We assign Apple a wide moat, stemming from customer switching costs, intangible assets, and a network effect. In our view, Apple’s iOS ecosystem extends far-reaching, sticky tendrils into customers’ wallets, entrenching them with its software capabilities and integration across disparate devices like the iPhone, Mac, iPad, Apple Watch, and more. We also see immense design prowess at Apple, most impressively from its deep integration of hardware, software, and semiconductors to create best-of-breed products. Finally, we see a virtuous cycle between Apple’s affluent customer base and its vast ecosystem of developer partners. These moat sources elicit great profitability and returns on invested capital. In our view, Apple can likely leverage these moat sources into continued economic profits over the next 20 years. To us, Apple’s most important moat source arises from the switching costs for its ecosystem of software, driven by iOS on the iPhone. The firm enjoys terrific customer retention and satisfaction, even despite pricing its products at a significant premium to its competition. First, Apple offers software capabilities that are only available to iPhone users—iMessage messaging, FaceTime calling, AirDrop sharing, the Apple Pay digital wallet, and location sharing are among the most used. Apple’s products become even more entrenched when a customer adopts two or more. Users who combine the iPhone with a Mac, an iPad, and/or a Watch are offered more features, which in turn creates a higher switching cost. In our view, Apple’s ability to widen its portfolio of user devices helps augment its existing switching costs. The Apple Watch and AirPods are good recent examples of new products that we see raising the stickiness of customers. A Watch user can answer calls, read and respond to messages, and keep track of notifications, but must have an iPhone to use these capabilities. AirPods connect with marked ease to Apple devices but have to be manually repaired if joined to a non-Apple device. As customers use more point devices, we believe they are less likely to leave Apple’s ecosystem. We view Apple’s nascent push into augmented and virtual reality as the next step in this strategy. The firm’s Vision Pro headset offers yet another auxiliary form factor that relies on the iPhone as the focal computing point. Read more about Apple’s moat rating. We assign Apple a Medium Uncertainty Rating. We think the firm’s greatest risk is its reliance on consumer spending, for which there is great competition and cyclicality. Apple is at constant risk of disruption, just as the iPhone disrupted BlackBerry in the budding smartphone market. The iPhone could be unseated by a new device or “super app.” We believe the firm defends against this risk by introducing new form factors (like a watch and an augmented reality headset) and selling an ecosystem of software and services on top of hardware. We also see geopolitical risk arising from Apple’s supply chain. It is heavily dependent on Foxconn and Taiwan Semiconductor Manufacturing TSM for its assembly and chip production, respectively. The majority of iPhones are produced at a factory in China by Foxconn, and the majority of Apple chips are produced in Taiwan by TSMC. If there were a souring of relations between the United States and China, or if China threatened Taiwan, the firm could see a severe hit to its supply. Additionally, the Chinese government has recommended that government officials not conduct business on iPhones, which presents a current and potential future risk to sales in China. We see a low level of environmental, social, and governance risk for Apple. The firm has committed to full carbon neutrality by 2030, and we believe it will achieve this goal. The potential future loss of talented human capital could be another risk on this front. Read more about Apple’s risk and uncertainty. This article was compiled by Freeman Brou. The author or authors do not own shares in any securities mentioned in this article.\n\n\t\t\t\t\t\tFind out about Morningstar’s editorial policies. Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}