{
    "title": "Vision Pro Will Officially Launch On February 2 As Apple Announces \nPackaging And Lens Details",
    "date": "1/8/2024",
    "url": "https://wccftech.com/vision-pro-launch-date-finally-confirmed/",
    "text": "Apple initially announced that the Vision Pro headset will be available early in 2024. However, the company failed to give us an exact launch date for the highly anticipated headset. The company has finally unveiled that its Vision Pro headset will launch on February 2, with pre-orders beginning the following week. Apple announced the Vision Pro last year at its WWDC 2023 event in June. After the initial unveiling, the company has been working with developers to create additional use cases for the headset. The company is also working with its software team to fix bugs and clear the headset of potential stutters and hiccups in visionOS. In the past few weeks, excitement regarding the headset started piling up for users looking to get their hands on the device. Vision Pro will finally launch on February 2, with pre-orders beginning a week after. The company announced the launch date for the Vision Pro in a press release today. The headset will launch in the United States and will be available from Apple's Online Store. In the press release, Tim Cook states: “The era of spatial computing has arrived,” said Tim Cook, Apple’s CEO. “Apple Vision Pro is the most advanced consumer electronics device ever created. Its revolutionary and magical user interface will redefine how we connect, create, and explore.” If you want to get your hands on the Vision Pro headset at launch, it will cost you $3,499 with 256GB of storage capacity. The company has also announced the lens prices that go with the headset. The ZEISS Optical Inserts - Readers will be available for $99, and the ZEISS Optical Inserts - Prescription will be available for $149 in the United States. Besides this, the Vision Pro will feature a Solo Knit Band and a Dual Loop Band at launch, which users can choose from. The packaging will include a USB-C charging cable, a USB-C power adapter, a battery, a polishing cloth, a cover for the front display, and Light Seal Cushions. These are all the accessories that will be available in the box. As mentioned earlier, Apple will launch the Vision Pro headset only in the United States. However, the company will expand the product to additional regions in the near future. The Vision Pro is finally here, and we are very excited to try Apple's latest product after the launch of the Apple Watch back in 2015. Although, how the market will respond to the product remains to be seen. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}