{
    "title": "History Says the Nasdaq Could Keep Soaring in 2024: 1 \"Magnificent Seven\" \nStock to Buy Hand Over Fist Before It ...",
    "date": "1/10/2024",
    "url": "https://www.fool.com/investing/2024/01/10/history-nasdaq-soar-2024-magnificent-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Technology stocks soared impressively in 2023 as they found favor with investors once again thanks to promising economic indicators like falling inflation, the Federal Reserve's decision to pause interest rate hikes, and the impressive growth reported by several tech companies thanks to new tech trends such as artificial intelligence (AI). These factors go some way to explaining why the Nasdaq-100 Technology Sector index rose nearly 54% last year. Historical trends show that the year in which the Nasdaq-100 delivered 40%-plus gains is nearly always followed by another solid growth year (1999 was an exception as it preceded the dot-com bubble). Brokerage firm Capex.com estimates that the Nasdaq-100 will deliver a gain of 24% in 2024. That seems like good news for a group of seven megacap tech companies known as the \"Magnificent Seven,\" which played an important role in the Nasdaq's surge last year. The Magnificent Seven group consists of Apple (AAPL -1.06%), Amazon, Alphabet, Meta Platforms, Microsoft, Nvidia, and Tesla. One of these companies, however, has been at the receiving end of downgrades from Wall Street in 2024. Apple got off to a disappointing start in 2024 following robust gains last year, with the stock being hit by a couple of downgrades recently. Let's see why that has been the case. Barclays analyst Tim Long downgraded Apple stock to underweight last week, pointing out that the demand for the company's latest generation iPhone 15 models has been tepid, especially in China. At the same time, Long claims that the company's high-margin services business could witness a slowdown in growth. The Barclays downgrade was followed by another one from Harsh Kumar of investment banking firm Piper Sandler. Kumar downgraded Apple stock from overweight to neutral, and his thesis was similar to Long's. The Piper Sandler analyst said he believes that the unit growth of Apple's iPhone sales has peaked already. Meanwhile, a report from Apple's contract manufacturing partner Foxconn hasn't helped matters either. The Taiwan-based company, which assembles iPhones for Apple, reported a sharp decline of 27% in sales for December 2023. Foxconn sees its revenue declining in the current quarter as well. Given that the iPhone is Apple's biggest product line (it produced 52% of its total revenue in fiscal 2023, ended in September 2023), these reports don't bode well for the tech giant's performance in the new year. For instance, Counterpoint Research expects iPhone sales volume to increase by just 2% this year, below the 5% growth that the overall smartphone market is expected to clock in 2024. All this paints a gloomy picture of Apple's future. However, there is a major catalyst that could help Apple spring a surprise and prove the doubters wrong. The smartphone market wasn't in great shape last year -- shipments dropped an estimated 3.5%, according to IDC. Not surprisingly, Apple's revenue fell in the previous fiscal year as it relies on the smartphone market for a large chunk of its top line. The company sold $200.6 billion worth of iPhones in fiscal 2023, down 2.3% year over year. What's worth noting is that Apple's revenue decline was slower than the pace at which the overall smartphone market is estimated to have dropped last year. That can be attributed to the company's solid market share and robust pricing power. Apple was the second-largest smartphone company in the third quarter of 2023 with a market share of 17.7%, a couple of percentage points behind market leader Samsung. However, the average selling price (ASP) of each iPhone is estimated to have hit $1,038 in 2023, which was significantly higher than the overall smartphone market's ASP of $292. Apple's solid share and pricing put it in a nice position to capitalize on the market for AI-enabled smartphones, which are expected to start gaining traction this year. According to Counterpoint Research, 100 million AI-enabled smartphones could be shipped in 2024. More importantly, the AI smartphone market is expected to keep growing nicely over the next three years, clocking a compound annual growth rate of 83% through 2027 and hitting annual shipments of 522 million units at the end of the forecast period. Counterpoint estimates that a total of 1 billion AI-powered smartphones could be shipped through 2027. Apple is reportedly working on integrating multiple AI features into its next smartphone generation. Some of these features may include creating playlists in Apple Music with generative AI-powered prompts and running large language models on the smartphone instead of the cloud to allow users to generate images with the help of AI. There are also reports that Apple built hundreds of AI servers last year and plans to build more of them in 2024 to give users a combination of cloud-powered AI processing along with on-device AI processing in smartphones. The adoption of AI-enabled smartphones could lift Apple's shipment volumes in 2024, which could lead to stronger growth considering the healthy ASP it enjoys in the smartphone market. Apple's revenue is expected to jump 4% to $397 billion in the current fiscal year. What's more, as the following chart indicates, Apple's top line could keep heading higher in the next couple of fiscal years as well.  AAPL Revenue Estimates for Current Fiscal Year data by YCharts It is worth noting that consensus estimates are also up for how much earnings growth the company will see.  AAPL EPS Estimates for Current Fiscal Year data by YCharts Assuming Apple does hit $7.91 per share in earnings over the next couple of fiscal years and trades at the Nasdaq-100's average price-to-earnings ratio of 29 at that time (using the index as a proxy for tech stocks), its stock price could jump to $230. That's a 27% upside from current levels. Given that Apple stock currently trades at 29 times sales, investors should consider accumulating the stock before it jumps higher. AI-enabled smartphones could help drive stronger growth in the company's revenue and earnings, and the market may reward the stock with a higher valuation as a result. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends Barclays Plc. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}