{
    "title": "Stock market today: Stocks rise as S&P 500 hits fresh record to kick off \nearnings-packed week",
    "date": "1/29/2024",
    "url": "https://finance.yahoo.com/news/stock-market-today-stocks-rise-as-sp-500-hits-fresh-record-to-kick-off-earnings-packed-week-210043365.html",
    "text": "US stocks edged higher Monday, with the S&P 500 notching another record close as investors braced for a busy week packed with Big Tech earnings updates, a Federal Reserve rate decision, and the crucial US jobs report. The Dow Jones Industrial Average (^DJI) drifted 0.6% higher, while the S&P 500 (^GSPC) rose 0.8% to build on last week's wins for the indexes. The tech-heavy Nasdaq Composite (^IXIC) gained over 1%. With five of the \"Magnificent Seven\" tech companies set to report earnings, it looks like a crunch week for stocks. Big Tech has driven the S&P 500's recent record-setting gains, and the focus will be on whether their AI efforts and layoffs are paying off. Microsoft (MSFT) and Alphabet (GOOGL, GOOG) lead out the pack on Tuesday, with Apple (AAPL), Amazon (AMZN), and Meta (META) among the 100-plus flood of corporates on the docket. At the same time, investors are preparing for the Fed's policy decision on Wednesday after data last week showed inflation cooling and the economy robust. While policymakers are expected to hold interest rates steady at 5.25%, the market will listen closely to Chair Jerome Powell's comments for clues as to when cuts could begin amid a scaling back on March bets. Also coming is Friday's US jobs report for December, which will factor into calculations of whether the Fed has managed a \"soft landing.\" Read more: What the Fed rate-hike pause means for bank accounts, CDs, loans, and credit cards Oil prices fell as concerns about an impact on Chinese demand vied with supply risks from escalating Middle East tensions after a drone attack on US forces. US benchmark WTI futures (CL=F) fell more than 1% to settle at $76.78 a barrel, while global benchmark Brent futures (BZ=F) also closed lower at $82.40 a barrel. The Dow Jones Industrial Average (^DJI) edged higher on Monday while the S&P 500 (^GSPC) gained 0.6% starting the week with fresh record closes. The tech-heavy Nasdaq 100 (^NDX) also rose 1%. Tech stocks led the session gains as Tesla (TSLA) shares jumped 4%. Nvidia (NVDA), Meta (META), and Microsoft (MSFT) all rose roughly 1% to close at record highs. Apple (AAPL) was the only stock among the \"Magnificent Seven\" group that closed fractionally lower, down about 0.4%. Investors are anticipating a jam-packed week ahead of Big Tech earnings. The markets will also be digesting Wednesday's rate decision from the Federal Reserve and Friday's January jobs report. The US tax filing season begins on Monday, as the Internal Revenue Service starts accepting and processing 2023 federal tax returns. Taxpayers have until April 15 to file without an extension. The IRS generally issues refunds within about three weeks after returns are electronically filed — even faster if you choose direct deposit instead of a mailed check. Yahoo Finance's Rebecca Chen shares other important facts and dates to keep in mind when filing taxes. Tech stocks led Monday's modest gains in afternoon trading, helping lift the Nasdaq Composite (^IXIC) higher by 0.6%. Tesla (TSLA) shares jumped as much as 3%, rebounding from a steep sell-off last week after the EV giant offered a downbeat production outlook for 2024. Nvidia (NVDA), Meta (META), and Microsoft (MSFT) all rose roughly 1%. Apple (AAPL) was the only stock among the \"Magnificent Seven\" group that was trading lower, down about 0.5%. This is expected to be a jam-packed week as investors anticipate Big Tech earnings. The markets will also be digesting Wednesday's rate decision from the Federal Reserve and Friday's January jobs report. Another top Goldman Sachs (GS) executive is leaving. Jim Esposito, who had been co-head of Goldman’s global banking and markets division, will leave after nearly three decades, according to a memo viewed by Yahoo Finance. The Wall Street Journal was the first to report the departure. As Yahoo Finance's David Hollerith reports, Esposito's departure raises new questions about the race to succeed CEO David Solomon, and caps a period of high-profile management and board changes for the Wall Street giant. Read more here. Warner Bros. Discovery (WBD) stock fell as much as 3% on Monday after Wells Fargo downgraded the stock from Overweight to Equal Weight, citing a \"risky earnings setup\" to kick off the year. \"We've taken a thorough scrub of our 2024 WBD earnings estimates and come out more negative,\" Wells Fargo analyst Steve Cahall wrote in a note to clients on Monday. Read more here from Yahoo Finance's Allie Canal. SoFi Technologies (SOFI) SoFi shares rose as much as 22% after the fintech company reached profitability for the first time since going public under generally accepted accounted principles (GAAP). SoFi's fourth quarter net income came in at $48 million, or $0.02 per share. The company also generated its 11th consecutive quarter of record adjusted net revenue of $594 million. Lucid (LCID) Share of the luxury electric vehicle maker rose as much as 21% on Monday, occupying the No. 2 trending ticker slot on Yahoo Finance. The startup is expected to report quarterly results on Feb. 21. Lucid stock has zero Wall Street analyst Buy recommendations, 12 Hold, and five Sell. Short interest on the stock sits just above 26% of the float, making it prone to short squeezes. Year to date the stock is down roughly 24%. iRobot (IRBT) Shares iRobot pared some of its losses after sinking as much as 18% after the vacuum maker's sale to Amazon (AMZN) fell apart amid resistance from EU regulators. The companies said there was \"no path to regulator approval for the deal.\" On Monday iRobot announced it will cut 31% of its workforce and that CEO Colin Angle would step down immediately. The stock market rally is still all about tech. Strategists have called for a broadening out of the market rally, but big tech companies are expected to be the drivers of Q4 earnings growth in the S&P 500, according to new data from FactSet. As Yahoo Finance's Josh Schafer highlights, five of those companies — Apple, Alphabet, Microsoft, Amazon, and Meta — are set to report quarterly results this week. Earnings for Apple (AAPL), Alphabet (GOOGL, GOOG), Microsoft (MSFT), Amazon (AMZN), Meta (META), and Nvidia (NVDA) are expected to grow a combined 53.7% in the fourth quarter. Meanwhile the other 494 companies in the S&P 500 are expected to see a 10.5% decline. Read more here. Oil futures fell on Monday, backing off an initial rise after Iran-backed militants killed three US soldiers in Jordan over the weekend. Crude prices fell after a Hong Kong court ordered Chinese property developer Evergrande to liquidate. The ruling deemed the company, once worth about $50 billion, incapable of delivering on its restructuring plan. West Texas Intermediate (CL=F) fell more than 1% trading around $77 per barrel. Brent (BZ=F), the international benchmark price, also dropped to trade below $83 per barrel. Crude rose more than 6% last week as traders assessed what a wider escalation of tensions in the Middle East means for oil prices. Iran-backed Houthi rebels have continued to target vessels along the Red Sea area, prompting cargo companies to delay or reroute their shipments. \"While the attacks had traders' attention, at this point no real oil supplies have been disrupted,\" Dennis Kissler, senior vice president at BOK Financial, said in a note on Monday. The major averages held steady on Monday morning as tech and consumer discretionary stocks drifted higher, while energy-related equities lagged. The Dow Jones Industrial Average (^DJI) and the S&P 500 (^GSPC) rose above the flatline. The tech-heavy Nasdaq (^IXIC) also ticked slightly higher. Meta (META) hit an intraday high as Microsoft (MSFT) and Amazon (AMZN) rose ahead of their earnings releases this week. Meanwhile the Energy Select Sector ETF (XLE) lagged as shares of Chevron (CVX), ExxonMobil (XOM), and Occidental Petroleum (OXY) fell fractionally. Oil declined on Monday as concerns of over the health of the Chinese economy overshadowed worries of escalating tensions in the Red Sea area. West Texas Intermediate (CL=F) futures slipped more than 1% to trade below $77 per barrel. Brent (BZ=F), the international benchmark price, also sank more than 1%, hovering just above $82 per barrel. Stocks opened little changed as investors brace for a busy week bringing Big Tech earnings, a Fed rate decision, and January's jobs report. The Dow Jones Industrial Average (^DJI) and the S&P 500 (^GSPC) hovered around the flatline after the major stock gauges notched weekly wins. The tech-heavy Nasdaq 100 (^NDX) ticked slightly higher on Monday morning. Amazon (AMZN) shares gained 0.4% after the e-commerce giant terminated an agreement to acquire Roomba vacuum maker iRobot (IRBT). The companies said there was \"no path to regulator approval for the deal.\" Shares of iRobot sank more than 16%. The company announced it will cut 31% of its workforce and that CEO Colin Angle would step down immediately. Tesla (TSLA) shares opened higher on Monday, rebounding from a steep sell-off last week after the EV giant offered a downbeat production outlook for 2024. Click here for in-depth analysis of the latest stock market news and events moving stock prices. Read the latest financial and business news from Yahoo Finance Related Quotes "
}