{
    "title": null,
    "date": "1/3/2024",
    "url": "https://markets.businessinsider.com/news/stocks/apple-stock-price-market-value-paypal-magnificent-seven-barclays-downgrade-2024-1",
    "text": "       Apple's new year got off to a nightmarish start Tuesday as its plummeting stock price wiped out more than $100 billion in market value. Shares in the Cupertino-based Big Tech giant tumbled 4% in the first trading session of 2024 after Barclays downgraded the stock to \"underweight,\" with analysts flagging sluggish iPhone, Mac, and iPad sales. That slide lowered Apple's valuation by $107 billion, according to data from Refinitiv. The one-day decline is more than the combined market value of Ford and General Motors. Starbucks, Citigroup, Blackstone, Airbnb, and FedEx are also all valued at less than $107 billion, per CompaniesMarketCap. As well as slashing its rating for Apple, Barclays trimmed its price target for the \"Magnificent Seven\" mega-cap tech stock from $161 to $160. It cited \"lackluster\" iPhone 15 sales data in China and \"a lack of bounce-back in Macs, iPads, and wearables\". The bank's warning served as a reminder to investors that higher interest rates and a slowing economy could chip away at Big Tech stocks' bottom line this year as consumers rein in their spending, according to analysts. Apple \"might wish it could hit the restart button right now,\" said AJ Bell's head of financial analysis, Danni Hewson. \"Once again Chinese competition is a factor, but as high interest rates do the job they were designed to do and consumers continue to think carefully about big-ticket purchases, tech like iPhones are the ultimate nice to have that many potential customers may end up putting off buying until their budgets are less constrained,\" she added. Apple's bumpy start to the year comes after a mixed 2023. Its stock climbed almost 50% to put its market capitalization on the cusp of $3 trillion, but that performance lagged some of its Big Tech rivals as investors started to fret about how China's economic slowdown might affect sales. Read next Indices Commodities Currencies Stocks Jump to "
}