{
    "title": "Apple stock down 3.6% as Barclays says iPhone weakness will persist",
    "date": "1/2/2024",
    "url": "https://finance.yahoo.com/news/apple-stock-down-36-as-barclays-says-iphone-weakness-will-persist-220019303.html",
    "text": "Shares of Apple (AAPL) fell 3.6% at the close of trading in New York on Tuesday, the stock's steepest drop since August. The moves came after Barclays downgraded the iPhone maker and lowered its price target for shares of the company on fears of slowing iPhone 15 sales in China. “We are still picking up weakness on iPhone volumes and mix, as well as a lack of bounce-back in Macs, iPads and wearables,” Barclays analyst Tim Long wrote in a note Tuesday. “The biggest takeaway from the latest checks is incrementally worse [iPhone 15] data points out of China, together with developed markets remaining soft,” he added. According to Long, the softness in iPhone sales is likely to continue even after Apple launches the iPhone 16 later this year, as the phone isn’t expected to have many major upgrades over the current model. Apple’s iPhone revenue declined roughly $5 billion in 2023 versus 2022. Sales of the company’s Macs, iPads, and wearables were also off, as consumers felt pressure from rising inflation and interest rates. The PC industry was also stung as fewer consumers needed to purchase new systems after millions bought up laptops and desktops at the start of the pandemic. Long also called out Apple’s services business as a potential weak link for the company, saying that the segment faces a number of battles ahead including those related to its App Store practices. Apple is facing pressure to allow app developers to offer users a means of paying for apps via third-party payment options that would cut out Apple’s 30% App Store fee. The company’s deal to use Google as the default search engine in its Safari browser could also be under threat as the Department of Justice continues its antitrust case against the search giant. Apple is estimated to rake in billions on the deal, which is reported under the services business. Apple’s service business, on the other hand, jumped from $78.1 billion in 2022 to $85.2 billion in 2023. Long, however, says that the segment will start to see growth slow in the coming years. “We model ~10% and ~8% growth in services in FY24 and FY25, well below [the] prior growth estimate of ~20%. In 2024, we should get an initial determination on the Google TAC, and some app store investigations could intensify,” Long wrote. At the same time, Apple is continuing to fight its patent battle with medical device maker Masimo over whether the Apple Watch’s blood oxygen sensor infringes on Masimo’s patents related to the technology. Apple initially pulled its Apple Watch Series 9 and Apple Watch Ultra 2 from store shelves ahead of Christmas after the International Trade Commission called for a ban on imports of the watches. But a federal appeals court ruled Apple could continue selling the watches while the dispute works its way through the court system. Despite those potential troubles, Apple has a major bright spot on the horizon: its Vision Pro headset. Apple is expected to host a launch event for the AR/VR headset sometime in February. And if the Vision Pro, which Apple refers to as a spatial computer, is a success, it could set up Apple as the go-to company for a new generation of computing devices. Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}