{
    "title": "Yahoo taps former Twitch, Spotify, Apple exec Jeff Rossi to oversee agency \ndevelopment",
    "date": "2/8/2024",
    "url": "https://www.editorandpublisher.com/stories/yahoo-taps-former-twitch-spotify-apple-exec-jeff-rossi-to-oversee-agency-development,248082",
    "text": "Yahoo today announced the appointment of Jeff Rossi as vice president, global agency partnerships, to lead and manage its agency strategy. Rossi joins Yahoo with over 20 years of experience driving strategic marketing and agency partnerships for iconic brands, including Twitch, Spotify and Apple. “Jeff not only brings an intimate understanding of developing innovative and successful campaigns, but he’s also a respected leader in the industry,” said Elizabeth Herbst-Brady, chief revenue officer, Yahoo. “We’re continuously investing in strong relationships across the board, and Jeff’s extensive background in agency development will further strengthen our team and expand our partnership network.” In his role, Rossi will oversee the development and execution of Yahoo's strategic vision with leading global agency holding companies. In recent months, Yahoo has enhanced its support for agency partners with innovative tools and services aimed at improving client outcomes. As Yahoo continues to build out its offerings, Rossi will be key to setting the overall direction for agency planning, activation and performance, as well as building and enhancing relationships at the highest levels. He will report to Alia Lamborghini, SVP, head of U.S. sales and strategy. “Yahoo Ads has built an impressive offering for its agency partners and I’m eager to help develop meaningful partnerships that take advantage of all Yahoo has to offer,” said Rossi. “I’ve always admired the Yahoo brand and I look forward to working alongside this talented team to deliver outstanding value to our clients and partners worldwide.\" Prior to joining Yahoo, Rossi most recently held the position of senior director, agency development at Twitch. Before Twitch, he spent over six years at Spotify as both the global head of industry and global head of business marketing, overseeing teams that worked with the world's biggest advertisers. Previously, Rossi launched the global agency relations practice at Apple within their former iAd mobile advertising platform. Prior to joining Apple, he served in leadership roles such as SVP at Starcom MediaVest Group, where he led the Procter & Gamble business, as well as partner and communication strategy director at Mediaedge:cia where he developed digital and traditional media strategies for Activision, AT&T and LiveNation. About Yahoo: Yahoo serves as a trusted guide for hundreds of millions of people globally, helping them achieve their goals online through our portfolio of iconic products. For advertisers, Yahoo Advertising offers omnichannel solutions and powerful data to engage with our brands and deliver results. To learn more about Yahoo, please visit yahooinc.com. No  comments on this item\n                \n\nPlease log in to comment by clicking here Other items that may interest you E&P Exlusives    Post or search jobs now Read more E&P Exclusive Stories In a strategic move aimed at optimizing its public notice services, Wick Communications, a third-generation family-owned and operated media corporation, has embraced Column’s latest professional service offering — Column Pro. This shift has reallocated staff resources, cost savings, and increased operational stability.\n\n“Column is great about attending to the details, such as keeping our newspaper logos on the invoices. Their team works with us to ensure our long-standing clients understand that Column is our newspaper partner — that we’re all working together,\" stated Manuel Coppola of Wick Communications. /casestudies/index.html See More Partner News  "
}