{
    "title": "Enterprise hits and misses - Apple Vision Pro gets a business review, \nGoogle Gemini is put to the productivity test, and sustainability gets real",
    "date": "2/12/2024",
    "url": "https://diginomica.com/enterprise-hits-and-misses-apple-vision-pro-gets-business-review-google-gemini-put-productivity",
    "text": " Lead story - Sustainability in 2024 - impact and use cases AI might be hogging the marketing ink, but the enterprise sustainability theme continues to press forward. Our diginomica authors approached this from several directions, starting with George's Why sustainability data sharing needs to start with a trust framework: It’s also important to note that the whole trusted framework is architected without needing a blockchain or cloud service monopoly in the middle. Yes - let's solve real world problems, not look for another blockchain use case to run up the flagpole of shopworn expectations. George turned his attention to another real world problem in How the UK water industry is collaborating to contextualize water data: The UK has an essential strength in building a culture of open data. While better technologies and data management services can play a role, it’s essential to build out a framework of trust that includes lawyers, risk managers, and executives... Solving problems like river health, air pollution, housing, economic growth, and climate change requires a systems-level approach informed by diverse data sets and expertise. Madeline looked at the possibilities of Dryad's Silvanet IoT system in Sustainability and climate change - how green tech can stop wildfires with sensors that ‘smell’ fires: This means fires can be detected within minutes after someone starts even the smallest fire, a key aspect in increasing the probability of firefighters extinguishing a fire when it's still small. Talk about tech-for-good - the urgency of this use case is as clear as you can get. Mark Samuels looks at how sustainability and open source intersect in Why the ‘Do No Harm’ principle can be key to open source sustainability and equality. Though the political conversations about sustainability are unavaoidable at times, this topic is far too politicized for its own good. How many enterprises can afford to ignore energy costs, supplier inefficiencies, and the emerging regulatory frameworks around all of this? We'll keep documenting the use cases. Diginomica picks - my top stories on diginomica this week Vendor analysis, diginomica style. Here's my three top choices from our vendor coverage: Jon's grab bag - Stuart asks a question with big implications in AI, IP and the Abilene Paradox - should media companies and gen AI leaders be \"wooing, not suing\"?  Stuart: \"Frankly, a ruling in the New York Times Company’s suit can’t come soon enough. In the meantime, watching which tech firms are willing to come to mutually-beneficial deals with content creators is going to be revelatory in its own right.\" Indeed - but there is one catch. I believe, though I can't say this with certainty, that the big LLM vendors will figure out how to prevent their LLMs from issuing big chunks of verbatim copyrighted material as they currently can be manipulated into doing (perhaps this could be solved by building a copyright check into the output architecture). That will change how publishers view this - and how, I suspect, the courts will view this too (preventing copyrighted image content from being outputted by image generators trained on such content is a more difficult and intractable technical problem). Chris raises questions on the UK's AI innovation versus regulation problem in AI and LLMs - the UK has a Goldilocks problem, says House of Lords report. Finally, Mark Chillington addressed a topic that will be even more important with AI gobbling up junior-level tasks: Getting technology apprenticeships right - digital leaders explain how apprentices can enable business change.  My top six Though Google Gemini is on the consumer tech side, this review from The Verge is highly relevant to enterprise concerns: Google’s Gemini assistant is fantastic and frustrating. I've blown gaskets over the insistence that gen AI will be *totally awesome* for search, especially on the consumer side. Where I think it might someday excel is triggering workflows across applications. As Verge author Allison Johnson put it: I also appreciate that when Gemini comes up with something for me, like a recipe or a packing list, I have somewhere to put it. Gemini can export answers directly to Google Docs or Gmail. When I get the same kinds of things from ChatGPT, they just feel like they’re floating around in space until I copy and paste them somewhere. Johnson gave Gemini a mixed review, and the workflows are tied to Google tools, but to me, this is where the productivity side of gen AI actually gets interesting...  I guess this qualifies as good news, but barely: FCC votes to outlaw scam robocalls that use AI-generated voices | CNN Business https://t.co/2ex57NTsXR -> good/obvious move - but as a commenter said, \"scam calls from humans are fine?\" — Jon Reed (@jonerp) February 11, 2024 Same deal with the so-called \"smart\" toothbrushes: 3 million smart toothbrushes were not used in a DDoS attack after all, but it could happen https://t.co/13NANzutBS -> good (for now). resume brushing.... — Jon Reed (@jonerp) February 11, 2024 Oh, and camera security is an issue now too, because Hackers can spy on cameras through walls, new research finds. Paging all techno-optimists... Until then, be well. If you find an #ensw piece that qualifies for hits and misses - in a good or bad way - let me know in the comments as Clive (almost) always does. Most Enterprise hits and misses articles are selected from my curated @jonerpnewsfeed. Image credit - Waiter Suggesting Bottle © Minerva Studiom, Overworked Businessman © Bloomua, Businessman Choosing Success or Failure Road © Creativa - all from Adobe Stock. Disclosure - Oracle, Workday, Salesforce and Confluent are diginomica premier partners as of this writing. diginomica and the diginomica logo are trademarks of\ndiginomica Limited. © Diginomica Limited and its licensors 2013-\n2024 Developed by\n\nBRAINSUM\n. "
}