{
    "title": "EU set to fine Apple in Spotify music streaming case, sources say",
    "date": "2/27/2024",
    "url": "https://finance.yahoo.com/news/eu-set-fine-apple-spotify-184504647.html",
    "text": "By Foo Yun Chee BRUSSELS (Reuters) - Apple is set to be handed an EU antitrust fine of about 500 million euros ($543 million) next week in a music streaming case triggered by a Spotify complaint, sources said. The European Commission last year charged the iPhone maker with preventing Spotify and other music streaming firms from informing users of options outside Apple's App Store. Apple declined to comment on Tuesday. The European Union's competition watchdog said such \"anti-steering obligations\" constitute unfair trading conditions, a relatively novel argument in an antitrust case and one which has also been used Meta Platforms in a separate case. The sources said that Apple was set to be fined on March 5, although the final timing and the amount of the fine could change depending on EU antitrust chief Margrethe Vestager. The EU will also order Apple to stop such practices, something it will have to do anyway under new EU tech rules called the Digital Markets Act (DMA) which six tech companies including Apple will have to comply with from March 7. While fining Apple is designed as a deterrent, it pales compared with billion euro fines for Google in its three EU antitrust cases over the past decade. Separately, the Commission is also looking into Apple's decision to remove home screen web apps for users in the EU, which the company said is to abide by the DMA. \"We're in particular looking into the issue of Progressive Web Apps, and can confirm sending the requests for information to Apple and to app developers, who can provide useful information for our assessment,\" a Commission spokesperson said. The spokesperson said the scrutiny is part of its assessment of the six companies' compliance with their DMA requirements. Home screen web apps, which can be launched as a standalone app on a device, allow developers to sell subscriptions through their websites, bypassing Apple's App Store and its 30% fees. Apple has said EU users will be able to continue accessing websites directly from their home screen through a bookmark with minimal impact to their functionality and that removing home screen web apps affect only a small number of users in the EU. Breaches of the DMA can result in fines up to 10% of a company's global turnover. ($1 = 0.9215 euros) (Reporting by Foo Yun Chee; Editing by Alexander Smith) Related Quotes "
}