{
    "title": "Huawei’s Rise Continues To Harm Apple’s Market Share In China, Claim \nAnalysts; Other Reasons Also Highlighted For iPhone Shipments Decline",
    "date": "2/18/2024",
    "url": "https://wccftech.com/huawei-rise-has-resulted-in-apple-market-share-decline-in-china/",
    "text": "In Apple’s latest Q1 2024 earnings call, it was revealed that nearly 30 percent of the technology giant’s iPhone revenue for the quarter was thanks to its presence in one market, China. Given its recent 13 percent shipment decline in the region, the company stands to lose out on a ton if its market share continues to be threatened. Unfortunately, that looks to be the case here, with analysts believing that Huawei’s comeback is creating a torrent of problems and other reasons for that sales slump. A compilation of opinions from various analysts was posted by Revegnus, starting with Ming-Chi Kuo, who strongly believes that premium smartphone consumers in the region prefer foldable devices instead of Apple’s iPhones. Various Chinese firms are racing towards mass producing foldable handsets bearing a clamshell design, and incorporating such smartphones with high-end specifications should make them an attractive purchase over Apple’s products. On the other hand, IDC is of the opinion that Huawei is primarily the reason for the California giant’s shipments declining. However, the business practices adopted by Apple are also culpable for this steady decline, as the firm continues to launch iPhones with limited product upgrades. For instance, the majority of Apple’s competitors have shifted their handsets to feature high refresh rate, 120Hz panels, whereas it is yet to transition to such displays for the less expensive options such as the iPhone 15 and iPhone 15 Plus. While this decision incentivizes consumers to acquire the premium iPhone 15 Pro and iPhone 15 Pro Max, it can also lose potential customers as they may not have the budget to pick one of the more expensive devices. What is Apple's future in China? First, let's look at the outlook for Apple in the Chinese market from various market research firms.@mingchikuo: \"Consumers in the Chinese premium market are already prioritizing the purchase of foldable smartphones. The decline in Apple's… — Revegnus (@Tech_Reve) February 18, 2024  TrendForce had earlier reported that Apple would face several challenges in 2024 regarding iPhone sales in China, with Huawei’s comeback being one of them. However, it is not like Huawei has everything executed to the letter because its foundry partner, SMIC, is experiencing its own troubles. The semiconductor is said to be establishing 5nm production lines for its client for commercialization later in the year, but thanks to using the existing DUV machinery, a previous report stated that chips manufactured using this technology could be up to 50 percent more expensive than what it costs TSMC. In short, Huawei’s first 5nm Kirin SoC could be thoroughly costly, removing the competitive price advantage from its next high-end smartphone offerings. While it is safe to assume that Apple is losing ground in China, that does not mean that those slowly gaining in this market are not experiencing any struggles of their own, but it should be an interesting turn of affairs by the end of 2024, so we will revisit which company managed to come out on top. News Source: Revegnus Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}