{
    "title": "Apple declines to share MLS Season Pass viewing numbers",
    "date": "2/22/2024",
    "url": "https://worldsoccertalk.com/news/apple-declines-to-share-mls-season-pass-viewing-numbers-20240222-WST-491069.html",
    "text": "by Chris Moore February 22, 2024 Apple is continuing to keep a lid on official viewership numbers regarding MLS Season Pass. The massive tech company previously signed a 10-year deal to become the media home of Major League Soccer. The agreement was in place ahead of the 2023 campaign. As of yet, Apple has not released statistics regarding the streaming service. Some assumed that Apple may be slow to release these viewership figures during their first season. After all, the deal only just began in 2023 and the company could need time to gather data. Nevertheless, MLS Season Pass has been in place for a year, and we are still waiting for the official numbers. The 2024 MLS season kicked off on Wednesday night as Inter Miami hosted Real Salt Lake. Miami was given the chance to start the season due to the influence of Lionel Messi. The superstar initially joined the Floridian side last July but only played six top-flight matches with the club. The 2024 campaign will be his first full season in the United States. Apple Senior Vice President Eddy Cue spoke on Messi’s positive effect on MLS Season Pass subscriptions during a recent interview. However, the exec also failed to reveal any real information regarding the viewership of the streaming service. “I won’t give you the exact number, but pre-Messi it was very U.S. dominant. Post-Messi, it changed materially,” Cue said of Messi’s impact on MLS Season Pass subscriptions. “He had a significant number of subscribers from South America and Europe. So, it was a big change.” During the same discussion, MLS commissioner Don Garber claimed that the league is getting more attention internationally than domestically. This, according to Garber, is solely due to the Messi effect. Nevertheless, the commissioner also understands that MLS needs to be aware that the Argentine will someday depart the league. “At some point, Messi won’t be in our league,” stated Garber. “Who will the next Messi be? It’s no different than what anybody thought when David Beckham left, when Thierry Henry left, when Zlatan left.” “Getting [Messi] signed was a statement about Major League Soccer that we can compete that we can deliver a great experience for a player with a competitive environment where they can further their career. There’s going to be another Leo Messi at some point. And I hope that MLS is in a position to be able to sign that player.” Apple and MLS are banking on Messi to continue helping attract subscribers to MLS Season Pass. However, their reluctance to reveal viewership statistics for the streaming service is concerning. Many other similar businesses, such as ESPN+, Paramount+, and Peacock, share their subscription figures throughout the year. These services also regularly give game-by-game viewership statistics. Instead, Apple is opting to keep viewership numbers confidential. This is likely to avoid comparisons to other sports streaming services. Ultimately, hiding statistics means the numbers are not up to par. If viewership were extremely high, companies would certainly want people to know it. Includes: Premier League + 84 Sports Channels Includes: Bundesliga & La Liga Includes: Champions League & Serie A Includes: Premier League Includes: every MLS game and Leagues Cup World Soccer Talk © 2023.  Made in Florida. World Soccer Talk is reader-supported and may earn a commission through our partner links. "
}