{
    "title": "Why Tim Cook Is Going All In on the Apple Vision Pro",
    "date": "2/1/2024",
    "url": "https://www.vanityfair.com/news/tim-cook-apple-vision-pro",
    "text": "To revisit this article, visit My Profile, then View saved stories. By Nick Bilton Photography by Norman Jean Roy The first time Tim Cook experienced the Apple Vision Pro, it wasn’t called the Apple Vision Pro. It was years ago; maybe six, seven, or even eight. Before the company built Apple Park, where we’re sitting right now, at a bleached oak table in this incredible circular edifice of a building clad in miles of curved glass. It’s been raining, and the clouds are clearing over the pine trees and the rows of citrus and maple trees, and the sun is reflecting off the pond in the meadow, and it’s kind of mesmerizing. And Cook’s telling me about that time, all those years ago, in his dulcet Robertsdale, Alabama, accent, when he first saw it. It was at Mariani 1, a nondescript low-rise building on the edge of the old Infinite Loop campus with blacked-out windows. This place is so secret, it’s known as one of Apple’s “black ops” facilities. Nearly all of the thousands of employees who work at Apple have never set foot inside one. There are multiple layers of doors that lock behind and in front of you. But Cook is the CEO and can go anywhere. So he strolls past restricted rooms where foldable iPhones and MacBooks with retractable keyboards or transparent televisions were dreamed up. Where these devices, almost all of which will never leave this building, are stored in locked Pelican cases inside locked cupboards. This building, after all, is folklore to Apple. It’s where the iPod and the iPhone were invented. This same building, where Cook finds the industrial design team working on this thing virtually no one else knows exists. Mike Rockwell, vice president of Apple’s Vision Products Group, is there when Cook enters and sees it. It’s like a “monster,” Cook tells me. “An apparatus.” Cook’s told to take a seat, and this massive, monstrous machine is placed around his face. It’s crude, like a giant box, and it’s got screens in it, half a dozen of them layered on top of each other, and cameras sticking out like whiskers. “You weren’t really wearing it at that time,” he tells me. “It wasn’t wearable by any means of the imagination.” And it’s whirring, with big fans—a steady, deep humming sound—on both sides of his face. And this apparatus has these wires coming out of it that sinuate all over the floor and stretch into another room, where they’re connected to a supercomputer, and then buttons are pressed and lights go on and the CPU and GPU start pulsating at billions of cycles per second and…Tim Cook is on the moon! He’s sitting right there. On the fucking moon! With Buzz Aldrin and Neil Armstrong of Apollo 11, he looks around and there’s the ghostly luminescence of ancient dust under a black, star-studded sky. It’s magnificent. It’s amazing. There, in the distance, is the earth. The blue dot. Where all of this magic is happening. But Cook’s not just on the moon. He’s also in that secret room. In that secret building. And he can see Rockwell and other Apple employees, and he can see his own hands. And he knows right then and there what this all means. Like the universe is telling him something. He knows that this is the future of computing and entertainment and apps and memories, and that this crude apparatus wrapped around his head will change everything. He knows Apple has to make this thing its next product category. “I’ve known for years we would get here,” says Apple CEO Tim Cook. “I didn’t know when, but I knew that we would arrive here.” What Cook didn’t know is how his engineers were going to take this thing that needs a supercomputer in another room, and fans and multiple screens, and shrink it down to the size of a pair of goggles that weighs a little more than a box of spaghetti. “I’ve known for years we would get here,” Cook told me. “I didn’t know when, but I knew that we would arrive here.” Now that time is finally here. The first Vision Pro, in a perfect white cube the size of a large shoebox, will arrive in stores on Friday, with tens of thousands of Apple obsessives and early adopters already having preordered it. Of course, the niche crowd is easy. What Cook and his army of executives know is that the company still has to convince everyone else that, in their own daily lives, for work or entertainment or meditating or capturing the most surreal family memories, or all of the above, they need to spend $3,500 on a spatial computer. A headset that makes you look, as a friend put it, like “you’re going skiing in the Matrix,” and on which you can’t access popular apps like Netflix and YouTube—at least not yet. It won’t be hard to get people to try the Apple Vision Pro; buying it may be another story. Though fortunately for Apple, seemingly anyone who has strapped one on prior to Friday’s launch is preaching with the zeal of the converted about all the wondrous things it can do. “I would say my experience was religious,” the director James Cameron told me when I asked him about his first encounter with the Apple Vision Pro. “I was skeptical at first. I don’t bow down before the great god of Apple, but I was really, really blown away.” Another prominent filmmaker, Jon Favreau, offered a similar sentiment, telling me he was “blown away” by the technology and what it will do to storytelling. (Favreau created content for Apple specifically to showcase the device’s 3D capabilities, where a dinosaur climbs out of a screen and looks like it wants to eat you.) “I’m excited by what kind of story I can tell now that I couldn’t tell before now,” he said. And when I called Om Malik, who has been writing about tech since tech reporters used to write about calculators, he was even more effusive. “It’s amazing! It’s incredible!” he enthused. “You can feel a vibration in the universe!” Everyone else I’ve spoken to who has had a chance to try out the Apple Vision Pro: investors (“Whoa!”) and designers (“Wow!”) and analysts (“Ooh!”) and producers (“Ahh”). I was thinking about all of those whoas and wows and oohs and ahhs as I walked up to the Steve Jobs Theater, a round building with walls made of nothing but glass that hold up a massive cylindrical roof that looks like it’s resting on air. It was my first time visiting “SJT,” as they call it, an homage to the man, the legend, the guy who dreamed all of this up. An Apple employee walked out holding a Pelican case the size of a lunch box, and I knew what was inside. Yeah, it’s one of those. And seeing him reminded me that when I had first spoken to Apple months earlier, I had absolutely no desire to try what was inside that case. Zero interest. Not an inkling. I didn’t watch Cook’s June keynote about the Apple Vision Pro. I didn’t read the dissecting blog posts or the uninformed conjecture on social media. I just kept scrolling, like I do when I see anything about Harry and Meghan. I told Cook this as I sat with him in the same room where he did that keynote, because I’ve seen this play before, and I know what the first act is like, and the second act, and I know how it ends. This was as far from a VR headset as a kid’s Schwinn bicycle is from a Gulfstream G800 private jet. Back in 2013, in a conference room in Los Angeles, I strapped an Oculus VR headset to my head for the first time. (Oculus, a well-funded start-up, would later be purchased by Facebook, which would later rename itself Meta.) It was cool, sure. I offered my proverbial “wow” and gave out a few oohs and aahs as I played a video game with brutalist square-edged graphics that looked like Pablo Picasso had smoked too much opium and designed a digital world. But after a few minutes I felt claustrophobic, and by the intermission I was mired in an existential crisis that maybe I had stopped inhabiting the real world because I could only see myself in the virtual one. Over the last decade, as the graphics became smoother and the chips faster, the same thing kept happening with each new VR device. Rift, Vive, Quest, Quest 2, and Quest 3. I used them all once or twice, and then they went into a drawer or a cupboard or a box in my basement because I didn’t want to feel the claustrophobia of putting something on my face. Then last August, I was invited to Apple’s Los Angeles office, formally the home of Beats, to experience what I thought would be yet another VR device. I was sitting in a sleek room with white oak furniture and polished floors, and all I was thinking about was how long it would take me to get home, and whether I’d take the local streets because the 405 by that hour is just a nightmare. I sat on this gray couch, and an Apple employee told me to reach out and grab the Apple Vision Pro in front of me and place it on my head, which I did, reluctantly, just wanting to get this over with, and then—as I expected—the world disappeared, as it always does with VR headsets. But that only lasted for a few seconds, because a digital curtain pulled back and behind it was the real world. I could see my arms and legs, and then the Apple app icons popped up in front of me like a multicolored apparition. This was as far from a VR headset as a kid’s Schwinn bicycle is from a Gulfstream G800 private jet. Just as when I scrolled my finger around the wheel of the first iPod or used my finger and thumb to zoom into an image on the first iPhone. With the Vision Pro, I could look at an app icon and simply tap my fingers together, and the app would open. And then it was hanging in front of me. In the clearest resolution I’d ever seen in my life. I could swipe through images with my hands, move things with my fingers. Unlike other VR headsets, where you have to use a controller that feels like you have lobster claws for hands, with the Apple Vision Pro your eyes become the mouse absolutely seamlessly. “It’s mind-blowing,” Cook said to me when I told him about my experience. “We live in a 3D world, but the content that we enjoy is flat.” During that first demo I went to the iconic Mount Hood stratovolcano in Oregon, and I could hear and see a million raindrops falling into Mirror Lake, so much so that I felt like I was there, and the only thing missing was the earthy scent of rain-soaked soil. I interacted with graphics in midair that were crisper than anything I’d ever seen before. And I touched them all with my fingers, not a mouse or keyboard. I saw spatial videos for the first time. To say this feature is astounding is an understatement. You actually feel like the person is in front of you and you can reach out and touch them. I saw clips of movies that were 100 feet wide, sharper and clearer than any IMAX. But most importantly, I saw the world around me. That very room. I didn’t feel closed off or claustrophobic. I was there. I was everywhere, all at once. I left the Apple offices that day and went to a nearby coffee shop, and when I opened my laptop, a relatively new computer, it felt like a relic pulled from the rubble of a Soviet-era power plant. “You know, one of our most common reactions we love is people go, ‘Hold on, I just need a minute. I need to process what just happened,’” said Greg “Joz” Joswiak, Apple’s senior vice president of worldwide marketing, as we ate lunch at Apple Park. “How cool is that? How often do people have a product experience where they’re left speechless, right?” “I was skeptical at first,” says director James Cameron. “I don’t bow down before the great god of Apple, but I was really, really blown away.” I wasn’t really left speechless until the second demo. A few months after my initial experience, I went back to the LA offices. Two Apple employees led me into a room. I put on the Apple Vision Pro and the curtain opened and I was looking at them. The only difference this time was I had a cup of tea with me. In the middle of this new demo, I reached down and grabbed the tea and I took a sip, and as I did, one of my fingers flickered, like I was in a simulation no different from reality and there was a glitch. “Wait, what am I seeing?” I asked, confused. “Are you real? Or…” “No, you’re seeing a video of us that’s being rendered in real time,” one of the employees explained. I sat there for a moment, speechless. I had thought what I had been seeing was the real world, and that all the digital wonder was layered on top of that. That the Apple Vision Pro was transparent and there was a layer of technology on top of it. In reality, it was the other way around. “I think it’s not evolutionary; it’s revolutionary,” Cameron said to me when I told him about my experience. “And I’m speaking as someone who has worked in VR for 18 years.” He explained that the reason it looks so real is because the Apple Vision Pro is writing a 4K image into my eyes. “That’s the equivalent of the resolution of a 75-inch TV into each of your eyeballs—23 million pixels.” To put that into perspective, the average 4K television has around 8 million pixels. Apple engineers didn’t slice off a rectangle from the corner of a 4K display and put it in the Apple Vision Pro. They somehow compressed twice as many pixels into a space as small as your eyeball. This, to people like Cameron who have been working in this space for two decades, “solves every problem.” But even with all this wonder, with 23 million pixels that are so clear and crisp that you can’t tell reality from a digital composite of it, there are some problems Apple hasn’t solved—at least not yet. There’s an old story about Steve Jobs that has become folklore in Silicon Valley. It takes place about 25 years ago, in that same nondescript black ops building, Mariani 1, where Cook would see the first Apple Vision Pro prototype years later. Back then, in the late ’90s, Jobs had a team of engineers building the first iPod. They’re toiling away, bending physics and doing engineering acrobatics to make the smallest prototype of an iPod they can squeeze into a box. Finally, when it can’t get any smaller, they take it to Jobs. Now, these prototypes cost millions of dollars, sometimes more, and Jobs looks at it, he inspects it, and he says it needs to be smaller. The engineers say it’s as small as it can get, and Jobs walks over to a fish tank and drops the prototype in—splash! And as it drowns, Jobs says, “You see those air bubbles? That means you can make it smaller.” “You’ve got your M2 chip here…R1 chip…near zero latency…5,000 patents…seven years…” Richard Howarth, the vice president of industrial design, said in a thick Leicester accent as he pointed to the dozens of disassembled components splayed out in front of me, all of which made up the cadaver of the Apple Vision Pro. And yet, all I could think about was the fish story and that iPod prototype, and whether Jobs, if he were alive today, would throw the Apple Vision Pro into a fish tank and say, “There’s bubbles. Make it smaller!” If there’s one consistent grumble about the Apple Vision Pro, it’s about the size and weight. It’s around 20 ounces, which might not sound like a lot, because you cook with ounces, you don’t necessarily wear them. But that’s the same as five sticks of butter—imagine walking around with five sticks of butter on your face all day. Carolina Cruz-Neira, a pioneer of virtual reality, told me that the way a device sits on your face really impacts how you respond to the technology. “I’ve been working in VR for over 30 years, and until we can get the scuba diving mask off your face and we make it less noticeable, we’re not going to make this a mass-adoption technology,” Cruz-Neira said. “And the size and weight of these scuba diving masks are not going to be solved in a year.” It’s largely this question that will determine if the Apple Vision Pro will be a financial success. While Apple execs would only tell me “we’re excited” about the sales numbers so far, Wall Street analysts believe the company sold around 180,000 units in the opening weekend of online preorders. Morgan Stanley anticipates that sales will ramp up to 2 million to 4 million units a year over the next five years, and it will become a new product category for the company. But others, like Ming-Chi Kuo, an Apple supply chain analyst, thinks it’s going to remain a niche product for some time. Almost all the analysts I spoke with believe it will eventually get there. “We think a few years from now it’ll resemble sunglasses and be less than $1,500,” Dan Ives, a senior analyst at the investment firm Wedbush Securities, told me. “It feels like we’ve reached into the future and grabbed this product,” says Greg Joswiak, Apple’s senior vice president of worldwide marketing. “You’re putting the future on your face.” I didn’t even have to ask Howarth about the weight; he brought it up himself. But he did so as he explained that this component and that component are made of magnesium and carbon fiber and aluminum (he pronounced it a-loo-min-e-um, not a-loo-min-um, which I respected as a Brit myself), and he noted that these are the lightest materials on earth, and that there is no more diminutive alternative. “There’s nothing we could have done to make it lighter or smaller,” Howarth explained. “This is the state of the art.” Everyone else I spoke to at Apple proffered a similar sentiment. “It feels like we’ve reached into the future and grabbed this product,” Joswiak said to me. “You’re putting the future on your face.” As did Rockwell, who told me: “We packed just about as much technology as you could possibly pack into that small of a form factor.” “You can actually lay on your sofa and put the displays on your ceiling if you wish,” Cook told me. “I watched the third season of [Ted] Lasso on my ceiling and it was unbelievable!” When I got home and hooked up my own Apple Vision Pro, I watched Ford v Ferrari on my ceiling, and with the spatial audio it felt like Ken Miles’s Ford GT40 was in the room with me. “I think meditation is on a different level than anything I’ve ever experienced, and I’ve meditated for a long time,” Cook said. I’ve always had trouble meditating, and he was right about that too. “And I use it for productivity,” Cook told me. Typing with the Apple Vision Pro virtual keyboard is a little like trying to write with a pen between your toes. Not impossible but impractical. But when I opened my MacBook Pro while wearing the Vision Pro, the screen popped into my augmented reality and I was able to work pretty seamlessly. I’m actually writing these words here, the ones you’re reading, on the Vision Pro using the MacBook, and all I can say is I bet if you were watching me now you’d think I looked just like Tom Cruise in Minority Report, only slightly more handsome. And then there’s those spatial videos. I’ve recorded and watched dozens of spatial videos of my kids just playing and talking, reliving moments that seem mundane but when played back are so emotionally immersive, it’s like stepping into a living, breathing memory. Again, it’s hard to describe how realistic the environments feel, but I’ve found myself periodically returning to Mirror Lake, turning off all my notifications, and just sitting there at the edge of the water, peacefully watching and listening to the rain for 5 or 10 minutes before returning to work. There are plenty of quirks using the device. One of my favorites is when you use the Vision Pro in one room and then go to another, open the same app, and you have to find it by looking all around the room; sometimes it’s on the ceiling or the floor. I couldn’t find my text app the other day and turned around to find it was in my bathroom. (I later learned you can reset the apps by pressing the digital crown for a few seconds.) But the more I’ve used the Apple Vision Pro over the past two weeks, the more one glaring problem revealed itself to me. It’s not the weight (which is a problem but will come down over time), or the size (which will shrink with each iteration), or the worry that it will drive us to consume more content alone (almost half of Americans already watch TV alone). Or how tech giants like Meta, Netflix, Spotify, and Google are currently withholding their apps from the device. (Content creators may come around once the consumers are there, and some, like Disney, are already embracing the device, making 150 movies available in 3D, including from mega-franchises like Star Wars and Marvel.) And it’s not even the price, because if Apple wanted to, the company could subsidize the cost of the Apple Vision Pro and it would have about as much financial impact as Cook losing a nickel between his couch cushions. I’m talking about something that I don’t see a solution for. I first recognized the problem when I was at Apple Park, in the basement offices of SJT. I was seeing yet another demo, this time in Joshua Tree, where I sat in the striking desert silhouette of the arid landscape. I played Fruit Ninja, where I got to slice fruit with my bare hands. Then I tried a DJ app, where a turntable opened in front of me and I could slide the fader, tweak the mixer, and scratch the records, and I summoned a disco ball that magically clung to the ceiling as animated ravers danced around me. “I’m sure the technology is terrific. I still think and hope it fails,” says one Silicon Valley investor. “Apple feels more and more like a tech fentanyl dealer that poses as a rehab provider.” In the middle of my DJ set, an Apple employee said it was time to wrap up. I took the Apple Vision Pro off, and that’s when it hit me. The problem. It happened again at home, scrolling through the spatial videos I’ve taken of my kids over the last few weeks, seeing them as if they’re actually in front of me. And it’s going to happen in a few minutes, when I finish writing this article and the Word document in front of me the size of an IMAX screen goes away. When I take it off, every other device feels flat and boring: My 75-inch OLED TV feels like a CRT from the ’90s; my iPhone feels like a flip phone from yesteryear, and even the real world around me feels surprisingly flat. And this is the problem. In the same way that I can’t imagine driving a car without a stereo, in the same way I can’t imagine not having a phone to communicate with people or take pictures of my children, in the same way I can’t imagine trying to work without a computer, I can see a day when we all can’t imagine living without an augmented reality. When we’re enveloped more and more by technology, to the point that we crave these glasses like a drug, like we crave our iPhones today but with more desire for the dopamine hit this resolution of AR can deliver. I know deep down that the Apple Vision Pro is too immersive, and yet all I want to do is see the world through it. “I’m sure the technology is terrific. I still think and hope it fails,” one Silicon Valley investor said to me. “Apple feels more and more like a tech fentanyl dealer that poses as a rehab provider.” Harsh words, but he feels what we all feel, a slave to our smartphone, and he’s seen this play before and he knows what the first act is like, and the second act, and he knows how it ends. I didn’t ask Cook about this because I didn’t realize it all until days later, but I did ask him if technology is moving too quickly. If all of it, AI, spatial computing, and our reliance on technology, if it’s all too much. “What does the future of it all look like?” I asked Cook. “I think it’s hard to predict exactly,” he replied. “But you’re making it,” I said. “So don’t you get to predict it?” “What we do is we get really excited about something and then we start pulling the string and see where it takes us,” Cook told me. “And yes, we’ve got things on the road maps and so forth, and yes, we have a definitive point of view. But a lot of it is also the exploration and figuring out.” He concluded, “Sometimes the dots connect. And they lead you to some place that you didn’t expect.” (Letting connected dots lead the way was a theme Cook’s predecessor used to talk about.) The question is, is the place we’re about to go, into the era of spatial computing, going to make our lives better, or will it become the next technology that becomes a necessity, where we can’t live in a world that’s not augmented? I think Joswiak had it half right when he said, ​​“It feels like we’ve reached into the future and grabbed this product. You’re putting the future on your face.” I think it’s the other way around. Apple is taking us into the future, into a new era of computing. Some of us are running as fast as we can to get there, and others are being dragged, kicking and screaming. But we’re all going. We’re going to the moon, and we’re going to look around at the ghostly luminescence of ancient dust under a black, star-studded sky, and we’ll just know that this is the future of computing and entertainment and apps and memories, and that this apparatus wrapped around our head will change everything. Anne Hathaway on Tuning Out the Haters and Embracing Her True Self Rose Hanbury Sends Legal Notice to Stephen Colbert After His Affair Joke The Confessions of an Art Fraudster Extraordinaire The Evolving Power of the Princess of Wales The Best TV Shows of 2024, So Far From the Archive: The Fatal Mauling of the Man Who Loved Grizzlies (2004) Stay in the know and subscribe to Vanity Fair for just $2.50 $1 per month. By Joe Reid By Anthony Breznican By Laura Regensdorf By Anthony Breznican More from Vanity Fair Contact © 2024 Condé Nast. All rights reserved. Vanity Fair may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Entertainment "
}