{
    "title": "Spotify needs every win against Apple it can get",
    "date": "2/21/2024",
    "url": "https://www.theverge.com/2024/2/21/24079617/spotify-apple-app-store-eu-iheart",
    "text": "By  Ariel Shapiro, lead reporter of Hot Pod, a newsletter covering podcasting and the audio industry. She previously worked at Forbes, where she covered media and entertainment. If you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement. This is Hot Pod, The Verge’s newsletter about podcasting and the audio industry. Sign up here for more. Hello! Today, I have a look at what Europe’s regulatory moves against Apple mean for Spotify, and podcasting more broadly. Plus, a lightning round featuring all kinds of audio stories from the purely business (a cash influx at iHeart) to the delightfully criminal (a missing radio tower). As a heads-up, I will not be publishing Hot Pod next week due to Hot Pod Summit and On Air Fest. Insiders, I’ll be back on Friday. As for the rest of you, I’ll see you in March. If this turns out to be true, it would be a big win for Spotify in its perpetual battle with Apple. In 2019, Spotify filed a complaint against Apple with the European Commission, the EU body that deals with antitrust issues, claiming that it was clamping down on rival music services with its App Store fees. The Financial Times and Bloomberg both reported that the EU plans to fine Apple €500 million — not so much as to hurt the $2.8 trillion company in a material way, but enough to signify that the Commission is no longer tolerating its business practices. The Financial Times also says Apple could be banned from putting restrictions on music services that would stop it from letting users switch to cheaper payment options. The details are vague for now, but such a ruling could potentially carve out more space for Spotify to operate on iOS within the European Union — even as the EU’s new legal regime starts to open things up in other respects. These reports come at a key time. Apple is being regulated as one of six “gatekeeper” tech companies that will have to comply with the EU’s Digital Markets Act. Under the DMA, Apple will be required to open up its tightly controlled app ecosystem in order to foster competition from smaller developers. Spotify, in particular, is planning for a future in which Apple cannot slap a 30 percent fee on all digital transactions, which could have a huge upside for Spotify’s subscription and audiobook businesses. Apple introduced changes last month in order to be compliant with the DMA, including support for alternative browser engines and app stores, as well as an alternative regime that includes reduced App Store fees and more flexibility for developers. But Apple has been accused by developers and fellow gatekeepers of making it onerous for third parties to use those new features (particularly thanks to a new €0.50 fee per app install after the millionth install). Companies still have to pay Apple — potentially quite a bit — to skirt that 30 percent tariff and use their own payments systems. Apple even ended support for progressive web apps on iPhones, in what is being viewed as a bad faith move. If Apple’s changes are ruled to not be enough, the EU can fine the company up to 10 percent of its annual turnover. Considering it made $383 billion last year, a fine like that would make $540 million look like a slap on the wrist. The outcome of this regulatory battle could have a big impact on the podcast space. If smaller audio companies’ apps are better able to attract iPhone users, we could see real innovation in the space. Plus, without the App Store tax, podcasters and podcast platforms could have more ways to make money beyond ads (which, as we have seen, are not enough to support the ambitions of the industry). Apple is certainly not moving toward that future quietly, but the EU’s decision to fine them at least shows that regulators there are serious about holding the company accountable. That’s all for now! / News and analysis on the biggest events in audio. Subscribe to Hot Pod Insider for full access and three editions each week. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}