{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.livemint.com/technology/tech-news/apple-vision-pro-makes-it-to-bengaluru-streets-netizens-pour-comments-11707819527332.html",
    "text": "All heads in the streets of Bengaluru turned to see the new spectacle, the Apple Vision Pro. The latest gadget in the tech-savvy city sparked conversation among netizens as picture of a man wearing the new headset and testing the virtual reality device went viral. In the everyday traffic and the hustle bustle of the busy city, a techie named Varun Mayya was captured on the streets of Indiranagar, navigating along the sidewalk with the Apple Vision Pro. The device, which is Apple's first 3D camera, was launched earlier this year. It was announced at the Worldwide Developers Conference last year. Sharing the picture on microblogging website, X, Ayush Pranav wrote, “bumped into @waitin4agi_ while he was playing around with his vision pro on the streets of Indiranagar. gotta be a @peakbengaluru moment.\" The post went viral almost immediately and the internet dubbed it as a quintessential \"Peak Bengaluru\" moment. One user said she'd sprint away if she ever encountered a human with Vision Pro on streets. \"Forget man, if I see any such human at s public place ama sprinting away next second\" While other user was concerned about what's coming next for the eye doctors. \" Eye doctors better be prepared for what’s coming.\" Comments like someone will run away with the gadget, and words of caution over potholes were also making rounds on the internet. \"Dont try in Koramangala. Full of potholes,\" a comment read. \"Koi utar ke na bhag jaye,\" read another. The Apple Vision Pro, priced at  ₹2.8 lakh, is garnering attention not only for its advanced features but also for attracting daring adventurers who are bringing virtual experiences into reality. Its recent launch on the streets of Bengaluru is not just a viral sensation; it underscores the city's tech enthusiasm and thirst for innovation. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}