{
    "title": "Handful of owners report spontaneous Vision Pro glass cracks",
    "date": "2/23/2024",
    "url": "https://9to5mac.com/2024/02/23/vision-pro-glass-cracks/",
    "text": "A handful of owners have reported spontaneous Vision Pro glass cracks while the device was simply left overnight (see photo below) … Apple Insider describes “multiple” reports, linking to three Reddit posts, two of which are by the same person with a photo of the same headset. Multiple users on Reddit have shared images of a clean-cut shear in their Apple Vision Pro front glass appearing for reportedly no reason […] Prominent Reddit posts share similar images of sheared glass right at the nose bridge […] Each account claims they left the Apple Vision Pro connected to the battery pack and stored it overnight. One user said that Apple told them the full cost of a glass repair would be $800, but they would instead be charged the $300 AppleCare deductible. This is one of those ‘we’re covering it because it will generate coverage elsewhere’ pieces – where it can easily lead to sensational headlines unless reported responsibly. To be clear, the AI report itself falls into the latter category. The site acknowledges that with an estimated 200k Vision Pro units sold, two or three reports are pretty meaningless. If there is a manufacturing defect which could cause this to occur, then it’s likely to show up in more units. As of right now, there’s likely nothing to see here. If that changes, we’ll get to know about it. Stock photo by Igor Omilaev on Unsplash FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Ben Lovejoy is a British technology writer and EU Editor for 9to5Mac. He’s known for his op-eds and diary pieces, exploring his experience of Apple products over time, for a more rounded review. He also writes fiction, with two technothriller novels, a couple of SF shorts and a rom-com! "
}