{
    "title": "Apple imported 9 million units of phones in 2023 to India, market share \ngrows 38.6%",
    "date": "2/14/2024",
    "url": "https://www.newindianexpress.com/business/2024/Feb/14/apple-imported-9-million-units-of-phones-in-2023-to-india-market-share-grows-386",
    "text": "NEW DELHI: Apple shipped nearly 9 million units of mobile phones in India in 2023, despite having the highest ASP (Average Selling Price) of $940, according to the latest report released by the International Data Corporation (IDC) on Tuesday. Apple's market share in India grew from 4.6% in 2022 to 6.4% in 2023, a 38.6% increase. This growth was led by previous generation iPhone models and its push for local manufacturing. Apple's iPhone 13/14 were amongst the top 5 shipped models annually. However, in terms of market share, South Korean built Samsung still dominates with 17% market share in the smartphone segment. However, it experienced a 5% shipment decline Year-on-Year and its ASP stands at $338. Its Galaxy A14 was the highest shipped device of 2023. According to a report by IDC, in the super-premium segment, above $800, overall, Apple led the segment with a share of 68%, followed by Samsung at 30%. Apple’s iPhone 14/13/14 Plus together accounted for 54% of shipments, followed by the Galaxy S23+/S23/S22+/S23 Ultra with a 22% share of Samsung. Overall, India’s smartphone market recorded a nominal growth of 1% year-over-year in shipments, reaching 146 million units at the end of 2023. The second half of the year grew by 11% YoY in 2H23, compensating for the sharp 10% decline in the first half. The fourth quarter of 2023 (calendar year) grew by 26% YoY with shipments of 37 million units, as the second half of the quarter saw stronger-than-expected shipments with several new model launches. “Most brands chose to reduce prices and offer additional channel margins in the last quarter to manage the inventory levels from post festive cyclic dip. This will give a lukewarm start to 2024 with cautious stocking by the channels,” said Upasana Joshi, Research Manager, Client Devices, IDC India. In terms of market share, Chinese mobile maker Vivo took the second spot with 15.2%, followed by Realme, Xiaomi, and Oppo with 12.5%, 12.4%, and 10.3%, respectively. Another positive trend was the revival of the feature phone segment, which witnessed an 8% annual growth after four consecutive years of decline. This growth was primarily driven by the launch of Reliance Jio's new 4G feature phone in the second half of 2023. Follow The New Indian Express channel on WhatsApp Download the TNIE app to stay with us and follow the latest  Copyright - newindianexpress.com 2024. All rights reserved.  "
}