{
    "title": "Apple Abandons Plans for In-House Development of MicroLED Displays for \nApple Watch",
    "date": "3/22/2024",
    "url": "https://www.mactrast.com/2024/03/apple-abandons-plans-for-in-house-development-of-microled-displays-for-apple-watch/",
    "text": "Apple has dropped its plans to develop microLED displays in-house, according to Bloomberg’s Mark Gurman. Gurman’s comments mark a reversal of his previous reports about Apple’s development of the microLED technology. Apple had invested billions in the development of the microLED display, which the company had intended to use first on the Apple Watch Ultra. The technology turned out to be too complex and expensive for Apple to handle in-house, and the Cupertino company is now reorganizing its display engineering teams, which includes laying off employees in both Asia and the U.S. While some employees will likely move to other roles in the company, some will receive a severance package. This isn’t the first report about Apple terminating the microLED project. In February, Apple supplier ams OSRAM on Wednesday announced it would “re-assess its microLED strategy” after a “cornerstone project” was “unexpectedly cancelled” that day. Following that announcement, the company’s stock plunged precipitously (40%) While neither ams Osram nor Apple has ever publicly confirmed that the Austrian firm supplies microLED displays for the upcoming Apple Watch Ultra 3. However, past reports have linked the two companies. In 2023 it was reported that the company would see increased revenues in 2025, when the Apple Watch Ultra 3 with the technology was expected to debut. In March, Apple industry analyst Ming-Chi Kuo commented on the situation, and confirmed that Apple had indeed canceled the project for the “foreseeable future.” The analyst said that microLED production costs are currently “too high” for the project to be “economically viable.” “My latest survey indicates that Apple has canceled the Micro LED Apple Watch projects because Apple thinks that Micro LED can’t add significant value to this product, and the production costs are too high to make it economically viable,” said Kuo. ams OSRAM was Apple’s exclusive LED chip supplier for the project at the time it was canceled, says Kuo. He said Apple has “no plans” to mass-produce microLED devices for the “foreseeable future.” microLED display technology has several advantages over OLED displays, including higher brightness, decreased power consumption, improved contrast ratio, and other benefits. There is also much less risk of screen burn-in, and microLEDs have a longer potential lifetime. Gurman says Apple will use OLED display technology for the Apple Watch “for now,” but that the company is “eyeing microLED for other projects down the road,” and is “identifying” potential new suppliers and processes for microLED, but it “won’t likely happen anytime soon.” "
}