{
    "title": "Apple canceling the development of Apple Car caused no fluctuation in the \nstock market",
    "date": "3/2/2024",
    "url": "https://www.thetechoutlook.com/news/business/apple-canceling-the-development-of-apple-car-caused-no-fluctuation-in-the-stock-market/",
    "text": "The Tech Outlook - Daily Tech News, Interviews, Reviews and Updates Apple’s electric car project known as Project Titan has been going on for years now and the company has also invested a lot of money in this decade-long project. The company was planning to introduce a fully autonomous electric vehicle but now surprisingly this project has been terminated by the company. It is said that the company had faced numerous challenges in this project and had finally decided to shut it down. This decision by Apple has received mixed reactions on social media platforms According to MacRumors some employees within the company have suspected this project and referred to the car as “The Titanic Disaster” rather than “Project Titan.” Although it was expected that Apple’s decision might also cause havoc in the stock market @mingchikuo revealed on the X platform that it might seem like a big deal, but no stock in the world has gone up or down after this decision. He also stated that this shows the stock markets have since long stopped caring whether Apple wants to make the Apple Car or not. As per reports, employees working on this project will be shifted to work on generative artificial intelligence. Apple has not officially commented anything on the shutdown of this decade-long project. Xiaomi Unveils its SU7 EV Models in China: Check Out its Key Features, Price, and… Xiaomi’s first EV vehicle- SU7 all set to launch on 28th March,2024 in China Nothing Phone (2a) Sale Commences in India: More than 60,000 units sold in just one… Huawei signs a Global Patent Cross Licensing Agreement with smartphone brand Vivo Reviews Samsung Galaxy A55 vs OnePlus 11R: Is the Latest Galaxy A55 the Better Smartphone? Honor X9b review: Tough display, long battery life makes it a… Samsung Galaxy A25 5G vs Motorola Edge 40 Neo: A Spec Comparison Tecno Camon 20 Pro 5G vs Infinix GT 10 Pro: Which is the Best… Realme GT 5 Pro VS OnePlus 11R: Is the Latest GT 5 Pro the Better… Moto G24 Power VS Redmi Note 13 4G: Which is the Best 2024 Budget… Xiaomi Redmi 13C 5G vs Motorola Moto G54 5G: A Spec Comparison TOZO HT2 Hybrid Active Noise Cancelling Wireless Headphones Review:… Realme 11 Pro 5G vs Samsung Galaxy A25 5G: Is the Latest Galaxy A25 5G… Tozo Open Buds TWS Review: A Heavy Contender in Design, Sound, and… Editor's Pick Avatar: The Last Airbender, live-action series, developed by… Mea Culpa, upcoming American legal thriller film, directed… Reviews Samsung Galaxy A55 vs OnePlus 11R: Is the Latest Galaxy A55… Honor X9b review: Tough display, long battery life makes it… This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish.\nAccept\nRead More "
}