{
    "title": null,
    "date": "3/29/2024",
    "url": "https://www.apple.com/education/k12/success-stories/scottish-borders/",
    "text": "Make a smart investment by bringing Apple to your school or your entire district. For help with sales,call Apple Education at 1-800-800-2775. Create an account to buy Apple products with your education discount or sign in to your store. Apple Financial Services can provide financing options, discuss special pricing, and review purchase agreements by state to determine your school’s eligibility. The Scottish Borders Council decided to invest in technology for all schools across their district as a commitment to the community’s future. They wanted to give students equal access to learning and provide educators with intuitive, easy-to-use tools for teaching. They needed devices that worked as well offline as they did online to overcome barriers caused by remote access in their rural area. And they knew that the young people in their community had to develop vital skills to thrive in an increasingly digital world. The council considered Apple alongside every alternative. With its wide range of features and professional learning resources, iPad stood out as the best tool for teaching and learning. They created a plan called “Inspire Learning” that led to financing and deployment of thousands of devices across the 1,800-square-mile region. “We wanted to demonstrate the value that we placed upon education,” says David Robertson, Chief Financial Officer of the Scottish Borders Council. “We looked at the total cost of ownership: the initial cost of the devices, the residual value that we could get from them, the leasing deal with Apple Finance. To us, Apple offered the best value for the money.” Learn more in another video. David Robertson describes how iPad was the most cost-effective option. After implementing iPad and Apple Professional Learning across 68 primary and secondary schools, educators saw an enormous change in their classrooms. With iPad, educators were creating more interactive lessons than ever before. Its mobility allowed for immersive learning experiences from anywhere, including at home throughout the pandemic. And its versatility supported the entire curriculum — from horticulture lessons where students use Clips to make movies about native plants to English lessons where they use Keynote to bring stories about Macbeth to life. Apple products and resources are designed to make learning personal, creative, and inspiring. "
}