{
    "title": "Apple Inc. (NASDAQ:AAPL) Stock Position Boosted by Axxcess Wealth \nManagement LLC",
    "date": "3/13/2024",
    "url": "https://www.defenseworld.net/2024/03/13/apple-inc-nasdaqaapl-stock-position-boosted-by-axxcess-wealth-management-llc.html",
    "text": "Posted by Defense World Staff on Mar 13th, 2024 Axxcess Wealth Management LLC increased its holdings in shares of  Apple Inc. (NASDAQ:AAPL – Free Report) by 66.8% during the 3rd quarter, HoldingsChannel.com reports. The institutional investor  owned 403,296 shares of the iPhone maker’s stock after purchasing an additional 161,513 shares during the quarter. Apple comprises about  2.3% of Axxcess Wealth Management LLC’s investment portfolio, making the stock its 6th biggest holding. Axxcess Wealth Management LLC’s holdings in Apple were worth $66,887,000 at the end of the most recent reporting period. Several other large investors have also recently added to or reduced their stakes in the business. Kingdom Financial Group LLC. raised its holdings in shares of  Apple by 5.5% in the 3rd quarter. Kingdom Financial Group LLC. now owns 11,464 shares of the iPhone maker’s stock worth $1,963,000 after purchasing an additional 598 shares during the period.  RFG Advisory LLC raised its holdings in shares of  Apple by 13.6% in the 3rd quarter. RFG Advisory LLC now owns 172,823 shares of the iPhone maker’s stock worth $29,589,000 after purchasing an additional 20,737 shares during the period.  Tsfg LLC raised its holdings in shares of  Apple by 2.2% in the 3rd quarter. Tsfg LLC now owns 50,943 shares of the iPhone maker’s stock worth $8,722,000 after purchasing an additional 1,091 shares during the period.  State Street Corp raised its holdings in shares of  Apple by 0.5% in the 2nd quarter. State Street Corp now owns 578,897,858 shares of the iPhone maker’s stock worth $112,288,818,000 after purchasing an additional 2,616,084 shares during the period.  Finally, Private Wealth Partners LLC raised its holdings in shares of  Apple by 3.8% in the 3rd quarter. Private Wealth Partners LLC now owns 673,349 shares of the iPhone maker’s stock worth $115,284,000 after purchasing an additional 24,634 shares during the period. 58.51% of the stock is currently owned by hedge funds and other institutional investors. Shares of NASDAQ AAPL opened at $173.23 on Wednesday. The company has a market cap of $2.67 trillion, a price-to-earnings ratio of 26.98, a price-to-earnings-growth ratio of 2.06 and a beta of 1.29. Apple Inc. has a 12-month low of $147.70 and a 12-month high of $199.62. The company has a current ratio of 1.07, a quick ratio of 1.02 and a debt-to-equity ratio of 1.28. The stock’s 50 day simple moving average is $184.00 and its 200 day simple moving average is $183.55. Apple (NASDAQ:AAPL – Get Free Report) last announced its quarterly earnings results on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share (EPS) for the quarter, topping the consensus estimate of $2.09 by $0.09. The business had revenue of $119.60 billion for the quarter, compared to the consensus estimate of $117.99 billion. Apple had a return on equity of 156.04% and a net margin of 26.16%. The business’s revenue was up 2.1% on a year-over-year basis. During the same quarter last year, the business posted $1.88 EPS.  Equities research analysts expect that  Apple Inc. will post 6.55 EPS for the current year. The business also recently declared a quarterly dividend, which was paid on Thursday, February 15th. Investors of record on Monday, February 12th were issued a $0.24 dividend. This represents a $0.96 annualized dividend and a dividend yield of 0.55%. The ex-dividend date of this dividend  was Friday, February 9th. Apple’s dividend payout ratio (DPR) is 14.95%. A number of equities research analysts have recently issued reports on AAPL shares. Barclays lowered their target price on Apple from $160.00 to $158.00 and set an “underweight” rating for the company in a research note on Friday, February 2nd. Monness Crespi & Hardt increased their target price on Apple from $189.00 to $200.00 and gave the company a “buy” rating in a research note on Friday, February 2nd. Oppenheimer  reiterated an “outperform” rating and issued a $200.00 target price on shares of Apple in a research note on Friday, February 2nd. DA Davidson initiated coverage on Apple in a research note on Wednesday, January 3rd. They issued a “neutral” rating and a $166.00 target price for the company. Finally, Robert W. Baird raised their price objective on Apple from $186.00 to $200.00 and gave the company an “outperform” rating in a research note on Monday, January 29th. One research analyst  has rated the stock with a sell rating, eleven have issued  a hold rating, twenty-one have assigned  a buy rating and one  has given a strong buy rating to the stock. Based on data from MarketBeat.com, Apple currently has a consensus rating of “Moderate Buy” and a consensus target price of $205.27. Read Our Latest Stock Analysis on AAPL In related news, Director Arthur D. Levinson sold 100,000 shares of the firm’s stock in a transaction that occurred on Thursday, February 29th. The stock was sold at an average price of $180.94, for a total value of $18,094,000.00. Following the sale, the director now owns 4,434,576 shares of the company’s stock, valued at approximately $802,392,181.44. The sale was disclosed in a document filed with the SEC, which is available at the SEC website. Company insiders own  0.06% of the company’s stock. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Advisors Asset Management Inc. Reduces Stake in Microsoft Co. (NASDAQ:MSFT) Alps Advisors Inc. Has $38.84 Million Stock Holdings in Apple Inc. (NASDAQ:AAPL) "
}