{
    "title": "Apple's (AAPL) Hold Rating Reaffirmed at DZ Bank",
    "date": "3/28/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-aapl-reiterated-rating-2024-03-28/",
    "text": "Apple (NASDAQ:AAPL - Get Free Report)'s stock had its \"hold\" rating restated by stock analysts at DZ Bank in a research note issued on Thursday, MarketBeat.com reports. They currently have a $180.00 price objective on the iPhone maker's stock. DZ Bank's price objective would suggest a potential upside of 4.97% from the company's current price. Several other research firms have also commented on AAPL. The Goldman Sachs Group boosted their price target on Apple from $223.00 to $232.00 and gave the stock a \"buy\" rating in a research report on Friday, February 2nd. Rosenblatt Securities reissued a \"neutral\" rating and issued a $189.00 price target on shares of Apple in a research report on Tuesday, March 5th. Bank of America raised Apple from a \"neutral\" rating to a \"buy\" rating and boosted their price target for the stock from $208.00 to $225.00 in a research report on Thursday, January 18th. Oppenheimer reissued an \"outperform\" rating and issued a $200.00 price target on shares of Apple in a research report on Friday, February 2nd. Finally, Redburn Partners lowered Apple to a \"neutral\" rating and set a $200.00 price target for the company. in a research report on Wednesday, January 10th. One analyst has rated the stock with a sell rating, twelve have given a hold rating, twenty-one have given a buy rating and one has assigned a strong buy rating to the stock. Based on data from MarketBeat, the stock has a consensus rating of \"Moderate Buy\" and a consensus target price of $204.53. Check Out Our Latest Stock Analysis on Apple Shares of AAPL stock traded down $1.83 during mid-day trading on Thursday, hitting $171.48. The stock had a trading volume of 65,623,339 shares, compared to its average volume of 62,001,594. Apple has a 12-month low of $159.35 and a 12-month high of $199.62. The firm has a market capitalization of $2.65 trillion, a P/E ratio of 26.81, a price-to-earnings-growth ratio of 2.05 and a beta of 1.29. The firm's 50-day moving average is $181.50 and its two-hundred day moving average is $182.66. The company has a debt-to-equity ratio of 1.28, a current ratio of 1.07 and a quick ratio of 1.02. Apple (NASDAQ:AAPL - Get Free Report) last issued its earnings results on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share for the quarter, topping the consensus estimate of $2.09 by $0.09. Apple had a return on equity of 156.04% and a net margin of 26.16%. The business had revenue of $119.60 billion during the quarter, compared to analysts' expectations of $117.99 billion. During the same period in the prior year, the business earned $1.88 EPS. The business's revenue for the quarter was up 2.1% compared to the same quarter last year. On average, analysts predict that Apple will post 6.55 earnings per share for the current fiscal year. In other Apple news, Director Arthur D. Levinson sold 100,000 shares of the stock in a transaction that occurred on Thursday, February 29th. The stock was sold at an average price of $180.94, for a total transaction of $18,094,000.00. Following the completion of the transaction, the director now owns 4,434,576 shares of the company's stock, valued at $802,392,181.44. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this hyperlink. 0.06% of the stock is currently owned by company insiders. A number of hedge funds have recently made changes to their positions in the company. HighPoint Advisor Group LLC acquired a new position in shares of Apple during the fourth quarter valued at approximately $175,436,000. Fairman Group LLC acquired a new stake in shares of Apple in the fourth quarter valued at approximately $1,025,000. Napatree Capital LLC acquired a new stake in shares of Apple in the fourth quarter valued at approximately $2,787,000. Livelsberger Financial Advisory acquired a new stake in shares of Apple in the fourth quarter valued at approximately $811,000. Finally, Cooksen Wealth LLC acquired a new stake in shares of Apple in the fourth quarter valued at approximately $706,000. Institutional investors and hedge funds own 60.41% of the company's stock. Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.See AlsoFive stocks we like better than Apple3 Home Improvement Stocks that Can Upgrade Your Portfolio3 Value Stocks Too Small For Buffett’s PortfolioHow to Invest in Insurance Companies: A Guide Foot Locker Builds Up Another Head of Steam; Gains ImminentElection Stocks: How Elections Affect the Stock MarketDisney Stock Catches 3 Upgrades In a Single Week  Before you consider Apple, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Apple wasn't on the list. While Apple currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Need to stretch out your 401K or Roth IRA plan? Use these time-tested investing strategies to grow the monthly retirement income that your stock portfolio generates. Discover three of the top stocks favored by members of Congress over the past 90 days using MarketBeat's tool to track Congressional trades. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}