{
    "title": "Affinity Wealth Management LLC Buys 394 Shares of Apple Inc. (NASDAQ:AAPL)",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/affinity-wealth-management-llc-buys-394-shares-of-apple-inc-nasdaqaapl.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Affinity Wealth Management LLC lifted its stake in shares of  Apple Inc. (NASDAQ:AAPL – Free Report) by 1.5% during the fourth quarter, HoldingsChannel.com reports. The firm owned 26,042 shares of the iPhone maker’s stock after purchasing an additional 394 shares during the quarter. Apple makes up   1.0% of Affinity Wealth Management LLC’s portfolio, making the stock its 29th largest position. Affinity Wealth Management LLC’s holdings in Apple were worth $5,014,000 at the end of the most recent quarter. A number of other hedge funds and other institutional investors also recently made changes to their positions in AAPL. Atlantic Private Wealth LLC bought a new stake in shares of  Apple during the 1st quarter valued at $30,000.  Wyrmwood Management LLC increased its stake in  Apple by 69.0% in the 4th quarter. Wyrmwood Management LLC now owns 169 shares of the iPhone maker’s stock worth $33,000 after acquiring an additional 69 shares during the last quarter.  Summit Wealth Group LLC increased its stake in  Apple by 16,252.3% in the 1st quarter. Summit Wealth Group LLC now owns 6,992,420 shares of the iPhone maker’s stock worth $42,000 after acquiring an additional 6,949,659 shares during the last quarter.  HBC Financial Services PLLC increased its stake in  Apple by 21.7% in the 1st quarter. HBC Financial Services PLLC now owns 448 shares of the iPhone maker’s stock worth $49,000 after acquiring an additional 80 shares during the last quarter.  Finally, West Tower Group LLC bought a new position in  Apple in the 2nd quarter worth about $64,000. 60.41% of the stock is currently owned by institutional investors. AAPL stock opened at $171.48 on Friday. Apple Inc. has a twelve month low of $159.35 and a twelve month high of $199.62. The company has a quick ratio of 1.02, a current ratio of 1.07 and a debt-to-equity ratio of 1.28. The firm has a market cap of $2.65 trillion, a PE ratio of 26.71, a price-to-earnings-growth ratio of 2.09 and a beta of 1.29. The business has a 50 day moving average of $181.15 and a 200 day moving average of $182.58. Apple (NASDAQ:AAPL – Get Free Report) last posted its quarterly earnings data on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share for the quarter, beating analysts’ consensus estimates of $2.09 by $0.09. Apple had a return on equity of 156.04% and a net margin of 26.16%. The company had revenue of $119.60 billion during the quarter, compared to analyst estimates of $117.99 billion. During the same quarter last year, the company earned $1.88 EPS. The firm’s revenue for the quarter was up 2.1% on a year-over-year basis.  On average, research analysts forecast that  Apple Inc. will post 6.55 EPS for the current fiscal year. The business also recently disclosed a quarterly dividend, which was paid on Thursday, February 15th. Investors of record on Monday, February 12th were given a dividend of $0.24 per share. This represents a $0.96 dividend on an annualized basis and a yield of 0.56%. The ex-dividend date  was Friday, February 9th. Apple’s dividend payout ratio (DPR) is presently 14.95%. In related news, Director Arthur D. Levinson sold 100,000 shares of the firm’s stock in a transaction that occurred on Thursday, February 29th. The stock was sold at an average price of $180.94, for a total transaction of $18,094,000.00. Following the completion of the transaction, the director now owns 4,434,576 shares of the company’s stock, valued at approximately $802,392,181.44. The transaction was disclosed in a filing with the SEC, which can be accessed through this link. 0.06% of the stock is owned by corporate insiders. A number of brokerages have weighed in on AAPL. Morgan Stanley  restated an “overweight” rating and issued a $220.00 target price on shares of Apple in a research note on Friday, March 22nd. Monness Crespi & Hardt upped their target price on Apple from $189.00 to $200.00 and gave the stock a “buy” rating in a research note on Friday, February 2nd. Redburn Atlantic lowered Apple from a “buy” rating to a “neutral” rating and set a $200.00 target price on the stock. in a research note on Wednesday, January 10th. Bank of America upgraded Apple from a “neutral” rating to a “buy” rating and upped their price objective for the stock from $208.00 to $225.00 in a report on Thursday, January 18th. Finally, Piper Sandler cut their price objective on Apple from $205.00 to $190.00 and set a “neutral” rating for the company in a report on Friday, February 2nd. One investment analyst  has rated the stock with a sell rating, twelve have assigned  a hold rating, twenty-one have issued  a buy rating and one  has given a strong buy rating to the company. According to MarketBeat, the company currently has an average rating of “Moderate Buy” and an average price target of $204.53. Get Our Latest Report on Apple (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Capstone Wealth Management Group LLC Decreases Stake in Microsoft Co. (NASDAQ:MSFT) Microsoft Co. (NASDAQ:MSFT) is Asio Capital LLC’s 6th Largest Position "
}