{
    "title": "Apple Inc. (NASDAQ:AAPL) Stock Holdings Boosted by Beaird Harris Wealth \nManagement LLC",
    "date": "3/14/2024",
    "url": "https://www.defenseworld.net/2024/03/14/apple-inc-nasdaqaapl-stock-holdings-boosted-by-beaird-harris-wealth-management-llc.html",
    "text": "Posted by Defense World Staff on Mar 14th, 2024 Beaird Harris Wealth Management LLC lifted its position in  Apple Inc. (NASDAQ:AAPL – Free Report) by 1.9% during the third quarter, Holdings Channel reports. The institutional investor  owned 20,478 shares of the iPhone maker’s stock after buying an additional 375 shares during the quarter. Beaird Harris Wealth Management LLC’s holdings in Apple were worth $3,506,000 at the end of the most recent reporting period. Several other institutional investors have also modified their holdings of the company. Greenwood Gearhart Inc. boosted its holdings in  Apple by 1.9% during the third quarter. Greenwood Gearhart Inc. now owns 272,631 shares of the iPhone maker’s stock worth $46,679,000 after buying an additional 5,147 shares in the last quarter.  Maripau Wealth Management LLC lifted its position in shares of  Apple by 72.5% during the 3rd quarter. Maripau Wealth Management LLC now owns 9,421 shares of the iPhone maker’s stock valued at $1,613,000 after acquiring an additional 3,960 shares during the last quarter.  Spouting Rock Asset Management LLC boosted its stake in shares of  Apple by 11.0% during the 3rd quarter. Spouting Rock Asset Management LLC now owns 50,168 shares of the iPhone maker’s stock worth $8,589,000 after acquiring an additional 4,986 shares in the last quarter.  Pacific Center for Financial Services grew its holdings in shares of  Apple by 1.5% in the 3rd quarter. Pacific Center for Financial Services now owns 30,777 shares of the iPhone maker’s stock worth $5,269,000 after acquiring an additional 455 shares during the last quarter.  Finally, Morgan Stanley raised its position in shares of  Apple by 1.0% during the third quarter. Morgan Stanley now owns 206,732,960 shares of the iPhone maker’s stock worth $35,394,751,000 after purchasing an additional 2,018,010 shares during the period. Institutional investors and hedge funds own  58.51% of the company’s stock. A number of research firms recently weighed in on AAPL. DA Davidson began coverage on Apple in a research report on Wednesday, January 3rd. They issued a “neutral” rating and a $166.00 price target for the company. The Goldman Sachs Group raised their target price on shares of Apple from $223.00 to $232.00 and gave the stock a “buy” rating in a report on Friday, February 2nd. Redburn Atlantic lowered shares of Apple from a “buy” rating to a “neutral” rating and set a $200.00 price target on the stock. in a report on Wednesday, January 10th. Tigress Financial raised their price objective on shares of Apple from $225.00 to $240.00 and gave the stock a “strong-buy” rating in a research note on Thursday, November 16th. Finally, Citigroup  reissued a “buy” rating and set a $225.00 target price on shares of Apple in a research note on Friday, February 16th. One analyst  has rated the stock with a sell rating, eleven have given a hold rating, twenty-one have assigned  a buy rating and one  has given a strong buy rating to the company’s stock. According to MarketBeat, the stock  has a consensus rating of “Moderate Buy” and a consensus target price of $205.27. View Our Latest Report on Apple AAPL opened at $171.13 on Thursday. The firm has a market cap of $2.64 trillion, a P/E ratio of 26.66, a price-to-earnings-growth ratio of 2.08 and a beta of 1.29. The company has a debt-to-equity ratio of 1.28, a quick ratio of 1.02 and a current ratio of 1.07. The business has a 50 day moving average price of $183.74 and a 200 day moving average price of $183.47. Apple Inc. has a twelve month low of $149.92 and a twelve month high of $199.62. Apple (NASDAQ:AAPL – Get Free Report) last issued its quarterly earnings data on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share for the quarter, topping analysts’ consensus estimates of $2.09 by $0.09. Apple had a net margin of 26.16% and a return on equity of 156.04%. The business had revenue of $119.60 billion during the quarter, compared to analysts’ expectations of $117.99 billion. During the same period in the previous year, the company earned $1.88 earnings per share. Apple’s revenue for the quarter was up 2.1% on a year-over-year basis.  Research analysts forecast that  Apple Inc. will post 6.55 EPS for the current year. The company also recently declared a quarterly dividend, which was paid on Thursday, February 15th. Shareholders of record on Monday, February 12th were issued a dividend of $0.24 per share. This represents a $0.96 dividend on an annualized basis and a yield of 0.56%. The ex-dividend date of this dividend  was Friday, February 9th. Apple’s dividend payout ratio (DPR) is 14.95%. In other Apple news, Director Arthur D. Levinson sold 100,000 shares of Apple stock in a transaction that occurred on Thursday, February 29th. The stock was sold at an average price of $180.94, for a total value of $18,094,000.00. Following the transaction, the director now directly owns 4,434,576 shares of the company’s stock, valued at approximately $802,392,181.44. The sale was disclosed in a document filed with the SEC, which is accessible through this link. 0.06% of the stock is currently owned by company insiders. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Reviewing AT&T (NYSE:T) & SoftBank (OTCMKTS:SFBQF) High Falls Advisors Inc Has $9.49 Million Stock Holdings in Apple Inc. (NASDAQ:AAPL) "
}