{
    "title": "EU regulators probe Apple's latest Epic Games takedown",
    "date": "3/7/2024",
    "url": "https://au.finance.yahoo.com/news/eu-regulators-probe-apples-latest-epic-games-takedown-130016452.html",
    "text": "The European Union has entered the latest clash between Apple and Epic Games. Bloomberg reports that regulators will question Apple over its choice to ban Epic's developer account. The Fortnite creator claims this action prevents it from launching the Epic Games Store in Europe. This escalation began when Epic CEO Tim Sweeney shared a post on X in January claiming that Apple was trying to thwart complying with the Digital Market Act (DMA) and calling much of its latest policy announcement \"hot garbage.\" Apple's rules include meeting the company's Notarization requirements, paying a Core Technology fee (about 54 cents per install annually) after hitting the millionth download and showing proof of $1.1 million in credit that could be used for financial disputes. Supreme A month after Sweeney's post, Apple sent a letter stating, \"In plain, unqualified terms, please tell us why we should trust Epic this time.\" Sweeney responded that the company was \"acting in good faith and will comply.\" Apple seemingly had no trust in Epic and would not allow it to have a developer account. \"Epic's egregious breach of its contractual obligations to Apple led courts to determine that Apple has the right to terminate 'any or all of Epic Games' wholly owned subsidiaries, affiliates, and/or other entities under Epic Games' control at any time and at Apple's sole discretion.' In light of Epic's past and ongoing behavior, Apple chose to exercise that right,\" the company said in a statement. Sweeney's response was visual, to say the least, stating, \"This is the medieval feudal lord, mounting the skulls of their former enemies on their castle walls,\" CNBC reports. This disagreement is the latest in nearly half a decade of issues between the two companies — you could throw a dart at a board filled with fights in the tech industry (of which there are many) and still have a good chance of hitting an Epic Games and Apple face-off. The friction between the pair started in 2020 when a Fortnite update allowed gamers to buy digital coins through a direct payment feature, thus going around Apple's rule that iOS games use in-app purchases (giving them a 30 percent cut). Epic sued Apple, with California's Ninth Circuit Court ruling in favor of the game developer. The Supreme Court declined to take up the case, in which both Apple and Epic appealed the ruling (Epic claimed there were \"legal errors\" and that Apple had violated federal antitrust laws). The EU's decision comes just as the DMA finally goes into effect. The new law states that \"gatekeepers,\" such as Apple, Microsoft and Meta, can't favor their own systems or prohibit third party developers from interoperating with them. Apple could be forced to pay ten percent of its annual worldwide revenue if found in violation of the DMA and 20 percent if it's a repeat offender. Apple recently received its first fine from the EU, a €1.8 billion ($1.96 billion) charge for restricting competitors' music streaming apps. Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  This update would represent Apple's first overhaul to that lineup since 2018. ANALYSIS: The US and EU argue that Apple is abusing its power to crush competition and blight users’ experience. The iPhone maker says the proceedings threaten the company. Andrew Griffin examines what the row could mean for the technology in your pocket  (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b Apple will finally launch new iPads in early May, according to Bloomberg’s Mark Gurman. Expected are a new iPad Pro with an OLED display and a faster iPad Air, including a 12.9-inch model for the first time in that lineup. This food habit is linked to a specific type of dementia.  The dreaded pest also displaces wildlife and can blind pets. Find out more. The \"Late Night\" comedian brutally summed up the former president's media company. King Edward VIII’s proposal to Wallis Simpson marked a constitutional crisis in Britain almost 90 years ago Trade 24 hours a day on the world's most popular platform. MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president. The not-so-happy campers were stunned by the unexpected guest at their beachside campsite. The concerned shopper raised the alarm with staff at the store. Now, a 'full product inspection' is underway.  Married At First Sight’s breakout star Lucinda Light has wowed fans on social media after she unveiled a surprising new look. Read more. A London judge has dismissed former President Donald Trump’s appeal in his case against retired British spy Christopher Steele’s company over a controversial 2016 dossier. The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia.  The person who wrote on the road has been called a \"top bloke\" by motorists. Russia launched fresh attacks on Ukraine’s energy infrastructure on Friday morning \"I mean, is there no depth to which he will not descend?\" asked Andrew Weissmann. 連續13日閃購，PS5 Slim、Marshall、Switch OLED、AirPods Pro 2、DJI等人氣產品平到笑！ Jacqui Lambie has responded after Senator Tammy Tyrrell announced she was leaving the Jacqui Lambie Network to sit as an independent. Footage shows Dylan Edwards moved out of the way. Find out more here. Despite referee Gerard Sutton labelling the collision \"incidental\", Souths superstar Latrell Mitchell has been charged for dangerous contact on Josh Addo-Carr. "
}