{
    "title": "Apple opens up iPhone app store in Europe, a major crack in its 'walled \ngarden'",
    "date": "1/25/2024",
    "url": "https://www.cnbc.com/2024/01/25/apple-opens-up-iphone-app-store-in-europe.html",
    "text": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article Apple announced plans to open up its iPhone App Store in Europe to competitors on Thursday, a move that opens up cracks in the company's famous \"walled garden,\" with which it controls app distribution on its devices. Apple didn't make these moves voluntarily — the changes were required by a new European law, the Digital Markets Act, which forces big tech companies to open up their platforms by March of this year. The new rules could threaten Apple's lucrative App Store fees, especially if developers such as Spotify and Microsoft take advantage of the new regulations that allow it to bypass Apple's 30% fee on in-app purchases and move to release their own competing app stores for iPhone. But Apple also announced a new fee structure in Europe that includes an annual charge per installation for popular apps that don't use Apple's App Store, raising the possibility that many big developers will end up paying a similar amount to Apple even if they take advantage of the new capabilities. Apple said on Thursday that it believes the new regulation puts its users at risk for scams, fraud and abuse, because apps that don't go through Apple's App Store aren't reviewed for content and could contain malware. It also warned that some new browser apps using an \"engine\" not made by Apple, enabled by the DMA, could hurt user battery life. Developers in general are likely to celebrate, as many have chafed for years over Apple's fees and rigorous App Review program that frequently rejects app updates. While regulators around the world have aimed to make Apple open up its platforms, Thursday's changes are the most drastic so far and can provide a preview of what could happen if the U.S. were to implement similar regulations. The changes are restricted to Europe and accounts that are registered in the E.U., rather than changes to the way iPhone app distribution works in the U.S. The changes will go live in an iOS software update in March. \"Developers can now learn about the new tools and terms available for alternative app distribution and alternative payment processing, new capabilities for alternative browser engines and contactless payments, and more,\" said Apple App Store boss Phil Schiller in a statement. Apple said that it would allow non-Apple companies to offer app stores in Europe, but the system requires an application to Apple to acquire an \"authorization.\" The new app stores will be \"special\" iOS apps that integrate with Apple software that it built to comply with the DMA. Apple will know which companies are running app stores, and the company will be able to revoke those permissions if the other app stores are filled with scams or malware. For users, it means that apps installed from alternative app stores will show up in settings, with details about when they were downloaded and from where. When developers upload an app for Europe, they will be able to pick which app store they'd like to distribute it from. Apple will \"notarize\" the apps, meaning the company will scan them for malware and other code issues. For developers like Spotify and Microsoft, which have expressed interest in distributing apps outside the App Store in Europe, the rules do not contradict their stated plans, but Apple's implementation does add hurdles beyond offering an installation file for download on their website. Apple will also allow app developers to bill their users directly. Previously, apps could only charge users for digital goods — game coins, for example — through Apple's billing system, which takes between 15% and 30% of total sales. Now, Apple will allow iPhone app developers to take credit card numbers inside the app, or app developers can choose to link users to their website to collect their payment information. However, Apple said Thursday it still planned to collect fees and commissions from apps even if they handle their own payments or distribute through an alternative app store. Developers can stick with the current system, but if they opt for one of the new capabilities in Europe, Apple will start charging reduced commission rates in Europe but add an install fee for popular apps. \"Importantly, developers can choose to remain on the same business terms in place today if they prefer,\" Schiller said in the statement. Here are the new business terms, according to Apple: The DMA has been in the works for years. Spotify, among other companies, lobbied heavily for it starting in 2019. It goes into effect in March, but other parts of Apple's business could come under scrutiny as the European Commission continues to examine Apple's business practices — in particular, it may focus on making Apple's iMessage service interoperable with competitors. On Thursday, Apple also made changes to the way it makes its digital wallet technology accessible, as well as allowing competitors to use different underlying web browser technology. Earlier this month, Margrethe Vestager, the European Commission antitrust chief, visited Apple CEO Tim Cook in California. She posted on social media that they had discussed Apple's compliance with the law. Epic Games CEO Tim Sweeney posted on social media on Thursday that Apple's plan was a \"devious new instance of malicious compliance,\" arguing that its new business terms amounted to \"junk fees.\" Epic Games sued Apple in the U.S. over antitrust and similar App Store restrictions in 2020, mostly losing, and the Supreme Court declined to hear appeals earlier this month. Spotify said on Friday that Apple's changes were against the goals of the DMA and urged regulators to reject them. \"The ball is in your court, European Commissioners, and once and for all you must reject this blatant disregard of the very principles you worked so hard to establish,\" Spotify said in a blog post. \"We strongly encourage designated gatekeepers to test their proposals with third parties,\" a European Commission spokesperson told CNBC. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by "
}