{
    "title": null,
    "date": "1/3/2024",
    "url": "https://finance.yahoo.com/news/stock-market-news-today-us-stocks-dip-to-start-new-year-as-apple-slips-121819598.html",
    "text": "US stocks retreated Tuesday, setting Wall Street up for a downbeat start to 2024 after a winning year that left the S&P 500 just short of a new record high. The benchmark S&P 500 (^GSPC) lost nearly 0.6%, while Dow Jones Industrial Average (^DJI) rose just above the flatline. The tech-heavy Nasdaq Composite (^IXIC) led the losses, shedding close to 1.6%. The rally in stocks stalled on Friday after two months of gains that helped the major gauges end 2023 with strong yearly gains. Plus, the S&P 500 notched its ninth weekly win in a row, the longest streak since 2004, and is inching toward taking out its all-time closing high of 4,796.56. Tech stocks lost ground after Barclays analysts downgraded their rating on Apple's stock, citing concerns about demand for new iPhones. Apple (AAPL) shares fell almost 4% as tech stocks slid. Economic updates this week could also put the rally to the test, with the December jobs report due Friday watched for its potential to sway the Federal Reserve's thinking. Investors' bets that interest rate cuts will come fast and deep in 2024 have buoyed stocks. Read more: What the Fed rate-hike pause means for bank accounts, CDs, loans, and credit cards Elsewhere in markets, oil prices rose after Iran sent a warship to the Red Sea in response to the US Navy’s sinking of three Houthi boats over the weekend. West Texas Intermediate crude (CL=F) and Brent crude (BZ=F) futures climbed over 1% as tensions escalated. Meanwhile, bitcoin prices jumped close to 3% to top $45,000 for the first time since early 2022 as hopes grew that the SEC will soon approve a spot bitcoin ETF. The new year began with a backpedal, as Wall Street retreated from a year-end rally, led by declines in technology. The benchmark S&P 500 (^GSPC) shed nearly 0.6%, while Dow Jones Industrial Average (^DJI) rose just above the flatline. The tech-heavy Nasdaq Composite (^IXIC) led the losses, shedding close to 1.6% Bitcoin (BTC-USD), the dominant cryptocurrency, surpassed $45,000 Tuesday, reaching levels not seen since the spring of 2022 and extending the optimism that carried a year-end rally. The digital currency rose nearly 3% during afternoon trading. Overall, the crypto market rose almost 2% and reached a total market cap of $1.7 trillion. The rise to start the new year builds on the speculative but growing chance that US spot bitcoin ETFs will be listed later this month, reports Yahoo Finance's David Hollerith. As with similar crypto runs in the past, the increasing awareness and popularity of holding digital assets serves as momentum for an asset class that has stood on the fringes for many years. The release of new crypto financial products has also historically coincided with a run-up in crypto prices. For backers of cryptocurrencies, the late-in-the-year rally was seen as a way for the industry to move past the wave of scandals that rocked some of its biggest players and weighed heavily on digital assets. The December jobs report is scheduled to be released on Friday morning, offering the latest insight into the strength of the labor market after the Federal Reserve wrapped its tightening campaign at the end of 2023. The report is expected to show 168,000 nonfarm payroll jobs were added to the US economy in December while the unemployment rate ticked higher to 3.8%, according to data from Bloomberg. In November, the US economy added 199,000 jobs while the unemployment rate unexpectedly declined to 3.7%. \"We do not expect to see a sharp contraction in employment just yet, but remain cautious as we head into 2024,\" Jefferies's economics team led by Thomas Simons wrote in a research note on Friday. \"With the UAW strike finally in the rearview, we expect the volatility in manufacturing payrolls we saw over the last couple of months to level out.\" Higher hopes that the Federal Reserve will achieve a \"soft landing\" — where inflation cools to 2% without a recession — drove the stock market rally that closed out 2023, reports Yahoo Finance's Josh Schafer. Another crucial part of the story has been that the labor market has held up more than many expected. The last snapshot for the year could very well bolster that narrative. Here are some of the stocks leading Yahoo Finance’s trending tickers page during afternoon trading on Tuesday: Moderna (MRNA): Shares of the the pharmaceutical company surged Tuesday afternoon after Oppenheimer upgraded the stock to Outperform and raised its price target to $142 per share, implying a more than 40% gain from Friday's closing price. Shares rose 15%. Apple (AAPL): The tech giant slid after Barclays downgraded the iPhone maker and lowered its price target on shares on fears of slowing iPhone 15 sales in China. The iPhone maker dropped 3%. MicroStrategy (MSTR): Shares of the software company with holdings of bitcoin surged 10% Tuesday afternoon, joining other companies with ties to crypto in a new year rally. Bitcoin (BTC-USD): Prices for the most dominant cryptocurrency surpassed $45,000 on Tuesday, marking the first time the digital currency has crossed that benchmark since April 2022. Bitcoin prices rose just under 5%. Shares of Tesla (TSLA) ticked over the flatline Tuesday following the release of new delivery figures that showed the all electric automaker set a record for the fourth quarter and met its 2023 delivery target. For the fourth quarter Tesla reported 484,507 deliveries, beating Wall Street estimates of 483,173, as compiled by Bloomberg. That figure represents an all-time record quarter for Tesla, nearly 20,000 units higher than its past record quarter of 466,000 units delivered in Q2 of last year, Yahoo Finance's Pras Subramanian reports. Tesla's stock price more than doubled in 2023, helping to drive the growth of the Magnificent Seven stocks and the broader market. But the company faces increasing competition, especially in China, as rivals race to claim market share for the next generation of vehicles. BYD, the Chinese automaker, reported it delivered 526,409 pure EVs globally in Q4, besting Tesla for the first time. While Tesla delivered more EVs in 2023, BYD is on track to take the title as it expands deliveries in in mainland China and in Europe. “This was an important quarter for Tesla to show strong deliveries with clear momentum into 2024 as demand has upticked since 3Q based on all our global checks,” Wedbush analyst Dan Ives wrote in a note to clients following Tesla's release of delivery figures. “Pricing was stable and actually increased in China throughout the quarter as the price war in China has finally hit a calm period which is music to the ears of Tesla bulls.” Stocks were mostly in the red during afternoon trading on Tuesday as Apple (AAPL) dipped to start the year. The benchmark S&P 500 (^GSPC) lost nearly 0.5%, while Dow Jones Industrial Average (^DJI) gained about 0.2%, or roughly 60 points. The tech-heavy Nasdaq Composite (^IXIC) slid 1.4%. Here are some of the stocks leading Yahoo Finance’s trending tickers page during morning trading on Tuesday: Apple (AAPL): Tech stocks lost ground after Barclays analysts downgraded their rating on Apple's stock, citing concerns about demand for new iPhones. Apple shares fell nearly 3% during trading on Tuesday morning. Tesla (TSLA): Tesla shares rose just under 1% after setting a new delivery record for the fourth quarter and met its 2023 delivery target, shaking off a third quarter miss and cooling investors concerned as competition in producing electric vehicles ramps up. Rivian (RIVN): The American EV maker fell more than 9% Tuesday morning after the company reported deliveries of almost 14,000 vehicles in the fourth quarter of 2023, marking a decline of about 10% from figures in the previous three months. Bitcoin (BTC-USD): Prices for the most dominant cryptocurrency surpassed $45,000 on Tuesday, marking the first time the digital currency has crossed that benchmark since April 2022. Bitcoin prices rose just under 6%. Crude futures pared earlier session gains as demand concerns overshadowed rising tensions in the Red Sea. The US Manufacturing Purchasing Managers Index (PMI) fell to 47.9 in December, down from 49.4 in the prior month. A reading below 50 indicates the sector is in contraction. West Texas Intermediate (CL=F) was trading as high as $73.64 per barrel before giving up those gains following the PMI print. Brent (BZ=F) crude rose to a session high of $79.04 per barrel. Both WTI and Brent were trading around the flatline at 11:00 a.m. Eastern time. Oil prices jumped more than 2% earlier in the session after Iran deployed a warship to the Red Sea following days of tensions in the critical shipping region. \"The escalation of tensions between the US & Iran has caught some fund managers attention and is bringing on some new longs,\" Dennis Kissler, senior vice president at BOK Financial, wrote in a note to clients. The US manufacturing sector fell further into contraction during the final month of 2023. New data from S&P Global showed its manufacturing PMI index posted a reading of 47.9 in December, down from 49.4 in November and below economists' expectations for 48.4. A reading below 50 indicates the sector is in contraction. \"US manufacturers ended the year on a sour note, according to S&P Global's PMI survey,\" S&P Global Market Intelligences chief business economist Chris Williamson said in a press release. \"Output fell at the fastest rate for six months as the recent order book decline intensified. Manufacturing will therefore likely have acted as a drag on the economy in the fourth quarter.\" Notably, the report also showed a slowdown in the labor market. Payrolls dropped for the third straight month, with factories reducing employment at the second-fastest rate since 2009. The only other time factories have reduced employment at this pace in recent years was early in the pandemic lockdown, per S&P Global. Inflation was also a key concern for manufacturers in the month of December with selling prices increasing at the quickest price since April. \"Hikes in supplier prices for metals and plastics, alongside greater transportation charges, reportedly drove the uptick in inflation,\" S&P Global wrote in the report. Shares of Apple sunk more than 3% during morning trading on Tuesday, following a downgrade from Barclays analysts who foresee cooling demand for the iPhone 15. The analysts cut Apple's rating to underweight and dropped their price target from $161 to $160. Apple's stock price as of Friday's close was about $193, meaning the analysts forecast a roughly 17% stock price drop for the tech giant. “We expect reversion after a year when most quarters were missed and the stock outperformed,” the analysts said in a note on Tuesday. “Our checks remain negative on volumes and mix for iPhone 15, and we see no features or upgrades that are likely to make the iPhone 16 more compelling.” While the tech-heavy Nasdaq Composite (^IXIC) gained about 44% for the year, Apple shares rose roughly 50%, trailing several other tech giants. During the company's most recent earnings call, a cautious outlook overshadows a record iPhone quarter for the company. Stocks began the first trading day of 2024 in the red, placing the year-end rally on hold. The pause in momentum carried over from Friday, when all three major indexes closed in the negative while still posting double-digit gains for the year. The benchmark S&P 500 (^GSPC) lost nearly 0.6%, while Dow Jones Industrial Average (^DJI) shed 0.3%, or about 100 points. The tech-heavy Nasdaq Composite (^IXIC) lost about 0.9%. Click here for in-depth analysis of the latest stock market news and events moving stock prices. Read the latest financial and business news from Yahoo Finance Related Quotes "
}