{
    "title": "Apple, Amazon, Tesla: Why shares of these global giants are falling",
    "date": "1/4/2024",
    "url": "https://www.indiatoday.in/business/story/apple-amazon-tesla-global-tech-rally-fizzles-shares-under-pressure-2484116-2024-01-04",
    "text": "Listen to Story Some of the world’s biggest companies have not had a good start to 2024, with their shares facing heavy losses on the stock market. Shares of top companies like Apple, Amazon.com, Alphabet (Google parent), Microsoft Group, Meta Platforms, Tesla and Nvidia Corp – cumulatively known as the ‘Magnificent 7’ – have been falling for the past four sessions, marking their longest losing streak in a month, reported Bloomberg News. The report noted that shares of Apple have fallen 4.6 per cent in the past four sessions and is leading the broad-based slump that has erased $383 billion in market value. It noted that the Nasdaq 100 index has also fallen sharply in the last four trading days. Steve Sosnick, chief strategist at Interactive Brokers Group, told Bloomberg News that it is “completely normal” for markets to pull back after a strong rally. He was referring to the spectacular rally enjoyed by major global companies, especially from the tech domain, in calendar year 2023. “Without the year-end factors that turbocharged the rally, I think we’re seeing the party winding down,” he added. Despite experiencing a remarkable surge of over 100 per cent last year, fueled by a fervor in artificial intelligence, the momentum of the ‘Magnificent 7’ waned in the latter part of 2023. This slowdown occurred as investors deliberated over the Federal Reserve's capacity to orchestrate a smooth economic landing for the US, potentially resulting in fewer anticipated interest rate cuts. “You’re not going to get high-single-digit or double-digit earnings growth if we get something worse than a soft landing,” Sosnick told the publication. “But we’re not going to get six cuts with a soft landing,” he added. Some members within the ‘Magnificent 7’ group are facing individual stock challenges in the early part of this year. Apple shares, in particular, have experienced downward pressure following a recent bearish outlook. Analysts from Barclays Plc downgraded the tech giant's shares to underweight earlier this week, citing their anticipation of weakened demand for iPhones in the future. Meanwhile, Over the past four days, Tesla has experienced a continuous decline, marking its longest losing streak in over four weeks. Despite reporting on Tuesday that it surpassed analysts' expectations for electric vehicle deliveries in the fourth quarter, Tesla has relinquished its position as the leading seller of electric cars to China's BYD Co. In any case, the Bloomberg report noted that it is too early to conclude whether the tech-focused rally is over, adding that the majority of the gains in 2023 served to recover losses from the previous year, and significant players like Amazon, Alphabet, Meta, and Tesla are still trading below their all-time highs – an indication that there might be potential for further upward movement. However, looking ahead to 2024, the major tech companies face significant challenges. It is important for them to not only provide innovative technology but also ensure its profitability moving forward, highlighted Sosnick.Published By: Koustav DasPublished On: Jan 4, 2024Must Watch "
}