{
    "title": "Apple becomes the first big tech company with a gender-equal board of \ndirectors",
    "date": "1/15/2024",
    "url": "https://english.elpais.com/economy-and-business/2024-01-15/apple-becomes-the-first-big-tech-company-with-a-gender-equal-board-of-directors.html",
    "text": "Apple — which has been the most valuable company in the world over the last decade (although on Friday it was dethroned by Microsoft) — will have a board of directors with four men and four women at next month’s shareholders meeting. If, as is likely, the shareholders ratify the proposal, the company founded by Steve Jobs will become the only large tech company (a list that includes Microsoft, Alphabet, Amazon, and Meta among others) that has an even split of male and female directors. It is a big change for Apple: until now, there were twice as many men as women on the board of directors. Former U.S. vice-president Al Gore (a board member since 2003) and former Boeing CFO James Bell (a board member since 2015) are retiring after reaching the age of 75. Apple has proposed that Wanda Austin, 69, former CEO of The Aerospace Corporation, be appointed to the board. Austin has decades of experience in science and technology and a significant track record in promoting innovation and designing corporate strategies, as highlighted by Apple. “Wanda has spent decades advancing technology on behalf of humanity, and we’re thrilled to welcome her to Apple’s board of directors,” said Tim Cook, Apple’s CEO. “She’s an extraordinary leader, and her invaluable experience and expertise will support our mission of leaving the world better than we found it.” Once Austin’s appointment is approved, Apple’s board of directors will be made up of eight people, four men and four women. Art Levinson, 73, is the non-executive chair of Apple’s board of executives. He is CEO of the health company Calico and previously led Genentech in the same sector. He has been on the board since 2000. Cook, 63, is the CEO and, as such, the company’s first executive. He succeeded Steve Jobs in 2011. He was previously the group’s chief operating officer, a position he had held since 2005. Also on the board is Alex Gorsky, 63, who was the CEO and chairman of Johnson & Johnson until January 2023. He is also on JPMorgan and IBM’s board of directors, and has been on Apple’s board since 2001. The fourth man is Ronald Sugar, who will remain on the board even though he has turned 75. Apple has made an exception for him, arguing that as chairman of the Audit Committee, Sugar plays an important technical role and brings executive leadership experience as former president and CEO of Northrop Grumman Corporation, a global security company. Additionally, Apple says, he has financial knowledge, experience in global operations, an understanding of advanced technology, experience in government relations and public policy, and a global business perspective. He is a director of Amgen and Uber, and has also been a director of Chevron. Austin is also on the boards of Chevron and Amgen. The other women on Apple’s board of directors are Andrea Jung, 65, who was executive president of Avon and is now a director of Unilever, Wayfair and Rockefeller Capital Management. She has been on Apple’s board since 2008. Sue Wagner, 62, co-founder of the asset management giant BlackRock, a firm of which she was vice-president from January 2006 until her retirement in July 2012, has been a director since 2014. She was director of Operations and Head of Corporate Strategy at BlackRock, and led the alternative investments and international client businesses. She remains a director of BlackRock. The woman who joined the board before Austin was Mónica Lozano, 67, who has a long career in the media. She was president of the board of directors of U.S. Hispanic Media, the parent company of ImpreMedia, and held different positions in the group, including as director of La Opinión in Los Angeles. Lozano is on the Bank of America and Target’s board of directors, and has been on the Apple board since 2021. At Microsoft and Amazon, the board of directors is made up of seven men and five women. At Meta, there are five men and four women, and at Alphabet, Google’s parent company, there are eight men and only three women, according to each company’s latest board nominations to the U.S. Securities and Exchange Commission (SEC). Apple also has an equal number of male and female non-advisory senior managers in leadership. The four most prominent are CFO Luca Maestri; head of retail, Deirdre O’Brien; general counsel Kate Adams, and COO Jeff Williams. Each of them earned close to $27 million in the 2023 financial year, in line with the remuneration package of the previous two years. After some shareholder outcry and pressure over his high payouts, Cook agreed to cut his 2023 target or benchmark compensation to $49 million, down from $84 million in 2022. However, after exceeding expectations, and due to strong stock appreciation, the cut was somewhat less noticeable. Now, Apple’s remuneration committee is backtracking and raising Cook’s benchmark remuneration to $59 million, an increase of 20.4%. His base salary remains $3 million and the annual cash incentive or bonus at another $6 million (it can be as much $12 million), but his equity award has been set at $50 million, an increase of 25%. In addition, there are other items (pensions, vacations, security, private plane trips.), which last year, for example, amounted to $2.5 million. The actual remuneration will depend on the objectives achieved and the evolution of Apple’s share price, which will determine the cash bonus and the equity awards that come into effect. A proposal from a group of shareholders has been submitted to the board requesting greater transparency on the use of artificial intelligence. It asks Apple to prepare a report on the company’s use of AI in its business operations. It also proposes that the company disclose any ethical guidelines it has adopted in relation to the company’s use of AI technology. “This report shall be made publicly available to the company’s shareholders on the company’s website, be prepared at a reasonable cost, and omit any information that is proprietary, privileged, or violative of contractual obligations,” the filing states. Apple’s board of directors has recommended that shareholders vote against the proposal. “We are committed to responsibly advancing our products and services that use AI, have a robust approach to addressing ethical considerations across our business operations, and already provide resources and transparency on our approach to artificial intelligence and machine learning,” the company said. “The scope of the requested report is extremely broad and could encompass disclosure of strategic plans and initiatives harmful to our competitive position and would be premature in this developing area.” Sign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition Suscríbete y lee sin límites "
}