{
    "title": "Accenture Buying New York Firm That Counts Apple, Google As Clients",
    "date": "1/10/2024",
    "url": "https://www.crn.com/news/channel-news/accenture-buying-new-york-firm-that-counts-apple-google-as-clients",
    "text": "Work & Co, a provider of product design and brand strategy for some of the biggest names in tech-focused businesses, will become part of Accenture Song, a group within Accenture that focuses on product and user experience design and technology.  Global IT solutions provider Accenture this week unveiled plans to acquire Work & Co, a digital design and technology company, and make it part of its Accenture Song digital experience business. New York-based Work & Co, with nearly 400 employees, brings to Accenture a wide range of skills around brand strategy, product strategy, design, business intelligence, generative AI, data science, and user experience. It also brings Accenture, ranked No. 1 in CRN’s 2023 Solution Provider 500, increased access to such clients as IKEA, Gatorade, Apple, Disney, Airbnb, and Google. [Related: Accenture Places $3B AI Bet Following Multiple Acquisitions] Accenture said Tuesday that Work & Co is slated to become part of Accenture Song. Accenture Song, formerly known as Accenture Interactive, is aimed at helping clients accelerate growth and value via a combination of product and experience design, technology, media and marketing strategies, and orchestration of campaigns, content, and channels. Terms of the acquisition were not disclosed. The final closing date of the acquisition is not yet known. Accenture Song’s acquisition of Work & Co is one of two acquisitions Accenture has unveiled this week. The company Wednesday unveiled plans to acquire Navisite, an Andover, Mass.-based cloud solution and service provider. David Droga, CEO at Accenture Song, said in a prepared statement that he has admired Work & Co’s client work, distinct model, and strong leadership for years. “It's little wonder they are widely considered as one of the world's very best digital product companies,” Droga said. “So, as Song continues to grow significantly, we will continue to bring more and more tech expertise and creative excellence into our Song family.” Accenture declined to respond to a CRN request for further information and pointed to prepared remarks from Olof Schybergson, Accenture Song’s design and digital products practice lead. “Work & Co has always been known for digital product excellence,” Schybergson said. “By using gen AI, they’ve recently added both speed and deeply tailored customer experiences to their core strengths. Accenture Song’s Design and Digital Products practice focuses on creating new and reinventing existing products and services for our clients, and Work & Co will significantly elevate and strengthen our world-class team.” "
}