{
    "title": "AAPL Earnings Preview: Will AI and VR boost growth amid flat revenues?",
    "date": "1/29/2024",
    "url": "https://news.alphastreet.com/aapl-earnings-preview-will-ai-and-vr-boost-growth-amid-flat-revenues/",
    "text": "News . Data . Research Categories  Analysis, Technology Apple Inc. (NASDAQ: AAPL) will be publishing the first earnings report of fiscal 2024 this week amid expectations that the bottom line will benefit from the rapidly growing services business and customers’ positive response to iPhone-15, which was launched a few months ago. The Cupertino-headquartered gadget giant’s shares hit an all-time high a few weeks ago and reached close to the $200 mark. Though the stock pulled back, once again it is hovering near the peak now.  The value has more than doubled since mid-2020. Considering its stable performance, even during the market downturn, AAPL looks poised to move higher and set new records this year. The tech titan is preparing to report first-quarter results on February 1, after regular trading hours. On average, analysts following the company are looking for earnings of $1.93 per share for the December quarter, which represents a 3% year-over-year increase and the best earnings performance in recent quarters. The consensus revenue estimate for Q1 is $108.54 billion, compared to $117.2 billion in the corresponding period of 2023. The outlook for iPhone sales is positive, and the market will be closely following the earnings event to see how the latest version of the smartphone has performed so far. While sales have been almost stagnant lately, the company keeps innovating and is all set to launch Vision Pro, its eagerly awaited virtual reality headset designed to place digital content around the user’s environment. Recently, the company unveiled a new generation of Apple silicon with the M3 chip series, to take its gadgets to the next level while boosting AI capabilities. Meanwhile, there are concerns that the company will face an investigation into possible anticompetitive practices involving iPhone. It is alleged that Apple designed its software and hardware in such a way that some of the company’s products will work efficiently only with its other products. Apple’s CEO Tim Cook said at the Q4 earnings call, “We’ve continued to invest in the future and manage for the long-term. We’ve adapted continuously to circumstances beyond our control while being thoughtful and deliberate on spending. And, we’ve carved a path of groundbreaking innovations and delivered with excellence every step of the way. That includes Apple Vision Pro, which has gotten such an amazing response from developers who are currently creating truly incredible apps.” Though the company had a rather weak start to fiscal 2023, delivering lower-than-expected first-quarter results, it regained momentum and posted strong quarterly sales and earnings that beat estimates for the remainder of the year. However, iPhone struggled to maintain momentum last year – sales grew 2.7% year-over-year in the fourth quarter, after declining so much in the prior quarter. Among others, all segments except Services contracted in Q4, resulting in a 1% decline in total revenues to 89.5 billion. In the Americas, there was a modest increase in sales, while all other geographical segments recorded declines. On the other hand, September-quarter earnings increased in double digits to $22.9 billion or $1.46 per share. In the past three months, Apple’s shares have consistently stayed above their 12-month average. The stock traded slightly lower during Monday’s session. Listen to the conference calls as they happen. Don't miss a beat! With AlphaStreet Intelligence, you can listen to live calls and interviews as they happen, so you never have to worry about missing out on important information. Cargo giant United Parcel Service, Inc. (NYSE: UPS) ended fiscal 2023 on a weak note, reporting lower revenues and profit for the fourth quarter. The company experienced a slowdown post-pandemic Boundless Bio is preparing to debut on the Nasdaq stock market this week, and become the latest addition to the list of biotech firms that have launched IPOs this year. Sneaker giant Nike, Inc. (NYSE: NKE) has been going through a rough patch for some time, with sales coming under pressure from weak demand and rising competition. Post-pandemic, the company © 2020 AlphaStreet Inc. All Rights Reserved info@alphastreet.com 44053 Fremont Blvd,\nFremont, CA 94538 "
}