{
    "title": "How to fix Family Sharing in Apple Music on iPhone and iPad",
    "date": "1/24/2024",
    "url": "https://www.imore.com/apple-music-family-sharing-fix",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. A music fix for all the family. Family Sharing on your Apple devices is a very useful feature, as long as it works. For those unaware, this allows you to share your Apple subscriptions with other family members who use an iPhone, iPad or anything else from the company. Once added, they can use Apple Arcade, Apple TV Plus, share your iCloud storage, and lots more. For this guide, however, Family Sharing with Apple Music has not been known to be a marriage made in heaven. With this in mind, we've rounded up the best troubleshooting recommendations to fix your plight with getting Family Sharing working with your Apple Music account.  Below, we've got four solutions that could help fix your issues with enabling Family Sharing on Apple Music. Family Sharing requires the devices of other family members to be logged in to their iCloud ID. For example, if you're the head of the household that's associated with jollybaxter@icloud.com, your family member's iPhone or iPad needs to be logged into their account, such as spice@icloud.com, not yours. Some users may share Apple Music accounts for purchased content — but to get Family Sharing to work, every account on the family member's device must be linked to that family member's account. You can't have a different Apple ID for Apple Music on the same device. Straight to the point — have a family member switch off their Apple Music account by going to Settings > Apple Music, then remove them from the Family Sharing screen if they're there. iMore offers spot-on advice and guidance from our team of experts, with decades of Apple device experience to lean on. Learn more with iMore! You can do this by going to Settings > iCloud > Family Sharing. Have them enable Apple Music, and once it's back on their device, try to add them back into Family Sharing. The apocalyptic option, but it can work — simply remove everyone from your Family Sharing settings. Have all of them delete the Music app on iPhone and iPad, and also have them log out of their Apple ID accounts. Once this is all done, do the opposite — log back in with their Apple ID accounts on their devices, enable Apple Music, then add them back into Family Sharing. If you've tried everything and nothing's working still, talk to Apple. Hopefully someone in the team can help walk you through problems with your account and go from there.  It's only in the past couple of years that I've begun to see what Family Sharing is capable of. It's an impressive feature, especially for students who may want to share an Apple Music subscription. My wife and I share some services already — such as Amazon Prime, Netflix and PlayStation Plus, so Family Sharing was the natural step for us, as we only own iPhones, iPads and Apple Watches. I have, however, come across some issues in adding a couple of Apple's services to this — random errors would appear, simply refusing me to allow my wife to use Apple Music. After she signed out of her Apple ID and signed back in, everything worked, and, four months later, there's been no issues so far. If you're thinking of setting it up, don't worry about potential issues that may crop up — the above solutions will be able to help you out if needed. Daryl is iMore's Features Editor, overseeing long-form and in-depth articles and op-eds. Daryl loves using his experience as both a journalist and Apple fan to tell stories about Apple's products and its community, from the apps we use everyday to the products that have been long forgotten in the Cupertino archives.  Previously Software & Downloads Writer at TechRadar, and Deputy Editor at StealthOptional, he's also written a book, 'The Making of Tomb Raider', which tells the story of the beginnings of Lara Croft and the series' early development. He's also written for many other publications including WIRED, MacFormat, Bloody Disgusting, VGC, GamesRadar, Nintendo Life, VRV Blog, The Loop Magazine, SUPER JUMP, Gizmodo, Film Stories, TopTenReviews, Miketendo64 and Daily Star. Tidal just cut the price of its top-level HiFi tier — now it costs the same as Apple Music Apple Music just added a monthly Replay so you'll always know which bangers you just can't take off repeat The 11-inch OLED iPad Pro's availability might be stymied by Samsung Display's quality issues By Alex BlakeMarch 07, 2024 By John-Anthony DisottoMarch 07, 2024 By Brady SnyderMarch 06, 2024 By Alex BlakeMarch 06, 2024 By Tammy RogersMarch 06, 2024 By Lloyd CoombesMarch 04, 2024 By Matt EvansMarch 04, 2024 By Brady SnyderMarch 04, 2024 By Matt EvansFebruary 28, 2024 By Mike HarrisFebruary 23, 2024 By Mike HarrisFebruary 23, 2024 iMore is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}