{
    "title": "Apple Returns to List of Top US Employers as Other Tech Firms Lose Appeal",
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/news/apple-returns-list-top-us-045910454.html",
    "text": "(Bloomberg) -- Apple Inc. returned to an annual list of the 100 best places to work after falling off last year, but the ranking wasn’t as rich with technology firms after layoffs roiled the sector. Most Read from Bloomberg US Merchant Vessel Struck as Shippers Told to Avoid Red Sea Iowa Latest: Late Counties Could Favor Haley, Strategist Says Apple to Pull Blood-Oxygen Tool From Watches to Avoid US Ban If Appeal Fails US Economy Set for Another Cash Boost If Congress Backs Tax Deal What Is Disease X? How Scientists Are Preparing for the Next Pandemic The iPhone maker was No. 39 in the list from Glassdoor, a website where employees submit anonymous workplace reviews. Glassdoor has conducted the survey since 2009. Apple was one of 31 tech-industry firms on the list, down from 41 last year, leaving more room for old-line employers like banks, retailers and manufacturers. The best company to work for was management consultant Bain & Co., followed by chipmaker Nvidia Corp., whose products underpin the booming artificial intelligence field. “Tech has lost some of its luster versus the past year,” said Glassdoor’s lead economist Daniel Zhao. “It’s still a great industry for jobseekers, but the shine has worn off to some extent. And the companies making a comeback, they’re the old guard, so it suggests we’re heading back to a more balanced job market.” While Apple’s return-to-office push in 2022 may have been to blame for its falling off the list last year, the tech bellwether’s lack of large-scale layoffs compared with its peers likely brought it back, Zhao said, as employees value “stability and security.” The 48% gain in Apple’s shares last year — double the benchmark S&P 500’s increase — probably also kept employees satisfied. Other prominent tech firms on the list include Adobe Inc. at 15, Microsoft Corp. at 18 and Alphabet Inc.’s Google at 26, while Salesforce Inc., Intel Corp., Netflix Inc. and Yahoo Inc. fell off. In finance, Fidelity Investments ranked tenth, up from 18th the previous year. New financial firms making an appearance include Raymond James Financial at 14, Barclays Plc at 72 and JPMorgan Chase & Co. at 82, while BlackRock Inc. didn’t make the cut after being included on the 2023 list. Work-life balance gained importance for many employees last year — mentions of “anxiety” in posts on Glassdoor’s community sites shot up fourfold — but factors such as career opportunities traditionally carry more weight, Zhao said. Bain’s rise to number one for the sixth time was fueled by its reputation for career enhancement, he said, despite the industry’s well-publicized long hours. Bain and Google are the only two firms that have made the list every year. With some tech stalwarts fading — Facebook parent Meta Platforms Inc. missed the cut for the second straight year — more companies from other industries filled the void. The number of retail companies more than doubled to 10, with Lululemon Athletica Inc. and HEB Grocery Co. making repeat appearances while regional supermarket chain Wegmans Food Markets made the cut after not being on last year’s list. Manufacturing firms doubled their presence to six companies, including medical-device maker Boston Scientific Corp., engine maker Cummins Inc. and Texas Instruments Inc. To be considered for the list, firms must have more than 1,000 employees and receive at least 75 employee ratings over the past year on nine workplace attributes, such as compensation, culture and senior management. The rating threshold resulted in last year’s No. 1, software company Gainsight Inc., falling off the list entirely this year as it didn’t receive enough reviews, Zhao said. Most Read from Bloomberg Businessweek Chinese Tycoon on the Rebound After $10 Billion Debt Deal How AI Replaced the Metaverse as Zuckerberg’s Top Priority Trumponomics 2.0: What to Expect If Trump Wins the 2024 Election Five ETFs to Watch in 2024 Kim Kardashian’s Skims Isn’t the Only Celebrity Brand to Watch ©2024 Bloomberg L.P. Related Quotes "
}