{
    "title": "Microsoft is getting close to overtaking Apple as the most valuable US \ncompany",
    "date": "1/6/2024",
    "url": "https://www.windowscentral.com/microsoft/microsoft-is-getting-close-to-overtaking-apple-as-the-most-valuable-us-company",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Microsoft's decision to extend its reach and business portfolio seems to be paying off as it gets within a stone's throw of Apple's market leader position. The source for the market caps comes from factset.com via Marketwatch.com and seems to be a live feed of the market prices. If you follow Microsoft as much as we do, it seems palpable that there is some magic going on over there. While there are areas of the business we want them to improve on, for the most part, the company seems to have positive forward momentum and is making fewer gaffs that would set the company's progress back. With our recent news about the upcoming Surface Pro 10 and Surface Laptop 6 and hardware manufacturers bending the knee to Copilot as Microsoft announced that some Windows 11 devices going forward are going to have an integrated, built-in Copilot button, it seems like Microsoft is heading in the right direction. Hardware is still one of Microsoft's weak points, but AI seems to be doing well, especially as Microsoft and OpenAI continue to strengthen their relationship. And of course, Xbox, with the now-closed Activision Blizzard King deal, has a great chance to make waves in the gaming world that could lead to a serious shift in overall perception of the brand.  Per Companiesmarketcap.com, Microsoft has had a nearly 62% increase in stock value year over year, that alone is enough reason for me to invest in them. But on top of that, Microsoft has been trying, at least from my perspective, to find ways to increase its market cap without harming its consumers and employees. Last year Microsoft laid off 11,000 employees, however, from what we saw across the industry it indeed seems this was a correction for overhiring during the pandemic and the crazy growth period companies were experiencing during lockdown. Microsoft is constantly voted one of the best places to work by many sources, and the company seems to place inclusivity and employee satisfaction at the center of its business' core values. In many other ways, Microsoft has shown that it wishes to be a responsible megacorporation, from Xbox winning the Green Studio of the Year award at Gamescom to being one of the last studios to raise the price of its games to $70. Don't get me wrong, I'm sure there are plenty of things Microsoft could and should be doing better for its employees, consumers, and the environment, but when I see what Apple is doing in the same 3 categories, even from an outside perspective, I guess it is easy for me to root for a company that has backed its platitudes with actual beneficial action. 2024 is set to be a blockbuster year for Microsoft, make sure to tune in to our upcoming CES coverage for all the newest news and highlights of the awesome new technology coming out this year as well as get a look into the future of Copilot and how Microsoft plans to make it so ubiquitous we won't be able to escape it. Xbox, of course, is doing better than it has in years, and 2024 could be Xbox's best year ever, stay tuned to Windows Central for breaking news. If you haven't had a chance yet, check out these top 7 hidden gem games that you shouldn't miss in 2024, some of which are in Game Pass. All the latest news, reviews, and guides for Windows and Xbox diehards. What do you think about Microsoft becoming the number 1 valued company in the U.S.? What do you think Microsoft could be doing better? Let us know in the comments. Colton is a seasoned cybersecurity professional that wants to share his love of technology with the Windows Central audience. When he isn’t assisting in defending companies from the newest zero-days or sharing his thoughts through his articles, he loves to spend time with his family and play video games on PC and Xbox. Colton focuses on buying guides, PCs, and devices and is always happy to have a conversation about emerging tech and gaming news. Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}