{
    "title": "Developers respond to Apple’s new EU iOS rules",
    "date": "1/26/2024",
    "url": "https://www.theverge.com/24051818/apple-app-store-dma-eu-developer-response",
    "text": "By  Emma Roth, a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO. Apple is finally opening up the iPhone to sideloading and alternative app stores — at least in the European Union. It’s also allowing developers to use third-party payment processors in their apps. This is all part of Apple’s efforts to comply with the EU’s new Digital Markets Act (DMA), and at the surface, these changes make it seem like Apple is giving in to regulatory pressure. But some developers are already responding with criticism about Apple’s new guidelines. Epic Games CEO (and part-time Apple critic) Tim Sweeney notably called out the changes as “hot garbage,” even as Epic announced it would be launching its own app store through them. That’s because Apple’s new business terms come with some pretty big disadvantages — especially for larger developers. While the new rules would reduce the commission Apple takes, it would add a new €0.50 (~54 cents USD) Core Technology Fee for apps with over 1 million downloads. For successful apps, those fees add up. Nikita Bier, the founder of the Gas app that has since been acquired by Discord, used Apple’s fee calculator to show just how much Apple will take from apps subject to the Core Technology Fee. In a post on X (formerly Twitter), Bier details how an app with $10 million in sales and 10 million downloads using the App Store’s payment processor will get charged a whopping $515,942 per month. That adds up to around $6.2 million paid to Apple per year — compared to $250,000 per month or about $3 million a year under the existing terms. “This poison pill is therefore explicitly designed to ensure that no second-party app store ever takes off.” Additionally, critics point out that Apple will require a €1,000,000 letter of credit from an “A-rated” financial institution in order to establish an alternative app store in the EU. David Heinemeier Hansson, the creator of Ruby on Rails and co-founder of Basecamp, says the new guidelines will discourage developers of big apps like Meta from using alternative app stores. “This poison pill is therefore explicitly designed to ensure that no second-party app store ever takes off,” Heinmeier Hansson writes in a post on his blog. “Without any of the big apps, there will be no draw, and there’ll be no stores. All of the EU’s efforts to create competition in the digital markets will be for nothing.” The Coalition for App Fairness, a nonprofit organization spearheaded by Epic and focused on fostering mobile app competition, had a similar response. Executive director Rick VanMeter said the plan “does not achieve the DMA’s goal to increase competition and fairness in the digital market — it is not fair, reasonable, nor non-discriminatory,” adding that the change forces developers “to choose between two anticompetitive and illegal options. Either stick with the terrible status quo or opt into a new convoluted set of terms that are bad for developers and consumers alike.” Other developers remain skeptical of the new changes as well. Paul Haddad, the co-founder of Tapbots, tells The Verge that “any reduction in the, overly high, commissions that Apple charges is a benefit for developers.” However, Haddad also notes that Apple’s Core Technology Fee “is likely unworkable” for freemium apps, as well as those that offer demos. “I’m not interested in risking losing money on each and every app install/update in order to save a little money on folks that actually do subscribe to our app,” Haddad says. Meanwhile, developer and author Maximiliano Firtman tells The Verge that the new policy is “Apple doing as many dirty tricks as possible to force developers to stay with current terms and not take advantage of the new terms that will impose an installation fee (on every store) apart from the money Apple will try to collect from your app’s revenue even if App Store won’t be involved in any process.” Firtman also points out that Apple will “still have control” over apps through its iOS notarization feature, which vets each app on alternative app stores, and can also dictate what alternative app stores and web browsers can and can’t do. The potential downsides of Apple’s new guidelines aren’t stopping everyone from adopting them. AltStore, an app store that lets users on iOS sideload apps, already has plans to officially launch its app store in the EU. AltStore developer Riley Testut tells The Verge that it’s working toward meeting Apple’s requirements so it can allow users to download AltStore directly from their website. Testut says developers will be able to publish their apps for free on AltStore, and that they’ve added “deep Patreon integration so that developers will be able to distribute Patreon-exclusive apps to just their patrons.” AltStore doesn’t plan to charge a commission on Patreon-exclusive apps, either. “As a whole, I view this as positive for the platform,” Testut says. “For the first time ever, entirely new classes of apps can exist on iOS, which I believe will push the platform forward.” As for the €1,000,000 letter of credit, Testut tells The Verge that it’s a “reasonable” ask from Apple. “While it does significantly raise the barrier for entry, I’ve learned first-hand that running an alternative marketplace comes with a strong responsibility to protect users,” Testut says. “By requiring proof of credit, this ensures marketplaces are at least legitimate businesses, reducing the risk of ‘scam’ marketplaces taking everyone’s money and leaving.” It’ll take some time to see whether other developers and alternative app stores choose to go along with Apple’s new rules. But perhaps one of the biggest hurdles Apple might have to face in the coming days is whether the EU Commission will actually approve of the company’s changes. The Commission will start evaluating companies’ responses when the DMA goes into effect on March 7th, and Commissioner Thierry Breton has already warned: “If the proposed solutions are not good enough, we will not hesitate to take strong action.” / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}