{
    "title": "Foxconn warns of revenue of drop in Q1",
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/video/foxconn-warns-revenue-drop-q1-152759113.html",
    "text": "Foxconn (2354.TW), best known for assembling Apple's iPhone (AAPL), reported revenue declined in both December and fourth quarter as a whole. The company also warned it expects a year-over-year revenue decline in the first quarter as well. Foxconn noted \"slower market demand\" for its smart consumer products in the fourth quarter. That echoes the comments of two Apple analysts who downgraded the stock this week on iPhone demand concerns. Yahoo Finance Live discusses the report and what it could mean for other Apple suppliers. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Stephanie Mikulich. SEANA SMITH: All right. Let's get to another mover, a top trender here at \"Yahoo Finance.\" Apple supplier Foxconn. Apple moving to buy Apple supplier Foxconn seeing sales declines again in December. Falling over 5% year-over-year. It isn't predicting a turnaround in the current quarter. The data raising some concerns about demand for the newest iPhone model. Something that we have heard about a number of times over the last several weeks. But in particular, this week when we got the downgrades here from two analysts on the Street started by Barclays earlier this week, when they cut their rating to underweight. But what all this means here for some of these suppliers who rely so heavily on Apple's iPhone sales. We're continuing to see some of that pressure here. Taiwan Semiconductor, one of those names here, Myles, that has been under a bit of pressure this week considering the fact that it gets about a fifth of its annual revenue from Apple. So we're seeing pressure once again on Apple. And once again, some of Apple's critical suppliers falling as well. MYLES UDLAND: Yeah. And the classic names for US investors really focused on the derivative Apple Play, let's say. Skyworks, Corvo, a couple of names that have been down closer to 9%, over 9% over the same five-day period, where we've seen shares of Apple fall 6%. So I think it is a reminder that when Apple sneezes, others catch a cold, to use that old cliche. And we see that here, once again, with these names. But I think the question for the overall Apple ecosystem is no one doubts that they're going to continue to sell millions and millions of iPhones. And that they're going to continue to be the dominant player, at least, in the US market in terms of handset share. And I know we're going to get into this, as we get towards their earnings report at the end of this month. It might be the beginning of February, when we have Dan Howley back on set. But it comes down to what's the hardware innovation timeline for them. We know that the headset is really the main driver in terms of hype like a new piece of equipment for Apple people to get-- Apple consumers, and, of course, the Apple fans to get really excited about, as we get into this year. We've seen the services business continue to be the main driver in terms of revenue growth. Though, it's a smaller overall line item on that top line, it grows faster than the other segments. We had the watch problems at the end of last year. I know they've found some interim solutions to that, but are they creating a new business line around AirPods? I think AirPod Max have been somewhat disappointing. Mine are fine. They fit OK. But I think what they've done with the Beats business. There are a bunch of different questions here just around like your Apple stuff. And this gets into like the old, what do I know thing. Every iPhone is the same. But I'm just a guy. And I think that just the guy is the majority of Apple consumers. SEANA SMITH: Yeah, exactly. MYLES UDLAND: And that my defense of me. SEANA SMITH: Well, it's a bit-- it's not too far off from what the argument was from Tim Long there at Barclays just in terms of the fact that there's not a heck a lot of excitement about the iPhone 15. We certainly did not see the number of crowds or the number of sales, at least, expected that we had initially hoped for, many investors had initially hoped for going into this launch. And then he also brought up the fact that looking ahead to the iPhone 16, at least, from his checks. He doesn't anticipate it to be a heck of a lot different than the reception that we're seeing this time around for the latest model. So taking all of that into account, the fact that it's still so reliant on this one piece of hardware. Yes, they are diversifying their business. But the fact that it is still so reliant clearly a headwind, at least, in the immediate term, when you take into account the valuation in the run up that we see in the stock. MYLES UDLAND: Yeah. And look, biggest company in the market. That's why we talk about it all the time. SEANA SMITH: It is. Related Quotes "
}