{
    "title": "Apple, under Brussels pressure, agrees to open up iPhone payments",
    "date": "1/19/2024",
    "url": "https://www.euronews.com/business/2024/01/19/apple-under-brussels-pressure-agrees-to-open-up-iphone-payments",
    "text": "Banks and other rivals had complained the dominance of Apple Pay was anti-competitive. Tech giant Apple has agreed to open up access to its iPhone’s payment functionality after EU antitrust officials warned of an unlawful restriction to competition. Apple Pay lets users buy goods by just tapping their iPhone, using a technology called near-field communication (NFC) – but banks and other potential rivals argued it’s unfair they’re forced to use software controlled by the tech giant. Under the deal brokered by the European Commission, Apple would let alternative providers access the NFC chip on the iPhone – and could face a mammoth fine of 10% of worldwide turnover if it doesn’t comply. The EU executive is now seeking views on whether those plans would help boost competition – after, in 2022, it tentatively found Apple was unfairly restricting access to its technology. An Apple spokesperson said its existing software won’t change, but there’ll also be room for other payments, banking and digital wallet app developers to get involved. “Apple Pay will continue to be a broadly available option,” the spokesperson said, though iPhone users will be able to opt for an alternative. A spokesperson for lobby group the European Digital Payments Industry Alliance, a Brussels lobby group representing the likes of Nexi and Worldline, said it welcomed the announcement. “Fair access to NFC technology can accelerate the digitalisation of payments in Europe and increase the uptake of instant payments, which would deliver savings for merchants and consumers,” the spokesperson said. EU antitrust authorities have in recent years imposed record sanctions on big tech players deemed to favour their own products – and have also introduced special legislation, the Digital Markets Act, to control the power of major internet services that act as gatekeepers. Two fines of €2.4bn and €4.3bn imposed on Google are currently being considered by the EU’s top court. Apple itself is also locked in a court battle over the low tax rates it paid in Ireland. The company said it complied with the law, but the commission argued alleged special deals were an unlawful subsidy. UPDATE (19 January, 15:51 CET): adds quote from EDPIA. CORRECTION (19 January, 16:15 CET): corrects EDPIA’s membership.   "
}