{
    "title": "Fake Curve Finance app listed on Apple Store",
    "date": "2/14/2024",
    "url": "https://cointelegraph.com/news/fake-curve-finance-app-listed-apple-store",
    "text": "Several unauthorized crypto apps that drain users’ assets when downloaded have been listed by tech giants over the years. Own this piece of crypto history A fake app impersonating decentralized finance protocol Curve has been listed on Apple’s App Store. According to a Feb. 14 warning issued by developers, there is currently no official DeFi Curve app. “Beware of scams,” Curve staff wrote. “A fake with our logo was spotted! Stay safe.” The unauthorized Curve app lists MK Technology Co. Ltd as its creator. On its official website, which is hosted by Google Sites, a single proton mail contact address is provided along with a “Curve Finance” descriptor. There are no further apps created by MK Technology on the App Store. The fake app, currently rated 4.6 out of 5 stars with nine reviews, promotes itself as a “powerful app for managing your borrowers and their loans.” “Additionally, users can get entertainment right in app by playing puzzle game in Gaming section. There’s two kinds of the game, classic and shuffle for you to play,” the alleged scammer wrote. It is unclear at the time of publication if the app is simply using Curve Finance’s brand without authorization or is designed to steal users’ wallet assets using in-app features. Fake crypto applications have remained a persistent problem over the years. On June 21, 2023, Apple removed a malicious Trezor wallet app from its App Store. Upon opening, the fake application prompted users to insert their wallet seed phrases, allowing hackers to drain all of the users’ crypto. Similarly, on Nov. 5, 2023, Microsoft removed, for the third time in two years, a fake Ledger app that stole $588,000 across 38 transactions before its delisting. Related: iPhone user blames Apple for $600K Bitcoin theft via fake app Add reaction Add reaction "
}