{
    "title": "Samsung leads Indian smartphone market, Apples market share remains in \nsingle-digit",
    "date": "2/15/2024",
    "url": "https://www.zeebiz.com/technology/news-samsung-india-smartphone-market-share-apple-vivo-realme-idc-report-276596",
    "text": "India is one of the largest mobile phone markets in the world - second largest to be precise - and therefore every smartphone brand wants to increase its presence here. In 2023, South Korean tech major Samsung ruled the smartphone market with a 17 per cent market share. This despite the fact that the company registered a 5 per cent year-on-year (YoY) decline in shipment. The company had a market share of 18.1 per cent in the year 2022. According to the International Data Corporation’s (IDC) Worldwide Quarterly Mobile Phone Tracker, Samsung remained in the leadership position with a record-high ASP (average selling price) of $338. On the other hand, Apple's market share remain in the single digit in 2023. According to IDC, the market share of the Cupertino-based tech company was 6.4 per cent in 2023, higher than 4.6 per cent in 2022.  The year 2023 was quite good for Vivo (excluding iQOO) as shipments and ASPs both grew by 8 per cent and 9 per cent respectively. It was the only brand to register growth amongst the top five brands. According to the report, the market share of Vivo increased to 15.2 per cent in 2023 from 14.1 per cent in 2022. According to IDC, shares of Apple declined in the premium segment ($600 < $800). While Apple’s share declined, Samsung’s share more than doubled in this segment. Also, the premium segment reached a 3 per cent share, growing by 23 per cent, led by the iPhone 13, Galaxy S23/S23 FE and OnePlus 11. \"The super-premium segment (US$800+) registered the highest growth of 86%, with its share up from 4% to 7%. The iPhone14/13/14 Plus together accounted for 54% of shipments, followed by the Galaxy S23+/S23/S22+/S23 Ultra with 22% share. Overall, Apple led the segment with a share of 68%, followed by Samsung at 30%,\" the report said. Meanwhile, India’s smartphone market shipped 146 million smartphones in 2023, with a nominal 1 per cent growth YoY (year-over-year). LATEST NEWS "
}