{
    "title": "Apple’s AI absence may be its advantage",
    "date": "2/3/2024",
    "url": "https://www.republicworld.com/business/apples-ai-absence-may-be-its-advantage/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated February 3rd, 2024 at 10:54 IST Quiet restraint makes the smartphone giant a refreshing contrarian bet. Quiet mode. All the tech world seems to talk about is artificial intelligence. Except, that is, at Apple. Microsoft Chief Executive Satya Nadella mentioned AI three dozen times in his introductory remarks during the software firm’s quarterly results on Tuesday. The $2.9 trillion Apple’s earnings release on Thursday didn't even mention it once. Quiet restraint makes the smartphone giant a refreshing contrarian bet. True, companies making large AI pushes have been rewarded by the market. Microsoft and Google owner Alphabet’s stock have given investors a total return of 62% and 42% respectively over the past year, compared with Apple’s 29%. Alphabet increased its capital investment at an annual rate of 70% in the latest quarter. Meta Platforms said on Thursday its capital expenditure might be up to $9 billion higher this year than in 2023, driven in large part by AI infrastructure. Its shares popped 12%. At Apple, meanwhile, investment spending fell year-on-year in the quarter ending Dec. 30. Boss Tim Cook has said Apple’s AI work happens behind the scenes. The focus is to enhance products, so that image search is more accurate, and iPhones retain their charge longer. Apple also doesn’t like to talk about products until they are ready. Apple’s work in generative AI for its Siri voice assistant and Messages are hardly secrets, but what will be released and when remain mysteries. Cook promised to share more details on Apple’s AI efforts, but not until later this year. The hesitation could mean a missed opportunity: Had Apple’s stock kept up with Microsoft's over the last year, the company would be worth $700 billion more than today. Apple will benefit from others’ AI spending indirectly. If the technologies take hold, users will spend more time in virtual worlds. That probably means more sales of devices such as Apple’s new headset. Moreover, hefty investment carries no guarantees. If they disappoint, or an upstart crashes the party in the way Apple did with the cellphone business, Cook’s restraint will look even wiser. As others serve AI hype by the bucketful, Apple may be less on-trend than usual. Investors ought to be glad of it. Published February 2nd, 2024 at 12:07 IST Send us your views, we’ll publish them. This section is moderated. 'To Share Grief': Husbands in Jail, Mrs Kejriwal And Mrs Soren Meet Hostages in Dutch Town Ede Rescued, Man Arrested UP: Portion of Under-Construction Bridge Collapses in Bulandshahr Upset Over Relationship Issues, B.Tech Student Dies by Suicide in Noida Daughter-in-Law of Former Lok Sabha Speaker Shivraj Patil Joins BJP Google's timeline for RCS support on iPhone Han So Hee-Ryu Jun Yeol Call It Quits Within Two Weeks Amid Controversy Zodiac Signs That Are Born To Be Rebels And Challenge The Status Quo 'Received I-T Notice Last Night', Claims DK Shivakumar AAP's Bharadwaj, Atishi to Address Press Conference at Noon Today | LIVE © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}