{
    "title": null,
    "date": "2/9/2024",
    "url": "https://techcrunch.com/2024/02/09/apple-eyes-business-as-a-prime-market-for-the-apple-vision-pro/",
    "text": "For years, we’ve been hearing about virtual and augmented reality use cases in business around manufacturing, field service and product design, but for the most part, the notion has failed to take hold in a big way. The question now is whether the Apple Vision Pro (AVP), released last week with much ballyhoo, will move the needle at all when it comes to shifting these kinds of devices into the enterprise mainstream. While most people use terms like “augmented reality,” “virtual reality” or even “metaverse” (thanks, Meta), Apple prefers to define the genre in its own terms, referring to the Apple Vision Pro as spatial computing or mixed reality. In its typical fashion, Apple is trying to define a new category. Whatever you call it, the company certainly sees the AVP as a business device alongside its more obvious consumer use cases around gaming, media consumption and good old-fashioned web surfing. Certainly it has the potential to transform the online shopping experience. On Apple’s quarterly earnings call with analysts earlier this month, CEO Tim Cook emphasized that he was seeing lots of interest in the enterprise. “Leading organizations across many industries such as Walmart, Nike, Vanguard, Stryker, Bloomberg and SAP have started leveraging and investing in Apple Vision Pro as their new platform to bring innovative spatial computing experiences to their customers and employees,” Cook said. Notice that reference to spatial computing. Cook cited ideas for business like everyday productivity, collaborative product design and immersive training. The ability to have a so-called infinite desktop is key to the productivity piece: Users can open multiple programs and move them around a huge palette that gives new meaning to extra screen real estate. Whether these devices are good for content creation, however, remains an open question. With 600 apps announced last week, and more expected over time, the Apple Vision Pro lets people access the same apps that they are used to using on macOS and iOS, but tuned to the visual experience of the device. To select an app, users simply gaze at the icon in a similar interface as Apple’s other apps, like Safari, Photos, Messages and Mail. As the gaze focuses on the icon, it lights up and users pinch a finger and thumb together to select it. The Apple Vision Pro sports a familiar-looking interface. Image Credits: Apple The Apple Vision Pro sports a familiar-looking interface. Image Credits: Apple One of the big differences between this and earlier devices is that even though it goes over your eyes, you can see through it. Apple deliberately designed it that way, letting the user see the world, and other people see the user’s eyes, so there wasn’t as much separation between the two. The company believes that will alter the experience and perhaps generate new use cases. Steve Sinclair, who is part of worldwide product marketing for Apple Vision Pro, says the company sees the device as an opportunity to explore new ways of interacting with software. “As our first spatial computer, it’s really given us a platform to build upon to create new spatial experiences,” he told TechCrunch. “We really believe that being able to bring information into your space while allowing you to stay connected to people around you is really important. And that has applications obviously from a consumer perspective but also from a business perspective.” IDC analyst Ramon Llamas surveyed over 400 U.S.-based IT decision-makers last year at the Apple Worldwide Developer Conference and found there were several potential use cases, bearing in mind that this survey was conducted before people actually laid their hands on one. “I think we’re still trying to figure out use cases, especially when it has to do with B2B usage,” Llamas told TechCrunch. “About 56% use it for training, about 44% for customer facing retail experiences, and 43%-44% for collaboration.” Note that none of these use cases involves content creation. Ray Wang, founder and principal analyst at Constellation Research, who has tried the device and is mostly positive about the experience, sees similar use cases. “We expect field service, training and customer experience to be the top use cases,” Wang said. Apple Vision Pro review: The infinite desktop  Earlier this week, Apple announced it was bringing the AVP under the Apple device management umbrella, making it a lot more palatable for IT as a business device that can be managed in the same fashion as any Apple device. But is that enough for companies to commit to a product that starts at $3,500? Jon Turow, a partner at Madrona Ventures, says this pricing approach follows a typical pattern of how Apple tends to introduce new hardware, including the iPhone, iPad, Watch or any new device. Over time, the company adds functionality and refines the approach, and the price usually tends to come down, and newer versions at different price points have also become the norm. “Some people are going to be willing to pay for this. Apple has the Apple Watch Ultra and [there is a market for that]. They’re trying to find that northernmost price point, and then they will probably come in with another option below it,” Turow said. In his survey of IT pros, IDC’s Llamas found that Turow could actually be right: 65% of those surveyed were interested in the device as described at WWD with around half saying they would definitely buy it. The other half expressed curiosity about it. “When you have enterprise users coming back and saying that they want to get their hands on it, I think that speaks to Apple’s abilities to court the enterprise user with this device,” Llamas told TechCrunch. It also has clear benefits over other devices. Wang called it the best eye tracking he’s seen. “Think of macOS and iOS merging and this is what you get,” he said. But there are obvious things that will need to be addressed. For example, the AVP is tethered to a battery, which is definitely awkward and a big weakness, in Wang’s view, but something he expects Apple will fix in future versions. “It feels much lighter when the battery is not attached, but that’s a temporary thing. I’m sure the power will get better over time,” he said. There’s also the ability for people to build their own apps. As a developer ecosystem begins to emerge, we will start to see apps created from scratch, some for consumers and some for businesses, that have been specifically designed for this paradigm. Apple has clearly advanced the technology, whatever you want to call it, and created a pleasurable user experience, bringing the outside world in to the extent you want it. But so far, no AR device has attracted companies to buy them at scale. For now, Apple’s entry is cool to experiment with, but it’s not clear whether people want to wear a device on their face for hours at a time, no matter how good the interface design may be. These VCs think the Vision Pro has a shot in the enterprise  "
}