{
    "title": "Iranian celebrities caught up in $35 million iPhone scam",
    "date": "2/23/2024",
    "url": "https://appleinsider.com/articles/24/02/23/iranian-celebrities-caught-up-in-35-million-iphone-scam",
    "text": "Copyright © 2024, Quiller Media, Inc. Contact Us | Privacy Policy Apple's iPhone 15 is highly sought-after in Iran Thousands of Iranians have been scammed out of a total of $35 million in a con offering half-price iPhones, backed by celebrity endorsement.\r  Apple does not do business in Iran itself, following US sanctions, but businesses do buy iPhones and import them, sometimes individually, and sometimes in bulk. One business that claimed to do this, Kourosh Company of Tehran, further said that it was able to sell iPhones for $700.\rAccording to the Financial Times, for several months, owner Amir Hossein Sharifian was able to drive up sales using high-profile endorsements from Iranian celebrities. In each case, the buyers were told to wait 45 days for delivery of their iPhones, which then never came.\rSubsequently, there have been protesters picketing Tehran's police headquarters demanding action against the Kourosh Company. In the meantime, however, Sharifian reportedly left Iran many months ago. \rIranian police have announced that they have now found Sharifian. While they have not reported his location, they say that he will be extradited back to Iran through Interpol.\rFor his part, Sharifian has claimed that he owes his clients only the equivalent of around $2.7 million.\rEven the reported $35 million is a small proportion of the approximately $1 billion worth of iPhones that local media says has been imported over the last 10 months. Once bought, though, buyers face having to work around how Apple also restricts its services in the region. Apple does not do business in Iran itself, following US sanctions, but businesses do buy iPhones and import them, sometimes individually, and sometimes in bulk. One business that claimed to do this, Kourosh Company of Tehran, further said that it was able to sell iPhones for $700. According to the Financial Times, for several months, owner Amir Hossein Sharifian was able to drive up sales using high-profile endorsements from Iranian celebrities. In each case, the buyers were told to wait 45 days for delivery of their iPhones, which then never came. Subsequently, there have been protesters picketing Tehran's police headquarters demanding action against the Kourosh Company. In the meantime, however, Sharifian reportedly left Iran many months ago. Iranian police have announced that they have now found Sharifian. While they have not reported his location, they say that he will be extradited back to Iran through Interpol. For his part, Sharifian has claimed that he owes his clients only the equivalent of around $2.7 million. Even the reported $35 million is a small proportion of the approximately $1 billion worth of iPhones that local media says has been imported over the last 10 months. Once bought, though, buyers face having to work around how Apple also restricts its services in the region. William Gallagher has 30 years of experience between the BBC and AppleInsider discussing Apple technology. Outside of AppleInsider, he's best known for writing Doctor Who radio dramas for BBC/Big Finish, and is the De... Apple will be holding WWDC 2024 from June 10, showing off its future operating system updates and maybe even new hardware. This is what has been rumored so far. Time Machine is Apple's backup system that automatically saves your Mac's files. Here's how to use the macOS file protection feature. Sponsored Content As streaming becomes more unreliable, having a backup copy is becoming a greater priority, leaving more internet users turning to a YouTube video downloader for various reasons. We checked out the 4K Video Downloader app on Mac to learn how to download YouTube videos for free. Canada's complex car theft ring, which often involves stealing and shipping expensive cars and SUVs around the world, just got even creepier thanks to AirTag. We now have a date for WWDC 2024, we have perhaps more idea than ever of just what it will cover, and we have ever increasing rumors of a smart Apple Ring. All we need now is the release of new iPads. B&H has dropped MacBook Pro prices further as March comes to a close. Pick up an M3 MacBook Pro with 16GB RAM for just $1,549 — or opt for the M3 Pro MacBook Pro 14-inch for $1,699. Both are record-breaking deals. Fake iPhones, AirPods and iPhone cases were among counterfeit goods seized in police raids in Northern Ireland. A photograph of cases intended for the iPhone 16 indicates at least one accessory producer is leaning in on rumors of a new vertical camera arrangement in the new models. Fake iPhones, AirPods and iPhone cases were among counterfeit goods seized in police raids in Northern Ireland. A photograph of cases intended for the iPhone 16 indicates at least one accessory producer is leaning in on rumors of a new vertical camera arrangement in the new models. Apple is believed to be sticking with titanium for the forthcoming iPhone 16 Pro, but a new leak claims that an improved manufacturing process will give it a more polished look.  "
}