{
    "title": "Is Apple Vision Pro The Next iPhone? Analyst Gushes, But Flags Some Early \nHurdles - Apple (NASDAQ:AAPL)",
    "date": "2/7/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/36982661/is-apple-vision-pro-the-next-iphone-analyst-gushes-but-flags-some-early-hurdles",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Apple Inc.'s AAPL latest product, the Apple Vision Pro, is making waves amongst fans and analysts alike for being a \"revolutionary\" product. While it's not the first spatial computing device, Apple is said to have sold nearly 180,000 units over the first weekend. However, the analysts at Deepwater Asset Management have sounded a slightly cautious note, tempering expectations given that it's a first-generation device and comes with its limitations. What Happened: Deepwater's Andrew Murphy likened Apple Vision Pro’s launch to the iPhone’s debut by Steve Jobs. The review recognized the device’s first-generation limitations but also underscored its potential for future evolution. The review suggests that Apple Vision Pro’s utility falls somewhere between the iPhone and the Apple Watch. Murphy anticipates that within the next decade, the Vision Pro product segment will surpass the Apple Watch, which currently contributes to 5% of Apple’s revenue but will remain smaller than the iPhone, which accounts for about 50% of the company’s revenue. See Also: Three Sentences That Saved Apple’s Macintosh 1984 Launch And Underlined Steve Jobs’ Leadership Murphy also highlighted the device’s trade-offs, which could impede its early adoption. These include a limited app ecosystem and a user interface that requires the user to move their head to view certain apps in space physically. Despite these limitations, Murphy thinks the Vision Pro still offers a sneak peek into the future of spatial computing. He anticipates that the Vision Pro could become thinner, lighter, and more capable over time, with new use cases emerging and being adopted by more people. Why It Matters: The Vision Pro has been a hot topic since its launch, with users showcasing its revolutionary capabilities on social media. The device’s real-time ability to scan objects and surfaces has been lauded for its potential in various fields, from learning piano to cooking. Former Apple CEO John Sculley has also compared the Vision Pro to the iPhone, praising the current Apple team for their work on the new product. However, not everyone shares this enthusiasm. Tech billionaire Elon Musk, for instance, has expressed skepticism about the device’s positioning as a “moon shot” attempt by Apple. AAPL Price Action: Apple shares closed at $190.3 on Tuesday, up by 0.53% in the last 24 hours. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: If You Invested $1000 In Apple When Steve Jobs Returned To Apple 28 Years Ago, Here’s How Much You’d Have Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo courtesy: Apple © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}