{
    "title": "Apple earnings: China could be 'source of weakness'",
    "date": "2/1/2024",
    "url": "https://finance.yahoo.com/video/apple-earnings-china-could-source-162806012.html",
    "text": "Apple (AAPL), Amazon (AMZN), and Meta Platforms (META) are set to report earnings on Thursday as Wall Street continues evaluating the strength of Big Tech and its influence on broader markets. Corient Associate Partner and Senior Portfolio Manager Jason Benowitz focuses on the core factors that will determine Apple and Amazon's performances: Chinese markets and the strength of the US consumer. \"China will probably be a source of weakness\" for Apple, Benowitz tells Yahoo Finance. \"The decline last quarter may even get worse in the current quarter when they report because of Huawei being a stronger competitor than they were six months ago.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. BRAD SMITH: Another three big tech companies reporting earnings after the bell this afternoon-- Apple, Meta, and Amazon. And investors are speculating how much the impact-- how much impact the results will have on markets here, given how important the Magnificent Seven rally has been since the end of last year. Let's get to Jason Benowitz, who is the Corient Roosevelt associate partner and senior portfolio manager, to discuss more. Great to have you here in studio with us. When you think about what we could potentially hear from these companies that perhaps add some fuel to the rally that we had seen since the end of last year, what would these companies need to come out and say? JASON BENOWITZ: Sure. So, certainly, investors are expecting to hear positive things from the companies. And I think as an example, if we take Amazon. So, we think Amazon, you know, could potentially provide good results that could catalyze the market higher. And that's because if you look at the different segments of their business, so for example, retail, we know that broadly retail had a good sort of holiday shopping season that was driven by e-commerce and that could drive North American retail at Amazon. And then if you think about their cloud business, here again, we already heard from Google and from Microsoft that cloud business accelerated at those two companies driven by AI. It could be that investors think that this is not quite as applicable to Amazon. And so if they deliver the same sort of result, that could be a driver. And then thinking about Apple. So Apple, we feel like the setup is positive because they've guided to only having flat revenue growth in the quarter, which we think is achievable. And then if you look at what the Street consensus is for Apple for the following quarter and March that they're going to guide to, here again, only up 1%, something we think the company can achieve. So overall, we feel like yes, the stocks have run, but the estimates seem reasonable and there are things that the companies can meet or exceed when they report. SEANA SMITH: Jason, when we hear from some of the sell side analysts since the start of the year, you had Barclays downgrading the stock, as well as Piper Sandler talking about that demand issue that Apple has when it comes to the iPhones. And they also made the case that the next generation or the next iteration of the iPhone won't be too different from the iPhone 15 in terms of that demand, and won't really be enough to excite people to get off the sidelines and really upgrade their phone. How big of a cloud or how big of a risk do you see that being to Apple, at least in the short term? JASON BENOWITZ: Yeah, so Apple will need to show growth in the iPhone segment when they report. And that's an interesting point of contention for investors. So we think China will probably be a source of weakness. We think it declined last quarter. It may actually-- the decline might even get worse in the current quarter when they report because of Huawei being a stronger competitor than they were six months ago. But on the other hand, in the developed world, the US and Europe, we see a higher mix shift. So people buying more expensive phones being a driver. We think the company might be gaining share in emerging markets. And overall, we think they can deliver that iPhone growth that investors are looking for. BRAD SMITH: OK. And so, what can these tech earnings also tell us about the state of the consumer right now, as we're continuing to pore through inflation data, retail sales data? Of course, all of this is kind of what's leading us to try and figure out what the state of the economy is. But as per these companies, what is the state in the health of the consumer? JASON BENOWITZ: So, as I was referencing with respect to Amazon, I think that the fact that the consumer went shopping in the holiday season and furthermore used e-commerce, that was a particular source of growth for the industry broadly. I think we'll see Amazon get at least more of their fair share of that growth. On the other hand, if we look at Meta and sort of the advertising business now, we've already heard from Google, and investors were somewhat disappointed with the search and YouTube advertising that Google reported. And so I think that's probably a good read through to Meta, and so there's some risk there. What could counteract that at Meta is company-specific initiatives. For example, monetization of the Instagram Reels product. But overall, that might be a source of concern. And actually, when Meta provides their guidance for the following quarter, we might get a sense as to whether we think advertisers are-- they're willing to spend in 2024 at the beginning of the year or they themselves concerned about whether the consumer strength would merit that. SEANA SMITH: Yeah, certainly whether or not their year of efficiency is going to be able to really help them navigate some of these headwinds ahead. All right, Jason Benowitz, always great to have you. Thank you so much for joining us here. Related Quotes "
}