{
    "title": "Apple beats AliveCor antitrust lawsuit over heart-rate apps for Apple Watch",
    "date": "2/6/2024",
    "url": "https://finance.yahoo.com/news/apple-beats-alivecor-lawsuit-over-001641448.html",
    "text": "(Reuters) — Apple has persuaded a federal judge to dismiss a lawsuit by a Silicon Valley startup accusing it of illegally monopolizing the US market for heart rate monitoring apps for its Apple Watch. US District Judge Jeffrey White in Oakland, California, ruled on Tuesday against AliveCor, which had developed an app for detecting irregular heartbeats. It had accused Apple of violating the federal Sherman antitrust law and a California unfair competition law. The decision explaining White's reasoning is temporarily being kept under seal because of confidentiality concerns. \"AliveCor is deeply disappointed and strongly disagrees with the court's decision to dismiss our anti-competition case and we plan to appeal,\" the company said in a statement. Apple said in a statement that the lawsuit challenged its ability to make improvements to the Apple Watch that consumers and developers rely on. \"Today's outcome confirms that is not anticompetitive,\" it said. In an amended complaint, AliveCor said Apple had led it to believe it would collaborate on heart-monitoring technology for the Apple Watch, only to then copy its ideas and embark on a \"concentrated campaign to corner the market for heartrate analysis.\" The complaint also accused Apple of \"updating\" the heartrate algorithm for its watches, to prevent third parties from identifying irregular heartbeats and offering competing apps. AliveCor had developed KardiaBand, a wristband for the Apple Watch capable of recording an electrocardiogram, or ECG. The Mountain View, California-based company also developed the Kardia app for analyzing ECG readings on Apple Watches, and a SmartRhythm heartrate analysis app powered by artificial intelligence. Apple, based in Cupertino, California, has denied wrongdoing, and said competitors have no right to dictate its design decisions. AliveCor is still litigating separate patent infringement claims against Apple. The case is AliveCor Inc v Apple Inc, U.S. District Court, Northern District of California, No. 21-03958. (Reporting by Jonathan Stempel in New York; Editing by Sandra Maler) Related Quotes "
}