{
    "title": "Win-Win: Our Analysts' Long $AMZN + Short $AAPL Calls Confirmed",
    "date": "2/2/2024",
    "url": "https://app.hedgeye.com/insights/145895-win-win-our-analysts-long-amzn-short-aapl-calls-confirmed?type=stock-and-policy%2Chedgeye-tv",
    "text": "Continue Browsing © 2024 Hedgeye Risk Management LLC. The information contained herein is the property of Hedgeye, which reserves all rights thereto. Redistribution of any part of this information is prohibited without the express written consent of Hedgeye. Hedgeye is not responsible for any errors in or omissions to this information, or for any consequences that may result from the use of this information. Most of Wall Street is scrambling today as narratives and stock prices shift within the “Magnificent 7.” Consensus may have been caught off guard, but this week’s earnings reports confirmed our analysts’ long and short calls. Amazon (AMZN), a Hedgeye Retail “Best Idea” Long call, was up over 7% today while Apple (AAPL), our Global Tech research team’s top short idea, was down.“We said a couple quarters ago, when the stock was closer to $100, it would test new all-time highs,” Retail analyst Brian McGough said of Amazon, which saw its stock price surpass $170 today. “The print was great, which was what we expected,” Retail analyst Jeremy McLean added. “We thought the numbers would look really good. Upward revisions continue to happen. We’ve seen three quarters now of really good accelerating trends and upside to numbers.” Few analysts are bearish on Apple. Those who are believe the tech giant’s problems are limited to China. Our analyst Felix Wang has repeatedly said that’s not the case, and last night’s earnings call proved that to be true. “Bulls will point to the fact that Apple returned to growth 2% growth. Oh my God, 2% growth. Apple should be surging, right? Not so fast,” Wang explained. “Only one segment showed growth in the December quarter, and that was the iPhone, but that was because they were comping a 9% decline from a year ago.”“China gets all the blame from analysts when you talk to them about Apple, but it’s not just a China problem. This is so important to my short thesis. If you really dig into their earnings statements, there were multiple red flags, which I wrote to clients last night.” To stay informed of our analysts’ long and short calls on the Magnificent 7 and other companies, subscribe to Retail Pro and Tech Pro.  Join New Subscriber Orientation New Conference: Hedgeye Live 2024 May 2-5 Hedgeye University | Become a Better Investor Hedgeye Education Center | Learn More About Hedgeye Learn About Our New Sectors: Global Technology Pro and Software Pro Van Sciver: ‘Not a Great Look’ for Tesla $TSLA A Knockout Call on Long $TKO: Stock Soars on $NFLX News McCullough: ‘The Biggest Red Signal In the Market’ Right Now Is $AAPL By joining our email marketing list you agree to receive marketing emails from Hedgeye. You may unsubscribe at any time by clicking the unsubscribe link in one of the emails. © 2024 Hedgeye Risk Management LLC. The information contained herein is the property of Hedgeye, which reserves all rights thereto. Redistribution of any part of this information is prohibited without the express written consent of Hedgeye. Hedgeye is not responsible for any errors in or omissions to this information, or for any consequences that may result from the use of this information. Thank You! Your request has been received. You have been added to our\n\nMarket Brief. By joining our email marketing list you agree to receive marketing emails from Hedgeye. You may unsubscribe at any time by clicking the unsubscribe link in one of the emails.\nAll hedgeye products and services are subject to Hedgeye's Terms of Service available at\nwww.hedgeye.com//terms_of_service Thank You! Your request has been received. CONGRATULATIONS You're well on your way to becoming a better investor. Check your email & get started today! "
}