{
    "title": "How Will New iPads And Higher iPhone Pricing Help Apple Suppliers?",
    "date": "2/16/2024",
    "url": "https://www.forbes.com/sites/greatspeculations/2024/02/16/how-will-new-ipads-and-higher-iphone-pricing-help-apple-suppliers/",
    "text": "The Texas Instruments headquarters in Dallas, Texas, US, on Sunday, Jan. 21, 2024. Texas Instruments ... [+] Inc. released earnings figures on January 23. Photographer: N. Johnson/Bloomberg Our Theme of Apple Component Supplier Stocks, which includes a diverse set of companies that supply components for Apple’s\nAAPL\n devices, has gained about 3% year-to-date in 2024, underperforming the S&P 500 which remains up by 4% and compared to Apple stock (NASDAQ\nNDAQ\n: AAPL), which has remained roughly flat. Within our theme, Jabil stock, a company known for making casings for Apple’s iDevices, has been the strongest performer, rising by about 8% year-to-date. On the other side, Texas Instruments\nTXN\n - which supplies semiconductor components for the iPhone - has been one of the weaker performers with its stock down by 7% year-to-date. TXN stock has seen little change, moving slightly from levels of $165 in early January 2021 to around $160 now, vs. an increase of about 35% for the S&P 500 over this roughly 3-year period. Overall, the performance of TXN stock with respect to the index has been lackluster. Returns for the stock were 15% in 2021, -12% in 2022, and 3% in 2023. In comparison, returns for the S&P 500 have been 27% in 2021, -19% in 2022, and 24% in 2023 - indicating that TXN underperformed the S&P in 2021 and 2023. In fact, consistently beating the S&P 500 - in good times and bad - has been difficult over recent years for individual stocks; for heavyweights in the Information Technology sector including MSFT, AAPL, and NVDA, and even for the megacap stars GOOG, TSLA, and AMZN. In contrast, the Trefis High Quality Portfolio, with a collection of 30 stocks, has outperformed the S&P 500 each year over the same period. Why is that? As a group, HQ Portfolio stocks provided better returns with less risk versus the benchmark index; less of a roller-coaster ride as evident in HQ Portfolio performance metrics. Given the current uncertain macroeconomic environment with high oil prices and elevated interest rates, how are Texas Instruments and other Apple supplier stocks likely to fare? The demand environment for Apple products has been somewhat mixed. Over Q1 FY’23, the most recently reported quarter, Apple saw overall revenues grow by just 2% year-over-year to $119.6 billion, and earnings stood at $2.18 per share, up 16% year over year. Apple’s iPad and wearables businesses have been facing a slowdown as demand tailwinds seen through Covid-19 have eased. However, this is being partly offset in part by higher sales of iPhones and services. That said, Apple has been able to keep margins relatively high. Over Q1, gross margins came in at a multi-year high of 45.8%, up from about 43% in the year-ago period likely driven by increasing premiumization of its product line and higher services sales. While iPhone average selling prices came in at a high of about $988 for the quarter that ended March 2023, per estimates from research firm CIRP, the metric declined a bit in the subsequent two quarters. It’s likely that the launch of the iPhone 15, which includes a pricier Pro Max model (starting at $1,200) could help drive average prices up again. Higher average iPhone prices should give suppliers some more room to negotiate better deals with Apple. Apple is also slated to launch a new line of iPads in the coming months, and this could also help Apple suppliers to an extent. There were no new tablet launches by Apple in 2023. Besides new product launches and higher average pricing, we also believe that Apple suppliers could see margins improve as supply chain issues faced by semiconductor players through Covid-19 continue to ease. TXN Return Compared With Trefis Reinforced Portfolio Invest with Trefis Market Beating Portfolios See all Trefis Price Estimates  "
}