{
    "title": "Apple Scraps EV Plans Highlighting Shifting Focus on AI",
    "date": "2/28/2024",
    "url": "https://www.investopedia.com/apple-scraps-ev-plans-highlighting-shifting-focus-on-ai-8601590",
    "text": " CFOTO / Future Publishing / Getty Images Apple (AAPL) is reportedly canceling its electric vehicle (EV) plans as the company shifts its focus toward artificial intelligence (AI), which could help the iPhone maker better compete with other tech giants amid the AI boom. After quietly working on an EV for around a decade, Apple decided to wind down the project and transition some of the 2,000 employees assigned to the EV team to AI projects, Bloomberg reported. \"On one hand this is a modest disappointment,\" Wedbush analysts wrote, adding that \"on the other hand, the laser focus within Apple is ramping up and executing a broad AI strategy within the Apple ecosystem as it appears the vast majority of these engineers and developers will now focus their efforts on AI.\" Unlike many of its \"Magnificent 7\" peers such as Microsoft (MSFT) and Google parent Alphabet (GOOGL), Apple has largely kept the details of its AI initiatives out of the public eye so far. During the iPhone maker's annual shareholder meeting Wednesday, Chief Executive Officer (CEO) Tim Cook said that the company sees “incredible breakthrough potential for generative AI, which is why we’re currently investing significantly in this area,\" adding that Apple anticipates \"it will unlock transformative opportunities for our users when it comes to productivity, problem solving and more.” The update comes after Cook had said \"there's a huge opportunity for Apple with GenAI and AI\" during the company's most recent earnings call earlier this month. CFRA analyst Angelo Zino told Investopedia that \"Apple in many respects has been late to the AI game but that is typical Apple.\" He added that the company \"has more than enough to be a major player in the AI arms race but rather focus on cloud services like many others, Apple will look to be a leader on the device side, creating more personalized experiences for the consumer while continuing to focus on privacy.\" Zino noted that \"reallocating R&D towards AI initiatives illustrates the opportunity it see[s] ahead and where we think it has a greater chance to improve its overall ecosystem of products.\" He added that \"it has the potential to spur greater Services revenue where margins are higher and has been the key driver for realizing greater shareholder value over the last 5 years.\" Wedbush analysts said that the firm views Apple's new Vision Pro virtual reality headset as \"the first step to Apple pushing into AI.\" Bank of America analysts have also said they expect future gains for Apple as AI capabilities are integrated into iPhones, with \"a strong refresh cycle to take place over the next two years as Generative AI features start to take hold on smartphones.\" Apple shares were down 0.8% trading at $181.24 at 3:40 p.m. ET Wednesday. They've lost about 2.4% so far this year, though they've gained close to 23% over the past year. Bloomberg. \"Apple to Wind Down Electric Car Effort After Decadelong Odyssey.\" Wedbush. \"Apple (AAPL) Rips the Band-Aid Off Project Titan; Focus on AI InitiativesTime to Move On.\" CNBC. \"Apple CEO Tim Cook says company is ‘investing significantly’ in generative AI.\" Bank of America. \"Apple Inc. Survey signals incoming iPhone refresh cycle and strong customer loyalty.\" "
}