{
    "title": "Netflix Takes Direct Control — No More Apple iTunes Billing For Longtime \nUsers",
    "date": "2/26/2024",
    "url": "https://www.tradingview.com/news/benzinga:891e8a3fe094b:0-netflix-takes-direct-control-no-more-apple-itunes-billing-for-longtime-users/",
    "text": "Netflix Inc. NFLX has decided to discontinue billing through Apple Inc. AAPL for its long-term subscribers. The streaming giant will now require these subscribers to pay directly through Netflix. What Happened: Netflix has started to remove its long-term subscribers from their Apple iTunes billing plans. These subscribers will now have to pay Netflix directly using a credit or debit card, reported The Verge. This change applies to all basic plan members who were using an iTunes payment method. Netflix representative Momo Zhao confirmed the news, stating that the change is now in effect. This means that subscribers who have been enjoying the old $9.99 price for years will now have to switch to direct billing or accept a price hike for the same plan. See Also: How Much is Netflix: Current Subscription Prices in 2024 This move marks the end of an era for Netflix subscribers who have been using Apple’s payment system. Despite Apple introducing in-app subscription options for iPhones in 2010, Netflix only added them to its iOS app in 2015 due to its opposition to Apple’s 30% cut. In late 2018, Netflix stopped in-app subscriptions entirely, indicating its unwillingness to pay Apple, the report noted. Why It Matters: While Netflix and Apple have a long standing relationship, the streaming giant in January announced that it would not be developing an app for the Apple Vision Pro, suggesting users watch its programming via the web. This was seen as a significant setback for Apple, given its focus on entertainment content for the new device. Netflix’s Co-CEO, Greg Peters, also downplayed the market relevance of Apple's first-generation mixed reality headset, stating that the market for the device isn’t large enough to warrant an investment in app development. Photo via Shutterstock Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Netflix Following Amazon-Style Subscriber Tactics? Tests Streaming Deal With France’s Carrefour To Boost Customer Base Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @bradfairbridge @rajbuzzz @Kevin Trinh @Cenobar @arcanebear @udcovers @fx.today @_dalton16 @TradingView @mytradingsetup @ftmocom @chartfeed @olka_gadzieva @mytradingsetup @satoshi_empire @MidasPls @Zeiierman Trading @Onlnternet Whatever the trade "
}