{
    "title": "US iPhone market share rises despite declining smartphone sales",
    "date": "2/22/2024",
    "url": "https://9to5mac.com/2024/02/22/us-iphone-market-share-3/",
    "text": "US iPhone market share continued to rise last month, despite a continued decline in all smartphone sales, according to a new market intelligence report. The report shows that US smartphone sales for the start of the year continued a long-term downward trend in each new year, with a 45% decline since a peak in 2017 … Counterpoint Research didn’t break things down in any detail, but opened by noting the continued depression in the US smartphone market as a whole. US smartphone sales declined 10% YoY in January, according to preliminary data from Counterpoint Research’s 2024 US Weekly Sell-through Tracker. This declining trend was mainly driven by the underperformance of low-end segments. The premium and ultra-premium segments performed better but overall upgrade rates remained tepid. “Tough times in the volume-driven low end coupled with delayed upgrades in anticipation of new products drove the market lower,” said Senior Analyst Maurice Klaehne. Indeed, says the company, aside from a temporary blip two years ago, we’ve seen a steady decline since 2017. (This view obscures the pandemic effect by showing only new year sales.) But the good news, illustrated on the same graph is that Apple’s market share has continued to rise over the same time period. Apple outperformed most brands with its iPhone continuing to gain share, though its sales were also down low single digits. “We continue to see strong promotions for the iPhone 15 series in postpaid, while there remains significant interest in older models like the iPhone 11 and iPhone 12 among cost-conscious consumers in prepaid. This combination is enabling Apple to maintain stability in a market experiencing double-digit declines,” observed Research Director Jeff Fieldhack, adding, “This is good for share gains and great for the iOS installed base.” Photo by Swipe on Unsplash FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Introduced in 2007 by Steve Jobs, iPhone is Appl… Ben Lovejoy is a British technology writer and EU Editor for 9to5Mac. He’s known for his op-eds and diary pieces, exploring his experience of Apple products over time, for a more rounded review. He also writes fiction, with two technothriller novels, a couple of SF shorts and a rom-com! "
}