{
    "title": "Vision Pro Review: Apple's First Headset Lacks Polish and Purpose",
    "date": "2/11/2024",
    "url": "https://www.myheraldreview.com/news/business/vision-pro-review-apple-s-first-headset-lacks-polish-and-purpose/article_73cac478-c60f-11ee-a8a5-531bfa8f1836.html",
    "text": "Have any questions?  Please give us a call at 520-458-9440 Copyright ©  • Wick Communications Terms of Use | Privacy Policy    The Vision Pro, Apple’s first major new product in nearly a decade, in San Francisco on Feb. 5, 2024. The company is marketing the $3,500 virtual reality headset as a computer for doing work, a movie player and a gaming machine. (Clara Mokri/The New York Times) About 17 years ago, Steve Jobs took the stage at a San Francisco convention center and said he was introducing three products: an iPod, a phone and an internet browser. “These are not three separate devices,” he said. “This is one device, and we are calling it iPhone.” At $500, the first iPhone was relatively expensive, but I was eager to dump my mediocre Motorola flip phone and splurge. There were flaws — including sluggish cellular internet speeds. But the iPhone delivered on its promises. Over the past week, I’ve had a very different experience with a new first-generation product from Apple: the Vision Pro, a virtual reality headset that resembles a pair of ski goggles. The $3,500 wearable computer, which was released Friday, uses cameras so you can see the outside world while juggling apps and videos. Apple calls it a “spatial computer” that blends together the physical and digital worlds for people to work, watch movies and play games. Apple declined to provide an early review unit to The New York Times, so I bought a Vision Pro on Friday. (It costs much more than $3,500 with the add-ons that many people will want, including a $200 carrying case, $180 AirPods and $100 prescription lens inserts for people who wear glasses.) After using the headset for about five days, I’m unconvinced that people will get much value from it. The device feels less polished than past first-generation Apple products I’ve used. It’s not better for doing work than a computer, and the games I’ve tried so far aren’t fun, which makes it difficult to recommend. An important feature — the ability to place video calls with a humanlike digital avatar that resembles the wearer — terrified children during a family FaceTime call. The headset is superb at delivering on one of its promises: playing video, including high-definition movies and your own recordings in 3D that let you immerse yourself in past memories, which is both eerie and cool. The Vision Pro, Apple’s first major new product in nearly a decade, in San Francisco on Feb. 5, 2024. Apple’s Time Cook called it a “spatial computer”, that blends together the physical and digital worlds for people to work, watch movies and play games. (Clara Mokri/The New York Times) In the past decade, companies such as Meta, HTC and Sony have struggled mightily to sell headsets to mainstream consumers because their products were cumbersome to wear, their apps were limited and they looked uncool. The Vision Pro has a superior user interface, better picture quality, more apps and higher computing power than other headsets. But it’s slightly heavier than Meta’s cheaper Quest headsets, and it plugs into an external battery pack that lasts only two hours. The ski-goggle aesthetic of the Apple product looks better than the bulky plastic headset visors of the past. But the videos posted by early adopters walking around outside with the headset — men I call Vision Bros — confirm that people still look ridiculous wearing tech goggles, even when they are designed by Apple. The Vision Pro is miles ahead of other headsets I’ve tested in making an immersive 3D interface simple for users to control with their eyes and hands. I let four colleagues wear the headset in the office and watched all of them learn to use it in seconds. That’s because it’s familiar to anyone who owns an iPhone or a similar smartphone. You’ll see a grid of app icons. Looking at an app is equivalent to hovering over it with a mouse cursor; to click on it, you tap your thumb and index finger together, making a quick pinch. The pinch gesture can also be used to move around and expand windows. Brian Chen, the personal tech columnist for The New York Times, reviews the Vision Pro, Apple’s first major new product in nearly a decade, at the NYT San Francisco bureau’s office on Feb. 5, 2024. The company is marketing the $3,500 virtual reality headset as a computer for doing work, a movie player and a gaming machine. (Clara Mokri/The New York Times) The Vision Pro includes a knob called the Digital Crown. Turning it counterclockwise lets you see the real world in the background while keeping digital windows of your apps in the foreground. Turning it clockwise hides the real world with an opaque background. When using the headset for work, you can surround yourself with multiple floating apps — your spreadsheet can be in the center, a notes app to your right and a browser to your left, for example. It’s the 3D version of juggling windows on a computer screen. As neat as that sounds, pinching floating screens doesn’t make working more efficient because you need to keep twisting your head to see them. I could tolerate juggling a notes app, a browser and the Microsoft Word app for no longer than 15 minutes before feeling nauseated. The least joyful part of the Vision Pro is typing with its floating keyboard, which requires poking one key at a time. I had planned to write this review with the headset before realizing I wouldn’t make my deadline. There’s an option to connect a physical keyboard, but at that point I’d rather use a laptop that doesn’t add weight to my face. The Vision Pro can also work with Mac computers, where you can mirror the screen into the headset as a virtual window that can be expanded to look like a large display. In my tests, there was a consistent lag — each keystroke took a fraction of a second to register virtually, and the mouse cursor moved sluggishly. I also instinctively wanted to control the Mac with pinches, even though it’s not set up to work that way, which was frustrating. Next I tried the headset in the kitchen, loading a pizza recipe in the web browser while I grabbed and measured ingredients. Moving around while looking through the camera, I became nauseated again and had to remove the headset. The Vision Pro is most comfortable to use while seated. Apple advises people to take breaks to reduce motion sickness. Video calling is now an essential part of office life, and here the Vision Pro is especially inferior to a laptop with a camera. The headset uses its cameras to snap photos of your face that are stitched into a 3D avatar called a Persona, which Apple has labeled a “beta” feature because it is unfinished. Personas are so cringe that people will be embarrassed to use these in a work call. The Vision Pro produced an unflattering portrait of me with no cheekbones and blurred ears. In a FaceTime call with my in-laws, they said the blur conjured 1980s studio portrait vibes. One of my nieces, a 3-year-old, turned around and walked away at the sight of virtual Uncle Brian. The other, a 7-year-old, hid behind her father, whispering in his ear, “He looks fake.” Video is where the Vision Pro shines. When streaming movies through apps such as Disney+ and Max, you can pinch the corner of a video and drag it to expand it into a jumbo high-resolution TV; some movies, such as “Avengers: Endgame” and “Avatar 2,” can be viewed in 3D. The picture looks much brighter and clearer than the quality in Meta’s Quest products. Audio quality on the Apple headset is excellent, but the speakers are loud, so you’ll need AirPods if you want to use them in public spaces. The headset’s two-hour battery life is not long enough to last through most feature-length movies, but in my experience, this turned out to be moot because I couldn’t watch movies for more than 20 to 30 minutes before needing to rest my neck and eyes from the heavy headset. Not many games have been made for the headset yet. I tried some new Vision Pro games such as Blackbox, which involves moving around a 3D environment to pop bubbles and solve puzzles. It looked nice, but after the novelty wore off, my interest fizzled out. It’s tough to recommend the Vision Pro for virtual-reality gaming when Meta’s $250 Quest 2 and $500 Quest 3 headsets have a deeper library of games. The Vision Pro is the start of something — of what, exactly, I’m not sure. But the point of a product review is to evaluate the here and now. In its current state, the Vision Pro is an impressive but incomplete first-generation product with problems and big trade-offs. Other than being a fancy personal TV, it lacks purpose. Most striking to me about the Vision Pro is, for such an expensive computer, how difficult it is to share the headset with others. There’s a guest mode, but there’s no ability to create profiles for different family members to load their own apps and videos. So it’s a computer for people to use alone, arriving at a time when we are seeking to reconnect after years of masked solitude. That may be the Vision Pro’s biggest blind spot. We're always interested in hearing about news in our community. Let us know what's going on! Copyright © 2001- • Herald/Review Media • 102 S Fab Ave, Sierra Vista, AZ 85635 | Terms of Use | Privacy Policy | Contact Us | The HERALD/REVIEW MEDIA is owned by Wick Communications. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: Get up-to-the-minute news sent straight to your device.        Account processing issue - the email address may already exist Receive the digital, interactive PDF of the newspaper in your inbox. Delivered right as the newspaper goes to print on Wednesdays, Fridays, and Sunday. Sign up with  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Sign in with Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.   Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. A receipt was sent to your email. "
}