{
    "title": null,
    "date": "2/24/2024",
    "url": "https://finance.yahoo.com/news/1-stock-id-drop-magnificent-120000673.html?ref=biztoc.com",
    "text": "The \"Magnificent Seven\" is a collection of companies called out as market leaders by CNBC's Jim Cramer. They are: Microsoft Apple Nvidia Alphabet Amazon Meta Platforms Tesla This group has had a phenomenal run since 2023, but there could be some changes. One of these companies' results stands out in stark contrast to the others, and I think it warrants removal from the group and replacement with another. So, which company would I kick out? While it may seem like blasphemy, removing Apple from this group is the clear choice. While every other company on this list has grown its revenue substantially over the past year, Apple's quarterly revenue has been shrinking or barely growing, including in its latest quarter. Prior to Apple's most recent quarter, Apple's revenue shrank for four straight quarters. (Nvidia is not displayed on the chart below because its 200% year-over-year quarterly revenue growth skews the graphic.) While Tesla is flirting with negative revenue growth, it hasn't dipped into that range yet, and its previous results still have some weight. Additionally, analyst revenue projections for 2024 and 2025 show that Tesla should have strong years while Apple will continue to struggle. Company 2024 Revenue Growth 2025 Revenue Growth Tesla 13.8% 20.6% Apple (6%) 6.4% Data source: Yahoo! Finance. Another factor in this analysis is Apple's lack of artificial intelligence (AI) strategy or products. While the other six companies in this group have a dedicated AI plan or product, Apple has announced nothing. In fact, the term \"artificial intelligence\" was only mentioned twice on its recent conference call. This is a quick-moving technology, and with competitors like Samsung already announcing innovative AI integration into their smartphones, Apple looks to be falling behind. Additionally, with improvements in smartphone technology, phone upgrade cycles have lengthened, hurting Apple. This has elongated its revenue cycle, causing its growth to slow tremendously. With Apple lacking an AI strategy and hardly growing, I think it's time to kick it out of the \"Magnificent Seven.\" But what company would I replace it with? In its place, I'd add Taiwan Semiconductor Manufacturing Company (NYSE: TSM), known as TSMC for short. At face value, this seems like an oddity. Above, I disparaged Apple's revenue growth. However, TSMC has underperformed most of Apple's growth figures since the start of 2023. Because TSMC is a chip manufacturer, it's known to be a cyclical business. After there was a chip supply glut at its customers' facilities over the past year, product demand dropped, causing its revenue to fall. This trend looks to be reversing, as TSMC's January revenue figures rose 7.9% year over year, indicating it's returning to growth mode. But that's just the beginning. Unlike Apple, TSMC has exposure to AI through the chips it supplies to various hardware companies, like Nvidia. Currently, AI chips only make up a small percentage of its total revenue. But its CEO C.C. Wei projects a compounded annual growth rate (CAGR) of 50% for these types of chips, and thinks this business segment could make up a \"high teens\" percentage of its revenue by 2027. Overall, management believes its CAGR will be between 15% and 20% over the next few years, placing TSMC at the top end of this group for growth projections. Wall Street analysts agree with these figures, as they project 22.7% and 19.7% revenue growth in 2024 and 2025, respectively. Although Apple was one of the most dominant stocks over the past decade, its time has come. Instead, I'd think investors would be better off owning shares of Taiwan Semiconductor Manufacturing. Although it may take some time, investors need to recognize this powerhouse for its dominance and include it in lists like these. Even some long-term Apple bulls like Warren Buffett and Berkshire Hathaway have already started reducing their position size, potentially marking a turning point for the stock. The \"Magnificent Seven\" is already a strong group, but substituting TSMC for Apple would make it even stronger. Should you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 20, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Keithen Drury has positions in Alphabet, Amazon, Meta Platforms, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Berkshire Hathaway, Meta Platforms, Microsoft, Nvidia, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. 1 Stock I'd Drop From the \"Magnificent Seven\" and 1 I'd Add was originally published by The Motley Fool Related Quotes "
}