{
    "title": "Apple's iPhones might need an AI upgrade soon",
    "date": "3/6/2024",
    "url": "https://www.businessinsider.com/apple-iphones-might-need-ai-upgrade-soon-2024-3",
    "text": "       The last thing Tim Cook needs this year is for the iPhone to give him a headache. The Apple CEO already has plenty on his plate as he attempts to make a success of a fresh hardware push from Cupertino following the launch of the Vision Pro last month. The $3,500 headset represents Apple's big bet on mixed reality. But its hefty price tag — along with uncertainty around the mainstream appeal of the wearable gear — means Cook will have plenty of work to do to turn it into a consumer hit. Unfortunately for Apple, that task could be complicated as signs emerge that its workhorse gadget needs a revamp. Since 2007, when Steve Jobs unveiled the original iPhone onstage at a Macworld Expo, the device has become Apple's biggest moneymaker. In its most recent quarter, Apple generated almost $70 billion of its $119.6 billion total revenue from iPhone sales. That was up from $65.8 billion a year earlier, showing growth is still happening in its most important product segment. But that growth isn't exactly even. China, Apple's most important international market, has started to sour on iPhones, bucking a trend of growth in other regions. Apple shared signs of this trend starting to form in the last three months of 2023 as net sales in the Greater China region fell almost 13% from $23.9 billion in 2022 to $20.8 billion. That hasn't changed in 2024. iPhone sales in China dropped 24% in the first six weeks of the year, according to data from Counterpoint Research. That has led Apple to slip to fourth spot in smartphone market share, behind local rivals Vivo, Huawei, and Honor. There are some key reasons for this. For one, Beijing has made it less appealing to buy iPhones. It was reported by the Wall Street Journal in September that the Chinese government had banned officials from using iPhones. Related stories Will Wong, a Singapore-based senior research manager with IDC's Asia/Pacific Client Devices Group, said a soft Chinese economy has led to more cautious consumer spending at large. He also pointed to a shift in consumer preferences in China as part of the reason Apple has lost its top spot. \"One important reason is that the local consumers have changed,\" Wong told BI. \"The FOMO sentiment is not as strong as before and the youngsters are also embracing the so-called 'B1B2 economy.'\" The B1B2 economy refers to a trend of Chinese youths shopping in the basement levels of malls because the stores on lower floors tend to carry lower-cost goods. Viable homegrown competition has emerged, too. Huawei released a 5G smartphone called the Mate 60 Pro last year that was championed at home thanks to its use of domestic chips. Unit sales of Huawei phones jumped 64% in the first six weeks of the year, per Counterpoint Research. Huawei had to increase production to keep up with the demand for the phone after its release, with the wait time for the phone extending up to three months by November. \"Android vendors have been promoting foldable and AI, while Apple brought little excitement to consumers,\" Wong told BI. Gene Munster, a managing partner and cofounder at Deepwater Asset Management, told BI that demand for the iPhone in China follows a boom-bust pattern. \"When Apple has a strong upgrade cycle one year it's followed by softer demand in year two,\" Munster said. \"I suspect demand next year will see a rebound.\" Munster added that the \"movement for made-in-China from Chinese consumers\" also contributes to Apple's soft sales in 2024 so far, though to a lesser extent than the boom-bust cycle. Though Apple can rely on other regions to continue to snap up iterative upgrades to its iPhone, the threat of Chinese consumers abandoning its phones in favor of homegrown ones is a problem. Especially so as they represent close to a fifth of Apple's revenue base. Dan Ives, a managing director at Wedbush, said slipping iPhone 15 sales matched with additional discounting on the device had given investors \"agita.\" \"This is the cherry on top of the sundae of bad news from Cupertino with last week's reports that Apple is ditching the EV project,\" he said. Fortunately for Apple, it is working on something this year that could give the iPhone the much-needed upgrade it's seeking: artificial intelligence. Last month, Cook shared that Apple would be ready to share details about its work on AI later this year. The technology has profoundly shaped Silicon Valley innovation since the launch of ChatGPT and left many to speculate on how Apple could put it to use across its devices. Apple's AI efforts, led by ex-Googler and senior vice president John Giannandrea, could introduce several AI features to iPhones that offer an edge over Chinese competitors. That could be a much smarter Siri or vastly improved photo editing capabilities. The time to act is limited, however. As the US and China are locked in a battle over technological supremacy, expect to see Chinese companies work tirelessly to incorporate AI into their devices too. When Jobs introduced the iPhone to the world in 2007, his mission was \"to reinvent the phone.\" Cook's new mission might be a reinvention of the iPhone.  Read next Jump to "
}