{
    "title": "EU fine wipes $78bn off Apple's valuation",
    "date": "3/4/2024",
    "url": "https://www.telegraph.co.uk/business/2024/03/04/ftse-100-markets-latest-news-japan-stocks-ai-nikkei/",
    "text": "Chosen by us to get you up to speed at a glance More than $78bn (£61bn) has been wiped off the value of Apple after it was fined €1.8bn (£1.6bn) by the European Union for breaking the bloc’s competition laws by favouring its own music streaming service over rivals. The US tech giant’s shares have dropped 2.9pc after it was issued the penalty for raising the price iPhone users pay for music streaming by banning apps like Spotify from promoting cheaper alternatives. Margrethe Vestager, the European Commission’s competition chief, said Apple had abused a dominant position for a decade, meaning that rivals to Apple Music found it more difficult to compete. The fine is the first that the EU has imposed on the tech giant. The European Commission said Apple had imposed “anti-steering provisions” that prevented apps such as Spotify from directing users to cheaper subscriptions if users subscribed outside of its app. The investigation into Apple’s practices was triggered after Spotify made a complaint five years ago. Apple charges fees of up to 30pc for music subscriptions bought through apps, meaning many streaming companies have offered cheaper alternatives on their website, or stopped offering in-app subscriptions altogether. Ms Vestager said: “For a decade, Apple abused its dominant position in the market for the distribution of music streaming apps through the App Store. They did so by restricting developers from informing consumers about alternative, cheaper music services available outside of the Apple ecosystem. This is illegal under EU antitrust rules, so today we have fined Apple over €1.8bn.” Apple said the Commission had failed “to uncover any credible evidence of consumer harm, and ignores the realities of a market that is thriving, competitive and growing fast”. It said Spotify had “co-ordinated” with the Commission, meeting 65 times over eight years, pointing out that the company is based in Sweden. The company said it would appeal. Read the latest updates below. Thanks for joining us today. Chris Price will be back in the morning. In the meanime, here are some key stories from elsewhere on The Telegraph website. BBC poised to reverse merger of news channels Non-dom tax raid risks backfiring on Hunt, warns IFS Scottish wind farm fined £5.5m for inflating prices Finally, here’s Lord Sugar, the founder of Amstrad, with one of his 1980s Personal Computer Word Processors, or PCWs, which reportedly sold 8m units and were popular with small businesses. He’s bought back the brand from Sky for a digital market agency run by his grandson. The billionaire Issa brothers have slashed investment at their petrol station empire as they battle to pay down debts. Hannah Boland reports: EG Group, the forecourt business owned by Mohsin and Zuber Issa, spent 37pc less on investment last year in what executives called a “controlled reduction” to maximise liquidity. The Blackburn-owned company, which controls thousands of petrol stations around the world, spent $243m (£191m) on growth in 2023. It did not explicitly lay out where capital expenditure was reduced but the business had invested heavily in US expansion in 2022. By contrast, EG Group said US chief John Carey had expanded “with minimal capital spend” last year.The cutback comes as EG races to reduce its debt pile in the face of high interest rates. The company has been selling off assets to pay down debts and reduced its borrowing pile from $10bn at the start of 2023 to $6bn by the end of the year. In a joint statement, Mohsin and Zuber Issa said they had “strengthened” EG’s balance sheet. The pair said they were committed to cutting debt further. Read the full story... Two low-cost airlines in the US, JetBlue and Spirit Airlines, pulled the plug on a merger yesterday [Monday], seven weeks after a judge ruled it violated competition law. The companies had argued that JetBlue’s $3.8bn (£3bn) purchase of Spirit would be good for consumers, but a Federal judge sided with the US Justice Department, which had argued that it would lead to higher fares. JetBlue chief Joanna Geraghty said: “We believed this merger was worth pursuing because it would have unleashed a national low-fare, high-value competitor to the Big Four airlines. “Given the hurdles to closing that remain, we decided together that both airlines’ interests are better served by moving forward independently.” JetBlue will pay Spirit $69m as a termination fee. The FTSE 100 closed down 0.55pc today. The biggest riser was Endeavour Mining, up 3.32pc, followed by silver and gold miner Fresnillo, up 2.70pc. The biggest faller was Ladbrokes owner Entain, down 7.85pc, followed by Ocado, down 6.51pc. Meanwhile, the FTSE 250 fell 0.54pc. Hochschild Mining was up the most, adding 5.26pc, followed by shipbroking business Clarkson, up 3.13pc. The biggest faller was music business Hipgnosis, down 8.24pc, followed by Aston Martin, down 6.62pc. America is engaged in “classic protectionism”, the Chinese government has claimed, days after President Joe Biden announced an investigation into the technology in cars made by “countries of concern. Mr Biden said: China is determined to dominate the future of the auto market, including by using unfair practices. China’s policies could flood our market with its vehicles, posing risks to our national security. I’m not going to let that happen on my watch. But China’s Ministry of Commerce has hit back, saying: In recent years, the US has imposed high tariffs on Chinese automobiles and restricted Chinese cars [from government procurement deals] ... Now, under the guise of national security, it intends to set up non-tariff barriers. This is classic protectionism. Nouriel Roubini, an economist who served on Bill Clinton’s Council of Economic Advisers and later famously predicted the financial crisis, is optimistic about US economic growth this year. But he says it could negate the so-called “soft-landing” that many are predicting. He told Bloomberg: There actually is a serious possibility of what people refer to as a ‘no landing,’ that growth remains above potential and inflation remains sticky… Paradoxically, the good news on growth may be bad news for the market if that implies the Fed is not going to cut as much and as soon as people expect now. The S&P 500 is 0.09pc lower in trading this afternoon, just below its latest all-time high set this year. The Dow Jones Industrial Average of 30 leading American companies is down 0.28pc, and the tech-heavy Nasdaq Composite index is 0.21pc lower. Momentum is slowing for US stocks after roaring higher on excitement that inflation appears to be cooling, cuts to interest rates may be coming and the US economy has so far shrugged off predictions for a recession. At the same time, a frenzy around artificial intelligence has catapulted some stocks to stratospheric heights. Super Micro Computer, which sells server and storage systems used in AI and other computing, jumped another 24pc today. It had already more than tripled in 2024 after more than tripling last year. It’s the first trading for the stock since an announcement that it will join the S&P 500 index of the biggest US stocks in two weeks. Such a move could drive even more investment in the company. The poster child of AI mania is Nvidia, whose chips are powering much of the move into AI. It has rise another 3.89pc today Monday to bring its gain for the young year so far to 77.49pc after more than tripling in 2023. Such spurts are bolstered by a surge in profits and expectations for tremendous growth to continue. But they are also raising worries about another potential bubble as prices whiz at breathtaking speeds. Anglo American has slashed executive bonuses by 15pc after workers were killed in mining accidents last year. Adam Mawardi has the details: Anglo American’s remuneration committee overhauled director pay structures following the loss of three employees last year in accidents at its operations in Los Bronces in Chile and Kumba in South Africa. Los Bronces is one of Anglo American’s largest copper mines, while Kumba is the largest iron-ore producer in Africa. The fatalities occurred despite the £23bn miner recording its lowest injury rate ever in 2023. The FTSE 100 company, which is the world’s largest producer of platinum, said on Monday that cutting bonuses will help recognise the “unacceptable loss of life”. The number of injuries and safety leadership will also be considered when calculating the 2024 bonus, the company added. Anglo American said that linking bonuses to workplace health and safety will help the company achieve its goal of having zero fatalities at its sites. Duncan Wanblad, the chief executive of Anglo American, was handed nearly £3.6m in total rewards for 2023, including a £1.8m salary, £1m bonus and more than £700,000 in long term share incentives. It comes after Anglo American last month posted a 31pc drop in underlying earnings before interest, tax, depreciation and amortisation to $10bn (£7.9bn) in 2023. The finance minister of France has attacked the European Commission’s approach towards energy, saying that it places much emphasis on renewable energy such as wind, while overlooking nuclear. Bruno Le Maire told reporters today: We no longer want a Europe that sets targets for wind turbines here, and for solar there. We want a Europe that sets clear climate targets. Bloomberg reported that France is seeking to avoid being fined for failing to miss its renewable energy target. The country argues that since its nuclear-heavy electricity system means it is emitting less carbon dioxide than most other nations. Mr Le Maire added. France won’t pay a fine, and will find a solution with the commission. I don’t see why one would pay a fine while being successful in terms of climate. The aerospace and defence giant Airbus has been handed almost £100m in grant funding to support the further development of ultra-lightweight wings in Britain. Matt Oliver reports: The company is among several manufacturers in the life sciences, automotive and aerospace industries to have been promised government cash ahead of Wednesday’s Budget. On Monday, Jeremy Hunt, the Chancellor, said the £360m package would help to grow the economy and support jobs in the UK. The money going to Airbus is part of efforts to boost the research and development of technologies that will reduce the carbon emissions of aircraft, under plans to reach net zero targets. Lighter and longer wings made of carbon fibre or composite materials will allow aircraft to create more lift while using less fuel, the company believes. However, the resulting wingspan of around 45 metres means the wings will need folding tips, for when planes are taxiing from airport runways to their parking spaces. At the same time, the company is looking at whether the wing tips could be made to rotate to take better advantage of wind conditions. Airbus has previously received £117m of public funding towards the scheme, known as the “wing of tomorrow” programme, and on Monday Mr Hunt confirmed it had been allocated another £96m. The wings are being designed at the company’s sprawling campus on the outskirts of Bristol, where both the Concorde jets and Bristol Blenheim bombers were built. They are then being built at Airbus’ historic factory in Broughton, North Wales. Two prototype wings, each about 17 metres long, have already been made, with one more in the pipeline. Zimbabwe’s mines minister, Soda Zhemu, has said today that the discovery of oil, helium and hydrogen in the country’s remote northeast will revive its ravaged economy. Zimbabwe has the world’s highest inflation rate and the economy has been on a downturn for more than two decades, after Robert Mugabe plunged the country into decline. Annual inflation stood at 47.6pc in February - its highest level in six months. Australian oil and gas firm Invictus Energy last year announced the discovery of oil and gas in the northeast, some 30 years after US giant ExxonMobil gave up its quest to secure crude oil in the area. Mr Zhemu said: Zimbabwe is on course to be counted as a player in the oil and gas industry. There are unimaginable spin-offs to the economy and for Zimbabwe at large from the oil and gas extraction and attendant value-chain activities. Announcing fresh laboratory results, Mr Zhemu said he “confirmed the presence, not only of natural gas, but also of light oil condensate as well as helium and hydrogen” at the Mukuyu well. Helium is a key component in the manufacture of semiconductors, liquid crystal display (LCD) panels and fibre optic wire. Mr Soda said the natural gas was of high quality, while the oil was of a superior quality that needed less refining. Light oil produces diesel, petrol as well as aviation gas. Neither the minister nor the company disclosed the quantities of the find. That’s all from me today. Alex Singleton will make sure all the latest updates are posted here. I will leave you with the latest on bitcoin, which continues to surge and has now hit an all-time high against the euro. Against the dollar, it was last up 5pc to $66,356.50, just short of its record of $68,999.99 set in November 2021. In case you missed it! #Bitcoin has reached a new all-time high against the #euro. pic.twitter.com/QkwgOpJKFd Shipping services company Clarkson has said that a post-pandemic investment in container ships should lead to capacity jumping this year and pushing down prices. However, the business also warned it could be blown off course by problems in the Red Sea and the Panama Canal. Bosses said that capacity is expected to increase 7.3pc this year, while demand will only rise 3pc as the global economic situation improves. Some of this increase in capacity is because container shipping liners invested in their fleets after getting a big injection of cash when shipping costs soared in 2021 as global economies reopened following the pandemic. It leaves a potential impact from the increased supply of containers being shipped globally, the business said. Clarkson said: “However, the duration of disruption in the Red Sea remains highly uncertain and the scenario of a prolonged period of re-routing container ships around the Cape of Good Hope would have significant demand implications, providing the possibility of significant upside to the market outlook.” Disruption in the Red Sea started late last year as Houthis in Yemen, one of the parties in the country’s nearly decade-long civil war, started attacking ships travelling through the area. Apple’s shares have dropped after the EU fined the US tech giant for breaking the bloc’s competition laws. The iPhone maker has fallen 2.5pc in early trading, wiping $70bn off the value of the company. US stock markets opened lower after the S&P 500 and the Nasdaq’s record-closing highs on Friday. The Dow Jones Industrial Average fell 118.61 points, or 0.3pc, at the open to 38,968.77. The S&P 500 opened lower by 6.09 points, or 0.1pc, at 5,130.99, while the Nasdaq Composite dropped 10.73 points, or 0.1pc, to 16,264.21 at the opening bell. Jeremy Hunt is expected to announce a one-year extension to the windfall tax on energy company profits in this week’s Budget, according to reports. The energy profit levy was introduced in May 2022 after a jump in energy prices resulting from Russia’s invasion of Ukraine. The Chancellor raised the tax in November 2022 from its initial 25pc rate to 35pc, bringing the overall tax burden on North Sea oil and gas producers to 75pc, among the highest in the world. Mr Hunt also extended the tax to 2028 from 2025 and expanded it to electricity generators with a levy of 45pc in an effort to raise tens of billions of pounds to plug a major hole in public finances. When he delivers his Budget on Wednesday, Mr Hunt is expected to extend the levy by one more year to 2029, sources told Reuters. Read what to expect in the Chancellor’s Budget. The pound has strengthened as investors analyse speculation that the Chancellor is trying to find ways to cut taxes in the Budget in a move which could stimulate growth in the British economy. Sterling was last up 0.2pc against the dollar and was heading towards $1.27, while against the euro it was up 0.1pc at 85p. Matthew Ryan, head of market strategy at Ebury, said cuts to income taxes, national insurance or inheritance tax would all be “marginally positive for sterling”. Persistent inflation means central banks across the world will be forced to keep interest rates high for years to come as they battle pay demands, warfare and trade disputes, the Bank for International Settlements (BIS) has said. Our deputy economics editor Tim Wallace has the details: Inflation is falling “but the job is not done yet”, warned the institution, often known as the central bank for central bankers. Price rises in services are proving “stubborn” across much of the world, even as goods inflation has come down following the supply chain chaos of the pandemic and the energy price shock which accompanied Russia’s invasion of Ukraine. The BIS warned that if price pressures in the services industry persisted, central banks would be forced to keep monetary policy tighter in order to meet inflation targets. There is also a longer-term threat from disruption to trade routes and the end of the wave of globalisation which helped hold down costs in the early years of this century, the organisation added. The map shows how Red Sea disruption has hit global shipping. US stock indexes lack direction ahead of the opening bell despite the S&P 500 and the Nasdaq’s record-closing highs at the end of last week. The Nasdaq kicked off March by hitting an intraday all-time high on Friday, also closing at its highest level for the second day, as the artificial intelligence-driven tech rally continues to steal the spotlight on Wall Street. The S&P 500 has also been on a record-breaking rally, with BofA Global Research lifting its year-end target for the benchmark index to 5,400, from 5,000, representing a 5pc upside from current levels. All eyes will be on monthly non-farm payrolls, JOLTS job openings and the ADP National Employment report as well as the Fed’s “Beige Book” scheduled throughout the week for insights into the health of the economy. Federal Reserve chairman Jerome Powell is also scheduled to testify before Congress on Wednesday and Thursday, with analysts assuming the Fed chief to stay in wait-and-watch mode on policy after a recent escalation in inflation. Money markets predict there is a 73.3pc chance of the first Fed rate cut arriving in June and 90.4pc odds of that happening in July, as per CME Group’s FedWatch tool. In premarket trading, the Dow Jones Industrial Average was down 0.3pc, the S&P 500 had fallen 0.1pc and the Nasdaq 100  was up 0.1pc. Caffè Nero has swung back into the black after raising the price of a flat white by 15pc. Our senior business reporter Daniel Woolfson has the details: The chain’s parent company Caffè Nero Group Holdings posted a £7m pre-tax profit for the year to May 2023 compared with a £16m loss a year earlier, as sales soared by £100m to £450m. The surge in sales came after Caffè Nero raised the price of a flat white coffee from £3 in May 2022 to £3.45 in September 2023, according to UCC, which tracks the price of coffee in big chains. Caffè Nero said it had been hit by rising cost of energy, ingredients, wages and higher interest rates. Ben Price, finance director at Caffé Nero, said these pressures had slowed its recovery from the pandemic. This chart shows how its prices have changed. Apple has been fined €1.8bn (£1.6bn) by the European Union for raising the price iPhone users pay for music streaming by banning apps like Spotify from promoting cheaper alternatives. Our technology editor James Titcomb has the details: Margrethe Vestager, the European Commission’s competition chief, said Apple had abused a dominant position for a decade, meaning that rivals to Apple Music found it more difficult to compete. It comes five years after Spotify complained to the EU that Apple’s App Store rules limit competition. It is the first fine that the EU has imposed on the tech giant. The European Commission said Apple had imposed “anti-steering provisions” that prevented apps such as Spotify from directing users to cheaper subscriptions if users subscribed outside of its app. Apple charges fees of up to 30pc for music subscriptions bought through apps, meaning many streaming companies have offered cheaper alternatives on their website, or stopped offering in-app subscriptions altogether. Ms Vestager said: “For a decade, Apple abused its dominant position in the market for the distribution of music streaming apps through the App Store. They did so by restricting developers from informing consumers about alternative, cheaper music services available outside of the Apple ecosystem. This is illegal under EU antitrust rules, so today we have fined Apple over €1.8bn.” Apple said the Commission had failed “to uncover any credible evidence of consumer harm, and ignores the realities of a market that is thriving, competitive and growing fast”. It said Spotify had “co-ordinated” with the Commission, meeting 65 times over eight years, pointing out that the company is based in Sweden. The company said it would appeal. Apple has hit back at both the European Commission and Spotify, saying it would appeal the €1.8bn penalty. In a statement it insisted developers “compete on a level playing field on the App Store” and accused Spotify of wanting to “rewrite the rules of the App Store — in a way that advantages them even more”. It said: The primary advocate for this decision — and the biggest beneficiary — is Spotify, a company based in Stockholm, Sweden. Spotify has the largest music streaming app in the world, and has met with the European Commission more than 65 times during this investigation. Today, Spotify has a 56pc share of Europe’s music streaming market — more than double their closest competitor’s — and pays Apple nothing for the services that have helped make them one of the most recognizable brands in the world. A large part of their success is due to the App Store, along with all the tools and technology that Spotify uses to build, update, and share their app with Apple users around the world. We’re proud to play a key role supporting Spotify’s success — as we have for developers of all sizes, from the App Store’s earliest days. Apple has been fined €1.8bn (£1.6bn) by the European Union for breaking the bloc’s competition laws by favouring its own music streaming service over rivals. The European Commission said the US tech giant had banned app developers from “fully informing iOS users about alternative and cheaper music subscription services outside of the app”. The EU’s executive arm said Apple’s actions meant users paid “significantly higher prices for music streaming subscriptions”. The investigation into Apple’s practices was triggered after Swedish streaming service Spotify made a complaint five years ago. The EU has been cracking down on Big Tech companies, including issuing a series of multbillion-dollar fines for Google and charging Meta with distorting the online classified ad market. Saxo head of commodity strategy Ole Hansen said the price of gold hit a record high after the relief of last week’s US inflation figures, which fell slightly faster than expected. He said: Ahead of last Thursday’s long-awaited US PCE core deflator print, the Fed’s preferred inflation gauge, gold had behaved like a coiled spring, wanting to trade higher despite yield headwinds, but held back by worries about an inflation surprise. However, with the number in line with expectations, gold started a move that accelerated on Friday when the yellow metal reached the December 28 high at USD 2,088, before closing at a record USD 2,082.90. Overall, these developments point to a continued strong underlying physical demand from central banks and retail buyers in Asia. In addition, we believe that heightened geopolitical tensions around the world have reduced the short-selling appetite, basically all strengthening gold’s current buy-on-dips credentials. The price of gold has hit a record high as investors seek out safe haven assets ahead of the Budget and amid geopolitical uncertainty. The LBMA gold price reached $2,083.15 today, surpassing its previous record of $2,078.40 set in December. Analysts do not think there is one clear reason for gold’s move higher but investors have been buying up the yellow metal amid heightened tensions in the Middle East and the threat of inflation caused by the shipping crisis in the Red Sea. Apart from three days in mid-February, the price of gold has not dropped below $2,000 an ounce amid uncertainty about rate cuts. Traders are also putting their money into safe havens like gold as the Chancellor prepares to unveil his Budget on Wednesday, as Jeremy Hunt scrambles to find room to announce pre-election tax cuts. Oil prices have slipped back from their highest levels of the year after the Opec+ cartel announce it was expecting cuts to crude production to the end of the next quarter. Brent crude, the international benchmark, has fallen 0.3pc towards $83 a barrel after rising 2pc in the previous session. US benchmark West Texas Intermediate was down 0.5pc but still close to $80, having breached the psychological level on Friday for the first time since November. It comes after the Opec cartel of oil producing nations and its allies extended their roughly two million-barrel-a-day reduction in output until the end of June. Prices have also been kept elevated by the Israel-Hamas war, where progress towards a ceasefire has stalled. The UK audit watchdog has fined KPMG £1.5m for “serious failings” after it didn’t spot an accounting scandal at ad agency M&C Saatchi. Our reporter Adam Mawardi has the latest: The Financial Reporting Council (FRC) has reprimanded the Big Four firm and supervising partner Adrian Wilcox for lacking “professional scepticism” when auditing the advertising agency’s 2018 accounts. It follows a five-year investigation into serious accounting blunders at M&C Saatchi, which is known for its work with the Conservative Party. The FRC launched its inquiry in 2019 after M&C Saatchi discovered £25.8m worth of accounting errors and misjudgments, including £14m of overstated profits. The London-listed group was ultimately forced to restate its 2018 profits in its 2019 annual accounts. The crisis sent shares plunging and prompted the resignation of founder Maurice Saatchi and three directors. Read what the FRC said about KPMG and M&C Saatchi. A tree planting company is preparing for a stock market listing in London as it seeks to change perceptions about investing in green projects. Carbon Done Right, which was formerly known as Klimat X, is seeking a dual listing of its shares on London’s AIM market, which it hopes to have completed by early in the second quarter of 2024. The company has secured 57,000 hectares of forest and mangrove in Sierra Leone for its reforestation programme, which it said is using AI to come up with “simplified strategic rainforest planting focus”. It comes as investors become increasingly sceptical about climate change investments. Global funds network Calastone said in October that nearly £2.5bn had flowed out of funds focused on environmental, social and governance issues (ESG) since May. Wholesale gas prices have fallen as energy providers found that burning coal has become more economical. The benchmark European gas contract has declined by as much as 3.9pc today to about €25 per megawatt hour, which is down about a fifth since the start of the year. It comes as energy companies have been boosted by a drop in the price of carbon permits in Europe, a carbon emission trading scheme, which began in 2005 and is intended to lower greenhouse gas emissions by the EU countries. The fall in price means it is not as expensive for companies to use the more polluting fuel. The price of gas had already been under pressure from a mild winter, which limited demand, and unusually high stocks of liquified natural gas. The UK equivalent gas contract has fallen as much as 3.9pc and was last trading around 63p per therm. Google’s co-founder Sergey Brin has admitted that the company “messed up” after its AI chatbot created images of black Nazis. Our technology editor James Titcomb has the details: Speaking to Google staff in an internal “hackathon” meeting, Mr Brin said the system was not thoroughly tested before being released to the public. It comes after the company suffered widespread ridicule when its Gemini program inserted ethnic minority groups when asked to create images of people from history who were white. As well as black Nazis and native American vikings, it also portrayed the US founding fathers as a diverse group. Read what Mr Brin said at the meeting on Saturday. Bitcoin has rallied to a two-year high as it broke above $65,000 and neared its record high. The price hit $65,537 early in Europe having already hit a new two-year high in Asian trading. It was last up 3.4pc at $65,327.40. Bitcoin hit a record $68,999.99 in November 2021. The largest cryptocurrency by market value has gained 50pc this year following the approval of wider trading methods in the US. The so-called spot bitcoin exchange-traded funds, or ETFs, were approved in the United States earlier this year. Their launch opened the way for new large investors and has re-ignited enthusiasm and momentum reminiscent of the run up to record levels in 2021. Markus Thielen, head of research at crypto analytics house 10x Research in Singapore, said: “The flows are not drying up as investors feel more confident the higher price appears to go.” British insurer Aviva has returned to the Lloyd’s of London specialist insurance market for the first time in more than two decades after acquiring Probitas for £242m. The deal includes the 1492 Syndicate, part of the Lloyds market which specialises in property, construction and casualty insurance and reinsurance solutions. Syndicate 1492 reported gross written premiums of £288m in 2023 and has grown by 21pc since 2019. Chief executive Amanda Blanc said: This acquisition is another step in our strategy to invest in Aviva’s future profitable growth. Aviva’s presence in the Lloyd’s market opens up new opportunities to accelerate growth in our capital-light General Insurance business. Aviva shares rose by 0.1pc. Music royalties investment company Hipgnosis Songs Fund has slashed the value of its portfolio by more than a quarter and warned it would need to prioritise paying down debts as woes mount at the troubled group. The fund, which owns the back catalogues for artists including Justin Bieber and Shakira, said the latest valuation by a newly-appointed adviser, Shot Tower, saw the mid-point value of its songs catalogue cut by 26.3pc since the end of September, to $1.9bn (£1.5bn). The embattled group - co-founded by former Beyonce manager Merck Mercuriadis and Nile Rodgers of Chic - said that due to the fall in its net asset value, it would need to use the company’s free cash to pay down debt and therefore would not be restarting shareholder dividend payouts “for the foreseeable future”. Shares in the fund have plunged another 10pc in early trading after the latest blow. Shot Tower was appointed as an independent valuer following disagreements between the firm and its investment advisor, Hipgnosis Song Management Limited (HSM), over the value of its assets. Robert Naylor, chairman of Hipgnosis Songs Fund, said: “We are disclosing the valuation at this time given its material difference to valuations previously disclosed.” It comes amid an increasingly intense relationship between HSM and the board of Hipgnosis Songs Fund (HSF), whose assets HSM manages. The fund is currently undergoing a strategic review process that could see its assets sold or wound up completely. Bond markets have held steady as traders prepare for potentially big impacts from the Budget and the European Central Bank’s interest rate decision. The UK’s benchmark 10-year UK gilts were flat to 4.11pc, while the 10-year German bund - seen as a key measure for the eurozone - was down slightly at 2.4pc. The ECB is widely expected on Thursday to leave interest rates at the current record high of 4pc but investors will listen for any hints from President Christine Lagarde on when borrowing costs might start to fall. Meanwhile, the Chancellor will lay out the Government’s spending and taxation plans on Wednesday, which bond investors will watch closely as the memory of the crisis caused by Liz Truss’s mini-Budget lingers. Also this week, US Federal Reserve chairman Jerome Powell will begin his twice-a-year two-day testimony before Congress. Mohit Kumar, chief Europe economist at Jefferies, said: We are not expecting any change from the ECB this week, but the market will look for any hints over the possibility of an April cut. We remain in the June rate cut camp both from the Fed and the ECB. Similarly, from Powell, we expect a push back on early rate cuts with the tone being that it’s too early to declare victory over inflation. A SpaceX Falcon 9 rocket launched overnight carrying a crew of four on a mission to the International Space Station to begin a six-month science mission in orbit. The rocket, which has an autonomously operated Dragon capsule dubbed Endeavor, was launched from NASA’s Kennedy Space Center at Cape Canaveral in Florida. UK shares edged lower as investors were cautious ahead of the Budget this week. The blue-chip FTSE 100 index was down 0.2pc as traders wait for Jeremy Hunt’s speech in the Commons on Wednesday, in which there is speculation the Chancellor will unveil tax cuts. BP advanced 1.6pc after Jefferies upgraded the oil heavyweight to “buy” from “hold”, with the oil and gas index rising 0.3%. Meanwhile, the FTSE 250 was down 0.2pc, with Hipgnosis its worst performer. The music rights company has fallen 9.7pc to hit a record low after steep declines in its asset valuations led the UK music investor to freeze dividend payments for the “foreseeable future”. Losses on the FTSE 250, however, were limited by a 2.8pc gain in Senior after the aerospace engineer raised its dividend as 2023 profits nearly doubled. Japan’s government is reportedly considering declaring a formal end to its battle against deflation in a move that paves the way for its central bank to cease negative interest rates for the first time in eight years. The world’s fourth largest economy has effectively paid borrowers to take out loans since 2016, when interest rates were lowered to minus 0.1pc. The Bank of Japan lowered interest rates as it sought to bring an end to its decades long battle against deflation, symbolised by the “lost decade” from 1991 to 2001 after its financial bubble burst. However, inflation has exceeded the Bank of Japan’s 2pc target for more than a year and its government is considering formally calling an end to deflation in the wake of rising prices, according to Kyodo news. In the last few years the government has maintained that Japan was no longer in deflation, but it has stopped short of declaring a complete victory over falling prices. Atsushi Takeda, chief economist at Itochu Economic Research Institute, said such an announcement “may suggest that the government and the BOJ may be coordinating with each other to let the markets factor in the prospects for declaring an end to deflation in future and terminating negative interest rates”. A formal declaration would draw a line under the era of falling prices and economic stagnation that followed the collapse of its “bubble era” boom in the late 1980s. Last week, the Tokyo Nikkei benchmark soared past the record high for the first time since 1989 and today it surpassed 40,000 for the first time. Low-cost airlines Ryanair and Wizz Air both saw jumps in the number of passengers taking their flights in February. Ryanair, the larger of the two companies, said it carried 11.1m passengers last month - an increase of 5pc from the 10.6m people who took a Ryanair flight in February 2023. Its load factor - the proportion of seats that were filled with passengers - was 92pc, unchanged from a year earlier. It came as Ryanair announced it had cancelled the lowest number of flights because of the Israel-Gaza conflict since before Hamas’s October attacks. It cancelled 800 flights last month due to the war, down from 950 in January. Meanwhile, Wizz Air announced a 15.8pc rise in passenger numbers last month, compared with February 2023, to 4.4m. Its load factor was 90pc. The airline said its load factor was “impacted by reallocated Israel capacity”, but did not give any details. It also flew more capacity than expected during the month. Stock markets in London have begun the week on the downward path as investors remains cautious ahead of the Budget this week. The FTSE 100 has fallen 0.1pc to 7,673.98 while the midcap FTSE 250 has slipped 0.3pc to 19,301.39. The world’s largest semiconductor chip manufacturer TSMC rose to a record high amid the global AI-linked rally in chip stocks. The Taiwanese chip-maker, which has a market share of more than 50pc, gained 5.2pc overnight as it helped Taipei’s Taiex stock market index add nearly 2pc. TSMC, which listed in 1994, is a step closer to regaining a spot in the world’s 10-most valuable companies after its market capitalisation rose to $597bn (£471bn). The company, which is the main supplier to Apple and Nvidia, has soared over 22pc so far this year, helping Taiwan’s Tapei also reach a record high amid a clamour from investors for AI-related stocks. London-listed car dealership Vertu Motors has cautioned that consumer uncertainty is still taking its toll amid the cost of living crisis. The group said used vehicle prices have steadied after a record drop of 4.2pc in October and November as values tumbled following steep gains in the previous few years. It warned in December that this would knock its profits, although it said it would also make them more affordable to buyers. Vertu said in its latest update that the used car prices “have stabilised in recent weeks following post-October wholesale pricing correction”, with sales up 0.8pc in the five months to January 31. But it said the new vehicle market continued to suffer, with sales down 5.1pc amid cost pressures on consumers, with car makers ramping up incentives and offering discounts to boost demand. The group forecast that full-year underlying pre-tax profits would be “broadly” in line with market expectations as group revenues lifted 7.8pc in the most recent five months. Turkey’s annual inflation rose again in February, reaching 67.1pc despite a string of interest rate hikes, official data showed. The Turkish central bank held its key interest rate at 45pc last month, pausing after eight straight increases aimed at taming consumer prices that reached 64.9 percent in January. Bitcoin has risen to a more than two-year peak amid big flows into cryptocurrency exchange-traded funds. Bitcoin was last trading about 1pc higher from Sunday at $63,804.50, after earlier reaching $64,284.75. It was its highest point since November of 2021, the same month it marked its record high of $68,999.99. The largest cryptocurrency by market value has gained 50pc this year and most of the rise came in the last few weeks where trading volume has surged for US-listed bitcoin funds after their approval earlier this year. Matt Simpson, senior market analyst at City Index, said: When I look at the Bitcoin futures chart, I see a tired market that doesn’t quite have the willpower to reach for 69k right now. I’m not saying this is a market to short, but I would be wary going long at these highs. Japan’s flaship stock market closed above the 40,000 mark for the first time as the rally fueled by AI excitement continued. The benchmark Nikkei 225 index added 0.5pc, or 198.41 points, to end at 40,109.23, days after breaking a stock market record that had stood since 1989. Tokyo and other major global shares have steadily gained since last year, and analysts predict the Nikkei should gain even further, lifted by rallying Wall Street, robust corporate earnings and strong hopes for AI technologies. The Nikkei waited for 34 years to return to its record highs after an asset bubble in Japan catastrophically burst in the early 1990s. Daiju Aoki, regional chief investment officer at UBS SuMi Trust Wealth Management, said: “When markets reach a record, they tend to be stuck in range. “The Nikkei reaching 40,000 shows that many investors, especially from overseas, are still bullish on Japanese stocks.” The excitement around Japan’s stock markets “isn’t justified” because of weak profit margins at many companies, according to economists. Marcel Thieliant, head of Asia-Pacific at Capital Economics, said Japanese firms’ profitability remains the lowest among G7 countries. He said: The decline in listed firms’ profit margins over the last couple of years despite the tailwind from a weaker yen suggests that improved corporate governance isn’t changing corporate behaviour. While timely data point to a rebound in profitability, the narrative that Japan is on the cusp of a new dawn remains flawed. Thanks for joining me. Japan’s key Nikkei index closed above the 40,000 mark for the first time today, following gains on Wall Street. The benchmark Nikkei 225 index added 0.5 percent, or 198.41 points, to end at 40,109.23, but the broader Topix index slipped 0.1 percent, or 3.14 points, to 2,706.28. The dollar stood at 150.28 yen, compared with 150.11 yen seen Friday in New York. “The US high-tech sector including chips rallied on the back of falls in US long-term yields, which prompted purchases” of high-tech equities in the Tokyo market, IwaiCosmo Securities said. Tokyo and other major global shares have steadily gained since last year, and analysts predict the Nikkei should gain even further, lifted by rallying Wall Street, robust corporate earnings and strong hopes for AI technologies. On February 22, the Nikkei finally broke through a record high set just before an asset bubble in Japan catastrophically burst in the early 1990s. After the Nikkei climbed above the 40,000 mark during Monday’s trade, “profit-taking sales grew and capped the upward movement”, Daiwa Securities said. 1) Hunt’s hopes for $90bn London Shein float risks being derailed by High Street rebellion | Retailers call on ministers to close tax loophole used by Chinese fast fashion giant 2) UK’s £400m electric bus scheme accused of ‘subsidising China’ | British manufacturers say current scheme is slowing net zero transition 3) Banks call for crackdown on Apple over claims it stockpiles British spending data | Calls for better policing of data come amid fears big tech is gaining an unfair advantage 4) Lenders sound the alarm over ‘rapid’ uptick in 35-year mortgages | Almost one in four first-time buyers are now stretching their repayments over 35 years 5) Saudi Arabia and Russia lead Opec in extending oil cuts | Move triggers fears that the cartel could keep cuts in place for the rest of the year Asian stocks were mostly higher ahead of China’s top annual political gathering, while Japan’s benchmark surpassed the 40,000 level for the first time. Japan’s Nikkei 225 share index advanced 0.5p to 40,109.23, breaching the 40,000 level, after a big rally on Wall Street last week pushed US stocks to new heights. Shares in Japan have tracked gains in other markets driven by expectations for strong demand for technology associated with artificial intelligence. They have also been boosted by continued easy credit policies with the Bank of Japan pumping money into the economy to help support growth. Hong Kong’s Hang Seng fell 0.2pc to 16,558.00 and the Shanghai Composite index rose 0.2pc to 3,033.63. All eyes will be on the National People’s Congress annual meeting in China that starts Tuesday, during which Beijing might announce steps to bolster an economy that is sagging under the weight of expanded government controls and the bursting of a real-estate bubble. The Kospi in Seoul surged 1.2pc to 2,672.94 after a private-sector survey showed manufacturing activity expanding at a slower pace in February compared to previous months as overseas demand weakened. Australia’s S&P/ASX 200 was down 0.1pc at 7,598.00, and in Bangkok the SET edged 0.1pc lower. "
}