{
    "title": "Apple Inc. (NASDAQ:AAPL) Stock Holdings Trimmed by AIMZ Investment Advisors \nLLC",
    "date": "3/13/2024",
    "url": "https://www.defenseworld.net/2024/03/13/apple-inc-nasdaqaapl-stock-holdings-trimmed-by-aimz-investment-advisors-llc.html",
    "text": "Posted by Defense World Staff on Mar 13th, 2024 AIMZ Investment Advisors LLC cut its holdings in  Apple Inc. (NASDAQ:AAPL – Free Report) by 0.2% in the third quarter, according to the company in its most recent disclosure with the SEC. The fund owned 95,028 shares of the iPhone maker’s stock after selling 153 shares during the quarter. Apple comprises  7.2% of AIMZ Investment Advisors LLC’s holdings, making the stock its largest position. AIMZ Investment Advisors LLC’s holdings in Apple were worth $16,270,000 as of its most recent SEC filing. Several other institutional investors have also added to or reduced their stakes in the business. Moneta Group Investment Advisors LLC lifted its stake in shares of  Apple by 116,483.5% during the fourth quarter. Moneta Group Investment Advisors LLC now owns 569,554,722 shares of the iPhone maker’s stock worth $74,002,245,000 after buying an additional 569,066,184 shares during the period.  Norges Bank acquired a new position in shares of  Apple in the 4th quarter valued at $21,746,940,000.  Morgan Stanley raised its stake in  Apple by 14.2% in the 4th quarter. Morgan Stanley now owns 208,655,323 shares of the iPhone maker’s stock worth $27,110,586,000 after acquiring an additional 25,926,552 shares during the last quarter.  Barclays PLC lifted its position in  Apple by 60.0% during the 2nd quarter. Barclays PLC now owns 46,932,352 shares of the iPhone maker’s stock worth $9,103,464,000 after acquiring an additional 17,604,799 shares during the period.  Finally, Osaic Holdings Inc. grew its stake in  Apple by 154.9% during the 2nd quarter. Osaic Holdings Inc. now owns 23,295,770 shares of the iPhone maker’s stock valued at $1,729,270,000 after purchasing an additional 14,157,430 shares during the last quarter. Institutional investors and hedge funds own  58.51% of the company’s stock. Shares of NASDAQ:AAPL opened at $173.23 on Wednesday. The business’s 50 day moving average price is $184.00 and its 200-day moving average price is $183.55. Apple Inc. has a 1 year low of $147.70 and a 1 year high of $199.62. The company has a debt-to-equity ratio of 1.28, a current ratio of 1.07 and a quick ratio of 1.02. The firm has a market capitalization of $2.67 trillion, a PE ratio of 26.98, a P/E/G ratio of 2.06 and a beta of 1.29. Apple (NASDAQ:AAPL – Get Free Report) last released its earnings results on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share (EPS) for the quarter, topping analysts’ consensus estimates of $2.09 by $0.09. The business had revenue of $119.60 billion during the quarter, compared to analyst estimates of $117.99 billion. Apple had a net margin of 26.16% and a return on equity of 156.04%. The company’s revenue for the quarter was up 2.1% compared to the same quarter last year. During the same quarter in the prior year, the firm earned $1.88 earnings per share.  As a group, equities research analysts expect that  Apple Inc. will post 6.55 earnings per share for the current fiscal year. The firm also recently disclosed a quarterly dividend, which was paid on Thursday, February 15th. Shareholders of record on Monday, February 12th were issued a $0.24 dividend. The ex-dividend date  was Friday, February 9th. This represents a $0.96 dividend on an annualized basis and a yield of 0.55%. Apple’s payout ratio is 14.95%. Several research analysts have recently issued reports on AAPL shares. Needham & Company LLC  restated a “buy” rating and issued a $220.00 price objective on shares of Apple in a research note on Friday, February 2nd. Rosenblatt Securities  restated a “neutral” rating and set a $189.00 price objective on shares of Apple in a research note on Tuesday, March 5th. DA Davidson started coverage on shares of Apple in a research note on Wednesday, January 3rd. They issued a “neutral” rating and a $166.00 price objective on the stock. Redburn Atlantic cut shares of Apple from a “buy” rating to a “neutral” rating and set a $200.00 target price for the company. in a report on Wednesday, January 10th. Finally, Morgan Stanley increased their price target on Apple from $210.00 to $220.00 and gave the stock an “overweight” rating in a research report on Friday, December 8th. One research analyst  has rated the stock with a sell rating, eleven have given a hold rating, twenty-one have issued  a buy rating and one  has given a strong buy rating to the company. Based on data from MarketBeat, Apple  has an average rating of “Moderate Buy” and a consensus target price of $205.27. Read Our Latest Stock Report on AAPL In other news, Director Arthur D. Levinson sold 100,000 shares of the company’s stock in a transaction that occurred on Thursday, February 29th. The stock was sold at an average price of $180.94, for a total value of $18,094,000.00. Following the completion of the sale, the director now directly owns 4,434,576 shares in the company, valued at $802,392,181.44. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is available through the SEC website. Corporate insiders own  0.06% of the company’s stock. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Ameriprise Financial Inc. Has $8.33 Billion Holdings in Apple Inc. (NASDAQ:AAPL) GSA Capital Partners LLP Invests $741,000 in Physicians Realty Trust (NYSE:DOC) "
}