{
    "title": null,
    "date": "3/23/2024",
    "url": "https://techcrunch.com/2024/03/23/apple-sued-microsofts-ai-ambitions-and-nvidia-surprises/",
    "text": "In this edition of Week in Review, we have big news on the latest Apple antitrust lawsuit. Microsoft’s AI ambitions dominated the news as well, so let’s dive right in.… Did someone forward this to you? Sign up here to receive the Week in Review newsletter in your inboxes. The U.S. joined international regulators in accusing Apple of using monopolistic tactics to lock in iPhone users. In response, Apple claims the DOJ’s actions could ruin exactly what its users enjoy about its phones and ecosystem. The DOJ’s lawsuit draws a connection between Apple and the 1990s era of Microsoft, though there are some key differences between the two companies and their efforts to retain customers. All that said, don’t expect much to come out of the lawsuit in the short-term. Experts predict it could take three to five years for it to reach a resolution. But that’s not all — read on for more updates on Reddit’s IPO, Nvidia’s GTC event and an unexpected change for Glassdoor accounts. Microsoft absorbs Inflection AI’s leads: The co-founders of the high-profile AI startup were scooped up by Microsoft on Tuesday in a deal that positions Mustafa Suleyman as the lead of consumer-facing unit Microsoft AI, and Karén Simonyan as the EVP and CEO of the same group. This all comes after Inflection raised $1.3 billion, with the biggest investor in the startup being, you guessed it, Microsoft. Nvidia’s GTC event: Remember when their biggest news was tied to ray tracing? In their wide-ranging GTC developer conference, Nvidia had a couple of surprises from CEO Jensen Huang, including a prediction that artificial general intelligence was five years away and news of a new AI platform for humanoid robots called GR00T. Google’s Gemini AI on iPhones?: The two companies are reportedly in talks that could lead to Google’s AI model being deployed to power several upcoming iOS updates, which leaves the question of whether this will be a stopgap until Apple’s own AI efforts are up to speed, a longstanding partnership, or just one of those negotiations that never reaches the finish line. Investors undercut by past malware investments: The Biden administration is bringing together an international coalition to fight against commercial spyware, with investors now hopping on board. But one of those investors was previously involved in the very business they’re now fighting, TechCrunch exclusively learned. Hacking a $5 million tournament “for fun”: Sometimes, the stated justification for a hack that takes the gaming community by storm is as simple as that, plus an intent to highlight for developers the exploit used to grind an Apex Legends tournament to a halt. Be careful about those Glassdoor reviews: Users are reporting that their real names are being added to their profiles without their consent, and the only solution provided to them is to delete their accounts entirely. Time to double-check that burner you made to bad-mouth that ex-employer! Reddit’s IPO gets off to a strong start: The stock, which launched at $34 a share, jumped 48% on its first day and ended up at $46 after the market closed Friday. Astera Labs balloons 72% on day one: The company, which makes connectivity hardware for cloud computing data centers, is benefiting immensely from the AI boom, with revenue growing to 45% to $115.8 million last year and its stock closing at $62.03 on day one. The Browser Company raises $50 million at $550 million valuation: The startup behind the Arc browser has an ambitious, complicated and at-times controversial take on supplanting PCs with browsers. Amid numerous feature launches and AI updates, the company remains unclear about its path to monetization. AI is bad at spelling, and image generators are to blame: If you’ve ever seen awful spelling in an AI-generated image, you’re not alone. We dove deep into why, despite its massive potential, AI still has trouble spelling the word “burrito.” Fisker pauses production: And it’s not because of the EVs — it’s because the company is swiftly running out of money. If they’re not able to raise more capital, they could cease operations altogether. Why AI can’t be reviewed, but we’ll still try: The fact that systems like ChatGPT or Gemini are impossible to truly review makes it all that much more important to put them to the test. "
}