{
    "title": "Apple stock could remain under siege for months – analyst",
    "date": "3/8/2024",
    "url": "https://macdailynews.com/2024/03/08/apple-stock-could-remain-under-siege-for-months-analyst/",
    "text": "Update font size. Reset  Apple stock is coming off a seven-session losing streak, and it’s down 12% so far this year. Shares could remain under siege through the company’s WWDC developer event in June, according to a Citi Research analyst. Emily Bary for MarketWatch:\n ‎ Smartphone demand has been sluggish, though that event could become the “AI catalyst to drive upside to 2025 AI smartphone demand,” Citi’s Atif Malik wrote Friday. While Malik kept his buy rating on Apple shares, he narrowly reduced his price target to $220 from $225 in his latest note to clients… [T]hird-party data from Counterpoint Research suggested that iPhone unit sales plunged 24% in China during the first six weeks of the year. And Apple appears to be getting more aggressive with its discounting in order to drive sales. Meanwhile, his analysis of U.S. third-party data found that foot traffic to a sampling of U.S. Apple Stores was off 6% in the first two months of 2024 relative to the same period a year before… “Apple currently holds 75% market share in the premium phone market…and we expect Apple to release [generative AI] features to maintain its position in the high-end market,” Malik said. ‎\nMacDailyNews Take: Via it’s current frenzied catch up efforts, Apple needs to get “good enough” generative AI — preferably better than rivals’, but Apple is trying to come from way behind here — out the door and into its marketing and, finally, into users’ hands ASAP. It’d be best for the stock if users didn’t have to wait for generative AI to appear in Apple’s next-gen OSes to hit public release in the fall.\n ‎\nPlease help support MacDailyNews. Click or tap here to support our independent tech blog. Thank you! Support MacDailyNews at no extra cost to you by using this link to shop at Amazon. The Apple schtick of giving users 50% of what was expected in new products (nickel and diming with RAM and drive space) and software and then making us all wait 4 more months for the software to be released, is not working any more. The last few years of software releases have been pathetic. The best thing that comes to mind is the improved stability of AirDrop, a glaring embarrassment for years prior to that. It’s not pretty but having MSFT and NVDA kick AAPL’s ass is necessary, hopefully they wake up. I ignore all articles that predict Apple’s share price movement without a clear commitment to either buy or short shares by the writer of the article. They never put their asses on the line and just take pot shots to get their article fee and move on to the next guessing game. Buy it, Sell it, Short it, RIGHT AFTER YOU WRITE ABOUT IT,  FOOL TOOL. This site uses Akismet to reduce spam. Learn how your comment data is processed. “Ted Lasso” star and writer Brett Goldstein is set to appear in a guest star role in “Shrinking” Season 2 at Apple TV+… Apple’s M3 Ultra chip may be designed as a unique standalone chip, rather than two M3 Max chips joined together as in the M1 Ultra and… Alphabet subsidiary Google’s Android website has added a new landing page for Google Messages which touts that RCS on Apple’s iPhone… Sunshine is launching a new AI product, Shine. The product offers a photo-sharing app and an events website. Co-founder Marissa Mayer tells… Apple filed a lawsuit earlier this month against former software engineer Andrew Aude, alleging he leaked info about products he hated… Enter your email address to follow MacDailyNews and receive notifications of new posts by email. Email Address Follow :-) "
}