{
    "title": "Tim Cook-led Apple acquires Canadian startup DarwinAI in major AI push",
    "date": "3/16/2024",
    "url": "https://www.hindustantimes.com/technology/tim-cook-led-apple-acquires-canadian-startup-darwinai-in-major-ai-push-101710558988257.html",
    "text": "Subscribe Now! Get features like Apple has acquired Canadian artificial intelligence startup DarwinAI, Bloomberg has learnt. Earlier this year, the Tim Cook-led iPhone maker had made the acquisition. According to the report, dozens of DarwinAI employees had joined Apple's AI division, who refused to be identified as the deal has not been formally announced. DarwinAI developed the tech for visually inspecting components during manufacturing. It serves the customers in range of industries, but one of the core technologies of this Canadian startup is developing AI systems smaller and faster. University of Waterloo's AI researcher Alexander Wong had helped build the business at DarwinAI. Now he has joined Apple's AI division as a director. Apple told Bloomberg that it “buys smaller technology companies from time to time” but doesn’t discuss its plans. The company's shares had briefly surged by one per cent to $173.37 after the news. However, it was later trading 10 per cent down at $172.92. ALSO READ: Apple terminates Fortnite maker Epic Games' developer account DarwinAI had raised more than $15 million as of 2022. It had received investments from Honeywell Ventures and Inovia Capital, among other venture capital firms. The Ontario-based company also has worked with companies like Lockheed Martin Corp. and Intel Corp., according to Communitech. The acquisition comes ahead of a big AI push for Apple this year. The company is adding features to its iOS 18 software that rely on generative AI, the technology behind ChatGPT and other groundbreaking tools. Tim Cook has promised that Apple will “break new ground” in AI this year, and an announcement is expected as soon as the company’s worldwide developers conference in June.ALSO READ: Apple reinstates Fortnite-maker Epic Games' developer account in EU Despite having acquired more AI companies than most rivals over the past decade, Apple has fallen behind in the generative AI market. It was caught flat-footed by the launch of OpenAI’s ChatGPT in 2022, and tech peers like Google and Microsoft Corp. have stolen the spotlight with new features. Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}