{
    "title": null,
    "date": "3/20/2024",
    "url": "https://au.finance.yahoo.com/news/meta-microsoft-x-and-match-group-come-out-swinging-against-apples-third-party-payment-rules-200705867.html",
    "text": "Several notable names have joined Epic Games in taking a stance against Apple's decision to charge a fee for iOS payments made outside of the App Store. Meta, Microsoft, X and Match Group filed an amicus brief in the case, as The Wall Street Journal reports. That lends some heavyweight backing to Epic's cause. Apple was forced to enable third-party payments on iOS due to the European Union's Digital Markets Act (DMA) and a court ruling in the US. It also has to allow alternative app marketplaces on iOS in the EU. The company takes up to a 30 percent cut of App Store purchases. Perhaps fearing that it was about to lose out on a significant chunk of commission, Apple said it would charge a fee of up to 27 percent when developers process purchases outside of the App Store. Epic this month filed a petition asking District Judge Yvonne Gonzalez Rogers to enforce a permanent injunction she issued against Apple in 2021 as part of her ruling in the case between the two companies. The decision compelled Apple to allow developers to direct users to alternative payment systems. Most of Rogers' ruling was in Apple's favor, however, and both companies appealed the decision all the way up to the Supreme Court. However, in January, the highest court in the US declined to hear the appeals. That means Rogers' permanent injunction against Apple stood, but Epic was not happy about the way Apple implemented the third-party payment changes. The four companies supporting Epic's petition claim that the fee Apple is charging on external payments effectively leaves the previous rules in place. \"The Apple Plan comports with neither the letter nor the spirit of this Court's mandate,\" their brief states. As X put it, the 27 percent fee doesn't give developers much incentive to link to external payment methods. Microsoft, which has been working on its own mobile game store, noted that Apple's latest policy limits its ability to offer users subscriptions and discounts. Match Group argued that Apple's decision will affect many developers and users, and that it stymies the court's attempt to offer consumers competition on pricing. Meta, meanwhile, charges more for its ad-free plans and boosted posts on its iOS apps than it does on the web. (The ad-free subscription is also more expensive in the company's Android apps, as Google takes a cut of in-app payments too). Meta states in the amicus brief that it ought to be able to direct users to other payment options for boosted posts. Apple claims to have complied with the court order. According to the Journal, the company (which is reportedly facing a Justice Department antitrust case) says its current external link policies are important to protect user privacy and security. Apple has also been dinged over its compliance with the DMA, with critics suggesting the company might be adhering to the letter of the law, but not its spirit. For what it's worth, Meta, Microsoft, X and Match Group filed their petition one day after the EU's antitrust chief warned Apple over new fees it's charging developers (and Meta over its ad-free subscription). Margrethe Vestager told Reuters that feedback from developers would play an important factor in whether the bloc investages Apple, Meta or any other company subject to the DMA's rules. She noted that she had received \"quite a lot\" of comments from third parties. Meanwhile, Epic is gearing up to debut its game store on both iOS and Android later this year. The company said at the Game Developer Conference that the store would be cross-platform between mobile, PC and macOS. The company plans to charge developers of mobile games the same 12 percent cut it takes from PC game sales. Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  This update would represent Apple's first overhaul to that lineup since 2018. ANALYSIS: The US and EU argue that Apple is abusing its power to crush competition and blight users’ experience. The iPhone maker says the proceedings threaten the company. Andrew Griffin examines what the row could mean for the technology in your pocket Trade 24 hours a day on the world's most popular platform. A court in Minnesota has ordered MyPillow to be evicted from the warehouse it formerly used. MyPillow founder, Mike Lindell, a prominent election denier, told The Associated Press that the eviction is a formality because the landlord wants to take the property back. The Minneapolis warehouse is approximately 125,000 square feet and has been leased… Apple will finally launch new iPads in early May, according to Bloomberg’s Mark Gurman. Expected are a new iPad Pro with an OLED display and a faster iPad Air, including a 12.9-inch model for the first time in that lineup. Alex Murdaugh failed a polygraph test administered as part of the plea agreement for the disgraced former attorney’s raft of financial crimes, violating the deal, which required his truthfulness, federal prosecutors said in a court filing Tuesday. 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b Kim Kardashian is being sued by late artist Donald Judd’s foundation over claims her minimalist office furniture was designed by Judd ‘About Damn Time’ singer’s reputation faced scrutiny after she was sued by former employees last year IBKR EventTrader - A new, straightforward way to trade CME futures markets This food habit is linked to a specific type of dementia. The dreaded pest also displaces wildlife and can blind pets. Find out more. Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show.  King Edward VIII’s proposal to Wallis Simpson marked a constitutional crisis in Britain almost 90 years ago There is a growing understanding across the Western allies that Ukraine is losing the ground war against Russia, and by summer could face defeat.  Russia is pounding front lines with artillery, rocket and drone fire — and at over five times the rate the Ukrainian army can reply.  Volodymyr Zelensky’s troops are exhausted — after sustaining in some sectors a heavier concentration of incoming artillery than at the Somme in 1916, or the Normandy Bocage after D-Day in 1944. The former president’s son hemmed and hawed before eventually working in a Biden slam.  She could head to the U.K. to commemorate the tenth anniversary of the Invictus Games. The concerned shopper raised the alarm with staff at the store. Now, a 'full product inspection' is underway. Married At First Sight’s breakout star Lucinda Light has wowed fans on social media after she unveiled a surprising new look. Read more.  The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. The person who wrote on the road has been called a \"top bloke\" by motorists. King Charles and Queen Camilla will sit apart from the main congregation at St. George’s Chapel’s Easter service "
}