{
    "title": "Steve Jobs' business card sold for over 27 million yen",
    "date": "3/24/2024",
    "url": "https://gigazine.net/gsc_news/en/20240325-steve-jobs-signed-business-card/",
    "text": " A business card signed by Apple co-founder Steve Jobs, who passed away in 2011, was put up for auction and sold for $181,183 (approximately 27.4 million yen). Steve Jobs Signed Apple Business Card (c. 1983) - PSA GEM MT 10 | RR Jobs' business cards have been exhibited at RR Auction in the past. Although no signature was written on this business card, it was sold for $12,905 (approximately 1.95 million yen) as a set with the business cards of employees such as Apple Computer engineers and program managers at the time. The business card that was sold this time is in relatively good condition, but it is yellowed overall, and some of the cards have slight stains that look like tape marks. However, this business card has been authenticated by PSA, a trading card authentication organization, and has been given the highest condition rating of ` According to RR Auction, no more than five business cards signed by Jobs have been authenticated by PSA. ◆Forum now open A forum related to this article has been set up on the GIGAZINE official Discord server . Anyone can write freely, so please feel free to comment! If you do not have a Discord account, please create one by referring to the article explaining how to create an account! • Discord | 'Do you have a business card that could sell at a high price?' | GIGAZINE https://discord.com/channels/1037961069903216680/1221749459059343450 Related Posts: << Next An AI that can perform tasks with just text instructions and can teach skills to another AI will be developed. Prev >> I tried ``Tiramisu Cookie Crunch'' and ``Almond Caramel Cookie'' from Haagen-Dazs ``Mini Cup Decorations'', which enhances the feeling of luxury with the crunchy texture of cocoa fiantine and butter cookies. Mar 25, 2024 11:45:00 in Note, Posted by log1i_yk  "
}