{
    "title": null,
    "date": "3/5/2024",
    "url": "https://www.kiplinger.com/personal-finance/class-action-suit-says-youre-overpaying-for-apple-icloud-storage",
    "text": "Save up to 74% Subscribe to Kiplinger When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. If you think you’re one of the millions possibly affected, you can file a form to find out about the investigation. Apple is at the center of a newly proposed class-action lawsuit that claims the company holds an illegal monopoly over cloud storage. In a complaint filed in a federal court on Friday (March 1), a California law firm alleges that Apple is making it unreasonably difficult to use cloud storage systems other than its in-house iCloud service, charging what the firm calls “supracompetitive fees” and affecting tens of millions of iCloud users. The complaint is still in its early stages, and it’s unclear whether it will move forward. However, the suit says it believes “the class will consist of tens of millions of members,” all iCloud users. If you purchased an iCloud storage plan in the last four years, you can fill out a form at the law firm’s site to learn more about its investigation into Apple’s iCloud policies. Be a smarter, better informed investor. Profit and prosper with the best of expert advice on investing, taxes, retirement, personal finance and more - straight to your e-mail. Profit and prosper with the best of expert advice - straight to your e-mail. Apple did not immediately respond to requests for comment. “Undisciplined by competition, Apple has marked up its iCloud prices to the point where the service is generating almost pure profit,” the suit says. “Apple’s ability to sustain these prices is a testament to its monopoly power.” While several companies provide cloud storage solutions for photos, videos and documents, the suit charges that Apple blocks third-party cloud storage systems from hosting app data and device settings, which makes it difficult for users to access necessary information when they replace or update their phones. That, per the suit, forces users to either juggle two cloud storage systems — one for photos and videos, and another for app data and settings — or exclusively use iCloud. “This is far less convenient than using a single cloud storage service capable of storing all file types in one location,” according to the suit. “Through the restraints challenged in this lawsuit, Apple has ensured that only iCloud can perform this basic function.” Though the suit says tens of millions of users have been overcharged by iCloud, it’s unclear to what extent users are paying more. Two terabytes of iCloud storage costs $9.99 a month, which is equivalent to a Google Cloud subscription or a Dropbox one. The suit alleges Apple marks up storage by as much as 61%, since it buys storage from Google. For Apple, the storage app has quietly been part of a profit-making machine. Though the company reported weak quarterly earnings in December, Apple’s services (including iCloud and App Store sales) generated  more than $22 billion in revenue, a 16% jump from the previous year. It’s worth noting its App Store division is facing antitrust accusations from the U.S. and beyond. In addition, the European Union earlier today (March 4) slapped Apple with a $2 billion antitrust lawsuit for “abusing” the app store. Separately, iPhone users began receiving settlement money from Apple earlier this year following a battery slowdown lawsuit in 2018. Claimants are expected to receive a cash settlement of $92.17 per device. In the iCloud case, once the complaint is filed, a class representative will file a motion to have the court determine whether it should approve the class and the complaint. As Kiplinger previously reported, if you think you may be a class member in a suit but haven’t been contacted, there are several websites, such as www.consumer-action.org, offer information on current cases and settlements. Keerthi Vedantam is a reporter covering finance, tech and science. She previously covered biotech and health at Crunchbase News and enterprise technology at Business Insider. The proceeds from selling your current home have made it possible to pay cash for your retirement home, but should you skip the mortgage? By Evan T. Beach, CFP®, AWMA®\n\nPublished 30 March 24 Trend of loud budgeting emphasizes being open about skipping unnecessary purchases and sticking to your budget, while older generations still struggle to talk about their finances. By Neale Godfrey, Financial Literacy Expert\n\nPublished 30 March 24 You’ll find Easter deals on fashion, gifts, toys, flowers, candy and oh, so much more By Kathryn Pomroy\n\nPublished 29 March 24 The limited-time agreement directly benefits merchants, which can potentially pass savings on to consumers. By Keerthi Vedantam\n\nPublished 28 March 24 Some Medicare beneficiaries may pay lower coinsurance rates from April 1 to June 30 for the drugs, HHS says. By Joey Solitro\n\nPublished 28 March 24 A handful of suits against the iPhone maker seek to crack down on everything from app store purchases to messaging. By Keerthi Vedantam\n\nPublished 28 March 24 Push back on Capital One's planned merger with Discover is growing with one group of consumer advocates calling for a public hearing. By Keerthi Vedantam\n\nPublished 28 March 24 Offsetting Social Security benefits to pay for defaulted student loans can be devastating for some beneficiaries, lawmakers say. By Joey Solitro\n\nPublished 26 March 24 Defective airbag inflators on certain Chrysler and Dodge vehicles could rupture and cause injury or death, NHTSA says. By Joey Solitro\n\nPublished 25 March 24 Some airlines offer options to pay for the seat next to you to be free. How do you calculate that value? By Alexandra Svokos\n\nLast updated 25 March 24 Kiplinger is part of Future plc, an international media group and leading digital publisher.  Visit our corporate site.\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}