{
    "title": "US sues Apple, alleging iPhone monopoly - World - Chinadaily.com.cn",
    "date": "3/21/2024",
    "url": "https://www.chinadaily.com.cn/a/202403/22/WS65fce587a31082fc043be1ca.html",
    "text": " An antitrust lawsuit filed against Apple by the US Justice Department on Thursday takes direct aim at the company's iPhone, could take years to play out, and force the tech giant to make changes in some of its most valuable businesses. They include the iPhone, in which Apple reported more than $200 billion in sales in 2023; the Apple Watch, part of the company's $40 billion wearables business; and its profitable services line, which reported $85 billion in revenue. US Attorney General Merrick Garland announced the landmark suit at a news conference. He claimed that Apple has a monopoly over the smartphone market, alleging the tech giant blocked software developers and mobile-gaming companies from offering better options on the iPhone, resulting in higher prices for consumers. \"We allege that Apple has consolidated its monopoly power, not by making its own products better, but by making other products worse,\" Garland said. The long-anticipated lawsuit comes after years of allegations by critics that Apple has harmed competition with restrictive app store terms and high fees. The Justice Department, which began its investigation of Apple in 2019, focused on its entire system of products and services. Reaction from Apple was swift: \"This lawsuit threatens who we are and the principles that set Apple products apart in fiercely competitive markets,\" an Apple spokeswoman said. \"If successful, it would hinder our ability to create the kind of technology people expect from Apple — where hardware, software, and services intersect. It would also set a dangerous precedent, empowering government to take a heavy hand in designing people's technology.\" Apple plans to file a motion to dismiss the case in the next 60 days. In its filing, the company said it plans to emphasize that competition laws permit it to adopt policies or designs that its competitors oppose, particularly when those designs would make using an iPhone a better experience. Apple is worth nearly $3 trillion, making it one of the highest valued companies in the world. Apple, based in Cupertino, California, had 64 percent of the market share for US smartphones in the last quarter of 2023, versus 18 percent for Samsung, according to Counterpoint Research. Colin Kass, an antitrust lawyer at New York-based Proskauer Rose, told The New York Times that the most compelling allegation is that Apple could be contractually preventing rivals from developing apps that work with other app providers, as \"super apps\" could. Other legal experts noted that companies are legally allowed to favor their own products and services, so the government will have to explain why that is a problem with Apple. \"This case is about technology,\" said Kass. \"Can the antitrust laws force a company to redesign its product to make it more compatible with competitors' products?\" This is the third lawsuit the Justice Department has brought against Apple over antitrust violations in the past two decades. European regulators also have targeted the company over anticompetitive behavior, including claims of blocking rivals with its music-streaming service. Garland said a key principle of US antitrust law is a critical part of the suit. It isn't illegal to hold a monopoly, he said. It is only illegal when a monopolist resorts to anticompetitive tactics, or harms competition, in an effort to maintain that monopoly. Apple \"has maintained its power, not because of its superiority, but because of its unlawful, exclusionary behavior\", Garland said. He claimed that Apple's dominance comes \"not by making its own products better —but by making other products worse\". Each step in Apple's course of conduct built and \"reinforced the moat around its smartphone monopoly\", according to the suit, filed by the DOJ and 16 attorneys general in federal court in New Jersey. The tech giant prevented other companies from offering applications that compete with Apple products like its digital wallet, which could diminish the value of the iPhone, the government said. Apple's policies hurt consumers and smaller companies that compete with some of Apple's services, in the form of \"higher prices and less innovation\", the lawsuit said. Copyright 1995 -  . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. "
}