{
    "title": "Australia's Top Banker Renews Warning on Apple Payments",
    "date": "3/10/2024",
    "url": "https://finance.yahoo.com/news/australia-top-banker-renews-warning-044600823.html",
    "text": "(Bloomberg) -- Commonwealth Bank of Australia Chief Executive Officer Matt Comyn renewed his warning on Apple Inc.’s power over the nation’s payments market, reigniting a years-long dispute about competition in a booming area of finance. Most Read from Bloomberg Putin Says Ukraine Deal Requires Security Pledges for Russia US House Passes Bill That Would Force TikTok Sale or Ban It Ukraine Hits Third Russian Refinery in Escalating Drone Strikes An $80 Billion Crash in India’s Small Caps Flashes Warning Signs Ex-Wall Street Banker Takes On AOC in New York Democratic Primary “They should be subjected to a lot more scrutiny in Australia,” Comyn said at a conference in Sydney on Monday. In a fracas that has lasted years, Comyn has pushed for more competition and has told a parliamentary inquiry that customers should be able to decide which features they prefer in wallet apps. Apple, which is a partner and also a competitor for domestic banks, doesn’t give access to the near field communication chip on its iPhones, and instead requires banks to send payments using Apple Pay. “They are very sophisticated companies who are playing a very deliberate game and it should be a very clear agenda item for government and policymakers,” Comyn said, referring to the US technology giant. He was speaking at the AFR Business Summit in Sydney. Macquarie Group Ltd. Chief Executive Officer Shemara Wikramanayake, speaking on a panel at the same conference later in the day, said she won’t buy into the regulation of the so-called Magnificent Seven, companies that do “an amazing job for the US and the world.” “The US and the world does need to allow other competition to come in, but that’s something for regulators to sort out,” she said when asked whether the Australian government should place more attention on Apple’s market power. “Basically we take the world as we see it and work with it. They’re contributing a lot and we’re focusing on the positive in how we engage with them,” she said. Comyn also reiterated his opinion on hybrid work, a policy which requires his staff to spend at least 50% of their time in the office. This contrasts with some US banks that have pushed workers back to the office up to five-days-a-week. “Hybrid is here to stay,” he said. (Adds comments from Macquarie CEO on regulation from fifth paragraph) Most Read from Bloomberg Businessweek Gold-Medalist Coders Build an AI That Can Do Their Job for Them Make Up or Break Up: Will Trump and Musk Merge? Academics Question ESG Studies That Helped Fuel Investing Boom America’s Plumber Deficit Isn’t Good for the Economy Luxury Postnatal Retreats Draw Affluent Parents Around the US ©2024 Bloomberg L.P. Related Quotes "
}