{
    "title": "Apple is getting serious about AI",
    "date": "3/27/2024",
    "url": "https://www.aol.com/finance/apple-getting-serious-ai-180823588.html",
    "text": "Advertisement For premium support please call: ​​ Apple appears to be finally raising the curtain on some of its AI efforts. Apple researchers say they’ve developed a family of multimodal models — which refers to an AI system that can interpret and generate different types of data, such as text and images at the same time — called MM1. The report said its new methods boasts “superior abilities” and can offer advanced reasoning and in-context learning to respond to text and images. The announcement hints at how such a system could benefit future Apple products, including iPhones, Macs and its Siri voice assistant. It comes as Apple is expected to unveil several new AI features at its developer conference in June. At the same time, however, Apple has reportedly reached a deal with Google that indicates perhaps its own AI efforts are not quite where they want them to be yet. According to a Bloomberg report, Apple is interested in licensing and building Google’s Gemini AI engine, which includes chatbots and other AI tools, into upcoming iPhones and its iOS 18 features. As more tech companies pour billions of dollars into the development and rollout of artificial intelligence, Apple has largely been left out of the conversation, with many other tech companies already making big strides in the space. A partnership with Google would catapult Apple into the growing AI arms race. The report also said Apple previously held conversations with OpenAI, the company behind the viral chatbot ChatGPT. Apple, Google and OpenAI did not respond to a request for comment. In February, CEO Tim Cook teased during an investors meeting that he sees “incredible breakthrough potential for generative AI, which is why we’re currently investing significantly in this area.” But the company has not yet shared much about its vision for AI. Behind the scenes, Apple reportedly has been working its on-device generative AI capabilities and acquiring companies, such as Canadian startup DarwinAI. It also has a Machine Learning Research division dedicated to advancing AI. Angelo Zino, a VP and senior equity analyst at CFRA Research, said in an investors note on Monday that the latest news “likely confirms that Apple’s internal efforts are well behind those of OpenAI and Gemini.” But he added a potential deal “shows that the company is serious about adding significant AI capabilities across iOS 18 this fall when its new iPhones launch.” Google may be well suited for the new AI partnership considering its existing search partnership; the company has invested heavily on ensuring Google remains the default search engine option on Apple’s Safari browser. That search arrangement between the two tech giants, however, is under review by antitrust authorities. In another investor’s note on Monday, Wedbush Securities analysts said they see the potential partnership as a boon for both companies. “This is a major win for Google to get onto the Apple ecosystem and have access to the golden installed base of Cupertino with clearly a major license fee attached to this,” the analysts said. It would also give Apple the foundation and technology to double down on AI-powered iOS features currently being developed. The partnership could bring Gemini to nearly 2 billion Apple devices. Wedbush also said the deal would be a huge “validation moment” for Google’s generative AI positioning, considering Microsoft and OpenAI captured early market share by commercializing some of their products. For more CNN news and newsletters create an account at CNN.com Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}