{
    "title": "Apple Inc. (NASDAQ:AAPL) Stock Position Cut by Peoples Bank KS",
    "date": "3/19/2024",
    "url": "https://www.defenseworld.net/2024/03/19/apple-inc-nasdaqaapl-stock-position-cut-by-peoples-bank-ks.html",
    "text": "Posted by Defense World Staff on Mar 19th, 2024 Peoples Bank KS reduced its stake in shares of  Apple Inc. (NASDAQ:AAPL – Free Report) by 0.6% during the fourth quarter, according to the company in its most recent 13F filing with the Securities & Exchange Commission. The institutional investor  owned 21,675 shares of the iPhone maker’s stock after selling 130 shares during the period. Apple accounts for  3.3% of Peoples Bank KS’s portfolio, making the stock its 5th biggest holding. Peoples Bank KS’s holdings in Apple were worth $4,173,000 as of its most recent filing with the Securities & Exchange Commission. A number of other institutional investors and hedge funds also recently added to or reduced their stakes in AAPL. Moneta Group Investment Advisors LLC boosted its stake in  Apple by 116,483.5% in the 4th quarter. Moneta Group Investment Advisors LLC now owns 569,554,722 shares of the iPhone maker’s stock worth $74,002,245,000 after purchasing an additional 569,066,184 shares during the period.  Norges Bank purchased a new position in  Apple during the fourth quarter valued at $21,746,940,000.  Morgan Stanley increased its holdings in  Apple by 14.2% in the 4th quarter. Morgan Stanley now owns 208,655,323 shares of the iPhone maker’s stock valued at $27,110,586,000 after acquiring an additional 25,926,552 shares during the last quarter.  Barclays PLC lifted its stake in  Apple by 60.0% in the 2nd quarter. Barclays PLC now owns 46,932,352 shares of the iPhone maker’s stock worth $9,103,464,000 after purchasing an additional 17,604,799 shares in the last quarter.  Finally, Osaic Holdings Inc. boosted its holdings in shares of  Apple by 154.9% during the 2nd quarter. Osaic Holdings Inc. now owns 23,295,770 shares of the iPhone maker’s stock valued at $1,729,270,000 after purchasing an additional 14,157,430 shares during the last quarter. Institutional investors own  58.51% of the company’s stock. Apple stock opened at $173.72 on Tuesday. The company has a debt-to-equity ratio of 1.28, a quick ratio of 1.02 and a current ratio of 1.07. The stock has a market cap of $2.68 trillion, a PE ratio of 27.06, a price-to-earnings-growth ratio of 2.09 and a beta of 1.29. The stock has a 50-day moving average of $183.15 and a two-hundred day moving average of $183.21. Apple Inc. has a one year low of $154.15 and a one year high of $199.62. Apple (NASDAQ:AAPL – Get Free Report) last announced its quarterly earnings data on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share for the quarter, beating analysts’ consensus estimates of $2.09 by $0.09. The firm had revenue of $119.60 billion for the quarter, compared to analyst estimates of $117.99 billion. Apple had a net margin of 26.16% and a return on equity of 156.04%. During the same period in the previous year, the company earned $1.88 earnings per share. The business’s quarterly revenue was up 2.1% compared to the same quarter last year.  On average, research analysts anticipate that  Apple Inc. will post 6.55 EPS for the current fiscal year. The company also recently announced a quarterly dividend, which was paid on Thursday, February 15th. Investors of record on Monday, February 12th were issued a dividend of $0.24 per share. This represents a $0.96 dividend on an annualized basis and a dividend yield of 0.55%. The ex-dividend date of this dividend  was Friday, February 9th. Apple’s dividend payout ratio (DPR) is 14.95%. In related news, Director Arthur D. Levinson sold 100,000 shares of the business’s stock in a transaction on Thursday, February 29th. The shares were sold at an average price of $180.94, for a total transaction of $18,094,000.00. Following the completion of the transaction, the director now directly owns 4,434,576 shares in the company, valued at $802,392,181.44. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available at the SEC website. 0.06% of the stock is owned by corporate insiders. A number of equities research analysts recently commented on AAPL shares. Morgan Stanley boosted their target price on Apple from $210.00 to $220.00 and gave the stock an “overweight” rating in a research report on Friday, December 8th. Barclays lowered their target price on Apple from $160.00 to $158.00 and set an “underweight” rating for the company in a research report on Friday, February 2nd. Piper Sandler Companies downgraded shares of Apple to a “neutral” rating and decreased their price target for the company from $220.00 to $205.00 in a research note on Thursday, January 4th. Bank of America raised shares of Apple from a “neutral” rating to a “buy” rating and lifted their price objective for the stock from $208.00 to $225.00 in a research note on Thursday, January 18th. Finally, Citigroup  restated a “buy” rating and set a $225.00 target price on shares of Apple in a research report on Friday, February 16th. One equities research analyst  has rated the stock with a sell rating, eleven have given a hold rating, twenty-one have assigned  a buy rating and one  has assigned  a strong buy rating to the stock. Based on data from MarketBeat, the stock  has an average rating of “Moderate Buy” and a consensus price target of $205.27. View Our Latest Research Report on Apple (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Riverwater Partners LLC Reduces Holdings in Apple Inc. (NASDAQ:AAPL) DNB Asset Management AS Sells 842 Shares of Franklin Resources, Inc. (NYSE:BEN) "
}