{
    "title": "Apple in talks With OpenAI, Google to enhance iPhone AI Capabilities",
    "date": "3/18/2024",
    "url": "https://www.businessupturn.com/technology/apple-in-talks-with-openai-google-to-enhance-iphone-ai-capabilities/",
    "text": "Business Upturn - News | Nation | World | External Affairs | Business | Money | Culture | Tech | Sports | Updates | Breaking Apple is reportedly in discussions with OpenAI and Google to incorporate advanced AI technology into the iPhone. The company is particularly interested in OpenAI’s ChatGPT and Google’s Gemini system. Apple is reportedly in active negotiations with Google to bring advanced AI technology to its iPhone lineup. The tech giant is looking to enhance the AI capabilities of its smartphones by leveraging technology from OpenAI and Google. According to a report from Bloomberg’s Mark Gurman, Apple is in talks with both OpenAI and Google about using their AI systems, specifically OpenAI’s ChatGPT or Google’s Gemini, to power AI on the iPhone. While Apple appears to be further along in negotiations with Google, it is also reportedly in discussions with OpenAI, although the stage of those discussions remains undisclosed. Advertisement Apple’s CEO Tim Cook has expressed his ambitions to bring more AI features to phones, emphasizing the company’s ongoing investments in technologies that will shape the future. Cook stated during Apple’s latest earnings call, “As we look ahead, we will continue to invest in these and other technologies that will shape the future. That includes artificial intelligence, where we continue to spend a tremendous amount of time and effort, and we’re excited to share the details of our ongoing work in that space later this year.” Apple already has a partnership with Google, making it the default search engine on iPhones. This existing relationship may influence Apple’s decision to collaborate with Google on AI technology. However, considering that competitor Samsung also uses Google’s AI tech, Apple could be exploring these collaborations as a way to differentiate its features from the Galaxy line. Apple’s discussions with OpenAI and Google underscore its commitment to advancing AI technology and integrating it into its products. As the demand for AI-driven features grows, Apple’s focus on AI innovation is likely to play a key role in shaping the future of smartphone technology. Tushar, a B.Tech student with a penchant for technology and finance, finds joy in the harmonies of music and the wisdom within the pages of books. His dynamic interests and multifaceted personality reflect a journey of constant exploration at the intersection of creativity and logic. Google Pixel 8 Pro vs Google Pixel 7 Pro: Unveiling the evolution of Pixel… Dive into the future with the OPPO F25 Pro 5G in Ocean Blue, 128 GB (8 GB RAM): Now… How Technology Has Changed Traditional Payments Unveiling Excellence: Oppo F25 Pro vs. Oppo Reno11 F – A Comprehensive Showdown  What's happening IPL 2024 RCB v KKR: Fantasy XI of Shreyas Iyer’s KKR… IPL 2024 RCB v KKR: Predicted playing XI of Challengers and… Sharp Aquos R8s vs. Sharp Aquos R8s Pro: A detailed… Experience excellence with the Vivo T2x 5G: A Fusion of… Unveiling the Samsung Galaxy F14 5G: Power, Performance, and… Pulse: The Boys and Pennyworth stars come onboard to… Claire Danes to lead Netflix’s The Beast In Me;… Sean ‘Diddy’ Combs ex Yung Miami accused of… "
}