{
    "title": "Amazon adds 'frequently returned' warning label to Apple's FineWoven iPhone \ncases after slew of one-star revie",
    "date": "3/2/2024",
    "url": "https://www.businessinsider.in/tech/news/amazon-adds-frequently-returned-warning-label-to-apples-finewoven-iphone-cases-after-slew-of-one-star-reviews/articleshow/108147692.cms",
    "text": "Liked the article? Share it with your friends... or copy link Apple's FineWoven iPhone 15 cases have been dragged on the internet for their seemingly questionable quality — and some customers want a refund. As of March 1, Amazon has labeled Apple's FineWoven Case as a \"frequently returned item.\" The warning encourages users to \"check the product details and customer reviews\" to learn more about the $59 case. It reflects how dissatisfied some customers are with it, the e-commerce giant's product listing for the case shows. Customer reviews for the product seem to be divided. While 45% of 628 reviewers gave the product five out of five stars, 32% gave it one out of five stars, the listing shows. Those who left one-star reviews and mentioned a return complained about the quality and durability of the case. \"I didn't like it at all,\" one customer wrote in a review titled \"Disappointed.\" \"The material is very poor. And the color doesn't match the picture.\" \"Not sure that quality is worth the price,\" another reviewer wrote. \"Seriously feels cheap and easily scratches. Stained easily.\" One reviewer said they returned the case after using it for two days and would not buy another Apple-made case until the company brought back its leather ones. Amazon did not respond to Business Insider's request for comment when asked how the site determines when to flag a product as a \"frequently returned item.\" The online-retail giant rolled out the return tag in March 2023 to encourage customers to do their research before buying a product, The Information reported. The warning appeared on products such as the Pro-Ject Automat A1 record player and some dresses, The Information reported, though the sign is no longer on their Amazon listings. Apple did not respond to BI's request for comment when asked if the company would improve the product to address customer concerns. FineWoven case users aren't just complaining about the product on the online-retail site. Since Apple's latest iPhone case hit the market last September, users have turned to social media to share their thoughts. In a poll on X from late February, over half of 3,324 respondents voted that the iPhone case is a \"piece of junk.\" Only 17.9% said the case \"has held up well.\" In response to the poll, users added their own two cents. Users commented things such as, \"This product is the worst Apple has even released,\" and that the case looks like it's been \"dragged through the jungle\" along with photos of their bruised cases. The appalling state of an @Apple “FineWoven” (e.g. real leather substitute) premium iPhone Pro case after only 4 months of standard real-world use: this product is the worst Apple has even released - it should be withdrawn and customers should receive a fully refund & apology. pic.twitter.com/WnyFN2HhPk \"I've been waiting for the CDC to show up at my house to declare it a biomedical concern,\" Joanna Stern, a tech reviewer, wrote in The Wall Street Journal's \"Tech Things\" newsletter after using the case for five months. Advertisement "
}