{
    "title": null,
    "date": "3/29/2024",
    "url": "https://www.breakinglatest.news/business/apple-employee-apparently-leaked-details-about-products-he-didnt-like/",
    "text": " People walk past an Apple Store in Berlin, Germany on March 25, 2024. Sean Gallup/Getty Images Apple is suing a former software engineer for leaking confidential information. According to Apple, Andrew Aude shared information about products with media and employees of other companies. Aude still poses a threat due to his knowledge of confidential company information. Apple is suing a former employee who is said to have shared confidential information about his iPhone. This should also include details about products that he didn’t like. Apple filed a lawsuit with one on March 18 California court a. In the letter, the company alleges that former software engineer Andrew Aude leaked information about projects, including Apple’s Journal app and Vision Pro, to the media and employees of other technology companies over a five-year period. The tech giant is suing Aude, who joined Apple in 2016, for breaching the confidentiality agreement and violating labor law. The lawsuit was first filed by the platform „MacRumors“ reported. Read too Analysts say Nvidia could soon be more valuable than Apple if the iPhone maker doesn’t wow investors with AI soon Apple said it discovered the leaks in late 2023. When the company first confronted him about it, Aude denied his involvement. But he then faked a bathroom break and “permanently deleted significant amounts of evidence from his device.” This also included deleting the Signal app – which he used for communication – from his work phone, it was said. However, the lawsuit states that Aude frequently saved screenshots of his communications to his work iPhone “to preserve them for posterity.” Apple was able to retrieve these. Apple’s analyzed Aude’s company-issued work iPhone. It emerged that he exchanged more than 1,400 encrypted messages with a journalist from the Wall Street Journal over a period of four months. As written in the lawsuit, Aude also sent over 10,000 text messages to a journalist from The Information. He also traveled to meet her. Aude’s screenshots are included in the lawsuit. In one particular leak leaked to the journalist in April 2023, Aude’s screenshots showed a “dizzying anticipation” of the “chaos” that awaits the company following the publication of the leaked information, explains Apple. Read too Apple asks software developers for feedback on the App Store – and should expect a lot of criticism Aude also described the leak as a “necessary evil” to other colleagues, it goes on to say. “In connection with a leak, Mr. Aude admitted that he violated his obligations to Apple to ‘kill’ products and features with which he did not agree,” Apple writes in the lawsuit. The information shared by Aude led to the publication of several news reports, according to Apple. “His revelations have also impaired Apple’s ability to surprise and delight with its new offerings,” the technology company describes in its lawsuit. Although Aude was fired, Apple says he poses a “continuing threat” to the company, including knowledge of confidential and proprietary information and his “long and extensive history of intentionally and unauthorizedly disclosing this information to third parties.” . Apple is seeking a jury trial and damages. There is also an order that Aude may not pass on the company’s confidential and proprietary information to third parties without the company’s consent. The company is also demanding that Aude forgo his voluntary bonuses and stock options. Apple did not immediately respond to a request for comment sent outside of business hours. This article was translated from English by Muriel Dittmar. You can find the original here.     Save my name, email, and website in this browser for the next time I comment.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More "
}