{
    "title": "Delos Wealth Advisors LLC Sells 93 Shares of Apple Inc. (NASDAQ:AAPL)",
    "date": "3/14/2024",
    "url": "https://www.americanbankingnews.com/2024/03/14/delos-wealth-advisors-llc-sells-93-shares-of-apple-inc-nasdaqaapl.html",
    "text": "Posted by ABMN Staff on Mar 14th, 2024 Delos Wealth Advisors LLC cut its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 1.5% during the 3rd quarter, according to its most recent 13F filing with the Securities and Exchange Commission. The fund owned 6,263 shares of the iPhone maker’s stock after selling 93 shares during the quarter. Apple accounts for about 1.4% of Delos Wealth Advisors LLC’s portfolio, making the stock its 27th largest position. Delos Wealth Advisors LLC’s holdings in Apple were worth $1,177,000 as of its most recent filing with the Securities and Exchange Commission. Other institutional investors have also added to or reduced their stakes in the company. Atlantic Private Wealth LLC acquired a new position in shares of Apple in the first quarter valued at approximately $30,000. Summit Wealth Group LLC grew its holdings in Apple by 16,252.3% during the 1st quarter. Summit Wealth Group LLC now owns 6,992,420 shares of the iPhone maker’s stock worth $42,000 after acquiring an additional 6,949,659 shares during the last quarter. HBC Financial Services PLLC increased its position in Apple by 21.7% in the 1st quarter. HBC Financial Services PLLC now owns 448 shares of the iPhone maker’s stock valued at $49,000 after acquiring an additional 80 shares during the period. West Tower Group LLC acquired a new position in shares of Apple during the second quarter worth $64,000. Finally, PayPay Securities Corp grew its stake in shares of Apple by 70.2% in the third quarter. PayPay Securities Corp now owns 509 shares of the iPhone maker’s stock worth $87,000 after purchasing an additional 210 shares during the last quarter. 58.51% of the stock is currently owned by institutional investors and hedge funds. NASDAQ:AAPL opened at $171.13 on Thursday. The company has a debt-to-equity ratio of 1.28, a current ratio of 1.07 and a quick ratio of 1.02. Apple Inc. has a one year low of $149.92 and a one year high of $199.62. The company has a market cap of $2.64 trillion, a PE ratio of 26.66, a PEG ratio of 2.08 and a beta of 1.29. The firm has a 50-day moving average of $183.74 and a 200-day moving average of $183.47. Apple (NASDAQ:AAPL – Get Free Report) last issued its quarterly earnings data on Thursday, February 1st. The iPhone maker reported $2.18 EPS for the quarter, topping analysts’ consensus estimates of $2.09 by $0.09. Apple had a return on equity of 156.04% and a net margin of 26.16%. The firm had revenue of $119.60 billion during the quarter, compared to analyst estimates of $117.99 billion. During the same period in the previous year, the company posted $1.88 EPS. The company’s revenue for the quarter was up 2.1% on a year-over-year basis. As a group, equities research analysts expect that Apple Inc. will post 6.55 EPS for the current fiscal year. The company also recently declared a quarterly dividend, which was paid on Thursday, February 15th. Investors of record on Monday, February 12th were issued a dividend of $0.24 per share. This represents a $0.96 annualized dividend and a yield of 0.56%. The ex-dividend date was Friday, February 9th. Apple’s dividend payout ratio (DPR) is presently 14.95%. In other news, Director Arthur D. Levinson sold 100,000 shares of the business’s stock in a transaction that occurred on Thursday, February 29th. The stock was sold at an average price of $180.94, for a total value of $18,094,000.00. Following the transaction, the director now owns 4,434,576 shares in the company, valued at approximately $802,392,181.44. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is available through this link. 0.06% of the stock is currently owned by insiders. Several research analysts recently issued reports on AAPL shares. Citigroup reaffirmed a “buy” rating and set a $225.00 target price on shares of Apple in a research report on Friday, February 16th. Tigress Financial lifted their price objective on Apple from $225.00 to $240.00 and gave the stock a “strong-buy” rating in a research note on Thursday, November 16th. Monness Crespi & Hardt increased their target price on shares of Apple from $189.00 to $200.00 and gave the company a “buy” rating in a research report on Friday, February 2nd. Redburn Partners lowered shares of Apple to a “neutral” rating and set a $200.00 price objective on the stock. in a research note on Wednesday, January 10th. Finally, Oppenheimer reiterated an “outperform” rating and set a $200.00 price objective on shares of Apple in a research report on Friday, February 2nd. One equities research analyst has rated the stock with a sell rating, eleven have given a hold rating, twenty-one have given a buy rating and one has issued a strong buy rating to the company’s stock. Based on data from MarketBeat.com, the stock has a consensus rating of “Moderate Buy” and an average target price of $205.27. View Our Latest Research Report on AAPL (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.    Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Vanguard Mega Cap Value ETF (NYSEARCA:MGV) Shares Bought by Harbour Investments Inc. Altria Group, Inc. (NYSE:MO) Shares Sold by Diversified Trust Co "
}