{
    "title": null,
    "date": "1/3/2024",
    "url": "https://www.technewsworld.com/story/courts-regulators-pose-threat-to-apple-services-revenue-in-2024-178918.html",
    "text": "Court cases and regulators are stirring up uncertainty among Apple watchers about the prospects for its lucrative US$85 billion services business. The U.S. government’s antitrust lawsuit against Google has produced anxiety about whether Apple will continue to rake in anywhere from $15 billion to $20 billion a year for making Google’s search engine the default choice on the iPhone, iPad, and Mac. Meanwhile, the U.S. Department of Justice is reportedly preparing a case that could loosen Apple’s iron grip on its App Store operations, something it has been forced to do to some extent by the European Union’s Digital Markets Act, which has a March deadline for compliance. To comply with that act, Apple has agreed to allow “sideloading” in the EU, which allows iPhone users to download apps from outside the App Store. “Apple’s financial performance has increasingly depended on services and, at some future point, the company may largely become a services company. So services are very important now and likely critically important to Apple’s anticipated future,” explained Rob Enderle, president and principal analyst at the Enderle Group, an advisory services firm in Bend, Ore. “If Google loses the antitrust case, Apple could take a large financial hit, and it may substantially set back Apple’s apparent plan to transition into more of a services company,” he told TechNewsWorld. With smartphone and other hardware sales slowing over the past few years, services income has played an increasingly crucial role in Apple’s financial ecosystem, steadily gaining significance alongside hardware sales, added Mark N. Vena, president and principal analyst at SmartTech Research in San Jose, Calif. “With offerings like the App Store, Apple Music, iCloud, and more, services are contributing significantly to revenue diversification,” he told TechNewsWorld. “The company’s focus on expanding its services portfolio, including Apple TV+ and Arcade, suggests a growing emphasis on this revenue stream.” “As the technology landscape evolves,” he continued, “Apple’s strategic pivot towards services is likely to intensify, making it increasingly vital for sustained financial success.” Despite Apple’s financial success — its market capitalization at the turn of the year was $2.89 trillion — the company has been a bit of a “one trick pony,” maintained Charles King, the principal analyst at Pund-IT, a technology advisory firm, in Hayward, Calif. “While sales of secondary solutions, like the Apple Watch, continue to grow, the lion’s share of the company’s revenues and income still derive from the iPhone,” he told TechNewsWorld. “So services offerings and revenues have acted to round out Apple as a company, both for its customers and investors. With no new ‘killer’ Apple solutions on the horizon, successful services are a crucial part of the company’s portfolio.” Ross Rubin, the principal analyst with Reticle Research, a consumer technology advisory firm in New York City, pointed out that Apple’s services business is small compared to its iPhone sales. “But it’s a growing part of the business, which is particularly important since growth in its devices business has been flat or down as the market becomes saturated and moves into a replacement cycle,” he told TechNewsWorld. Because services have become so important to Apple, the outcome of the antitrust lawsuit against Google is casting a shadow on the Cupertino gang’s services finances. “Google is responsible for a significant amount of Apple’s services revenue, and if Apple were to lose control of that default search experience, it might not be able to command the kind of fees it gets from Google now,” Rubin reasoned. However, the ramifications of a Google loss in court could extend beyond the financial relationship between the companies. “If Google were to lose the antitrust lawsuit, the potential impacts on Apple could include increased regulatory scrutiny of its own practices,” Vena said. “Apple might face a reevaluation of its App Store policies and business practices, potentially leading to changes in its competitive landscape,” he continued. “It could also influence broader industry dynamics, affecting partnerships and collaborations.” “However,” he added. “The specifics would depend on the nature of the antitrust allegations and the subsequent legal outcomes.” “The connections between Apple and Google, and the latter’s antitrust woes, make close scrutiny of Apple by regulators more or less inevitable,” added King. “And given the political uncertainties of a presidential election cycle, the DOJ may decide to move as quickly as possible if they determine that action against Apple is warranted.” Rubin pointed out, though, that there could be an upside for Apple in a DOJ win over Google. “There have been rumors for many years that Apple has been developing its own search engine as a fallback if its relationship with Google soured,” he said. “That could have a benefit for Apple because it could collect its own revenue from search and enforce its own privacy standards.” Rubin added that if regulators forced Apple to loosen the reins that it has on the distribution of software through its App Store, consumers could see a broader set of offerings, such as cloud-gaming services that offer multiple games through a single app, programs to emulate hardware other than Apple devices, and greater integration with non-Apple services, like Spotify, Peloton, and Netflix. “Regulatory changes to Apple’s App Store business model could have far-reaching effects,” Vena said. “Implementing fair competition policies may stimulate innovation and provide users with more choices. Developers, too, may benefit from more equitable terms, fostering a diverse app ecosystem.” “However,” he continued, “alterations might challenge Apple’s control over app distribution, potentially impacting its revenue model.” “Striking the right balance will be crucial to ensuring competition without compromising Apple’s ability to maintain a secure and user-friendly App Store environment,” he added. Ultimately, though, regulation is likely to be another hit on Apple’s revenues in the long run. “Apple derives substantial financial benefits from the 15% to 30% commission it charges on most App Store in-app purchases and paid downloads,” King explained. “The company fought hard against, and lost to, the EU’s new Digital Marketing Act, which requires vendors to allow customers to download apps from other companies. If similar regulations were adopted in the U.S., it could substantially reduce Apple’s App Store commissions over time,” he said. Regulation is a significant threat to Apple services, maintained Vijay Marolia, managing partner and chief investment officer of Regal Point Capital, an investment firm, in Orlando, Fla. “Apple’s services business is a friggin’ money tree,” he declared. “Lawyers, regulators, and lobbyists are trying to shake that tree while it keeps getting bigger and the rest of Apple’s revenues are stagnating.” John P. Mello Jr. has been an ECT News Network reporter since 2003. His areas of focus include cybersecurity, IT issues, privacy, e-commerce, social media, artificial intelligence, big data and consumer electronics.  He has written and edited for numerous publications, including the Boston Business Journal, the Boston Phoenix, Megapixel.Net and Government Security News. Email John. Please sign in to post or reply to a comment. New users create a free account. How confident are you in the reliability of AI-powered search results?\nVery - I look forward to the widespread adoption of AI search.\nModerately - AI search is promising, and I'm cautiously optimistic.\nUnsure, but I am keeping an open mind.\nNot at All - I do not trust AI-powered search results.\n\n\n\n Loading ...   Very - I look forward to the widespread adoption of AI search. Moderately - AI search is promising, and I'm cautiously optimistic. Unsure, but I am keeping an open mind. Not at All - I do not trust AI-powered search results. https://www.technewsworld.com/wp-content/uploads/sites/3/2022/02/antitrust-law.jpg https://www.technewsworld.com/story/courts-regulators-pose-threat-to-apple-services-revenue-in-2024-178918.html Courts, Regulators Pose Threat To Apple Services Revenue in 2024 https://www.technewsworld.com/wp-content/uploads/sites/3/2024/02/filmmaker.jpg https://www.technewsworld.com/story/openais-sora-elevenlabs-and-the-end-of-video-media-as-we-know-it-179032.html OpenAI’s Sora, ElevenLabs, and the End of Video Media as We Know It https://www.technewsworld.com/wp-content/uploads/sites/3/2024/02/Snapdragon-X-Elite.jpg https://www.technewsworld.com/story/qualcomm-chip-closing-performance-gap-with-apple-m3-in-leaked-benchmarks-179039.html Qualcomm Chip Closing Performance Gap With Apple M3 in Leaked Benchmarks https://www.technewsworld.com/wp-content/uploads/sites/3/2024/01/Mantic-Minotaur.jpg https://www.technewsworld.com/story/lunar-lobster-is-dead-how-to-upgrade-to-ubuntu-23-10-mantic-minotaur-177260.html Lunar Lobster Is Dead: How To Upgrade to Ubuntu 23.10 Mantic Minotaur https://www.technewsworld.com/wp-content/uploads/sites/3/2022/11/systems-control-operators.jpg https://www.technewsworld.com/story/report-finds-white-hats-on-offensive-against-black-hat-hackers-179057.html Report Finds White Hats on Offensive Against Black Hat Hackers https://www.technewsworld.com/wp-content/uploads/sites/3/2023/09/passwordless-computing.jpg https://www.technewsworld.com/story/the-realities-of-switching-to-a-passwordless-computing-future-178579.html The Realities of Switching to a Passwordless Computing Future https://www.technewsworld.com/wp-content/uploads/sites/3/2023/06/computer-programmers.jpg https://www.technewsworld.com/story/ai-will-have-a-transformative-impact-on-software-development-in-2024-178950.html AI Will Have a Transformative Impact on Software Development in 2024 https://www.technewsworld.com/wp-content/uploads/sites/3/2023/07/strategic-planning.jpg https://www.technewsworld.com/story/the-high-stakes-of-tech-marketing-and-the-green-lantern-conundrum-179059.html The High Stakes of Tech Marketing and the ‘Green Lantern’ Conundrum https://www.technewsworld.com/wp-content/uploads/sites/3/2023/09/network-engineers-code.jpg https://www.technewsworld.com/story/more-linux-malware-means-more-linux-monitoring-177174.html More Linux Malware Means More Linux Monitoring https://www.technewsworld.com/wp-content/uploads/sites/3/2023/12/Wi-Fi-7.jpg https://www.technewsworld.com/story/next-generation-wi-fi-7-standard-expected-to-be-finalized-in-early-2024-178845.html Next-Generation Wi-Fi 7 Standard Expected To Be Finalized in Early 2024 https://www.technewsworld.com/wp-content/uploads/sites/3/2024/02/mobile-app-security.jpg https://www.technewsworld.com/story/mobile-security-firms-fortify-defenses-as-app-attacks-accelerate-179003.html Mobile Security Firms Fortify Defenses as App Attacks Accelerate https://www.technewsworld.com/wp-content/uploads/sites/3/2024/01/CES-2024-Innovation-Showcase.jpg https://www.technewsworld.com/story/10-products-from-ces-2024-that-set-the-innovation-bar-178966.html 10 Products From CES 2024 That Set the Innovation Bar https://www.technewsworld.com/wp-content/uploads/sites/3/2024/01/SevaCare-Blood-Pressure-Monitor.jpg https://www.technewsworld.com/story/sevacare-blood-pressure-monitor-offers-affordable-home-health-assurance-178951.html SevaCare Blood Pressure Monitor Offers Affordable Home Health Assurance https://www.technewsworld.com/wp-content/uploads/sites/3/2022/07/home-security.jpg https://www.technewsworld.com/story/majority-of-consumers-feel-safe-with-diy-home-security-parks-study-179055.html Majority of Consumers Feel Safe With DIY Home Security: Parks Study https://www.technewsworld.com/wp-content/uploads/sites/3/2024/01/smartphone-user-happy.jpg https://www.technewsworld.com/story/how-to-speed-up-a-suddenly-slow-android-phone-178982.html How To Speed Up a Suddenly Slow Android Phone https://www.technewsworld.com/wp-content/uploads/sites/3/2023/04/home-hacker.jpg https://www.technewsworld.com/story/paranoia-in-the-home-1-in-3-americans-worried-about-their-smart-gadgets-being-hacked-178954.html Paranoia in the Home: 1 in 3 Americans Worried About Their Smart Gadgets Being Hacked https://www.technewsworld.com/wp-content/uploads/sites/3/2024/03/strategy-plan.jpg https://www.technewsworld.com/story/nvidia-vs-apple-the-difference-between-strategic-and-tactical-leadership-179051.html Nvidia vs. Apple: The Difference Between Strategic and Tactical Leadership https://www.technewsworld.com/wp-content/uploads/sites/3/2023/12/tech-forecast-2024.jpg https://www.technewsworld.com/story/rob-enderles-tech-forecast-for-2024-178841.html Rob Enderle’s Tech Forecast for 2024 https://www.technewsworld.com/wp-content/uploads/sites/3/2024/02/dating-app-user.jpg https://www.technewsworld.com/story/mozilla-recommends-swiping-left-on-ai-romance-apps-179014.html Mozilla Recommends ‘Swiping Left’ on AI Romance Apps https://www.technewsworld.com/wp-content/uploads/sites/3/2024/01/linux-review-tux-keyboard.jpg https://www.technewsworld.com/story/lindoz-returns-with-advanced-ai-to-revamp-the-makululinux-lineup-177239.html LinDoz Returns With Advanced AI To Revamp the MakuluLinux Lineup https://www.technewsworld.com/wp-content/uploads/sites/3/2024/02/deepfake-edit.jpg https://www.technewsworld.com/story/are-deepfakes-overblown-179016.html Are Deepfakes Overblown? https://www.technewsworld.com/wp-content/uploads/sites/3/2024/02/Netgear-Orbi-RBE973.jpg https://www.technewsworld.com/story/the-orbi-rbe973-wi-fi-router-really-is-that-good-179048.html The Orbi RBE973 Wi-Fi Router Really Is That Good https://www.technewsworld.com/wp-content/uploads/sites/3/2024/01/Dysolve-Game-Lobby.jpg https://www.technewsworld.com/story/ai-powered-software-offers-breakthrough-for-treating-dyslexia-178937.html AI-Powered Software Offers Breakthrough for Treating Dyslexia https://www.technewsworld.com/wp-content/uploads/sites/3/2024/01/smartphone-user-perplexed.jpg https://www.technewsworld.com/story/affiliate-marketing-contributing-to-substandard-search-results-study-178978.html Affiliate Marketing Contributing to Substandard Search Results: Study https://www.technewsworld.com/wp-content/uploads/sites/3/2023/08/e-waste.jpg https://www.technewsworld.com/story/disorganization-not-cost-fuels-the-it-e-waste-crisis-178570.html Disorganization, Not Cost, Fuels the IT E-Waste Crisis https://www.technewsworld.com/wp-content/uploads/sites/3/2022/01/smartphone-shopping.jpg https://www.technewsworld.com/story/att-transunion-launch-initiative-to-combat-business-call-spoofing-178995.html AT&T, TransUnion Launch Initiative To Combat Business Call Spoofing https://www.technewsworld.com/wp-content/uploads/sites/3/2023/11/law-enforcement-investigators.jpg https://www.technewsworld.com/story/tech-coalition-launches-initiative-to-crackdown-on-nomadic-child-predators-178773.html Tech Coalition Launches Initiative To Crackdown on Nomadic Child Predators https://www.technewsworld.com/wp-content/uploads/sites/3/2023/12/Project-Kuiiper.jpg https://www.technewsworld.com/story/amazons-competitor-to-musks-starlink-takes-critical-step-toward-deployment-178873.html Amazon’s Competitor to Musk’s Starlink Takes Critical Step Toward Deployment https://www.technewsworld.com/wp-content/uploads/sites/3/2023/12/best-in-tech-2023.jpg https://www.technewsworld.com/story/standout-tech-products-of-2023-178853.html Standout Tech Products of 2023 https://www.technewsworld.com/wp-content/uploads/sites/3/2023/12/QR-code-scan.jpg https://www.technewsworld.com/story/quishing-alert-experts-advise-caution-before-scanning-qr-codes-178824.html Quishing Alert: Experts Advise Caution Before Scanning QR Codes https://www.technewsworld.com/wp-content/uploads/sites/3/2024/02/Apple-Vision-Pro-unboxed.jpg https://www.technewsworld.com/story/apple-vision-pro-impressions-one-week-later-179019.html Apple Vision Pro Impressions: One Week Later https://www.technewsworld.com/wp-content/uploads/sites/3/2023/11/tv-set-top-box-with-remote.jpg https://www.technewsworld.com/story/electronic-frontier-foundation-calls-for-ftc-action-on-poisoned-set-top-boxes-178797.html Electronic Frontier Foundation Calls for FTC Action on Poisoned Set-Top Boxes https://www.technewsworld.com/wp-content/uploads/sites/3/2024/02/Honda-CR-V-eFCEV.jpg https://www.technewsworld.com/story/honda-introduces-first-hydrogen-powered-consumer-vehicle-in-america-179042.html Honda Introduces First Hydrogen-Powered Consumer Vehicle in America https://www.technewsworld.com/wp-content/uploads/sites/3/2024/02/Tim-Cook-Vision-Pro-selfie.jpg https://www.technewsworld.com/story/vision-pro-revives-one-and-done-app-purchases-179012.html Vision Pro Revives One-and-Done App Purchases https://www.technewsworld.com/wp-content/uploads/sites/3/2023/06/Apple-Vision-Pro-with-battery.jpg https://www.technewsworld.com/story/apples-vision-pro-the-slow-birth-of-spatial-computing-179000.html Apple’s Vision Pro: The Slow Birth of Spatial Computing https://www.technewsworld.com/wp-content/uploads/sites/3/2023/06/women-dont-play-emma-raz.jpg https://www.technewsworld.com/story/women-dont-play-confronts-gender-disparity-in-the-tech-industry-178379.html ‘Women Don’t Play’ Confronts Gender Disparity in the Tech Industry Copyright 1998-2024 ECT News Network, Inc. All Rights Reserved. Enter your Username and Password to sign in.  "
}