{
    "title": null,
    "date": "1/12/2024",
    "url": "https://deadline.com/2024/01/microsoft-apple-ai-most-valuable-public-company-1235729573/",
    "text": "By Dade Hayes Business Editor Powered by its artificial intelligence assets, Microsoft has leapfrogged Apple to become the most valuable public company. According to Bloomberg, Microsoft’s market value finished the week at $2.88 trillion, compared with Apple’s $2.86 trillion. Over the past year, Microsoft has added about $1 trillion in value, as fascination with generative AI (a major point of contention in Hollywood’s dual strikes) increased. Shares in Microsoft finished Friday’s trading at $388.47, up 1% and near an all-time high. Apple’s stock has also been within range of record territory, though it closed the day up only a fraction at $185.92.\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tNews\n\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tVP Kamala Harris Unveils \"Safe, Secure & Responsible\" AI Guidelines For Federal Agencies\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tCasting\n\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tJohn Leguizamo Joins Taron Egerton In Apple Drama Series 'Firebug'; Kari Skogland To Direct & EP OpenAI, the maker of ChatGPT, is partly owned by Microsoft. The tech giant invested $10 billion in it last year, making a claim on a large chunk of the profits made by its for-profit arm. The market has been in a frenzy over AI stocks, causing shares in chipmaker Nvidia to triple in 2023 because the company was seen as an avenue for investors looking to take part in the AI revolution. In addition to its stake in ChatGPT, Microsoft has built out its own AI infrastructure and made investments in the space via M12, its 7-year-old investment firm. “We were already looking for uses of generative AI before the whole thing exploded,” M12 partner Michael Stewart told Crunchbase News. AI is viewed on Wall Street as a way for Microsoft to close the longtime gap with Google in search revenue. The former took in about $3.2 billion in search revenue in 2023, compared with $43 billion for the latter. Apple, by contrast with Microsoft, does not have a fully developed presence in AI. Its shares have also drifted down about 4% in recent weeks on concerns about its fourth-quarter results and potential softness in its flagship iPhone, which accounts for more than half of company revenue.   Subscribe to Deadline Breaking News Alerts and keep your inbox happy. Signup for Breaking News Alerts & Newsletters By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Get our latest storiesin the feed of your favorite networks We want to hear from you! Send us a tip using our annonymous form. Sign up for our breaking news alerts By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Deadline is a part of Penske Media Corporation. © 2024 Deadline Hollywood, LLC. All Rights Reserved. By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. "
}