{
    "title": "Apple's biggest challenges after rocky 2024 start",
    "date": "1/23/2024",
    "url": "https://finance.yahoo.com/video/apples-biggest-challenges-rocky-2024-171809136.html",
    "text": "Apple's (AAPL) market cap has been neck-and-neck with Microsoft (MSFT) as the iPhone maker experiences a rough start to 2024 with three analyst downgrades. Yahoo Finance Tech Editor Dan Howley details Apple's outlook for the rest of the year as iPhone demand in China wanes, Vision Pro headsets begin pre-order sales, and federal regulators reportedly consider an antitrust probe. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. AKIKO FUJITA: Apple had a pretty rough start to 2024 with three downgrades, sending the stock tumbling. Today, shares of the tech giant are trading higher amid the ongoing tech rally and a report that its new Vision Pro has already sold out in preorders. Joining us now to break down the tech giant's latest move is our very own Dan Howley. Dan, what's the path ahead for Apple? DAN HOWLEY: Yeah, Akiko. It's been a rough 2024, as you said. Those three downgrades from Piper Sandler, Barclays, and Redburn Atlantic basically pointing to a handful of issues, namely the potential for a slowdown in China iPhone sales. Basically, what's going on there is obviously the economy not being as robust as some would like and a resurgent Huawei, which has gotten its hands on modern processors for smartphones now being able to offer competing features to what the iPhone has available at lower prices. So some of the analysts are saying, look, the 15 and even the 16 doesn't look like it's going to sell in wild numbers over in China. That being kind of a drag on the company. And then there's also the talk of antitrust coming from the DOJ, a potential antitrust lawsuit that could look at the company's business practices overall. And then, oh yeah, we're also looking at changes to the App Store pricing structure from 15% and 30% fees to 12% and 27%. Not a huge change, but still something here in the US. And then the Vision Pro launching, you said the estimates is that they've sold out so far. It's about 180,000 units maybe, that's the general estimate. But it's still an expensive product at $3,499, so it's not going to sell in the volumes of something like an iPhone. So it is-- does feel like a lot coming to a head for Apple at least in the first few weeks of the year. Related Quotes "
}