{
    "title": "Apple launches Vision Pro headset Feb. 2, preorders begin Jan. 19",
    "date": "1/8/2024",
    "url": "https://finance.yahoo.com/news/apple-launches-vision-pro-headset-feb-2-preorders-begin-jan-19-155218836.html",
    "text": "Apple (AAPL) will release the new Vision Pro headset in the US on Feb. 2, the company announced Monday, in what CEO Tim Cook has described as the dawn of spatial computing. Customers can pick up the headset, which sells for $3,499 with 256GB of storage, at US Apple Store locations and the online store. Preorders for the device will begin on Jan. 19, the company said. Apple shares rose 1.3% during morning trading, steering the stock toward a win after a bruising week. The official release of the VR and augmented reality headset marks a significant moment for the company as consumers will soon get their hands on Apple's biggest product launch in roughly a decade. “The era of spatial computing has arrived,” said Cook in a statement. “Apple Vision Pro is the most advanced consumer electronics device ever created. Its revolutionary and magical user interface will redefine how we connect, create, and explore.” Apple's highly anticipated expansion of its hardware lineup comes at a challenging moment for the tech giant. Cupertino is coming off a brutal week in which traders erased more than $175 billion in market value after two analyst downgrades sparked a punishing sell-off. Apple's stock is closely watched because, as the market's most valuable company, it accounts for a significant percentage of the benchmark S&P 500 index, and the company's financial performance can influence the broader stock market. Due to Apple's enormous user base and its operations in crucial markets like China, the company also acts as a health gauge of the global economy. The headset, in particular, is a test for Apple charting a new path as older hardware categories, most notably the iPhone, have reached maturity. Apple's more critical observers have framed cooling demand for its devices as a sign of the company's slow demise. Its bullish backers, however, contend that Wall Street underestimates the pull of Apple's devices. They also highlight Apple's massive potential to grow its services business. Dan Ives of Wedbush, a prominent Apple optimist, estimates that Apple's services segment alone is worth a staggering $1.6 trillion. The Vision Pro runs on a new operating system, dubbed visionOS, featuring a new three-dimensional user interface and inputs controlled by a user’s eyes, hands, and voice. Apple's device will go head-to-head against Meta's (META) Quest headsets, pitting one American tech giant against another as Silicon Valley attempts to sell augmented and virtual reality as tech's next frontier, alongside the rapid development of generative AI. Hamza Shaban is a reporter for Yahoo Finance covering markets and the economy. Follow Hamza on Twitter @hshaban. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance "
}