{
    "title": "The CEO behind a Chinese startup says its AR glasses will blow Apple's \nVision Pro out of the water. Here's why",
    "date": "1/30/2024",
    "url": "https://www.businessinsider.in/tech/news/the-ceo-behind-chinese-startup-xreal-says-its-ar-glasses-will-blow-apples-vision-pro-out-of-the-water-heres-why-/articleshow/107241119.cms",
    "text": "Liked the article? Share it with your friends... or copy link Earlier this month, Chinese startup XReal unveiled the Air 2 Ultra, the company's latest augmented reality glasses that blend a virtual world with the user's physical surroundings. Its hope? To give consumers a cheaper substitute to Apple's pricier Vision Pro devices. Available for pre-order starting at $699, XReal's Air 2 Ultra are glasses that project a virtual screen that presents notifications and video onto the user's line of vision when worn. The startup says they'll be an \"affordable alternative\" to rivals like the Apple Vision Pro. The iPhone maker's mixed reality headset starts at a whopping $3,499. \"Unlike competing brands in this emerging space, we believe in making advanced wearable 6DoF glasses something you can wear all day long and that are accessible to all players in the XR development ecosystem,\" Chi Xu, the CEO of Xreal, said in its January press release. XReal also said that the Air 2 Ultra will rival the Meta Quest 3, though those goggles appear to be cheaper starting at $499. Xu didn't immediately respond to Business Insider's request for comment before publication. Neither did Apple or Meta. Xu told Bloomberg in a recent interview that the company's older, cheaper models of its AI glasses will be \"definitely easier to sell\" and are mostly purchased on Amazon. Still, Xu expects the Air 2 Ultra — with 50,000 units expected to be produced this year — to be the company's real money maker in the future. XReal, which has been selling AR glasses as part of its Air product line since 2017, is reportedly set to raise an additional $60 million from an undisclosed supply chain partner — putting the company one step closer to going toe-to-toe with tech giants Apple and Meta, the CEO says. \"This will help us scale our manufacturing capabilities and research and development,\" Xu told Bloomberg. Thanks to its latest funding round, XReal predicts its production capacity will nearly double within the next two years. This year, the startup is expected to produce an additional 500,000 to 1 million units of its AR devices, and projects to rake in $100 to $150 million in revenue, according to Bloomberg. In 2025, the company expects to generate up to 2 million devices which is projected to translate to $200 to $300 million in revenue. Unlike Apple's Vision Pro, Xu says XReal has no intentions to build a fully immersive virtual reality feature into its glasses. Yet, when it comes to its AR capabilities, Xu says his company's is half a decade ahead of Apple's. After all, Xreal comprised nearly half of the market share for AR devices in the third quarter of last year, according to data from research firm IDC. \"I think we're three to five years ahead of them in AR,\" Chi said in regards to Apple. \"They are catching up, though. So we need to keep up and push the boundary.\" Advertisement "
}