{
    "title": "Iranian iPhone buyers caught up in colossal cheap iPhone scam: Tehran \ncompany may have scooped $35 million ...",
    "date": "2/23/2024",
    "url": "https://www.imore.com/iphone/iran-based-iphone-buyers-caught-up-in-colossal-cheap-iphone-scam-tehran-company-may-have-scooped-dollar35-million-selling-dollar700-iphones-endorsed-by-celebrities-that-were-never-delivered",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. A story of celebrity endorsement, cheap iPhones, and thousands of unhappy customers. If you live in Iran and recently bought an especially cheap iPhone that never arrived, then you too might be the victim of a scam that has cost residents of the country millions of dollars. The Financial Times called the scam a “multi-million-dollar fraud” that saw customers duped by a slick sales pitch, only to never receive the goods that they ordered. It’s led to picketing outside police stations, scrutiny over the kind of services that Iranian celebrities endorse, and “revealed the lengths that its consumers will go to get their hands on the prized mobile device.” When Iranians, particularly young ones, saw the marketing from Kourosh Company, they were hooked. The promise of a cheap iPhone in a country where they’re considered an “American Luxury item” which tends to require not only more work to save up for but also to set up was too much for many to resist, and it’s led to an estimated $35 million being stolen by the Kourosh company. Why were they duped so easily? The man behind the company, Amir Hossein Sharifian, used massive celebrity endorsements, including “Iranian sports figures and other celebrities”. Sucked in by the marketing, buyers waited for the full shipping time to finish — only to end up distinctly iPhone-less. iPhones in Iran are expensive, desirable devices in a country with increasingly diminishing purchasing power. Not only that, but Tehran banned imports of the latest and best iPhone, the iPhone 15 and iPhone 15 Pro, further increasing the iPhone's luster. They are, just as everywhere else in the world, a fashionable item, albeit one that is harder to use as Apple restricts the use of the App Store and Apple IDs. Iranian users get around restrictions with foreign addresses, use gift cards to purchase apps and games, and import banned devices from Middle Eastern countries nearby. It’s this image, and unusual difficulty in procurement, that made the cut-price iPhones so tempting to potential customers — and what made it so easy for Sharifan to steal so much money. Those affected by the scam have picketed the Tehran Police headquarters, demanding action against Sharifan and the Kourosh company. When the Police responded and went to find Sharifan, they discovered that he’d already left the country. Since then, he’s been located and Iranian officials say that he will be “extradited through Interpol”. iMore offers spot-on advice and guidance from our team of experts, with decades of Apple device experience to lean on. Learn more with iMore! As for the celebrity endorsers, they are facing more scrutiny from Iranians. Whether they engaged in a scam knowingly or not is unknown, but there are calls “for them to be held accountable.” Unfortunately, there’s no news on whether the affected customers will be getting their money back from Sharifan. As iMore's Senior Staff writer, Tammy uses her background in audio and Masters in screenwriting to pen engaging product reviews and informative buying guides. The resident audiophile (or audio weirdo), she's got an eye for detail and a love of top-quality sound. Apple is her bread and butter, with attention on HomeKit and Apple iPhone and Mac hardware. You won't find her far away from a keyboard even outside of working at iMore – in her spare time, she spends her free time writing feature-length and TV screenplays. Also known to enjoy driving digital cars around virtual circuits, to varying degrees of success. Just don't ask her about AirPods Max - you probably won't like her answer. New iPhone 16 case leak shows rumored camera redesign with the Apple Vision Pro in mind The iPhone 16 Pro's titanium finish could be getting a shiny upgrade over your old iPhone 15 Pro New Apple Pencil-like patent hints at future Apple Vision Pro virtual pointer capability By Oliver HaslamMarch 28, 2024 By Daryl BaxterMarch 28, 2024 By The GeniusMarch 28, 2024 By Stephen WarwickMarch 28, 2024 By Oliver HaslamMarch 28, 2024 By Oliver HaslamMarch 28, 2024 By Stephen WarwickMarch 28, 2024 By Daryl BaxterMarch 28, 2024 By Becca CaddyMarch 28, 2024 By Oliver HaslamMarch 28, 2024 By Oliver HaslamMarch 28, 2024 iMore is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}