{
    "title": "Some Vision Pro returns due to set-up confusion, analyst says",
    "date": "2/29/2024",
    "url": "https://www.businessinsider.com/apple-vision-pro-returns-set-up-confusion-analyst-2024-2",
    "text": "       Apple says its Vision Pro headset will change how you live and work — but some people are apparently having trouble figuring out how to set up the headset in the first place. A significant percentage of Vision Pro returns are from customers who can't figure out how to operate the headset when they first get it, according to a high-profile analyst who recently said he surveyed the product's repair and refurbishment production line. Ming-Chi Kuo, an analyst who often reports on Apple's supply chain, estimates that 20% to 30% of Apple Vision Pro returns stem from users not knowing how to set up the mixed-reality headset, he wrote Wednesday. Related stories But overall, Kuo says some of Apple's smaller Vision Pro suppliers are expanding production and he estimates the current return rate for the device is less than 1%. It's not clear exactly what could be tripping up some of the new owners during set-up, but the headset is incredibly high-tech and introduces a new control interface that relies on eye and hand tracking for navigation. There are a few steps to setting up the Apple Vision Pro, according to the company's user guide for the device. After you charge and connect the battery and adjust the headset to comfortably fit your face, you can either set it up manually or by using an iPhone with iOS 17 or iPad with iPadOS 17 or later in close proximity. Once there, you'll need to do your eye and hand input setup, sign in with your Apple ID, and learn the gestures you'll use to navigate while using the device. Some users are returning their Vision Pros for other reasons, including gripes with its bulky design, feeling underwhelmed by its pass-through video quality, and questions over whether it's worth the $3,500 price tag. Some diehard fans, meanwhile, likely wouldn't dream of parting with the headset. One tech worker wore the Vision Pro to his wedding, much to his wife's dismay, while some people are going against safety advice from authorities and crossing the street with the headset on or even driving a Tesla Cybertruck while in the device.  Read next Jump to "
}