{
    "title": "Can Nvidia Join Apple, Microsoft In $2-Trillion Club Today? Here's How Much \nThe Stock Needs To Gain To Hi",
    "date": "2/22/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/37255783/can-nvidia-join-apple-microsoft-in-2-trillion-club-today-heres-how-much-the-stock-n",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Nvidia Corp. NVDA shares are soaring in premarket trading on Thursday, fueled by a stellar quarterly performance that exceeded expectations. This strong showing has fueled speculation that the stock could reach the coveted $2 trillion market cap, joining an elite group of tech giants. Rallying From Strength: The stock’s upward trajectory began in early 2023, capitalizing on Nvidia’s early leadership in artificial intelligence (AI) technology. CEO Jensen Huang commented on the company’s performance and outlook, stating, “Accelerated computing and generative AI have hit the tipping point. Demand is surging worldwide across companies, industries and nations.” Price Target Boost: Following the impressive quarterly report, KeyBanc Capital Markets boosted Nvidia’s price target. Analyst John Vinh maintained an Overweight rating and increased the target from $740 to $1,100, representing a significant 49% jump. This new target suggests the stock has roughly 63% upside potential from current levels. Thesis for Growth: Vinh attributed Nvidia’s success to several factors, including strong Data Center revenue driven by major “hyper scalers” like Alphabet (Google), Microsoft, Amazon, Meta, Apple, Alibaba, Baidu, and Huawei. He also highlighted improved chip supply in the quarter. Source: Y Charts See Also: Best Artificial Intelligence Stocks Revenue and Earnings: Nvidia’s first-quarter revenue guidance of $24 billion (plus or minus 2%) exceeded the consensus of $22.2 billion. This translates to an expected earnings per share of $5.41, exceeding the $5 per share consensus. Vinh attributed this strong outlook to surging demand for the H100 platform and InfiniBand, resulting in a 409% year-over-year revenue growth in the Data Center business. Global Reach: All regions except China witnessed strong performance, with the company starting alternative GPU shipments below export thresholds to address the Chinese market. Looking ahead, Vinh expects continued growth in the Data Center and Pro Viz segments, while Gaming revenue might decline compared to the previous quarter. The H200 AI chip is anticipated to ramp up in the second quarter, while initial demand for the B200 AI chip exceeded supply. See Also: How To Buy Nvidia (NVDA) Stock Optimistic Outlook: Vinh expressed enthusiasm for Nvidia’s future, stating, “We’re encouraged by these impressive results. We maintain our Overweight rating and view NVDA as best positioned in the semiconductor industry to benefit from Gen AI.” Reaching $2 Trillion: To reach the $2 trillion market cap, Nvidia’s stock would need to reach $804, given its 2.49 million outstanding shares. This translates to a necessary increase of $129.28, or 19.16%, from Wednesday’s closing price. Currently, only Microsoft, Apple, and Saudi Aramco boast valuations exceeding $2 trillion. Premarket Price Action: In premarket trading on Thursday, the stock already climbed 13.60% to $766.50, according to data from Benzinga Pro. Continued upward movement is likely as analysts adjust their estimates and price targets. See Also: ‘Self-Driving Cars Will Take Time:’ Munster Explains What Nvidia’s Q4 Automotive Revenue Slide Means For Future Of EVs © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}