{
    "title": "iMessage RCS support explained: China requires it",
    "date": "2/19/2024",
    "url": "https://bgr.com/tech/apples-rcs-support-in-messages-might-have-an-explanation-chinese-carriers/",
    "text": "Sign up for our daily newsletter If you buy through a BGR link, we may earn an affiliate commission, helping support our expert product labs. Apple announcing that the iPhone’s Messages app will support RCS was quite a surprise a few months ago. I also thought it was a brilliant thing to do, as Apple practically ended the debate over bubbles. At the time, I thought Apple was simply preparing for the inevitable battles with regulators. The European Union, in particular, has been a nuisance for Apple, pressuring the company to comply with the new Digital Markets Act (DMA) rules. iMessage is not part of that for the moment, but things could always change in the future. It turns out that Apple might have responded to pressures from third parties. Only it wasn’t EU lawmakers that convinced the company to add RCS support to the Messages app, in addition to iMessage and SMS. It might be Chinese carriers that requested the feature. The tidbit comes from John Gruber, who has learned from his sources that “Apple’s hand was effectively forced. But it was China instead of the EU that did it:” Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. But then why did Apple do a 180° turn on RCS? I can’t say for certain, alas, but after spending the last few months periodically poking around the trees inhabited by little birdies, I do have good news for fans of coercive government regulation. Apple’s hand was effectively forced. But by China, not the EU. Chinese carriers have been proponents of RCS for years, and last year, the Chinese government began the process of codifying into law that to achieve certification, new 5G devices will be required to support RCS. (Here’s a good English translation on Reddit of the parts relevant to Apple.) Shockingly, the Chinese government seemingly isn’t concerned that the RCS standard has no provisions for encryption. The little birdies I’ve spoken to all said the same thing: iOS support for RCS is all about China. China is one of Apple’s most important markets. It’s also a market that often imposes strict measures, including the censoring of apps and services. China is also the market where Apple assembles most of its products, including the iPhone. But Apple has been trying to move some of those lines to other countries, with India being a growing manufacturing hub for the iPhone. So when China has requests for Apple, the iPhone maker usually complies. “When the CCP says device makers must jump to sell their products in China, Apple asks ‘How high?'” Gruber notes. I’ll also remind you that Apple will support the RCS standard in iMessage not the encrypted version that Google has delivered. That’s the GSMA standard that carriers use. RCS might get encryption down the road on iPhone, but nothing is certain for now. That said, it’s unclear when RCS will roll out to iPhone. iOS 18 looks like the most likely upgrade to enable RCS on iPhone. We’ll learn more about the iPhone’s next-gen operating system in June at WWDC 2024. Chris Smith has been covering consumer electronics ever since the iPhone revolutionized the industry in 2008. When he’s not writing about the most recent tech news for BGR, he brings his entertainment expertise to Marvel’s Cinematic Universe and other blockbuster franchises. Outside of work, you’ll catch him streaming almost every new movie and TV show release as soon as it's available. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. BGR’s audience craves our industry-leading insights on the latest in tech and entertainment, as well as our authoritative and expansive reviews. We guide our loyal readers to some of the best products, latest trends, and most engaging stories with non-stop coverage, available across all major news platforms. Founded in 2006 Over 2 billion visitors 100K+ articles published Millions of readers helped Honest news coverage, reviews, and opinions since 2006. -\n\t\t\t\t\t\tJonathan S. Geller, Founder BGR is a part of Penske Media Corporation.\n© 2024 BGR Media, LLC. All Rights Reserved. "
}