{
    "title": "How To Accept Apple Pay In 2024 – Forbes Advisor",
    "date": "2/11/2024",
    "url": "https://www.forbes.com/advisor/business/how-accept-apple-pay/",
    "text": "You might be using an unsupported or outdated browser. To get the best possible experience please use the latest version of Chrome, Firefox, Safari, or Microsoft Edge to view this website. Reviewed Reviewed Updated: Feb 11, 2024, 5:39pm Apple Pay is a mobile payment service that allows customers to pay for goods and services with their phone. It uses near-field communication (NFC) to securely transmit payment tokens from a linked credit card or Apple Cash account data. It’s a win-win situation for both parties thanks to the reduced chances of fraud, and businesses in particular can benefit from speedier transactions. Featured Partners 1 Stax No From $99 First Month Free 1 Stax On Stax's Website 2 Payment Depot No Starting at $79 Free Terminal 2 Payment Depot On Payment Depot's Website 3 MerchantOne No $0 Set up fee $6.95 per month, 0.29% to 1.99% per transaction 3 MerchantOne On MerchantOne's Website You can learn how to accept Apple Pay at your business in four simple steps. A payment processor is an essential tool for ensuring credit card transactions go through. You’ll need one whether you run a brick-and-mortar or e-commerce store. It acts as a middleman between the customer’s credit card issuer, the customer’s bank and your bank to validate the transaction and transfer funds. Apple Pay has a list of recommended payment service providers, but we’ve compiled our top picks here as well. Most modern options should play nice with Apple Pay, but it’s always best to confirm. If you’d like to accept Apple Pay in person, the next step is to find a point-of-sale (POS) system with NFC technology. This is how Apple Pay securely transmits payment tokens to keep transactions secure. Depending on the payment processor you choose, you may be able to order a POS terminal from it as well. This might help simplify your transactions and streamline your monthly costs. It could also be possible to simply order an NFC reader rather than an entirely new terminal—this is usually more cost-efficient. For more advice on choosing a POS system, check out our top picks for small businesses and restaurants. If your goal is to accept Apple Pay online, you have a couple of options. The easiest one is to use an e-commerce platform that offers support for Apple Pay, such as these ones recommended by Apple: All of these platforms have slightly different instructions for how to accept Apple Pay, so check their individual documentation. If you’re a bit more technologically inclined, you also have the option of adding an Apple Pay SDK or JavaScript API to your site directly. However, this is likely best left to developers who know how to navigate a back end. For online transactions, when it’s time for a customer to pay, they’ll see a “Buy with Apple Pay” button. After clicking this, they’ll then need to verify the purchase with their Face ID, Touch ID or passcode to complete payment. This is what a customer will see in your online store when they’re ready to use Apple Pay. Once you have your payment processor and terminal or platform that accepts Apple Pay, that’s it! You’ll be ready to accept contactless payments. There’s no need to create an account or sign up with Apple. However, you need to let your customers know you take Apple Pay. One way to do that is by putting a sticker or placard at checkout with the Apple Pay logo. Many customers also recognize NFC readers and will know how to use them. If the upfront costs of buying new readers or terminals won’t work for you right now, you may be able to accept Apple Pay payments right on your iPhone with Tap to Pay. This service uses your phone’s built-in NFC reader to capture credit card information or receive payment tokens from a customer’s Apply Pay account. When ringing up a customer’s purchase on your phone, Tap to Pay displays the total, along with where the customer needs to put their phone to use Apple Pay. Currently, this is a newer product, so functionality is limited to Stripe, Square and Adyen payment service providers. But using it is as simple as downloading one of these companies’ payment apps and configuring it on your device. One great benefit of using Apple Pay is that it doesn’t cost business owners anything extra. Payment processors consider it a normal credit card transaction, so you’ll only pay regular card processing fees. The only upfront cost involved might be upgrading your POS terminal. Here’s a closer look at what it might look like to set up Apple Pay from scratch with two popular POS terminals, Square and Clover:  Apple has also partnered with Square to create an NFC reader that connects directly to your phone so you can take payments on the go. This currently costs $49.99 with fees of 2.6% plus 10 cents per transaction. Featured Partners 1 Stax No From $99 First Month Free 1 Stax On Stax's Website 2 Payment Depot No Starting at $79 Free Terminal 2 Payment Depot On Payment Depot's Website 3 MerchantOne No $0 Set up fee $6.95 per month, 0.29% to 1.99% per transaction 3 MerchantOne On MerchantOne's Website Accepting Apple Pay can have huge benefits for your business, including faster transaction times, more secure transactions and no additional fees. However, you may need to upgrade your POS system to get it to work. Still, considering there are 507 million Apple Pay users worldwide, it makes sense to invest in this technology so you aren’t falling behind on trends. It’s free to use Apple Pay. However, you still need to pay typical card processing fees. See our guide on credit card processing fees to get a better estimate of what this will cost you. Apple Cash is a digital credit card that lives in your Apple Wallet. Apple Pay, on the other hand, is a contactless payment technology that lets you use Apple Cash or any other card in your Wallet to pay for goods and services. Learn more about the differences between the two services. Apple Pay can help reduce transaction times for businesses. It also offers a more secure transaction that eliminates fraud risks. However, if you’re running an older POS system, you’ll have to upgrade to something newer. Additionally, it might be confusing to set up Apple Pay if you’re used to traditional payments. Besides mobile credit card readers, other types of POS systems that you can use include full-service terminals, cloud-based POS systems and web-based POS systems. Full-service terminals are the most expensive type of restaurant POS system. Typically, they’re used by large restaurants with multiple locations. Cloud-based POS systems are less expensive than full-service terminals, and they’re often used by smaller restaurants.  Kristy Snyder is a freelance writer and editor with 12 years of experience, currently contributing to the Forbes Advisor Small Business vertical. She uses her experience managing her own successful small business to write articles about software, small business tools, loans, credit cards and online banking. Kristy's work also appears in Newsweek and Fortune, focusing on personal finance. "
}