{
    "title": "Apple Foldable iPhone Likely To Launch in 2026, Company Working on Device \nSimilar to Samsung Galaxy Z-Flip:",
    "date": "2/8/2024",
    "url": "https://www.latestly.com/technology/apple-foldable-iphone-likely-to-launch-in-2026-company-working-on-device-similar-to-samsung-galaxy-z-flip-reports-5745715.html",
    "text": "Mumbai, February 8:  Apple is rumoured to launch its iPhone 16 powered by the latest powerful A18 chipset with significant design changes, including a bigger display, battery, camera module and AI features. Apple CEO Tim Cook confirmed to be working on artificial intelligence and will unveil it in 2024. Amid these ongoing developments, reports have surfaced saying Apple foldable smartphones are in development phase. Apple iPhones have followed a different path than the other smartphone brands by introducing their design, operating system and other features. The tech giant stepped up the game in terms of many new features and introduced cutting-edge innovations to the smartphone. However, the company needs to catch up regarding AI-powered features and foldable smartphone technology. OpenAI To Add Watermark to AI-Generated Using 'DALL-E 3 Model', Will Adopt 'C2PA Technical Standard' Amid Growing Concerns of Misusing Information Ahead of Election. According to the report by Hindustan Times Tech, Apple is speeding up its process of developing foldable iPhones in the market, which will likely be launched in 2026. The report said that top brands like Samsung, Google, OPPO and others have already introduced their foldable smartphones in the market, but Apple has yet to delay its entry. The report mentioned that it is rumoured that the tech giant is developing prototypes for its upcoming foldable iPhones. First reported by the Information, Apple is developing two prototypes for its foldable iPhones, which may be launched in 2026. Other reports say that foldable Apple smartphones will be like Galaxy Z-Flip. The company could unveil the device early during its launch events or tease it early this or next year. The device's screen size is expected to be 8-inch just like Apple's iPad Mini. Meta Expands ‘Take It Down’ Programme to More Countries and Languages To Help Millions of Teens Combat Sextortion. According to other reports, the new foldable smartphone from Apple could have the ability to stand and take pictures at a 90-degree angle when unfolded. The reports also said that Apple CEO Tim Cook approached Apple engineers to make a foldable smartphone as early as 2018, but unfortunately, the work was stopped in 2020. The reports said the iPhone foldable will be as thin as the flat models, but the engineers need help with the design. So far, there is little information about the upcoming foldable iPhone models. (The above story first appeared on LatestLY on Feb 08, 2024 12:07 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com). Copyright © Latestly.com All Rights Reserved. "
}