{
    "title": null,
    "date": "2/24/2024",
    "url": "https://wccftech.com/apple-oled-roadmap-for-ipad-and-macbooks/",
    "text": "In the coming years, Apple will gradually switch its entire product line from LCD and mini-LED displays to OLED displays. The company's transition will potentially begin next month with the launch of the new iPad Pro models. A new report shares details on Apple's transition plans for its entire product line. The report also mentions a 20.3-inch foldable device from Apple which will potentially launch in 2027, alongside upcoming OLED iPad Pro models. It was recently covered that Apple is relying on Samsung and LG to supply OLED panels for the upcoming iPad Pro models. LG will produce 13-inch panels, and Samsung will initially cater to provide 11-inch OLED panels. However, the company has plans to transition its entire product line to OLED panels. Currently, only the iPhone and Apple Watch feature an OLED display, and by the end of next month, the iPad will jump on the bandwagon as well. Note that Apple is only looking to upgrade the iPad Pro models with an OLED display. The rest of the iPad lineup, including the iPad Air, iPad mini, and the entry-level iPad, will continue to feature an LCD. According to the OLED roadmap shared by Omdia, the iPad Air is slated to be upgraded with an OLED display in 2026, and the iPad mini will launch with an OLED display in 2027. The report also highlights Apple's OLED transition for MacBook models. The chart highlights that the MacBook Air will launch with an OLD display in 2027 while the 'Pro' models will rock the display a year earlier. However, the roadmap also includes an unnamed device featuring a foldable OLED display. The device is slated to launch in 2027, and we suspect it will be the company's first foldable iPad. It was recently reported that Apple is working on a foldable device, but it will not be an iPhone. The report from The Elec specifically states that the company is working on a \"larger device\" instead of an iPhone. It was also previously rumored that the iPad mini would be the first to receive the foldable treatment. However, these are mere speculations at this stage, as the final word rests with Apple. Instead of upgrading its existing product lineup with a foldable display, the company could introduce an entirely new product category. However, it is too early to conclude as the devices are slated to launch in the next few years. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}