{
    "title": null,
    "date": "2/4/2024",
    "url": "https://www.india.com/technology/apple-decides-not-to-license-masimos-patents-despite-watch-import-ban-6702966/",
    "text": "click this icon for latest updates  Updated: February 5, 2024 8:30 AM IST By India.com News Desk \n\n\n\n\n\n | Edited by  Abhijay Singh Rawat New Delhi: American smartphone giant Apple has been involved in a patent dispute with Masimo, a healthcare company, over the blood oxygen detection function in the Apple Watch. This dispute led to an import ban on certain Apple Watch models in the US. Despite the ban, Apple CEO Tim Cook has stated that the company has no intention to licence Masimo’s blood oxygen detection to end the import ban. Cook mentioned that the company is focused on appeals and that there are several other reasons to buy the watch, even without the blood oxygen sensor. The ban affects the Apple Watch Series 9 and Apple Watch Ultra 2, with the blood oxygen sensor being disabled via software in the models sold after the ban was imposed. However, the models sold before the ban still have functional blood oxygen detection. It is likely that Apple might add the blood oxygen detection function back using a software update if and when the import ban ends.  \n\nApple Masimo Patent DisputeMasimo has expressed its willingness to settle with Apple, and the sales of the affected Apple Watch models have resumed without the blood oxygen features amid the patent infringement dispute. Apple’s appeal is ongoing, and the company is taking steps to comply with the ruling while ensuring customers have access to the Apple Watch with limited disruption.The dispute arose after the United States International Trade Commission (USITC) ordered a ban on some Apple Watch imports into the US, ruling that Apple violated Masimo patents related to non-invasive blood oxygen sensing. Apple has been working on a software fix to address the issue, but Masimo believes that a hardware change is necessary to address the patent violations.  As a result of this dispute, the ability to measure blood oxygen is no longer available on Apple Watch units sold by Apple in the US on or after January 18, 2024. The Blood Oxygen app on these watches will occasionally measure blood oxygen levels if the feature was available before the ban.\n\n \n\nWhat Is Masimo’s Blood Oxygen Detection?Masimo’s blood oxygen detection function is a key feature of its pulse oximetry technology, which is used to measure the oxygen saturation (SpO2) in the blood. Masimo’s SET® (Signal Extraction Technology) is designed to identify the venous blood signal, isolate it, and use adaptive filters to extract the arterial blood signal, providing accurate and reliable oxygen saturation readings, even during challenging conditions of motion and low perfusion. This technology is used in various products, including the Masimo W1 Sport wearable, which offers accurate and continuous health data, including oxygen levels in the blood, for consumers interested in monitoring their health and fitness. The company’s pulse oximetry technology is also widely used in hospitals and has been shown to outperform other pulse oximetry technologies in various studies. Masimo’s blood oxygen detection function is a key feature of its pulse oximetry technology, which is used to measure the oxygen saturation (SpO2) in the blood. is technology is used in various products, including the Masimo W1 Sport wearable, which offers accurate and continuous health data, which due to patent rights is under   Masimo has expressed its willingness to settle with Apple, and the sales of the affected Apple Watch models have resumed without the blood oxygen features amid the patent infringement dispute. Apple’s appeal is ongoing, and the company is taking steps to comply with the ruling while ensuring customers have access to the Apple Watch with limited disruption.The dispute arose after the United States International Trade Commission (USITC) ordered a ban on some Apple Watch imports into the US, ruling that Apple violated Masimo patents related to non-invasive blood oxygen sensing. Apple has been working on a software fix to address the issue, but Masimo believes that a hardware change is necessary to address the patent violations. As a result of this dispute, the ability to measure blood oxygen is no longer available on Apple Watch units sold by Apple in the US on or after January 18, 2024. The Blood Oxygen app on these watches will occasionally measure blood oxygen levels if the feature was available before the ban.  Masimo’s blood oxygen detection function is a key feature of its pulse oximetry technology, which is used to measure the oxygen saturation (SpO2) in the blood. Masimo’s SET® (Signal Extraction Technology) is designed to identify the venous blood signal, isolate it, and use adaptive filters to extract the arterial blood signal, providing accurate and reliable oxygen saturation readings, even during challenging conditions of motion and low perfusion. This technology is used in various products, including the Masimo W1 Sport wearable, which offers accurate and continuous health data, including oxygen levels in the blood, for consumers interested in monitoring their health and fitness. The company’s pulse oximetry technology is also widely used in hospitals and has been shown to outperform other pulse oximetry technologies in various studies. Masimo’s blood oxygen detection function is a key feature of its pulse oximetry technology, which is used to measure the oxygen saturation (SpO2) in the blood. is technology is used in various products, including the Masimo W1 Sport wearable, which offers accurate and continuous health data, which due to patent rights is under For breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram. Read more on Latest\n                        Technology News on India.com. Samsung Galaxy S23 Price Drop: Now Available For Rs 60649 With THIS Special Offer; Check DEETS Tecno POVA 6 Pro Launched With 6000 mAh Battery, 120 Hz AMOLED Display, More At THIS Price WhatsApp Will Soon Get Suggestion For Contacts To Chat With; Know More Details On The Update Here iQOO Z9 5G Review: Better Than Honor X9B & Nothing Phone 2A? Realme Narzo 70 Pro 5G Now At A Special Price With Amazon Sale; Here's How To Avail Discount Offer Apple Coconut Salad is the Perfect Breakfast Choice Tim Cook Extends Holi Wishes With Colourful Picture Shot On iPhone Google CEO Sundar Pichai & Apple CEO Tim Cook’s Photo At A Restaurant Goes Viral; Check Hilarious Reactions 'Creating Social Stigma': US Sues Apple For 'Monopolising And Crushing Competition' In Smartphone Market Apple iPhone 15, iPad, MacBook Prices Drop: Avail These Special Discount Offers On Vijay Sales By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts Cookies Policy. "
}