{
    "title": "Forget Apple Stock: Buy This Growth Monster Instead",
    "date": "2/5/2024",
    "url": "https://www.fool.ca/2024/02/05/forget-apple-stock-buy-this-growth-monster-instead/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. Apple stock (NASDAQ:AAPL) fell after seeing Chinese sales drop 13% during the quarter, so perhaps consider this other tech stock instead! Image source: Getty Images Apple (NASDAQ:AAPL) shares fell pretty dramatically last week after Apple stock came out with earnings results that showed weak China sales performance. The tech giant remains in the trillion-dollar market cap range at US$2.8-trillion as of writing, but the recent announcement brought shares down by 8% from 52-week highs. So is this your opportunity to get in? Perhaps, but for now I might consider this other growth stock instead. Investors really cared about China sales during Apple stock’s recent release. China is the company’s third-largest market, and one that continues to pose challenges with so many Chinese companies continuing to create competition. Add in cautious consumer spending and an economic slowdown, and Apple stock saw sales drop 13% in the quarter. This missed estimates of US$23.5 billion, bringing it down to US$20.8 billion instead. Shares dropped 3% after the news, and continued to fall on Friday as well. All this adds to the mounting pressure that Apple experiences in the world’s largest smartphone market. Especially as Huawei continues its comeback with high-end smartphones. But Huawei wasn’t alone, with other Android brands also edging in on Apple stock’s market. What some analysts have identified as Apple stock’s issue is providing that “wow” factor. Not just in China, but elsewhere as well. There has been a lack of innovation when it comes to the company’s design aesthetic compared to others in recent years. That’s especially the case when it comes to integrating artificial intelligence (AI) into these smartphones, something Android is already doing. While Apple stock hinted at AI news later this year, it hasn’t happened yet. So for now, it might be time to look at other companies that are producing strong results, seeing shares climb instead of drop – ones with recurring revenue, rather than depending on consumer products that lack innovation. One option that investors may want to consider is OpenText (TSX:OTEX), after the cloud company delivered strong second quarter results last week. While the tech stock missed its earnings before interest, taxes, depreciation and amortization (EBITDA) margin estimates, it was still a solid quarter. Shares dropped 7% after the news, but are still up 26% in the last year alone. Revenue rose 71% year over year, beating out estimates, driven by a 58% rise in annual recurring revenue. OpenText continues to see strong deals and cloud bookings moving the company forward. In fact, it managed to increase its full-year cloud bookings guide as well. While full-year guidance remained largely unchanged, that guidance is certainly good enough for investors to consider the stock. Its acquisition of Micro Focus was a solid move, and the sale of its non-core assets provide a stronger portfolio. What investors are still waiting on, however, is getting that full integration of Micro Focus up and running. However, once it does, there is a lot for shareholders to look forward to in terms of growth through to 2025. So with shares offering recurring revenue, stable growth, and value with shares trading at 2.4 times sales, it looks like a great time to get into OpenText stock. Even over the Magnificent Seven Apple stock. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 29, 2024 |\n        Puja Tayal Have you given a thought to how you plan to retire? Your decision depends significantly on how much your investments… Read more » March 29, 2024 |\n        Andrew Button AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. Read more » March 29, 2024 |\n        Andrew Button Hot AI stocks like Open Text Corp (TSX:OTEX) have been rallying lately. Read more » March 29, 2024 |\n        Amy Legate-Wolfe Hut stock (TSX:HUT) surged by 23% after the company reported strong earnings, and even more growth occurred in 2024. Read more » March 28, 2024 |\n        Puja Tayal Nvidia stock has made investors millionaires in the last 10 years. Is it too late to invest to become a… Read more » March 28, 2024 |\n        Chris MacDonald There are plenty of growth stocks in the market worth considering, but Shopify (TSX:SHOP) looks like one of the best… Read more » March 28, 2024 |\n        Puja Tayal The TSX has been favouring tech stocks, but not this one. However, it has the potential to trounce the market… Read more » March 27, 2024 |\n        Rajiv Nanjapla These three under-$20 stocks offer excellent buying opportunities for long-term investors. Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. ©  2024 The Motley Fool Canada, ULC. All rights reserved. "
}