{
    "title": "5 reasons why investors should stay bullish on Apple stock despite its \nrecent sell-off, according to Wedbush",
    "date": "3/6/2024",
    "url": "https://www.businessinsider.in/stock-market/news/5-reasons-why-investors-should-stay-bullish-on-apple-stock-despite-its-recent-sell-off-according-to-wedbush/articleshow/108247065.cms",
    "text": "Liked the article? Share it with your friends... or copy link It's been a tough go of it for shares of Apple in 2024, but Wedbush analyst Dan Ives says there are at least five reasons why investors should remain bullish on the iPhone maker. Shares of Apple have declined by about 12% so far this year. The stock dropped 3% on Tuesday after a research report from Counterpoint said that iPhone sales dropped 24% in China during the first six months of the year. Ives said that his recent travels to Asia confirmed likely weakness in iPhone 15 sales, evidenced by extra discounting for the phone. It also doesn't help that Apple has some tough comparables for iPhone sales in China over the next two quarters. \"Overall flattish iPhone numbers remain the target for the year with the March quarter expected to have some very tough comps from the China region,\" Ives said in a Tuesday note. But Ives' continued bullishness on Apple is driven by these five factors, according to the note. 1. \"Current iPhone estimates for 2024 remain hittable with 2025 street estimates conservative.\" 2. \"Pent up demand around an upgrade cycle could exceed 270 million iPhones heading into iPhone 16.\" 3. \"Services remains rock solid with double digit growth and a key to the valuation support.\" 4. \"AI is finally coming to Apple in the form of new App Store enhancements and built into iPhone 16 based on our work in the field.\" 5. \"Apple has the strongest installed base of any company in the world with 2.2 billion iOS devices and the next phase of monetization is on the horizon.\" \"In a nutshell, right now the data points are not roses and rainbows for Apple and headline risk remains in the name. However, our view is all about navigating this next 1-2 quarters and getting on to the other side of easier comps, AI announcement at WWDC, stronger upgrade cycle for iPhone 16, and the monetization opportunity of the golden installed base in Cupertino,\" Ives said. \"Brighter days will be ahead for Apple although right now the China story remains the dark cloud over the name in the near-term.\" Ives reiterated his \"Outperform\" rating and $250 price target, which represents potential upside of 47% from current levels. Advertisement "
}