{
    "title": "Apple Blamed For Amazon, Microsoft, And HTC's Smartphone Flops In DOJ's \nLatest Lawsuit Against iPhone-Mak",
    "date": "3/21/2024",
    "url": "https://www.benzinga.com/news/24/03/37884855/apple-blamed-for-amazon-microsoft-and-htcs-smartphone-flops-in-dojs-latest-lawsuit-against-iphone-ma",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW On Thursday, the Department of Justice filed a lawsuit against Apple Inc. AAPL blaming iPhone-maker for the lack of success of major companies like Amazon.com, Inc. AMZN, Microsoft Corporation MSFT and HTC Corporation. What Happened: On Thursday, Bloomberg columnist Mark Gurman posted a screenshot from the DOJ lawsuit against Apple on X, formerly Twitter, and said, \"The DOJ is blaming Apple for the Amazon Fire phone failing.\" The screenshot showed the DOJ accusing Apple: “Many prominent, well-financed companies have tried and failed to successfully enter the relevant markets because of these entry barriers. Past failures include Amazon (which released its Fire mobile phone in 2014 but could not profitably sustain its business and exited the following year); Microsoft (which discontinued its mobile business in 2017) and HTC…\" See Also: Apple’s Senior VP Shares His Top 3 iPhones — And The Answer May Not Be What You Guessed The Cupertino, California-based tech giant previously responded to the lawsuit, saying that it threatened its core principles and ability to innovate. \"If successful, it would hinder our ability to create the kind of technology people expect from Apple—where hardware, software, and services intersect,” the company told Benzinga in an emailed statement, adding, \"It would also set a dangerous precedent, empowering government to take a heavy hand in designing people’s technology.\" Subscribe to the Benzinga Tech Trends newsletter to get all the latest tech developments delivered to your inbox. The latest lawsuit filed by the DOJ is the third antitrust case against Apple in the last 14 years. However, this is the first time the DOJ is accusing Apple of illegally maintaining its dominant position in the phone market. Why It's Important: Deepwater Asset Management's managing partner Gene Munster has also addressed the concerns surrounding the lawsuit saying the case is \"going to prove to be noise.\" He said, \"Consumers just want the best tech for the money, and Apple [delivers] that today and will in three years,\" adding, \"Yes, Apple will likely be forced [to] make some small changes to ‘delight' the regulators, but those tweaks won’t change the loyalty the company has from its 1.4B and growing customer base.\" Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Apple Quietly Unveils New Multimodal AI With A Staggering 30B Parameters: Could It Power Text And Vision Features On iPhones? © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}