{
    "title": "Why I don't believe Warren Buffett sold Apple shares in Q4 2023",
    "date": "3/2/2024",
    "url": "https://www.fool.co.uk/2024/03/02/why-i-dont-believe-warren-buffett-sold-apple-shares/",
    "text": "A recent filing from Berkshire Hathaway indicates that Warren Buffett made a surprising move in the stock market. But Stephen Wright thinks otherwise. Image source: The Motley Fool When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More. Did Warren Buffett sell 10,000,382 shares in Apple (NASDAQ:AAPL) at the end of last year? It’s a nice headline, but I don’t think it’s actually the case. Berkshire Hathaway reported a reduction in its Apple stake at the end of 2023, but when Buffett sold the stock in 2020, he later admitted it was “probably a mistake“. I think there’s a better explanation. One of Berkshire Hathaway’s subsidiaries is General Reinsurance (Gen Re). And within Gen Re is a company called New England Asset Management (NEAM). Until last year, Gen Re’s stock investments were reported by NEAM, which files its own quarterly reports. As of May 2023 though, these have been part of the Berkshire update. As part of that move, around 20,424,207 shares appeared on Berkshire’s filing in May. But these were owned by Gen Re, not (directly) by Berkshire itself. Importantly, the Gen Re portfolio isn’t run by Buffett. So the moves made in that part of the company might not represent the Oracle of Omaha’s latest thoughts. My guess is that the 10,000,382 shares that were sold came out of Gen Re’s portfolio – and therefore weren’t sold by Buffett. And this probably isn’t the first time something like this has happened. Over the last few years, NEAM (which included Gen Re at the time) has reported several moves that would have been surprising for Berkshire. These include: That’s not to say these are bad ideas – different tax implications might well be significant. But it’s fair to say not every move made by a Berkshire subsidiary is signed off by Buffett. I suspect Berkshire’s recent sale of Apple stock is a move like this. I can’t know for certain, but I’d guess the 10,000,382 shares the company sold came from the 20,427,207 it inherited last year. Like Buffett, I own Apple shares in my portfolio. And with the price having fallen back to its December 2021 levels, might there be a further buying opportunity for me here? There are a few reasons why there might be, the most notable of which is difficulties in China, where revenues fell 13% during the last quarter. This is a risk both from a sales and a manufacturing perspective. Strong growth in the company’s services division is boosting profitability through higher margins though. And the emergence of India helps reduce Apple’s risk both in production and sales growth. With the stock at $182, it’s firmly on my list to keep an eye on. A retreat to $160 might well see me adding to my existing investment in the company. Apple accounts for around 50% of Berkshire Hathaway’s total stock portfolio. And I think the recent reduction is likely to have been a Gen Re sale, not a Buffett one. I own both stocks in my portfolio. I’m intending to keep them for many years to come, and keeping an eye out for buying opportunities in either.  Should you invest, the value of your investment may rise or fall and your capital is at risk. Before investing, your individual circumstances should be assessed. Consider taking independent financial advice. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Stephen Wright has positions in Apple and Berkshire Hathaway. The Motley Fool UK has recommended Alphabet and Apple. Views expressed on the companies mentioned in this article are those of the writer and therefore may differ from the official recommendations we make in our subscription services such as Share Advisor, Hidden Winners and Pro. Here at The Motley Fool we believe that considering a diverse range of insights makes us better investors. 30 March, 2024 |\n        Kevin Godbold With a chunky dividend yield and exciting expansion prospects, this FTSE 250 company is powering ahead on a wave of… Read more » 30 March, 2024 |\n        Charlie Keough This Fool has targeted these two cheap FTSE 100 stocks as shrewd buys in April. Here, he explains why he… Read more » 30 March, 2024 |\n        Christopher Ruane Christopher Ruane explains a handful of techniques employed by Warren Buffett when finding shares to buy that he hopes could… Read more » 30 March, 2024 |\n        Ben McPoland This investor takes a look at how much he'd need to invest in Tesco stock to aim for a four-digit… Read more » 30 March, 2024 |\n        Mark Rogers We believe the UK small-cap market offers a myriad of opportunities across a wide range of different businesses and industries. Read more » 30 March, 2024 |\n        Alan Oscroft The Vodafone share price has lost half its value in the past five years. I think it might be on… Read more » 30 March, 2024 |\n        Charlie Keough This Fool plans to start generating passive income for his retirement today. With a £10,000 lump sum, here's how he'd… Read more » 30 March, 2024 |\n        Christopher Ruane Our writer identifies a well-known FTSE 100 firm with an 8% dividend yield he’s been eyeing as an addition for… Read more » View All When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. Tax treatment depends on your individual circumstances and may be subject to future change. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. Tax Year Ends 5 April 2024 Shelter up to £20,000 from the Taxman this tax year in a Stocks and Shares ISA, and you’ll pay no UK income tax or capital gains on potential profits! We’ve made it easy to compare Stocks and Shares ISAs, so you can find an account that’s a great fit for your needs. Whether you’re shopping for a trading account with all the whistles and bells, or seeking a simple, ready-made portfolio solution, we’ve got it covered. Investments involve various risks, and you may get back less than you put in. Tax benefits depend on individual circumstances and tax rules, which could change. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. Read more about us >  We have taken reasonable steps to ensure that any information provided by The Motley Fool Ltd, is accurate at the time of publishing. Any opinions expressed are the opinions of the authors only. The content provided has not taken into account the particular circumstances of any specific individual or group of individuals and does not constitute personal advice or a personal recommendation. No content should be relied upon as constituting personal advice or a personal recommendation, when making your decisions. If you require any personal advice or recommendations, please speak to an independent qualified financial adviser. No liability is accepted by the author, The Motley Fool Ltd or Richdale Brokers and Financial Services Ltd for any loss or detriment experienced by any individual from any decision, whether consequent to, or in any way related to the content provided by The Motley Fool Ltd; the provision of which is an unregulated activity. The value of stocks, shares and any dividend income may fall as well as rise and is not guaranteed, so you may get back less than you invested. You should not invest any money you cannot afford to lose, and you should not rely on any dividend income to meet your living expenses. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, administrative costs, withholding taxes and different accounting and reporting standards. They may have other tax implications, and may not provide the same, or any, regulatory protection. Exchange rate charges may adversely affect the value of shares in sterling terms, and you could lose money in sterling even if the stock price rises in the currency of origin. Any performance statistics that do not adjust for exchange rate changes are likely to result in an inaccurate portrayal of real returns for sterling-based investors. Fool and The Motley Fool are both trading names of The Motley Fool Ltd. The Motley Fool Ltd is an appointed representative of Richdale Brokers & Financial Services Ltd who are authorised and regulated by the Financial Conduct Authority (FCA) (FRN: 422737). We publish information, opinion and commentary about consumer credit products, loans, mortgages, insurance, savings and investment products and services, including those of our affiliate partners. The Motley Fool Ltd. Registered Office: 5 New Street Square, London EC4A 3TW. | Registered in England & Wales. Company No: 3736872. VAT Number: 188035783. © 1998 – 2024 The Motley Fool. All rights reserved. The Motley Fool, Fool, and the Fool logo are registered trademarks of The Motley Fool Holdings Inc. "
}