{
    "title": "Apple acquires Canadian AI start-up DarwinAI: What may change for iPhone \nusers",
    "date": "3/24/2024",
    "url": "https://www.hindustantimes.com/business/apple-acquires-canadian-ai-start-up-darwinai-what-may-change-for-iphone-users-101711332394955.html",
    "text": "Subscribe Now! Get features like Apple ramped up its AI plans by buying Canadian startup DarwinAI just months before the release of the iPhone maker’s iOS 18 software. The company bought DarwinAI earlier this year and the firm’s employees have joined the iPhone maker’s AI division, Bloomberg reported citing “people with knowledge of the matter, who asked not to be identified because the deal hasn’t been announced.” DarwinAI makes technology that can “inspect components during the manufacturing process\", the report said, adding that the company has also developed tech that can make AI systems smaller and faster. “That could be helpful to Apple, which is focused on running AI on devices rather than entirely in the cloud,” it explained. Additionally, DarwinAI deal also gives Apple some very able staff to help develop AI as iOS 18 takes shape including Alexander Wong- “an AI researcher at the University of Waterloo who helped build the business\"- as per Bloomberg. Earlier Bloomberg Apple commentator Mark Gurman wrote in his Power On newsletter that iOS 18 is “seen within the company as one of the biggest iOS updates—if not the biggest—in the company’s history\" after Apple CEO Tim Cook recently told shareholders that the firm will “break new ground” in AI in 2024. With Apple’s purchase of DarwinAI, iOS is going to be game-changing for iPhone. As privacy remains at the core of Apple, iOS 18 could have accompanying AI features to come with stringent controls that users can take advantage of. Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}