{
    "title": null,
    "date": "3/20/2024",
    "url": "https://au.news.yahoo.com/proposed-class-action-lawsuit-alleges-232334212.html",
    "text": "Apple faces a proposed class action lawsuit alleging the company holds an illegal monopoly over digital storage for its customers. The suit, filed Friday, claims “surgical” restraints prevent customers from effectively using any service except its iCloud storage system. iCloud is the only service that can host certain data from the company’s phones, tablets and computers, including application data and device settings. Plaintiffs allege the practice has “unlawfully ‘tied’” the devices and iCloud together. “Apple’s arbitrary prohibition on hosting Restricted Files fundamentally distorts the competitive landscape to privilege iCloud over all rivals,” the suit reads. “As a result of this restraint, would-be cloud competitors are unable to offer Apple’s device holders a full-service cloud-storage solution, or even a pale comparison.” iCloud enjoys about 70 percent market share in cloud storage for Apple users, according to the suit. Plaintiffs also noted that the high market share has allowed prices to skyrocket, marking it “undisciplined by competition.” “Apple has marked up its iCloud prices to the point where the service is generating almost pure profit. Apple’s ability to sustain these prices is a testament to its monopoly power,” the suit said. The plaintiffs propose a class action suit with tens of millions of members, all iCloud platform users. The Hill has reached out to Apple for comment. For the latest news, weather, sports, and streaming video, head to The Hill. Three million dollars sounds like the kind of money that lets you spend retirement sitting on the dock of your own boat, sipping mai tais (or coffee, if that's more of your thing). But a $3 million... At 53, Guan Junling is too old to get hired at factories anymore.  Toiling in sweatshops and building apartment complexes they could never afford to live in, they played a vital role in China's transformation into an economic powerhouse.  As they grow older, the first generation of migrant workers is struggling to find jobs in a slowing economy. IBKR EventTrader - A new, straightforward way to trade CME futures markets A court in Minnesota has ordered MyPillow to be evicted from the warehouse it formerly used. MyPillow founder, Mike Lindell, a prominent election denier, told The Associated Press that the eviction is a formality because the landlord wants to take the property back. The Minneapolis warehouse is approximately 125,000 square feet and has been leased… An expert warned these types of mergers can sometimes see customers pay more at the checkout. ANALYSIS: The US and EU argue that Apple is abusing its power to crush competition and blight users’ experience. The iPhone maker says the proceedings threaten the company. Andrew Griffin examines what the row could mean for the technology in your pocket Play this game for 1 minute and see why everyone is addicted. In this article, we will look at the 25 countries with the highest average salaries in the world. We have also discussed the global unemployment rates. If you want to skip our detailed analysis, head straight to the 10 Countries with the Highest Average Salaries in the World. The International Labour Organization (ILO) has reported […] (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b Apple will finally launch new iPads in early May, according to Bloomberg’s Mark Gurman. Expected are a new iPad Pro with an OLED display and a faster iPad Air, including a 12.9-inch model for the first time in that lineup.  Kim Kardashian is being sued by late artist Donald Judd’s foundation over claims her minimalist office furniture was designed by Judd In this piece, we will take a look at the 25 largest automotive companies and suppliers in the world. If you want to skip our overview of the global automotive industry, then you can take a look at the 5 Largest Automotive Companies and Suppliers in the World. The global automotive industry is one of the […] (Bloomberg) -- This year’s crypto rally has been so strong that a software maker, largely viewed as a Bitcoin hedge fund of sorts, now has a stock market capitalization that’s higher than nearly half of the companies in the S&P 500 Index. Most Read from BloombergBankman-Fried Is Sentenced to 25 Years in Prison Over FTX CollapseTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineDubai Is Losing Its Allure for Wealthy RussiansLondon Insurers Face Baltimore Bridge Payouts Worth Bill  In this article, we will take a look at the top 15 3D printing companies in the US. If you want to skip our detailed analysis, you can go directly to Top 5 3D Printing Companies in the US. Recent Trends in 3D Printing According to a report by Grand View Research, the global 3D […] Early retirement sounds like a dream come true, but it's not all rainbows and roses for most people. Find Out: I Retired at 65: Here's My Monthly BudgetLearn More: 7 Unusual Ways To Make Extra Money... Apple's overseas suppliers have increased production of the company's new iPad models and plans to launch them in early May, Bloomberg News reported on Thursday citing people with knowledge of the matter.  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  (Bloomberg) -- Oil scored a 16% quarterly gain in the latest sign that export curbs by OPEC and its allies are reining in global supplies.Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentWest Texas Intermediate The SA government has unveiled a package to help winemakers return to China's huge market with the lifting of punitive tariffs. Making wise financial plans for retirement is essential if you want to enjoy your golden years without having to worry about making ends meet. Be Aware: Cutting Expenses in Retirement: 6 Stores To... He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” If you're thinking about retirement, even if it's still quite a ways away, it's important to start planning. One way to do this is to look at your paycheck and see if there are new or more ways to... If you want to enjoy your retirement and not have to stress about working into your 70s, it's essential to sidestep the pitfalls that loom during your working years. Ill-advised decisions can shrink... Financial services giant Fidelity has a rule for retirement savings you may have heard of: Have 10 times your annual salary saved for retirement by age 67. This oft-cited guideline can help you identify a retirement savings goal, but it … Continue reading → The post Should the 45% Rule Guide Your Retirement Strategy? appeared first on SmartAsset Blog. "
}