{
    "title": null,
    "date": "3/23/2024",
    "url": "https://www.tradingview.com/symbols/FWB-APC/ideas/page-459/?sort=recent",
    "text": "Apple buy strategy was success and please check my sell or short zones as it is still valid price has not touch it yet. What i mean to say is that In my buy zone what happens was that as soon as the price came to my fresh buy zone or in other words newly fresh formed support zones i placed my buy order for long. try to spot and find this type of newly formed and... Lets look at the longer trend on Apple .... In December 2016 it tossed its trendline that went back from 2009 for a more agressive one . It then broke out of its channel during the Fed invoked bubble market. Looks like it has a far drop to take. Lets see it come down and tag back in the channel it launched from... Lets look at the longer trend on Apple.... In December 2016 it tossed its trendline that went back from 2009 for a more agressive one.  It then broke out of its channel during the Fed invoked bubble market.  Looks like it has a far drop to take.    Lets see it come down to ideally the 60s to confirm the breakout area... but back to the channel... April - May Earnings AAPL - Week of 3/22 Momentarily escaped the bullish triangle last week before joining in. I expect to see it near 135 level by end of month. Looks like AAPL may be forming an inverse Head and Shoulders to match the Head and Shoulders at the top as well as an ABC pattern.\n\nThis is a bullish pattern so far, but I am crossing my fingers that C is C.\n\nNot a recommendation.\n\nA trick to trading can be avoiding losing too much ground when you are going sideways between homeruns. \n\nPossible stop below C.\n\nIt... AAPL going for an inverted shs and complete the cup part?\n\nAAPL seems to be broken the downtrend channel (pink) and make it a support. If it can jump over the uptrend line (turquise) and hold on, it's likely to be going to complete the cup. calling the bottom here stoploss 200ma Risk-reward over 4 Risk Size 50% AAPL continues to look bearish.\n\nAll cash, waiting to see what happens Monday.  Remember, AAPL is teh market. Right now price is at a critical support level. A break here would see a retest of 118-117. If this support holds, and with confirmation of a bullish RSI and MACD, it looks to go long. Apple is close to the 120 support area. Let see if we can get back to max numbers of last months We created Timelines to help people learn more about the companies and symbols they follow. Timelines are comprehensive guides that reveal the history, key events, and defining moments of a specific symbol.  As a trader or investor, Timelines can be used to study the historical events of markets and the story that makes a symbol what it is today. \n\nIn this video... I do not recommend speculators to hold Apple stock Since the last ER AAPL has come back down to the 120s price range. Although it was not alone in its share price correction as we've seen overall market come down as well in February.\n\nAlthough I hold a long term bullish stance on AAPL, looking at the short term daily chart I see that we have crossed under the 100 EMA on the daily chart, are still making lower lows... Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @bradfairbridge @rajbuzzz @Kevin Trinh @Cenobar @arcanebear @udcovers @fx.today @_dalton16 @TradingView @mytradingsetup @ftmocom @chartfeed @olka_gadzieva @mytradingsetup @satoshi_empire @MidasPls @Zeiierman Trading @Onlnternet Whatever the trade "
}