{
    "title": "You Won’t Believe What The Apple Car Prototype Was Named Internally",
    "date": "3/10/2024",
    "url": "https://wonderfulengineering.com/you-wont-believe-what-the-apple-car-prototype-was-named-internally/",
    "text": "In 2020, Apple employees involved in developing the tech giant’s first electric car created a prototype dubbed the “Bread Loaf,” a name that was sometimes used mockingly. This prototype, resembling a minivan with rounded sides, an all-glass roof, sliding doors, and whitewall tires, was part of the secretive “Project Titan.” After nearly a decade of work, top executives officially halted the project on February 27. The “Bread Loaf” prototype, though not always admired by its creators, made it to the test tracks in 2020 before undergoing design changes when the project lead departed for another company. Apple CEO Tim Cook attended a demonstration of the prototype, which was meticulously prepared over nine months for his safety. The demonstration was highly scripted, aiming to impress Cook with a proof of concept for conditionally automated driving, allowing the driver to take control at any moment. However, Cook and other Apple executives were so impressed that they sought full self-driving capabilities instead. Despite Apple’s ambitious goals, the decision to terminate the car project aligns with broader trends in the electric vehicle market. Demand for premium electric vehicles in the US is waning, and major automakers like Ford and Tesla are facing delays in their EV infrastructure investments. This slowdown reflects a shift in consumer preferences and market dynamics following the initial excitement surrounding electric vehicles. The development of the “Bread Loaf” prototype marked a significant milestone in Apple’s pursuit of automotive innovation under Project Titan. Despite initial excitement, the project faced setbacks, including design changes and leadership transitions. Apple CEO Tim Cook’s involvement in a meticulously prepared demonstration highlighted the company’s dedication to impressing stakeholders. However, the decision to pursue full self-driving capabilities instead of conditional automation reflected Apple’s ambitious goals. The termination of the project aligned with broader trends in the electric vehicle market, with declining demand for premium EVs and delays in infrastructure investments by major automakers. While the “Bread Loaf” prototype showcased Apple’s innovative efforts, its cancellation underscores the challenges of navigating the rapidly evolving automotive industry. Your email address will not be published. Required fields are marked * Comment * Name * Email *  Notify me of follow-up comments by email. Notify me of new posts by email.  Copyright © 2024 Wonderful Engineering. All Rights Reserved. "
}