{
    "title": "Apple Inc. (NASDAQ:AAPL) Shares Bought by Rather & Kittrell Inc.",
    "date": "3/7/2024",
    "url": "https://www.defenseworld.net/2024/03/07/apple-inc-nasdaqaapl-shares-bought-by-rather-kittrell-inc.html",
    "text": "New Rank-Based ScoringMarketRank™ is calculated by averaging available category scores (with extra weight given to analysis and valuation), then ranking the company's weighted average against that of other companies. 4.97 out of 5 stars 6th out of 592 stocks 1st out of 6 stocks Apple has received a consensus rating of Moderate Buy. The company's average rating score is 2.65, and is based on 21 buy ratings, 11 hold ratings, and 1 sell rating. According to analysts' consensus price target of $204.53, Apple has a forecasted upside of 19.3% from its current price of $171.48. Apple has been the subject of 19 research reports in the past 90 days, demonstrating strong analyst interest in this stock. Apple has a dividend yield of 0.57%, which is in the bottom 25% of all stocks that pay dividends. Apple has been increasing its dividend for 12 years. The dividend payout ratio of Apple is 14.95%. This payout ratio is at a healthy, sustainable level, below 75%. Based on earnings estimates, Apple will have a dividend payout ratio of 13.50% next year. This indicates that Apple will be able to sustain or increase its dividend. In the past three months, Apple insiders have sold more of their company's stock than they have bought. Specifically, they have bought $0.00 in company stock and sold $18,094,000.00 in company stock. Only 0.06% of the stock of Apple is held by insiders. 60.41% of the stock of Apple is held by institutions. High institutional ownership can be a signal of strong market trust in this company. Earnings for Apple are expected to grow by 8.55% in the coming year, from $6.55 to $7.11 per share. The P/E ratio of Apple is 26.71, which means that it is trading at a less expensive P/E ratio than the market average P/E ratio of about 128.47. The P/E ratio of Apple is 26.71, which means that it is trading at a less expensive P/E ratio than the Computer and Technology sector average P/E ratio of about 230.77. Apple has a PEG Ratio of 2.09. PEG Ratios above 1 indicate that a company could be overvalued. Apple has a P/B Ratio of 42.87. P/B Ratios above 3 indicate that a company could be overvalued with respect to its assets and liabilities. Apple Inc. is among the world's most iconic brands. Founded on April 1, 1976, by Steve Jobs and Steve Wozniak, it is now the leading producer of consumer electronics and an economy all of its own. The was valued at over $2.6 trillion in 2022 and brought in $0.4 trillion in revenue making it equal in size to the economies of Thailand and Belgium which are ranked 24th and 23rd largest worldwide.\nFounders Jobs and Wozniak, both college dropouts, founded the company with the idea of changing the way people looked at computers. Their vision coincided with a revolution within the PC industry and helped to create personal computing as we know it today. The company’s first product was a personal computer known as the Apple 1 but the product line has since evolved to include a wide range of desirable personal computing devices.\nTim Cook took over the role of CEO in 2011 shortly before the death of Steve Jobs. Cook joined the company in 1988 as Senior VP of Global Sales and went on to become Executive VP of Global Operations before taking on the chief executive role. In his tenure, Mr. Cook has more than doubled Apple’s revenue and earnings while growing the company’s value by more than 450%.\nThe company designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. Apple also provides and sells related platforms and services to power them and is the host of a widely-used digital ecosystem. The digital ecosystem revolves around the Apple App Store which lists thousands of games and applications for iOS users. The App Store also features digital content like music, TV, and movies as well as books, podcasts, and other forms of digital content.\nApple is headquartered in Apple Park, an ultra-modern campus built in Cupertino, California. The campus features a massive circular building nicknamed The Spaceship and provides working space for over 12,000 employees. The circular shape houses a park and a pond and there are many amenities within the facility including cafes, a wellness center, care clinics, and terminals for the shuttle system.\nThe company’s core product line has shifted away from computers over the years and towards iPhones and devices but computing is still fundamental to the business. In regard to iPhones, Apple’s products are routinely ranked as the top-selling in all comparisons. Other product lines include Mac (a line of computers), iPad (a line of tablets), AirPods (wifi-enabled earbuds), wearables like the Watch, home accessories such as Apple TV, and smart-home devices like the HomePod.\nFinally, Apple provides AppleCare support services, cloud store services, and a host of other service offerings intended to simplify life. Among them are Apple News (subscription news), Apple TV+ (subscription TV with original content), Apple Card (consumer credit card), and Apple Pay (mobile cashless pay feature).\nApple computers and wifi-enabled smart devices are in demand by consumers, small and mid-sized businesses, the education sector, enterprises, and governments worldwide because they are high-quality, long-lasting, powerful devices. The company sells its products through an omnichannel network of DTC, wholesales, and eCommerce channels including mobile carriers, retailers, and resellers. Apple Inc. is among the world's most iconic brands. Founded on April 1, 1976, by Steve Jobs and Steve Wozniak, it is now the leading producer of consumer electronics and an economy all of its own. The was valued at over $2.6 trillion in 2022 and brought in $0.4 trillion in revenue making it equal in size to the economies of Thailand and Belgium which are ranked 24th and 23rd largest worldwide. Founders Jobs and Wozniak, both college dropouts, founded the company with the idea of changing the way people looked at computers. Their vision coincided with a revolution within the PC industry and helped to create personal computing as we know it today. The company’s first product was a personal computer known as the Apple 1 but the product line has since evolved to include a wide range of desirable personal computing devices. Tim Cook took over the role of CEO in 2011 shortly before the death of Steve Jobs. Cook joined the company in 1988 as Senior VP of Global Sales and went on to become Executive VP of Global Operations before taking on the chief executive role. In his tenure, Mr. Cook has more than doubled Apple’s revenue and earnings while growing the company’s value by more than 450%. The company designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. Apple also provides and sells related platforms and services to power them and is the host of a widely-used digital ecosystem. The digital ecosystem revolves around the Apple App Store which lists thousands of games and applications for iOS users. The App Store also features digital content like music, TV, and movies as well as books, podcasts, and other forms of digital content. Apple is headquartered in Apple Park, an ultra-modern campus built in Cupertino, California. The campus features a massive circular building nicknamed The Spaceship and provides working space for over 12,000 employees. The circular shape houses a park and a pond and there are many amenities within the facility including cafes, a wellness center, care clinics, and terminals for the shuttle system. The company’s core product line has shifted away from computers over the years and towards iPhones and devices but computing is still fundamental to the business. In regard to iPhones, Apple’s products are routinely ranked as the top-selling in all comparisons. Other product lines include Mac (a line of computers), iPad (a line of tablets), AirPods (wifi-enabled earbuds), wearables like the Watch, home accessories such as Apple TV, and smart-home devices like the HomePod. Finally, Apple provides AppleCare support services, cloud store services, and a host of other service offerings intended to simplify life. Among them are Apple News (subscription news), Apple TV+ (subscription TV with original content), Apple Card (consumer credit card), and Apple Pay (mobile cashless pay feature). Apple computers and wifi-enabled smart devices are in demand by consumers, small and mid-sized businesses, the education sector, enterprises, and governments worldwide because they are high-quality, long-lasting, powerful devices. The company sells its products through an omnichannel network of DTC, wholesales, and eCommerce channels including mobile carriers, retailers, and resellers. Sign-up to receive the latest news and ratings for Apple and its competitors with MarketBeat's FREE daily newsletter. Wondering what the next stocks will be that hit it big, with solid fundamentals? Click the link below to learn more about how your portfolio could bloom. Here are some ways that investors could benefit from investing in Apple: Investors should be bearish about investing in Apple for these reasons: 34 Wall Street equities research analysts have issued \"buy,\" \"hold,\" and \"sell\" ratings for Apple in the last twelve months. There are currently 1 sell rating, 11 hold ratings, 21 buy ratings and 1 strong buy rating for the stock. The consensus among Wall Street equities research analysts is that investors should \"moderate buy\" AAPL shares. View AAPL analyst ratings or view top-rated stocks. 34 equities research analysts have issued twelve-month price objectives for Apple's stock. Their AAPL share price targets range from $158.00 to $250.00. On average, they anticipate the company's stock price to reach $204.53 in the next year. This suggests a possible upside of 19.3% from the stock's current price. View analysts price targets for AAPL or view top-rated stocks among Wall Street analysts. Apple's stock was trading at $192.53 on January 1st, 2024. Since then, AAPL stock has decreased by 10.9% and is now trading at $171.48. View the best growth stocks for 2024 here. The company is scheduled to release its next quarterly earnings announcement on Thursday, May 2nd 2024. View our AAPL earnings forecast. Apple Inc. (NASDAQ:AAPL) announced its quarterly earnings data on Thursday, February, 1st. The iPhone maker reported $2.18 EPS for the quarter, beating analysts' consensus estimates of $2.09 by $0.09. The iPhone maker earned $119.60 billion during the quarter, compared to the consensus estimate of $117.99 billion. Apple had a net margin of 26.16% and a trailing twelve-month return on equity of 156.04%. Apple's revenue was up 2.1% compared to the same quarter last year. During the same period last year, the business posted $1.88 EPS. Read the conference call transcript. Apple announced a quarterly dividend on Thursday, February 1st. Investors of record on Monday, February 12th will be paid a dividend of $0.24 per share on Thursday, February 15th. This represents a $0.96 annualized dividend and a yield of 0.56%. The ex-dividend date is Friday, February 9th. Read our dividend analysis for AAPL. Apple (NASDAQ:AAPL) pays an annual dividend of $0.96 per share and currently has a dividend yield of 0.57%. The company has been increasing its dividend for 12 consecutive years, indicating the company has a strong committment to maintain and grow its dividend. The dividend payout ratio is 14.95%. This payout ratio is at a healthy, sustainable level, below 75%. Based on earnings estimates, AAPL will have a dividend payout ratio of 13.50% next year. This indicates that the company will be able to sustain or increase its dividend. Read our dividend analysis for AAPL. ETFs with the largest weight of Apple (NASDAQ:AAPL) stock in their portfolio include Technology Select Sector SPDR Fund (XLK), Vanguard Information Technology ETF (VGT), Fidelity MSCI Information Technology Index ETF (FTEC), iShares Global Tech ETF (IXN), iShares U.S. Technology ETF (IYW), Direxion Daily Technology Bull 3X Shares (TECL), Vanguard Mega Cap Growth ETF (MGK) and Direxion AAPL Bull 1.5X Shares (AAPU). Shares of Apple split on the morning of Monday, August 31st 2020. The 4-1 split was announced on Thursday, July 30th 2020. The newly issued shares were payable to shareholders after the closing bell on Friday, August 28th 2020. An investor that had 100 shares of stock prior to the split would have 400 shares after the split. Apple announced that its Board of Directors has initiated a share buyback program on Thursday, May 4th 2023, which allows the company to buyback $90,000,000,000.00 in shares, according to EventVestor. This buyback authorization allows the company to purchase up to 3.4% of its shares through open market purchases. Shares buyback programs are generally an indication that the company's board of directors believes its shares are undervalued. 11,001 employees have rated Apple Chief Executive Officer Tim Cook on Glassdoor.com. Tim Cook has an approval rating of 94% among the company's employees. This puts Tim Cook in the top 30% of approval ratings compared to other CEOs of publicly-traded companies. Based on aggregate information from My MarketBeat watchlists, some companies that other Apple investors own include NVIDIA (NVDA), Alibaba Group (BABA), Tesla (TSLA), Micron Technology (MU), Netflix (NFLX), General Electric (GE), Walt Disney (DIS), Advanced Micro Devices (AMD), AT&T (T) and Boeing (BA). Apple's stock is owned by many different retail and institutional investors. Top institutional investors include Vanguard Group Inc. (8.54%), Vanguard Group Inc. (8.54%), Berkshire Hathaway Inc (5.86%), Price T Rowe Associates Inc. MD (1.37%), Norges Bank (1.14%) and Northern Trust Corp (1.05%). Insiders that own company stock include Arthur D Levinson, Chris Kondo, Deirdre O'brien, Jeffrey E Williams, Jeffrey E Williams, Katherine L Adams, Katherine L Adams, Luca Maestri and Timothy D Cook. View institutional ownership trends. Shares of AAPL stock can be purchased through any online brokerage account. Popular online brokerages with access to the U.S. stock market include Charles Schwab, E*TRADE, Fidelity, and Vanguard Brokerage Services. Compare Top Brokerages Here. You have already added five stocks to your watchlist. Upgrade to MarketBeat All Access to add more stocks to your watchlist. Please log in to your account or sign up in order to add this asset to your watchlist. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}