{
    "title": "Why Taiwan Semiconductor Stock Was Gaining Today",
    "date": "3/8/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/AAPL/pressreleases/24661268/why-taiwan-semiconductor-stock-was-gaining-today/",
    "text": "Shares of Taiwan Semiconductor (NYSE: TSM) were moving higher today after the company reported February revenue that showed growth was accelerating year over year from January to February. The news seemed to be the latest confirmation that TSMC is seeing strong demand for AI-related chips even at a time when Apple, its biggest customer, is reporting sales headwinds in China. As of 11:38 a.m. ET, the stock was up 1.1% after gaining as much as 6.1% earlier in the session. Image source: TSMC. Taiwan Semi is recovering from the decline in the chip industry rapidly, the latest numbers indicate. In February, the company reported $5.74 billion in revenue, which was up 11.3% from a year ago, though it was down 15.8% from January, which may be for cyclical reasons. That result also represented an acceleration from January as year-to-date growth for the first two months of the year was up 9.4%. Those numbers seemed to convince investors that Taiwan Semi is benefiting from AI trends even as demand from Apple, which represents roughly 25% of its revenue, has been slow. Taiwan Semi is also a central player in the AI boom as it's the top manufacturing partner for companies like Nvidia, AMD, and Broadcom. Taiwan Semi finally seems to be getting recognition as a winner in AI as it owns more than 50% share of the contract chip-manufacturing market and roughly 90% of the advanced chip-manufacturing segment, which is key to making AI components. Companies like Nvidia continue to complain about supply constraints, and that will benefit TSMC as prices rise and companies like to make smaller, even more advanced chips. Expect Taiwan Semi stock to keep rising as the AI boom continues.   Should you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 8, 2024  Jeremy Bowman has positions in Broadcom. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Apple Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}