{
    "title": "After Apple glasses - Meta will launch augmented reality in the fall",
    "date": "3/3/2024",
    "url": "https://www.jpost.com/brandblend/article-789985",
    "text": "After the success of Apple's augmented reality glasses, Meta also plans to present its glasses soon: the company, which has been working on the AR glasses for years, is expected to present a prototype during 2024, and it is possible that the initial version will be shown this fall.Under the name \"Orion\", the virtual reality glasses are expected to integrate the real environment with digital reality and applications. According to the report, a number of Meta workers have already started experimenting with glasses.The AR glasses were developed in the company's laboratories and under the watchful eye of CEO Mark Zuckerberg. Earlier this year, Zuckerberg posted several versions of Meta Glasses on his desktop. A source in the company leaked that one of them is expected to be the augmented reality glasses that the company intends to launch. However, the company's spokesperson refused to respond.   Apple's augmented reality glasses. The initial stock has been eliminated  (credit: APPLE)The augmented reality glasses are a central part of Meta's plan to expand the development of wearable products. Additional reports stated that the new glasses are expected to be the most advanced available today, hinting at the company's competition with Apple.Meanwhile, Tim Cook's technology giant is speeding up the pace of production of its augmented reality glasses, after 200,000 copies of the glasses sold out in pre-order, even before the launch a few weeks ago. The company has not yet said when the shelves of Apple stores will be filled with glasses, which are not expected to arrive in Israel for the time being. Under the name \"Orion\", the virtual reality glasses are expected to integrate the real environment with digital reality and applications. According to the report, a number of Meta workers have already started experimenting with glasses.The AR glasses were developed in the company's laboratories and under the watchful eye of CEO Mark Zuckerberg. Earlier this year, Zuckerberg posted several versions of Meta Glasses on his desktop. A source in the company leaked that one of them is expected to be the augmented reality glasses that the company intends to launch. However, the company's spokesperson refused to respond.   Apple's augmented reality glasses. The initial stock has been eliminated  (credit: APPLE)The augmented reality glasses are a central part of Meta's plan to expand the development of wearable products. Additional reports stated that the new glasses are expected to be the most advanced available today, hinting at the company's competition with Apple.Meanwhile, Tim Cook's technology giant is speeding up the pace of production of its augmented reality glasses, after 200,000 copies of the glasses sold out in pre-order, even before the launch a few weeks ago. The company has not yet said when the shelves of Apple stores will be filled with glasses, which are not expected to arrive in Israel for the time being. The AR glasses were developed in the company's laboratories and under the watchful eye of CEO Mark Zuckerberg. Earlier this year, Zuckerberg posted several versions of Meta Glasses on his desktop. A source in the company leaked that one of them is expected to be the augmented reality glasses that the company intends to launch. However, the company's spokesperson refused to respond.   Apple's augmented reality glasses. The initial stock has been eliminated  (credit: APPLE)The augmented reality glasses are a central part of Meta's plan to expand the development of wearable products. Additional reports stated that the new glasses are expected to be the most advanced available today, hinting at the company's competition with Apple.Meanwhile, Tim Cook's technology giant is speeding up the pace of production of its augmented reality glasses, after 200,000 copies of the glasses sold out in pre-order, even before the launch a few weeks ago. The company has not yet said when the shelves of Apple stores will be filled with glasses, which are not expected to arrive in Israel for the time being. The augmented reality glasses are a central part of Meta's plan to expand the development of wearable products. Additional reports stated that the new glasses are expected to be the most advanced available today, hinting at the company's competition with Apple.Meanwhile, Tim Cook's technology giant is speeding up the pace of production of its augmented reality glasses, after 200,000 copies of the glasses sold out in pre-order, even before the launch a few weeks ago. The company has not yet said when the shelves of Apple stores will be filled with glasses, which are not expected to arrive in Israel for the time being. Meanwhile, Tim Cook's technology giant is speeding up the pace of production of its augmented reality glasses, after 200,000 copies of the glasses sold out in pre-order, even before the launch a few weeks ago. The company has not yet said when the shelves of Apple stores will be filled with glasses, which are not expected to arrive in Israel for the time being.  "
}