{
    "title": "Alps Advisors Inc. Has $38.84 Million Stock Holdings in Apple Inc. \n(NASDAQ:AAPL)",
    "date": "3/13/2024",
    "url": "https://www.defenseworld.net/2024/03/13/alps-advisors-inc-has-38-84-million-stock-holdings-in-apple-inc-nasdaqaapl.html",
    "text": "Posted by Defense World Staff on Mar 13th, 2024 Alps Advisors Inc. raised its holdings in  Apple Inc. (NASDAQ:AAPL – Free Report) by 16.5% during the third quarter, according to the company in its most recent 13F filing with the SEC. The institutional investor  owned 226,844 shares of the iPhone maker’s stock after purchasing an additional 32,077 shares during the quarter. Alps Advisors Inc.’s holdings in Apple were worth $38,838,000 as of its most recent SEC filing. Several other hedge funds also recently modified their holdings of AAPL. Vanguard Group Inc. raised its position in  Apple by 0.7% during the 1st quarter. Vanguard Group Inc. now owns 1,269,995,750 shares of the iPhone maker’s stock worth $221,753,959,000 after purchasing an additional 8,734,393 shares during the last quarter.  State Street Corp raised its position in  Apple by 0.5% during the 2nd quarter. State Street Corp now owns 578,897,858 shares of the iPhone maker’s stock worth $112,288,818,000 after purchasing an additional 2,616,084 shares during the last quarter.  Moneta Group Investment Advisors LLC raised its position in  Apple by 116,483.5% during the 4th quarter. Moneta Group Investment Advisors LLC now owns 569,554,722 shares of the iPhone maker’s stock worth $74,002,245,000 after purchasing an additional 569,066,184 shares during the last quarter.  Geode Capital Management LLC raised its position in  Apple by 2.2% during the 2nd quarter. Geode Capital Management LLC now owns 291,538,165 shares of the iPhone maker’s stock worth $56,396,763,000 after purchasing an additional 6,367,053 shares during the last quarter.  Finally, Price T Rowe Associates Inc. MD raised its position in  Apple by 3.4% during the 1st quarter. Price T Rowe Associates Inc. MD now owns 234,017,381 shares of the iPhone maker’s stock worth $38,589,468,000 after purchasing an additional 7,736,013 shares during the last quarter. Institutional investors and hedge funds own  58.51% of the company’s stock. In other news, Director Arthur D. Levinson sold 100,000 shares of the business’s stock in a transaction that occurred on Thursday, February 29th. The stock was sold at an average price of $180.94, for a total value of $18,094,000.00. Following the transaction, the director now owns 4,434,576 shares in the company, valued at approximately $802,392,181.44. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is available through this link. Company insiders own  0.06% of the company’s stock. Several research analysts recently issued reports on AAPL shares. Monness Crespi & Hardt raised their target price on Apple from $189.00 to $200.00 and gave the stock a “buy” rating in a research report on Friday, February 2nd. Piper Sandler lowered their target price on Apple from $205.00 to $190.00 and set a “neutral” rating for the company in a research report on Friday, February 2nd. Redburn Partners lowered Apple to a “neutral” rating and set a $200.00 price objective for the company. in a research report on Wednesday, January 10th. Barclays lowered their price objective on Apple from $160.00 to $158.00 and set an “underweight” rating for the company in a research report on Friday, February 2nd. Finally, Robert W. Baird lifted their price objective on Apple from $186.00 to $200.00 and gave the stock an “outperform” rating in a research report on Monday, January 29th. One equities research analyst  has rated the stock with a sell rating, eleven have issued  a hold rating, twenty-one have assigned  a buy rating and one  has assigned  a strong buy rating to the stock. According to data from MarketBeat.com, the stock currently has an average rating of “Moderate Buy” and a consensus price target of $205.27. Check Out Our Latest Stock Analysis on Apple AAPL stock opened at $173.23 on Wednesday. The company has a market capitalization of $2.67 trillion, a P/E ratio of 26.98, a price-to-earnings-growth ratio of 2.06 and a beta of 1.29. The company has a debt-to-equity ratio of 1.28, a quick ratio of 1.02 and a current ratio of 1.07. Apple Inc. has a 52-week low of $147.70 and a 52-week high of $199.62. The business has a 50-day simple moving average of $184.00 and a two-hundred day simple moving average of $183.55. Apple (NASDAQ:AAPL – Get Free Report) last announced its earnings results on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share for the quarter, topping analysts’ consensus estimates of $2.09 by $0.09. Apple had a return on equity of 156.04% and a net margin of 26.16%. The firm had revenue of $119.60 billion for the quarter, compared to the consensus estimate of $117.99 billion. During the same quarter in the previous year, the business earned $1.88 EPS. The company’s revenue was up 2.1% compared to the same quarter last year.  Research analysts expect that  Apple Inc. will post 6.55 EPS for the current fiscal year. The firm also recently announced a quarterly dividend, which was paid on Thursday, February 15th. Stockholders of record on Monday, February 12th were paid a $0.24 dividend. The ex-dividend date of this dividend  was Friday, February 9th. This represents a $0.96 dividend on an annualized basis and a dividend yield of 0.55%. Apple’s payout ratio is presently 14.95%. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Augustine Asset Management Inc. Sells 2,522 Shares of Apple Inc. (NASDAQ:AAPL) Apple Inc. (NASDAQ:AAPL) Stock Holdings Trimmed by AIMZ Investment Advisors LLC "
}