{
    "title": "Apple's $3,499 Vision Pro headset sees strong demand in early pre-orders, \nshipping dates extend to March | Mint",
    "date": "1/20/2024",
    "url": "https://www.livemint.com/technology/gadgets/apples-3-499-vision-pro-headset-sees-strong-demand-in-early-pre-orders-shipping-dates-extend-to-march-11705738586014.html",
    "text": "Apple Inc. has officially opened preorders for its highly anticipated Vision Pro mixed-reality headset, and early indicators suggest a robust response from buyers, quickly depleting initial supplies of the $3,499 device, reported Bloomberg. Reportedly, the product became available for purchase at 8 a.m. Eastern time on Apple's website and mobile app, with delivery dates for all three models slipping to March 8-15 for online orders. The rapid sellout for in-store pickup on the first day at many locations hints at either strong demand or limited supplies, or a combination of both. In a move that adds more options for consumers, Apple unveiled two additional configurations: a version with 512 gigabytes of storage for $3,699 and a top-end model with a capacious 1 terabyte of space for $3,899. The base model comes with 256 gigabytes of storage. Complementing the headset, Apple will offer a carrying case for $199, additional batteries for $199, and extra bands priced at $99 each. However, the unique purchasing process requires customers to use a recent iPhone or iPad to scan their head and, if necessary, provide a vision prescription. As per the report, while Apple typically refrains from commenting on the sales performance of new products, Wall Street analysts are predicting a measured start for the Vision Pro. UBS Group AG analyst David Vogt anticipates Apple shipping 300,000 to 400,000 units this year, generating up to $1.4 billion. Despite the hefty price tag, Apple's sales expectations appear to align with a slow and steady market entry. Initially available exclusively in the U.S., Apple plans to extend the Vision Pro's availability to other markets, with the UK, Canada, and China among the first countries in line, according to Bloomberg News reports. Internally, Apple executives anticipate a strong opening weekend, with sales tapering off in the subsequent weeks. Priced significantly higher than Meta Platforms Inc.'s latest device, the Vision Pro is positioned as one of the most expensive consumer headsets, emphasizing its premium nature. However, the unique fitting process poses a challenge for sharing the device with family and friends. A precise face scan is required to determine the optimal light seal and strap size for each user, with 25 different light seals and two straps available. Additionally, prescription lens inserts are offered at an extra cost. Some early testers have raised concerns about the headset's weight, finding it cumbersome for extended periods.   Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}