{
    "title": "Shareholder Statement on Departure of Al Gore from Board of Directors for \nApple Inc.",
    "date": "1/11/2024",
    "url": "https://finance.yahoo.com/news/shareholder-statement-departure-al-gore-230216412.html",
    "text": "National Legal and Policy Center Called For Former Vice President’s Ouster From Tech Company at Last Year’s Annual Meeting Falls Church, VA --News Direct-- NLPC Apple Inc. announced that former Vice President Al Gore will not stand for reelection to the board of directors at the annual meeting in two months, attributing his departure to the company’s age limit for members. Ahead of last year’s annual meeting, National Legal and Policy Center – a shareholder in Apple – called for fellow investors to oppose Gore’s reelection, explaining in a lengthy memo filed with the Securities and Exchange Commission why he was unqualified to serve in such an influential leadership role and was detrimental to the company. NLPC wrote in part: Mr. Gore has held a position on Apple’s board since 2003, despite having no relevant experience in technology or core business functions. His primary benefit to the board is his supposed climate change expertise. However, Mr. Gore’s public reputation is inconsistent with his track record, his carbon-intensive lifestyle, and his actual investments. Instead, he has used his public advocacy as a tool for personal enrichment. In addition, his political activism poses to Apple a reputational risk that is not worth his limited skillset. Following the announcement, Paul Chesser, Director of NLPC’s Corporate Integrity Project, stated: “Al Gore was Apple’s longest serving director, for more than 20 years – but he never should have even served a day. How influential were his many distortions and exagerations over the years about energy and climate? How much more did his policy preferences increase the costs of Apple products to unaffordable highs for many more potential customers? How much did his hypocritical jet-setting and personal electricity use undermine the company’s reputation?” “Apple is a great company, but it would have been even greater without the presence of Al Gore. Good riddance.” NLPC is also sponsoring a shareholder proposal at the upcoming annual meeting, which seeks accountability from the Cupertino, Calif.-based tech giant about its human rights policies versus its actions. Founded in 1991, NLPC promotes ethics in public life and government accountability through research, investigation, education, and legal action. ### For more information or to schedule an interview with Paul Chesser, contact Dan Rene at 202-329-8357 or drene@nlpc.org. Please visit http://www.nlpc.org. National Legal and Policy Center Dan Rene +1 202-329-8357 drene@nlpc.org http://www.nlpc.org View source version on newsdirect.com: https://newsdirect.com/news/shareholder-statement-on-departure-of-al-gore-from-board-of-directors-for-apple-inc-286540718 "
}