{
    "title": "What Are the Magnificent 7 Stocks?",
    "date": "1/7/2024",
    "url": "https://www.kiplinger.com/investing/stocks/what-are-the-magnificent-7-stocks",
    "text": "Save up to 74% Subscribe to Kiplinger When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The Magnificent 7 stocks were market leaders in 2023 and have been long-time outperformers. Here's a closer look at the group of mega-cap stocks. Bank of America strategist Michael Hartnett coined the term \"Magnificent 7\" stocks for the most dominant tech companies. The group is made up of mega-cap stocks Apple (AAPL), Alphabet (GOOGL), Microsoft (MSFT), Amazon.com (AMZN), Meta Platforms (META), Tesla (TSLA) and Nvidia (NVDA). In 2023, the Magnificent 7 stocks logged an impressive average return of 111%, compared to a 24% return for the broader S&P 500. Here's a look at the individual performances of the Magnificent 7 stocks over the past decade: Be a smarter, better informed investor. Profit and prosper with the best of expert advice on investing, taxes, retirement, personal finance and more - straight to your e-mail. Profit and prosper with the best of expert advice - straight to your e-mail. These stocks drove the domestic stock market in 2023 for a reason, says Daniel Dusina, a Chartered Financial Analyst (CFA) and chief investment officer at Blue Chip Partners. \"These companies display earnings growth that is among the highest within the large-cap domestic subset, and most have businesses that are exposed to secular trends.\" These returns are certainly impressive, but these Magnificent 7 stocks are not bulletproof. Even seemingly invincible stocks can have problems (think 2022, when all seven of these names finished the year with double-digit percentage losses). As such, prudent investors must stay aware of market environments and diversify their portfolios. With that in mind, let's take a closer look at each of the Magnificent 7 stocks:  The recent drama at OpenAI – when the board abruptly fired CEO Sam Altman – threatened Microsoft's $13 billion dollar investment in the company.  But this event turned out to be a big plus. Microsoft CEO Satya Nadella skillfully managed the crisis and ultimately strengthened the partnership with the artificial intelligence (AI) firm, with Altman back at the helm. OpenAI is the clear leader in sophisticated generative AI technologies, and MSFT has leveraged this into an array of applications. Analysts at Jefferies estimate that Microsoft's Office 365 Copilot will generate about $19 billion in revenue by fiscal 2025. The company is also aggressively moving into other categories. There will be copilots that target massive opportunities like CRM and cybersecurity.  So even though Microsoft fetches a high multiple – priced at 35 times earnings – a premium is reasonable in light of the long-term growth potential.  In terms of operating income, Amazon.com's cloud business has been the main driver. The problem is that during the past year or so, the business has come under pressure. This is unlikely to last long, though. Why? Generative AI. While Amazon was slow to invest in this technology, the company has been able to make up a lot of ground. This was evident at the recent AWS re:Invent conference where Amazon announced enhancements to its Bedrock platform and also disclosed details about its Q chatbot. These technologies can certainly help boost AWS, as customers rapidly adopt generative AI.  Over the years, Nvidia CEO Jensen Huang has made huge bets on AI. His vision was that GPUs – or graphics processing units – would be at the heart of this technology. No doubt, this was spot on and NVDA has become a growth machine. In the latest quarter, revenue more than tripled year-over-year to $18.1 billion. But Nvidia is more than a chip company. It has a full-stack technology platform for running sophisticated AI applications. These include networking capabilities, as well as a software system called Cuda that is essentially an operating system.  These assets have turned Nvidia's advantages into a powerful moat. As AI continues to grow, so will Nvidia.  Meta Platforms is starting to rev up growth again. In the third quarter of 2023, the Facebook parent saw revenue jump by 23% year-over-year to $34.1 billion. In addition to seeing traction with Instagram reels, AI is becoming a factor, helping to improve the results with advertising. Given Meta's large user base, even a small enhancement can have a big impact on the top line. In the meantime, the company has been investing in its own large-language model, called Llama 2. This has become the number one choice for those companies looking for open source platforms. In the near term, the main catalyst for Meta is likely to be the upcoming U.S. presidential election. This will create a surge in advertising – and a considerable chunk will go to Meta.  Apple has suffered from declining sales as its smartphone business has matured, but the company should not be counted out. Apple has the benefit of a large customer base that can be leveraged, such as with its lucrative services business. \"They offer Apple TV, Music and other services,\" said Glenn Tompkins, senior global market strategist at VectorVest. \"People are deeply engaged in the ecosystem and many will never leave.\" The company may also get a boost from AI. Recently, Apple announced the release of MLX, which is an open source framework for Apple Silicon. It is a platform to help build AI projects and it has already shown promise against rival systems.  Alphabet's Google has seen a rebound in its core search and advertising business, but there worries remain about its AI initiatives. Even though the company's researchers pioneered generative AI, it was slow to commercialize it. But Google is making up for lost ground. Its new model, Gemini, appears to be state-of-the-art. The company is also aggressively implementing the system across its apps. Additionally, Google is developing new AI products, such as for code development, cybersecurity and healthcare. These could open up new growth opportunities for the company.  Despite competitors like Ford Motors (F) and General Motors (GM) spending huge amounts of money on electric vehicles (EVs), Tesla remains the category leader. It has the advantages of a modern infrastructure for production and charging networks. \"We expect the focus of the story to shift towards share gains and deeper penetration within the auto space,\" says Tejas Dessai, AVP and research analyst at Global X. \"Tesla's attempt to ignite a price war on the back of massive operational efficiencies from scale is a net positive for consumers and will likely continue to keep the pressure on competition. Meanwhile, real margin capture for Tesla will likely come through value-add services such as self-driving software.\" Tom Taulli has been developing software since the 1980s when he was in high school.  He sold his applications to a variety of publications. In college, he started his first company, which focused on the development of e-learning systems. He would go on to create other companies as well, including Hypermart.net that was sold to InfoSpace in 1996. Along the way, Tom has written columns for online publications such as Bloomberg, Forbes, Barron's and Kiplinger.  He has also written a variety of books, including Artificial Intelligence Basics:  A Non-Technical Introduction. He can be reached on Twitter at @ttaulli. This question is being asked more than ever these days, so here’s what you can do when it comes to making Medicare decisions while you’re still working. By Jae W. Oh\n\nPublished 28 March 24 Boosted by Truth Social stock deal, Trump is thrust into the world’s wealthiest 500 people on the Bloomberg Billionaires Index By Kathryn Pomroy\n\nPublished 27 March 24 Digital World Acquisition sizzled, too, ahead of its merger with Trump Media & Technology Group. By Karee Venema\n\nPublished 25 March 24 A fiscal year has uses for financial reporting. Here's why it's an important concept for investors to be aware of. By Will Ashworth\n\nPublished 23 March 24 The main indexes erased early losses Tuesday as mega-cap tech stock Nvidia swung higher. By Karee Venema\n\nPublished 19 March 24 The main indexes started the week strong after several mega-cap stocks rallied. By Karee Venema\n\nPublished 18 March 24 Weakness in several Magnificent 7 stocks created headwinds for the main indexes Friday. By Karee Venema\n\nPublished 15 March 24 The main indexes erased an early lead Thursday as several semiconductor stocks sold off. By Karee Venema\n\nPublished 14 March 24 Stocks took a breather Wednesday as investors looked ahead to tomorrow's inflation data. By Karee Venema\n\nPublished 13 March 24 Strong gains for Oracle and Nvidia helped the main indexes brush off hotter-than-anticipated inflation data. By Karee Venema\n\nPublished 12 March 24 Kiplinger is part of Future plc, an international media group and leading digital publisher.  Visit our corporate site.\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}