{
    "title": null,
    "date": "1/17/2024",
    "url": "https://seekingalpha.com/news/4055754-apple-crosshairs-doj-file-antitrust-case-as-soon-as-march-report",
    "text": "Scott Olson Apple (NASDAQ:AAPL) is facing yet another legal battle from global regulators as the U.S. Department of Justice could bring an antitrust case against the tech giant in short order. The case could happen as soon as March, Bloomberg reported, citing people familiar with the matter. Though the suit is expected to come in Q1, timing could slip as the Justice Department's most senior antitrust officials have not yet signed off, the news outlet added. The probe from the Justice Dept. would be centered around the restrictions that Apple has allegedly imposed on its hardware and software that hurt competitors. Spotify (SPOT) has previously filed an antitrust complaint in Europe and other companies, such as Life360's Tile, which makes a competing products to AirTags, and Beeper have made similar complaints. Cupertino, Calif.-based Apple did not immediately respond to a request for comment from Seeking Alpha. Apple shares fell around 1% in late afternoon trading on Wednesday. The Justice Dept. is currently in the middle of an antitrust case with Alphabet's (GOOG) (GOOGL) Google unit and has weighed bringing cases against other big tech companies, including Meta Platforms (META) and Amazon (AMZN). Amazon is currently facing an antitrust lawsuit from the U.S. Federal Trade Commission. News of the antitrust suit comes after the U.S. Supreme Court declined to hear a ruling related to its antitrust case over its App Store. Developers can now point users to the web to let them know about alternative payment methods, something that had been an issue as Apple (AAPL) takes a 30% commission for goods and services sold inside the app from the App Store. Last year, the 9th US Circuit Court of Appeals found Apple had run afoul of California's Unfair Competition Law when it ruled it had limited developer's abilities to communicate with users about outside or alternative payment systems. Apple (AAPL) will still take a 27% commission (down from 30% in most other scenarios) or 12% if a developer is part of the App Store Small Business Program on the external payments, according to a support page. The company said enforcing and collecting the payments, though, will be exceptionally difficult. \"Although developers are contractually obligated to pay the commission, as a practical matter, with hundreds of thousands of developers with apps on the U.S. storefronts for the iOS and iPadOS App Stores, collection and enforcement will be exceedingly difficult and, in many cases, impossible,\" Apple (AAPL) said in recent court filings. Apple was recently listed among six companies considered to be \"gatekeepers\" by Europe's Digital Markets Act, set to go into effect on March 7. If the companies do not comply with the rules laid down by the DMA, they can be fined up to 10% of global annual turnover or 20% for repeated violations, the European Commission explained. Additional steps can be taken by the EC, including requiring a gatekeeper to sell a business or parts of it or banning the respective gatekeeper from acquiring additional services related to the non-compliance. Apple (AAPL) tweaked its risk factors late last year to include new language around third party developers and potential App Store risks amid the coming regulation. "
}