{
    "title": null,
    "date": "2/9/2024",
    "url": "https://ca.finance.yahoo.com/news/ex-apple-engineer-sentenced-to-six-months-in-prison-for-stealing-self-driving-car-tech-110537599.html",
    "text": "Xiaolang Zhang, the former Apple employee who pleaded guilty to stealing information about the development of the company's self-driving vehicle, has been sentenced to 120 days in prison followed by a three-year supervised release. Zhang was arrested back in 2018 at San Jose International Airport just as he was about to board a flight to China. He initially pleaded not guilty until he changed his tune in 2022 and admitted to stealing trade secrets. In addition to serving time behind bars, he also has to pay restitution amounting to $146,984, according to the court document of his sentencing first seen by 9to5Mac. Zhang originally faced up to 10 years in prison and a fine of $250,000. The former Apple employee worked as a hardware engineer for the company's decade-old autonomous vehicle initiative codenamed Project Titan. Based on Apple's complaint, Zhang transferred a 25-page document containing engineering schematics of a circuit board for the company's self-driving vehicle to his wife's laptop via AirDrop. He also saved a copy of technical manuals that described Apple's prototype to that laptop, in addition to stealing circuit boards and a Linux server from the company's development labs. Zhang resigned from Apple following a paternity leave and a trip to China, telling the iPhone maker that he was going to work in the country for XPeng Motors. That reportedly triggered an investigation, since XPeng is also working on autonomous driving technology, which revealed that Zhang was caught on CCTV taking hardware from Apple's labs and transferring files to his wife's computer. He's expected to surrender himself by June 19, after which he will be sent to a minimum-security facility as close as possible to his home in San Jose, California. Apple's self-driving vehicle has been in the works for a decade, but it has yet to launch a product consumers can buy. Bloomberg's Mark Gurman recently reported that the company changed its plans and is now developing an EV like Tesla's instead of a full-fledged autonomous vehicle. The long-awaited Apple Car is now projected to debut no earlier than 2028. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th Trade 24 hours a day on the world's most popular platform. This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt 2024 Subaru Crosstrek Review, Pricing, and Specs Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone  They soft-launched their relationship at the supermodel's cookbook event in Miami. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret.  The \"Late Night\" comedian brutally summed up the former president's media company. Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair.  \"We love to cook and we have the family together,\" Richards tells PEOPLE Public disagreements about how to handle immigration resulted in U.S. Rep. Alexandria Ocasio-Cortez reminding Elon Musk he is an immigrant himself. Leaks from a notoriously sketchy data broker have revealed the locations of hundreds of people who visited convicted pedophile Jeffrey Epstein's Bahaman island before his 2019 arrest and subsequent death behind bars. In an investigation, Wired reports that the firm in question, Near Intelligence, "
}