{
    "title": null,
    "date": "2/24/2024",
    "url": "https://www.tekedia.com/apple-records-massive-revenue-growth-in-india-as-sales-of-iphone-surpasses-individual-eu-countries/",
    "text": "DD\n\n\nMM\n\n\nYYYY CATEGORIES PAGES   DD\n\n\nMM\n\n\nYYYY FACEBOOK \n\n\n TWITTER \n\n\n GOOGLE+ \n\n\n RSS FACEBOOK TWITTER GOOGLE+ RSS CATEGORIES PAGES  In the vibrant landscape of Apple’s global iPhone sales, the Indian market emerges as a standout performer, boasting sales figures that surpassed those of individual European Union countries, showcasing the significant impact and potential of India’s consumer base. According to a report by Morgan Stanley, the company’s revenue in India surged 42% year-on-year in 2023 to $8.7 billion. iPhone shipments grew 39% year-on-year, to 9.2 million units, making it iPhone’s fifth-largest smartphone market. Analysts from Morgan Stanley wrote, Tekedia Mini-MBA edition 14 (June 3 – Sept 2, 2024) begins registrations; get massive discounts with early registration here. Tekedia AI in Business Masterclass opens registrations here. Join Tekedia Capital Syndicate and invest in Africa’s finest startups here. “This means that in CY23, India represented 4% of iPhone shipments and revenue, up from 3% in CY22 and 1% 5 years ago. This compares to China iPhone shipments, which represented 20% of iPhone shipments and revenue in CY23 (down 1-2 points Y/Y, respectively). “Ultimately, this means that India as a standalone market is still not big enough to offset the declines we are seeing in the Chinese market today, but if India continues to grow at the same trajectory while China iPhone shipments stay flat, India would be a bigger iPhone market than China by 2027.” Driving India’s iPhone growth is increasing consumer demand for premium devices with more storage capacity rather than the latest models. The average iPhone sold in India last year had around 260GB of memory, a 26% increase over 2022, Morgan Stanley said. India became Apple’s fifth-largest iPhone market in the second quarter of 2023,  for the first time, overtaking France and Germany. India contributed close to 4% of all iPhone sales in the second quarter, growing 50% year-on-year. The top five iPhone models shipped in the country were the iPhone 13, iPhone 14, iPhone 14 Plus, iPhone 14 Pro, and iPhone 15 and they made up 86% of total sales. Apple’s significant revenue growth in India is coming after the Cupertino giant in 2023, opened two Apple stores, a significant milestone for the company, roughly 25 years after entering the South Asian market. The tech giant has been touting India as its next big growth driver amid declining sales of its flagship device. Its suppliers have also been ramping up manufacturing operations in the region amid weakening demand and regulatory pressure in China. Last year, Morgan Stanley predicted that India will likely be a major driver of Apple’s five-year revenue and installed base growth, citing Apple’s investment in manufacturing in India and the country’s economic boom. The establishment of Apple’s first retail stores and the company’s increased efforts to assemble iPhones and other products in India underscore the importance of the South Asian market, as the company’s big bet on India is already beginning to pay off. Analysts forecast that India in the next five years can account for 15 percent of Apple’s major revenue growth. This suggests that India will be just as important to Apple’s growth algorithm over the next 5+ years as China was in the last 5 years. Save my name, email, and website in this browser for the next time I comment.   Δ   © 2024 Tekedia. All rights reserved. Term & Privacy © 2024 Tekedia. All rights reserved. Term & Privacy "
}