{
    "title": "Here's Why Bireme Capital Shorted Apple (AAPL)",
    "date": "2/7/2024",
    "url": "https://finance.yahoo.com/news/why-bireme-capital-shorted-apple-062556628.html",
    "text": "Investment management company Bireme Capital recently released its fourth-quarter 2023 investor letter. A copy of the same can be downloaded here. In 2023, the fund returned 21.3% net of fees underperforming the S&P 500’s 26.2%. The fund was up 448% net since inception in 2016 vs the S&P at 161%, an annual outperformance of 11.7%. Last year was the second calendar year in a row that the fund underperformed the S&P 500, and the first since 2019. Nonetheless, the firm is particularly proud of last year’s returns because 2023 was an extraordinarily tough year for the relative performance of active value managers. In addition, please check the fund’s top five holdings to know its best picks in 2023. Bireme Capital featured stocks such as Apple Inc. (NASDAQ:AAPL) in its Q4 2023 investor letter. Headquartered in Cupertino, California, Apple Inc. (NASDAQ:AAPL) is a multinational technology company that designs and manufactures smartphones, personal computers, tablets, wearables, and accessories. On February 6, 2024, Apple Inc. (NASDAQ:AAPL) stock closed at $189.30 per share. One-month return of Apple Inc. (NASDAQ:AAPL) was 1.67%, and its shares gained 24.61% of their value over the last 52 weeks. Apple Inc. (NASDAQ:AAPL) has a market capitalization of $2.923 trillion. Bireme Capital stated the following regarding Apple Inc. (NASDAQ:AAPL) in its fourth quarter 2023 investor letter: \"We also shorted Apple Inc. (NASDAQ:AAPL) in Q3. At our average price of around $190 per share, Apple traded at 30x peak earnings and a $2.8 trillion market cap. While Apple is indeed a magnificent company, this valuation is simply too rich for a business with a substantial cyclical component. The company is projected to grow revenue at a mere 4% rate between 2022 and 2026. We think the total return on Apple stock will be lower than the market, and especially our long positions, over the next few years.\" Pixabay/Public Domain Apple Inc. (NASDAQ:AAPL) is in 10th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 134 hedge fund portfolios held Apple Inc. (NASDAQ:AAPL) at the end of third quarter which was 135 in the previous quarter. We discussed Apple Inc. (NASDAQ:AAPL) in another article and shared the list of best American tech stocks to buy according to analysts. . In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: 12 Most Popular Dating Sites and Apps in the US 11 Best Hair Care Stocks To Buy Now 20 Dating Sites with the Most Users in 2024 Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}