{
    "title": "Apple Defeats Lawsuit Claiming It Overpaid Tim Cook and Other Execs",
    "date": "2/8/2024",
    "url": "https://www.macrumors.com/2024/02/08/apple-defeats-lawsuit-overpaid-tim-cook/",
    "text": "Apple will not have to face an investor lawsuit accusing it of overpaying CEO Tim Cook and other top executives by tens of millions of dollars, after a federal judge on Wednesday dismissed the case (via Reuters). The plaintiff, a pension fund affiliated with the International Brotherhood of Teamsters, said Apple in 2021 and 2022 awarded a respective $92.7 million and $94 million to Cook and four other executives by improperly calculating the value of performance-based stock awards. The plaintiff argued its compensation committee intended to award just $77.5 million each year. The alleged error was attributed by the pension fund's lawyers to the committee's improper calculation of the restricted stock unit's \"fair values\" at the time of the grants, and said it misled shareholders who would be casting advisory votes on executive compensation, known as \"say-on-pay.\" U.S. District Judge Jennifer Rochon disagreed, however, saying Apple described its pay methods in detailed compensation tables in its 2023 proxy statement \"precisely,\" as securities laws and U.S. Securities and Exchange Commission rules require. The Manhattan judge also found no proof that Apple's board of directors acted improperly in awarding pay, and said the plaintiff did not give the board enough time to consider its objections before suing. Apple proxy filings show Cook's compensation totaled about $99 million in both 2021 and 2022, including more than $82 million of stock awards each year. Cook's total pay declined to $63.2 million for 2023. Get weekly top MacRumors stories in your inbox. Our comprehensive guide highlighting every major new addition in iOS 17, plus how-tos that walk you through using the new features. App Store changes for the EU, new emoji, Podcasts transcripts, and more. Get the most out your iPhone 15 with our complete guide to all the new features. A deep dive into new features in macOS Sonoma, big and small. Revamped models with OLED displays, M3 chip, and redesigned Magic Keyboard accessory. Updated 10.9-inch model and new 12.9-inch model, M2 chip expected. Apple's annual Worldwide Developers Conference will kick off with a keynote on June 10. Expected to see new AI-focused features and more. Preview coming at WWDC in June with public release in September. 22 hours ago by Tim Hardwick 23 hours ago by Tim Hardwick 1 day ago by Juli Clover 2 days ago by MacRumors Staff 3 days ago by MacRumors Staff  MacRumors attracts a broad audience of both consumers and professionals interested in the latest technologies and products. We also boast an active community focused on purchasing decisions and technical aspects of the iPhone, iPad, Mac, and other Apple platforms. "
}