{
    "title": null,
    "date": "3/29/2024",
    "url": "https://www.hindustantimes.com/business/tech-layoffs-march-2024-apple-dell-ibm-and-other-companies-cut-jobs-complete-details-here-101711737652653.html",
    "text": "Subscribe Now! Get features like Tech layoffs March 2024: The technology industry saw layoffs in the month of March as major companies downsized their workforces amid challenges faced by the sector. Ericsson, Dell and Apple saw job cuts in March due to various factors. While Ericsson cut 1,200 jobs in Sweden amid declining demand for 5G equipment, Dell reduced its workforce as part of cost-cutting measures. Ericsson layoffs: Ericsson announced that it will lay off about 1,200 employees in Sweden as demand for 5G network equipment slowed down. The cuts are a part of the Swedish telecom giant's cost-saving plan for 2024. Ericsson cited expectations of a “challenging mobile networks market” this year and had laid off 8,500 workers, or 8% of its workforce, last year as well. Dell layoffs: Dell cut its workforce as part of broader cost-cutting measures, the company said. In February, Dell’s headcount stood at nearly 1,20,000, which is down from about 1,26,000 in 2023. The layoffs come at a time when there is slow demand for Dell’s PCs which resulted in a 11% drop in Q4 revenue. Apple layoffs: Bloomberg reported that Apple ceased its internal efforts to develop microLED displays for a future Apple Watch model owing to which it reorganised its display engineering teams and laid off several dozen employees across the United States and Asia. IBM layoffs: International Business Machines Corp (IBM) announced layoffs without informing about the specific number of job cuts in the company's marketing and communications division. The decision was disclosed in a seven-minute meeting by Jonathan Adashek, the chief communications officer at IBM, CNBC reported citing unnamed sources . Turnitin layoffs: Plagiarism detection firm Turnitin laid off around 15 people earlier this year, TechCrunch reported after the company's CEO Chris Caren said last year that Artificial Intelligence would enable Turnitin to reduce its engineering headcount by 20% within 18 months. Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}