{
    "title": "Apple just can't catch a break",
    "date": "3/18/2024",
    "url": "https://ca.news.yahoo.com/apple-just-cant-catch-break-151807597.html",
    "text": "It's been a rough start to the year for Apple, with bad news this week adding to its problems. It got hit by a nearly $2 billion fine from the EU and a reported decline in China iPhone sales. Still, some analysts believe Apple could bounce back if it successfully shifts its focus toward AI. Bad news keeps piling up for Apple. On Monday, the European Commission slammed the iPhone maker with a nearly $2 billion fine after ruling that it restricted competition for music-streaming services such as Spotify. The very next day, a report from Counterpoint Research found that Apple's iPhone sales in China — a major market — had dropped by 24% in the first six weeks of 2024. That also means the iPhone has been dethroned from its No. 1 smartphone spot in the country, falling behind competitors including Vivo, Huawei, and Honor. And all this comes just days after Apple killed its long-worked-on self-driving-car project, dubbed \"Project Titan.\" It's said to have shuttered that project to focus on artificial intelligence. This string of negative headlines has left some concerned that Apple has lost its mojo. So far, shares have dropped by about 12% this year, while the Nasdaq has gained. Plus, Apple has been taking heat for falling behind peers in its AI efforts, with the move away from Project Titan seen as a sign that it's scrambling to catch up. And the European Union forced Apple to crack open its App Store — a move it wasn't at all happy about that will almost certainly net it less money from developers. \"I think the last three months is as rough as it gets for Apple,\" Gene Munster, a managing partner at Deepwater Asset Management, told Business Insider. \"There's a sense that their franchise is in jeopardy.\" But some analysts say Apple hasn't lost all its luster. \"There are a lot of factors swirling around Apple today, but I do think the core of the business is fundamentally intact,\" Toni Sacconaghi, a senior research analyst at Bernstein, said Tuesday on CNBC's \"Squawk Box.\" \"This is a company that has 2 billion devices in its install base and about 1.2 billion unique users, and they have a capability to develop new products that consumers want to go and try.\" Dan Ives, a technology analyst at Wedbush Securities, concurs. He told BI that while Apple had \"definitely had a few roadblocks over the course of the past couple of weeks,\" he remained bullish on the company and believed it could eventually bounce back. \"Over the last decade we have been through many challenging periods in the Apple story, and we handheld investors through these stormy periods just like today,\" Ives wrote in a recent analyst note. \"This is no different, and in our view, brighter days will be ahead.\" After all, Apple may still have what it takes to win over consumers. Just look at the Vision Pro, Apple's mixed-reality headset that got more than 200,000 units in preorders before its February launch and had customers lining up to buy it. While the $3,500 spatial-computing device didn't win over everyone — some returned it after finding its design a bit too clunky — it did demonstrate Apple still had the wow factor when introducing products and services, which may help it in the future. \"That platform of 1.2 billion users isn't going anywhere, and Apple has the opportunity to leverage that going forward,\" Sacconaghi said on CNBC. That doesn't mean the road ahead is easy. With growing pressures in the hot, new AI space, there have been mounting questions about whether Apple is lagging. But Sacconaghi said it didn't have to be a leader in generative AI to win. \"Apple has this powerful install base, and the question is: Can it use AI to add more value to that install base? And I think it can,\" the analyst said on CNBC. While Apple has held its AI cards close to its chest so far, \"we think Apple will have AI-enabled capabilities in its next phone coming out in September,\" he added. But if it doesn't buckle down on its AI strategy, the tech titan may find it's outdone by other major companies, Ming-Chi Kuo, an analyst, wrote in a post on X, formerly Twitter. \"If Apple fails to launch generative AI services this year that are better than market expectations, Nvidia's market value will most likely surpass Apple,\" Kuo said. Apple didn't respond to a request for comment from BI before publication. Read the original article on Business Insider AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. The post 5 Artificial Intelligence (AI) Stocks That Could Be Millionaire Makers appeared first on The Motley Fool Canada. Some iPhone owners have received a series of notifications about resetting their Apple ID password, followed by a spoofed phone call.  Ping Ping Ping A Boston Dynamics SPOT robot that was sent inside a home by Massachusetts state police was shot three times by a person barricaded inside. As the Associated Press reports, the robotics company believes it's the first time one of its robotic dogs has been shot. The remotely-controlled quadruped was deployed earlier this […] While it's easy to draw comparisons to the Microsoft - OpenAI alliance, Wednesday's move by AWS actually signals just how vulnerable Amazon's cloud empire has become. HONG KONG (AP) — Chinese telecoms gear company Huawei Technologies has reported its profit more than doubled last year as its cloud and digital businesses thrived in spite of U.S. sanctions. The Shenzhen-based company reported a net profit of 87 billion yuan ($12 billion), helped by strong sales and an improved product portfolio. Revenue jumped nearly 10% from a year earlier, to 704.2 billion yuan ($97.4 billion). Huawei’s rotating chairman Ken Hu said the company’s figures were in line with for IBKR EventTrader - A new, straightforward way to trade CME futures markets Apple's overseas suppliers have increased production of the company's new iPad models and plans to launch them in early May, Bloomberg News reported on Thursday citing people with knowledge of the matter.  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said. Spot, a robotic dog created by tech company Boston Dynamics, is being used across the nation to help assist law enforcement in the field. (Bloomberg) -- Huawei Technologies Co. sustained its run of strong quarterly profit growth, building on the resurgence of its consumer business against Apple Inc.’s iPhone and the rise of its cloud division against incumbent Alibaba Group Holding Ltd.Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the Play this game for 1 minute and see why everyone is addicted. (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b Taiwan's Foxconn hit a record closing high on Thursday as it is set to benefit from growth in AI servers. Elsewhere, CEOs of U.S. chip makers met Chinese leader Xi Jinping. ANCHORAGE, Alaska (AP) — A headless robot about the size of a labrador retriever will be camouflaged as a coyote or fox to ward off migratory birds and other wildlife at Alaska's second largest airport, a state agency said. The Alaska Department of Transportation and Public Facilities has named the new robot Aurora and said it will be based at the Fairbanks airport to “enhance and augment safety and operations,\" the Anchorage Daily News reported. The transportation department released a video of You will never turn off your computer again. The company is among the fastest-growing cybersecurity players based on my peer analysis Caution is needed even with this famous tech behemoth and its fast-growing services business Amazon has been a huge staging ground for the proliferation of AI-generated spam. In fact, as we noticed earlier this year, its marketplace has already started to fill up with shoddy AI-generated listings — at the same time, of course, that Amazon itself is working on the same tech. Now, the consequences of this AI […] Improve grammar, word choice, and sentence structure everywhere you work. Write better with Grammarly. \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. 了解玩家多年來喜歡遊玩 Taonga 的原因。 加入熱帶農業和冒險活動吧。（立即遊戲） Trump's former national security adviser shut down a comparison between the ex-president and Julius Caesar. Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million "
}