{
    "title": "Apple Inc. (NASDAQ:AAPL) Short Interest Up 14.6% in February",
    "date": "3/15/2024",
    "url": "https://www.defenseworld.net/2024/03/16/apple-inc-nasdaqaapl-short-interest-up-14-6-in-february.html",
    "text": "Posted by Defense World Staff on Mar 16th, 2024 Apple Inc. (NASDAQ:AAPL – Get Free Report) was the target of a significant increase in short interest in February. As of February 29th, there was short interest totalling 111,930,000 shares,  an increase of 14.6% from the February 14th total of 97,670,000 shares. Based on an average daily volume of 58,190,000 shares, the days-to-cover ratio is currently 1.9 days. In related news, Director Arthur D. Levinson sold 100,000 shares of the business’s stock in a transaction on Thursday, February 29th. The shares were sold at an average price of $180.94, for a total transaction of $18,094,000.00. Following the transaction, the director now directly owns 4,434,576 shares in the company, valued at $802,392,181.44. The sale was disclosed in a filing with the SEC, which is available through this link. 0.06% of the stock is currently owned by insiders. Institutional investors and hedge funds have recently made changes to their positions in the stock. Wyrmwood Management LLC increased its position in  Apple by 69.0% during the 4th quarter. Wyrmwood Management LLC now owns 169 shares of the iPhone maker’s stock valued at $33,000 after purchasing an additional 69 shares during the period.  Atlantic Private Wealth LLC acquired a new stake in  Apple during the 1st quarter valued at approximately $30,000.  Gilfoyle & Co LLC increased its position in  Apple by 118.0% during the 4th quarter. Gilfoyle & Co LLC now owns 218 shares of the iPhone maker’s stock valued at $40,000 after purchasing an additional 118 shares during the period.  A.P. Gilfoyle & Co. L.P. acquired a new stake in  Apple during the 4th quarter valued at approximately $39,000.  Finally, Cheyne Capital Management UK LLP increased its position in  Apple by 200.0% during the 3rd quarter. Cheyne Capital Management UK LLP now owns 275 shares of the iPhone maker’s stock valued at $212,000 after purchasing an additional 550 shares during the period. Institutional investors own  58.51% of the company’s stock. AAPL opened at $172.62 on Friday. Apple has a twelve month low of $151.64 and a twelve month high of $199.62. The company has a 50-day simple moving average of $183.39 and a 200 day simple moving average of $183.34. The company has a quick ratio of 1.02, a current ratio of 1.07 and a debt-to-equity ratio of 1.28. The stock has a market capitalization of $2.67 trillion, a price-to-earnings ratio of 26.89, a P/E/G ratio of 2.06 and a beta of 1.29. Apple (NASDAQ:AAPL – Get Free Report) last posted its quarterly earnings data on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share for the quarter, topping the consensus estimate of $2.09 by $0.09. The business had revenue of $119.60 billion during the quarter, compared to analysts’ expectations of $117.99 billion. Apple had a net margin of 26.16% and a return on equity of 156.04%. Apple’s revenue was up 2.1% compared to the same quarter last year. During the same quarter in the prior year, the business posted $1.88 earnings per share.  Analysts predict that  Apple will post 6.55 EPS for the current fiscal year. The business also recently announced a quarterly dividend, which was paid on Thursday, February 15th. Stockholders of record on Monday, February 12th were issued a $0.24 dividend. The ex-dividend date of this dividend  was Friday, February 9th. This represents a $0.96 dividend on an annualized basis and a dividend yield of 0.56%. Apple’s dividend payout ratio (DPR) is currently 14.95%. AAPL has been the topic of a number of recent analyst reports. Wedbush  restated an “outperform” rating and set a $250.00 target price on shares of Apple in a report on Wednesday, February 28th. Needham & Company LLC  restated a “buy” rating and set a $220.00 target price on shares of Apple in a report on Friday, February 2nd. DA Davidson initiated coverage on shares of Apple in a report on Wednesday, January 3rd. They issued a “neutral” rating and a $166.00 price objective on the stock. Oppenheimer  reiterated an “outperform” rating and issued a $200.00 price objective on shares of Apple in a report on Friday, February 2nd. Finally, Barclays decreased their price objective on shares of Apple from $160.00 to $158.00 and set an “underweight” rating on the stock in a report on Friday, February 2nd. One analyst  has rated the stock with a sell rating, eleven have given a hold rating, twenty-one have assigned  a buy rating and one  has assigned  a strong buy rating to the company’s stock. According to data from MarketBeat, the stock presently has a consensus rating of “Moderate Buy” and an average price target of $205.27. View Our Latest Report on Apple (Get Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. HashiCorp (NASDAQ:HCP) Rating Increased to Hold at StockNews.com Color Star Technology Co., Ltd. (NASDAQ:ADD) Short Interest Update "
}