{
    "title": null,
    "date": "3/23/2024",
    "url": "https://www.benzinga.com/news/24/03/37905532/apple-slams-dangerous-doj-lawsuit-tim-cooks-iphone-suggestion-returns-to-haunt-and-potential-google",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Apple Inc. AAPL found itself making headlines last weekend, with the U.S. Department of Justice’s (DOJ) antitrust lawsuit taking center stage. The company’s CEO, Tim Cook, was thrust into the limelight as a 2022 conversation surfaced in the lawsuit, sparking controversy. Meanwhile, Apple is making strides in artificial intelligence, unveiling a new multimodal AI and considering integrating Google’s Gemini AI model into its iPhone software. Let’s break it down. DOJ Lawsuit: Apple Fights Back Apple has come out swinging against a lawsuit filed by the DOJ that the company alleges threatens its core values and innovation capabilities. The tech giant voiced its concerns, stating that the lawsuit compromises the essence of its products and their competitive markets. The company expressed its belief that if the lawsuit is successful, it would impede Apple’s ability to produce the high-quality technology that users have come to expect. Read the full article here. Trending: Here’s why you should never copy the CIA’s venture capital investment strategy. Tim Cook’s iPhone Suggestion Returns to Haunt A conversation from 2022 featuring Apple CEO Tim Cook has come under the DOJ’s scrutiny in its antitrust lawsuit against the company. The DOJ has cited Cook’s lack of enthusiasm for improving the messaging experience between iPhone and non-iPhone users as evidence in the “dangerous” antitrust lawsuit. The conversation in question involved Cook responding to a journalist’s query about the difficulty of sending media files from an iPhone to an Android device. Read the full article here. Apple and Google: A Potential Partnership on the Horizon? In a potential game-changing move, Apple is reportedly in talks to integrate Alphabet Inc.'s GOOG GOOGL Google Gemini into the iPhone. The tech giant is in active negotiations with Google to license Gemini, a set of generative AI models, to power new iPhone software features. If successful, this deal would build on the existing search partnership between the two tech giants. Read the full article here. Apple Unveils New Multimodal AI Apple researchers have made significant progress in AI, revealing new techniques for training large language models using text and images. This could lead to more powerful and flexible AI systems. Read the full article here. Apple Vision Pro Gets Nvidia Boost Nvidia Corp. NVDA has announced a new software framework to integrate with Apple Vision Pro’s high-resolution displays. The framework, announced at Nvidia’s annual GTC event, is based on Omniverse Cloud APIs and allows developers to send their Universal Scene Description industrial scenes to the Nvidia Graphics Delivery Network (GDN). The GDN is a global network of graphics-ready data centers capable of streaming advanced 3D experiences to the Apple Vision Pro. Read the full article here. Read Next: This Trader Lost $784,000 FOMO-Buying The Latest Hyped Meme Coin Photo courtesy: Shutterstock Engineered by\n        Benzinga Neuro, Edited by\n        \n\n              Rounak Jain The GPT-4-based Benzinga Neuro content generation system exploits the\n        extensive Benzinga Ecosystem, including native data, APIs, and more to\n        create comprehensive and timely stories for you.\n        Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}