{
    "title": "Apple supplier Foxconn's Q4 profit jumps 33% y/y, beats forecasts",
    "date": "3/13/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024:newsml_L2N3FS0D3:0-apple-supplier-foxconn-s-q4-profit-jumps-33-y-y-beats-forecasts/",
    "text": "Apple AAPL supplier Foxconn 2317 has adopted a far more bullish outlook for this year, saying on Thursday that it expected a significant rise in revenue driven by booming demand for artificial intelligence servers. The upbeat tone comes after a forecast-beating 33% jump in net profit for the fourth quarter. It also contrasts sharply with remarks by Foxconn Chairman Young Liu in November that the world's largest contract electronics maker had \"relatively conservative and neutral\" expectations for 2024. \"We see very strong demand for AI servers from our clients,\" Liu told an online earnings conference, adding that he expects the business to have revenue growth of more than 40% this year. The AI server market was likely to see 30% growth each year between 2023 and 2025, and Foxconn's growth would be in line with that or even higher, he said. October-December net profit for the Taiwanese company came in at T$53.1 billion ($1.7 billion), handily beating a T$43.5 billion LSEG SmartEstimate. The 33% surge in profit was the strongest year-on-year growth logged for a quarter since March 2021. In addition to robust demand for AI servers, it also had  better-than-expected sales of cloud and networking products and smart consumer electronics. Apple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts' estimates. In the fourth quarter, consumer electronics including smartphones accounted for 58% of Foxconn's revenue while cloud and networking products which include servers contributed 20%. Although it expects healthy growth over 2024, Foxconn cautioned that first-quarter revenue was set to come in lower than the same period a year ago when sales surged after pandemic restrictions were lifted in China. Chief Financial Officer David Huang also said that 2024 growth in capital expenditure would at least match last year's rate, partly due to the company's drive to diversify investment around the world and expand into areas such as electric vehicles and semiconductors. Foxconn's capital expenditure climbed 14% in 2023 to around T$111.7 billion ($3.6 billion). ($1 = 31.5090 Taiwan dollars) Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @bradfairbridge @rajbuzzz @Kevin Trinh @Cenobar @arcanebear @udcovers @fx.today @_dalton16 @TradingView @mytradingsetup @ftmocom @chartfeed @olka_gadzieva @mytradingsetup @satoshi_empire @MidasPls @Zeiierman Trading @Onlnternet Whatever the trade "
}