{
    "title": "Dubai real estate: Apple Vision Pro to impact property sales, agents must \nadapt",
    "date": "3/25/2024",
    "url": "https://www.arabianbusiness.com/industries/real-estate/dubai-real-estate-apple-vision-pro-to-impact-property-sales-agents-must-adapt",
    "text": "بالعربية Русский  Arabian Business Real Estate > Dubai real estate: Apple Vision Pro to impact property sales, agents must adapt by\nNicole Abigael The augmented reality technology promises to transform property viewing and buying process, Allsopp & Allsopp CEO believes that it is a ‘huge opportunity’ The launch of Apple’s newest gadget has made waves on social media as videos surface of business professionals sporting the giant VR box across their faces while carrying out daily tasks. Real estate experts predict that this innovative augmented reality device will transform how people interact with and perceive the property market. “Following its official release in the region, I truly think it will bring a new level of immersion into the whole buying property process. In particular, it will create a huge opportunity for developers launching off-plan properties,” Carl Allsopp, CEO of Allsopp & Allsopp Group said in an exclusive interview with Arabian Business. Foreseeable opportunities with the gadget include like-for-like walkthroughs of homes before it being built or without having to visit the location in-person. Allsopp believes that, “In the real estate sector, its use will make viewings 10 times better, as you can feel, move, and experience the real feeling of what it would be like to live in that house.” The glasses also incorporate advanced spatial mapping technology, allowing users to visualise how a property would look with different colour schemes, furniture arrangements, and even renovations. “I believe there is a huge opportunity for developers to showcase their newly launched properties, showcasing what a property could look like – from the kitchen counters to bathroom space – you can even step out onto a balcony to see what the view is like from your bedroom window,” he said. Agents can now conduct virtual property tours with clients, regardless of their geographical location. This breakthrough eliminates the need for time-consuming and costly in-person visits, expanding the market reach for both buyers and sellers. Allsopp recognises the content as the biggest driver of real estate transactions, agents are increasingly expanding their online presence to showcase property features to drive investor interest. “This will be great for agents too as it could lead to more qualified inquiries from buyers, save time on viewings, and remove the need for them to be on the field as much filming 2D videos – they can instead provide their buyers and sellers with an immersive 3D experience,” he said. Furthermore, Vision Pro enhances the efficiency of property searches. Users have the the option to walk down a street or neighbourhood while wearing the glasses, and relevant property information, such as pricing, square footage, and availability, will be displayed in real-time. This streamlined process saves time for both buyers and agents, enabling them to focus on properties that truly match their needs. Emphasising the advantage, Allsopp said, “2D vs. 3D viewing – in 3D you can see more, you can move around the property, and even hear the sounds of the neighbourhood – like birds chirping or children playing. It will be very helpful for buyers to experience what living there could be like.” Aside from all the advantages of the technology, it could cause drastic shifts in responsibilities and roles and the overall functioning of the property market. There is also a major factor that accompanies the acceptance of this technology as part of daily work – the cost. The device itself can cost around $3,500 and this excludes further costs to make it adaptable to the specific needs of the real estate company, including building apps and more. “The device itself is not cheap,” Allsopp said, adding that, “Those who invest and take risks early on could benefit the most in years to come.” “Yes, there will be an added cost, but I do not think it will place any hurdles in acceptance – times are changing and everyone is evolving with them,” he explained. Industry experts predict that the Apple Vision Pro will have a profound impact on the real estate market. With its immersive and interactive capabilities, it has the potential to attract new buyers, accelerate the property search process, and enhance the overall efficiency of the industry. “It may take a few years to get there, but I am excited to see what’s in store,” Allsopp concluded. Follow us on Nicole Abigael is a reporter for Arabian Business, a journalist with a knack for unravelling intricate stories across several topics including but not limited to economics, politics, business, entrepreneurship,...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tMore by Nicole Abigael  "
}