{
    "title": "Amazon adds 'frequently returned' warning label to Apple's FineWoven iPhone \ncases after slew of one-star reviews",
    "date": "3/8/2024",
    "url": "https://ca.news.yahoo.com/amazon-adds-frequently-returned-warning-182650933.html",
    "text": "Amazon labeled Apple's FineWoven iPhone 15 case as a \"frequently returned item.\" The tech giant flagged the case to warn customers to read the reviews — many of which are one-star. Some reviewers cited the quality and durability of the cases as reasons for returns. Apple's FineWoven iPhone 15 cases have been dragged on the internet for their seemingly questionable quality — and some customers want a refund. As of March 1, Amazon has labeled Apple's FineWoven Case as a \"frequently returned item.\" The warning encourages users to \"check the product details and customer reviews\" to learn more about the $59 case. It reflects how dissatisfied some customers are with it, the e-commerce giant's product listing for the case shows. Customer reviews for the product seem to be divided. While 45% of 628 reviewers gave the product five out of five stars, 32% gave it one out of five stars, the listing shows. Those who left one-star reviews and mentioned a return complained about the quality and durability of the case. \"I didn't like it at all,\" one customer wrote in a review titled \"Disappointed.\" \"The material is very poor. And the color doesn't match the picture.\" \"Not sure that quality is worth the price,\" another reviewer wrote. \"Seriously feels cheap and easily scratches. Stained easily.\" One reviewer said they returned the case after using it for two days and would not buy another Apple-made case until the company brought back its leather ones. Amazon did not respond to Business Insider's request for comment when asked how the site determines when to flag a product as a \"frequently returned item.\" The online-retail giant rolled out the return tag in March 2023 to encourage customers to do their research before buying a product, The Information reported. The warning appeared on products such as the Pro-Ject Automat A1 record player and some dresses, The Information reported, though the sign is no longer on their Amazon listings. Apple did not respond to BI's request for comment when asked if the company would improve the product to address customer concerns. FineWoven case users aren't just complaining about the product on the online-retail site. Since Apple's latest iPhone case hit the market last September, users have turned to social media to share their thoughts. In a poll on X from late February, over half of 3,324 respondents voted that the iPhone case is a \"piece of junk.\" Only 17.9% said the case \"has held up well.\" In response to the poll, users added their own two cents. Users commented things such as, \"This product is the worst Apple has even released,\" and that the case looks like it's been \"dragged through the jungle\" along with photos of their bruised cases. The appalling state of an @Apple “FineWoven” (e.g. real leather substitute) premium iPhone Pro case after only 4 months of standard real-world use: this product is the worst Apple has even released - it should be withdrawn and customers should receive a fully refund & apology. pic.twitter.com/WnyFN2HhPk — Stuart Shelton (@srcshelton) February 10, 2024 \"I've been waiting for the CDC to show up at my house to declare it a biomedical concern,\" Joanna Stern, a tech reviewer, wrote in The Wall Street Journal's \"Tech Things\" newsletter after using the case for five months. Read the original article on Business Insider AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. The post 5 Artificial Intelligence (AI) Stocks That Could Be Millionaire Makers appeared first on The Motley Fool Canada. McALLEN, Texas (AP) — A Texas woman who was charged with murder over self-managing an abortion and spent two nights in jail has sued prosecutors along the U.S.-Mexico border who put the criminal case in motion before it was later dropped. The lawsuit filed by Lizelle Gonzalez in federal court Thursday comes a month after the State Bar of Texas fined and disciplined the district attorney in rural Starr County over the case in 2022, when Gonzalez was charged with murder in “the death of an individ  Kim Kardashian is facing a lawsuit filed Wednesday claiming the celebrity incorrectly showcased some of her furniture as Donald Judd originals, TMZ reported. The Donald Judd Foundation, which manages the legacy of the late artist, points to a specific video Kardashian posted to YouTube in 2022 — that’s since been removed — but drew over 3.6 million views and featured a tour of her SKKN office ... Alex Murdaugh failed a polygraph test administered as part of the plea agreement for the disgraced former attorney’s raft of financial crimes, violating the deal, which required his truthfulness, federal prosecutors said in a court filing Tuesday. In 2019, Aurora and its peers in Canada’s cannabis sector were under immense pressure to reassure investors as stocks crashed from dizzying highs.  Some iPhone owners have received a series of notifications about resetting their Apple ID password, followed by a spoofed phone call. The Donald Judd Foundation has filed a lawsuit against Kim Kardashian, alleging that she falsely attributed the design of her tables and chairs to the late minimalist artist. Ping Ping Ping A Boston Dynamics SPOT robot that was sent inside a home by Massachusetts state police was shot three times by a person barricaded inside. As the Associated Press reports, the robotics company believes it's the first time one of its robotic dogs has been shot. The remotely-controlled quadruped was deployed earlier this […] He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Maritime law experts said Grace Ocean Private Ltd will almost certainly try to limit its liability in lawsuits expected to arise from the disaster. Tony Bobulinski, a former associate of Hunter Biden, filed a $30 million defamation lawsuit against Fox News host Jessica Tarlov over comments about his legal fees, which she corrected a day later. The suit, filed Thursday in the U.S. District Court for the Southern District of New York, alleged Tarlov “lied” last week when she initially… Apple's overseas suppliers have increased production of the company's new iPad models and plans to launch them in early May, Bloomberg News reported on Thursday citing people with knowledge of the matter.  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  (Bloomberg) -- Huawei Technologies Co. sustained its run of strong quarterly profit growth, building on the resurgence of its consumer business against Apple Inc.’s iPhone and the rise of its cloud division against incumbent Alibaba Group Holding Ltd.Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b Taiwan's Foxconn hit a record closing high on Thursday as it is set to benefit from growth in AI servers. Elsewhere, CEOs of U.S. chip makers met Chinese leader Xi Jinping. 連續13日閃購，PS5 Slim、Marshall、Switch OLED、AirPods Pro 2、DJI等人氣產品平到笑！ ANCHORAGE, Alaska (AP) — A headless robot about the size of a labrador retriever will be camouflaged as a coyote or fox to ward off migratory birds and other wildlife at Alaska's second largest airport, a state agency said. The Alaska Department of Transportation and Public Facilities has named the new robot Aurora and said it will be based at the Fairbanks airport to “enhance and augment safety and operations,\" the Anchorage Daily News reported. The transportation department released a video of Kim Kardashian is being sued by late artist Donald Judd’s foundation over claims her minimalist office furniture was designed by Judd The company is among the fastest-growing cybersecurity players based on my peer analysis 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ A court in Minnesota has ordered MyPillow to be evicted from the warehouse it formerly used. MyPillow founder, Mike Lindell, a prominent election denier, told The Associated Press that the eviction is a formality because the landlord wants to take the property back. The Minneapolis warehouse is approximately 125,000 square feet and has been leased… Caution is needed even with this famous tech behemoth and its fast-growing services business NEW YORK (AP) — A Texas federal judge on Thursday accused the major banking industry groups and U.S. Chamber of Commerce of venue shopping in their lawsuit against the Consumer Financial Protection Bureau, a major win for the federal regulator. The bureau had argued the only reason banks filed their lawsuit in Texas was to increase their chance of a favorable ruling. Judge Mark Pittman ruled that the lawsuit should be transferred to Washington, where the banking lobby has armies of lawyers able "
}