{
    "title": "Apple ends development of its EV, in this week's R&D 100 - Research & \nDevelopment World",
    "date": "3/7/2024",
    "url": "https://www.rdworldonline.com/apple-ends-development-of-its-ev-in-this-weeks-rd-100/",
    "text": "Research & Development World By Tim Studt | March 7, 2024  The R&D World Index (RDWI) for the week ending March 1, 2024, closed at 3,643.74 for the 25 companies in the RDWI. The Index was up 0.64% (or 23.76 basis points). Twelve RDWI members gained value last week from 0.17% (Johnson & Johnson) to 4.70% (Toyota). Thirteen RDWI members lost value the previous week from -0.08% (Stellantis NV) to -4.74% (Alphabet/Google). Click to enlarge. Electric vehicle (EV) maker Lucid Motors, Newark, California, announced last week that they are establishing a new engineering and R&D hub in Southfield, Michigan. The company plans to require 50,000 to 75,000 ft2 of space for their laboratory and commercial purposes. The project will create 262 “high-wage” jobs over the next three years with a capital investment of $10 million. The Michigan Business Development Program will support the initiative with a $6 million grant. The company chose this site because Michigan is ranked number one in automotive and mobility R&D. Lucid is also building a three million ft2 warehouse and manufacturing addition at its advanced manufacturing plant in Casa Grande, Arizona. RDW Index member Apple, Cupertino, California, announced internally last week that it had ended its decadelong effort to build its own EV. The secret group within Apple, known as Project Titan, will instead ramp up its efforts and R&D investments in generative AI with some EV-focused employees shifting to the AI group and others facing layoffs. Apple invested billions of dollars in Project Titan with several rounds of restructuring and shifting strategies over the past ten years. At one point, Tesla’s CEO Elon Musk considered selling Tesla to Apple, but Apple’s CEO Tim Cook rejected the offer. Medical device maker Medtronic, Minneapolis (operational HQ) / Dublin, Ireland (legal HQ), announced last week that it had opened its expanded R&D facility in Hyderabad, India, as part of a $350 million investment the company will make over five years. The facility is expected to employ up to 2,000 people. The Medtronic Engineering and Innovation Center (MEIC) includes a digital therapy and innovation lab, a connected care lab, a platform and tech lab, a systems engineering lab, and a software lab. Aerospace manufacturer Boeing, Arlington, Virginia, is in talks to acquire Spirit AeroSystems, Wichita, Kansas. Spirit was formerly owned by Boeing until 2005. It supplies airframe components to Boeing, Airbus, and other aerospace companies. Boeing accounts for about two-thirds of Spirit’s sales. Spirit’s factory in Wichita made the fuselage involved in the Alaska Airlines door plug blowout in January 2024. Boeing and Spirit are being pressured by U.S. federal regulators to improve their manufacturing quality issues. A panel of government and industry members recently reported that Boeing still needs to improve its manufacturing quality and made 53 recommendations. The repurchase of Spirit would be expected to improve some of these issues. Aluminum supplier Alcoa, Pittsburgh, announced last week that it had purchased Alumina Ltd., Southbank, Victoria, Australia, for $2.2 billion. Alumina is Alcoa’s joint venture partner in a global mining operation. Aluminum is used in large global quantities to manufacture EVs and renewable power infrastructures. Alcoa said the purchase would significantly increase its ownership of five of the world’s 20 largest bauxite mines and five of the 20 largest alumina refineries outside China. Biotech company 1910 Genetics, Boston, announced last week that it entered a five-year commercial agreement and go-to-market partnership with RDW index member Microsoft, Redmond, Washington. The partnership aims to revitalize pharmaceutical R&D productivity. The companies will leverage AI and high-performance computing (HPC) to set up the infrastructure layer for drug discovery and development processes. The alliance will merge 1910’s computational and wet lab biological information laboratory automation powered by robotics and multimodal AI models for drug discovery with Microsoft’s Azure Quantum Elements (for chemical and materials science) and its HPC platform. Startup Figure AI, Sunnyvale, California, has received $675 million in investments from Amazon’s Jeff Bezos, Nvidia, OpenAI, and Microsoft. Figure AI is working on a faceless robot that can do tasks in the place of humans. The company said the recent investments would speed up the commercial deployment of its robots. The company has signed an agreement with automaker BMW, Munich, Germany, to use its robots for automobile manufacturing. Refire, Shanghai, China, announced last week that it is preparing for a Hong Kong, China, initial public offering (IPO) as early as this year. The developer and manufacturer of hydrogen fuel cells could raise up to $100 million in its IPO. The company says its products are powering over 5,000 fuel-cell vehicles and various devices in 40 cities throughout China as of mid-2023. The company’s backers include China Petroleum & Chemical (Sinopec), China’s investment firm Legend Capital, and Paris-based Cathay Capital. A report from semiconductor industry association, SEMI, last week noted that imports of semiconductor manufacturing equipment rose 14% year over year in 2023 to nearly $40 billion. This rise occurred while global semiconductor equipment sales fell 6.1% in 2023 to $101 billion. Reasons for China’s spending spree are noted by analysts as due to stockpiling of equipment in anticipation of restrictions on China by foreign countries due to security concerns. Cutting-edge manufacturing equipment has been restricted to China for some time, but newer restrictions say they won’t be able to import less-advanced equipment either.  R&D World’s R&D Index is a weekly stock market summary of the top international companies involved in R&D. The top 25 industrial R&D spenders in 2020 were selected based on the latest listings from Schonfeld & Associates’ June 2020 R&D Ratios & Budgets. These 25 companies include pharmaceutical (10 companies), automotive (6 companies), and ICT (9 companies) which invested a cumulative total of nearly $260 billion in R&D in 2019, or approximately 10% of all the R&D spending in the world by government, industries, and academia combined, according to R&D World’s 2021 Global R&D Funding Forecast. The stock prices used in the R&D World Index are tabulated from NASDAQ, NYSE, and OTC common stock prices for the companies selected at the close of stock trading business on the Friday preceding the online publication of the R&D World Index. Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.   Δ Browse the most current issue of R&D World and back issues in an easy to use high quality format. Clip, share and download with the leading R& magazine today. Copyright © 2024 WTWH Media LLC. All Rights Reserved. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of WTWH Media Privacy Policy  | Advertising  | About Us "
}