{
    "title": "Apple slammed with antitrust lawsuit over 'illegal monopoly'",
    "date": "3/21/2024",
    "url": "https://www.investomania.co.uk/apple-slammed-with-antitrust-lawsuit-over-illegal-monopoly/",
    "text": "US takes aim at tech giant's anti-competitive practices in smartphone market. The US Department of Justice has filed a blockbuster 88-page antitrust lawsuit against Apple Inc (NASDAQ: AAPL), accusing the tech behemoth of maintaining an illegal monopoly over the smartphone market. The lawsuit, joined by 15 states and the District of Columbia, alleges that Apple is deliberately making its products worse for consumers to suppress competition. Attorney General Merrick Garland lambasted Apple's \"exclusionary, anti-competitive conduct\", stating that such monopolies \"threaten the free and fair markets upon which our economy is based\" by stifling innovation, hurting producers and workers, and increasing costs for consumers. The lawsuit cites five specific examples of Apple suppressing rival technologies, including \"super apps\", cloud gaming, messaging apps, smartwatches, and digital wallets. It alleges that Apple blocks third-party digital wallets from using \"tap-to-pay\" functionality on iPhones, forcing users to share personal data with Apple instead of directly with banks. Garland criticised Apple for intentionally degrading the messaging experience between iPhone and non-iPhone users, claiming this tactic makes \"rival smartphones appear lower quality\". The lawsuit also accuses Apple of making iPhones \"less secure and less private\" to maintain its monopoly power. With over 65% share of the US smartphone market and net income exceeding the GDP of over 100 countries, largely driven by the iPhone's success, the Justice Department argues that allowing Apple's practices to continue unchecked would only \"strengthen its smartphone monopoly\". In response, Apple vehemently denied the allegations, stating the lawsuit is \"wrong on the facts and the law\". The company's shares closed 4% lower on Thursday. Subscribe to Investomania for more business news and updates. Subscribe to the Investomania newsletter to have our daily recap delivered directly to your inbox. No spam. Unsubscribe anytime. London stocks inched higher ahead of Easter, led by JD Sports' sales jump and a takeover battle for Spirent. Sam Bankman-Fried, once crypto's golden boy, sentenced for $8bn fraud against FTX customers. Customers of troubled utility firm Thames Water face potential bill increases of up to 40% as the company grapples with a £15bn debt mountain and ballooning interest payments. Telecoms tester Spirent shares jump after backing £1.16bn cash bid from Keysight. Subscribe to the Investomania newsletter to have our daily recap delivered directly to your inbox. "
}