{
    "title": "Apple (NASDAQ:AAPL) Trading 1.6% Higher",
    "date": "3/27/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-aapl-percent-advance-2024-03-27/",
    "text": "Apple Inc. (NASDAQ:AAPL - Get Free Report)'s stock price rose 1.6% during mid-day trading on Wednesday . The stock traded as high as $173.12 and last traded at $172.42. Approximately 18,831,786 shares traded hands during mid-day trading, a decline of 69% from the average daily volume of 61,226,938 shares. The stock had previously closed at $169.71. AAPL has been the subject of several research reports. Wedbush reissued an \"outperform\" rating and issued a $250.00 target price on shares of Apple in a research report on Thursday, March 21st. Oppenheimer reissued an \"outperform\" rating and set a $200.00 price target on shares of Apple in a report on Friday, February 2nd. Barclays decreased their price target on Apple from $160.00 to $158.00 and set an \"underweight\" rating on the stock in a report on Friday, February 2nd. Redburn Partners cut Apple to a \"neutral\" rating and set a $200.00 price target on the stock. in a report on Wednesday, January 10th. Finally, Robert W. Baird lifted their target price on Apple from $186.00 to $200.00 and gave the stock an \"outperform\" rating in a report on Monday, January 29th. One investment analyst has rated the stock with a sell rating, eleven have assigned a hold rating, twenty-one have given a buy rating and one has issued a strong buy rating to the stock. According to data from MarketBeat.com, Apple presently has an average rating of \"Moderate Buy\" and an average target price of $205.27. Check Out Our Latest Stock Report on AAPL The company's 50 day simple moving average is $181.68 and its 200 day simple moving average is $182.73. The firm has a market cap of $2.68 trillion, a price-to-earnings ratio of 27.00, a P/E/G ratio of 2.06 and a beta of 1.29. The company has a debt-to-equity ratio of 1.28, a current ratio of 1.07 and a quick ratio of 1.02. Apple (NASDAQ:AAPL - Get Free Report) last posted its quarterly earnings results on Thursday, February 1st. The iPhone maker reported $2.18 EPS for the quarter, topping the consensus estimate of $2.09 by $0.09. The business had revenue of $119.60 billion during the quarter, compared to the consensus estimate of $117.99 billion. Apple had a net margin of 26.16% and a return on equity of 156.04%. The company's quarterly revenue was up 2.1% compared to the same quarter last year. During the same quarter in the previous year, the firm posted $1.88 earnings per share. As a group, research analysts expect that Apple Inc. will post 6.55 earnings per share for the current fiscal year. The business also recently declared a quarterly dividend, which was paid on Thursday, February 15th. Investors of record on Monday, February 12th were given a $0.24 dividend. The ex-dividend date was Friday, February 9th. This represents a $0.96 dividend on an annualized basis and a yield of 0.55%. Apple's dividend payout ratio (DPR) is presently 14.95%. In related news, Director Arthur D. Levinson sold 100,000 shares of the business's stock in a transaction on Thursday, February 29th. The shares were sold at an average price of $180.94, for a total value of $18,094,000.00. Following the completion of the sale, the director now directly owns 4,434,576 shares of the company's stock, valued at $802,392,181.44. The sale was disclosed in a filing with the SEC, which is available through this hyperlink. 0.06% of the stock is owned by corporate insiders. Institutional investors and hedge funds have recently made changes to their positions in the business. Atlantic Private Wealth LLC acquired a new stake in shares of Apple in the first quarter valued at approximately $30,000. Wyrmwood Management LLC grew its position in shares of Apple by 69.0% in the fourth quarter. Wyrmwood Management LLC now owns 169 shares of the iPhone maker's stock valued at $33,000 after purchasing an additional 69 shares during the last quarter. A.P. Gilfoyle & Co. L.P. acquired a new stake in shares of Apple in the fourth quarter valued at approximately $39,000. Gilfoyle & Co LLC grew its position in shares of Apple by 118.0% in the fourth quarter. Gilfoyle & Co LLC now owns 218 shares of the iPhone maker's stock valued at $40,000 after purchasing an additional 118 shares during the last quarter. Finally, Summit Wealth Group LLC grew its position in shares of Apple by 16,252.3% in the first quarter. Summit Wealth Group LLC now owns 6,992,420 shares of the iPhone maker's stock valued at $42,000 after purchasing an additional 6,949,659 shares during the last quarter. 60.41% of the stock is owned by hedge funds and other institutional investors. Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.Recommended StoriesFive stocks we like better than AppleWhy Invest in High-Yield Dividend Stocks?Best Bear Market Funds: Top 3 Investment Options to ConsiderLow PE Growth Stocks: Unlocking Investment OpportunitiesIs DraftKings A Good Bet Ahead of Q1 Earnings?What Does a Gap Up Mean in Stocks? How to Play the GapMid-Cap Stocks to Outperform the Market This Cycle Before you consider Apple, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Apple wasn't on the list. While Apple currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering when you'll finally be able to invest in SpaceX, StarLink, or The Boring Company? Click the link below to learn when Elon Musk will let these companies finally IPO. Discover three of the top stocks favored by members of Congress over the past 90 days using MarketBeat's tool to track Congressional trades. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}