{
    "title": "Investing in Apple Inc (AAPL) Is Getting More Attractive – Knox Daily",
    "date": "3/11/2024",
    "url": "https://knoxdaily.com/2024/03/11/investing-in-apple-inc-aapl-is-getting-more-attractive/",
    "text": "Apple Inc’s recently made public that its Director LEVINSON ARTHUR D unloaded Company’s shares for reported $18.09 million on Feb 29 ’24. In the deal valued at $180.94 per share,100,000 shares were sold. As a result of this transaction, LEVINSON ARTHUR D now holds 4,434,576 shares worth roughly $757.12 million. Then, KONDO CHRIS sold 5,513 shares, generating $1,058,496 in total proceeds. Upon selling the shares at $192.00, the Principal Accounting Officer now owns 29,174 shares. Before that, Adams Katherine L. sold 123,448 shares. Apple Inc shares valued at $23,305,748 were divested by the SVP, GC and Secretary at a price of $188.79 per share. As a result of the transaction, Adams Katherine L. now holds 0 shares, worth roughly $0.0. Piper Sandler reiterated its Apple Inc [AAPL] rating to a Neutral in a research note published on February 02, 2024; the price target was $190. A number of analysts have revised their coverage, including Monness Crespi & Hardt’s analysts, who remained covering the stock and in early February has reiterated a ‘”a Buy”‘ rating for it. JP Morgan also remained covering AAPL and reiterated its “an Overweight” recommendation on February 02, 2024. Goldman maintained its rating on February 02, 2024. It rated AAPL as “a Buy”. On Friday, Apple Inc [NASDAQ:AAPL] saw its stock jump 1.02% to $170.73. Over the last five days, the stock has lost -4.97%. Apple Inc shares have fallen nearly -11.32% since the year began. Nevertheless, the stocks have risen 11.68% over the past one year. While a 52-week high of $199.62 was reached on 01/24/24, a 52-week low of $147.61 was recorded on 03/07/24. SMA at 50 days reached $185.01, while 200 days put it at $183.87. A total of 75.91 million shares were traded, compared to the trading of 71.77 million shares in the previous session. The 24-hour chart illustrates a support level at 168.55, which if violated will result in even more drops to 166.36. On the upside, there is a resistance level at 173.31. A further resistance level may holdings at 175.88. The Relative Strength Index (RSI) on the 14-day chart is 27.80, which indicates oversold technical sentiment, while the Moving Average Convergence Divergence (MACD) stands at -8.27, which suggests price will go down in the next trading period. Percent R suggests that price movement has been bearish at 86.47%. Stochastics %K at 6.44% indicates the stock is a buying. A steep rise in short interest was recorded in Apple Inc stocks on Feb 15, 2024, dropping by -3.59 million shares to a total of 97.67 million shares. Yahoo Finance data shows the prior-month short interest on Jan 12, 2024 was 101.26 million shares. There was a decline of -3.68%, which implies that there is a negative sentiment for the stock. In spite of short shares comprising just 0.63% of the overall stock float, the days-to-cover ratio (short ratio) fell to 1.71. The most recent change occurred on February 02, 2024 when Barclays resumed its ‘”an Underweight”‘ rating for the stock and retained the price target to $158. © 2023  All rights Reserved. Knox Daily We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. "
}