{
    "title": "Fidelity D & D Bancorp Inc. Buys New Holdings in Apple Inc. (NASDAQ:AAPL)",
    "date": "3/16/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-aapl-sec-filing-2024-03-16/",
    "text": "Fidelity D & D Bancorp Inc. acquired a new position in shares of Apple Inc. (NASDAQ:AAPL - Free Report) during the 3rd quarter, according to its most recent disclosure with the SEC. The institutional investor acquired 9,149 shares of the iPhone maker's stock, valued at approximately $1,566,000. Apple makes up about 1.6% of Fidelity D & D Bancorp Inc.'s portfolio, making the stock its 18th largest position. Several other hedge funds and other institutional investors also recently bought and sold shares of the stock. Atlantic Private Wealth LLC purchased a new stake in Apple in the first quarter worth $30,000. Summit Wealth Group LLC increased its stake in Apple by 16,252.3% in the first quarter. Summit Wealth Group LLC now owns 6,992,420 shares of the iPhone maker's stock worth $42,000 after purchasing an additional 6,949,659 shares during the period. HBC Financial Services PLLC increased its stake in Apple by 21.7% in the first quarter. HBC Financial Services PLLC now owns 448 shares of the iPhone maker's stock worth $49,000 after purchasing an additional 80 shares during the period. West Tower Group LLC purchased a new stake in Apple in the second quarter worth $64,000. Finally, PayPay Securities Corp grew its position in shares of Apple by 70.2% during the 3rd quarter. PayPay Securities Corp now owns 509 shares of the iPhone maker's stock worth $87,000 after buying an additional 210 shares in the last quarter. Hedge funds and other institutional investors own 58.51% of the company's stock. AAPL has been the topic of a number of recent research reports. Rosenblatt Securities reissued a \"neutral\" rating and set a $189.00 price target on shares of Apple in a research report on Tuesday, March 5th. Piper Sandler dropped their price target on Apple from $205.00 to $190.00 and set a \"neutral\" rating on the stock in a research report on Friday, February 2nd. Piper Sandler Companies downgraded Apple to a \"neutral\" rating and dropped their price objective for the company from $220.00 to $205.00 in a research report on Thursday, January 4th. Citigroup reaffirmed a \"buy\" rating and set a $225.00 price objective on shares of Apple in a research report on Friday, February 16th. Finally, Morgan Stanley raised their price objective on Apple from $210.00 to $220.00 and gave the company an \"overweight\" rating in a research report on Friday, December 8th. One research analyst has rated the stock with a sell rating, eleven have assigned a hold rating, twenty-one have given a buy rating and one has assigned a strong buy rating to the stock. According to MarketBeat.com, Apple has a consensus rating of \"Moderate Buy\" and a consensus target price of $205.27. View Our Latest Report on AAPL In other news, Director Arthur D. Levinson sold 100,000 shares of the company's stock in a transaction dated Thursday, February 29th. The stock was sold at an average price of $180.94, for a total transaction of $18,094,000.00. Following the completion of the transaction, the director now directly owns 4,434,576 shares of the company's stock, valued at approximately $802,392,181.44. The transaction was disclosed in a legal filing with the SEC, which is available at this hyperlink. 0.06% of the stock is currently owned by insiders. Shares of AAPL stock traded down $0.38 on Friday, hitting $172.62. The stock had a trading volume of 121,752,699 shares, compared to its average volume of 61,212,246. Apple Inc. has a 1 year low of $151.64 and a 1 year high of $199.62. The firm has a market capitalization of $2.67 trillion, a P/E ratio of 26.89, a P/E/G ratio of 2.06 and a beta of 1.29. The company has a debt-to-equity ratio of 1.28, a current ratio of 1.07 and a quick ratio of 1.02. The company's 50 day moving average price is $183.39 and its 200-day moving average price is $183.34. Apple (NASDAQ:AAPL - Get Free Report) last released its earnings results on Thursday, February 1st. The iPhone maker reported $2.18 EPS for the quarter, topping the consensus estimate of $2.09 by $0.09. Apple had a return on equity of 156.04% and a net margin of 26.16%. The firm had revenue of $119.60 billion during the quarter, compared to analysts' expectations of $117.99 billion. During the same period in the previous year, the firm posted $1.88 EPS. Apple's revenue for the quarter was up 2.1% on a year-over-year basis. Analysts anticipate that Apple Inc. will post 6.55 earnings per share for the current year. The business also recently announced a quarterly dividend, which was paid on Thursday, February 15th. Investors of record on Monday, February 12th were paid a dividend of $0.24 per share. The ex-dividend date was Friday, February 9th. This represents a $0.96 annualized dividend and a yield of 0.56%. Apple's payout ratio is 14.95%. Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.See AlsoFive stocks we like better than AppleHigh Flyers: 3 Natural Gas Stocks for March 2022MarketBeat Week in Review – 3/11 – 3/15The 3 Best Fintech Stocks to Buy NowWhy Dollar General and Dollar Tree Are Similar Yet DifferentHow to Most Effectively Use the MarketBeat Earnings ScreenerJabil Stock Implodes: Market Manufactures Entry for New Money  Before you consider Apple, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Apple wasn't on the list. While Apple currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's list of seven best retirement stocks and why they should be in your portfolio. Discover three of the top stocks favored by members of Congress over the past 90 days using MarketBeat's tool to track Congressional trades. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}