{
    "title": "Microsoft Overtakes Apple as World's Most Valuable Company [Updated]",
    "date": "1/11/2024",
    "url": "https://www.macrumors.com/2024/01/11/microsoft-overtakes-apple-as-most-valuable-company/",
    "text": "Microsoft today overtook Apple as the world's most valuable public company by market value. Apple's share price dropped by just one percent, enabling Microsoft to narrowly pull ahead of Apple at a value of $2.87 trillion. Microsoft has briefly overtaken Apple as the most valuable company since 2018, most recently in 2020 and 2021 when concerns about supply chain shortages dented Apple's stock price and a boom in remote working bolstered Microsoft. Over the past year, Microsoft's support for artificial intelligence tools by backing OpenAI has helped boost its value, while equivalent offerings from Apple have been noticeably absent. In its November earnings report, Apple's sales results missed expectations as demand for iPads and wearables was lower than expected. Mac revenue also saw a major drop compared to the previous year. It is yet to be seen how responses to the Vision Pro headset will influence the market, but expectations are relatively low due to low sales forecasts and the device's high price point. Update 1:40 pm: By the close of the regular trading day, Apple had retaken the top spot in market capitalization at $2.89 trillion compared to Microsoft's $2.86 trillion, and the companies may swap places multiple times in the coming days and weeks as they remain close in value. Get weekly top MacRumors stories in your inbox. Our comprehensive guide highlighting every major new addition in iOS 17, plus how-tos that walk you through using the new features. App Store changes for the EU, new emoji, Podcasts transcripts, and more. Get the most out your iPhone 15 with our complete guide to all the new features. A deep dive into new features in macOS Sonoma, big and small. Revamped models with OLED displays, M3 chip, and redesigned Magic Keyboard accessory. Updated 10.9-inch model and new 12.9-inch model, M2 chip expected. Apple's annual Worldwide Developers Conference will kick off with a keynote on June 10. Expected to see new AI-focused features and more. Preview coming at WWDC in June with public release in September. 22 hours ago by Tim Hardwick 23 hours ago by Tim Hardwick 1 day ago by Juli Clover 2 days ago by MacRumors Staff 3 days ago by MacRumors Staff  MacRumors attracts a broad audience of both consumers and professionals interested in the latest technologies and products. We also boast an active community focused on purchasing decisions and technical aspects of the iPhone, iPad, Mac, and other Apple platforms. "
}