{
    "title": "Apple is quietly ramping up its focus on AI",
    "date": "1/25/2024",
    "url": "https://www.businessinsider.com/apple-acquires-startups-talent-to-bring-gen-ai-to-iphones-2024-1",
    "text": "       Apple has largely sat out of the AI arms race — but that could be about to change. The Silicon Valley heavyweight has acquired 21 AI startups since 2017 — more than any of its rivals — according to data from PitchBook, shared with Business Insider and cited by the Financial Times. And it's embarking on a hunt for AI talent as it seeks to catch up with rivals like Google and Microsoft. Based on analysis of academic papers, industry data, and insights from tech sector experts, the FT report suggested that Apple is primarily focused on getting AI to run directly on its iPhones — rather than relying on massive data centers and a connection to the cloud, as services like ChatGPT do. The tech titan is also reportedly working on a smarter, AI-powered version of its Siri voice assistant that Morgan Stanley analysts predict could launch alongside iOS 18 at Apple's Worldwide Developers Conference in June, the FT wrote. Apple has also updated some of its hardware to support generative AI, unveiling more powerful M3 chips for its Macbook line in October and a new S9 chip for the Apple Watch, which allows Siri to access data without being connected to the internet. Related stories A look at Apple's job listings shows that the company is hiring a number of roles focused on improving Siri's AI capabilities and \"enabling a better conversational experience\" with Apple's voice assistant. They also suggest that Apple is ramping up its search for AI talent, advertising AI-focused jobs across several areas, including health, on-device AI, and building \"foundation models,\" which are baseline AI models like GPT-4. A recent research note from Morgan Stanley, cited by the FT, found that nearly half of the company's AI job postings are now focused on \"Deep Learning,\" a type of machine learning that is integral to building large language models like ChatGPT. Apple last year reportedly developed its own GPT-4 rival, a large language model called \"Ajax\" that employees have used to create an internal chatbot service. The company pumped money $22.61 billion into research and development in the first half of last year — an increase CEO Tim Cook said was partly down to Apple's focus on generative AI. Apple was largely caught off guard by the astonishing success of ChatGPT in late 2022, with one insider at the company telling Bloomberg that the lack of response was considered \"a pretty big miss internally.\" The company has taken a cautious approach to the new technology even as rivals like Google and Microsoft have launched a number of new AI products. In a May 2023 earnings call, Apple CEO Tim Cook described the AI boom as \"huge\" for the tech industry, but cautioned that the tech titan would be \"deliberate and thoughtful\" in how it incorporated the technology into its products. Apple did not immediately respond to a request for comment from Business Insider, made outside normal working hours. Read next Jump to "
}