{
    "title": "Apple Card Has 12 Million Users And They Are Reaping The Financial \nBenefits, With Daily Cash Rewards Exceeding The $1 Billion Mark",
    "date": "1/31/2024",
    "url": "https://wccftech.com/apple-card-12-million-users-benefitting-greatly/",
    "text": "The Apple Card launched five years ago, and though there has been some recent controversy with banking partner Goldman Sachs, the users are loving every bit of it. According to the latest data shared by Apple in a press release, there are 12 million Apple Card users, and they are benefitting from the launch in every possible way, such as racking up $1 billion in Daily Cash rewards, along with more perks. Apple Card holders’ stats have been shared for the first time since the service’s inception in 2019, with the company stating that 30 percent of the 12 million users took advantage of the credit card feature at least twice a month. Additionally, around one million users rely on Apple Card Family to share their credit cards with other members, with approximately 600,000 users building credit together by co-using the card. Jennifer Bailey, Apple’s Vice President of Apple Pay and Apple Wallet, says in the press release that it is rewarding to see users taking advantage of the service to make better life decisions. “We designed Apple Card with users’ financial health in mind, and it’s rewarding to see our more than 12 million customers using its features to make healthier financial decisions. We’re proud of what we’ve been able to deliver to Apple Card customers in just five years. As we look at the year ahead and beyond, we’re excited to continue to innovate and invest in Apple Card’s award-winning experience, and provide users with more tools and features that help them lead healthier financial lives.” With Apple Card Savings, which now offers a 4.50 percent Annual Percentage Yield (APY), account holders have crossed $10 billion in deposits. This was all made possible by teaming up with Goldman Sachs, but it looks like the partnership with the bank might not last for long, with an executive earlier regretting the Apple Card deal because of the financial loss the bank had to bear. Unfortunately, Goldman Sachs replacement has yet to be found, at least according to previous reports, though there might be some deal happening behind closed doors that might become public information in the coming weeks. Given the list of Apple Card benefits, it is unlikely that users will switch to another service, so it is most probably on Apple’s list of top priorities to seek out a banking partner as early as possible to avoid any unnecessary turmoil. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}