{
    "title": "What Is the Newest iPad? the Latest Models You Can Buy",
    "date": "1/16/2024",
    "url": "https://www.businessinsider.com/guides/tech/what-is-the-newest-ipad",
    "text": "When you buy through our links, Business Insider may earn an affiliate commission. Learn more  New iPad models aren't given simple numbers like the iPhone, which makes things a lot more confusing when talking about new and old iPads. You might be wondering what the latest option is between the iPad Pro, Air, and Mini models, and how to distinguish between different generations. We're here to break it down for you. Currently, Apple officially sells six different iPads, listed here from newest to oldest: It can be difficult to determine which iPad makes the most sense for your needs, as many features and specs can overlap. But it's important to understand the differences, especially if you want to make sure you're choosing the proper model when considering the best iPad Pro cases, best iPad Air cases, or best iPad cases. Read on for a full breakdown of every model, or check out our guide to the best iPads for more details. Apple's most premium tablet got a minor update in October 2022 with the sixth-generation 12.9-inch iPad Pro and fourth-generation 11-inch iPad Pro. The 12.9-inch Pro is the largest tablet in Apple's lineup, and the only iPad to use Apple's mini-LED display that boasts improved brightness and contrast. Among the updates from 2022 was Apple's computer-grade M2 processor, also in the 2022 MacBook Air, and support for the new Hover feature with the second-generation Apple Pencil, which offers better accuracy and new interactions. Both tablets include optional 5G connectivity with support for mmWave 5G networks, Thunderbolt 4 USB-C ports, Face ID, high-refresh-rate 120Hz ProMotion displays, dual-lens cameras, and a Center Stage feature that keeps the selfie camera centered on the subject despite movement. Taken together, these changes make Apple's iPad Pro tablets more powerful and tailored for productivity than ever before. But they're still best suited for professional creatives and multimedia editors since multitasking for most other work is still easier on a desktop operating system like macOS or Windows. Read our full iPad Pro (2022) review. Apple released the 10th-generation iPad in October 2022. It starts at $449, a significantly higher price than the ninth-generation iPad that's still available for $329. The 10th-gen iPad adopts Apple's modern design language with slim bezels around a larger 10.9-inch screen, and it can be easily mistaken for the fifth-gen iPad Air at a glance. It has a USB-C port instead of Lightning. The Touch ID sensor is now integrated into the power button, and the rear camera sees an upgrade from 8 megapixels to 12 megapixels. But the best upgrade is that the ultra-wide FaceTime camera has been repositioned in the landscape position for a better angle of yourself during video calls. In terms of power, the 10th-gen iPad uses Apple's A14 Bionic chip, the same processor as the iPhone 12. It's worth noting that this new version of Apple's basic iPad only supports the first-generation Apple Pencil, which requires an adapter to charge. The 10th-gen iPad also supports mouse input and a Magic Keyboard Folio designed exclusively for it. Despite its positives and the fact that it's an exceptional tablet, the 10th-gen iPad's $449 price tag makes it a hard tablet to recommend when the $329 ninth-gen iPad is still in the lineup. Read our full 10th-generation iPad review. While the 2022 basic iPad is powerful, the 2022 iPad Air, released in March 2022, steps it up a notch with Apple's computer-grade M1 processor that also powers the 2020 13-inch MacBook Air, Mac Mini, and 24-inch iMac. That's a significant bump in power compared to the A14 Bionic processor in the fourth-gen iPad Air. In terms of design, the fifth-gen iPad Air shares many similarities with its predecessor, with the same 10.9-inch screen, USB-C port, and Touch ID integrated into the power button. The front camera was upgraded to 12 megapixels, with support for Center Stage, which automatically focuses the camera on you while you move around during a video call. Other upgrades include 5G connectivity in the WiFi + Cellular models and an enhanced USB-C port for faster transfer of big files between the iPad Air and storage devices. Starting at $599, Apple's iPad Air sits in the current lineup as a step up from the basic iPad and iPad Mini and a worthy alternative to the iPad Pro. Read our full fifth-generation iPad Air review. While a new entry-level iPad is available, we think the 2021 ninth-generation iPad is still a great tablet for most people. At its $329 starting price, it's currently the most affordable iPad you can buy. With a 10.2-inch touchscreen and A13 Bionic chip, the ninth-gen iPad offers enough power to get you through your basic needs. However, you may want to upgrade to the 256GB model for a bit more storage space if you're planning on using the iPad to download many videos, store many pictures, or play many games. Like the 10th-gen iPad, the ninth-gen iPad supports the first-gen Apple Pencil, but it doesn't require an adapter as it can plug right into the iPad's Lightning port to recharge. The ultra-wide FaceTime camera supports the Center Stage feature that follows you as you move around on video calls or when recording a video, but it's in portrait position. The display also has Apple's True Tone feature that automatically adjusts the screen to the color temperature of the room you're in. Read our full ninth-generation iPad review. The most recent iPad Mini model is the sixth-generation iPad Mini, which Apple released in September 2021. Starting at $499, the 2021 iPad Mini sits among more premium models like the iPad Air. If you're looking for the perfect balance between portability and performance, the iPad Air could be calling your name. The 2021 iPad Mini marks a total redesign over previous generations, making for a look that's closer to the iPad Air with narrower borders. The 2021 iPad Mini features a larger 8.3-inch Liquid Retina touch display with True Tone color technology versus the 7.9-inch screens of previous generations. Apple's A15 Bionic processor that's running the iPhone 13 series is also present, and storage is available in 64GB or 256GB. The latest iPad Mini supports the second-generation Apple Pencil, a USB-C port for charging and connecting accessories, an ultra-wide FaceTime camera with Apple's Center Stage, an improved 12-megapixel rear camera, and a Touch ID sensor built into the power button on the top edge. The WiFi + Cellular models also support 5G networks. Read our full iPad Mini sixth-generation review. All the latest iPads look similar now that Apple has updated its basic iPad with its modern iPad design language. If you're not sure which iPad model you own, you can either find your iPad's model in the Settings app, or find the model number etched on the back of the iPad. You can purchase logo and accolade licensing to this story here.Disclosure: Written and researched by the Insider Reviews team. We highlight products and services you might find interesting. If you buy them, we may get a small share of the revenue from the sale from our partners. We may receive products free of charge from manufacturers to test. This does not drive our decision as to whether or not a product is featured or recommended. We operate independently from our advertising team. We welcome your feedback. Email us at reviews@businessinsider.com. Jump to "
}