{
    "title": "Will Apple and Tesla be ousted from the Magnificent Seven?",
    "date": "2/8/2024",
    "url": "https://www.mercurynews.com/2024/02/08/magnificent-seven-stocks-will-apple-tesla-be-ousted/",
    "text": "Today's e-Edition Get Morning Report and other email newsletters  Get Morning Report and other email newsletters Today's e-Edition Trending: Is Wall Street’s favorite clique of tech stocks in need of a makeover? Some investors think so. Related Articles\nTechnology |  \n\n\t\t\tSam Bankman-Fried has to repay $11 billion. How can he possibly do that?\t\t\n\n\nTechnology |  \n\n\t\t\tTesla’s $25,000 car means tossing out the 100-year-old assembly line\t\t\n\n\nTechnology |  \n\n\t\t\tSBF’s parents ‘heartbroken’ for ’empathetic’ son who wanted to ‘do good on a large scale’\t\t\n\n\nTechnology |  \n\n\t\t\tWhite-collar crimes: Sam Bankman-Fried’s sentence is double Elizabeth Holmes’\t\t\n\n\nTechnology |  \n\n\t\t\tTimeline: The downfall of Sam Bankman-Fried and the colossal failure of FTX\t\t\n\nMost of the Magnificent Seven stocks have reclaimed their leadership of the market this year. But two stocks in the group haven’t pulled their weight. Tesla shares have slid roughly 25% this year on concerns about rising competition from electric vehicle makers in China and its second consecutive earnings miss reported in January. Shares of Apple have declined roughly 2% during the same period on worries about falling sales in China. Meanwhile, shares of Nvidia, Meta, Amazon, Microsoft and Alphabet have continued their climb from last year. Meta beat fourth-quarter earnings expectations in results posted on February 1 and announced its first-ever dividend, sending its stock surging more than 20% the next day to a new record. Many investors are skeptical that the Magnificent Seven will match their blockbuster gains from 2023, even if they continue their leadership this year. Some say that divergence in the group’s performance indicates that a new pecking order is emerging. Jim Worden, chief investment officer at the Wealth Consulting Group, says he believes the group should consolidate to the “Fab Five,” which he classifies as the Magnificent Seven minus Tesla and Apple. “The challenges that both Apple and Tesla have in terms of the consumer, in terms of China and in terms of their growth, it’s just going to be more challenging,” said Worden. Bank of America strategist Michael Hartnett coined the term “Magnificent Seven,” a nod to a 1960 film of the same name, in a research note last May. That term quickly caught fire on Wall Street as those stocks raced higher, pushing the S&P 500 index to jump 24% last year as interest rates hovered at a 23-year high, geopolitical turmoil swirled and investors dealt with a regional banking crisis. Nvidia’s stock, the biggest gainer among the group and the benchmark index, soared a whopping 239% in 2023, with the rest of its elite tech cohort notching double- or triple-digit gains. The big board for tech stocks has seen reshuffling in the past. For years, the Jim Cramer-coined “FAANG” stocks — Facebook, Apple, Amazon, Netflix and Google — were heralded as the market’s top dogs. Then tech names got pummeled in 2022 as the Federal Reserve began its aggressive interest rate hiking campaign and investors fled growth stocks. Interest in other, smaller artificial intelligence players is also picking up this year. Super Micro Computer shares have surged 140% so far in 2024, following a 246% jump in 2023, after the company in January reported second-quarter results that blew past expectations and raised its full-year revenue forecast. Nvidia and chipmaker Advanced Micro Devices are among the server producer’s customers. “There is a big leadership change underway in the Magnificent Seven stocks,” wrote Louis Navellier, chairman of Navellier & Associates, in a note on Tuesday. “Money is on the move, and it is headed to more small and mid-capitalization companies that are prospering from explosive sales and earnings growth.” Still, some investors are sticking by the Magnificent Seven laggards. Nancy Tengler, chief investment officer at Laffer Tengler Investments, says that her firm plans on adding to its Tesla position if the stock falls to $160. The electric-vehicle maker’s stock closed Wednesday at $187.58 a share. She says she’s taking a long-term view on the stock and believes that the company’s innovation in developing autonomous driving software and EV charging stations will help pad the blow from demand problems. “I wouldn’t write off the names that are underperforming,” said Tengler. The-CNN-Wire\n™ & © 2024 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved. Copyright © 2024 MediaNews Group "
}