{
    "title": "The people buying the $3,500 Apple Vision Pro | Mint",
    "date": "2/3/2024",
    "url": "https://www.livemint.com/companies/news/the-people-buying-the-3-500-apple-vision-pro-11706950908984.html",
    "text": "Pele Bapere paid $3,500 for a new Apple gadget he never tried. “This is sight unseen,\" he said Friday morning at a New York Apple store. “I can’t wait to get home.\" The pricey gadget is Apple’s Vision Pro, a virtual-reality headset that looks like ski goggles and went on sale for the first time Friday morning. A crowd of people waited outside Apple’s Fifth Avenue store in New York, mostly die-hard Apple fans who wanted to be the first to get their hands on the company’s first new major product launch since the Apple Watch in 2015. Also there: Apple Chief Executive Tim Cook, who opened the doors at 8 a.m., like he has for new iPhone launches. Bapere, a transit authority manager, said the Vision Pro would replace his 10-year-old MacBook to send emails, watch movies or video chat with his mom. He won’t, however, be walking around the streets of New York with a $3,500 device strapped to his face. “I think that’ll be inviting the wrong kind of attention,\" he said. The Vision Pro was unveiled in June, with Cook calling it a revolutionary new product. Putting on the device allows users to see apps, movies and personal photos overlaid on the real world. “This is a day that’s been years in the making,\" Cook said at the time. “Blending digital content with the real world can unlock experiences like nothing we’ve ever seen.\" On Friday, inside the store, Cook was surrounded at all times by Apple fans who took selfies with the CEO or asked for his autograph. Yam Olisker, who flew in from Modi’in, Israel, had Cook sign the back of his iPhone and the box of his Vision Pro. His hands were shaking. “I’m so excited,\" said Olisker. He believes the Vision Pro will one day replace the iPhone and wanted to be the first to try it. “I want to be a part of history,\" he said. Friday was also the first day people could try out the device by signing up online. At the Fifth Avenue store, 16 half-circle, leather-like sofas were set up to give 30-minute demonstrations. Shoppers sat with an Apple employee the entire time. Amol Kodan said he watched a clip of “The Super Mario Bros. Movie\" during his demo. “It looked amazing,\" said the 26-year-old New Yorker, who purchased a Vision Pro afterward. “I have never experienced anything like it.\" After Kodan’s demo was done, the Apple worker asked to take a selfie with him. “He said I was one of the first people to get the demo,\" Kodan said. Arthur Benhamou, who has an artificial-intelligence consulting firm in Paris, said he watched the AppleTV+ series “For All Mankind\" during the demo. The device made him feel like he was watching it on a giant screen by a California lake. Benhamou, 24, plans to use it for work. “It’s a real computer,\" he said, and not a gadget he’ll just use once. In addition to the Vision Pro, he bought a $200 white case that looks like a pillow. Apple hasn’t disclosed how many headsets it has sold. One analyst at TF International Securities projected the number to be between 160,000 and 180,000 units when it initially went on sale. One man said he was the first one in the door Friday morning, after waiting outside since 9:30 p.m. the night before. “I didn’t sleep,\" he said. He didn’t give his name, because when Cook walked by, he asked to borrow a reporter’s pen to get Cook’s autograph, disappearing into the crowd. Write to Joseph Pisani at joseph.pisani@wsj.com Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}