{
    "title": "Apple Music introduces monthly version of year-end 'Replay' feature",
    "date": "2/22/2024",
    "url": "https://www.musicbusinessworldwide.com/apple-music-introduces-monthly-version-of-year-end-replay-feature/",
    "text": "Apple Music is offering a major upgrade to its popular ‘Replay’ feature, introducing a monthly version alongside the existing year-in-review experience. This follows the success of its annual version, similar to Spotify Wrapped, which provides users with a personalized summary of their listening habits throughout the year. This new feature, which Apple Music confirmed to MBW, provides music lovers with a more detailed and personalized look at their listening habits, allowing them to relive their musical journeys, one month at a time.  Previously, Replay offered a comprehensive recap of users’ top songs, artists, and albums at the end of each year. While this provided insights into overall listening trends, it didn’t capture the nuances of evolving tastes and seasonal preferences. The new monthly Replay addresses this gap, offering users a more granular perspective on their musical journey. To access their monthly Replays, users simply need to visit replay.music.apple.com and sign in with their Apple ID. Users can now access individual monthly pages on the Replay website, revealing their top songs, artists, albums, and total listening minutes for each specific month. Users can also start listening to their personal top songs chart of the year with their Replay Mix, which updates weekly. “The Replay mix that users already know and love also becomes available today for the 2024 calendar year. Users must listen to enough music to qualify for both the monthly insights and the yearly playlist.” APple Music “The Replay mix that users already know and love also becomes available today for the 2024 calendar year. Users must listen to enough music to qualify for both the monthly insights and the yearly playlist,” Apple said in an email. Apple Music’s decision to offer monthly Replays comes amid increasing competition in the music streaming market. The feature, which Apple rolled out in 2019, came three years after Spotify launched its Wrapped feature in 2019.  Spotify Wrapped has become a cultural phenomenon, generating social media buzz and user engagement at the end of every year. It has been touted as the company’s “biggest marketing campaign” and the “blueprint for modern marketing.” By offering a more frequent and personalized version of this concept, Apple Music aims to capture a larger share of the market by providing a more dynamic experience for its users. Other music streaming services that took notes from Spotify’s playbook include Tidal and YouTube Music, which also unveiled their year-end summaries in 2020 and 2021, respectively. In 2022, YouTube Music started offering a feature called seasonal recaps as an expansion to its Recap experience.  While features like Spotify Wrapped and Apple Music Replay offer a fun and personalized look at users’ listening habits, some critics have raised concerns regarding user data collection and privacy. “This is a particularly shining example of the fact that Spotify’s business model is based on surveillance,” Evan Greer, director of the digital rights advocacy group Fight for the Future, told Wired in December 2022. “Spotify has done an amazing job of marketing surveillance as fun and getting people to not only participate in their own surveillance, but celebrate it and share it and brag about it to the world.” Music Business Worldwide The best of MBW, plus the most important music biz stories on the web. Delivered for FREE, direct to your inbox each day. "
}