{
    "title": null,
    "date": "2/24/2024",
    "url": "https://wccftech.com/steve-jobs-would-have-been-69-years-old-today/",
    "text": "It is difficult to fathom what sort of day nearly everyone would be living had Steve Jobs not founded Apple. As polarizing as the technology behemoth is, one cannot put up an argument that it did not change the face of multiple industries, including smartphones. Unfortunately, Jobs would not be able to witness the current position of the trillion-dollar company he founded with Steve Wozniak back in 1976, and had he been with us today, he would be celebrating his 69th birthday. Before Apple was known for the iPhone, and when its smartphone division brought in the lion’s share of the revenue, Steve Jobs and Steve Wozniak started the company’s journey with a desktop computer called the Macintosh. It launched in 1984, with the successor, the Macintosh II, unveiled shortly after. However, Jobs had a tumultuous relationship with Apple’s board and its CEO, John Sculley. Later, a joint decision led to Steve Jobs’ firing from Apple, but he returned in 1997, at a time when the company was struggling and bleeding cash and was nearing bankruptcy. With the team-up of former industrial design chief Jony Ive, Jobs created iconic products, both in design and functionality, bringing the now California-based giant to the new position of one of the largest technology entities in the world. Of course, how can one forget the first time when Jobs unveiled Apple’s first iPhone announcement back in 2007? Before that, we vividly remember smartphones looking and functioning significantly different than what we see today. In addition to iPhones, Jobs also introduced capable tablets to the market, driving out those compact and rather slow Netbooks, but shortly after, rival companies started materializing their own products, mimicking what Apple released earlier. Tim Cook succeeded Steve Jobs as CEO of Apple in 2011, and under his leadership, Cook reportedly doubled the company’s revenue and profit, with its market value going from $348 billion to $1.9 trillion. Cook has shared a heartwarming message on X, honoring his friend, former boss, and mentor on the micro-blogging social media platform and remembering what could have been his 69th birthday.  Thinking of my friend Steve on his birthday — the lives he touched, the vision he shared, and the profound impact he had on our world. “We’re here to put a dent in the universe. Otherwise, why else even be here?” Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}