{
    "title": "Apple cancels work on electric car, ending decadelong effort",
    "date": "2/27/2024",
    "url": "https://www.bostonglobe.com/2024/02/27/business/apple-cancels-electric-car/",
    "text": "Apple is canceling a decadelong effort to build an electric car, according to people with knowledge of the matter, abandoning one of the most ambitious projects in the history of the company. Apple made the disclosure internally Tuesday, surprising the nearly 2,000 employees working on the project, said the people, who asked not to be identified because the announcement wasn’t public. The decision was shared by chief operating officer Jeff Williams and Kevin Lynch, a vice president in charge of the effort, according to the people. The two executives told staffers that the project will begin winding down and that many employees on the car team — known as the Special Projects Group, or SPG — will be shifted to the artificial intelligence division under executive John Giannandrea. Those employees will focus on generative AI projects, an increasingly key priority for the company. Advertisement The Apple car team also has several hundred hardware engineers and vehicle designers. It’s possible they will be able to apply for jobs on other Apple teams. There will be layoffs, but it’s unclear how many. Apple, based in Cupertino, Calif., declined to comment. Elon Musk, head of Tesla, celebrated the move. He sent a post on X with a saluting emoji and a cigarette. The decision to ultimately wind down the project is a bombshell for the company, ending a multibillion-dollar effort called Project Titan that would have vaulted Apple into a whole new industry. The tech giant started working on a car around 2014, setting its sights on a fully autonomous electric vehicle with a limousine-like interior and voice-guided navigation. But the project struggled nearly from the start, with Apple changing the team’s leadership and strategy several times. Lynch and Williams took charge of the undertaking a few years ago — following the departure of Doug Field, now a senior executive at Ford Motor Co. Advertisement Apple also was facing a cooling market for EVs. Sales growth lost steam in recent months after high prices and a lack of charging infrastructure discouraged mainstream buyers from shifting to all-electric vehicles. General Motors Co. and Ford are pivoting to producing more hybrid vehicles after confronting lackluster EV demand and manufacturing bottlenecks, and automakers across the industry are slashing battery-electric car prices, production targets, and profit forecasts. Even Tesla, the pioneer of the EV revolution in the United States, has warned its rate of expansion will be “notably lower” this year. Domestic EV sales growth will decelerate to 11 percent next year from an estimated 47 percent growth rate this year, according to a forecast by UBS Monday. Apple’s most senior executives finalized the decision in recent weeks, according to the people. It comes just a month after Bloomberg News reported that the project reached a make-or-break point. The most recent approach discussed internally was delaying a car release until 2028 and reducing self-driving specifications from Level 4 to Level 2+ technology. Apple once envisioned creating a car without a steering wheel and pedals, but it scrapped that notion earlier. The company also spent time working on a remote command center that could take over for a driver. Most recently, Apple had imagined the car being priced at around $100,000. But executives were concerned about the vehicle being able to provide the profit margins that Apple typically enjoys on its products. The company’s board was also concerned about continuing to spend hundreds of millions of dollars a year on a project that may never see the light of day. Advertisement Apple continues to invest heavily in other areas. The company spent $113 billion on total research and development over the past five years, with an average annual growth rate of about 16 percent. The company also recently launched the Vision Pro headset — its first new product category in almost a decade — and has built up that business. The company has scrapped projects before, including a plan to make a TV set that was abandoned around 2015. But few endeavors have lasted this long, involved so many employees, or racked up billions of dollars in expenses. So far, Apple’s biggest push into the auto industry was its CarPlay software, which lets drivers access iPhone features like maps and Siri. It’s being redesigned to integrate more deeply with vehicle controls and entertainment systems. By not competing with automakers, Apple could give a boost to that software, helping spread it to more models. And, in the end, focusing on AI may be a better bet, Bloomberg Intelligence analysts Anurag Rana and Andrew Girard said in a note. “Apple’s decision to abandon electric cars and shift resources toward generative AI is a good strategic move, we believe, given the long-term profitability potential of AI revenue streams versus cars.” "
}