{
    "title": "After dissing Apple Vision Pro, Meta CEO Mark Zuckerberg now asking \nadvertisers to ditch iPhones, iPads",
    "date": "2/16/2024",
    "url": "https://www.firstpost.com/tech/after-dissing-apple-vision-pro-meta-ceo-mark-zuckerberg-now-asking-advertisers-to-ditch-iphones-ipads-13735852.html",
    "text": "Meta CEO Mark Zuckerberg is not backing down in taking shots at Tim Cook and Apple. After taking potshots at the Apple Vision Pro, Zuckerberg is now asking advertisers to boycott Apple’s iPhone, iOS and App Store businesses After taking shots at Apple’s mixed reality headset, the Vision Pro, Meta CEO Mark Zuckerberg has now trained his guns at Apple’s iPhone, iOS and App Store businesses. The feud between the tech giants escalated when Meta Platforms released guidelines advising advertisers to use a workaround to evade a hefty 30 per cent service fee charged by Apple. This workaround is specifically targeted at “boosted posts,” a popular advertising feature offered by Meta for Facebook and Instagram, as per a report by The Wall Street Journal. Boosted posts, which allow users to enhance the visibility of their content by purchasing advertisements directly through their smartphones, generate substantial revenue for Meta, particularly from small businesses. Starting later this month, Meta plans to impose an additional 30 per cent surcharge on US advertisers who continue to purchase boosted posts through iPhone and iPad apps. Meta is planning to pass the burden of Apple’s fees to its consumers, rather than paying it from their end. In response to Apple’s mandate, Meta Platforms asserted in a blog post on Thursday, “We are compelled to either adhere to Apple’s directives or remove boosted posts from our applications. We opt to retain the boosting feature to support small enterprises, ensuring their continued access to an effective promotional tool.” To circumvent Apple’s service charge, Meta is advising advertisers reliant on boosted posts to access the Facebook and Instagram websites via desktop or mobile web browsers. In contrast, Apple maintains that its App Store guidelines apply uniformly to all developers. A company spokesperson stated, “Apple collaborated with Meta for over a year to facilitate compliance with the revised policy.” Additionally, Meta Platforms announced modifications to its pricing structure, stipulating that advertisers purchasing boosted posts through Apple devices must prepay for advertising campaigns. However, prepayment is not obligatory for advertisers utilizing Meta’s websites, and those who prepay through Meta’s platforms will be exempt from Apple’s service fee when boosting posts within Facebook and Instagram iOS apps. The conflict between Meta Platforms and Apple extends beyond boosted posts. Notably, in 2021, Apple implemented privacy modifications to its mobile devices, which Meta estimated would result in a $10 billion revenue loss in 2022. Tensions have further heightened in 2024, with Meta CEO Mark Zuckerberg publicly criticizing Apple’s recent initiatives, including its decision to permit third-party app stores on mobile devices to comply with European regulations. Meta had long been gearing up to launch its own app store for Apple’s mobile devices. However, Zuckerberg expressed dismay after witnessing Apple’s announcement, stating that their offering was overly burdensome and contradictory to the spirit of European law. He believed it would pose significant challenges for any company considering serious engagement with it. Zuckerberg’s criticisms intensified as he assessed Apple’s Vision Pro headset, comparing it unfavourably to Meta’s Quest 3 device. In a video uploaded to his Instagram page, Zuckerberg expressed surprise at the Vision Pro’s $3,500 price tag, limited app selection, discomfort, and wired battery pack, asserting that the Quest 3 offers superior functionality despite its lower cost. (With inputs from agencies) Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}