{
    "title": "Apple Q1 Earnings Beat Estimates As Cupertino Snaps 4-Quarter Revenue \nDecline Streak; Stock Slides On Chi",
    "date": "2/1/2024",
    "url": "https://www.benzinga.com/news/earnings/24/02/36900033/apple-q1-earnings-beat-estimates-as-cupertino-snaps-4-quarter-revenue-decline-streak-stock-slides-o",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Editor’s note: This story has been updated with additional details from Apple’s first-quarter report. Apple, Inc. AAPL reported first-quarter earnings and revenue Thursday that increased year-over-year and beat Street expectations. With this, the company managed to break its four-quarter-long streak of declining revenue. The strong performance came on the back of Services revenue rising to an all-time record. The stock slid in after-hours trading, apparently in reaction to a revenue decline in China. Apple’s Key Q1 Numbers: Cupertino, California-based Apple reported first-quarter earnings per share of $2.18 and revenue of $119.6 billion, thanks to record Services revenue and iPhone revenue. CFO Luca Maestri said the bottom-line result was at an all-time record due to topline growth and margin expansion. Here’s how the quarterly numbers compare with the consensus and the company’s past performance: In early November, Apple guided to flattish first-quarter revenue on a year-over-year basis, despite the quarter having one less selling week than its comparable year-ago period. Morgan Stanley analyst Erik Woodring had called for a healthy first-quarter beat, with revenue and earnings per share likely coming in at $119  billion and $2.13, respectively. Gross margin was at 45.88%, compared to the 45%-46% range flagged by the company in November. “Today Apple is reporting revenue growth for the December quarter fueled by iPhone sales, and an all-time revenue record in Services,” said, CEO Tim Cook. “We are pleased to announce that our installed base of active devices has now surpassed 2.2 billion, reaching an all-time high across all products and geographic segments.” Apple's board declared a cash dividend of 24 cents per share, payable on Feb. 15 to shareholders of record as of the close of business on Feb. 12. Apple’s Performance By Product, Geographies: The iPhone, Apple's flagship product, fetched revenue of $69.7 billion, in line with the company's guidance for year-over-year growth on an absolute basis as well as after normalizing for both last year's supply disruptions and the one extra week. Wedbush analyst Daniel Ives said this week that iPhone sales may have fared well, with the consensus revenue estimate for the product at $68 billion. The rest of the product categories, including Mac, iPad and \"Wearables, Home and Accessories\" fared in line with the company's guidance and exceeded consensus expectations. Maestri said in November he expected a significant acceleration in Mac revenue growth but a significant deceleration in growth for the latter two categories. Weak expectations for iPad and WH&A were blamed on the different launch timing for these products. Apple grew revenue year-over-year in all geographies, except China, where its sales fell 12.9%. The country has been a key market for the tech giant both from a demand and supply perspective. Competiton from Huawei, the U.S-China stand-off and weak economic fundamentals have proved to be headwinds for the company in China. See Also: Everything You Need To Know About Apple Stock Apple’s Outlook: For the second quarter, analysts expect earnings per share of $1.57 and revenue of $95.95 billion, on average. This compares to the year-ago earnings of $1.52 and revenue of $94.8 billion. Morgan Stanley’s Woodring expects the company to guide the March quarter down. He said the tech giant will likely flag revenue and bottom-line results at $93.4 billion and $1.54, respectively, zero to 3% below consensus. He sees the consensus estimates for 2024 as too high and therefore views Thursday’s earnings as a “clearing event” that will help to reset the next 12-month estimates lower and allow investors to turn their attention towards a likely positive inflection in fundamentals in fiscal year 2025. What Apple Investors Are Watching: With Vision Pro set to release on Friday, investors may want to know first impressions about the newest hardware from Apple’s stable, said Citi analyst Atif Malik. He said that new AI efforts, the impact of Apple’s iOS, Safari, and App Store changes in compliance with the Digital Markets Act, and iPhone demand trends are among the other key focus areas. Wedbush’s Ives said investors may pay attention to commentary on the crucial China region, which constitutes about 20% of iPhone unit sales. The analyst rubbished the “Apple demise story” and said the Services business will see steady double-digit growth in 2024, and iPhone units will likely be in the 220-million unit range. He expects shipments of 600,000 Vision Pro headsets in 2024, driven by robust preorder trends AAPL Price Action: Apple shares have been on a broad consolidation move since mid-July and have completed a double-top formation, peaking around $197-$199 in late July and mid-December. The stock snapped a six-session losing streak on Thursday before ending 1.33% higher at $186.86. The 14-day relative strength index is at 40, considered a neutral zone. The average analyst price target for Apple is $206.49, according to TipRanks. Upside potential based on the price target is around 12%. Apple’s shares are down about 2.95% year-to-date, underperforming the Invesco QQQ Trust QQQ, which is up about 3.02%. In after-hours trading, the stock was down 1.71% at $183.66, according to Benzinga Pro data. Read Next: Tech Titans Microsoft, Apple Lead ‘Magnificent Seven’ Earnings Wave This Week: Can Mega-Caps Ignite Market Optimism? Photo courtesy of Apple. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}