{
    "title": "Apple’s Services Contribution to Total Revenue Skyrockets by 150% Over the \nPast 9 Years",
    "date": "2/23/2024",
    "url": "https://mindanaotimes.com.ph/apples-services-contribution-to-total-revenue-skyrockets-by-150-over-the-past-9-years/",
    "text": "By Edith Muthoni Apple Services is consolidating its position as one of Apple’s major income avenues. That’s come out in a recent Stocklytics.com data analysis showing the segment’s share of Apple’s revenues has jumped 150% in the last nine years. The site reports that the branch accounted for 25% of the tech giant’s Q3 2023 earnings, up from 10% in Q3 2015. According to Stocklytics’ investment expert Edith Reads, Apple Services’ growth has been extraordinary. She adds that the rise is more impressive given that it has outdone some of Apple’s other key segments like wearables and iPads. Edith projects an even brighter future for the segment, asserting: Apple Services’ income surge underscores its growing significance to Apple’s overall revenue structure. The segment can only consolidate its gains as the tech giant innovates to expand its global reach. Stocklytics Financial Analyst, Edith Reads Apple Services’ quarterly earnings have been on a tear since crossing the $10 billion mark in Q3, 2018. This movement has seen the unit’s annual income grow from roughly $40B in FY18 to over $85B in FY23.  The spike is due to three major factors:  price increases across various service offerings, Apple’s expanding installed capacity, and AI adoption. CEO Tim Cook echoed similar sentiments on Apple’s Q4,23 earnings call. He said: The services segment achieved all-time revenue records across App Store, advertising, AppleCare, iCloud, payment services, and video, as well as the September quarter revenue record in Apple Music. Tim Cook, CEO of Apple The tech giant recently hiked prices for some of its premium offerings, which could net an extra $5 billion yearly. It has also grown its active devices from 1.3 billion in 2018 to over 2 billion. That jump has coincided with a 360% peak in its subscribers, standing at 1.1 billion. According to analysts, Apple Services’ revenues will surpass the $100 billion mark by H2 FY24, buoyed by its remarkable growth. Its earnings have grown at a CAGR of nearly 17% since 2018. Meanwhile, Apple’s and iPhone’s CAGRs have grown at comparatively low figures of 7.6% and 4.0%, respectively. The company will seek to consolidate its gains in its core markets of America, Europe, the APAC region, and Greater China. Additionally, it is pursuing some AI projects that it could monetize. Though it remains tight-lipped on these, speculation is that it will integrate the technology into some of its popular products like Siri and its iOS operating system.  View all posts  Published in BUSINESS  "
}