{
    "title": "What is Apple Vision Pro? Price, what to know about headset on its release \ndate",
    "date": "2/2/2024",
    "url": "https://ca.finance.yahoo.com/news/apple-vision-pro-price-know-182640597.html",
    "text": "Apple's mixed reality headset is now a reality. The company officially launched Apple Vision Pro on Friday, with the headset now available in stores and on Apple's website. Apple said in a news release Thursday the headset is launching with more than 600 apps and games \"designed to take full advantage of the unique and powerful capabilities of Apple Pro Vision.\" The company said Vision Pro has an \"infinite canvas\" where apps can scale beyond a traditional display and introduces a \"powerful three-dimensional user interface that users navigate with their eyes, hands, and voice.\" Apple officially announced the Vision Pro's release date last month, with CEO Tim Cook calling it \"the most advanced consumer electronics device ever created.\" The headset was first unveiled at the Worldwide Developer Conference in June as a device that incorporates augmented and virtual reality. Users can control the device's interface using their eyes, hands and voice. To get a sense of what it might look like to wear a Vision Pro, Apple released a commercial in January that pans to the point of view of a user putting on the device, who then sees an array of apps overlaying her surroundings. Apple said the Vision Pro will allow users to immerse themselves into the company's visionOS operating system, supporting spatial Facetime video, photos and apps. “With more than 600 new spatial experiences to explore in the all-new App Store, alongside more than 1 million compatible apps across iOS and iPadOS, users can discover a wide array of apps that expand the boundaries of what’s possible,\" said Susan Prescott, Apple's vice president of worldwide developer relations in the Thursday news release. The headset starts at $3,499. Cook told CNBC's Jim Cramer he thinks the company \"priced it at the right level considering the value of it,\" calling it \"tomorrow's technology today.\" Cook also said people can spread payments for the Vision Pro out over time. Apple held a launch party at the company's flagship store on Fifth Avenue in New York City on Friday morning, according to a social media post. \"What a thrilling morning celebrating the launch of Apple Vision Pro at Apple Fifth Avenue! The era of spatial computing has arrived!\" Cook said on X, the platform formerly known as Twitter. What a thrilling morning celebrating the launch of Apple Vision Pro at Apple Fifth Avenue! The era of spatial computing has arrived! pic.twitter.com/SORkEO87d6 — Tim Cook (@tim_cook) February 2, 2024 Contributing: James Powel and Brett Molina, USA TODAY This article originally appeared on USA TODAY: What is Apple Vision Pro? Price, what to know on its release date \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th Trade 24 hours a day on the world's most popular platform. This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids  Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt  Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone  They soft-launched their relationship at the supermodel's cookbook event in Miami. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret.  The \"Late Night\" comedian brutally summed up the former president's media company. Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair.  \"We love to cook and we have the family together,\" Richards tells PEOPLE Public disagreements about how to handle immigration resulted in U.S. Rep. Alexandria Ocasio-Cortez reminding Elon Musk he is an immigrant himself. Leaks from a notoriously sketchy data broker have revealed the locations of hundreds of people who visited convicted pedophile Jeffrey Epstein's Bahaman island before his 2019 arrest and subsequent death behind bars. In an investigation, Wired reports that the firm in question, Near Intelligence, "
}