{
    "title": "SoftBank AI Fund?; Currys Bidding War; Apple Fined",
    "date": "2/19/2024",
    "url": "https://www.cmcmarkets.com/en/opto/softbank-ai-fund-currys-bidding-war-apple-fined",
    "text": "Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money. 5 Top Stories By OPTO  19 Feb 2024, 16:45 Every day, we handpick the 5 Top Stories stock market investors need to know. In 5 minutes, you’ll learn the stocks, CEOs, and money managers moving markets. Shares in Tokyo’s SoftBank Group [9984:T] hopped as much as 3.2% after Bloomberg reported that founder Masayoshi Son is weighing a $100bn artificial intelligence (AI) chip venture. Code-named Izanagi, it would work alongside Arm [ARM], which is majority-owned by SoftBank, and compete with Nvidia [NVDA]. An investment of that scale would represent some 20% of the global semiconductor market. E-commerce titan JD.com [JD] has confirmed that it is in the early stages of a possible cash bid for UK firm Currys [CURY:L]; the UK electronics retailer rejected a £700m offer from Elliott Investment Management over the weekend. Currys has attracted interest of late, following a three-year bad spell that saw the firm lose 60% of its value. Its share price jumped as much as 38% on the news. The Cupertino company [AAPL] is facing a fine of some €500m from the EU, over allegations that it supressed other music-streaming services, including Spotify [SPOT], across its platforms. Elsewhere, Apple’s Vision Pro has met with a mixed response, with some customers returning their $3,500 headsets, citing complaints about its size and weight, as well as issues with the interface, Bloomberg reported. Having hit an all-time high last week, Nintendo [7974:T] fell by up to 8.8% — its biggest intraday drop since October 2021 — on news the Kyoto-based game maker is to push back the release of the next generation of its Switch console until the start of 2025. It had initially been slated for release in the Q4 of this year. The share price eventually pared its losses to a 5.8% decline for the day Monday. The Chinese electric vehicle (EV) leader [1211:HK] has launched a new, cheaper version of its plug-in hybrid sedan, the Qin Plus DM-i. The company has also said it is going to launch several “high-end luxury” models this year. Elsewhere, Chinese EV maker Human Horizons Group, manufacturer of the premium HiPhi brand, has suspended operations for at least six months. Disclaimer Past performance is not a reliable indicator of future results. CMC Markets is an execution-only service provider. The material (whether or not it states any opinions) is for general information purposes only, and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed. No opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person. The material has not been prepared in accordance with legal requirements designed to promote the independence of investment research. Although we are not specifically prevented from dealing before providing this material, we do not seek to take advantage of the material prior to its dissemination. CMC Markets does not endorse or offer opinion on the trading strategies used by the author. Their trading strategies do not guarantee any return and CMC Markets shall not be held responsible for any loss that you may incur, either directly or indirectly, arising from any investment based on any information contained herein. *Tax treatment depends on individual circumstances and can change or may differ in a jurisdiction other than the UK. Continue reading for FREE Error! Please try submitting again. Success! You have successfully signed up. Latest articles 5 Top Stories TSMC Record High; Nvidia AI Investments; Microsoft AI Boost Chipmaker Taiwan Semiconductor Manufacturing Co. added some $42bn to its market value on Thursday. 15 Feb 2024 Analysis “A Real Dangerous Cocktail” — Adam Taggart on AI Adam Taggart, CEO and Founder of Thoughtful Money, discusses the societal dangers associated with artificial intelligence. 15 Feb 2024 5 Top Stories PS5 in Decline; Nvidia Trumps Amazon; Waymo Recall “Looking ahead, PS5 will enter the latter stage of its life cycle,” said Senior Vice President Naomi Matsuoka during Sony’s earnings call on Wednesday. 14 Feb 2024 5 Top Stories Temu Splashes Out; SoftBank Soars; Paytm On the Brink? PDD-owned e-commerce app Temu splashed some serious cash on advertisements during Sunday’s Super Bowl in the US. 13 Feb 2024 © 2024 CMC Markets Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money. CMC Markets UK plc (173730) and CMC Spreadbet plc (170627) are authorised and regulated by the Financial Conduct Authority in the United Kingdom. "
}