{
    "title": null,
    "date": "3/29/2024",
    "url": "https://www.entrepreneur.com/business-news/apples-new-device-updates-iphones-in-the-box-picture/471896",
    "text": "Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC By          \n            Sherin Shibu\n          \n                                                    •\n            \n            \n              Mar 29, 2024 Share Apple's time-saving new device called Presto, which allows iPhones to be updated with the most recent software while still in the box, has gone from a leak to possible photographic proof. A new picture from tech news site iGeneration shows what Presto reportedly looks like — and the device has been compared to everything from a toaster to a metal cubby. According to iGeneration, Presto is a stackable small locker with two shelves per unit that can hold up to 6 iPhone boxes. It allows iPhone buyers to save 20 minutes of having to install updates after purchasing so they can use the phones right out of the box. The photo shows a sleek column of Presto devices stacked vertically, almost like a high-tech bakery cart or bookshelf. The tower contains boxed iPhones, with what appears to be three boxes per row.Apple's Presto system. Source: iGeneration The Presto system first leaked in October when Bloomberg's Mark Gurman revealed that Apple was planning a new system for its stores that would update iPhones before they were sold. Related: Apple Cancels Its 10-Year Electric Car Project, Moves Some Employees to AI Division Apple has created \"a proprietary pad-like device\" that can power on the iPhone, update it, and then power it back down, Gurman wrote at the time. Some users have mixed feelings about Presto, with cybersecurity specialist Michael Robert telling Lifewire that while Presto \"does solve the minor frustration of waiting for updates, I don't believe it addresses a widespread pain point that consumers truly care about.\" Others are more enthusiastic about the system. George Nicholson, founder of Juno Telecoms, told the same publication that \"waiting in-store for updates to complete can be a frustrating experience for customers.\" Related: The U.S. Justice Department Is Suing Apple in a Groundbreaking iPhone Monopoly Lawsuit — Here's Why Gurman's Bloomberg newsletter this week covered that Presto uses MagSafe and other wireless tech to make the in-box updates happen. According to Gurman, Apple started testing Presto last year and plans to roll it out across U.S. stores in April, with broader plans to have the device in all of its U.S. retail stores \"by early summer.\" Entrepreneur Staff News Reporter Want to be an Entrepreneur Leadership Network contributor?\n                \n  Apply now to join. Here are four key actions that early-stage founders need to take to reduce the potential for catastrophic antitrust violations down the road People on Medicare with heart-related conditions may now be covered. Jason Nelson followed his passions for music and entertainment into a lucrative business. Thinking beyond cash flow is the key to stability for small businesses. Here's how to implement a long-term cash planning strategy. After escaping a crate at Raleigh-Durham International Airport in North Carolina, he was found safe and reunited with his owner. Three strategies to help women entrepreneurs unlock business growth and success. Successfully copied link We'll be in your inbox every morning Monday-Saturday with all the day’s top business news, inspiring stories, best advice and exclusive reporting from Entrepreneur. Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC  "
}