{
    "title": "Apple's Epic ban is questioned by EU regulators; more details",
    "date": "3/7/2024",
    "url": "https://9to5mac.com/2024/03/07/apple-epic-ban-regulators/",
    "text": "Apple’s Epic ban – which saw the iPhone maker again terminate a developer account used by the games company – is being questioned by EU antitrust regulators. More details also emerged of follow-ups to Phil Schiller’s demand for written assurances of good faith by both Epic CEO Tim Sweeney and Apple’s lawyers … The drama continued when Epic opened a developer account through its Swedish subsidiary. At the time, it appeared as it all was forgiven – but it has since emerged that Apple wasn’t actually aware the account had been opened. Epic Sweden just applied as if it were a new developer, and the automated system granted the account. Once senior Apple execs became aware of the account, they terminated it. Apple said that it has a good reason for terminating the account: Epic previously agreed to the App Store terms, and then blatantly broke that agreement. If the company had said no more than that, it would probably have been on safe ground – especially as it said it was willing to reconsider if Epic provided written assurances that it would stick to the terms this time around. But Phil Schiller said more than this. He specifically referenced a tweet by Tim Sweeney which was extremely critical of Apple. You have described our DMA compliance plan as “hot garbage,” a “horror show,” and a “devious new instance of Malicious Compliance.” And you have complained about what you called “Junk Fees” and “Apple taxes.” While this was within the context of whether Epic could be trusted, this was perceived as saying that Epic had better not criticise Apple in public if it knew what was good for it. Apple Inc. will face questions from European Union regulators over accusations it barred Epic Games Inc. from opening its own app store for iPhone customers in Europe...  That isn't what Apple did. Epic not being able to open its own app store for iPhone customers in Europe is a consequence of not being able to secure a developer account. Bloomberg reports that regulators are questioning the basis of this decision. Apple Inc. will face questions from European Union regulators over accusations it barred Epic Games Inc. from opening its own app store for iPhone customers in Europe […] An EU commission spokesperson confirmed it had requested further explanations from Apple concerning its conduct with Epic’s game developer account under the bloc’s DMA. Key to this battle is that Schiller wanted Epic to provide a written assurance that the company would respect the new App Store terms. The Verge reports that Sweeney provided this assurance, but Apple rejected it. Sweeney responded the same day. “Epic and its subsidiaries are acting in good faith and will comply with all terms of current and future agreements with Apple, and we’ll be glad to provide Apple with any specific further assurances on the topic that you’d like,” Sweeney wrote […] Sweeney said that Epic received no communication from Apple between Schiller’s email and the letter from Apple’s lawyers and said that he’d have been willing to provide “any assurance they’d like” to abide by the contractual agreement. When asked whether Epic planned to abide by Apple’s developer terms despite Sweeney’s public criticism of its policies, Sweeney responded, “Yes, absolutely.” Regulators will most likely write to Apple, requesting a detailed explanation of the company’s decision, and the basis for it – as well as its conditions for reinstating the account. The most likely outcome is that Apple will allow Epic back, but likely on the very clear understanding that its account can and will be terminated again if the games company breaches the agreement. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… There are growing concerns that Apple could be f… Ben Lovejoy is a British technology writer and EU Editor for 9to5Mac. He’s known for his op-eds and diary pieces, exploring his experience of Apple products over time, for a more rounded review. He also writes fiction, with two technothriller novels, a couple of SF shorts and a rom-com! "
}