{
    "title": "Tech 5: NVIDIA Reveals New AI Products, Cryptos Pull Back, Apple Faces \nLawsuit",
    "date": "3/22/2024",
    "url": "https://investingnews.com/top-tech-news/",
    "text": "NVIDIA delivered a host of new, innovative technology at its hotly anticipated GPU Technology Conference this week. Meanwhile, crypto prices experienced a modest pullback after a two week hot streak, and Apple was hit with a major antitrust lawsuit in the US.  After a two week hot streak, cryptocurrency prices experienced a modest pullback as Bitcoin exchange-traded funds (ETFs) experienced outflows and spot Ethereum ETF expectations were dampened. Meanwhile, NVIDIA's (NASDAQ:NVDA) hotly anticipated GPU Technology Conference delivered a host of new, innovative technology, including a project for building humanoid robots, and Apple (NASDAQ:AAPL) shares pulled back after the US Department of Justice filed a lawsuit accusing the tech giant of anticompetitive behavior. Stay informed on the latest developments in the tech world with the Investing News Network's round-up. 1. Nasdaq closes at new record\n            \n            \n        The Nasdaq Composite (INDEXNASDAQ:.IXIC) closed at a new record high on Friday (March 22) after the US Federal Reserve held interest rates steady on Wednesday (March 20) and maintained its forecast for three cuts this year.Shares of Microsoft (NASDAQ:MSFT) peaked at US$429.83 on Thursday (March 21), a 3.75 percent difference from the firm's opening price of US$414.31 on Monday (March 18). Meta (NASDAQ:META) reached its highest valuation so far this month that same day, touching US$515 at market open before falling slightly, ending the week at US$509.58. Amazon (NASDAQ:AMZN) traded around US$175 during the first half of the week before rising on the Fed news to over US$180 on Thursday. It remained elevated at the close of trading on Friday at US$178.87. Alphabet (NASDAQ:GOOGL) experienced some volatility leading up to the Fed's meeting, but didn’t see the same sharp share price uptick as many of the other mega-cap tech stocks. And, after three weeks in a downtrend, Tesla's (NASDAQ:TSLA) share price finished the week 0.53 percent higher to close at US$170.83.Apple was the only one of the major tech stocks to see an overall decline this past week. NVIDIA was unsurprisingly the biggest winner of the mega-cap tech stocks this week, closing 4.31 percent higher despite a sharp drop both before and after a conference it held on Monday. \n            \n                2. Bitcoin and Ethereum record mild week\n            \n            \n        After last week’s surge, Bitcoin experienced a moderate drop over the weekend, starting the week at US$68,437 on Monday, 7.5 percent lower compared to its record high of US$73,580 on March 14. The cryptocurrency's price continued to fall through the week, dropping as low as US$61,494 just before midnight on Tuesday (March 19). By the end of Wednesday, it had mostly recovered, reaching US$67,883. Bitcoin was trading at US$63,117 as of 4:00 p.m. PST on Friday.Ethereum followed a similar pattern, hitting a high of US$3,566 on Thursday after starting the week at US$3,626 — that's 12.24 percent lower than its March 11 price level of US$4,070.60. Ethereum’s lowest valuation for the week was US$3,107 on Tuesday. It was trading at US$3,297 as of 4:00 p.m. PST on Friday. According to trader and economist Alex Kruger, reasons for the “crash,” from most to least important, include too much leverage, waning optimism that the US Securities and Exchange Commission will approve spot Ethereum ETFs, outflows from Bitcoin ETFs and inflated valuations. \n            \n                3. NVIDIA delivers at GPU Technology Conference\n            \n            \n        NVIDIA CEO Jensen Huang kicked off his company’s GPU Technology Conference on Monday with a keynote, unveiling a new lineup of artificial intelligence (AI) chips and software for running AI models, the Blackwell architecture. Alluded to for the first time in October 2023 as part of the company’s developmental roadmap, Blackwell was rumored to be NVIDIA's most capable graphics processing unit (GPU) yet. During the presentation, Huang outlined Blackwell’s capabilities and how the company is poised to lead the “new industrial revolution” with its hardware and software. The Blackwell GPU, manufactured by Taiwan Semiconductor Manufacturing Company (NYSE:TSM), is the world’s first multi-die chip specifically designed for AI applications, with two large dies connected by cables to form one large GPU. In a computer chip, a die refers to the semiconductor material, usually silicon, that houses the transistors, resistors, capacitors and other elements that carry out the tasks the chip was designed for. The Blackwell platform consists of NVIDIA's B200 Tensor Core GPUs and the GB200 Grace Blackwell Superchip, a powerful processor that connects the two CPUs to the NVIDIA Grace CPU over an ultra-low-power NVLink chip-to-chip (C2C) interconnect. NVIDIA developed C2C to allow high-speed communication between different chips within a single processor. With the increased processing power, AI companies will be able to train bigger and more complex models.NVIDIA also introduced NVIDIA AI Enterprise 5.0, which offers dozens of generative AI microservices that will help businesses create and establish their own applications on their own platforms, giving them full ownership rights over their intellectual property. Developers can run their models on their own servers or on cloud-based NVIDIA servers, and are charged based on usage. The microservices offered by 5.0 include the new NVIDIA Inference Microservices, which will make it easier to deploy AI and run programs, including on older versions of NVIDIA GPUs.The keynote concluded with a presentation of Project GR00T, or Generalist Robot 00 Technology, a foundation model that will provide natural language understanding and imitative learning for humanoid robots. The initiative is powered by a new NVIDIA computer for humanoid robots called Jetson Thor, which is available for developers through the company's upgraded Isaac Robotics Platform.\n            \n                4. NVIDIA to build humanoid robots“The ChatGPT moment for robotics may be right around the corner,” NVIDIA's Huang said as he revealed a new innovative project at the conference. Project GR00T is a general-purpose foundation model for humanoid robots built on a new computer called Jetson Thor. Jetson Thor is based on the newly designed NVIDIA Thor system-on-a-chip, which itself is built on the Blackwell architecture and an upgraded Isaac Robotics Platform. As Huang pointed out at the event, “Building foundation models for general humanoid robots is one of the most exciting problems to solve in AI today.” One obstacle he identified was the difference between large language model reinforcement learning on a computer and reinforcement learning with physical feedback. “We need a simulation engine that represents the world digitally for the robot so that the robot has a gym to go learn how to be a robot,” he said. “We call that virtual world Omniverse.”NVIDIA's Omniverse bridges the gap between the digital and physical worlds. By creating digital twins in Omniverse, developers can simulate real-world scenarios to test robot behaviors and optimize designs before physical implementation. Other tools to facilitate robot learning are the Isaac Lab, a robotic simulation platform for reinforcement learning that is powered by Omniverse; and OSMO, a compute orchestration service that helps developers scale their workloads across a distributed environment for scheduling multi-stage workflows. \n            \n                5. Apple fined by DoJ and 16 statesThe US Department of Justice (DoJ), joined by 16 other state and district attorneys general, filed a major antitrust lawsuit against Apple in New Jersey on Thursday, alleging that the tech giant has engaged in anticompetitive practices to maintain its dominant position in the smartphone market. The lawsuit claims that Apple has stifled competition, suppressed innovation and inflated prices by restricting the ability of smaller companies to offer competing applications and services on its iOS platform, thereby making it more difficult for users to switch to other devices. The government argues that Apple’s actions violate antitrust laws and harm both consumers and smaller competitors. The lawsuit seeks remedies that could include breaking up Apple; however, outcomes will depend on the court’s decision. This legal action marks a significant escalation in the ongoing regulatory scrutiny of Big Tech, and follows similar litigation brought against both Amazon and Alphabet’s Google last year. Overseas, Apple was issued a 2 billion euro fine by the European Commission on March 4 after the court ruled that Apple had broken the bloc’s antitrust laws by favoring its music streaming service, iTunes, over those belonging to competitors. US President Joe Biden has made this issue a priority as well, launching a task force on March 5 jointly led by the DoJ and the Federal Trade Commission to strictly enforce antitrust laws and crack down on unfair corporate pricing. The Nasdaq Composite (INDEXNASDAQ:.IXIC) closed at a new record high on Friday (March 22) after the US Federal Reserve held interest rates steady on Wednesday (March 20) and maintained its forecast for three cuts this year. Shares of Microsoft (NASDAQ:MSFT) peaked at US$429.83 on Thursday (March 21), a 3.75 percent difference from the firm's opening price of US$414.31 on Monday (March 18). Meta (NASDAQ:META) reached its highest valuation so far this month that same day, touching US$515 at market open before falling slightly, ending the week at US$509.58. Amazon (NASDAQ:AMZN) traded around US$175 during the first half of the week before rising on the Fed news to over US$180 on Thursday. It remained elevated at the close of trading on Friday at US$178.87. Alphabet (NASDAQ:GOOGL) experienced some volatility leading up to the Fed's meeting, but didn’t see the same sharp share price uptick as many of the other mega-cap tech stocks. And, after three weeks in a downtrend, Tesla's (NASDAQ:TSLA) share price finished the week 0.53 percent higher to close at US$170.83. Apple was the only one of the major tech stocks to see an overall decline this past week. NVIDIA was unsurprisingly the biggest winner of the mega-cap tech stocks this week, closing 4.31 percent higher despite a sharp drop both before and after a conference it held on Monday. After last week’s surge, Bitcoin experienced a moderate drop over the weekend, starting the week at US$68,437 on Monday, 7.5 percent lower compared to its record high of US$73,580 on March 14. The cryptocurrency's price continued to fall through the week, dropping as low as US$61,494 just before midnight on Tuesday (March 19). By the end of Wednesday, it had mostly recovered, reaching US$67,883. Bitcoin was trading at US$63,117 as of 4:00 p.m. PST on Friday. Ethereum followed a similar pattern, hitting a high of US$3,566 on Thursday after starting the week at US$3,626 — that's 12.24 percent lower than its March 11 price level of US$4,070.60. Ethereum’s lowest valuation for the week was US$3,107 on Tuesday. It was trading at US$3,297 as of 4:00 p.m. PST on Friday. According to trader and economist Alex Kruger, reasons for the “crash,” from most to least important, include too much leverage, waning optimism that the US Securities and Exchange Commission will approve spot Ethereum ETFs, outflows from Bitcoin ETFs and inflated valuations. NVIDIA CEO Jensen Huang kicked off his company’s GPU Technology Conference on Monday with a keynote, unveiling a new lineup of artificial intelligence (AI) chips and software for running AI models, the Blackwell architecture. Alluded to for the first time in October 2023 as part of the company’s developmental roadmap, Blackwell was rumored to be NVIDIA's most capable graphics processing unit (GPU) yet. During the presentation, Huang outlined Blackwell’s capabilities and how the company is poised to lead the “new industrial revolution” with its hardware and software. The Blackwell GPU, manufactured by Taiwan Semiconductor Manufacturing Company (NYSE:TSM), is the world’s first multi-die chip specifically designed for AI applications, with two large dies connected by cables to form one large GPU. In a computer chip, a die refers to the semiconductor material, usually silicon, that houses the transistors, resistors, capacitors and other elements that carry out the tasks the chip was designed for. The Blackwell platform consists of NVIDIA's B200 Tensor Core GPUs and the GB200 Grace Blackwell Superchip, a powerful processor that connects the two CPUs to the NVIDIA Grace CPU over an ultra-low-power NVLink chip-to-chip (C2C) interconnect. NVIDIA developed C2C to allow high-speed communication between different chips within a single processor. With the increased processing power, AI companies will be able to train bigger and more complex models. NVIDIA also introduced NVIDIA AI Enterprise 5.0, which offers dozens of generative AI microservices that will help businesses create and establish their own applications on their own platforms, giving them full ownership rights over their intellectual property. Developers can run their models on their own servers or on cloud-based NVIDIA servers, and are charged based on usage. The microservices offered by 5.0 include the new NVIDIA Inference Microservices, which will make it easier to deploy AI and run programs, including on older versions of NVIDIA GPUs. The keynote concluded with a presentation of Project GR00T, or Generalist Robot 00 Technology, a foundation model that will provide natural language understanding and imitative learning for humanoid robots. The initiative is powered by a new NVIDIA computer for humanoid robots called Jetson Thor, which is available for developers through the company's upgraded Isaac Robotics Platform. “The ChatGPT moment for robotics may be right around the corner,” NVIDIA's Huang said as he revealed a new innovative project at the conference. Project GR00T is a general-purpose foundation model for humanoid robots built on a new computer called Jetson Thor. Jetson Thor is based on the newly designed NVIDIA Thor system-on-a-chip, which itself is built on the Blackwell architecture and an upgraded Isaac Robotics Platform. As Huang pointed out at the event, “Building foundation models for general humanoid robots is one of the most exciting problems to solve in AI today.” One obstacle he identified was the difference between large language model reinforcement learning on a computer and reinforcement learning with physical feedback. “We need a simulation engine that represents the world digitally for the robot so that the robot has a gym to go learn how to be a robot,” he said. “We call that virtual world Omniverse.” NVIDIA's Omniverse bridges the gap between the digital and physical worlds. By creating digital twins in Omniverse, developers can simulate real-world scenarios to test robot behaviors and optimize designs before physical implementation. Other tools to facilitate robot learning are the Isaac Lab, a robotic simulation platform for reinforcement learning that is powered by Omniverse; and OSMO, a compute orchestration service that helps developers scale their workloads across a distributed environment for scheduling multi-stage workflows. The US Department of Justice (DoJ), joined by 16 other state and district attorneys general, filed a major antitrust lawsuit against Apple in New Jersey on Thursday, alleging that the tech giant has engaged in anticompetitive practices to maintain its dominant position in the smartphone market. The lawsuit claims that Apple has stifled competition, suppressed innovation and inflated prices by restricting the ability of smaller companies to offer competing applications and services on its iOS platform, thereby making it more difficult for users to switch to other devices. The government argues that Apple’s actions violate antitrust laws and harm both consumers and smaller competitors. The lawsuit seeks remedies that could include breaking up Apple; however, outcomes will depend on the court’s decision. This legal action marks a significant escalation in the ongoing regulatory scrutiny of Big Tech, and follows similar litigation brought against both Amazon and Alphabet’s Google last year. Overseas, Apple was issued a 2 billion euro fine by the European Commission on March 4 after the court ruled that Apple had broken the bloc’s antitrust laws by favoring its music streaming service, iTunes, over those belonging to competitors. US President Joe Biden has made this issue a priority as well, launching a task force on March 5 jointly led by the DoJ and the Federal Trade Commission to strictly enforce antitrust laws and crack down on unfair corporate pricing. Don't forget to follow us @INN_Technology for real-time news updates! Securities Disclosure: I, Meagen Seatter, hold no direct investment interest in any company mentioned in this article.   Investment Market Content Specialist Meagen moved to Vancouver in 2019 after splitting her time between Australia and Southeast Asia for three years. She worked simultaneously as a freelancer and childcare provider before landing her role as an Investment Market Content Specialist at the Investing News Network.  Meagen has studied marketing, developmental and cognitive psychology and anthropology, and honed her craft of writing at Langara College. She is currently pursuing a degree in psychology and linguistics. Meagen loves writing about the life science, cannabis, tech and psychedelics markets. In her free time, she enjoys gardening, cooking, traveling, doing anything outdoors and reading. Investing News Network websites or approved third-party tools use cookies. Please refer to the cookie policy for collected data, privacy and GDPR compliance. By continuing to browse the site, you agree to our use of cookies. Investment Market Content Specialist Meagen moved to Vancouver in 2019 after splitting her time between Australia and Southeast Asia for three years. She worked simultaneously as a freelancer and childcare provider before landing her role as an Investment Market Content Specialist at the Investing News Network.\nMeagen has studied marketing, developmental and cognitive psychology and anthropology, and honed her craft of writing at Langara College. She is currently pursuing a degree in psychology and linguistics. Meagen loves writing about the life science, cannabis, tech and psychedelics markets. In her free time, she enjoys gardening, cooking, traveling, doing anything outdoors and reading. Meagen moved to Vancouver in 2019 after splitting her time between Australia and Southeast Asia for three years. She worked simultaneously as a freelancer and childcare provider before landing her role as an Investment Market Content Specialist at the Investing News Network.  Meagen has studied marketing, developmental and cognitive psychology and anthropology, and honed her craft of writing at Langara College. She is currently pursuing a degree in psychology and linguistics. Meagen loves writing about the life science, cannabis, tech and psychedelics markets. In her free time, she enjoys gardening, cooking, traveling, doing anything outdoors and reading. Follow Learn about our editorial policies. "
}