{
    "title": "Robinhood's new credit card goes after Apple Card with ability to invest \ncash-back perks",
    "date": "3/26/2024",
    "url": "https://au.news.yahoo.com/robinhoods-credit-card-goes-apple-230025817.html",
    "text": "Eight months after acquiring credit card startup X1 for $95 million, Robinhood announced today the launch of its new Gold Card, with a list of features that could even give Apple Card users envy. Robinhood, better known for its brokerage app aimed at the everyday investor, is touting all sorts of benefits with its new card in an attempt to attract users. The card has no annual or foreign transaction fees. However, it will only be available for Robinhood Gold members, which costs $5 a month, or $50 annually. (Gold is a program that offers other benefits like 5% APY on an account’s uninvested brokerage cash.) Gold Card users can earn 3% cash back on all categories, including restaurants and groceries, and 5% cash bank when booking travel at Robinhood’s new travel portal. That cash back can be transferred to brokerage accounts, which can go toward making investments like stock purchases, the company says. The ability to invest using cash back is the big innovation that X1 developed prior to getting acquired. Another interesting feature of the Gold Card includes the ability to provide cards for family members. This is the first time that Robinhood has introduced a family-oriented financial product, Robinhood Money General Manager Deepak Rao told TechCrunch. Rao was the founder and CEO of X1 before joining Robinhood in the acquisition. Users will have the ability to add up to five family members as cardholders to their account with every cardholder receiving their own card. Additional cardholders can be any age, giving parents a way to help teens build credit and monitor spending. The ability to provide cards to family members will extend even to those visiting from other countries. “A user can provide cards to parents, children or caregivers and set the right kind of controls and protection, while also helping them build their credit,” Rao said. “They don’t have to provide any other information than their name and date of birth and Social Security number if they have one. If you’re worried about spending limits, you can put a dollar amount limit and also a child-safe mode for kids.” The Card also allows users to create and delete virtual cards for one-time purchases and will have an APR of 20.24% - 29.99%, which Robinhood said will vary with the market based on the Prime Rate. Robinhood is also making its physical cards numberless so if they are lost or stolen, users won’t have to swap out all their card information. The company is also launching a new app to go along with the new Gold Card that will be completely separate from its investment app, Rao said. Generally, the Gold account offers up to $2.25 million FDIC insurance from a network of partner banks. Robinhood’s entrance into the credit card market is clearly taking a cue from the likes of Apple, which has seen great success with its own card (despite hiccups with its partnership with Goldman Sachs). By forgoing hidden fees like annual or late fees, and by applying its cash back daily, Apple Card topped more than 12 million users as of January. Many cards offer cash back but often restrict it to certain categories. This card is generous in its cash-back offer. Apple, for instance, offers 3% cash back on all purchases made at Apple, and on purchases made at select merchants when using the Apple Card with Apple Pay. In general, purchases made on Apple Card with Apple Pay earn users 2% back. But Apple also offers a Family Sharing feature, and a high-yield savings account offering 4.5% interest. Obviously, Robinhood will earn interchange revenue from the credit cards, standard transaction fees paid by the merchants. It has earned interchange revenue off of its debit cards, which launched in 2018. Coastal Community Bank is Robinhood’s banking partner on the new Gold Card. The new credit card is part of Robinhood’s evolving business model and offerings over the years. In December of 2022, the company announced Robinhood Retirement, which it described as the “first and only” individual retirement account (IRA) with a 1% match on every eligible dollar contributed. Gold Membership, a requirement to get the Gold Card, increases the eligible match to up to 3% match. “There’s always been special perks and opportunities reserved for the wealthy that make them even richer. It’s why we started Robinhood...” Robinhood co-founder and CEO Vlad Tenev said in a written statement. “Today’s announcements...bring us one step closer to the goal of giving everyone better access to the financial system.\" You must be a Robinhood Gold card member. You must first meet the following credentials in order to apply for a card: Must have a Robinhood Gold account. Be 18 years or older Have a valid social security number (not a taxpayer identification number) Have a legal U.S. residential address within the 50 states (exceptions may apply for active U.S. military personnel stationed abroad) Be a U.S. citizen, U.S. permanent resident, or have a valid U.S. visa You must be a Robinhood Gold member to apply for the card. It costs $5 a month, or $50 a year, to become a Robinhood Gold member. Are there foreign transaction fees associated with a Robinhood Gold Card? No, there are no foreign transaction fees. Robinhood doesn’t do a hard pull on your credit until you accept the card offer. Users can earn 3% cash back on all categories. That cash back can be transferred to brokerage accounts, which can go toward making investments like stock purchases. Users will have the ability to add up to five family members as cardholders to their account with every cardholder receiving their own card. Cardholders can create and delete virtual cards for one-time purchases. The physical cards will be numberless so if they are lost or stolen, users won’t have to swap out all their card information. Is Robinhood Gold FDIC insured? Robinhood offers up to $2.25 million in FDIC insurance through a network of partner banks. You can check out the full archive of Robinhood's event announcing the Gold Card below. [youtube https://www.youtube.com/watch?v=Muwy-r0hNa8?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&start=1021&wmode=transparent&w=640&h=360] Want more fintech news in your inbox? Sign up for TechCrunch Fintech here. This post was originally published March 26 at 4 p.m. PT, and has been updated to include Robinhood's stream and additional remarks. The bank is rolling select customers into new accounts to help them save money. Three million dollars sounds like the kind of money that lets you spend retirement sitting on the dock of your own boat, sipping mai tais (or coffee, if that's more of your thing). But a $3 million...  In this article, we will take a detailed look at Jim Cramer Says You Should ‘Buy, Buy, Buy’ These 11 Stocks. For a quick overview of such stocks, read our article Jim Cramer Says You Should ‘Buy, Buy, Buy’ These 5 Stocks. Jim Cramer in his latest program talked about CNBC’s Alpha Stock Survey according to which a “majority” […] An expert says waiting that long for an operation can be 'a very financially stressful situation'. There's more than one way you can quickly grow your money besides working. According to money expert Jaspreet Singh's YouTube video, you can grow $10,000 to $100,000 using five different methods....  Here's what you need to know about HECS today, and whether it's still worth pursuing a uni degree. For Tesla, a combination of poor guidance, a tough selling environment in China, and more drama from CEO Elon Musk led the EV maker — which topped $750 billion in market cap to start the year — to shed over $200 billion since Jan. 1. Berkshire Hathaway’s chairman Warren Buffett, one of the world's most famed investors, is still faithful to the fact that holding steady, being patient and believing in the power of value investing is key to successful investments. Just as important to Buffett's investment strategy, though, are the investments he doesn't believe in. Here are but a few of the investment types that the Oracle of Omaha would rather not waste money on.  (Bloomberg) -- Japan’s top currency official said recent yen weakness is odd and out of line with current economic fundamentals, reaffirming his commitment to act if needed to prevent excessive swings in the exchange rate.Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF In this article, we will look at the 25 countries with the highest average salaries in the world. We have also discussed the global unemployment rates. If you want to skip our detailed analysis, head straight to the 10 Countries with the Highest Average Salaries in the World. The International Labour Organization (ILO) has reported […] Amanda Wilson is one of around 200,000 'mortgage prisoners' stuck on sky-high rates through no fault of her own.  TOKYO (Reuters) -Core inflation in Japan's capital slowed in March and factory output unexpectedly slid in the previous month, heightening uncertainty on how soon the Bank of Japan can raise interest rates again after exiting its radical monetary stimulus.  The slew of weak signs in the economy could prompt the central bank to go slow in its next rate hike and give investors an excuse to continue selling yen, keeping pressure on Japanese authorities to intervene in the market to prop up the currency.  \"Factory output is weaker than expected,\" said Masato Koike, an economist at Sompo Institute Plus. (Bloomberg) -- This year’s crypto rally has been so strong that a software maker, largely viewed as a Bitcoin hedge fund of sorts, now has a stock market capitalization that’s higher than nearly half of the companies in the S&P 500 Index. Most Read from BloombergBankman-Fried Is Sentenced to 25 Years in Prison Over FTX CollapseTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineDubai Is Losing Its Allure for Wealthy RussiansLondon Insurers Face Baltimore Bridge Payouts Worth Bill As a former Wells Fargo financial advisor, the managing trustee of a private real estate trust and general counsel and head of finance of the LLC Attorney firm, Jonathan Feniak has earned sizeable...  46% of Americans with bad debt have said it's affected their mental health. In this piece, we will take a look at the 25 largest automotive companies and suppliers in the world. If you want to skip our overview of the global automotive industry, then you can take a look at the 5 Largest Automotive Companies and Suppliers in the World. The global automotive industry is one of the […] On March 28, 2024, Michael Saylor, the Executive Chairman and 10% Owner of MicroStrategy Inc (NASDAQ:MSTR), sold 3,973 shares of the company.  Using your usual UK bank debit card abroad could trigger some annoying fees Falling behind on your student loan debt can lead to significant financial consequences, including losing Social Security money. Learn More: America's Retirement Crisis: How Social Security, Student... In this article, we will take a look at the top 15 3D printing companies in the US. If you want to skip our detailed analysis, you can go directly to Top 5 3D Printing Companies in the US. Recent Trends in 3D Printing According to a report by Grand View Research, the global 3D […] "
}