{
    "title": "Apple sues former iOS engineer for allegedly leaking Vision Pro, Journal \napp details",
    "date": "3/28/2024",
    "url": "https://www.theverge.com/2024/3/28/24115067/apple-leak-lawsuit-andrew-aude",
    "text": "By  Amrita Khalid, one of the authors of audio industry newsletter Hot Pod. Khalid has covered tech, surveillance policy, consumer gadgets, and online communities for more than a decade. Apple is suing a former employee for leaking confidential information, including unknown details about Apple’s Journal app, the development of the VisionOS headset, and more, to journalists and employees of other companies. The lawsuit, filed ten days ago in California state court (24CV433319, pdf), says Andrew Aude also leaked regulatory compliance strategies, employee headcounts, and other product hardware characteristics. As reported previously by MacRumors, in at least one message, the company says Aude claimed he leaked information “so he could “kill” products and features with which he took issue.” Apple referenced many of the communications in the lawsuit: Between June and September 2023 alone, Mr. Aude connected with a Wall Street Journal (WSJ) journalist, whom Mr. Aude code named “Homeboy,” over 1,400 times using an encrypted messaging app. Mr. Aude also read “Homeboy” a final feature list for an unannounced Apple product over the phone. Mr. Aude sent another journalist at The Information over 10,000 text messages and traveled across the continent to meet with her. The following screenshot of an encrypted message exchange on the Signal app between Aude and a WSJ journalist appears in the complaint, as Apple says, “Mr. Aude often took and saved screenshots of his communications on his Apple-issued work iPhone to preserve them for posterity.” Apple accuses Aude of leaking a list of finalized features for Apple’s Journal app in a phone call that occurred in April 2023 to the same reporter. A story about the unreleased app’s features appeared that same month in The Wall Street Journal. Aude joined Apple in 2016 as an iOS engineer focused on optimizing battery performance. Apple’s lawyers write that the nature of the role gave Aude access to “information regarding dozens of Apple’s most sensitive products.” The leaks weren’t discovered until late 2023, the company states. When representatives from Apple first sat down with Aude in November 2023, he reportedly denied his involvement in the leaks and lied about having his Apple-issued iPhone with him. Then, they claim, he faked needing to go to the bathroom, “extracted his iPhone from his pocket during the break and permanently deleted significant amounts of evidence from his device,” including the Signal app. Then, in a second meeting on December 12th, the complaint says “Mr. Aude admitted that he leaked information about Apple’s strategies for regulatory compliance, unannounced products, development policies, and hardware characteristics of certain released products to at least two journalists.” He was fired three days later. Apple’s filing says the company is seeking a jury trial, damages, “restitution and/or disgorgement” of bonuses and stock options, plus “An order directing Mr. Aude not to disclose Apple’s confidential and proprietary, information to third parties without its written consent.” / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}