{
    "title": "Cook extends Holi wishes with colourful iPhone shot",
    "date": "3/25/2024",
    "url": "https://www.dtnext.in/news/business/cook-extends-holi-wishes-with-colourful-iphone-shot-776281",
    "text": "MORE Representative Image NEW DELHI: Apple CEO, Tim Cook on Monday extended Holi wishes. Cook, who shared the greetings on X, added a picture showcasing the festival’s vibrant colour and joy, shot on the iPhone. The image was clicked by photographer Joshua Karthik. “Happy Holi to all who celebrate! Thank you @joshuakarthikr for sharing this beautiful #ShotOniPhone photo that captures the colorful festival,” he wrote in the post. Meanwhile, Apple’s revenue in India rose nearly 42 per cent (on-year) last year to $8.7 billion, foreign brokerage Morgan Stanley said in a report last month. According to the report, iPhone shipments grew about 39 per cent to 9.2 million units last year and Apple also registered strong double-digit growth in the December quarter in India, reaching another quarter revenue record in the country, Cook said in February. Responding to an analyst’s questions, Cook said that the India market “hit a quarter revenue record”. WHAT AILS APPLE? • First 6 weeks of the year, historically a peak season for Chinese shoppers to spring for a new phone, iPhone sales fell 24% from a year earlier • Sales for one of Apple’s longstanding Chinese rivals, Huawei, surged 64% • It’s a challenging time for Apple • Its latest product, a $3,500 virtual reality headset released in February, is still years away from gaining mainstream appeal •This month, Apple has taken two regulatory hits: an European Union fine of nearly $2 billion for anticompetitive music streaming practices and a US government lawsuit claiming Apple violated antitrust laws Where it all began and rebound • Apple started selling iPhones in China in 2009 • Last time it was losing ground to Huawei, in 2019, the Trump administration inadvertently extended Apple a lifeline by restricting US technology firms from dealing with Huawei •Google, which makes the Android operating system, and several semiconductor companies cut off their support of the Chinese smartphone maker • As Huawei struggled, Apple rebounded • In 2022, its share of phones sold in China rose to 22%, from 9% in 2019 • Apple reported record revenue of $74 bn from the region during its fiscal year ending in September 2022 WHO GAINED • But restrictions also forced Huawei to develop own wireless chip and operating system, resulting in technology behind Mate 60 Pro • Has drawn Chinese shoppers, and many of China’s biggest tech companies have made apps exclusively for it, further walling off users from platforms used outside China • Huawei’s innovation has made Apple’s latest models appear stodgy by comparison • China’s economy has struggled to rebound from the COVID pandemic, many consumers are hesitant to spend on what feels like incremental upgrade • Apple has responded to the challenges in China • Chief executive, Tim Cook, has travelled to China, visited Apple’s suppliers • Last week, he attended the splashy opening of an Apple Store near Shanghai’s Jing’an Temple — the company’s 8th store in Shanghai and 57th in China — to a crowd of Apple fans • Apple expanding research and development labs in Shanghai • But for some shoppers, Apple’s efforts have been overshadowed by Washington’s approach to the company’s Chinese rival • Customers drawn to Huawei after CFO Meng Wanzhou was arrested by Canadian authorities in 2018 at the request of the US  © Copyright  | Powered by Hocalwire "
}