{
    "title": "Apple Terminates Epic Games' Developer Account In Ongoing Feud Over App \nStore Fees",
    "date": "3/6/2024",
    "url": "https://www.tradingview.com/news/benzinga:5b1ed92e3094b:0-apple-terminates-epic-games-developer-account-in-ongoing-feud-over-app-store-fees/",
    "text": "In the latest twist of the ongoing feud between Epic Games and Apple over app store fees, Apple Inc AAPL has terminated Epic Games Inc's developer account, preventing the introduction of the Epic Games Store and Fortnite on iOS devices in Europe. In a statement, Epic Games condemned Apple's actions as a violation of the Digital Markets Act (DMA): \"This is a serious violation of the DMA and shows Apple has no intention of allowing true competition on iOS devices.\" See Also: Tim Sweeney Blasts Apple For Alleged Amazon Bias — Elon Musk Curiously Asks, 'What's Up With This?' \"They are undermining our ability to be a viable competitor and they are showing other developers what happens when you try to compete with Apple or are critical of their unfair practices,\" the Epic Games statement added. Apple did not immediately respond to Benzinga's request for comment. Despite the setback, Sweeney hinted at the possibility of reintroducing Fortnite to iOS via another company's third-party app store in the European Union. On Feb.16, Epic Games CEO Tim Sweeney celebrated the approval of their developer account, posting on X (formerly Twitter): \"Dev account secured, let's go!\" This development comes in the wake of Apple's announcement to permit third-party app stores on iOS in compliance with the DMA, effective this week. In January, Apple proposed changes to comply with certain conditions of the DMA, including allowing alternative app stores and providing an opt-out from using the in-app payments system. However, the proposed \"core technology fee\" of 50 euro cents per user account per year for developers who sign up for the new regime has sparked controversy. This development further intensifies the legal battle between the two companies that began in 2020, when the gaming firm alleged that Apple's practice of charging up to 30% commissions on in-app payments violated U.S. antitrust rules. Read Next: How Did Epic Games' Showdown With Google Differ From Apple? CEO Tim Sweeney Says It Was Like Ice And Fire Image created using photos from Shutterstock. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @bradfairbridge @rajbuzzz @Kevin Trinh @Cenobar @arcanebear @udcovers @fx.today @_dalton16 @TradingView @mytradingsetup @ftmocom @chartfeed @olka_gadzieva @mytradingsetup @satoshi_empire @MidasPls @Zeiierman Trading @Onlnternet Whatever the trade "
}