{
    "title": "Apple and Meta’s New VR Headsets Look Like a Sports Force Multiplier",
    "date": "3/2/2024",
    "url": "https://www.sportico.com/business/tech/2024/apple-meta-vr-headsets-sports-force-multiplier-1234768786/",
    "text": "By \n\n\tRick Burton Professor Today’s guest columnist is Rick Burton of Syracuse University. A few weeks ago, I wrote a Sportico column referencing the increased investment in sport technology aimed at improving human performance above and below the neck. I name-dropped the old movie Rollerball and concluded my rant with the dystopian suggestion artificial bodies (AB) might appear in our not-too-distant sporting future. I trust no one was offended or took me seriously. I write that because, usually, I don’t hear directly from readers. I do, however, send the odd published link to brainier friends who continue to influence my superficial thinking. Interestingly, one of them shared comments I feel are worthy of a revisit. Sean Branagan is a professor of media entrepreneurship in the famed Newhouse School at Syracuse University. Where I had mentioned Apple Vision Pro and Meta’s Quest last time, he wrote back to say: “Apple’s product isn’t a headset for what most people see as Virtual Reality (VR). Yes, it will do AR/VR stuff, but I think Apple’s primary market will be for delivering movies and shows. In the TV versus computers competition, computers win big with unlimited screen size.” Branagan continued by suggesting the evolving Apple Vision Pro ecosystem allows consumers to create another room in their house or apartment that essentially becomes their home theater with iMax capabilities. In other words, folks can add a room to their existing real estate for $3,500. That’s a huge marketing concept. The cost of adding living space would become pennies on virtual square footage. It also gives Apple added incentive to buy Disney, Paramount or both just to pump out Star Wars or other classics into the home theater resting on your face. “But don’t forget to add,” Branagan replied, “for that $3,500, you can also add a home office if your company and job makes use of these devices. That’s a lot of win-win for both parties if the work-from-home battle continues.” The sports world was not part of our initial dueling digital diatribe, but Branagan followed up a few weeks later with a note that Apple had recently launched a free standalone app called Apple Sports which will give sports fans with iPhones scores and stats in real time. “With Apple VisionPro and Apple TV+ this may be a bigger deal than it first appears,” Branagan wrote. “Apple traditionally develops a killer app and usually delivers it with a new device.” As Variety noted, “the app also is designed to drive viewership to the Apple TV app to watch live sports—including all Major League Soccer matches, which are available through Apple TV’s MLS Season Pass,” part of the exclusive 10-year deal the tech company struck with the American soccer league. Apple and Meta’s interest in the sports world means most teams will quickly grasp that spectators buying courtside seats via VR means one mind-blowing thing: The team’s sales staff can sell any seat in their physical building many times in the VR world. Or many hundreds of thousands of times. That makes every sporting event a purchasable global ticket with every VR headset acting as a toll booth for content of all kinds. Forget about cable or even hundreds of streaming platforms. The sports world, like most markets, relishes consolidation. But let’s get serious about the content distributors. Who will own the rights and economies of scale to offer their consumers new shows, movies and sports for VR devices? Or, said another way, if a team can sell a VR seat to its game, does it need a special media partner to put the “viewer” courtside? The NBA is already playing around in this vertical. Think of it this way. The Milwaukee Bucks play in the 18,000-seat Fiserv Arena. That’s a fixed number. Their home games are broadcast on either NBA TV, ABC, TNT or ESPN. The number of people who can watch that telecast (or stream) is not infinite but limited to the number of people who purchased specific cable or streaming access. Those viewers see the game the host network wants them to see and get commentary from the play-by-play and color commentator provided by the network. These viewers do not enjoy the same visual or audio freedom the 18,000 in the stadium do. The in-stadium posse can look anywhere at any time while talking to the people around them. There are no voices explaining the game, and the first law of sports has always held that attending in person always beats watching via media (radio, TV or mobile device). This law has stood unchallenged for more than a century. But what if the sport experience evolved to mimic some of what happens in esports. The “viewer” gets to choose which player on the field they want to become. This is not about choosing camera angles (where the consumer acts as the broadcast director) but rather about running a route or setting a pick at the point of contact. Far-fetched? Not at all. We have microphones in football helmets and cameras in F1 cockpits. Why not have a camera on every player providing real-time, in-the-game, accessibility? VR headsets will deliver that capacity shortly. Let the consumer decide what they want. Tired of being Travis Kelce? Switch over and become a linebacker trying to stop him. Yeah, I know it’s crazy … but then so was Rollerball. Rick Burton is the David B. Falk Professor of Sport Management at Syracuse University and COO of Playbk Sports. He is the co-author of numerous sports business books including Business the NHL Way, 20 Secrets to Success for NCAA Student-Athletes and Invisible No More (the story of Wilmeth Sidat-Singh). Get our latest stories in the feed of your favorite networks We want to hear from you! Send us a tip using our anonymous form. Sign up for our daily newsletter Sportico is a part of Penske Media Corporation. © 2024 Sportico Media, LLC. All Rights Reserved. "
}