{
    "title": "U.S. files antitrust lawsuit against Apple alleging company monopolized \nsmartphone market",
    "date": "3/21/2024",
    "url": "https://www.spokesman.com/stories/2024/mar/21/us-files-antitrust-lawsuit-against-apple-alleging-/",
    "text": "Subscriber Actions Staff Options Connect With Us The U.S. Justice Department on Thursday filed a sweeping antitrust lawsuit against Apple alleging that the technology giant attempted to monopolize the smartphone market to boost its business. The complaint, filed in the U.S. District Court for the District of New Jersey, alleges that Cupertino, California-based Apple illegally maintains a monopoly over smartphones by “selectively imposing contractual restrictions on, and withholding critical access points from, developers,” according to a press release from the Department of Justice. The lawsuit also alleges that Apple undermines apps, products and services that would make customers less reliant on iPhones. The lawsuit seeks to restore competition in the tech market to protect customers from higher prices and expand their product choices,  Attorney General Merrick Garland said in a prepared statement. IPhones are the most popular smartphone in the United States, accounting for more than 60% of sales, analysts say. Its main competition comes from phones made by Samsung and other manufacturers that run Alphabet’s Android operating system. “Consumers should not have to pay higher prices because companies violate the antitrust laws,” Garland said in a prepared statement. “We allege that Apple has maintained monopoly power in the smartphone market, not simply by staying ahead of the competition on the merits, but by violating federal antitrust law.” Apple generated annual net revenues of $383 billion in 2023 and a net income of $97 billion. IPhone sales made up the largest chunk of the company’s revenue in its most recent quarter. The Justice Department last sued Apple in 2012, accusing the company of colluding with book publishers to fix e-book prices. Apple was required to pay a $450 million settlement in the case. Local journalism is essential. Give directly to The Spokesman-Review's Northwest Passages community forums series -- which helps to offset the costs of several reporter and editor positions at the newspaper -- by using the easy options below. Gifts processed in this system are not tax deductible, but are predominately used to help meet the local financial requirements needed to receive national matching-grant funds.  Get breaking news delivered to your inbox as it happens. On November 22, 2020, Fred Fleming was driving home when he started slurring his words. Follow Us Subscribe Help User Advertising More Contact Us © Copyright 2024, The Spokesman-Review | Community Guidelines | Terms of Service | Privacy Policy | Copyright Policy "
}