{
    "title": "Elon Musk Reacts As Tim Sweeney Blasts Apple Again For Blocking Epic Games \nFrom Competing With Its App St",
    "date": "3/8/2024",
    "url": "https://www.benzinga.com/general/gaming/24/03/37526154/elon-musk-reacts-as-tim-sweeney-blasts-apple-again-for-allegedly-blocking-epic-games-from-competin",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Update (05:03 AM ET): Apple Inc. AAPL has responded to Benzinga’s query with a statement addressing its decision regarding Epic Games. Epic Games CEO Tim Sweeney on Wednesday took to X, formerly Twitter, and slammed Apple Inc. AAPL again for blocking the Fortnite-maker \"from competing with their App Store.\" What Happened: Sweeney posted to X just hours after Epic Games shared a blog post revealing that Apple has terminated its developer account. This development prevents the Sweeney-led company from introducing Epic Games Store and Fortnite on iOS devices in Europe. The CEO said that they serve more than 270 million customers. Therefore, \"the victim of Apple's competition bans,\" includes several future iPhone users who will miss out on good deals for games. See Also: Tim Sweeney Blasts Apple For Alleged Amazon Bias — Elon Musk Curiously Asks, ‘What’s Up With This?’ \"Competition is a fragile thing. Apple can crush it not only by banning it outright as it did pre-DMA, but also by selectively blocking specific competitors like us, and by sowing fear among all developers who'd like to partner with us to reach users, and by users who fear buying apps on a third-party store Apple can block at any time,\" Sweeney said. He went on to say that Cupertino is trying hard to make developers scared and it is disappointing to see \"the world's most respected company to be slipping down.\" Apple has responded to Benzinga’s query, saying, “Epic's egregious breach of its contractual obligations to Apple led courts to determine that Apple has the right to terminate ‘any or all of Epic Games' wholly owned subsidiaries, affiliates, and/or other entities under Epic Games' control at any time and at Apple's sole discretion.' In light of Epic's past and ongoing behavior, Apple chose to exercise that right.\" Meaning, due to Epic’s major contract breaches, courts have backed Apple’s right to cut ties with Epic Games and its affiliates anytime, at Apple’s own call. This move is Apple’s response to Epic’s ongoing behavior, pushing Apple to ditch Epic officially. Tesla and SpaceX CEO Elon Musk who previously agreed with Sweeney's comments about Apple returning to its roots also reacted to his latest post. Why It's Important: Last month, Sweeney expressed joy over the approval of their developer account. The development came after the Tim Cook-led tech giant announced that it will allow third-party app stores on iOS in accordance with the Digital Markets Act or DMA. However, as per Epic Games’ blog post, Apple terminated Sweeney’s developer account because Sweeney \"publicly criticized their proposed DMA compliance plan.\" The blog post states, \"Apple also claims that Epic is a threat to their ecosystem.\" Photo by Frederic Legrand – COMEO on Shutterstock Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Microsoft Back On Top, Dethrones Apple As World’s Most Valuable Company © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}