{
    "title": "Apple supplier Foxconn turns upbeat on 2024, cites huge demand for AI \nservers",
    "date": "3/14/2024",
    "url": "https://theprint.in/tech/apple-supplier-foxconn-turns-upbeat-on-2024-cites-huge-demand-for-ai-servers/2000834/",
    "text": "By Yimou Lee and Faith HungTAIPEI (Reuters) -Apple supplier Foxconn has adopted a far more bullish outlook for this year, saying on Thursday that it expected a significant rise in revenue driven by booming demand for artificial intelligence servers.\nThe upbeat tone comes after a forecast-beating 33% jump in net profit for the fourth quarter. It also contrasts sharply with remarks by Foxconn Chairman Young Liu in November that the world’s largest contract electronics maker had “relatively conservative and neutral” expectations for 2024.\n\n\n“We see very strong demand for AI servers from our clients,” Liu told an online earnings conference, adding that he expects the business to have revenue growth of more than 40% this year.\n\n\r\n\t\t\t\t\tShow Full Article By Yimou Lee and Faith HungTAIPEI (Reuters) -Apple supplier Foxconn has adopted a far more bullish outlook for this year, saying on Thursday that it expected a significant rise in revenue driven by booming demand for artificial intelligence servers. The upbeat tone comes after a forecast-beating 33% jump in net profit for the fourth quarter. It also contrasts sharply with remarks by Foxconn Chairman Young Liu in November that the world’s largest contract electronics maker had “relatively conservative and neutral” expectations for 2024.\n\n\n“We see very strong demand for AI servers from our clients,” Liu told an online earnings conference, adding that he expects the business to have revenue growth of more than 40% this year.\n\n\r\n\t\t\t\t\tShow Full Article The upbeat tone comes after a forecast-beating 33% jump in net profit for the fourth quarter. It also contrasts sharply with remarks by Foxconn Chairman Young Liu in November that the world’s largest contract electronics maker had “relatively conservative and neutral” expectations for 2024. “We see very strong demand for AI servers from our clients,” Liu told an online earnings conference, adding that he expects the business to have revenue growth of more than 40% this year.\n\n\r\n\t\t\t\t\tShow Full Article “We see very strong demand for AI servers from our clients,” Liu told an online earnings conference, adding that he expects the business to have revenue growth of more than 40% this year. The AI server market was likely to see 30% growth each year between 2023 and 2025, and Foxconn’s growth would be in line with that or even higher, he said.\nOctober-December net profit for the Taiwanese company came in at T$53.1 billion ($1.7 billion), handily beating a T$43.5 billion LSEG SmartEstimate. The 33% surge in profit was the strongest year-on-year growth logged for a quarter since March 2021.\nIn addition to robust demand for AI servers, it also had  better-than-expected sales of cloud and networking products and smart consumer electronics.\nApple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ estimates.\nIn the fourth quarter, consumer electronics including smartphones accounted for 58% of Foxconn’s revenue while cloud and networking products which include servers contributed 20%.    \nAlthough it expects healthy growth over 2024, Foxconn cautioned that first-quarter revenue was set to come in lower than the same period a year ago when sales surged after pandemic restrictions were lifted in China.\nChief Financial Officer David Huang also said that 2024 growth in capital expenditure would at least match last year’s rate, partly due to the company’s drive to diversify investment around the world and expand into areas such as electric vehicles and semiconductors.  \nFoxconn’s capital expenditure climbed 14% in 2023 to around T$111.7 billion ($3.6 billion).\n($1 = 31.5090 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree, Christopher Cushing and Edwina Gibbs)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. The AI server market was likely to see 30% growth each year between 2023 and 2025, and Foxconn’s growth would be in line with that or even higher, he said. October-December net profit for the Taiwanese company came in at T$53.1 billion ($1.7 billion), handily beating a T$43.5 billion LSEG SmartEstimate. The 33% surge in profit was the strongest year-on-year growth logged for a quarter since March 2021.\nIn addition to robust demand for AI servers, it also had  better-than-expected sales of cloud and networking products and smart consumer electronics.\nApple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ estimates.\nIn the fourth quarter, consumer electronics including smartphones accounted for 58% of Foxconn’s revenue while cloud and networking products which include servers contributed 20%.    \nAlthough it expects healthy growth over 2024, Foxconn cautioned that first-quarter revenue was set to come in lower than the same period a year ago when sales surged after pandemic restrictions were lifted in China.\nChief Financial Officer David Huang also said that 2024 growth in capital expenditure would at least match last year’s rate, partly due to the company’s drive to diversify investment around the world and expand into areas such as electric vehicles and semiconductors.  \nFoxconn’s capital expenditure climbed 14% in 2023 to around T$111.7 billion ($3.6 billion).\n($1 = 31.5090 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree, Christopher Cushing and Edwina Gibbs)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. October-December net profit for the Taiwanese company came in at T$53.1 billion ($1.7 billion), handily beating a T$43.5 billion LSEG SmartEstimate. The 33% surge in profit was the strongest year-on-year growth logged for a quarter since March 2021. In addition to robust demand for AI servers, it also had  better-than-expected sales of cloud and networking products and smart consumer electronics.\nApple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ estimates.\nIn the fourth quarter, consumer electronics including smartphones accounted for 58% of Foxconn’s revenue while cloud and networking products which include servers contributed 20%.    \nAlthough it expects healthy growth over 2024, Foxconn cautioned that first-quarter revenue was set to come in lower than the same period a year ago when sales surged after pandemic restrictions were lifted in China.\nChief Financial Officer David Huang also said that 2024 growth in capital expenditure would at least match last year’s rate, partly due to the company’s drive to diversify investment around the world and expand into areas such as electric vehicles and semiconductors.  \nFoxconn’s capital expenditure climbed 14% in 2023 to around T$111.7 billion ($3.6 billion).\n($1 = 31.5090 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree, Christopher Cushing and Edwina Gibbs)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. In addition to robust demand for AI servers, it also had  better-than-expected sales of cloud and networking products and smart consumer electronics. Apple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ estimates.\nIn the fourth quarter, consumer electronics including smartphones accounted for 58% of Foxconn’s revenue while cloud and networking products which include servers contributed 20%.    \nAlthough it expects healthy growth over 2024, Foxconn cautioned that first-quarter revenue was set to come in lower than the same period a year ago when sales surged after pandemic restrictions were lifted in China.\nChief Financial Officer David Huang also said that 2024 growth in capital expenditure would at least match last year’s rate, partly due to the company’s drive to diversify investment around the world and expand into areas such as electric vehicles and semiconductors.  \nFoxconn’s capital expenditure climbed 14% in 2023 to around T$111.7 billion ($3.6 billion).\n($1 = 31.5090 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree, Christopher Cushing and Edwina Gibbs)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Apple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ estimates. In the fourth quarter, consumer electronics including smartphones accounted for 58% of Foxconn’s revenue while cloud and networking products which include servers contributed 20%.    \nAlthough it expects healthy growth over 2024, Foxconn cautioned that first-quarter revenue was set to come in lower than the same period a year ago when sales surged after pandemic restrictions were lifted in China.\nChief Financial Officer David Huang also said that 2024 growth in capital expenditure would at least match last year’s rate, partly due to the company’s drive to diversify investment around the world and expand into areas such as electric vehicles and semiconductors.  \nFoxconn’s capital expenditure climbed 14% in 2023 to around T$111.7 billion ($3.6 billion).\n($1 = 31.5090 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree, Christopher Cushing and Edwina Gibbs)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. In the fourth quarter, consumer electronics including smartphones accounted for 58% of Foxconn’s revenue while cloud and networking products which include servers contributed 20%. Although it expects healthy growth over 2024, Foxconn cautioned that first-quarter revenue was set to come in lower than the same period a year ago when sales surged after pandemic restrictions were lifted in China.\nChief Financial Officer David Huang also said that 2024 growth in capital expenditure would at least match last year’s rate, partly due to the company’s drive to diversify investment around the world and expand into areas such as electric vehicles and semiconductors.  \nFoxconn’s capital expenditure climbed 14% in 2023 to around T$111.7 billion ($3.6 billion).\n($1 = 31.5090 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree, Christopher Cushing and Edwina Gibbs)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Although it expects healthy growth over 2024, Foxconn cautioned that first-quarter revenue was set to come in lower than the same period a year ago when sales surged after pandemic restrictions were lifted in China. Chief Financial Officer David Huang also said that 2024 growth in capital expenditure would at least match last year’s rate, partly due to the company’s drive to diversify investment around the world and expand into areas such as electric vehicles and semiconductors.  \nFoxconn’s capital expenditure climbed 14% in 2023 to around T$111.7 billion ($3.6 billion).\n($1 = 31.5090 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree, Christopher Cushing and Edwina Gibbs)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Chief Financial Officer David Huang also said that 2024 growth in capital expenditure would at least match last year’s rate, partly due to the company’s drive to diversify investment around the world and expand into areas such as electric vehicles and semiconductors. Foxconn’s capital expenditure climbed 14% in 2023 to around T$111.7 billion ($3.6 billion).\n($1 = 31.5090 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree, Christopher Cushing and Edwina Gibbs)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Foxconn’s capital expenditure climbed 14% in 2023 to around T$111.7 billion ($3.6 billion). ($1 = 31.5090 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree, Christopher Cushing and Edwina Gibbs)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. ($1 = 31.5090 Taiwan dollars) (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree, Christopher Cushing and Edwina Gibbs)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree, Christopher Cushing and Edwina Gibbs) Disclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Disclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content.   Subscribe to our channels on YouTube, Telegram & WhatsApp Support Our Journalism India needs fair, non-hyphenated and questioning journalism, packed with on-ground reporting. ThePrint – with exceptional reporters, columnists and editors – is doing just that. Sustaining this needs support from wonderful readers like you. Whether you live in India or overseas, you can take a paid subscription by clicking here. Support Our Journalism Save my name, email, and website in this browser for the next time I comment.  Δ Required fields are marked *  Name * Email *  Δ Copyright © 2024 Printline Media Pvt. Ltd. All rights reserved. "
}