{
    "title": "3 Top Dividend Stocks That Could Deliver Record Payouts In 2024",
    "date": "3/3/2024",
    "url": "https://finance.yahoo.com/news/3-top-dividend-stocks-could-121500424.html",
    "text": "Often, investors focus too much on a stock's yield instead of the reasons behind the yield. In the case of Apple (NASDAQ: AAPL), its yield is low because its stock price has outpaced its dividend raises. Air Products and Chemicals (NYSE: APD) and MSC Industrial Direct (NYSE: MSM) both yield over 3% and have rich histories of raising their dividends over time. But both stocks have underperformed the S&P 500 over the past five years. Here's why we should see record-high payouts from all three companies this year and why each business has what it takes to continue rewarding shareholders in the future. Daniel Foelber (Apple): Last May, Apple raised its dividend for the 11th consecutive year to $0.24 per share per quarter. I'd expect Apple to announce another raise when it reports its Q2 fiscal results this May. The question is how large the dividend raise will be. Apple has issued minimum raises for a few years now of one cent per share per quarter. These raises keep the streak alive, but they do little to attract income investors, especially with the stock yielding just 0.5%. As investors familiar with Apple may know, it could easily pay a much larger dividend. It just prefers to prioritize buybacks over dividends in its capital return program. Last quarter, Apple spent $3.83 billion on dividends and $20.14 billion on buybacks. If it returned all of that capital to shareholders through the dividend and did no buybacks, Apple would yield 3%, which is double the S&P 500's 1.5% yield and far higher than any of its big tech peers. Buybacks have been a far better use of capital than dividends. Apple stock is up over 825% over the past decade, and it has reduced its outstanding share count by 36%. The buyback program has been nothing short of brilliant. But there's a good argument that Apple should shift its capital spending program toward the dividend, mainly because the business is slower-growing and more mature than in past years. Apple is posting record results in its service segment and iPhone demand from North America and many emerging markets. But its sales are falling in China, enough to make the whole business look bad right now. Apple is a quality company that's going through a difficult downturn. It has also been largely left out of the artificial intelligence craze and has drastically underperformed Amazon, Microsoft, and Nvidia over the past six months. Apple's ace in the hole is that it generates far more money than it needs to operate the business. That capital can be used to transform Apple into a surefire high-yield dividend stock, or spur growth, or something in between. Wall Street may be unwilling to take a bite out of Apple stock today, but underestimating the company's prospects could be a big mistake. Scott Levine (Air Products): Air Products is poised to achieve a record payout to shareholders in 2024. But then the industrial gas producer and supplier has consistently hit the same mark for decades. For 42 consecutive years, Air Products has raised its dividend, making it a leading option for income investors seeking a high-quality dividend opportunity. But wait: There's more. Shares of Air Products, currently offering a forward yield of 3%, are sitting in the bargain bin, making it a compelling option for income and value investors alike. Operating more than 750 production facilities and about 1,800 miles of gas pipeline, Air Products provides materials critical to various industries, including healthcare, energy, and aerospace. This business model helps to mitigate risk, since a downturn in any one industry is highly unlikely to catastrophically impair the company's financial well-being. Moreover, its robust portfolio of assets contributes to the company's significant competitive advantage, making it highly unlikely that upstart companies will succeed in challenging Air Products' business. Logging its 42nd year of consecutive increases, Air Products raised its quarterly dividend to $1.77 per share in January. If the company maintains this payout in the remaining quarters of 2024, it will mean the company has raised its payout at a 9% compound annual growth rate since 2014, a clear indication of the company's commitment to rewarding shareholders. And the company hasn't imperiled its financial well-being in achieving the feat. Over the past decade, Air Products has averaged a 62.3 % payout ratio. With shares of Air Products currently valued at 13.5 times operating cash flow, notably lower than its five-year average cash flow multiple of 17.4, now seems like a great time to gas up on this leading dividend stock. Lee Samaha (MSC Industrial): This is going to be a challenging year for MSC Industrial Direct. The company has already reported its first-quarter 2024 earnings, and, as previously discussed, its end market conditions in late 2023 were significantly worse than management had previously expected. The manufacturing sector is slowing, weighed down by the persistence of relatively high interest rates. MSC Industrial is a metalworking and maintenance, repair, and operations products and services distributor, so its sales are governed by manufacturing conditions and susceptible to changes in its customers' manufacturing activity and the industrial sector at large. That's bad news in slowing conditions, as of now, but it's nothing that won't turn around with lower interest rates taking the brakes off the economy later in the year. In addition, while conditions are softening now, there's an underlying trend for manufacturing to reshore to the United States. In addition, MSC Industrial is improving the quality of its earnings by increasing its installed base of vending machines and its sales through customer locations accordingly. Meanwhile, investors can earn a well-covered dividend, currently yielding 3.3%, while they wait for conditions to improve. While there's obviously potential for near-term bad news, MSC Industrial's best days are ahead of it, as is the U.S. manufacturing sector's. Should you invest $1,000 in Apple right now? Before you buy stock in Apple, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Daniel Foelber has no position in any of the stocks mentioned. Lee Samaha has no position in any of the stocks mentioned. Scott Levine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Apple, MSC Industrial Direct, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. 3 Top Dividend Stocks That Could Deliver Record Payouts In 2024 was originally published by The Motley Fool Related Quotes "
}