{
    "title": "Apple will face lawsuit over how stalkers use AirTags",
    "date": "3/17/2024",
    "url": "https://qz.com/apple-airtags-stalkers-victims-lawsuit-ruling-1851342814",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Apple will have to face a lawsuit arguing that AirTags are used by stalkers to track their victims, after a judge rejected the tech giant’s effort to have the class-action complaint dismissed. U.S. District Judge Vince Chhabria ruled Friday in San Francisco that the plaintiffs’ claims of negligence and product liability were sufficient for the case to move forward, Bloomberg reports. He did dismiss other claims. “Apple may ultimately be right that California law did not require it to do more to diminish the ability of stalkers to use AirTags effectively, but that determination cannot be made at this early stage,” Chhabria wrote. The dozens of plaintiffs in the class-action lawsuit claim that Apple could be held legally liable under state law for how its AirTag tracking devices are used improperly. Apple has said the AirTag with was designed with “industry-first” safety measures, and has argued that it shouldn’t be held responsible for how the product is misused. Apple didn’t immediately comment on the ruling. Apple has had a rough start to 2024. In the span of less than a week recently, it shut down its long-troubled project to build an electric car, got dropped from a Goldman Sachs list of top stocks, backtracked on the issue of web apps on its iPhones and Europe, and got hit with a $2 billion fine in Europe for “abusing” its power against Spotify and other music streaming platforms. The company ended this week with a $490 million settlement deal in a shareholder lawsuit over the company reversing course after some 2018 comments by CEO Tim Cook about sales projections for China. Apple stock was largely flat last week, but the shares are down 7% so far in 2024. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}