{
    "title": "Apple may hire Google to build Gemini AI engine into next-gen iPhone",
    "date": "3/18/2024",
    "url": "https://finance.yahoo.com/news/apple-may-hire-google-build-134800940.html?prefer_reader_view=1&prefer_safari=1",
    "text": "The next batch of Apple iPhones could feature an artificial intelligence upgrade that comes from search engine giant Google. Apple is exploring a deal with Google that would allow Google to build its Gemini AI engine into Apple's iPhones, Bloomberg reported on Monday. Apple and Google have not confirmed a deal. Neither company immediately responded to a request for comment Monday. Wall Street analysts said the potential deal would help both companies in different ways. \"What matters here is that Apple may receive or retain some payment from Google for the privilege, especially if it helps Google keep more search revenue,\" analysts at Melius Research said in an investors' note. \"For Google, it would be a reputational win versus Microsoft and OpenAI, after a series of missteps in launching reliable AI products.\" But talks between Apple and Google don't necessarily mean a deal is coming. Bloomberg reported that Apple has also spoken to Microsoft's OpenAI about using its service. Google and Microsoft have been in a race against each other for dominance over generative AI — which took the world by storm in 2023 with the introduction of OpenAI's ChatGPT. The technology has since captured the attention of businesses and users alike, and has already begun to reshape work and entertainment, raising concerns from lawmakers and tech companies alike over AI's rapidly evolving impact on society itself. For now, tech giants Google and Microsoft are trying to get the upper hand on the market, something which a partnership with Apple could be key to achieving. Analysts said Apple's talks with Google are an attempt by the Cupertino, California-based company to beef up its upcoming iOS 18, ahead of its new products event scheduled for June. If finalized, an Apple-Google deal would give Apple access to Google's Gemini AI app, Bloomberg reported, citing anonymous sources. \"We believe the company is looking to upgrade Siri, augment the App Store for AI developers and foster edge processing on its devices for faster, secure experiences,\" Melius Research analysts said. But Google's Gemini has hit a rough patch since it was rebranded last month. The search giant in February suspended its Gemini artificial intelligence chatbot from generating images after it was discovered the bot was creating historical depictions featuring \"inaccuracies.\" Examples included depictions of Nazi soldiers as Black and Asian and popes as female, for which the company apologized. Dan Ives, senior equity research analyst at Wedbush Securities, said the impetus for the potential deal boils down to Apple hoping to bolster iPhone sales. \"For Apple, this will give them the foundation and technology blueprint to double down on AI features currently being developed within Apple Park to make sure that iPhone 16 will be a potential game changer iPhone release around AI functionality,\" Ives said. FBI agents raid FCI Dublin, a women’s prison known as the “rape club” | 60 Minutes Jim Gaffigan raises a glass to bourbon \"Jeopardy!\" host Ken Jennings "
}