{
    "title": "Tech layoffs continue unabated in March 2024: Apple, IBM, Dell among IT \nmajors that cut jobs | Mint",
    "date": "3/30/2024",
    "url": "https://www.livemint.com/technology/tech-news/tech-layoffs-continue-unabated-in-march-2024-apple-ibm-dell-among-it-majors-that-cut-jobs-11711791233360.html",
    "text": "As the Information Technology industry struggles with its challenges, major tech giants have been on a layoff spree in March this year. The downsizing of the company size is mostly being attributed to \"cost-cutting\" . Big names in the tech industry such as Apple, Dell, and Ericsson have trimmed their workforce citing different reasons. While Apple reportedly sacked its team of engineers because of a job not well done, Ericsson said the demand of 5G equipment had declined. Here's a list tech layoffs in March and why were these job cuts made:Layoffs at Apple: Apple Inc was trying to develop microLED displays for the future models of Apple Watches internally. However, according to Bloomberg, the efforts were futile and because of it the tech giant re-organised its display engineering teams while laying off dozens of employees across Asia and United States.\n     Layoffs at Dell: Dell had said that it is cutting its workforce as a part of broader cost-cutting measure. The layoff, which reportedly took away nearly 6,000 jobs, came at a time when the demand for the Dell PCs slowed down causing an 11% drop in the Q4 revenue.\n  Layoffs at Ericsson: Earlier this month, Ericsson said that it will cut 1,200 jobs in Sweden because the demand for 5G network equipment has slowed down. The telecom giant is bracing for a \"challenging mobile networks market\" this year, and therefore the layoffs are a part of its cost-saving measure for 2024.\n Layoffs at Turnitin: Turnitin, a plagiarism detection tech firm, laid off around 15 people earlier this year, TechCrunch reported.  Company's CEO Chris Caren said last year that Artificial Intelligence would enable Turnitin to reduce its engineering headcount by 20 per cent within 18 months.\n Layoffs at Zee: Zee Entertainment Enterprises Ltd on Friday said it is overhauling its technology and innovation centre, which includes a pruning of expenses by 50 per cent and a restructuring of its team on the advice of a new management oversight panel.\n Layoffs at IBM: International Business Machines Corp (IBM) in March announced job cuts in its marketing and communication divison, CNBC reported. However, IBM gave no specific number of employees who would lose their jobs in the process. Jonathan Adashek, the chief communications officer at IBM announced the layoffs in a seven-minute meeting, the report added.\n\n\n\n\nYou may be interested in\n\n\n\n\n\n\n\n\n\n\n\n\n    As many as 56,858 tech jobs have been cut in 2024, reported Layoffs.fyi, a startup that has been tracking job cuts in the industry since the pandemic.\n   In February, Layoffs.fyi founder Roger Lee, in an email wrote that this year, “tech companies are still trying to correct for their over-hiring during the pandemic surge.\"\n   \"Given that the high interest-rate environment and tech downturn have both lasted longer than initially expected,\" he had added.\n  ZEE ENTERTAINMENT ENTERPRISES                    More Information      \nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Chip(per) ambitions: Why India needs its wafer fabs          Dholera chip fab: India's leap into electronics manufacturing          Mint Primer| Google vs Indian startups row: its global implications          Ask me anything: Inside the race to build desi GPTs          A Google Maps competitor in India's tech revolution          ‘Need another technology leap for AI to start reasoning like humans’          Govt's ₹1-trillion deep tech fund: why we need it, and is it enough?          Telepathy: Would you allow a chip implant in your brain?          Budget 2024: India's digital public infra now a new 'factor of production'          Rights issue caps Byju's wild ride from top startup to throwaway valuation       Explore Premium  \n\n\n                Catch all the  Technology News and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 30 Mar 2024, 03:27 PM IST\n\t\nTopics You May Be Interested In \n tech sector \n tech layoffs \n layoffs in tech sector \n IT industry \n job cuts \n downsizing \n layoffs \n layoffs at apple \n layoffs at dell \n layoffs at ericsson \n layoffs ar turnitin \n layoffs at ibm Layoffs at Apple: Apple Inc was trying to develop microLED displays for the future models of Apple Watches internally. However, according to Bloomberg, the efforts were futile and because of it the tech giant re-organised its display engineering teams while laying off dozens of employees across Asia and United States. Layoffs at Dell: Dell had said that it is cutting its workforce as a part of broader cost-cutting measure. The layoff, which reportedly took away nearly 6,000 jobs, came at a time when the demand for the Dell PCs slowed down causing an 11% drop in the Q4 revenue. Layoffs at Ericsson: Earlier this month, Ericsson said that it will cut 1,200 jobs in Sweden because the demand for 5G network equipment has slowed down. The telecom giant is bracing for a \"challenging mobile networks market\" this year, and therefore the layoffs are a part of its cost-saving measure for 2024. Layoffs at Turnitin: Turnitin, a plagiarism detection tech firm, laid off around 15 people earlier this year, TechCrunch reported.  Company's CEO Chris Caren said last year that Artificial Intelligence would enable Turnitin to reduce its engineering headcount by 20 per cent within 18 months. Layoffs at Zee: Zee Entertainment Enterprises Ltd on Friday said it is overhauling its technology and innovation centre, which includes a pruning of expenses by 50 per cent and a restructuring of its team on the advice of a new management oversight panel. Layoffs at IBM: International Business Machines Corp (IBM) in March announced job cuts in its marketing and communication divison, CNBC reported. However, IBM gave no specific number of employees who would lose their jobs in the process. Jonathan Adashek, the chief communications officer at IBM announced the layoffs in a seven-minute meeting, the report added. As many as 56,858 tech jobs have been cut in 2024, reported Layoffs.fyi, a startup that has been tracking job cuts in the industry since the pandemic. In February, Layoffs.fyi founder Roger Lee, in an email wrote that this year, “tech companies are still trying to correct for their over-hiring during the pandemic surge.\" \"Given that the high interest-rate environment and tech downturn have both lasted longer than initially expected,\" he had added. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}