{
    "title": "Apple pays $13 million Russian fine, goes directly into federal budget",
    "date": "1/23/2024",
    "url": "https://www.businessinsider.com/apple-13-million-russian-fine-putin-crackdown-western-tech-giants-2024-1",
    "text": "       Apple has reportedly paid a $13 million Russian fine as President Vladimir Putin escalates his crackdown on foreign tech firms. The US tech giant paid the 1.18 billion roubles ($13.3 million) fine on January 19, Russia's FAS antitrust agency announced, per Reuters — with those funds immediately going into the country's federal budget as Russia ramps up spending on its destructive invasion of Ukraine. The fine was levied after the regulator ruled that Apple had used its dominant market position to stop developers from informing customers they could pay for in-app purchases outside of Apple's app store, according to the Financial Times. Related stories Like many other Western companies, Apple has largely abandoned Russia since Putin launched an invasion of Ukraine in February 2022, though it still operates its app store in the country. The Silicon Valley heavyweight paused all iPhone sales shortly after Russian tanks rolled across the Ukrainian border, and has also limited its ApplePay service in the country. Apple and its Big Tech rivals have faced repeated fines and legal action by Russian regulators. Apple previously paid a $12 million fine over similar allegations of anticompetitive behavior in February, and Google has received over $400 million worth of fines for failing to remove what Russia describes as \"fake\" information about the war in Ukraine. Russia's finances are straining under the pressure of the ongoing war in Ukraine and crippling sanctions, with the Kremlin reportedly burning through nearly half of its national wealth fund since the invasion began. Putin has attempted to top up stretched defense budgets by cracking down on foreign companies and selling off their stranded Russian assets, with the Russian government hoping to raise 114.5 billion roubles ($1.3 billion) from such sales in 2023. However, the war has left the Russian economy struggling with spiraling food prices and a shortage of workers. It has also devastated Russia's once-thriving tech sector, with tech workers fleeing the country to escape conscription and social media giant Yandex NV, once known as \"Russia's Google,\" reportedly planning to sell off most of its Russian business. Apple did not immediately respond to a request for comment from Business Insider, made outside normal working hours. Read next Jump to "
}