{
    "title": "Apple Vision Pro: Don't call it 'virtual reality'",
    "date": "1/9/2024",
    "url": "https://www.businessinsider.com/apple-vision-pro-tim-cook-spatial-reality-vr-virtual-reality-2024-1",
    "text": "       What's the best way to describe Apple's just-about-to-debut Vision Pro headsets? It's a big question since these $3,500 (and up) devices are supposed to be mind-blowing tech. But they are also supposed to be impossible to appreciate until you've tried the devices themselves. So when people who've used Apple's Vision Pro try explaining what it's like, they end up fumbling for words. Related stories Apple, however, seems confident that this term will make sense to you, a normal person who has never tried the Vision Pro: \"spatial computing.\" Those are the first words Apple uses on its site to sell/promote the headsets. They are also the words Apple is telling Vision Pro developers — the people who will make specialized apps for the headset — they must use to describe their software. \"Refer to your app as a spatial computing app,\" Apple tells developers in its online guidelines. \"Don't describe your app experience as augmented reality (AR), virtual reality (VR), extended reality (XR), or mixed reality (MR).\" The generous way to interpret this instruction: It's Apple's device, and Apple is free to use any terms it wants to describe it. If Apple wanted to call the Vision Pro a \"mind-blowing into-the-future awesome thing on your head,\" they could do that, too. It would also make some sense for Apple to survey the marketing used by competitors like Meta — which uses both \"virtual reality\" and \"mixed reality\" when describing Meta's lineup of high-tech headsets and glasses — and conclude that most people don't know what any of that means and that Apple will go another direction. But if you're bearish on Apple's new headset (Apple doesn't want developers calling it \"headset, either, by the way) then you'd look at its insistence on \"spatial computing\" — a technical term that won't mean anything to a normal person — and conclude that Apple doesn't know how to tell you, a normal person, what Vision Pro is, why you'd want to use it, or why you'd pay (at least) $3,500 for it. And if you had that point of view, you might view Apple's newest teaser ad for Vision Pro in the same way: It's a bunch of cool clips from famous movies (with a cool Devo song as the soundtrack) depicting people putting things on their heads — without really explaining what happens after that. We'll start to find out which perspective is right next month. Read next Jump to "
}