{
    "title": null,
    "date": "1/22/2024",
    "url": "https://www.investors.com/news/technology/apple-stock-rises-as-vision-pro-sales-begin/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Hardcore Apple (AAPL) fans grabbed the initial production run of Apple Vision Pro headsets during the first weekend of preorders. But the real test for the spatial computing device will come in the weeks ahead, analysts say. Apple stock rose on Monday. In a blog post, TF International Securities analyst Ming-Chi Kuo estimates that Apple sold 160,000 to 180,000 units of Vision Pro over the first three days of preorders. That's at least 40% of the 400,000 units Apple reportedly plans to sell in the first year. Apple began taking preorders for the mixed-reality headset on Friday. The Apple Vision Pro officially goes on sale Feb. 2. However, Kuo is cautious about near-term demand for the $3,500 computer headset. \"The instant sold-out and extended shipping times seem positive at first, but a key concern emerged: shipping times remained unchanged 48 hours after preorders opened,\" Kuo said. \"It indicates that demand may quickly taper off after the core fans and heavy users place their orders.\" The key factor to watch is \"whether the demand is sustainable,\" he said. \"Right now, Vision Pro is still a very niche product.\" Apple Vision Pro is the highest-profile launch in the spatial computing headset space to date. But others are working on headsets ranging from mixed-reality goggles to augmented-reality smartglasses. JPMorgan analyst Samik Chatterjee thinks investor focus on Vision Pro availability and \"lead times\" is misplaced. \"The focus should be on the consumer feedback on the experience of the device,\" he said in a client note Monday. \"The orders currently being put through for the Vision Pro are prior to the product being tried or experienced by any customers.\" Apple will start demonstrating the device in stores on Feb. 2. Chatterjee added that investors also should watch for supply chain moves around the second-generation Vision Pro. Chatterjee rates Apple stock as overweight with a price target of 225. On the stock market today, Apple stock rose 1.2% to close at 193.89. With Monday's gains, Apple stock returned to the buy zone of its Dec. 5 breakout from a cup-with-handle base with a 192.93 buy point, according to IBD MarketSmith charts. The 5% buy zone stretches to 202.58. Apple stock reclaimed its 50-day line on Friday and could be forming a new base with a buy point of 199.62. Follow Patrick Seitz on X, formerly Twitter, at @IBD_PSeitz for more stories on consumer technology, software and semiconductor stocks. YOU MAY ALSO LIKE: Powerfoyle Becoming 'Intel Inside' For Light-Powered Gadgets Robot Barista Looks To Fill Labor Shortage. Say Hello To Adam. Apple In 2024: AI, Selling Vision Pro Are Key Challenges See Stocks On The List Of Leaders Near A Buy Point Find Winning Stocks With MarketSmith Pattern Recognition & Custom Screens 3/29/2024\nCheck the Stock Market Today column to spot changes in market trend and track the best stocks to buy and... 3/29/2024\nCheck the Stock Market Today column to spot changes in... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}