{
    "title": "Norway wealth fund posts record $213 billion profit, driven by Apple, tech \nstocks",
    "date": "1/30/2024",
    "url": "https://macdailynews.com/2024/01/30/norway-wealth-fund-posts-record-213-billion-profit-driven-by-apple-tech-stocks/",
    "text": "Update font size. Reset  Norway’s $1.6 trillion sovereign wealth fund, the world’s largest, reported on Tuesday a record profit of 2.22 trillion crowns ($213 billion) in 2023, driven by strong returns on its investments in technology stocks. The fund’s most valuable company stakes were in Apple, Microsoft and Nvidia. Gwladys Fouche for Reuters:\n ‎ The results compared with a record loss in 2022 of 1.64 trillion crowns, when tech stocks fell. “2023 ended a lot better than expected,” NBIM CEO Nicolai Tangen told a press conference. The fund’s return on investment in 2023 stood at 16.1% for the year, 0.18 percentage point lower than the return on its benchmark index. Norway is a major crude oil exporter and Europe’s largest gas supplier after a drop in Russian gas flows in 2022, and has benefited from higher energy prices due to the war in Ukraine. ‎\nMacDailyNews Take: There’s a nice profit.\n ‎\nPlease help support MacDailyNews. Click or tap here to support our independent tech blog. Thank you! Support MacDailyNews at no extra cost to you by using this link to shop at Amazon. This site uses Akismet to reduce spam. Learn how your comment data is processed. “Ted Lasso” star and writer Brett Goldstein is set to appear in a guest star role in “Shrinking” Season 2 at Apple TV+… Apple’s M3 Ultra chip may be designed as a unique standalone chip, rather than two M3 Max chips joined together as in the M1 Ultra and… Alphabet subsidiary Google’s Android website has added a new landing page for Google Messages which touts that RCS on Apple’s iPhone… Sunshine is launching a new AI product, Shine. The product offers a photo-sharing app and an events website. Co-founder Marissa Mayer tells… Apple filed a lawsuit earlier this month against former software engineer Andrew Aude, alleging he leaked info about products he hated… Enter your email address to follow MacDailyNews and receive notifications of new posts by email. Email Address Follow :-) "
}