{
    "title": "Microsoft on verge of surpassing Apple as world’s most valuable company",
    "date": "1/11/2024",
    "url": "https://www.businesstoday.in/technology/news/story/microsoft-on-verge-of-surpassing-apple-as-worlds-most-valuable-company-412749-2024-01-11",
    "text": "Feedback Microsoft seems to be set to overtake Apple as the world’s most valuable company. This development comes in the wake of a recent dip in Apple’s stock, fuelled by concerns over iPhone sales. Apple’s shares have fallen by 4 per cent in 2024, following a 48 per cent rally last year. In contrast, Microsoft’s shares have risen by about 2 per cent this year, building on a 57 per cent surge in 2023. On Wednesday, Apple’s shares dipped by 0.4 per cent, while Microsoft’s rose by 1.6 per cent, further narrowing the gap between the two tech giants. Apple’s current market value stands at $2.866 trillion, with Microsoft hot on its heels at $2.837 trillion. Apple’s market capitalisation reached its peak at $3.081 trillion on December 14, while Microsoft’s value hit a high of $2.844 trillion on November 28. However, iPhone sales in China dropped by 30 per cent in the first week of 2024, according to a note from Jefferies analysts, indicating increasing competitive pressure from Huawei and other domestic rivals. Apple is set to launch its Vision Pro mixed-reality headset on February 2 in the United States, marking its biggest product launch since the iPhone in 2007. However, a report from UBS on Monday estimated that Vision Pro sales would be “relatively immaterial” to Apple’s earnings per share in 2024. Microsoft has briefly surpassed Apple as the most valuable company a few times since 2018, most recently in 2021, when concerns about supply chain shortages related to the COVID-19 pandemic impacted Apple’s stock price. Both tech stocks appear relatively expensive in terms of price to their expected earnings. Apple is trading at a forward PE of 28, significantly above its 10-year average of 19, according to LSEG data. Microsoft is trading around 31 times forward earnings, above its 10-year average of 24. In its most recent quarterly report in November, Apple provided a sales forecast for the holiday quarter that fell short of Wall Street expectations, due to weak demand for iPads and wearables. Analysts predict Apple will post a revenue increase of 0.7% to $117.9 billion for the December quarter, marking its first year-on-year revenue increase in four quarters. Apple is set to report its results on February 1. Meanwhile, analysts expect Microsoft to report a 16% increase in revenue to $61.1 billion, driven by ongoing growth in its cloud business. Microsoft’s results are due in the coming weeks. With inputs from AgenciesAlso read: AI helps Indian-origin scientist-led team discover new battery material potentially reducing lithium use by 70% Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}