{
    "title": "Nearly 50% of Warren Buffett-Led Berkshire Hathaway's $369 Billion \nPortfolio Is Invested in Only 1 Stock",
    "date": "1/28/2024",
    "url": "https://www.fool.com/investing/2024/01/28/half-warren-buffett-berkshire-portfolio-1-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Berkshire Hathaway, which has exposure to various industries, including insurance, railroads, and energy, also owns a massive public-equities portfolio. Individual investors look through this list of holdings to find potential opportunities. It's hard to ignore that Apple (AAPL -1.06%) represents nearly half of the Warren Buffett-led portfolio. This investment has worked out extremely well, as shares of the iPhone maker have soared some 640% since the start of 2016, around the time Berkshire Hathaway first started purchasing the stock. Investors can gain insights by figuring out what characteristics first intrigued Buffett when it comes to Apple. And by looking at things as they stand today with a long-term time horizon, we can make a conclusion about this top FAANG stock's investment merits now. Berkshire Hathaway's portfolio includes well-known businesses like American Express, Coca-Cola, and Kraft Heinz. What all of these companies have in common is the presence of a powerful brand. This has long been Apple's key competitive advantage and differentiator, and it's probably what Buffett noticed when he started buying shares. The consumer electronics industry is typically a difficult one to find lasting success in because there's intense competition and pricing pressure. Apple is unique in that it's able to buck this trend and demonstrate its pricing power. The business sells its hardware products at premium prices, which consumers have shown a willingness to pay. This explains why Apple's gross margin has averaged 41% in the last five years. Past and present leaders, from Steve Jobs to Tim Cook, have done a fantastic job maintaining Apple's brand strength. I think this gives Buffett confidence that the business will be dominant in the future. The Oracle of Omaha -- as Buffett is known -- was also certainly impressed by Apple's financial profile. This is one of the most profitable enterprises on the face of the planet. Its operating margin has consistently been over 24% in each of the last 10 fiscal years. And the company's return on invested capital of 56.9% is indicative of a financially exceptional business. Before investing in a stock, Buffett wants to figure out if the company in question will have materially higher earnings in the future. Between fiscal 2016 and 2023, Apple's net income increased at a compound annual rate of 14.7%. Based on this track record, it's hard to envision a scenario where the bottom line doesn't continue expanding in the years ahead. And maybe the most important factor that encouraged Buffett to make the decision to add this tech stock to Berkshire's portfolio was its ridiculously cheap valuation. During the first quarter of 2016, Apple shares traded at an average price-to-earnings (P/E) ratio of 10.6. Based on the brand recognition and the impressive financials, this valuation made the stock a no-brainer buy back then. That's why Buffett pounced at the opportunity. Before you rush to add Apple to your portfolio, it's a good idea to view the business with a fresh perspective. Ultimately, investors need to figure out if Apple can outperform the S&P 500 as we look toward the next decade. To be quite frank, I don't have confidence in this outcome. One reason is the company's slowing growth. Apple posted a revenue drop of 2.8% in fiscal 2023. The softer economic backdrop is partly to blame, but this might also demonstrate that the business is in a far more mature stage of its lifecycle. I also think the valuation is expensive right now. The P/E multiple is currently about 32, which is around three times more expensive than it was when Buffett first bought it. My view that the stock will likely underperform the broader index going forward can obviously prove to be incorrect. But based on where things stand today, I don't believe Apple is a smart investment for long-term investors. American Express is an advertising partner of The Ascent, a Motley Fool company. Neil Patel and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool recommends Kraft Heinz. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}