{
    "title": "Stocks Decline And Fed Rate Cuts Imperiled To Begin 2024",
    "date": "1/7/2024",
    "url": "https://www.forbes.com/sites/bill_stone/2024/01/07/stocks-decline-and-fed-rate-cuts-imperiled-to-begin-2024/",
    "text": "After stellar gains in 2023, stocks and the Magnificent 7 took a breather to start 2024. After stellar gains of 107% in 2023, the Magnificent 7 took a breather to start 2024. Recall the Magnificent 7 consists of Microsoft\nMSFT\n (MSFT), Meta Platforms\nFB\n (META), Amazon.com (AMZN), Apple\nAAPL\n (AAPL), NVIDIA\nNVDA\n\nDIA\n (NVDA), Alphabet (GOOGL), and Tesla\nTSLA\n (TSLA). The mega-caps in the S&P 500 also underperformed, with the equal-weighted S&P 500 besting the traditional capitalization-weighted index. The relative market kindness did not extend to the small-cap stocks, which had a tough week. Magnificent 7 Lag In 2024 At least some of the weakness can be attributed to rebalancing in a new tax year to take some profits from some winners. Additionally, as discussed previously, the markets had priced in a very high probability of avoiding a recession. The significant underperformance of the economically sensitive cyclical stocks last week relative to the less sensitive staples shows some wavering in confidence around a soft landing. The small caps, as represented by the Russell 2000, are also very economically sensitive, so less economic optimism certainly played a role in its underperformance. Cyclicals & Yields The case for a soft landing of the economy is also predicated on rate cuts from the Federal Reserve (Fed). Markets had priced in significant easing by the end of 2023, and those expectations eased on the margin last week. Expectations for the Fed’s short-term interest rates in one year were at 3.95% at the end of 2024 and 4.05% last week. One-Year Forward Fed Funds Futures Rate Another solid payrolls report on Friday helped lower the odds that the Fed would need to cut rates in March. Nonfarm payrolls grew by an above-consensus 216,000, partially offset by downward revisions to previous months. The household survey showed job losses, but the ironclad evidence of weakness in the labor market remains elusive. The household survey had a similarly poor showing in late 2022, then had a couple of significant upside surprises. Monthly Job Growth Perhaps more concerning for the ability of the Fed to pivot to rate cuts was the above-consensus growth in wages. The concern will be that this will continue to bleed into services inflation and derail the move back to target inflation. Wage Growth The next big test for markets will be Thursday’s consumer inflation (CPI) report for December. Consistent with the Cleveland Fed’s estimate, the consensus expects headline CPI to reaccelerate slightly to 3.2% year-over-year. The more critical subset of inflation will likely be services inflation, excluding housing, to judge the bleed-through from wages. Even though the probability has declined, the futures market still calls for the first Fed easing in March. U.S. CPI Inflation Estimate As much as the decline in the pricing of Fed funds from 5.01% to 3.95% one year in the future acted like rocket fuel for stock and bond prices, any movement higher is likely to add to the market turbulence. The consumer inflation (CPI) reading on Thursday will likely provide the next big hurdle for expectations and markets. In addition, the fourth-quarter earnings season begins on Friday with some of the big banks. Disclosure: Glenview Trust currently has holdings of Microsoft (MSFT), Meta Platforms (META), Amazon.com (AMZN), Apple (AAPL), NVIDIA (NVDA), and Alphabet (GOOGL) within its recommended investment strategies.  "
}