{
    "title": "Apple class action claims company won't service watches for those with ICDs",
    "date": "2/15/2024",
    "url": "https://topclassactions.com/lawsuit-settlements/lawsuit-news/apple-class-action-lawsuit-and-settlement-news/apple-class-action-claims-company-wont-service-watches-for-those-with-icds/",
    "text": "Apple allegedly refuses to service Apple Watches under its AppleCare+ service, support and repair contract for consumers with an implantable cardioverter defibrillator. An Apple class action alleges the company won’t service Apple Watches under its service, support and repair contract, AppleCare+, for consumers with an implantable cardioverter defibrillator (ICD). Plaintiff Harrison Varnes, who has an ICD, claims Apple is refusing to service his Apple Watch while allegedly telling him his implant makes him an “unintended user” for the Apple Watch and AppleCare+. “Apple has confirmed by subsequent letter to Plaintiff’s counsel that its refusal to repair or service Plaintiff’s Apple Watch under AppleCare+ was solely because Plaintiff has an ICD,” the Apple class action states. Varnes is seeking to represent a nationwide class of consumers with a cardiac pacemaker, ICD or other implanted electronic device and who purchased an Apple Watch in the U.S. that is or was covered by AppleCare+. Varnes says in the Apple class action that he was “surprised to learn” that his ICD would make him an “unintended user” of the Apple Watch. Varnes claims Apple encouraged him and “thousands of other Americans with ICDs and pacemakers” to use the device to monitor their cardiac activity. “There is nothing in the AppleCare+ contract that suggests that AppleCare+ services are not available to Apple Watch customers with ICDs or defibrillators,” the Apple class action states. Varnes, who argues he has received no compensation for his two prior years of payments for AppleCare+, claims Apple is guilty of breach of contract and violating the Magnuson-Moss Warranty Act. The plaintiff is demanding a jury trial and requesting declaratory and injunctive relief along with an award of actual and statutory damages for himself and all class members. U.S. Customs and Border Protection decided last month that a redesigned version of the Apple Watch that does not contain a blood oxygen monitor will not be subject to an import ban, amid an ongoing patent dispute between Apple and global medical technology company Masimo. Do you have an implanted electronic device and purchased an Apple Watch with AppleCare+? Let us know in the comments. The plaintiffs are represented by Darren T. Kaplan of Kaplan Gore LLP. The Apple Watch ICDs class action lawsuit is Varnes v. Apple Inc., Case No. 1:24-cv-01007, in the U.S. District Court for the Eastern District of New York. Check out our list of Class Action Lawsuits and Class Action Settlements you may qualify to join! Read About More Class Action Lawsuits & Class Action Settlements: Δ I got my series 5 Apple Watch in 2017 and now it just doesn’t work anymore. Can’t even get it to charge I had a big problem with Apple in 2017 and 2018, because they wouldnt help me with my watch because of my icd. I ended up getting rid of apple and going to an android and using a fitbit 4, havent had any trouble with the fitbit watch so far. please add me Add me Your email address will not be published. By submitting your comment and contact information, you agree to receive marketing emails from Top Class Actions regarding this and/or similar lawsuits or settlements, and/or to be contacted by an attorney or law firm to discuss the details of your potential case at no charge to you if you qualify. Required fields are marked * Comment * Name * Email *   Δ Δ I got my series 5 Apple Watch in 2017 and now it just doesn’t work anymore. Can’t even get it to charge I had a big problem with Apple in 2017 and 2018, because they wouldnt help me with my watch because of my icd. I ended up getting rid of apple and going to an android and using a fitbit 4, havent had any trouble with the fitbit watch so far. please add me Add me Your email address will not be published. By submitting your comment and contact information, you agree to receive marketing emails from Top Class Actions regarding this and/or similar lawsuits or settlements, and/or to be contacted by an attorney or law firm to discuss the details of your potential case at no charge to you if you qualify. Required fields are marked * Comment * Name * Email *   Δ Please note: Top Class Actions is not a settlement\n\t\tadministrator or law firm. Top Class Actions is a legal news source\n\t\tthat reports on class action lawsuits, class action settlements,\n\t\tdrug injury lawsuits and product liability lawsuits. Top Class\n\t\tActions does not process claims and we cannot advise you on the\n\t\tstatus of any class action settlement claim. You must contact the\n\t\tsettlement administrator or your attorney for any updates regarding\n\t\tyour claim status, claim form or questions about when payments are\n\t\texpected to be mailed out.  Δ @2024 Top Class Actions. All Rights Reserved.\n                    \n                        Privacy Policy                     |\n                    \n                        Terms and Conditions "
}