{
    "title": null,
    "date": "3/29/2024",
    "url": "https://nz.news.yahoo.com/apple-fighting-governments-across-world-060000103.html",
    "text": "According to the US government, Apple is something like a disease: spreading ever further and destroying any competition that gets in its way. The problem has infected much of the world – and has even damaged Apple’s own core, making the iPhone worse. The tech giant’s anticompetitive conduct “reverberates through the industries ... including financial services, fitness, gaming, social media, news media, entertainment, and more”, a new lawsuit reads. “Unless Apple’s anticompetitive and exclusionary conduct is stopped, it will likely extend and entrench its iPhone monopoly to other markets and parts of the economy.” That was one accusation among many made by the US Department of Justice last week when it officially sued Apple, alleging that the company had illegally used its monopoly to keep its own standing in the smartphone market. There was more to come, when a few days later the European Union announced that it would be investigating Apple, Meta and Google over claims that they were not properly complying with its new Digital Markets Act (DMA). Apple is now facing regulatory scrutiny on both sides of the Atlantic. The company, which was once a scrappy upstart and still seems, often, to see itself that way, has grown to become one of the largest businesses on the planet. Recently, it appears that governments have come to view that as a danger – as something that could damage the experience of their citizens. The proceedings in both Europe and the US are based on a fairly simple premise: that Apple’s control over its platforms allows it to crush competition and thereby hurt consumers, and that its power should be limited by way of regulation. The US case, for example, suggests that Apple can use its control of the iPhone and its platform to favour the Apple Watch, meaning that other potentially better smartwatches are not able to gain access to the same features. While that is one of many complaints, they are all largely versions of the same issue: features and benefits are being kept from customers so that Apple can keep its power and money. Apple sees the various pieces of regulation as a threat – or at least, it wants people to think so. In its statement in response to the US proceedings, it suggested that it could be forced to change fundamentally. “This lawsuit threatens who we are and the principles that set Apple products apart in fiercely competitive markets,” it said. “If successful, it would hinder our ability to create the kind of technology people expect from Apple – where hardware, software, and services intersect. It would also set a dangerous precedent, empowering government to take a heavy hand in designing people’s technology.” Apple is right that the consequences of the proceedings could be dramatic. The DMA, for instance, gives officials a rare amount of leeway to impose meaningful fines: companies can be forced to pay up to 10 per cent of their annual turnover. The US lawsuit is less specific – it only asks for “relief” that would stop Apple from behaving illegally – but it could still lead to dramatic punishments. But it is also unusual that the company has responded to these regulations in public. Its approach to the DMA, for instance, appears to have been to offer a form of compliance, try it out, and then adjust it where necessary. In hearings relating to the EU case recently, Apple advised one affected developer that part of the legislation sounded potentially worrisome and that they should keep an eye out for a response. The proceedings in both Europe and the US are based on a fairly simple premise: that Apple’s control over its platforms allows it to crush competition and thereby hurt consumers Similarly, Apple appeared to scoop the Department of Justice when it adjusted its rules for streaming games services – one of the central tenets of the complaint – just a few weeks before the action was announced. That is one of the problems with trying to control companies through the courts. The EU’s act was trailed for years and comes with a thorough collection of regulations and punishments for not complying with the rules. It also requires Apple to let its users download apps from other third-party app stores – Apple complained about the changes for years, and may only have complied with them in the most resistant way, but it did accept the necessity of doing so. The US government, presumably because of political problems that make passing new laws difficult, has instead opted to use existing laws to try to crack down on Apple. In fact, its action against Apple is based on an astonishingly old law – the Sherman Anti-trust Act of 1890, which is closer to the beginning of the US than today. It was intended to limit the power of the growing trusts that were in the process of taking over the tobacco, steel, oil and other big industries, and was signed at a time when the major concern was railroads, not broadband connections. Still, it has remained useful to legislators who are looking to try to rein in companies. Its basic principles – that a monopoly may be permissible, but using that monopoly status to control the market is not – have been applied to technology companies that could never have been envisaged by John Sherman, the senator who wrote the law. It was used, for instance, in 2001, when the US sued Microsoft, arguing that it had illegally monopolised the browser market with its Windows product. The government had initially sought to break up the company – but eventually settled, agreeing to limited new rules on Microsoft and Windows, some of which were later removed on appeal. At the time, the case was hailed as a major development in the rules around personal computing – though Microsoft continued to dominate the market, and it was not the government but the mobile revolution that partially dethroned it. The Apple case might be its contemporary version: not aimed at PCs in people’s houses, but at the phones in their pockets. It is being brought by a new generation of government lawyers, in relation to a new generation of technology, but the principles they are looking to uphold are much the same. The conclusion may be much the same, too: grand statements on both sides, and a potentially seismic change in the landscape of technology, followed by a quiet compromise that changes little. Dutch police have detained a man who walked out of a nightclub where hostages were being held after a tense hours-long stand-off. Melbourne's Ben Brown has kicked three goals as the Demons scored a seven-point away victory against Port Adelaide. Trade 24 hours a day on the world's most popular platform. Lachlan Lonergan has suffered a serious ankle injury as the ACT Brumbies overcame a nine-point deficit to beat the Queensland Reds 20-19 at Suncorp Stadium. The Dolphins have gone top of the NRL ladder with a 30-14 win over Gold Coast as their big-name off-season recruits Thomas Flegler and Herbie Farnworth shone. Goalkeeper Ryan Scott was the hero for the Newcastle Jets as they hung on to deny A-League Men finals hopefuls Melbourne City in a scoreless draw. 為本地學士及研究院課程學生提供保險公司或專業中介公司的中後勤職位實習，體驗行業實況，了解發展前景並累積工作經驗。實習期為6月至8月，實習生可獲僱主發放每月酬金，立即報名！ Goals from Anthony Caceres and Joel King have sealed a 2-0 win for Sydney FC over the Central Coast Mariners in the A-League Men. The Hurricanes and Blues have both recorded huge Super Rugby Pacific wins, thumping the Highlanders and Moana Pasifika, respectively. Police are investigating racial abuse yelled at the children of an AFL legend while they were playing in their yard as support floods in for the family. If given HK$8 million to spend, Yat says he would invest in digital assets such as non-fungible tokens St George Illawarra fullback Tyrell Sloan has scored two tries to help the Dragons bounce back to winning ways with a 20-12 NRL victory over a poor Manly side. Essendon star Jake Stringer has kicked the match-winning goal to pull the Bombers over the line against a tired St Kilda at Marvel Stadium. The great Kelly Slater has been beaten at Bells Beach as Australians Morgan Cibilic and Ethan Ewing advanced to the quarter-finals of the Rip Curl Pro. DBS Treasures, Asia's safest bank, offers unmatched wealth management and investment services. Connect with us today. The Western Force's unbeaten start to the Super Rugby Women season has come to an end, losing to Fijian Drua, while the Brumbies saw off the Reds. Wellington have dealt a blow to Western Sydney's finals hopes, while Michelle Heyman equalled an ALW record as Canberra staged a late comeback in Brisbane. Liam Wilson has been told by ring rival Oscar Valdez he must not give up on a promise he made to his dying dad, despite losing his latest world-title fight.  Melbourne United will have home-court advantage for the deciding game of the best-of-five NBL championship series against the Tasmania JackJumpers. Endale Mekonnen and Chloe Mannix-Power have set the pace in the heats for the 2024 Stawell Gifts. The Western Force were up a man for 30 minutes against the Drua, but still suffered a 31-13 loss in wet and slippery conditions in Fiji. 連續13日閃購，PS5 Slim、Marshall、Switch OLED、AirPods Pro 2、DJI等人氣產品平到笑！ Australian star Josh Giddey scored a team-high 23 points to help the Oklahoma City Thunder roll past the Phoenix Suns in the NBA. The SA government has unveiled a package to help winemakers return to China's huge market with the lifting of punitive tariffs. One woman has died and a second is in a critical condition after overdosing in Queensland's southeast. "
}