{
    "title": "United States sues Apple in iPhone monopoly case",
    "date": "3/21/2024",
    "url": "https://mybroadband.co.za/news/business/529759-apples-market-value-shaken-as-regulators-close-in.html",
    "text": "MyBroadband Regulators on both sides of the Atlantic are training their eyes on Apple Inc., unnerving investors with fears over fines and threatening its market dominance. In the US, the Justice Department and 16 attorneys general are suing the iPhone maker for violating antitrust laws. And in Europe, the company is said to be facing probes about whether it’s complying with the region’s Digital Markets Act. Shares of the company slid 4.1% Thursday, erasing about $113 billion in market value and taking their year-to-date loss back to 11%. Once the world’s most valuable firm at more than $3 trillion, Apple has underperformed both the Nasdaq 100 and the S&P 500 in 2024. The American suit, filed Thursday in New Jersey federal court, accuses Apple of blocking rivals from accessing hardware and software features on its popular devices. The potential investigations in Europe, which are also targeting some of Apple’s rivals, will focus on the firm’s new fees, terms and conditions for app store developers. “There comes a point in which the downpour of cases and scrutiny that comes with them become a real drag on how these companies operate,” said Bill Kovacic, an antitrust professor at George Washington University Law School. “Even if they win, in an important way they’ve lost.” Apple fired back at the US lawsuit by calling it “wrong on the facts and the law.” It warned that the action would “set a dangerous precedent, empowering government to take a heavy hand in designing people’s technology” and vowed to “vigorously defend against it.” The company didn’t respond to a request for comment on the potential European probes. The US lawsuit alleges that Apple has used its power over app distribution on the iPhone to thwart innovations that would have made it easier for consumers to switch phones. The company has refused to support cross-platform messaging apps, limited third-party digital wallets and non-Apple smartwatches, and blocked mobile cloud streaming services, according to the DOJ. It highlights five examples of technologies in which it says Apple suppresses competition: super apps, cloud streaming game apps, messaging apps, smartwatches and digital wallets. The company recently added support for cloud-based gaming services and said it would add RCS cross-platform messaging later this year. “At Apple, we innovate every day to make technology people love — designing products that work seamlessly together, protect people’s privacy and security, and create a magical experience for our users,” the company said in a statement. “This lawsuit threatens who we are and the principles that set Apple products apart in fiercely competitive markets.” The Digital Markets Act — which lays out a series of do’s and don’ts for some of the world’s largest tech platforms — allows European Commission to levy hefty penalties of as much as 10% of a company’s total annual worldwide revenue, and up to 20% for firms who repeatedly flout the rules. After starting formal investigations into Apple — as well as Alphabet Inc.’s Google — regulators aim to wrap up their final decisions within a period of 12 months. Apple, fresh from its €1.8 billion ($2 billion) European Union fine for blocking music streaming apps from informing users of cheaper deals, has been under heavy scrutiny since the DMA came into full effect on March 7. antitrust Apple big tech Department of Justice (DoJ) Digital Markets Act (DMA) European Commission European Union (EU) iphone most valuable companies Comments section policy: MyBroadband has a new article comments policy which aims to encourage constructive discussions. To get your comments published, make sure it is civil and adds value to the discussion.   Which cinema have you visited recently or plan on visiting?  View Results "
}