{
    "title": "Valueworks LLC Has $3.98 Million Stake in Apple Inc. (NASDAQ:AAPL)",
    "date": "3/11/2024",
    "url": "https://www.americanbankingnews.com/2024/03/11/valueworks-llc-has-3-98-million-stake-in-apple-inc-nasdaqaapl.html",
    "text": "Posted by ABMN Staff on Mar 11th, 2024 Valueworks LLC decreased its position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 0.6% during the 3rd quarter, HoldingsChannel reports. The fund owned 23,238 shares of the iPhone maker’s stock after selling 140 shares during the period. Apple comprises approximately 1.4% of Valueworks LLC’s portfolio, making the stock its 24th largest holding. Valueworks LLC’s holdings in Apple were worth $3,978,000 as of its most recent SEC filing. Several other hedge funds also recently modified their holdings of the company. IFM Investors Pty Ltd lifted its holdings in Apple by 20.0% during the 1st quarter. IFM Investors Pty Ltd now owns 2,615,701 shares of the iPhone maker’s stock worth $456,728,000 after buying an additional 435,891 shares during the period. Ironwood Wealth Management LLC. lifted its holdings in Apple by 0.4% during the 1st quarter. Ironwood Wealth Management LLC. now owns 240,628 shares of the iPhone maker’s stock worth $42,016,000 after buying an additional 1,040 shares during the period. Markel Corp lifted its holdings in Apple by 0.7% during the 1st quarter. Markel Corp now owns 1,206,990 shares of the iPhone maker’s stock worth $210,752,000 after buying an additional 8,450 shares during the period. Camden Capital LLC lifted its holdings in Apple by 9.2% during the 1st quarter. Camden Capital LLC now owns 156,364 shares of the iPhone maker’s stock worth $27,305,000 after buying an additional 13,200 shares during the period. Finally, Harbor Island Capital LLC lifted its holdings in Apple by 0.3% during the 1st quarter. Harbor Island Capital LLC now owns 135,325 shares of the iPhone maker’s stock worth $23,629,000 after buying an additional 400 shares during the period. Institutional investors and hedge funds own 58.51% of the company’s stock. AAPL has been the topic of several recent research reports. Oppenheimer reaffirmed an “outperform” rating and set a $200.00 target price on shares of Apple in a report on Friday, February 2nd. Redburn Atlantic downgraded Apple from a “buy” rating to a “neutral” rating and set a $200.00 target price on the stock. in a report on Wednesday, January 10th. Redburn Partners lowered Apple to a “neutral” rating and set a $200.00 price objective for the company. in a research report on Wednesday, January 10th. Citigroup reissued a “buy” rating and issued a $225.00 price objective on shares of Apple in a research report on Friday, February 16th. Finally, DA Davidson assumed coverage on Apple in a research report on Wednesday, January 3rd. They issued a “neutral” rating and a $166.00 price objective for the company. One investment analyst has rated the stock with a sell rating, eleven have given a hold rating, twenty-one have issued a buy rating and one has issued a strong buy rating to the company. According to MarketBeat, the stock presently has an average rating of “Moderate Buy” and a consensus target price of $205.27. Check Out Our Latest Stock Report on Apple In other Apple news, Director Arthur D. Levinson sold 100,000 shares of the business’s stock in a transaction on Thursday, February 29th. The shares were sold at an average price of $180.94, for a total transaction of $18,094,000.00. Following the sale, the director now owns 4,434,576 shares of the company’s stock, valued at approximately $802,392,181.44. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available at this hyperlink. Insiders own 0.06% of the company’s stock. Apple stock opened at $170.73 on Monday. Apple Inc. has a 12 month low of $147.61 and a 12 month high of $199.62. The company has a current ratio of 1.07, a quick ratio of 1.02 and a debt-to-equity ratio of 1.28. The business’s 50 day simple moving average is $184.64 and its 200 day simple moving average is $183.62. The company has a market cap of $2.64 trillion, a price-to-earnings ratio of 26.59, a PEG ratio of 2.06 and a beta of 1.29. Apple (NASDAQ:AAPL – Get Free Report) last posted its quarterly earnings data on Thursday, February 1st. The iPhone maker reported $2.18 EPS for the quarter, beating the consensus estimate of $2.09 by $0.09. Apple had a return on equity of 156.04% and a net margin of 26.16%. The business had revenue of $119.60 billion for the quarter, compared to the consensus estimate of $117.99 billion. During the same quarter in the prior year, the business earned $1.88 earnings per share. Apple’s revenue for the quarter was up 2.1% on a year-over-year basis. Sell-side analysts forecast that Apple Inc. will post 6.55 EPS for the current year. The firm also recently announced a quarterly dividend, which was paid on Thursday, February 15th. Shareholders of record on Monday, February 12th were issued a dividend of $0.24 per share. The ex-dividend date of this dividend was Friday, February 9th. This represents a $0.96 dividend on an annualized basis and a yield of 0.56%. Apple’s payout ratio is 14.95%. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Alps Advisors Inc. Takes Position in SM Energy (NYSE:SM) Alps Advisors Inc. Takes Position in Markel Group Inc. (NYSE:MKL) "
}