{
    "title": "Apple says the iPhone 15's battery has double the promised lifespan",
    "date": "3/17/2024",
    "url": "https://ca.movies.yahoo.com/apple-says-the-iphone-15s-battery-has-double-the-promised-lifespan-213736866.html",
    "text": "Apple has updated the iPhone 15’s battery lifespan. The company said on Tuesday its latest iPhones can retain 80 percent of their original charging capacity after 1,000 cycles — double the company’s previous estimate — without any new hardware or software updates. Not so coincidentally, the change will arrive in time for upcoming EU regulations that will assign an energy grade for phones’ battery longevity. Before today, Apple’s online support documents quoted iPhone batteries as maintaining 80 percent of their original full charge after 500 cycles. But after the company retested long-term battery health in its 2023 smartphones — iPhone 15, iPhone 15 Plus, iPhone 15 Pro and iPhone 15 Pro Max — it found they can retain 80 percent capacity after at least 1,000 cycles. The company said its support documents will be updated on Tuesday to reflect the new estimate. Apple says its testing involved charging and draining the batteries 1,000 times under specific conditions and a suite of tests reflecting common uses. As for how the estimate doubled without any physical or software changes, the company attributes the upgrade to continual improvements to its battery components and iOS power management. For older (pre-2023) iPhones, the original estimate of retaining 80 percent capacity after 500 charge cycles still stands — at least for now. Apple said it’s looking into whether older models’ estimates need to be updated. Starting in June 2025, smartphone and tablet manufacturers doing business in the EU will be assigned a grade (A to G) indicating their energy efficiency, battery longevity, protection from dust and water and resistance to accidental drops. The battery longevity portion of the grade requires at least 800 charging cycles while retaining at least 80 percent of their original capacity, helping explain why Apple began retesting its devices’ long-term health. For ideal battery longevity, Apple recommends keeping your phone in temperatures between 62 and 72 degrees Fahrenheit when possible. You’ll also want to avoid charging or leaving your handset in hot environments (95 degrees or warmer) while trying to avoid much direct sun exposure. In addition, if you’re storing an old iPhone long-term, it’s best to leave it half-charged. In addition, Apple will soon move one of your phone’s most essential battery metrics to a different part of iOS settings. Beginning in iOS 17.4, currently in beta, the battery cycle count will move from Settings > General > About to a more logical home under Battery Health (under Settings > Battery). Apple introduced the battery cycle count to its mobile software in iOS 17, which was launched last fall. Local Bounti Corporation (NYSE:LOCL) Q4 2023 Earnings Call Transcript March 27, 2024 Local Bounti Corporation misses on earnings expectations. Reported EPS is $-8.1 EPS, expectations were $-3.18. LOCL isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning, and welcome […] The actress celebrated her daughter Matilda's first birthday on Saturday  Police in southern Russia have arrested three men from Central Asia for allegedly plotting a bomb attack, a week after Islamic State terrorists from Tajikistan killed 144 people at a rock concert in Moscow. Women working for the Office for National Statistics face disciplinary action if they object to male-born colleagues using single-sex lavatories and changing rooms, documents leaked to The Sunday Telegraph reveal. Spurs welcome the Hatters to town looking to get back on track IBKR EventTrader - A new, straightforward way to trade CME futures markets Bunnyville at the Detroit Zoo A few scattered snow showers are possible in Colorado's higher elevations, but it will remain dry across the metro and plains. Passive investing in index funds can generate returns that roughly match the overall market. But you can significantly...  Scrub Daddy, pimple patches and an awesome upholstery cleaner: The 'net is gaga over these picks. Iran International journalist Pouria Zeraati is recovering in hospital after being attacked on Friday. Cuts to central funding leaves lower tier of local government left to look after libraries, street cleaning and other facilities  The French actress (\"The English Patient\") will succeed Polish director Agnieszka Holland (\"Europa\") in the honorary role. ProSomnus, Inc. Common Stock (NASDAQ:OSA) Q4 2023 Earnings Call Transcript March 27, 2024 ProSomnus, Inc. Common Stock misses on earnings expectations. Reported EPS is $-0.42 EPS, expectations were $-0.31. OSA isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good day, […] COMMENT: Why is it that, in 2024, age-gap relationships still cause such brouhaha? There is no escaping the whispers and judgement if you choose to date someone much older or younger – but when it comes to love, we’ve all got skin in the game, writes Olivia Petter  Photo Illustration by Luis G. Rendon/The Daily Bast/Getty Images/Courtesy of Keianna MillerThe family of a Black 4-year-old boy who was shot dead by police responding to a bloody domestic violence incident are considering taking legal action. Lawyers representing Keianna Miller, whose son Terrell was killed by Macomb Police two weeks ago, told The Daily Beast she may file a civil lawsuit.“Police would lead a criminal investigation. The civil would be by a personal injury law firm like ours for a From Martini variations to spicy Margs, spring ushered in some surprising cocktail searches this month. If we want to find a potential multi-bagger, often there are underlying trends that can provide clues. One common...  Investors in Cintas Corporation ( NASDAQ:CTAS ) had a good week, as its shares rose 7.5% to close at US$687 following... Sellers have been dictating the action in Alibaba stock in recent months amid slowing growth and plenty of restructuring challenges. The Blues look to extend a strong run at Stamford Bridge "
}