{
    "title": "New iPad Pro And iPad Air On The Way? Apple's Longest Pause On New Models \nMight End In May - Apple (NASDA",
    "date": "3/28/2024",
    "url": "https://www.benzinga.com/news/24/03/38000809/new-ipad-pro-and-ipad-air-on-the-way-apples-longest-pause-on-new-models-might-end-in-may",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Apple Inc. AAPL has reportedly been gearing up to launch its new iPad Pro and iPad Air models. What Happened: The new iPad Pro and iPad Air models are expected to be released in early May, according to sources familiar with the matter, reported Bloomberg columnist Mark Gurman on Thursday. The new Pro model is rumored to feature OLED displays and a 12.9-inch screen for the iPad Air for the first time. This release will mark the end of the longest period without new iPad models since Apple co-founder Steve Jobs launched the product in 2010. The last update was about 18 months ago, contributing to a decline in tablet demand. The Cupertino, California-based tech giant is hoping that the new models, equipped with faster chips and updated accessories, will reinvigorate the category, Gurman noted. See Also: Mark Zuckerberg Reportedly Woos AI Talent From Google’s DeepMind With Personal Emails: Meta CEO Offers No Interviews, Higher Salaries Why It Matters: Despite a surge in iPad sales during the pandemic, the numbers have dropped in the last two fiscal years. During the recent holiday season, sales saw a further 25% year-over-year decline, a period when the devices are typically popular as gifts. The new iPad Pro models codenamed J717, J718, J720, and J721, will be powered by the new M3 chip and will be compatible with redesigned versions of the Magic Keyboard and Apple Pencil. This marks the first major update to the lineup since 2018. Subscribe to the Benzinga Tech Trends newsletter to get all the latest tech developments delivered to your inbox. The iPad Air, last updated in 2022 with the M1 chip, will receive a new processor. The 12.9-inch screen option will allow consumers to purchase a larger iPad at a lower price than the more upscale Pro. The current iPad Air costs $599, while the Pro line costs $200 more. Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: ‘Time To Buy’ Apple Stock, Says Expert: ‘Out Of All Mag 7 Stocks, After Maybe Tesla, Apple Is Currently The Most Hated’ Image Credits- Shutterstock Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}