{
    "title": null,
    "date": "3/23/2024",
    "url": "https://www.tradingview.com/news/benzinga:5f83b74f8094b:0-nvidia-s-superchip-elon-musk-s-microsoft-critique-apple-s-ai-advances-and-more-this-week-in-artificial-intelligence/",
    "text": "This week was filled with significant developments in the tech world, from Elon Musk’s renewed criticism of the Microsoft-OpenAI alliance to Apple’s advancements in AI. Nvidia made headlines with the launch of a new superchip, while speculation about a potential stock split made rounds. Additionally, Apple and Google’s potential collaboration over Gemini AI model sparked conversations. Here’s a quick recap: Nvidia’s New Superchip Nvidia Corp. NVDA unveiled its new GB200 AI superchip at the annual GTC event. The chip, touted as a “miracle”, has generated excitement in the tech world, outperforming the first AI supercomputer, the DGX-1, that Nvidia donated to OpenAI back in 2016. Read the full article here. Musk Criticizes Microsoft-OpenAI Alliance Tesla and SpaceX CEO Elon Musk highlighted Microsoft Corp. MSFT CEO Satya Nadella’s dismissive remarks about OpenAI in his lawsuit. According to the lawsuit, Nadella said that Microsoft could continue functioning even if OpenAI ceased to exist as they have all the intellectual property rights and necessary capabilities. Read the full article here. Apple’s Multimodal AI Progress Researchers at Apple Inc. AAPL have made significant strides in AI. They published a research paper detailing new methods for training large language models (LLMs) using text and images, which could lead to more advanced and flexible AI systems. Read the full article here. See Also: This Trader Lost $784,000 FOMO-Buying The Latest Hyped Meme Coin Apple and Google’s Potential Gemini Collaboration Deepwater Asset Management’s managing partner Gene Munster suggested that a reported deal between Apple and Alphabet Inc. GOOG GOOGL Google to license the Gemini AI model could benefit both companies. The move could position Apple as a leader in personalized AI and result in substantial annual payments for Google. Read the full article here. Potential Nvidia Stock Split With Nvidia shares soaring, CNBC host Jim Cramer asked CEO Jensen Huang about the possibility of a stock split. While Huang didn’t dismiss the idea, he made it clear that no immediate announcement would be made. Read the full article here. Read Next: Trump Vs Biden: Ohio Exit Polls Reveal Possible Chink In Ex-President’s Armor As 2024 Race Heats Up Photo courtesy: Shutterstock Engineered by Benzinga Neuro, Edited by Rounak Jain The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @bradfairbridge @rajbuzzz @Kevin Trinh @Cenobar @arcanebear @udcovers @fx.today @_dalton16 @TradingView @mytradingsetup @ftmocom @chartfeed @olka_gadzieva @mytradingsetup @satoshi_empire @MidasPls @Zeiierman Trading @Onlnternet Whatever the trade "
}