{
    "title": "Apple supplier Foxconn sees strong 2024 as Q4 beats forecasts",
    "date": "3/13/2024",
    "url": "https://theprint.in/tech/apple-supplier-foxconn-sees-strong-2024-as-q4-beats-forecasts/2000513/",
    "text": "By Yimou Lee and Faith HungTAIPEI (Reuters) -Apple supplier Foxconn said on Thursday it expects revenue to increase significantly in 2024 following a slow start to the year amid booming demand for AI servers, after it posted fourth-quarter profit that beat market estimates.\nThe outlook has turned rosier since Foxconn Chairman Young Liu said in November the world’s largest contract electronics maker had “relatively conservative and neutral” expectations for 2024.\n\n\nThe Taiwanese company said October-December net profit jumped 33% to T$53.14 billion ($1.69 billion) from T$40 billion in the same period the previous year thanks to robust demand for AI servers and strong sales during the peak year-end holiday season.\n\n\r\n\t\t\t\t\tShow Full Article By Yimou Lee and Faith HungTAIPEI (Reuters) -Apple supplier Foxconn said on Thursday it expects revenue to increase significantly in 2024 following a slow start to the year amid booming demand for AI servers, after it posted fourth-quarter profit that beat market estimates. The outlook has turned rosier since Foxconn Chairman Young Liu said in November the world’s largest contract electronics maker had “relatively conservative and neutral” expectations for 2024.\n\n\nThe Taiwanese company said October-December net profit jumped 33% to T$53.14 billion ($1.69 billion) from T$40 billion in the same period the previous year thanks to robust demand for AI servers and strong sales during the peak year-end holiday season.\n\n\r\n\t\t\t\t\tShow Full Article The outlook has turned rosier since Foxconn Chairman Young Liu said in November the world’s largest contract electronics maker had “relatively conservative and neutral” expectations for 2024. The Taiwanese company said October-December net profit jumped 33% to T$53.14 billion ($1.69 billion) from T$40 billion in the same period the previous year thanks to robust demand for AI servers and strong sales during the peak year-end holiday season.\n\n\r\n\t\t\t\t\tShow Full Article The Taiwanese company said October-December net profit jumped 33% to T$53.14 billion ($1.69 billion) from T$40 billion in the same period the previous year thanks to robust demand for AI servers and strong sales during the peak year-end holiday season. The profit beat a T$43.52 billion LSEG SmartEstimate, which gives greater weight to forecasts from analysts who are more consistently accurate.\nIn the fourth quarter, consumer electronics including smartphones accounted for 58% of revenue while cloud and networking products, including servers, contributed 20%.\nFoxconn said it expects revenue for the first quarter to slightly decline from a year earlier, with revenue for smart computer electronics also likely to drop in the period.\nThe company, formally called Hon Hai Precision Industry Co Ltd, has said it expects slowness in this year’s first quarter to be similar to the same period of the previous three years.\nStill, it sees 2024 revenue increasingly significantly year-on-year, it said.\nThe first quarter is traditionally quieter than the previous one, the season when Taiwan’s tech companies race to supply smartphones, tablets and other electronics to major vendors such as Apple for Western markets’ year-end holiday period.\nApple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ targets.\nFoxconn’s shares closed up 0.4% on Thursday ahead of the earnings release, compared with a flat broader market.\n($1 = 31.5050 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree and Christopher Cushing)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. The profit beat a T$43.52 billion LSEG SmartEstimate, which gives greater weight to forecasts from analysts who are more consistently accurate. In the fourth quarter, consumer electronics including smartphones accounted for 58% of revenue while cloud and networking products, including servers, contributed 20%.\nFoxconn said it expects revenue for the first quarter to slightly decline from a year earlier, with revenue for smart computer electronics also likely to drop in the period.\nThe company, formally called Hon Hai Precision Industry Co Ltd, has said it expects slowness in this year’s first quarter to be similar to the same period of the previous three years.\nStill, it sees 2024 revenue increasingly significantly year-on-year, it said.\nThe first quarter is traditionally quieter than the previous one, the season when Taiwan’s tech companies race to supply smartphones, tablets and other electronics to major vendors such as Apple for Western markets’ year-end holiday period.\nApple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ targets.\nFoxconn’s shares closed up 0.4% on Thursday ahead of the earnings release, compared with a flat broader market.\n($1 = 31.5050 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree and Christopher Cushing)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. In the fourth quarter, consumer electronics including smartphones accounted for 58% of revenue while cloud and networking products, including servers, contributed 20%. Foxconn said it expects revenue for the first quarter to slightly decline from a year earlier, with revenue for smart computer electronics also likely to drop in the period.\nThe company, formally called Hon Hai Precision Industry Co Ltd, has said it expects slowness in this year’s first quarter to be similar to the same period of the previous three years.\nStill, it sees 2024 revenue increasingly significantly year-on-year, it said.\nThe first quarter is traditionally quieter than the previous one, the season when Taiwan’s tech companies race to supply smartphones, tablets and other electronics to major vendors such as Apple for Western markets’ year-end holiday period.\nApple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ targets.\nFoxconn’s shares closed up 0.4% on Thursday ahead of the earnings release, compared with a flat broader market.\n($1 = 31.5050 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree and Christopher Cushing)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Foxconn said it expects revenue for the first quarter to slightly decline from a year earlier, with revenue for smart computer electronics also likely to drop in the period. The company, formally called Hon Hai Precision Industry Co Ltd, has said it expects slowness in this year’s first quarter to be similar to the same period of the previous three years.\nStill, it sees 2024 revenue increasingly significantly year-on-year, it said.\nThe first quarter is traditionally quieter than the previous one, the season when Taiwan’s tech companies race to supply smartphones, tablets and other electronics to major vendors such as Apple for Western markets’ year-end holiday period.\nApple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ targets.\nFoxconn’s shares closed up 0.4% on Thursday ahead of the earnings release, compared with a flat broader market.\n($1 = 31.5050 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree and Christopher Cushing)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. The company, formally called Hon Hai Precision Industry Co Ltd, has said it expects slowness in this year’s first quarter to be similar to the same period of the previous three years. Still, it sees 2024 revenue increasingly significantly year-on-year, it said.\nThe first quarter is traditionally quieter than the previous one, the season when Taiwan’s tech companies race to supply smartphones, tablets and other electronics to major vendors such as Apple for Western markets’ year-end holiday period.\nApple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ targets.\nFoxconn’s shares closed up 0.4% on Thursday ahead of the earnings release, compared with a flat broader market.\n($1 = 31.5050 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree and Christopher Cushing)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Still, it sees 2024 revenue increasingly significantly year-on-year, it said. The first quarter is traditionally quieter than the previous one, the season when Taiwan’s tech companies race to supply smartphones, tablets and other electronics to major vendors such as Apple for Western markets’ year-end holiday period.\nApple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ targets.\nFoxconn’s shares closed up 0.4% on Thursday ahead of the earnings release, compared with a flat broader market.\n($1 = 31.5050 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree and Christopher Cushing)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. The first quarter is traditionally quieter than the previous one, the season when Taiwan’s tech companies race to supply smartphones, tablets and other electronics to major vendors such as Apple for Western markets’ year-end holiday period. Apple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ targets.\nFoxconn’s shares closed up 0.4% on Thursday ahead of the earnings release, compared with a flat broader market.\n($1 = 31.5050 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree and Christopher Cushing)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Apple last month reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business though its China sales missed analysts’ targets. Foxconn’s shares closed up 0.4% on Thursday ahead of the earnings release, compared with a flat broader market.\n($1 = 31.5050 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree and Christopher Cushing)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Foxconn’s shares closed up 0.4% on Thursday ahead of the earnings release, compared with a flat broader market. ($1 = 31.5050 Taiwan dollars)\n (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree and Christopher Cushing)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. ($1 = 31.5050 Taiwan dollars) (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree and Christopher Cushing)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. (Reporting by Yimou Lee and Faith Hung; Editing by Anne Marie Roantree and Christopher Cushing) Disclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Disclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content.   Subscribe to our channels on YouTube, Telegram & WhatsApp Support Our Journalism India needs fair, non-hyphenated and questioning journalism, packed with on-ground reporting. ThePrint – with exceptional reporters, columnists and editors – is doing just that. Sustaining this needs support from wonderful readers like you. Whether you live in India or overseas, you can take a paid subscription by clicking here. Support Our Journalism Save my name, email, and website in this browser for the next time I comment.  Δ Required fields are marked *  Name * Email *  Δ Copyright © 2024 Printline Media Pvt. Ltd. All rights reserved. "
}