{
    "title": "Apple in China: iPhone maker to pull a Samsung with Baidu AI partnership, \nreport says",
    "date": "3/25/2024",
    "url": "https://www.financialexpress.com/life/technology-apple-in-china-iphone-maker-to-pull-a-samsung-with-baidu-ai-partnership-report-says-3436771/",
    "text": "The Financial Express Apple, an American multinational corporation, has made the selection of Baidu, a Chinese multinational technology company, to be the generative artificial intelligence (AI) technology supplier for its upcoming iPhone 16, with regard to a Chinese media report. The report also suggests that Baidu will be responsible for supplying generative AI to products present in the domestic market in the current year. From what it’s understood, Baidu’s Ernie Bot will be utilised by Apple for its iOS 18, iPhone 16, and Mac OS. Insights from a report on Monday by China Star Market, a Shanghai United Media Group-based press agency, stated that Apple have had conversations with other Chinese corporations, such as Alibaba Group Holding, which holds the Post, and a technology enterprise associated with Tsinghua University’s AI division. As per unnamed sources in the report, Apple plans to utilise its in-house AI model beyond the Chinese market, while favouring domestically developed technology for operations within mainland China. This approach is reportedly driven by compliance considerations. Reportedly, on Monday morning, Baidu’s share value increased to the extent of six percent, concluding at HK$100.7 for the day, which marked a 2.55% increase. Counterpoint Research’s report indicates that Apple is encountering heightened competition within China, evidenced by a 24 percent year-on-year decrease in iPhone sales during the initial six weeks of 2024. Concurrently, total smartphone sales on the mainland experienced a seven percent decline over the same timeframe, attributed to intensified competition and subdued consumer expenditure. Moreover, as Samsung Electronics moves forward with incorporating Baidu’s Ernie large language model (LLM) into its latest flagship 5G device, the anticipated collaboration between Apple and Baidu gains attention. Meanwhile, on a global scale, Samsung has opted for Google’s Gemini AI technology to fuel its new AI-equipped 5G smartphones, solidifying a multi-year partnership. Get live Share Market updates, Stock Market Quotes, and the latest India News and business news on Financial Express. Download the Financial Express App for the latest finance news.   "
}