{
    "title": "Apple: Buy, Sell, or Hold?",
    "date": "1/6/2024",
    "url": "https://www.fool.com/investing/2024/01/06/apple-buy-sell-or-hold/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More With the holidays in the rearview mirror, the new year brings hope and renewal. It's also a good time to turn the page and analyze whether you should buy, sell, or hold certain stocks. Apple's (AAPL -1.06%) stock performed very well last year, with the share price increasing by 48%. That's about double the S&P 500's gain. If you owned the shares, that makes for a very happy new year. But what should holders or prospective buyers do now? Examining the company's offerings and valuation will lead to an informed decision. Image source: Getty Images. Apple generates most of its sales from iPhones. In the latest fiscal year, which ended on Sept. 30, 2023, iPhones accounted for 52% of its $383.3 billion of sales. Management released the latest version last September. However, the iPhone 15 didn't provide a major boost to Apple's fourth-quarter top line. For the period, iPhone sales grew by 2.8% to $43.8 billion. CEO Tim Cook noted record iPhone sales in China and blamed supply issues for the tepid sales growth. Nonetheless, data shows the device had been losing worldwide market share with strong competition from Huawei, among others. Additionally, China's government has limited iPhone usage by government employees. Based on the number of shipments, iPhone's worldwide market share was 16% in the calendar year's third quarter compared to 23% at the end of 2022, according to Counterpoint. It dominates the U.S. market with an over 50% share. Apple's offerings include Mac personal computers, iPads, smartwatches, wireless headphones, and a variety of services. They have generally produced lackluster sales. In the fourth quarter, iPhone, Mac, iPad, and wearables, home, and accessories had lower sales than a year ago. Economic factors, such as stressed consumers dealing with overall higher prices, explain part of the weaker sales. However, there were also company-specific issues, such as a lack of new innovative products. Management hopes to get a boost from Vision Pro, a mixed reality headset that it plans to release this year. The price tag, about $3,500, may prove challenging to buyers, though. Services remain a bright spot, however. Apple's services include advertising, product support and repair, cloud, and payments. Fourth-quarter sales grew by over 16% to $22.3 billion. And the business has a much higher gross margin than the company's products. Last year, services had a 70.8% gross margin, nearly double products' 36.5%. The stock's large gain last year has created a more expensive valuation. The shares sell at a price-to-earnings (P/E) ratio of 30 compared to the low 20s a year ago. That's also higher than the S&P 500's P/E multiple of 26. With a higher valuation comes the expectation of faster sales and earnings growth. However, I have questions about whether Apple's key iPhone product will resume higher sales growth and I'd like to see its other products reverse the negative sales trend. Despite services doing well, it's insufficient for me to buy the stock on that basis alone. Given the stock price's run-up, I'd look to cash in and sell the shares. Lawrence Rothman, CFA has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}