{
    "title": "A Fed meeting, Big Tech earnings, and the January jobs report: What to know \nthis week",
    "date": "1/28/2024",
    "url": "https://finance.yahoo.com/news/a-fed-meeting-big-tech-earnings-and-the-january-jobs-report-what-to-know-this-week-181304626.html",
    "text": "Stocks closed out another week hovering near record highs as one of the busiest weeks of the quarter is set to greet investors. Earnings from five of the\"Magnificent Seven\" tech stocks — Apple (AAPL), Alphabet (GOOGL, GOOG), Microsoft (MSFT), Amazon (AMZN), and Meta (META) — will highlight a packed week of quarterly reports. In all, 106 S&P 500 companies, including six Dow components, are slated to report in the week ahead, per FactSet. On Wednesday afternoon, the Fed is set to announce its latest policy decision. Investors expect the central bank will leave interest rates unchanged in a range of 5.25% to 5.50%. Investors will be closely watching for any commentary during Fed Chair Jerome Powell's conference on Wednesday about when the Federal Reserve may begin cutting rates. Read more: What the Fed rate-hike pause means for bank accounts, CDs, loans, and credit cards On Friday, the January jobs report is set for release where economists expect a modest tick down in job additions while the unemployment rate is projected to remain flat at 3.7%. Elsewhere on the schedule, key updates on activity in the manufacturing and services sectors of the economy, as well as the latest data on job openings, highlight the economic side of things. Outside of Big Tech, results from AMD (AMD), Starbucks (SBUX), Pfizer (PFE), Chevron (CVX), Exxon Mobil (XOM), and Boeing (BA) headline the reporting calendar. Stocks will enter the final week of the month near all-time highs. After a rocky start to the year, both the S&P 500 (^GSPC) and Nasdaq Composite (^IXIC) are up over 2% so far in January while the Dow Jones Industrial Average (^DJI) is up more than 1%. The market narrative has shifted significantly since the last time Jerome Powell took the podium in December. Investors aggressively priced in a March cut and then scaled back those bets as economic growth has continued to surprise to the upside. But with inflation down to its lowest levels in nearly three years, many Wall Street economists still believe that the Fed will begin cutting in the near future. \"It is time for Fed officials to take the win and start dialing back the level of policy restrictiveness soon,\" Capital Economics deputy chief US economist Andrew Hunter wrote in a note to clients on Friday. Investor bets are still mixed on when that cut will come. As of Friday afternoon, markets had priced in a 47% chance that the Fed will cut rates in March, per the CME FedWatch Tool. Looking out to May, investors believe there is an 88% chance rates are lower by the end of that meeting. Bank of America US economist Michael Gapen expects the Fed to change its post-meeting statement to more neutral language about the restrictiveness of policy, serving as \"a de-facto easing bias.\" But he doesn't believe Powell and the central bank will fully tip their hand just yet. \"Labor markets have cooled, and inflation has come down more rapidly than expected absent a large rise in unemployment, but we don't think the Fed is ready to send a strong signal about its intentions just yet,\" Gapen wrote in a note to clients on Friday. Gapen believes the Fed will be buying time to see more data. And some of that data will come in the days following the Fed meeting. The January jobs report is scheduled for release at 8:30 a.m. ET on Friday. And while layoffs have dominated headlines in recent weeks, economists expect any signs of a broad labor market slowdown to remain absent from the data. The report is expected to show that 175,000 nonfarm payroll jobs were added to the US economy last month, with unemployment ticking up slightly to 3.8%, according to data from Bloomberg. In December, the US economy added 216,000 jobs while the unemployment rate remained unchanged at 3.7%. \"All told, the themes of improving supply, cooling demand and overall labor market normalization likely continued in January,\" Wells Fargo's team of economists led by Jay Bryson wrote in a weekly note to clients. \"Although payroll growth has held up remarkably well recently, there are several signs of further moderation in the months ahead. On net, fewer industries are adding headcounts each month and job openings and hiring plans continue to pull back.\" As if the economic calendar alone wouldn't be enough to keep investors on their toes, the biggest corporate earnings week of the quarter will also set the stage for how companies are holding up amid the higher interest rate environment. Analysis from FactSet on Friday shows just how much upcoming earnings could drive the market narrative. Excluding Tesla, the other \"Magnificent Seven\" tech stocks are expected to be the top six earnings drivers for the S&P 500, contributing year-over-year earnings growth of 53.7%. Excluding those six companies the remaining 494 companies would report a 10.5% earnings decline. Five of those key companies — Alphabet, Microsoft, Meta, Amazon, and Apple — are set to report in the week ahead. Evercore ISI managing director Julian Emanuel described the stock price reaction to these reports as \"critical for overall market direction.\" Weekly Calendar Monday Economic data: Dallas Fed manufacturing activity, January (-9.3 prior) Earnings: Cleveland Cliffs (CLF), Philips (PHG), SoFi Technologies (SOFI), Whirlpool (WHR) Tuesday: Economic data: S&P CoreLogic 20-city year-over-year NSA (4.87% prior); Conference Board consumer confidence, January (112.5 expected, 110.7 prior) JOLTS job openings, December (8.79 million prior); Dallas Fed services activity, January (-8.7 prior) Earnings: Advanced Micro Devices (AMD), Alphabet (GOOGL), Electronic Arts (EA), General Motors (GM), JetBlue (JBLU), Juniper Networks (JNP), Match Group (MTCH), Marathon Petroleum Corporation (MPC), Microsoft (MSFT), Pfizer (PFE), Starbucks (SBUX), UPS (UPS) Wednesday Economic data: MBA Mortgage Applications, week ended January 26 (3.7%); ADP private payrolls, January (+150,000 expected, +164,000 prior); Employment cost index, fourth quarter (1.0% expected, 1.1% prior); Federal Reserve monetary policy decision (no interest rate change expected) Earnings: Aflac (AFL), Boeing (BA), Hess (HES), Mastercard (MA), MetLife (MET), Novo Nordisk (NVO), Phillips 66 (PSX), Qualcomm (QCOM) Thursday Economic data: Challenger jobs cuts, year-over-year, January, (-20.2% prior); Unit labor costs, fourth quarter (+2.6% expected, -1.2% prior); Nonfarm productivity, fourth quarter (+1.6% expected, +5.2% prior); Initial jobless claims, week ending January 27 (214,000 prior); S&P Global US manufacturing PMI, January final (50.3 prior); Construction spending, month-over-month, December (+0.5% expected, 0.4% prior); ISM manufacturing, January (47.5 expected, 47.2 prior); ISM prices paid, January (45.2 prior) Earnings: Apple (AAPL), Amazon (AMZN), Deckers Outdoor (DECK), Honeywell (HON), Meta (META), Merck (MRK), Royal Caribbean Group (RCL), Peloton (PTON), SiriusXM (SIRI), Skechers (SKX), Tractor Supply (TSCO), The Clorox Company (CLX), United States Steel (X) Friday Economic calendar: Nonfarm payrolls, January (+175,000 expected, +216,000 prior); Unemployment rate, January (3.8% expected, 3.7% previously); Average hourly earnings, month-over-month, January (+0.3% expected, +0.4% prior); Average hourly earnings, year-over-year, January (+4.1% expected, +4.1% prior); Average weekly hours worked, January (34.4 expected, 34.3 prior); Labor force participation rate, January (62.5% previously); U. of Mich sentiment, January final (78.8 expected, 78.8 prior); Factory orders, December (+0.5% expected, 2.6% prior); Durable goods orders, December final (0.0% prior) Earnings: Chevron (CVX), Exxon Mobil (XOM), Charter Communications (CHTR) Correction: A previous version of this article misspelled the names of Evercore ISI's managing director, Julian Emanuel, and the Philips corporation. We regret the errors. Josh Schafer is a reporter for Yahoo Finance. Follow him on X @_joshschafer. Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance Related Quotes "
}