{
    "title": "Jim Cramer Recommended Selling These 12 Stocks",
    "date": "1/7/2024",
    "url": "https://finance.yahoo.com/news/jim-cramer-recommended-selling-12-120720452.html",
    "text": "In this article, we will take a detailed look at the Jim Cramer Recommended Selling These 12 Stocks. For a quick overview of such stocks, read our article Jim Cramer Recommended Selling These 5 Stocks. Jim Cramer recently said in a program that the time has come for investors to take some profits on the Magnificent Seven group of stocks as the market begins to undergo a rotation. Cramer said “it’s a new market” in 2024 and financial, healthcare and small-cap stocks which were put on the backburner by the Street amid recession fears are now in the spotlight. Cramer said that the market is favoring “boring” stocks with high yields as investors believe recession fears have been managed by the Federal Reserve and rates are expected to come down. Cramer said long-term interest rates peaked in October 2023 and since then high-yield dividend stocks have been “flying\" while Magnificent Seven stocks are losing their leadership position when it comes to stock market gains. Cramer said that during most of 2023 Magnificent Seven stocks, which include major companies like Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA), among other tech leaders, led the stock market gains. But after October 2023, things have changed. Cramer shared a chart which showed S&P 500 performance trends on an equal-weighted basis. Data shows that an equal-weighted S&P 500 has beaten the Magnificent Seven index by 13.4% from October 2023 through January 3, 2024. Jim Cramer said that “all sorts of stocks” are now showing strong performance and gains are no longer limited to the seven major tech stocks. Cramer mentioned some major banks and said financial stocks have been among the top performers in the current environment. Jim Cramer also highlighted that there’s a broader money rotation going on in the market right now, with major tech stocks like Nvidia, Apple and Tesla acting as “sources of funds.” That means money managers are taking profits from these stocks and putting these funds into other companies that have hitherto been ignored amid the macro economic backdrop. Methodology In this article we decided to evaluate the performance of Jim Cramer’s predictions and analysis. Back in September we covered some stocks Jim Cramer was recommending investors to sell. In this article we took a look at the performance of those stocks to see whether Cramer’s predictions and sell calls were right or wrong. For each stock we mentioned its performance over the past few months and the reasons behind Cramer’s bearish outlook on these companies. The list is ranked in ascending order of the number of hedge fund investors in these companies. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). Number of Hedge Fund Investors: 2 Jim Cramer called Carl Icahn’s Icahn Enterprises LP Common Stock (NASDAQ:IEP) a “mess” in 2023 and said he was unable to understand how Icahn Enterprises LP Common Stock (NASDAQ:IEP) makes money. Icahn Enterprises LP Common Stock (NASDAQ:IEP) shares have plummeted about 39% over the past six months. Problems started for Icahn Enterprises LP Common Stock (NASDAQ:IEP) last year after a short report from Hindenburg Research accused the company of overstating asset values. Just two hedge funds in Insider Monkey’s database of 910 funds had stakes in Icahn Enterprises LP Common Stock (NASDAQ:IEP) as of the end of the third quarter of 2023. Last year Cramer remained bullish on quality stocks like Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA), and kept recommending investors to stay away from money-losing stocks. Number of Hedge Fund Investors: 11 Back in August 2023, Jim Cramer said that investing in spacecraft company Rocket Lab USA Inc (NASDAQ:RKLB) was akin to “sending your money up in smoke.” Over the past six months the stock has lost about 7% in value. However, December 2023 was a great month for Rocket Lab USA Inc (NASDAQ:RKLB) as it announced multiple positive news. The US government awarded Rocket Lab USA Inc (NASDAQ:RKLB) a $515 million contract to design, manufacture, deliver, and operate 18 space vehicles.  Rocket Lab USA Inc (NASDAQ:RKLB) also successfully launched its 42nd Electron rocket and deployed a satellite for Japan-based Earth imaging company the Institute for Q-shu Pioneers of Space. Number of Hedge Fund Investors: 14 Jim Cramer in August 2023 called the Canadian telecom company Telus Corp (NYSE:TU) a “loser” as the analyst believes there are multiple companies in the market doing the same thing as Telus Corp (NYSE:TU). Over the past six months, Telus Corp (NYSE:TU) shares have lost about 9% in value. In November, Telus Corp (NYSE:TU) upped its quarterly dividend by 3.4%. As of the end of the third quarter of 2023, 14 hedge funds out of the 910 funds tracked by Insider Monkey had stakes in Telus Corp (NYSE:TU). Number of Hedge Fund Investors: 17 Bitcoin mining firm Riot Platforms Inc (NASDAQ:RIOT) ranks 9th in our list of the stocks Jim Cramer was recommending selling last year. In November 2023, Jim Cramer said the following about the company: “They don’t make any money...If you want to do Bitcoin, own Bitcoin.” Over the past six months, Riot Platforms shares have gained about 16%. Earlier this month, the company said it produced 619 bitcoins in December 2023, a 12% increase month over month and a 9% decline on a yearly basis. Number of Hedge Fund Investors: 20 Last year, when asked about his thoughts on solid state lithium metal battery company Quantumscape Corp (NYSE:QS), Jim Cramer made a “hard pass” on the stock and said “there’s nothing there” about Quantumscape Corp (NYSE:QS). The stock has lost about 6.6% over the past six months. Insider Monkey’s database of 910 hedge funds shows that 20 hedge funds had stakes in Quantumscape Corp (NYSE:QS). The biggest stakeholder of Quantumscape Corp (NYSE:QS) during this period was Philippe Laffont’s Coatue Management which owns a $40 million stake in Quantumscape Corp (NYSE:QS). The company in its Q3 earnings call talked about its business performance and guidance: \"Despite these changes in the timing of CapEx, we continue to target low-volume B samples in 2024 and higher-volume B samples in 2025. During Q3, our CapEx primarily went toward facility and equipment spend for our consolidated QS-0 pre-pilot line, including for our Raptor process. For the remainder of the year, our CapEx will continue to be predominantly allocated toward QS-0. During the quarter, we raised $300 million in gross proceeds from our public follow-on offering. We ended Q3 with over $1.1 billion in liquidity and continue to look for opportunities to optimize our spending and be prudent with our strong balance sheet. We now forecast our cash runway will extend into 2026. Any additional funds raised from capital markets activity, including under our ATM prospectus supplement, would further extend this cash runway. Longer term, our capital requirements will be a function of our industrialization business model, which we believe could reflect a mix of wholly owned production, joint venture, and licensing relationships. With that, I’ll hand things over to Jagdeep for a final word on our strategic outlook.\" Read the entire earnings call transcript here. Number of Hedge Fund Investors: 18 In December 2022, Jim Cramer said the following about EV company Lucid Group Inc (NASDAQ:LCID): “We don’t want to fool around with that. The thing just goes down and down. I see a trend. ... I think that one is just too dangerous.” Fast forward to June 2023, Cramer’s thoughts about Lucid Group Inc (NASDAQ:LCID) hadn’t budged as he said, while answering a call about Rivian Automotive, that investors should sell Rivian and Lucid Group Inc (NASDAQ:LCID) because they were money-losing companies. Jim Cramer has been right about the stock since Lucid Group Inc (NASDAQ:LCID) shares have gone nowhere but down. Over the past six months Lucid Group Inc (NASDAQ:LCID) stock lost about 47% in value. As of the end of the third quarter of 2023, 18 hedge funds tracked by Insider Monkey had stakes in Lucid Group Inc (NASDAQ:LCID). Number of Hedge Fund Investors: 26 In August 2023, Jim Cramer said Plug Power Inc (NASDAQ:PLUG) investors should take profits should the stock bounce back since Plug Power Inc (NASDAQ:PLUG) has “disappointed” for so long. In December 2023, Jim Cramer said that he was “pulling the plug” on Plug Power Inc (NASDAQ:PLUG) and Plug Power Inc (NASDAQ:PLUG) is now a “no go” for him. Plug Power Inc (NASDAQ:PLUG) shares have lost about 58% over the past six months. As of the end of the third quarter of 2023, 26 hedge funds tracked by Insider Monkey had stakes in Plug Power Inc (NASDAQ:PLUG). The most significant stakeholder of the firm during this period is Israel Englander’s Millennium Management which owns a $26 million stake in Plug Power Inc (NASDAQ:PLUG). While PLUG is a sell according to Cramer, throughout 2023, he remained bullish on tech stocks like Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA). The company talked about its Q4 guidance in its Q3 earnings call: In the fourth quarter, we anticipate the revenue from our new ventures will surpass revenue from our traditional business for the first time as our electrolyzers and cryogenic businesses continue to grow. Finally, I’d like to just like to reflect on the conversation I had yesterday morning with a European customer supplier and partner. He gets toward our facilities and remind me that no one has built hydrogen infrastructure on the scale we have. No one has our product set, no one has technical talent, no one has our customer relationships and no one has our real life experiences. It remains our belief and his there is the market for hydrogen fuel cell grows, no one is in a better position than Plug to take advantage of this opportunity. This is just a bump on the road. Read the entire earnings call transcript here.  Click to continue reading and see the Jim Cramer Recommended Selling These 5 Stocks.  Suggested Articles: 11 Best Jim Cramer Stocks To Buy According to Billionaires 13 Best Jim Cramer Stocks To Buy Now George Soros and Jim Cramer Love These Stocks Disclosure. None. Jim Cramer Recommended Selling These 12 Stocks was initially published on Insider Monkey. Related Quotes "
}