{
    "title": "Apple undergoes its biggest board shakeup in years as 2 longtime directors \ndepart, including Al Gore",
    "date": "1/11/2024",
    "url": "https://fortune.com/2024/01/11/apple-board-shakeup-al-gore/",
    "text": "In one of Apple Inc.’s biggest board shake-ups in years, longtime directors Al Gore and James Bell will be retiring from the company, with former Aerospace Corp. Chief Executive Officer Wanda Austin coming aboard. The company made the announcement Thursday, citing a policy of directors not standing for reelection after the age of 75. Bell, a former Boeing Co. executive, joined the Apple board in 2015, while former US Vice President Gore has been a director for more than two decades. Both men are 75. The upheaval is unusual for Apple’s board, which rarely has more than one retirement at a time. Gore was the longest-serving member — having joined in 2003, when co-founder Steve Jobs was CEO and the iPhone didn’t yet exist. “Al has contributed an incredible amount to our work — from his unconditional support for protecting our users’ privacy, to his incomparable knowledge of environment and climate issues,” Apple CEO Tim Cook said in a statement. “James’s dedication has been extraordinary, and we’re thankful for the important perspectives and deep expertise he’s offered on audit, finance, and so much more over the years.” Austin, the new nominee, has a significant track record of “advancing innovation and shaping corporate strategy,” Apple said. She has long been a major proponent of US space exploration efforts, though that’s not an area that Apple is directly involved in. She will be up for election at the company’s annual shareholder meeting on Feb. 28. In spite of the age policy, another director, Ronald Sugar, is turning 76 this year and not slated to leave the board. Apple said that Sugar is remaining “in consideration of the significant recent transitions in board composition and the value of retaining directors who have developed deep insights into the company during their tenure.” Given Apple’s rationale for retaining Sugar, it’s unclear if the policy will apply to Chairman Arthur Levinson, who turns 75 next year. Apple also disclosed the latest compensation details for Cook and other executives. While Cook’s target pay for 2023 was $49 million — about half of the $99 million he received in 2022 — his total ended up coming in at $63.2 million. About $47 million of that came from stock awards, which were higher than the projection because Apple exceeded its internal financial targets for net sales and operating income. For 2024, Cook’s target compensation from equity is increasing to $50 million. Apple’s other named executives — its chief financial officer, head of retail, general counsel and chief operating officer — all saw compensation remain roughly the same in 2023, at about $27 million each. In a filing, the company asked shareholders to vote in favor of the board members and executive compensation. And it urged investors to reject a proposal demanding a report about the use of artificial intelligence at the company. “The scope of the requested report is extremely broad and could encompass disclosure of strategic plans and initiatives harmful to our competitive position and would be premature in this developing area,” the company said. Apple is planning to unveil a slew of AI-based tools for the iPhone and other devices as early as June, Bloomberg News has reported. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}