{
    "title": "IPhone Takes Top Spot in China for First Time Despite Challenges",
    "date": "1/24/2024",
    "url": "https://finance.yahoo.com/news/iphone-takes-top-spot-china-044921270.html",
    "text": "(Bloomberg) -- Apple Inc.’s iPhone was the top-selling smartphone series in China for the first time last year, a surprisingly strong showing in the face of fierce local competition and expanding government prohibitions against the American company’s technology. Most Read from Bloomberg Traders Line Up for ‘Once-in-a-Generation’ Emerging Markets Bet Blackstone Is Building a $25 Billion Empire of Power-Hungry Data Centers Trump Cash Stockpile at Risk From $450 Million Dual Verdicts Musk Says First Human Patient Has Received Brain Implant Amazon Drops iRobot Deal; Roomba Maker Cuts 31% of Staff The iPhone ranked first in shipments in the fourth quarter and 2023 overall, market tracker IDC said. It came after several analysts, including Jefferies, said iPhone sales tanked in the fourth quarter due to a lull in enthusiasm for the Cupertino, California company’s latest generation of hardware in the world’s biggest smartphone market. IDC also noted rising competition from domestic names like a resurgent Huawei Technologies Co., but timely discounts and promotions helped reduce the harm for Apple. Success in the fourth quarter was largely a matter of declining less than competitors, the IDC data showed. For the year, Apple’s 2.2% drop in 2023 was better than local rivals like Honor Device Co. and Vivo — both of which suffered double-digit slumps — and the overall 5% fall in shipments. The year marked the lowest volume of smartphones in China in a decade, due to a soft economic recovery and weak consumer sentiment, according to IDC. It was also highlighted by Huawei’s return to prominence with its Mate 60 series, catapulting it back into the top five makers in China in the holiday quarter, with a 36% jump in shipments. “Apple’s climb to the top spot in 2023, especially in light of renewed competition from Huawei and the soft spending sentiment, marks a tremendous success,” said IDC research analyst Arthur Gao. “Apple achieved this thanks to timely price promotions in its third-party channels, which stimulated demand.” Apple also took the crown of the world’s biggest smartphone seller in 2023, after iPhone sales slumped less than Samsung Electronics Co.’s Galaxy smartphones. Still, the iPhone 15 family of products is facing headwinds in sustaining demand in China, where analysts forecast sales will continue to weaken. See: IPhone Sales in China to Fall Double Digits, Jefferies Says Chinese agencies and government-backed companies ordered staff to stop bringing iPhones and other foreign devices to work, Bloomberg News reported in December, expanding prohibitions against such technologies in sensitive sectors. Most Read from Bloomberg Businessweek There’s So Much Data Even Spies Are Struggling to Find Secrets Basketball, Basketball, Basketball: Inside Steve Ballmer’s New $2 Billion Arena How a Lucky Break Fueled Eli Lilly’s $600 Billion Weight-Loss Empire AI Needs So Much Power That Old Coal Plants Are Sticking Around How the West’s Favorite Autocrat Engineered Africa’s Most Dramatic Turnaround ©2024 Bloomberg L.P. Related Quotes "
}