{
    "title": "Apple, Amazon, and Meta rolled out earnings updates",
    "date": "1/26/2024",
    "url": "https://finimize.com/content/apple-1q24-earnings",
    "text": "Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Sponsored IG - The ISA with more flex than the rest about 2 months ago  •  2 mins What’s going on here? Apple, Meta, and Amazon released results late on Thursday, proving once and for all that good things come in threes. What does this mean? Meta set the trio’s tone with advertising revenue that picked up by 24% from the same time last year, keeping pace with last quarter. The announcement that really sent investors toward Meta’s stock, though, was news of the company’s first-ever dividend. Amazon, for its part, managed to beat most of its expectations. That said, its famed cloud division only just hit targets: AWS made 13% more revenue last quarter than the same time the year before, falling shy of Microsoft’s rate. Apple had issues too, reporting that sales in China fell 13%. Still, with iPhones flying off the conveyor belts, Apple managed to make more revenue and profit than analysts expected. Why should I care? For markets: The end is nigh… maybe. Many a prophet has advised that all good things must eventually come to an end, from Geoffrey Chaucer to Nelly Furtado. That’s a worrying prospect for Big Tech investors, though, after the Magnificent Seven stocks carried US markets on their backs last year. Microsoft offered some reassurance on Tuesday, boasting a cloud business that made 30% more revenue last quarter than the same time last year. And with any luck, Nvidia will dole out more comforting news on February 21st. The bigger picture: Big Tech gets tired, too. Big Tech’s results have been fine, so far, but any Friends fans will know that you can’t trust “fine”. In fairness, though, investors’ expectations could hardly have been higher after last year’s AI furor, so the seven biggest tech companies landing somewhere around that mark is no small feat. Still, Big Tech stocks could enter a “consolidation” phase where prices stay within a tight range for some time, often referred to as moving “sideways” rather than higher or lower. ai amazon apple cloud earnings growth stocks information technology meta tech stocks us ai earnings grocery retail Disclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. /3 • Your free quarterly content is about to expire. Uncover the biggest trends and opportunities. Subscribe now for 50% off. Cancel anytime. "
}