{
    "title": "Apple's VP of Finance to take over as Sonos CFO",
    "date": "1/9/2024",
    "url": "https://9to5mac.com/2024/01/09/apples-vp-of-finance-to-depart-this-month-will-take-over-as-sonos-cfo/",
    "text": "Apple VP of Finance Saori Casey is headed to Sonos after more than a dozen years at Apple. The move comes after she departed Apple in December. Casey, described by Bloomberg as a “top deputy” to Apple CFO Luca Maestri, will assume the role of Sonos CFO later this month. In a press release announcing the news today, Sonos CEO Patrick Spence touted Casey’s experience at Apple and Cisco: “I am excited to welcome Saori as our new CFO. The depth and breadth of her experience at world-class companies like Apple and Cisco make her perfectly suited to build on our momentum and seize the opportunity ahead.” Casey is taking over the Sonos CFO role from Eddie Lazarus, who will retain his existing duties as Chief Legal Officer and take on a new Chief Strategy Officer role. “Sonos is an iconic consumer brand with an exciting portfolio of audio products that delight and inspire millions of consumers around the world, myself included,” Casey said in the press release today. She will assume the CFO role at Sonos effective January 22, 2024. As Bloomberg points out, this is a significant loss for Apple and it comes amid a string of other executive departures. Last month, it was reported that Steve Hotelling, who worked on key technologies like the iPhone’s multitouch screen, Touch ID, and Face ID, is retiring from Apple. Tang Tan, VP of product design at Apple, is also on the way out. At Apple, Casey was a “top deputy to CFO Luca Maestri” and was tasked with “overseeing financial planning, forecasting and investor relations.” Follow Chance: Threads, Twitter, Instagram, and Mastodon. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Chance is an editor for the entire 9to5 network and covers the latest Apple news for 9to5Mac. Tips, questions, typos to chance@9to5mac.com "
}