{
    "title": null,
    "date": "2/4/2024",
    "url": "https://www.pymnts.com/apple/2024/apples-changes-in-royalties-strike-sour-note-with-indie-labels/",
    "text": "Apple’s plans to pay more for songs produced with higher-quality audio are causing discord among some artists. That’s according to a report Friday (Feb. 2) by the Financial Times (FT), which says that independent record labels argue that this shift will mean more money for high profile stars and less for other artists. At issue is Apple’s recent announcement that it would pay music companies up to 10% more in royalties for songs produced with Dolby Atmos, a “spatial audio” technology that the company has described as providing “immersive” experiences for listeners. As the FT report noted, better-quality audio is one area where Apple Music has an advantage over its competitor Spotify, though this audio costs more to produce. However, Apple won’t be paying more in total. The extra 10% will come from a fixed pool of money, the FT said, which means songs that aren’t recorded using Dolby Atmos will get less money. Now, some high-profile record labels — including Beggars Group, home to Vampire Weekend and Adele, and Secretly, which represents Phoebe Bridgers and Bon Iver — have expressed concerns about Apple’s policy, sources told the FT. “It’s literally going to take the money out of independent labels and their artists, to benefit the biggest companies in the marketplace,” said a senior executive at a large independent label. “It’s going to benefit the biggest player, Universal, because they’re the ones with the resources to invest in that. Whereas the independent sector … we’ve found it hard to justify the expense of creating spatial masters … we’re not in the business of chucking money just because Apple is saying you should be spending money on this.” Record executives told the FT that producing a song in spatial audio costs an extra $1,000, while a whole album would cost 10 times that amount. And going back and reproducing an old song with the technology can double costs. PYMNTS has contacted Apple for comment but has not yet gotten a reply. The news comes weeks after Spotify announced it was launching in-app shopping on iPhones in the European Union beginning March 7. As PYMNTS reported, the new offering is enabled by the rollout of the EU’s Digital Markets Act (DMA), which blocks the restrictions and 30% fees that Apple places on apps offering through its App Store. “For years, even in our own app, Apple had these rules where we couldn’t tell you about offers, how much something costs, or even where or how to buy it. We know, pretty nuts,” Spotify said in a blog post. “The DMA means that we’ll finally be able to share details about deals, promotions and better-value payment options in the EU.”  We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}