{
    "title": "iRing, iGlasses Or Supercharged iPods? Gurman Says Apple Brainstorming \nWearables That Could Keep More Use",
    "date": "2/25/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37304048/iring-iglasses-or-supercharged-ipods-gurman-says-apple-brainstorming-wearables-that-could-keep-m",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Close on the heels of Vision Pro launch, a news report said on Sunday that Apple, Inc. AAPL is contemplating a few innovative products that could add further strength to the company’s sticky ecosystem. What Happened: Separate Apple teams have begun brainstorming about a smart ring and smart glasses, said Bloomberg columnist Mark Gurman in the latest installment of his weekly Power On newsletter. Apple’s industrial design team made a presentation about the concept of the smart ring, which can be worn on fingers, a few years ago, and the ring will likely adopt Apple Watch’s health-tracking features, Gurman said. He also noted that engineers at Apple’s lab in California more recently discussed the possibility of developing smart glasses. These smart glasses will be along the lines of similar products from Meta Platforms and Amazon, Gurman said. They will provide audio, removing the need for AirPods, and will leverage AI and cameras to identify objects around the user, he said. “The device also could act as a stepping stone toward Apple's long-held dream: true augmented reality spectacles that you can wear all day,” the columnist said. The smart ring, Gurman said, is currently a mere idea, although those at Apple’s campus are promoting the concept. The glasses are in an “exploratory phase” within the company’s hardware engineering division, he  said. The columnist added the company is also exploring other ideas, such as equipping AirPods with cameras, along with more “advanced AI and health sensors.” “That would give consumers many of the benefits of smart glasses without needing lenses and frames,” he added. See Also: Everything You Need To Know About Apple Stock Why It’s Important: The smart ring and smart glasses, Gurman said, will likely bolster the company’s already solid wearable devices business. This division currently accounts for 10% of Apple’s revenue, more than doubling its share from a decade ago, he noted. Delving into the importance of the wearables device business, Gurman said it will help the company rope in new customers, boost growth and “keep people even more locked into the Apple ecosystem.” A smart ring could appeal to users who are focused on health and fitness and are not keen to have the other features of an Apple Watch, such as apps and phone calls, the columnist said. The smart ring could be a low-cost way to gather key health data without the need for wearing a full-blown watch, he further added. If the company sells the ring as an iPhone accessory, it is less likely an Apple customer will shift their allegiance to an Android phone, he added. With glasses, Apple could settle for a less ambitious yet functional product similar to the likes of Amazon’s Echo Frames and Meta’s Ray-Ban Smart Glasses, Gurman said. But the ones that meet Apple’s standards for visual quality, performance, battery life and size could still be several years away, he said. Lower-cost wearable options, be it a ring or glasses or supercharged AirPods, could help Apple “turn things around” without stealing sales from existing products, the columnist said. Although the company snapped a four-quarter year-over-year revenue-declining streak in the December quarter, sales growth has yet to take off in a big way. Apple ended Friday’s session down 1% at $182.52, according to Benzinga Pro data. Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}