{
    "title": "Why Apple's iconic Super Bowl ad still resonates 4 decades later",
    "date": "2/10/2024",
    "url": "https://finance.yahoo.com/news/why-apples-iconic-super-bowl-ad-still-resonates-4-decades-later-151027182.html",
    "text": "Once upon a time, believe it or not, no one particularly looked forward to Super Bowl ads. That all changed when Washington faced Los Angeles on Jan. 22, 1984, in Tampa, Fla. Those who tuned in to the big game on CBS — and hadn’t fled to the kitchen for snacks — found themselves watching something completely different. In between ads for Gillette Foamy Gel and Northwestern Mutual insurance, a dystopian scene appeared on their TV sets: A line of men wearing faded gray apparel marched mindlessly into a theater, where a bespectacled face, “Big Brother,” addressed them on a massive screen. Extolling the virtues of groupthink, Big Brother celebrated freedom from “pests of any contradictory true thoughts.” Then, the camera cut to a striking blond athlete running in slow motion. Wearing a white tank top and red shorts — and played by British discus thrower and actress Anya Rajah (then Anya Major) — she strode into the theater, with guards in close pursuit. She spun and, with a shout, hurled a sledgehammer at Big Brother’s face. As the screen exploded, large text appeared along with a voice narrating, “On January 24th, Apple Computer will introduce Macintosh. And you’ll see why 1984 won’t be like '1984.'” Happy 40th to one of the greatest ads, Super Bowl or otherwise, of all time. Created by the ad agency Chiat/Day and Apple (AAPL), “1984” elevated Super Bowl ads to a whole new level. Today, tech historians, ad pros, and techies alike all look back at the commercial not only as a seminal moment in the democratization of personal computing and Super Bowl advertisements, but as a work of art containing themes that still resonate today. Though Rob Schwartz, an advertising industry leader who ran Chiat/Day from January 2015 to April 2021, was not at the agency when the ad was created, he still still remembers feeling inspired by it when it aired. “It marked the first time that the commercials in the Super Bowl were going to be something else to watch besides the game itself. This marked the moment,” he told Yahoo Finance recently. “It was,” he added, “the first time where the audience went, ‘Wait, wait, wait, don't go to the bathroom. Let's stay and watch a few commercials before the game comes back.'\" But Apple, the Super Bowl aside, was in need of a boost. IBM = Big Brother? In the early 1980s, the company had established itself as a promising tech business with products like the Apple II. In an attempt to make personal computers more accessible, it had then developed the Lisa, named after Steve Jobs’ daughter. Though innovative, the computer had sold poorly, especially compared to IBM’s (IBM) PC, which was released in 1981. Meanwhile, Apple had begun working on the Macintosh, which was meant to accelerate the adoption of the personal computer by the masses. “Apple came into 1984 being walloped by IBM in the personal computing market, and needing a new big hit … the company had bet it all on the Macintosh, spending huge on its R&D, building a new state-of-the-art factory for it,” said Margaret O'Mara, the Scott and Dorothy Bullitt chair of American History at the University of Washington. But then arose the question of how to advertise the revolutionary new product. Steve Hayden, now 76, then a copywriter at Chiat/Day, still remembers receiving the assignment from Steve Jobs directly. The young tech visionary reportedly wanted to “stop the world in its tracks” and entrusted the L.A.-based firm with the job. Along with art director Brent Thomas, Hayden began brainstorming. He rifled through old ad concepts he had worked on in San Francisco and found one with the headline \"Why 1984 won't be like '1984,'\" a line Hayden attributed to fellow Chiat/Day copywriter Gary Gussick. At first, Hayden and Thomas toyed with a comical conception of 1984 “like the Jetsons.” But the ad’s director, a well-known talent by the name of Ridley Scott, had a better idea. “He came and looked at our initial board … he brought in this wonderful coffee table book about the making of Metropolis, the movie, and the dramatic huge machines and the interface between humans and these kinds of overwhelming technologies,” Hayden explained. “And so the art direction took a really sharp turn at that point to meet that vision.” The advertising experts had already come up with the Big Brother character and Scott insisted that they introduce another, a heroine who would contrast starkly with the all-male cast and \"break the spell,\" Hayden said. A new age The heroine symbolized more than simple rebellion against Big Brother. As historian O’Mara pointed out, the ad aired during the height of the Cold War and year of the 1984 Summer Olympics in Los Angeles. “I think it's telling that she's dressed as a track athlete and dressed as if she's running for the United States,\" she said. The heroine also represented the Macintosh. While computers had previously been monopolized by experts — think mainframes and IBM — the Macintosh offered a revolutionary user interface that made personal computers accessible to the mass market. “She was supposed to represent freedom and the dawning of a new age, and therefore, Macintosh,” Hayden said. Added Chiat/Day’s Schwartz: “You have to remember that this was a time when computers were only used for business … When she throws that sledgehammer, she is all of us … and she represents all of us trying to destroy any kind of tyranny or dictatorship, even if it's just a dictator for a day, we don't want that. We want to be free. And I think the power of that is the reason why people talk about it, 40 years later.” But there were some naysayers within the company. Apple's board of directors hated it and almost stopped it from airing. Meanwhile, Hayden himself felt unsure about his work. “I had my own concerns that it might be too foreign in structure and content for an American audience,” he said. “It didn't match the traditional advertising forms.” But Jean-Louis Gassée, now 79, who was then running Apple France, still recalls the first time he saw the ad at a 1983 meeting to prepare for the January launch of the Macintosh. “We had never seen advertising like this ... it was absolutely stunning. And then the lights went up a little bit and from the top of the theater machinery, a Mac came down on a wire, and halfway through the descent it [was amplified by microphones],” he told Yahoo Finance. “So we could hear what became the highly recognizable “bong” of the Mac starting. There was this hysteria in the room.” Though Hayden and the rest of his team at Chiat/Day had never specifically intended “Big Brother” to represent IBM, Jobs quickly adopted that framing. After showing the ad, Jobs gave a “fiery” anti-IBM speech, “saying that the Macintosh would change the world,” according to Gassée. “It was easy at the time to superimpose the Big Brother and the big IBM images.” Holding up It is actually stunning to watch the ad today and see how it still holds up. Only this time, you can imagine Big Brother appearing on your screen as Tesla’s (TSLA) Elon Musk, Meta’s (META) Mark Zuckerberg, and the developers of ChatGPT and other artificial intelligence products. At least Jean-Louis Gassée sees it that way. He asserted that the ad is still relevant as we grapple with the likes of AI and user privacy in the world of Facebook and Google. It serves as “a good way to remind us of the necessary fight between established powers and upstarts.” He added: “I think the ad presents two views of technology. One that is Big Brother-like, oppressive, and one which is the Macintosh, a way to break through the domination of Big Brother technology.” he said. “So this ad in 1983, 1984, presented a view of the conflict between usages of technology. I think that that conflict is still alive.” Enjoy the Super Bowl. Dylan Croll is a Yahoo Finance reporter. Related Quotes "
}