{
    "title": "Celebrity-backed iPhone scam reportedly netted fraudster $35M",
    "date": "2/23/2024",
    "url": "https://9to5mac.com/2024/02/23/celebrity-backed-iphone-scam-iran/",
    "text": "An iPhone scam carried out in Iran has reportedly generated around $35M, after celebrities were hired to promote the fake deal. It was made possible because Apple isn’t allowed to sell iPhones in the country. The man alleged to be behind the scam has been located abroad by Iranian police, who say that he will be extradited back to the country through Interpol … Iran is subject to US sanctions as a result of the country’s actions against US ships transiting the Persian Gulf, and support for terrorism. This means that Apple has no presence in the country, and does not sell any of its products directly to anyone based in Iran. This creates a gray market, where Iranians buy iPhones in other countries, and import them into Iran for resale. The alleged scammer took advantage of this, claiming to offer a cheaper route, bypassing these intermediaries. The Financial Times reports: Kourosh Company, based in Tehran, was for months offering half-price deals on iPhones that sell for the equivalent of about $700, arguing that it saved money securing them by eliminating costly middlemen. The company, run by entrepreneur Amir Hossein Sharifian, used high-profile endorsements to drive sales, with Iranian sports figures and other celebrities using their star power to lure in thousands of victims, many of them young people who dreamt of owning the latest Apple gadget. But after most would-be buyers had parted with their money and waited the required 45 days for delivery, the iPhones never arrived. It dawned on them eventually that they had been scammed. A police investigation found that Sharifian had left the country, but they say that he has been located, and they are working with Interpol to have him arrested and extradited back to Iran. Sharifian admitted in a YouTube interview that he does owe money to his company’s clients, but claimed that it was around $2.7M, rather than the $35M cited by local media. There is no suggestion that any of the celebrities involved were aware that it was a scam, but they have reportedly been facing public condemnation, and demands that they be held accountable. Some have been suggesting that the company’s ability to obtain the necessary permits to operate the business and advertise suggests government corruption. Photo by Rohan on Unsplash FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Ben Lovejoy is a British technology writer and EU Editor for 9to5Mac. He’s known for his op-eds and diary pieces, exploring his experience of Apple products over time, for a more rounded review. He also writes fiction, with two technothriller novels, a couple of SF shorts and a rom-com! "
}