{
    "title": "Hedge Fund Investors Pull $100B From Market As Stock Pickers Underperform - \nApple (NASDAQ:AAPL), iShares",
    "date": "2/7/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/36981523/hedge-fund-investors-pull-100b-from-market-as-stock-pickers-underperform",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW More than $100 billion was withdrawn from hedge funds in 2023, following similar outflows in 2022 as investors tired of strategies that have been underperforming the market for several years. What Happened: Data, provided by Nasdaq eVestment showed that among the worst-performing strategies was the equity long-short fund — where hedge fund managers buy stocks they think will perform well and bet against stocks they believe are likely to fall. Indeed, investors have pulled more than $150 billion from this type of fund over the past five years as they have underperformed the market in nine of the past 10 years. The equity long-short fund has been around for decades and was generally successful during periods of broadly calm market conditions as so-called “star stock pickers” were able to capitalize strongly on market fluctuations by buying long and selling short. When more turbulent conditions persist, it becomes much more difficult for stock pickers to predict. One of the chief problems for pickers last year, however, was the expectation that several mega-cap stocks had become so overvalued that they had become ripe for shorting. Why It Matters: Short selling is tougher to do nowadays. Market gains gathered pace and data from S3 Partners, published last month, showed that short sellers in the U.S. and Canada lost a total of $194.4 billion over the year. According to S3 Partners, the three most shorted stocks during the last couple of months of 2023 were Apple Inc. AAPL Microsoft Corp. MSFT and Tesla Inc. TSLA, whose shares had reached record levels during the fourth-quarter rally. The most unprofitable shorts in 2023 were Tesla, with mark-to-market losses of $12.2 billion; Nvidia Corp. NVDA with losses of $11.2 billion; and Apple, with $7.3 billion of losses. Also Read: Short Sellers’ Nightmare: $195B Evaporates In 2023’s Market Surge Morningstar data shows that global long-short equity funds made an average annual return of 1.98% in 2023, and only 4.18% over a three-year timescale. Investing during 2023 in a fund backing the S&P 500 index, such as the exchange-traded fund SPDR S&P 500 SPY, would have netted investors a tidy 24.3%. Among the star stock pickers, Terry Smith — who is not a long-short fund manager, but an equity value investor — performed shy of the market. His Fundsmith equity fund rose by 12.4% in 2023 after losing 13.8% in 2022. Smith has also seen investors withdraw funds and has urged them to take a longer-term view of the market. Among the poorest-performing strategies were funds linked to U.S. government bonds, whose yields saw some turbulence during the second half of 2023. USD Government Bond funds fell by an average 4% over the year. By comparison, the iShares US Treasury Bond ETF GOVT, an ETF that holds Treasuries over a spread of maturities, climbed 1.5% over 2023. What’s Next: U.S. government bond fund strategies could be coming under threat from new rules introduced by the Securities and Exchange Commission (SEC) this week. The rule will require hedge funds and other traders that manage more than $50 million in assets to register as dealers with the SEC. Managers say the new rules bring greater compliance risk and costs, as well as closer scrutiny of their activities. Many firms have lobbied against the ruling since it was first proposed last year. Now Read: Biden The Master Oil Trader Part III? President Refills Emergency Stash As Crude Price Slides Image: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}