{
    "title": null,
    "date": "2/9/2024",
    "url": "https://www.tradingview.com/news/benzinga:fc51657d0094b:0-if-you-invested-1-000-when-apple-aired-its-famous-1984-super-bowl-commercial-here-s-how-much-you-d-have-today/",
    "text": "Technology giant Apple Inc AAPL is the presenting partner of this year’s Super Bowl Halftime Show, a role it took over last year. The Cupertino, California-based company replaced PepsiCo, which held the role for over 10 years. Apple has a history with Super Bowls dating back decades. Recall how it aired a commercial during Super Bowl XVIII, which saw the Los Angeles Raiders defeat the Washington Redskins 38-9. It aired on CBS, and was watched by over 77 million people. A 30-second commercial at the time had a cost of $368,200. Today, 30 seconds of Super Bowl ad time costs $7 million. Apple used Super Bowl XVIII to promote the upcoming launch of the Macintosh computer. Directed by Ridley Scott, the ad referenced the George Orwell dystopian novel \"1984.\" Watch the commercial below. The commercial may have also poked fun at rival International Business Machine IBM and provided a warning that Apple was coming after them in the computer sector. Apple's commercial is considered by many to be one of the greatest ads of all time. It also helped boost the brand recognition of Apple nationally. Related Link: Super Bowl Commercials Preview: Celebrities, Movie Trailers And The Taylor Swift Effect Investing $1,000 in Apple: The commercial from Apple aired during the third quarter of the Super Bowl. Anyone watching might have been intrigued by Apple enough to invest in shares of the company. Apple stock traded at a split-adjusted price of 13 cents on the Monday after Super Bowl XVIII (Jan. 23, 1984). A $1,000 investment could have purchased 7,692.31 shares of AAPL. The $1,000 investment in Apple stock at the time would be worth $1,455,538.90 today, based on a price of $189.22 for Apple at the time of writing. The Super Bowl commercial from Apple was a key event for the company and could have been a key moment for investors who recognized the potential for Apple. Read Next: Usher To Take Center Stage At Super Bowl LVIII Halftime Show, But Can He Topple Rihanna’s Hype? Image: Wikimedia © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @bradfairbridge @rajbuzzz @Kevin Trinh @Cenobar @arcanebear @udcovers @fx.today @_dalton16 @TradingView @mytradingsetup @ftmocom @chartfeed @olka_gadzieva @mytradingsetup @satoshi_empire @MidasPls @Zeiierman Trading @Onlnternet Whatever the trade "
}