{
    "title": "Meta's Facebook, Instagram to charge Apple service fee for posts 'boosted' \nvia iOS apps",
    "date": "2/16/2024",
    "url": "https://brandequity.economictimes.indiatimes.com/news/digital/metas-facebook-instagram-to-charge-apple-service-fee-for-posts-boosted-via-ios-apps/107732709",
    "text": "Meta Platforms announced that businesses purchasing a \"boost\" for posts on iOS versions of Facebook and Instagram would need to pay an extra 30% service charge to Apple. Advertisers can boost content on Instagram and Facebook via a browser without paying Apple's service charges. Meta will start implementing the changes this month in the United States. For Mark Zuckerberg, the barnstorming success of other parts of Meta Platforms Inc. — the rebranding of the business meant to reflect his vision of the future — means its duds can hide out within the comically cluttered navigation menu on the main Facebook app. Besides, for 20 years, use of the main Facebook service — known as the “blue” app internally — has remained remarkably resilient By commenting, you agree to the Prohibited Content Policy By commenting, you agree to the Prohibited Content Policy News See whats happening in Marketing & Advertising right now Exclusive Read and get insights from specially curated unique stories from editorial Leaders Speak Business leaders sharing their insights Events Explore and discuss challenges & trends in India's leading B2B events Awards Recognise work that not only stood out but was also purposeful Webinars Join leaders & experts for roundtables, conferences, panels and discussions Subscribe to our Daily Newsletter  By continuing you agree to our Privacy Policy & Terms & Conditions Advertise With Us We have various options to advertise with us including Events, Advertorials, Banners, Mailers, etc. Download ETBrandEquity App Save your favourite articles with seamless reading experience Get updates on your preferred social platform Follow us for the latest news, insider access to events and more. About Us Contact Us Newsletters "
}