{
    "title": "Apple and Google are discussing a deal to bring generative AI to iPhones",
    "date": "3/19/2024",
    "url": "https://www.straitstimes.com/business/apple-and-google-are-discussing-a-deal-to-bring-generative-ai-to-iphones",
    "text": "SAN FRANCISCO – Apple is in discussions with Google about using the search giant’s generative artificial intelligence (AI) model called Gemini for its next iPhone, as the company races to embrace a technology that has upended the tech industry. The talks are preliminary and the exact scope of a potential deal has not been defined, three people with knowledge of the discussions said. Apple also has held discussions with other AI companies, one of these people said, as it looks to tap into the power of a large language model capable of analysing vast amounts of data and generating text on its own. Mr Tim Cook, Apple’s chief executive, has promised investors that the company will introduce new generative AI capabilities later in 2024. The company’s smartphone rivals, Samsung and Google, have already added Gemini to their newest devices to edit videos and summarise audio recordings. Apple and Google declined to comment. Bloomberg earlier reported on the talks between them. An Apple-Google deal on generative AI would extend one of technology’s most longstanding partnerships. Since Apple introduced the iPhone in 2007, Google has been a critical contributor to the device’s success. It initially provided Google Maps for navigation and later struck a deal to become the default search engine on the iPhone’s Safari browser, a lucrative agreement for which Google pays Apple more than US$18 billion (S$24 billion) a year. Google’s discussions to provide generative AI capabilities for the iPhone would be the latest example of it filling a gap in Apple’s products. Apple’s effort to develop its own large language model, the technology behind chatbots such as ChatGPT and Google’s Gemini, has been running behind, two people familiar with its development said. Apple’s delay in releasing an AI product has been costly. After a decade-long run as the world’s most valuable public company, it was dethroned in 2024 by Microsoft, which has aggressively pursued AI. The technology has been heralded for its potential to disrupt businesses and create trillions of dollars in economic value. Despite its delays, Apple has the potential to be a big player in AI. The company has more than two billion devices actively in use, making it an attractive partner for Google and others. It also has a reputation for protecting customers’ private information that could be helpful in a future where AI services help manage people’s calendars or health data. A deal could bring the Gemini model to iPhones around the world, giving Google access to a massive user base and making generative AI even more mainstream. Virtually overnight, Google could have more consumers using its AI than its chief rival, OpenAI, which makes the ChatGPT AI chatbot – making a pact with Apple a tantalising prospect. Separately, The New York Times sued OpenAI and Microsoft in December for copyright infringement of news content related to AI systems. Apple selecting Google as an AI supplier would be a crucial vote of confidence in the search giant after a number of setbacks to its AI ambitions. The company’s first AI chatbot, Bard, debuted to middling reviews in March 2023 and struggled to attract as many users as ChatGPT. In February, Google debuted a new chatbot named Gemini. The chatbot ran into problems that month when users found that its image generator produced illustrations of historical figures that were not racially accurate and refused in most instances to generate images of white people, leading to accusations of bias. Google disabled the ability to create images of people and vowed to fix the problem. In a note on March 19, Bernstein Research analyst Toni Sacconaghi called an Apple-Google deal a “win-win”, giving Apple generative AI for iPhones and validating Google’s work on Gemini. He also said that Apple did not have to own an AI model on iPhones to profit from it and could instead take a commission from Google, which charges US$19.99 (S$27) per month for its Gemini Advanced app. Companies have not yet cashed in on generative AI. The costs associated with running large language models in the cloud are staggering, and consumers and business customers are only starting to pay for the emerging technology. But they are optimistic that profits will increase as the capabilities of AI systems improve and the costs decline for building the data centres to power the systems. A new deal between Apple and Google could draw scrutiny from US regulators. The Justice Department is in the final stages of a lawsuit against Google for harming competition law by paying Apple to be the default search engine on the iPhone and other services. Judge Amit P. Mehta of the US District Court for the District of Columbia, who is presiding over the non-jury trial, is expected to deliver a verdict in 2024. NYTIMES Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2024 SPH Media Limited. All rights reserved. "
}