{
    "title": "Apple CEO Tim Cook believes AI could be critical to reduce carbon footprint \nof businesses",
    "date": "3/24/2024",
    "url": "https://www.businesstoday.in/technology/news/story/apple-ceo-tim-cook-believes-ai-could-be-critical-to-reduce-impact-of-climate-change-422756-2024-03-25",
    "text": "Feedback Apple CEO, Tim Cook, stated that artificial intelligence (AI) is a crucial tool for businesses to reduce their carbon footprint during a climate change dialogue at the China Development Forum. In the week leading up to the event, Cook met with Commerce Minister Wang Wentao and revealed plans to further invest in China, according to a report by Bloomberg. Apple aims to be a leader in reducing carbon emissions, with the Apple Watch being its first carbon-neutral product. Cook highlighted the company's progress towards its environmental goals and emphasised the need for innovation. AI provides a vast toolkit for companies aiming to be carbon neutral or significantly reduce their emissions, said Cook. However, Chinese tech companies' progress in AI is hampered by US trade sanctions. Cook's visit to China comes at a time when Beijing is keen to show it is open for business. Cook met with China Premier Li Qiang and other international CEOs after Li's opening speech. Cook revealed that he had visited China multiple times in the past year due to its dynamic and vibrant environment. Cook's trip to China had a strong environmental focus, possibly to avoid geopolitical sensitivities amidst deteriorating US-China relations. Apple's operations are now carbon neutral and the company aims to have net zero climate impact across its entire business by 2030. It has also set a goal to eliminate plastic from its product packaging by 2025. The removal of exterior plastic wrap from iPhone 13 packaging alone prevented 600 metric tons of waste, demonstrating the effect of small changes when applied on a large scale. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}