{
    "title": "Yahoo Finance Video - Apple 'an opportunity' for investors, Boeing 'a value \ntrap'",
    "date": "3/8/2024",
    "url": "https://es-us.finanzas.yahoo.com/video/apple-opportunity-investors-boeing-value-211720573.html",
    "text": "In the latest segment of Yahoo Finance's \"Good Buy or Goodbye,\" Main Street Research CIO James Demmert joins the Live Show to analyze why investors should consider Apple (AAPL) a buy and steer clear of Boeing (BA). Demmert suggests investors consider Apple stock as a potential buy. He notes that Apple's share price has declined from its highs, stating \"it's getting no love from Wall Street,\" creating \"an opportunity\" for investors. He also highlights Apple's investments in artificial intelligence (AI) technology for its iPhones, which he believes is a strategic \"refocus\" will drive future stock appreciation. On the other hand, Demmert advises investors to avoid Boeing stock. He cites the company's persistent production issues, safety incidents, and manufacturing setbacks, saying Boeing has severely undermined the \"decades [it takes] to build a good reputation.\" He also mentions that the valuation has declined significantly, and the company continues to \"lose money.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith JULIE HYMAN: It's a big noisy universe of stocks out there. Welcome to Good Buy or Goodbye. Our goal to help cut through that noise to navigate the best moves for your portfolio. Though the broader market has hit record highs in the past few months, not all individual stocks are in positive territory. Some provide great opportunities to buy solid companies at a lower cost. Others are best left alone. I'm here with James Demmert, Main Street Research Chief Investment Officer. Thanks for being here. JAMES DEMMERT: Good to see you, Julie. JULIE HYMAN: So we're talking about two stocks today that are down year-to-date. And let's talk about your buy stock, first of all. And this is one that we have talked about a lot on the program. It's Apple. The shares are down about 10% or so year-to-date. So let's talk about why you still like it. And part of it is because it is down from the highs. So good value right now? JAMES DEMMERT: Yeah, Julie, it's down from the high. It's getting no love, whatsoever from Wall Street. And, in fact, the short interest, the amount of people shorting the stock has increased quite a bit. And we think that's an opportunity mainly for the underlying things. I think that investors are misunderstanding about Apple. Where are they going really in this what we call the new tech led AI bull market? It looks like they're left behind. But I think investors are mistaking that no, that's coming in the next quarter or two. JULIE HYMAN: OK, so let's dig into that a little bit here because Apple has teased what might be coming here. There's been a lot of focus on some negatives and some perceived negatives like slowing sales in China. But you think that the AI tech is coming. What gives you that confidence? JAMES DEMMERT: Yeah, I think the China sales is moderating, first of all. I think investors should get used to that. And I think that's in the stock price at this point. What we think is exciting-- and if someone missed NVIDIA or any of the semiconductors that have been the really hot stocks that led AI in the first phase. This is where you want to go now because the next phase is where it is AI make a difference. And we think the iPhone is what's going to be carrying AI over the next quarter or 2 and 3. First, it starts with AI subscriptions probably in Q2. I don't think the street is putting that in the price of the stock here. And we think those subscriptions on a $200 million-- or 200 million users can be very significant to earn. JULIE HYMAN: Let me just stop you right there. Because what does that mean? Like meaning there would be something ChatGPT like that Apple is offering as a subscription service on devices? JAMES DEMMERT: Think like a Siri that's really incredible, right? Siri right now is really not incredible. We think that the AI subscription to Apple is going to be that on steroids. So you're really going to be able to talk to your phone. It's going to be telling you what to do in that first phase subscription, of course. Service is good for them. Recurring revenue for a long time. So that'll be the first phase we think that rolls out in Q2. JULIE HYMAN: Interesting. JAMES DEMMERT: Q3 is really exciting because that's going to be iPhone 16. We think it's going to be a phone that people are going to need to buy because it's new hardware that can run this AI. So that's another very exciting product cycle. JULIE HYMAN: Well, James, I don't want to hear that because I just bought the 15. But let's get to your last point here, which is sort of the investment strategy and the redeployment of capital. You think that's going to AI just after they, for example, stopped their whole car endeavor. So why was that a good decision? And why is it good what they're doing with that money? JAMES DEMMERT: If you think about Meta, the era of efficiency, reducing costs, I think that's what Apple's doing here. They're saying let's give up on the driverless car in the $10 billion that we threw at that. Let's refocus. Where are they refocusing it? AI. So we think that's a very smart thought process they're going through of, hey, let's think about dollar in dollar out where is going to be most profitable. Really love that they're doing that. Stocks 25 times earnings, right? I think that's wrong. I mean, the PE, right? The E is estimated to be a certain number by the street. We think that E is too low. So the PE today actually may be lower in hindsight as we go forward over the next few quarters. JULIE HYMAN: We always like to put out a potential risk to this upside case. And in the case of Apple, it's that they don't bring this stuff to fruition soon enough. JAMES DEMMERT: That's exactly what the risk is. I mean, I think that if they don't make magic happen in the next few quarters, and I think it's the AI play. The stock definitely will be at risk because then you're going to have the China moderated sales on top of no real reason to get the 16. I think the stock would be in trouble. JULIE HYMAN: OK, gotcha. All right, let's get to your stock that you do not like. It's another one that's down year-to-date. And it's down quite a bit more than Apple. I'm talking about Boeing. Those shares are down more than 20% year-to-date. But you say, no, you don't want to get in here. Let's talk about why. First of all, there's sort of the obvious here. What's been going on production wise at the company? JAMES DEMMERT: Yeah, I mean, it takes decades to build a great reputation, Julie. You know that. It takes moments to ruin it. And I think this is what's going on. This is the story with Boeing. And it's really a management problem. They've had mistake after mistake. Some of them the same mistakes over the last two years. And that is really making the institutional investors sort of walk away. And that's why the stock is down. Now, a lot of people think it's cheap because it's down a lot. And we think that is a value trap. And we can talk about valuation in just a moment. JULIE HYMAN: Yeah, let's do that then. Let's talk about the valuation. JAMES DEMMERT: You know, here's a company in the last 12 months. That's lost money. I mean, this is an AI-tech led new bull market. That is not really where you want to be. AI can't save their valuation, right? But going forward, the street suggests that you're looking at the price relative to the earnings. You look at that. The streets are estimating the earnings to be at a PE to about 60 times earnings. The S&P 500 is trading at about 21 times earnings. Here's a stock. Three times as expensive as the average company, it's losing money. It's got a real reputation problem. I would stay away from a valuation. JULIE HYMAN: Well, and let's get to the last one here, which is competition. Airbus, of course, its big competitor not suffering from these same issues. JAMES DEMMERT: You know, Airbus has got that reputation down. They've really been able to be very consistent. Now, one problem with Airbus is they're pretty booked for a long period of time. But I think investors should recognize when companies have one of their biggest competitors have a problem like Boeing does, Airbus very well may come out with a new way to produce more planes sooner. So I think that competitive advantage that Airbus has could be a threat to Boeing another reason I don't want to own the stock. JULIE HYMAN: OK, one thing that maybe would draw you in, if the stock kept going down, would it get more attractive? JAMES DEMMERT: I don't want to use the pun-- the plane crashes here. But if the stock crashes, I mean, if the stock literally went down by 50%. I think investors then say, hey, maybe there's value now relative to book value, the amount of the number of the planes, and the future potentially getting brighter. But the stock would really have to come way down and be less than a market multiple. JULIE HYMAN: Gotcha. All right, and just to be clear here, you own Apple shares, if I'm not mistaken. JAMES DEMMERT: We own Apple shares as a firm and as my family. Yes. JULIE HYMAN: OK, but you don't own Boeing? JAMES DEMMERT: No. JULIE HYMAN: No? All right, let's summarize what you're telling investors here today, James. By Apple based on its current price, I'd likely blockbuster announcement at some point and solid investment strategy avoid Boeing for its poor management current valuation and potential loss of market share. James, thanks so much for being here. Appreciate it. JAMES DEMMERT: Thanks, Julie. JULIE HYMAN: And thank you for watching Good Buy or Goodbye. We're going to bring you new episodes three times a week at 3:30 PM Eastern. María del Rosario Sosa Unzaga ganó mucha popularidad por ser un apoyo incondicional para el jugador desde afuera de la casa; ahora es la protagonista de un escándalo que pondría en juego su relación El operativo se da en el marco de una acusación contra la mandataria Dina Boluarte por presunto enriquecimiento ilícito  Polémica en ANSeS: nombran a funcionario que avaló millonaria pensión de Cristina Kirchner Llegaron a España y construyeron una familia de luchadores voraces Majadahonda (Madrid), 30 mar (EFE).- Diego Simeone, entrenador del Atlético de Madrid, dio este sábado otra vuelta más a las variantes que maneja para su once titular contra el Villarreal, con una nueva prueba que afianzó a Memphis Depay junto a Antoine Griezmann en el ataque y abrió la opción de Rodrigo Riquelme para el carril izquierdo.  El encuentro, uno de los clásicos más apasionantes del fútbol argentino, se disputa este sábado en la Bombonera, con arbitraje de Nazareno Arasa ¿Quién escribió la Biblia? En este artículo te contamos las diferentes teorías que existen. Hace 17 años que Beatriz Trapote y Víctor Janeiro comenzaron su historia de amor de una forma casual. La periodista tuvo que entrevistar al torero para un programa de televisión y desde ese momento, no se han separado. A pesar de que hubo quienes al principio pusieron en entre dicho su amor, el matrimonio ha dejado claro, casi dos décadas después, lo unidos que están. Y así lo han vuelto a demostrar una vez más en el plató de ¡De Viernes!, donde se han sincerado e, incluso, la periodista ha cont  Las autoridades peruanas allanaron este sábado la vivienda de la presidenta Dina Boluarte y la sede de gobierno, en el marco de una investigación sobre unos relojes Rolex que la mandataria no habría declarado como parte de sus bienes.Boluarte fue interrogada por primera vez en marzo de 2023 en el marco de esa investigación. Jannik Sinner y Grigor Dimitrov superaron sus respectivos compromisos de la instancia de los cuatro mejores y accedieron a la definición El entrenador del Real Madrid Carlo Ancelotti confirmó este sábado el regreso a los terrenos de juego de Éder Militao, una vez que el central brasileño se ha recuperado de la grave lesión de rodilla a comienzos de esta temporada.El Real Madrid ha tenido muchas bajas esta temporada en el sector defensivo, con solo dos centrales naturales disponibles: Nacho Fernández y Antonio Rüdiger.  Desde la llegada de los “mocktails” y los tragos sustentables, hasta la moda de las sidras, las cervezas artesanales, los “hard seltzers” y los mezcales de colección, las barras más “adultas” están de vuelta. Un ambiente más calmado, superacogedor, cómodo para conversar y pasar un buen rato sin el “boom boom boom” de los clubes o restaurantes de música infernal. Esa es la meta, y aquí te presentamos cinco locales que parecen cumplir todos los requisitos. Después de tres años de ausencia, la reina Sofía y la infanta Cristina han acudido este Viernes Santo a la procesión del Cristo de los Alabarderos en Madrid. Acompañadas por Irene de Grecia, la madre de Felipe VI ha recibido la medalla de la popular cofradía durante un acto celebrado en el Palacio Real que nos ha dejado un sinfín de detalles. Como se aprecia en la imagen, la hermana del monarca ayudaba a su madre a colocarse esta distinción honorífica que, durante toda la tarde, la agasajada luc Las autoridades peruanas llevaron a cabo un allanamiento en la residencia de la presidenta Dina Boluarte como parte de una investigación en curso sobre presunta corrupción y enriquecimiento ilícito. El operativo fue ejecutado por un equipo conformado por fiscales y agentes policiales. Aquí el momento en que los agentes lograron acceder a la vivienda.  Cuando Christian de Hannover decidió pasar una temporada en Perú, no podía imaginar que aquella decisión marcaría para siempre su futuro. En el país de América del Sur conoció a Sassa de Osma mediante los primos de ella y comenzó de esta manera una bonita relación que suma ya 15 años en los que se han transformado en familia numerosa. La felicidad se ha multiplicado para ellos con el nacimiento de los mellizos Nicolás y Sofía en 2020 y la reciente llegada de Alexia hace solo un mes. Recordamos a Una toma de rehenes en Países Bajos que duró varias horas se saldó con la liberación de todos los retenidos, sin daños, y con la detención de un sospechoso. En los últimos años, se han producido en Países Bajos algunos atentados, pero no a la escala de otros países europeos como Francia o el Reino Unido. Aitana se encuentra en un momento profesional de lo más dulce. La cantante, de 24 años, está en plena gira internacional con su Alpha Tour y allá donde va consigue colgar el cartel de ‘no hay entradas’ pocos minutos después de que estas salgan a la venta. Sin embargo, antes de su gran concierto en Monterrey (México), la intérprete de Mi amor ha sufrido un percance por el que ha tenido que ser operada de urgencia. Aitana se derrumba en su último concierto tras el revuelo originado por sus nuevas  El entrenador tuvo un intercambio picante sobre el final de la conferencia de prensa Cuando el pasado verano se conoció que Leo Messi dejaba de ser jugador del PSG, fueron muchos los rumores que surgieron sobre las posibilidades que tenía para continuar con su carrera, una de las más importantes de la historia del fútbol. Entre todas las ofertas recibidas se decantó por el Inter de Miami, donde su llegada junto a Antonela Rocuzzo y sus tres hijos causó una gran revolución. En estos ocho meses se ha convertido en uno de los principales activos del equipo y fuera de los terrenos d Cuando apenas faltan dos días para la esperada reaparición de Carlos III en su primer acto público desde que le fuera detectado un cáncer, a unos 8.500 kilómetros de distancia habrá alguien de su familia más directa que pasará la Pascua de un modo muy diferente. Se trata del príncipe Harry, acostumbrado a vivir esta celebración lejos de los suyos desde que en 2020 decidiera instalarse en Norteamérica junto a su esposa. Sin embargo, las circunstancias actuales han provocado que este fin de semana "
}