{
    "title": "Apple Device Repairs Might Soon Get Cheaper And Easier: Oregon's Historic \nRight-To-Repair Law To Ban Part",
    "date": "3/27/2024",
    "url": "https://www.benzinga.com/top-stories/24/03/37975666/apple-device-repairs-might-soon-get-cheaper-and-easier-oregons-historic-righ-to-repair-law-to-ban-pa",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW In a significant blow to Apple Inc. AAPL, Oregon has passed a right-to-repair bill that outlaws the contentious practice of parts pairing in repairs. What Happened: Despite Apple’s vigorous opposition, Oregon’s Governor Tina Kotek signed SB 1596 into law on Wednesday. This legislation aims to facilitate consumer and third-party repairs. The bill is the first of its kind to prohibit parts pairing, a practice where specific components, such as the screen or battery, are matched with the original iPhone. This practice reportedly ensures the use of genuine parts and enhances device security during repairs. However, critics argue that part pairing restricts consumer choice, limits third-party repair options, and contributes to significant electronic waste. See Also: ‘Time To Buy’ Apple Stock, Says Expert: ‘Out Of All Mag 7 Stocks, After Maybe Tesla, Apple Is Currently The Most Hated’ “This is cause for celebration. Electronic waste is growing five times faster than our electronics recycling capacity, according to last week's United Nations Global E-Waste Monitor report. We need to cut down the insane cycle of churning through personal electronics—and that starts by empowering repair,” said Nathan Proctor, PIRG Right to Repair campaign senior director. He added, “Oregon's nation-leading Right to Repair law will keep devices working and off the scrap heap.” The bill also mandates companies to provide the same parts, tools, and repair documents to owners as they do to repair shops without charging extra. The law does not apply to phones sold before July 1, 2021, but covers other consumer electronics sold after July 1, 2015. Why It Matters: Apple’s opposition to the right-to-repair movement has been a long-standing issue. The company’s practices have faced criticism from various quarters, including its own co-founder, Steve Wozniak, who voiced support for the movement in 2021. Subscribe to the Benzinga Tech Trends newsletter to get all the latest tech developments delivered to your inbox. However, in 2023, California became the third state to pass a Right to Repair bill, which was interestingly backed by Apple. Previously, AppleInsider noted that it may appear odd that Apple backs right-to-repair legislation in one state while opposing it in another. Still, it is important to note that Oregon’s bill differs in a crucial aspect—it imposes restrictions on parts pairing. Check out more of Benzinga's Future Of Consumer Tech by following this link. Read Next: Apple’s WWDC 2024 Event To Be ‘Generative AI Launch Party,’ Predicts Gene Munster Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}