{
    "title": "Apple Dell Tech Layoffs 2024 Reason; IBM Ericsson | Cost Cutting And AI | 4 \nglobal tech-companies laid off 8000 ...",
    "date": "3/26/2024",
    "url": "https://www.connexionblog.com/2024/03/apple-dell-tech-layoffs-2024-reason-ibm-ericsson-cost-cutting-and-ai-4-global-tech-companies-laid-off-8000-employees-in-march-ericsson-laid-off-1200-and-dell-technologies-laid-off-6000-c/",
    "text": " New Delhi6 minutes ago copy link Retrenchment of employees as part of cost cutting in the tech sector continued in March also. Five global tech companies have laid off more than 8,000 employees this month. These include Apple, IBM, Dell and Ericsson. On the 25th of this month, telecom equipment company Ericsson announced the layoff of 1,200 employees in Sweden. This decision of the company has been taken this year keeping cost cutting in mind. These include reduction in advisors, process restructuring and facilities. The company had laid off 8,500 workers last year also. Apple closes Micro LET display projectApple has stopped an expensive Research and Development (R&D) project this month. The company has halted efforts to develop micro LED displays for future Apple Watch models. For this, Apple restructured the display engineering team, due to which jobs were cut on a large scale in America and Asia. Second major layoff in Dell in two years, now 1.2 lakh staffAmerican computer company Dell Technologies has made layoffs for the second time in two years. This time the company has removed 6,000 employees. There are now 1.20 lakh employees left in the company, which was less than a year ago.There were 1.26 lakhs. The company has taken this decision due to cost cutting. IBM removed half the staff from its communications unit.IBM’s Chief Communications Officer Jonathan Adashek laid off more than half of the staff in the marketing and communications department on March 12. In August 2023 also, the company had announced to get about 8,000 jobs done through Artificial Intelligence (AI). There is more news…\n\n< Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  © Connexionblog 2023. All Rights Reserved. © Connexionblog 2023. All Rights Reserved. "
}