{
    "title": "Apple's car prototype was internally called the 'Bread Loaf' because of its \nshape: Bloomberg",
    "date": "3/6/2024",
    "url": "https://ca.style.yahoo.com/apples-car-prototype-internally-called-045543239.html",
    "text": "We've rounded up the best deals from Amazon, Walmart, Best Buy, Coach Outlet & more. Apple employees called the design of their first electric vehicle the \"Bread Loaf,\" per Bloomberg. The minivan was tested in 2020 by executives as part of Apple's secret \"Project Titan.\" CEO Tim Cook appeared impressed, but the \"Bread Loaf\" wasn't always viewed in a positive light, per Bloomberg. Apple employees working on the tech giant's first electric car built a prototype in 2020 that they called the \"Bread Loaf,\" a name that was at times used disparagingly. The moniker was reported in a Bloomberg feature about the secretive \"Project Titan\" to build Apple's failed car, which top executives officially shelved on February 27 after nearly a decade of work. The four-seater prototype resembled a minivan featuring, as Bloomberg writes, \"rounded sides, an all-glass roof, sliding doors, and whitewall tires.\" The car team used the \"Bread Loaf\" name \"not always affectionally,\" according to Bloomberg reporters Mark Gurman and Drake Bennett. Its design would later change as the project's lead moved to another company, but the \"Bread Loaf\" was an iteration that made it to the test tracks in 2020, per Bloomberg. Apple CEO Tim Cook took part in that demo, according to the outlet, in what seems like a classic case of how trying to impress your boss can backfire. According to Bloomberg, the Apple team spent nine months preparing a proof of concept demonstration that was highly scripted and fine-tuned for Cook's safety. Project leaders wanted to advise Cook to aim for conditionally automated driving, which is built to let the driver take over at a moment's notice in some situations. But Cook and other Apple honchos liked the demo so much that they wanted the full suite of self-driving sophistication, when the computer can drive in all circumstances, Bloomberg reported. Apple's killing of the car project comes as the electric vehicle market slows from its initial burst of hype and sales. Demand for expensive, premium EVs is tapering off in the US, and automakers such as Ford and Tesla have in the last year announced delays to their investments in new EV infrastructure. Apple did not immediately respond to a request for comment sent outside regular business hours by Business Insider. Read the original article on Business Insider Passengers traveling on a Boeing jet from San Francisco to Paris made an emergency stop in Denver Thursday after the crew reported an engine problem. BALTIMORE (AP) — A crane that can lift 1,000 tons, described as one of the largest on the Eastern Seaboard, appeared near the site of a collapsed highway bridge in Baltimore as crews prepared Friday to begin clearing wreckage that has stymied the search for four workers missing and presumed dead and blocked ships from entering or leaving the city's vital port. Maryland Gov. Wes Moore called the Francis Scott Key Bridge's collapse following a freighter collision an “economic catastrophe\" and desc  The largest crane on the East Coast will soon try to lift the treacherous, colossal wreckage that has hampered search crews from finding victims of this week’s catastrophic Baltimore bridge collapse. Seven people were taken to a New York hospital for observation after experiencing severe turbulence on a United Airlines flight, according to a local EMS chief. A dog who escaped while being loaded onto a plane in North Carolina was reunited with his owner after an extensive search. Select Hong Kong and Greater Bay Area (GBA) artists are being showcased at Art Central, an annual international art fair which this year takes... ‘Bubble cars’ could soon be a regular sight on British roads again for the first time since the 1960s. The tiny cars became an unlikely style icon and now, thanks to Swiss firm Microlino, a car based on the original four-wheel European design will return to British roads later this year. Enthusiasts for the old Isetta are already excited about the Microlino’s potential arrival in the U.K.. Original Isetta owner Dave Watson said he “can’t wait” to get to try the new version - with owners hotly anticipating its arrival. He says the original was “cheap transport and seen as a one up from a motorcycle” as it kept the driver and a partner “dry and warm”.The Microlino was first unveiled at the 2016 Geneva Motor Show and entered production in Europe six years later. Different models of the Microlino come with battery packs of 5.5kWh, 10.5kWh or 15.0kWh, corresponding to claimed ranges of 58 miles, 110 miles and 142 miles. It mimics the Isetta’s front-mounted door, but unlike the original, it has a reverse gear - making parking in the tiny car even easier. In Europe, the Microlino starts at €17,990 (£15,400) and rises to €19,990 (£17,100) for a 10.5kWh model, or €21,990 (£18,800) with the 15.0kWh battery. MONTREAL — Quebec's police watchdog says it is investigating the deaths of two men in Montreal who were fleeing from police when their vehicle struck a tree Thursday morning. The crash northeast of downtown happened shortly after two nearby drive-by shootings, which injured one man. The watchdog agency, the Bureau des enquêtes indépendantes, said a Montreal police officer was responding to a 911 call reporting gunshots and dangerous driving shortly after 5:30 a.m. \"The officer reportedly spotted Forty-five people were injured, five of them critically, when a train crashed into the side of a bus at a rail crossing in northwestern Cambodia Friday, police said.  Gen. Sar Theng, the police chief for Pursat province, said the crash in Krakor district occurred around 11 a.m. when the bus attempted to cross the tracks even though the oncoming train had loudly sounded its horn as it approached.  Sar Theng said there used to be a barrier at the crossing but it had broken and had not yet been replaced.  Ford is considering making a new sports-utility vehicle (SUV) at its plant in Valencia in Spain, the company said on Thursday.  \"Given the changes we see in the industry, we believe there is an opportunity to add an all-new multi-energy SUV to the Europe cycle plan, to be manufactured in Valencia.\"  Spanish newspaper Cinco Dias first reported that Ford was weighing production of a new passenger car at the Almussafes plant in Valencia. WASHINGTON (AP) — The Environmental Protection Agency on Friday set strict emissions standards for heavy-duty trucks, buses and other large vehicles, an action that officials said will help clean up some of the nation's largest sources of planet-warming greenhouse gases. The new rules, which take effect for model years 2027 through 2032, will avoid up to 1 billion tons of greenhouse gas emissions over the next three decades and provide $13 billion in net benefits in the form of fewer hospital vi DETROIT (AP) — U.S. auto safety regulators are investigating complaints that more than 540,000 Ford pickup trucks can abruptly downshift to a lower gear and increase the risk of a crash. The National Highway Traffic Safety Administration says in documents posted on its website Friday that it opened the investigation this week after receiving 86 consumer complaints about the problem with the trucks' automatic transmissions. Investigation documents say the probe covers F-150s from the 2014 model y IBKR EventTrader - A new, straightforward way to trade CME futures markets Stealing an EV comes with some unique risks. While different people have different needs for their cars -- some might want family-friendly vehicles while others may want sporty, fun rides -- everyone has the same basic metrics for satisfaction.... 1984 Porsche 911 Carrera Targa Undergoes Comprehensive Refresh. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Urbanandsport/NurPhoto via Getty ImagesStrong winds forced a United Airlines flight from Tel-Aviv, which was intended for Newark Airport, to instead land at New York Stewart International Airport in Orange County on Friday, officials confirmed.The flight tracking site, FlightAware shows that the plane approached Newark airport before circling back North and landing at New York Stewart International.“We responded to NY International Airport with 10 EMS units to evaluate passengers on a United fli A motorcycle accident on Sunday afternoon left one person dead and another in critical condition. The single-vehicle crash occurred on Highway 16, near the truck scales about one kilometer east of the Tete Jaune junction. According to the North District of the B.C. RCMP, Valemount RCMP responded to the crash at 4:16 p.m. Of the two passengers on the motorcycle, one was pronounced dead at the scene while the other was rushed to the hospital. An investigation into the crash is ongoing and a cause The EPA’s new pollution rules for heavy-duty vehicles push the industry toward zero-emission technology. 友和周年感恩節隆重推出「保證最抵」，幫每位顧客穩守價格優勢！3月內友和會員購物後發現其他商店埋得更平，即可申請差額補償高達$1000！ Volkswagen built the first example of the original Golf on March 29, 1974, and the company has made about 37 million units of the Golf since. After a yearlong closure, a bridge over the Puyallup River reopened in 2019 with a sturdy new span and a brand new name. It even won a national award. But today, the Fishing Wars Memorial Bridge is closed again after federal officials raised concerns about a vintage section of the nearly century-old bridge that carried about 15,000 vehicles a day. It has no timetable to reopen because the city of Tacoma, Washington, first must raise millions of dollars to clean and inspect it. “It’s frustrating Purchasing a car is much less of a gamble now than it used to be thanks to all the information at your fingertips. You can instantly find out a car's history just by entering its vehicle... "
}