{
    "title": "Steve Jobs' autographed business card sells for $180,000 at auction",
    "date": "3/22/2024",
    "url": "https://www.newsbytesapp.com/news/science/steve-jobs-signed-business-card-from-1983-sold-for-181000/story",
    "text": "Hi, Logout A vintage Apple business card, signed by its late co-founder Steve Jobs, has been sold at auction for an impressive $181,183 (nearly Rs. 1.51 crore). \n \nThe card, thought to be from 1983, was a key item in the \"Steve Jobs and the Apple Computer Revolution\" event hosted by Boston-based RR Auction. \n \nThe auction house has confirmed that this is one of only five verified business cards bearing Jobs' signature from any period. Bobby Livingston, Executive Vice President at RR Auction, shared in a press release that the sale of the autographed Steve Jobs' Apple business card has established a new standard for such items. \n \nHe further commented that this sale underscores Jobs' lasting legacy and Apple's significant influence on our contemporary world. \n \nThe auction presented six items signed by Jobs, with the business card achieving the highest bid. Among other items sold, a 1976 check signed by Jobs fetched $176,850. \n \nThis check holds importance as it was issued nearly two weeks before Apple's official inception, and bears address of the renowned \"Apple Garage\" in Palo Alto, where the company was allegedly founded. \n \nA Jobs' signed 2003 movie ticket for Pirates of the Caribbean: The Curse of the Black Pearl, collected $14,653. \n \nAn employment offer letter promising salary increase and signed by him went under the hammer for $17,706. Besides items signed by Jobs, the auction also featured an unsigned business card from the 1980s and an Apple promotional poster. \n \nThe ongoing popularity and influence of Steve Jobs ensures that items linked to him remain highly prized. \n \nThese pieces are especially coveted by technology enthusiasts and collectors, reflecting the substantial impact of Jobs' legacy on our contemporary world. "
}