{
    "title": "Apple blocks Epic Games and prevents the return of Fortnite to iOS",
    "date": "3/7/2024",
    "url": "https://www.levelup.com/en/news/778189/Apple-blocks-Epic-Games-and-prevents-the-return-of-Fortnite-to-iOS",
    "text": " Tim Sweeney's company regrets the lack of support for a competitive environment. Tim Sweeney's company regrets the lack of support for a competitive environment. by\nVíctor Rosas\n2024-03-07T20:00:00+00:00 by The dispute between Epic Games and Apple is far from over. Just when it was thought that the dispute initiated by the Fortnite company had managed to crack Apple's business model and fees, the outcome has been different, and a new act has reignited the feud between both parties. The Battle Royale was close to returning to iOS but was brought down halfway. Epic Games and its CEO, Tim Sweeney, lamented Apple's new action, considering it an attack on competition and a direct affront. To put the situation into context, you should know that Apple canceled Epic Games' developer account on iOS, Epic Sweden, which is the only way the company could achieve the return of Fortnite to this platform by adding its store as part of the changes mandated by the Digital Markets Act in Europe (DMA), which favors the implementation of third-party digital stores and creators without going through the App Store. In this regard, Epic issued a statement stating: \"By canceling Epic's developer account, Apple is eliminating one of the potential largest competitors from the Apple App Store. They are undermining our ability to be a viable competitor and are showing other developers what happens when you try to compete with Apple or criticize their unfair practices. If Apple retains its power to expel a third-party market from iOS at its sole discretion, no reasonable developer would be willing to use a third-party app store because they could be permanently separated from their audience at any time.\" Thanks to everyone who is speaking up against Apple blocking Epic from competing with their App Store.On PC, we’ve served over 270,000,000 customers, so the victims of Apple’s competition bans include hundreds of millions of future customers on iOS who are deprived of better… The official version, confirmed by Apple, is that Epic Games' developer account was canceled, and its operation on iOS and the App Store is prevented due to being considered untrustworthy. In the end, the iPhone and iPad company appeals to regulations that favor it, reserving access to its platform, something defined by the seriousness and reliability of the developer in question. It is not that Epic Games is untrustworthy, but Apple perceives it that way and justifies the cancellation of its account. In response, Apple executive Phil Schiller said to Tim Sweeney: \"Your colorful critique of our DMA compliance plan, along with Epic's past practice of intentionally violating contractual provisions with which it disagrees, strongly suggests that Epic Sweden has no intention of following the rules. Please tell us why we should trust Epic this time.\" Stay tuned here on LEVEL UP. Best New Follow us Advertise |\n\t\t\t\t\t\tContact |\n\t\t\t\t\t\tReport Bug |\n\t\t\t\t\t\tTerms www.levelup.com and the LEVELUP logo are registered trademarks. \nAll Rights Reserved © LEVELUP.COM S de R.L. of C.V. "
}