{
    "title": "A tech worker wore Apple's 'creepy' Vision Pro headset during his wedding \nphotos — much to his wife's dismay",
    "date": "3/18/2024",
    "url": "https://ca.news.yahoo.com/tech-worker-wore-apples-creepy-105733962.html",
    "text": "A software engineer wore Apple's Vision Pro headset during his wedding. The bride told the SFGATE she found Apple's headset a \"little creepy\" and \"a little uncanny.\" Users have been seen wearing the Vision Pro in various public places, including while driving. A tech worker wore Apple's Vision Pro headset during his wedding photo shoot — much to his new wife's dismay. Pictures of software engineer Jacob Wright wearing the mixed-reality headset while his wife looks on disapprovingly went viral earlier this month. Wright, an engineer at an AI startup, also wore Apple's chunky new headset during the wedding reception, local outlet SFGATE reported. Wright told the science and technology news outlet Futurism he had a \"bad habit\" of carrying the Vision Pro with him everywhere. The bride, Cambree Wright, told the SFGATE she found the headset a \"little creepy\" and \"a little uncanny\" — adding she'd tried to keep the headset out of the bridal shots despite her husband's multiple requests. \"I turn around one minute, and he has it on,\" she said of the photos. However, said added she wasn't angry about her husband's decision to don the Vision Pro, despite looking upset in one of the pictures snapped by the photographer. \"I look pissed in the picture. I wasn't really mad, though,\" she told Futurism. \"I just thought it was funny.\" Jacob Wright did not immediately respond to a request for comment from Business Insider, made via LinkedIn outside normal working hours. Apple's Vision Pro has only been unleashed on the world for less than a month, but users have already been spotted wearing the headset in odd places. At least two people have been filmed using the headset while driving, while another appeared to be wearing it while crossing a road. Users have also been spotted wearing the headset in other public places, including the gym and the subway. Read the original article on Business Insider \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th  \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76.  Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million  TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap.  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone They soft-launched their relationship at the supermodel's cookbook event in Miami.  The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company.  Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. "
}