{
    "title": "Apple Antitrust Suit: The US shouldn’t force the company to make a worse \niPhone",
    "date": "3/21/2024",
    "url": "https://www.moneycontrol.com/news/opinion/apple-antitrust-suit-the-us-shouldnt-force-the-company-to-make-a-worse-iphone-12507671.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now The biggest challenge that the Department of Justice has in winning its antitrust case against Apple Inc is this: The iPhone is really, really awesome. I’m not trying to be droll. The iPhone’s quality, and the way in which Apple continues to make it so, goes to the heart of the case filed against the company on Thursday morning. And it makes any potential remedy a touchy subject. Levelling the playing field invariably means adding complication, friction and insecurity to a device that became successful because Apple was able to engineer away all of those things. Unlike other recent antitrust cases filed against big technology companies, in which regulators have targeted Google’s search deal with Apple andAmazon.com Inc’s tactics on price manipulation, this long-awaited filing against one of the richest US companies seeks to draw strength from its breadth, focusing on several crucial parts of Apple’s competitive “moat.” After a five-year investigation, here are the chief points the government is bringing to court: * It says the company prevents the existence of super apps — that is, apps that contain more apps within them, like a digital shopping mall. It means competitors must launch their apps in Apple’s store with its onerous controls and expensive fees. * It says the company blocks “cloud streaming apps” that would allow, for example, streaming of games over the cloud, something that would reduce the need to have a more powerful smartphone — i.e the latest iPhone. * It goes after what users will know best as the “green bubble effect,” the clunky experience of sending and receiving messages between the iPhone’s iMessage app and smartphones that run Google’s Android operating system. Videos sent by Android users to the iPhone appear grainy and low quality — an artificial restriction concocted by Apple to benefit itself, regulators argue, creating a “social stigma.” * It says Apple’s tight integration between the Apple Watch and the iPhone prevents people from switching smartphones, accusing Apple of “having copied the idea of a smartwatch from third-party developers.” * And it says Apple is blocking developers from creating their own digital wallets that can use the iPhone’s near-field communication chip to use tap-to-pay. In sum, the complaint contends: “Apple reinforces the moat around its smartphone monopoly not by making its products more attractive to users, but by discouraging innovation that threatens Apple’s smartphone monopoly or the disintermediation of the iPhone.” I disagree with that framing. As any iPhone user knows, Apple clearly does both: It uses its maniacal control over the user experience on the iPhone to make it a vastly superior smartphone that is more attractive to consumers. But in doing so, it shuts out competitors in a manner that has anticompetitive side effects because of the iPhone’s scale. Attempts to remedy this situation could be painful, unpopular and have a high chance of failure. Just ask iPhone users in Europe, where regulators enforced their tough new rules to increase mobile browser competition — and all users got was a lousy menu. Hardly a tectonic shift in the competitive landscape. Apple’s authoritarianism is what makes an iPhone an iPhone and not an Android. Fans of that competing platform will eagerly say it can do everything an iPhone can do while ignoring the fact that the user experience is a steaming hot mess — particularly for less tech savvy users who aren’t as vigilant in keeping out nasty apps or for whom too many separate apps doing similar things would be massively confusing. (It’s no coincidence that when my father calls with a tech support question, it’s always about his Android phone, never his Apple iPad.) Forcing Apple to open up to competition in the way the Justice Department is demanding would degrade the iPhone experience. Would it be better for users, for instance, if their credit cards, plane tickets and IDs were squirreled away in different apps for banks, airlines and everything else? Or would they rather have them, as Apple currently forces, in a single wallet they knew was secure? (Or to put it another way: How many physical wallets does the typical person carry?) Would it be better for users if, instead of Apple deciding what apps are safe, individual companies could make their own decisions through their own “mini” app stores? More democratic, maybe, but more open to abuse. The Apple Watch, meanwhile, finds its value in the software and hardware integration between it and the iPhone — including the secure monitoring and storing of health data. Could Apple make it compatible with Android? Yes, with trade-offs. But why should it? Shouldn’t competition come from Google doing something similar with its Pixel phone and a wearable? Indeed, Google tried, acquiring fitness device-maker FitBit in 2021 for $2.1 billion; it has since run the once-competitive brand and its products into the ground. Saying Apple “copied” the smartwatch is like arguing Ferrari copied the Model T because Ford’s car had four tires and a steering wheel. The annoyance at the “green bubble” has some credibility — the limitations Apple has imposed are petty — but a remedy arguably already exists in that users can already choose to use (free) interoperable services like Whatsapp or Signal. In fact, the US is just about the only country in which this is even an issue. More may come out during a trial, but there are no real smoking guns in the government’s filing. One comment in particular, attributed to an unidentified “Apple Manager,” highlights the dichotomy. Allowing super apps, this manager wrote, would “let the barbarians in at the gate,” which is almost certainly true. It would also mean “iOS stickiness goes down.” Through examples like this, Apple will be able to credibly argue that the “anticompetitive” move was first and foremost the right one for its users. Of all the recent legal actions against technology companies emanating from the joint assaults of the Federal Trade Commission and Justice Department, the case against Apple seems the most muddled and least convincing. It relies on a flimsy notion that Apple’s success has throttled innovation at other companies, rather than compelled it, without truly explaining how. It certainly doesn’t make a persuasive case that ordering Apple to make a worse iPhone would change anything for the better. Dave Lee is a Bloomberg Opinion columnist. Views do not represent the stand of this publication. Credit: Bloomberg Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}