{
    "title": "Apple Maps Incorrectly Marks Small Businesses as 'Permanently Closed'",
    "date": "1/23/2024",
    "url": "https://www.extremetech.com/internet/apple-maps-incorrectly-marks-small-businesses-as-permanently-closed",
    "text": "Like any other mainstream GPS app, Apple Maps does more than help you get from point A to point B. It also surfaces what’s around you, whether you’re on vacation, passing through an unfamiliar part of town, or settling into a new city. This facet of Apple Maps is vital to the survival of small businesses, which rely more than big chains on customers’ ability to “discover” new places. If you don’t know about a business, you can’t spend your money there. But what happens when apps like Apple Maps represent those businesses incorrectly? Based on a recent example, they might lose thousands of dollars in lost patronage. According to Australia’s ABC Sunshine Coast, a couple in Queensland found out through a regular that their Thai restaurant was labeled “permanently closed.” “We have no idea when this change went through,” co-owner Chris Pyatt told ABC. “But we have seen a sudden and drastic change in customer behavior towards the end of November and all of December. We've noted a significant downturn of around $12,000.” (In US currency, that’s about $7,877.) When Pyatt reached out to Apple to correct the listing, the company claimed it couldn’t help Pyatt because he didn’t own an Apple product. Pyatt was eventually able to open an Apple business account online, “claim” his business, and then mark it as open. This resulted in the Pyatts’ listing being moved to incorrect GPS coordinates, which had to be corrected. The Pyatts aren’t the only business owners who have struggled with incorrect Apple Maps labels. Countless posts on Apple’s Support Community forum claim businesses have switched to “permanently closed” seemingly out of the blue, thus turning away customers who might have otherwise supported those businesses. “The clinic I work for is listed as permanently closed on Apple Maps, but we are open and fully operational with our regular hours,” one post from 2021 reads. “People are not showing up for appointments and when we call they say they saw that we were closed on Maps.  It's hurting our business.” Similar posts from 2023 reflect similar issues: incorrect labeling, lost customers, and difficulty correcting affected Apple Maps listings. It’s unclear what causes businesses to be labeled as “permanently closed” when they’re fully operational. Business owners are supposed to be able to use Apple Business Connect to manage their organizations’ listings. Still, some owners aren’t aware of the program, and others find it difficult to use. One Redditor says their experience with Apple Business Connect is so poor that they rarely report issues with their listings anymore. Although they like the Apple Maps user experience more than Google Maps, the latter’s business listing team usually responds to error reports within minutes. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}