{
    "title": "Apple embraces change: Sideloading, alternate app stores coming to iPhone \nthanks to the EU",
    "date": "1/26/2024",
    "url": "https://www.businesstoday.in/technology/news/story/apple-embraces-change-sideloading-alternate-app-stores-coming-to-iphone-thanks-to-the-eu-414987-2024-01-26",
    "text": "Feedback Apple has unveiled plans to reshape its app ecosystem in response to the European Union's Digital Markets Act (DMA), set to take effect in March. This marks the most significant transformation since the inception of the App Store in 2008. The key highlight is the allowance of third-party app stores on iOS for the first time, challenging the exclusive distribution role held by the Apple App Store. The sweeping modifications are slated to be introduced with the release of iOS 17.4 in March. Under the new paradigm of \"alternative app marketplaces,\" users within the EU and operating on iOS 17.4 will gain the ability to download these marketplaces from their respective websites. However, adherence to Apple's approval process is mandatory for these marketplaces to be functional on iPhones. Users must explicitly grant permission for the download of apps through these third-party marketplaces, even those that may contravene App Store guidelines. Additionally, users can designate a non-App Store marketplace as their default choice. Developers, too, are granted greater flexibility. They can opt to use Apple's payment services and in-app purchases or integrate third-party payment systems without incurring an extra charge from Apple. For those sticking with Apple's in-app payment system, a 3 percent processing fee applies. Despite these changes, Apple retains a vigilant oversight of the app distribution process. All apps must be \"notarised\" by Apple, and third-party marketplace distribution is managed through Apple's systems. Developers are limited to distributing a single version of their app across various app stores and must adhere to basic platform requirements, including malware scans. Also Read Apple iOS 17.3 update: How to turn on Stolen Device Protection on your iPhone In terms of costs, developers may now pay no commission to Apple in the EU, depending on their chosen app distribution method. Apple has revised its fee structures, offering developers the choice between adopting new business terms or continuing with the existing model through the App Store. Apps distributed through the App Store using an alternative payment system will now incur a 17 percent commission (down from 30 percent) on digital goods and services. This rate drops to 10 percent for apps eligible for Apple's reduced \"small business\" rate, with an additional 3 percent fee for those using Apple's payment processing system. A new addition is the Core Technology Fee, charging developers €0.50 per annual app install after surpassing a million annual installs in the EU. Apple estimates that over 99 percent of developers will either reduce or maintain their fees under these new terms. Beyond app stores and payment systems, Apple is opening up other facets of the iOS ecosystem in the EU. Alternative browser engines to WebKit will be allowed, and users will have the option to choose alternative browsers upon opening Safari for the first time on iOS 17.4. The App Store will now permit global game streaming services, marking a departure from previous restrictions. Furthermore, Apple is preparing to allow NFC payments in third-party apps in the European Economic Area. The DMA, enacted in 2022, represents the EU's robust attempt to curb alleged anticompetitive practices by major tech companies, designating them as \"gatekeepers.\" Apple, identified as a gatekeeper last September, faces obligations related to app installation, uninstallation of stock apps, and changes to default services under the DMA. “There’s no need to panic. Apple is clearly not becoming the Wild West of apps that many consider Android to be. This announcement is essentially Apple's attempt to balance the need for compliance while maintaining security. Firstly, to be able to create a third-party marketplace, a developer has to apply for a special entitlement from Apple, which requires a large amount of documentation, and Apple would be able to deny applications from entities they do not approve. Additionally, Apple also requires a letter of credit of over 1 million USD from the developer of a third-party marketplace, which will make it impossible for smaller companies to create their own marketplace,” Jan Vidar Krey, VP of engineering at Promon told Business Today. Also Read Apple Vision Pro headset pre-orders and availability announced: See dates and more details Apple expands ‘Find My’ network limit to 32 devices; quick guide on how to use it Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}