{
    "title": "Epic Games goes to court to accuse Apple of breaching App Store ruling",
    "date": "1/31/2024",
    "url": "https://9to5mac.com/2024/01/31/epic-games-app-store-ruling/",
    "text": "While some may have thought the Epic Games versus Apple battle ended when the US Supreme Court decided the existing App Store ruling would stand, and it would not hear appeals from either side, it quickly became clear that this isn’t the case. Epic Games has now followed through with its threat to contest Apple’s “bad-faith compliance plan” – which would see the company charge 27% commission on app sales made outside of its own App Store … That decision meant the original court rulings stand, and Apple promptly responded with an announcement that, sure, it would allow third-party app sales – but it would still charge a 27% commission on them (12% for small developers). It seems clear that antitrust regulators will not be satisfied with this, with the US Department of Justice reportedly close to initiating legal proceedings against Apple. Apple has take almost exactly the same stance in response to European antitrust legislation, and is again likely to face the wrath of regulators there. As soon as Apple announced its plans, Epic accused the company of bad faith, arguing that it was not in fact complying with the original court ruling. The company’s chief exec told us that it went against the entire intention of the judge’s decision. Epic Games CEO Tim Sweeney isn’t happy with the final terms and says the company will contest Apple’s “bad-faith compliance plan” […] In a statement to 9to5Mac, Sweeney pointed out that Apple’s solution is “anticompetitive” since developers can’t offer digital items more cheaply on the web after having to pay both Apple and another platform. Bloomberg reports that Epic has indeed filed an official complaint to this effect. Apple Inc. hasn’t properly complied with a court order to open its App Store to allow outside payment options weeks after its bid to resist those changes hit a dead end, Epic Games Inc. told a judge […] Epic said in a filing Tuesday that it “disputes Apple’s compliance” with previously ordered changes and said it will explain the “non-compliance” in a forthcoming filing. Apple didn’t immediately respond to a request for comment. (While the Supreme Court decision means neither side can challenge the ruling itself, what Epic is doing here is claiming that Apple is not complying – which is a matter which will need to be settled in court.) Apple’s position is that the court confirmed it is entitled to charge a commission (though expressed no view on the amount); that all developers benefit from the support the company provides through APIs and the like; and, rather randomly, that it doesn’t charge anything if a user taps an external purchase link and for some inexplicable reason waits seven days before buying the app. Photo by Markus Spiske on Unsplash FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… There are growing concerns that Apple could be f… Ben Lovejoy is a British technology writer and EU Editor for 9to5Mac. He’s known for his op-eds and diary pieces, exploring his experience of Apple products over time, for a more rounded review. He also writes fiction, with two technothriller novels, a couple of SF shorts and a rom-com! "
}