{
    "title": "Company News for Jan 16, 2024",
    "date": "1/16/2024",
    "url": "https://ca.finance.yahoo.com/news/company-news-jan-16-2024-130500117.html",
    "text": "Apple Inc. (AAPL) shares rose by 0.2% as the tech giant strategically opts to eliminate a blood-oxygen sensor from certain smartwatches, aimed at sidestepping a patent dispute and mitigating potential sales disruptions. Uber Technologies, Inc. (UBER) shares declined 0.4% as the company announced the discontinuation of its alcohol delivery app, Drizly. The Boeing Company (BA) shares fell 2.2% as the company announced new quality changes in response to the midair incident involving Alaska Air Group, Inc. (ALK). DocuSign (DOCU) shares surged by 3.6%, following Reuters’ reports of competitive interest from private equity firms Bain Capital and Hellman & Friedman in acquiring the company. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report The Boeing Company (BA) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Alaska Air Group, Inc. (ALK) : Free Stock Analysis Report DocuSign (DOCU) : Free Stock Analysis Report Uber Technologies, Inc. (UBER) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th  This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids  Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Trade 24 hours a day on the world's most popular platform. Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone  They soft-launched their relationship at the supermodel's cookbook event in Miami. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 The \"Late Night\" comedian brutally summed up the former president's media company. Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. 2024 Subaru Crosstrek Review, Pricing, and Specs \"We love to cook and we have the family together,\" Richards tells PEOPLE Public disagreements about how to handle immigration resulted in U.S. Rep. Alexandria Ocasio-Cortez reminding Elon Musk he is an immigrant himself. Leaks from a notoriously sketchy data broker have revealed the locations of hundreds of people who visited convicted pedophile Jeffrey Epstein's Bahaman island before his 2019 arrest and subsequent death behind bars. In an investigation, Wired reports that the firm in question, Near Intelligence, "
}