{
    "title": null,
    "date": "1/3/2024",
    "url": "https://finance.yahoo.com/video/pc-demand-presents-opportunities-apple-174500977.html",
    "text": "Apple (AAPL) shares sink to a seven-week low after Barclays downgraded the stock to \"Underweight\" citing weakening iPhone demand. But Goldman Sachs analysts provided a counterpoint, noting potential upside from recovering PC demand ahead of Apple's VR headset launch. Yahoo Finance Tech Editor Dan Howley breaks down the details on Apple's demand outlook for its various products. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith. RACHELLE AKUFFO: All right. Well, Apple hit its lowest level in seven weeks after Barclays issued a rare downgrade on the stock citing weaker demand for the iPhone 15. But Goldman Sachs sang a different tune this morning saying the tech giant could stand to benefit from PC demand recovery. And with Apple's much anticipated virtual reality headset expected to be released this year, what should investors expect? Yahoo Finance's Dan Howley joins us with the details. Dan, it seems like a lot riding on this year. DAN HOWLEY: Yeah, that's right, Rachelle. We're seeing this-- obviously this note from Barclays yesterday impacting the stock price, sending it down about 3% throughout the day yesterday, and now we're seeing this kind of, as you said, opposite side of the coin. This Goldman piece saying that essentially an increase in PC demand will help Apple. And so one of the weaker portions of Apple's business has been the Mac and iPad side of things, and that, like other PC manufacturers, comes down to when people purchase tons of new products as the pandemic kind of kicked off. It's been about four years since the pandemic and people are in that refresh cycle where they're going to go out and buy new products. We'll be seeing that as PC sales start to pull back up. There's been different reports from Gartner and IDC essentially saying the same thing that the slowdown is starting to come to an end, and we'll see a return to growth in 2024. So that should really benefit Apple and its Mac and iPad business. We're also-- there's been rumblings about new iPads coming, and the Mac line has been refreshed with Apple's M3 chips. And so these are the kind of boons that they're looking for. This-- they're going to potentially see this kind of reinvigoration of those segments and oh, yeah, they're running with really new processors. And so that's something that I think a lot of people are going to be interested in. The flip side of that is, you know, Apple's computers tend to last a long time and so people don't necessarily need to upgrade them as often as they may other PC makers, so that could be a problem for them. But This is going to be, I think, a year where Apple starts to regain that strength in the Mac and the iPad business. RACHELLE AKUFFO: And it's interesting. When you consider the slump that we saw in PC sales and as you mentioned, IDC predicting global PC shipments forecast to recover in 2024, you don't usually think of-- I mean, obviously a lot of people still use Apple's laptops, but how do you see them gaining market share from that? Is it just about perhaps people getting that refresh as you mentioned that even though price is still relatively high versus say getting a Microsoft PC? DAN HOWLEY: Yeah, the prices are very high compared to getting a Windows PC although, you know, all things being equal between the capabilities of one and the capabilities of the other, the prices are relatively equal. They just don't sell the entry level devices that you would get from a Windows PC. But we were talking-- you mentioned earlier the Vision Pro headset, and, you know, I think the question is, where is that going to fit in Apple's business segments, right? Is that going to be part of the computer segment? They do call it a spatial computer, not a headset. They refuse to call it a headset. So will it be part of the Mac segment? Will it be part of the wearables segment? It could give a boon to the Mac segment if it slots in there because it is a computer. Likely, it'll be in the wearables because you're going to wear it on your face, and, you know, I think for Apple at first, it's not going to be a volume seller that's basically just known now. $3,500 is going to be expensive. So I think when it does hit, it's going to make a splash. It's not going to be in a lot of people's houses, though. RACHELLE AKUFFO: True that it does seem to be more so for the early adopter who's going to take this on, but I mean, you never know. I mean, that price tag though. But I mean, yeah. I mean, you never know. I might be open to it. I might. Dan Howley, always great to get your take on all things tech. Thank you so much. Related Quotes "
}