{
    "title": null,
    "date": "1/1/2024",
    "url": "https://seekingalpha.com/article/4660598-apple-accept-the-gift-move-on",
    "text": " Petra Schüller/iStock via Getty Images Apple (NASDAQ:AAPL) investors don't appear to fully understand how the stock had a remarkable year disconnected from how bad the business actually performed during 2023. The tech giant went all year without growing, yet the stock ended the year trading right off all-time highs. My investment thesis remains ultra Bearish on Apple with the hope current shareholders use this gift to unload shares at a premium valuation. Source: Finviz Apple shares were up nearly 50% for the year starting 2023 just below $130. The company failed to report a single quarter of growth during the year and the tech giant has limited prospects for excessive growth in 2024 due to missing out on the generative AI demand surge. Source: Seeking Alpha The problem is that most investors think Apple rallied due to the successful ability of the tech giant to generate growing profits. Too many investors just judge the company based on the performance of the stock and appear to have completely missed the lessons from the 2000 Internet bubble and the 2021 Covid bubble. Stocks become detached from logical valuations all the time and alert investors to take advantage of these dislocations by selling the stock, otherwise, the gifts are given back. Everyone should be well aware of how Zoom (ZM) surged to over $500 on Covid demand and now trades for only $72. The market convinced a lot of people Zoom was worth over $120 billion, yet the 100%+ growth rates were clearly not sustainable and the company was hardly generating $4 billion in annual revenues. In a similar manner, Apple has seen the stock rally due to Magnificent 7 hype. The big tech stocks surged during 2023 due to AI hype for NVIDIA (NVDA) and Microsoft (MSFT) and to a lesser extent Google (GOOG). At the same time, Meta Platforms (META) completed a year of efficiency, but investors need to step back and ask what has Apple delivered to warrant a massive rally in the stock. The company has now reported 4 consecutive quarters of declining sales. The forecast is for Apple to squeak out less than 1% growth in the important holiday quarter just ended followed by barely 2% sales growth in the March quarter. Apple has the promising Vision Pro headset launching, possibly in February, soon, but the company is nowhere to be found in generative AI technology. The latest estimate has Apple delivering only 500,000 mixed-reality units for 2024 with sales in the $1.75 billion range based on a $3,500 cost. Source: Ming-Chi Kuo medium All while Apple is running into patent issues with the Apple Watch. The International Trade Commission has banned sales of the Watch due to a patent from Masimo (MASI), but the Federal Circuit court has paused the ban for now. At best, Apple appears set for a long-term software fix to avoid the dispute on most Watch models. Apple enters 2024 trading at nearly 30x FY24 EPS targets. Yet, the base case is for the tech giant to grow EPS in the 7% to 8% range in the next couple of fiscal years. Even under the best scenario, the stock should trade at ~15x forward EPS targets, or ~$99, in order for investors to generate solid total returns. The odd part of this scenario is investors have other examples when investor brand loyalty trips up investing decisions. Coca-Cola (KO) has been one of the most popular stocks to own in the last 50 years, yet the stock massively underperformed the market in the last decade per the below chart. Source: Seeking Alpha A similar theme with Apple is a stock still trading at an excessive forward PE multiple compared to the growth. The market usually isn't willing to pay more than 2x the growth rate, yet Coca-Cola currently trades at 21x 2024 EPS targets with a forecast for minimal 4% growth. An investor can probably stretch a long-term growth target in the 6% to 7% range with 2024 subdued due to potentially deflationary pressure in the sector. The key here is Coca-Cola still trading at 3x the normalized EPS growth rate and Apple falls right into that same category. Investors need to realize the growth story for Apple is now all centered on Services, which is constantly under pressure from regulators now. The tech giant doesn't have a software solution to where enterprise customers will potentially pay double the price for new AI technology like Microsoft with CoPilot. Apple Services grew 9% in FY23 to reach $85 billion and analysts are generally forecasting a rebound towards growth in the 15% range. Services are still only ~22% of the business limiting the impact on overall growth. Source: Six Colors After a period of weak growth for Services due to Covid pull forwards with people locked at home, Apple has forecasted maintaining double-digit growth. The Services sector would provide about $12 billion in additional revenues this year to reach the 15% growth rate. Apple reported $383 billion in FY23 revenues, so Services would contribute only 3% to total growth in FY24 despite the solid 15% growth rate. Investors have long not seemed to understand that Services growth is impressive, but the amount is hardly material to the overall business due to the massive $300+ billion annual revenues from the products division led by the iPhone. In essence, Apple has to produce revenue growth from other categories in order to really move the needle to warrant the current stock valuation. The company forecasts iPhone growth in the December quarter, but the Apple Watch patent issues and tough comps in iPad and Wearables, including the Watch, will lead to revenue challenges in these categories. Our dead money research going on 2 years now correctly forecasts how Apple would run into problems growing due to issues with new product development. Neither the Apple Car nor the AR/VR device has reached the market yet and the company just reported an FY with sales declining 3%. Investors were also informed the stock could make an irrational run to $200 or more. One can't always predict how influential analysts and other external factors will impact a stock. Source: Seeking Alpha/SFC With Dan Ives from Wedbush Securities gaining in popularity and pushing $250 price target on the stock despite Apple literally reporting horrible quarterly results, the stock has flown to $200 to end 2023. The stock would reach an incredible market cap of $4 trillion and the stock would trade at 35x FY25 EPS targets due to a rally based purely on multiple expansion. What ultimately matters is that Apple is only forecast to earn $6.56 per share in FY23 and a 15x P/E multiple just gets the stock to $100. Even if one goes out to the $7.12 EPS targets for FY25 and applies a 20x P/E multiple, Apple would only be worth $142, or ~$24 below where we predicted the stock would be dead money for 4 years. The key investor takeaway is that investors need to understand the gift from the stock rally in 2023. Apple could definitely rally more in 2024, but investors need to understand the current disconnect between the stock here and the results being reported by the company. At some point in the next couple of years, investors are likely to face a scenario where Apple trades below $150 and the fear is the stock falling even further. One of the worst scenarios in investing is giving up gains due to being greedy and the easy scenario is to lock in gains here and move on. If you'd like to learn more about how to best position yourself in under valued stocks mispriced by the market in 2023, consider joining Out Fox The Street. The service offers a model portfolio, daily updates, trade alerts and real-time chat. Sign up now for a risk-free 2-week trial. This article was written by Stone Fox Capital (aka Mark Holder) is a CPA with degrees in Accounting and Finance. He is also Series 65 licensed and has 30 years of investing experience, including 10 years as a portfolio manager. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. The information contained herein is for informational purposes only. Nothing in this article should be taken as a solicitation to purchase or sell securities. Before buying or selling any stock, you should do your own research and reach your own conclusion or consult a financial advisor. Investing includes risks, including loss of principal. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}