{
    "title": null,
    "date": "1/22/2024",
    "url": "https://finance.yahoo.com/news/views-polen-focus-growth-strategy-062654965.html",
    "text": "Polen Capital, an investment management company, released its “Polen Focus Growth Strategy” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. In the quarter the fund returned 14.43% (net) compared to 14.16% for the Russell 1000 Growth Index and 11.69% for the S&P 500 Index. For the full year, the fund returned 38.99% (net) compared to 42.68% and 26.29% returns for the indexes. The firm had the second-highest return in the Portfolio's 35-year history in 2023.  In addition, please check the fund’s top five holdings to know its best picks in 2023. Polen Focus Growth Strategy featured stocks such as Apple Inc. (NASDAQ:AAPL) in its Q4 2023 investor letter. Headquartered in Cupertino, California, Apple Inc. (NASDAQ:AAPL) is a multinational technology company that designs and manufactures smartphones, personal computers, tablets, wearables, and accessories. On January 19, 2024, Apple Inc. (NASDAQ:AAPL) stock closed at $191.56 per share. One-month return of Apple Inc. (NASDAQ:AAPL) was -1.05%, and its shares gained 38.94% of their value over the last 52 weeks. Apple Inc. (NASDAQ:AAPL) has a market capitalization of $2.962 trillion. Polen Focus Growth Strategy stated the following regarding Apple Inc. (NASDAQ:AAPL) in its fourth quarter 2023 investor letter: \"Apple Inc. (NASDAQ:AAPL) and NVIDIA alone drove over 1,100 basis points of the Russell 1000 Growth Index’s 42% return, so not owning them was a meaningful headwind to our relative return in 2023. While on a total attribution basis, Apple was not a top three detractor to our full-year return, given its extremely large weighting in the Index, we feel it’s worth sharing our thoughts. The company’s share price appreciated nearly 50% in a year when its revenue declined and earnings per share was relatively flat with the previous year. For 2024, consensus expectations are for low-single-digit revenue growth and only slightly faster EPS growth. These pedestrian growth rates are not surprising for a company with nearly $400 billion in annual revenue. What is more surprising is that Apple shares trade at nearly 30x forward earnings, a large premium to the market and many faster-growing, competitively advantaged businesses. While we continue to think Apple is a wonderful business, it is also a slow growing one with risks that we do not see as insignificant. Apple’s entire supply chain is based in China and much of its incremental revenue growth also comes from China, so if there is a U.S.-China issue that makes it more difficult for U.S.-based companies that have access to large amounts of local data to operate in China, Apple’s business would likely face more challenges than many others. In addition, much of Apple’s services growth and margin expansion has come from direct payments from Google to be the default search provider on iOS devices. This practice is currently the subject of a lawsuit between Google and the U.S. Justice Department. If this practice is deemed unlawful, it could take away a large and highly profitable revenue stream from Apple’s already slow growth engine. While we closely cover Apple, we continue to believe we have better investment opportunities. Apple’s current P/E is above our Portfolio’s weighted average, yet its long-term earnings growth rate is likely to be lower than even our slowest growing holding, according to our research.\" Apple Inc. (NASDAQ:AAPL) is in 10th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 134 hedge fund portfolios held Apple Inc. (NASDAQ:AAPL) at the end of third quarter which was 135 in the previous quarter. We discussed Apple Inc. (NASDAQ:AAPL) in another article and shared the list of stocks that will make you rich in 5-10 years. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: 30 Most Underrated Cities in the US 30 Best Places to Live in the World for the Weather 16 Most Profitable New Stocks Today Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}