{
    "title": "Citadel's Strategy Anyone Can Use — Probabilistic Options Strategies I",
    "date": "1/29/2024",
    "url": "https://medium.datadriveninvestor.com/citadels-strategy-anyone-can-use-probabilistic-options-strategies-i-d19b0bb17a9a",
    "text": "Sign up Sign in Sign up Sign in Ayrat Murtazin Follow DataDrivenInvestor -- 2 Listen Share Disclaimer: I do not provide investment advice and I am not a qualified licensed investment advisor. If you missed that corner near the top left of the image, let me zoom it in for you. Indeed, you’ve understood correctly. OptionsProfitCalculator.com classifies specific trades as surefire victories. Let’s delve straight into it. Select well-established companies that you favor. Determine their long-term trend, whether it’s bullish or bearish, by examining the hourly to daily timeframes. Sell options significantly out of the money that align with the identified bullish or bearish trend. Gather the premiums. Now, let’s explore the steps and illustrate how to implement this straightforward strategy. gurufinanceinsights.com Numerous factors can influence a stock’s movement, but aligning with the prevailing trend is often the most advantageous approach. The phrase “the trend is your friend” is a common adage emphasizing the importance of following market trends. Optimal stocks for this strategy are typically those with low volatility and robust, sustained trends. In the current market, technology companies appear to occupy this favorable position. However, this preference may vary depending on the market conditions, such as financials or real estate dominating in previous markets. A brief analysis can help identify companies with upward momentum, and if you perceive it as a strong buying opportunity, why not capitalize on it by collecting premiums from those who may hold a contrary view? In this illustration, I’ve selected the widely favored stock, $AAPL. The chart below depicts Apple’s stock performance in 2023. Undoubtedly, Apple has experienced an impressive surge, driven in part by the AI boom and its recent forays into Apple finance programs. However, there are indications that this upward trend might encounter some deceleration. The strength of the trend is clearly evident, as depicted by the prominent vertical and horizontal lines on the screen, which will be elucidated shortly. It’s crucial to emphasize that our objective is not solely to track the stock’s trend but rather to align it with the broader market trend. Although SPY’s ascent this year may not have been as meteoric as that of AAPL, it’s crucial to recognize that the overall market is also in an upward trend. This reinforces our hypothesis that the positive trend observed in AAPL is likely to persist. Having identified our potential high-performer, let’s delve into our Options (pun intended). Since we anticipate Apple’s continued ascent, our strategy involves selling puts, a bullish approach. The vertical and horizontal lines featured in our initial AAPL chart signify the expiration date and strike of our contract. Typically, I opt for options with an expiration period ranging from approximately 2 weeks to 1 month, providing ample time for position management and an extended view of the stock. Here are the options for AAPL expiring on July 28th, as of July 1st. Our aim is to sell out-of-the-money puts since they are more prone to expiring out of the money. On the mentioned website, we continue to choose increasingly out-of-the-money options to sell and assess the probability of profits until we reach the remarkable 100% probability of profit. For $AAPL, this occurs with a put expiring at the end of the month with a strike of $165. Now, let’s revisit this. Isn’t it perfect? It’s crucial to acknowledge that the market is unpredictable, and trend reversals can be risky, making us cautious about black swan events or general selloffs. However, in most scenarios, statistically, it’s unlikely that $AAPL will experience a significant decline. The profit and loss (P/L) chart illustrates the profit and loss at each day as the sold contract expires. Since options lose value over time due to theta, selling them generates income automatically, assuming the option hasn’t moved too far in a specific direct As long as AAPL hasn’t declined by -17.64% by the day of expiry, we can collect the premium. Additionally, even if AAPL is up just 3% in 2 weeks, we can collect our full premium and close the position. Opportunities like this are prevalent in the market, and we just need to be vigilant. It’s essential to monitor this position and set stop losses to safeguard your position in case $AAPL experiences an unprecedented decline. By adopting this approach, you can collect premiums across various stocks. While there are undoubtedly better opportunities than $AAPL, it serves as a good example to begin with. You can save up to 100% on a Tradingview subscription with my refer-a-friend link. When you get there, click on the Tradingview icon on the top-left of the page to get to the free plan if that’s what you want. ➡️Subscribe Me here ➡️ https://medium.com/@aamurtazin/subscribe I’ve got a lot to share in my upcoming blogs. -- -- 2 DataDrivenInvestor DS & Finance Explorer, My Newsletter - gurufinanceinsights.com For Inquires: aamurtazin@edu.hse.ru Help Status About Careers Blog Privacy Terms Text to speech Teams "
}