{
    "title": null,
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/expect-future-earnings-growth-apple-104743921.html",
    "text": "Tsai Capital Corporation, an investment management firm, released its fourth quarter 2023 investor letter. A copy of the same can be downloaded here. For the year ended December 31, 2023, the Tsai Capital Growth Equity Strategy gained 56.81%, gross of fees, and 55.07%, net of fees, as compared with a total return of 26.29% for the S&P 500 Index. Since its inception 24 years ago, the strategy gained 691%, before fees, and 472%, after fees, compared to a 401% total return for the index. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023. Tsai Capital Corporation featured stocks such as Apple Inc. (NASDAQ:AAPL) in its Q4 2023 investor letter. Headquartered in Cupertino, California, Apple Inc. (NASDAQ:AAPL) is a multinational technology company that designs and manufactures smartphones, personal computers, tablets, wearables, and accessories. On January 12, 2024, Apple Inc. (NASDAQ:AAPL) stock closed at $185.92 per share. One-month return of Apple Inc. (NASDAQ:AAPL) was -5.90%, and its shares gained 37.96% of their value over the last 52 weeks. Apple Inc. (NASDAQ:AAPL) has a market capitalization of $2.875 trillion. Tsai Capital Corporation stated the following regarding Apple Inc. (NASDAQ:AAPL) in its fourth quarter 2023 investor letter: \"Apple Inc. (NASDAQ:AAPL) ($192.53 – up 49.0% for the year. Recent high $199.62): Our investment in Apple dates back to 2018, the same year the company launched the revamped 13 and 15-inch MacBook pro models. Led by Tim Cook, Apple continues to innovate, but our research shows that the company only needs one revolutionary product from time to time in order to keep revenue on an upward path. That’s because Apple has arguably created the strongest brand and ecosystem in the world. With more than 2 billion active devices in the company’s growing installed base, and with an extremely “sticky” ecosystem, Apple has been able to capture an increasing share of wallet over time. Indeed, during the company most recent fiscal year (September 2023), Apple’s high-margin services division represented approximately 35.7% of total gross profits, up from 31.2% just two years ago. Apple’s balance sheet is stellar, with approximately $66.8 billion of net cash and marketable securities. We expect earnings per share to continue to advance, aided not only by revenue and net income growth, but also by margin improvement and share repurchases at a rate of approximately 2-3% per year.\" Apple Inc. (NASDAQ:AAPL) is in 10th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 134 hedge fund portfolios held Apple Inc. (NASDAQ:AAPL) at the end of third quarter which was 135 in the previous quarter. We discussed Apple Inc. (NASDAQ:AAPL) in another article and shared the list of most widely held stocks by individuals. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: 13 Most Advanced Countries in Agriculture Technology Jim Cramer’s 2024 Predictions and His Top 11 Stock Picks 10 Best AI Stocks for 2024 Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}