{
    "title": "Why Apple faces its biggest crisis since it was saved by the iPod",
    "date": "1/9/2024",
    "url": "https://www.telegraph.co.uk/business/2024/01/09/why-apple-faces-biggest-crisis-more-than-two-decades/",
    "text": "Investors are increasingly jittery as company's share price slides and sales fall Tim Cook did not hold back. “This is obviously a disaster,” he told finance executives in a 2018 email, ordering his lieutenants to improve underwhelming sales of Apple’s latest iPhones. Apple’s business in China was sliding, leading to the company’s first profit warning in 16 years. One executive described the performance as “an extreme problem”, while another said employees needed to respond as if it was a “five alarm fire”, according to emails recently released as part of a lawsuit against Apple. The company later reported two consecutive quarters of revenue decline, a rare dip for a business famous for reliably getting more cash out of its customers each year. At the time, blame for the poor sales was laid at the foot of Huawei, the Chinese phone giant seen as a domestic rival to the iPhone maker. “I do think upgraders consider choices [like Huawei] to be more value for money, especially if they don’t see major reasons and new innovation in the iPhone,” wrote Apple’s head of marketing for China. Ultimately, Huawei did not kill Apple’s business in China. US sanctions effectively crippled Huawei’s ability to make high-end handsets, handing an advantage to the iPhone maker in the process. Despite fraying relations between Beijing and Washington, Apple went on to post record sales in the Middle Kingdom. But Cook may have simply delayed the reckoning. Wall Street has recently sounded a new alarm on Apple’s business in China, sending the company’s shares sliding. It is just one of a number of significant issues facing the world’s biggest company. In November, the company revealed revenues had fallen year-on-year for four consecutive quarters, the longest slump for more than two decades. Some analysts believe Apple could deliver a fifth quarter of decline when it reports Christmas sales in the coming weeks. This would mark its longest losing streak since 1998, the year after Steve Jobs returned to save the company from near-bankruptcy. Nobody is suggesting that Apple or Cook are in similar trouble. The company became the first business to hit a $3 trillion (£2.4 trillion) valuation last year and shares hit a new all-time high just last month. The company has captured more than two thirds of the high-end segment of the smartphone market – the only part that is reliably profitable – and made profits of $97bn in its last financial year: roughly $11m in an hour. Cook has also defied repeated predictions of “peak Apple” to continue to swell the company’s coffers, even as each annual iPhone release becomes harder to distinguish from the previous year’s. But investors are increasingly jittery. Since its peak in December, Apple’s share price has declined by 8.5pc – a drop worth $260bn in market value terms. The company is now facing a series of challenges that together, represent perhaps the most complex in Cook’s tenure. On Monday, analysts at Jefferies said iPhone sales in China were likely to fall by double digits this year. Supply chain sources suggest shipments are currently falling at a rate of 30pc, analysts at the investment bank said. It follows gloomy downgrades from both Barclays and Piper Sandler last week. A darkening economic picture in China is partly to blame but Apple is once again being challenged by a resurgent Huawei, which has overcome US sanctions with a homegrown smartphone processor. The high specifications of its new Mate 60 phone have led to huge demand within its home market. Some government officials have also been told to stop using iPhones and other foreign made devices, according to local reports. Huawei is slowly eating into Apple’s sales at the top of the market in China as it rebuilds its smartphone business, according to analysts at Counterpoint Research. The Chinese company’s market share of phones priced above $600 rose from 3pc to 5pc last year, while Apple’s fell from 75pc to 71pc – a significant shift in what is a largely calcified market. Ben Wood, a longtime Apple watcher at analyst firm CCS Insight, says smartphones are “approaching washing machine territory”, meaning they are generally only replaced when they are broken. “Part of Apple’s pain is sales are slowing because people are keeping their devices for longer,” he says. This is a concern because the iPhone still accounts for most of Apple’s revenue. Yet it is not smartphone sales in China that are Cook’s only headache. In the run-up to Christmas, the company was forced to suspend most sales of its Apple Watch in the US after a legal victory from a medical device company accusing it of patent infringement. Apple has frozen the order as it appeals the ruling, but the reprieve may only last until this Friday, when US customs authorities are set to rule on whether a proposed update addresses the complaint. The Apple Watch, which remains the most significant device launched in Cook’s more than 12 years in charge, has become a significant source of revenue if not the revolutionary product the iPhone was. There are other potential legal issues. Last week, The New York Times reported that the US Justice Department was on the cusp of filing a major anti-monopoly case against Apple, which is likely to target the tactics the company uses to safeguard the market position of the iPhone. While the company is likely to challenge any case, the encounter will be bruising at the very least and likely very time consuming. A more immediate regulatory crackdown will be felt in Europe. Later this year, new competition laws mean iPhone users will be able to bypass Apple’s highly-profitable app store when installing apps. With problems mounting, Apple is trying to focus instead on a new product that it hopes will revitalise its business. On Monday, Apple announced that its augmented reality headset, the ski goggle-esque Vision Pro, will go on sale on February 2. Cook has talked up its credentials, calling it a “new type of computer”. Yet the launch will be a significant test of Apple’s selling power and its innovation credentials. At $3,499, both production and sales of the devices are likely to be limited. Other companies have also failed to make high-tech headsets stick. Meanwhile, as Apple debuts its metaverse tech, the world is shifting its attention to a shinier innovation: artificial intelligence. On this topic, Apple has had less to say. The company rarely raves about AI itself, preferring to talk about how machine learning is improving existing technology like Autocorrect or the iPhone camera. This has led to perceptions that the company is losing ground, an idea not helped by the constant frustrations of users with the iPhone’s AI assistant Siri. Apple reportedly plans to overhaul Siri with a new system closer to ChatGPT later this year, and is in talks with news publishers about licensing their content for the launch. Still, it faces questions about whether its pro-privacy credentials will deter it from collecting the vast amounts of data typically used to train AI systems. Apple has had long sales slumps in the past, yet it has always been saved by breakthrough new products: 1998’s iMac and 2001’s iPod. As the clouds draw in once more, Apple’s new ideas have a lot to live up to. "
}