{
    "title": "Vision Pro tidbits: The visionOS virtual keyboard, Apple Card financing, \nmore",
    "date": "1/14/2024",
    "url": "https://9to5mac.com/2024/01/14/vision-pro-keyboard-apple-card-and-more/",
    "text": "Ahead of Apple Vision Pro pre-orders beginning in just a few days, more details have emerged about what to expect. Bloomberg’s Mark Gurman has shared new information on the M2 chip inside Vision Pro, the virtual keyboard for visionOS, and more. The visionOS virtual keyboard Alongside the Vision Pro’s announcement at WWDC 2023, Apple showed of a floating in-air keyboard for Vision Pro. According to Apple, this in-air keyboard even includes feedback via spatial sound effects. In a post on social media, however, Gurman described this virtual keyboard on Vision Pro as a “complete write-off” in visionOS 1.0. He suggests that most people will want a Bluetooth keyboard instead. “The Vision Pro virtual keyboard is a complete write-off at least in 1.0. You have to poke each key one finger at a time like you did before you learned how to type. There is no magical in-air typing. You can also look at a character and pinch. You’ll want a Bluetooth keyboard.” Vision Pro’s M2 chip The Vision Pro is powered by an M2 chip paired with Apple’s first R1 chip, which processes all the cameras and sensor inputs in real time. Apple itself, however, hasn’t shared any additional details on the specifications of these chips. The base model M2 features 8 GPU cores and 8 CPU cores, but Vision Pro will apparently use a higher-end version of the chip. Gurman says that he’s “hearing the M2 chip in the Vision Pro is the higher-end variant with 10 GPU cores and 8 CPU cores.” Apple Card Monthly Installments If you’re buying Vision Pro but don’t want to shell out the $3,500 upfront, Gurman says that Apple Card Monthly Installments will indeed be an option. Apple Card Monthly Installments give users the option to spread a purchase out into equal monthly payments with no interest. There aren’t any details on how long the payment plan for Vision Pro will be. Currently, iPhone purchases can be divided into 24 monthly payments. Payment plans for Macs, iPads, Apple Watches, and other devices are divided into 12 monthly payments. Apple hasn’t yet updated its Apple Card Monthly Installments support webpage to acknowledge the existence of Vision Pro. Follow Chance: Threads, Twitter, Instagram, and Mastodon. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Chance is an editor for the entire 9to5 network and covers the latest Apple news for 9to5Mac. Tips, questions, typos to chance@9to5mac.com "
}