{
    "title": "Apple, Amazon, Microsoft, Meta and Nvidia are part of Zacks Earnings Preview",
    "date": "2/12/2024",
    "url": "https://finance.yahoo.com/news/apple-amazon-microsoft-meta-nvidia-110000505.html",
    "text": "Chicago, IL – February 12, 2024 – Zacks.com releases the list of companies likely to issue earnings surprises. This week’s list includes Apple AAPL, Amazon AMZN, Microsoft MSFT, Meta META and Nvidia NVDA. The overall picture that has emerged from the Q4 earnings season is one of stability and resilience as a whole, with key pockets starting to enjoy notable acceleration regarding growth momentum. Earnings aren’t great, but then again, no one expected corporate profitability to be great. The earnings naysayers have been relatively less vocal in their doom-and-gloom pronouncements lately. But the fear of an impending earnings cliff has been in the back of market participants’ minds. These results have likely eased many of those fears. With quarterly results from about two-thirds of S&P 500 members already out through Friday, February 9th, here are the five key features these quarterly results have confirmed. First, the Q4 earnings and revenue growth pace represents an acceleration from what we have been seeing in recent quarters. The absolute level of Q4 earnings and revenue growth isn’t much, and the improving trend may not seem like a big deal to some of you. But we nevertheless see this improving growth trend as significant and a sign of the things to come in the coming periods. For the 338 S&P 500 members that have reported results through Friday, February 9th, total earnings and revenues are up +5.5% and +3.7% from the same period last year, respectively. Concerning the beats percentages, 80.5% of the companies have beaten EPS estimates, and 65% have beaten revenue estimates. Second, companies are making good progress on the margins front. The year-over-year change in net margins turned positive in 2023 Q3 after staying in negative territory for six consecutive quarters. This margins recovery is a key driver of earnings growth in the coming periods. At the sector level, Q4 net margins are above the year level for 9 of the 16 sectors, with the biggest gains at Tech, Consumer Discretionary, Retail, Industrial Products, Utilities, Finance and others. On the negative side, Q4 margins are below the year-earlier level for 7 of the 16 Zacks sectors, with the biggest declines at the Medical, Autos, Energy and Transportation sectors. Third, the Tech sector is firmly back in the growth mode now, and the trend is expected to continue going forward. For the 64.5% of Tech companies in the S&P 500 index that have reported Q4 results already, total earnings are up +21.5% on +6.4% higher revenues, with 86% beating EPS estimates and 72% beating revenue estimates. Looking at Q4 results for the sector as a whole, combining the results that have come out with estimates for the still-to-come companies, total Tech sector earnings are on track to be up +25.4% from the same period last year on +8.1% higher revenues. The sector went through a period of post-Covid adjustment in 2022 and the first half of 2023 when it became a drag on the aggregate growth picture. Please remember that Tech isn’t just any other sector, as it’s the biggest earnings contributor to the S&P 500 index. The sector is currently expected to bring in 28.5% of the index’s total earnings over the coming four-quarter period, with the second and third biggest contributors in Finance and Medical at 17.7% and 12.5%, respectively. What this means is that the Tech sector’s growth profile has a significant impact on the aggregate picture, both negative as well as positive. The Tech sector dragged down the aggregate growth picture in 2022 and the first half of 2023, now appearing ready to resume its historical positive growth role. Please note that the Tech sector is instrumental in keeping the aggregate growth picture in positive territory in Q4. Of the reported results, the +5.5% earnings growth drops to a decline of -0.7% when Technology is excluded from the results. Fourth, related to the Tech sector’s strong showing is the dominance of the so-called Magnificent 7 companies – Apple, Amazon, Google parent Alphabet, Microsoft, Meta, Nvidia and Tesla. Each of the Mag 7 companies relies on technological innovation to dominate its respective space. But strictly speaking, not all of them are in the Tech sector, as we at Zacks have Amazon as part of the Zacks Retail sector and Tesla as part of the Zacks Auto sector. Nvidia will report its Q4 results on February 21st, but the rest of the Mag 7 members have already reported results. For Q4 as a whole for the group, combining the actuals that have come out for the six group members with estimates for Nvidia, total Mag 7 earnings are expected to be up +48.7% on +14.5% higher revenues. The Mag 7 companies are expected to bring in 20% of all S&P 500 earnings in 2024 and currently account for 29.5% of the index’s total market capitalization. Please note that S&P 500 earnings growth for Q4 would be in negative territory had it not been for the heavy lifting from Mag 7: -3% vs. +5.4%. Five, the revisions trend has notably stabilized after appearing to turn substantially negative at the start of 2023 Q4. Estimates for 2024 Q1 and full-year 2024 are modestly coming down, with negative revisions from some sectors mostly getting offset by positive revisions from others. For a detailed look at the overall earnings picture, including expectations for the coming periods, please check out our weekly Earnings Trends report >>>> Q4 Earnings: Tech Sector Back in Growth Mode Since 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer. Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Meta Platforms, Inc. (META) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}