{
    "title": "Huawei gains more ground in the Chinese smartphone market with a 36.2% \nshipment increase as Apple’s shipment falls by 2%",
    "date": "2/3/2024",
    "url": "https://www.gizchina.com/2024/02/03/chinese-smartphone-market-huawei-apple-shipping/",
    "text": "IDC, an authoritative market research agency has released its latest report on the Chinese market for the fourth quarter of 2023. According to the report, Apple’s iPhone shipments in China dropped 2% in the fourth quarter of 2023, while Huawei’s shipments increased by 36.2% during the same period. This growth has positioned Huawei as the fourth-largest smartphone vendor in China. The Chinese brand now has a market share of 13.9%, up from 10.3% in the same period a year ago. The Chinese mobile phone market is the third-largest for Apple and the company takes this market seriously. However, the intensifying competition from local rivals, led by Huawei is not an easy hurdle to climb. In the global setting, Statista, Counterpoint Research, and IDC agree that Apple and Samsung are the two dominant players in the market. Apple did hold on to the top spot in terms of market share in 2023. Other major players include Xiaomi, Huawei, Oppo, and Vivo. The market is highly competitive, with companies vying for market share through aggressive trade-in offers. There are also many interest-free financing plans and competitive devices in the lower price range of the high end. The global smartphone market grew 19% YoY but declined by 7% QoQ as 323 million units were shipped, led by Samsung.  Huawei has experienced a significant resurgence in the Chinese smartphone market, following the challenges posed by U.S. sanctions. The company’s substantial growth in shipments has solidified its position as a major player in the Chinese market. Huawei’s success can be attributed to its new product launches and the increasing demand for its 5G handsets. Back in 2020, Counterpoint Research reported that Huawei was the outright leader in the Chinese smartphone market. In the first quarter of 2020, its market share that grew to 36% in Q1 2020, reaching a record high. The company also captured a massive 60% share of the 5G smartphone market and reached its highest-ever share in China, capturing 46% of sales volumes. However, over the next two years, Huawei saw a significant fall in its market performance because of the U.S. ban. Not giving up, in Q3 2023, Huawei’s China smartphone sales surged, with a 37% year-on-year increase in smartphone sales. This helped the company narrow the market share gap with top brands such as Apple. The company’s growth has been attributed to the success of its new smartphones, such as the Mate 60 Pro, which has contributed to its strong sales performance. In October 2023, Huawei and Xiaomi led a double-digit rebound in the China phone market, with Huawei improving by 83%. The growth of Huawei’s smartphone sales in China has outpaced that of Apple, with the company being the fastest-growing smartphone maker in China in the third quarter of 2023, according to Counterpoint Research. This growth has been particularly notable in the 5G smartphone segment, where Huawei has made significant strides. The decline in Apple’s smartphone shipments in China reflects the increasing competition from local players and the impact of government restrictions on the use of Apple devices. Despite offering substantial discounts, Apple faced a 2.1% decrease in its shipments in the final quarter of 2023. This decline has raised concerns about the company’s position in one of its key markets. Apple was not impressed with its financial report in Greater China. The company’s executives did not fail to openly express their dissapointment with the performance. Apple CFO, Luca Maestri said that the company is not satisfied with the decline in revenue in China. However, he affirms that the Chinese market contains long-term major opportunities. Of course, the sharp decline in revenue in Greater China is mainly due to weak iPhone sales. In this regard, Apple’s CEO, Tim Cook reiterated in an interview that it is not that the iPhone is difficult to sell. He said that the iPhone’s performance in China is still excellent but the company can achieve more. He showed confidence that Apple will bounce back from the slight decline. Cook also reiterated that iPhone occupies four of the top six sales positions in China. The decline in revenue is not due to the loss of iPhone popularity but is mainly a reflection of overall economic problems. Cook said that taking into account exchange rate factors, the overall impact of the 13% year-on-year decline in Greater China on the company will become a “mid-single digit”. Cook added: “China has always been the most competitive smartphone market in the world, and that hasn’t changed.” The Chinese mobile phone market is a dynamic and highly competitive landscape, with over 285 million smartphone shipments in 2022. Domestic brands such as Huawei, Xiaomi, Oppo, and Vivo have established strong footholds through their brand reputation, extensive distribution networks, and competitive pricing strategies. These brands are expected to continue dominating the market, especially in the mid-range and budget segments. International brands like Apple and Samsung also have a significant presence in the premium segment. The market is highly competitive, driven by evolving consumer preferences, technological advancements, and intense competition among domestic and international brands.  The smartphone market in China can be segmented based on price range, brand positioning, screen size, and camera capabilities. Chinese consumers are highly tech-savvy and place a strong emphasis on smartphones’ features, design, and value for money. The market is also influenced by factors such as localized features, ecosystem integration, and tapping into the untapped rural market. Huawei maintained its market leadership with a 45% market share in the third quarter of 2022, and the company’s 5G smartphones received positive market feedback, driving it to the top of China’s best-selling models list. Despite the challenging environment and sluggish consumer demand, Huawei and Apple were the only vendors with a positive year-on-year growth in the top 5 ranking, indicating the intense rivalry and competition in the market. IDC’s latest report on the Chinese smartphone market highlights the contrasting fortunes of Apple and Huawei in the fourth quarter of 2023. While Apple faced a 2% decline in iPhone shipments, Huawei experienced a remarkable 36.2% growth, solidifying its position as a major player with a 13.9% market share. Huawei’s resurgence, fueled by new product launches and increasing demand for its 5G handsets, underscores its resilience despite past challenges. The dynamics of the Chinese mobile phone market continue to evolve, with intense competition among domestic and international brands. Domestic players like Huawei, Xiaomi, Oppo, and Vivo dominate through brand reputation and competitive pricing, while Apple and Samsung maintain a presence in the premium segment. The market’s competitiveness reflects consumers’ emphasis on features, design, and value for money, driving innovation and adaptation among manufacturers. For Apple, the decline in smartphone shipments in China signals the need to navigate the competitive landscape and address evolving consumer preferences. Despite challenges, Tim Cook’s optimism about the long-term opportunities in China underscores Apple’s commitment to the market. As Huawei’s growth reshapes the competitive landscape, both domestic and international players must innovate and adapt to capture opportunities in this dynamic market. Efe Udin is a seasoned tech writer with over seven years of experience. He covers a wide range of topics in the tech industry from industry politics to mobile phone performance. From mobile phones to tablets, Efe has also kept a keen eye on the latest advancements and trends. He provides insightful analysis and reviews to inform and educate readers. Efe is very passionate about tech and covers interesting stories as well as offers solutions where possible. Efe Udin, a government tech policy expert is a seasoned tech writer with over seven years of tech writing experience. Efe's true passion lies in exploring the intersection of technology, politics, and brand feuds.\n\r\nWith an astute understanding of the power dynamics and competitive landscape within the tech world, Efe delves into the intricacies of how technology influences political discourse and how brand rivalries shape the industry.     GizChina Follow @gizchina  Accredited technology blog dedicated to providing breaking news, expert reviews and original content related to mobile tech and EV industry, smartphones, gadgets and IoT. Keep up to date with the latest Android phone news and reviews on our social media channels: "
}