{
    "title": "Europe could fine Apple €500 million over anticompetitive music streaming \npractices",
    "date": "2/19/2024",
    "url": "https://www.techspot.com/news/101941-europe-could-fine-apple-500-million-over-anticompetitive.html",
    "text": "A hot potato: In 2019, Spotify filed a complaint with the European Union, alleging that Apple was stifling competition in the music streaming industry through its App Store payment policies. After five years, Brussels appears poised to take action against Cupertino for violating EU antitrust laws. According to unnamed sources cited in a recent Financial Times report, the European Union is set to announce a €500 million fine (approximately $539 million) against Apple for its alleged anticompetitive practices. This penalty, marking the first-ever fine imposed by Europe on Cupertino, is expected to be made public early next month, as per the sources. The fine is a result of the European Commission's antitrust investigation into Apple's conduct in the streaming market. Over the past five years, EU investigators scrutinized contractual restrictions imposed by Apple on app developers. The restrictions prevented third-party companies from informing customers about potentially cheaper alternatives to Apple Music, a practice that Spotify denounced in 2019. Apple eventually modified this policy in 2022 under regulatory pressure from Japan. The report from Financial Times asserts that Apple's actions contravene Europe's competition laws, leading to the substantial fine. Cupertino will be required to alter its business practices in the EU, allowing third-party apps to offer competitive prices outside the App Store on iOS devices.  In 2023, the European Commission issued a preliminary Statement of Objections to Apple, accusing the company of abusing its dominant position. The Commission suggested that Cupertino could face a fine of up to 10 percent of its annual worldwide turnover, but the final ruling was still pending. A €500 million penalty, compared to a potential $40 billion fine, seems a more favorable outcome for Apple. However, it's worth noting that last year, the company urged Brussels authorities to drop the case entirely. Both Apple and European representatives are refraining from commenting on the recent Financial Times rumors, while Spotify continues to criticize Apple's alleged predatory business practices. Cupertino has recently announced adjustments to its App Store policies to comply with the EU's Digital Markets Act (DMA). Spotify CEO Daniel Ek characterized the new policies as \"extortion,\" as Apple is now proposing a new fee for each individual download, along with a 17 percent \"rent\" for apps to be featured in the App Store. According to Ek, these conditions would render Spotify's business, serving 100 million users in Europe, \"untenable.\" TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}