{
    "title": "Next-Gen A18 Chip For iPhone 16 To Feature Significantly Improved Neural \nEngine To Handle iOS 18’s Generative AI Features",
    "date": "2/15/2024",
    "url": "https://wccftech.com/iphone-16-to-launch-with-upgraded-neural-engine-for-better-generative-ai-performance-on-ios-18/",
    "text": "It was previously reported that Apple is planning to introduce AI-related features with the launch of iOS 18 and the iPhone 16 lineup. The company is currently working on various AI tools, which could debut at the WWDC 2024 event in June. Prominent analyst Jeff Pu also stated that the iPhone 16 would be the company's first device to boast AI features coupled with iOS 18. It is now rumored that the iPhone 16 lineup will feature a significantly upgraded Neural Engine for generative AI features coming with iOS 18. According to the Economic Daily News, Apple's upcoming A18 and M4 chips for the iPhone and Mac will feature significantly upgraded Neural Engine performance with additional cores. A Neural Engine with more cores has various benefits, as it allows faster AI and machine learning tasks. The hardware upgrade would prove to be beneficial with iOS 18's upcoming generative AI features. We have previously reported how the company is introducing breakthroughs in developing its custom generative AI models. The company is working on a wide range of tools, such as Keyframer, which allows users to animate images based on user commands. Earlier this month, we also covered Apple's breakthrough in generative AI technology that can edit and manipulate images based on natural language commands. If Apple is planning to bring these additions to the iPhone 16 lineup later this year, the upgraded Neural Engine could allow for better on-device processing. Apple is also planning to upgrade its digital assistant, which currently lags behind Google Assistant. With generative AI technology onboard, Siri will be able to understand the context for queries with upgraded information. Apple is expected to launch an A18 chip later this year with the iPhone 16 models. We have also previously heard that the generative AI features will only be available on the iPhone 16 models, potentially due to the new chip. Apple offered the 16-core Neural Engine with the launch of the iPhone 12 models, and the same core count was brought forward to the iPhone 15 models. However, the company improved the performance of the Neural Engine with its latest iPhones, offering 2x faster performance on the A17 Pro chip compared to the A16 Bionic. Apple is also planning to improve the performance of the Neural Engine on Macs with forthcoming M4 chips. While most Macs still feature a 16-core Neural Engine, the Mac Studio and Mac Pro have a 32-core Neural Engine with the M1 Ultra and M2 Ultra chips. It remains to be seen how the company will integrate generative AI technology in this year's iPhone 16 models. We will share more details on the subject, so be sure to stick around. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}