{
    "title": "This 1 Number Points to Apple's Next Growth Driver",
    "date": "2/16/2024",
    "url": "https://www.fool.com/investing/2024/02/16/this-1-number-points-to-apples-next-growth-driver/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Apple (AAPL -1.06%) reached fame worldwide for one big reason: the excellence of its products. From the iPhone to the Mac and much more, the technology and consumer goods giant has built an empire, bringing in billions of dollars in earnings every year. In fact, earnings per share in the most recent quarter climbed 16% to a record high. But Apple isn't only about products. The company also has quite a services business, selling users of its devices a variety of subscriptions, including cloud storage and digital content. And this business has been reporting new all-time high revenues quarter after quarter in recent times as more and more devices are sold and more and more customers sign up for all Apple has to offer them. This momentum on its own is great news, but one particular number makes it even better -- and suggests services could become Apple's next big growth driver. Image source: Getty Images. Apple's latest earnings report -- the fiscal 2024 first quarter -- is a great place to start. Of course, the market giant still generates most of its revenue from the sale of its products. In the quarter, they brought in $96 billion, while services earned the company $23 billion. And this brings us to the number that suggests services, even though they generate much less in revenue today, will become Apple's next growth driver. The number is cost of sales, or the amount it costs Apple to create and sell its offerings. Apple's cost of sales for products in the quarter totaled more than $58 billion, compared to a cost of sales of a little over $6 billion for services -- meaning selling services is a lot cheaper for Apple than selling products. We can consider the picture from a different angle to confirm my point, and that's by taking a look at gross margin. Apple's gross margin for products in the recent quarter was 37% compared to a 70% gross margin for services. So all of this means services are more profitable for the company than products -- not surprising, considering the creation, manufacturing, and transport expenses involved in selling a technology product. But why does the services business represent such an opportunity for Apple right now? Well, the answer starts with Apple's growth over the years, putting its devices in more hands worldwide. In fact, Apple recently outpaced Samsung to take the biggest share of the global smartphone market. Apple's iPhone now holds more than 24% of the market compared with Samsung's 16%, according to market research firm IDC. The growth in iPhones and other products equals additional potential customers for Apple's services. The company said recently that its number of installed devices has surpassed 2.2 billion worldwide, so it's no wonder Apple's seeing record revenue across services, from cloud storage to payment services. What's also great about services revenue is that it is recurrent, meaning the purchase of an iPhone or a Mac doesn't stop there -- but continues as the customer signs up for various services that will enrich their experience on the particular device. So, what does this mean for you as an investor? Apple's revenue isn't soaring in the double or triple digits like certain younger growth companies, but this doesn't mean the company's growth story is over. Far from it. The services business could be an extremely valuable one for Apple because it represents recurrent revenue from customers -- and considering Apple's customers generally keep coming back and the company continues to win over new ones too, services revenue should rise over time. Even better, as we've seen by looking at cost of sales, Apple doesn't have to invest much to offer these services -- making them very profitable for the company. All of this means Apple is a great stock to buy and hold, as its services business has what it takes to boost earnings and share performance over time. Adria Cimino has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}