{
    "title": "Apple explored smart ring and glasses, report says",
    "date": "2/25/2024",
    "url": "https://www.businessinsider.com/apple-smart-ring-glasses-exploration-report-2024-2",
    "text": "       Apple has considered a couple of new ideas for future wearables alongside ways to further advance its existing AirPods, according to a new report. The company has discussed making a smart ring, though it's not actively working on the product, Bloomberg reported. It's also exploring whether it should make smart glasses and put tiny cameras onto AirPods that could bring AI benefits, the report said. For those closely watching Apple's potential product pipeline, there's been public evidence the company has at least pondered what its approach could be to a ring or glasses. Apple has issued a number of patents for smart glasses and smart rings in the past dating back at least 10 years. Previous patented ring designs from Apple show illustrations of a ring with a mounted touchscreen, computer processor, wireless transceiver, and rechargeable power source, similar to a smaller Apple Watch, BI previously reported. Of course, filing a patent doesn't mean the company will end up making a device. Apple has also had early discussions about creating smart glasses as a possible alternative to AirPods, the report said. Related stories Now, the idea of smart glasses from Apple is in an \"exploratory phase\" known as \"technology investigation\" by the company's hardware engineers, according to the Bloomberg report published Sunday. The company would face some competition if it were to move forward with either idea. Mark Zuckerberg has recently said that Meta's Ray-Ban smart glasses are selling better than expected, thanks in part to their AI features. Meta's glasses can record and live stream video, interact with the company's AI agent, and play music. Meanwhile, Apple is also examining ways to further innovate AirPods, one of its most popular wearables. The company is testing out putting low-resolution cameras onto earbuds that are around the same size as current AirPods in a project codenamed B798, according to Bloomberg. In theory, AI could use footage from the cameras to help people keep track of their daily activities and optimize their daily routines, the report said. Apple did not immediately return Business Insider's request for comment on Sunday ahead of publication. And even though the smart ring isn't currently in the works, some employees at Apple are apparently still into the idea as a budget-friendly way to get people tracking their health and fitness if they don't wear an Apple Watch, the report said. A smart ring would also be a competitor for Oura, and newcomer Samsung's upcoming Galaxy smart ring that it plans to release later this year, which is designed to keep track of health metrics. The company teased the ring in a splashy video presentation last month, but information about what it can do is still scarce. Read next Jump to "
}