{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.businessinsider.in/tech/news/it-sounds-like-the-vision-pro-4-will-be-worth-waiting-for/articleshow/107639127.cms",
    "text": "Liked the article? Share it with your friends... or copy link Apple has blown people away with its new Vision Pro headset — but some feel that there's much more to do. In fact, some team members within Apple's Vision Products Group — the division responsible for developing the headset — said it could take four generations before the device reaches its \"ideal form,\" reported Bloomberg's Marc Gurman. That's certainly been the trajectory of Apple products like the iPhone and Apple Watch, which have gone through countless iterations since their introductions. Gurman, in his review, wrote that \"today's Vision Pro is more of a preview of the future than the future itself,\" pointing out its unwieldy weight and short battery life. He was also critical of the device's operating system, saying that the software is \"about a year away\" from feeling developed enough for everyday use. \"For all its strengths, the visionOS operating system suffers from more bugginess than you'd typically expect from an Apple product, even a first-generation one,\" he added. Nevertheless, the tech industry is still buzzing about Apple's latest release, which has drawn praise from figures like Sam Altman, OpenAI CEO and creator of ChatGPT. In a post on X, formerly Twitter, Altman called the headset the \"second most impressive\" technology since the iPhone was released in 2007. Wedbush Securities, a financial advisory firm, said it expects the next version of the device (the \"Vision Pro 2\") to have a \"much lower\" price point — potentially below $2,000, according to a company report last week. Future generations of the Vision Pro, the firm said, may resemble sunglasses and have a \"much broader reach/functionality for Apple users down the road.\" \"While many on the Street are dismissing Vision Pro as noise, we strongly disagree,\" the firm said. Business Insider's Jordan Hart also called the Vision Pro a \"promising\" technology, though she noted the relatively meager offerings on the device's App Store. \"I was disappointed that my searches didn't yield many results,\" she said. She noted, though, that companies like YouTube may kick off a race to develop dedicated apps for the Vision Pro — not unlike the iPhone in 2007. Advertisement "
}