{
    "title": "Apple Sports: Tech Giant Launches Data-Focused iPhone App for Fans",
    "date": "2/21/2024",
    "url": "https://www.hollywoodreporter.com/business/digital/apple-sports-app-live-scores-betting-odds-1235830646/",
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter The new Apple Sports app launches today, and will focus on real-time scores, betting odds and data, while also directing users to the Apple TV app to watch live games. By \n\n\tAlex Weprin Media & Business Writer The tech giant Apple is seeking a bigger piece of the live sports market, leaning into the iPhone’s status as the primary second screen to launch a new app dedicated to real-time sports data. Called Apple Sports, the free app launches today in the U.S., U.K. and Canada and is focused on live scores, as well as other data around the games. Notably, that also includes real-time betting odds, though users will be able to turn those off at any time. At launch Apple Sports will have scores and stats from the NBA, NHL, MLS, NCAA basketball, Premier League, LaLiga, Serie A, Bundesliga and LigaMX, though the company notes that other leagues will be up and running by the time their seasons begin, including MLB, the NFL as well as NCAA football.\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tBusiness\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tAs DOJ Takes on Apple, Netflix and Spotify Could Stand to Benefit\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tLifestyle\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tThe Best Deals on Apple AirPods Are at Amazon Right Now -- At Prices That Rival Black Friday Users will be able to select their favorite leagues and teams for a more personalized experience. The new app is a significant expansion of Apple’s interest in the sports space. it already has a dedicated section within the Apple News app, and Apple TV+ is the exclusive streaming home of MLS, as well as Friday night MLB games. And Apple also sees sports as an obvious use case for its Vision Pro device, with CEO Tim Cook telling The Hollywood Reporter earlier this month that he had “seen several demos of the output of different games, and it’s just mind blowing, it’s so much different.“ “It’s hard to go back to the 2-D world after you’ve been in the 3-D world, you just don’t want to do it,” Cook added. The new app, however, is clearly meant as a companion to that viewing, with a dedicated app allowing for the real-time data needed for live stats, odds and scores. For sports fans who aren’t near a TV (or are, and are watching something else and want to check in on another game in progress), the Apple Sports app is meant to be an easy — and most importantly fast — way to do so. It will also work with other iPhone features like live widgets. The app will also have a clearly visible button letting users click to watch the game being played on their iPhones. In the case of MLS or MLB, that will switch over to Apple TV+, for other sports, it will bring the user to the Apple TV app, where games from some of Apple’s content partners that stream live games (most likely via a subscription) will be easily accessible. “We created Apple Sports to give sports fans what they want — an app that delivers incredibly fast access to scores and stats,” said Eddy Cue, Apple’s senior VP of Services, in a statement. “Apple Sports is available for free in the App Store, and makes it easy for users to stay up to date with their favorite teams and leagues.” Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. "
}