{
    "title": "Shares of the iPhone maker soar amid the AI frenzy, setting a record high.",
    "date": "3/27/2024",
    "url": "https://www.cryptopolitan.com/shares-iphone-maker-soar-amid-ai-frenzy/",
    "text": "Amid an intense AI frenzy, shares of Hon Hai Precision Industry Co.—also referred to as the iPhone Maker because of its affiliation with Apple Inc.—have reached previously unheard-of heights. Hon Hai’s stock surged 5.1% to NT$156 despite persistent worries about the slow recovery of the smartphone industry. The company’s strong quarterly profitability and optimistic demand estimates for its AI servers were the main drivers of this price increase. Following a global preoccupation with artificial intelligence, Hon Hai Precision Industry Co., the well-known creator of iPhones, has seen an incredible surge in its stock price, breaking a historic high. Hon Hai’s stock increased 5.1% to NT$156 on Thursday, indicating remarkable investor optimism in face of growing worries over the sluggish recovery of the smartphone market. The company’s outstanding quarterly performance, which raised expectations for the market for its AI servers, preceded this amazing rise. Notwithstanding the obstacles presented by the smartphone market, investors maintain a positive outlook regarding the industry’s rapid expansion because of the attraction of artificial intelligence (AI), which has produced substantial profits for corporations such as Nvidia Corp.  JPMorgan Chase & Co. analysts predict that by 2025, Hon Hai’s revenue from AI servers would account for 18% of total revenue, driven mostly by the growing percentage of Nvidia shipments. Despite concerns about Hon Hai’s higher exposure to AI than its competitors—its AI income is predicted to be between 10% and 12% this year—hope remains strong because of the optimistic sentiments that reputable financial institutions have conveyed. Analysts’ bullish assessment of Hon Hai Precision Industry Co. holds steady despite growing concerns about the excesses of the market. Esteemed financial institutions such as Morgan Stanley, Citigroup Inc., and Goldman Sachs Group Inc. have all increased their price projections for the shares, indicating their conviction in the trajectory the firm is following. The goal has been raised by JPMorgan analysts by a substantial 21% to NT$170, indicating their unwavering optimism over Hon Hai’s future prospects. Given that Hon Hai expects strong earnings growth in the future and that ramp-ups in AI servers and electric cars (EVs) are expected to be key drivers for the firm in 2024, Goldman analysts, including Allen Chang, highlight the attractiveness of the company’s pricing. Surprisingly, Goldman Sachs is still aiming for NT$172, which is the highest estimate among industry peers, indicating that industry peers are generally optimistic about Hon Hai’s future. Investors are wondering if Hon Hai Precision Industry Co.’s incredible growth can continue as the company enjoys the spotlight of its soaring stock performance amid the AI mania. Is there more artificial intelligence mania ahead for Hon Hai, or are we about to see a fall in the market due to growing worries about overvaluation? The full story of the iPhone Maker’s incredible journey in the face of AI technology’s continuous pull will only become clear with time. Disclaimer. The information provided is not trading advice. Cryptopolitan.com holds no liability for any investments made based on the information provided on this page. We strongly recommend independent research and/or consultation with a qualified professional before making any investment decisions. Amir is a media, marketing and content professional working in the digital industry. A veteran in content production Amir is now an enthusiastic cryptocurrency proponent, analyst and writer. Discover our daily newsletter, empowering investors with market insights. Your gateaway into the world of Web3 Copyright 2024 Cryptopolitan "
}