{
    "title": "Apple, Microsoft interested to invest in Indonesia, says comms and \ninformatics minister",
    "date": "3/24/2024",
    "url": "https://www.marketing-interactive.com/microsoft-apple-invest-indonesia",
    "text": "published author share on Tech giants Microsoft and Apple are interested in investing in Indonesia, deputy minister of communications and informatics Nezar Patria reportedly said. At a public discussion in Jakarta last Friday, Patria reportedly said that Satya Nadella, CEO of Microsoft and Tim Cook, CEO of Apple sought to meet President Joko Widodo. Don't miss: Apple to appeal US$2bn fine ruled by EU following Spotify's complaint The collaboration will reportedly develop Indonesia's human resources and manufacturing sectors, as well as open up greater opportunities for the country and its people. In addition, the deputy minister reportedly said that such collaborations with the two tech giants would bolster Indonesia's efforts to develop its digital talent capacity and competency. This comes after Budi Arie Setiadi, minister of communications and informatics, revealed that Cook will be visiting Indonesia on 20 April this year. Cook's upcoming visit will be to review Apple Academy, Apple's official program to develop talents in the IT field, reported Kompas. In addition to Cook's visit, Budi reportedly revealed that Nadella will be visiting the country in mid-April. Nadella's visit, Budi reportedly said, will be to discuss the transfer of technological knowledge, including artificial intelligence (AI). Partnering with other organisations is not new to Microsoft. In August last year, it partnered with eight UGC-funded universities to drive the development of AI adoption and to enable the use of generative AI. Powered by Azure OpenAI, the AI solutions will be available in the academic year 2023/2024 for professors, teachers, researchers and students across the academic, research and operational domains of the institutions. It aims at revolutionising the teaching and learning model, as well as equipping students with the necessary skills to utilise AI in their academic and professional careers. MARKETING-INTERACTIVE has reached out to Apple and Microsoft for more information. Join us this coming 24 - 25 April for #Content360, a two-day extravaganza centered around four core thematic pillars: Explore with AI; Insight-powered strategies; Content as an experience; and Embrace the future. Immerse yourself in learning to curate content with creativity, critical thinking, and confidence with us at Content360! Related articles:  Apple overhauls iOS, App Store and Safari in the EU following new laws  PETRONAS Digital inks MOU with Microsoft and Cegal to boost AI and computing offerings MY looks to attract Microsoft and Google as it works towards becoming a data hub share on We break down the big and messy topics of the day so you're updated on the most important developments in Asia's marketing development – for free. MARKETING-INTERACTIVE is an online publication of Lighthouse Independent Media. ©  Lighthouse Independent Media. All rights reserved. Marketing Interactive is not responsible for the content of external sites. "
}