{
    "title": "Alterna Wealth Management Inc. Has $3.10 Million Stock Holdings in Apple \nInc. (NASDAQ:AAPL)",
    "date": "3/11/2024",
    "url": "https://www.defenseworld.net/2024/03/11/alterna-wealth-management-inc-has-3-10-million-stock-holdings-in-apple-inc-nasdaqaapl.html",
    "text": "Posted by Defense World Staff on Mar 11th, 2024 Alterna Wealth Management Inc. boosted its position in  Apple Inc. (NASDAQ:AAPL – Free Report) by 3.8% in the 3rd quarter, according to the company in its most recent Form 13F filing with the Securities & Exchange Commission. The fund owned 18,089 shares of the iPhone maker’s stock after buying an additional 665 shares during the quarter. Apple makes up  about  4.0% of Alterna Wealth Management Inc.’s investment portfolio, making the stock its 6th biggest holding. Alterna Wealth Management Inc.’s holdings in Apple were worth $3,097,000 at the end of the most recent reporting period. Several other hedge funds and other institutional investors have also recently bought and sold shares of the company. Robertson Stephens Wealth Management LLC boosted its stake in  Apple by 2.0% in the third quarter. Robertson Stephens Wealth Management LLC now owns 427,007 shares of the iPhone maker’s stock valued at $73,108,000 after acquiring an additional 8,332 shares during the period.  Sargent Investment Group LLC boosted its stake in  Apple by 1.1% in the third quarter. Sargent Investment Group LLC now owns 179,115 shares of the iPhone maker’s stock valued at $30,666,000 after acquiring an additional 1,919 shares during the period.  BNP PARIBAS ASSET MANAGEMENT Holding S.A. boosted its stake in  Apple by 3.2% in the third quarter. BNP PARIBAS ASSET MANAGEMENT Holding S.A. now owns 8,719,535 shares of the iPhone maker’s stock valued at $1,492,871,000 after acquiring an additional 271,955 shares during the period.  Meridian Wealth Advisors LLC boosted its stake in  Apple by 1.2% in the third quarter. Meridian Wealth Advisors LLC now owns 103,763 shares of the iPhone maker’s stock valued at $17,765,000 after acquiring an additional 1,201 shares during the period.  Finally, Alcosta Capital Management Inc. boosted its stake in  Apple by 0.3% in the third quarter. Alcosta Capital Management Inc. now owns 36,652 shares of the iPhone maker’s stock valued at $6,275,000 after acquiring an additional 112 shares during the period. 58.51% of the stock is owned by institutional investors. A number of equities analysts have commented on AAPL shares. Barclays decreased their target price on Apple from $160.00 to $158.00 and set an “underweight” rating for the company in a research note on Friday, February 2nd. Monness Crespi & Hardt boosted their price objective on Apple from $189.00 to $200.00 and gave the stock a “buy” rating in a research report on Friday, February 2nd. Redburn Atlantic downgraded Apple from a “buy” rating to a “neutral” rating and set a $200.00 price objective for the company. in a research report on Wednesday, January 10th. Bank of America upgraded Apple from a “neutral” rating to a “buy” rating and boosted their price objective for the stock from $208.00 to $225.00 in a research report on Thursday, January 18th. Finally, JPMorgan Chase & Co. reduced their price objective on Apple from $225.00 to $215.00 and set an “overweight” rating for the company in a research report on Friday, February 2nd. One investment analyst  has rated the stock with a sell rating, eleven have issued  a hold rating, twenty-one have issued  a buy rating and one  has assigned  a strong buy rating to the company’s stock. According to data from MarketBeat, the stock presently has an average rating of “Moderate Buy” and a consensus target price of $205.27. Check Out Our Latest Report on AAPL In related news, Director Arthur D. Levinson sold 100,000 shares of the company’s stock in a transaction on Thursday, February 29th. The shares were sold at an average price of $180.94, for a total value of $18,094,000.00. Following the completion of the sale, the director now directly owns 4,434,576 shares in the company, valued at $802,392,181.44. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available at the SEC website. 0.06% of the stock is currently owned by corporate insiders. Apple stock opened at $170.73 on Monday. The company’s fifty day simple moving average is $184.64 and its 200-day simple moving average is $183.62. The company has a quick ratio of 1.02, a current ratio of 1.07 and a debt-to-equity ratio of 1.28. Apple Inc. has a 12 month low of $147.61 and a 12 month high of $199.62. The stock has a market cap of $2.64 trillion, a P/E ratio of 26.59, a P/E/G ratio of 2.06 and a beta of 1.29. Apple (NASDAQ:AAPL – Get Free Report) last posted its quarterly earnings results on Thursday, February 1st. The iPhone maker reported $2.18 EPS for the quarter, beating the consensus estimate of $2.09 by $0.09. Apple had a net margin of 26.16% and a return on equity of 156.04%. The business had revenue of $119.60 billion for the quarter, compared to analysts’ expectations of $117.99 billion. During the same period in the previous year, the company posted $1.88 EPS. Apple’s revenue was up 2.1% on a year-over-year basis.  As a group, sell-side analysts forecast that  Apple Inc. will post 6.55 EPS for the current fiscal year. The business also recently declared a quarterly dividend, which was paid on Thursday, February 15th. Stockholders of record on Monday, February 12th were issued a dividend of $0.24 per share. This represents a $0.96 annualized dividend and a dividend yield of 0.56%. The ex-dividend date of this dividend  was Friday, February 9th. Apple’s dividend payout ratio  is currently 14.95%. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.    Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Qube Research & Technologies Ltd Increases Stock Position in Schwab Fundamental Emerging Markets Large Company Index ETF (NYSEARCA:FNDE) Qube Research & Technologies Ltd Has $2.25 Million Stock Position in First Trust Rising Dividend Achievers ETF (NASDAQ:RDVY) "
}