{
    "title": "Financial Engines Advisors L.L.C. Cuts Holdings in Apple Inc. (NASDAQ:AAPL)",
    "date": "3/9/2024",
    "url": "https://www.defenseworld.net/2024/03/09/financial-engines-advisors-l-l-c-cuts-holdings-in-apple-inc-nasdaqaapl.html",
    "text": "Posted by Defense World Staff on Mar 9th, 2024 Financial Engines Advisors L.L.C. trimmed its position in  Apple Inc. (NASDAQ:AAPL – Free Report) by 12.1% in the third quarter, according to its most recent filing with the SEC. The institutional investor  owned 84,595 shares of the iPhone maker’s stock after selling 11,609 shares during the period. Financial Engines Advisors L.L.C.’s holdings in Apple were worth $14,483,000 as of its most recent SEC filing. Several other institutional investors and hedge funds have also recently added to or reduced their stakes in the company. Excalibur Management Corp raised its stake in shares of  Apple by 0.5% during the 3rd quarter. Excalibur Management Corp now owns 57,104 shares of the iPhone maker’s stock worth $9,777,000 after purchasing an additional 275 shares during the period.  Garrett Wealth Advisory Group LLC raised its position in  Apple by 1.0% in the third quarter. Garrett Wealth Advisory Group LLC now owns 29,670 shares of the iPhone maker’s stock worth $5,080,000 after acquiring an additional 296 shares during the period.  Altiora Financial Group LLC boosted its stake in  Apple by 1.6% in the third quarter. Altiora Financial Group LLC now owns 4,362 shares of the iPhone maker’s stock valued at $747,000 after acquiring an additional 68 shares during the last quarter.  Kestra Advisory Services LLC grew its position in shares of  Apple by 2.5% during the 3rd quarter. Kestra Advisory Services LLC now owns 2,114,988 shares of the iPhone maker’s stock valued at $362,107,000 after acquiring an additional 52,399 shares during the period.  Finally, Bank Julius Baer & Co. Ltd Zurich increased its stake in shares of  Apple by 1.6% during the 3rd quarter. Bank Julius Baer & Co. Ltd Zurich now owns 4,179,450 shares of the iPhone maker’s stock worth $715,564,000 after purchasing an additional 67,243 shares during the last quarter. Hedge funds and other institutional investors own  58.51% of the company’s stock. Several equities analysts recently commented on the company. Oppenheimer  reiterated an “outperform” rating and issued a $200.00 price objective on shares of Apple in a research note on Friday, February 2nd. Wedbush  reiterated an “outperform” rating and set a $250.00 price target on shares of Apple in a research note on Wednesday, February 28th. Barclays decreased their price objective on Apple from $160.00 to $158.00 and set an “underweight” rating for the company in a report on Friday, February 2nd. Rosenblatt Securities  reaffirmed a “neutral” rating and set a $189.00 price objective on shares of Apple in a report on Tuesday. Finally, Needham & Company LLC  reiterated a “buy” rating and issued a $220.00 target price on shares of Apple in a research note on Friday, February 2nd. One equities research analyst  has rated the stock with a sell rating, eleven have assigned  a hold rating, twenty-one have issued  a buy rating and one  has assigned  a strong buy rating to the stock. According to data from MarketBeat, Apple presently has an average rating of “Moderate Buy” and an average target price of $205.27. Check Out Our Latest Stock Analysis on Apple In other news, Director Arthur D. Levinson sold 100,000 shares of the stock in a transaction on Thursday, February 29th. The shares were sold at an average price of $180.94, for a total value of $18,094,000.00. Following the sale, the director now owns 4,434,576 shares in the company, valued at $802,392,181.44. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through this hyperlink. 0.06% of the stock is currently owned by insiders. Shares of Apple stock opened at $170.73 on Friday. The company has a quick ratio of 1.02, a current ratio of 1.07 and a debt-to-equity ratio of 1.28. The company has a market capitalization of $2.64 trillion, a PE ratio of 26.59, a price-to-earnings-growth ratio of 2.04 and a beta of 1.29. The stock’s fifty day moving average is $184.64 and its two-hundred day moving average is $183.56. Apple Inc. has a 52 week low of $147.61 and a 52 week high of $199.62. Apple (NASDAQ:AAPL – Get Free Report) last posted its quarterly earnings results on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share (EPS) for the quarter, topping analysts’ consensus estimates of $2.09 by $0.09. Apple had a net margin of 26.16% and a return on equity of 156.04%. The business had revenue of $119.60 billion during the quarter, compared to analysts’ expectations of $117.99 billion. During the same quarter last year, the company posted $1.88 earnings per share. The business’s quarterly revenue was up 2.1% on a year-over-year basis.  As a group, analysts expect that  Apple Inc. will post 6.55 earnings per share for the current year. The firm also recently declared a quarterly dividend, which was paid on Thursday, February 15th. Investors of record on Monday, February 12th were issued a $0.24 dividend. The ex-dividend date  was Friday, February 9th. This represents a $0.96 annualized dividend and a yield of 0.56%. Apple’s dividend payout ratio (DPR) is presently 14.95%. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. PNC Financial Services Group Inc. Sells 3,809 Shares of Gerdau S.A. (NYSE:GGB) WCG Wealth Advisors LLC Makes New $41.11 Million Investment in Apple Inc. (NASDAQ:AAPL) "
}