{
    "title": "Apple is scrapping its electric car to focus on AI: what went wrong?",
    "date": "3/13/2024",
    "url": "https://www.globaldata.com/newsletter/details/apple-is-scrapping-its-electric-car-to-focus-on-ai-what-went-wrong_154508/?newsletterdate=2024-03-14&hubspotcategory=gd-technology-verdict-daily&utm_source=website&utm_medium=top_navigation&utm_content=spotlight_news_article&utm_campaign=type2_technology",
    "text": "Previous edition: 14 Mar 2024\nShare article Get the full version straight to your inbox.\r\n                                Exclusive access to our best-in-class data & intelligence Subscribe now Apple's decade-long electric car development has come to an end after years of delays and setbacks, pivoting towards AI. Apple’s long-running electric car programme has been cancelled after a decade of development, it was reported last week.Codenamed Titan, the project began in 2014 and was confirmed the year after. After years of delays – the original shipping target was 2019 – the company appears to have finally accepted that the sunk cost is lower than the potential for even longer delays in an increasingly competitive market.Why build a car?On the face of it, Apple's desire to build a car was perhaps more surprising than the decision to scrap it. It is after all a technology company that, at least in 2014, was more focused on software and design than in-house manufacturing.Cars, even ones with artificial intelligence (AI) features and batteries, are a far cry from the phones and laptops for which the company is known. There were however a few key market considerations that made the project less far-fetched than it sounds.At the time of development, the electric vehicle (EV) market was up for grabs. The Nissan Leaf, the world’s first mass-market EV was a mere four years old and the Model S, Tesla’s best-selling car until 2017’s Model 3 had only launched two years earlier. It sold over 50,000 units in its first two full years of operation, proving that new entrants into the space could both generate hype and convert that into strong sales numbers. At the time of writing, Tesla is ranked as the twelfth-largest company in the world by market cap, and it is by far the most valuable car company.Another factor is that Apple is a cash-rich company. In its end-of-year filings for 2014, the company reported $155bn in cash and equivalents. This makes the upfront costs of any partnerships more manageable, like the one it was apparently investigating with BMW. Coupled with generous subsidies and tax breaks available at the time, the move may have been unexpected but not as outlandish as it first appears.A decade of setbacksUnfortunately for Apple, things didn’t go according to plan. While Titan remained shrouded in secrecy – Apple has yet to officially confirm its scrapping – the glimpses outsiders had of its development were not promising.In 2021, its former chief Doug Field left the company for Ford, signalling the beginning of the end after he failed to revitalise the team following a layoff of nearly 200 employees in 2019.Around the same time, news outlets speculated that the project might have been shifting toward autonomous driving software, spurred on by Apple’s acquisition of Drive.AI, a company already working on the technology. The problem with this strategy – assuming it was the direction in which Apple had moved – is that developing self-driving cars has proven more difficult than industry players previously expected.Level 1 semi-autonomous vehicles capable of basic acceleration and deceleration have existed since the 1990s, but it took almost 20 years to reach level 2, which simply adds the ability to remain in the correct lane. The gulf between this and levels 4 and 5, which allow genuine self-driving over greater or lesser areas, is huge and harder to bridge than proclaimed by the likes of Tesla’s Elon Musk.Poor growth climateAtop all this, 2024 has been a poor year for EV manufacturers overall. Poor growth figures have led to price reductions and sell-offs as the market faces up to the difficulties of achieving profitability. A GlobalData report suggests that only 14% of passenger vehicle sales in 2023 were EVs, and a large amount of these were in the Chinese market, which is dominated by domestic manufacturers. The loss of tax credits in the US for many EV manufacturers due to battery sourcing rule changes has also not helped matters.While Apple’s secrecy makes it hard to know whether any of this factored into its decision – or indeed when the decision was made internally – these conditions have primed investors to accept its move away from the project. Apple’s stock was largely unaffected by the announcement, rising and then falling slightly over the course of 28 February and 1 March but remaining within 2% of its value at the beginning of the week.It is rumoured that many of the staff members from the team will move to Apple’s burgeoning AI division, on which it is likely to spend at least $1bn a year in future. Given the high growth potential in this sector and the vast spend by its main competitor, Microsoft, the news that the company will reveal the fruits of its labour later this year is likely more exciting to investors than anything it could offer in the EV space.Right now, AI is seen as far more of a home run investment-wise than autonomous driving. In a survey of 386 people as part of GlobalData’s Tech Sentiment Polls Q4 2023 across its network of B2B websites, 92% responded that AI would either live up to all of its promise or that it was hyped but that they could still see a use for it. Apple’s long-running electric car programme has been cancelled after a decade of development, it was reported last week. Codenamed Titan, the project began in 2014 and was confirmed the year after. After years of delays – the original shipping target was 2019 – the company appears to have finally accepted that the sunk cost is lower than the potential for even longer delays in an increasingly competitive market.  On the face of it, Apple's desire to build a car was perhaps more surprising than the decision to scrap it. It is after all a technology company that, at least in 2014, was more focused on software and design than in-house manufacturing. Cars, even ones with artificial intelligence (AI) features and batteries, are a far cry from the phones and laptops for which the company is known. There were however a few key market considerations that made the project less far-fetched than it sounds.  At the time of development, the electric vehicle (EV) market was up for grabs. The Nissan Leaf, the world’s first mass-market EV was a mere four years old and the Model S, Tesla’s best-selling car until 2017’s Model 3 had only launched two years earlier. It sold over 50,000 units in its first two full years of operation, proving that new entrants into the space could both generate hype and convert that into strong sales numbers. At the time of writing, Tesla is ranked as the twelfth-largest company in the world by market cap, and it is by far the most valuable car company. Another factor is that Apple is a cash-rich company. In its end-of-year filings for 2014, the company reported $155bn in cash and equivalents. This makes the upfront costs of any partnerships more manageable, like the one it was apparently investigating with BMW. Coupled with generous subsidies and tax breaks available at the time, the move may have been unexpected but not as outlandish as it first appears.  Unfortunately for Apple, things didn’t go according to plan. While Titan remained shrouded in secrecy – Apple has yet to officially confirm its scrapping – the glimpses outsiders had of its development were not promising. In 2021, its former chief Doug Field left the company for Ford, signalling the beginning of the end after he failed to revitalise the team following a layoff of nearly 200 employees in 2019. Around the same time, news outlets speculated that the project might have been shifting toward autonomous driving software, spurred on by Apple’s acquisition of Drive.AI, a company already working on the technology. The problem with this strategy – assuming it was the direction in which Apple had moved – is that developing self-driving cars has proven more difficult than industry players previously expected. Level 1 semi-autonomous vehicles capable of basic acceleration and deceleration have existed since the 1990s, but it took almost 20 years to reach level 2, which simply adds the ability to remain in the correct lane. The gulf between this and levels 4 and 5, which allow genuine self-driving over greater or lesser areas, is huge and harder to bridge than proclaimed by the likes of Tesla’s Elon Musk.  Atop all this, 2024 has been a poor year for EV manufacturers overall. Poor growth figures have led to price reductions and sell-offs as the market faces up to the difficulties of achieving profitability. A GlobalData report suggests that only 14% of passenger vehicle sales in 2023 were EVs, and a large amount of these were in the Chinese market, which is dominated by domestic manufacturers. The loss of tax credits in the US for many EV manufacturers due to battery sourcing rule changes has also not helped matters. While Apple’s secrecy makes it hard to know whether any of this factored into its decision – or indeed when the decision was made internally – these conditions have primed investors to accept its move away from the project. Apple’s stock was largely unaffected by the announcement, rising and then falling slightly over the course of 28 February and 1 March but remaining within 2% of its value at the beginning of the week. It is rumoured that many of the staff members from the team will move to Apple’s burgeoning AI division, on which it is likely to spend at least $1bn a year in future. Given the high growth potential in this sector and the vast spend by its main competitor, Microsoft, the news that the company will reveal the fruits of its labour later this year is likely more exciting to investors than anything it could offer in the EV space. Right now, AI is seen as far more of a home run investment-wise than autonomous driving. In a survey of 386 people as part of GlobalData’s Tech Sentiment Polls Q4 2023 across its network of B2B websites, 92% responded that AI would either live up to all of its promise or that it was hyped but that they could still see a use for it.  Google said on Tuesday (12 March) that it will restrict its AI chatbot Gemini from answering questions about this year's many global elections. Oracle shares increased 13% on Tuesday (12 March) after the database giant posted a 25% jump in cloud revenue and rumours of partnership announcement with AI heavyweight Nvidia emerged. The UK government has dedicated £1.1bn to upskill thousands of people in future technologies like AI and quantum computing. Apple has said it will allow developers to distribute their apps directly to EU customers from their websites, marking another regulatory concession from the iPhone maker as it seeks to protect the dominance of its App Store. Skanska has secured a contract to build a data centre in the US state of Virginia for $242m (SEK 2.5bn). Global warehouse robotics provider Exotec has announced that it has sold over $1bn in systems globally, highlighting the growing demand for robotics technology. The UK and Germany have signed a new partnership to deepen science and research collaboration on quantum computing. Access best-in-class insights to stay ahead of major industry developments, built on GlobalData's leading datasets and developed by our expert analysts. Stay ahead of the forces shaping your industry with curated analysis on disruptive innovations, technologies, macroeconomic shifts, and social trends. Technology Decoded 13 Mar 2024 Technology Decoded 12 Mar 2024 Technology Decoded 11 Mar 2024 Give your business an edge with access to the latest insights for your sector. Aerospace, Defence & Security Apparel Automotive Banking & Payments Construction Consumer Foodservice Healthcare Insurance Medical Devices Mining Oil & Gas Packaging Pharma Power Retail Sport Technology Travel and Tourism Search companies, themes, reports, as well as actionable data & insights spanning 22 global industries Access more premium companies when you subscribe to Explorer Contact the team or request a demo to find out how our data can drive your business forward "
}