{
    "title": "Where Will Apple Stock Be in 3 Years?",
    "date": "3/3/2024",
    "url": "https://www.fool.com/investing/2024/03/03/where-will-apple-stock-be-in-3-years/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Since March 1, 2021, Apple (AAPL -1.06%) shares have climbed almost 50%. That gain is more than double the increase in the Nasdaq Composite Index over the same period. And it continues an impressive track record of this tech behemoth outpacing the broader market. Even today, Apple shares aren't too far off their all-time high, as the artificial intelligence (AI) craze is still in full effect. But investors have their sights on the longer term. Where will this \"Magnificent Seven\" stock be in three years? Launched in 2007 for the first time, the iPhone is the single product that made Apple the global cultural and business icon that it is today. We're 17 years past that point, and the popular smartphone still generated 52% of the company's 2023 revenue. At the end of the day, Apple is still an iPhone business. Of course, numerous other products are offered, like the iPad tablets and MacBook laptops, as well as the Watch and AirPods. Combined, hardware accounted for 78% of fiscal 2023's revenues. But it's not a big growth driver anymore, as that sales figure was down 6% compared to the year before. A finger can be pointed to the current macroeconomic climate, as higher interest rates and worries about a recession might discourage consumers from spending more on discretionary purchases. And the fact that newer devices have fewer game-changing updates makes it easy to delay buying the latest product introduction. Some Apple supporters might have hoped that the business would stay on course with its plan to launch an autonomous vehicle. However, this project was recently scratched. The global car market is a massive industry that could've moved the financial needle for Apple, but I guess we'll never know what could've been. If we look to 2027, there's no question in my mind, though, that the iPhone will remain Apple's bread and butter. Astute readers will quickly realize that there's another part of the Apple empire that is quickly ascending to become more important. I'm talking about services and subscriptions, including services like iCloud, Pay, Card, TV+, Fitness+, and Music. This segment raked in $23 billion of sales in the latest fiscal quarter (the first quarter of 2024 ended Dec. 30), up 11% year over year. While still a small part of the business, services have greater growth potential than hardware. And they are far more profitable, carrying a stellar gross margin of 73%. From a purely competitive standpoint, services are what create the dominant Apple ecosystem. The business has 2.2 billion active devices worldwide, a number that gets larger with each passing quarter. This helps drive more and more of the high-margin and recurring revenue that comes from services and subscriptions. And it keeps consumers engaged and loyal. As I mentioned above, I still expect products, particularly the iPhone, to carry the weight three years from now. But this up-and-coming segment shouldn't be ignored. In order to become one of the world's most valuable corporations, it's not surprising that a business has to be kind to its shareholders. And Apple is no exception. The stock is a huge winner, likely making many millionaires over the years. However, if we view things with a fresh perspective today, shares aren't cheap. They trade at a price-to-earnings ratio of 28.2. That's a sizable premium to its trailing 10-year average. This indicates the optimism that Apple investors have. If Apple was staring at a significant growth opportunity in the years ahead, that valuation might make sense. This just isn't the case. Consensus analyst estimates call for revenue to rise at an annualized clip of 4% between fiscal 2023 and fiscal 2026. Consequently, there's a good chance the stock will underperform the Nasdaq Composite Index over the next three years. Neil Patel and his clients have no positions in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}