{
    "title": "Apple quietly bought another AI firm",
    "date": "3/14/2024",
    "url": "https://qz.com/emails/daily-brief/1851337304/apple-quietly-buys-ai-startup",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Good morning, Quartz readers! Apple quietly bought another AI firm. Canada’s DarwinAI will add to the iPhone maker’s growing arsenal of AI startups. BlackRock and JPMorgan are backing a $15 billion investor fund to rebuild Ukraine. It’s certainly not nothing, but reconstructing Ukraine could cost half-a-trillion dollars. Under Armour stock slipped after investors found out its old CEO is getting off the bench. Founder Kevin Plank is returning as the head of the American sportswear company. Meanwhile, another sporting goods company, Dick’s, saw its stock hit a record high. Maybe it’s time for the high-flying retailer to take a crack at the Bass Pro Shops way. Who created Bitcoin? That we don’t know, but now we certainly know a guy who didn’t create Bitcoin. A U.K. court ruled that Australian scientist Craig Wright, who claims to be Satoshi Nakamoto (the pseudonymous person or persons who developed Bitcoin), is not the creator of Bitcoin or the author of its founding whitepaper. But then, who is Satoshi Nakamoto? And if the cryptocurrency wants to keep promoting decentralized finance, will we ever know? Corrective actions that SpaceX needed to complete to earn its third launch license for its Starship rocket. And it was worth it! The 400-foot-tall (122-meter) megarocket reached orbital velocity yesterday in a big win for Elon Musk’s SpaceX. Here’s how the launch went down, or, er, up. Stake that a major Anheuser-Busch InBev shareholder, the tobacco conglomerate Altria, is selling Altria holds about a 10% stake of the brewing company — or 197 million shares — and plans to offload 18% of that. Here’s why. 🥧 The history of why pi equals 3.14(15926…) 🪓 Facebook is killing a data tool that helps researchers monitor Facebook 👷 A jobs board for the American Climate Corps opens next month 🚖 Google’s Waymo robotaxi service is expanding as its rival tries to stage a comeback 🤖 Walmart is selling its AI-powered delivery software 🧐 Former Trump adviser Steven Mnuchin wants to buy TikTok as it faces a U.S. ban An LVMH company that sells a $9,000 sweater pays a whole village the equivalent of $280 for the fiber to make it. Many in the Peruvian community where the vicuña wool comes from don’t feel like a long-established trade deal with Loro Piana has benefited them. Whale species that go through menopause live, on average, four decades longer than those that don’t. That longer lifespan gives their offspring a better chance at survival. Coral reefs love a good sound system. Blasting the happenings and goings of a healthy seascape through underwater speakers convinces larvae to nest in damaged areas. OpenAI’s Sora images are getting freakishly good. A Labrador Retriever wearing a hoodie and typing really fast… looks just like its prompt. Tote bags have been around since at least the late 1800s. We can credit the tote design we know and love today though to the 1944 L.L. Bean “ice bag” — literally, a bag for carrying frozen water. Learn everything you need to know about tote bags in our latest Obsession, and sign up for our next ones here. Did you know we have two premium weekend emails, too? One gives you analysis on the week’s news, and one provides the best reads from Quartz and elsewhere to get your week started right. Become a member or give membership as a gift! Our best wishes for a productive day. Send any news, comments, seascape soundscapes, and Trader Joe’s totes to talk@qz.com. Today’s Daily Brief was brought to you by Morgan Haefner. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}