{
    "title": "AI has spoken: the Apple Car would have been adorable",
    "date": "3/6/2024",
    "url": "https://ca.style.yahoo.com/ai-has-spoken-the-apple-car-would-have-been-adorable-020527007.html",
    "text": "We've rounded up the best deals from Amazon, Walmart, Best Buy, Coach Outlet & more. After a decade of rumors and speculation, the Apple Car is dead. Last week, Bloomberg  reported that the multibillion-dollar project had finally been scrapped. Reports about the electric vehicle never quite seemed real, but now we have many new details about the car that never was thanks to an excellent post-mortem from Bloomberg’s Mark Gurman. The story includes many astonishing details about various Apple executives’ plans for the car, and why the project ultimately failed. But some of the best details are the descriptions of what the vehicle was supposed to look like. At one point, Apple’s leaders were adamant that the autonomous “microbus” should not include a steering wheel or pedals. It would have “club seating like a private plane” and curved sides and a glass roof. Famed Apple designer Jony Ive thought the interior should be “covered in stainless steel, wood and white fabric,” and that it should only come in one color: white. Since any actual mock-ups of the car, which Gurman says was sometimes referred to as the “Bread Loaf,” are presumably locked deep inside a well-guarded Apple office, I did the next best thing and asked AI. The results are, actually, kind of cute? Copilot reallllly wanted it to have a steering wheel. AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. The post 5 Artificial Intelligence (AI) Stocks That Could Be Millionaire Makers appeared first on The Motley Fool Canada. Some iPhone owners have received a series of notifications about resetting their Apple ID password, followed by a spoofed phone call. IBKR EventTrader - A new, straightforward way to trade CME futures markets Ping Ping Ping A Boston Dynamics SPOT robot that was sent inside a home by Massachusetts state police was shot three times by a person barricaded inside. As the Associated Press reports, the robotics company believes it's the first time one of its robotic dogs has been shot. The remotely-controlled quadruped was deployed earlier this […] While it's easy to draw comparisons to the Microsoft - OpenAI alliance, Wednesday's move by AWS actually signals just how vulnerable Amazon's cloud empire has become. Apple's overseas suppliers have increased production of the company's new iPad models and plans to launch them in early May, Bloomberg News reported on Thursday citing people with knowledge of the matter.  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  Apple will finally launch new iPads in early May, according to Bloomberg’s Mark Gurman. Expected are a new iPad Pro with an OLED display and a faster iPad Air, including a 12.9-inch model for the first time in that lineup. Taiwan's Foxconn hit a record closing high on Thursday as it is set to benefit from growth in AI servers. Elsewhere, CEOs of U.S. chip makers met Chinese leader Xi Jinping. ANCHORAGE, Alaska (AP) — A headless robot about the size of a labrador retriever will be camouflaged as a coyote or fox to ward off migratory birds and other wildlife at Alaska's second largest airport, a state agency said. The Alaska Department of Transportation and Public Facilities has named the new robot Aurora and said it will be based at the Fairbanks airport to “enhance and augment safety and operations,\" the Anchorage Daily News reported. The transportation department released a video of  The company is among the fastest-growing cybersecurity players based on my peer analysis Caution is needed even with this famous tech behemoth and its fast-growing services business WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th  \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. Nordegren has moved on and built a life that focuses on her six kids  Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Victoria’s Secret's wedding-inspired collection includes corsets, bras, thongs and more sexy apparel Play this game for 1 minute and see why everyone is addicted. Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. "
}