{
    "title": "Apple partner Foxconn to invest $1.5 billion in India",
    "date": "3/18/2024",
    "url": "https://ca.style.yahoo.com/apple-partner-foxconn-invest-1-022956378.html",
    "text": "We've rounded up the best deals from Amazon, Walmart, Best Buy, Coach Outlet & more. Foxconn plans to invest $1.54 billion in India, the latest in its growing expansion plan, following a surge in revenues in the South Asian market. Foxconn said in a stock exchange filing that the investment will help it fulfill \"operational needs.\" The investment comes two months after the Taiwanese firm said it plans to double its workforce and investment in India by next year. Foxconn works with many firms including Apple and assembles their devices in plants in India as many tech giants look to shift part of their manufacturing base to India in a move that analysts describe as \"China+1.\" The investment from Foxconn, which is the largest EMS provider globally, into China climbed in 2001-2017, or over 15 years, and has slowed down since 2018, given the U.S.-China trade tension. The company, which operates three manufacturing campuses in India, pulled out of a $19.5 billion chipmaking joint venture with Vedanta earlier this year, but said it remains \"confident\" about India's ambitions. “Building fabs from scratch in a new geography is a challenge, but Foxconn is committed to invest in India. We have been working on challenges like this since the 1980s. Foxconn has no intention to do anything but continue to strongly support the government’s ‘Make in India’ ambitions and establish a diversity of local partnerships that meet the needs of stakeholders,” Foxconn, which also goes by the name Hon Hai, said at the time. In August, the firm announced plans to invest $600 million in two projects in the Southern Indian state of Karnataka for chip-equipment manufacturing and casing components for iPhones. \"For 3Q23 (the most recent quarter, whose results were revealed earlier this month) revenues by region, we see revenues from India continuing to increase, at NT$62 billion, or +53% YoY from a low base, leading India revenue contribution to increase to 3.3% in 9M23 vs. ~2% in 2021-22A,\" Goldman Sachs analysts wrote in a recent report. \"The rising contribution reflects global-tier clients' needs on a diversified production base, and we see Hon Hai's global footprints as better securing its leading market position in EMS.\" \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone They soft-launched their relationship at the supermodel's cookbook event in Miami. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company. Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. "
}