{
    "title": "Apple to reportedly bring Google and OpenAI models to upcoming iOS 18 in a \nnew deal",
    "date": "3/17/2024",
    "url": "https://www.albawaba.com/business/apple-reportedly-bring-google-and-openai-models-upcoming-ios-18-new-deal-1558026",
    "text": "ALBAWABA - Apple is presumably in talks with Google about utilizing its Gemini generative Artificial Intelligence technology in the iPhone, according to Bloomberg, with OpenAI’s ChatGPT considered another option, as the tech giant prepares its highly anticipated iOS 18 with an arsenal of AI features, which is expected to be released later this year. Apple could ultimately use a combination of first and third-party AI models to provide the AI capabilities integrated into its devices, as Bloomberg reports. Cloud-based AI capabilities like text and image creation may be made possible through collaborations with companies like Google, while on-board generative AI would be powered by Apple's own AI models. EXCLUSIVE: Apple is in talks to build Google’s Gemini AI engine into the iPhone in a potential blockbuster deal.Here's what we know so far https://t.co/e3XYmn05vL pic.twitter.com/2CMZ1PveKg If the deal comes to light, it would tighten both companies’ long-standing partnership; as for several years, Apple has received annual multi-billion-dollar payments from Alphabet Inc.'s Google to set its search engine as the default choice in the Safari web browser on iPhones and other Apple devices. However, it would not be the first mobile phone to partner with Google to incorporate AI features. Earlier this year, Samsung brought a number of AI features to its Galaxy S24 smartphones, which use Google's AI technology yet branded under the Galaxy AI moniker. Additionally, Google's AI is heavily included in its Pixel 8 lineup of smartphones. While it is not yet clearly determined how Google's AI technology would be branded or integrated into Apple’s products, Bloomberg report indicates that negotiations are underway, adding that any agreement is not likely to be declared public until June, coinciding with the iPhone manufacturer's annual Worldwide Developers Conference. © 2000 - 2024 Al Bawaba (www.albawaba.com) Subscribe to our newsletter for exclusive updates and enhanced content Subscribe  "
}