{
    "title": "DOJ calls Apple’s privacy justifications an ‘elastic shield’ for financial \ngains",
    "date": "3/21/2024",
    "url": "https://techcrunch.com/2024/03/21/doj-calls-apples-privacy-justifications-an-elastic-shield-for-financial-gains/",
    "text": "The U.S. Department of Justice sued Apple Thursday over monopolistic practices. The complaint accuses Apple of molding its privacy and security practices in ways that benefit the company financially. One quote particularly jumps out where the DOJ calls Apple’s privacy and security justification an “elastic shield”: “Apple deploys privacy and security justifications as an elastic shield that can stretch or contract to serve Apple’s financial and business interests,” it says. “Apple wraps itself in a cloak of privacy, security, and consumer preferences to justify its anticompetitive conduct. Indeed, it spends billions on marketing and branding to promote the self-serving premise that only Apple can safeguard consumers’ privacy and security interests.” That’s not all — there are several other instances where the DOJ thinks Apple is bending privacy to degrade customer experience. It also pointed out that Apple doesn’t allow the creation and usage of alternative app stores. However, it allows governments and enterprise customers to install secure app stores, the complaint noted. It also said that at the moment developers can’t offer a separate app store for children. Notably, some of this has changed partially with EU enforcing its Digital Markets Act (DMA). (Some of the changes are applicable only in the EU region.) The DOJ pointed out that Apple lets users easily sideload apps on the Mac. Developers can additionally distribute apps with fewer restrictions on the platform, the DOJ argues. The DOJ also made an argument about Apple restricting “super apps,” which could be a better alternative for the App Store to access services. The DOJ also accused Apple of restricting third-party apps from receiving carrier-based messages (SMS). It said that Apple marks SMS as “private” in its API documentation, so other developers can’t access them. Apple lets users text anyone by typing their number in the “to:” field of its Messages app, but with other messaging apps it is not possible, the complaint reads. The plaintiff also argued that Apple makes iPhones less secure by not implementing encryption protection when iPhone users are sending messages to Android users. The complaint also accuses Apple of using “vast amounts of personal and sensitive data” to distribute the app on its own App Store. It also pointed fingers at the Cupertino-based company for utilizing user data for advertising. Additionally, the lawsuit said that Apple has entered into deals with Google to make the latter’s service the default search engine for Safari, despite Apple knowing that there are better privacy-focused alternatives out there. The DOJ also made an argument about users having to share information with Apple to use a digital wallet rather than just sharing those details with a bank or a medical provider. Essentially, the DOJ argues that Apple’s privacy and security practices are pretextual in nature and the company chooses “alternative courses” to protect its monopoly. Apple has long marketed user privacy as its strong suit, and DOJ’s complaint wants to prove those claims wrong. Apple’s iPhone is not a monopoly like Windows was a monopoly  Apple sent a boilerplate response to TechCrunch when we approached the company about the DOJ’s accusation about Apple’s privacy practice: At Apple, we innovate every day to make technology people love—designing products that work seamlessly together, protect people’s privacy and security, and create a magical experience for our users. This lawsuit threatens who we are and the principles that set Apple products apart in fiercely competitive markets. If successful, it would hinder our ability to create the kind of technology people expect from Apple—where hardware, software, and services intersect. It would also set a dangerous precedent, empowering the government to take a heavy hand in designing people’s technology. We believe this lawsuit is wrong on the facts and the law, and we will vigorously defend against it. The company added that the DOJ discounted Apple’s privacy and security features as pretextual. It argued that there is no iMessage version for other operating systems and devices because Apple can’t guarantee user security on those devices. "
}