{
    "title": "Apple (NASDAQ:AAPL) Earns “Overweight” Rating from Morgan Stanley",
    "date": "3/25/2024",
    "url": "https://www.defenseworld.net/2024/03/26/apple-nasdaqaapl-earns-overweight-rating-from-morgan-stanley.html",
    "text": "Posted by Defense World Staff on Mar 26th, 2024 Morgan Stanley reaffirmed their overweight rating on shares of Apple (NASDAQ:AAPL – Free Report)  in a research report report published on Friday, Benzinga reports. Morgan Stanley currently has a $220.00 price target on the iPhone maker’s stock. Other analysts have also recently issued research reports about the stock. Redburn Partners cut shares of Apple to a neutral rating and set a $200.00 price target on the stock. in a research report on Wednesday, January 10th. Monness Crespi & Hardt raised their target price on shares of Apple from $189.00 to $200.00 and gave the company a buy rating in a report on Friday, February 2nd. Piper Sandler reduced their target price on shares of Apple from $205.00 to $190.00 and set a neutral rating on the stock in a report on Friday, February 2nd. JPMorgan Chase & Co. reduced their target price on shares of Apple from $225.00 to $215.00 and set an overweight rating on the stock in a report on Friday, February 2nd. Finally, Oppenheimer  reaffirmed an outperform rating and issued a $200.00 target price on shares of Apple in a report on Friday, February 2nd. One analyst  has rated the stock with a sell rating, eleven have assigned  a hold rating, twenty-one have assigned  a buy rating and one  has assigned  a strong buy rating to the company. According to MarketBeat.com, the company currently has a consensus rating of Moderate Buy and a consensus target price of $205.27. Get Our Latest Research Report on AAPL Shares of AAPL stock opened at $170.85 on Friday. The company has a debt-to-equity ratio of 1.28, a current ratio of 1.07 and a quick ratio of 1.02. The firm has a market cap of $2.64 trillion, a PE ratio of 26.61, a price-to-earnings-growth ratio of 2.08 and a beta of 1.29. The company has a 50-day moving average of $182.26 and a two-hundred day moving average of $182.83. Apple has a 1-year low of $155.98 and a 1-year high of $199.62. Apple (NASDAQ:AAPL – Get Free Report) last issued its quarterly earnings results on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share (EPS) for the quarter, topping the consensus estimate of $2.09 by $0.09. The business had revenue of $119.60 billion for the quarter, compared to analysts’ expectations of $117.99 billion. Apple had a net margin of 26.16% and a return on equity of 156.04%. The business’s quarterly revenue was up 2.1% on a year-over-year basis. During the same quarter in the prior year, the company earned $1.88 earnings per share.  On average, analysts predict that  Apple will post 6.55 EPS for the current year. The company also recently declared a quarterly dividend, which was paid on Thursday, February 15th. Stockholders of record on Monday, February 12th were paid a dividend of $0.24 per share. This represents a $0.96 annualized dividend and a dividend yield of 0.56%. The ex-dividend date  was Friday, February 9th. Apple’s dividend payout ratio (DPR) is presently 14.95%. In other news, Director Arthur D. Levinson sold 100,000 shares of Apple stock in a transaction on Thursday, February 29th. The stock was sold at an average price of $180.94, for a total transaction of $18,094,000.00. Following the completion of the transaction, the director now owns 4,434,576 shares of the company’s stock, valued at approximately $802,392,181.44. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available at this link. Corporate insiders own  0.06% of the company’s stock. Several institutional investors have recently added to or reduced their stakes in the company. Vanguard Group Inc. raised its stake in  Apple by 1.4% in the 4th quarter. Vanguard Group Inc. now owns 1,318,064,349 shares of the iPhone maker’s stock valued at $253,766,929,000 after purchasing an additional 18,067,216 shares during the last quarter.  State Street Corp grew its holdings in  Apple by 0.5% in the 2nd quarter. State Street Corp now owns 578,897,858 shares of the iPhone maker’s stock valued at $112,288,818,000 after buying an additional 2,616,084 shares during the period.  Moneta Group Investment Advisors LLC grew its holdings in  Apple by 116,483.5% in the 4th quarter. Moneta Group Investment Advisors LLC now owns 569,554,722 shares of the iPhone maker’s stock valued at $74,002,245,000 after buying an additional 569,066,184 shares during the period.  Geode Capital Management LLC grew its holdings in  Apple by 2.2% in the 2nd quarter. Geode Capital Management LLC now owns 291,538,165 shares of the iPhone maker’s stock valued at $56,396,763,000 after buying an additional 6,367,053 shares during the period.  Finally, Price T Rowe Associates Inc. MD grew its holdings in  Apple by 3.4% in the 1st quarter. Price T Rowe Associates Inc. MD now owns 234,017,381 shares of the iPhone maker’s stock valued at $38,589,468,000 after buying an additional 7,736,013 shares during the period. Institutional investors and hedge funds own  60.41% of the company’s stock. (Get Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.    Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. AbbVie (NYSE:ABBV) Trading Up 0.1% Following Analyst Upgrade Zacks Research Comments on Copa Holdings, S.A.’s Q1 2024 Earnings (NYSE:CPA) "
}