{
    "title": null,
    "date": "1/12/2024",
    "url": "https://www.thestar.com.my/business/business-news/2024/01/12/microsoft-challenges-apple-as-worlds-most-valuable-company",
    "text": "Friday, 12 Jan 2024 Apple’s stock market value is now at US$2.87 trillion, compared to Microsoft’s US$2.84 trillion value. — Reuters NEW YORK: A recent dip in Apple’s stock over worries about iPhone sales has left the Silicon Valley tech heavyweight in danger of being overtaken by Microsoft as the world’s most valuable company. Fresh worries about smartphone demand have pushed Apple’s shares down 4% so far in 2024 after rallying 48% last year. Microsoft is up about 2% year to date after surging 57% in 2023. Apple dipped 0.4% on Wednesday, while Microsoft added 1.6%, further eroding the iPhone maker’s lead. Apple’s stock market value is now at US$2.87 trillion, compared to Microsoft’s US$2.84 trillion value. Apple’s market capitalisation peaked at US$3.08 trillion on Dec 14, while Microsoft’s value reached as much as US$2.85 trillion on Nov 28. IPhone sales in China dropped 30% in the first week of 2024, Jefferies analysts said in a client note this week, adding to signs of growing competitive pressures from Huawei and other domestic rivals. Sales of Apple’s Vision Pro mixed-reality headset start on Feb 2 in the United States, marking Apple’s biggest product launch since the iPhone in 2007. However, UBS in a report on Monday estimated that Vision Pro sales would be “relatively immaterial” to Apple’s earnings per share in 2024. A handful of times since 2018, Microsoft has briefly taken the lead over Apple as the most valuable company, most recently in 2021, when concerns about supply chain shortages related to the Covid-19 pandemic hit the iPhone maker’s stock price. Both tech stocks look relatively expensive in terms of price to their expected earnings, a common method of valuing publicly listed companies. Apple is trading at a forward price earnings of 28, well above its average of 19 over the past 10 years, according to LSEG data. Microsoft is trading around 31 times forward earnings, above its 10-year average of 24. In its most recent quarterly report in November, Apple gave a sales forecast for the holiday quarter that missed Wall Street expectations, hurt by weak demand for iPads and wearables. Analysts on average see Apple posting revenue up 0.7% to US$117.9bil for the December quarter, according to LSEG. That would mark its first year-on-year revenue increase in four quarters. Apple reports its results on Feb 1. Analysts see Microsoft reporting a 16% increase in revenue to US$61.1bil, lifted by ongoing growth in its cloud business when it reports in the coming weeks. — Reuters Tags / Keywords:\nApplevsMicrosoft\n                                                                ,\n                                                                                                BattleoftheTitans\n                                                                ,\n                                                                                                AppleStock\n                                                                ,\n                                                                                                MicrosoftStock\n                                                                ,\n                                                                                                TechStocks\n                                                                ,\n                                                                                                MarketCap\n                                                                ,\n                                                                                                iPhoneSales\n                                                                ,\n                                                                                                VRHeadsetHope\n                                                                ,\n                                                                                                TechValuations Topic:  Report it to us. Thank you for your report!  Copyright © 1995-\n            \n\n Star Media Group Berhad [197101000523 (10894-D)] Best viewed on Chrome browsers.  We would love to keep you posted on the latest promotion. Kindly fill the form below We hope you enjoy this feature! "
}