{
    "title": null,
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/hold-apple-aapl-long-term-123749460.html",
    "text": "Wedgewood Partners, an investment management company, released its fourth quarter 2023 investor letter. A copy of the same can be downloaded here. In the fourth quarter, Wedgewood Composite’s net return was 11.4% compared to the Standard & Poor’s 11.7%, Russell 1000 Growth Index’s 14.2%, and Russell 1000 Value Index’s 9.5% return for the same period. Year-to-date, the fund returned 29.2% compared to 26.3%, 42.7%, and 11.5%, respectively for the indexes. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023. Wedgewood Partners featured stocks such as Apple Inc. (NASDAQ:AAPL) in its Q4 2023 investor letter. Headquartered in Cupertino, California, Apple Inc. (NASDAQ:AAPL) is a multinational technology company that designs and manufactures smartphones, personal computers, tablets, wearables, and accessories. On January 12, 2024, Apple Inc. (NASDAQ:AAPL) stock closed at $185.92 per share. One-month return of Apple Inc. (NASDAQ:AAPL) was -5.90%, and its shares gained 37.96% of their value over the last 52 weeks. Apple Inc. (NASDAQ:AAPL) has a market capitalization of $2.875 trillion. Wedgewood Partners stated the following regarding Apple Inc. (NASDAQ:AAPL) in its fourth quarter 2023 investor letter: \"Apple Inc. (NASDAQ:AAPL) was also a top contributor to performance during the fourth quarter. The Company's services segment revenue growth accelerated to +16% over last year, one of the fastest growth rates since Covid-19 lockdowns, helping drive +11% growth in earnings per share. The strength in the Company's services segment was aided by over 1 billion paid subscribers across Apple's media platforms. We estimate that there are more than 2 billion iOS devices in Apple's global installed base, which still represents a very large addressable share of their current subscriber count. Apple also continues to innovate across its hardware portfolio, with custom silicon for nearly all its device form factors. More recently, the Company launched its new line of Mac computers, which included their M3 family of chips, including the M3 Max, which contains up to an astonishing 92 billion transistors. Apple's long-term strategy of creating products with customized hardware and software should continue to differentiate their products and help drive solid revenue growth and expense leverage across the Company's ecosystem.\" Apple Inc. (NASDAQ:AAPL) is in 10th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 134 hedge fund portfolios held Apple Inc. (NASDAQ:AAPL) at the end of third quarter which was 135 in the previous quarter. We discussed Apple Inc. (NASDAQ:AAPL) in another article and shared the list of most widely held stocks by individuals. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: Analysts Say These 13 AI Stocks Will Skyrocket in 2024 16 States with Income Tax Cuts in 2024 16 Best Mid-Cap Growth Stocks To Buy Now Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}