{
    "title": "Apple (AAPL) Expands TV+ Content With Latest Scorsese Movie",
    "date": "1/16/2024",
    "url": "https://finance.yahoo.com/news/apple-aapl-expands-tv-content-144600554.html",
    "text": "Apple AAPL recently added well-known director Martin Scorsese’s latest movie — Killers of the Flower Moon — to its streaming service, Apple TV+. The movie, based on the book of the same name by David Grann, stars Leonardo DiCaprio, Robert DeNiro and Lily Gladstone in key roles.The Martin Scorsese directorial was the first Apple Original Films release to have a wider theatrical run, garnering roughly $150 million in global box office sales. Killers of the Flower Moon has received rave reviews from critics and is one of the leading contenders for best picture nomination at this year’s Academy Awards. Apple has been focusing on quality content for its streaming service amid intensifying competition from the likes of Netflix NFLX, Disney DIS and Amazon AMZN.Consumption of Apple TV+ doubled in 2023, per a report from Deadline cited by 9TO5 Mac. Total viewership surged 42% year over year.Movies and shows like The Family Plan, The Morning Show, Lessons in Chemistry, Messi Meets America, Slow Horses, For All Mankind, Silo, Hijack, Bad Sisters and Ted Lasso drove consumption.Mark Wahlberg-starrer The Family Plan, which premiered on Dec 15, became the most-viewed movie ever for the service since its launch. The latest season of Jennifer Aniston – Reese Witherspoon starred The Morning Show witnessed a viewership increase of 20% over the second season. Apple Inc. price-consensus-chart | Apple Inc. Quote However, an impressive content portfolio has not essentially turned into a market share gain for Apple TV+.According to 9TO5Mac, which cited a JustWatch report, Amazon Prime Video was #1 in terms of market share (22%) in the United States, trailed by Netflix (21%). Max, Disney+ and Hulu had 15%,12% and 11% market share, respectively. Apple TV+’s market share increased from 6% to 7%.Apple shares have outperformed Disney but lagged both Amazon and Netflix in the past year. While Apple has returned 38%, Amazon and Netflix have gained 57.6% and 47.9%, respectively. Disney shares have dropped 9.1%.Apple currently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Netflix, Inc. (NFLX) : Free Stock Analysis Report The Walt Disney Company (DIS) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}