{
    "title": "BofA upgrades Apple stock to Buy citing Vision Pro and generative AI as \ngrowth catalysts",
    "date": "1/18/2024",
    "url": "https://finance.yahoo.com/news/bofa-upgrades-apple-stock-to-buy-citing-vision-pro-and-generative-ai-as-growth-catalysts-182414468.html",
    "text": "After a string of downgrades from Wall Street analysts, Apple’s (AAPL) stock received a much-needed vote of confidence on Thursday as Bank of America (BAC) analyst Wamsi Mohan upgraded the bank’s position on the company and raised its price target. Shares of Apple were up nearly 3% as of midday Thursday. In a research note, Mohan upgraded Apple from Neutral to Buy and increased its price objective from $208 to $225. Mohan said the company stands to benefit from a number of industry trends, as well as a glut of users who are using older iPhones and will need to upgrade to newer models in the coming years. Specifically, Mohan says that he expects a “stronger multi-year iPhone upgrade cycle driven by need for the latest hardware to enable Generative AI features to be introduced in 2024/2025.” He also expects to see better growth in the company’s services business and said risks around potential legal issues Apple could face are “manageable.” Apple is also preparing to launch its most ambitious product yet: the Vision Pro headset. The first new product category for the company since it launched the Apple Watch, the $3,499 Vision Pro will serve as a test for Apple’s ability to produce a new kind of device for what could be the next generation of computing. In a recent hands-on with the Vision Pro, Engadget’s Dana Wollman and Cherlynn Low praised the device’s technological capabilities and fun factor, but criticized its floating keyboard. I was blown away by the Vision Pro when I first tested it out in June during Apple’s WWDC event. It’s easily the best headset out there, but the price is going to be a tough sell for the average consumer. Mohan, however, says that as spatial computing takes hold, the Vision Pro could outpace Apple’s iPad revenue. The company’s iPad business generated $28.3 billion in 2023 compared to the $200.6 billion generated by iPhone sales. Mohan’s upgrade follows downgrades on Apple’s stock at Barclays, Piper Sandler, and Redburn Atlantic. Analysts at each of the firms pointed to slowing iPhone sales, especially in China, as a major headwind for the tech giant. Greater China is Apple’s third-largest region by revenue behind North America and Europe. In 2023, the area accounted for $72.6 billion of the company’s $383.3 billion in total revenue. China could be particularly irksome for Apple, as the company faces increased competition from homegrown tech companies like Huawei and Xiaomi. Huawei in particular has managed to regain its strength in the smartphone market after US sanctions nearly crushed the company. Apple’s biggest smartphone rival, Samsung, meanwhile announced its new Galaxy S24 lineup on Wednesday. The phones, which go on sale Jan. 31 and range in price from $799 for the Galaxy S24 to $1,299 for the S24 Ultra, all come with generative AI capabilities including translation functions, AI for photo editing, and more. If Apple is going to compete on an equal level with its Android counterpart, it’ll need to introduce some kind of generative AI capabilities with its next iPhone in September. For now, though, it’s all about the iPhone 15 and Vision Pro. We’ll find out more about how the iPhone 15 is performing and perhaps get an outlook for the Vision Pro when Apple announces its first quarter earnings on Feb. 1. Correction: A previous version of this article listed an incorrect prior price target for Apple. We regret the error. Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}