{
    "title": "Apple earnings are on tap. Can the iPhone maker snap an ugly streak?",
    "date": "1/31/2024",
    "url": "https://www.marketwatch.com/story/apple-earnings-are-on-tap-can-the-iphone-maker-snap-an-ugly-streak-e83886f9",
    "text": "Apple Inc. will be looking to break an inglorious streak Thursday afternoon. The iPhone maker has seen revenue decline for each of its past four reported quarters, and there are questions heading into its earnings report about whether that stretch will extend to a fifth quarter. The consensus view calls for Apple \n        AAPL,\n        -1.06%\n       to have eked out positive growth in the all-important holiday period, with the average forecast calling for $118 billion in sales in aggregate, up 0.7% from the $117.2 billion that Apple posted a year before. Still, the company will be cutting it close, as the December quarter brought continued consumer-spending pressures in China as well as a brief disruption to Apple Watch sales brought about by a patent dispute. While most analysts tracked by FactSet project some sort of revenue growth for Apple, some have forecasts that would imply a decline. See also: Should Apple investors worry about a Justice Department antitrust lawsuit? FactSet has quarterly data going back to 1998, and in that span, Apple has never logged five quarters in a row of year-over-year revenue declines. Wall Street will be most focused on the health of the iPhone business when Apple’s management holds its earnings call — and the Street is particularly interested in iPhone trends in China. “While concerns around iPhone sales in China have been around since Huawei resurgence, our recent supply chain checks don’t show near-term production cuts for [the December and March] and quarters,” Citi Research analyst Atif Malik wrote recently. He noted that while Apple’s market share slipped in China during the calendar fourth quarter based on third-party estimates, the company ended up the top smartphone vendor in the country for the year. Still, he acknowledged that the “patriotism sentiment” that is helping brands like China’s Technologies Co. “could be a near-term headwind for iPhone sales in China.” UBS’s David Vogt saw upside potential for overall Apple revenue in the December quarter, “driven by [a 2 million to 3 million] inventory build of iPhone units in China.” He said that better iPhone performance in the December quarter would come as “a modest relief” but noted that the channel buildup in China “creates risk” for the March quarter. Evercore ISI’s Amit Daryanani chimed in that Apple had the potential to deliver “modest upside” to overall results for the December quarter and with its March-quarter forecast, especially in light of pressure on the stock so far this year. Apple’s stock has lost about 3% in the year to date, while the S&P 500 is up by the same amount. “China risk [is] in focus, but we think emerging-market share gains and developed-market [average-selling-rice] uplift should help [the] iPhone stay stable in December and potentially March,” he said. While iPhones will be the main focal point on the call, investors will also likely want to hear a bit about Apple’s newest device, the $3,499 Vision Pro mixed-reality headset. Whether they get much information there, however, is another story. See more: Apple’s Vision Pro headset is selling out — but what does that really mean? Preorders for the Vision Pro kicked off earlier this month, so the device wasn’t a factor in the just-completed quarter. And Apple doesn’t tend to give numerical specifics on some of its “newer” hardware like the Apple Watch and AirPods. More than eight years out from its launch, the Apple Watch still doesn’t get its own line item on Apple’s financials, so Wall Street probably shouldn’t get too excited about the prospect of useful Vision Pro nuggets. The stock looks like a bet on Trump himself more than a company with significant revenue and profits. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}