{
    "title": "Apple Analyst Sees Soft Holiday Quarter Weighing Down On Stock But Thinks \nOne Data Point Offers Glimmer O",
    "date": "1/10/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36572953/apple-analyst-sees-soft-holiday-quarter-weighing-down-on-stock-but-thinks-one-data-",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Indicators of a challenging December quarter for Apple Inc. AAPL continue to mount, with yet another sell-side analyst expressing concerns about weakness in the crucial holiday period. The Apple Analyst: KeyBanc Capital Markets analyst Brandon Nispel holds a Sector Weight rating on Apple shares. Muted Hardware Outlook: Nispel notes that Apple’s December quarter, marking the company’s first quarter of fiscal 2024, is expected to witness hardware revenue growing by 38% sequentially. This contrasts with the historical three-year average growth of 62% for the quarter and the current consensus estimate of 41% quarter-over-quarter growth. KeyBanc’s deduction is based on its KeyBanc First Look Data, revealing a 27% month-over-month increase in indexed spending in December, below the three-year average of 37%. For the December quarter, indexed spending showed a 2% quarter-over-quarter growth, falling short of the historical 8% growth. See Also: Everything You Need To Know About Apple Stock Mixed Signals on iPhone: Despite the concerning overall outlook, KeyBanc’s December carrier survey brings positive news for Apple. iPhone sell-through tracked in line with store expectations, improving month-over-month. Demand for the iPhone 15 Pro/Max remained robust, while regular 15/Plus demand stayed solid, driven by holiday momentum. Inventory levels declined slightly compared to the previous year, according to the analyst. This contradicted KeyBanc’s FLD, which indicated weaker-than-seasonal iPhone sales growth—26% month-over-month and a negative 12% year-over-year growth. ”Overall, our data is telling us we should expect below-avg. growth for F1Q24,” Nispel said. The analyst said he remained concerned around U.S. upgrade rates and China iPhone sales, among other factors. ”With AAPL trading at 18.3x 2025 adj. EBITDA, vs. the 3/10-yr/peer avg. at 18.9x, 12.1x, and 13.4x, respectively, at best, we see the stock as fairly valued and likely to perform in line with the Nasdaq,” KeyBanc said. Apple ended Tuesday’s session down 0.23% at $185.14, according to Benzinga Pro data. The stock has shed about 4% so far this year amid negative analysts’ actions and the macro worries. Read Next: Samsung Reigns In US Patents, Tesla Stays Out: How Do Apple, Qualcomm, And IBM Compare? © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}