{
    "title": "Big Tech earnings: What markets are expecting this week",
    "date": "1/29/2024",
    "url": "https://finance.yahoo.com/video/big-tech-earnings-markets-expecting-142946351.html",
    "text": "Big Tech is next up at bat to report earnings this week, mainly five of the Magnificent Seven components — Apple (AAPL), Amazon (AMZN), Alphabet (GOOG, GOOGL), Meta Platforms (META), Microsoft (MSFT). Yahoo Finance Markets Reporter Josh Schafer explains market commentary on projected earnings growth for these mega-cap tech companies. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. - And tech is on deck this week. Some of the stock market's largest technology companies set to report earnings. And for more on how the reports may impact markets, we've got Yahoo Finance's very own Josh Schafer to help us give the rundown for the week ahead. JOSH SCHAFER: Yeah, Brad. So you take a look at that list we just showed five of the so-called Magnificent Seven. And when you think about Tesla's performance a week ago, maybe we're talking more of a Super Six here and not a Magnificent Seven. So really, you're only missing NVIDIA in terms of massive tech companies to report this week. And really, guys, I think the story here is understanding how big this is going to be for the overall market and the fundamental story that we're seeing in the stock market. So when you take a look at the earnings projections for the six companies-- I'm going to say six here because we're including NVIDIA in the graphic that we're showing, but they're projected to grow earnings-- this is data from FactSet-- at nearly 54% year over year for the fourth quarter. Look at the other 494 companies. They're expected to have earnings fall 10.5%. So when you think about why stocks move higher and what people are buying, you're buying earnings, right? You want earnings to eventually go up. That is the story of the stock market in the long term. And that's why the short-term story of the stock market has really just been these six stocks. This is what we're waiting for. This is what we-- this is the big moment. - This is what we're waiting for. It's a big moment. And then you pair that also with the jobs data that we're going to be getting out on Friday, the Fed decision on Wednesday. I know you closely are following that as well, Josh. In terms of investors' view on this, in terms of the big driver of the market or the key thing that traders are going to be listening for obviously a lot of that's going to be surrounding the timing of that first cut. But beyond that, what do you think has the potential to move the markets this week? JOSH SCHAFER: Yeah. I mean, it seems like overall, we're still in the soft landing is probably consensus and probably to the upside, right, as far as what people are expecting. So anything that doesn't give us that, when you're thinking maybe a really cool jobs report, perhaps the Fed talking about cutting later than people think or being more restrictive than people think, or I do think the fundamental earnings story from tech because of where the overall S&P is at right now. I did a story over the weekend about the S&P being potentially overvalued and what strategists say about that. Well, they talk about if you really think about what's in the S&P, you're buying future earnings growth, right? And if you get that earnings growth from these big companies, then one could argue the S&P 500 at a record high isn't overvalued, and it has room to keep growing. So you get all three aspects this week, right? We talk about the Fed a lot. That can move your major indexes and move things. We talked about the Mag Seven. We're getting that. And we've got a jobs report on Friday because why not? - So I guess we'll talk on Friday, and we'll decide what the biggest mover was of the week. - Certainly setting up to be a very busy week here potentially for the markets. Josh, great stuff. Thanks so much. Related Quotes "
}