{
    "title": "Apple Stock: Time to Buy the Dip?",
    "date": "1/14/2024",
    "url": "https://www.fool.com/investing/2024/01/14/apple-stock-time-to-buy-the-dip/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Following a great 2023 for Apple (AAPL -1.06%) shares, which soared 48% higher, the stock is taking a breather so far in 2024. Year to date, shares are down more than 3%. Is this an opportunity to buy shares of the iPhone maker, or is the stock's decline justified? To explore whether or not shares are attractive today, let's look at both the bear and bull cases for the tech stock. The bear case for Apple (the case against owning the stock) can be summarized in two points: Regarding the Cupertino-based company's growth, fiscal 2023 revenue fell nearly 3% year over year. Further, earnings per share barely budged, coming in at $6.13 for the period -- up from $6.11 in the year-ago quarter. A pullback in iPhone sales and a dramatic decline in Mac sales weighed on the year's results. Foreign exchange headwinds were also a major factor pulling down revenue and earnings. Also raising some eyebrows is the stock's valuation. Over the last year, the stock's price-to-earnings ratio has gone from 22 to more than 30. Viewed another way, the company has a $2.9 trillion market capitalization despite annual earnings only coming in at $97 billion. This high valuation bakes in robust earnings-per-share growth for years to come. More specifically, a valuation at this level demands average annual earnings-per-share growth in the mid-to-high single digits over the next decade and, more importantly, continued market dominance in lucrative segments like its iPhone and services businesses. But don't count Apple out. The bull case (the case for owning the stock) highlights several reasons the company could deliver strong earnings growth in the coming years. First, there's Apple's fast-growing services segment. This segment, which includes revenue from services like Apple Pay, Apple Music, AppleCare, and revenue share from third-party applications in the App Store, grew 16% year over year in Apple's most recent fiscal quarter. Further, management said the company expects similar growth, when adjusted to exclude revenue from the extra week in the year-ago period, in the first quarter of fiscal 2024. Longer term, there's good reason to expect Apple's momentum in services to persist. The tailwinds for the segment are numerous, including a nascent but meaningful advertising business, Apple's ability to bring new services to market over time, and rapid growth in third-party app subscriptions. Another reason to be bullish on Apple stock is its strong balance sheet combined with management's excellent track record of good capital allocation. The company ended fiscal Q4 with a net cash and marketable securities position of $51 billion. With a goal to become cash neutral (the point at which total cash and marketable securities equals total debt) over time, Apple has been steadily repurchasing its shares and paying dividends. Further, Apple has a history of opportunistically buying back more stock when shares appear cheaper. This prudent approach to repurchases makes every dollar go further than if the company purchased the same amount of shares every quarter no matter where the stock traded. Of course, with annual free cash flow of nearly $100 billion, it's going to take some time for Apple to become net cash neutral. So, investors can expect the company to repurchase shares in substantial sums and pay meaningful dividends for the foreseeable future. Combining these positive developments (a fast-growing services segment and prudent capital allocation backed by a healthy balance sheet) with the company's loyal customer base and Apple's long history of innovation, the tech stock arguably deserves to trade at a premium valuation. While it may not make sense to be an aggressive buyer of Apple stock at this valuation, it may make sense for investors without exposure to the stock to start a small position following its recent dip. Daniel Sparks has no position in any of the stocks mentioned. His clients may own shares of the companies mentioned. The Motley Fool has positions in and recommends Apple. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}