{
    "title": "Forget Apple: 3 \"Magnificent Seven\" Stocks to Buy Instead",
    "date": "1/9/2024",
    "url": "https://www.fool.com/investing/2024/01/09/forget-apple-3-magnificent-seven-stocks-to-buy-ins/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The \"Magnificent Seven\" stocks led the market in 2023, and many believe they will do it again in 2024. This cohort, headlined by the big tech stars, includes: Apple is one of the most prominent companies within this group, especially with its consumer-facing products. It's also the world's largest company, valued at $2.87 trillion (compared to Microsoft's $2.75 trillion). However, I don't think it's worth the investment right now, especially when this group has three better stocks to choose from. Years ago, Apple's stock was reasonably valued. Now, it's not.  AAPL PE Ratio (Forward) data by YCharts Apple's stock trades for around 30 times earnings -- a level reserved for perfectly executing companies growing at an above-market pace. While it's hard to dispute Apple's execution, its revenue shrank every quarter in 2023. As a result, Apple has a long way to go to earn its valuation. However, three stocks within the Magnificent Seven are cheaper and growing faster than Apple, making them superior investments for 2024. Of the remaining six, I think Alphabet, Amazon, and Meta Platforms make for stronger buys. While Alphabet and Meta have other investments and businesses, they are primarily advertising businesses. In late 2022 and early 2023, this industry struggled. However, in Q3, they lapped those comparisons, which allowed their ad divisions to grow much faster than in previous quarters (Meta's ad revenue grew 24% to $33.6 billion, and Alphabet's rose 9.4% to $59.6 billion). The same tailwinds that boosted these two in Q3 will prevail throughout Q4 and 2024, setting them up for a strong year. Amazon also has an ad division, but it didn't experience the same weakness as the other two because its ad segment is relatively new (at least compared to Meta and Alphabet). However, the rise of ads and other high-margin segments marks the transition of Amazon from solely an e-commerce business to one with vital services. As a result, Amazon's gross margins have substantially risen over the past decade with AWS (its cloud computing division), ad services, subscriptions, and third-party seller services.  AMZN Gross Profit Margin (Quarterly) data by YCharts High gross margins allow for better profit margins, which have also risen alongside its gross margin. This paints an optimal picture for Amazon, as it is finally turning the corner to become a consistently profitable business. This is something investors haven't experienced before, making 2024 an exciting year for Amazon. With these three, there is a lot of excitement and buzz about what 2024 could be. With Apple, the consensus is: \"I hope the iPhone weakness doesn't get worse.\" I prefer to invest in more optimistic companies, making these three no-brainers compared to Apple. They're also priced a lot more competitively.  AAPL PE Ratio (Forward) data by YCharts From a forward-looking perspective, Meta and Alphabet are far cheaper than Apple. Historically, these two have traded around the same range as Apple, which means their stocks are slated for strong growth in 2024. Amazon is much harder to compare because it's in an entirely different business and hasn't had a full year of optimized profits. However, if you consider analyst revenue estimates for Amazon's 2024 fiscal year, and if the company can pull off an 8.5% profit margin for the entire year, it will produce nearly $50 billion in profits. With Amazon's current market cap, that would price the stock at 31 times 2024 earnings, which is still more expensive than Apple's valuation. However, that's a short-term view, as Amazon is just starting its optimization journey. As a result, I still think Amazon will outperform Apple by a wide margin over the next few years and could increase its profit margin even more. Apple may have been the stock to own over the past decade, but there are much better options now. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Alphabet, Amazon, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}