{
    "title": "Netflix co-CEO: Vision Pro not worth our time yet",
    "date": "1/26/2024",
    "url": "https://www.businessinsider.com/why-netflix-app-not-on-apple-vision-pro-2024-1",
    "text": "       Netflix co-CEO Greg Peters isn't sold on Apple's Vision Pro yet. Peters, in an interview on Stratechery's \"Daily Update\" podcast, said the decision not to launch a dedicated app for Apple's new Vision Pro headset was \"not by any unwillingness or lack of desire.\" Rather, the streaming giant concluded that integrating an app for the $3,500 mixed-reality device simply wasn't worth the resources at this point. \"We have to be careful about making sure that we're not investing in places that are not really yielding a return,\" he said. \"I would say we'll see where things go with Vision Pro.\" Related stories Peters said Netflix concluded that its main audience would not substantially \"benefit\" from a dedicated app on the Vision Pro. Instead, users of Apple's new headset will have to watch Netflix through the device's web browser instead. \"Certainly we're always in discussions with Apple to try and figure that out but right now, the device is so subscale that it's not really particularly relevant to most of our members,\" he said. His comments speak to deeper concerns surrounding the Vision Pro, which is set to launch next Friday. Despite interest in initial pre-orders extending delivery times by at least a month, prominent Apple analyst Ming-Chi Kuo said that demand for the new headset — which he described as a niche product — could taper off substantially. And while the Vision Pro carries a hefty price tag, consumers may be drawn to cheaper headsets on the market, like the $500 Quest 3 launched by Meta in October. Netflix and Apple did not immediately return a request for comment ahead of publication. Peters acknowledged that there is \"always\" the chance that the success of the Vision Pro could change Netflix's decision. \"[Netflix and Apple] have worked together for a long time, we've always had active discussions to how we could help each other out. Sometimes we find a great space of overlap. We can move very, very quickly. Sometimes it takes a little bit longer.\" Disclosure: Mathias Döpfner, CEO of Business Insider's parent company, Axel Springer, is a Netflix board member. Read next Jump to "
}