{
    "title": "Apple: Avoid This P/E 29x Value Stock Or Bet On Next Innovation \n(NASDAQ:AAPL)",
    "date": "1/8/2024",
    "url": "https://seekingalpha.com/article/4661612-apple-avoid-this-pe-29x-value-stock-or-bet-on-next-innovation",
    "text": "jamesteohart jamesteohart The objective of this article is to outline my thinking on Apple (NASDAQ:AAPL) in a rational, facts-based manner so that investors, who own or are contemplating on going long AAPL have an additional angle of insight when calibrating return expectations of the Stock. At the current share price level, AAPL is a subpar investment providing limited potential for capturing alpha in the foreseeable future. It is priced as growth stock, while the underlying substance resembles pure play value company. At the same time, investors should be extremely careful shorting AAPL given the structural forces stemming from passive flows and other dynamics, which influence the directionality of AAPL, while more or less dismissing the underlying business performance. My recommendation is to avoid AAPL without assuming a short position. So, let me now justify my stance. Currently, AAPL trades at a P/E multiple of 29x, which clearly tells that the market is pricing this as a value stock. One might think that P/E is actually a bad measure and instead I should focus on something, which captures the strength of AAPL's ability to generate cash. Ycharts Ycharts Well, if we assess AAPL's valuation through a P/CF metric, which indeed captures the cash flows better, the end result or conclusion is exactly the same (note that the difference is not material since AAPL is not a capital-intensive business). From the P/CF perspective, AAPL trades way above the 10-year historical norm with the current multiples revolving around all-time highs. This is even despite the fact that the SOFR is significantly above where it was before that should theoretically introduce headwinds on the valuation front. Finally, I really like to use Seeking Alpha valuation table below, which provides a nice overview of where company's valuations are relative to peers and its own history. Seeking Alpha Seeking Alpha Here the conclusion is also very straightforward: i.e., the prevailing multiples of AAPL are relatively unattractive and put pressure on the Company to really justify them so that investors can access solid returns. For instance, a P/E of 29x translates to a fact, where investors, all things remaining constant, would have to wait for ~ 29 years to get fully compensated for the price they paid at these levels. Granted, the notion of potential growth could clearly justify this high multiples. Again, in the context of P/E 29x we would expect a growing business at least on the top-line. Seeking Alpha Seeking Alpha Looking at the table above, we can, however, notice almost a constant sales generation since March 2021 and even a tiny drop at the EBIT level. In fact, the recent results show that AAPL also struggles to shield its historical financial performance result levels. FORM 10-K FORM 10-K For example, AAPL has recorded a sales decline (September 2023 vs. September 2022) in its key income category, which consists of products such as iPhone, iPad and Mac. In 2023, all of the product subcategories experienced a decline, while the only element, which delivered positive rate of change effects was AAPL's services. Now, let's remember two things: So, this is a very subjective topic, where many investors tend to disagree with each other. In the one camp you have investors, who think that, for example, VR, Apple car, and various platform monetization opportunities that are currently not yielding meaningful streams of cash would help AAPL reach the next trillions in the market cap. And in the other camp, you have investors, who think that AAPL is all about the iPhone and that all of these additional business strategies will just burn cash and not compensate for the current multiple. I would put myself somewhere in the middle, and maybe even more biased towards the latter group. Having said that, what is important is AAPL's valuation in the context of the underlying cash generation. Here we have already established that the recent quarters have not lived up to the market's expectations of growth and that the recent rate of change patterns in quarterly results do not send signals of a sudden reversal in this trend. Seeking Alpha Seeking Alpha For 2024 and 2025, the market expects below double-digit growth in the EPS, which is not sufficient to explain the aggressive valuation multiples. Yet, it seems that the market has attached greater probabilities for attractive double-digit EPS growth starting from 2026, which if materialized could for sure boost the AAPL's share price, rewarding the existing investors. So, this really boils down to AAPL's ability to come up with innovative products that could penetrate the market in a notable manner to not only offset the seemingly exhausted iPhone sales potential but also to warrant incremental cash generation, thereby justifying the P/E multiple of 29x. Meantime, while waiting for this to play out, we are left with declining iPhone sales, struggling with other categories, and the fears of the Chinese market, which currently accounts for ~19% of AAPL's business. This just does not seem a good deal for me. Let me just quickly remind you and once again underscore that I am not suggesting to short AAPL. There are two reasons for this. First, since AAPL carries so huge market cap level, it assumes a notable constituency in many ETF structures, which introduce completely different dynamics in the AAPL share price movements that are not necessarily reflective of the underlying (fundamental performance). It is extremely hard to predict and calibrate the potential impact of the passive flows. Second, we have to be cognizant (based on the track record and huge amounts of capital directed to R&D spend) of AAPL's ability to drive innovation and come up with products that really could move the needle in the context of its current revenue generation. So, in case AAPL truly succeeds and develops a new product, which would help secure high double digit growth offsetting the downward pressure from core product sales, the short seller would get seriously hurt. Finally, by avoiding AAPL there is a considerable probability of suffering from the opportunity cost that is associated with not going on AAPL, while the Company's share price keeps going up. Not that recent history has shown that exactly this type of thinking has robbed the investors of the opportunity to capture juicy returns. Namely, AAPL's expensive multiple is nothing new and present since early 2021 or the period when the underlying performance started to stagnate. Yet, if we, say, take a look at the 3-year historical total return performance, AAPL is up by 45% or ~15% above the S&P 500. Given the combination of stagnating performance (and event recent declines in core product sales), notable exposure to China, which is a huge risk factor theoretically requiring higher discount rate, and rich valuations, going long AAPL seems like a suboptimal choice for investors. As the market has baked into the cake an elevated growth starting from 2026 and up until then EPS growth of just ~7.5%, AAPL has a bit more relaxed expectations to meet to avoid negative repricing of its shares. Yet, given the recent dynamics in the core product sales and no indications of AAPL's ability to change this trajectory (even the opposite considering the geopolitical and macroeconomic headwinds), I highly doubt that AAPL will manage to deliver on these expectations. As a result of this, in my view, AAPL is a hold with a preference to trim down any position that is allocated in this Stock. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}