{
    "title": "Apple Maps errors show small businesses as closed down, costing thousands \nof dollars",
    "date": "1/23/2024",
    "url": "https://9to5mac.com/2024/01/23/apple-maps-errors-small-businesses/",
    "text": "Apple Maps errors have reportedly been costing small businesses thousands of dollars, by incorrectly showing them as permanently closed. Business owners also say that it can be hard to correct the error, despite going through the process Apple recommends … Australia’s ABC News highlighted one example, where not even media attention could get the problem fully resolved. Chris Pyatt and his wife Pum have been running Thai restaurant Pum’s Kitchen on Queensland’s Sunshine Coast for nearly a decade […] It was only when a regular customer called to ask why he had shut his restaurant that Chris Pyatt found out his small business had been listed as “permanently closed” on Apple Maps, leaving him with a costly problem. The restaurant said the mistake cost them around AU$12,000 (almost US$8,000). “We have no idea when this change went through,” Mr Pyatt said. “But we have seen a sudden and drastic change in customer behaviour towards the end of November and all of December. We’ve noted a significant downturn, of around $12,000. This is our livelihood.” As a small business owner, I found it was easier to correct location data errors by reporting them through Apple Maps using my personal Apple ID than it was through the Apple Business Connect platform using a business account. I assume that since Apple doesn’t sell ads in Maps (yet), they have prioritized reports from their own customers using Apple devices over reports from business owners. Google makes it easier for businesses owners to update location information through the Google Business Profile, but this is largely driven by its incorporation into Google Ads. When he called Apple to try to get the problem fixed, the company initially said it couldn’t help as he didn’t own any Apple devices. He was subsequently able to use a web browser to follow Apple’s instructions to open an Apple business account, claim the business, and mark it as open – but the Apple Maps app didn’t update the info. Even when ABC News called Apple, it wasn’t fully resolved: Apple Maps started showing the business as open, but now in the wrong location! Web searches show that hundreds of other small businesses have experienced similar problems. Tech expert Erica Mealy from the University of the Sunshine Coast said there were hundreds of posts on Apple Forums, as well as sites like Reddit and Quora, from business owners experiencing similar issues. Via Patently Apple. Photo by Ravi Palwe on Unsplash. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Apple Maps is Apple's map application that's pre… Ben Lovejoy is a British technology writer and EU Editor for 9to5Mac. He’s known for his op-eds and diary pieces, exploring his experience of Apple products over time, for a more rounded review. He also writes fiction, with two technothriller novels, a couple of SF shorts and a rom-com! "
}