{
    "title": "Where Will Apple Stock Be in 3 Years?",
    "date": "2/5/2024",
    "url": "https://www.fool.com/investing/2024/02/05/where-will-apple-stock-be-in-3-years/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More By looking at its current market cap of $2.9 trillion, investors can easily come to the conclusion that Apple (AAPL -1.06%) has been a fantastic stock historically. Just in the last five years, shares have soared 348%, crushing the broader Nasdaq Composite index. But this top FAANG stock currently sits 6% below its peak price from last December (as of Feb. 1). So, some investors might be ready to buy the dip. As we look out over the next three years, where will Apple stock be? Let's consider some important factors that investors should be looking at. Despite being launched as far back as 2007 and having more than a dozen different iterations over the years, Apple still depends heavily on the iPhone for its financial success. In the most recent quarter (Q1 2024 ended Dec. 30), this popular smartphone raked in $69.7 billion of revenue, representing 58% of Apple's total. That's not necessarily a bad thing on the surface, but the issue is that the iPhone is registering slower growth these days. Its revenue in Q1 2024 was up 6% compared to the year-ago period. This points to the maturity of the iPhone. To its credit, the product's pricing power has resulted in the iPhone representing roughly 80% of the industry's operating income. But with upgrades becoming less and less revolutionary, it's easy for consumers to hold off buying a new device. Apple has other popular hardware products, like the iPad, MacBook, Watch, and AirPods, that could potentially drive growth over the years. And there are still rumors swirling around that the business is working on an autonomous vehicle that could be released in a few years. All of these could help move the needle financially for the company and lead to less focus on the iPhone. Nonetheless, I think in three years, the iPhone will still be a major driver of business results. Generating 19% of revenue in the most recent fiscal quarter, Apple's services registered growth of 11% year over year, which was faster than the products segment. This division includes a variety of offerings, like iCloud, Music, Pay, Fitness+, and TV+. On their own, the services might not be anything too special. But because they help to differentiate Apple's hardware products, they are what makes up the company's ecosystem. In other words, buying a piece of hardware from Apple might provide the business with a one-time sale, but it's the growth of software and services that keeps users engaged and helps generate recurring revenue. The segment posted an impressive gross margin of 72.8% in Q1. There's no reason to believe that software won't continue to report faster revenue growth than products for the foreseeable future. And this could help lift profitability for the company overall going forward. Now that you have some understanding of the two key components of Apple's business, we can try to figure out how the stock will perform over the next three years. Bullish investors are certainly hoping that the company's historical streak of rewarding shareholders can continue. Thanks to its impressive outperformance in the past, Apple shares are far from cheap. They trade at a price-to-earnings ratio of 30.5, which is significantly more expensive than their trailing-10-year average of 20.9. This is a very expensive stock that is priced for perfection. If Apple was reporting monster growth, then maybe paying that valuation would make sense. But this is a much more mature enterprise, so growth would have to seriously pick up to justify paying a premium valuation. Consequently, I wouldn't be surprised if Apple's stock underperforms the Nasdaq Composite index between now and the start of 2027. Neil Patel and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}