{
    "title": null,
    "date": "2/4/2024",
    "url": "https://www.fool.com/investing/2024/02/04/after-skyrocketing-why-does-buffett-own-apple/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Many people believe that Warren Buffett is the greatest investor ever. As the longtime CEO of Berkshire Hathaway, he has held many winning investments. Perhaps his most successful is Apple (AAPL -1.06%). The conglomerate first started buying shares in the iPhone maker during the first quarter of 2016. And since the start of that year, shares have skyrocketed an incredible 615%. A whopping 45.7% of Berkshire's entire portfolio is represented by just Apple. With such a high weighting, coupled with a market cap of $2.9 trillion and a price-to-earning (P/E) ratio of 30.4, it forces one to wonder why the Oracle of Omaha still owns Apple today. I think there are four reasons why this might be the case. Buffett's investment strategy has long focused on finding outstanding businesses and aiming to hold them for a long time. In fact, his favorite holding period is forever. Apple has the makings of a forever stock. Its incredibly powerful brand supports its economic moat. And because customers are also using the company's software and services more, Apple has an ecosystem that drives stickiness. These traits have helped support the business's financial success. The added benefit of having an indefinite holding period is that it doesn't trigger a taxable event. This means compounding isn't interrupted unnecessarily. When picking stocks to invest in, the hope is that they can beat the market over the long term. Despite its huge market cap and premium valuation, Buffett might still believe that Apple has the potential to produce strong returns going forward. With dividends reinvested, the S&P 500 has historically returned an average of about 10% per year. This is a difficult hurdle for most active managers to beat. But Buffett may think there is a high chance that Apple can outperform the broader index. If this is the case, then there's absolutely no reason why he should sell, especially since he probably has expert knowledge about the business after owning it for all these years. Berkshire owns a 5.9% stake in Apple thanks to its holding of nearly 916 million shares. This massive position provides a financial windfall. Apple pays a dividend that yields a measly 0.52%. But based on the current quarterly payout of $0.24, Buffett's firm receives an annualized $879 million from its equity position in the tech giant. Apple uses the vast majority of its free cash flow to retire its outstanding stock. From the end of fiscal 2018 through the end of 2023, the business saw its share count shrink by 21%, a capital-allocation policy that increases Berkshire's ownership stake. In this instance, it's very easy to come up with reasons for why Apple should be sold right now. But let's also consider the opportunity cost. If Buffett sold the entire position today, what would Berkshire do with the almost $170 billion in proceeds? This sizable cash infusion would only exacerbate the conglomerate's problem. It already has $152 billion in cash, cash equivalents, and U.S. Treasury bills on the balance sheet, a sum that Buffett hasn't seemed to have had much use for in terms of finding compelling investments. He would likely have no idea what to do with more money that would come from selling Apple. This tells me that even though a valid argument can be made that at its current size and expensive valuation it should be sold, Apple still provides a better potential return than just holding cash. This might be what Buffett is thinking. Neil Patel and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}