{
    "title": "Apple's EV project screeches to halt, AI its new focus - Chinadaily.com.cn",
    "date": "2/29/2024",
    "url": "http://epaper.chinadaily.com.cn/a/202403/01/WS65e11378a310df4030f4fc4d.html",
    "text": " After spending billions of dollars and a decade on research, Apple is reportedly dropping building an electric car and will use some of the project's staff members to focus on artificial intelligence. At an annual shareholder meeting held virtually on Wednesday, CEO Tim Cook said the company is pouring money into AI. The iPhone maker sees \"incredible breakthrough potential for generative AI, which is why we're currently investing significantly in this area\", Cook said. \"We believe that will unlock transformative opportunities for users when it comes to productivity, problem solving and more.\" Cook also shared a major announcement coming this year, CNBC reported. \"Later this year, I look forward to sharing with you the ways we will break new ground in generative AI, another technology we believe can redefine the future,\" he said. But Cook, who began the EV project after he took over as CEO from co-founder Steve Jobs in 2011, did not mention dropping the project, Bloomberg reported on Tuesday. Unnamed sources told Bloomberg that Apple told employees in an internal meeting on Tuesday that it had scrapped the EV project and that many of the 2,000 people said to be working on the project would be shifted to different roles, including in Apple's AI division. \"This is a smart and long-awaited decision,\" Ray Wang, founder and CEO of Silicon Valley-based consultancy Constellation Research, told the BBC.\"The market demand for EVs is not there, and AI is where all the action is.\" Dan Morgan, a senior portfolio manager at Apple shareholder Synovus Trust, told The Wall Street Journal that Apple canceling this project is \"a sigh of relief for us\". \"When you looked at Apple's future initiatives, the car project was always the most far-fetched for Apple. This just isn't in their wheelhouse,\" Morgan said. Instead, it is better that Apple will be redeploying engineers and investments into areas such as AI that could help its consumer electronics business, he said. Apple dropping the EV project comes as consumer and investor enthusiasm in the United States for electric vehicles is waning because of financing costs. US automakers have also been shifting plans to account for the softer EV demand. General Motors said it would begin to rely on hybrid sales in North America, and Volvo in Sweden said it was pulling future funding from its EV company Polestar. aiheping@chinadailyusa.com  Copyright 1995 -  . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. "
}