{
    "title": "Apple fans in China can't buy the Vision Pro yet, so they're lining up to \nrent it by the hour or day",
    "date": "2/28/2024",
    "url": "https://ca.finance.yahoo.com/news/apple-fans-china-cant-buy-170107873.html",
    "text": "Apple's Vision Pro hasn't launched in China yet. Chinese denizens can rent the Apple Vision Pro for as low as $13 an hour, SCMP reported. Some third-party vendors are seeing lines of customers eager to get their hands on the headset. People living in China are eager to try out the Apple Vision Pro before it launches in the country — and some are lining up to rent the headsets from third-parties, the South China Morning Post reported. Dozens of advertisements to rent Apple's mixed reality headset — which retails for $3,500 in the US — are popping up across Chinese sites like Alibaba Group Holding's Xianyu and Zhuan Zhuan, according to ads seen by the news outlet. Rental prices ranged from around $13.62 US dollars (98 yuan) per hour to roughly $208 (1500 yuan) per day, according to the Post. Some ads said merchants require a deposit of at least $4,168 (or 30,000 yuan) while others give renters the option to purchase the device after they use it. It's unclear how Chinese third-party vendors get their Apple Vision Pros. Vision Space, a Beijing-based VR startup offering Vision Pro rentals, said that one of its brick-and-mortar stores received more than 10,000 customers just two days after the device hit the US market, SCMP reported, with people lining up. The VR firm could not be reached for additional comment. So far, these rentals seem to be well-received. One Vision Pro merchant told the South China Morning Post that customers were pleased by the device and that some were considering buying it. While Apple CEO Tim Cook reportedly said the headset will \"soon\" be available in China, one of its largest markets, a release date hasn't been set. Apple didn't immediately respond to Business Insider's request for comment ahead of publication. When it does, the third-party vendors renting the headsets will likely have some competition from Apple itself. In the US, Apple offers free, 30-minute demos of the headset that are guided by an Apple retail employee. For people interested in enjoying some time with a Vision Pro in their own home, however, third-party vendors aren't just leasing the headsets in China. Photography equipment rental companies like Lensrentals and ShareGrid appear to be offering their own Apple headset rentals starting at $120 a day. Are you using the Apple Vision Pro in an interesting way? BI would like to hear about it. Contact reporter Aaron Mok at amok@insider.com. Read the original article on Business Insider \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th Trade 24 hours a day on the world's most popular platform. This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids  Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt  Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone  They soft-launched their relationship at the supermodel's cookbook event in Miami. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret.  The \"Late Night\" comedian brutally summed up the former president's media company. Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair.  \"We love to cook and we have the family together,\" Richards tells PEOPLE Public disagreements about how to handle immigration resulted in U.S. Rep. Alexandria Ocasio-Cortez reminding Elon Musk he is an immigrant himself. Leaks from a notoriously sketchy data broker have revealed the locations of hundreds of people who visited convicted pedophile Jeffrey Epstein's Bahaman island before his 2019 arrest and subsequent death behind bars. In an investigation, Wired reports that the firm in question, Near Intelligence, "
}