{
    "title": "Amazon, Apple, Meta, Nvidia are good but...: Aswath Damodaran dissects 7 \nSamurai",
    "date": "2/11/2024",
    "url": "https://www.businesstoday.in/markets/global-markets/story/amazon-apple-meta-nvidia-are-good-but-aswath-damodaran-dissects-7-samurai-417021-2024-02-11",
    "text": "Feedback Amazon, Apple, Alphabet, Meta, Microsoft, Nvidia, Tesla added $5.1 trillion to their market cap in 2023, accounting for about 55% of the $9.2 trillion done in the year by all 6658 US companies. In his blog, Aswath Damodaran, often referred to as the 'Dean of Valuation', says excluding the seven stocks -- or Seven Samurai -- from the portfolio of 6658 US stocks, investing between 2012 and 2023, creates a 17.97% shortfall in end value. \"This would suggest that any portfolio that did not include any of these seven stocks during the last decade would have faced a very steep, perhaps even insurmountable, climb to beat the market,\" says Damodaran, who teaches finance and equity valuation at NYU's business school said. At a $12 trillion market cap, the 'Magnificent Seven' are now worth more than all listed Chinese stocks. Among the Seven Samurai, Nvidia and Meta were top performers, with the chip maker more than tripling in value. Microsoft and Apple each added a trillion dollars to their market caps during the year, solidifying their positions as key players in the market resurgence. Damodaran says there is \"implicit belief that their market dominance is unprecedented, but it is  not\". He attributes the rise of the Mag Seven stocks to correction/momentum story, where 2023 just represented a reversal of the losses in 2022. During the course of 2023, the Mag Seven, Damodaran says, also exhibited pricing power and product demand resilience. With Mag Seven, debt concerns are also on the back burner. The \"winner-take-all economics\" also played a crucial role, underscoring a shift from a manufacturing to a technology-driven global economy. “I don't think it is debatable that investors have not only bought into the dominant player story (coming from the winner-take-all economics), but have also anointed these seven companies as leaders in the race to dominance in each of their businesses,\" Damodaran writes. But Damodaran has a word of catuion. He notes that on every pricing metric, the Mag Seven stocks trade at a premium over the rest of the stocks in the S&P 500, and therein lies the weakest link in pricing. \"That premium can be justified by pointing to higher growth and margins at the Mag Seven stocks, but that is followed by a great deal of hand waving, since how much of a premium is up for grabs\". \"The Mag Seven are clearly great businesses, but to assess whether they are good investments, you have to get a mismatch between your perceptions of a company and other investors' perceptions of the same company\". Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}