{
    "title": "Apple Rolls Out Quantum-Proof Encryption For iMessage Amid Possible Hacking \nThreats",
    "date": "2/21/2024",
    "url": "https://www.forbes.com/sites/tylerroush/2024/02/21/apple-rolls-out-quantum-proof-encryption-for-imessage-amid-possible-hacking-threats/",
    "text": "Apple will roll out an iMessage update guarding against future hacking threats through quantum computing, the company announced Wednesday, following warnings by government agencies and tech executives suggesting protections are needed to guard against threats from advanced computers. TKTK The update—which will be applied to all iPhones this year—includes a new encryption standard for iMessage that will periodically reissue encryption keys to the app, making it harder for hackers to gain access, Apple said. Current encryption standards could be attacked using a “sufficiently powerful quantum computer” and hackers who have collected “large amounts of today’s encrypted data” for reference, according to Apple. Apple said it hasn’t identified any evidence of a successful attack on the new encryption standard, which the company calls PQ3, though it noted quantum computers capable of cracking the old standard “don’t exist yet.” Apple’s new security protocols “surpass those in all other widely deployed messaging apps” like Signal, an encrypted messaging service, the company said. Similar protections for other Apple products are being developed, including iCloud, according to the company. Chinese government officials claimed last month a Beijing-based forensic lab managed to crack Apple’s encryption for AirDrop. China’s Judicial Bureau said the lab analyzed encrypted logs on a recipient’s iPhone and created a tool that could decipher the AirDrop sender’s phone numbers and emails. The tool helped police “identify suspects” who were using AirDrop for “malicious purposes,” like sending “illegal pictures, videos, audio” while “illegally delivering and spreading bad information to nearby people in crowded places such as subways, buses and shopping malls.” It was not immediately clear whether any arrests were made because of the breakthrough. A bill calling for cybersecurity standards protecting against possible threats from quantum computers—capable of solving complex problems faster than classic computers—was announced in 2022. The National Institute of Standards and Technology and Homeland Security subsequently released new standards for cybersecurity, indicating quantum computers pose risks while working at “unprecedented speed and power in computing.” Separately, the Cybersecurity and Infrastructure Agency warned against potential threats from quantum computing and said “early planning is necessary.” Ana Paula Assis, a general manager for IBM, suggested last month quantum computing would create a “cybersecurity armageddon,” according to Bloomberg. Most companies don’t have a roadmap for protecting against hacking threats posed by AI or quantum computers, according to SandboxAQ CEO Jack Hidary, who claimed banks could need eight to 10 years to implement proper standards. China Claims It Has Cracked Apple’s AirDrop To Identify Senders Of Inappropriate Speech (Forbes)  "
}