{
    "title": "Apple Ask: Support staff reportedly testing AI tool to help answer your \nquestions",
    "date": "2/23/2024",
    "url": "https://9to5mac.com/2024/02/23/apple-ask-support/",
    "text": "A limited number of Apple support staff are reportedly using an internal AI tool to help answer customer questions. The tool is reportedly known as Apple Ask. The ChatGPT-style tool lets advisors paste in or paraphrase a support question, and the AI then searches Apple’s internal knowledge base to generate answers … MacRumors reports that Apple is encouraging to use the tool as their first port of call for any question they are unable to answer themselves. Apple encourages participating advisors to use “Ask” before using traditional search methods or consulting a senior advisor for info, and it says the tool is useful for solving complex or unfamiliar issues. As the tool is linked to Apple’s internal knowledge base, the company ensures that the responses are factual, traceable, and useful […] Advisors can rate an answer as “helpful” or “unhelpful” [and] can ask up to five follow-up questions per topic. The company reportedly plans to make Ask available to more advisors after this phase of testing. We first learned last summer that Apple had created its own ChatGPT-style AI system for internal use, which has been dubbed AppleGPT. According to Gurman, Apple is internally testing a generative AI chatbot it developed that some are calling Apple GPT. The project uses a framework called “Ajax” that Apple started building in 2022 to base various machine learning projects on a shared foundation. We’re expecting iOS 18 to include a major upgrade to Siri, with ChatGPT-style capabilities. A next generation Siri version is set to be powered by a generative AI chatbot, with analysts expecting it to be launched with iOS 18, and announced at this year’s WWDC […] Almost half of Apple’s AI job postings now include the term “Deep Learning”, which relates to the algorithms powering generative AI — models that can spew out humanlike text, audio and code in seconds. While Apple has been criticized for allowing Siri to lag behind generative AI, research papers suggest that the company is looking not just to catch up with systems like ChatGPT, but to overtake them. AI systems like ChatGPT do all their processing on remote servers, but Apple has a far more ambitious objective: using on-device processing. Additionally, while LLMs are all about generating text responses, Apple is also working on using text instructions to carry out photo editing, and using a single image and text instructions to generate animated video. Photo by Charanjeet Dhiman on Unsplash FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Ben Lovejoy is a British technology writer and EU Editor for 9to5Mac. He’s known for his op-eds and diary pieces, exploring his experience of Apple products over time, for a more rounded review. He also writes fiction, with two technothriller novels, a couple of SF shorts and a rom-com! "
}