{
    "title": "BKM Wealth Management LLC Buys New Position in Apple Inc. (NASDAQ:AAPL)",
    "date": "3/28/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-aapl-sec-filing-2024-03-28/",
    "text": "BKM Wealth Management LLC acquired a new position in Apple Inc. (NASDAQ:AAPL - Free Report) during the 4th quarter, according to its most recent 13F filing with the Securities and Exchange Commission. The institutional investor acquired 43,863 shares of the iPhone maker's stock, valued at approximately $8,445,000. Apple comprises 0.5% of BKM Wealth Management LLC's portfolio, making the stock its 7th biggest holding. Several other institutional investors also recently bought and sold shares of the company. Moneta Group Investment Advisors LLC boosted its holdings in Apple by 116,483.5% in the fourth quarter. Moneta Group Investment Advisors LLC now owns 569,554,722 shares of the iPhone maker's stock valued at $74,002,245,000 after purchasing an additional 569,066,184 shares in the last quarter. Norges Bank acquired a new stake in shares of Apple in the 4th quarter worth approximately $21,746,940,000. Morgan Stanley increased its stake in Apple by 14.2% in the 4th quarter. Morgan Stanley now owns 208,655,323 shares of the iPhone maker's stock valued at $27,110,586,000 after purchasing an additional 25,926,552 shares in the last quarter. Barclays PLC boosted its position in shares of Apple by 60.0% in the 2nd quarter. Barclays PLC now owns 46,932,352 shares of the iPhone maker's stock worth $9,103,464,000 after buying an additional 17,604,799 shares in the last quarter. Finally, Osaic Holdings Inc. grew its stake in Apple by 154.9% in the 2nd quarter. Osaic Holdings Inc. now owns 23,295,770 shares of the iPhone maker's stock valued at $1,729,270,000 after acquiring an additional 14,157,430 shares during the last quarter. 60.41% of the stock is owned by institutional investors and hedge funds. In related news, Director Arthur D. Levinson sold 100,000 shares of the business's stock in a transaction dated Thursday, February 29th. The stock was sold at an average price of $180.94, for a total transaction of $18,094,000.00. Following the transaction, the director now directly owns 4,434,576 shares in the company, valued at $802,392,181.44. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available at this hyperlink. 0.06% of the stock is owned by corporate insiders. AAPL traded down $1.83 during midday trading on Thursday, reaching $171.48. The company's stock had a trading volume of 65,623,339 shares, compared to its average volume of 62,001,594. The company has a current ratio of 1.07, a quick ratio of 1.02 and a debt-to-equity ratio of 1.28. The company has a fifty day simple moving average of $181.50 and a 200 day simple moving average of $182.66. The stock has a market cap of $2.65 trillion, a P/E ratio of 26.71, a PEG ratio of 2.05 and a beta of 1.29. Apple Inc. has a twelve month low of $159.35 and a twelve month high of $199.62. Apple (NASDAQ:AAPL - Get Free Report) last announced its quarterly earnings data on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share (EPS) for the quarter, topping the consensus estimate of $2.09 by $0.09. The business had revenue of $119.60 billion for the quarter, compared to the consensus estimate of $117.99 billion. Apple had a net margin of 26.16% and a return on equity of 156.04%. Apple's quarterly revenue was up 2.1% on a year-over-year basis. During the same quarter last year, the company posted $1.88 earnings per share. Research analysts expect that Apple Inc. will post 6.55 earnings per share for the current year. The business also recently disclosed a quarterly dividend, which was paid on Thursday, February 15th. Stockholders of record on Monday, February 12th were given a dividend of $0.24 per share. This represents a $0.96 dividend on an annualized basis and a dividend yield of 0.56%. The ex-dividend date of this dividend was Friday, February 9th. Apple's dividend payout ratio is currently 14.95%. A number of equities analysts have recently weighed in on the stock. Redburn Partners downgraded shares of Apple to a \"neutral\" rating and set a $200.00 price objective on the stock. in a research note on Wednesday, January 10th. DA Davidson began coverage on Apple in a research note on Wednesday, January 3rd. They set a \"neutral\" rating and a $166.00 price target on the stock. Rosenblatt Securities reiterated a \"neutral\" rating and issued a $189.00 target price on shares of Apple in a research note on Tuesday, March 5th. Oppenheimer restated an \"outperform\" rating and issued a $200.00 price target on shares of Apple in a report on Friday, February 2nd. Finally, Redburn Atlantic lowered shares of Apple from a \"buy\" rating to a \"neutral\" rating and set a $200.00 price objective on the stock. in a report on Wednesday, January 10th. One analyst has rated the stock with a sell rating, twelve have assigned a hold rating, twenty-one have given a buy rating and one has assigned a strong buy rating to the stock. According to data from MarketBeat, the company has a consensus rating of \"Moderate Buy\" and a consensus price target of $204.53. Read Our Latest Research Report on Apple Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.See AlsoFive stocks we like better than AppleInsider Selling Explained: Can it Inform Your Investing Choices?3 Value Stocks Too Small For Buffett’s PortfolioWhat Does a Stock Split Mean? Foot Locker Builds Up Another Head of Steam; Gains ImminentWhat is the Dow Jones Industrial Average (DJIA)?Disney Stock Catches 3 Upgrades In a Single Week  Before you consider Apple, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Apple wasn't on the list. While Apple currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering when you'll finally be able to invest in SpaceX, StarLink, or The Boring Company? Click the link below to learn when Elon Musk will let these companies finally IPO. Discover three of the top stocks favored by members of Congress over the past 90 days using MarketBeat's tool to track Congressional trades. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}