{
    "title": "Leaked Images of iPhone 16 Cases Reveal The Biggest Change in Design Coming \nto The Standard Models",
    "date": "3/30/2024",
    "url": "https://wccftech.com/iphone-16-leaked-cases-shows-design/",
    "text": "Apple will announce the iPhone 16 lineup later this year in September, and third-party case manufacturers have already started developing designs for the forthcoming devices. Third-party accessory makers usually start making products ahead of the device's release to save time and offer their product ahead of launch to beat the competition. We now have our first look at the iPhone 16 cases, which share details on the design of the device. Apple has been testing a wider range of designs for the iPhone 16 models over the past few months, and it appears that the company is bringing back the iPhone X-like look. While there are some key differences, the overall design language is pretty similar to the iPhone X, and it raises the question of whether the company has run out of ideas for its upcoming devices. Nonetheless, the new design will give the iPhone 16 a new look and feel compared to the current iPhone 15 and iPhone 15 Plus. We have previously covered that the company is opting for a vertical layout for the cameras on the iPhone 16, and the design shift could bolster features like Spatial Video support for the new devices. It can be seen in the images (via Sonny Dickson) that the case for the iPhone 16 houses cutouts that reflect a vertical layout of the cameras. In comparison to the iPhone X, the vertical camera layout is quite large, as sensor sizes have increased over the past few years. The iPhone 16 will feature the Wide and Ultra Wide sensors inside the pill-shaped plateau. The microphone would rest alongside the cameras, but the flash is seen to be located outside of the camera bump. Currently, the iPhone 15 and iPhone 15 Plus come with a diagonal camera layout, a design that Apple introduced with the iPhone 13 and iPhone 13 mini. Apart from the vertical camera layout, the iPhone 16 and iPhone 16 Plus will also house a handful of additional changes that will enhance the functionality of the devices while being more user-friendly. For instance, we have previously heard that the company is planning to introduce the Action Button on all four models of the iPhone 16, similar to the iPhone 15 Pro models. Other than this, past reports have also suggested that Apple is planning to introduce a new Capture Button. The Capture Button would solely respond to the camera features on the iPhone 16 lineup, potentially the video-taking capabilities. Due to the capacitive nature of the button, the Capture Button could respond to partial and full presses to register different commands. Possibly, pressing the button halfway could focus the subject in the frame, while a full press will act as the shutter button, similar to how DSLR cameras work. We will keep you guys updated on the latest, so be sure to stick around. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}