{
    "title": null,
    "date": "3/23/2024",
    "url": "https://www.latestly.com/technology/apple-layoffs-2024-as-tech-giant-cancels-its-in-house-microled-display-project-for-apple-watches-dozens-of-roles-might-be-eliminated-says-report-5841807.html",
    "text": "Mumbai, March 24: Apple reportedly cancelled its ambitious car project a few weeks ago after realising there was no need to make the car to control its software experience. Besides the car project, Apple was also reported to have halted its microLED display development project for its upcoming Apple Watches. Earlier, it was said the company was developing AI for its iPhone 16 and other products. However, it was reported that Apple was in conversation with Google about bringing Gemini AI to its phones. According to a report by Times of India, Apple cancelled its long-running project to develop microLED screens due to problems like high production costs and other technical challenges. The report highlighted that Apple's project took seven years to develop an in-house microLED display for its Apple Watches. The reports said that the company offered alternative solutions to the technology it is currently using and offered the required brightness and vibrant visuals. Paytm Layoffs: Paytm’s Parent Company One97 Denies Reports Suggesting 25–50% Job Cuts in Business Segments After Praveen Sharma Steps Down As SVP. According to the report, Apple wanted complete control of its microLED screen in-house project, nicknamed 'T159'. The tech giant wanted to offer an energy-efficient, slimmer, and colour display. Apple also built a separate facility for producing the screen in Santa Clara, where it reportedly employed hundreds of employees. Aitana AI Model: First Virtual Model From Spain Who Earns up to 10,000 Euros per Month, Check Details. The report said Apple might plan to reorganise the teams capable of handling the \"display engineering\". Following the reorganisation, the company could eliminate specific roles in the United States and Asia. The report mentioned that the Apple electric car project affected some employees, and they were allowed to look for other roles within the company. Just like that, the workers affected by the Apple microLED project could be given opportunities. However, the report highlighted that if Apple cannot find suitable jobs within the company, layoffs will begin, and they will be provided with severance. (The above story first appeared on LatestLY on Mar 24, 2024 11:29 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com). Copyright © Latestly.com All Rights Reserved. "
}