{
    "title": "Apple Inc. (NASDAQ:AAPL) Shares Sold by Sugarloaf Wealth Management LLC",
    "date": "3/11/2024",
    "url": "https://www.defenseworld.net/2024/03/11/apple-inc-nasdaqaapl-shares-sold-by-sugarloaf-wealth-management-llc.html",
    "text": "Posted by Defense World Staff on Mar 11th, 2024 Sugarloaf Wealth Management LLC trimmed its stake in shares of  Apple Inc. (NASDAQ:AAPL – Free Report) by 7.1% in the third quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission. The firm owned 55,898 shares of the iPhone maker’s stock after selling 4,297 shares during the period. Apple comprises about  2.2% of Sugarloaf Wealth Management LLC’s holdings, making the stock its 11th biggest position. Sugarloaf Wealth Management LLC’s holdings in Apple were worth $9,570,000 at the end of the most recent reporting period. A number of other hedge funds and other institutional investors also recently modified their holdings of the stock. Vanguard Group Inc. lifted its position in shares of  Apple by 0.7% during the 1st quarter. Vanguard Group Inc. now owns 1,269,995,750 shares of the iPhone maker’s stock valued at $221,753,959,000 after acquiring an additional 8,734,393 shares during the period.  State Street Corp increased its stake in shares of  Apple by 0.5% during the 2nd quarter. State Street Corp now owns 578,897,858 shares of the iPhone maker’s stock worth $112,288,818,000 after purchasing an additional 2,616,084 shares in the last quarter.  Moneta Group Investment Advisors LLC increased its stake in shares of  Apple by 116,483.5% during the 4th quarter. Moneta Group Investment Advisors LLC now owns 569,554,722 shares of the iPhone maker’s stock worth $74,002,245,000 after purchasing an additional 569,066,184 shares in the last quarter.  Geode Capital Management LLC increased its stake in shares of  Apple by 2.2% during the 2nd quarter. Geode Capital Management LLC now owns 291,538,165 shares of the iPhone maker’s stock worth $56,396,763,000 after purchasing an additional 6,367,053 shares in the last quarter.  Finally, Price T Rowe Associates Inc. MD increased its stake in shares of  Apple by 3.4% during the 1st quarter. Price T Rowe Associates Inc. MD now owns 234,017,381 shares of the iPhone maker’s stock worth $38,589,468,000 after purchasing an additional 7,736,013 shares in the last quarter. 58.51% of the stock is currently owned by institutional investors and hedge funds. A number of research analysts have recently weighed in on AAPL shares. Citigroup  reissued a “buy” rating and set a $225.00 price objective on shares of Apple in a research note on Friday, February 16th. DA Davidson assumed coverage on shares of Apple in a research note on Wednesday, January 3rd. They set a “neutral” rating and a $166.00 price objective for the company. Piper Sandler lowered their target price on shares of Apple from $205.00 to $190.00 and set a “neutral” rating for the company in a research note on Friday, February 2nd. Redburn Partners cut shares of Apple to a “neutral” rating and set a $200.00 target price for the company. in a research note on Wednesday, January 10th. Finally, Rosenblatt Securities  reaffirmed a “neutral” rating and issued a $189.00 target price on shares of Apple in a research note on Tuesday, March 5th. One research analyst  has rated the stock with a sell rating, eleven have given a hold rating, twenty-one have issued  a buy rating and one  has issued  a strong buy rating to the stock. According to MarketBeat, Apple currently has an average rating of “Moderate Buy” and a consensus target price of $205.27. Check Out Our Latest Research Report on AAPL In other Apple news, Director Arthur D. Levinson sold 100,000 shares of the business’s stock in a transaction on Thursday, February 29th. The shares were sold at an average price of $180.94, for a total value of $18,094,000.00. Following the transaction, the director now owns 4,434,576 shares in the company, valued at approximately $802,392,181.44. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this link. 0.06% of the stock is currently owned by company insiders. NASDAQ:AAPL opened at $170.73 on Monday. Apple Inc. has a twelve month low of $147.61 and a twelve month high of $199.62. The company has a current ratio of 1.07, a quick ratio of 1.02 and a debt-to-equity ratio of 1.28. The firm has a market capitalization of $2.64 trillion, a price-to-earnings ratio of 26.59, a PEG ratio of 2.06 and a beta of 1.29. The firm’s fifty day simple moving average is $184.64 and its 200 day simple moving average is $183.62. Apple (NASDAQ:AAPL – Get Free Report) last issued its quarterly earnings data on Thursday, February 1st. The iPhone maker reported $2.18 EPS for the quarter, topping analysts’ consensus estimates of $2.09 by $0.09. Apple had a net margin of 26.16% and a return on equity of 156.04%. The firm had revenue of $119.60 billion for the quarter, compared to analyst estimates of $117.99 billion. During the same quarter in the previous year, the business posted $1.88 EPS. The firm’s revenue was up 2.1% compared to the same quarter last year.  As a group, equities research analysts expect that  Apple Inc. will post 6.55 earnings per share for the current fiscal year. The company also recently disclosed a quarterly dividend, which was paid on Thursday, February 15th. Shareholders of record on Monday, February 12th were issued a $0.24 dividend. The ex-dividend date  was Friday, February 9th. This represents a $0.96 dividend on an annualized basis and a yield of 0.56%. Apple’s dividend payout ratio  is currently 14.95%. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Qube Research & Technologies Ltd Has $2.15 Million Position in Brinker International, Inc. (NYSE:EAT) Qube Research & Technologies Ltd Makes New Investment in Goosehead Insurance, Inc (NASDAQ:GSHD) "
}