{
    "title": "Will Apple Acquire Rivian? 1 Wall Street Analyst Thinks it Should",
    "date": "3/2/2024",
    "url": "https://finance.yahoo.com/news/apple-acquire-rivian-1-wall-110200309.html",
    "text": "Electric vehicles (EVs) are among the bedrock technologies of the sustainability movement. Unsurprisingly, most legacy car manufacturers, including Ford, General Motors, and Volkswagen, have experimented with battery-powered vehicles. But beyond traditional automakers, some big tech companies have shown an interest in entering the EV market. For the last several years, Apple (NASDAQ: AAPL) has reportedly been working on an EV of its own. In a lot of ways, this makes sense. Apple has a long history of innovation, specifically when it comes to consumer electronics. However, just this week, news broke that Apple is abandoning its in-house EV effort, dubbed Project Titan. Does this mean that Apple is giving up on its EV ambitions for good? Gene Munster of Deepwater Asset Management is one of Wall Street's most respected technology analysts. And while Project Titan appears to have been consigned to the dustbin of tech sector history, Munster just floated an interesting idea. During a discussion on CNBC Tuesday, Munster put forth the notion that Apple should acquire Rivian. This is interesting for several reasons. First, Rivian has demonstrated some success in the highly competitive EV landscape. However, the company seems to be stuck in a \"one step forward, two steps back\" paradigm. In other words, every time it seems to be turning over a new leaf, fresh problems arise. On one side of the equation, you have Apple, a company whose flagship consumer electronics business is struggling. The company's revenue has been in consistent decline as consumers wait longer between upgrades of products such as iPhones, iPads, laptops, and wearable devices. While Apple's Services business is accelerating nicely, that growth has not been enough to offset the lagging hardware sales. As such, Apple is in need of additional growth drivers. On the other side of the equation sits Rivian. In 2023, it produced 57,232 vehicles -- an increase of 135% year over year. While that's encouraging, it's not all smooth sailing from here. During the company's fourth-quarter earnings call, management shocked investors when it guided for essentially flat production in 2024. Apple and Rivian both share a similar problem: In an economic environment defined by interest rates higher than consumers have dealt with in years and the ripple effects of recent high inflation, demand for luxury consumer goods is simply not that strong. With both companies desperate to accelerate growth and get investors excited, are Apple and Rivian a match made in heaven? On the surface, I completely understand Munster's proposal. For Rivian, a deal with Apple could be transformative. As part of Apple, it would immediately gain access to a larger team of engineers and technologists, and would have the luxury of Apple's bankroll. Apple, meanwhile, would gain access to the EV market and add yet another product to its sticky ecosystem. Apple currently has more than $73 billion of cash and equivalents on its balance sheet. Rivian's market capitalization is around $11 billion.Given those parameters, it's clear that Apple could acquire Rivian in an all-cash deal at a pretty generous premium, and still have plenty of change left over. But a closer look at Apple's history with regard to making acquisitions puts the possibility of such a hypothetical deal becoming reality in a different light. Apple's largest purchase ever was its $3 billion deal for headphone company Beats Electronics in 2014. Across its 10 largest acquisitions, Apple has spent roughly $7.4 billion. Those data points make one thing clear: Apple rarely pursues big-ticket acquisitions. So while the idea of it acquiring Rivian is interesting, and while such a deal could even make strategic sense for both companies, I see it as highly unlikely. Large-scale acquisitions have not been part of Apple's DNA, and I don't see that changing anytime soon. Should you invest $1,000 in Apple right now? Before you buy stock in Apple, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 Adam Spatacco has positions in Apple. The Motley Fool has positions in and recommends Apple and Volkswagen Ag. The Motley Fool recommends General Motors and recommends the following options: long January 2025 $25 calls on General Motors. The Motley Fool has a disclosure policy. Will Apple Acquire Rivian? 1 Wall Street Analyst Thinks it Should was originally published by The Motley Fool Related Quotes "
}