{
    "title": "European Commission slaps Apple with nearly $2 billion fine for…",
    "date": "3/4/2024",
    "url": "https://wng.org/sift/european-commission-slaps-apple-with-nearly-2-billion-fine-for-antitrust-violations-1709575075",
    "text": "EU Commission vice president Margrethe Vestager speaking on on Apple fine\n\t\t\t\t  \t\t\t\t  \t\t\t\t  \tAssociated Press/Photo by Geert Vanden Wijngaert The executive branch of the European Union fined Apple over $1.95 billion on Monday for violating antitrust rules. The commission says its investigation showed the tech giant unfairly quashed competition from other music services offering cheaper music service subscriptions. Apple “applied restrictions on app developers preventing them from informing iOS users” of Apple Music alternatives in the App Store, according to a statement from the EC. The commission’s executive vice president in charge of competition policy, Margrethe Vestager, said, “Apple abused its dominant position in the market,” resulting in the EU’s first antitrust penalty on the tech giant. The commission said any company affected by Apple’s conduct may seek damages. The decision sparked public curiosity about whether United States officials would crack down on Apple. What has Apple said about the fine? Apple released a statement noting the investigation’s “failure to uncover any credible evidence of consumer harm.” The company points to streaming competitor Spotify as a proponent of the decision, alleging investigators met with Spotify representatives dozens of times throughout the five-year investigation. Apple also pointed out that Spotify claims over 50 percent of Europe’s music streaming market, alleging that the IOS app store “helped make them [Spotify] one of the most recognizable brands in the world.” Apple said it plans to appeal the ruling. What is Spotify’s response? The Sweden-based company lauded the EC’s decision, praising the commission for “putting consumers first” in a statement titled “Time To Play Fair.” Spotify described Apple as “a monopoly” that has “muzzled Spotify and other music streaming services.” Dig deeper: Read Lauren Canterberry’s report on a recent antitrust settlement with tech titan Google. If you enjoyed this article and would like to support WORLD's brand of Biblically sound journalism, click here. Christina Grube is a graduate of the World Journalism Institute.  An actual newsletter worth subscribing to instead of just a collection of links. —Adam     Please wait while we load the latest comments... Please register, subscribe, or log in to comment on this article. P.O. Box 20002\n\t\t\t\tAsheville, NC 28802 (828) 435-2981 © 1986-2024 WORLD NEWS GROUP. ALL RIGHTS RESERVED. "
}