{
    "title": "Apple CEO Tim Cook shares Holi picture captured by Indian photographer, \nshot on iPhone",
    "date": "3/25/2024",
    "url": "https://www.businesstoday.in/technology/news/story/apple-ceo-tim-cook-shares-holi-picture-captured-by-indian-photographer-shot-on-iphone-422823-2024-03-26",
    "text": "Feedback As India celebrated the vibrant festival of Holi, Apple CEO Tim Cook extended his greetings via the micro-blogging platform X. Cook appreciated a photograph taken by Indian photographer Joshua Karthik, shot on an iPhone, showcasing the high-contrast , colourful setup. Cook's post received a warm response, with many users replying with their own Holi wishes.  Happy Holi to all who celebrate! Thank you @joshuakarthikr for sharing this beautiful #ShotOniPhone photo that captures the colorful festival. pic.twitter.com/HpJWRm93PH Karthik also clicked multiple other shots using the new iPhone 15 Pro Max. The device comes with a triple camera lens setup. The primary lens is a 48MP unit, the phone also gets an ultra-wide angle lens as well as a 5X telephoto lens for the first time in an iPhone. The phone is also capable of shooting Pro Res Log that can be big differentiator when it comes to smartphones from other brands like Samsung and Google's Pixel. The Pro Res log video footage manages to capture more details which can be edited later in post.  Happy Holi Guys 😁#shotoniphone by - @joshuakarthikr @Apple pic.twitter.com/Ns1YsfvMbE Camera Changes in iPhone 16 The iPhone 16 series will be launching later this year but Apple is expected to make some design changes related to the camera, especially in the non-Pro models. Apple is expected to opt for a new oval camera island that will hold both the camera sensors vertically. This setup will allow Apple iPhone 16 non-Pro models to capture Spatial videos, that can be played back on the Apple Vision Pro. The pro models are expected to retain most of the design with a triple camera setup and a front-facing notch. However, the Pro models are expected to get a bump in size. The smaller 6.1-inch screen may graduate to a 6.3-inch screen and the bigger iPhone 16 Pro Max is expected to get a massive 6.9-inch display. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}