{
    "title": "Wall St. ends higher on AI enthusiasm; Fed in focus",
    "date": "3/18/2024",
    "url": "https://tw.yahoo.com/news/wall-st-ends-higher-ai-220056202.html",
    "text": "STORY: Wall Street’s main indexes ended higher on Monday, led by megacap growth stocks such as Alphabet and Tesla, while investors also awaited this week’s Federal Reserve policy meeting. The Dow ticked up two-tenths of a percent, the S&P 500 gained more than six-tenths while the tech-heavy Nasdaq climbed eight-tenths of a percent. Google parent Alphabet gained nearly 4.5% after a media report that Apple is in talks to build Google's Gemini AI engine into the iPhone. That’s a partnership investors would welcome, says Chris Carey, Portfolio Manager at Carnegie Investment Counsel. “Apple is one of the last major tech companies that has yet to really talk about their endeavors into the world of world of AI. They've been very… they’ve kept their details very close to their chest on this one. So I think it's very encouraging that they've chosen to partner with Google, a company that they have a long-lasting relationship with in terms of Google being the default provider for search [flash] and so I think that this is quite encouraging to investors to see that Apple is trying to take this seriously.” In other AI news, shares of Nvidia added more than half a percent but closed well below their session high. The world’s leading AI chipmaker kicked off its annual developer conference Monday with Chief Executive Jensen Huang unveiling the new flagship AI chip, the Blackwell B200. Tesla shares finished up more than 6% after the electric carmaker said it would soon increase the price of its Model Y EVs in parts of Europe. And shares of server-maker Super Micro Computer, which joined the S&P 500 on Monday, gave up earlier gains to close down nearly 6.5%, making it the biggest percentage decliner on the day in the benchmark index. Its shares, however, are up roughly 280% so far this year. Investors now look to the Federal Reserve for updates on when possible rate cuts may begin, with the central bank’s March policy meeting concluding on Wednesday. 元大臺灣價值高息ETF（00940）4月1日正式掛牌上市，29日建倉完成，股票配置達92.44％、期貨占比3％，50檔成份股全數揭曉。其中長榮持股排名第一，占比達9.32％；基金淨資產價值為1,737.68億元，每受益權單位淨資產價值9.92元。 還在等什麼？ 現在就玩 [FTNN新聞網]記者高麗玲／台北報導台股今（29）日再創收盤新高，收在20,294.45點，上漲147.9點，漲幅0.73%。根據證交所統計資料顯示，投信今日買超高達599.51... 00940「巨嬰」發威！根據證交所，投信今（29）日大撒幣，買超台股金額高達600億，創下今年第一大，預期刷新投信史上單日買超金額最高紀錄，投信買超前十大也出爐，聯電(2303）、長榮（2603）買最多，合計超過13萬張。 合庫金控已經公告配發現金股利0.65元、股票股利0.35元，合計股利金額1元。據合庫金今（29）日下午法說會資料與說明，沒法發更多，...  [NOWnews今日新聞]昨（29）日台股震盪走高，在權值股領軍帶動下，帶動電子、半導體類股表現強勢，加上AI概念股普遍走揚，終場台股上漲147.9點，收在20294.45點。成交量4811.28億元... [FTNN新聞網]記者蕭廷芬／台北報導台股昨（29）日漲147.9點，收20,294.45點，漲幅0.73%。據證交所公布籌碼動向，本週（3/25~3/29）外資買進6188.21億元，賣出... 新光金控今（29）日傍晚公告，董事會決議將辦理16.7億股現金增資發行普通股，以「因應子公司業務發展，轉投資子公司新光人壽，...  [NOWnews今日新聞]00940將於4月1日掛牌上市，其規模高達1752億元，創下台股ETF史無前例的驚人紀錄，但淨值不太給力，今（28）日淨值下滑至9.93元，已連5天跌破預購的10元發行價。有... 高息ETF的大舉加碼與投信季底結帳均在29日劃下句點，台股以全月7％的漲幅名列全球主要股市首位，風光結束3月天。進入4月，分析師建議投資人的資金布局，要陸續回歸具有基本面、前景展望佳的個股為主，如長榮航、華榮、國泰金等15檔個股。 [NOWnews今日新聞]台北股市今（29）日以20156.34點開出，隨後在台積電、AI概念股的領軍之下，最高點來到20335.92點，終場上漲147.9點或0.73%，收在20294.45點，再創...  台股3月結算，統計上市公司今年前20大個股跌幅排行，前四大都是半導體類股，其中，芯鼎（6659）單月跌25.99％成為前二十大跌最兇的個股。 [周刊王CTWANT] 日月光投控去年全年營收5819.14億元，年減13.3%，毛利率 15.8%，也較 2022 年減少 4.4 個百分點。去年全年稅後純益317.25億元，較上一年減約49%，全年EPS7.39元。董事會決議盈餘擬每股配發現金股利5.2元，配發率逾70%。日月光投控近年為滿足客戶採用更先進技術，積極投資先進... [NOWnews今日新聞]台北股市今（28）日開在平高盤，最高點一度來到20222.2點，可惜隨後在權王台積電的拉回之下翻黑，雖然盤面上由鴻家軍出面上攻，一度翻紅，不過還是敵不過空方壓力，終場下跌53...  募資超過1700億元的指數型基金ETF新兵00940下周一正式掛牌上市，今（29）日是場內買股最後決戰日，台股早續開高再戰20200點，天天開高橫盤整理已陷第六天。資深證券分析師王兆立今早受訪表示，今日量縮到3800億元左右，觀盤指標股看千金股（IC設計），盤面輪動缺乏新利多，下周提防指數拉回，今天先守2萬整數大關。 00940最新淨值9.92元　元大投信：符合指數表現 銅箔基板 (CCL) 廠聯茂 (6213-TW) 在 AI 伺服器高階材料需求走揚，可望進一步改善毛利面的加持之下，本周獲外資買超高達 1.05 萬張，股價出量收在 98.3 元，本周漲幅達 14.7%，股價漲幅居三大專業 CCL 廠之冠。  [FTNN新聞網]記者高麗玲／台北報導台股今（29）日收在20,294.45點，上漲147.9點，漲幅0.73%。根據證交所統計資料顯示，外資今日買超4.61億元，在買超ETF部分... 千億債券ETF再添一檔！群益ESG投等債20+（00937B）規模正式突破千億元，成為第7檔債券ETF千金。通膨降溫趨勢不變，聯準會（Fed）年內可望降息3碼，債市多頭格局可望延續，也使得投信發行的債券ETF投資熱度不退，截至28日止，整體債券ETF規模已突破2.3兆元，今年來增加近3257億元。 [周刊王CTWANT] 根據理柏資訊統計，目前台股基金規模超過50億元的有30檔，其中今年來績效前十名皆打敗大盤，復華高成長基金以近2成報酬居冠，國泰、統一旗下亦有國泰小龍、統一奔騰、統一黑馬等多檔招牌基金入列。投信法人分析，基金規模大增加基金經理的操作難度，但績效能優於大盤也凸顯經... 英國Sheffield Hallam University與SHAPE 合辦，1年完成獲取英國及本地認可學歷。高資助、高認受、了解更多! AI伺服器大行其道，吸引市場資金聚焦電源供應商，然外資看台系二大業者出現兩樣情。摩根士丹利證券指出，光寶科（2301）多項業務進度慢於預期，降評「劣於大盤」，推測合理股價僅88.8元，反觀外資較青睞台達電（2308），高盛證券賦予股價預期達415元。 "
}