{
    "title": "Apple’s new EU steps draw rivals’ complaints",
    "date": "3/3/2024",
    "url": "https://www.dawn.com/news/1818686",
    "text": "BRUSSELS: Changes Apple is making to its services in the European Union  “make a mockery” of new antitrust rules in the bloc, 34 digital organisations complained to the European Commission this week. They include app makers Epic Games and Spotify. “We are very concerned that Apple’s proposed scheme for compliance with the Digital Markets Act (DMA)...will not meet the law’s requirements, therefore inhibiting our ability to deliver the benefits of the DMA to consumers as soon as possible,” they said in a letter to the EU executive dated Friday. Apple in January announced it was modifying how its iOS operating system, Safari browser and App Store operate in the 27-nation EU. It said it was doing so to comply with the DMA, which clamps down on anti-competitive practices online in the bloc. Apple and other big tech companies deemed  “gatekeepers” — Google parent Alphabet, Amazon, Meta, Microsoft and TikTok owner ByteDance — have until March 7 to come into line with the DMA. The EU law threatens fines of up to 10 per cent of global revenue for non-compliance or 20pc for repeat offenders. Apple notably announced it was, for the first time, opening its App Store to rival apps and allowing payment services beyond Apple Pay on its iPhones. But app developers going that route had to agree to a new  “Core Technology Fee” from Apple that would charge them $0.54 per download, for apps getting over a million downloads. Many app developers — among them Epic Games, maker of the massively popular Fortnite game — say that is a huge cost for them. They say it will simply line Apple’s pockets and cement its gatekeeper status. In their letter, the digital companies and associations said:  “Apple’s new terms not only disregard both the spirit and letter of the law, but if left unchanged, make a mockery of the DMA and the considerable efforts by the European Commission and EU institutions to make digital markets competitive.” Published in Dawn, March 3rd, 2024 Dear visitor, the comments section is undergoing an overhaul and will return soon. Compunode.com Pvt. Ltd. (www.compunode.com).Designed for Dawn. Copyright © 2024, Dawn NewsKit Publishing Platform "
}