{
    "title": "Apple to pay $490m to settle claims it misled investors over sales in China \n- nationnews.com",
    "date": "3/16/2024",
    "url": "https://nationnews.com/2024/03/16/apple-to-pay-490m-to-settle-claims-it-misled-investors-over-sales-in-china/",
    "text": " Date: Share post: Apple has agreed to pay $490m to settle a class-action lawsuit alleging chief executive Tim Cook misled investors about a steep downturn in the iPhone’s sales in China that culminated in a jarring revision to the company’s revenue forecast. The preliminary settlement filed Friday in Oakland, California, in federal court stems from a shareholder lawsuit focused on the way Apple relayed information about how iPhone models released in September 2018 were performing in China, one of the company’s biggest markets. Cook signaled that the new iPhones were off to a good start during an investor conference call in early November 2018, according to the complaint. That reassurance dissolved into a huge letdown on January 2, 2019, when Cook issued a warning that Apple’s revenue for the just-completed quarter would fall $9bn below management’s forecast for the period. What’s more, virtually all of the sales drop was traced to weak demand in China. It marked the first time Apple had cut its revenue guidance since the iPhone’s release in 2007 and triggered its stock price to plunge 10% in the next day of frenetic trading, wiping out more than $70bn in shareholder wealth. Apple vehemently denied Cook deceived investors about the iPhone’s sales in China between early November and early January. The company maintained that stance in the settlement documents, but said it decided to make the payment after more than four years of legal wrangling to avoid an “overly burdensome, expensive, and distracting” hassle. The settlement was reached through a mediator after US district judge Yvonne Gonzalez Rogers rejected Apple’s request to dismiss the case and set a September 9 trial date. Gonzalez Rogers is now being asked to approve the settlement in a hearing scheduled for April 30. Thousands of shareholders who bought Apple stock in late 2018 could be eligible for a piece of the settlement, which will be distributed from a pool that will be less than $490m after lawyers involved in the case are paid. The attorneys plan to seek up to one-fourth, or about $122m, of the settlement. The $490m payment represents less than 1% of the $97bn profit that Apple pocketed during its last fiscal year, which ended in September. Apple shareholders who have held on to their shares have become wealthier too. Apple’s stock price has more than quadrupled from where it stood after Cook’s China warning, creating an additional $2 tn in shareholder wealth. (The Guardian) Save my name, email, and website in this browser for the next time I comment.  Each template in our ever growing studio library can be added and moved around within any page effortlessly with one click. Copyright © 1997 - 2023, Nation Publishing Co. Limited • P.O. Box 1203, Fontabelle, St. Michael, BB11000, Barbados, West Indies • All Rights Reserved No unauthorized use is permitted of content produced by NationNews.com, The Nation Newspaper or any other publication or media owned by Nation Publishing Co. Limited. Unauthorized use includes framing and direct posting of content on websites other than www.nationnews.com. "
}