{
    "title": "You can no longer buy the newest Apple Watches from Apple's online store",
    "date": "3/7/2024",
    "url": "https://ca.news.yahoo.com/no-longer-buy-newest-apple-202958901.html",
    "text": "Apple preemptively removed its Series 9 and Ultra 2 smart watches from its online store ahead of an expected sales ban. The move comes after a ruling against Apple in a patent dispute over blood oxygen tracking. The tech giant is set to pull its latest watches from its physical store shelves by Christmas Eve. Thinking about buying the latest Apple Watch for Christmas? It might be too late. Apple just removed its Series 9 and Ultra 2 smart watches from its online store. Ads for the devices have been removed from Apple's website's home page, and the watches are now \"currently unavailable\" on the site. These models are also set to be taken off the shelves from its flagship stores by December 24th. The halt in online sales comes after the International Trade Commission ruled that Apple violated patents from Masimo, a health-tech company, related to blood oxygen monitoring. Both of the watches being pulled from shelves have a feature that tracks the wearer's blood oxygen levels. When the ban goes into effect, Apple will be barred from importing Apple Watches from overseas. Pulling sales of these models could cost Apple between $300 to $400 million in lost revenue. The iPhone maker says it's currently taking measures — like updating its software — to resolve the issue related to the blood oxygen monitor, according to Bloomberg. Apple has also said it will try to fight the ITC ruling. Masimo told Business Insider that the ruling \"demonstrates that even the world's most powerful company must abide by the law.\" Separately, Apple will no longer replace out-of-warranty watches, Bloomberg reported. That includes models going back to Apple Watch Series 6, which include the blood oxygen feature the commission ruled were covered by the patents. Apple, when contacted by BI, didn't say whether it plans on putting its latest watches back online in the near future. The ITC ruling came after Masimo sued Apple for patent infringement related to its pulse oximetry technology in 2020. \"This is not an accidental infringement,\" Joe Kiani, CEO and founder of Masimo, told Bloomberg. \"This is a deliberate taking of our intellectual property.\" Kiani also claimed that the tech giant poached 25 of the medical company's engineers, including its chief medical officer and the CTO of a spinoff company. Kiani said he is open to reaching a settlement with Apple. If the two companies don't settle, Apple's only other hope is to either get President Biden to veto the ruling, which is unlikely, or to convince customs officials that a software tweak addresses the issue without having to make any changes to the device's hardware. Read the original article on Business Insider \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th Thanks to the attention it’s getting on TikTok and Instagram, stores around the world are selling out of this lean muscle builder. But, before you... \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76.  Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million IBKR EventTrader - A new, straightforward way to trade CME futures markets TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone They soft-launched their relationship at the supermodel's cookbook event in Miami. Select Hong Kong and Greater Bay Area (GBA) artists are being showcased at Art Central, an annual international art fair which this year takes... The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company.  Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. "
}