{
    "title": "Apple cancels decade-long electric car project, source says",
    "date": "3/17/2024",
    "url": "https://ca.style.yahoo.com/apple-cancels-ev-moves-staff-192629772.html",
    "text": "We've rounded up the best deals from Amazon, Walmart, Best Buy, Coach Outlet & more. By Stephen Nellis and Shivansh Tiwary (Reuters) -Apple has canceled work on its electric car, a source familiar with the matter told Reuters on Tuesday, a decade after the iPhone maker kicked off the project. The move draws the curtain on a plan that would have helped Apple break out into a new industry and potentially replicate the success of the iPhone. The project had seen uneven progress throughout its life and its end comes as global automakers cut back their investments in electric vehicles, whose demand has dropped significantly. Several employees working on the project will be shifted to the company's artificial intelligence (AI) division, according to Bloomberg News, which first reported the development. Apple declined to comment. \"If it is true, Apple will put more focus on GenAI and that should give investors more optimism about the company's efforts and ability to compete at a platform level on AI,\" said Ben Bajarin, CEO of consulting firm Creative Strategies. Apple has so far held back from any big moves in AI, in stark contrast to tech giants such as Alphabet and Microsoft, which have first-mover advantage in incorporating the breakthrough technology. Its quiet approach has sparked worries the iPhone-maker could be behind in integrating the technology into its products. That was reflected in Apple's share gain last year, which at nearly 50% was the smallest among the so-called Magnificent Seven stocks. Last month, Microsoft overtook Apple as the world's most valuable company as the iPhone maker grapples with weakness in demand for its key products, especially in major market China. Meanwhile, high interest rates have led to a slowdown in demand for usually pricier electric vehicles, prompting the industry to cut jobs and reduce production. Several major automakers, including EV market leader Tesla, have decided to pull back on investments, with some shifting plans to focus on hybrids instead of fully battery-powered cars. Tesla CEO Elon Musk cheered Apple's move on X social media with a post of a saluting emoji and a cigarette. PROJECT TITAN Apple kicked off Project Titan, as its car effort was known internally, a decade ago, as a wave of interest in self-driving vehicles swept through Silicon Valley. Reuters reported in 2020 that Apple was considering releasing its proposed car soon as 2024 or 2025. But progress had been bumpy even before the COVID-19 pandemic disrupted the global automotive industry. Apple had laid off 190 workers from the group in 2019 after revamping its software approach. The design of the concept car also changed from a radical, steering-wheel-free autonomous vehicle that would have been a departure from traditional automotive design to a more conventional car with advanced driver-assistance features. News of the project had initially raised hopes that Apple may replicate the success of the iPhone, whose fresh design and clean interface helped alter the handheld phone market. But even iPhone sales, the main source of the company's revenue, has started seeing a growth slowdown as rivals launch handsets with matching specs and competitive prices. Sales of iPad and Mac computers have also fallen amid broader slump in demand for expensive gadgets. (Reporting by Stephen Nellis in San Francisco and Shivansh Tiwary in Bengaluru; Additional reporting by Abhirup Roy in San Francisco, Harshita Mary Varghese and Yuvraj Malik in Bengaluru; Editing by Pooja Desai and Arun Koyyur) \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th IBKR EventTrader - A new, straightforward way to trade CME futures markets \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76.  Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million  TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. Play this game for 1 minute and see why everyone is addicted. A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone They soft-launched their relationship at the supermodel's cookbook event in Miami. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company.  Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. "
}