{
    "title": "Suggested logging on iPhone will not share name, exact location",
    "date": "3/6/2024",
    "url": "https://ustimespost.com/suggested-logging-on-iphone-will-not-share-name-exact-location/",
    "text": "A new iPhone feature can suggest journaling topics based on nearby people in your contact list.  It doesn’t share your name or location with those people. Apple and Google add new features to iPhones and Android devices with each update. Sometimes it can be difficult to keep up with what these new features do. VERIFIED reader Erin messaged us to ask about viral social media posts making some alarming claims that new iPhone features could compromise privacy and safety. These posts claim a feature called “Suggest logging” has a default setting that allows people nearby to see your full name and exact location. These claims have spread across multiple platforms, including Facebook and TikTok. “[The setting] Let people discover you based on whether they’re nearby or not,” one person claims in a TikTok video with 4.6 million views.  Does iPhone’s Suggested Logs feature allow people nearby to see your full name and exact location?   No, iPhone’s Logging Suggestions feature doesn’t let people nearby see your full name and exact location.   Apple added the Diary app to iPhone in December 2023. The app can suggest custom prompts and questions to inspire electronic entries within the app. However, these Logging Suggestions don’t let people see your full name and exact location, no matter what settings you enable. Apple added the Diary app to serve as a kind of diary that people can keep on their iPhone. Suggested journaling uses data stored locally on your iPhone such as exercise, location, media usage, contact information, and photos to suggest people and topics to write. Viral social media posts highlight the device’s Logging Recommendations setting, located in the device’s general settings menu. They say the setting, which is enabled by default, “may be discoverable by others,” shares your full name and exact location with other iPhones nearby. But Apple’s website explains that this setting doesn’t share names or locations with strangers. “Logging hints use Bluetooth to detect the number of devices and contacts around you without storing specific nearby contacts,” Apple’s website says. “This information is used to improve and prioritize your recommendations.” For example, it won’t share your full name with someone nearby or allow strangers to track your location. Let’s say you and two friends with iPhones go bowling. If everyone turns on “discoverable by others,” each person’s phone will detect that two of your contacts are nearby and may then suggest you write a diary about bowling with friends, based on your location. According to Apple, turning off this setting means you won’t be included in the list of nearby people in your contacts. So in this example, if you turn that setting off, your friend’s iPhone will only detect one person nearby, and your iPhone won’t try to detect anyone. If you turn that setting off, your iPhone won’t detect anyone nearby. The future magazine suggestion could be just about bowling. VERIFY journalists used their iPhones to test how Log Recommendations responded to nearby contacts by default. In their proposal there is no information about the names and exact locations of people nearby, even with the “discoverable by others” setting enabled. The diary prompt advised journalists to write about contacts that appeared in their photos or messages a few days earlier. But these suggestions don’t include the exact locations of past or present contacts.  The VERIFY team works to separate fact from fiction so you can understand what is right and wrong. Please consider subscribing to our daily newsletter, text alerts, and YouTube channel. You can also follow us on Snapchat, Instagram, Facebook and TikTok. Find out more “ Text: 202-410-8808  "
}