{
    "title": "Apple terminates Epic’s account, Meta platforms get knocked offline and \nformer Twitter execs sue Elon Musk",
    "date": "3/9/2024",
    "url": "https://techcrunch.com/2024/03/09/apple-terminates-epics-account-meta-platforms-get-knocked-offline-and-former-twitter-execs-sue-elon-musk/",
    "text": "Hey, folks, welcome to Week in Review (WiR), TechCrunch’s newsletter covering all of — or at least the bulk of! — noteworthy happenings around the tech-o-sphere. This week, Roku played hardball with its customers, requiring them to consent to new dispute resolution terms. This means users can’t use their Roku devices until agreeing to the terms (or opting out via snail mail), which requires any customer with legal complaints against Roku to take them to the company’s lawyers first. In other news, a leaky database spilled two-factor authentication codes for the world’s tech giants — including Facebook, Google and TikTok — online. YX International, an Asian tech and internet firm that routes millions of SMS text messages across the world, exposed a repository containing one-time security codes that might’ve granted access to users’ accounts. And Elon Musk, the CEO of X, sued OpenAI over allegedly “betraying” its nonprofit mission. (OpenAI began as a nonprofit but shifted to a “capped-profit” company managed by a nonprofit entity in 2019.) Musk, a co-founder and early backer of OpenAI, is accusing OpenAI CEO Sam Altman and president and co-founder Greg Brockman of pursuing profit at the expense of the organization’s founding mission to develop AI that benefits humanity. Lots else happened. We recap it all in this edition of WiR — but first, a reminder to sign up to receive the WiR newsletter in your inbox every Saturday. Epic takedown: Apple has terminated Epic Games’ App Store developer account, reportedly calling it a “threat” to the iOS ecosystem. Epic and Apple have long sparred — rhetorically and in numerous courtroom battles — over the latter’s power and influence over the app economy. Social media meltdown: Facebook, Instagram and Threads went down in a massive Meta outage on Tuesday. After restoring service, Meta revealed the issue was “technical” in nature, but gave no further details. Musk money: Four former Twitter executives, including ex-CEO Parag Agrawal, sued Musk on Monday, alleging that they’re owed over $128 million in severance payments. Data transfers unfettered: AWS has followed Google in announcing unrestricted free data transfers to other cloud providers. As Paul writes, the move stems from regulatory pressure around cloud lock-in practices — leaving Microsoft Azure the odd one out. AI worker: A new startup called Ema has raised $25 million for what it describes as a “universal AI employee” — an enterprise-focused, AI-powered platform that’s designed to “emulate human responses” like handling customer service tasks, offering tech support and more. Uninvestable startups: Haje writes about a case study in unwise capitalization — a Norwegian hardware startup that gave up more than two-thirds of its equity to raise $3.3 million. Such a move can make a company uninvestable, he says. But there’s hope. On Equity, the crew talked about OpenAI bringing receipts to its tussle with Musk and about what’s happening with the VC firm OpenView. Also on the agenda was online banking startup Monzo’s big tranche, a noteworthy funding deal in the AI space and upcoming climate regulations. Over on Found, Becca and Dom spoke with Advocate founder Emilie Poteat. Advocate helps Americans engage with federal benefits programs through its tech-enabled services platform. And Chain Reaction featured Dee Goens, the co-founder of Zora. Zora is a platform and protocol that helps developers and creators bring their ideas on the blockchain and Ethereum through an open and shared environment. Udacity exit: Accenture this week announced that it’d acquire the learning platform Udacity, reportedly for $80 million. That’s far below the roughly $300 million Udacity raked in from its founding in 2011 until now, Ron reports. "
}