{
    "title": "Apple Savings Account Review 2024 – Forbes Advisor",
    "date": "1/4/2024",
    "url": "https://www.forbes.com/advisor/banking/savings/apple-savings-account-review/",
    "text": "You might be using an unsupported or outdated browser. To get the best possible experience please use the latest version of Chrome, Firefox, Safari, or Microsoft Edge to view this website. Fact Checked Fact Checked Updated: Jan 4, 2024, 2:17am Apple—the same company that brought you the iPhone and Mac—added a high-yield savings account to its product roster in early 2023. Offered in partnership with Goldman Sachs, the Apple savings account touts an above-average APY, no fees and no minimums, making it a worthy option for building your savings. However, it’s only available to Apple Card users. If you don’t have an Apple Card and don’t plan on getting one, you’ll need to stash your savings elsewhere. This review covers the Apple high-yield savings account. All account details and annual percentage yields (APYs) are current as of Oct. 24, 2023. The Apple High-Yield Savings Account earns an impressive 4.50% APY, far above the national average and in line with some of the best savings accounts. In addition to its high rate, the account has no fees, no minimum deposit requirements and no minimum balance requirements. Apple savings accounts are provided by Goldman Sachs Bank and FDIC-insured up to $250,000. Apple Savings is only available to Apple Card* customers. If you don’t qualify for Apple Savings, there are plenty of other high-yield savings accounts to consider. Apple Card users earn Daily Cash on purchases made with their card, and that cash back is automatically transferred to your Apple Savings account so it can earn interest. To access money from your Apple Savings account, you’ll need to initiate a transfer from your savings to Apple Cash or a linked external bank account. Transferring money to a linked bank account typically takes one to three business days, while transfers to Apple Cash are usually instant. Setting up a transfer from Apple Savings involves the following steps: Depositing money into savings follows a similar process and you can transfer funds from your linked bank account or Apple Cash. To deposit money into your savings account, open the Wallet app and select Apple Card. From there, navigate to “Savings,” then “Add Money.” Enter the amount of money you want to deposit and add or select the bank account you want to transfer money from. Interest starts accruing on the day you initiate a transfer from your Wallet app. While Apple is better known for its tech products, it offers a couple of other financial products. The Apple Card* is a credit card with no fees that earns cash-back rewards, known as Daily Cash. You can earn 3% back on eligible purchases from Apple including the Apple Store, apple.com, the App Store and iTunes, 2% back on purchases when using Apple Pay and 1% back on all other purchases. You need an Apple Card to open an Apple Savings account. You can apply for the Apple Card and view your credit limit and interest rate offer without impacting your credit score. The Apple Card comes with a high APR, so it’s not a card you’d want to carry a balance on. Apple Cash is a digital card that functions similarly to a debit card, allowing you to easily send and receive money. Like the Apple Card and Apple Savings, Apple Cash lives in your Wallet app, but it can also be accessed through Messages. You can use it to make purchases anywhere Apple Pay is accepted, whether online or in stores, and link it with a bank account for easy transfers.  You can only access Apple Savings with an iPhone using the Wallet app. To access your savings account, open the Wallet app on your iPhone, select Apple Card and then choose Savings. There are two ways to access the money in your savings account on the go: Be sure to keep your iPhone up-to-date with the latest version of iOS so your Apple Wallet—and Savings account—can be accessed without issue. Apple and Varo’s savings accounts both have no fees and no minimum balance requirements. However, because Varo Bank offers a 3.00% to 5.00% APY on savings compared to 4.50% APY with Apple, Varo may or may not help you earn more, depending on your balance and account activity. You can only earn the higher APY on balances up to $5,000 with Varo and must meet two requirements to qualify for the higher rate. To earn the higher yield, you must receive direct deposits totaling $1,000 or more and end the month with a positive balance in your Varo bank and Varo savings accounts. Though SoFi is widely known for loans, SoFi Bank offers the SoFi Checking and Savings Account¹ with a 0.50% APY on checking and 4.60% APY on savings if you set up direct deposit or by depositing $5,000 or more every 30 days. Customers who don’t mee this criteria earn 1.20% APY on savings balances. The SoFi savings account has no fees or minimum balance requirements. A unique benefit of SoFi’s account is it offers FDIC insurance up to $2 million through its network of participating banks—higher than the standard $250,000 FDIC coverage limit. Unlike Apple, SoFi offers a welcome bonus of up to $300, depending on your direct deposit amount. Like Apple Savings, Sallie Mae Bank’s SmartyPig Account is a fee-free savings account with an above-average APY. The SmartyPig Account earns 4.25% APY on all balance tiers, slightly higher than Apple. One unique benefit of this account is its referral program. You can earn a $10 reward for each friend you refer who opens a SmartyPig account and contributes at least $25 within 30 days of receiving the invite. The reward will be deposited into your SmartyPig account within 90 days. ¹SoFi members with Direct Deposit or $5,000 or more in Qualifying Deposits during the 30-Day Evaluation Period can earn 4.60% annual percentage yield (APY) on savings balances (including Vaults) and 0.50% APY on checking balances. There is no minimum Direct Deposit amount required to qualify for the stated interest rate. Members without either Direct Deposit or Qualifying Deposits, during the 30-Day Evaluation Period will earn 1.20% APY on savings balances (including Vaults) and 0.50% APY on checking balances. Interest rates are variable and subject to change at any time. These rates are current as of 10/24/2023. There is no minimum balance requirement. Additional information can be found at http://www.sofi.com/legal/banking-rate-sheet. The biggest downside is that you can only open an Apple savings account if you have an Apple Card. If you don’t already have an Apple Card and aren’t interested in applying for one, you won’t be able to open an Apple Savings account. Since your Apple savings account is attached to the Wallet app on your iPhone, you lose access to your savings account if your phone is lost or stolen. If you lose your phone, call Apple customer service at 800-275-2273 to regain access to your savings account. Get the Forbes Advisor newsletter for helpful tips, news, product reviews and offers from a name you can trust. "
}