{
    "title": null,
    "date": "1/3/2024",
    "url": "https://www.wsj.com/podcasts/the-journal/one-companys-quest-to-burst-apples-blue-bubble-texts/e10958fa-d44f-406c-b344-111502efcc07",
    "text": "If you text on a smartphone, chances are you’ve seen the problem: blue text bubbles versus green texts. It's a visual symbol of the problems that Android and iPhone users have when trying to text each other. WSJ’s Nicole Nguyen on the blue-green texting divide and one company’s fight to pop Apple’s iMessage exclusivity.  Further Reading: - The Fight Over Apple’s iMessage and Those Green Bubbles - Why Apple’s iMessage Is Winning: Teens Dread the Green Text Bubble  Further Listening: - How Apple Lost to the EU  This transcript was prepared by a transcription service. This version may not be in its final form and may be updated. Ryan Knutson: Our colleague, Nicole Nguyen is a personal tech columnist, and like a lot of people, she's got a group chat with her family, but not just with her mom and dad. It's got cousins, aunts, uncles. The group chat is called Big Fam. Nicole Nguyen: It is currently 22-ish people deep. Ryan Knutson: That is a big fam. Nicole Nguyen: It's a big fam. Ryan Knutson: And Nicole's big fam sends lots of messages. Nicole Nguyen: I have to scroll a lot because it's a very active chat. Okay, let's see here. A lot of people are sending birthday messages to Uncle Dave. There's a selfie of Uncle Dave at a boat parade. There are updates about my grandma's knee surgery. Grandma's on the move. A lot of texting, \"Go grandma, go.\" An image of her on an iPad sunbathing and watching K-dramas. Ryan Knutson: The group chat has grown over the years as kids grew up and spouses got added, but one member of Nicole's family has been left out. Will Marquardt: I'm Will Marquardt, and I'm Nicole Nguyen's husband. Nicole Nguyen: My husband Will, who has been a part of my family for almost 10 years now, is not in the chat. Ryan Knutson: Are you really part of the family though if you're not in the group chat? Will Marquardt: At first I thought I was, and then as other partners who joined the family after me started joining the group chat, I realized that maybe I'm not. Ryan Knutson: The reason Nicole's husband isn't on the group chat is because he has an Android phone and all the members of the Big Gam group chat have iPhones, meaning the chat runs over Apple's iMessage and all the text bubbles are blue. If Will were to join the group text using his Android, things would get messy. Nicole Nguyen: If I added Will to the chat as an Android user, it would make a new chat. The bubbles would be green and it would break everything. The conversation history wouldn't be there. No one would be able to send high resolution images. They would show up tiny and pixelated. You wouldn't be able to see if they were delivered or if people read them. And if it were a green bubble chat with Will, none of that would exist. Ryan Knutson: But last month, Will found a way to break in using a new app called Beeper Mini. It allows Android users to fully participate in Apple's iMessages, with blue text bubbles and everything. And on December 13th, like a burglar with a backdoor key, he sent his first message to the group. Will Marquardt: Hi all. I've infiltrated this chat from my Android phone. Look forward to being involved until Apple closes the loophole. Ryan Knutson: And how long did your stay inside the group chat last? Will Marquardt: It lasted a day or two and then it stopped working completely. Ryan Knutson: Welcome to The Journal, our show about money, business, and power. I'm Ryan Knutson. It's Wednesday, January 3rd. Coming up on the show, the company that's trying to burst Apple's blue texting bubble. Nicole Nguyen: Are you a blue bubble or are you a green bubble? Ryan Knutson: I am a blue bubble, yes. And anytime I'm on a green bubble chat, I'm just like, \"Why? Why are we here? Can we please get on WhatsApp? What are we doing?\" And then people will still send videos to the green bubble chat and you can't see them. They're all tiny and pixelated, and it's so frustrating. Nicole Nguyen: Yes. Ryan Knutson: The green bubble experience only happens when someone with an iPhone texts someone with an Android. And the reason green bubble texts are so much worse is because Androids and iPhones transmit messages using a really old technology called SMS. Nicole Nguyen: Which stands for Short Message Service, and it's a form that evolved from pagers. I don't know if you remember pagers. Ryan Knutson: But SMS is like texting on flip phones where you'd use the T-9 and you'd tap, tap, tap the four three times in order to get to the letter M or whatever. Nicole Nguyen: Exactly. It hasn't changed much since back then. Sending an SMS is like sending a postcard back and forth. You don't really know if the recipient got it. You don't have a lot of space to send a lot of content. If you try to send an image, it turns out really small. If you try to send a video that's too big, it won't work. It's a very low bandwidth way of sending someone a message. Ryan Knutson: iMessage, which are the blue texts that pass between two iPhone users, is more sophisticated than SMS. It runs over the internet, so there's a lot more functionality. Nicole Nguyen: And iMessage came on the scene in about 2011, and like other internet-based chat apps or database chat apps, it's a completely different experience. You can see when people are typing, you can unsend text messages, you can send people stickers, you can react to messages, you can reply to a specific message in a chat, you can see if that message was successfully delivered or even read by the recipient. So there are all of these other perks that come with data-based chat apps like iMessage. And the reason why iMessage is so prevalent, especially in the US, is that it's built into the iPhone. Apple sort of ops you in automatically as soon as you set up your iPhone and register your phone number. Ryan Knutson: Another big difference between iMessage and SMS is that iMessage is fully encrypted, which means no one other than the sender and recipient can see what the message says. Not even Apple. SMS is not encrypted, so hackers, cell phone carriers, and even the government could theoretically access your texts. Google has pushed Apple to upgrade its SMS technology so that Androids can text more seamlessly with iPhones, but Apple hasn't done it yet. It's sort of like Apple makes it almost an automatic segregation of Android users and iPhone users where you don't even know if someone has a different kind of phone, and then you send them a text message and it's either green or it's blue and you know that they're an iPhone user and you get all these extra perks. Nicole Nguyen: That's exactly right, and it's become kind of a status symbol. If you meet a new friend and type in a number and the number is green, you have to think to yourself, \"Is this the wrong number, or are they an Android user?\" And a blue thread signals legitimacy, or it's kind of a wealth status also to have an iPhone. So I think, over time, being a green bubble came with a social stigma. Ryan Knutson: The green bubble stigma is real. Take these recent TikToks, for example. Speaker 4: He's a 10, but he has an Android phone. What's his new rating? Speaker 5: One. Android, I can't do. I just can't do. Speaker 6: You can't have green text messages. It's 2022, get an iPhone. Ryan Knutson: Teens have reported feeling social pressure to have an iPhone so they aren't left off group chats at school and ridiculed for having a green bubble. Apple executives have thought about making iMessage available to Android users, but they decided against it. In internal emails released as part of a lawsuit, an Apple executive said in 2013, \"I am concerned that iMessage on Android would simply serve to remove an obstacle to iPhone families giving their kids Android phones.\" And at a tech conference in 2022, Apple CEO Tim Cook took a question from an audience member who asked why the company doesn't make texting between Android and iPhone users better. Tim Cook: I don't hear our users asking that we put a lot of energy in on that at this point. Speaker 8: Phone wars continue. Tim Cook: I would love to convert you to iPhone. Speaker 8: Okay. Speaker 9: It's just, it's tough not to make it personal, but I can't send my mom certain videos or she can't send me certain videos, and so we leave- Tim Cook: Buy your mom an iPhone. Ryan Knutson: But a lot of people don't want to buy an iPhone, like Nicole's husband, Will. Will Marquardt: I'd been at a bunch of family gatherings where people are like, \"Come on, just get an iPhone. Why don't you get an iPhone?\" And you have to have all these debates about Android versus iPhone, which is not what you want to do at family gatherings. Ryan Knutson: Why not buy an iPhone? Will Marquardt: I've got a million reasons for... I've been on Android for decades. I think just changing operating systems, that in itself is enough of a reason. But I'm a big fan of tinkering, and Android phones give me a little bit more of that flexibility that I like. Ryan Knutson: And by using that new app called Beeper Mini, Will could finally participate in the Big Fam group chat and still keep his Android. The app essentially uses code to trick iMessage into thinking an Android text is coming from an iPhone. The result, green text messages turn into blue bubbles. Here's Nicole again. Nicole Nguyen: Beeper is an app that sought to make messaging interoperable, and this is a very wonky term that just means two devices of two different brands being able to talk to each other seamlessly. I'll mention that before Beeper, there were many other people that tried to do what Beeper has done and they used sketchy Mac servers or Mac computers living somewhere that would then relay your message to Apple servers and who knows who would have been able to see the contents of those messages. And Beeper was able to find a way to leave those messages, they claim, encrypted. Ryan Knutson: When Beeper came out in early December, it took off. Within the first 48 hours of Beeper's launch, the app shot to the top of the Google Play Store with more than 100,000 downloads. But soon, Apple caught on and started trying to shut Beeper down. That's after the break.\nIn December, Nicole's husband, Will, was finally on the Big Fam group chat. And how did Big Fam respond? Will Marquardt: I got an Instant Message from one of Nicole's aunts, saying, \"That's awesome. Welcome, Will.\" And overall, a pretty positive response from everyone. Nicole Nguyen: Yeah. In fact, one of my uncles responded, \"Oh, time to switch to Android.\" Ryan Knutson: Wait, your uncle was going to leave iPhone now that there was an opportunity for him to stay in the chat? Nicole Nguyen: I think that's what he's saying. Some family members did not like that. He got two thumbs down, but also two thumbs up from two cousins who switched from Samsung phones to iPhones in order to be in the family chat. Ryan Knutson: But Will's time on the chat didn't last long. After just a few days, Apple found a way to disable the app. Beeper scrambled to find a workaround, but it's a little clunky. Android users now need to be able to access an Apple device in order to make it work. Nicole Nguyen: The end result is now you have to basically use an iPhone or a Mac in order to send iMessage messages from an Android phone. You have to borrow a friend's iPhone. You have to use a Mac that is turned on very regularly. You have to have an Apple device. Ryan Knutson: So it looks like Beeper doesn't have much of a future with iMessage. Nicole Nguyen: Yeah, Beeper's founder eventually released this announcement that said, \"This is our last workaround. And if Apple closes this one, we won't put any more resources into figuring out how to make this work.\" Ryan Knutson: Apple said the reason it wanted to crack down on Beeper is because it said what the app was doing \"posed significant risks to user security and privacy.\" Beeper responded by saying that its app is secure, and invited Apple to inspect its code to see for themselves.\nWhat has the response to Apple's crackdown on Beeper been like? Nicole Nguyen: From the Android community, there was a lot of frustration and disappointment that they have to go back to using SMS, or convince iPhone users to switch to another app. From a legislative perspective, it looks like Apple will have to face the music eventually. Ryan Knutson: Apple's decision to crack down on Beeper Mini caught the attention of lawmakers on both sides of the aisle. On December 10th, Democratic Senator Elizabeth Warren posted on X, \"Big tech executives are protecting profits by squashing competitors. Chatting between different platforms should be easy and secure.\" And a few days later... Nicole Nguyen: These four lawmakers, Amy Klobuchar, Mike Lee, Jerry Nadler, Ken Buck sent a letter to the Department of Justice concerned about potential anti-competitive treatment by Apple towards Beeper Mini, citing competition, innovation, consumer choice in the digital marketplace, and effectively asking the Department of Justice to investigate. Ryan Knutson: The DOJ hasn't responded publicly. Beeper and Apple didn't comment. Then the Federal Trade Commission put out a statement. While it didn't name Apple directly, it hinted strongly that it was watching the situation with Beeper. Nicole Nguyen: It was very cryptic, but it mentioned that word that I mentioned earlier, interoperability, and mentioning that platforms after they've reached a certain size should be interoperable. In other words, given a certain platform's popularity, it should be able to work among a variety of devices, not just between a certain brand. Ryan Knutson: How big of a deal is that, that these lawmakers and the FTC are turning their sights on to this issue? Nicole Nguyen: It's become more and more of a headache for Apple, for sure. They're facing anti-competitive pressures on many different fronts. The App Store being one of them. And their proprietary lightning port in iPhones became the more universal USB-C standard this year as a result of a lot of these concerns from lawmakers around the world. And so if iMessage is the next legislative front for them to fight, then they should be concerned about keeping it only iPhone exclusive. Ryan Knutson: One of the things that a lot of big tech companies have said is there's a lot of competition in tech and apps can become really popular and they're so easy to download, and there's Facebook Messenger and there's WhatsApp and there's Signal and there's Telegram. There's tons of messaging apps, so why does iMessage matter so much? Nicole Nguyen: People could just download WhatsApp, but inside of the US, the majority of Americans who have smartphones have iPhones and Apple has made iMessage the default messaging service. Most people use iMessage without even knowing it's called iMessage. It's just, it's pre-downloaded, you don't have to sign up for anything. Defaults are really powerful. Ryan Knutson: But soon, those default settings might play a bit better with Androids when it comes to texting. Apple says that later this year, it's planning to update the technology that the green messages run on. Instead of using ancient SMS, it's going to upgrade to something called RCS, which stands for Rich Communication Services. RCS is something that Google's been pushing Apple to adopt for years. Nicole Nguyen: It's a much better form of texting that Google has been a long proponent of. So you can, for example, see when texts are sent, you can send high resolution images and video, you can send audio notes. It's just a much better experience overall. And Apple is adopting it to throw a bone in the direction of interoperability, because it will make the experience of an iPhone user texting an Android user, or vice versa, much richer, but it's not quite iMessage. Ryan Knutson: So there'll still be blue iMessage chats that are separate from green texting chats. It's just that Apple will make this change that will make the green texting experience better and richer. Nicole Nguyen: Yes. Ryan Knutson: RCS might make the green bubble experience better, but a green bubble will remain a green bubble, which means it won't actually fix Will's problem. Will Marquardt: We would still have to ask the family to start a new chat, which they might be more willing to do than switch applications entirely. But their willingness to do that, I think really comes down to the feature parity of RCS versus iMessage. Ryan Knutson: Or their willingness to do that might come down to how much they love you. Will Marquardt: Very much so. It's a combination of those two things. If it's close to being good and they love me a lot, then maybe they'll do it. Ryan Knutson: That's all for today, Wednesday, January 3rd. The Journal is a co-production of Spotify and the Wall Street Journal. If you like our show, follow us on Spotify or wherever you get your podcasts. We're out every weekday afternoon. Thanks for listening. See you tomorrow. Kate Linebaugh is the co-host of The Journal. She has worked at The Wall Street Journal for 15 years, most recently as the deputy U.S. news coverage chief. Kate started at the Journal in Hong Kong, stopping in Detroit and coming to New York in 2011. As a reporter, she covered everything from post-9/11 Afghanistan to the 2004 Asian tsunami, from Toyota's sudden acceleration recall to General Electric. She holds a bachelor degree from the University of Michigan in Ann Arbor and went back to campus in 2007 for a Knight-Wallace fellowship. Ryan Knutson is the co-host of The Journal, The Wall Street Journal’s flagship daily podcast. He has worked at the Journal since 2013. Before joining the podcast, Ryan covered the wireless industry, and was responsible for a string of scoops including Verizon's $130 billion buyout of Vodafone's stake in their joint venture, Sprint and T-Mobile's never ending courtship, and a hack of the 911 emergency system that spread virally on Twitter. He also spent a year on the business side of Dow Jones, helping lead the company's strategic relations with tech companies like Apple and Google. Before WSJ, he reported for ProPublica, PBS Frontline and OPB, the NPR affiliate station in Portland, Ore. He grew up in Aloha, Ore. and graduated from the University of Oregon. "
}