{
    "title": "Where Will Apple Stock Be in 5 Years?",
    "date": "1/27/2024",
    "url": "https://www.fool.com/investing/2024/01/27/where-will-apple-stock-be-in-5-years/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Apple (AAPL -1.06%) is off to a mediocre start in 2024. The tech giant received a couple of analyst downgrades recently owing to potential weakness in iPhone demand, patent-related lawsuits, and a potential antitrust suit by the Justice Department. However, there was some relief for Apple investors after Bank of America Securities analyst Wamsi Mohan upgraded the stock from neutral to buy and also hiked the price target to $225 from $208. The upgraded price target points toward a 16% jump from current levels, and Apple's stock price jumped following Mohan's note. The BofA Securities analyst pointed out that Apple could benefit from a couple of strong tailwinds in the form of an iPhone upgrade cycle and the upcoming Vision Pro headset. According to Mohan, the growing adoption of additional artificial intelligence (AI) features in smartphones could drive a multiyear upgrade cycle for Apple's biggest product -- the iPhone. But will this catalyst be enough to drive solid gains for investors over the next five years? Let's find out. Shares of Apple have jumped an impressive 393% in the past five years, significantly outpacing the S&P 500's gains of 81%. So, a $1,000 investment in Apple stock half a decade ago is now worth almost $5,000.  AAPL data by YCharts. Apple's revenue during this period went from $265.6 billion in fiscal 2018 to $383.3 billion in fiscal 2023. That translates into a compound annual growth rate (CAGR) of 7.6%. Meanwhile, the company's net income increased from $59.5 billion in fiscal 2018 to $97 billion in fiscal 2023, a CAGR of just over 10%. It seems the market rewarded Apple despite the modest growth that it has clocked over the past five years. It's a bit surprising, but investors should note that Apple's earnings increased at a faster pace than the S&P 500's earnings over the same period.  AAPL EPS Diluted (TTM) data by YCharts. The good part is that the new growth drivers that BofA Securities points out could help Apple outgrow the S&P 500's earnings again over the next five years. For instance, the integration of additional AI features in smartphones is expected to become a crucial growth driver for a market that has been under pressure of late. Investment bank Morgan Stanley predicts that global smartphone sales could rise 4% in 2024 and 4.4% next year following last year's decline of 5%. The growth will be driven by new smartphones capable of running AI applications directly on the device instead of the cloud. The good part is that original equipment manufacturers (OEMs), such as Vivo and Xiaomi, saw solid growth in sales of their AI-enabled smartphones. Even Samsung joined the bandwagon with its new Galaxy S24 models, integrating on-device generative AI features into its latest smartphones. It is not surprising to see why OEMs are rushing to offer AI in smartphones. After all, a total of 1 billion generative AI-enabled smartphones are expected to be sold between 2024 and 2027, according to Counterpoint Research. The market for these phones is expected to clock a terrific CAGR of 83% during this period, hitting annual shipments of 522 million units in 2027 as compared to an estimated 100 million units this year. Given that Apple is the global leader in the smartphone market with a share of 20%, it is in a nice position to capitalize on this lucrative opportunity. What's more, Apple managed to increase its iPhone shipments in 2023 by 3.7% to 234.6 million units, overcoming the broader smartphone market's decline of 3.2%. It is also worth noting that Apple's closest rivals Samsung and Xiaomi saw their shipments decline 13% and 5% last year. Even better, Apple dominated the premium smartphone market (for devices priced at $600 or more) last year with an impressive share of 71%. All this puts Apple in a solid position to capitalize on the opportunity presented by AI smartphones, especially considering that the company is reportedly looking to integrate AI-focused features into its next-generation iPhones. Based on IDC's estimate of 1.17 billion smartphones shipped in 2023 and an average selling price (ASP) of $438 per smartphone, the overall smartphone market generated $512 billion in revenue. Apple, however, commanded an ASP of $1,038, which was a nice jump of 24% over 2019 levels. Using IDC's iPhone shipment estimate of 234.6 million units and the estimated iPhone ASP in 2023, the company's smartphone revenue reportedly stood at $243 billion last year. So, Apple commanded 47% of the smartphone market's revenue last year even though it accounted for just 20% of shipment volumes. Mordor Intelligence expects the global smartphone market to hit 1.85 billion units in 2029. If Apple can manage to increase its share to 25% thanks to developments such as AI, it could ship 460 million iPhones annually after five years. Again, it won't be surprising to see the iPhone maintain its pricing power and witness higher ASP in five years on account of AI-powered features. Assuming the ASP of an iPhone hits $1,100 in 2029, Apple could generate $506 billion in iPhone revenue after five years. That would be more than double the 2023 levels. More importantly, this suggests Apple's iPhone revenue is set to increase at a faster pace over the next five years. The company generated an estimated $164 billion in iPhone revenue in 2018, indicating that its revenue from this product increased 50% over five years. Now, the faster growth in iPhone revenue should translate into stronger overall growth for Apple since it relies on this product for 52% of its top line. Throw in the potential of the company's high-margin services business and other opportunities such as AI-powered personal computers, it won't be surprising to see Apple clocking faster growth in the next five years as compared to the last five. This could eventually lead to a healthy upside, which is why investors should consider buying this tech stock before it goes on an AI-fueled surge. Bank of America is an advertising partner of The Ascent, a Motley Fool company. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Bank of America. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}