{
    "title": "Apple's third-party app store announcements guarantee the company will end \nup in court",
    "date": "1/26/2024",
    "url": "https://9to5mac.com/2024/01/26/apples-third-party-app-store-announcements/",
    "text": "Apple’s third-party app store announcements – in which the company set out the terms on which it will claim compliance with European antitrust law – was nothing if not confident. The company’s announcement combined criticism of the law that required it, exceedingly tough requirements on any developer wanting to sell outside the App Store, and warnings intended to deter users from buying their apps anywhere else … The headline news was that iOS 17.4 complies with Europe’s Digital Markets Act (DMA) antitrust law, by allowing developers to sell their apps outside of the official Apple App Store. The headlining change in iOS 17.4 for users in the European Union is a new set of options for distributing iOS apps from alternative app marketplaces. This includes “new APIs and tools that enable developers to offer their iOS apps for download from alternative app marketplaces.” This is essentially Apple opening the iPhone to third-party app stores for the first time. iPhone users will be able to download a new app store from a third party’s website. The wording of Apple’s announcement makes it clear that the company is only begrudgingly complying with a law it thinks should never have been passed. “Apple is introducing new safeguards that reduce — but don’t eliminate — new risks the DMA poses to EU users” “The new options for processing payments and downloading apps on iOS open new avenues for malware, fraud and scams, illicit and harmful content, and other privacy and security threats.” “the unavoidable increased privacy and security threats this regulation brings” “a less intuitive user experience” “the new options for developers’ EU apps create new risks to Apple users and their devices” “may negatively affect the user experience, including impacts to system performance and battery life” “Apple will not be able to issue refunds, and will have less ability to support customers encountering issues, scams, or fraud” “more opportunities for bad actors to steal sensitive financial information” The impression Apple seeks to create is that this is essentially the end of app civilisation as we know it. If developers were hoping that this would open up a Mac-like world, where they are free to sell their own apps direct to users from their own websites, free from Apple’s cut, they were disappointed. Apple has gone the third-party app store rather than sideloading route. And no, a small developer can’t set up their own app store to sell their own apps: Apple requires anyone wanting to do this to have a €1M ($1.09M) letter of credit. This is not even saying you have to be big enough to have a million Euro business – it’s saying you must have so much money that you can set aside one million Euros to cover any claims from developers or app buyers. Effectively, it’s more than a million bucks tied-up in escrow, so you’d need to be a huge business to be in a position to do that. There’s also an annual fee of €0.50 (55c) per app install, which means that if you offer a free app which goes viral, you could be filing for bankruptcy rather than celebrating. Many freemium apps operate on a business model where a tiny fraction of their customers upgrade to a paid version, but if they hit over a million downloads, they pay for all the non-paying users too. I fell for Apple’s misleading numbers. It’s actually WAY WORSE. The $310k is MONTHLY.8 million installs would cost $3.7 MILLION https://t.co/sdC0HdZTw9 Did Apple just pull a Unity?!? WTF is going on in the games world? Imagine a few months from now you use Unity 6 (dumb move #1) and end up getting dinged per install TWICE. Plus the Core Technology Fee. What a year it’s gonna be…🤣 Apple has bought itself some time here for sure – in part, because what it has come up with is so complicated it will take regulators some time to digest all the details and run all the numbers. But there seems little doubt that Apple is aiming to do everything it can to make leaving the App Store as difficult and expensive as possible. Some tiny fraction of 1% of developers will be big enough to create their own ‘app marketplace,’ and developers who work on a freemium model could end up punished for their own success. Letters of credit and escrow are different things. A letter of credit is a contract between, in this case, the App Marketplace’s (as a foreign entity) bank and Apple to affect payment once proof has been submitted. Also, it demonstrates the creditworthiness of the App Marketplace prior to commencement of the agreement. Escrow is the actual withholding of funds while and as long as the agreement is in place.  That said, both can be applied simultaneously. 500K each if the parties are in agreement. Once all the dust has settled, it seems pretty clear that regulators are not going to consider what Apple has done as DMA compliant. Apple will maintain that it is. And sooner or later the two sides will end up arguing the case in court. As with most court battles involving Apple, it will likely be many years before a final ruling is made. Even if Apple loses – as I would expect it to – that means it has been able to keep developers in the App Store, and protect its 15% or 30% cut, for all that time. Who will win the PR battle – Apple, or the developers who are up in arms about this – remains to be seen. Photo by Colin Lloyd on Unsplash FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Ben Lovejoy is a British technology writer and EU Editor for 9to5Mac. He’s known for his op-eds and diary pieces, exploring his experience of Apple products over time, for a more rounded review. He also writes fiction, with two technothriller novels, a couple of SF shorts and a rom-com! "
}