{
    "title": "Samsung opens maiden company-owned store outside Korea close to Apple's \nfirst India store in BKC",
    "date": "1/23/2024",
    "url": "https://www.deccanherald.com/business/companies/samsung-opens-maiden-company-owned-store-outside-korea-close-to-apples-first-india-store-in-bkc-2861389",
    "text": "Follow Us Mumbai: Consumer electronics giant Samsung on Tuesday opened its first company-owned store outside South Korea, in the BKC business district. The Samsung store inside a mall is just over a km from rival Apple's recently opened store in another mall. The company's store is spread over 8,000 sq ft in the second floor of the Jio World Centre, built by a sister concern of the South Korean conglomerate. It has eight experience zones where customers can check out and then order an array of Samsung products, including TVs, audio systems, tabs, washing machines, refrigerators, and mobile phones. It has a kinetic video wall measuring 33 ft x 12 ft, which the company claimed is the largest in the country. Apple's store -- spread over 20,000 sq ft across two floors in the nearby Jio World Drive -- was inaugurated in April last year in the presence of the Cupertino-based company's Chief Executive Tim Cook. Asked about the Apple store's presence next door, Senior Director Sumit Walia said the company operates 1,600 brand stores in the country, with the first dating back to 2012, and added that it has a wider variety of options beyond smartphones as well. \"We are going after the customer, we are going after the right location where we can serve these experiences,\" he added. About the seemingly low footfall in the mall, Walia said everybody is welcome, and exuded confidence that the right people will walk in. He also pointed to the company's analysis, which said over two-thirds of products purchased in the brand stores are premium, which point to what the consumers desire. Earlier, its President and Chief Executive for southwest Asia, J B Park, said the company is the largest consumer electronics player in the country with a revenue of $10 billion. #Elections2024 "
}