{
    "title": "Top Stock Reports for Apple, UnitedHealth & Exxon Mobil",
    "date": "1/8/2024",
    "url": "https://finance.yahoo.com/news/top-stock-reports-apple-unitedhealth-190400751.html",
    "text": "Thursday, January 4, 2024 The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Apple Inc. (AAPL), UnitedHealth Group Incorporated (UNH) and Exxon Mobil Corporation (XOM). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Apple’s shares have essentially moved sideways to down since July 2023, but they have performed roughly in-line with the Zacks Tech sector over the past year (+41.6% vs. +45.1%) and handily outperformed the broader market's +22% gain. The company is benefiting from strong demand for iPhone. Apple expects the iPhone’s year-over-year revenues to grow on an absolute basis in first-quarter fiscal 2024.Revenues for Mac are expected to significantly accelerate compared with the fourth-quarter fiscal 2023’s reported figure. It expects the year-over-year revenue growth for both iPad and Wearables, Home and Accessories to decelerate significantly from the September quarter due to a different timing of product launches.For the Services segment, Apple expects average revenues per week to grow at a similar strong double-digit rate as it did during the September quarter. It is benefiting from increasing customer engagement in the services segment. The expanding content portfolio of Apple TV+ aids subscriber growth.(You can read the full research report on Apple here >>>)Shares of UnitedHealth have outperformed the Zacks Medical - HMOs industry over the past year (+12.3% vs. +9.8%). The company’s top line remains well-poised for growth on the back of a strong market position, new deals, renewed agreements and expansion of service offerings. The company’s solid health services segment provides diversification benefits.The Government business remains well-poised for growth. Adjusted net earnings per share are anticipated in the $24.85-$25.00 band in 2023, the midpoint of which indicates a 12.3% rise from the 2022 figure. A sturdy balance sheet enables business investments and prudent deployment of capital via share repurchases and dividend payments.However, membership in its global business continues to decline. High operating costs due to rising medical expenses are hurting margins. As such, the stock warrants a cautious stance.(You can read the full research report on UnitedHealth here >>>)Exxon Mobil shares have underperformed the Zacks Energy sector over the past year (-7.9% vs. -0.7%), but they have held up better than Chevron's -15.5% decline over the same time period.  The energy giant’s financials were weakened by years-long significant spending on low-return developments and the coronavirus pandemic. Also, high input cost is hurting refining operations.Nevertheless, this bellwether status and an optimal integrated capital structure that has historically produced industry-leading returns make it a relatively lower-risk energy sector play. In Stabroek Block, located offshore Guyana, ExxonMobil has made many major discoveries that significantly improve its production outlook.The advantaged growth projects of Guyana have lower greenhouse gas intensity than most of the oil and gas-producing resources across the globe. ExxonMobil’s deal to acquire Pioneer Natural will bolster its presence in the prolific Permian Basin.(You can read the full research report on Exxon Mobil here >>>)Other noteworthy reports we are featuring today include Amgen Inc. (AMGN), The Boeing Company (BA) and AT&T Inc. (T).Director of ResearchSheraz MianNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>> Today's Must Read Robust Portfolio, Services Strength to Benefit Apple (AAPL) Solid Top Line & Strong Cash Flows Drive UnitedHealth (UNH) ExxonMobil (XOM) Banks on Offshore Guyana Resources Featured Reports Amgen (AMGN) Well-Poised for Growth on a Solid PipelineThe Zacks analyst believes that Amgen has key pipeline assets in obesity and inflammation, indications that have a large market opportunity. Several data readouts are expected in the next 12 months. Boeing (BA) Gains From Rising Demand Amid Supply Chain IssuesPer the Zacks analyst, Boeing gains from solid demand for its commercial and defense unit, due to the rising air traffic and U.S. defense budget, respectively. Supply chain disruptions pose a concern. AT&T (T) Rides on Wireless Traction, Customer-Centric FocusPer the Zacks analyst, AT&T is likely to benefit from a solid traction in postpaid wireless and fiber businesses, backed by a customer-centric focus, lower churn rate and higher-tier unlimited plans. Medtronic (MDT) Banks on Expansion in International MarketsThe Zacks analyst is optimistic about Medtronic's expansion in emerging markets to address the massively unmet and untapped demand for advanced medical technologies. Palo Alto (PANW) Rides on Product Strength, Marketing EffortPer the Zacks analyst, Palo Alto Networks is gaining from solid contributions of its growth-oriented products including Prisma and Cortex. Increasing marketing efforts are also positive. Kroger's (KR) Product Freshness, Digital Efforts to Aid SalesPer the Zacks analyst, Kroger has been making investments to enhance product freshness and quality as well as expand digital capabilities. Digital sales grew 11% during third-quarter fiscal 2023. Low Carbon Activities Aid Weyerhaeuser (WY), Low Volumes AilPer the Zacks analyst, more capital inflows for carbon/ESG-related projects will prove beneficial for Weyerhaeuser. However, lower sales volumes in the Western and Southern markets raise concerns. New Upgrades Solid Initiatives, High Demand Aid International Paper (IP)Per the Zacks analyst, solid results from its Building a Better IP initiatives and solid demand for corrugated and containerboard packaging will drive International Paper's earnings. OUTFRONT Media (OUT) to Ride on Digital-Billboard ConversionPer the Zacks analyst, OUTFRONT Media is likely to benefit from its efforts to convert its business from static billboard advertising to digital displays and expansion of the OOH advertising platform. Impressive Subsea Robotics Outlook to Aid Oceaneering (OII)The Zacks analyst believes that Oceaneering's 'Subsea Robotics' unit, which provides cutting-edge technology solutions for remote working, will continue to experience activity and pricing gains. New Downgrades Landstar (LSTR) Continues to Grapple With Operating ExpensesThe Zacks Analyst is worried about escalating operating expenses, primarily due to a rise in purchased transportation costs and fuel prices, which pose a threat to the company's bottom line. Weakness in Consumer Packaging Unit Ails Berry Global (BERY)Per the Zacks analyst, Berry Global is struggling with the poor performance of the Consumer Packaging International segment due to softer consumer and industrial market demand. Volatile Long-term Flows, Weak Revenues Hurt Invesco (IVZ)Per the Zacks analyst, several macroeconomic headwinds are leading to a volatile trend in long-term net flows. This, along with a challenging operating backdrop, will likely hurt Invesco's revenues. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report The Boeing Company (BA) : Free Stock Analysis Report AT&T Inc. (T) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report UnitedHealth Group Incorporated (UNH) : Free Stock Analysis Report Exxon Mobil Corporation (XOM) : Free Stock Analysis Report Amgen Inc. (AMGN) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}