{
    "title": "Where Will Apple Stock Be in 3 Years?",
    "date": "1/21/2024",
    "url": "https://www.fool.com/investing/2024/01/21/where-will-apple-stock-be-in-3-years/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Since January 2021, Apple (AAPL -1.06%) has made for a fantastic investment, rising 44% during that time. This gain far outpaces the 14% rise of the Nasdaq Composite. The business, known for its powerful brand and innovative culture, has a history of posting healthy revenue and earnings growth. The question, though, is whether this momentum can continue. Investors have their attention focused on what the future might bring. With this in mind, where will this top tech stock be in three years? Even nearly 17 years after the first iteration was launched, Apple still generates most of its revenue from the iPhone. In fiscal 2023 (ended Sept. 30), $201 billion, out of total sales of $383 billion, was derived from this incredibly lucrative smartphone. However, there have been changes in recent years. In fiscal 2018, the iPhone represented 63% of revenue, so we've seen that over time, its importance to the overall business declines. I think this will continue over the next three years. Apple is finding success with other popular hardware products, like the MacBook, the iPad, the Watch, and AirPods. Management just launched the Vision Pro, which it hopes can be another successful hardware device. Software and services are becoming extremely important to the Apple story. Offerings like iCloud, Music, TV+, and Pay provide the business with a high-margin revenue source. This segment has consistently grown faster than the products division. It's likely to become a more critical part of the company. But if we look out three years, I believe it's likely that the iPhone will continue to be the main revenue driver for Apple. There's no evidence it won't. And because of this product's maturity, the result could be slower sales growth than shareholders have become accustomed to in past years. While Apple's mix of products and services will continue to shift as we look ahead, one thing is unlikely to change anytime soon. And that's Apple's profitability. The financial statements are impressive. Last fiscal year, Apple reported a net profit margin of 25%. If that isn't impressive on its own, consider that this metric has been remarkably consistent at more than 20% in each of the past 10 years. Turning to the balance sheet, there's probably no other company in the world in a stronger financial position. As of Sept. 30, Apple had $162 billion in cash. And while the business carries debt of $111 billion, the interest expense of under $4 billion last year is nothing to worry about, showing that Apple pays low rates on its borrowings. Because Apple generates so much free cash flow, more than it needs to reinvest into growth initiatives, the leadership team has been known to aggressively repurchase shares. This capital allocation strategy means that shareholders will see their ownership stakes rise over time, which is a good thing. There isn't any concern that Apple's business will remain on solid footing in the years ahead. However, from an investment perspective, we must also factor in the valuation to figure out what the return potential looks like. Apple's price-to-earnings (P/E) ratio is currently at 29.9, which is far higher than its 10-year average. For a mature and slower-growing business, this seems expensive. It's impossible to know what the P/E should be in three years. But if we assume that it drops to 25 around January 2027, which seems reasonable, this creates a 17% headwind for shareholders. Given the valuation concerns, there's a very real possibility that investors searching for market-beating returns from Apple over the next three years will be disappointed. Neil Patel and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}