{
    "title": "Sonos nabs Apple's finance director as new Group CFO",
    "date": "1/11/2024",
    "url": "https://the-cfo.io/2024/01/11/sonos-nabs-apples-finance-director-as-new-group-cfo/",
    "text": "Casey marks the third senior executive to leave the tech giant in recent months. She will join Sonos later in January, as it embarks on ambitious growth plans. Apple is experiencing a significant loss as one of its top executives departs for a new opportunity. Saori Casey, Apple’s vice president of Finance, is set to join Sonos, a prominent smart speaker company, as its CFO. This move marks another high-profile defection for Apple, as Casey brings her extensive experience and expertise to the audio technology company. Casey’s impressive finance career spans over a dozen years at Apple, where she served as a top deputy to CFO Luca Maestri. During her tenure, Casey played a crucial role in overseeing financial planning, forecasting, and investor relations. Her deep understanding of the inner workings of a tech giant like Apple positions her as a valuable asset for Sonos as they navigate the competitive market of smart speakers. Casey’s departure from Apple follows a string of executive exits from the tech giant. Steve Hotelling, a key contributor to technologies such as the iPhone’s multitouch screen, Touch ID, and Face ID, recently announced his retirement. Additionally, Tang Tan, Apple’s vice president of Product Design, is set to leave in February 2024. Casey’s appointment as CFO at Sonos is set to take effect on January 22, 2024. She will be succeeding Eddie Lazarus, who will transition to the role of Chief Strategy Officer while maintaining his responsibilities as Chief Legal Officer. Lazarus’s expertise and strategic insights will continue to contribute to Sonos’ growth and success. “The depth and breadth of her experience at world-class companies like Apple and Cisco make her perfectly suited to build on our momentum and seize the opportunity ahead,” said Sonos CEO, Patrick Spence. Sonos has established itself as a leading brand in the smart audio equipment market, often referred to as “the Apple of speakers.” The company’s focus on premium hardware with software verticals has garnered a loyal customer base worldwide. However, with the smart audio equipment market experiencing a slowdown, Sonos is looking to expand into new categories, including headphones, set-top boxes, and video services. In preparation for this expansion, Sonos has been strategically appointing high-ranking Apple employees to leverage their expertise as they venture into new devices beyond smart speakers. This move demonstrates Sonos’ commitment to innovation and diversification in the tech industry. With Casey’s appointment as CFO, Sonos aims to capitalise on her expertise and experience to fuel its growth and innovation. The company’s plans to expand into new device categories, including headphones and video services, demonstrate a commitment to adapt and stay ahead in the ever-evolving tech landscape. Sonos’ iconic consumer brand and portfolio of audio products have resonated with millions of customers worldwide. By combining premium hardware with user-friendly software, Sonos has established itself as a trusted name in the industry. With Casey’s financial acumen and strategic insights, Sonos is well-positioned to solidify its market presence and explore new opportunities.  Comments are closed. Join our webinar to learn how to streamline your a... Copyright © 2024 The CFO "
}