{
    "title": null,
    "date": "1/12/2024",
    "url": "https://www.independent.co.uk/tech/microsoft-most-valuable-company-apple-b2474872.html",
    "text": "Notifications can be managed in browser preferences. Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in Brief supremacy only lasts a few hours – before Apple comes back Find your bookmarks in your Independent Premium section, under my profile Microsoft briefly overtook Apple to become the world’s most valuable company for the first time since 2021. The US software giant saw its value rise above its rival after a relatively poor start to the year from the iPhone maker, however Apple closed the day ahead. Microsoft has seen its share price rise by more than 60 per cent over the last year, taking its market cap above $2.8 trillion for the first time in its history. The company has been buoyed by its involvement with ChatGPT creator OpenAI, whose AI tools have been incorporated into Microsoft’s search engines and keyboards. Last week, Microsoft announced that it was making a change to the Windows PC keyboard for the first time in 30 years by adding a “Copilot key” to access its AI tools. The move signals the beginning of the era of the “AI PC”, according to Microsoft executives, who said it would make its introduction in late February. Last year, Apple became the first company in the world to reach a market cap of $3 trillion, however it has since slipped to below $2.81 trillion. The iPhone maker’s recent dip has been attributed to falling smartphone demand and a recent US sales ban of the latest Apple Watch range following a patent dispute. Despite the struggles, Apple was identified as the most efficient tech company when analysing how much profit it generates in relation to its size. A study by Agency Reviews revealed that a profit last year of $99.8 billion for the Cupertino company meant each of its 164,000 employees generated an average profit of $609,000. Microsoft ranked fourth with a proft-per-employee of $329,000 in 2023. Join thought-provoking conversations, follow other Independent readers and see their replies Reuters Want to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today. Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in Log in New to The Independent? Or if you would prefer: Want an ad-free experience?  "
}