{
    "title": "Thursday's biggest stocks to watch: Apple, Netflix, Nvidia, Meta",
    "date": "1/18/2024",
    "url": "https://www.cnbc.com/2024/01/18/thursdays-biggest-stocks-to-watch-like-apple.html",
    "text": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  Here are Thursday's biggest calls on Wall Street: KBW said it sees too many negative catalysts after the company's earnings report Wednesday. \"To be clear, we still like the SCHW story over a multi-year view with eventual tailwinds from cash troughing, getting back to repurchases, and significant back-book repricing, but these catalysts will simply take time to play out, with most of them 2025 events.\" UBS said \"industry dynamics\" are poised to drive Netflix shares higher. \"We are incr. our estimates & price target to $560 ($500 prior). We believe Netflix is the main beneficiary as the industry increases prices, consolidates platforms, cuts spend & renews focus on licensing, likely driving upside to estimates & the multiple.\" Bank of America said artificial intelligence and Vision Pro should drive upside for Apple. \"We upgrade Apple to Buy from Neutral, given: 1) stronger multi-year iPhone upgrade cycle driven by need for the latest hardware to enable Generative AI features to be introduced in 2024/2025 (large part of installed base still on iPhone 11), 2) higher growth in Services as Apple better monetizes its installed base.\" Read more about this call here. Mizuho said Affirm's debit card is a \"game-changer.\" The firm says it also likes Robinhood in 2024. \"We see the 'Affirm Card' as a game-changer to credit payments and are highly bullish on the opportunity to bring BNPL/hybrid debit/credit to brick and mortar through the card. … HOOD: Share gains in retail trading across products should ensue as improved sentiment benefits equity and options trading.\" D.A. Davidson said the stock remains a \"long term winner.\" \"As we indicated in the initiation, we believe NVDA is a long-term winner in accelerated computing that can grow at a 20% CAGR off of CY22 revenue.\" Baird said it sees several positive catalysts for Rivian shares in 2024. \"We recently named RIVN as one of our Best Ideas for 2024 and see several potential catalysts ahead.\" Wolfe upgraded several semis stocks and says it's getting \"incrementally more constructive.\" \"We are upgrading ADI, NXPI, and MCHP to Outperform from Peer Perform. We have become incrementally more constructive on analog, and we continue to be selectively constructive elsewhere in our coverage.\" Barclays said the casino stock is underappreciated. \"RRR is a pure play on the attractive Las Vegas Locals gaming market with an under-appreciated competitive moat and development pipeline that should collectively drive EBITDA growth above regional peers over the short, medium and long term.\" Bank of America raised its price target on Microsoft to $450 per share from $430. \"In summary, we expect total revenue growth to accelerate to solid high teens from current mid-teens level in a reasonable upside case.\" Wells Fargo said it's bullish on the fast-food giant in 2024. \"MCD: Sizing the Unit Growth Acceleration Lever; EBIT Growth Contribution Poised to Double.\" Bernstein raised its price target on the stock to $435 per share from $375. \"After a generational performance in 2023, is Meta's stock still a good investment? Wecertainly think so.\" Guggenheim said Target is well-positioned in 2024. \"We believe the rate of change of top line and margins is declining and believe that at current levels the shares offer an attractive risk/reward ratio. We see various levers/paths for the company to begin its return to a 6% operating margin.\" Citi downgraded the airline and says it sees too much uncertainty. \"Although JetBlue and Spirit can still appeal Tuesday's court ruling, which blocked the carriers' proposed merger, it is unclear why JetBlue wouldn't cut its losses here and recognize that it avoided a risky bid on a highly levered carrier with steep losses.\" Loop raised its price target on Costco to $755 per share from $710 and said it sees upside to estimates. \"We are raising our revenue growth estimates this year and next on a better club growth target for F2024 than we had previously modeled and merchandising improvements we're seeing in warehouse clubs.\" Piper Sandler said shares of the mattress company are attractive. \"TPX has become a dominant operator within the mattress industry, with a multi-year growth outlook that is becoming highly attractive to long-term investors.\" Bernstein initiates CrowdStrike and Palo Alto and said it's bullish on cybersecurity. \"PANW (O, $402 PT, 21% upside) in firewalls and CRWD (O, $334, 17% upside) in endpoint are leaders in maturing categories, pursuing platform expansion into adjacent growth categories.\" CFRA said shares of Paramount are compelling. \"We think the current share price is an attractive entry for our upgrade to a Buy rating.\" Bank of America said the motorcycle company is well-positioned for 2024. \"HOG's sportster category should benefit in 2024 from easy comps as it laps the wind down of legacy models which we estimate accounted for more than half of year-to-date retail unit declines thru November.\" The firm said an \"improving macro backdrop will drive higher spending on anti-financial crime, higher equity markets, and improving IPO market\" for shares of Nasdaq. \"NDAQ is our top 2024 idea in the exchange space because of accelerating organic growth, deleveraging, and attractive valuation. We believe the improving macro backdrop will drive higher spending on anti-financial crime, higher equity markets, and improving IPO market.\" Morgan Stanley said it sees an attractive entry point for auto rental company Hertz. \"While risks remain, we believe forward estimates have fallen far-enough below our forecast for normalized earnings to drive an upgrade to this strategically consequential rental car giant.\" Bank of America said the stock remains a top idea for 2024. \"We reiterate our Buy rating/top pick and are raising our PO to $800 from $750. ServiceNow is a key beneficiary from the three secular themes outlined in our year ahead: AI, Consolidation & Cloud.\" Morgan Stanley raised its price target on the stock to $1,000 per share from $952 and says it sees a \"compelling entry point.\" \"BLK best positioned to capture key growth zones and drive +13% EPS CAGR.\" Argus said the stock is compelling at current levels. \"We expect Pinterest to benefit from its recently announced partnership with Amazon and expanded advertiser base.\" Deutsche Bank said Salesforce is a top idea for 2024. \"We expect Subscription revenue growth to accelerate into the low teens in the coming years with continued margin expansion, driven by (1) unparalleled access to trusted customer data helping to unlock the potential for generative AI, (2) pricing and packaging levers, (3) improving execution.\" JPMorgan said in its upgrade of the Southeast China ride-hailing and food delivery company that the valuation is \"reasonable.\" \"In our view, financial results in 1H24 are likely to drive positive revisions in near-term earnings expectations with ongoing industry growth, easing competition and rationalization in delivery industry. We upgrade GRAB to OW.\" Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by "
}