{
    "title": null,
    "date": "1/17/2024",
    "url": "https://investorplace.com/market360/2024/01/7-rock-solid-dividend-companies-to-anchor-your-portfolio/",
    "text": " Dividend stocks are a great way to begin your portfolio Advertisement Source: Shutterstock If you’re looking to anchor your portfolio for financial success, buying and holding solid dividend stocks is one of the best strategies you can employ. These stocks are a great investment option for anyone who wants to generate income and build wealth over the long term. These stocks, known for their consistent dividend payments and potential for growth, offer several advantages that make them highly attractive to investors. When you’re looking for solid dividend stocks, one thing to consider is the consistency of dividend payouts. You want your dividend stocks to pay out quarterly or even monthly and have a consistent payout. Avoid companies that are cutting their dividend, because that’s a sure sign of trouble afoot. Even better, find a dividend stock with a history of increasing its payout. Regular income can prove to be invaluable, especially for retirees who rely on investment income as a primary source of cash flow. Investors can also reinvest their dividend payouts to increase their positions. This allows investors to acquire more shares of the same solid dividend stocks over time, leading to potential compounded growth. We used the Portfolio Grader and Dividend Grader tools to choose some solid dividend stocks to start 2024. All of these names are worthy of consideration in any income portfolio. Apple (NASDAQ:AAPL) stock is in a little slump right now, with shares down 6% over the last month. First, there was news of a court-ordered (short-lived) import ban on Apple watches, then then it was a series of sell-side downgrades predicting lower iPhone demand, slower Services growth, and a rich valuation. Apple is now on the verge of losing its position as the largest company in the world by market capitalization. But this is still an excellent company and a good stock. If anything, the pullback is a chance to get shares at a slight discount before AAPL moves higher again. Apple’s suite of products has massive potential to use generative artificial intelligence, and its AI-related innovations will drive earnings growth in the future. AAPL stock still shows growth of 38% over the last year, and it pays a dividend yield of 0.5%. It gets “B” ratings in the Portfolio Grader and the Dividend Grader. This is just one of those solid dividend stocks that keeps on giving. If it’s January, it’s tax season. And companies like Intuit (NASDAQ:INTU) will be in the forefront. Intuit is a software financial company that is best known for its tax preparation products, including TurboTax and QuickBooks. The products help people who aren’t financial professionals do their personal taxes without going to a tax preparer or accountant. Intuit also owns Credit Karma, which allows people to monitor their credit and offers credit card and loan recommendations, and Mailchimp, which is a marketing, automation and email platform. Earnings for the first quarter of fiscal 2024 (ending Oct. 31, 2023) included $3 billion in revenue, up 15% from a year ago. Income was $307 million or 85 cents per share, up from $76 million and 14 cents per share a year ago. Management is expecting full-year revenue to be in a range from $15.89 billion to $16.1 billion, which would be an increase of 11% to 12% from a year ago. INTU pays a dividend yield of .6% and the stock is up 54% in the last year. It also gets “B” ratings in the Dividend Grader and the Portfolio Grader. Visa (NYSE:V) is a global leader in payment processing and credit cards. The company does business in over 200 countries and accounts for more than half of the cards in circulation. Visa doesn’t lend money directly but serves as a link between banks, customers, and businesses. Visa makes money from assessment fees that are charged for processing merchants’ credit card or debit card transactions. Visa also makes money by allowing banks to brand its cards with the Visa name. The U.S. economy is stronger than expected and consumers are still more than willing to incur debt for major and household purchases. As long as the consumer is bullish on the economy, Visa will continue seeing profits. Earnings for the fiscal fourth quarter of 2023 (ending Sept. 30, 2023), included $8.6 billion in revenue, up 11% from a year ago. For the full year, Visa brought in $32.7 billion, which was also an 11% increase from 2022. V stock is up 18% in the last year and has a dividend yield of 0.8%. It gets “B” ratings in the Dividend Grader and the Portfolio Grader. TJX Companies (NYSE:TJX) stands out as a brick-and-mortar retailer that actually is flourishing with in-person shopping rather than relying on a vibrant e-commerce division. That’s because of the nature of the company. TJX operates several low-cost department store chains, including Marshall’s HomeGoods, Sierra, and T.J. Maxx, and sells clothing, home goods and furnishings. In total, it has over 4,900 locations. As a discount retailer, its offerings vary from store to store and often, week to week. Shopping at these stores can be like a treasure hunt, sometimes finding a gem and other times coming up empty. Earnings for the fiscal third quarter of 2023 (ending Oct. 28, 2023) included revenue of $13.26 billion, up from $12.16 billion a year ago. Net income was $1.19 billion, or $1.03 per share, versus $1.06 billion and 91 cents per share a year ago. TJX stock is up 15% in the last year and provides a dividend yield of 1.4%. It gets a “B” rating in the Portfolio Grader and an “A” rating in the Dividend Grader. Verisk Analytics (NASDAQ:VRSK) is a data analytics and risk assessment firm based in New Jersey, right outside New York City. The company started as an insurance rating bureau before evolving into a data analytics company. Verisk’s insights help companies be more efficient, improve underwriting, improve profitability with claims, and make decisions about climate risks, extreme events and political issues. It uses AI and machine learning to analyze records to create insights that help its clients manage risk. The company operates in 20 countries and is continuing to expand – in January it announced the purchase of Rocket Enterprise Solutions in Germany to further its expansion in Europe. Earnings for the third quarter showed revenue of $677.6 million, up 11.1% from a year ago; net income of $221.2 million, which was up 17%, and earnings per share of $1.52, which was up 26% from last year. VRSK stock is up 27% in the last year and provides a dividend yield of 0.6%. It gets “B” ratings in the Portfolio Grader and the Dividend Grader. International Business Machines (NYSE:IBM), or IBM, is one of the best-known computer companies in the world. The blue-chip stock is known for its AI-powered Watson platform, a data analytics processor that stormed into the public consciousness in 2011 when it won a match on the Jeopardy! game show. Last year IBM unveiled the watsonx platform, which incorporates generative AI and machine learning. The platform will allow organizations to train and deploy advanced AI models while maintaining data privacy. Third-quarter earnings showed that the company still has room to grow, even after over 100 years. Revenue was $14.8 billion, up 4.6% from a year ago, with the software unit growing by 7.8% and the company’s consulting business growing by 5%. IBM offers an attractive 4% dividend yield and the stock is up 10% in the last year. It gets “B” ratings in the Portfolio Grader and the Dividend Grader. Broadcom (NASDAQ:AVGO) is a maker of semiconductors – an important product in today’s age of connectivity and AI. Broadcom’s products are used for data centers, networking, software, storage, wireless and industrial applications. Its Jericho3-AI chip came out last spring and can connect as many as 32,000 graphics processing units at a time, giving computers the power they need to handle complex AI-powered software. Broadcom also finally closed its purchase of VMWare, which will boost the company’s bottom line and make it easier for clients to build and modernize private and hybrid cloud environments. Third-quarter revenue was $8.87 billion, up 5% from a year ago. AVGO stock offers a dividend yield of 1.9% and is up 180% in the last year. It gets a “B” rating in the Dividend Grader and an “A” rating in the Portfolio Grader. On the date of publication, Louis Navellier did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The InvestorPlace Research Staff member primarily responsible for this article had a long position in AAPL. The staff member did not hold (either directly or indirectly) any other positions in the securities mentioned in this article. Artificial Intelligence, Bank, Financial, Consumer Discretionary, Retail, Semiconductor, Software, Technology   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/01/7-rock-solid-dividend-companies-to-anchor-your-portfolio/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Market Analysis Market Analysis Market Analysis Market Analysis Market Analysis Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}