{
    "title": null,
    "date": "2/4/2024",
    "url": "https://www.benzinga.com/news/24/02/36926411/vision-pros-future-version-may-replace-the-ipad-says-mark-gurman-many-people-buy-apples-tablets-just",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Apple Inc. AAPL released its highly-anticipated, first-generation mixed reality headset on Feb. 2 and popular tech analyst Mark Gurman has compared the headset's functionality with that of an iPad in his early review. What Happened: In his weekly \"Power On\" newsletter, Bloomberg columnist, Gurman said that while these are still early days for Apple Vision Pro and there is potential for significant changes in the coming years, \"for now, I'm going to treat my Vision Pro like a new iPad.\" Gurman admitted that it is \"impossible\" to provide an in-depth review after just spending a couple of days with Vision Pro, he said that as per the initial observation, the headset appears to have the potential to become the ultimate tool for watching movies, a brilliant videoconferencing machine, and a viable alternative to laptops for lightweight computing on the go. \"If that sounds familiar, the same things have been said about the iPad. And that's not a bad thing,\" he added. \"My first takeaway from using the Vision Pro is that some future version may eventually replace the iPad.\" \"Many people buy Apple's tablets just for these kinds of activities — movies, video chats and basic tasks — and the Vision Pro could fill that need (especially if the price and weight come down),\" Gurman stated. The analyst also spoke about the Vision Pro buying experience saying that it \"was nothing like purchasing an iPhone, iPad or Mac.\" \"It's not like a quick trip to the store. But it was a fairly smooth undertaking, with a few hiccups,\" he said. Prospective customers looking to purchase the device initiate the process with a facial scan, either in-store or online. This is followed by a detailed product demonstration. \"Vision Pro has to be carefully fitted to a customer's head, with just the right light seal and (if necessary) prescription glass inserts.\" See Also: Tim Cook Opens Up On Apple Watch Ban, Licensing Masimo Tech: ‘We’re Focused On Appeal’ Why It's Important: Previously, it was reported that despite the high price point of the headset, Apple Vision Pro has garnered significant internet. According to Ming-Chi Kuo, Cupertino sold between 160,000 to 180,000 units of Vision Pro during the first pre-order weekend. While giving the review of Apple Vision Pro, tech YouTuber Marques Brownlee said that while the headset has several upsides like it excels in immersion, spatial placement, eye tracking, hand control, passthrough functionality, ecosystem integration, and spatial audio, there are downsides to consider as well including the device's weight and comfort, limited app selection at present, relatively short battery life, and the higher price point. Photo Courtesy: Apple Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Apple’s Longtime Focus On iPhone To Change In 2024, With Vision Pro, AirPods Taking The Limelight, Suggests Mark Gurman © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}