{
    "title": "1 Unstoppable Stock Set to Join Apple and Microsoft in the $2 Trillion Club \nin 2024",
    "date": "2/23/2024",
    "url": "https://www.fool.com/investing/2024/02/23/1-unstoppable-stock-set-to-join-apple-and-microsof/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Reaching a $1 trillion valuation is one of the most prestigious milestones a company can achieve, and it usually takes decades of consistent operational excellence. That's why a mere six U.S. companies have valuations of $1 trillion or more right now: However, Apple and Microsoft are the only two companies to have valuations north of $2 trillion at the moment. In fact, they were each worth more than $3 trillion before a recent sell-off in their stock. One more company looks almost certain to join them and stay there. On Friday, within the first hour of the market opening, Nvidia crossed the $2 trillion mark but closed the day back under the major milestone. It is worth $1.97 trillion as of this writing, and $1 trillion of that value was created in the last 12 months alone. Following another spectacular set of financial results released this month, Nvidia is now charging toward a $2 trillion market cap. Here's why it's likely to get there -- and stay there -- this year. Nvidia was founded in 1993 with a goal to bring 3D graphics to the gaming and multimedia industries. It released the world's first graphics processing unit (GPU) in 1999, which marked the birth of its GeForce brand, and it remains the dominant name in gaming today. But GPUs are now transforming the data center. A GPU features hundreds of cores, which means it can process high volumes of data much faster than a traditional central processing unit (CPU) and makes it ideal for artificial intelligence (AI) workloads. Nvidia designed its H100 GPU for that specific purpose, and it has been almost single-handedly responsible for the company's incredible growth over the past year. While the H100 is already the first choice for most AI data center operators, Nvidia's innovation engine has been hard at work developing the next iteration. It's called the H200, and it's twice as fast as the H100 when it comes to inferencing, which involves feeding an AI model live data so it can make predictions. It also consumes half the energy, making it far cheaper for data center operators to run. Shipments of the H200 will ramp up this year, and Nvidia already says there is no way it will keep up with demand. Image source: Nvidia. Much of Nvidia's success can be attributed to its software ecosystem, which is increasingly important. Its CUDA platform allows developers to optimize their GPUs so they can develop applications much faster. But here's the kicker -- CUDA can't be used with chips from other manufacturers, so developers who are comfortable with CUDA have to stick with Nvidia's GPUs. That's why it will be so difficult for competitors to unseat Nvidia's dominance. But that's not all. CEO Jensen Huang says Nvidia's engineers now manage, optimize, patch, and tune the AI software stack for businesses through its AI Enterprise platform. It's effectively an artificial intelligence operating system that offers development tools and pre-trained models to help businesses accelerate the creation of AI applications. Nvidia AI Enterprise is accessible through major cloud platforms like Amazon Web services, Microsoft Azure, and Google Cloud, which effectively serve as distribution channels and give Nvidia access to millions of potential customers. Huang believes every enterprise in the world deploying software will eventually use Nvidia AI Enterprise. It was only launched in 2021 -- before AI really took off -- yet it has already amassed $1 billion in annual revenue. Nvidia just reported its financial results for fiscal 2024 (ended Jan. 28). Its revenue surged to $60.9 billion, which was up 126% compared to fiscal 2023, and as the below chart shows, it has increased more than tenfold in just the last eight years.  The data center was the main driver of Nvidia's spectacular fiscal year, thanks to AI and the H100 GPU. The data center segment was responsible for $47.5 billion (78%) of the company's total revenue, and it marked an increase of 217% from fiscal 2023. The company expects to carry its momentum into the first quarter of fiscal 2025. Its forecast points to $24 billion in total revenue, which will represent 233% growth compared to the first quarter of fiscal 2024. However, investors should really focus on the long term because Nvidia believes the generative AI revolution is only getting started. Jensen Huang believes accelerated computing and generative AI will lead to a doubling of the current installed base of world data center infrastructure, which is an opportunity he says will be worth hundreds of billions of dollars in just the next five years. As I touched on at the top, Nvidia is currently worth $1.97 trillion. It already leapfrogged tech giants like Amazon and Alphabet in terms of valuation, and if its stock gains just another 1.5%, it will join Apple and Microsoft in the $2 trillion club. Based on Nvidia's $12.96 in non-GAAP (adjusted) earnings per share (profit) in fiscal 2024 and its current stock price of $788.17, it trades at a price-to-earnings (P/E) ratio of 60.6. That's almost twice the 32.1 P/E ratio of the Nasdaq-100 index, which implies Nvidia is extremely expensive. However, the stock market is a forward-looking machine. Wall Street is already forecasting $20.44 in earnings for Nvidia in fiscal 2025, which would reduce its P/E ratio to 37.9 (assuming its stock price remained the same). While that is still more expensive than the Nasdaq-100, a company growing as quickly as Nvidia deserves a premium. There might even be significant upside to come. A Wall Street analyst from Loop Capital believes Nvidia stock could jump 53% to $1,200. That would take Nvidia's valuation to almost $3 trillion! That target is a little ambitious -- if not unrealistic -- in the short term, but if Jensen Huang is right about the data center opportunity in the next five years, the stock could certainly get there in the longer term. In any case, Nvidia's entry into the $2 trillion club now appears to be a foregone conclusion. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}