{
    "title": "Will Apple launch a foldable iPhone?",
    "date": "2/7/2024",
    "url": "https://finance.yahoo.com/video/apple-launch-foldable-iphone-205151948.html",
    "text": "According to a new report from The Information, Apple (AAPL) has two new active prototypes of foldable phones in the works. Whether or not those prototypes will ever make it to market, however, is up for debate. Yahoo Finance Tech Editor Dan Howley breaks down the latest development for Apple and what it could mean for the company moving forward. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino JULIE HYMAN: Is Apple finally planning to introduce a flip iPhone? According to a new report by the information, Apple has at least two active prototypes of foldable phones. Yahoo Finance's Dan Howley joins us now with more. So active prototypes, what does that mean? DAN HOWLEY: It means a few things. It means that they are interested in this kind of technology. It's something that other competitors have out there. We have Samsung and Google with flip phones right now. There's a bunch in China. And I think that's really where the kind of interest lies, especially for Apple. You're seeing more consumers in China pick up foldable phones. They're advanced. They have better capabilities. They're also pretty darn cool, right? I mean, I've used them a couple of times and they're fun. So I think what Apple is trying to do here is kind of what Apple does, keep up with the Joneses as far as what's popular and then add its own spin on it, provide its own capabilities. The big thing here, though, is it's a prototype, it does not mean that one is coming. Apple, like every other company, develops prototypes and then shelves them forever. They go in that little box from-- was it \"Raiders of the Lost Ark,\" I think, and just sits in a warehouse somewhere forever. So it doesn't necessarily mean we're going to get one, but the prospect it's looking a little more promising. Though according to this report, it wouldn't happen anytime in the next year or so. JOSH LIPTON: And some people, they might be asking, what could they do with a flip phone that they couldn't do with this? DAN HOWLEY: Right, so that's a good idea-- a good question. The idea is that this is a large phone, right? Where's my iPhone? I have the 15 Pro Max, so it's a big boy-- JOSH LIPTON: Yeah. DAN HOWLEY: --kind of chunky. The idea would be, OK, well, I don't want this big screen or I want a bigger screen than this. I can just fold it in half and then just drop it in my pocket and there you go. With Samsung, they have the Z Flip and the Z Fold. The Z Flip-- this right here is the Z Fold where it kind of opens like a book. The Z Flip is one that opens like a clam-shell. And so the clam-shell design, I'm going to be honest, is awesome. I love it. You can like unfold it halfway, and then let it sit on its own and prop itself up, and then take selfies. It's also incredible to slap that thing shut when you're ending a phone call, even if you're not mad at someone, just to be feel like you're like-- JULIE HYMAN: Satisfying finality of ending the call. DAN HOWLEY: Bam! JULIE HYMAN: So Dan, obviously, you have had experience with it. For viewers who are not familiar, Dan went to South Korea, got to see how the flip phone was made, got to test it out. How is that thing selling for Samsung? DAN HOWLEY: For Samsung they're selling surprisingly well. They are more expensive than most phones, right? So the Z Fold is the most expensive. That's the Fold right there. The Flip is less expensive, around $1,000 . I believe the Fold is $1,800, around there. So it's a spicy meatball as, I guess, someone would say. JULIE HYMAN: Yes, you just did. DAN HOWLEY: Yeah. JULIE HYMAN: I have to say, I was on the train yesterday and I was watching a show on my regular sized iPhone. And the guy next to me pulled out like an iPad or something and I thought, huh, that would be nice to watch something on a bigger screen, but I don't want to carry around the iPad. JOSH LIPTON: Yeah, there you go. DAN HOWLEY: And that's the exact point there. JOSH LIPTON: That's it. DAN HOWLEY: So I mean you get the bigger screen, you get the better styling, because it does look really nice. And there's more functionality to it. So I think if Apple can do it, they will. I just don't think they're going to release something that's frankly kind of bulky when it's folded up like Samsung's devices. JOSH LIPTON: Yeah, you can see it though, higher price, medium margins, China. DAN HOWLEY: I mean, that's the big thing, I think, is for them is for China. JOSH LIPTON: Yeah, makes sense. Dan, thank you, as always, for joining us. Related Quotes "
}