{
    "title": "Apple Vision Pro at a fraction of the price? Try China’s Shenzhen",
    "date": "2/17/2024",
    "url": "https://www.scmp.com/tech/big-tech/article/3251935/chinese-start-emdoorvr-counts-apple-vision-pro-lookalike-break-consumer-headset-market",
    "text": "One of them is the Vision SE, made by Shenzhen-based headset maker EmdoorVR. CEO Shi Qing said the company was hoping to leverage the interest around Apple’s Vision Pro to survive a slowdown in the virtual reality (VR) and augmented reality (AR) industry. “We did not want to miss the Apple Vision Pro opportunity, so we rode the wave and made something similar,” he said. From its white straps and curved front screen down to its name, the Vision SE shows remarkable similarities with Apple’s headset. Yet, their functionality and prices are starkly different. For less than 2,000 yuan (US$280), the Vision SE lets users view videos, web pages and workplace apps in a VR and AR environment through its 5.5-inch LCD display that has 3664 x 1920 pixels combined. But the device, powered by Qualcomm’s entry-level AR and VR processor Snapdragon XR1, lacks the eye tracking and hand-gesture interaction experience offered by the Apple Vision Pro, which has a starting price of US$3,499 and costs twice as much in China’s grey market. While Apple’s device dives into the new concept of spatial computing, Emdoor’s Vision SE focuses more on providing an entertainment experience, according to Shi. Shi said he recognised the two devices’ resemblance, which has earned the Vision SE the nickname “Huaqiangbei Vision Pro” on social media, after the famed consumer electronics market in Shenzhen that is known for selling knock-off gadgets. Shi stressed that the company had filed for relevant patents and undergone auditing to avoid legal risks. The devices from EmdoorVR and Apple arrived after a rocky year for the AR and VR industry, which saw global shipments decline 8.3 per cent to 8.1 million units in 2023, research firm IDC estimated in December. Demand was curtailed by macroeconomic pressures on both consumers and businesses, according to that report. 2024 is going to be different, according to IDC. The sector is “at a critical point in its short history,” said Ramon Llamas, IDC research director for mobile devices and AR/VR. “Apple’s entry [in 2024] will bring much needed attention to a small market, but it will also force other companies to compete in different ways.” Established in 2015, EmdoorVR started as a contract manufacturer of VR devices for Chinese tech firms including iQiyi and ZTE, as well as other industry and government clients. EmdoorVR’s enterprise-facing business contributes around 90 per cent of the firm’s total revenue, according to Shi. The company has shipped 200,000 units of its AX161 headset, an enterprise product with the same specifications as Vision SE, since its launch last year. Vision SE is EmdoorVR’s shot at the consumer segment, and the company is counting on Apple to pave the way. The device’s marketing and launch schedule follows closely that of the Californian giant: Vision SE hit the market in October, just months after Apple unveiled the Vision Pro in June. EmdoorVR then showcased its headset at CES, one of the world’s leading consumer electronics expos, which took place in Las Vegas last month, right before the Vision Pro shipped on February 2. Alibaba is the owner of the South China Morning Post. Emdoor’s Shi said he saw the Apple Vision Pro as a major opportunity to educate the market and bring substantial changes to the content ecosystem and supply chain, which would eventually make similar headsets more popular and affordable. But for now, his top goal is just to stay afloat after a challenging year. “2023 has been tough for the VR industry, which saw tech giants downsize their investment and manpower in these projects,” Shi said. “My priority for my team is to survive and ship products.” "
}