{
    "title": "Apple is debt-free, Steve Jobs says | Today in Apple history",
    "date": "2/18/2024",
    "url": "https://www.cultofmac.com/529397/apple-debt-free/",
    "text": "By Luke Dormehl • 8:47 am, February 18, 2024 February 18, 2004: Steve Jobs sends an internal memo to Apple employees revealing that the company is, for the first time in years, totally debt-free. “Today is a historic day of sorts for our company,” he writes. This marks a big turnaround from the bad old days of the 1990s, when Apple carried more than $1 billion in debt — and faced the danger of bankruptcy. Achieving debt-free status was, in some ways, a formality for Apple. By this time, the company had enough money in the bank to easily clear its remaining debt. By 2004, Apple had released the first iMac, the similarly colorful iBook laptop and the groundbreaking iPod music player. Cupertino also had launched the iTunes Store, which was on its way to transforming the music industry. Apple clearly had changed course and was headed in the right direction. Nonetheless, using $300 million in cash to pay off the last of its debt proved a symbolic triumph. Apple CFO Fred Anderson, on the verge of retirement, confirmed the news. Apple revealed its plans to pay off the debt, originally borrowed in 1994, in an SEC filing dated February 10, 2004: “The Company currently has debt outstanding in the form of $300 million of aggregate principal amount 6.5% unsecured notes that were originally issued in 1994. The notes, which pay interest semiannually, were sold at 99.925% of par, for an effective yield to maturity of 6.51%. The notes, along with approximately $1.5 million of unamortized deferred gains on closed interest rate swaps, are due in February of 2004 and therefore have been classified as current debt as of December 27, 2003. The Company currently anticipates utilizing its existing cash balances to settle these notes when due.” Jobs’ email to Apple employees also mentioned that the company had $4.8 billion in the bank in February 2004. These days, Apple maintains a much larger pile of cash reserves (although its finances are structured in such a way that the company also carries a large amount of debt). By 2004, Apple had been profitable for about six years. The change happened in early 1998, when Jobs shocked attendees at San Francisco’s Macworld Expo by revealing that Apple was once again making money. The company’s fortunes dipped and rose a few times before the big recovery started. But Cupertino was once again bound for the top of the tech world. The February 2004 payoff of Apple’s remaining debt hammered home that point.   Daily round-ups or a weekly refresher, straight from Cult of Mac to your inbox. Our daily roundup of Apple news, reviews and how-tos. Plus the best Apple tweets, fun polls and inspiring Steve Jobs bons mots. Our readers say: \"Love what you do\" -- Christi Cardenas. \"Absolutely love the content!\" -- Harshita Arora. \"Genuinely one of the highlights of my inbox\" -- Lee Barnett. The week's best Apple news, reviews and how-tos from Cult of Mac, every Saturday morning. Our readers say: \"Thank you guys for always posting cool stuff\" -- Vaughn Nevins. \"Very informative\" -- Kenly Xavier. "
}