{
    "title": "Big ticket clipping. Why I'm doubling down on Apple shares with $2300",
    "date": "2/10/2024",
    "url": "https://www.fool.com.au/2024/02/10/big-ticket-clipping-why-im-doubling-down-on-apple-shares-with-2300/",
    "text": " Access all of your premium services in our Member Centre Click here to learn more about our premium services TO MAKE THE WORLD\nSMARTER, HAPPIER, AND RICHER. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show, and premium investing services. Living in a headset might seem like a joke, but I bet no one ever thought we'd be as glued to our phones as we are now either. Image source: Getty Images You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More On Monday night, I submitted my order to buy more Apple Inc (NASDAQ: AAPL) shares, now the third-largest position in my portfolio. I know what you might be thinking… pouring more money into a company with a US$2.9 trillion market capitalisation, valued at nearly 30 times earnings, and expected sales decline of its core product (the iPhone) — he's lost the plot this time. Yet, there I was, in the late hours of the night, gleefully adding to my shares in the 48-year-old US tech giant. See, I think many onlookers are missing the forest for the trees amid Apple's newest addition to the product lineup: Apple Vision Pro. Frivolous and unduly expensive… terms that some might label the futuristic-looking augmented reality headset. Does it sound familiar? At US$3,500, the Vision Pro headset (pictured above) is certainly not a cheap piece of gear. However, the original iPhone was not either when it launched in 2007. Apple's first crack at a cell phone carried a price tag of US$499, or US$733 when adjusted for inflation, at a time when other phones valued between US$350 to US$400 were considered the top end. Plenty of naysayers dismissed the product, overlooking the value of its exceptional software and interface. The real 'aha' moment came when developers flocked to iOS. Quality touchscreen displays unlocked endless possibilities for entertainment and productivity applications, allowing customers to assign more value to the iPhone beyond 'just a phone'. I'd argue the same could be true of Vision Pro once developers exploit the immersive interface. Apple App Store developers generated US$1.1 trillion in billings and sales in 2022. Owning this enormous ecosystem, Apple collects fees of between 15% and 30% on its sales. This revenue stream forms part of the company's 'services' segment, which accounted for about 19% of net sales in Apple's last quarter. The services category is critical to why I bought more Apple shares. As more use cases are addressed by apps, Apple can clip the ticket at near-nil cost. With more of our everyday tasks and activities passing through a glass display, Apple's toll booth-style business has delivered solid growth. Now imagine a world where even more actions (both menial and masterful) are traversed through an Apple product. Interacting with 3D models Working with your files in Vision Pro is wild pic.twitter.com/6Wp26U7AVc Watching your favourite sport F1 + Apple Vision Pro 😳 pic.twitter.com/jW5b9j7Tn7 Learning an instrument Piano: Flowing Tiles for Apple Vision Pro!\"A spatial computing app that brings a dynamic, interactive dimension to your keyboard.\" pic.twitter.com/XZiS5Tv5nn Carrying out surgery With our SurgicalAR trace registration, surgeons can now visualize a 3D holographic rendering of a patient's anatomy mapped directly onto them in real-time. No more alternating views. No more cognitive gymnastics. Just an immersive, precise and confident approach to #neurosurgery pic.twitter.com/gMikonOMp9 So here's my elevator pitch on why I loaded up on Apple shares… Developers will find more innovative ways to utilise Apple's new platform over time. The hands-free, immersive experience lends the Vision Pro to high-value use cases. For this reason, Apple's digital toll booth could see an order of magnitude more money flow through it in the next decade. Meta Platforms Inc (NASDAQ: META) is the only serious competitor currently with its Meta Quest 3. As such, there's a real chance a duopoly could form, allowing both companies to realise incredible shareholder returns. Given Apple's track record of marrying hardware and software, I'm confident it will repeat its success in the headset domain. Apple shares now account for 7.9% of my portfolio after this week's investment. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Motley Fool contributor Mitchell Lawler has positions in Apple and Meta Platforms. The Motley Fool Australia's parent company Motley Fool Holdings Inc. has positions in and has recommended Apple and Meta Platforms. The Motley Fool Australia has recommended Apple and Meta Platforms. The Motley Fool has a disclosure policy. This article contains general investment advice only (under AFSL 400691). Authorised by Scott Phillips. March 29, 2024 |\n        Tristan Harrison I’m a believer in the long-term outlook of these stocks. Read more » March 28, 2024 |\n        Sebastian Bowen I would happily exchange dollars for these two shares right now. Read more » March 28, 2024 |\n        Bernd Struben I believe these ASX 200 shares will continue rewarding passive income investors for years to come. Read more » March 28, 2024 |\n        Tristan Harrison I decided to put this stock in my shopping basket over Woolies. Read more » March 28, 2024 |\n        Tony Yoo Reliable dividend shares are everywhere on the ASX. Here's how you could use that to your advantage. Read more » March 28, 2024 |\n        Tony Yoo The best performer on the index last year has had a poor start to 2024. Let's examine whether this is… Read more » March 28, 2024 |\n        Mitchell Lawler Just because a company's share price has gone up doesn't mean it's no longer good value. Read more » March 27, 2024 |\n        Sebastian Bowen I think these index funds are well worth a look right now. Read more » View All Sign Up for Take Stock\nInvestment news, stock ideas, and more, straight to your inbox. Get Started Investing\nYou can do it. Learn about investing with our Investing Education hub. Win at Retirement\nOur latest articles and strategies for the post-work life you want. Listen to Our Podcast\nHear our experts take on shares, the market & how to invest. Join Our Premium Community\nJoin our flagship membership service, Share Advisor. The Motley Fool stands behind our products and our membership-fee-back guarantee. If for any reason you are not 100% satisfied with your premium subscription, simply notify us within the first 30 days and you won't pay a cent. By taking up this offer, you will also be enrolled in our auto-renewal program, which is our way of making your ongoing subscription easier by ensuring uninterrupted service.  Don't worry, though – you're not locked in, and can cancel your auto-renewal at any time before each 'anniversary' date without question or penalty. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. The Motley Fool launched its Australian presence in 2011, and since then has grown to reach over 1 million Australians. Read more about us >  This Service provides only general, and not personalised financial advice, and has not taken your personal circumstances into account. The Motley Fool Australia operates under AFSL 400691. For more information please see our Financial Services Guide. Please remember that investments can go up and down. Past performance is not necessarily indicative of future returns. The Motley Fool Australia does not guarantee the performance of, or returns on any investment. We respectfully acknowledge the Traditional Custodians of the land where we live and work and pay our respects to all Elders, past and present, of all Aboriginal and Torres Strait Islander nations. © 2010 - 2023 The Motley Fool Australia Pty Ltd. All rights reserved. ACN: 146 988 052 Australian Financial Services Licence (AFSL): 400691 The Motley Fool Australia, PO Box 104, Isle of Capri, Qld 4217 Contact Details:\nPhone: (03) 8592 4841\nEmail: [email protected]\nOur friendly customer service team will happily get back to you as soon as they can. Notifications Scott Phillips just released his 5 best stocks to buy right now and you could grab the names of these stocks instantly! "
}