{
    "title": "Meta will make advertisers cover Apple's 30 percent fee on boosted Facebook \nand Instagram posts",
    "date": "2/15/2024",
    "url": "https://www.engadget.com/meta-will-make-advertisers-cover-apples-30-percent-fee-on-boosted-facebook-and-instagram-posts-160823453.html",
    "text": "Meta says it will start making businesses and influencers cover the cost of a 30 percent fee Apple is charging when they pay to promote their posts on the Facebook and Instagram iOS apps. In 2022, Apple updated its App Store policy to apply the 30 percent cut it takes from digital purchases to boosted posts, claiming that they were effectively in-app purchases. Meta is now passing that additional cost along to advertisers. Starting later this month in the US and in other markets later this year, Apple will take over billing of boosted posts through the apps. When the 30 percent fee becomes applicable, it will be more expensive for advertisers to pay for boosted posts on the Instagram and Facebook iOS apps. They can get around Apple's fee by going through the mobile web or desktop instead. Meta says its hands are tied, since it either has to play by Apple's rules or remove the boosted post feature from its iOS apps. \"We do not want to remove the ability to boost posts, as this would hurt small businesses by making the feature less discoverable and potentially deprive them of a valuable way to promote their business,\" the company wrote in a blog post. Those who don’t mind paying extra to promote posts via the iOS apps will need to go through a different payment process too. They’ll have to add prepaid funds to their account and pay for boosted posts in advance of publishing them instead of after the ads run. If advertisers add prepaid funds through the Facebook or Instagram iOS apps, they'll be subject to Apple's 30 percent service fee. Alternatively, they can add funds to their Meta account on desktop or the mobile web. That way, Meta says, they can use the funds to boost posts \"from any tool, including from the Instagram or Facebook iOS apps, without incurring fees.\" "
}