{
    "title": "Apple Event 'WWDC' on June 10: From Generative AI to iOS 18; Here's What to \nExpect",
    "date": "3/26/2024",
    "url": "https://www.etvbharat.com/en/!technology/apple-event-wwdc-on-june-10-from-generative-ai-to-ios-18-here-is-what-to-expect-enn24032701784",
    "text": "national ETV Bharat / technology By  ETV Bharat Tech Team Published : Mar 27, 2024, 11:29 AM IST Apple has announced the dates for WWDC 2024. The conference will be held from June 10 to June 14, 2024. The event is speculated to talk about generative artificial intelligence, and new versions of iOS, iPadOS, watchOS, and macOS.Hyderabad: Apple on Tuesday announced it will host its annual Worldwide Developers Conference (WWDC) online from June 10 to June 14, 2024, probably aiming at implementing generative artificial intelligence across its products.The iPhone maker, Apple informed that the conference will be free for all the developers. \"WWDC24 will spotlight the latest iOS, iPadOS, macOS, watchOS, tvOS, and visionOS advancements. As part of Apple’s ongoing commitment to helping developers elevate their apps and games, the event will also provide them with unique access to Apple experts, as well as insight into new tools, frameworks, and features,\" the company said in its press release.   It is highly expected that the event will majorly revolve around the inclusion of generative artificial intelligence in Apple products. The iPhone maker has been working on generative AI for quite some time. The company has hired for several generative AI roles and also acquired a startup, DarwinAI, recently to accelerate its growth in the area. However, there has been no official confirmation on this by the company. “We’re so excited to connect with developers from around the world for an extraordinary week of technology and community at WWDC24,” said Susan Prescott, Apple’s vice president of Worldwide Developer Relations. “WWDC is all about sharing new ideas and providing our amazing developers with innovative tools and resources to help them make something even more wonderful.”The company informed that the developers and students will be able to discover the latest Apple software and technologies by tuning into the keynote, and they can experience WWDC24 throughout the week on the Apple Developer app, Apple Developer website, and YouTube. The conference will include an in-person experience on June 10 that will provide developers the opportunity to watch the keynote at Apple Park, meet with Apple team members, and take part in special activities. Details on how to apply to attend can be found on the Apple Developer site and app, the company said.Read MoreApple Has Kept an Illegal Monopoly Over Smartphones in US, Justice Department Says in Antitrust SuitMore iPhone Hacking? Apple Making Big App Store Changes in Europe Over New RulesOne Tech Tip: Don't use rice for your device. Here's how to dry out your smartphone Apple has announced the dates for WWDC 2024. The conference will be held from June 10 to June 14, 2024. The event is speculated to talk about generative artificial intelligence, and new versions of iOS, iPadOS, watchOS, and macOS. Hyderabad: Apple on Tuesday announced it will host its annual Worldwide Developers Conference (WWDC) online from June 10 to June 14, 2024, probably aiming at implementing generative artificial intelligence across its products. The iPhone maker, Apple informed that the conference will be free for all the developers. \"WWDC24 will spotlight the latest iOS, iPadOS, macOS, watchOS, tvOS, and visionOS advancements. As part of Apple’s ongoing commitment to helping developers elevate their apps and games, the event will also provide them with unique access to Apple experts, as well as insight into new tools, frameworks, and features,\" the company said in its press release. It is highly expected that the event will majorly revolve around the inclusion of generative artificial intelligence in Apple products. The iPhone maker has been working on generative AI for quite some time. The company has hired for several generative AI roles and also acquired a startup, DarwinAI, recently to accelerate its growth in the area. However, there has been no official confirmation on this by the company. “We’re so excited to connect with developers from around the world for an extraordinary week of technology and community at WWDC24,” said Susan Prescott, Apple’s vice president of Worldwide Developer Relations. “WWDC is all about sharing new ideas and providing our amazing developers with innovative tools and resources to help them make something even more wonderful.” The company informed that the developers and students will be able to discover the latest Apple software and technologies by tuning into the keynote, and they can experience WWDC24 throughout the week on the Apple Developer app, Apple Developer website, and YouTube. The conference will include an in-person experience on June 10 that will provide developers the opportunity to watch the keynote at Apple Park, meet with Apple team members, and take part in special activities. Details on how to apply to attend can be found on the Apple Developer site and app, the company said. Read More Apple has announced the dates for WWDC 2024. The conference will be held from June 10 to June 14, 2024. The event is speculated to talk about generative artificial intelligence, and new versions of iOS, iPadOS, watchOS, and macOS.Hyderabad: Apple on Tuesday announced it will host its annual Worldwide Developers Conference (WWDC) online from June 10 to June 14, 2024, probably aiming at implementing generative artificial intelligence across its products.The iPhone maker, Apple informed that the conference will be free for all the developers. \"WWDC24 will spotlight the latest iOS, iPadOS, macOS, watchOS, tvOS, and visionOS advancements. As part of Apple’s ongoing commitment to helping developers elevate their apps and games, the event will also provide them with unique access to Apple experts, as well as insight into new tools, frameworks, and features,\" the company said in its press release.   It is highly expected that the event will majorly revolve around the inclusion of generative artificial intelligence in Apple products. The iPhone maker has been working on generative AI for quite some time. The company has hired for several generative AI roles and also acquired a startup, DarwinAI, recently to accelerate its growth in the area. However, there has been no official confirmation on this by the company. “We’re so excited to connect with developers from around the world for an extraordinary week of technology and community at WWDC24,” said Susan Prescott, Apple’s vice president of Worldwide Developer Relations. “WWDC is all about sharing new ideas and providing our amazing developers with innovative tools and resources to help them make something even more wonderful.”The company informed that the developers and students will be able to discover the latest Apple software and technologies by tuning into the keynote, and they can experience WWDC24 throughout the week on the Apple Developer app, Apple Developer website, and YouTube. The conference will include an in-person experience on June 10 that will provide developers the opportunity to watch the keynote at Apple Park, meet with Apple team members, and take part in special activities. Details on how to apply to attend can be found on the Apple Developer site and app, the company said.Read MoreApple Has Kept an Illegal Monopoly Over Smartphones in US, Justice Department Says in Antitrust SuitMore iPhone Hacking? Apple Making Big App Store Changes in Europe Over New RulesOne Tech Tip: Don't use rice for your device. Here's how to dry out your smartphone Apple has announced the dates for WWDC 2024. The conference will be held from June 10 to June 14, 2024. The event is speculated to talk about generative artificial intelligence, and new versions of iOS, iPadOS, watchOS, and macOS. Hyderabad: Apple on Tuesday announced it will host its annual Worldwide Developers Conference (WWDC) online from June 10 to June 14, 2024, probably aiming at implementing generative artificial intelligence across its products. The iPhone maker, Apple informed that the conference will be free for all the developers. \"WWDC24 will spotlight the latest iOS, iPadOS, macOS, watchOS, tvOS, and visionOS advancements. As part of Apple’s ongoing commitment to helping developers elevate their apps and games, the event will also provide them with unique access to Apple experts, as well as insight into new tools, frameworks, and features,\" the company said in its press release. It is highly expected that the event will majorly revolve around the inclusion of generative artificial intelligence in Apple products. The iPhone maker has been working on generative AI for quite some time. The company has hired for several generative AI roles and also acquired a startup, DarwinAI, recently to accelerate its growth in the area. However, there has been no official confirmation on this by the company. “We’re so excited to connect with developers from around the world for an extraordinary week of technology and community at WWDC24,” said Susan Prescott, Apple’s vice president of Worldwide Developer Relations. “WWDC is all about sharing new ideas and providing our amazing developers with innovative tools and resources to help them make something even more wonderful.” The company informed that the developers and students will be able to discover the latest Apple software and technologies by tuning into the keynote, and they can experience WWDC24 throughout the week on the Apple Developer app, Apple Developer website, and YouTube. The conference will include an in-person experience on June 10 that will provide developers the opportunity to watch the keynote at Apple Park, meet with Apple team members, and take part in special activities. Details on how to apply to attend can be found on the Apple Developer site and app, the company said. Read More TAGGED: Please write to us, for media partnership and Ad-sales inquiries. Email: adops@etvbharat.com Copyright © 2024 Ushodaya Enterprises Pvt. Ltd., All Rights Reserved. "
}