{
    "title": "Apple could double down on China market, Wedbush says, as iPhone sales drop",
    "date": "3/25/2024",
    "url": "https://www.cnbc.com/2024/03/26/apple-could-double-down-on-china-market-wedbush-says-as-iphone-sales-drop.html",
    "text": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  Apple could double down on the China smartphone market amid declining iPhone sales and stiff competition in the country, Wedbush Securities said on Monday. Apple needs to overcome its China challenges including a tough macro environment and competition from Huawei before the iPhone 16 release and \"it all starts with reaffirming Apple's presence in China,\" Wedbush said. China's Minister of Commerce Wang Wentao met Apple CEO Tim Cook on Friday and said his country holds opportunities for Apple as well as other companies, and asked the iPhone maker to keep building its business in China for \"shared development,\" according to a press statement. Cook said China was a crucial supply chain partner for Apple and the company plans to increase investment in the country in the long term, the statement said. Last week, Cook opened Apple's newest flagship store in Shanghai on Thursday and met with key suppliers in China, according to media reports. He also attended the China Development Forum in Beijing, as China seeks to woo foreign investors amid regulatory and global uncertainties. Cook's latest trip to China, which Wedbush said is \"a sign Apple could double down\" on China, comes amid reports of iPhone sales in China plunging 24% in the first six weeks of 2024. Apple is operating in a challenging environment in its largest overseas market, China, as it faces stiff competition from local Chinese smartphone makers, particularly Huawei, whose consumer business is experiencing a resurgence in the country after the launch of its Mate 60 smartphone. \"The timing of this trip was important as in essence Apple needs China and China needs Apple despite all the noise,\" Wedbush said. Covid-19 lockdowns in China in late 2022 majorly disrupted Apple's supply chain, which prompted the tech firm to diversify some of its production to countries such as India and Vietnam. \"However, the vast majority of its iPhone production and suppliers will remain in China,\" Wedbush said while maintaining its \"outperform\" rating and a $250 price target on Apple. Apple is currently facing regulatory challenges in the U.S. and EU and while its sales have dropped in China this year, the company last year emerged as the country's biggest smartphone supplier. The U.S. Department of Justice sued Apple on Thursday, alleging the tech firm illegally maintains a monopoly over smartphones. The EU on Monday opened an investigation into Apple in relation to the so-called anti-steering rules. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by "
}