{
    "title": "Banks call for crackdown on Apple over claims it stockpiles British \nspending data",
    "date": "3/3/2024",
    "url": "https://www.telegraph.co.uk/business/2024/03/03/banks-call-crackdown-apple-claims-stockpiles-uk-spend-data/",
    "text": "Calls for better policing of data come amid fears big tech is gaining an unfair advantage Major banks have called for a crackdown on Apple over claims the tech giant’s access to millions of iPhone users’ transactions will give it an unfair advantage as it pushes further into financial services. The Financial Conduct Authority (FCA)’s Practitioner Panel, consisting of bank and insurance executives, has written to the regulator saying there are “multiple imbalances” in how tech giants can gather and use consumer spending data. The letter, signed by Barclays’ UK chief executive Matt Hammerstein, specifically references Apple and Amazon, warning that there is a “pressing need” to address their access to data. It says that Apple, which allows customers to connect their bank accounts to their iPhone’s Wallet app, will account for the majority of activity in open banking – a system paid for by major banks – by the end of this year. It also raises concerns over Amazon and how its wealth of data on shopping habits could also give the company an advantage. “Consistent access to information across competitors is essential for fairness in the market,” the letter said. “The ability of big tech to access private and public retail data and combine it with AI and advanced analytics may create the conditions for market dominance. “While we have no doubt that big tech often does deliver good experiences and outcomes for their customers, they are under no obligation to do so, let alone demonstrate that, while big tech obtains these data privileges for free and have no obligations on how it is used.” The FCA is investigating whether big tech companies enjoy unfair access to customers’ data in a way that could make them dominant in the market. It expects to report on a “call for input” by the summer. Last year, Apple began allowing iPhone users to see their bank account transactions and balances through the Wallet app, taking advantage of the open banking protocol pushed through by regulators that allows bank accounts to be linked to other apps. It came after the company bought UK fintech start-up Credit Kudos for a reported $150m (£119m) in 2022. Open banking access requires authorisation by the FCA. The tech giant company has offered contactless payments through Apple Pay in Britain since 2015. In the US it has pushed heavily into financial services, offering a credit card, savings account and buy now, pay later services. It is unclear if the company plans to bring those to the UK but banks are believed to be concerned that its potential access to data could give it an advantage if it chose to do so. The Practitioner Panel’s letter suggests the FCA could bring tech companies’ payment systems under financial services regulation, or limit what data big tech companies could use when launching finance products. The panel is chaired by Mr Hammerstein and includes representatives from Lloyds, Nationwide, KPMG, Vanguard, Aquis Exchange, UBS, NatWest, Admiral, Rathbones and digital bank Chetwood. An FCA spokesman said: “Big tech firms have the potential to boost innovation in financial services but their unique access to large sets of data, such as retail or social media, could give them an advantage in the future if combined with financial data that firms already hold. “That’s why we launched a call for input to better understand how this data and access to advanced technology could affect consumers and businesses. “Meanwhile, we are setting standards for critical third parties, like cloud or AI services, so we can manage risks and protect the integrity of the market.” A Barclays spokesman said Mr Hammerstein had signed the letter in an independent capacity and that the letter represented the views of the panel. Apple said it does not use Apple Pay data to build profiles on users and that transaction information is stored on users’ devices, not the company’s servers. "
}